{"duration": 0.14260172843933105, "input_args": {"text": "'DALLAS  —   Mississippi State lists its starting point guard, Morgan William, as 5 feet 5 inches. It is a matter of generosity more than accuracy. “We need to ” Coach Vic Schaefer said amusedly, “because I’m pretty sure she ain’t the 5 on the second part of that. ” No matter. William, the shortest player on the court, made the biggest play of the national semifinals late Friday. Her   jump shot at the buzzer in overtime defeated Connecticut,   in an epic upset that halted the Huskies’   winning streak and ended their chance of a fifth consecutive N. C. A. A. championship. “I was in shock I’m still in shock,” William, who had 13 points and 6 assists, said half an hour after the game. “I’m over here like, dang, I just won the game. ” It was a startling moment of release for William in a career forged by the doubts of others, bereavement, injury, newfound assurance and a remarkably close bond with her coach. And it was a rousing moment of liberation for the N. C. A. A. in the 36th year that it has sponsored a women’s basketball tournament. UConn and Tennessee  —   with 19 national titles between them  —   have provided reliable and appreciated greatness. Their success has given women’s basketball groundbreaking visibility and legitimacy. And now the sport has another luminous moment that many observers felt it needed: not certainty but mystery. A surprise ending, a   revelation, a champion dethroned. A stunning instant that will be replayed for as long as games are won in a final astonishment. A woman hitting a late shot and her face blooming in jubilant disbelief and her teammates engulfing her in an ecstatic pile. “I think the fun of the men’s game is the parity, and the fun of the N. C. A. A. tournament is the upsets,” said Muffet McGraw, the longtime women’s coach at Notre Dame, which won the 2001 N. C. A. A. title and reached the final in four of the previous six seasons. “You hear about a lot of different teams on the men’s side you know about a lot of different players,” McGraw said. Referring to UConn, she added, “I think it gets boring for some people to watch and say, ‘Eh, they’re going to win.’ You want to see a great game. When the Yankees dominated, when the Celtics dominated, they still lost games. ” But with the Huskies, she said, “Nobody comes close. ” Well, hardly ever. UConn had not lost a game since Nov. 17, 2014. No team had seriously threatened this season since the Huskies escaped the opener in November by 2 points at Florida State. But there was something personal about Mississippi State’s determination on Friday after it had lost to the Huskies by 60 points  —   60 points  —   in the 2016 tournament. “I feel like we earned respect,” William said. “People didn’t believe in us, but it didn’t faze us. ” On Sunday, in the national title game, Mississippi State ( ) will face a familiar opponent: South Carolina ( ) a fellow member of the Southeastern Conference. One university will win its first national title, bringing hope to other aspirants and confirmation that women’s basketball has been steadily and broadly improving in UConn’s shadow, even if it was not always apparent to a general audience. “It breathes a little life into women’s basketball, knowing that it’s not the same old, same old, same old UConn,” said Dawn Staley, the South Carolina coach. “It’s been a beautiful thing to watch, but it’s great to know somebody else is going to win the national championship, and it’s not like you just tear the Velcro off and stick UConn back up. ” By early Saturday afternoon, the shock of Friday for William had been replaced by preparation for Sunday’s championship game. “I’m just trying to stay levelheaded,” she said. “We still have business to take care of. I can’t get the big head just yet. We beat UConn, but we haven’t got the ring or cut down the nets, nothing like that. ” For William, 20, a junior from Birmingham, Ala. her awakening during this tournament has been a validation of her skill and a rebuke to the countless people who told her she was too short to play major college basketball. After averaging 9. 6 points for her career, William scored 41 in a regional final a week ago against Baylor. And then she dribbled three times to the right of the lane just before overtime expired on Friday and hit a   jumper, sending Mississippi State’s players and fans into delirium. In that moment, William did what every child who ever played basketball in the driveway or shot at a hoop nailed to a barn has dreamed of and rehearsed  —   counting the time down, hitting the winning shot and hearing the crowd erupt with the sound of something decisive and astounding. “Sometimes all it takes is one kid to go into a completely different zone, and they can carry a team through an entire tournament,” UConn Coach Geno Auriemma said. “It happens. That kid averaged 9 points a game during the season. This isn’t the regular season. She doesn’t have to do it for the next five months. ” Just for one more night. “That’s a whole different dynamic,” he said. Auriemma met William at a Final Four banquet on Wednesday night and said he told her: “That’s what the N. C. A. A. tournament’s all about, for kids to throw themselves into the national spotlight. It’s the chance of a lifetime, and you’re taking advantage of it. ” But her career has not followed the same smooth arc as her winning shot on Friday. When William was a senior in high school in Birmingham in 2014, her stepfather, Donnie Rory, died of a heart attack. He had played football at Samford University in Alabama and had encouraged his stepdaughter to play basketball. She could play in the S. E. C. he told her, and could be the best point guard in the conference. “Every time I play basketball, I think about him,” William said. “He put the ball in my hand when I was 3, and I ran from there. ” At Mississippi State, she found the understanding of Schaefer, who had lost both his parents. William rooms with Schaefer’s daughter, Blair, a reserve guard on the team, and often eats dinner at the Schaefer household. “Because of what she’s been through, I try to provide that stability whenever necessary, because she’s away from home,” Vic Schaefer said. “I love all my kids. But there’s always a special place in my heart for any young person who has had to go through dealing with losing a parent. ” Last season, as a sophomore, William played with what she called a stress fracture in her right tibia. Schaefer called it a “crack. ” William wore a protective covering over her leg, but she admitted to playing timidly in the   loss to UConn. “I didn’t cry because we played so bad,” she said. After the season, the injury did not heal. So William underwent surgery, and a rod was inserted into her leg. “I’m back to myself,” she said. This season, she has played more aggressively and confidently. On Friday, when Mississippi State called a timeout to set up its final play with the score tied at 64, Schaefer told William, “Mo, you’re about to win the game. ” She did, and on the UConn bench, Auriemma flashed a droll smile. “It was almost like, ‘Of course, of course it’s going to go in,’” Auriemma said. “She’s had an amazing run so far. ” Afterward, William said that Auriemma told her, “You deserve everything that’s coming your way. ” She took it to mean one thing: “Go win it all. ”'"}, "time": 1742561815.0699143}