{"duration": 0.0935828685760498, "input_args": {"text": "' NYT Admits Key Al Qaeda Role in Aleppo\\nIn a backhand way, The New York Times admits that the U.S.-backed \\x93moderate\\x94 rebels in east Aleppo are fighting alongside Al Qaeda jihadists, an almost casual admission of this long-obscured reality.\\nBy Robert Parry\\nNovember 08, 2016 \" Information Clearing House \" - \" Consortium News \" - As much as The New York Times and the mainstream U.S. media have become propaganda outlets on most foreign policy issues, like the one-sided coverage of the bloody Syrian war, sometimes the truth seeps through in on-the-ground reporting by correspondents, even ones who usually are pushing the \\x93propo.\\x94\\nSuch was the case with Anne Barnard\\x92s new reporting from inside west Aleppo, the major portion of the city which is in government hands and copes with regular terror rocket and mortar attacks from rebel-held east Aleppo where Al Qaeda militants and U.S.-armed-and-funded \\x93moderate\\x94 rebels fight side-by-side.\\nAlmost in passing, Barnard\\x92s article on Sunday acknowledged the rarely admitted reality of the Al Qaeda/\\x94moderate\\x94 rebel collaboration, which puts the United States into a de facto alliance with Al Qaeda terrorists and their jihadist allies, fighting under banners such as Nusra Front (recently renamed Syria Conquest Front) and Ahrar al-Sham.\\nBarnard also finally puts the blame for preventing civilians in east Aleppo from escaping the fighting on a rebel policy of keeping them in harm\\x92s way rather than letting them transit through \\x93humanitarian corridors\\x94 to safety. Some of her earlier pro-rebel accounts suggested that it wasn\\x92t clear who was stopping movement of civilians through those corridors.\\nHowever, on Sunday, she reported: \\x93We had arrived at a critical moment, as Russia said there was only one day left to pass through a corridor it had provided for people to escape eastern Aleppo before the rebel side was flattened, a corridor through which precious few had passed. The government says rebels are preventing civilians from leaving. Rebels refuse any evacuation without international supervision and a broader deal to deliver humanitarian aid.\\x94\\nGranted, you still have to read between the lines, but at least there is the acknowledgement that rebels are refusing civilian evacuations under the current conditions. How that is different from Islamic State terrorists in Mosul, Iraq, preventing departures from their areas \\x96 a practice which the Times and other U.S. outlets condemn as using women and children as \\x93human shields\\x94 \\x96 isn\\x92t addressed. But Barnard\\x92s crimped admission is at least a start.\\nBarnard then writes: \\x93Instead [of allowing civilians to move through the humanitarian corridors], they [the rebels] are trying to break the siege, with Qaeda-linked groups and those backed by the United States working together \\x97 the opposite of what Russia has demanded.\\x94\\nAgain, that isn\\x92t the clearest description of the situation, which is stunning enough that one might have expected it in the lede rather than buried deep inside the story, but it is significant that the Times is recognizing that Al Qaeda and the U.S.-backed \\x93moderates\\x94 are \\x93working together\\x94 and that Russia opposes that collaboration.\\nShe also noted that \\x93Three Qaeda-linked suicide bombers attacked a military position with explosive-packed personnel carriers on Thursday, military officials said, and mortar fire was raining on neighborhoods that until now had been relatively safe. It was among the most intense rounds in four years of rebel shelling that officials say has killed 11,000 civilians.\\x94\\nWhile she then throws in a caveat about the impossibility of verifying the numbers, the acknowledgement that the U.S.-backed \\x93moderate\\x94 rebels and their Al Qaeda comrades have been shelling civilians in west Aleppo is significant, too. Before this, all the American people heard was the other side, from rebel-held east Aleppo, about the human suffering there, often conveyed by \\x93activists\\x94 with video cameras who have depicted the conflict as simply the willful killing of children by the evil Syrian government and the even more evil Russians.\\nMore Balance\\nWith the admission of rebel terror attacks on civilians in west Aleppo, the picture finally is put into more balance. The Al Qaeda and U.S.-backed rebels have been killing thousands of civilians in government-controlled areas and the Syrian military and its Russian allies have struck back only to be condemned for committing \\x93war crimes.\\x94\\nThough the human toll in both sides of Aleppo is tragic, we have seen comparable situations before \\x96 in which the U.S. government has supported, supplied and encouraged governments to mount fierce offensives to silence rockets or mortars fired by rebels toward civilian areas.\\nFor instance, senior U.S. government officials, including President Barack Obama and Democratic presidential nominee Hillary Clinton, have defended Israel\\x92s right to defend itself from rockets fired from inside Gaza even though those missiles rarely kill anyone. Yet, Israel is allowed to bomb the near-defenseless people of Gaza at will, killing thousands including the four little boys blown apart in July 2014 while playing on a beach during the last round of what the Israelis call \\x93mowing the grass.\\x94\\nIn the context of those deaths, U.S. Ambassador to the United Nations Samantha Power, who has built her career as a supposed humanitarian advocating a \\x93responsibility to protect\\x94 civilians, laid the blame not on the Israeli military but on fighters in Gaza who had fired rockets that rarely hit anything besides sand.\\nAt the United Nations on July 18, 2014, Power said , \\x93 President Obama spoke with [Israeli] Prime Minister Netanyahu this morning to reaffirm the United States\\x92 strong support for Israel\\x92s right to defend itself . Hamas\\x92 attacks are unacceptable and would be unacceptable to any member state of the United Nations. Israel has the right to defend its citizens and prevent these attacks.\\x94\\nBut that universal right apparently does not extend to Syria where U.S.-supplied rockets are fired into civilian neighborhoods of west Aleppo. In that case, Power and other U.S. officials apply an entirely different set of standards. Any Syrian or Russian destruction of east Aleppo with the goal of suppressing that rocket fire becomes a \\x93war crime.\\x94\\nPerhaps it\\x92s expected that the U.S. government, like other governments, will engage in hypocrisy regarding affairs of state: one set of rules for U.S. allies and another for countries marked for U.S. \\x93regime change.\\x94 Statements by supposed \\x93humanitarians\\x94 \\x96 such as Samantha Power, \\x93Ms. R2P\\x94 \\x96 are no exception.\\nBut double standards are even more distasteful when they come from allegedly \\x93objective\\x94 journalists such as those who work at The New York Times, The Washington Post and other prestige American news outlets. When they take the \\x93U.S. side\\x94 in a dispute and become crude propagandists, they encourage the kind of misguided \\x93group thinks\\x94 that led to the criminal Iraq War and other disastrous \\x93regime change\\x94 projects over the past two decades.\\nYet, that is what we normally see. A thoughtful reader can\\x92t peruse the international reporting of the U.S. mainstream media without realizing that it is corrupted by propaganda from both government officials and from U.S.-funded operations, often disguised as \\x93human rights activists\\x94 or \\x93citizen journalists\\x94 whose supposed independence makes their \\x93propo\\x94 even more effective.\\nSo, it\\x92s worth noting those rare occasions when The New York Times and the rest of the MSM let some of the reality peek through. When evaluating the latest plans from Hillary Clinton and other interventionists to expand the U.S. military intervention in Syria \\x96 via prettily named \\x93safe zones\\x94 and \\x93no-fly zones\\x94 \\x96 the American people should realize that they are being asked to come to the aid of Al Qaeda.\\n[For more on this topic, see Consortiumnews.com\\x92s \\x93 The De Facto US/Al Qaeda Alliance. \\x94]\\nInvestigative reporter Robert Parry broke many of the Iran-Contra stories for The Associated Press and Newsweek in the 1980s. You can buy his latest book, America\\x92s Stolen Narrative, either in print here or as an e-book (from Amazon and barnesandnoble.com ).'"}, "time": 1742628430.092424}