{"duration": 0.15425729751586914, "input_args": {"text": "'WASHINGTON  —   Every day, in F. B. I. offices around the country, agents leaf through classified counterterrorism documents on American citizens one last time. They reread informant reports and review surveillance logs. And then they close the case and walk away. It is a weighty decision, one that supervisors closely review. But with up to 10, 000 F. B. I. terrorism investigations open at any given time, there is little time for  . The nightclub shooting in Orlando, Fla. in which a gunman killed 49 people, has brought unusual attention to a seemingly mundane process. For 10 months, F. B. I. agents investigated the gunman, Omar Mateen, but closed the investigation after following a standard checklist. F. B. I. supervisors approved the decision. Managers in Washington, who can reverse any decision to close a case, were notified. Officials said there was nothing particularly remarkable about the decision  —   until Sunday’s predawn shooting. On Tuesday, the F. B. I. was scrutinizing Mr. Mateen’s computer use, trying to learn how much his wife knew before the attack. Attorney General Loretta Lynch pledged a thorough investigation that would also address “if there are lessons we can learn to prevent another tragedy. ” But perhaps the biggest question raised by this episode  —   as it was after the Boston Marathon bombing in 2013 and the shooting in Garland, Tex. last year  —   is why the perpetrator’s behavior was alarming enough to attract the F. B. I. ’s attention, but could not be stopped. The answer is in part a reflection of American vigilance in the era of “see something, say something. ” Tens of thousands of counterterrorism tips flow to the F. B. I. each year. Some are legitimate. Others come from vengeful   or people casting suspicion on  . Thousands of investigations are opened and closed. Right now, law enforcement officials say, the F. B. I. is investigating 1, 000 potential “homegrown violent extremists,” the majority of whom are most likely tied to or inspired by the Islamic State. Fifty to 100 are considered the highest priority. The flood of leads is so relentless that, years ago, counterterrorism agents hung an   section of fire hose outside their office suite in Northern Virginia as a symbol of their mission. Intelligence agencies in Europe and the Middle East face similar challenges, particularly with the rise of the Islamic State. But in the United States, Americans enjoy the unique protections of the First and Second Amendments. Criticizing, or even hating, the American government is not a crime. Neither is declaring support for the Islamic State or buying a gun. The number of agents working on terrorism cases is classified and changes with the threat, but across the country it amounts to several thousand, along with countless analysts. Sorting out angry Americans talking tough from   terrorists is among their biggest challenges. In Mr. Mateen’s case,   said in 2013 that he had boasted of ties to the terrorist groups Hezbollah and Al Qaeda. The remarks prompted the local sheriff to request his removal from the St. Lucie County Courthouse in Fort Pierce, Fla. where he worked as a security guard. The security contractor transferred him to work at a residential golfing community, and the sheriff alerted the F. B. I. Government officials said his claim had been dubious from the beginning. Hezbollah is a Shiite group Al Qaeda is Sunni. But agents opened what is known as a preliminary investigation. They secretly followed him and monitored his movements. They interviewed him twice, and dispatched an informant to get close to him in an investigation that spanned nearly a year. “I think the F. B. I. has an incredibly hard job, because this guy seems like a lone wolf,” said Caroline Fredrickson, the president of the American Constitution Society, a frequent critic of the agency. “He was an American citizen born in the United States. Law enforcement has been working its butt off to figure out what else could be done. ” This dilemma is not new, but it has become more acute in recent years. For years after the 2001 attacks on the World Trade Center and the Pentagon, the F. B. I. used Al Qaeda’s rigid hierarchy against the terrorist group. Government experts knew how plots were hatched and who approved them. They knew the terrorism pedigree of the key figures, and monitored travel to watch for people training in camps. Today, the Islamic State encourages anyone to take up arms in its name. Travel and training are unnecessary. Veteran counterterrorism agents ruefully note that the difference between America’s latest school shooting and its latest terrorist attack is whether the gunman praised the Islamic State  —   regardless of whether he had any actual ties to the group. Preventing those attacks is a fundamentally different mission, said James W. McJunkin, a former senior F. B. I. official who oversaw terrorism cases for years during Al Qaeda’s heyday. “It’s the counterterrorism equivalent of ‘How do you prevent someone from robbing a liquor store? ’” he said. After receiving a briefing Tuesday from investigators, Representative Adam B. Schiff, Democrat of California, said Mr. Mateen appeared to have been motivated by a mixture of violent radicalization and hatred for gays and lesbians. “The picture is filling in, though there are still a lot of unanswered questions,” he said. Among those questions is whether Mr. Mateen’s wife knew about his plans. His wife, Noor Zahi Salman, told the F. B. I. that she had driven him to the Pulse nightclub at some point before the attack and that she had been with him when he bought ammunition, a senior law enforcement official said. She said she had tried to talk him out of waging an attack, the official said. Her statements were first reported by NBC News. “There’s an indication that she was with him in certain parts of the process, and we’re sorting through it,” said the official, who spoke on the condition of anonymity because the investigation is at an early stage. “We don’t know what’s true and what’s not. ” Ms. Salman is not in custody, the official said. While a person who withholds knowledge of a crime could face criminal charges, she is not facing imminent arrest, and no decisions have been made on whether she might be prosecuted, the official said. Neighbors of Ms. Salman’s parents in Rodeo, Calif, who are of Palestinian descent, said she had grown up in a Muslim household. She and her sisters were not allowed to drive, they said. They said they understood Mr. Mateen to be a controlling husband who frequently forbade his wife to visit her family. As the F. B. I. pieces together details of Mr. Mateen’s life, lawmakers and lobbyists are already questioning whether the authorities missed any leads. Senator Charles E. Grassley, Republican of Iowa and chairman of the Judiciary Committee, sent a letter to Obama administration officials demanding information about Mr. Mateen, his family and the dates he was on a terrorism watch list. James B. Comey, the F. B. I. director, has said Mr. Mateen was on a watch list during his investigation. Once it was closed, he was removed from the list, as is required. “We don’t keep people under investigation indefinitely,” he said. Even if Mr. Mateen had remained on the watch list, it would not have stopped him from buying a gun. Congress blocked an attempt last year to give the F. B. I. the power to block gun sales to people on terrorism watch lists. Had he been on a watch list, however, agents would have been alerted to the gun sale. “Certainly in retrospect in this case we would have liked to have known about it,” Deputy Attorney General Sally Q. Yates said. She said the Justice Department would consider a new policy in which the F. B. I. is alerted on gun sales to people who were previously under investigation for terrorism. The National Rifle Association moved quickly to quash discussion of new gun policies. In a piece for USA Today, Chris W. Cox, the group’s executive director, blamed the federal authorities for not doing more to stop Mr. Mateen. “His former   reported violent and racist comments,” Mr. Cox wrote. “Unfortunately, the Obama administration’s political correctness prevented anything from being done about it. ”'"}, "time": 1742562792.8228312}