{"duration": 0.06979179382324219, "input_args": {"text": "'WikiLeaks founder Julian Assange recently discussed the topic of “fake news” and how WikiLeaks’ pure   approach has prevented them from becoming “weaponized text. ”[CNET reports that Assange appeared via   in a discussion with Australian comedian Chas Licciardello in Sydney, Australia this week. During the interview, Assange discussed the idea of “fake news” and how WikiLeaks’ refusal to editorialize their content and rather provide pure data to the public has allowed them to publish facts without bias.  “What is special about WikiLeaks is that it’s not just another damn story,” said Assange, “it’s not just another damn journalist putting their damn byline, advertising themselves and their position on another damn story. ” “You’re not reading   knowledge,” Assange said in discussing WikiLeaks vast database of information. “When you read a newspaper article, you are reading weaponised text that is designed to affect a person just like you  …     I think that is the real beauty of WikiLeaks  …     it is that sea of information, that treasure, that intellectual treasure, that rebel library of Alexandria you can go into. ” Surprisingly, Assange said that he was quite happy to see the narrative of “fake news” being pushed by the media, claiming so far WikiLeaks has a 100% correct record when it comes to verifiable information. “When the narrative of fake news came out and was then taken off effectively by the   press and pushed around  …     I could see exactly where that was going. I was rather happy about it,” Assange said. “WikiLeaks is very happy that there is a narrative about fake news out there because we have a perfect record of having never got it wrong in terms of authentications. ” “The real value in WikiLeaks is it is a wonderful library that you can trust  …     But the library has to be marketed. And so the   business, which we’re also in  —   I view that as a kind of marketing effort for what is much more substantial, which is our archive,” he continued. “We try and maximize the value of the information to readers. So that’s publishing it at the moment when they most want to read it, when they most want to know what it contains. And that’s definitely before an election rather than after election. ” When asked about the accuracy of the released emails of Clinton campaign chairman John Podesta, Assange said, “We had lots of critics in the Democratic Party, liars in the Democratic Party  …     saying that what we published was not accurate  —   trying to imitate it, sometimes saying it directly. And of course we could mathematically prove that they were liars. And it’s not every day that you can mathematically prove that your critics are full of it. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742561911.1148083}