{"duration": 0.05739450454711914, "input_args": {"text": "'Fresh from a tour of   ‘  zones’ across Europe, Breitbart London    Raheem Kassam has slammed the media establishment for playing down the phenomenon, telling them to “get your head out of your rears! ”[ Speaking at the prestigious Conservative Political Action Conference (CPAC) he explained: “I was there, in these   zones, and I came back and we were talking about Sweden, and Donald Trump is talking about Sweden. ”  He was referring to a speech by the president, in which he spoke of “problems” in the Nordic nation caused by mass uncontrolled immigration. It was widely mocked by many in the media, who claimed everything was fine there. President Trump hit back at the claims today at the same conference, remarking the violence in Sweden as well as other European nations confirmed his remarks.  “And I was in Paris too, and I was in Brussels in [the municipalities of] Molenbeek too, and you guys at the back [the mainstream media] you just don’t get it!” blasted Mr. Kassam. “You don’t go there, you don’t see what’s going on! Get your heads out of your rears!” “I was in these   zones, actually, and if you want to hear more about that  …     I’ve got a book coming out on it” he revealed. Mr. Kassam, who is just    and has edited Breitbart London since its inception in February 2014, also told the crowd about his own background.  “I was born in West London into a Muslim family. And I am now proud to say that I am a conservative I am a proud Englishman and, I am a robust Americaphile” he said to cheers. Finally, he moved on to introducing “Mr. Brexit” former UKIP leader Nigel Farage, describing him as a “father figure” and comparing him favourably to president Donald J. Trump. “But I’m here to introduce a man, today, who really changed my life in a very significant way who changed my country in a very significant way and I would argue, changed the world in a very significant way. “You know last year we had Brexit!” Mr. Kassam declared, to more rapturous cheers, “and Brexit was spearheaded by a man who loves his country, who wants an end to uncontrolled, mass migration  …     who wants us to be a proud sovereign nation again. “I used to work for that man. He is a member of the European Parliament. He worked tirelessly, travelled up and down the country sometimes speaking to rooms of three or four people at the beginning of his career, just to have his message heard. “Twenty years ago this movement started. “He’s been a mentor to me. He’s been a friend to so many of us. And he’s also been, really, a father figure to so many of us. He has survived cancer. He has survived a car crash. He has survived a plane crash. He has survived the BBC, CNN, the establishment [and] the European Parliament!” Watch Raheem Kassam at CPAC: '"}, "time": 1742562330.8627777}