{"duration": 0.0831148624420166, "input_args": {"text": "'President Trump’s administration is ending U. S. funding of the United Nations Population Fund  —   an agency that human rights activists have linked to the support of population control programs such as China’s coercive abortion “  policy. ”[The halt to the funding of the United Nations Population Fund  —   known as UNFPA  —   comes as Trump is scheduled this week to host Chinese President Xi Jinping at the president’s    resort in Florida.  In January, Trump signed an executive order that reinstated the “Mexico City Policy,” which concerns U. S. aid for abortions overseas. The president updated the policy by directing Secretary of State Rex Tillerson to implement a plan that expands the policy across all global health assistance funding. The directive means that U. S. taxpayer dollars will no longer be supporting organizations that promote or participate in the management of a coercive abortion program, such as that espoused by China. A report by the Associated Press states that as a result of the end of U. S. funding of UNFPA, $32. 5 million will shift to the U. S. Agency for International Development (USAID) which has the goal of reducing maternal deaths and practices such as genital mutilation. As Breitbart News reported in December 2015, Rep. Chris Smith ( )   of the Congressional Executive Committee on China, observed during a hearing, “The Chinese government is not the only one culpable in these heinous crimes against women and children. The UN Population Fund helped fund birth restrictions, fund forced abortions, and a massive and coercive family planning bureaucracy. ” “The UNFPA whitewashed China’s crimes for decades and continues to do so today,” the congressman continued, adding that on its website UNFPA “justifies its history in China, saying it was ‘tasked by the Executive Committee’ to help China and had to ‘engage with China as a sovereign nation. ’” More than a year ago, China announced that it had switched to a “  policy,” one that Smith said only continues the country’s longstanding attempts to control family life: The “  policy” may possibly become a “  policy” but China’s police state population control policies will not end anytime soon. The Chinese government retains the power to tell couples what their families must look like and the power to punish those who disobey birth quotas. For the past 35 years the Chinese government has wasted precious human potential and sanctioned   violence against women and children —  enabled by   groups globally and the United Nations Population Fund. No one should applaud China’s announced “ ” policy instead we should be insisting they abolish intrusive and abusive birth restrictions forever. Trump’s reinstatement of the Mexico City Policy was criticized in February by Bill and Melinda Gates, whose foundation has as its focus the support of family planning across the globe.  The Gates Foundation is also criticizing Trump’s foreign aid cuts: Foreign aid and access to contraceptives can be smart investments in a more stable and prosperous future. https:  .   —   Gates Foundation (@gatesfoundation) April 3, 2017,  “We’re concerned that this shift could impact millions of women and girls around the world,” Melinda Gates told the Guardian. “It’s likely to have a negative effect on a broad range of health programs that provide lifesaving treatment and prevention options to those most in need”: In Indonesia, I saw more proof that when we invest in contraceptives, we invest in a more stable  prosperous future https:  .   —   Melinda Gates (@melindagates) April 2, 2017, '"}, "time": 1742628367.308588}