{"duration": 0.048165082931518555, "input_args": {"text": "'Freitag, 4. November 2016 Übrige Wrestler überlegen, wann sie Tim Wiese endlich sagen sollen, dass alles abgesprochen ist München (dpo) - Früher oder später wird Tim Wiese die Wahrheit erfahren müssen. Doch noch rätseln seine Wrestler-Kollegen, wann sie den Ex-Nationaltorwart am besten wissen lassen sollen, dass sein Sieg bei seinem Debüt als Profi-Wrestler in der Münchner Olympiahalle von vornherein abgesprochen war . \"Tim hat sich so ins Zeug gelegt für seinen ersten Kampf, da will ich echt nicht der sein, der ihm jetzt erklären muss, dass unsere Gegner absichtlich verloren haben und alle außer ihm vorher Bescheid wussten\", erklärt WWE-Superstar Cesaro, der gemeinsam mit Wiese (\"The Machine\") und Profi-Wrestler Sheamus gegen das Duo The Shining Stars und Bo Dallas antrat. Zaghafte Versuche, Tim Wiese darüber aufzuklären, dass beim Wrestling alles abgesprochen ist, seien in der Vergangenheit fehlgeschlagen. Cesaro: \"Ich habe Tim letztens erst gefragt, ob ihm klar ist, dass das alles Show ist.\" Daraufhin habe Wiese genickt und geantwortet: \"Jaja, geile Show. Ich muss jetzt noch trainieren, damit ich nicht verliere.\" Dann sei Wiese im Fitnessstudio verschwunden. Cesaro und seine Kollegen hätten schließlich der Einfachheit halber beschlossen, den kompletten ersten Kampf um Tim Wiese herum zu choreografieren, damit er weiter seinen Traum leben kann. Auf Dauer sei das aber zu gefährlich. \"Auch wenn es nicht schwierig ist, so zu tun, als wären seine plumpen Angriffe gefährlich: Irgendwann trifft er doch mal einen von uns wirklich. Deshalb müssen wir bald Tacheles mit ihm reden\", so Cesaro. \"Aber eine schöne Aufgabe ist das natürlich nicht – gerade jetzt, wo er so froh ist, eine Sportart gefunden zu haben, in der er der Größte ist.\" Damit Tim Wiese diesmal auch wirklich zuhört, wollen seine Wrestling-Kollegen \"The Machine\" beim nächsten Kampf innerhalb der ersten zehn Sekunden überwältigen, ihn auf dem Boden fixieren und ihm dann in aller Ruhe darlegen, wie Wrestling tatsächlich funktioniert. ssi, dan; Foto oben: dpa Artikel teilen:'"}, "time": 1742564541.6383622}