{"duration": 0.10927748680114746, "input_args": {"text": "'Posted on November 6, 2016 by Eric Zuesse. Eric Zuesse The leading financiers of the Republican Party, the Koch brothers, were exposed on November 4th by the great investigative journalist Lee Fang, as being solid supporters and heavy financiers of congressional candidates who have been leaders in expanding the U.S. military budget and moving America toward a police state (including militarization of the police). The leading financier of the Democratic Party, George Soros, has long been known to provide major financial backing for the most-neoconservative Democratic candidates, such as Hillary Clinton, who favor every possible military invasion and coup (and see this , for more on that). In fact, Soros was one of the top three financial backers (the other two were the U.S. government and the Netherlands government) for the television station in Ukraine that championed extermination of the people in Ukraine’s Donbass region, where the coup-imposed government, which he helped to install, is loathed . And also on the Ukrainian matter, the Kochs have championed the view that when considering whether Crimea should be part of Russia, or else part of Ukraine, or else entirely independent, the people who live there shouldn’t have any opportunity to vote on the matter, and they should instead be forced to be ‘Ukrainians’ , even if they loathe this post-coup Ukrainian governmen t. Soros and the Kochs insist that this Ukrainian government should be imposed upon Crimeans, regardless of what they want. In fact, Soros has proposed adding from 20 to 50 billion taxpayer dollars to the effort by the coup-imposed Ukrainian government’s military, in order for that government to achieve this conquest of Crimea (to restore it to Ukraine, to which it had been forcibly joined, by the Soviet dictator Khrushchev in 1954, after having been for hundreds of years a part of Russia — and to which Obama and the Kochs and Soros insist it belongs). Regarding the U.S. Presidential contest, the difference between the Kochs and Soros is that the Kochs in 2016 directed all of their political financing away from the Presidential contest altogether, so as to weaken Trump’s effort to beat Hillary, whereas Soros has devoted tens of millions of dollars to the financing of Hillary’s campaign and of PACS (such as this) that support Hillary against Trump. Hillary is supported by Kochs and the big oil-and-gas firms as well as by Soros and Wall Street. Virtually all of the U.S. aristocracy want Hillary Clinton to become President. Right after the nominating conventions, the Kochs withdrew their financial backing of the Republican ‘hawk’ U.S. Senatorial candidate Ron Johnson in Wisconsin because Johnson had just endorsed Trump . But afterwards, the Kochs — as Lee Fang noted — spent big on the campaigns of Ron Johnson and of other pro-Lockheed-Martin (etc.) Senators. To be pro ‘Defense’ industry, isn’t to be pro-U.S. defense, but instead to be pro-mega-corporate investors, and that’s something America’s entire aristocracy are, because they control all of the large U.S.-based corporations. Those corporations expand by the U.S. military having the might to enforce in foreign countries what their owners want — so that America’s State Department and USAID etc. can serve as spokespersons for, essentially, the billionaires who own controlling blocs of stock in U.S.-based international corporations. That’s “the system,” which Hillary Clinton and the Kochs and Soros and all the rest of the U.S. aristocracy support, and which Bernie Sanders opposed without understanding it. If Donald Trump understands it, he’s been keeping that fact secret from his followers, who generally understand nothing of it at all. Maybe if he were to try to explain it to them he’d be called ‘unpatriotic’ — even though his trying to explain it to them would actually be the deepest form of patriotism. Unfortunately, for him to be patriotic in that way would probably be politically suicidal for his campaign. He instead points to “foreigners” as being America’s enemies, when the real enemies are actually right at home in America — and they’re enemies of the entire world, not just their own country. These are the people at the top of the global food-chain. It’s not clear whether Trump feels mainly that he’s one of them, or instead that they’re his chief enemies. How much more ambiguous could a person be than that? And is the ambiguity intentional? The most reliable answer might be found by identifying whom his actual political enemies are — and they seem to be virtually all of the global aristocracy. Maybe they know him in ways that the U.S. public don’t and can’t. The public will just have to guess. But no guesses are necessary in order to understand Hillary Clinton. She has a lengthy record in public office, and it’s entirely consistent, as a neoconservative .'"}, "time": 1742561694.8740807}