{"duration": 0.11217999458312988, "input_args": {"text": "'NEWARK  —   Almost as soon as Chris Christie was sworn in as governor of New Jersey in 2010, his administration began an elaborate courtship of Mayor Mark Sokolich of Fort Lee. There were private tours of ground zero for the mayor and his cousins, free tickets to the governor’s box at Giants football games, a ceremonial flag from the World Trade Center site, and money for firefighting equipment and shuttle buses in Fort Lee. The governor went to Fort Lee to tape a national television talk show at the town’s high school invited the mayor to his Christmas cocktail party and had him over for an intimate lunch in the private dining room at the governor’s mansion, which Mr. Sokolich called “a   item for a   mayor. ” The wooing continued into 2013, when Mr. Christie was up for   and hoping that a broad victory would propel him to the front of the pack of contenders for the 2016 Republican nomination for president. He was gathering endorsements from Democratic mayors like Mr. Sokolich. The mayor said he could not go that far. It would take a few months, and what federal prosecutors in a courtroom here called an extraordinary act of political retribution, before Mr. Sokolich would begin to suspect that, as he recalled on Tuesday, “someone must be mad at me. ” “There was absolutely no plausible explanation” for what happened, the mayor said. As the first day of school dawned in September 2013, two access lanes to the George Washington Bridge were closed, locking Fort Lee in what Mr. Sokolich would call “concrete gridlock. ” And his onetime friends in the Christie administration would not return his calls, texts or emails. Mr. Sokolich took the stand in United States District Court here on Tuesday to tell the story at the center of the prosecution’s case: that Christie administration officials deliberately closed two of three access lanes to create a traffic jam in Fort Lee, all to punish the mayor for refusing to endorse Mr. Christie. It was the first day of testimony in the trial of the two Christie administration officials: Bridget Anne Kelly, a former deputy chief of staff to Mr. Christie, who ran the office responsible for collecting endorsements and Bill Baroni, the former deputy executive director of the Port Authority of New York and New Jersey, which prosecutors say became an arm of Mr. Christie’s   campaign. Mr. Sokolich’s recollection of gifts and favors underscored just how assiduously Christie administration officials used the levers of power to secure endorsements. And while the broad outlines of the lane closings  —   a scandal that ultimately sank Mr. Christie’s presidential ambitions  —   are well known, testimony from the mayor and his police chief offered dramatic details about the chaos in Fort Lee, and the futile efforts of the officials to get relief. “I was begging for someone to help,” Mr. Sokolich said. On the first morning of the lane closings, the police chief, Keith M. Bendul, had just pulled into a Department of Public Works facility to refuel his Ford Expedition when he received an anxious radio transmission from a traffic officer. He was standing near the access lanes to the bridge, and traffic was at a standstill. “I immediately knew it was not going to be good,” the chief recalled on Tuesday. The Port Authority, the bistate agency that operates the bridge, typically informs the Fort Lee Police Department well in advance of any traffic pattern changes, but this time, Mr. Bendul said, there had been no notice. Confused, he began calling his contacts there. “I reached out to everybody I could think of,” he said. Eventually, Mr. Bendul connected with Robert Durando, the general manager of the George Washington Bridge for the agency. Mr. Durando asked the police chief to talk with him, but not in his Port Authority office. Instead, he wanted to meet in a municipal parking lot next door. “I thought it was very weird,” Mr. Bendul said. “I thought it was cloak and dagger. It just struck me as very, very odd. ” Without bothering to change from his golf shirt and jeans, he drove with a deputy into oncoming traffic on the wrong side of the street, sirens blaring. “I was hot,” he said of his demeanor going into the meeting. “Public safety was being compromised. ” Mr. Durando claimed that the lane closings were part of a traffic study, Mr. Bendul recalled. “I told him it was a miserable failure. End it, stop it,” he said, adding that the gridlock was contributing to series of crises: a missing    a patient in cardiac arrest, a car accident and numerous complaints of road rage, among other problems. “I told him bluntly that if anybody dies, I’m going to tell those people to sue him and everybody at the Port Authority,” said Mr. Bendul, who described Mr. Durando as “very nervous. ” Mr. Durando told Mr. Bendul that Mr. Sokolich should contact Mr. Baroni. Before their meeting ended, though, Mr. Bendul recalled one last comment from Mr. Durando. “He told me if anybody asked if this meeting occurred, he would deny it,” Mr. Bendul testified. Mr. Sokolich called Mr. Baroni, whom he considered a friend by then he had a photo of the two of them on his office credenza. But his call went unanswered. The next day, upon seeing “a repeat performance” of the previous day’s gridlock, Mr. Sokolich began beseeching Mr. Baroni with an increasingly urgent set of messages. “I’ve got to talk to somebody about this new policy at the bridge it’s truly shutting down Fort Lee,” he said in a voice mail message early that morning, which was played for the jury on Tuesday. “We’re in total gridlock. I’m just trying to figure out who’s mad at me. ” His pleas still unheeded, Mr. Sokolich later texted: “Help please. It’s maddening. ” “The town is ready to revolt,” he implored in another voice mail, before asking once more: “Who’s mad at me?”'"}, "time": 1742562754.8055735}