{"duration": 0.12714815139770508, "input_args": {"text": "'\\nThe 2016 Presidential election about to get even crazier.\\nEarlier this week Joe Joseph reported that recent Wikileaks point to the Clinton family having ties to a child porn abduction ring in Haiti. On top of that, emails appear to confirm that both Bill and Hillary Clinton previously joined convicted pedophile Jeffrey Epstein at his “sex slave island,” with Fox News having confirmed that Former President Bill Clinton flew with Epstein on his private jet at least 20 times. As Fox News notes, the plane was outfitted with a bed where travellers would often engage in group sex.\\nThe evidence of criminal activity identified via Anthony Wiener’s laptop is so damning that the NYPD was preparing arrest warrants for a number of Clinton campaign officials. A Brietbart report indicates that the investigation was stifled earlier this week by the Justice Department after “huge pushback.”\\nAnd while the Obama administration and liberal mainstream news sources are doing everything in their power to keep the thousands of Wikileak revelations at bay, according to a developing story from the Gatway Pundit , it will be impossible for them to contain the fallout from what comes next.\\nAs early as this weekend we could see the most explosive email, video and photographic evidence yet. According to members of the hacking collective Anonymous, 4Chan, and Hillary State Department target Kim Dotcom, a government insider has provided undeniable evidence that Bill Clinton and six other government officials engaged in sexual acts with minors.\\nKim Dotcom, apparently privvy to the evidence, posted a series of Tweets this as highlighted by The Daily Sheeple :\\nThere’s unpublished material, yet to come out. Clinton is in serious trouble.\\n— Kim Dotcom (@KimDotcom) November 1, 2016 \\n\\nWith the last one coming Friday evening:\\nThe end is near @HillaryClinton \\n— Kim Dotcom (@KimDotcom) November 5, 2016 \\n\\nIt appears Dotcom’s Tweet was in reference to a 4Chan post archived at The Free Republic which indcates in no uncertain terms that a government official has the evidence that confirms Bill Clinton is indeed a sexual predator:\\n\\nUntil this month, Wikileaks and Anonymous have worked together in building an efficient, detailed, comprehensive set of documents that would be responsible for the incarceration of Hillary Clinton, Bill Clinton, and 21 individuals ranging from the DNC, FBI, CIA, and Clinton foundation. These documents will show without a doubt, evidence of Treason, Obstruction of Justice, Election Fraud, Manipulation and Bribery. \\nThis was intended to be the October surprise. But before the release of these documents, we were contacted by a member of the FBI, as well as another from the CIA, and a week later by the NYPD . All with information retaining to something much darker than we ever imagined.\\nDue to the nature of these leaks, we all worked together as efficiently as possible to ensure two objectives:\\n1.) That all necessary information would be given to the public in an organized, searchable, manageable way.\\n2.) Those who provided us with this information would be able to find safety before these releases were made ( This concern wasn’t without warrant).\\n…\\nThe new leaks being released this week will provide documents in the form of emails, pictures, and videos. Within these will be evidence of Bill Clinton, as we as at least 6 other Government officials, taking part in sexual acts with minors. As well as evidence of Human trafficking that also include minors. \\nWe believe these pictures and videos were taken for the purpose of political manipulation. In order to make sure all participants followed through on a previously agreed agenda. \\nThese documents were given to us by an American Government official when he had come to learn that this crime had been covered by Hillary and her staff through methods including bribery and blackmail. He also told us that due to the restricted access to these documents, they would soon know he was the one who released them to us.\\nWe tried to make arrangements for him to exit the country safely, but he was killed before those arrangements could be carried out. We are still not sure if this is because they became aware of the leak, or if they were scared that he may in the future. In either case, his identity will be made public in this next set of leaks so that he can be honored for the hero that he was.\\nWe will not only be releasing these documents, but we have multiple members of the FBI, CIA, and NYPD who will be publicly verifying their authenticity once their safety is assured. \\nThis hack has not come from Russia or anyone else they may try to blame this on. This is a leak from Americas own Government Officials who fear for their safety had the opposed them directly due to reasons that will be made clear soon.\\nWe thank you for your patience, as well as your determination and assistance in helping us expose the corruption that has infested our own government. Democracy will be restored to America.\\nRemember remember the 5th of November. \\nIf true, then sometime this weekend we will see the end of the Clintons. While they can cover up tens of thousands of email chains and be protected from prosecution by the Justice Department for bribery or pay-for-play, no one will stand in the way if actual sex tapes come to light, especially if minors are involved.\\nPerhaps this is why FBI Director Comey operated with such haste in recent weeks and publicly re-opened the Clinton investigation, because no one will want to be a friend to Bill or Hillary after this hits the internet.\\nRelated: \\n5 States Hillary Is Set to Steal from Trump \\nNot Just Assange… Hillary Wants to Drone Strike “All Dissidents and Whistleblowers” \\nInternet Mogul Kim Dotcom: More Leaks Coming, “Clinton Is in Serious Trouble \\n '"}, "time": 1742561826.3705802}