{"duration": 0.08312416076660156, "input_args": {"text": "'Yahoo News PORTLAND, Ore. (AP) — A jury delivered an extraordinary blow to the government Thursday in a long-running battle over the use of public lands when it acquitted all seven defendants involved in the armed occupation of a national wildlife refuge in rural southeastern Oregon. Tumult erupted in the courtroom after the verdicts were read when an attorney for group leader Ammon Bundy demanded his client be immediately released, repeatedly yelling at the judge. U.S. marshals tackled attorney Marcus Mumford to the ground, used a stun gun on him several times and arrested him. U.S. District Judge Anna Brown said she could not release Bundy because he still faces charges in Nevada stemming from an armed standoff at his father Cliven Bundy’s ranch two years ago. The Portland jury acquitted Bundy, his brother Ryan Bundy and five others of conspiring to impede federal workers from their jobs at the Malheur National Wildlife Refuge, 300 miles southeast of Portland. Even attorneys for the defendants were surprised by the acquittals. “It’s stunning. It’s a stunning victory for the defense,” said Robert Salisbury, attorney for defendant Jeff Banta. “I’m speechless.” Said defendant Neil Wampler: “This is a tremendous victory for rural America and it is a well-deserved, overwhelming defeat for a corrupt and predatory federal government.” The U.S Attorney in Oregon, Billy J. Williams, issued a statement defending the decision to bring charges against the seven defendants: “We strongly believe that this case needed to be brought before a Court, publicly tried, and decided by a jury. A Bundy daughter, Bailey Logue, said family members were savoring the victory, and would begin Friday to determine their next step. “First thing, we’re going to get down on our knees and thank our Heavenly Father, and we’re going to enjoy our families,” Logue said. “Tomorrow, we’re going to figure out what we’re going to do next.” Messages left for Bundy family matriarch Carol Bundy in Bunkerville, Nevada, weren’t immediately returned. The Oregon case is a continuation of the tense standoff with federal officials at Cliven Bundy’s ranch in 2014. Cliven, Ammon and Ryan Bundy are among those who are to go on trial in Nevada early next year for that standoff. While the charges in Oregon accused defendants of preventing federal workers from getting to their workplace, the case in Nevada revolves around allegations of a more direct threat: An armed standoff involving dozens of Bundy backers pointing weapons including assault-style rifles at federal Bureau of Land Management agents and contract cowboys rounding up cattle near the Bundy ranch outside Bunkerville. Daniel Hill, attorney for Ammon Bundy in the Nevada case, said he believed the acquittal in Oregon bodes well for his client and the other defendants facing felony weapon, conspiracy and other charges. “When the jury here hears the whole story, I expect the same result,” Hill told The Associated Press in Las Vegas. Hill also said he’ll seek his client’s release from federal custody pending trial in Nevada. Ammon Bundy and his followers took over the Oregon bird sanctuary on Jan. 2. They objected to prison sentences handed down to Dwight and Steven Hammond, two local ranchers convicted of setting fires. They demanded the government free the father and son and relinquish control of public lands to local officials. The Bundys and other key figures were arrested in a Jan. 26 traffic stop outside the refuge that ended with police fatally shooting Robert “LaVoy” Finicum, an occupation spokesman. Most occupiers left after his death, but four holdouts remained until Feb. 11, when they surrendered following a lengthy negotiation. Federal prosecutors took two weeks to present their case, finishing with a display of more than 30 guns seized after the standoff. An FBI agent testified that 16,636 live rounds and nearly 1,700 spent casings were found. During trial, Bundy testified that the plan was to take ownership of the refuge by occupying it for a period of time and then turn it over to local officials to use as they saw fit. Bundy also testified that the occupiers carried guns because they would have been arrested immediately otherwise and to protect themselves against possible government attack. The bird sanctuary takeover drew sympathizers from around the West. It also drew a few protesters who were upset that the armed occupation was preventing others from using the land. They included Kieran Suckling, executive director of the Center for Biological Diversity. Suckling on Thursday called the acquittals “extremely disturbing” for “anyone who cares about America’s public lands, the rights of native people and their heritage, and a political system that refuses to be bullied by violence and racism. “The Bundy clan and their followers peddle a dangerous brand of radicalism aimed at taking over lands owned by all of us. I worry this verdict only emboldens the kind of intimidation and right-wing violence that underpins their movement,” Suckling said. One of Ammon Bundy’s attorneys, Morgan Philpot, had a different perspective after watching Mumford get tackled by marshals. “His liberty was just assaulted by the very government that was supposed to protect it, by the very government that just prosecuted his client — unjustly as the jury found.” There’s another Oregon trial coming up over the wildlife refuge. Authorities had charged 26 occupiers with conspiracy. Eleven pleaded guilty, and another had the charge dropped. Seven defendants chose not to be tried at this time. Their trial is scheduled to begin Feb. 14.'"}, "time": 1742562192.5027926}