{"duration": 0.1357872486114502, "input_args": {"text": "'Over the past three weeks, Hillary Clinton’s chances to win the presidency have fallen. Her lead over Donald J. Trump has shrunk to between one and four percentage points nationwide, depending on which polls you count, and which candidates are included. Here’s one way to think about the race: Three weeks ago, a Clinton loss was about as likely as a missed     attempt in the N. F. L. Today, circumstances have moved that kick 10 yards farther from the goal line. (And here’s something for those of you yelling, “Not another sports analogy!” Mr. Trump’s chances of winning are roughly equal to the chance of drawing two consecutive cards of the same suit.) Another way to think about it: In terms of the candidates’ chances, we’re in about the same place we were before the conventions. Clinton supporters should be about as concerned as they were two months ago, before the parties gathered. Trump supporters should be roughly as hopeful as they were then. In The Upshot’s model, Mrs. Clinton’s chances to win the presidency stand at 75 percent. Mr. Trump, in just three weeks, has more than doubled his likelihood of becoming president. But his odds remain below those of Mrs. Clinton. Of course, The Upshot is not the only organization with a forecasting model. In addition to   models from Daily Kos, FiveThirtyEight and the Princeton Election Consortium, there is the PredictWise model, which uses information from betting markets. Each model takes a somewhat different view of how the race has evolved over the past six weeks, as seen in the charts below. Broadly speaking, each model moved toward Mrs. Clinton after the Democratic convention at the end of July, then stayed on a plateau for several weeks before drifting back toward Mr. Trump. But there are differences. The PredictWise numbers, for example, tend to be more certain about the outcome in both directions  —   giving Mrs. Clinton zero chance of picking off a conventionally red state like Texas, Alaska or South Carolina, and giving Mr. Trump zero chance of shuffling the electoral map and capturing a small blue state like Rhode Island or Maine. The extent to which the lines move together shows how correlated the states are to one another. In some models, like FiveThirtyEight’s, the states are very correlated in others, like the Princeton Election Consortium, they are much less so. The Upshot’s model lies somewhere between. In general, states move in lock step from one presidential election to the next. The overall picture may change, but the states typically hold their positions relative to one another and swing together uniformly. Election cycles in which this does not happen tend to be aberrations  —   1976, for example  —   or can signal an electoral realignment. We’ve been in a remarkable period of electoral stability compared with previous eras. The eight least volatile elections since 1920 in terms of state shifts include the seven most recent. In the 2012 election, only one state fell more than 10 points from its expectation, after controlling for home state effects: West Virginia, which voted 20 points more Republican than the nation in 2008, and then 30 points more in 2012. While there are differences on the state level between the various models, the differences now  —   as with two months ago  —   are more about how the states will move together, and what that means for the distribution of possible outcomes. The Daily Kos model foresees a more narrow range of plausible outcomes. The FiveThirtyEight model is centered in about the same place as our model is, but is shorter and flatter than ours, leading to a slightly lower chance of victory for Mrs. Clinton. As I did at the beginning of this article, election analysts often fall back on the metaphor of sports odds: for example, saying something is analogous to a team leading by 14 points at the start of the second half or comparing a candidate’s odds with making a field goal from a certain distance. It’s a convenient way to get people to think probabilistically, which is not an easy thing to do. Trying to grasp what 75 percent really means out of context is hard. But the football metaphor shouldn’t be extended too far. The difference between probability in sports and probability in an election is one of measurement. In a football game, all of the parameters are known. You can know that the home team is up by 7 points with 5 minutes 41 seconds to go, with a    on the   line. Ignoring factors like team strength and weather, this tells you everything you need to know to make a simple forecast about who is going to win. Elections aren’t like that. We can’t get a perfect representation of people’s voting intentions, so we have to rely on polling. And polling is a messy business. There is often a lot of noise, and little signal. This was doubly so for the period before and during the conventions. When we said in a previous article that The Upshot’s model is stubborn to move by design, we mean that it’s somewhat inured to noise. The situation with a political campaign is more like a football game in which you know how much time is left, but don’t know the score  —   you have to infer it based on how the home team’s fans are cheering. Now that the conventions are over and we’re past Labor Day, the polls speak louder  —   they contain more information  —   so it’s easier to get the model’s attention.'"}, "time": 1742563966.207719}