{"duration": 0.06528019905090332, "input_args": {"text": "'There has been a   and a rally, an allegation of “fake news,” a petition that garnered thousands of signatures and a chorus of outcry from elected officials. What is causing so much outrage? Townsend Harris High School, a   school in Queens, is getting a new principal. For several months, students, teachers and parents have made a forceful and public case against the school’s interim acting principal, Rosemarie Jahoda, who has held the position since the beginning of the school year. They have criticized her management style and interactions with students, and called for her to be replaced. In the past week, the conflict has only intensified. On Tuesday, the Queens borough president, Melinda Katz, sent a letter to the New York City schools chancellor, Carmen Fariña, calling for changes in the     process, which she described as “entirely shrouded under a veil of silence and secrecy. ” This was her third letter to Ms. Fariña on the hiring process and its impact on Townsend Harris. When a principal position is open, the superintendent selects three to five candidates from the applicant pool and sends them to members of the school leadership team, which is made up of parents, school staff members and the chapter leader of the teachers’ union. A committee from the leadership team interviews applicants and makes recommendations to the superintendent. The superintendent then consults with the leadership team, but does not have to choose the candidate it favored. This is all done in private, and members of the leadership team are required to sign a confidentiality agreement. “You can’t have true community input without allowing the community input to be public,” Ms. Katz said in an interview. Students working on the school newspaper, The Classic, filed a Freedom of Information Act request this week asking for the names of the 38 people who had applied to be their principal, according to Brian Sweeney, an English teacher and the school newspaper adviser. Although being appointed interim acting principal does not officially confer an advantage in getting the job permanently, some people familiar with the workings of the system believe that it does. Other public officials have also criticized the process and expressed concerns about Ms. Jahoda. Nily Rozic and David Weprin, two Democratic members of the New York State Assembly, said in a letter last week to the schools chancellor that they were “disappointed by the lack of community input during the selection process and the lack of engagement by your office. ” Their letter also raised concerns about a comment by an Education Department official that “fake news” about the situation at Townsend Harris was being widely circulated. The official, Fran DeSanctis, a representative for the high school superintendent’s office, made the comment at a district leadership meeting last week, the letter said. The Townsend Harris newspaper has aggressively covered the tensions at the school and Ms. Jahoda. Students on the school paper were outraged by the “fake news” comment, saying their own reporting accounted for much of the news being written on the subject. They published a public letter of their own online.’ ”“PolitiFact defines fake news as ’  stuff, masterfully manipulated to look like credible journalistic reports,’” the letter said. “Fake news is not poorly sourced journalism: It is wholly fictitious. Ms. DeSanctis is therefore not accusing us of being wrong she is accusing us of purposefully making up lies and reporting them as news. If we were fabricating our material, we would be able to leave school far earlier than we do. ”” ’Through the Education Department, Ms. DeSanctis declined to comment. Ms. Jahoda, who declined to be interviewed, said in a statement, “It’s always been my focus as a teacher and administrator to serve students, and it continues to be my focus at Townsend Harris. ” “While there have been many inaccurate allegations,” she said, “I want to move forward and serve all the students and families at Townsend. ” Ms. Katz, the borough president, said she was perplexed by how the conflict had spun so far out of control. “Whatever they’re doing right now, it’s not working,” she said of the Education Department. “No matter who they pick permanently, right now they’ve let it go astray. No one is answering the question of the kids and teachers and parents and alumni. ” Will Mantell, a spokesman for the department, said, “We value hearing from students, elected officials and school communities, and continue to listen to their feedback. ”'"}, "time": 1742562186.3847966}