{"duration": 0.07162809371948242, "input_args": {"text": "'BANGKOK  —   North Korea said Tuesday that it was barring all Malaysians from leaving the country until there was a “fair settlement” of a dispute over the assassination in Kuala Lumpur of Kim   the half brother of North Korea’s leader. Malaysia responded in kind, with Prime Minister Najib Razak instructing the police to prevent all North Koreans from leaving Malaysia until he was assured of the safety of Malaysians in North Korea. The developments were a drastic escalation in the diplomatic dispute over Mr. Kim’s killing. The Malaysian police have said that several North Koreans are suspects. “This abhorrent act, effectively holding our citizens hostage, is in total disregard of all international law and diplomatic norms,” Mr. Najib said of North Korea’s action. Mr. Najib convened an emergency meeting of the National Security Council in the evening. In its statement on Tuesday, North Korea said it would “temporarily ban the exit of Malaysian citizens” until the safety of North Korean diplomats and citizens in Malaysia is “fully guaranteed through the fair settlement of the case that occurred in Malaysia,” the   Korean Central News Agency reported. It was unclear what resolution to the Kim case North Korea was seeking. But it has rejected the findings of the Malaysian police that Mr. Kim was poisoned by VX nerve agent at the Malaysian capital’s international airport on Feb. 13, and it has demanded that his body be handed over to the North Korean Embassy. The Malaysian police want to question several North Koreans in the case, including a diplomat. Malaysian officials said there were 11 Malaysians in the North who could be affected by the North Korean ban, including embassy staff members, their family and two workers for the United Nations. After the security council meeting, Mr. Najib posted on his Twitter account: “I know that the family and friends of our fellow Malaysians detained in North Korea are anxiously anticipating news of their loved ones. ” He added in a second posting: “You can rest assured that we are doing our very best to secure their safe return. ” About 1, 000 North Koreans are believed to live and work in Malaysia until Monday, they had been allowed to enter the country without a visa. “As a   nation, Malaysia is committed to maintaining friendly relations with all countries,” Mr. Najib said on Tuesday. “However, protecting our citizens is my first priority, and we will not hesitate to take all measures necessary when they are threatened. ” Mr. Kim, the elder half brother of the North Korean leader, Kim   was killed when two women rubbed poison on his face at Kuala Lumpur International Airport, the Malaysian police said. The women, one from Vietnam and one from Indonesia, have been arrested and charged with murder. The Malaysian police, who conducted an autopsy of Mr. Kim’s body over North Korea’s objections, concluded that he had been poisoned by VX nerve agent, a banned chemical weapon known to be in North Korea’s arsenal. North Korea has suggested that he died of heart failure and accused Malaysia of working with other countries to defame North Korea. “Once it denied responsibility for the assassination, North Korea had no option but to push back in a    escalation,” Kim   a professor of North Korean studies at Dongguk University in Seoul, South Korea, said on Tuesday. “Offense is the best defense for the North. ” Preventing the Malaysians from leaving North Korea would also give the government continuing leverage over Malaysia. If the Malaysians had been free to leave, Malaysia could have broken off diplomatic relations without any significant political cost. That would have led to the closing of the North Korean Embassy, with at least one suspect who has taken refuge there no longer safe from arrest. The suspect, Kim   an employee of the   North Korean airline, Air Koryo, could be arrested if the embassy were closed. A second suspect who the police say may be hiding at the embassy, Ri   also known as James, would also be subject to arrest. A third suspect, Hyon   a second secretary at the embassy, has diplomatic immunity and could not be arrested. “If we break diplomatic ties, then all the embassy staff have to leave Malaysia, but the staff with diplomatic immunity at the time of the offense is still safe and must be allowed to leave,” said Sivananthan Nithyanantham, a Malaysian lawyer who has served as counsel at the International Criminal Court in The Hague. “The airline worker then loses his sanctuary and will be liable to arrest. ” The police are seeking seven North Korean men in connection with Mr. Kim’s killing. The other four are believed to have returned to North Korea. Khalid Abu Bakar, Malaysia’s top police official, confirmed at a news conference on Tuesday that at least two suspects had taken refuge at the North Korean Embassy and that North Korea had refused a request to hand them over. “The North Korean authorities are not cooperating with us in this investigation,” he said. He said the police would wait as long as necessary to arrest Mr. Kim, the airline employee, and Mr. Ri, if he is there. “If it takes five years, we will wait outside,” he said. “Definitely somebody will come out. ” North Korea has denied responsibility for the killing and has not acknowledged that the victim was Kim  . Lim Kit Siang, a leader of Malaysia’s opposition Democratic Action Party, called on Parliament to adopt an emergency motion condemning what he called North Korea’s “hostage terrorism” and urging the North Koreans to let the Malaysians leave. North Korea’s statement on Tuesday described the exit ban as temporary. But the North Korean government has been accused of playing hostage politics before, partly to complicate negotiations over its nuclear arms and missile development. In 2014, North Korea said it would reopen an investigation into Japanese citizens it was accused of abducting during the Cold War, but it halted that inquiry last year in retaliation for sanctions imposed by Japan over a rocket launch. Duyeon Kim, a   nonresident fellow at Georgetown University’s Institute for the Study of Diplomacy, said on Tuesday that North Korea was “playing dirty and not diplomatically, apparently hoping this might force Malaysia to reverse its findings” about Mr. Kim’s killing. Malaysia, however, showed every intention of pressing ahead with its contention that VX nerve agent had been used in the Kim assassination. On Tuesday, the Malaysians presented their formal report about their findings to the executive council of the Organization for the Prohibition of Chemical Weapons, the group based in The Hague that monitors compliance with the Chemical Weapons Convention, which Malaysia has signed. In a statement to the executive council, Malaysia noted that it did not “produce, stockpile, import, export or use” VX or any other such chemical weapon. “Malaysia strongly condemns the use of such a chemical by anyone, anywhere and under any circumstances,” the statement said. “Its use at a public place could have endangered the general public. ” North Korea, which has not signed the Chemical Weapons Convention, is believed to have a large stockpile of VX despite its denials. Tuesday’s developments follow the    expulsion of ambassadors between the two countries. Kang Chol, North Korea’s ambassador to Malaysia, was expelled on Monday over what Malaysia considered to be insulting comments. North Korea responded by formally expelling Malaysia’s ambassador, Mohamad Nizan Mohamad, though he had already been recalled to Malaysia for consultations.'"}, "time": 1742628377.9099402}