{"duration": 0.03155207633972168, "input_args": {"text": "\"Madeleine Albright Gets in Costume in Time for Halloween \\nLook who's pretending they're a humanitarian Originally appeared at The Libertarian Institute \\nLast week, The Washington Post reported that the Beltway’s foreign policy elite is salivating at the prospect of a more hawkish Hillary Clinton administration. \\nApparently, the Obama administration’s reluctance to intervene directly in Syria is driving the liberal interventionalists and the neocons crazy. The out-of-power imperialists of the left and right, though, have been biding their time and doing what they do best: writing reports that only the foreign policy elite read inside the imperial city. Absurdly, or maybe the better word is frighteningly, the foreign policy elite’s reports and studies “call for more-aggressive American action to constrain Iran, rein in the chaos in the Middle East and check Russia in Europe.” The idea that Washington could bring order to the chaos it helped create in the greater Middle East is lunacy. \\nCome November 9, the nation better start preparing itself for more of the same with the almost guaranteed ascension of President Clinton the Second: perpetual, wealth-sapping, rights-eviscerating war. \\nBut what was particularly striking about the article was the appearance of former Secretary of State and U.S. Ambassador to the United Nations Madeleine Albright discussing the need for more muscular American intervention in Syria. \\n“The immediate thing is to do something to alleviate the horrors that are being visited on the population,” said former secretary of state Madeleine Albright, who is leading a bipartisan and international team looking at U.S. strategy in the Middle East for the Atlantic Council. \\n“We do think there needs to be more American action — not ground forces but some additional help in terms of the military aspect.” \\nJust in time for Halloween, Secretary Albright wants to dress up like a humanitarian. But fortunately we know that Secretary Albright believes that the lives of innocent children are okay to sacrifice in the pursuit of a U.S-led international order.* Back in 1996, Albright showed what’s truly under that humanitarian costume during an interview with 60 Minutes on the toll of U.N. Security Council sanctions on Iraq: \\nLesley Stahl on sanctions against Iraq: We have heard that a half million children have died. I mean, that’s more children than died in Hiroshima. And, you know, is the price worth it? \\nMadeleine Albright: I think this is a very hard choice, but the price–we think the price is worth it. \\nThese are the kinds of people ready to assume the commanding heights of the U.S. national security apparatus soon after Inauguration Day. They make the hard choices you don’t want to make, and the price is worth it. \\n* NOTE: For a good analysis of exactly how many Iraqi children under five years old died because of U.N. Security Council sanctions on Iraq, see Matt Welch’s Reason piece from 2002, “ The Politics of Dead Children .” Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742628454.6367412}