{"duration": 0.07382631301879883, "input_args": {"text": "'The last time we saw John Oliver on “Last Week Tonight,” the weekly comedy series he hosts for HBO, he was blowing up a giant 2016 sign in a soccer stadium, bidding farewell to a year that seemed unmatchable in its capacity for tumult and   news events. Then 2017 came along. As Mr. Oliver prepares for the   premiere of “Last Week Tonight” on Sunday, he returns to an arena where President Trump, the bête noire of the   shows, has been in charge of the country for nearly a month. During that time, the Trump administration has already made the picture more complicated for many issues that Mr. Oliver has addressed in his   segments, like net neutrality, voter fraud, torture and nuclear weapons. Now, who wants to hear some jokes? In an interview on Monday at HBO’s New York offices, Mr. Oliver, 39, said that despite some clear challenges to his way of looking at the world, he did not believe his past work had been in vain. “I’m not a complete nihilist,” he said with a laugh. “I haven’t quite got to the point where I’m going, ‘What’s the point in anything? Burn it down. ’” Though he was mum on the subject of Sunday’s episode, Mr. Oliver said “Last Week Tonight” would continue to resist the impulse to go “all Trump, all the time,” and instead try to focus on subjects not addressed by his   peers. “It’s a lot of people feeding on the same carcass,” he said. “We try to pick a different carcass because of how many different beaks have already gotten to it. ” The   Mr. Oliver did talk about how his   perspective and   experiences have informed his takes on the presidential election, the Brexit vote and Mr. Trump’s travel ban why you’d have to be a “sociopath” to think   comedy programs helped Mr. Trump win and the relationship between his show and what he considers real journalism. These are edited excerpts from that conversation. How did you spend your election night? I just watched it at home, but it was the same muscle memory as the Brexit vote, as those early returns came in  —   I think I know what’s going to happen here. You’ve been living in the United States for about a decade. Do news events in Britain still have a visceral impact on you? I hadn’t left much of a career behind in England  —   I pretty quickly had flipped the switch in my head. This is my home. But Brexit was awful because it reminded me of a certain blatant ugliness in the country that I was raised in. I’d just had a baby, so I liked the idea that he’d have a British passport as well  —   which is a European passport, meaning he can live and work anywhere in Europe. From that vote, you realize his horizons have been contracted dramatically, and that becomes a physical manifestation of what is true for a lot of people. I’m very happy that he doesn’t understand anything that’s happened in the last year. You’re a   holder and the husband of a former United States Army medic. Do you fear any personal ramifications from the travel ban, which created widespread complications for immigrants and residents? Practically speaking, I should be O. K. but it’s kind of scary in a way. That pales into insignificance next to the   trauma of other people. My wife’s been in Iraq. She had a translator. So I know IRAP [the International Refugee Assistance Project] very well. They were there the whole time at J. F. K. I know some of the people who have bled for this country and are now not being let in. When I was still on a visa, I remember the third or fourth time I landed back in J. F. K. from England, catching myself thinking, Oh, great to be home. And then realizing, that is a dangerous thought when there is someone behind a glass panel deciding whether this is your home or not. I still have the basic immigrant’s crush on this country. I like the point of America, that it is diverse  —   not a reactionary idea of an America that happened after the fact. When, say, you do a long segment on “Last Week Tonight” about the importance of the   fiduciary rule, and then Trump signs an executive order that could put a halt to it, does that frustrate you?  No, but it hurts more. We’ve spent so long looking at those stories, we know how important it is. Even something like the fiduciary rule, which can seem like a luxury issue  —   that, in very meaningful ways, affects people’s lives down the line. Our researchers have been looking at the [hiring freeze on federal workers]  —   there’s a lot of veterans who are going to be adversely affected and they don’t even realize it yet. With some of these E. O. s [executive orders] it’s like a tsunami warning. You’re in real trouble and you don’t yet know because the sea looks calm. Do you accept the argument that   comedians helped Trump win, either by insulating Clinton voters from the possibility she could lose or egging on his supporters to vote for him? That is just a stick to hit someone with, knowing that it’s something that could hurt someone. What’s a thing that you like? I’ll attach something you don’t like to it. “Pancakes  —   this is why Trump won. ” But I like pancakes! I’m not saying that comedians are not, by their nature,  . But if you, as a comedian, think you got Donald Trump elected, you’re a sociopath. The election and its aftermath have brought attention to the problem of fake news. Do you think shows like “Last Week Tonight” contribute to this problem?  The phrase “fake news” has now been used so liberally, it’s meaningless. The problem with aggregation is that the very act of aggregating a piece of information assumes that somewhere along the line, there was a level of  . We are very, very strict about making sure that every piece of information that we pass along, we   independently. I do not, for a second, say that our sourcing is transferable across other political comedy shows. Mr. Trump has vociferously criticized the media  —   news outlets as well as comedy shows like “Saturday Night Live. ” Do you fear he might actually try to retaliate against his critics? What he says about journalists is a serious, lasting concern. He has proven these threats are not entirely empty. They’re sometimes promises. But “S. N. L. ” is a comedy show. What would he do, get “S. N. L. ” taken off the air? “S. N. L. ” is something he cares about. We are a meaningless mosquito that he barely hears buzzing by his ear. There is a nonzero chance that he’ll do anything. There’s a nonzero chance you and I are taken to the border this evening and deported as Mexicans. That’s probably not going to happen, but it’s not zero. [laughs] Do you feel as if you were seeing more TV journalists use some of the basic techniques “The Daily Show” developed, like juxtaposing video clips of an administration official contradicting himself?  What you’re describing just seems like basic   to expose hypocrisy. I always find it pretty dispiriting if ever I see journalists trying to tell a joke. This is not your concern. Pick a lane. You don’t need to do this. Also, almost 100 percent of the time, you’re less funny than you think you are. Although, you could absolutely apply that to most comedians. [Laughs.] In all my working years at “The Daily Show,” whenever [a TV journalist] said, “I wish we could do what you guys do”  —   you can. Just don’t tell jokes at the end. Because you can’t, and you shouldn’t. Have you been approached about hosting the White House Correspondents’ Association dinner? Oh, no. God, no. That is just such a noxious concept. I have such contempt for that, as an evening. It would seem really [awful] to go and say, “This whole thing is a horrendous farce. ” I don’t need to go and ruin their unearned evening of celebration. Any of that commentary, I can do on my own show.'"}, "time": 1742628558.6605127}