{"duration": 0.07155656814575195, "input_args": {"text": "'Even before President Trump issued an order on Friday banning immediate entry into the United States by people from several predominantly Muslim countries, immigration lawyers, having heard rumors of coming action from the White House, were on alert. On Wednesday, lawyers from the International Refugee Assistance Project at the Urban Justice Center who were concerned that the action would affect the project’s clients sent out an email calling for lawyers who could volunteer immediately to go to airports where refugees were scheduled to enter the United States. “It occurred to us that there were going to be people who were traveling who would land and have their status affected while in midair,” said Betsy Fisher, the group’s policy director. And that is exactly what happened. Across the country, people were detained on Sunday after being caught up in the aftermath of Mr. Trump’s order, even though a petition filed on Saturday in federal court in Brooklyn led a judge to block part of the order. Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi, the plaintiffs named in the petition, were originally clients of Ms. Fisher’s organization. The email received a tremendous response, Ms. Fisher said, with “well over a thousand people” expressing interest and availability. By Saturday morning, the lawyers who heeded the call were at about a dozen airports around the country. Others who heard about the effort through colleagues or the news media went to airports on their own to pitch in. By early Sunday morning, Ms. Fisher said, lawyers offering services and advice were at “most international airports in the United States. ” Andre Segura, a lawyer for the American Civil Liberties Union, arrived at Kennedy International Airport in New York at 1:30 p. m. on Saturday. He said that the outside section of Central Diner, a restaurant in Terminal 4, was “entirely taken over by attorneys,” all working to file petitions for individual clients with the help of the clients’ families. “There were attorneys from numerous major law firms, nonprofits, all working together,” Mr. Segura said. “I’ve never seen that immediate coming together of teams to start filing actions to try to protect people. ” He added, “The dynamic between what was happening inside the terminal with all the attorneys, and outside with massive protests and people holding signs  —   I’ve never experienced anything like that. ” Mr. Segura said he arrived home around 2 a. m. on Sunday. He woke up at 5:30 and began answering emails from lawyers who had stayed overnight at the airport. While lawyers gathered at airports on Saturday, others were working furiously on litigation. Cecillia Wang, the A. C. L. U.’s deputy legal director, described the scene at her office as “complete chaos. ” “I was sitting at my desk working on a template habeas petition that could be used by lawyers at airports all around the country,” she said. Omar Jadwat, the director of the A. C. L. U.’s Immigrant Rights Project, which worked on the petition that led to the judge’s stay, said the litigation had not been prepared ahead of time. “That was not something we had on the shelf ready to go, waiting for the right plaintiffs to come along,” he said. “It was a case of: There’s this emergency, and people have to work together to figure out a response as quickly as we can so that these people and other people around the country didn’t get deported. ” Even after word of the federal court’s order reached the airport in New York, confusion reigned. Alina Das, a professor of clinical law at New York University School of Law, said she had arrived at the airport at 7 p. m. on Saturday and stayed overnight, working to get a client released. Ms. Das, who said she could not comment on her client’s situation, described the scene on Sunday morning, saying that it was “incredibly difficult to get an answer on whether our clients were going to be sent back or whether they were being processed for release” and that people remained detained even after the court order blocked part of the president’s actions. Avi Gesser, a partner at the law firm Davis Polk  Wardwell, described the process in Terminal 4 on Saturday, saying that a group of people had been deployed to search for those whose family members were detained. “If they found people, they referred them over to us and we onboarded people as clients if we could, and then filed habeas petitions,” he said. Mr. Gesser, who is originally from Canada, did not leave the airport until 4:30 a. m. on Sunday, he said. “Our firm has a lot of people who were not born in the United States,” he said. “We felt that people who were being detained needed legal representation. And that’s something that we do very well. ” Rebecca Heller, who was coordinating lawyers’ efforts on the ground for the International Refugee Assistance Project on Saturday, said that by Sunday afternoon, her services were far less in demand. “They’re   now!” she said excitedly in a brief phone call. “That’s how a movement starts. ”'"}, "time": 1742562332.7095704}