{"duration": 0.15332794189453125, "input_args": {"text": "'As of early Monday night, a meeting of U. S. A. Hockey’s board of directors had not yielded a resolution to the pay dispute with the American women’s national team, but the players’ network of support had expanded to Congress. Twenty United States senators, led by Elizabeth Warren, Democrat of Massachusetts, urged a quick solution to the standoff, which came after 15 months of negotiations. Major figures in professional sports had already voiced their support after the women’s hockey players took to Twitter on Friday to promote their cause. Several N. H. L. players and Philadelphia Flyers Coach Dave Hakstol, along with representatives of the players’ unions for the N. H. L. N. B. A. N. F. L. Major League Baseball and the W. N. B. A. backed the team on social media. Before the board meeting started at noon Eastern on Monday, a group of Democratic senators that included Dianne Feinstein of California, Patrick Leahy of Vermont and Cory Booker of New Jersey sent a letter to U. S. A. Hockey saying, “These elite athletes indeed deserve fairness and respect, and we hope you will be a leader on this issue as women continue to push for equality in athletics. ” The senators cited the Ted Stevens Olympic and Amateur Sports Act, which requires U. S. A. Hockey to “provide equitable support and encouragement for participation by women where separate programs for male and female athletes are conducted on a national basis. ” The women’s hockey team is threatening to boycott the International Ice Hockey Federation world championship, which begins Friday in Plymouth, Mich. The United States is the   defending champion and is currently ranked No. 1. Jim Johannson, U. S. A. Hockey’s assistant executive director of hockey operations, said Monday he had “nothing to say” on the matter. A spokeswoman for Ballard Spahr, the law firm representing the women’s team, wrote in an email that it had no comment on the U. S. A. Hockey meeting. The hockey organization’s 91 voting board members, a large majority of them men, were expected to vote on a proposal from the team. The women’s national hockey team is seeking an increase from the $1, 000 per month that U. S. A. Hockey provides each player during the   Olympic residency every four years. The players also receive up to $2, 000 per month in training stipends from the United States Olympic Committee   even in   years. The women’s team is also seeking travel accommodations and insurance coverage similar to what the men’s national team receives. Some national team players compete in the National Women’s Hockey League, where salaries, which range from $10, 000 to $26, 000 a year, were reduced last season. Because of the training schedules requested by U. S. A. Hockey, it is difficult for the women to hold   jobs. Last April, Meghan Duggan, the team’s captain, left a coaching job at Clarkson University, which last week won the N. C. A. A. championship. “That was an incredibly difficult decision for me,” Duggan said. “I remember sitting in my boss’s office and telling him why I had to leave. The sole reason was U. S. A. Hockey. ” Aside from increases in compensation, a main point of contention for the players is the money funneled into the National Team Development Program for top   boys. Largely subsisting on a $9 million donation from the N. H. L. the program has yielded several world championships and high N. H. L. draft picks, but it does not have a counterpart on the women’s side. After the boycott was announced March 15, the sides held a   meeting five days later in Philadelphia. The players thought they were closing in on a deal, but on Thursday, after U. S. A. Hockey met with its executive committee, it responded with a lower offer and began seeking possible replacement players for the world championship. U. S. A. Hockey’s response seemed only to galvanize supporters of the women’s team. Dozens of players from college and junior programs posted on Twitter that they had declined invitations to play for the national team, as did professionals from the N. W. H. L. and the Canadian Women’s Hockey League. Efforts by U. S. A. Hockey to recruit adult recreation players also failed. Bray Ketchum, who plays for the N. W. H. L.’s New York Riveters, received an email sent to former U. S. A. Hockey players. Ketchum, who last played for a national team in 2010, declined the invitation. “It’s kind of sad that U. S. A. Hockey is almost in a sense ignoring them and turning to these younger players,    players,” Ketchum said. Last week, when the national team first learned of U. S. A. Hockey’s intention to reach out to prospective replacements, players began contacting coaches and players throughout the youth, college and pro ranks to garner support. “I expect them to look under rocks for players,” the national team star Hilary Knight said. U. S. A. Hockey, in fact, reached out to some players who had no expectation of ever being considered. Paige Johnson was one of three players to be contacted at   Falls, a Division III team. A text message from a U. S. A. Hockey representative tried to entice Johnson with the chance to earn up to $3, 000 in performance bonuses if she competed in the world championship. Last week, in a statement posted on U. S. A. Hockey’s website, the organization said national team members could earn as much as $7, 500 at the world championship. “After I got being over the shock that they’re asking me, it came down to the fact that they reached to the   level, that everyone before me has said no,” Johnson said, adding that accepting an invite would “go against what we’re trying to accomplish” with gender equality. U. S. A. Hockey even tried to recruit players from the American Collegiate Hockey Association, a   league below Division III. One such player was Lauren Allen, a goalie at Grand Valley State in Michigan. She was a member of the American team at this year’s World University Games, which was organized and supported by U. S. A. Hockey. All of those players came from the A. C. H. A. and all of them declined U. S. A. Hockey’s most recent invitation. “We weren’t going to go behind the backs of our sisters, because we believe we need equality,” Allen said. “It’s a movement, women’s hockey history, and of course I support them. ”'"}, "time": 1742562945.582946}