{"duration": 0.13341689109802246, "input_args": {"text": "'JACKSON, Miss.  —   When officials in Mississippi’s rural Holmes County, about an hour’s drive north of here, hired an architecture firm to fix the county’s ailing schools, they got back plans for a new $40 million high school to serve 1, 200 students. Holmes County is among the poorest counties in the nation, plagued by   systematic racism, with a population (18, 340) that has been declining for more than a  . Holmes didn’t have $40 million to pay for a high school. Community leaders reached out to Derrick Johnson, state president of the N. A. A. C. P. who also helps underserved Mississippi neighborhoods and districts with strategic planning. “Poor communities here are especially vulnerable,” Mr. Johnson told me the other day. “The whole system perpetuates exploitation. Residents need people they can trust. ” So Mr. Johnson enlisted Roy Decker and Anne Marie Duvall,    architects from Jackson. Since they founded Duvall Decker nearly 20 years ago, the Deckers, as they’re known, have focused mostly on neglected corners in and around Jackson, Mississippi’s capital. To pay the bills, the two have redefined for themselves the ambit of a small architectural practice. They have become developers and even branched into building maintenance: a    strategy that has allowed them more than just financial breathing room. “Assuming more risk and responsibility has also given us a stronger voice, upfront, in this community, with politicians and businesspeople,” Ms. Duvall pointed out. “That’s because we have skin in the game. ” Architects are forever complaining about feeling undervalued, about having lost a seat at the   table. Big ideas  —   the ones that shape whole cities and ultimately determine what is built, for whom and where  —   mostly happen “during the first 10 percent of any project,” as Mr. Decker likes to put it, meaning before architects are called in to design something. For the Deckers, like more and more socially minded architects today, reclaiming that seat is an increasing priority. “When young architects apply to work for us,” Ms. Duvall said, “we ask what they want. Sometimes they say they want to design buildings that are unique, to express themselves. Other times they say they hope their work will have good consequences in a community. We’re finding more young people answering the second way. ” The architect Billie Tsien was a juror for the Architectural League in New York that just gave the Deckers an Emerging Voices award. “There’s a lot of fashionable work out there,” Ms. Tsien said. “Anyone who has done public work for nonprofits can appreciate the effort it takes to make even a smidgen of architecture happen. ” I met some of the people who live and work in the buildings the Deckers have designed. For Midtown, a Jackson neighborhood where the poverty rate hovers around 50 percent, the architects produced a master plan with affordable housing. The   homes  —       modernist duplexes with solar panels and tall   porches  —   have helped resuscitate a main street. Duvall Decker also renovated a nearby strip mall long dominated by a pair of liquor stores. The stores are now gone, replaced by a community health center, the mall painted a stylish slate gray, with shiny   benches and window frames beneath a lofty new portico. The Deckers eked their smidgens out of the arrangement of drainpipes and new signage. With a little money from the city housing authority and a mix of local nonprofits, a mall that used to blight the neighborhood has become an advertisement for it. The architects are looking to do something as transformative for Up in Farms, a food hub that links farmers (average income: $10, 000 a year) with Jackson restaurants, groceries and food banks. The Deckers are upgrading a dilapidated 1940s farmers market in the city. “They have also helped clarify our organization and reduce our costs,” said David Watkins Jr. who runs the hub. “They’re focused on our whole business and our outcomes, not just on designing space. ” Likewise, with Holmes County, the architects consulted parents and teachers on curriculums for kindergarten through 12th grade because the schools’ problems clearly went well beyond a single building. The Deckers brought in a tech consultant to help develop interactive digital learning tools  —   thinking about virtual space “in the same way we are thinking about buildings,” as Mr. Decker put it. Duvall Decker’s plan consolidates several     schools in the shell of an abandoned factory whose reconfiguration will cost residents a fraction of the $40 million the earlier firm originally discussed for just the high school. It’s instructive that Mr. Decker once taught architecture alongside Samuel Mockbee, the beloved, charismatic   of the Rural Studio, who died in 2001. Rural Studio trains Auburn University students to design highly refined buildings for poor communities, mostly in west Alabama. The Deckers acknowledge Rural Studio’s impact. But they don’t think of themselves as part of that legacy. Mr. Decker describes Mockbee’s initial strategy as a kind of   “creative abduction and aestheticized version” of Southern vernacular design. “Rural Studio has always done great   work, but we can’t depend on free labor,” Ms. Duvall added. We were talking on the sunny patio of a restaurant near Duvall Decker’s office, in a growing commercial area of   1950s buildings a couple of miles from downtown. What Mr. Decker said is the only abortion clinic left in Mississippi is just up the block. Next door is a building the Deckers bought years ago. They became almost accidental developers, acquiring a derelict site for a potential studio, receiving an offer to buy it within weeks, and realizing that real estate, on a modest scale, could subsidize their practice. Across the street, in what used to be a dry cleaner, they’re now partners in what expanded will become a hotel. At the same time, the firm fixes leaky pipes and broken windows for clients like an   program called Operation Shoestring. When the lights go out at a veterans’ home mortgage association, another client, Duvall Decker sends over an electrician. When rain falls on the headquarters of a community college honor society, the Deckers themselves sometimes go up on the roof afterward to clear the gutters and sweep away puddles. It’s all of a piece: architecture conceived as buildings with many lives. Tough and pragmatic, Duvall Decker’s work relies on an evolving vocabulary of economical materials and attunement to Southern light. A state library the Deckers designed exploits the changing shadows cast by an irregular grid of precast concrete panels on the facade. Light pours through huge windows into a     reading room for the state book collections. At a civil rights research center and art museum on the campus of Tougaloo, the historically black college on the northern edge of Jackson, I asked Beverly Wade Hogan, the president, what it’s like to work with Duvall Decker. “I talk a lot about what this school means and what it stands for,” she told me. “Roy and Anne listen. ” That’s the goal, Mr. Decker said. “The world is what you make of it,” he added. “For most people here in Mississippi, it’s hard. Our fundamental job as architects is to make it better. ”'"}, "time": 1742564558.0223184}