{"duration": 0.035013437271118164, "input_args": {"text": "'In the hall of fame of   comic characters, between wax works of W. C. Fields and Larry David, there ought to be a monument to Billy Bob Thornton’s work as Willie, the alcoholic safecracker of “Bad Santa. ” As much as Terry Zwigoff’s 2003 film relied on the spectacle of Mr. Thornton soiling himself in a Santa suit or saying unspeakable things to children, the performance was a master class in timing and sly reaction shots. Only Mr. Thornton could have played the role. Now comes a belated sequel, “Bad Santa 2,” directed by Mark Waters (already a connoisseur of bad behavior from “Mean Girls”) whose pitch meeting seems to have proceeded from two unnecessary questions: What if bad Santa weren’t as bad as all that? And what if he had an estranged mother whose conduct is at least as foul as his? Yet even the profanity has lost its zing in this   retread, which mostly prompts admiration for how far Mr. Zwigoff ran with one joke. When we   Willie (Mr. Thornton, looking resigned to his task) he is working as a valet parking attendant, a job that goes south after he is distracted by a   mother. Following our reunion with Thurman Merman (Brett Kelly)  —   Willie has promised to get the kid deflowered for his 21st birthday, which leads to a mortifying interlude with a prostitute (Octavia Spencer)  —   Willie accompanies his former partner (Tony Cox) to a prospective robbery in Chicago. (Shots of the city may be entirely stock footage, as if the movie crew knew tagging along might be a bad idea.) The target is a charity run by Diane (Christina Hendricks) and by her unfaithful husband (Ryan Hansen) who pockets most of the revenue. Dismayed about ripping off    —   mawkishness is the only aspect in which “Bad Santa 2” outpaces its predecessor  —   Willie is not above beating up a street Santa (Mike Starr) who gets into a dispute with him over a spot to stand. Diane, a target for Willie’s lewd advances, takes up the function of Lauren Graham’s character in the first film. If “Bad Santa 2” has anything new to offer, it’s the spectacle of Kathy Bates as Willie’s mom, whom Willie resents. (He offhandedly mentions having taken the fall for her at age 11.) Her remarks about her careless parenting (“Hell, I didn’t even know I’d given birth until I’d tripped over him”) constitute the movie’s best effort at a running joke, and while Ms. Bates can be a nimble scene stealer, decking her out in tattoos and punk jewelry is not enough to spark an uninspired script. “Bad Santa 2” is rated R (Under 17 requires accompanying parent or adult guardian) for Bad S’antics. Running time: 1 hour 32 minutes.'"}, "time": 1742562296.225732}