{"duration": 0.05992412567138672, "input_args": {"text": "'By Hrafnkell Haraldsson on Sat, Oct 29th, 2016 at 7:56 am \"If she gets elected on November 8th, this isn\\'t going away. So what needs to happen, special prosecutor? She can\\'t investigate herself as the president-elect\"   \\nPresident Barack Obama did not have to do anything wrong for Republicans to want to throw him in jail, or to impeach him. Hillary Clinton doesn’t have to have done anything wrong either, apparently, for Congress to appoint a special prosecutor to take her down once elected – because a bunch of emails had nothing to do with her . \\nAt least, that and completely ignoring the facts, was the theme on Fox News last night, though to be fair, other mainstream media outlets weren’t much better yesterday. \\nMegyn Kelly, fresh from a stint of pretending to be a feminist in a face-off with Newt Gingrich, suggested to Chairman of the House Judiciary Committee Bob Goodlatte (R-WV) that given the FBI revelations of a complete lack of evidence that Hillary Clinton has done anything wrong, “what needs to happen” is a special prosecutor. \\nMEGYN KELLY : Let me ask you this. If she gets elected on November 8th, this isn’t going away. So what needs to happen, [a] special prosecutor? She can’t investigate herself as the president-elect. BOB GOODLATTE : Well, first of all, we have said from the outset that the House Judiciary Committee would follow the truth wherever it leads, and we have done that throughout the summer, asking a number of questions about how this investigation by the FBI was being conducted. We will continue to do that. We don’t know what’s going to happen now. We don’t know what’s going to happen after the election. So it’s pure speculation what will happen afterwards. A special prosecutor, remember, is appointed by the Attorney General of the United States. So, you have to decide whether that’s going to be a fairer investigation than the one being conducted by the FBI under the direction of Director Comey right now. And the Judiciary Committee will certainly stay engaged in this and continue our investigation. \\nDemocracy is a fragile thing. It is to Goodlatte’s credit that he declined the call to draw up articles of impeachment in 2014 and that he cautioned Megyn Kelly that a special prosecutor is appointed not by the House but by the Attorney General. However, the GOP-led House has been far too engaged already in undermining our democracy. \\nWhat holds this country together is an idea and an agreement among all parties that it works. Republicans have decided it only works if they’re in charge, and this has brought us to the point where we threaten to jail our adversaries, appoint special prosecutors if they win, or vote to impeach them outright, as Trump’s pet snake at CNN, Jeffrey Lord, called for last night : \\nTwo points, Anderson. One, with 11 days left, this makes Donald Trump’s argument exactly to the point here, you sum up the argument in terms of her judgment, her paranoia and all of the rest. The second thing, Anderson is, and this is the really disturbing thing, let’s just say for the sake of the argument she wins the election, this isn’t going to stop. There will be a move to impeach her the moment her hand comes down from that Bible. This is going to go on and on and on and on and frankly, I mean that’s something the American people need to consider now. \\nIt is not difficult to see where this will lead. Hillary Clinton has committed no crimes. Far from being a miscarriage of justice, though it is that as well, this is a miscarriage of reason and sanity. \\nThis sort of talk is just further evidence that Donald Trump comes from the same vile brew as Paul Ryan and Mitch McConnell and the rest of the party. During the McCarthy era, the House took it upon itself to be both judge and jury. Last night, it was Fox News egging the House on for more of the same. \\nThis sort of talk is deplorable, it is reprehensible, and it is dangerous – and strikes at the very heart of our democracy.'"}, "time": 1742563196.2859132}