{"duration": 0.3337688446044922, "input_args": {"text": "'PARIS (AFP)  —   Such is Marine Le Pen’s aversion to the European Union that the French right wing leader demanded the removal of its   flag from a TV studio before agreeing to a recent interview. [Her chief rival in the race for the French presidency, centrist Emmanuel Macron, pointedly waved an EU flag from the podium at a campaign rally the next day.  Love it or loathe it, the European Union has become a   issue in the election, fanning fears far beyond France in the wake of Britain’s Brexit vote that a “Frexit” could doom the    bloc. “Rarely has the European issue held such a   place on all the candidates’ platforms as in this electoral campaign,” said analyst Pierre Vimont of the Carnegie Europe think tank. In the five years since France’s last presidential vote, Europe has seen a massive migrant crisis and a rise in populism, both contributing to the Brexit vote. None of the four main French candidates can afford to be neutral on the EU, whether they portray it as the source of all woes or a guarantee of peace and stability. Like Macron, conservative candidate Francois Fillon is bullish on Brussels, highlighting the   leadership axis and defending the euro. Both candidates met with German Chancellor Angela Merkel during the campaign. Arrayed on the other side are Le Pen, who advocates leaving the EU immediately, and   candidate   Melenchon, who demands a renegotiation of key treaty provisions. “Positions have hardened,” said Manuel Lafont Rapnouil of the European Council on Foreign Relations. “Melenchon was very influenced by what happened to (Greek   party) Syriza,” which gave in to European demands after months of crisis. Syriza, the party of Greek premier Alexis Tsipras, endorsed Melenchon, saying he “represents hope for change for France and Europe”. Le Pen, on the other hand, “is riding the wave of Brexit” and Donald Trump’s surprise accession to the White House, he said. The ideological underpinnings of the two candidates’ eurosceptism are worlds apart, however.  —   ‘Dictatorship of banks’  —   Le Pen stresses economic, monetary and territorial “sovereignty” along with a “national preference” for French citizens in the workplace and the allocation of state benefits. Melenchon vows to end the “nightmare” of an EU that submits its members to “the dictatorship of the banks” and the austerity policies they impose. But both promise a showdown with Brussels and say they are certain to come out on top given the strength of France within the bloc. Le Pen says she will launch six months of talks aimed at withdrawing France from the   Schengen area, as well as from the euro, before calling a referendum on whether the French want to leave the EU  —   a   “Frexit”. For his part, Melenchon has a   approach summed up as “change the EU or leave it”: a Plan A by which France will renegotiate its membership terms and a Plan B for a unilateral Frexit. As for the single currency, a poll carried out in early March found that more than 70 percent of the French oppose quitting the eurozone. On the eve of Sunday’s first round, Melenchon has toned down his euroscepticism, saying that he would prefer for France to stay in the EU and the eurozone. Le Pen has also adjusted her rhetoric, focusing more on FN staple issues such as immigration and security  —   the latter question surging to the fore after Thursday’s jihadist killing of a policeman in the Champs Elysees. On the   side, Macron says he has “Europe at heart” wants to bolster the eurozone and is the only candidate who favours CETA, the   agreement between the EU and Canada that will provisionally come into force in a few weeks. Fillon, more protective of French sovereignty, wants a   of the balance of power between Brussels and EU members states.   Giuliani of the Robert Schuman Foundation said both Fillon and Macron are too complacent with the status quo, calling the EU planks of their platforms “unimaginative”. Candidates should talk about the EU’s renewal and how France needs to revitalise its role within it, Giuliani said.'"}, "time": 1742562408.7089217}