{"duration": 0.0596928596496582, "input_args": {"text": "\"- < National Data | October Jobs— Immigrant Working-Age Population Grows 9 Times Faster Than Native-Born, Blacks Hardest Hit (Seriously) November 7, 2016, 9:29 am   \\nImmigrant displacement of American workers close to a record high, black unemployment jumps and a new immigration surge is underway—right in time for the election. \\nThe government, in its last pre-election snapshot of the economy, reported that employers added 161,000 workers in October. The official unemployment rate dropped to 4.9 percent, from 5 percent. And average hourly earnings rose 2.8 percent year over year, a level not reached since 2008. \\nThe MSM saw as presaging a healthy outlook for the months ahead. “It was pretty positive across the board,” said David Berson, chief economist at Nationwide Insurance.[ Last Economic Snapshot Before The Election Shows Healthy Job Growth, By Patricia Cohen, NYT, November 4, 2016, \\nApparently Mr. Berson does not scrutinize the part of Household Employment Survey where data are reported by race and nativity. There he would have seen that seasonally-adjusted unemployment among Black men 20 years and older rose in October (to 8.6% from 8.3% the prior month) while Hispanic men in that age bracket enjoyed a decline (to 5.0% from 5.4% in September). Seasonally adjusted unemployment among white men held steady at 4.1% in September and October. \\nThis pattern is consistent with the displacement of black workers by low wage, primarily Hispanic, immigrants.[ After Immigration Raid, Locals Line Up For Jobs, NPR, August 28, 2008] \\nEven the macro picture of continued job growth is belied by the latest Household Survey results. \\nIn October: Total Household Survey employment fell by 43,000, down by 0.03% Native-born American employment rose by 206,000 up by 0.16% Foreign-born immigrant employment fell by 249,000, down by 0.96% \\nBut October was unusual in that native-born American workers gained jobs and immigrants lost them. Overall, native-born American workers have lost ground to their foreign-born competitors throughout the Obama years and this trend has accelerated significantly in 2016. Last month was one of the occasional anomalies. This is brought out in our New VDARE.com American Worker Displacement Index (NVDAWDI) graphic: OBAMA'S LEGACY: IMMIGRANT VS. AMERICAN EMPLOYMENT GROWTH January 2009 though October 2016 (Monthly employment index: Jan. 2009=100) *VDARE.COM AMERICAN WORKER DISPLACEMENT INDEX Source: BLS Household Employment Survey; VDARE.com \\nNative-born American employment growth is represented by the black line, immigrant employment growth is in pink, and NVAWDI—the ratio of immigrant to native-born job growth—is in yellow. The index starts at 100.0 in January 2009 for both immigrants and native-born Americans, and tracks their employment growth since then. \\nFrom January 2009 through October 2016: Immigrant employment rose by 4.248 million, or by 19.6%. The immigrant employment index rose from 100.0 to 119.6. Native-born American employment rose by 5.456 million, up by 4.6%. The native-born American employment index rose from 100.0 to 104.5. NVDAWDI (the ratio of the immigrant to native-born employment growth indexes) rose from 100.0 to 114.4. (100X (119.6/104.5)) \\nDuring the Obama years, immigrant employment has risen 4.3 times faster than native-born employment–19.6% versus 4.6%. In many unskilled occupations, the gap is larger, owing to a disproportionate share of foreign-born workers. \\nThe foreign-born share of total U.S. employment has risen steadily, albeit erratically, during the Obama years: IMMIGRANT SHARE OF U.S. EMPLOYMENT January 2009 through October 2016 Source: BLS Household Employment Survey; VDARE.com \\nIn Barak Obama’s first full month in office (February 2009) 14.97% of all persons working in the U.S. were foreign-born. The foreign-born share in October was 17.05%, the fifth highest among the 94 months of Mr. Obama’s administration. The Obama era high, 17.216%, was set in September 2016. \\nSeven of the 10 worst months for native-born workers in the Obama years (measured by the share of jobs held by immigrants) have occurred in 2016. \\nThe foreign-born share of total employment in September was 2.23 percentage points above the level recorded in February 2009. With total employment now at 152.0 million, this implies that Obama-era immigration may have pushed as many as 3.39 million native-born Americans onto the unemployment rolls since then. \\nA detailed snapshot of American worker displacement over the past year is seen in the Employment Status of the Civilian Population by nativity table published in the monthly BLS Report. [ PDF] \\nEmployment Status by Nativity, Oct. 2015-Oct. 2016 (numbers in 1000s; not seasonally adjusted)\""}, "time": 1742564467.1480718}