{"duration": 0.09582233428955078, "input_args": {"text": "'Send your workplace conundrums to workologist@nytimes. com, including your name and contact information (even if you want it withheld for publication). The Workologist is a guy with   opinions, not a professional career adviser. Letters may be edited. I was one of several people my boss bullied into resignation by collecting gossip, pressuring people to say vaguely critical things and overstating what they said  —   a witch hunt, basically. When I saw this happening to me, I consulted a lawyer, but ultimately concluded I had no interest in saying or doing anything to continue being associated with this vitriolic nut. I resigned and had a better job lined up five days later. I win.  Nonetheless, I was angry and resentful, I think reasonably. I composed my detailed defense, pointing out that my boss knew she was lying, and that she is an evil, disgraceful woman. I felt much better  —   but I did not send the email, and moved on emotionally.  Recently my separation from that employer became official (there was a delay to account for leave time I was owed). Feeling that this horrid woman could no longer hurt me, I reread my email draft and came very close to sending it  —   maybe with a blind copy to her boss. I believe sending it will make me feel more victorious, but maybe it risks opening cans of worms I cannot foresee. I can’t decide if not sending it will make me feel like the better person, or if I’ll be nagged by the sense that I allowed this boss to bully me. Shall I send or delete? ANONYMOUS I am a fan of the raw, unvarnished   letter. Stating your case precisely as you see it, with absolutely no regard for diplomacy, nicety or consequences, can be a genuinely cathartic exercise. But I’m not a fan of actually sending such notes. (In fact, make sure you never do this as a draft in your official company email system this letter should exist only in a place your employers don’t have access to.) Sometimes it’s appropriate to submit a formal letter of resignation, but that is a separate exercise: Pour out your venom first, then start from scratch, composing yourself before you compose a statement you expect others to read. In this case, you may be right on the facts, but it’s hard to deny, based on the language you’re using, that you are still angry and resentful. This is rarely a productive frame of mind for convincing anyone else (your boss’s boss, let’s say) that you are offering a reasonable assessment. At best, you’ll communicate bitterness at worst, any mention of your lawyer might be interpreted as a veiled legal threat, which I doubt is your goal. And what is your goal? It’s not clear why you need to feel more “victorious” right after declaring victory for easily proving your own worth by finding new work elsewhere. Even if you see this boss as a liability to the company and think her supervisor should know, that would be a completely different letter  —   focused not on you but on the organization. But I generally see little point in trying to reform a company after you’ve quit. Maybe you’re having second thoughts about having resigned. That, too, is a different issue. You made a decision you felt was in your best interest, and there is no reason to get hung up on it. Focus on your future, not on continuing battles from your past. I supervise an employee who I know is considering moving on. I don’t begrudge him this because I can’t offer him the   position he wants. But I anticipate that he may ask me for a professional reference, and I’m not sure how to respond. He’s done decent work over all. But he’s demonstrated some frustrating traits. For example, he doesn’t respond reliably to emails while working remotely, and he waits for others to solve problems for him. I have no desire to sabotage his prospects (he’s young and at the beginning of his professional life) by withholding a reference or blabbing unnecessarily about his flaws. But if asked directly about things he needs to improve, I would not lie. What should I do if he asks for a reference? S. S. SEATTLE You could respond with a version of what you’ve said here. It sounds like, in general, you would endorse his work, you wish him well and you would not go out of your way to criticize him. That said (you could tell him) there are a few matters you would be honest about if asked  —   the ones you’ve named. End on a positive note by reiterating that you also see his good qualities and don’t want to prevent him from finding the   work you know he’s looking for. At that point, it’s really up to him. An alternative that has become popular is to adopt an “only the facts” policy: Tell him you’ll confirm dates of employment and the like, but that’s it. This is nothing personal, just company rules, or even your own personal rules. That may feel like a dodge  —   because it is  —   but it’s common practice at many organizations. (Obviously, if you do this you have to stick to it.) There’s one more option that might be more productive: a preventive strike. Have a conversation with this employee about the pros and cons of his performance before he announces he’s quitting. Start with the good points, note where he could do better, and circle back to the positive, perhaps noting his potential or some such. (Starting and ending on a high note is known as a “criticism sandwich. ”) It is honest and should help him whether he stays or goes  —   and might even benefit you.'"}, "time": 1742563098.8022726}