{"duration": 0.06754374504089355, "input_args": {"text": "'“The Newshour” anchors to dubsmash Arnab Goswami’s voice to combat sinking TRPs Posted on Tweet \\nFaced with a sharp slump in viewership after the departure of their former editor-in-chief and star anchor Arnab Goswami, the makeshift anchors of Times Now’s prime-time debate, “The Newshour” have decided to dubsmash Goswami’s voice in a desperate bid to restore their TRPs. (Image via aisfm.edu.in) \\nGoswami’s loud, hard-hitting voice, one of the main reasons behind The Newshour’s catapult to dominance, will now be played in The Newshour studios, while the makeshift anchors move their lips to his statements. According to senior Times Now journalist Navika Kumar, their usual stand-in Newshour anchor Anand Narasimhan has been spending sleepless nights, hard at work, trying to move his lips to Arnab’s audio flawlessly. “It’ll be a while before Rahul Shivshankar joins us and does a more believable and buy-able impression of Arnab, but until then, we’ve got to do this much at least,” Navika told The UnReal Times . \\nNarasimhan has admitted to finding this task the most difficult thing he’s ever had to do in life. “To open your throat and try to scream the loudest, yet without screaming, to keep interrupting people correctly before they finish a couple of words, to keep uttering that you would bring in some panelist in to the debate and yet not bring him, to keep announcing ever 5 minutes that you would open the phone lines and yet not open them..Whew! This is as Herculean as it can get. I expect to be featured on Ripley’s Believe it or not, if at all I’m able to achieve this dubsmashing feat,” the anchor described, before going ahead to practice moving his lips to “THE NATION WANTS TO KNOW!” \\nNavika also added that the crew has a backup plan in place, should the dubsmashing go awry. “In the worst case, if no one is able to lip sync properly, we will try to get Dr. Manmohan Singh to do the job. He doesn’t have to dubsmash, he might as well speak and we can have Arnab’s voice as the voiceover,” the senior journalist added. The channel, however, soon had a reason to cheer, as Bollywood actor Anupam Kher volunteered to act as Arnab for free. “Dubsmashing Arnab is the least I can do for my country and our soldiers at the border. It is a role that I would be proud and privileged to accept, all for the sake of the jawans,” Kher exclaimed. \\nThe move has, however, come in for sharp criticism from the channel’s bete noire s. “Dubsmash => Dumb smash. Enough said :)” tweeted Congress spokesperson Sanjay Jha. The last word though, went to AAP spokesperson The Ashutosh. “Why the Times Now sud depend on lip sinking the Arnab’s voice !!! Will the Modi answer !!!” (sic) the former IBN7 editor tweeted. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide. View all posts by Ashwin Kumar → Related Posts'"}, "time": 1742561949.5570767}