{"duration": 0.04446268081665039, "input_args": {"text": "'WASHINGTON  —   The pictures will be unavoidable, and the flood of painful memories unstoppable. When President Obama lands next Sunday in Hanoi, his visit will be chronicled by photographers, cameramen and journalists who will track every public move of only the third presidential visit to Vietnam since the end of the American war there. Mr. Obama’s former defense secretary, Chuck Hagel, said he is already bracing for the onslaught of recollections those pictures and articles are likely to inspire. “I know those images will hit me,” said Mr. Hagel, whose 12 months as a soldier in Vietnam remain the defining period of his life, despite the subsequent years as both a senator and a cabinet secretary. “They’re going to make it all come back. ” For Mr. Obama, the trip to Vietnam offers an opportunity to help solidify not only his promised pivot of American policy toward Asia, but also to deepen economic and security ties with an increasingly important regional player. But for the United States’ Vietnam War veterans, a presidential trip to the country where many of them lost their youth, innocence and some of their closest friends is weighted with powerful emotions and   debates about that war’s consequences. “There are still a lot of ghosts around,” Mr. Hagel, 69, said in an interview. “There is still a great deal of debate about Vietnam and what it meant for this country. ” “It still haunts us,” he added. “That terrible waste of lives, and the lessons we learned there, the terrible lessons that still hang over us. ” Mr. Hagel said that every decision he made as defense secretary and every piece of advice he gave Mr. Obama was informed by his experience in Vietnam. He now finds himself thinking more and more about the year he spent there in the 1960s. And he said he is certain to closely study the pictures from Mr. Obama’s trip: the lush green background, the people and their iconic conical hats. One of the stumbling blocks between the two nations is the continuing belief by some in the United States that there may still be captive American soldiers held there, the kind of mythology that was fueled by 1980s movies like “Missing in Action” starring Chuck Norris and the “Rambo” series starring Sylvester Stallone. A black P. O. W. . I. A. flag still flies above the Capitol and state capitols around the country, and the military and many lawmakers choose to focus on the retrieval of the remains of dead service members as fulfilling those concerns. But some leaders of veterans organizations insisted in a meeting on Friday at the White House that Mr. Obama ask Vietnamese leaders whether there are living prisoners, according to Frank Francois III, the chief executive of Service Disabled Veteran Enterprises, who attended the meeting. “One of the questions that has to be asked is whether there is anybody in jail or captivity or someone living in the area we need to know about,” Mr. Francois said. For other veterans, Mr. Obama’s trip will serve as a welcome reminder to two generations of Americans who have come of age since the war’s end, illustrating that conflict’s importance to the United States. For these men, the ghosts of the war should not have been so easily laid to rest. “Vietnam is a totally forgotten issue nowadays,” said Bobby Muller, a disabled veteran and antiwar activist whose life helped inspire the 1978 movie “Coming Home,” starring Jane Fonda. “To have gone through those times and have something as huge and powerful and affecting and tragic in our lifetimes wind up nonexistent in the consciousness of the country today is stunning. ” Mr. Muller lives in Washington in an apartment that is filled with books on the war, and his anger at two wartime leaders  —   President Richard M. Nixon and his closest adviser, Henry Kissinger  —   remains undiminished. Mr. Obama is unlikely to focus as much on combat deaths during his trip as President Bill Clinton did when he visited in 2000. Mr. Clinton took the two sons of a missing airman, Lt. Col. Lawrence G. Evert, to a rice paddy in a tiny town 17 miles northeast of Hanoi and searched, along with scores of villagers, for the remnants of an     that had crashed in 1967. Remarkably, they found Colonel Evert’s bones. Mr. Obama is more likely to hail cooperation between the two countries to clean up the remnants of Agent Orange, one of the wartime issues still important to Vietnam. But as a president who came of age after the war ended, he is unlikely to be a symbol of healing of the psychological wounds that some veterans suffered upon returning home, when many of their countrymen disdained them for fighting there. “That lack of a welcome home is still a national shame,” said Senator John McCain, a Vietnam veteran who, because he was a prisoner of war, did receive a hero’s welcome. “You had   or    draftees who did their duties and were literally spat upon by their fellow citizenry when they returned. ” Mr. McCain said the country has learned that lesson, and service members and veterans are routinely celebrated at sporting events and public occasions nowadays. But for some veterans, Mr. Obama’s visit is likely to stir bitter memories of their rejection, he said. Mr. McCain, a Republican of Arizona, said his efforts to help normalize relations between Vietnam and the United States were among the proudest accomplishments of his life, and he said he had been to Vietnam so often since the war’s end that “I’m recognized more in the streets of Hanoi than I am in Phoenix. ” Those efforts long ago helped Mr. McCain put the worst of the war and his captivity behind him, so he is unlikely to be moved by the photos of Mr. Obama’s visits, he said. Mr. McCain said he had other ways of stirring his wartime memories. “To this day, I’ll get up real early sometimes and go down to the Vietnam Memorial just as the sun is coming up,” Mr. McCain said in an interview. “It’s always a great experience for me to think and remember. ”'"}, "time": 1742628581.3849616}