{"duration": 0.05614519119262695, "input_args": {"text": "\"Mosul residents storm Daesh-run jail, free dozens of inmates By Press TV on November 4, 2016 \\nIraqi families walk on a street in the village of Gogjali, on the eastern edge of Mosul, on November 4, 2016, as they flee Daesh terrorists in the northern city. \\nResidents of the Daesh-held Iraqi city of Mosul have managed to storm the city’s main prison and free dozens of inmates amid a major military operation by the Iraqi forces who are tightening the noose around the terror group holed up in the northern city. \\nIraq’s Arabic-language al-Sumaria satellite television network quoted an unnamed security source as saying that the Mosul residents on Friday evening broke into the city’s main prison, located in the eastern part of Mosul, and freed at least 45 prisoners after killing all of the Daesh militants manning the jail. \\nThe development comes as Iraqi army troops, backed by the country’s Hashd al-Shaabi forces, also known as the Popular Mobilization Units, and Kurdish Peshmerga forces, are closing in on Daesh’s last stronghold in Iraq from almost all directions in a full-scale operation launched on October 17 to liberate the city. \\nThe Iraqi troops managed to enter Mosul’s limits earlier this week for the first time since June 2014, when Daesh began its terror campaign in northern and western Iraq. So far, a large number of the city’s villages and districts have been purged of terrorists. Iraqi Prime Minister Haider al-Abadi has vowed that the country’s second largest city will be fully recaptured by year-end. An Iraqi army M1 Abrams tank drives through Gogjali as it heads to Mosul on November 4, 2016, during a military operation to retake the main hub city from Daesh terrorists. (Photo by AFP) \\n‘Daesh killing hundreds, recruiting children’ \\nMeanwhile, UN human rights spokeswoman Ravina Shamdasani has announced that the terrorists have executed hundreds of people, including 180 former Iraqi government employees who were killed on Wednesday as the Takfiri group was withdrawing from Gogjali town. \\nCiting “credible reports”, she added that the terrorists also executed 50 deserters at the Ghazlani military base in Mosul on Monday. \\nShamdasani, who was speaking on Friday at a regular UN briefing in Geneva, Switzerland, went on to say that Daesh had moved 1,600 people, likely to use them as human shields against airstrikes, from the town of Hammam al-Alil to Tal Afar near Mosul on Tuesday, and told them they might be taken to Syria. \\nShe also warned that Daesh was trying to recruit children, particularly boys above the age of nine, in Hammam al-Alil as the group was increasingly losing its adult terrorists in clashes with the Iraqi troops. \\n“They’ve been knocking on people’s doors and asking for their boys,” Shamdasani further said, adding that defiant families were threatened with harsh punishment. \\nThe UN official also said that Daesh was currently holding about 400 Kurdish, Izadi and Shia women in Tal Afar, and had possibly killed up to 200 people in Mosul. \\nOn Friday, the Iraqi special forces launched an assault to advance deeper into the city’s urban center, and engaged in fierce fighting with Daesh terrorists, estimated to number between 3,000 and 5,000 in the sprawling city. \\nIraqis fleeing Daesh reunite with families \\nIn another related development, Iraqi civilians fleeing Daesh in Mosul reunited with their families for the first time in more than two years at the al-Khazar camp, to the east of the city, on Friday. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Press TV on November 4, 2016, With 30 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742564162.2045803}