{"duration": 0.04616379737854004, "input_args": {"text": "'Hillary Clinton emails recently discovered on Anthony Weiner’s computer revealed, among other things, that as secretary of state, she helped Clinton Foundation donors. [Clinton aide and Weiner’s wife Huma Abedin connected State Department officials to a Russian cultural organization, per a request by Clinton Foundation donor, Eddie Trump (no relation to President Trump).  According to a May 10, 2010, email obtained and published by Judicial Watch, Abedin told Doug Band, a Bill Clinton aide who formerly headed the foundation, that she “hooked up” people who recommended Trump to the “right people” at the State Department. Trump had apparently recommended that Abedin connect Russian American Foundation Vice President Rina Kirshner with people at the State Department. Abedin wrote to Kirshner on Mon, May 10, 2010, at 9:41 PM, “Hi Rina  —   wanted to connect on meeting at state department. Eddie trump passed on your email. Will be in touch soon. ” Two days later, Kirshner wrote to Abedin, thanking her and telling her that a State Department official had invited her to be part of a “  Cultural   Group” the next week: From: Rina Kirshner, Sent: Wednesday, May 12, 2010 11:29 AM, To: Huma Abedin, Subject: Re: Eddie   Band, Ms. Abedin, Just wanted to follow up and express our gratitude. I was contacted today by Ms. Christina Miner who invited us to be part of the   Cultural   Group meeting next week. Thank you very much for all your assistance  —   if there is any way we can be of assistance, please do not hesitate to contact me. Sincerely, Rina Kirshner, Abedin then forwarded that email to Band, writing, “We hooked her up with the right people here”: From: Huma Abedin [Huma@clintonemail. com] Sent: Wednesday, May 12, 2010 12:19:12, To: Doug Band, Subject: FW: Eddie   Band, fyi  —   we hooked her up with the right people here, According to Judicial Watch, the Russia American Foundation was staffed by Clinton political supporters and operatives, received more than $260, 000 in grants for “public diplomacy” from the Clinton State Department, and its leadership was supportive of former President Barack Obama’s Russia policies. Another email, two days later, showed that Abedin forwarded Trump’s name and information for inclusion on the guest list for a State dinner, even though he missed the   time to RSVP, and only spouses, not guests, were allowed. “I thought people could bring spouses but not guests. But ill [sic] send,” Abedin wrote.'"}, "time": 1742563717.842305}