{"duration": 0.03156399726867676, "input_args": {"text": "'WASHINGTON, D. C. —  Sens. John McCain ( ) and Lisa Murkowski ( ) announced on the Senate floor Wednesday that they will not allow a filibuster of Neil Gorsuch, and will instead vote for the constitutional option to restore a   vote to confirm Supreme Court nominations, making that outcome now almost certain. [Earlier during the day Senate Majority Leader Mitch McConnell ( ) claimed that he had the 50 votes he needs —  plus Vice President Mike Pence as a   if needed —  to invoke the constitutional option and confirm President Donald Trump’s first Supreme Court nominee.  With his towering stature in the party, both in seniority and later as the 2008 presidential nominee, McCain was seen by some as the de facto chairman of the Gang of 14 effort in 2005 to save the option of filibustering judicial nominees in the future  —   but allowing through many of President George W. Bush’s nominees that were then being blocked by a Democratic filibuster. Ironically, that strategy’s architect was none other than Sen. Chuck Schumer ( ) who implemented it in 2003. “The unprecedented nature of the Democrats’ filibuster of a Supreme Court nominee has left me in a difficult position,” the Arizona senator lamented on the state of affairs in 2017, and after surveying years of past practice in Senate confirmations. “I’m left with no choice,” McCain declared. “I will vote to change the rules to allow Judge Gorsuch to be confirmed by a simple majority. ” “Elections have consequences,” McCain affirmed. In this case, that means electing a Republican president and a Republican majority in the Senate. For her part, Murkowski has long supported the Gang of 14, even though she had not been part of it in 2005, so she was another senator to watch in this unfolding historic drama. Speaking shortly before McCain, Murkowski made comments, then announced, “I will not acquiesce to an effort to deny Judge Gorsuch a seat on the Supreme Court. ” “I am left with the undeniable impression that Neil Gorsuch has been nominated to a position that he prepared his whole life to assume,” Murkowski continued. “He is not merely a good choice in my book, he’s the best choice  …     perhaps a justice of historic proportions. ” Ken Klukowski is senior legal editor for Breitbart News. Follow him on Twitter @kenklukowski.'"}, "time": 1742628524.5378094}