{"duration": 0.06381773948669434, "input_args": {"text": "'Pakistan This photo taken in Lahore on October 27, 2016 shows Pakistani protesters burning the Indian flag to show their support for the Kashmiri people. (Photo by AFP) \\nPakistan has declared an Indian diplomat persona non grata and given him 48 hours to leave the country, in a tit-for-tat move that comes a day after India said it would deport a Pakistani official. \\nPakistan\\'s Foreign Ministry said it had declared Indian diplomat Surjeet Singh persona non grata and that it had informed India’s diplomatic mission in Islamabad of the decision. \\nThe statement said Singh was accused of activities “that were in violation of the Vienna Convention and the established diplomatic norms.” \\nAn aide to India’s prime minister in New Delhi said the Indian government was looking into the matter. \\nThe decision came after India said on Thursday it had declared a Pakistani consular official persona non grata for “espionage activities” against New Delhi. \\nMehmood Akhtar, the visa official at the Pakistani mission, had been briefly detained by Indian police on Wednesday outside the gates to the Delhi Zoo where he met two Indian associates. \\nIndian police said the Pakistani diplomat and his alleged accomplices were found in possession of forged documents, defense-related maps, deployment charts and lists of officers working along India’s border with Pakistan. Kashmiris protesters shout anti-India slogans at a rally in Muzaffarabad, October 26, 2016. (Photo by AFP) \\nPakistan’s High Commission in New Delhi dismissed the allegation, saying it “never engages in any activity that is incompatible with its diplomatic status.” \\nRelations between India and Pakistan have been strained in recent months, with New Delhi blaming Islamabad for a raid on an army base in Indian-controlled Kashmir in September that killed 19 soldiers. \\nKashmir has been divided between India and Pakistan but claimed in full by both since the two countries gained independence from Britain in 1947. They have fought four wars with each other, three of which have been over Kashmir. \\n\\'Indian soldier, civilian killed in Kashmir\\' \\nAn Indian paramilitary officer claimed that Pakistani troops had opened fire along the volatile frontier in Indian-controlled Kashmir, killing a civilian and a soldier. Pakistan\\'s army denied the claim. \\nThe Indian officer, who spoke on condition of anonymity, said the Pakistani soldiers fired mortars and automatic gunfire at several border posts in Jammu region on Friday in an \"unprovoked\" violation of a ceasefire accord between India and Pakistan in the disputed region. \\nTroops from the two countries regularly trade fire, causing casualties. \\nOn Thursday, protesters in Kashmir and Pakistan observed the Black Day, demonstrating against what they called Indian occupation. Loading ...'"}, "time": 1742562019.8667324}