{"duration": 0.07957720756530762, "input_args": {"text": "'President Donald Trump tweeted his response to the protest in Washington, D. C. known as the “Women’s March on Washington. ”[Trump tweeted early Sunday morning:  Watched protests yesterday but was under the impression that we just had an election! Why didn’t these people vote? Celebs hurt cause badly.  —   Donald J. Trump (@realDonaldTrump) January 22, 2017,  Peaceful protests are a hallmark of our democracy. Even if I don’t always agree, I recognize the rights of people to express their views.  —   Donald J. Trump (@realDonaldTrump) January 22, 2017,  According to NBC News, a Trump administration official noted about the   “Women’s” March that   women who had asked to partner with the march were refused. “If you want to come to the march you are coming with the understanding that you respect a woman’s right to choose,” Linda Sarsour, a   Muslim racial justice and civil rights activist, and a chairwoman of the event, told the New York Times. “The organizers noted that their platform is   and they revoked partnership status’ from   groups,” the Trump official’s comment continued. The news report noted the official also commented, that it was a “shame” that the March for Life next Friday “will not get anywhere near the same amount of coverage that this march got —  and those   members were NOT welcome at the Women’s March. ” NBC added: The comment also called out Madonna, one of many celebrities to speak at marches across the country, for telling crowds that she had “thought an awful lot about blowing up the White House. ” “Comments like [Madonna’s] are absolutely unacceptable and had they been said about President Obama, the mainstream media would be in an uproar,” the official continued. “The Trump administration welcomes a robust discussion regarding the critical issues facing America’s women and families. ” Students for Life of America (SFLA) the nation’s largest organization of   youth attempted to partner with the march, but were told only   groups would be welcome, an action that ultimately revealed the main focus of the demonstration was to support abortion rights and fight the Trump administration’s promise to defund Planned Parenthood if it continues to perform abortions. SFLA crashed the march in Washington anyway, carrying a banner that read, “Abortion Betrays Women. ” The group posted on Facebook, “We will not sit by as Planned Parenthood, our nation’s abortion Goliath and a sponsor of this March, betrays women into thinking abortion is their only choice. ” The  president of the   youth group, Kristan Hawkins, also said in a statement that the Women’s March is “excluding the majority of American women who find abortion to be morally wrong and believe in protecting families, defending the marginalized, and achieving social justice. ” “Instead of a march to promote those worthy values and truly be inclusive, the event has turned into a rallying cry for the radical abortion industry to save their own baby: taxpayer funding of Planned Parenthood,” she added.'"}, "time": 1742561855.8988087}