{"duration": 0.02955794334411621, "input_args": {"text": "'Figures Long-gone Russian Empire: Small towns in colorful archive photos Sergey Prokudin-Gorsky was a Russian photographer best known for his pioneering work in color photography. In the early 20th century he traveled across the Russian Empire capturing small-town life. Scroll down to see more SERGEY PROKUDIN-GORSKY Sergey Prokudin-Gorsky was a Russian chemist and photographer. He is best known for his pioneering work in color photography. In 1890 Prokudin-Gorsky joined Russia\\'s photography section of the Imperial Russian Technical Society. / Avraamiev Monastery in the city of Smolensk. SERGEY PROKUDIN-GORSKY In 1901, Prokudin-Gorsky established a photography studio and laboratory in Saint Petersburg. Throughout the years, Prokudin-Gorsky\\'s photographic work, publications and slide shows to other scientists and photographers in Russia, Germany and France earned him praise. / View of Volga river and Zytsov city. SERGEY PROKUDIN-GORSKY The Tsar Nicholas II enjoyed the color photos, and, with his blessing, Prokudin-Gorsky got the permission and funding to document Russia in color. / Dormition Cathedral, Smolensk. SERGEY PROKUDIN-GORSKY In long journeys around the country, carried out from 1905-1909, Prokudin-Gorsky captured on film the patriarchal Russian life. / Nikolskye gates in the city of Smolensk. Sergey Prokudin-Gorsky In the course of ten years, Sergey Prokudin-Gorsky was to make a collection of 10,000 photos. / Trinity Cathedral in Torzhok. SERGEY PROKUDIN-GORSKY Thanks to him, we have unique colour portraits of Tolstoy, Chekhov and Shalyapin, his pictures of young Russian peasants, the Emir of Bukhara, sailors from the steamship “Sheksna”, factory workers are widely known. / Nilov Monastery situated on a Stolobny Island in the Tver Oblast of Russia. SERGEY PROKUDIN-GORSKY As a result of unique technology, the images have survived in modern standards of quality and original, wonderfully saturated colours. / Bogomaterinskaya church. SERGEY PROKUDIN-GORSKY His ultimate goal was to educate the schoolchildren of Russia with his \"optical color projections\" of the vast history, culture, and modernization of the Empire. / View of city of Staritsa. SERGEY PROKUDIN-GORSKY After the October Revolution, Prokudin-Gorsky was appointed to a new professorship under the new regime, but he left Soviet Russia in August 1918. / View of Tver and Volga river. SERGEY PROKUDIN-GORSKY Upon leaving the country, about half of his photos were confiscated by Russian authorities for containing material that seemed to be strategically sensitive for war-time Russia. / Torzhok city. Sergei Prokedin-Gorsky Sergey Prokudin-Gorsky finally settled in Paris in 1922. He died in died on September 27, 1944 at the age of 81. / View on Borisoglebsky Monastery, Torzhok. Facebook'"}, "time": 1742564172.985473}