{"duration": 0.09621667861938477, "input_args": {"text": "\"Email \\nRepublican presidential candidate Donald Trump has been criticized for his response as to whether he’d accept 2016 election results. His exact words: “I’ll keep you in suspense.” Several pundits think that statement cost him the election. But read more broadly, the way the subliminal mind does, and his response was brilliant, revealing his astute instincts emanating from the newly discovered unconscious super intelligence (which we all possess). \\nHis word “suspense” implies an unfolding drama. Indeed, the depth of this drama is immeasurable. But Trump’s telling America a secret story. \\nHis story is told through his super intelligence which quick reads situations before telling what it perceives between the lines. Trump’s super-intel is naturally attuned to other persons’ subconscious confessions. They do so in the symbolic language of “protests too much” denial and “log in your eye” projection along with other key imagery. \\nHis super-intel quick reads Hillary Clinton and the media and conveys his response indirectly in code. \\nThere’s far more to the media’s insistence that Trump was violating rules by not accepting election results. The media asked, “Are you going to play by the rules of prior presidential candidates?” But the big picture behind this election focuses on presidents playing by the rules, specifically the rule of law. \\nUnconsciously, Trump’s answer implied that the candidacy of his Democratic opponent, Hillary Clinton, raises serious rule of law questions. \\nFor two weeks the media harangued Trump complaining he’d not played by society’s accepted rules of sexual conduct. That criticism continued while they ignored Hillary’s longtime enabling of her husband’s abusive sexual behavior and her documented harassment of his victims as well as her own sexual escapades. The media wanted to turn this sexual matter into the central rule of law issue while a far more important rule of law issue regarding the nation’s foundation still sits on the table. \\nAs Roger L. Simon of pjmedia.com wrote on March 23, 2016, “The very backbone of our country was the rule of law. Without [it]… America as we know it does not exist.” Simon declared Americans must be convinced that the FBI investigation of Hillary Clinton’s email matter was handled justly and that Obama dare not interfere. Neither condition was satisfied. Obama avowed long before the Department of Justice ruled that Hillary was innocent. \\nThen FBI Director James Comey in July 2016 detailed many of Hillary’s rule of law violations and in a denial confession—reading through his “protests too much”—revealed she should have been prosecuted although Comey lacked the courage to see it through. (On October 28 th under pressure from newly discovered emails he reopened the investigation.) \\nAs Simon warned, Democrats nominated an illegal candidate who should have been tried for breaking the law. Trump reiterated that Hillary shouldn’t have been allowed to run. \\nTrump also reading Obama’s law-breaking Yet there’s a deeper, far more powerful story Trump unconsciously hints at —one which terrifies Democrats and the entire political class. \\nTrump demonstrates his subtle super-intel instincts. He’s far ahead of the media’s conscious take. Deep down, Trump focused on Barack Obama who facilitated Hillary Clinton’s violation of the law in her email scandal. \\nTrump alludes to a far more significant rule of law issue. His super-intel continues asking the greatest question regarding the legality of any presidential election in U.S. history: the question of Obama’s citizenship in 2008 and 2012. \\nFrom 2008 to 2015, Donald Trump stood strong, demonstrating presidential-type leadership by insisting on respect for the Constitution. He questioned Obama’s failure to produce evidence of legal U.S. citizenship. When Obama produced his alleged birth certificate under pressure in 2011, Trump was aware that Sheriff Joe Arpaio’s panel of document examiners declared it a phony . \\nThe media buried the issue. Reporters abused millions of Americans, including Trump, by labeling them racist conspiracy theorists—a basic projection reflecting that the PC media was itself “enabling the Obama conspiracy” at the expense of our Constitution. \\nDon’t believe Trump’s no longer a birther. Only recently, to avoid media harassment, did he claim that he accepted Obama’s U.S. citizenship. But besides the birth issue, Trump saw that Obama continually functioned as an illegal president . To America’s detriment he repeatedly violated laws on a whim, for example by ignoring immigration laws. \\nWhen Obama continually neglected to protect America’s national security, Trump confronted him. Trump recognized Obama had increasingly enabled Islamic terrorists while simultaneously building up terrorist Iran, even giving them a nuclear bomb on a layaway plan and cash money to boot. \\nFollowing the June 11, 2016 Orlando massacre perpetrated by an Islamic terrorist, Trump confronted Obama, observing that Obama wouldn’t identify the enemy—call them by their name, “Islamic terrorists”—and Trump suggested Obama unconsciously knew the many reasons he should resign the presidency. \\nOn the surface, Obama became enraged, but unconsciously Trump elicited from Obama the most shocking confession imaginable. Secretly Obama wants the truth known. \\nOn the heels of Trump’s challenge, Obama explained between the lines of two speeches on June 12 and 14, that he was truly a mind-controlled Stockholm Syndrome prisoner of radical Islam, programmed at an early age in his own home. \\nThe decoded details are described in my book, The Stockholm Syndrome President, How Trump Triggered Obama’s Hidden Confession . \\nAs he intuitively put together the story of his life, Obama learned the horrifying family secret that his Muslim father had wanted him aborted. \\n(My scientific forensic profiling approach confirmed that Obama’s super-intel imagery pointed toward a near abortion which matched his life’s circumstances including a promiscuous 17 year-old mother unexpectedly pregnant from a casual affair.) \\nHis father had also emotionally “killed him” by abandoning him. Obama felt that pain on a daily basis, and then he learned that his father physically abused his mother and two later wives in Kenya. \\nThe near-death by abortion and constant death experience at the hands of his anti-American Muslim father became fixated in Obama’s mind. He became frozen in terror—suffering a deep early-childhood trauma—terrified that his father would kill him at any moment. \\nWhen he was a child, his father was radical Islam to him—both one and the same. To stay alive Obama became an unconscious Stockholm Syndrome victim controlled by Islam—explaining his repeated capitulations to them as president and his curious refusal to use that term. \\nObama’s Stockholm Syndrome remains buried deep in his psyche. Only his unconscious super-intel can tell his story in its psycholinguistic language. In his recent speeches, he unknowingly confessed in key images such as “doing the terrorists’ work for them” or key denials “then the terrorists would win. I’m not going to let that happen.” \\nBut Obama further confessed in his June 14 speech, that he was programmed as “a radical Islam mole” to carry out a major robbery from America— first by stealing the rule of law and running as an illegal president. \\nIn fact, Obama has robbed America in many ways: economically with massive debt and hampering business; robbed us of our borders with massive illegal immigration; of gains in racial harmony; of safe communities, of police safety, of inner city safety, of affordable health care, of military power and of our world leadership role. All the while his policies have strengthened terrorist Iran and radical Islam. \\nNow return to Trump’s threatened refusal to accept the election results. Consider his brilliant super-intel message to the media: “You keep America in suspense about how you avoid the rule of law both with Hillary Clinton and especially Obama, and I will keep you in suspense as to what I’ll do about it.” \\nConsciously Trump may not yet fully appreciate his deeper plans, but he hints at them strongly. \\nIf Trump wins he could appoint a special committee of document examiners to study Obama’s birth certificate. As Obama and Clinton have reversed themselves on gay marriage, Trump could simply change his mind about the need to clarify Obama’s birthplace. \\nBut if Trump loses he could still rise to the occasion by putting rule of law money behind a renewed investigation. He could potentially mobilize an abused citizenry. Rule of law Americans could demand Congress take action and legally obtain Obama’s birth records—as Obama himself, the traumatized child, has unconsciously encouraged. Obama’s super-intel, like Trump’s and all others, fully espouses the rule of law. And the need for America to re-embrace its moral compass is the most significant story of the election of 2016. Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares\""}, "time": 1742628379.57115}