{"duration": 0.042739152908325195, "input_args": {"text": "'Comments \\nIt’s another smoking gun in the North Carolina Republican Party’s fight against minority voting rights, which has now moved from the statehouse , into the courthouse and finally into election supervisory boards where newly leaked public records emails prove that the GOP’s policies of racism are overtly aimed at a white’s-only vote at the ballot box. \\nA North Carolina Republican elections board supervisor closed down Sunday early voting specifically to appease their GOP bosses, who argued that too many African-American voters would vote together in traditional “souls to the polls” events. \\nThis completely incontrovertible finding is sure to draw a swift reaction from the Department Of Justice’s Civil Rights Division and hopefully renewed coverage under the Voting Rights Act. Of course, they won’t announce anything about their investigation during the 60-days before voting finishes on November 8th. Reuters broke the news : \\nBill McAnulty, an elections board chairman in a mostly white North Carolina county, agreed in July to open a Sunday voting site where black church members could cast ballots after services, the reaction was swift: he was labeled a traitor by his fellow Republicans. \\n“I became a villain, quite frankly,” recalled McAnulty at a state board of elections meeting in September that had been called to resolve disputes over early voting plans. “I got accused of being a traitor and everything else by the Republican Party,” McAnulty said. \\nFollowing the blowback from Republicans, McAnulty later withdrew his support for the Sunday site. In an interview with Reuters, he said he ultimately ruled against opening the Sunday voting site in Randolph County because he had “ made a mistake in reading the wishes of the voters .” He declined to discuss the episode further. \\nNorth Carolina Republicans can’t win with ideas, so it appears that they have completely given up on democracy for the sake of winning. Politics isn’t just a popularity contest; our electoral system is rooted in the sacred covenant that everyone has a voice in how our country is run. \\nAs usual, the Republican voter suppression squad turned to the old trope of “wasteful and unnecessary” spending as the illegitimate justification to try and suppress minority votes. \\nIn two emails, on Aug. 11 and Aug. 14, Woodhouse urged Republicans serving on county election boards to follow the “party line” on curtailing the early voting period. “Many of our folks are angry and opposed to Sunday voting,” he wrote. “Six days of voting in one week is enough. Period.” Keeping polling sites open for the full 17-day early voting period “ may be wasteful and unnecessary ,” he added. \\nThe North Carolina Republican Party and its elected officials have set the gold standard for racially-driven dirty politics, and they’re not even slightly afraid to banter with each other openly about it. \\nFortunately, the Democratic Party fought back and while they could not prevent every instance of voter suppression, it has resulted in more early voting access rather than the GOP’s plan of less. \\n“Those who wanted to suppress the vote, they’re going to fail,” he said at University of North Carolina-Chapel Hill in Raleigh. “Right now, there are more one-stop early vote sites in North Carolina than ever before.” \\nWith only five days remaining in the race, North Carolina poll averages show a dead heat between Democrats and their vote suppressing opponents in the Republican party in the presidential race. \\nIf you witness voter suppression at the polls, don’t hesitate to call 866-OUR-VOTE.'"}, "time": 1742563562.9519312}