{"duration": 0.10607719421386719, "input_args": {"text": "'«L’arte della guerra»\\nCome votare No alle armi nucleari di Manlio Dinucci Rete Voltaire | Roma (Italia) | 2 novembre 2016 français «Grazie, presidente Obama. L’Italia proseguirà con grande determinazione l’impegno per la sicurezza nucleare»: così scriveva il premier Renzi in uno storico messaggio twitter. Sei mesi dopo, alle Nazioni Unite, Renzi ha votato Sì alle armi nucleari. Accodandosi agli Usa, il governo italiano si è schierato contro la Risoluzione, approvata a grande maggioranza nel primo comitato dell’Assemblea generale, che chiede la convocazione nel 2017 di una conferenza delle Nazioni Unite al fine di «negoziare uno strumento legalmente vincolante per proibire le armi nucleari, che porti verso la loro totale eliminazione».\\nIl governo italiano si è così rimangiato quanto promesso alla Conferenza di Vienna, due anni fa, ai movimenti antinucleari «esigenti», assicurandoli sulla sua volontà di operare per il disarmo nucleare svolgendo un «ruolo di mediazione con pazienza e diplomazia». Cade così nel vuoto l’appello « Esigiamo il disarmo nucleare totale », in cui si chiede al governo «la prosecuzione coerente dell’impegno e della lotta per la messa al bando delle armi nucleari», in un percorso «umanitario e giuridico verso il disarmo nucleare», nel quale l’Italia potrebbe svolgere «un ruolo più che attivo, possibilmente trainante».\\nCadono di conseguenza nel vuoto anche le mozioni parlamentari dello stesso tenore. Gli appelli generici al disarmo nucleare sono facilmente strumentalizzabili: basti pensare che il presidente Usa, artefice di un riarmo nucleare da 1000 miliardi di dollari, è stato insignito del Premio Nobel per la Pace per «la sua visione di un mondo libero dalle armi nucleari».\\nIl modo concreto attraverso cui in Italia possiamo contribuire all’obiettivo del disarmo nucleare, enunciato nella Risoluzione delle Nazioni Unite, è quello di liberare il nostro paese dalle armi nucleari statunitensi. A tal fine occorre non appellarsi al governo, ma esigere che esso rispetti il Trattato di non-proliferazione (Tnp), firmato e ratificato dall’Italia, che all’Art. 2 stabilisce: «Ciascuno degli Stati militarmente non nucleari, che sia Parte del Trattato, si impegna a non ricevere da chicchessia armi nucleari o altri congegni nucleari esplosivi, né il controllo su tali armi e congegni esplosivi, direttamente o indirettamente». Si deve esigere che l’Italia cessi di violare il Tnp e chieda agli Stati uniti di rimuovere subito tutte le loro armi nucleari dal nostro territorio e di non installarvi le nuove bombe B61-12, punta di lancia della escalation nucleare Usa/Nato contro la Russia, né altre armi nucleari. Si deve esigere che piloti italiani non vengano più addestrati all’uso di armi nucleari sotto comando Usa.\\nÈ questo l’obiettivo della campagna lanciata dal Comitato No Guerra No Nato e altri soggetti (per documentarsi digitare su Google «Change Nato»). La campagna ha ottenuto un primo importante risultato: il 26 ottobre, al Consiglio Regionale della Toscana, è stata approvata a maggiornza una mozione del gruppo Sì Toscana a Sinistra che «impegna la Giunta a richiedere al Governo di rispettare il Trattato di non-proliferazione delle armi nucleari e far sì che gli Stati uniti rimuovano immediatamente qualsiasi arma nucleare dal territorio italiano e rinuncino a installarvi le nuove bombe B61-12 e altre armi nucleari». Attraverso queste e altre iniziative si può creare un vasto fronte che, con una forte mobilitazione, imponga al governo il rispetto del Trattato di non-proliferazione.\\nSei mesi fa chiedevamo dalle pagine del manifesto se ci fosse qualcuno in Parlamento disposto a esigere, in base al Tnp, l’immediata rimozione dall’Italia delle armi nucleari statunitensi. Siamo ancora in attesa di risposta.\\nManlio Dinucci Fonte\\nIl Manifesto (Italia)'"}, "time": 1742563609.813282}