{"duration": 0.06342601776123047, "input_args": {"text": "'Be Sociable, Share! Rasmea Odeh smiles after leaving federal court in Detroit Thursday, March 12, 2015. \\nDETROIT — A federal hearing on Nov. 29 could determine whether the details of Israel’s torture of Palestinian prisoners will be aired in an American courtroom. \\nRasmea Odeh, a 69-year-old leader of Chicago’s Palestinian-American community, is appealing her 2014 conviction on charges of unlawful procurement of naturalization. \\nIf her conviction is upheld, she faces the loss of her U.S. citizenship and 18 months in a federal prison, followed by deportation. \\nProsecutors charge that Odeh, associate director of the Arab American Action Network, failed to disclose her 1970 conviction by an Israeli military military court when applying for U.S. citizenship. \\nHer supporters say Odeh’s Israeli military prosecutors used a confession obtained through torture, and that her resulting post-traumatic stress disorder caused her to avoid the memory of her interrogation and omit the experience from her application form. \\n“When the appellate court ruled in Rasmea’s favor back in February of this year, the defense committee declared an important victory, because that decision essentially stated that Judge Gershwin Drain wrongfully barred Dr. Fabri from testifying at the trial,” Hatem Abudayyeh, a U.S. Palestinian Community Network national coordinating committee member and spokesperson for the Rasmea Defense Committee, told MintPress News. \\nIn February, the 6th Circuit Court of Appeals ruled that District Judge Gershwin Drain had erroneously excluded expert testimony by Dr. Mary Fabri, an authority on torture and former clinical psychologist at the Kovler Center for the Treatment of Survivors of Torture, from Odeh’s initial trial, while accepting at face value the confession used by Israeli military prosecutors in 1969. \\nOn Nov. 29, a Daubert hearing, held to determine the admissibility of expert testimony, will consider the validity of Fabri’s diagnosis for Odeh’s defense, Abudayyeh said. \\n“Fabri’s testimony will be all about Rasmea’s PTSD and the torture she survived, so if the conclusion of the Daubert hearing is that her testimony is admissible, then we suspect that the torture (and the rest of Israel’s crimes against Rasmea) will make it into a new trial.” \\n‘So that they would leave my father alone’ \\nIn 1969, when Odeh was 21 years old, she was captured by Israeli soldiers during a nighttime raid on her Ramallah home, one of over 500 mostly young Palestinians swept up by occupying forces in the aftermath of the deadly bombing of a Jerusalem supermarket. \\nThe following year, an Israeli military court convicted Odeh of the bombing, as well as a subsequent blast at the British consulate in Jerusalem. \\nIn the meantime, she and her supporters say, Odeh had experienced the worst torture tactics Israeli prisons have to offer. \\n“They beat me with sticks, plastic sticks, and with a metal bar,” Odeh told a United Nations committee in Geneva after her release in a 1979 prisoner exchange between Israel and the Popular Front for the Liberation of Palestine – General Command. \\n“They beat me on the head and I fainted as a result of these beatings. They woke me up several times by throwing cold water in my face and then started all over again.” \\nHer interrogators’ torture focused on sexual violence and humiliation. They “tried to introduce a stick to break my maidenhead,” Odeh said, and “tied my legs, which were spread-eagled, and they started to beat me with their hands and also with cudgels.” \\nAt another point, she said, they “tore my clothes off me while my hands were still tied behind my back. They threw me to the ground completely naked and the room was full of a dozen or so interrogators and soldiers who looked at me and laughed sarcastically as if they were looking at a comedy or a film. Obviously they started touching my body.” \\nBut it took the detention of her father, a U.S. citizen, to compel the confession which would lead to her conviction. After “they brought in my father and tried to force him under blows to take off his clothes and have sexual relations with me,” Odeh said, she feared he “might lose his life from one moment to the next” and decided “to make the confession that they wanted, so that they would leave my father alone.” \\nAfter 45 days, Odeh said, she told her interrogators what they wanted to hear. Taking her to the site of the supermarket bombing, they “asked me to point out where I had put the explosive. Of course, I didn’t know the place and I said ‘where exactly do you want me to show you where I put this explosive charge?’ So they showed me where the explosion had taken place and I actually pointed out that place without being able to give any details of the operation.” \\n‘Why we believe we will win’ Protesters rally for Rasmea Odeh outside federal court in Detroit Thursday, March 12, 2015. \\nDrain’s admission of Odeh’s conviction, while excluding expert testimony on its circumstances, should nullify her conviction and offer grounds for a new trial, her supporters say. \\n“It is patently unfair, as we have stated many times, that the judge would allow a ‘confession’ from a foreign court, especially one that was gained by vicious torture and sexual assault, into the Detroit courthouse,” Abudayyeh said. \\n“The fact that he allowed this into evidence without giving Rasmea the opportunity to challenge the ‘confession,’ or talk about the torture, is the essence of the case, and why we believe we will win once the truth comes out.” \\nMeanwhile, Odeh faces hours of intensive examination by a government psychologist, which her defense teams says could subject her to further mental harm . \\n“Right now the government is seeking to carry out up to 18 hours of a mental examination by a government expert whose identity they will not disclose to the defense in order to debunk her PTSD claim and accuse her of malingering,” attorney Michael Deutsch, the head of Odeh’s defense team, told MintPress. \\nUltimately, he said, the process could result in a new trial which would explore the details of Odeh’s torture and its psychological effects. \\n“If the expert’s testimony is deemed admissible, we will have a new trial in which PTSD will be testified to as well as the specifics of the torture she endured.” \\nAnd that, Abudayyeh said, could further expose Israel’s repression of Palestinians while dealing a powerful blow to its support by the U.S. government. \\n“We have said repeatedly that this case is also an indictment of Israel,” he said, adding: “Our mobilizations and organizing around the case have pulled together people from all different sectors and communities to not only defend and support Rasmea, but to expose Israel’s torture, occupation, colonization, and apartheid policies. A victory in this case for Rasmea will be a huge victory for Palestine and Palestine liberation as well.” Be Sociable, Share!'"}, "time": 1742628478.4395635}