{"duration": 0.09490108489990234, "input_args": {"text": "'YouTube has restored the official channel for conservative blog Legal Insurrection following coverage from Breitbart News and a number of other media outlets. [The YouTube channel was originally removed “based on excerpts of audio of   and   speakers at the MLA Annual Meeting,” which Legal Insurrection covered —   exposing a number of individuals who wanted to lead a boycott against Israel.  In response to the coverage, the MLA filed a copyright claim against the audio of speakers recorded during the meeting, and Legal Insurrection’s channel was suspended. However, the site claims that they never received a warning or a copyright strike prior to the channel’s removal. Copyright infringements are usually sanctioned with a single strike, cautioning the channel against any further incidents. YouTube opts to remove a channel after three strikes. “While I’m glad our YouTube channel is restored, the fact remains that we were removed without any prior notice or chance to defend ourselves against what we believe are unjustified copyright claims,” said Legal Insurrection Founder William Jacobson. “We intend to fight the copyright claims if they are pursued in court. ” “It is highly questionable that MLA owns the copyright for oral presentations at the Annual Meeting, and even if it did, the limited excerpts we used from the nearly   video posted by MLA on YouTube are   fair use,” declared Legal Insurrection in a blog post last week. “What I think is really going on here is that   activists at MLA complained to MLA that MLA had posted the audio on YouTube. MLA took down its own   video and now seeks to silence our reporting. ” YouTube has previously censored conservative channels on their site, most notably targeting PragerU’s educational videos. Last year, YouTube placed some of PragerU’s videos on “restricted mode,” a mode designed to stop children from viewing inappropriate adult content. Videos covering topics such as whether George Bush lied about the Iraq War, the university “diversity scam,” and whether Sharia Law and freedom can coexist were all placed on restricted mode —   meaning the videos couldn’t be watched at schools, libraries, or on computers with parental blocks. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562191.7991765}