{"duration": 0.09668755531311035, "input_args": {"text": "'Sanders’ Democrats Call for Change November 14, 2016 \\nThe fallout from the imploded Hillary Clinton campaign is prompting demands from Democratic progressives for an immediate change at the top, in this case the resignation of interim DNC chairperson Donna Brazile, says Norman Solomon. \\nBy Norman Solomon \\nIt’s time for Donna Brazile to go. Like Debbie Wasserman Schultz before her, Brazile has lost credibility as an honest broker at the Democratic National Committee. The DNC chair should be evenhanded — but, thanks to leaked emails , Brazile’s cover is blown. \\nAt the same time that Brazile was publicly claiming to be neutral in the fierce Clinton-Sanders primary battle, she was using her job as a CNN political analyst to give the Clinton campaign advance notice of questions that would be asked during a CNN debate between the two candidates. Donna Brazile, interim Democratic Party chairperson. \\nYet Brazile seems tone deaf about her integrity breach — just as the Democratic Party establishment has been tone deaf about the corrosive effects of servicing Wall Street and wealthy contributors. \\nAs the Washington Post reported a week ago , “Donna Brazile is not apologizing for leaking CNN debate questions and topics to the Hillary Clinton campaign during the Democratic primary. Her only regret, it seems, is that she got caught.” \\nConsider Brazile’s response after the email hack exposed the chasm between her public claims of being evenhanded and her furtive effort to help Clinton gain an improper debate advantage over Sanders. “My conscience, as an activist, as a strategist — my conscience is very clear,” Brazile said in a radio interview , adding that “if I had to do it all over again, I would know a hell of a lot more about cybersecurity.” \\nBut the current DNC chair’s lack of encryption knowledge is hardly the problem. Brazile has functioned as a shameless cog in the Clinton political machine. That machine hasn’t just broken down; it is now kaput. \\nIn the wake of Donald Trump ’s victory, the DNC must undergo a far-reaching shakeup. And — with no time to waste — we can’t wait several months until Brazile’s planned departure from the DNC chair job in March. \\nThat’s why several hundred activists who were Bernie Sanders delegates to the Democratic National Convention just voted to “call for the immediate resignation of Donna Brazile as chair of the Democratic National Committee.” \\nA lopsided tally came in over the weekend, with 96 percent — 337 to 13 — in favor of pushing for Brazile to resign. The straw poll was conducted by the Bernie Delegates Network (which I coordinate), an independent group sponsored by the online activist organization RootsAction.org in partnership with Progressive Democrats of America. \\n“The DNC must either change or it will die,” says PDA executive director Donna Smith. “And that change starts with Ms. Brazile’s prompt resignation.” \\nRootsAction has launched a nationwide petition campaign calling for Brazile to resign immediately. \\nA Symbol and Symptom \\nBrazile’s duplicitous behavior is a symbol and symptom of the Democratic Party leadership — which remains unwilling to admit that its chronic alignment with Wall Street, big banks and harmful trade deals has been key to sagging electoral fortunes. Bernie Sanders supporters rally in Washington D.C. on June 9, 2016. (Photo credit: Chelsea Gilmour) \\nThe national Democratic Party has long been in the grip of those who assume that following along Wall Street — with minor quibbles and facile populist rhetoric — is the pathway to the White House. That claim has now been thoroughly discredited, as election returns from the Rust Belt attest. \\nThe old guard at the DNC should not be allowed to hang on. Despite all the pseudo-populist gestures, Donna Brazile and her Clinton Inc. allies can be expected to do little more than tinker with corporate-fueled DNC machinery that is long overdue for the junk heap. \\nThe Democratic National Committee is now a relic of mechanisms spinning toward oligarchy. Every day that goes by with the old leadership in place is a day wasted for the essential work to come. \\nNorman Solomon was a Sanders delegate from California to the Democratic National Convention. He is co-founder of the online activist group RootsAction.org, which has 730,000 members. Solomon is executive director of the Institute for Public Accuracy. [This article originally appeared at The Hill, http://thehill.com/blogs/pundits-blog/presidential-campaign/305831-for-the-good-of-the-party-its-time-for-donna-brazile ]'"}, "time": 1742564223.3380153}