{"duration": 0.03443598747253418, "input_args": {"text": "'\\nThe impact of the Syrian refugee crisis has been felt worldwide. \\nWhile it has helped make immigration a central issue in the U.S. presidential elections, one of the most affected countries has been Germany — with Pew noting that the nation received “442,000 asylum applications in 2015 alone.” \\nNow, a report has emerged from Germany that just one of these immigrants is claiming nearly $400,000 in benefits from the government, due to the fact that he arrived in the country with his four wives... and 23 children. Europe going mad: Syrian refugee in Germany claiming benefits for his 4 wives and 22 children. https://t.co/Cmcn550fym — Michael Heaver (@Michael_Heaver) October 26, 2016 \\nThe man — who has been identified only as Ghazia A. — is allowed to have multiple wives under Muslim tradition, but only if he can support them financially. \\nUpon emigrating to Germany, where polygamy is not officially permitted but officials have been \\'looking the other way,\\' Ghazia was forced to choose just one of his four wives as his “main” wife. \\nHe then split up his 22 children — one has since married and moved to Saudi Arabia — among the other three. These family members were placed in neighboring homes, some up to 31 miles away. \\nGhazia explained to German newspaper Das Bild how his wide-ranging family responsibilities have left him unable to work: \\n\"According to our religion I have the duty to visit each family equally and not to prioritize any of them. \\nI am practically always on my way to be with my family — yet I would gladly like to work.\" \\nNoting that “regardless of how one evaluates facts morally, it is never wrong to know the hard numbers,” one German financial manager calculated the state benefits Ghazia would receive for his massive family. \\nAccording to his estimate , it comes out to roughly $390,000 per year in U.S. dollars. Germany: Syrian Refugee with 4 Wives and 23 Children Claims £320,000 a year in benefits https://t.co/lU2ED6dSn9 — Bill Mitchell (@mitchellvii) October 26, 2016 \\nWhile much of the criticism surrounding America\\'s acceptance of refugees has centered on concerns of terrorism , similar cultural clashes have also been seen in the U.S. \\nIn August, one refugee family brought a lawsuit against the Pennsylvania school they were placed in, arguing it\\'s not the school they “deserved.” Lawsuit: Expert calls pace at Phoenix Academy ‘totally inappropriate’ for refugee students https://t.co/8AW75hF7tY #LNPinsider #FridayReads — LancasterOnline.com (@LancasterOnline) August 19, 2016 \\nOther, larger concerns have also emerged about the potential culture clash that could come as a result of accepting huge numbers of refugees, particularly involving women. \\nSome have argued that the “brutal ideology in Muslim majority countries” that many refugees were raised to practice places women in Western countries at risk of both sexual assault and violence. \\nIn September, German Chancellor Angela Merkel admitted that she had lost control of her “open-door” refugee policy, even expressing that she would “turn back time” if she could. \\nWith Ghazia\\'s case representing just one situation causing backlash from her citizens, it\\'s not difficult to see why. '"}, "time": 1742628312.4769182}