{"duration": 0.36571311950683594, "input_args": {"text": "'This post was originally published on this site \\nHaving soared to fresh 13 year highs in a quiet overnight session on thin liquidity due to the US Thanksgiving holiday, which sent the USDJPY just shy of 114 and the Yuan to 6.96, the dollar pared back its weekly advance with modest profit taking after traders wondered if the rally has gotten “too stretched.” European shares were fractionally higher, with Asian stocks and US equity futures rising and both the Dow Jones and the S&P set for new all time highs. Oil followed the USD lower, down fractionally ahead of next week’s OPEC meeting where negotiations now focus on whether non-OPEC led by Russia nations will cut or freeze. \\nWith the US offline yesterday, American markets are set for another early close on Black Friday: U.S. equity markets close at 1pm, bond markets close at 2pm. \\nThe Bloomberg Dollar Spot Index fell from the highest level in more than a decade, while emerging-market currencies clawed back gains after India’s rupee and Turkey’s lira fell to record lows on Thursday. U.S. equity-index futures signaled stocks will edge higher as trading resumes following the Thanksgiving holiday. European shares were little changed, oil pared a weekly gain and Treasuries fell. \\nThe recurring story every day since Trump’s election is that as a result of the upcoming debt-funded fiscal stimulus, inflation is poised to jump which in turn has fueled a surge in bets on Federal Reserve rate hikes, propelling the greenback higher against all but two of it peers this month. Traders see an increase in borrowing costs in December as a certainty, while the odds of additional moves by June have risen to more than 60 percent, according to futures data tracked by Bloomberg . \\nAs shown virtually every day on these pages, the “Trumpflation” bet on global reflation has sent the USD soaring, while slamming EM currencies, fading the prospect of future rate cuts by these economies, while industrial metals like copper continue to soar. \\nExpectations of rises in U.S. inflation and interest rates have driven the greenback to a gain of more than 6 percent in October and November combined, its strongest performance over a similar period since its rally in early 2015 . Most investors expect those gains to continue, but a combination of the Thanksgiving break in the United States, market participants’ need to process corporate flows at the end of the month and a raft of risks in the first half of December all speak for cashing in some of those gains now. \\n“The dollar bull run had perhaps become a little stretched,” said Lee Hardman, a currency strategist at Bank of Tokyo-Mitsubishi UFJ Ltd. in London. “We’ve had a very strong run since the election and it’s just a bit of a pull back.” \\nIt is Black Friday in the US, and the National Retail Federation projects that about 137.4 million consumers will make purchases in stores or online over the four-day weekend that starts on Thanksgiving, marking the kickoff to the holiday shopping season. U.S. retail spending is expected to rise 3.6% to $655.8 billion in November and December, the Washington-based NRF estimates. Retailers are poised to take full advantage of the Thanksgiving holiday period, now known by some as Black Week, which accounts for about 15 percent of holiday spending, according to the trade group. However, the amount Americans have spent has declined in the last three years, slipping 26 percent from 2013 to an average of $299.60 per person last year, according to the trade group, so there are risks. \\nThis holiday season is expected be better for retailers with unemployment, gasoline prices and inflation low, while wages, home values and the stock market continue to rise. Companies such as Kohl’s Corp., Gap Inc. and Barnes & Noble Inc. have said the U.S. presidential election was a major cause of consumers’ recent reluctance to open their wallets. With the outcome settled, they’re expecting the dollars to finally flow. “We’ve had some, we believe, pent-up demand — just based on the economics of our consumer,” J.C. Penney Co. Chief Executive Officer Marvin Ellison said in an interview this month. “We’re anticipating we’ll see pent-up demand released, and it being post-election will only help that.” \\nAs the following chart of retail stock performance shows, the market is as optimistic as the retailers coming into Black Friday. \\nThe MSCI world equity index, which tracks shares in 46 countries, was up 0.2% in early European trading and headed to close the week around 1 percent higher. In Asia, MSCI’s broadest index of Asia-Pacific shares outside Japan added 0.7 percent. European equities were steady in morning business, with a rally in defensive sectors such as healthcare and utilities offsetting weaker banking and commodities stocks. The pan-European STOXX 600 index was unchanged, on track for a third straight week of gains. \\nEuropean shares have gained 4.5 percent since Donald Trump’s surprise victory in this month’s U.S. presidential election. “It looks as if the market is taking a breather after a good run. The market view is that Trump is going to spend more and will shield the U.S. more so that we get higher inflation and higher domestic growth,” Ronny Claeys, senior strategist at KBC Asset Management, said. “ The market has reacted positively on Trump, but this could change as his policies are vague at this stage. Investors will react more on his policy details ” Claeys added cited by Reuters . Emerging-market shares are poised for the first weekly increase in more than a month, led by commodity and energy producers. \\nIn rates, U.S. yields gapped higher at the open, rising as high as 2.411%, “but have been unable to hold those gains and that has encouraged some profit-taking,” said Jeremy Stretch, head of currency strategy at CIBC in London, and the 10Y was last trading at 2.37%. “There is a degree of consolidation (but) there is still a consistent bias that means the dollar will remain pretty much supported into the Fed meeting next month. The message seems to be to take some profit and we will be looking to go again.” \\nIn the European bond market, short-dated German government bond yields set a new record low and were on track for their biggest two-week fall in more than three years, highlighting demand for top-rated assets. Demand for German debt for use as collateral for short-term lending in repo markets has helped drive two-year bond yields lower this week . Jitters ahead of an Italian referendum on Dec. 4 has also bolstered demand for German bonds, regarded as among the safest assets in the world. Rates on 10-year German bunds fell two basis points on Friday to 0.24%. Yields on 40-year Japan government bonds slid five basis points to 0.715 percent, reversing an earlier climb after an auction of the debt saw 499.7 billion yen ($4.4 billion) of securities sold at a highest yield of 0.725 percent. “The 40 year bonds were well received in the auction, triggering a bout of bond buying,” said Masahiko Sato, an analyst at Nomura Holdings Inc. in Tokyo. \\n* * * \\nBulletin Headline Summary from RanSquawk Price action in Europe thus far has been muted amid ongoing holiday-thinned conditions and a lack of notable newsflow A day of profit taking and position adjustment, while month end (real money) flow is also starting to kick in with the USD rally taking another pause Looking ahead, highlights include UK GDP and US Services PMI. Note there are also early US closures today for yesterday’s Thanksgiving Holiday \\nMarket snapshot S&P 500 futures up 0.2% to 2205 Stoxx 600 up less than 0.1% to 342 FTSE 100 down less than 0.1% to 6828 DAX up less than 0.1% to 10690 German 10Yr yield down 2bps to 0.24% Italian 10Yr yield down less than 1bp to 2.12% Spanish 10Yr yield down 2bps to 1.57% S&P GSCI Index down 0.3% to 370.2 MSCI Asia Pacific up 0.6% to 136 Nikkei 225 up 0.3% to 18381 Hang Seng up 0.5% to 22723 Shanghai Composite up 0.6% to 3262 S&P/ASX 200 up 0.4% to 5508 US 10-yr yield up 2bps to 2.37% Dollar Index down 0.26% to 101.44 WTI Crude futures down 0.7% to $47.63 Brent Futures down 1% to $48.53 Gold spot up 0.3% to $1,188 Silver spot up 0.9% to $16.44 \\nGlobal Headline News J&J Said to Make Takeover Approach for Drugmaker Actelion: Actelion shares soar by most in more than 2 years; deliberations said to be at early stage after initial offer Amazon Said in Talks to Buy Dubai’s Souq.com in $1b Deal: no final decisions have been made, talks could still falter; MidEast e-commerce site initially planned to sell a stake Black Friday Merchants See Americans Exhaling After Election: with uncertainty gone, stores see consumers poised to spend; Thanksgiving weekend accounts for 15% of holiday sales Holiday Price War Intensifies as Wal-Mart, Target Pursue Amazon: brick-and-mortar chains offering bigger discounts than in 2015 U.S. Boosts Refiners’ 2017 Biofuel Quotas to Record Levels: EPA mandates above levels the agency proposed in May Chevron to Pick Winner of Indonesian Geothermal Bid in Dec./Jan.: co. reviewing bids from 5 companies, including Marubeni, Pertamina Trump Expected to Pick Ross for Commerce Job, Person Says: President-elect Trump is expected to nominate as secretary of commerce investor Wilbur Ross OPEC’s Last Push for Oil Deal Shifts Focus to Iran, Russia: Algerian minister to meet his counterpart in Tehran Saturday GoDaddy Said in Exclusive Talks to Buy Host Europe: Reuters KKR Said to Partner With Arrow Pharma for INova Bid: AFR Samsung Bioepis Nasdaq IPO May Be Delayed: Maeil Business U.S. equity markets close at 1pm, bond markets close at 2pm \\nIn Asia, stock markets traded mostly positive, although gains were reserved after a small lead from Wall St. where US participants were absent due to Thanksgiving holiday. Nikkei 225 (+0.3%) traded choppy throughout the session with the index driven by JPY fluctuations, while ASX 200 (+0.4%) was also higher despite upside being limited by weakness in gold. Hang Seng (+0.5%) conformed to the positive tone while Shanghai Comp (+0.6%) initially lagged amid quiet news flow and after the PBoC reduced its weekly net liquidity injection by around 90% from the prior week. 10yr JGBs were initially pressured amid gains in riskier assets and as yields rose alongside their US counterparts. However, JGBs then recovered from their lows in the wake of a firmer 40yr auction leading to outperformance in the super-long end and curve flattening. PBoC injected CNY 120bIn in 7-day reverse repos, CNY 70bIn in 14-day reverse repos, CNY 25b1n in 28-day reverse repos for a weekly net injection of CNY 40bIn vs. last week’s CNY 425b1n net injection. \\nJapan reported its latest consumer price data, which met or beat most expectations: Japanese National CPI (Oct) Y/Y 0.1% vs. Exp. 0.0% (Prey. -0.5%) Japanese National CPI Ex. Food (Oct) Y/Y -0.4% vs. Exp. -0.4% (Prey. -0.5%) Japanese Tokyo CPI (Nov) Y/Y 0.5% vs. Exp. 0.2% (Prey. 0.1%) Japanese Tokyo CPI Ex-Food (Nov) Y/Y -0.4% vs. Exp. -0.4% (Prey. -0.4%). \\nTop Asian News Macquarie, ANZ to Pay $11 Million Over Malaysia Rates Probe: Australian banks admit attempted cartel conduct in 2011 In Asia Currency-Reserve Checkup, Two Countries Come Out on Top: IMF gauge shows Thailand, Philippines offer resilience China Bad-Loan Disposal No Easy Task With Slowdown, Survey Shows: Only 4% of bad-loan managers find it easy to dispose of NPLs JAL Plans First Post-Bankruptcy Bond to Fund Airbus Purchases: Airline plans to sell about 20 billion yen of notes next month Angry Soldiers Another Headache for Modi Amid Rupee Note Crisis: Suspected suicide of voluntary reservist highlights concerns \\nIn Europe, as expected, given yesterday’s US thanksgiving holiday, newsflow and price action has been light today. European equities trade flat, with Actellion higher by almost 10% amid talk of a potential merger, with Shire touted as a bidder. To the downside, Banca Monte Paschi traders got their usual morning break as Co. shares were halted limit down once again, this time as a consequence of the EUR 5bIn capital raising. Fixed income and commodity markets have been equally dull, with Bunds marginally higher today amid light volumes and little to drive price action. The energy complex has seen modest softness as all eyes focus on next week’s OPEC meeting, with participants becoming somewhat saturated with comments from the different nations in the build up. \\nTop European News U.K. Economy Shows No Sign of Brexit Effect as Spending Rises: consumers and businesses increased their spending in 3Q as the U.K. economy registered resilient performance after Brexit vote Brexit May Take Decade So Give the Pound a Rest, Investors Say: Pound already reflects changing economy, Standard Life says; Kames Capital now “slightly more optimistic” on currency Nordea Chairman Says Talks With ABN Amro Are Unlikely to Resume: Nordea isn’t tempted to buy ABN shares, Wahlroos says Greece’s Biggest Bank Sees Trump Boost to Country’s Economy: Piraeus Bank chair Handjinicolaou speaks in interview, declines to give timeframe for pending CEO pick Lufthansa Condemns ‘Emotional’ Pilots as Strike to Span Weekend: union has extended action, claiming company aims to destroy it \\nIn currencies, the Bloomberg Dollar Spot Index fell 0.3 percent at London morning trading, leaving it up 0.3 percent this week. Japan’s currency gained 0.4 percent to 112.80 per dollar. It’s down 1.8 percent in the week, the worst performance among major currencies. The rupee strengthened 0.4 percent after sinking to a record low Thursday, while the Turkish lira gained 0.3 percent. China’s yuan, which fell to an eight-year low against the dollar this week, was little changed. The yuan rose this week to an August high versus a basket of peers, signaling that its declines against the greenback have been more moderate than those of other currencies. South Africa’s rand headed for its first weekly gain in three weeks before a credit-rating review by Moody’s Investors Service. \\nIn commodities, West Texas Intermediate crude oil slipped 0.8 percent to $47.58 a barrel. OPEC’s focus has shifted to negotiations with Iran and non-member Russia for production curbs after Iraq’s prime minister signaled it will agree to cut output. Gold for immediate delivery rose 0.7 percent to $1,190.24 an ounce, the first advance in four days. Copper slipped less than 0.1 percent in London and has surged 8.2 percent this week. The industrial metal has soared 21 percent this month. \\nLooking at today’s events, the main focus this morning was on the UK where we got the second estimate of Q3 GDP which came in at 0.5%, as expected. Also in the UK today was the CBI’s Distributive Trades Survey for November which soared from 21 to 26, smashing expectations of a 12 print, while French consumer confidence data is the early print this morning. Markets in the US should be quiet again today but there is some data due out including the remaining flash November PMI’s (services and composite), wholesale inventories and the advance goods trade balance for October. It’ll also be worth keeping an eye on any retail sales data for Black Friday sales in the US. A reminder that this Sunday the second and final round of the French centre-right primary is due to be held. The run-off is between Francois Fillon and Alain Juppe, the former coming out on top in the first round, with the winner going on to be the chosen Republican candidate. We should know the winner around 9pm GMT on Sunday evening. \\nUS Event Calendar 8:30am: Advance Goods Trade Balance, Oct., est. -$59b (prior -$56.5b) 8:30am: Wholesale Inventories m/m, Oct P, est. 0.2% (prior 0.1%); Retail Inventories m/m, Oct. (prior 0.3%) 9:45am: Markit US Services PMI, Nov. P, est. 54.8 (prior 54.8) \\n* * * \\nDB’s Jim Reid concludes the overnight wrap \\nGood luck to all those braving the sales today. It’s staggering to see the number of ‘How to Survive Black Friday’ articles out there now and how many more stories there are with tips and strategies to get the best bargains on the day. Apparently it now takes weeks of precise planning and preparation. It sounds like you’ll need a decent plate of leftover turkey this morning to build up the energy first. \\nIf the last 24 hours is anything to go by then it’s likely to be another fairly quiet day ahead with the US scheduled for an early close. While there wasn’t much to shout about in markets yesterday the most interesting story concerned a Bloomberg report about the ECB possibly putting off decisions about the future of its bond-buying program until next year. The crux of the story concerned the parameters of the program and how the technical issues relating to bond scarcity may have eased with the recent rise in yields. The story also suggested that ‘some’ policy makers would consider a delay on the QE extension decision but we’d also caveat that with the mention of ‘most’ policymakers still seeing a need to send a dovish message at next month’s meeting given the inflation outlook. Indeed we’d highlight that the recent message from ECB officials has been just that including President Draghi’s recent comments. A reminder too that the 2019 staff forecasts will be available for the first time at the meeting next month. That said, it is worth noting that expectations were fairly high for a QE announcement in December 2014 and we had to wait for January 2015 for the decision to eventually be made so you can’t entirely rule out the possibility a delay. \\nWith that Bloomberg report coming as markets in Europe closed we didn’t get to see too much of a reaction. 10y Bund yields finished little changed at 0.251% with yields, if anything, a couple of basis points higher following the story. The periphery was a bit more mixed (Portugal and Spain 1bp lower and Italy 1bp higher) but again moves were fairly modest. This morning we’ve seen 10y Treasury yields rise nearly 5bps however. There was also some focus on FX markets yesterday with a number of EM currencies making new recent lows including currencies in India, Malaysia, Vietnam and Philippines. The Turkish Lira (-1.44%) was also under pressure despite Turkey’s central bank raising rates for the first time in nearly three years. Following that though the European Parliament then voted overwhelmingly in favour of suspending EU membership talks with Turkey. \\nElsewhere, equity markets in Europe yesterday were generally a touch firmer despite volumes some 50% or so below the usual daily average The Stoxx 600 closed up +0.31% as healthcare and tech stocks led the move higher, while credit indices were marginally tighter. A bit of stability in the Oil complex seemingly helped too with WTI continuing to hover around the $48/bbl level ahead of the OPEC meeting next week. \\nBack to the ECB, Vice-President Constancio also added to the recent chorus of dovish communication from the Bank yesterday. He said that ‘we want our policies, including unconventional policies, in place until we are convinced there is a sustained path toward our objective of inflation’. The ECB’s twice-yearly Financial Stability Review was also released yesterday with the report warning about the risk of a possible abrupt global correction on the back of political uncertainty and elevated geopolitical tensions which is posing risks to stability, banks, confidence and economic growth. \\nThis morning in Asia, with the exception of China it’s been a broadly positive session for equity markets. The Nikkei (+0.77%), Hang Seng (+0.38%), Kospi (+0.10%) and ASX (+0.62%) are all up although in China the Shanghai Comp (-0.43%) has dipped lower. US equity index futures are also a smidgen higher while sovereign bond markets are generally weaker. 10y JGB yields in particular are a couple of basis points higher at 0.053% and the highest yield since mid-February. The Yen (-0.25%) however is under pressure and approaching ¥114 following the latest leg higher for the Dollar. The latest CPI data was also out in Japan overnight. The good news is that headline CPI return to positive territory at +0.1% yoy versus -0.5% in September, however the core remains rooted in deflation at -0.4% yoy (from -0.5%). The core-core did also improve to +0.2% yoy from 0.0%. Our economists noted that the increase in overall CPI was mainly due to a sharp increase in the price of fresh vegetables due to unfavourable weather. \\nThe only other snippet to mention from yesterday was the economic data. The most significant came from Germany where there was no final revisions made to the Q3 GDP print of +0.2% qoq, leaving the YoY rate at +1.7%. The components of the report showed that growth mainly came from domestic demand, especially private and government consumption. Meanwhile Germany’s November IFO survey revealed a business climate reading of 110.4 which was unchanged from the month prior. A slight increase in the current assessment component was offset by a modest decline in expectations. In France business confidence was also unchanged in November at 102. \\nLooking at today’s calendar the main focus this morning in the European session will likely be on the UK where we’ll get the second estimate of Q3 GDP and where the Office for National Statistics is expected to confirm that GDP grew at +0.5% qoq during the quarter. We’ll also receive the wider components of the GDP report which will be interesting to see. Also due out in the UK today is the CBI’s Distributive Trades Survey for November while French consumer confidence data is the early print this morning. Markets in the US should be quiet again today but there is some data due out including the remaining flash November PMI’s (services and composite), wholesale inventories and the advance goods trade balance for October. It’ll also be worth keeping an eye on any retail sales data for Black Friday sales in the US. \\nA quick reminder before we sign off that this Sunday, the second and final round of the French centre-right primary is due to be held. As a reminder the run-off is between Francois Fillon and Alain Juppe, the former coming out on top in the first round, with the winner going on to be the chosen Republican candidate. We should know the winner around 9pm GMT on Sunday evening. Related '"}, "time": 1742563695.6058645}