{"duration": 0.047692298889160156, "input_args": {"text": "'Earlier in the week, we covered a study from Wharton School professor J. Scott Armstrong and Dr. Kesten Green which claims that only a fraction of 1 percent of the papers published in scientific journals follow the scientific method. Professor Armstrong appeared on Breitbart News Daily today to discuss his research with    Alex Marlow. [“The problem in journals, with government research, and with universities is that nobody asks them to follow [it]. I’ve been publishing for 55 years and can’t ever recall anyone saying ‘you should follow the scientific method. ’”  Armstrong, along with Dr Kesten Green developed a checklist of eight criteria to assess whether a paper or a study follows the scientific method. According to the checklist, scientific studies must (1) test multiple reasonable hypotheses, (2) provide useful findings, (3) fully disclose methods, data, and other relevant information, (4) conduct a comprehensive review of prior knowledge, (5) use valid and comparable data, (6) use valid and simple methods, (7) provide any experimental evidence, (8) reach conclusions consistent with the evidence. “So, [Dr.] Kesten Green and I got involved with this to develop a simple checklist that would help people to say ‘are you following the scientific method?’ If you’re going to fly a plane, if you’re going to be a doctor and operate, you have to use a checklist, and if you use a checklist you are much more effective. Nothing like that exists right now. ” “There is one exception, and that is PLOS One, Public Library of Science One actually provides a checklist. I think it took them about five years before they became the largest scientific journal in the world, so they’ve really revolutionized things. ” “What’s happening now is, government research, universities  —   they’re asking for what I call advocacy research. They have something, they want you to prove it, make sure you prove it, you do, you keep getting paid. ” “Advocacy research is the bulk of these 99 percent of   studies, and they’re not done for scientific development, they’re done to support a political idea. If you want to make money in universities these days, you publish papers that support global warming and you live handsomely. ” Armstrong said that the problem of   research had been a problem since at least the 1920s, but that it has intensified in recent years with the “vast growth of government funding for research. ” “I agree with many of the greats of the past when I say that the government should not be involved in research. ” Armstrong reiterated his argument that the Intergovernmental Panel on Climate Change (IPCC) violates all eight of his checklist for following the scientific method. “If you don’t believe me, you can go and look at their work and you can use that checklist. ” Listen to Professor Armstrong’s full discussion with Alex Marlow below. '"}, "time": 1742561833.761873}