{"duration": 0.04663515090942383, "input_args": {"text": "'‘We the people’ against tyranny: Seven principles for free government By John W. Whitehead   John W. Whitehead \\n“As I look at America today, I am not afraid to say that I am afraid.”—Former presidential advisor Bertram Gross \\nAs history teaches us, if the people have little or no knowledge of the basics of government and their rights, those who wield governmental power inevitably wield it excessively. After all, a citizenry can only hold its government accountable if it knows when the government oversteps its bounds. \\nPrecisely because Americans are easily distracted—because, as study after study shows, they are clueless about their rights—because their elected officials no longer represent them—because Americans have been brainwashed into believing that their only duty as citizens is to vote—because the citizenry has failed to hold government officials accountable to abiding by the Constitution—because young people are no longer being taught the fundamentals of the Constitution or the Bill of Rights, resulting in citizens who don’t even know they have rights—and because Americans continue to place their trust in politics to fix what’s wrong with this country—the American governmental scheme is sliding ever closer towards a pervasive authoritarianism. \\nThis steady slide towards tyranny, meted out by militarized local and federal police and legalistic bureaucrats, has been carried forward by each successive president over the past fifty years regardless of their political affiliation. \\nBig government has grown bigger and the rights of the citizenry have grown smaller. \\nHowever, there are certain principles—principles that every American should know—which undergird the American system of government and form the basis for the freedoms our forefathers fought and died for. \\nThe following seven principles are a good starting point for understanding what free government is really all about. \\nFirst, the maxim that power corrupts is an absolute truth. Realizing this, those who drafted the Constitution and the Bill of Rights held one principle sacrosanct: a distrust of all who hold governmental power. As James Madison, author of the Bill of Rights, proclaimed, “All men having power ought to be distrusted to a certain degree.” Moreover, in questions of power, Thomas Jefferson warned, “Let no more be heard of confidence in man, but bind him down from mischief by the chains of the Constitution.” As such, those who drafted our founding documents would see today’s government as an out-of-control, unmanageable beast. \\nThe second principle is that governments primarily exist to secure rights, an idea that is central to constitutionalism. In appointing the government as the guardian of the people’s rights, the people give it only certain, enumerated powers, which are laid out in a written constitution. The idea of a written constitution actualizes the two great themes of the Declaration of Independence: consent and protection of equal rights. Thus, the purpose of constitutionalism is to limit governmental power and ensure that the government performs its basic function: to preserve and protect our rights, especially our unalienable rights to life, liberty and the pursuit of happiness, and our civil liberties. Unfortunately, the government today has discarded this principle and now sees itself as our master, not our servant. The obvious next step, unless we act soon, is tyranny. \\nThe third principle revolves around the belief that no one is above the law, not even those who make the law. This is termed rule of law. Richard Nixon’s statement, “When the President does it, that means it is not illegal,” would have been an anathema to the Framers of the Constitution. If all people possess equal rights, the people who live under the laws must be allowed to participate in making those laws. By that same token, those who make the laws must live under the laws they make. However, today government officials at all levels often act as if they are royalty with salaries and perks that none of the rest of us are afforded. This is an egregious affront to the citizenry. \\nFourth, separation of powers ensures that no single authority is entrusted with all the powers of government. People are not perfect, whether they are in government or out of it. As history makes clear, those in power tend to abuse it. The government is thus divided into three co-equal branches: legislative, executive and judicial. Placing all three powers in the same branch of government was considered the very definition of tyranny. The fact that the president today has dictatorial powers would have been considered a curse by the Framers. \\nFifth, a system of checks and balances, essential if a constitutional government is to succeed, strengthens the separation of powers and prevents legislative despotism. Such checks and balances include dividing Congress into two houses, with different constituencies, term lengths, sizes and functions; granting the president a limited veto power over congressional legislation; and appointing an independent judiciary capable of reviewing ordinary legislation in light of the written Constitution, which is referred to as “judicial review.” The Framers feared that Congress could abuse its powers and potentially emerge as the tyrannous branch because it had the power to tax. But they did not anticipate the emergence of presidential powers as they have come to dominate modern government or the inordinate influence of corporate powers on governmental decision-making. Indeed, as recent academic studies now indicate, we are now ruled by a monied oligarchy that serves itself and not “we the people.” \\nSixth, representation allows the people to have a voice in government by sending elected representatives to do their bidding while avoiding the need of each and every citizen to vote on every issue considered by government. \\nFinally, federalism is yet another constitutional device to limit the power of government by dividing power and, thus, preventing tyranny. \\nThese seven vital principles have been largely forgotten in recent years, obscured by the haze of a centralized government, a citizenry that no longer think \\nIt will mean “ voting with our feet \\nAs journalist Chris Hedges points out, “There were once radicals in America, people who held fast to moral imperatives. , not because it was easy or practical. They were willing to accept the state persecution that comes with open defiance. They had the courage of their convictions. They were not afraid.” \\nUltimately, as I make clear in my book , it will mean refusing to be divided, one against each other, by politics and instead uniting behind the only distinction that has ever mattered: “we the people” against tyranny. \\nConstitutional attorney and author John W. Whitehead is founder and president of The Rutherford Institute. His book (SelectBooks, 2015) is available online at www.amazon.com. Whitehead can be contacted at  '"}, "time": 1742628608.4412446}