{"duration": 0.10675334930419922, "input_args": {"text": "'A group of   extremists at UC Berkeley have doxed the student hosts behind MILO’s upcoming event on campus, posting personal details, photographs, email addresses, social media accounts, and even one of the student’s workplace addresses. [In their post entitled “The Kids Are  : The UC Berkeley Students Behind the Milo Event,” the   website and group known as “It’s Going Down” posted the personal details of five student organizers in an attempt to intimidate and harass those behind MILO’s upcoming event on February 1st.  IGD listed the organizers’ names and pictures, supposedly taken after stalking the students’ private social media accounts, and attempted to link many of the students to white supremacy and racism purely based on their   Trump and Republican stances. The group even referred to one of the students as a “snitch” due to the fact that he had reported a violent incident to the police, after he was assaulted by   protesters and had his property destroyed. After attacking another student, citing the various comedy meme pages on Facebook he likes, the group proceeded to write “This is where [the student] works,” along with the full address, phone number, and website of his employers. “While not every member of BCR seems to be directly connected with   politics, at the same time, they are still involved in promoting a political party that holds the most reactionary, racist, and ecocidal platform in history,” noted the organization at the end of their post, despite attempting to link every student organizer to white supremacy just shortly beforehand. “While the institutional Left of Berkeley and the wider bay area, which has a stranglehold on the region, deserves no free pass, nor do the Republicans, as one of the two managers of the plantation that is America. ” “The white nationalists at its edges of this system are just the crystallization of the larger politics that has been mainstreamed under Trump that white supremacy needs to be strengthened in the wake of the Black Lives Matter movement and other popular struggles from below” they continued. “It’s up to all of us to realize that both the auxiliary force to the State of the white nationalist   it’s ‘hipster’ reactionary talking heads like Milo, and the ‘respectable’ Republican party they seek to influence and defend, are all our enemies. Let’s start treating them as such and organize accordingly. ” Despite orchestrating a harassment campaign against the student organizers of MILO’s event, and urging readers to start treating Republicans as “enemies,” the group claims in their about page to “not condone or promote illegal, violent, and unlawful behavior or actions, or acts of intimidation against individuals or groups. ” “It is a dangerous precedent in an academic environment for student groups to be subjected to harassment and cyber doxxing based on political affiliation,” said the President of the Associated Students of the University of California, Will Morrow. “This goes beyond any singular political frame or any one event context  —   rather this is something that the foundation of our university is in many ways built on. ” “The article is wrong in the moral sense and in the factual sense,” said Matt Ronnau, who was listed in the post, but claims to have not been involved in organizing MILO’s event. “When I didn’t know (that I was named) I thought it would be interesting but then seeing my information on there was   …     a little scary. ” Another student listed, Nick Winterer, claimed that he wasn’t even associated with the Berkeley College Republicans, and instead used to be affiliated with the Cal Students for Liberty —   a group he is no longer active with. “I can’t say that I’ve been affected in any way by my information being posted,” said Winterer. “I will say that I find it disrespectful that no attempt was made to verify the accuracy of the information posted. ” It’s Going Down (IGD) also falsely claimed in the post that the #GamerGate consumer revolt movement was a harassment campaign against women where men made “threats of rape and sexual assault,” against feminists. They also attempted to falsely associate both Breitbart News and MILO with white nationalism and racism. Several of the affected students have either deleted or hidden their Facebook accounts which were linked in the article. College administrators at UC Berkeley issued the student organizers with a sudden large security fee this week, demanding $6, 370 less than a month before the event —   a tactic frequently used by universities in an attempt to get the event cancelled. In addition to the security fee issue, a group of professors at UC Berkeley are attempting to get MILO banned from the campus, falsely accusing the Breitbart senior editor of advocating “white supremacy. ” Though the professors claimed to support freedom of speech and “open debate” in their letter, they declared MILO to be an exception, and called upon Chancellor Dirks to ban him from campus. UPDATE: IGD responded to Breitbart’s request for comment, defending the piece by claiming that they merely published an article written by someone else. “F*ck you,” they then concluded in the email. This story has been updated to list the correct position of student Will Morrow. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561796.0120053}