{"duration": 0.16816401481628418, "input_args": {"text": "'By Robert Fisk on October 30, 2016 Robert Fisk — The Independent Oct 29, 2016 Wrecked ambulance in Aleppo. Click to enlarge \\nMoonscape. Desert. Blitz. The past 100 years of war have turned all our words into clichés. I rage at every reference to the Second World War – because it’s over, because Hitler is dead, because we won and because we shouldn’t dig up old graves to frighten future generations. But Beni Zeid is an exception. \\nIt goes on for square miles and it is total destruction. This was the last great   Syrian army and the Jabhat al-Nusrah fighters (yes, they are the Al-Qaeda of 9/11 infamy, although we have quite put that aside in our coverage of the Syrian war) as the door closed on eastern Aleppo and the siege of its people and defenders began this summer. \\nBeni Zeid lies on a hill to the north of the city and its pulverisation is total. The words “Year Zero” comes to mind when I look at it. Factories, warehouses, streets of laced ruins , crushed apartment blocks, cratered courtyards and roads, and what the Syrians described as a Nusrah explosives factory, destroyed with a massive bomb. Dropped by a Syrian or Russian pilot, we shall never know. But its detonation scattered at least 70 red-painted gas cylinders across the rubble. \\nThe wreckage of industrial Stalingrad might be appropriate if we are talking in pictorial form, for there can be no repairs here. So crushed is the district of Beni Zeid that the Syrians will have to level these streets with bulldozers and start all over again. But the casualties were few; on 18 July this year, two Syrian army groups attacked this place from the north and west at almost the same time as they crossed the Castello road. \\nThey lost few men. They took no prisoners. And we all know what that means. \\nThey left the gas canisters where they were, ignored the craters and the cemeteries of streets and factories, and Beni Zeid became – as these places do in war – part of the front line, in this case   front line around besieged eastern Aleppo. The pain and grief of its surrounded people have now become the latest Sarajevo in our popular history books, although I notice that the equally cruel Israel siege of the Lebanese and Palestinians in Beirut in 1982 is left out when comparisons are made. I wonder why? \\nWell, there we were amid this desolation of Beni Zeid when one of us spotted a vehicle that had been jammed by the bomb blast between the foundation walls of a factory perhaps 200 feet from the gas cylinders. The top of its roof could just be seen from the next street and it said “AMBULANCE” in big letters. In English. \\nWe turned the corner. The Syrian military had not touched it. No one told us it was there. The bomb that destroyed the “explosives factory” (primitive though the factory was) had blasted the ambulance into the wreckage. \\nIt was right-hand drive, so the vehicle was never made for Syrian roads. And it looked, albeit crushed, like an ambulance you might see on the streets of London or Manchester or Glasgow. But the registration plates were missing. \\nWe overuse the word “ironic” in war – I admit I used it again this week – but the giant transfer painted on the side of the vehicle, in English, quite took our breath away. “HAS YOUR HEART DIED ALONG WITH THE CHILDREN?” it asked in capital letters. \\nWhat ghostly hand had plastered this frightening, horribly relevant legend along the side of this ambulance? I climbed in the driver’s cab. I clambered up the shattered ladder through the back. There was no sign of blood. \\nBut everything was in English. Fasten your seat belt. Even “DRINK OR DRIVE: YOU DECIDE” – which was not a question you need ask of the people of eastern Aleppo, since Nusrah and their 15 or so allied groupuscules (the figure is anyway contentious) are unlikely to encourage the pitiful civilians in their sector to touch alcohol. There were pieces of door frame and mudguards in the cab, but then on the right side of the wall of the ambulance was clear proof of this vehicle’s origin. \\nThis is what was printed in capitals in red ink: “THE SCOTTISH AMBULANCE SERVICE WILL FULLY SUPPORT THE PROCURATOR FISCAL AND POLICE IN THE PROSECUTION OF THOSE WHO ASSAULT THEIR STAFF…AMBULANCE STAFF HAVE THE RIGHT TO GO ABOUT THEIR DUTIES WITHOUT FEAR OF ATTACK…” \\nWell, of course, whoever was going about their duties in this Scottish ambulance was very much attacked in Aleppo. As for assault or fear, there was plenty of that around Beni Zeid. There was rifle fire across this wasteland as we prowled through the ambulance and a big shell came crashing into the ruins a few hundred metres away as we inspected the vehicle and its contents. \\nSo we should perhaps help the Scottish authorities – let alone the procurator general – to solve the mystery of this ambulance. On the steering column was the code: “A 9014600104” (the first 4 was slightly scratched and might have been a “6”). \\nThere was a lens in the cab marked ‘CAMERA OXYGEN” which carried the code “BS. EN 737-1: 1988. MFD [manufactured] 02/2006. B/no 18192”. There was an “in/out” switch (perhaps for the rear doors), manufactured by ‘Linax’ in Denmark, the item coded “HB41000-00012” and marked “DATE: 05.11.22 [sic] IP 65”. \\nThe maker’s code was “O.C. 096451-0057”. And for what it’s worth, the back of the driver’s mirror – if that is what it was – carried the “vehicle identity no” as “E367 44-3-5068 210 EG” and then “wv1zzz2D 2L z 6H014667, TYPE 2DF 292”. \\nBut enough codes. This is a detective story, not a crime story. Many an ambulance was donated to Syria by foreigners at the start of its terrible war, always to opponents of the regime or the civilians in areas under their control. A sign in English on the cab of the vehicle read: “EID IN SYRIA” and the last Muslim Eid feast came after the destruction of Beni Zeid and the ambulance. So the vehicle could have been in Syria for more than a year. \\nWas it sent in by NGOS from Britain? Was it brought in – yes, the thought struck me – by one of those selfless men and women who tried to help the people of Syria before Nusrah and its ghastly on-again-off-again ally Isis came into existence, and who then fell into the fatal hands of the very same Isis murderers? Was it used by the people of eastern Aleppo and the surrounding countryside and then later seized by Nusrah for its own use? There was no sign that it had been carrying weapons – and Nusrah, after all, has its own wounded. There are Syrian army ambulances aplenty in western Aleppo – and its wounded militia opponents are as worthy of medical help as any soldier once they are “ hors de combat ”, even in a civil war. \\nSo, until the Scottish Ambulance Service tells us to whom it gave (or sold) their ambulance – the procurator fiscal might find this out for us, although his writ does not run quite as far as Beni Zeid – this vehicle, built to save lives, will remain an unidentified skeleton amid the ruins of a Syrian bomb site. But the legend on its side remains to haunt us all. \\nHas your heart died along with the children? In this place, I fear the answer.'"}, "time": 1742562930.4244041}