{"duration": 1.4119088649749756, "input_args": {"text": "'Friday on Fox News Channel’s “Hannity,” host Sean Hannity used his “Opening Monologue” to criticize the media for what he said was an effort to overturn the results of last November’s presidential election.  Transcript as follows: The unelected fourth branch of government, the deep state, is trying to overturn the results of November’s election and throw this president out of office! So how did a bunch of unelected bureaucrats get so much power, feel so emboldened that think they can undermine a duly elected president of the United States and just take over? Plus, after this week’s   assassination attempt on Republican lawmakers, the left’s come together kumbaya moment, like I said last night, is nothing more than an illusion. It is a farce to hide the left’s true intentions. We will expose all of this hypocrisy in tonight’s very important “Opening Monologue. ” All right, so the unelected fourth branch of government is now being aided and abetted by the destroy Trump media, all in a massive effort to damage and destroy President Trump. Now, this week alone, we have seen unprecedented and potentially criminal leaks from the deep state to the liberal Washington Post. Now, the liberal smear machine is masquerading as a news outlet in their reporting, citing, of course, once again anonymous sources that the special counsel is investigating the president for possible obstruction of justice and that Robert Mueller is also looking into Jared Kushner’s finances and business dealings. OK, how is it possible that they dare to leak information almost every single day without any fear of consequences? And by the way, they’re wrong so often. Present Trump responding to that report today, tweeting, quote, “I am being investigated for firing the FBI director by the man who told me to fire the FBI director. That’s a witch hung. ” Now, the president, of course, is referring to the deputy attorney general, Rosenstein, who in a   memo laid out the strongest case on why Comey need to be fired. Now Rosenstein  —   now he wants an investigation by the special counsel to investigate why the president fired Comey and whether or not this was the right thing to do! This is insanity! And by the way, the special counsel now has 13 attorneys. And on top of that, including Hillary Clinton’s attorney and multiple attorneys that donated to both Obama and Hillary Clinton. Now, predictably, the destroy Trump media  —   they’re jumping all over this. They are, of course, hoping that it will lead to President Trump’s downfall. Let me remind you the Washington Post, ABC News, The New York Times, CNN, NBC  —   they have all gotten it wrong on this issue. They all at this point with the American public should have zero credibility. So we have to take these latest   smoking gun reports come out late night every night with a grain of salt. Last night, the deputy attorney general, Rod Rosenstein  —   he issued this statement about trusting these stories about the, quote (ph) coming out of the fake news media. He said this. He said, “Americans should exercise caution before accepting as true any stories attributed to, quote (ph) anonymous officials, particularly when they do not identify the country, let along the branch or the agency of government with which the alleged sources supposedly are affiliated. Americans should be skeptical about anonymous allegations. ” Now, the Department of Justice has a long established policy to neither confirm nor deny such allegations. You know what? I don’t trust that (ph) either, at this point. On top of that, James Comey  —   remember, he testified last week the media has been so dead wrong when it comes to stories about Russia. And by the way, while all that is alarming, it proves everything we have been saying on this program. This deep state, this fourth branch of government, as we’re calling it, doesn’t care about getting the truth to you, the American people. And of course, the media  —   they’re the willing accomplices. Their goal is the exact opposite here. They are selectively leaking information, intelligence information that is meant to damage, in this case, the president of United States of America, which is exactly what we have been seeing now almost on a nightly basis. Here’s a perfect example. James Comey told President Trump he wasn’t under investigation. Somehow, that’s the only one thing that never got leaked to the press. Why? The reason should be obvious. And what’s worse is the growing targets for the deep state. They’ve been successful in totally slowing down the president’s agenda, Congress’s agenda. Now, so far, they haven’t been able to stop him, which means the deep state is now going after anyone who’s even close to the president, including his family and White House advisers, and by the way, even people in the media. The deep state now plans to create as much collateral damage as possible, targeting everyone and everyone (sic) from the president straight on down. So what we’re seeing now is this unelected fourth branch of government looking for retribution, overturning a duly elected election. (sic) And by the way, they’re not going to stop until this president is either stopped or thrown out of office. Here’s the problem. Whoever is leaking this information to the media  —   they need to be arrested. They need to be prosecuted. Every one of them needs to be put in jail. Why hasn’t every Obama holdover been fired? Why have the leakers, you know, not been discovered and arrested at this point? Now, these people have now become a clear and present danger to this country and to you and the things that you care about deeply. Now, because these people now have, of course, done this to the country, well, that raises a lot of questions. Of course, now we have the left and their vicious and vile daily hatred that is now tearing this country apart and creating a climate where what we saw last week is now in some ways even encouraged by some. Now, last night’s   show of unity  —   remember, I’m not falling for it, the kumbaya moment at the congressional baseball game. It was nothing more than an illusion. Now, this week’s   assassination attempt on these Republican lawmakers is the culmination of endless vitriolic rage, animus, hatred towards the president and Republicans. I’m not saying anybody but this individual is responsible, but this atmosphere is so unhealthy. And those that are unhealthy  —   are they susceptible to potential influence of daily lies, misinformation, conspiracy theories? Remember this stunning video from this week. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: (EXPLETIVE DELETED) UNIDENTIFIED MALE: Do we know where he’s at? UNIDENTIFIED MALE: What? UNIDENTIFIED MALE: Do we know where he’s at? (END VIDEO CLIP) HANNITY: Now, after everything that we have seen, can anyone say that they’re surprised that a   lunatic went on a shooting rampage? For example, just this week, an opening night performance, Shakespeare’s Julius Caesar, New York City, or course, featured a Donald Trump lookalike getting what? Savagely murdered. Then of course, this most graphic example that we always warn you about before putting it up on he screen, Kathy Griffin, CNN host, posing like an ISIS fighter with a fake and bloody and severed head of President Trump. And that’s just a few examples of this   vitriol. Remember back in January, Madonna literally threatening, fantasizing about blowing up the White House. Remember this? (BEGIN VIDEO CLIP) MADONNA, SINGER: Yes, I’m angry. Yes, I am outraged. Yes, I have thought an awful lot about blowing up the White House. (END VIDEO CLIP) HANNITY: Thought an awful lot about blowing up the White House. Now, leftists, Hollywood liberals  —   they aren’t alone in viciously attacking the president. Then you got the destroy Trump media. Now, for months, 11 months almost, they have done the exact same thing, if not a lot worse. Take a look at what   news looks like. It’s real fake news, though. Take a look. (BEGIN VIDEO CLIP) UNIDENTIFIED FEMALE: I understand where you were coming from. I understand why you liked him. But this man is lying to you. UNIDENTIFIED MALE: Trump’s critics, those who are worried about this president and this White House, saw a live special television event brought to you by narcissism, thin skin, chaos and deeply personal grievances. UNIDENTIFIED MALE: This was a whitelash. This was a whitelash against a changing country. It was a whitelash against a black president, in part. And that’s the part where the pain comes. UNIDENTIFIED MALE: When he said today “America first,” it was not just the racial  —   I mean, the  —   I shouldn’t say “racial,” the Hitlerian background to it. UNIDENTIFIED MALE: This is a very sad night for the country. You can’t polish this turd. (CROSSTALK) UNIDENTIFIED MALE:  —   fake news. What if you had called him a fake president? UNIDENTIFIED MALE: He’s there with his wife. Here’s there with his whole family, as I say, like the Romanovs. He’s got  —   he’s got Jared, who might be a part of this story (INAUDIBLE) And he’s got his daughter, Ivanka. It’s like a traveling royal Romanov family! UNIDENTIFIED MALE: You can’t defend what the president of the United States just said. (CROSSTALK) UNIDENTIFIED MALE: If he took a dump on his desk, you would defend it. (END VIDEO CLIP) HANNITY: And now we’re supposed to believe all of these media folks and Democrats are preaching unity? But yet they have done nothing but smear, slander, besmirch this president for months. In case you forgot. Take a look. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: This executive order was   and  . UNIDENTIFIED MALE: Republican leaders and President Trump don’t give a (EXPLETIVE DELETED) about the people they were trying to hurt! UNIDENTIFIED FEMALE: I will fight every day until he is impeached. Impeach 45! (CHEERS AND APPLAUSE) UNIDENTIFIED FEMALE: Impeach 45! UNIDENTIFIED FEMALE: This is a bunch of scumbags. That’s what they are —   UNIDENTIFIED MALE: Those are very strong words, Congressman. UNIDENTIFIED FEMALE:  —   who are all organized around making money. UNIDENTIFIED FEMALE: We see nothing that we can work  —   that I can work with President Bush (sic) on. I’m trying really hard to find something positive. This morning, he had three tweets. I was thinking he was more of a creature that stalked the night, that these just came out at night like a vampire (INAUDIBLE) tweet us (ph) these things. But now it’s spread to the morning. (END VIDEO CLIP) HANNITY: And after Wednesday’s   assassination attempt, the HuffingtonPost  —   they had to take down an article calling for the president’s execution. Take a look at the headline we showed you last night, “Impeachment is no longer enough, Donald Trump must face justice. ” And here’s the   “Impeachment, removal from office are only the first steps. For America to be redeemed, Donald Trump must be prosecuted for treason. If convicted in a court of law, executed. ” Beyond disturbing. But there are plenty of other examples. Earlier this week, liberal Hollywood actor,   activist Mark Ruffalo  —   he called on his followers to sign a petition that demands NBC News stop hiring conservatives for   positions, white conservatives? We’ve also seen people like Robert de Niro and Mickey Rourke and Marilyn Manson advocating for violence against this president. And outside of Hollywood, then, of course, you have groups like Black Lives Matter. What do we want, dead cops. When do we want them, now. Pigs in a blanket, fry `em like bacon. Hillary Clinton supported that group. President Obama met with them in the White House! They’ve been spewing hate for years. And by the way, where was their criticism of Kathy Griffin and her ISIS pose? Take a look at Black Lives Matter. (END VIDEO CLIP) PROTESTERS: Pigs in a blanket, fry `em like bacon! Pigs in a blanket, fry `em like bacon! UNIDENTIFIED MALE: (INAUDIBLE) PROTESTERS: Now! UNIDENTIFIED MALE: (INAUDIBLE) PROTESTERS: Now! (END VIDEO CLIP) HANNITY: Also, we have all seen the    anger and rage that is springing up all over college campuses where  —   you know, showing you video  —   Berkeley, California, earlier this year, protesters starting a riot. Why? Because a conservative was going to speak at the university, the home of the Free Speech Movement. Now, while all these examples of hatred are shocking and alarming, they’re not new. Now, the roots of the left’s rage go back decades, if not further. In fact, it is part of the movement’s DNA. You know, groups like the Mayday Labor Movement, the Weather Underground, remember them, led by Barack Obama’s pals, Bill Ayers and Bernadine Dohrn, the Occupy Wall Street movement all started with, subscribed to radical     ideology advocating for using violence to their advantage in their political objectives. So while the Democrats and the left are putting their hate on pause for 24 hours last night, not even 24 hours, you can bet they’re only getting started when it comes to the president, conservatives, Republicans in this country. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563094.6339028}