{"duration": 0.06231355667114258, "input_args": {"text": "'November 21, 2016 - Fort Russ -  Sergey Shargunov, SvPressa - translated by J. Arnoldski - \\n\\n\\nWhen we’ll be at war, When we’ll be at war, I’ll fly forward to meet the bullets On my black steed… \\nThis song is playing out of an open window. Along with the song, there is a black SUV flying down an empty, shot-out road. It’s as if there was a storm around, trees are swaying around. \\nDriving is a blue-eyed man in a vest and camouflage jacket. Wildly flying down the road of death to Cossack songs. The sun shines in his eyes. \\nThen the words are drowned out by swishes and rattles…bullets, mines, and automatic grenade launchers. They’re shooting all day. \\nUpon returning from the frontline - this road of death - I interviewed Zakharchenko.  \\nSergey Shargunov (S): What qualities do you value in people? \\nAlexander Zakharchenko (Z): The main thing in a human is his inner core, his beliefs and ability to defend them. Under any circumstances. Here we have many decent, brave, and honest people. But the main thing is this core, which is important, real, and manly. Maybe you can’t be a soldier for one reason or another, but you have to be a man. Your personality must have integrity. \\nS: I am once again in Donbass, and I see that people have some kind of astonishing sense of dignity. Donbass is burning for the third year already. What is Donbass’ character based on? \\nZ: I believe that the quality of the people here was formed over centuries. Once this was just a wild field without its own sense of dignity and it was impossible to live here. Of course, this impacted the specificity of the mining profession. It allows one to respect himself first and foremost. And by respecting yourself, you can love your Homeland, your loved ones. All of this is thanks to respect for where you live. Inner respect is transmitted to people with their mother’s milk.  \\nA Russian man inherently has a sense of his own dignity. But some forgot about this. Even here, some people started to forget this. 2014 gave people something very valuable. The Russian spirit returned. An external threat awakened in people those qualities which, unfortunately, we had forgotten. \\nAs strange as it sounds, it is thanks to this that our qualities were awakened in us. It’s as if we were born again. Hence came the ability to fight, resist, respect ourselves, and the courage, faith, and will to sacrifice.  \\nYou just saw the guys on the frontline. Marik, the guy from Mariupol, has been wounded 8 times. The girl Dasha is our wonderful cook. She’s small, fragile, but is fighting and hasn’t left the frontline for 2 months. She respects herself. She respects her husband, her comrades, her land, and Russia. These are all of the qualities that are innate to us. \\nS: Everyone here, like the speakers at today’s meeting in Gorlovka for example, ask me how long this can all last. \\nZ: Sergey, can I ask you? How long can this all last? I’m asking the very same question. Believe me, I’d like to ask this question not only to you, but the State Duma, the government, and Russia in general.  \\nWe, Russians, are fighting here for the third year. Russians live here, and we want to return to the Homeland, to Russia.  \\nHow much longer should we fight here? What should we do? Explain us, and we will do the rest, we’ll fight and withstand. Just explain and tell us what we should do, what point we should reach, what we should capture, and how we can help this process of returning, so that it would all finish faster.  \\nS: What does being the head of the republic mean to you? \\nZ: First and foremost, it is a duty and service. It is not power, but the opportunity to fix what, unfortunately, wasn’t fixed for 23 years. \\nI am not the captain of a rebel frigate and this isn’t a naval or Corsair romance novel. We are here on the frontline, a frontline which has brought together the best representatives of Russia, where the people’s true spirit manifests itself. Liberals say that we should be the West, America. We should show that we don’t have to, that we ourselves are free people. And, perhaps, thanks to our service, Russia is also waking up.  This is mainly a duty and service. \\nS: Are you confident in victory? \\nZ: If I wasn’t confident, I wouldn’t wouldn’t have donned this uniform and taken up arms. I’m confident! It’s impossible to fight without it. \\nS: What impacted you most in your life? \\nZ: Character is formed in childhood thanks to your mom and dad, school, and the Homeland. What has impacted me, or awoken, rather than shocked me? The events of late 2013-early 2014. The Maidan. I was awakened by what is called the Russian soul. I was scared and offended that we, Russians, were perceived as second-class people. \\nSo then I took up arms and decided that if they don’t understand the easy way, then they need to be explained the hard way. I was sick and tired of being a second-class citizen. I live on my land, and yet there was the sense that I am an outcast. This awoke that feeling in me. \\nThey started to burn churches, set deputies on fire, and march around Kiev with Nazi flags and torches. I asked myself: “For what did our grandfathers die? What about our great grandfathers? Only for this scum to come to my hometown and say that we are all outcasts?\" This is probably what awakened me to another life. \\nS: People are interested in what is going on with the war and with peace in Donbass. \\nZ: I’ll let you in on a big secret: there is no peace here! We have a raging war. But public opinion is that today the peace process is ongoing, and that they\\'re trying to solve the problem peacefully. It is impossible to speak about any peace with those beasts that are now half a kilometer away from us.  \\nS: What would you tell people in Russia? \\nZ: I’ve said this earlier and I can say it again. Thank you,  Homeland! Thank you, Russian people! Thank you, that I had the honor to be born in this country and that its blood flows in my veins. \\nAnd I would also like to ask: Countrymen, what needs to be done for us to return home? What needs to be done so that, finally, the millions of Russian people who live here can return there whence we all came?  \\nS: I saw that you have the flag of Russia in your office.  \\n\\nZ: Yes, of course. The flag of the Donetsk People’s Republic - this is my land - and the flag of Russia - the flag of the Homeland. I was born in Donetsk, therefore the flag of Donbass stands. And Russia is my Homeland. Thus, I have to flags.  \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742628491.215999}