{"duration": 0.022850990295410156, "input_args": {"text": "'November 17, 2016 \\nHaving named post-truth as the word of the year, The Oxford English Dictionary’s post truth edition will be available online tomorrow, after a book launch on the moon in 1835, attended by Elvis Presley and Winnie the Pooh. The hardback edition will cost $50,000, but most branches of Waterstones will not mind if you nick it. \\n‘It’s the first time a major linguistic work has been edited by a koala bear,’ said post truth OED editorial director and pantomime horse Ian Smythe, playing down rumours (which he denies starting himself) about the size of his genitals. ‘The volume will be of enormous help to newspaper editors, students, political observers scientists and academics entering a world where the very idea of truth has to be examined by standing on a stepladder made of raspberry jelly and shouting ‘Rabbi, let’s tap-dance to Tewskbury!’ \\nIn the UK, the Murdoch press and the Mail group of newspapers say the official launch of the Post Truth era won’t make any difference whatsoever to their editorial policy, announcing that the £350 million pounds a week payable to the NHS has already started and queues waiting for treatment at hospitals are being ignored by immigrant doctors planning suicide attacks on Clarence House and smoking skunk supplied by Diane Abbott. \\nMeanwhile in the USA the much respected newspaper the Washington Post has launched a new weekly paper called the Washington Post Truth, reporting that Bernie Sanders won the presidential election, Nigel Farage was killed by a falling block of frozen urine traceable back to Air Force One, Bill Cosby has had a new show green lit co starring Monica Lewinsky and the Brexit Referendum ended in a dead heat. \\nThe manufacturers of self adhesive Post It notes have also joined post truth culture by launching a new range of ‘Post Truth It’ notes, bearing pre-printed messages like ‘Have gone to the pictures with Nicole Kidman/Brad Pitt/Lembit Opik’; ‘You do have to work to be mad here’ and ‘This note isn’t sticky so it has fallen off the fridge and you are not reading it.’ Share this story... \\nPosted: Nov 17th, 2016 by nickb Click for more article by nickb .. More Stories about: Left Alert 0'"}, "time": 1742628591.1670325}