{"duration": 0.10140752792358398, "input_args": {"text": "'by PAUL FASSA \\nChris Kilham once did a segment with Doctor Oz on the Five Tibetan exercises. In 2011 he wrote a book called: The Five Tibetans: Five Dynamic Exercises for Health, Energy, and Personal Power . Chris Kilham is a well-known “medicine hunter, author, educator, and world-traveler researching and promoting plant-based medicines. He is the founder of Medicine Hunter, Inc., and is a Fox News integrative alternative medicine TV personality and columnist.” (Wikipedia)Kilham told Dr. Oz and his audience that a daily five minute practice of the Five Tibetans will result in adding an entire decade to your life span. The exercises are done repetitiously on a gradient. The beginner starts out doing 1 to 5 repetitions for each exercise. It’s advisable to always listen to your body in order to avoid injury and never ever force your body to continue the exercises if your body is signaling pain. \\nSome soreness and minor discomfort is expected but beyond that is a danger zone that can lead to injury. The goal is to work up to twenty or some say 21 repetitions of each exercise at a comfortable pace. \\nThe advised best times to practice are sunrise or sunset but anytime is better than never. Be sure to use a carpeted area, yoga mat, towel or throw rug to ease the discomfort of the body moving against a hard surface. \\nThe room should be well ventilated. Choose a quiet area where you are not distracted by others and can easily concentrate. Click here for a text and graphics description of the exercises. A video demonstration by Chris Kilham is presented at the bottom of this article. \\nHistory \\nAccording to legend, the Five Tibetans originated form Tibetan Llamas around 2,500 years ago. Anti-aging expert Ellen Wood, stresses the importance of doing the 5 Tibetans very slowly for maximum longevity results. The exercises were a secret practice handed down from generation to generation to a select few –the initiated. \\nThe Tibetan monasteries guarded the practices as they were considered as part of a pathway to higher levels of consciousness. But a noted side-effect of the exercises was increased longevity and the restoration of youthfulness. This is what Chris Kilham is promoting. \\nEsoteric Benefits \\nIn the 1930’s, American Author Peter Kelder shared the secret of the Five Tibetans with the West. He explained that the true value of the exercises transcended the physical realm. In his book, The Eye of Revelation (later released as The Ancient Secret of the Fountain of Youth ). \\nHe states: “I would like to make it clearly understood that these are not physical culture exercises at all. They are only performed a few times a day; so few times that they could not possibly be of any value as physical culture movements. \\nWhat the Rites actually do is this: They start the seven Vortexes, also known as the chakras of the subtle body, spinning at a normal rate of speed; at the speed which is normal for, say, a young, robust, strong, virile person of twenty-five years of age.” \\nThese exercises are comprehensive and dynamic; they positively enhance and restore the body, mind, and emotions and the spirit or soul. Esoterically the exercises activate and tone the 7 major energy vortexes in what the yogis call the subtle body. \\nThe chakras or wheels of energy have been mapped put in yogic texts. These energy centers are the primary energetic interface between the individual and the larger universe. It is believed in esoteric circles that when these energy centers are functioning properly health and spiritual evolution are the result. \\nPhysical Health Benefits \\nThese exercises, like Qi-gong or Chi-Gong, restore energy, unlike calisthenics which expend energy without restoration.They enhance overall strength, balance, energy, metabolism, digestion, brain and nervous system, cardiovascular and pulmonary systems and overall health. \\nSo here’s that video demo: \\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption. Paul’s valiant contributions to the health movement and global paradigm shift are world renowned. Visit his blog by following this link and follow him on Twitter here . \\nSources:'"}, "time": 1742563782.0456471}