{"duration": 0.10969662666320801, "input_args": {"text": "'\\nDon’t just survive when the world burns, but survive in style.\\nThe election of Donald Trump signals a revolutionary fervor among a large segment of the population that is simply fed up, though it is isn’t just his supporters. The economic realities of a stagnated economy are weighing heavily upon the masses, and they are looking for outlets to address their anger.\\nIf the current protests against the election are any indication, the world is nearing ever closer to destruction, and those who can afford to do so are getting out of the path of violence, mayhem and property destruction ahead of a time. Though the dust will likely settle, the current atmosphere is somewhere between ‘anxious’ and ‘panicked’ :\\nvia CBS in Dallas/Fort Worth :\\nAn investor group is planning for a doomsday scenario by building a $300 million luxury community replete with underground homes. There will also be air-lock blast doors designed for people worried about a dirty bomb or other disaster and off-grid energy and water production. \\nResidents will enjoy an equestrian center, 18-hole golf course, polo fields, zip lines and gun ranges. Retail shops, restaurants and a row of helipads are also in the works. For those looking to “get away,” they’ll also be able to enjoy three white sand beaches and a neighborhood spa .\\n“We’ve evolved it into long-term sustainability instead of a survival community,” Trident Lakes CEO Jim O’Connor told the Houston Chronicle, adding that the 400 planned condos will house about 1,600 people.\\n“It’s not just a hole in the ground to hide in — it’s going to be one of the most plush resorts in all of Texas, if not America,” Trident Lakes spokesperson Richie Whitt told the Sherman Herald Democrat.\\n“People are getting fearful of this world … If need be, it’s going to be one of the safest places on Earth.”\\nFor those already living in the luxury class, the expense of the elaborate underground community is not only grandiose, but to me, the extra expense on comfort, entertainment and the focus on above-ground activities only suggests that they are hedging seriously on the possibility that they might have to retreat to these places for considerable time periods.\\nWe could use fancy words to describe what’s going on. Or we could just show you our Master Plan. pic.twitter.com/XYesGI7V68 \\n— Trident Lakes (@TridentLakes) November 1, 2016 \\n\\nAt any rate, the 1% has taken cues from Occupy Wall Street, Tea Party protest voters, Black Lives Matter, Bernie supporters and the populist upsurge that elected Trump – namely, that whether or not some or all of these events are manufactured, the population itself has reached the point of revolt and uprising.\\nWith such deep-seated anger and division, the wealthy are going to great lengths to ensure that they are able to live comfortably and, if necessary, completely apart from the rest of society.\\nThis elitist self-sustaining community will not only set the bar for the rich and well-connected, but for anyone looking to ensure long-term survival through sustainable living that is either off the grid, or not dependent upon it if the grid goes down.\\nWhether or not the world ever experiences a nuclear attack or apocalyptic disaster anytime in the foreseeable future, there is every sense that society itself could unravel, and that the disintegrated fabric will spread unrest, violence, riots and ruin for all that it touches.\\nAs J.D. Heyes has reported , the elite are preparing their getaways with considerable urgency:\\nWith growing inequality and riots such as those in London in 2011 and in Ferguson and other parts of the USA last year, many financial leaders fear they could become targets for public fury. \\nThe president of the Institute of New Economic Thinking, Robert Johnson, told attendees at the recent World Economic Forum in Davos (itself, ironically, representative of a class of uber-rich that exists apart from the 99.9 percent of the rest of the world) that a number of hedge fund managers and others with the means to do so were already busy planning their getaway.\\n“I know hedge fund managers all over the world who are buying airstrips and farms in places like New Zealand because they think they need a getaway,” he said. \\nFood, water, electricity, fuel (and other forms of power), firearms, medicine and skills in everything from agriculture, animal husbandry, mechanics, engine repair, shoes and clothing, tools, hunting and camoflauging will all become vital assets in building that lifeline – and people of all income brackets will need to take measures to prepare, or remain wide open and vulnerable to a society that continues to flirt with total disaster, while scoffing at measures to reduce risk and normalize.\\nThe underground shelter market is gaining in size, especially as more and more sectors are preparing to deal with the increasing importance of the threat of EMP attack.\\nNotably, engineers just announced the development of ‘conductive concrete,’ which they designed as a low cost way to shield against an electromagnetic pulse (EMP) attack.With the potential of grid failure and system wide disabling of communications, data centers, military structures, government buildings and more are investing in defensive protections, though theoretically anyone could create their own shielded room or home using these materials:\\nAccording to Phys.org :\\nNebraska engineers Christopher Tuan and Lim Nguyen have developed a cost-effective concrete that shields against intense pulses of electromagnetic energy, or EMP. Electronics inside structures built or coated with their shielding concrete are protected from EMP. \\n“EMP is very lethal to electronic equipment,” said Tuan, professor of civil engineering. “We found a key ingredient that dissipates wave energy. This technology offers a lot of advantages so the construction industry is very interested.” \\nEMP-shielding concrete stemmed from Tuan and Nguyen’s partnership to study concrete that conducts electricity [creating] – the ability to block electromagnetic energy.\\nTheir technology works by both absorbing and reflecting electromagnetic waves. The team replaced some standard concrete aggregates with their key ingredient – magnetite, a mineral with magnetic properties that absorbs microwaves like a sponge . Their patented recipe includes carbon and metal components for better absorption as well as reflection.\\n[…] Today’s shielding technologies employ metal enclosures that require expensive metal panel or screen construction, limiting their feasibility in large structures. […] The resulting patent-pending product protects building interiors from electromagnetic interference, such as radio waves and microwaves, as well as electronic eavesdropping. \\nFurthermore, this type of concrete, known as Shotcrete, can be sprayed on over existing structures – meaning that existing buildings can be upgraded for a fraction of the cost of new construction.\\nThe wealth gap that divides a few from a country devolving into desperate, revolutionary masses will be nothing compared to the doomsday gap that could follow widespread unrest, violence, war or an EMP attack.\\nPrepping has never made more sense.\\nRead more: \\nLanding Strips, Farms and Hideaways: Secret Escapes of the Elite: “The Rich Are Worried and They Should Be” \\nElite Bunker Down in “Secure, Safe Rooms Hidden in Plain Sight”… And You Can, Too \\nHow This Man Converted “Underground Shelter Using a 20 Ft. Shipping Container” \\nWhy The Elite Are Buying Secret Hideaways: “A Lot of Wealthy and Powerful People Are Quite Afraid Right Now” \\nWith Disaster on the Horizon, Elites Busy Building Luxury Bunkers: “Panic, Anxiety, Aftermath” \\nContinuity Preppers: FEMA, DHS In “Secret Orgy of Preparedness” at Secret Underground Mountain Bunker '"}, "time": 1742562119.484304}