{"duration": 0.0576167106628418, "input_args": {"text": "'Presidents never get second chances to make first impressions. So, Donald Trump’s opportunities to repeal and replace ObamaCare after this week’s failures diminish as time passes. [The late Milton Friedman in his book The Tyranny of the Status Quo noted that “a new administration has some six to nine months in which to achieve major changes if it does not seize the opportunity to act decisively during that period, it will not have another such opportunity. Further changes come slowly or not at all, and counterattacks develop against the initial changes. The temporarily routed political forces regroup, and they tend to mobilize everyone who was adversely affected by the changes, while the proponents of the changes tend to relax after their initial victories. ”  From Franklin Roosevelt’s accomplishments during his first hundred days to Ronald Reagan’s Economic Recovery Act, the signature legislative achievements of presidential administrations generally conform to Friedman’s axiom. Rahm Emanuel’s “You never want a serious crisis to go to waste” axiom proves an exception to this rule. Assassination attempts, wars, and other unforeseen events allow presidents to steamroll their legislation through Congress. A second exception involves legislation that receives bipartisan support. Reagan’s Tax Reform Act of 1986, which represented a larger cut than his initial reduction, received support from such Democrats as Senator Bill Bradley and Dick Gephardt. Bill Clinton’s reluctant welfare reform, one of the more significant legislative achievements of his presidency, similarly received support from important figures in the opposition party, notably Speaker Newt Gingrich, as most members from his own Democratic Party voted “no. ” Given the partisan rancor surrounding ObamaCare, foreseeing a scenario where the parties get together to repeal and replace seems the stuff of fantasy. And the idea of a crisis erupting that leads to repeal appears equally  . So, either the Republicans regroup to unite to get this done now or look forward to a future in which ObamaCare becomes as much as an untouchable third rail as Medicare or Social Security. For the   side, “don’t make the perfect the enemy of the good” comes to mind as the strongest argument. Instead of   Americans get ObamaCare because of the recalcitrance of conservative members of Congress. The   people want their Republican colleagues to act like they control the House, Senate, and the presidency instead of capitulating to the people who no longer control the House, Senate, and presidency as they did when ObamaCare passed. Why settle for a   status quo when they could get the status quo ante? Seven years ago, all Republicans opposed ObamaCare. Now in the majority, can’t they whip up 90 percent of their caucus in the House to repeal it? Prospects for Republicans fulfilling their    promise to the American people now look bleak. And conservatives, once again, find themselves conserving liberal laws. “We’re going to be living with Obamacare for the foreseeable future,” predicted Paul Ryan after his bill went down in flames before it even received a vote. Congressman Michael Burgess bluntly explained, “We’re done with this. ” Deflated Republican voters may similarly find themselves done with their representatives on the Hill. The GOP enjoyed a floating pitch down the middle of the plate. They whiffed. Such golden opportunities rarely present themselves. That’s the tyranny of the status quo.'"}, "time": 1742562348.977547}