{"duration": 1.5192575454711914, "input_args": {"text": "'  Recipient Email => \\nNo doubt because of the impending presidential election, we’ve had some musings on the past and future of conservatism in the pages of the New York Times this past few days. \\nRoss Douthat [ ] was first up with a column titled What The Right’s Intellectuals Did Wron g In the October 26th edition. \\nHis very short answer, in three parts: The follies of President George W. Bush delegitimized him, and the conservative intellectuals who supported him, in the eyes of conservative voters, leaving them susceptible to coarse populist appeals. Conservative intellectuals looked too kindly on the new populist-conservative media outlets that have come up the past 25 years: talk radio, Fox News, the Drudge Report, Breitbart.com. These outlets, says Douthat, are “fact-averse and irresponsible.” Our intellectuals should have taken charge and disciplined them, instead of smiling indulgently at their populist caperings, says Douthat. Conservative intellectuals, powered by populist energy, should have conducted a Long March through the institutions of the managerial state: the academy, the Main Stream Media, the courts, the bureaucracy. They failed to do this. \\nResult, according to Douthat: \\nSo it is that today, three generations after Buckley and Burnham, the academy and the mass media are arguably more hostile to conservative ideas than ever, and the courts and the bureaucracy are trending in a similar direction. \\nTwo days later, October 28th, David Brooks [ ] took up the issue in a column headed The Conservative Intellectual Crisis . \\nAgain, he fingers three causes of the crisis. We’re really in the realm of Threeness here. I refer interested listeners to the last segment of my October Diary here at VDARE.com for more explorations of that realm. Talk radio, cable TV and the internet have taken conservatism down-market, coarsening it so it no longer appeals to thoughtful, educated people. Conservatives have put too much faith in politics: “Recently conservatism has become more the talking arm of the Republican Party.” Conservatives have been too hostile to the idea of government as a tool for social good. It has offered nothing to hard-pressed working- and middle-class Americans. \\nThat’s David Brooks’ three-part diagnosis. \\nIf you got a whiff of snobbery in all that, especially from Brooks’ piece, your sense of smell is working just fine. What a shame that the genteel, cultured salons of the intellectual Right got invaded by tobacco-chewing hillbillies with mud on their boots! \\nBut that’s not my main problem with Douthat and Brooks. I don’t mind intellectual elites, and I don’t in fact believe you can have rational politics without them. I just don’t think the elites we actually have right now are any good. \\nThe liberal elites are in fact terrible: dishonest, corrupt, and in thrall to magical superstitions about human nature and society. The conservative elites Douthat and Brooks are writing about are not that bad, but they need seriously to revise some of their premises. \\nBuckleyite conservatism was a stool with three legs. (See, I can do the threes business with the best of them!) The Cold War. A good large cohort of believing Christians in the educated class. The unquestioned assumption that public affairs, both national and international, were a game played among white Europeans. \\nNone of those three things is any longer the case. The Cold War is a whole generation in the past. Religious devotion among educated Americans is fast draining away, for reasons I explained at length in Chapter Eight of We Are Doomed . And in one more generation, give or take a year or two, white Europeans will be a minority in the U.S.A., and quite possibly in large parts of Europe itself, too. \\nAmerica’s conservative intellectuals have not made the necessary adjustments. That’s what accounts for their irrelevance and impotence. \\nThey have, I’ll allow, acknowledged the end of the Cold War. They’re in denial, though, about the weakening of Christianity in our hedonistic welfare state. As for what a much earlier American writer called “The Rising Tide of Color,” conservative intellectuals like Douthat and Brooks are terrified to speak about it because they have internalized the social taboos about race talk imposed by the Liberal Establishment. \\nWith no more Cold War as a unifying principle, no more consensus on the centrality of religious faith to their program, and no courage to stand up to the race bullies, our conservative intellectuals are reduced to ineffectual arm-flapping–leaving citizens of a conservative temperament with nowhere to turn but to populism. And so, that’s where we turn. \\nUnless, of course, ineffectual arm-flapping is your thing; in which case I recommend the efforts of Ross Douthat and David Brooks. \\nFor example: How are things going in Europe with that mass Third World immigration Enoch Powell warned about in such alarmist phrases 48 years ago? Britain \\nThe current talking point: a report out of Open Democracy , a Left-liberal think-tank, about racial segregation in Britain. Sample headline : Call for action to tackle growing ethnic segregation across UK . By Anushka Asthana and Nazia Parveen , The Guardian, November 1, 2016. \\nThe segregation, which is of course voluntary, is massive. Muslims want to live among Muslims, blacks want to live among blacks, and white British people don’t want to live among either. \\nWhite flight has been dramatic. In last week’s podcast, I mentioned my uncle Fred, who lived in the Aston district of Birmingham until he died last year. When I stayed there with them in my childhood sixty years ago, there was nobody in Aston but working-class white English people, with a few Irish Catholics for variety. This new report lists Aston as still 45 percent white in 1991. In 2011, twenty years later, it was down to 14 percent white. \\nThe London borough of Newham , where I bought my first house (right) in 1970, was 34 percent white in 2001. Ten years later it was half that, 17 percent. In the Northern town of Blackburn, billed as one of the most segregated towns in Britain, one newspaper reporter found a butcher who declared he had never served a white person in the entire year he’s been in business. ORDER IT NOW \\nNot that there is no contact at all across the race lines. Every couple of years there is another news story about Muslim men raping and prostituting white British teenage girls: “grooming” is the newspaper euphemism. Quote from one such story , the men in this case being Somalis , quote: \\nSeveral of the girls … believed the sexual abuse was part of loving relationships they were having with the defendants, and that having sex with their “boyfriend’s” friends was part of their “culture and tradition.” \\nMulticulturalism, you see? \\nIn short, a complete failure of integration and assimilation–just as Enoch Powell predicted. \\nThe authors of the report recommend unspecified measures to encourage white Britons to stay put when minorities colonize a district. The rationale here is presumably Contact Theory , which says that prejudice arises from isolation and ignorance, and that when people get to know each other prejudice melts away. \\nContact Theory was launched by American psychologist Gordon Allport back in 1954. Subsequent events, and indeed subsequent research in the human sciences , have shredded it. We now know that familiarity mostly breeds not harmony and understanding but rancor and conflict. France \\nCrossing the English Channel, we find ourselves in France, whose capital city, once a favorite with tourists for its elegance, beauty, and civilized life, is now a dogpit of warring African and Middle Eastern street gangs. \\nIt got worse this week after French authorities demolished a huge camp of illegal aliens near Calais. A big group of the illegals headed for Paris, where they got into running street battles with illegals from Afghanistan and Eritrea already camped there–right there in the streets of Paris: \\nA mass brawl broke out as migrants in Paris attacked each other with sticks —hours after authorities moved in to smash up an illegal city centre camp. Pictures show men lunging at each other with makeshift clubs last night next to a row of tents in the Stalingrad district of the French capital. \\nAmid chaotic scenes, gangs of men were seen brandishing pieces of wood and squaring up for a street battle. Germany \\nFrom the UK Express : \\nDuring the first six months of 2016, migrants committed 142,500 crimes, according to the Federal Criminal Police Office.[ ‘We are losing control of the streets’ Merkel’s Germany descends into lawlessness , by Siobhan McFadyen , November 2, 2016] \\nAnd Germany has been hit by a spate of horrendous violent crime including rapes, sexual and physical assaults, stabbings, home invasions, robberies, burglaries and drug trafficking. \\nGerman police say they are losing control of the streets to the foreign invaders. In Leipzig, a ten-year-old girl was raped by an illegal. In the town of Bautzen, in the far east of Germany, there are regular street battles between local Germans and illegals. [ GERMANY AT BOILING POINT: Furious mob takes to streets hunting and attacking migrants , By Allan Hall, UK Express , November 3, 2016] Denmark \\nDenmark has its own report on white flight .[ MP blasts ‘soft-touch’ migrant policy as Denmark struggles with 31 ghettos , B y Lizzie Stromme, UK Express , November 2, 2016 ] That nation now has 31 ghettos, says the government, defined as areas with more than 50 percent minority residents. Sweden \\nSwedish police are struggling to cope with a massive crime wave caused by immigrants. There are now 52 areas where police officers can’t cope with the levels of crime being committed, according to the government. [ Sweden on the brink? Police force pushed to breaking point by violence amid migrant influx , By Lizzie Stromme, UK Express , November 2, 2016] Arson against automobiles is especially popular. The city of Västerås, in central Sweden, population 110,000 has seen 88 cars set alight so far this year. Sweden’s police forces are seeing mass resignations of officers.[ Arson attacks carried out by migrants are fault of ‘racist Swedes’ – says refugee , Lizzie Stromme, UK Express , October 31, 2016] And so on. This is the great catastrophe of our time: The willed self-destruction of Western civilization by nations that have disarmed themselves before the enemy, disarmed themselves with sentimentality and guilt and crazy economic fantasies. ORDER IT NOW \\nWe all thought the Third World War would be fought between Russia and the West, in mighty tank battles on the plains of Eastern Europe; or else between China and the U.S.A. in the Western Pacific, with carrier groups and submarines chasing each other around the sea and Marines storming up the beaches of tropical islands. \\nNo: This is World War Three, the First World vs . the Third World. To date, the First World is losing. Losing? It’s barely even fighting. \\nAn admirable outfit named the Victims of Communism Memorial Foundation released a report in October on American attitudes to communism and socialism . It makes depressing reading, especially those parts dealing with knowledge and opinions among millennials —that’s people born from the early 1980s to the mid 1990s. \\nSample: Of those millennials familiar with Vladimir Lenin, 25 percent have a favorable view of him. \\nAnd oh —did you know? —the American Communist Party is backing Mrs. Clinton’s candidacy . Mrs Clinton has of course loudly repudiated their support when challenged about it by interviewers. Oh, wait … \\nIn related news, here’s a chap named Duke Pesta, currently an associate professor of English at the University of Wisconsin, Oshkosh. Every year at the beginning of the school year Prof Pesta gives quizzes to his students to test their knowledge on basic facts about American history and Western culture. \\nHe declares that students overwhelmingly believe that slavery was a phenomenon exclusive to the United States: “Most of my students could not tell me anything meaningful about slavery outside of America.“ \\nIt goes without saying that they know nothing about the history of communism, either. \\nThese are the fruits of decades of utterly corrupted education, the corruption seeping down from our universities, to the schools of education, to the high schools and elementary schools. We now have a whole generation raised with a radically false view of the past. History has been rewritten, and the rewritten version prevails. \\nThe triumph of Cultural Marxism could not be more plain–nor could the ineffectuality of the “conservatism” that Ross Douthat and David Brooks are waxing nostalgic over. (Reprinted from VDare.com by permission of author or representative)'"}, "time": 1742563519.0786903}