{"duration": 0.07074165344238281, "input_args": {"text": "'Part 4 Of O’Keefe’s Project Veritas Videos Has Americans Asking 1 Question   Rebecca Diserio   \\nThe fourth part of James O’Keefe’s Project Veritas year-long sting operation was just posted today, and it’s shaken Hillary Clinton’s campaign in more ways than one. You’ll be shocked to learn more ways these Democrat thugs attempted to rig our election, taking illegal money and committing serious crimes that all point right back to Hillary. Pissed off Americans are now left asking just one question. Democratic thug Scott Foval \\nRobert Creamer, who has visited the White House over 300 times and met personally with Barack Obama 47 times, was caught in an undercover sting operation, illegally taking $20,000 for Hillary Clinton’s campaign from a “foreign donor” who was really an undercover journalist for Project Veritas, but it gets worse. \\nProject Veritas decided to give them the illegal contribution from a bank account that they set up in Belize to prove to Creamer they were not plants and to get Creamer to trust the Project Veritas journalist. Knowing Creamer was in deep, doing dirty deals for Hillary Clinton, it was worth risking the 20 grand, and at the very least, they busted the Democrat operatives taking an illegal donation. \\nCreamer took the bait in the form of 20 grand, and it gave the Project Veritas journalist access to all of the other lower level Democratic operatives who then confided all of their dirty dealings. Democratic operative dirty deal man Bob Creamer & his wife Congresswoman Jan Schakowsky (D-Illinois) \\nCreamer spilled the beans, linking him directly to Hillary’s campaign, which is totally illegal under campaign finance laws. Plus, in earlier videos, Creamer was exposed for being guilty of inciting violence at Trump rallies and potential voter fraud schemes. Here’s Creamer talking, not knowing he is being recorded: \\n“Every morning I am on a call at 10:30 that goes over the message being driven by the campaign headquarters … I am in this campaign mainly to deal with what earned media with television, radio, with earned media and social media, not with paid media, not with advertising.” He also mentions a conference call discussing a woman potentially coming forward to accuse Trump of inappropriate behavior . [via Breitbart ] \\nDid you get that last sentence? He threw in there that he would be discussing another woman who they knew in advance was going to coming forward to accuse Donald Trump. That’s highly suspicious, to say the least. How would this guy, Creamer, know in advance about something like that? \\nElsewhere in the video , Creamer adds, “I do a lot of work with the White House on their issues, helping to run issue campaigns that they have been involved in. I mean, for immigration reform for the… the health care bill, for trying to make America more like Britain when it comes to gun violence issues. ” \\nLook, so far, there are so many counts of illegal activity exposed here that the majority of comments from the American people are demanding an answer to one question: Where in the hell is the FBI? \\nCreamer is a major player who meets with the president 47 times and runs dirty operations for Hillary Clinton. He has taken 20 grand from an illegal foreign donor, which they give back after they find out Project Veritas busted them in a sting, but that doesn’t make it go away nor does it make any of the other crimes they have committed for Hillary go away either. \\nIt’s time for the FBI to step up and do some law enforcing. Even if Obama continues to shield Hillary Clinton, a criminal who cannot be president, that doesn’t make these crimes go away. Just wait until Donald Trump wins this election — all of these criminals in Washington will pay.'"}, "time": 1742564162.6742003}