{"duration": 0.1105191707611084, "input_args": {"text": "'\\nThe Libertarian Party has been shooting itself in the foot since the beginning with large amounts of misstatements, judgement errors and wrong policies, but now they finally decided to shoot themselves in the head.\\nWhat Libertarian VP Bill Weld just did, is going to destroy and bury the Libertarian Party forever. There is no going back from this one.\\nI mean, WHAT IS ALEPPO??? , I guess I’m having an Aleppo moment (when being asked to name a single foreign leader), sticking his tongue at a woman who interviewed him , having mental collapse reactions on camera , are imbecilic errors which some followers could forgive but no one can forgive this one.\\nSo this is what the Libertarian movement was all about. Total stupidity, betrayal and cuckoldry!\\nRon Paul, chief Libertarian cuckold whom we strongly supported back in the past (and you can search and look at our older 2008-2012 articles as proof that we actually DID strongly supported him) endorsed the Libertarian Party first on CNN and then on FOX Business clowns Bill Weld and Gary Johnson who threw a George Washington gun replica in the garbage , pledged to sign TPP , open borders plus many others and now this, clown number 2: Bill Weld directly endorsing Hillary Clinton.\\nLibertarian vice presidential candidate Bill Weld is under fire from members of his own party and from GOP after espousing support for Democrat presidential hopeful Hillary Clinton. Appearing on MSNBC’s The Rachel Madcow Show Tuesday, Weld told Libertarian voters in the battleground state of North Carolina to instead give their vote to Hillary, claiming “Donald Trump is a threat to the country”. Sure he is! He’s a THREAT to corruption and that’s exactly why the people want him.\\n“We are making our case that we’re fiscally responsible and socially inclusive and welcoming and we think we got on the merits the best ticket of the three parties if you will. And so we’d like to get there.”\\n“Having said that as I think you’re aware I see a big difference between the R candidate and the D candidate and I’ve been at some pains to say that I fear for the country if Mr. Trump should be elected. I think it’s a candidacy without any parallel that I can recall. It’s content-free and very much given to stirring up envy and resentment and even hatred. I think it would be a threat to the conduct of our foreign policy and our position in the world at large.”\\nStating voters in North Carolina may decide the outcome of the 2016 election, Madcow asked why a Libertarian voter fearing Trump should vote for Hillary rather than Weld and his running mate Gary Johnson.\\n“I’m here vouching for Mrs. Clinton,” Weld told Maddow, “and I think it’s high time somebody did.”\\nEarlier this year, Weld said he would dedicate remaining efforts in the campaign toward staving off a Trump presidency.\\n“The libertarians are reaching levels of cuckoldry never thought possible,” writes Chris Menahan for Information Liberation .\\nAfter this one, the Libertarian movement is DEAD, the very heads of the Libertarian movement, Ron Paul, Gary Johnson and Bill Weld killed the movement! Libertarians are disgusting cucks who like to watch their wives getting kissed by other men (censored version). And this is exactly what they are, cucks! Just watch the photo above, who in the world names their WI-FI “Cuckoo”??? They even spelled WI-FI “Wifi” with small letters and no minus line. Someone who would read it fast without paying too much attention, could end up reading “Wife: Cuckold”. You can’t make this stuff up!\\nThey like to watch the Constitution, morality, ethics, principles being screwed by Hillary Clinton!\\nLibertarians/cuckservatives: muh principles!\\nWe, the EU Times: Well what’s your principles?\\nLibertarians/cuckservatives: Open borders, TPP, destruction of 2nd Amendment, Christian oppression and Muslim immigration, pro-abortion, outsourcing of jobs, not standing up to government corruption and vote rigging! Define those principles of yours you cuckolds!\\nRon Paul is a disgrace for supporting this cuckoldry! We disavow Ron Paul and we SPIT on all his previous work! We regret ever supporting him! Ron Paul got himself rich with millions of dollars in grassroots donations and when they stole votes from him (and they did steal from Ron Paul) the weakling cuck that he is didn’t had the courage to stand up to himself and to his voters and say or do something. He’s a snake just as bad as Ted Cruz and Glenn Beck!\\nThe Libertarians are DEAD, Long live the Nationalists! Thanks to Trump, we now have a better, improved movement, more authentic and principled than ever before!\\nHere’s principled libertarian Bill Weld endorsing Hillary Clinton:\\n\\n'"}, "time": 1742563268.7930152}