{"duration": 0.08293700218200684, "input_args": {"text": "'PALM BEACH, Fla.  —   For some of the businesses and government agencies that surround President Trump’s “Winter White House,” the effects of his frequent weekend getaways to    can best be told in numbers. ■ $200, 000 in lost fuel sales at a large local airport in a single   visit this month. ■ 75   at a new restaurant in just one night. ■ $60, 000 a day to pay overtime to sheriff’s deputies who guard the many closed roads, a tab that is about $1. 5 million over all since the election. ■ 250 private flights grounded every day. A month into his presidency, Mr. Trump arrived at    his private club here, for a third weekend in a row this Presidents’ Day weekend. For the locals, that’s at least three days of clogged roads and strict security protocols that hurt local businesses and frustrate residents. Although economic development officials are ecstatic over the free publicity provided by news reporters’ live waterfront shots  —   and the excited buzz in the area is palpable  —   others are exasperated over the drain on small businesses and the circuitous routes residents have to drive to avoid two miles of closed roads. Secret Service rules restricting private flights have grounded operations at  Palm Beach County Park Airport in Lantana, nine miles south of Mr. Trump’s club, where most of the business is conducted on Saturday and Sunday. That means no parachute jumping, banner advertising, flight lessons or chopper trips. Business owners there are hoping that a president who campaigned on improving the economic prospects of the little guy will be sympathetic to the havoc his visits wreak. “This is a good test of his words versus his actions,” said Jonathan Miller, whose company, Stellar Aviation Group, runs the airport. He said he had lost $30, 000 with each of the president’s visits. Dave Johnson, the owner of Palm Beach Aircraft Services, which maintains and operates planes at Lantana, said he employs eight people full time and provides transportation for clients including doctors, lawyers and other professionals who travel throughout the country for work. But when Mr. Trump is in town, no private flights can take off within a   radius, and arriving flights have to first stop elsewhere for security clearance. “We never dreamed that he’d be here every weekend  —   that’s the killer,” Mr. Johnson said. “I’m getting customers that have been with me for years, and they’re actually moving their aircraft to other airports so they can fly. ” The Palm Beach County airport director’s office tallied the losses during Mr. Trump’s visit Feb. 3 to 6 to   . A sightseeing business canceled 19 tours and turned away a dozen  . One flight school business had to scratch $14, 000 worth of flight lessons. One company is in negotiations to move its   fleet out of the county, which would mean a loss of a quarter of the airport’s fuel sales, according to the office’s analysis. “It’s a very busy airport with a lot of   men trying to make a living,” said Bruce Pelly, the airport director for Palm Beach County. “You got flight training, aeronautics, a propeller shop, paint shops, maintenance companies. You got all kinds of businesses going on down there. We are obviously trying whatever we can to get that airport functioning in some form or fashion. ” Mr. Pelly said he had “offered everything we can think of” to make the airport secure. The Secret Service’s response so far: “No. ” The White House and the Federal Aviation Administration referred calls about the matter to the Secret Service. The Secret Service did not respond to requests for comment. “In their view, that airport is too close to  ” Mr. Pelly said of his conversations with the Secret Service. “We are not giving up. ” Jorge Gonzalez, who owns SkyWords Advertising, said he might have to. He said his business had lost $42, 000 because of Mr. Trump’s visits, during which his   planes were grounded. He hopes to last through May, but his wife said that at this rate, 30 days was more likely. “We are hoping his visits slow to once a month,” Mr. Gonzalez said. This isn’t the first time a president’s travels have caused local disruptions. President Barack Obama’s visits to Hawaii were a source of frustration for pilots and aviation businesses there that had to abide by similar restrictions. And President Bill Clinton’s frequent visits to White Plains during his presidency brought additional chaos to an already busy Westchester County Airport. Sascha Bennemann opened Costa Palm Beach, a Mediterranean restaurant at the Esplanade shopping complex at the east end of the county’s toniest shopping district, Worth Avenue, just as Mr. Trump began his regular trips. On the second Saturday in February, when a   stretch of South Ocean Boulevard that runs in front of    was closed, cutting the town in two, 70 people did not show up for dinner, amounting to a loss of about $5, 000, Mr. Bennemann said. He showed a photo of himself golfing with Mr. Trump last year, to underscore: “It’s nothing personal. ” Mr. Bennemann noted that increased foot traffic had offset some of his losses, and other Worth Avenue shop owners also said the visits had brought an increase in pedestrians. “For us, we have had some of the best days ever on weekends,” said Tatiana Van Zandt, who owns Trillion, a luxury clothing store. “The hum is exciting. ” Kelly Smallridge, the president and chief executive of the Business Development Board of Palm Beach County, said her agency would never have been able to afford the countless hours of free publicity. “Certainly this is the greatest advertising campaign in terms of name recognition an economic development board can hope for,” Ms. Smallridge said. Although Palm Beach had already been viewed as a place to vacation or retire, Mr. Trump’s visits have brought “panache and glamour,” which have caught the attention of a wider spectrum of people, including hedge fund and money managers, she said. Laurel Baker, executive director of the Palm Beach Chamber of Commerce, said, “If we want to be the Pollyanna of Palm Beach, all of the focus on the town is wonderful. ” Residents on that   stretch of closed road have to carry ID cards to get back to their homes, even when out walking their dogs.    Club members must park their cars at a parking lot down the street to be screened before they can enter through the club’s south entrance. The road closing splits the island in half, forcing residents to drive off the island into neighboring West Palm Beach if they want to shop or eat on the other half. The road was closed again at 8 a. m. Friday and was expected to remain closed till late Monday evening. “No one is for road closures it’s an inconvenience,” said Kirk Blouin, the town’s public safety director. “But most recognize it’s a necessity for the security of the president. ” St. Catherine Greek Orthodox Church, in West Palm Beach at the western end of the Southern Boulevard Bridge, was holding its 42nd annual Greek Festival this weekend. “If they see the road closed, they will find something else to do,” said the Rev. Andrew Maginas, who said the festival was a critical  . “We pray for him at every service to do right by our country, but we are sad that his visit comes during our festival. “We are hoping he can build a helipad soon on    grounds. ”'"}, "time": 1742628317.37497}