{"duration": 0.1043093204498291, "input_args": {"text": "'Seven of the 12 jurors who convicted Ronald B. Smith in the murder of a convenience store clerk voted to spare his life. When the case reached the Supreme Court, four of the eight justices voted to stay his execution. The arithmetic of capital punishment can seem curious. Mr. Smith was executed Thursday night. Mr. Smith was convicted of murdering the clerk in 1994 in Huntsville, Ala. The jury recommended life without parole, but the trial judge overrode that determination, sentencing Mr. Smith to death. Alabama is the only state that allows such overrides. It is a good bet that the Supreme Court will soon weigh the constitutionality of the practice. That will be too late for Mr. Smith, who came up one vote short on Thursday night, illuminating a lethal gap in the Supreme Court’s internal practices. It takes four votes to put a case on the court’s docket, but it takes five to stop an execution. Over the years, in fits and starts, some justices have sought to address this anomaly by casting a “courtesy fifth” vote to stay an execution when four justices thought the case worthy of further consideration. In a 1985 concurrence, Justice Lewis F. Powell explained his reluctant decision to supply such a courtesy vote. The inmate’s case had “no merit whatever,” he wrote. “But in view of the unusual situation in which four justices have voted” to hear it, he wrote, “and in view of the fact that this is a capital case with petitioner’s life at stake, and further in view of the fact that the justices are scattered geographically and unable to meet for a conference, I feel obligated to join in granting the application for a stay. ” Chief Justice John G. Roberts Jr. was asked about the practice at his confirmation hearing in 2005. “How would you feel, if you were chief, if you had four of the justices now voting for a stay of execution?” Senator Patrick J. Leahy, Democrat of Vermont, asked. “Do you feel as chief you would do the courtesy of kicking in the fifth one?” Chief Justice Roberts seemed receptive. “I don’t want to commit to pursue a particular practice,” he said. “But it obviously makes great sense. ” “You don’t want to moot the case by not staying the sentence,” he added. In the 11 years that Chief Justice Roberts has led the Supreme Court, its commitment to such courtesy votes has been inconsistent. Until Thursday, though, it seemed to be on the upswing. The recent trend started with a case on transgender rights. A Virginia school board wanted to stop a transgender boy, Gavin Grimm, from using the boys’ restroom at his high school while the Supreme Court considered an appeal from a decision in Mr. Grimm’s favor. In August, the court’s four more conservative members  —   Chief Justice Roberts and Justices Anthony M. Kennedy, Clarence Thomas and Samuel A. Alito Jr.  —   voted to grant a stay. Justice Stephen G. Breyer added a fifth vote “as a courtesy. ” Justice Breyer’s motives were not hard to discern. He was concerned about execution chambers, not restrooms. The only case he cited in his concurrence in the transgender case was Medellin v. Texas, a death penalty decision in which he had expressed frustration that “no member of the majority has proved willing to provide a courtesy vote for a stay. ” Last month, Justice Breyer’s gambit seemed to pay off. On Nov. 3, the court considered an application for a stay of execution from another Alabama death row inmate, Thomas D. Arthur. Chief Justice Roberts provided the fifth vote needed to halt the execution. He said he would not ordinarily have favored a stay, but noted that four justices had voted in favor of one. “To afford them the opportunity to more fully consider the suitability of this case for review,” Chief Justice Roberts wrote, “I vote to grant the stay as a courtesy. ” On Thursday, in Mr. Smith’s case, the court’s more liberal members  —   Justices Breyer, Ruth Bader Ginsburg, Sonia Sotomayor and Elena Kagan  —   voted for a stay. But this time there was no courtesy fifth vote. Upon hearing that news, Mr. Smith’s lawyers immediately filed a   request for reconsideration. “The court should not permit executions in the face of four dissents,” the motion said, adding that the court’s practices in this area “clash with the appearance and reality both of equal justice under law and of sound judicial decision making. ” That motion was denied, too, this time without noted dissent. The leading student of the courtesy fifth is Eric M. Freedman, a law professor at Hofstra University. The title of his 2015 law review article on the subject makes his views plain: “No Execution if Four Justices Object. ” On Thursday night, as it became clear that Mr. Smith was going to die, Professor Freedman made a more modest point. The justices, he said, should at the least explain their reasoning and standards. “The time has long ago passed for the court to address forthrightly a situation which is simply unseemly,” Professor Freedman said. “For people to live or die in the middle of the night on the basis of no visible rule is simply at odds with any defensible system of judicial decision making. ”'"}, "time": 1742564540.0237832}