{"duration": 0.05518507957458496, "input_args": {"text": "'At 1:00 a.m. on Wednesday, Nov. 2, 2016, Scott Michael Greene, a 46-year-old father of three, would change Urbandale, Iowa, forever. Officer Justin Martin and Sargent Tony Beminio were found shot and killed 20 minutes apart, Wednesday morning. Per authorities, Greene ambushed both Martin and Beminio while in their police cruisers, at two separate locations. Ambush-style shootings on police officers have been a common story on local and national news outlets.\\nOn July 17, Gaven Long took the lives of three Baton Rouge police officers. His motives were uncertain but his anger toward white police officials was clear. Recordings of Long ranting and raving about racial injustice surfaced on social media websites days prior to the shootings. Also, Long wore a self-made body camera and visited Dallas, where five officers were killed less than two weeks before his own rampage. There is no physical connection between Long and the Dallas shooter, their mental states were similar.\\nMicah Xavier Johnson, who fatally shot five Dallas officers, believed racial injustice was out of control. Despite his feelings toward police and the black community, Johnson’s stepmother was white and he was not known to “pick particular sides with race.” Johnson was killed by police officers who used a bomb-wearing robot, following the shootings. This left his motivation for the shootings a mystery. Not all police ambushes are incited by racial discrimination.\\nOn Sept. 12, 2014, Eric Frein opened fire on the Blooming Grove state police barracks, in Pennsylvania. One officer died and another was severely wounded. U.S. Marshals would later find Frein, 50 days later, in an airport hangar. He was discovered 23 miles from the barracks. Frein had expressed anger toward law enforcement but the reason for his anger has not been understood. What drives people such as Frein, Johnson, Long, and Green to go and act out such heinous crimes? Perhaps a mental illness can be blamed for such disturbing behavior.\\nThe mourning continues for the two officers who lost their lives early Wednesday morning. When a tragedy strikes a community, historically, the people come together. This is what is happening in Urbandale, Iowa.\\nBy Amy Weins\\nEdited by Jeanette Smith\\nSources:\\nDes Moines Register: Suspected police killer had history of run-ins with authorities\\nThe Advocate: Before Bloodshed: Where Gavin Long stayed, what he preached, odd encounters all on video\\nDallas News: Ousted from army, Dallas shooter used military skills for murder\\nPocono Record: Suspected State Police killer Frein Caught near abandoned airpark\\nImage Courtesy of Brandon Anderson’s Eric Frein , Gavin Long , Micah Johnson , Scott Greene , shooting'"}, "time": 1742561849.1467505}