{"duration": 0.04775834083557129, "input_args": {"text": "'ISTANBUL (AFP)  —   Turkish President Recep Tayyip Erdogan took the country’s lawmakers to task Friday over an “ugly” brawl in parliament during a vote on a hugely controversial bill bolstering his powers left several injured. [The fight broke out on Thursday as lawmakers voted on parts of the   bill to change the constitution to create an executive presidency, with one deputy suffering a broken nose and another claiming his leg was bitten.  “A very ugly situation like breaking the nose of our deputy friend and biting the leg of another is not suitable for any member of parliament,” Erdogan said in a televised remarks in Istanbul. One MP was held in a chokehold while another was left bleeding from the head. The fighting saw chairs and punches thrown while an ornamental flower pot was also seen flying through the air. But the tensions so far do not appear to have slowed the new constitution’s passage which is being debated article by article and will have two readings. While critics say the move is part of a power grab by Erdogan for   rule, supporters say it will put Turkey in line with France and the US and is needed for efficient government. Eight of the 18 articles have now been approved with the   majority required for it to be submitted to a referendum expected late March or early April. The ruling Justice and Development Party (AKP) has sufficient votes thanks to an alliance with the opposition Nationalist Movement Party (MHP). But the main opposition Republican People’s Party (CHP) is fiercely against the changes and has boycotted the vote. Erdogan said Friday after the fighting that if parliament “is incapable of working” then snap elections could be on the agenda. “It (early elections) could be conceivable. We could think about it,” he said. The CHP and AKP blamed each other for the fighting. AKP lawmakers took to Twitter to slam “the scumbag” who left tooth marks on their fellow MP. The biter’s identity was not made clear. There were reports Friday that a heavy and very expensive microphone seized from the chamber’s lectern had been broken off and used as a weapon during the rumpus. Despite the tensions, all articles of the bill have been passed easily so far and Erdogan said he believed the first round of voting would be “completed within the week”. “The real owners (of the constitution) are the people. They will decide on this,” he said about the referendum.'"}, "time": 1742563355.4132185}