{"duration": 0.10448694229125977, "input_args": {"text": "'The NBC news release for Monday’s “The 2016 S. N. L. Election Special,” which will compile recent “Saturday Night Live” political sketches, promises to “retrace the highlights of the current presidential campaign. ” That’s the first joke right there: that any part of this exhausting, acrimonious,   campaign can be considered a highlight. As Alec Baldwin put it, breaking character as Donald J. Trump on the last Saturday before the election: “Don’t you guys feel gross all the time about this?” But it’s undeniable that the race has blessed “S. N. L. ” with material. And cursed it. “S. N. L. ” faced   expectations: first, to wring laughs out of a national nervous breakdown, and second, to improve on a political reality so   that it writes its own penis jokes. “S. N. L. ” couldn’t manage that, at least when it’s taken the candidates head on. But it’s done some fine work around the election’s edges. “S. N. L. ” is a mainstream media institution, no less than “Meet the Press” or the presidential debates. (We’ve had televised   debates on a regular basis only since 1976, a year after “S. N. L. ” started.) So there’s a kind of dutifulness to its election satire, which unfolds with all the ritual merriment of a candidates’ pancake toss at a state fair. The big change the show made this fall was to bring in Mr. Baldwin to  . His boorish Trump felt like penance for “S. N. L. ” having let the candidate   the show last November during the Republican primary campaign, and maybe for NBCUniversal’s larger entanglements with him  —   the former “Apprentice” host, sucked up to by Billy Bush, coddled by Matt Lauer, patted like an apricot sheepdog by Jimmy Fallon. Was Mr. Baldwin’s Trump good? Mimetically, it was worthy of a biopic. If I try to visualize Mr. Trump from the debates now, I see Mr. Baldwin instead, hulking,   his lips pursed open like the suckers of some   creature. But there wasn’t a distinctive spin on Mr. Trump as a character, the way Kate McKinnon developed her Hillary Clinton long ago into a savage yet sympathetic portrait of political thirst. The scripts mainly highlighted moments, like Mr. Trump’s lurking in the second debate, that the writers’ room of Twitter had already hashed out in real time. Like any establishment institution, the show is prey to conventional wisdom. After the “Access Hollywood” Trump tape, “S. N. L. ” followed mainstream pundits’ conclusion that the election was over. The   sketch introduced the Democratic candidate as “President Hillary Clinton,” and Mr. Baldwin’s Trump declared, “I’m going to huff, I’m going to puff, and I’m going to blow this whole thing. ” (This, by the way, was the episode that enraged the real Mr. Trump on Twitter  —   “Alec Baldwin portrayal stinks. Media rigging election!”  —   and if the past year and a half taught us anything, it was being treated as a loser, not Mr. Baldwin’s huffing and puffing, that set him off.) The show hasn’t been able to   Mr. Trump’s   caricature, but then, neither has the rest of   comedy. He’s been a pulsating orange sun that blinds any comedian who stares at it directly. Which may be why “S. N. L. ” has been most effective when it’s looked past the candidates. “Celebrity Family Feud: Political Edition” sketched the motley circus of surrogates and campaign allies, including Ivanka Trump (Margot Robbie, her hair apparently blown by an offscreen fan) a vampiric Vladimir Putin (Beck Bennett) and Bill Clinton (Darrell Hammond, slipping on the role like an old sweatshirt). The taped short “A Day Off” imagined Mr. Trump’s campaign manager, Kellyanne Conway (Ms. McKinnon) having a free day interrupted by repeated calls to defend the indefensible on CNN. (“Of course Mr. Trump thinks that Mexicans can read, and actually what he wants them to read the most is Hillary Clinton’s 33, 000’s missing emails”  —   an only slightly exaggerated version of a familiar    ballet.) By far the season’s peak was an installment of the returning   sketch, “Black Jeopardy! ,” with Tom Hanks as Doug, a Trump supporter, answering    questions against two black contestants (Sasheer Zamata and Leslie Jones). Doug, to everyone’s shock, got one response after another right. Prompted with the answer, “They out here saying, the new iPhone wants your thumbprint ‘for your protection,’” he answered, “What is: ‘I don’t think so. That’s how they get you. ’” The host (Kenan Thompson) was surprised  —   “Yes!”  —   even relieved. This   white guy was on the same wavelength as his black guests, suspicious of authority, anxious to make ends meet, unimpressed with skinny women. It was cathartic, almost moving. Despite all the vitriol out there, maybe they weren’t all that different? Then came the final category: “Lives That Matter. ” Said the host, “Well, it was good while it lasted, Doug. ” This wasn’t just the best sketch of the “S. N. L. ” election season. It was some of the best political analysis of the campaign, making a nuanced point about white Trump supporters and minorities, race and economic anxiety. Doug and his black counterparts, it said, have real issues in common  —   and a real, ultimate difference they may not be able to get past. The final cold open with Mr. Baldwin and Ms. McKinnon likewise turned its focus from the candidates to us. It started in straight campaign mode, portraying Mr. Trump being supported by the F. B. I. Mr. Putin and the Ku Klux Klan while CNN obsessed over Mrs. Clinton’s email. Then the two actors broke off, declared that they were tired of hurling insults, and ran into the streets of Manhattan to hug   before returning to urge the audience, in Ms. McKinnon’s words, to “choose what kind of country we want to live in. ” This too was a staged bit. But it also felt like a concession. The election, it said, has taxed the limits of typical election comedy, of     poking at foibles. It’s become an emotionally draining, terrifying,   culture war into which we’ve been drafted. It was hardly the most hilarious election sketch “S. N. L. ” has ever done. But it may have been the right place, this year, to stop: peering beyond the vanishing edge of satire to the point at which all this stuff is no longer funny.'"}, "time": 1742562956.9325962}