{"duration": 0.11642742156982422, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) When the comedian Maz Jobrani was asked to deliver the 2017 commencement address at U. C. Berkeley, he immediately said yes. Later, it sank in  —   this is a big deal. Past speakers have included scholars, innovators and statesmen. “And then it becomes daunting,” he said, “because you go, ‘Oh my God I’ve got to write something and it’s going to go on the internet and the whole world’s going to see it. ” Mr. Jobrani himself graduated from Berkeley in 1993, then started a doctoral program in political science at U. C. L. A. before walking away for comedy. In a news release, a student leader suggested the appearance by Mr. Jobrani, who fled Iran as a child with his family in 1978, would resonate in a time of discord over immigration and Islam. We caught up with Mr. Jobrani by phone in Los Angeles, where he lives. Some excerpts: Q. Have you been thinking about what you’ll say? A. Oh my God, Mike, I’m losing sleep over it. I’m serious. I wake up at, like, 5 in the morning with ideas and I jot them on my iPhone. One of the challenges for me is, being a comedian, they expect me to be funny too. If you watch one of my favorite [commencement addresses] with Conan O’Brien at Dartmouth  —   so brilliantly written and so funny for 15 minutes or so. He’s just killing it. And then he goes into his story of being ousted by Jay Leno and so then it becomes poignant. And I’m just watching and I’m going, ‘Oh, my God. How did he do that?’ Q. You’ve become more political on stage. What worries you right now? A. Trump doesn’t go a day without worrying me. It seems like everyday there’s something new. And then as a comedian I’ve been also saying, ‘It’s hard to keep up with the guy,’ because he just does something outrageous every day. Q. Tell me about your experience at Berkeley. A. It was four of the best years of my life. I really loved it. I remember being taught to think critically at Berkeley. But there was also interesting stuff. We had a guy back then called the Naked Guy, who was just this guy who was a nudist who was a student who would go to class with like a little sheet around his midsection and that was it. You used to see him walking around and sometimes he’d just have it hanging out, and it was like, ‘Well, this is Berkeley.’ Q. If you could go back and talk to Maz in 1993, what advice would you give? A. Follow your heart. Do what you love. Because I was constantly struggling with that. If it’s in your heart go for it. Don’t listen to other people. Q. Any smaller advice? A. Be kind. It feels good. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Three people were killed, including an    at a San Bernardino school in an apparent  . [The New York Times] • Photos: Anxiety and sorrow in San Bernardino. [The Sun] • A voting law meant to increase minority representation did little  —   except to generate lawsuits. [Los Angeles Times] • In a milestone, solar power temporarily met roughly half of all electricity demand across a swath of California. [San Francisco Chronicle] • As California moves to become the nation’s first “sanctuary state,” other states are poised to follow. [The New York Times] • Wells Fargo executives were ordered to pay back $75 million after a scathing report on the company’s fraud scandal. [The New York Times] • In 2014, a former tribal leader fatally shot four people during an eviction dispute. She’s now been sentenced to death. [Sacramento Bee] • Tesla surpasses another established rival, General Motors, in market value. [The New York Times] • Locol, the California   chain, has found a way to serve the highest quality coffee for just $1. [The New York Times] • After a lot of eating out, a food critic compiled the 75 best restaurants in Orange County. [Orange County Register] The Pulitzer Prizes were announced Monday. Among the honorees was the East Bay Times, which took the breaking news prize for its “relentless coverage” of the Ghost Ship fire last year. You can see the reporting here. In an editorial, the newspaper said its work on the tragedy has just begun. Some of most stunning imagery of our bountiful spring has been from the Carrizo Plain. Situated east of San Luis Obispo, the   long grassland has been lit up by   wildflowers. Among the blooms are baby blue eyes, orange poppies, purple bush lupine and goldfields  —   all set against rare green canvas. Matthew O’Brien, a Bay Area reader, shared a photo he took in late March facing the normally dry Soda Lake and the Temblor Range, which forms the eastern border of the Carrizo Plain. The area is vast, open, and usually desolate. But word of the   superbloom has been drawing thousands of   visitors, said Gabe Garcia, a field manager at the Bureau of Land Management. “It’s something that’s kind of a     type of event,” Mr. Garcia said. The show won’t go on forever. Mr. Garcia predicted the flowers would start to wither within a few weeks as the weather turns warmer and drier. “Once that happens, everything kind of goes back to the way it was,” he said. Here are a few more pictures by Bob Wick, a Bureau of Land Management photographer. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis.  California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U. C. Berkeley.'"}, "time": 1742561959.4509766}