{"duration": 0.1818523406982422, "input_args": {"text": "'Tweet (Image via intoday.in) \\nThis week, the Central government proved what the philosophers have been saying for ages: Change is the only constant. \\nThe announcement that the existing Rs.500 and Rs.1000 notes will no longer be valid tender has created a huge confusion among the general public, especially among the poor and lower middle class, the section that mostly doesn’t get to see those two denominations. \\nHere at Crank’s Corner , which is always clearing misgivings of people on matters of public importance, we have come up with yet another primer on the whole issue answering some questions on money and economics with our usual yen for irresponsibility. The answers will be so irresponsible and totally false that they would soon be WhatsApped to you by your well-meaning friends and relatives as confirmed news. \\n1. Why were Rs.500 and Rs.1000 demonetised ? \\nThe Central government and the Finance Ministry had credible intelligence inputs that black money hoarders and terrorist networks had somehow managed to figure out that the existing Rs. 500 and Rs. 1000 notes didn’t have special computer chips to track them, and hence the government has had to come up with new rupee notes that are so technologically advanced that, quite frankly, you can use them as a debit card in all places, even in places that doesn’t have a card-swiping facility. \\nNo, just kidding. The new currency doesn’t have any special feature. But you can rest assured that all Indian legal Indian tender come with the ultimate guarantee of the Indian Constitution: “I hereby promise the bearer of this currency the unfettered right to scribble stuff like ‘I love Priyanka‘ in the blank space provided for the explicit purpose” \\n2. Can you give us some historical background to currencies? \\nBefore the advent of metal coins and paper rupees, as you would doubtless know barter system was in vogue where people exchanged goods and services for goods and services. For example, people with cattle exchanged them with those who had, say, knife or axe. And having got a knife or axe, they used the same to threaten and get the same cattle back. Life was mostly simple and straight forward then. \\nBut the problem was there were many who had nothing to offer. They all became economists and eventually came up with the concept of money. \\nOkay, this is not entirely true. Some of them also became journalists. \\nIndia, of course, was one of the earliest users of coins in the world, its history dating back to around 6th century BC, a period which — all Historians are unanimous on this — was very, very long back. \\nCloser back in time, the Reserve Bank of India — keeping in mind its essential character — was set up on the April Fool’s Day of 1935. In those non-technological days, every rupee, except Rupee one, used to be painstakingly signed by the RBI Governor, which to this day remains his only major work. The issuance of one rupee is outside the purview of RBI, and the minting of coins has been outsourced to a metal company in Guindy Industrial Estate. \\n3. In the aftermath of demonetisation , gold prices have shot up, Your views on investing one’s savings in gold \\nGold has always been a traditional hedge investment against other instruments that are prone to various vagaries. The government itself has invested hugely in gold, which it uses during times of economic contingency like when having to pay bonuses for government employees during Deepavali or to meet out expenses of the President or the Vice President who have to fly to other countries on emergency goodwill mission. \\nThe government is said to have reserves above 550 tonnes of gold and during Indira Gandhi’s time there was a smart move to store them as ornaments, especially in the form of kangan sets and ottianam . But the matter didn’t move forward because to this day no one knows how jewellers actually price their stuff. \\n4. Enough of history. What should I do in case I am unable to withdraw cash from my bank? \\nThe important thing is not to panic, at no point should you…no wait, drop that knife. Also, slapping bank employees is banned under the Income Tax Act. \\n5. A friend has given me a few 1000 and 500 rupee notes to pay them in my account. Can I? \\nRemember you are not supposed to remit in your account somebody else’s money, also you should not give your place in the ATM line to anybody else. If you do, 250% fine will be levied on you and your spouse. In which case, it is your sole responsibility to prove to the IT authorities that you don’t have a spouse at all. \\n6. If I still have some queries on demonetisation , whom should I approach? \\nYou may approach the control room of RBI by telephone (your secret pin number is written on your new notes) and the RBI will be only too happy to put your call on hold. Urjit Patel personally would like to answer your call, but at the moment he is busy signing some rupee notes.'"}, "time": 1742564451.0656188}