{"duration": 0.04766130447387695, "input_args": {"text": "'The public can attend two events on Thursday to honor   Donald Trump ahead of Inauguration Day on Friday, Jan. 20. [Thursday’s events will take place at the Lincoln Memorial, according to a press release from the Presidential Inaugural Committee.  The two public events are titled: “Voices of the People” and “Make America Great Again! Welcome Celebration. ” According to the press release, the Voices of the People event includes: “the DC Fire Department Emerald Society Pipes and Drums, King’s Academy Honor Choir, the Republican Hindu Coalition, Montgomery Area High School Marching Band, Marlana Van Hoose, Maury NJROTC Color Guard, Pride of Madawaska, Webelos Troop 177, Northern Middle School Honors Choir, American Tap Company, South Park and District Pipe Band, Everett High School Viking Marching Band, TwirlTasTix Baton Twirling, and Celtic United Pipes and Drums. ” The Make America Great Again! Welcome Celebration will happen following the Voices of the People event. Trump will deliver remarks. According to the press release, other special guests include: “Toby Keith, Jon Voight, Jennifer Holliday, The Piano Guys, Lee Greenwood, RaviDrums, 3 Doors Down, and The Frontmen of Country (featuring Tim Rushlow, former lead singer of “Little Texas” Larry Stewart of “Restless Heart” and Richie McDonald of “Lonestar”). ” “  Trump has made it clear that this inaugural is of, by, and for the American people. The 58th Inaugural will celebrate American history and heritage, while setting the course to a brighter and bolder future for all Americans,” stated the Committee’s Chairman Tom Barrack. “Above all, it will serve as tribute to one of our greatest attributes, the peaceful transition of partisan power. ” “As Abraham Lincoln said, ‘when an election is over, it is altogether fitting a free people that until the next election they should be one people,’” Barrack added. “We will be one people working together, leading together, and making America great again, together. ” On Thursday morning, Trump will also attend a   ceremony at Arlington Cemetery. The “Deploraball” will take place Thursday night, along with several other inauguration balls. Friday, Inauguration Day, will begin with Trump’s   ceremony at the U. S. Capitol beginning at 11:30 a. m. According to the Washington Post, security will open at 6:30 a. m. There will be an inaugural parade on Pennsylvania Avenue following the   ceremony. Three official inaugural balls will be held on Friday night. One will be at the National Building Museum, another at the Walter E. Washington Convention Center, and there will be an Armed Services Ball. The following morning, on Saturday, there will be a National Prayer Service at Washington National Cathedral.'"}, "time": 1742562250.4900115}