{"duration": 0.05817818641662598, "input_args": {"text": "'Clinton policy on Syria would lead to WW III: Trump  57 am Clinton policy on Syria would lead to WW III: Trump Wed Oct 26, 2016 1:37AM US Republican presidential candidate Donald Trump speaks during a campaign rally at Orlando Sanford International Airport on October 25, 2016 in Sanford, Florida. (Photos by AFP) \\nUS Republican presidential nominee Donald Trump says Hillary Clinton’s policy towards Syria would “lead to World War III”, arguing that the Democratic nominee would drag the US into an armed confrontation with Russia. \\nTrump made the warning in an interview with Reuters on Tuesday, following Clinton’s proposal for the establishment of a no-fly zone and “safe zones” in Syria earlier this month. \\n“What we should do is focus on ISIL (Daesh). We should not be focusing on Syria,” Trump said. \\n“You’re going to end up in World War Three over Syria if we listen to Hillary Clinton,” he said. \\nOn October 7, the Democratic nominee said a no-fly zone was required inside the war-ravaged country to stabilize fighting, a move that was opposed in Congress due to the risk of entering into conflict with Russia, since a US-enforced no-fly zone would mean the US could shoot down Russian fighter jets should they enter Syrian airspace. \\nClinton also described the situation in Syria as “incredibly complex” since the intervention of Russia. US Democratic presidential nominee Hillary Clinton speaks at an early vote rally at Broward College in Coconut Creek, Florida, on October 25, 2016. \\n“You’re not fighting Syria anymore; you’re fighting Syria, Russia and Iran, all right? Russia is a nuclear country, but a country where the nukes work as opposed to other countries that talk,” Trump said. \\nThe Republican nominee also referred to the removal of Syrian President Bashar al-Assad from power as a second-level priority to defeating Daesh. \\n“Assad is secondary, to me, to ISIL,” Trump said. \\nRussia might down US planes \\nMeanwhile, US Director of National Intelligence James Clapper also warned about the consequences of Clinton’s push for a no-fly zone in Syria that could spark a conflict with Russia. \\nSpeaking at the Council on Foreign Relations, Clapper said Clinton’s proposal for the establishment of a no-fly zone in Syria could lead to Russia shooting down American planes there. James Clapper, the US director of National Intelligence, speaks at the Council of Foreign Relations, on October 25, 2016 in New York City. \\n“I wouldn’t put it past them to shoot down an American aircraft if they — if they felt that was threatening to their forces on the ground,” he said. \\n“I take stock in the nature of the weaponry that they deploy and why they — why they did that,” Clapper said of Russian weapons recently deployed to Syria. “The system they have there is a very advanced air-defense system. It’s very capable. And I don’t think they’d do it and deploy it unless they had some intent to use it.” \\nDuring the third and final presidential debate last week, Clinton reiterated her remarks on a no-fly zone that could save lives and hasten the end of the conflict in Syria. \\nA foreign-backed militancy has been going on in Syria since March 2011, with a plethora of armed groups — each supported by one foreign country or another — fighting the Assad government. \\nSince 2014, the United States, along with a number of its allies, has been leading a so-called anti-terror campaign in Syria and neighboring Iraq. \\nInstead of helping to rein in the Takfiri terrorists, the air raids have killed many civilians, and caused extensive damage to the country’s infrastructure. \\nIran has been offering Syria advisory military help. Russia, another Syrian ally, has also been conducting an aerial bombardment campaign against militant positions in Syria at a request from Damascus. \\nThe foreign-sponsored conflict in Syria has claimed the lives of hundreds of thousands of people and displaced millions.'"}, "time": 1742562959.745136}