{"duration": 0.0926816463470459, "input_args": {"text": "'“Charging Bull” had a message for “Fearless Girl” on Wednesday, and it was more “Get out of my space” than “Here’s looking at you, kid. ” The message actually came from Arturo Di Modica, the sculptor who created “Charging Bull” nearly 30 years ago. He also copyrighted and trademarked the      sculpture that stands near Wall Street. Since March 7, “Charging Bull” has faced off against “Fearless Girl,” a statue of a girl posed with her fists on her hips that was commissioned by State Street Global Advisors, a financial firm based in Boston. Mr. Di Modica said that “Fearless Girl” was an insult to his work, which he created after the stock market crashes in the late 1980s. “She’s there attacking the bull,” he said. Even as Mr. Di Modica was denouncing “Fearless Girl” at a news conference in Midtown Manhattan, State Street Global’s home page highlighted the statue for its message about “the power of women in leadership” and urged “greater gender diversity on corporate boards. ” Mr. Di Modica and his lawyers did not disagree with that idea at a news conference  —   “None of us here are in any way not proponents of gender equality,” said one of Mr. Di Modica’s lawyers, Norman Siegel, a former executive director of the New York Civil Liberties Union. They demanded that “Fearless Girl” be moved somewhere else. Mayor Bill de Blasio, who spoke out in support of “Fearless Girl” last month, reiterated its importance on Twitter on Wednesday: “Men who don’t like women taking up space are exactly why we need the Fearless Girl. ” “Fearless Girl” was seen by many as a unifying symbol during International Women’s Day last month. Chelsea Clinton and the actress Jessica Chastain posted on Twitter expressing support for the statue. But on Wednesday, Mr. Siegel said, “Principle trumps popularity, and there are principles here. ” For his part, Mr. Di Modica became emotional, explaining later that when he had heard about “Fearless Girl,” his reaction was to go to the site in Lower Manhattan and try to do something to end the   between the two statues. “I said, ‘Now I’m going to turn around the bull myself,’” he recalled. The lawyers said that “Fearless Girl” had subverted the bull’s meaning, which Mr. Di Modica defined as “freedom in the world, peace, strength, power and love. ” Because of “Fearless Girl,” Mr. Siegel said, “‘Charging Bull’ no longer carries a positive, optimistic message,” adding that Mr. Di Modica’s work “has been transformed into a negative force and a threat. ” The lawyers accused State Street Global of commissioning “Fearless Girl” as a   work that was conceived with “Charging Bull” in mind. They said that that had improperly commercialized Mr. Di Modica’s statue in violation of its copyright. They asserted that the city had violated his legal rights by issuing permits allowing the    “Fearless Girl” to stand across from the   bronze bull without Mr. Di Modica’s permission. Mr. Siegel and other lawyers for Mr. Di Modica released letters they had sent to the mayor Ronald P. O’Hanley, the president and chief executive of State Street Global and Harris Diamond, the chairman and chief executive of McCann Worldgroup, State Street Global’s marketing agency. Among other things, the letters demanded the removal of “Fearless Girl. ” Anne McNally, a spokeswoman for State Street Global, said the firm was reviewing the letter. She added, “We continue to be grateful to the City of New York and people around the world who have responded so enthusiastically to what the ‘Fearless Girl’ represents  —   the power and potential of having more women in leadership. ” Mr. Siegel said he had filed Freedom of Information requests for city records about the permits for “Fearless Girl. ” It was initially issued a   permit, but after it became a social media sensation, Mr. de Blasio announced that the permit was being extended. The mayor said that the sculpture could remain until next year’s International Women’s Day. In March, the mayor called the statue a symbol of “standing up to fear, standing up to power, being able to find in yourself the strength to do what’s right. ” He also said the timing of the placement of “Fearless Girl” mattered, coming early in Donald J. Trump’s presidency and not long after the women’s rights marches that followed his inauguration. “She is inspiring everyone at a moment when we need inspiration,” the mayor said. Mr. Siegel said he hoped that the dispute over the two statues could be resolved amicably. But he added, “We never dismiss the possibility of litigation. ”'"}, "time": 1742562257.7747438}