{"duration": 0.05617094039916992, "input_args": {"text": "'The President of the European Council has finally recognized that Europe cannot handle the massive influx of migrants crossing from North Africa into Italy and has called for measures to shut down the maritime route across the Strait of Sicily. [Ironically, just two days ago, Council President Donald Tusk criticized Donald Trump’s recent executive order putting a moratorium on new visas for nationals of seven particularly dangerous seedbeds of terrorism, calling the U. S. President a “demagogue” who poses an “existential threat” to the EU.  And yet, Tusk seems to have taken a page from his namesake’s recent actions, boldly proposing that the   route be “closed down. ” “The flow of migrants from Libya into Italy and the EU is not sustainable,” Tusk said Thursday after a meeting in Brussels between European and Libyan officials. “Europe has proved it is able to close down irregular routes of migration, as we did on the Eastern Mediterranean route,” Tusk said. “We have discussed the example of our cooperation with Turkey and other countries in this part of the region. Now it is time to close down the route from Libya to Italy. ” Populist leaders in Europe were quick to highlight what they consider the hypocrisy of the Council President, who has tended to downplay Europe’s migrant crisis. The Leader of Italy’s Northern League Party, Matteo Salvini, challenged the EU official for his slowness to recognize the problem and his sudden   which occurred just after President Trump decided to draw a line in the sand on the problem of international terrorism and its links to migration. “When we at the League said the same thing five years ago,” Salvini asked, “weren’t we racists?” referring to accusations leveled against the League for its warnings of the dangers of unchecked immigration. Libyan Prime Minister Fayez   who met the press together with Donald Tusk, said that the problem of illegal migration is “something dramatic” and affects security, and social, economic and political stability. “We must find ways to deal with all these aspects of the phenomenon,”   said, noting that migrants need to be held back “in their countries of origin,” before they embark on the dangerous journey toward Europe. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742562330.113951}