{"duration": 0.050016164779663086, "input_args": {"text": "'Jacksonville Clay Target Sports (JCTS) believes education is the key to stopping accidental shootings, so they are teaching kids as young as five gun safety and usage. [JCTS teaches “about 50 children a day how to properly shoot and handle a gun. ”  According to First Coast News, Safety Officer Larry Freeman watches over JCTS. He said his dad taught him to use a gun at seven, adding, “He taught me gun safety as a young one and I’ve carried that all through my life. ” Freeman observed: You get rid of the mystique of the gun. That way, now they know what it can do, they’ve seen what it can do and they’ve been taught what it can do. And then they’ll know what to tell their parents if they find one, they won’t be sneaking it off to see how it works and wind up killing somebody. Jacksonville parent Tony Knight agrees with Freeman. He gave his son, Tony Knight Jr. his first gun at age three and says he still stands with Jr. when he shoots, placing his hand on his shoulder to give him support. Knight said he thinks following through —  continuing to teach safety and helping them use the gun —  is an important part of the learning process. He believes there is no magic age at which someone can begin learning. Rather, a child who can “learn and listen and follow directions” is “ready to be taught the gun. ” Knight’s son said, “People may use them wrong and I think that’s wrong. People should use them for hunting, shooting targets and other stuff, but not harming people. ” He also noted that his father taught him to respect firearms, saying, “It can hurt people, yeah dad taught me it can hurt people. ” Jr. added, “If I see a gun in my house I’m supposed to leave it alone and tell my parents and if they’re not home just leave it alone. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628334.852765}