{"duration": 0.04771995544433594, "input_args": {"text": "'Former New York City Mayor Michael Bloomberg told the New York Times Wednesday that he estimates President Donald Trump has a 55 percent chance at  . [Bloomberg, who has been harshly critical of President Trump, thought Democratic   would make Trump the odds on favorite in 2020.  “They’ll step on each other and   Donald Trump,” he told the Times‘s Frank Bruni, adding that there is a “55 percent chance he gets  . ” Bruni, for his part, was horrified by the estimate. “  percent? Whether good for my longevity or not, I need a cookie,” he wrote, comparing the campaign to unseat Trump to Bloomberg’s   crusades against smoking and junk food. Bloomberg was brutal in his critique of Hillary Clinton’s failed bid for the White House. ‘Hillary said, ‘Vote for me because I’m a woman and the other guy’s bad,’” he said. The   former mayor has a long and tumultuous history with the president. Despite Trump’s occasional praise of his fellow NYC billionaire’s time as leader of the Big Apple, things turned ugly after Trump’s presidential campaign kicked off. Bloomberg, nominally an independent, spoke at the 2016 Democratic National Convention, telling the packed arena, “The bottom line is: [Trump] is a risky, reckless, and radical choice, and we can’t afford to make that choice. ” Trump was quick to hit back, telling ABC News, “Michael Bloomberg couldn’t get elected as a dog catcher in New York. ” Bloomberg, best known outside New York for his steadfast opposition to gun rights, support for taxes on soda, and the   news outlet that bears his name, has not let up on the president since Trump took office. In March, he appeared to defy the president and Congress, saying America will meet the requirements of the Paris climate agreement regardless of what the democratically elected government tries to do.'"}, "time": 1742561954.772809}