{"duration": 0.08036613464355469, "input_args": {"text": "'Just when Tiger Woods appeared to get it going with back to back birdies on holes 10 and 11 at the Farmers Insurance Open in his first PGA tour round in 17 months, the wheels quickly came off the cart as he finished the day with a   par 76. [Now parked close to the bottom of the leaderboard, Woods will need to go low on Friday at the more forgiving North Course at Torrey Pines in La Jolla, CA to make the cut, (projected at  ) and continue the competition over the weekend.  Although the extremely soggy courses played long for all the golfers due to extraordinary amounts of rain the region received in January, Tiger couldn’t keep his drives out of the rough forcing bogeys on 12, 13, 14, and a disastrous double bogey on 15, where he tugged his drive into a ravine. Another bogey on 17 and a one putt birdie on 18 put an end to Tiger’s comeback debut.  Woods can’t blame the course for his troubles, a layout he has dominated in his career, winning there 8 times, including four consecutive wins between 2005 and 2008. Woods caddy Joe LaCava blamed the poor showing for Woods on his lack of patience. “Joey kept telling me all day today, just be patient with it. I didn’t quite smile at him a few of those times he said that. But I was fighting out there trying to get my ball around the golf course and score,” Woods said.  Slow playing conditions also contributed to Tiger’s frustration with rounds taking nearly five and a half hours on Friday. The   Major winner has accustomed himself to playing much quicker practice rounds while gearing up in Florida for his PGA return.  “It’s just weird to say this but it was just we were playing so much slower than I’m used to. It was just weird waiting that much,” Woods said. “Not used to doing that. At home I guess we’re flying a little quicker than this. It was just a different rhythm. We were out there talking most of the day trying just to kill time. ” Woods is hopeful for his Friday round at the North Course where the putting surfaces are better. “We’re going to go over on some better greens tomorrow, some better conditions and hopefully not only myself but the rest of the guys, we can put some good numbers up. ” Australian and world #1 ranked golfer Jason Day, who played with Tiger on Thursday, also struggled shooting 73. He acknowledged that it’s too early in the season to judge Tiger’s performance. “Having 17 months off is a very, very long time. We can’t just break down everything he did today because it’s been 17 months,” he said.  “Let him go a year, let him play and go from there.  That’s the same with us. We can’t panic too much at the start of the year. “Look at Rory’s year last year. He really didn’t do a lot until the FedExCup (Playoffs) and he ended up being the FedExCup champion. ” English golfer Justin Rose leads the tournament after shooting a remarkable 7 under 65 on the difficult South Course, while Canadian Adam Hadwin is one back after his 66 on the North. Hadwin is coming off of a 59 last Saturday in his   finish at the CareerBuilder in La Quinta. Haddin became only the ninth player to fire a   round in PGA tour history.'"}, "time": 1742563789.3472586}