{"duration": 0.04839777946472168, "input_args": {"text": "'New York (AFP)  —   Madonna voiced anger Tuesday over news that a Hollywood studio plans an unauthorized biopic of her early years in New York struggling to break into the music business. [“Nobody knows what I know and what I have seen. Only I can tell my story,” the Material Girl wrote on Instagram.  “Anyone else who tries is a charlatan and a fool. Looking for instant gratification without doing the work. This is a disease in our society,” she wrote. Entitled “Blond Ambition,” the name of her landmark provocative 1990 tour, the screenplay is the work of newcomer Los Angeles writer Elyse Hollander. The script’s description says it focuses on Madonna’s life in the gritty New York of the early 1980s as she navigates her love life and a music industry that treats women as disposable. Madonna, who moved to New York in 1978 from her native Michigan, has spoken increasingly in recent years of her early experiences in New York including being raped.  —     script  —   Born Madonna Louise Ciccone, the now      worked at a Dunkin’ Donuts branch in Times Square as she pursued a career in dance before releasing her debut album in 1983. While many of Madonna’s songs have been interpreted as reflections on her life and a number of books have been written on her, she has stayed away from outright autobiographical works herself. Madonna is no stranger to Hollywood, starring in movies that include “Desperately Seeking Susan,” “Who’s That Girl” and “Evita. ” Hollander’s screenplay last year topped Hollywood’s   black list in which film executives vote on their favorite scripts that have been in circulation but not selected for production. The Hollywood Reporter said Monday that Universal had picked up the project. It said that “Blond Ambition” would be   by Michael De Luca, who has worked on the “Fifty Shades of Grey” erotic thrillers and the Facebook drama “The Social Network” as well as the Oscars ceremony. Hollander, the writer, previously worked    on   film “Birdman or (The Unexpected Virtue of Ignorance)” and has completed a short film, “Nikolai,” about a Roma boy adapting to the United States.'"}, "time": 1742563214.7025504}