{"duration": 0.21395659446716309, "input_args": {"text": "'Former Pennsylvania Gov. Tom Ridge says Congress must pass a pending bill to close the shipping loophole allowing Chinese companies to sell lethal opioids to distributors in U. S. neighborhoods. [“We worry about weapons of mass destruction,” he told Breitbart News. “But I think 30 pounds of fentanyl in the wrong hands is a weapon of mass destruction. ”  In 2014, roughly 47, 000 in the U. S. died from drug overdoses, especially from heroin and other opiates. Heroin overdose deaths more than tripled between 2010 and 2015. The bill, titled the Synthetics Trafficking and Overdose Prevention, or the “STOP Act,” is being championed by Ohio Republican Sen. Rob Portman. Ridge, a senior advisor with the   group “Americans for Securing All Packages” (ASAP) is working to halt the spread of the deadly opioid epidemic ravaging American families. Fentanyl is usually 50 to 100 times stronger than heroin —  dousing the body’s opioid receptors in the brain stem, spine, and gut all at once, obliterating pain and potentially triggering an overdose. One quarter of a milligram of fentanyl can kill a person. As Breitbart News reported,   deaths rose a staggering 72 percent from 2014 to 2015, with 9, 580 dying from overdoses in 2015 compared to 5, 544 in 2014. The U. S. Centers for Disease Control and Prevention grimly noted in a January report that half a million people died from drug overdoses between 2000 and 2014. “It’s been an issue that’s growing in severity for the past two or three years,” said Ridge. “Sometimes these problems have to rise to an extreme level before people start paying attention to it, although I think you started paying attention to it some time ago,” Ridge, who also served as the first Secretary of Homeland Security, told Breitbart News. “Clearly, President Trump started paying attention to it during the primary. ” “I think he’s one of a couple candidates in New Hampshire who spoke specifically about the postal loophole, which has turned out to be a   front door to illicit drug trafficking, primarily from China,” Ridge continued. During a New Hampshire campaign stop in early October 2016, Trump promised he would protect Americans from a massive influx of deadly, illicit narcotics “poisoning our youth. ” The Granite State “was really the first glimpse I got at how serious a problem we have,” Trump said. “They’re poisoning our youth. They’re poisoning more than our youth —  they’re poisoning everybody. But they’re poisoning our youth. It’s tough enough out there. Our youth doesn’t have a chance with what’s happening, and we’re not going to let it happen anymore,” Trump had said. “We’re going to help the people that are so badly addicted. We’re going to help them  …     I’m going to stop the drugs from coming in. ” Ridge wants to continue the battle against the opioid influx. “I am hopeful that, one, we continue to raise awareness —  that’s what we do at ASAP —  and that, two, in a town looking for some bipartisan work to do together, that they follow the president’s lead, close the loophole, and support the STOP Act which has bipartisan support in both the House and the Senate,” Ridge said. Asked what the U. S. could do to halt Chinese businesses from openly advertising that they are “happy to sell” opioids so powerful that they are considered chemical weapons to U. S. buyers, Ridge said the STOP Act would at least allow officials to inspect such packages. “The STOP Act does not pretend —  does not suggest that it will eliminate, completely, the flow of illicit fentanyl from China or elsewhere,” Ridge said. “But China, according to the DEA and multiple sources, is the primary source. So we’ve got pretty much the crosshairs on that as the   source. And the fact is that, if we can just get them to provide the electronic data as to who the sender is, who’s to receive it, what’s contained, what’s the way —  you know, we’ve built some pretty sophisticated algorithms over the years that would at least give Customs and Border Protection enough information to question the contents to pull it aside and open it up for inspection. ” From the Associated Press: “In this Aug. 9, 2016, file photo, a bag of   isobutyryl fentanyl which was seized in a drug raid is displayed at the Drug Enforcement Administration (DEA) Special Testing and Research Laboratory in Sterling, Va. Acting United States DEA administrator Chuck Rosenberg will visit China next week amid efforts to cut off the Chinese supply of deadly synthetic drugs, like fentanyl. China disputes U. S. claims that it’s the top source of opioids. Still, Beijing has already banned fentanyl, an opioid some 50 times stronger than heroin, and 18 related compounds. ” (AP   Owen, File) “That’s what the STOP Act does,” Ridge explained. “It’s not designed to end the flow. I think one of the issues that the State Department’s got to deal with, the ambassador’s got to deal with, is much stronger diplomatic position in time. And frankly, I’d think it would be helpful to the diplomatic work that we have to do with China and other countries if [we] had bipartisan legislation that was passed and signed into law by the president. ” The   epidemic has caught attention from Democratic politicians as well. Missouri Sen. Claire McCaskill recently opened an investigation into pharmaceutical companies’ records inquiring about the drugs’ addictive qualities and the relation to marketing campaigns. It should be noted that it may only take seven days to become addicted to opioids, according to the Utah Department of Health. One week of taking narcotic painkillers can suddenly deliver someone into a lifetime of addiction, or what’s left of it —  before too many of   morphine molecules bind with opioid receptors in the brain stem and shut down the user’s ability to draw their next breath. Of course, heroin addiction can slowly consume one before one realizes it has, as one user explained: I have literally never met anyone who was introduced to heroin with a needle. That’s roughly the equivalent of taking your first drink of alcohol by   moonshine out of a gas can. The reality is a lot less abrupt, and a lot scarier: Most people start by popping and smoking pills. In that stage, it never seems like a problem, because you can use daily for weeks with no withdrawal effects whatsoever. “Once you’re at the stage where you’re even considering the needle, you long ago forgot about ‘squeamishness’ right along with ‘work’ and ‘everything else you ever wanted to accomplish in your life,’” the former user added. Breitbart News also asked Ridge what he would say to American families ravaged by opioid addiction. “Well, I’m glad you said —  you phrased it the right way,” Ridge sighed. “Because you may have someone in your family that’s addicted. You may have an individual that’s addicted, but it affects the family, friends of the family, and the broader community. ” From the Associated Press: “In this Wednesday, Sept. 2, 2015, photo, Dorothy McIntosh Shuemake, mother of Alison Shuemake, cries as she clutches her daughter’s toy stuffed rabbit during an interview at her home, in Middletown, Ohio. Alison Shuemake, 18, died Aug. 26, after a suspected heroin overdose when she and her partner were found unresponsive at their home and needles were present nearby. ” (AP   Minchillo) “And so, I think what we need to say to the families of those who are addicted to this —  and remember, we’ve got —  alcohol addiction is a huge problem,” he continued. “And more often than not, unless there’s family intervention, it’s a   trip to oblivion. And I think it’s also like mental health problems. The stigma of addiction, and the stigma associated with mental health problems —  we should be more tolerant in a society to accept the reality that as humans, we’re flawed, but these things do happen from time to time. ” Federal data shows that “deaths of despair,” particularly among   white Americans, have risen starkly in less than two decades, as researchers Angus Deaton and Anne Case told NPR earlier in March. Whites are steadily poisoning themselves with opioids and lethal amounts of alcohol, and are committing suicide in disturbing numbers.   whites account for   of all U. S. suicides. The American Foundation for Suicide Prevention found that seven out of every 10 suicides were committed by white men in 2015.   Ridge said that communities must come together and help families hurt by addiction. “And so, as a broader community, we need to appreciate the horror that the family deals with, if they have a family member who’s addicted right now,” he said. “And, frankly, to look for ways to provide as much support and treatment as possible. ” “But I know it might be somewhat simplistic, but I know families  …     where there’s been addiction to drugs and alcohol,” Ridge said. “Sometimes, that intersession —  and [getting] them to remediation —  and get them to care, works. And sometimes it doesn’t. ” From Getty: “WASHINGTON, DC  —   SEPTEMBER 18: Activists and family members of loved ones who died in the   epidemic take part in a ‘Fed Up!’ rally at Capitol Hill on September 18, 2016 in Washington, DC. Protesters called on legislators to provide funding for the Comprehensive Addiction and Recovery Act, which Congress passed in July without funding. Some 30, 000 Americans die each year due to heroin and painkiller pill addiction in the United States. ” (Getty Images) “And what do you say to the families?” Ridge asked again. “It’s difficult to live with that in your family. And I think I understand that as an observer. I’m sure it breaks your heart, and for many people, it may break the bank as they’re trying to deal with it. But I would just encourage them to do everything they can to get the loved one that’s addicted, get them as much help as soon as possible. There has to be intervention. ” Breitbart News also asked Ridge whether the Trump administration’s   strategy of cracking down on drug traffickers while expanding treatment options for those addicted to deadly drugs is effective. Ridge said it was: “I think it’s the right strategy. ” “It’s supply and demand,” he explained. “Supply: you go after those who push out the subscription —  the docs that  . You go after the labs. You go after the foreign sources. You go after the supply. ” “On the demand side? You have to intervene,” he continued. “You have to try to help. You have to try to rehabilitate. And some of these efforts are going to be successful —  some are not. But simply talking about supply isn’t enough. And so, any effort that the government, both the state and the federal government, can do to support families and to support the kind of medical, necessary intervention —  I think it’s critically important. You have to have to have it. ” “It’s a supply and demand problem. You have to attack both,” he added. Ridge also added that a suspect in New Jersey had been arrested with 30 pounds of fentanyl. “We worry about weapons of mass destruction,” he said. “But I think 30 pounds of fentanyl in the wrong hands is a weapon of mass destruction. ” Ridge pointed to a Breitbart News story explaining that more Americans had died from opioid overdoses in 2015 than they did of gun violence: “It’s about time we got serious. So, yes, the question of supply, yeah, let’s cut it off and demand —  let’s try to get some intervention and reduce the demand. ” According to the CDC, “prescription opioids in the U. S. nearly quadrupled from 1999 to 2014,” although a former federal prosecutor claimed painkiller and heroin addictions should be classified as “distinct” from one another. An Associated Press report revealed that drug wholesalers shipped roughly 780 million prescription painkiller pills to West Virginia alone in only six years, or 433 pills for every man, woman, and child in that state. The report also stated 1, 728 West Virginians fatally overdosed on painkilling pills in those six years. “Distributors have fed their greed on human frailties and to criminal effect. There is no excuse and should be no forgiveness,” a former pharmacist said about the painkillers’ death toll. President Trump’s budget blueprint pledged to commit some $675 million to combat drug trafficking, help lift opioid abusers out of addiction, and prevent more Americans from succumbing to the the narcotics epidemic.'"}, "time": 1742563502.5626364}