{"duration": 0.06383824348449707, "input_args": {"text": "'The Colombian government and the country’s largest rebel group said Wednesday that they had agreed to a   clearing a major hurdle in the effort to end one of the world’s   conflicts. In a joint statement, the two sides said that they had overcome some of the most intractable parts of a peace deal, which they have been negotiating in Havana since 2012. In addition to a   the rebels  —   known as the Revolutionary Armed Forces of Colombia, or the FARC  —   agreed to lay down their arms. The two sides said they would hold a ceremony in Havana on Thursday to mark the   attended by Colombia’s president, Juan Manuel Santos, the FARC leader Rodrigo Londoño and other Latin American leaders. Negotiators hope a final peace deal will be reached in the days or weeks to come. “Tomorrow will be a great day,” Mr. Santos said in a statement. “We worked for peace in Colombia, a dream which is now becoming reality. ” On Twitter, the FARC responded: “We made it. The path to peace must continue, because it’s not an illusion now, it’s a promise. ” The agreement sets in motion an end to the region’s oldest conflict. An estimated 220, 000 people have been killed in more than 50 years of fighting between the guerrillas and the government. More than five million people are estimated to have been displaced. The agreement to lay down arms sets the stage for what will be one of the largest demobilization of guerrilla fighters in years. An estimated 7, 000 FARC foot soldiers and commanders would be expected to disarm. Many were kidnapped as children by the guerrillas and know no other life than one with the rebels. Under a related agreement reached last year during the negotiations, FARC soldiers would enter into a “transitional justice” system, with reduced sentences for those who confess to crimes that took place during the conflict. In many cases, the punishments are expected to be limited to community service. Unicef, the United Nations Children’s Fund, will assist in reintegrating hundreds of child soldiers whom the FARC agreed in May to release. Many quarters of Colombia celebrated the steps announced on Wednesday. “This is a transcendent step,” said Alejo Vargas, a political scientist who heads a group that brought war victims to Havana to speak with negotiators during the talks. “Even if it’s not the final deal, we can say without a doubt the process is irreversible now. ” Others lent support, but voiced concerns about how the deal would be enacted. Luis Mendieta, a former chief of Colombia’s National Police who was kidnapped for 12 years by the FARC, said he worried that many guerrillas would join criminal gangs rather than disarm. He also said that while the FARC had agreed to lay down arms, he believed the group was continuing to extort Colombians in the countryside they control. “The FARC must now not just begin a   but end all their hostilities,” he said. “The two aren’t the same thing. ” The FARC, whose origins date to the early 1960s, was founded as a   group that vowed to defend the country’s peasants from   governments in Colombia. But as the years wore on, the group found a potent source of revenue in kidnapping city dwellers. By the 1990s, the FARC had also expanded into the coca trade, earning millions by taxing growers and, according to American and Colombian officials, trafficking cocaine. In 1999, the two governments announced Plan Colombia, an aid package in which the United States poured some $10 billion into Colombia to fight drug traffickers. Many FARC leaders have been killed and the group has suffered from mass desertions in its ranks. It counted 17, 000 members in the early 2000s, a group that is estimated at 7, 000 or fewer today. During the negotiations, the Colombian president, Mr. Santos, said he would hold a referendum on the agreement. A peace plan remains generally popular among most Colombians, with recent polls showing a majority  —   around 60 percent  —   saying they would vote for it. Among the harshest critics of the deal is Álvaro Uribe, the former Colombian president whose military crackdown on the FARC many credit with forcing the rebels to the negotiating table. Mr. Uribe has repeatedly said the deal amounts to an amnesty for the FARC and has accused Mr. Santos of being a traitor. Jorge Robledo, a leftist senator from an opposition party, says Mr. Uribe’s position is too extreme. While he believes that challenges remain in reintegrating FARC members into society, the opportunity for a   is too important to pass up, he said. “Disarming the FARC won’t resolve all of Colombia’s problems,” he said. “Some violence will disappear, some won’t. And other problems will continue in this country, like poverty, unemployment, an agrarian crisis and corruption. But this doesn’t take away from the immense importance that a   has for this country. ”'"}, "time": 1742628336.4194534}