{"duration": 1.0162334442138672, "input_args": {"text": "'Rail Traffic Depression: 292 Union Pacific Engines Are Sitting In The Arizona Desert Doing Nothing   May 4th, 2016 \\nWe continue to get more evidence that the U.S. economy has entered a major downturn. Just last week, I wrote about how U.S. GDP growth numbers have been declining for three quarters in a row , and previously I wrote about how corporate defaults have surged to their highest level since the last financial crisis . Well, now we are getting some very depressing numbers from the rail industry. As you will see below, U.S. rail traffic was down more than 11 percent from a year ago in April. That is an absolutely catastrophic number, and the U.S. rail industry is feeling an enormous amount of pain right now. This also tells us that “the real economy” is really slowing down, because less stuff is being shipped by rail all over the nation. \\nOne of the economic commentators that I have really come to respect is Wolf Richter of WolfStreet.com . He has a really sharp eye for   in the economy and in the financial world, and I find myself quoting him more and more as time goes by. If you have not checked out his site yet, I very much encourage you to do so. \\nOn Wednesday, he posted a very alarming article about what is happening to our rail industry. The kinds of numbers that we have been seeing recently are the kinds of numbers that we would expect if an economic depression was starting. The following is an excerpt from that article … \\nTotal US rail traffic in April plunged 11.8% from a year ago, the Association of American Railroads reported today. Carloads of bulk commodities such as coal, oil, grains, and chemicals plummeted 16.1% to 944,339 units. \\nThe coal industry is in a horrible condition and cannot compete with US natural gas at current prices. Coal-fired power plants are being retired. Demand for steam coal is plunging. Major US coal miners – even the largest one – are now bankrupt. So in April, carloads of coal plummeted 40% from the already beaten-down levels a year ago. \\nBecause rail traffic is down so dramatically, many operators have large numbers of engines that are just sitting around collecting dust. In his article, Wolf Richter shared photographs from Google Earth that show some of the 292 Union Pacific engines that are sitting in the middle of the Arizona desert doing absolutely nothing. The following is one of those photographs… \\nAs Wolf Richter pointed out, it costs a lot of money for these engines to just sit there doing nothing… \\nThese engines are expensive pieces of equipment. When they just sit there, not pulling trains, they become “overcapacity,” and they get very expensive. Then there are engineers and other personnel who suddenly become unproductive. Some of them have already been laid off or are getting laid off. \\nAll over the world, similar numbers are coming in. For example, the Baltic Dry Index fell 30 more points on Wednesday after falling 21 on Tuesday. Global trade is really, really slowing down during the early portion of 2016. What this means on a practical level is that a lot less stuff is being bought, sold and shipped around the planet. \\nIt is becoming increasingly difficult for authorities to deny that a new global recession has begun, and at this moment we are only in the very early chapters of this new crisis. \\nAnother thing that I watch very closely is the velocity of money. When an economy is healthy, people feel pretty good about things and money tends to circulate fairly rapidly. For example, I may buy something from you, then you may buy something from someone else, etc. \\nBut when times get tough, people tend to hold on to their money more tightly, and that is why the velocity of money goes down when recessions hit. In the chart below, the shaded areas represent recessions, and you can see that the velocity of money has declined during every single recession in the post-World War II era… \\nDuring the last recession, the velocity of money declined precipitously, and that makes perfect sense. But then a funny thing happened. There was a slight bump up once the recession was over, but then it turned down again and it has kept going down ever since. \\nIn fact, the velocity of money has now dropped to an all-time low. The velocity of M2 just recently dipped below 1.5 for the first time ever. \\nThis is not a sign of an “economic recovery”. What this tells us is that our economy is very, very sick. \\nAnd we can see evidence of this sickness all around us. For instance, the Los Angeles Times is reporting that homelessness in Los Angeles increased by 11 percent last year, and this marked the fourth year in a row that homelessness in the city has increased… \\nHomelessness rose 11% in the city of Los Angeles and 5.7% in the county last year despite an intensive federal push that slashed the county ranks of homeless veterans by nearly a third, according to a report released Wednesday . \\nThe increase marks the fourth consecutive year of rising homelessness in L.A., as local officials struggle to identify funding for billion-dollar plans they approved to solve the nation’s most intractable homeless problem. \\nLet us also not forget that about half the country is basically flat broke at this point. \\nJust recently, the Federal Reserve found that 47 percent of all Americans could not pay an unexpected $400 emergency room bill without selling something or borrowing the money from somewhere. \\nWith numbers such as these being reported, how in the world can anyone possibly claim that the U.S. economy is in good shape? \\nIt boggles the mind, and yet there are people out there that would actually have you believe that everything is just fine. \\nThe current occupant of the White House is one of them. \\nWith each passing month, the real economy is getting even worse. We may not have slipped into a full-blown economic depression just yet, but it is coming. \\nFor now, let us be thankful for whatever remains of our debt-fueled prosperity, because we don’t deserve the massively inflated standard of living that we have been enjoying. \\nWe have been consuming far more than we produce for decades, but it won’t last for much longer. And when those days are gone for good, we will mourn them bitterly. A New Digital Cash System Was Just Unveiled At A Secret Meeting For Bankers In New York » alan \\nSomebody will go out there and strip the copper out of them. The railroad then can write them off on insurance, problem solved. Jim Speaker \\nI bet A lot of those engines get graffitied soon. Randy \\nThe spot price of copper is too low right now to make it worthwhile. Have you ever seen how difficult it is to take wire out of a motor or generator? It’s not like peeling a grape. The health of the economy of any nation can be gauged by the price of its copper. Scarcity of copper due to it being used for motors, generators and conductors in conduits makes the price go high, lack of expansion means the price will be low. Outside of industrial use and as a medium of exchange, there’s not much use for copper. Except in the brass used for bullet casings. On our last scrap metal run down to the recycling place, we got $20.71 for 550 pounds of scrap iron. Pitiful. greyprepper \\nDon’t go giving me ideas now! I’m reformed by golly. Fiona \\nNobody tells us, but we’re in a deep recession. And with either Trump or Clinton as next president, there is no hope for a change. (I really wonder if Sanders could do a better job). Bring the popcorn and the camping seats, the economic collapse is about to begin. K2 \\nSad that you find this entertaining. Scott Comin \\nthe shadow government controls it all!!! they give us entertainment every four years so we can hope for the change that never happens!!! Steeve Girard \\nWe are in this mess because of Abrahamic beliefs. Steeve Girard \\nThat is true, rotating politicians will not solve the problem, nor will they be willing to enforce an un-democratic change to the social order. The system will have to be abolish to repair society and adapt it to the new reality of a low energy world. It is unlikely to happen until we are totally immobilized. DareToCreateYourBestLife \\nI see many people dying in this world before harmony is restored in a “low energy world”. Nature of humankind… ALWAYSTOMORROW \\nYour article looks very similar to this one. \\ninvestmentwatchblog dot com /freight-rail-traffic-plunges-haunting-pictures-of-transportation-recession/ \\nInteresting SunnyFlaSnotress \\noff topic: I know one of our “buddies” was planning a vacation, but Rorschach has been interestingly absent. hmm..   I wish a few others would have gone on vacation with them too. Robert \\nThere is no telling when the locomotive photo was taken. That is a mainline track. Unused engines are stored in large train yards where they are kept maintained until used or sold off. I doubt they are stored in AZ as aircraft. Google photos can be years out of date. \\nI am not doubting the numbers for freight traffic decline but the photo is not evidence. Jim Speaker \\nI know where those locomotives are stored at. They are stored on the old Southern Pacific out of service Pheonix line east of Wellington,AZ. I took A picture of A few trains their back in 1996. Amtrak used to use that line. When the SP/UP merger came in 1996 it was abandond. Stephen \\nThere is 50 to 70 maybe more BNSF train engines that have been sitting near downtown Oklahoma City for the last two months or more. While I agree that it is sad about the economic state of the country I have no sympathy for that criminal fraudster Mr. billionaire himself Warren Buffet that got a bailout from the tax payers back in 2008. Yup he Berkshire Hathaway owns BNSF and Union Pacific too I believe. He makes money as those goods move down the railway. Why do you think he fights that trans atlantic pipeline because competition is a sin. Steeve Girard \\nThat means the QE money keep falling into vaults, and never comes out. Especially the Treasury vault. Once in there it can only do one thing, pay the Treasury Bonds that are coming back from the BRICS countries, which makes it disappear. The black holes they tried to fill (with QE programs) and never was able to blow it away from existence are still there, and are still doing damages to the economy. . And with the energy crisis increasing, new black hole vaults have started to appear around the world, because they are trying to decouple the US dollar from the energy sector. Richard \\n“Global trade is really, really slowing down” \\nReally really? I haven’t seen this double repetition for months (a couple of years, maybe). Please don’t let it creep back again. Barry Goldwater \\nAm I wrong or shouldn’t the content be the focus in the comment section ? Having said that I can say I read this article and as usual applaud Michael for getting news out that goes unmentioned by the lame stream media. Personally I’ve been on the net for years and found the “Grammar Police ” a bit obnoxious to say the least. Michael is doing a superb job and my hat’s off to him. Jomine Jose \\nThey went the way of the MarcoBird. rentslave \\nOn the other hand,Powerball sales almost doubled since the last drawing.It seems that many TV stations show the drawing before the 11 PM news once it passes a certain point,proving that many affluent people still exist.It’s still taking an inordinate amount of time to reach that level as the regular street players are just about tapped out. K2 \\nCoal is slowing down because of natural gas. tom \\nLet’s not forget that the EPA under the president’s direction is going after the coal industry too. I remember Hillary Clinton saying earlier this year that she would basically kill the US coal industry. SmallerGovNow2 \\nand then she just recently said, “that’s not what I meant”. what a lying POS she is… tom \\nNow I know that you have a highly developed sense of humor. Have you begun searching for a puppy? SunnyFlaSnotress \\nI can think of something better to worship than one’s self or a government. SunnyFlaSnotress \\nDoes this ring a bell, Snotty? \\nA god complex is an unshakable belief characterized by consistently inflated feelings of personal ability, privilege, or infallibility. A person with a god complex may refuse to admit the possibility of their error or failure, even in the face of irrefutable evidence, complex, or intractable problems or difficult or impossible tasks, or may regard their personal opinions as unquestionably correct. The individual may disregard the rules of society and require special consideration or privileges. \\nAnd just whom is this paragraph describing? \\nHere’s a hint: Hillary is NOT God! \\n…She is GODESS!….(compliments of rarefied snotress) arresun \\nThere is no Hillary 😀 Richard O. Mann \\nObama said pretty much the same thing. He has been after coal for some time. It’s responsible for climate change and has to go. Steeve Girard \\nAll fossil fuels are slowing down due to quality and EROEI. We have now reached the commercially non-viable level 8:1… In 2030, we will reach the industrial non-viable level 5:1… that is when you will realize that industrial society just died. Priszilla \\nNo money nothing to buy. Current “economy” lives from ammo and derivatives. billtheguy \\nAs the movie “The Big Short” says “the music hasn’t stopped, its just slowing down.” This time around, it will slow down to almost stopping. Get prepared spiritually and economically. Steeve Girard \\nThe Limits to Growth scenario (Business as Usual) scenario is still on course. It all points to an energy crisis in 2030, that is when everything will go hectic. dauden \\nHow do you “get prepared spiritually”? When times are good ignore your soul but when times are about to get ugly, get spiritual? Explain please. SunnyFlaSnotress \\n“U.S. rail traffic was down more than 11 percent from a year ago in April.” Oil dropped in Nov 2014. A few months gave people time to believe the drop wasn’t a blip and trucking went into higher gear with new lower gas prices, passing the savings onto the clients. Hence, trucking likely gained more popularity for shipping some items. “This also tells us that “the real economy” is really slowing down” It’s inordinately skewed to make that statement without showing a traffic comparison chart of trucking vs railing during that timeframe. p.s. waves and kisses to my adoring fans 😀 Ricardo \\nStop blowing your snot everywhere you gross person SunnyFlaSnotress \\nRicardo the Beaner starts the day on a good note Bill \\nThanks for sharing your intelligence, now leave it at that and ignore the insults. SunnyFlaSnotress \\nBillTheController took several moments to think of the right compliment for me. Bill \\nAt the end of the day, it’s all just a game. Willard Ferch \\nThe surge was already there. Diesel is still relatively cheap. If there were buyers, there would be tons of shipping. Sales are needed to create the shipping. The Lord loves you and all Christians love you. They may disapprove of your life-style and your ideology, but they still love you. Fiddlin SunnyFlaSnotress \\nThe surge was building momentum Richard O. Mann \\nThat should be “may no god bless you”. Just keeping you constant there Sunny. SunnyFlaSnotress \\nNo, no no.. it’s “G0ddess Bless You” Richard O. Mann \\nAnother cut & paste for you to display. Nothing from that pea brain of yours SunnyFlaSnotress \\nThe majority was in my words or otherwise quoted unlike BarkingBill NCA who just copies others’ work w/o acknowledgement Mark \\nRemember everyone we need push the flag button on Sunny the Honey. Bill and I are doing so please join the party. SunnyFlaSnotress All_has_An _END_. \\nattention attention you must be fat and ugly and lonely and confused , and that is a good thing K2 \\nI have seen her in real life and she is slim and beautiful. cuchulain \\nBut with big ol’ stained fangs. Ouwy wowy ow ow !! arresun \\nTrains use diesel as well cuchulain \\nYo Snotty !!!! Very good. I like that someone did some fact checking. Now, be a good girl and find out the trucking volume stats the last 2 years. Go ahead. We’ll be here when ya get back :–). \\nSeriously… good job. Not sure it changes the big picture, though. Zaphod Braden \\nEerily close – Who is John Galt? 😉 watchmannonthewall \\nMaybe if Trump is elected TPTB will close up shop and just disappear and leave the good old US of A to fend for itself since voters didn’t want to go along with their program. History repeats. Oh, sorry! That first was the book! sistersoldier \\nI think the bomb shell that Trump dropped after winning the GOP nomination left a bad taste in the mouths of his supporters. He reported that he is not self funding the general election but rather will put together a finance committee with ties to George Soros to help raise the money to defeat Hillary. I’m not sure but I think that some are suffering a hangover this morning as it is now apparent you cannot be a DC insider with out enlisting DC aid. Only the future will tell the whole story. But you are correct about the book. 😀 watchmannonthewall \\nDon’t know if you ever heard of Larry Burkett, was a mentor of Dave Ramsey. He wrote one novel, “The Illuminati” about 1990 before his death. Seems a lot of what was in the book are actually being played out in events of today in the US. \\nIt will be very interesting, and seems most likely, if Trump were to chose a running mate with strong ties to inside the Beltway and spcifically (though not actually known) with the elite. In the book, the president the people wanted but the elite didn’t, was forced to chose a female VP the elite wanted and then they orchestrated events such that the Pres had to step down and, wow, they still got what they wanted! Interesting times!! sistersoldier \\nWow! That is compelling! No I am not familiar with Larry Burkett but I most certainly will search to see if one of my local libraries has the novel you mentioned. If I am able to find it I will work it in with my fishing trip this weekend – if the fish are not biting I will be gearing up for the next leg of this race. We must enjoy the simple things while they last. Thanks for the heads up! watchmannonthewall \\nIf I remember correctly Larry said, in the Forward, the only reason he wrote the book was because so many Christians were asking him to write a novel where he would lay out the events he thought would be most likely to occur to bring the anti-christ to power. When I read the book I sensed the content may have been prompted by the Holy Spirit, and Larry may have been more acccurate on events than he could have hoped for or dreamed. Funny thing is, I came across the book as a throwaway, cleaning out lockers, at an assembly plant I worked at 15 years ago. I need to get it out again and reread it. The book started with a major earthquake in Japan. sistersoldier \\nI must find it! You appear to be a fellow truth seeker and the similarities to what is going on today appear to be striking to say the least. There is just too much going on in the world today and so much has been hidden from the masses that the truth is often buried in our past or by those who were not afraid to print what the Holy Spirit was leading them to do for a time such as this! Good information and good post! Bill \\nIt is great to read good economic discourse and understand the true picture. Now let’s get to some solutions. Chris \\nWork hard. Stay out of debt. Save . greyprepper \\nAnd don’t forget to PREP! 😉 All_has_An _END_. \\nGreat advise. I have done the last 2 for years. \\nThe first one, not so much. Guest \\nFor some, staying out of debt and saving is hard work (as in self-discipline). If you fit in either one of those two categories, then you can say the first one applies to you, too. grumpyhillbilly \\nBetween the decades of lousy education and mass drug use, there is no simple fix. Steming the inflow of poverty might be a good start. End the war on men, especially white ones, would be another. And killing the Fed. Chris \\nForget the trains!! What about the super volcano in the Yellowstone? The Zika virus? Jade Helm? The Illuminati? The housing bubble? The Fed? Low interest rates? Oil bubble? AAAAGGG Evan Elliott \\nMy thoughts exactly. Such a confluence of events all at once…. Richard O. Mann \\nInformation overload. Oh yeah, that is problem too. Yes, it is an exciting time to be alive. Something about the tech market bubble deflating on one of the morning report programs. May have been Fox. Think I’ll take a nap. Gay Veteran \\nnot to mention outrage overload CASTIEL \\none problem at a time friend K \\nIn my area it was defiantly the war on coal, that killed the trains. Coal trains was about all that ran on the line. In my case it was CSX that was involved. Quite a few people were laid off. Because it ended up closing a repair shop for the railroad. People do not understand why Trump has the support, he has. Simple, people are sick and tired of D.C. making decisions, that cost them their jobs. It is really just that simple. When D.C. boasts they shut down the coal industry. You will have to excuse coal men, and railroad personnel for not cheering. SmallerGovNow2 \\ngreat post k, thanks… Steeve Girard \\nEven if the coal men did decide, it would not last long, because the coal they would produce would not be in acceptable standards for the buyers, for very long. K \\nWould have to disagree, because I lived it. I live in the smoky mountains in Tn. Every winter, I could tell you how cold it was in Virginia, by how much smoke was in my area. This was from the coal fired electrical plants. Then around 2010 it all changed. The latest filters were installed on the stacks, and you know what. They worked. I seldom saw smoke during the winter. When it was cold enough. The ice went from opaque to being perfectly clear. But they had already decided to kill coal. So no amount of improvement mattered. The simple fact is. Once D.C. makes a decision, no amount of facts will make a difference. Their arrogance knows no bounds. sistersoldier \\nYes indeed ‘K’ I agree. States such as Indiana, Kentucky, Virginia(s) are all under the same mandate by the “EPA” (supposedly) to reduce carbon emissions 32% by the year 2030. Converting the coal plants to natural gas which is reported to be cheaper and cleaner energy is underway where I live and near completion. There are trains collecting rust in my town as well. There is also a spike in my area of solar powered energy. Solar panels and equipment sales are soaring. Currently under construction are solar powered businesses, hotels, homes, new police station and state of the art hospital. I am not surprised to see the trains parked as they say “the only thing that is constant is change.” jsmith \\nCoal is an asset that this country has relied on for ages. And as you pointed out, much cleaner, and through the process of hydrogenation a cleaner gasoline than fracking can be made. I just can’t understand if the Germans were relying on hydrogenation during WW2, why haven’t we done it? Steeve Girard \\nIt does not matter where the mercury ends, in the environment or the filters as you say. It’s the quality of coal that is the problem: it’s EROEI, Coal is getting more and more costly to produce and contains more impurities with passing time. It is only a matter of time before, it’s grade is not acceptable. Mark \\nGood observation and agree. mtntrek3 \\nCoal will always have a part in the energy sector, but I’m not seeing it returning to levels in the days of yesteryear. I’ve suffered job losses because of the downturn in coal as well. The thing is all of the shale gas production has brought natural gas cost down considerably in the country, and of course gas burns cleaner. It has an unfair advantage in that respect over coal easily. We need some suitable substitutes for the coal industry jobs lost in the country for sure. If corporate greed would stand aside to allow our jobs to come back to the country……. it would be a big help. We manufacture little of what we use/consume in the country. Globalism is another factor in all of this. God help. Mike_Travis \\nCoal would be much less expensive were it not for the insane regulations that no one else in the world follows. Besides, it is NOT a function of the government to choose winners and losers in the market, nor is it within their power to CREATE losers which they frequently do. \\nGlobalism is the driving force behind all this mess which is why we are in this mess as governments everywhere WANT a collapse so they can force their criminal NWO on us all, then rule over us as subjects, NOT citizens. mtntrek3 \\nYes…. globalism being pushed by the powers that be in this world the main problem. We don’t need all the reg’s on coal , but some are needed to keep pollution down. Nat. gas very cheap now and burns cleaner that coal that’s been scrubbed…….. so that’s why coal is hurting so much now. Coal may make somewhat of a comeback in the future depending on what happens to gas production and geopolitical events here/worldwide. XSANDIEGOCA \\n“How did you go bankrupt?” \\nTwo ways. Gradually, then suddenly.” – Hemingway \\nWe have been through the Gradual part. We may be on the cusp of the Sudden Part. Guest \\nExcellent post. Many “suddenlies” yet to happen. sistersoldier \\n“It is easier, more delightful, and more profitable to build with other peoples’ money than our own.” \\nSo now we are beginning to see what happens when the powers that be run out of OTHER peoples’ money. The economy derails and stalls. David \\nThere is an old saying about putting lipstick on a Pig and it’s still a pig. I think Obama & our economists that are so optimistic about our economy are running out of lipstick. Deny what you can & downplay what you can’t seems to be DC Policy these days. as much as I love my country & miss the days of prosperity I would rather be told the Ugly truth about what is happening with our economy than to be lied to on a daily basis. Randy \\n  that truth since 1996, the year I found out just how the world wide fiat paper currency/electronic bookkeeping entry financial system scam is actually set up and runs! And who wanted to listen to me and take real steps to get out of the way of that runaway train that is going to fly off the rails when it hits the curve? NOBODY!! Everyone I talked to said that I was a nut job, didn’t know what I was talking about, et cetera, except for one guy. He did some preps, but then let life get in the way and undid most of it. Now he and his family are left standing nearly naked out in the cold night air. 1996 was also the year I wrote my first treatise on the subject, called What is Money? and it was ignored by most whom I shared it with. Steeve Girard \\nYou can’t make blind people read or deaf people hear. Randy \\nYes, I have seen that over and over again. But I still do my best to give them sight and make them hear. Mark Sivad \\nWhere I live in South Texas, I see many fairly new tank cars and bottom-dropping bulk carriers similarly stockpiled in places they never have been before (causing some local cities to complain). Must have been a tremendous over-building in all aspects of rail in recent years. LIZ THE SHIZ \\nmy future son in law just got back from Barcelona which is one of the busiest ports in the world and the commercial side was completely shut down , something’s going on??? jox \\nThey keep changing the way GDP is calculated, so perhaps we will never see another recession, no matter what the true economic output is. Joltin Joe \\nAll the government numbers are HIGHLY manipulated at best, and flat out lies most of the time. DareToCreateYourBestLife \\nAll statistics coming from DC are manipulated now. John \\nLiving in Arizona I have seen these train engines, what a sight. Scott Pease \\nBut, you ain’t seen nothing yet. Bu,bu,baby,you ain’t seen nothing yet. TellTheTruth-2 \\nI made the same observation when I saw over 100 engines sitting idle in the Roseville, California Union Pacific freight yard. BIGOTIST \\nRail workers? another “special” group of overpaid, over benefitted extortionists- Hopefully the thieves will all lose their job?~ JustBill \\nIf the train derailment risk calculation uses these metrics: number of active locomotives, and miles logged by locomotives with no change to maintenance of both locomotives and rail equipment then we may see fewer train derailments. I’ve found a bit of sunshine in the storm. All_has_An _END_. \\nMake no mistake about it ,after the election it is all down hill. I also think the elites will do anything to stop Trump. We could see a major revolt if Hitlary wins JustBill \\nThe largest overcapacity of any productive item on the planet is the human. JustBill \\nIf the American household is the center of the American economy, then the products and services it purchases, the wages earned by and the taxes/rent from collected from would drive the economy. \\nIf the economy and financial systems were not artificial then I think Production and Consumption would be shackled together. \\nWe’ve been provided data that displays the retail slowdown, slowdown of both CONUS and OCONUS shipping, decreasing velocity of money, and many traditional concrete indicators of activity and economic health and all are trending down. \\nCollapse or not nothing financial or economically appear to be healthy. \\nIs this the new normal? Are we treading Water? Ex Tempus \\n….these idle trains should be transporting all of the hot selling Government Motors cars, throughout North America! toktomi \\nI would offer that you probably should verify your source information before generating conclusions based on that information. \\nAs best as I can deduce from investigating the images of the engines, these pictures are two or three years old. I am not offering that as fact but merely as the best information that I can find in short order. \\n~toktomi~ jamesgwolfe \\nCome on you guys. They have put out there for some R&R and to soak up some rays. mister_roboto \\nThe same would be true if a caucasian member of the other major party were sitting in the Oval Office right now. Obama is as bought and paid for as nearly any other politician, so he says exactly what he is payed and commanded to say. The Kool-Aid drinkers of both of the major parties who are in the economic top 20%, as well as those who identify with them, have been increasingly adopted what I would call a “prison guard” sort of mentality towards the rest of society! House of Cards \\nThe most alarming stat here is the crashing velocity of money, how fast money changes hands. If money isn’t changing hands often, then the economy is slowing, period. These zero interest rates are creating more distortions. And the fact that the velocity of money is crashing along with zero rates is quite alarming. A major divergence. This cannot continue indefinitely. Orange Jean \\nI wouldn’t put too much stock in a photo from Goggle Earth showing a bunch of trains in the desert… unless there was other data proving they are idle. \\nYears ago I took Amtrack cross country (from New Orleans to Chicago and then from Chicago to Orange County, CA). Going through the desert they had to stop and creep … no more than 30 mph they said because it was too hot and if it gets too hot the train could derail. We were 11 hrs late getting into CA from the last leg of my journey where I stopped in SLC for a week. WTP1776 \\nObama promised that he would destroy the coal industry. sharonsj \\nWell, if the stupid politicians had not taken bribes from the auto and gas industry, we might still have a functioning rail system instead so that ordinary people could still travel by train. \\nI live in a rural area with no public transportation. All the small towns still have a rail line (and railroad stations) that are hardly used. If I could take a trail to the big city for shopping and entertainment, I would do it a minute. \\nMeanwhile, as the rich get richer and the rest of us are impoverished, there is no extra money for us to buy anything other than the necessities. angie hoekstra \\nHelpful writing . For my two cents , if someone has been looking for a YMCA Trading Post & Warm Fuzzies , my assistant encountered a sample form here https://goo.gl/tM1Tbq DIONNA CRIMMINS \\nGood article, Thanks!'"}, "time": 1742562655.9544451}