{"duration": 0.06485605239868164, "input_args": {"text": "'NTEB Ads Privacy Policy Last Minute Millions Pour In From Republican Donors As Donald Trump Surges Towards The Top Billionaire Sheldon Adelson just committed $25 million to an anti-Hillary Clinton Super PAC to try and help tilt the presidential race and down ballot House and Senate races to Republicans, Fox News learned Monday. There are indications the casino magnate will pony up even more by the end of the week. by Geoffrey Grider October 31, 2016 Adelson pours $25 million into White House race, more may be coming \\nBillionaire Sheldon Adelson just committed $25 million to an anti-Hillary Clinton Super PAC to try and help tilt the presidential race and down ballot House and Senate races to Republicans, Fox News learned Monday. There are indications the casino magnate will pony up even more by the end of the week. \\nTwo senior Republican sources familiar with the donation described it to Fox News as a “massive” amount of money to be spent during the final week of the presidential race and a sign that Adelson, who has largely been on the sidelines after initially suggesting he would give $100 million to help Donald Trump, is now going all in on the Republican nominee. GOP donors pouring-last minute money into the race: \\nThe money will benefit Future 45 , a Super PAC launched by the Ricketts family in Chicago, founders of TD Ameritrade. The group has recently been running a television ad in battlegrounds comparing Clinton to Richard Nixon, calling her a “secretive, paranoid politician who destroyed 30,000 pieces of evidence.” \\nThe Republican sources said the contribution was made in the last few days as the FBI re-ignited its investigation of Clinton’s email server, and could spark other big GOP donors – who may have thought the Democratic nominee was coasting to victory just days ago — to step up their support of Trump in the final days. \\nMost importantly, one source familiar with the Adelson contribution revealed he is considering pouring as much as another $25 million dollars into the race before Election Day on November 8. \\nThe first major contribution came as Trump visited Adelson’s Venetian resort and casino in Las Vegas for a rally with supporters on Sunday. Trump praised Adelson and his wife, Miriam, without any reference to the money that went to the Super PAC. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742563240.1538403}