{"duration": 0.04833722114562988, "input_args": {"text": "\"Foreign Policy Russian President Vladimir Putin gives a speech at a Valdai Discussion Club meeting of political scientists in Sochi, October 27, 2016. (Photo by AFP) \\nRussian President Vladimir Putin has dismissed as “hysteria” claims by US officials that Moscow is trying to influence the upcoming presidential election in America. \\nSpeaking to foreign policy experts during a Valdai Discussion Club meeting in Sochi, southern Russia, on Thursday, Putin said Washington was using Russia as a distraction to cover up the fact that this year’s White House contenders had nothing to offer on real issues. \\n“Hysteria has been whipped up in the United States about the influence of Russia over the U.S. presidential election,” Putin said, adding that so far no clear policies have been offered by the US political elite to tackle issues such as national debt and gun control. \\nAmerican officials and intelligence agencies have openly accused the Kremlin of sponsoring hacking attacks against the US. \\nThis is while Democratic presidential nominee Hillary Clinton and her campaign have gone even further, claiming that Russia was trying to rig the November election in favor of Republican nominee Donald Trump. US Democratic presidential nominee Hillary Clinton (L) and Republican nominee Donald Trump \\nDuring the last presidential debate last week, Clinton accused Trump of having secret ties with Moscow, saying that Putin would love to see a “puppet” president in the White House. \\n“It's much simpler to distract people with so-called Russian hackers, spies, and agents of influence. Does anyone really think that Russia could influence the American people's choice in any way? Is America a banana republic or what?” Putin asked in his Thursday speech. \\nBaffled by the release of a series of hacked emails that have uncovered the inner mechanics of the Democratic Party’s campaign for the election, the White House has stepped up its anti-Russian rhetoric. American officials have even threatened Russia with countermeasures. \\nDespite the general belief, however, Trump has on many occasions called on Russia-accusers to either provide their evidence or stop making baseless assumptions about Moscow. \\n“I don't know if they're behind it and I think it's public relations, frankly,” the real-estate mogul said Wednesday. “Do you know what bothers me? I have nothing to do with Russia.” \\n“People are hacking all over the place and nobody knows. They don't know if it's Russia. They can't guarantee it's Russia, and it may be,” he added. Loading ...\""}, "time": 1742563638.859669}