{"duration": 0.05035257339477539, "input_args": {"text": "'A new Norwegian study has found the gap in labour participation rates between citizens born in Norway and third world migrants widens the longer newcomers have been in the country. [Researchers at the Ragnar Frisch Centre for Economic Research uncovered “encouraging signs of labour market integration during an initial period upon migrants’ admission”.  But after a period of just five to 10 years, according to the report, “the integration process goes into reverse with widening   employment differentials and rising rates of immigrant social insurance dependency”. “Basically we were very surprised by these results, because really the differences between immigrants and   citizens should be getting lesser and lesser the longer migrants have lived in Norway. We found that the opposite happens,” said Knut Røed, a senior researcher at the Frisch Centre. Norway’s acting minister for immigration and integration Per Sandberg said the government is aware of problems highlighted by the report, but suggested that not everything can be solved politically. “Even if the government went further still in delivering migrants jobs and opportunities, we mustn’t forget that politicians can’t force people to become integrated,” said the minister. He added: “There must also be a significant commitment from individuals themselves, if they are wanting to succeed in Norway. ” Norwegian newspaper Verdens Gang described the findings of the study as “very bad news” for the nation’s welfare state. “The conclusion is clear: if we do not succeed in getting newcomers into work, our entire welfare model will be in jeopardy,” the paper’s editorial read. Norway’s welfare state is not the only aspect of life in the Nordic nation that mass migration threatens to disrupt, it has been warned. Last year, the head of the Norwegian Police Security Service (PST) stated that Muslim immigrants are resistant to integration and can cause “problems” for the host nation. “A strong increase in immigration, particularly from Muslim countries, can cause other   challenges. When a large number of asylum seekers come to a local community, it can have unfortunate consequences,” said PST head Marie Benedicte Bjørnland.'"}, "time": 1742563408.9287775}