{"duration": 0.08014893531799316, "input_args": {"text": "\"How Much Of A Political Junkie Are You? Posted today Sure, you might think you’re hot stuff by being able to name one of the presidential candidates. But can you attain true political-junkie status? Find out below. 1. Check off every behavior that describes you: In between elections, I just stay in the voting booth. I put a penny in a jar every time I think about Congress. As Electoral College results come in, I like to bruise or burn the states in the map of America tattooed on my chest. I know all nine issues, including Environment, Big Fiscals, Fighting, the Lantern Question, and Shipping Glue Overseas. I spent my college summer vacations camped out on the Washington mall, just in case I could hear any laws being yelled about. I love looking at election maps and imagining what they’d look like back in the Pangea days. I am always looking high and low for politics. I describe Google as “the website that takes you to Poltico.com.” I am fifth in the line of presidential succession. My idea of a fun Friday night is filling a bathtub with warm maple syrup and feathers to give myself a big mess to clean up while I think about politics. I can name any senator from the past three decades, and I can tell you whether or not they have an outie belly button. Wolf Blitzer is near me. I have an unopened case of Paul Ryan’s old energy drink, Konkrete Kik. I wouldn’t tell America’s enemies how many electoral votes Maryland has, even if I were being tortured. Every four years for three months, people avoid me like the plague. Get results Results for How Much Of A Political Junkie Are You? You Are An Out-Of-Control, Borderline Psychotic Political Junkie. You're clearly so obsessed with politics that when you see the CNN “BREAKING NEWS” bumper, your whole body convulses in dry, silent near-orgasm. Sorry this election is about to be over, because you need this bullshit to live! Share Your Results\""}, "time": 1742628582.4548466}