{"duration": 0.1356205940246582, "input_args": {"text": "'At the time, it was a momentous announcement: New York City officials said they would eliminate solitary confinement at Rikers Island for all inmates under age 22. The declaration, made in January 2015, put the city’s   Correction Department in the vanguard of national jail reform efforts. But a year and a half later, the administration of Mayor Bill de Blasio is still struggling to pull it off. The city missed another deadline last week, and it is now requesting a second   extension. City officials had originally promised to end the use of the punishment for young adults by January 2016. Most of the 78 young adults who were in isolation at the beginning of the year have been moved out. But while the city has now eliminated segregation for the   to    there are some older, more difficult inmates remaining who cause such serious disciplinary problems, according to the correction commissioner, Joseph Ponte, that at least for now segregation is still needed. As solitary confinement has been emptied, the violence in the jail for young adults has significantly increased, Mr. Ponte wrote in a letter to the city jail watchdog agency last week. The correction officers’ union has long argued that ending the use of segregation would endanger guards and lead to greater violence. Eliminating solitary confinement is an expensive,   proposition. To replace it, the city has created enhanced supervision units, with two officers and one counselor for every 12 inmates. Not long ago, a typical cellblock was overseen by one guard for every 50 inmates. A few weeks ago, The New York Times interviewed several of the nine remaining inmates under age 22 still in isolation at the part of the jail complex known as 3 South Segregation Unit. A correction officer and a member of the commissioner’s press office were present for the interviews the inmates were shackled to a wall. “My first week I was in the box. I broke a guy’s jaw. He was big, too, so, you know, that boosted my ego. ” Since arriving at Rikers in March 2015, Mr. Delgado says he has spent about 40 days in solitary. At times, he said, life in the box could be a relief from the violence of the regular population. “I was fighting the whole week,” he said. “So, I’m like, damn, finally a break. I used to wake up, and breakfast is like 4, 5 in the morning. So you got to fight for your cereal, so I’m like I didn’t even brush my teeth. My heart is pumping, and I got to get ready. I don’t know what’s about to happen but it’s about to go down. I was exhausted. ” That feeling of safety lasted for only a few hours, he said. Other inmates yelled constantly, and he missed privileges like commissary and three daily phone calls. Mr. Delgado has been in and out of Rikers since he was 16, mostly short stints for drugs and other minor crimes. This time he is potentially facing a   sentence for the murder of a    man in Queens. “I think about it  —   damn this could be the rest of my life,” he said. “That’s why I got to have a radio or something to keep my mind off that, talk to someone. ” He looks forward to his girlfriend’s visits. “She keeps me at peace. She reminds me of what I got in the town. ” Because he is constantly in trouble, he and his girlfriend are separated by a glass partition during visits. He has not kissed her since September. “I forgot how her lips taste. ” Mr. Busgith has done several stretches in isolation during his six stays at Rikers, the longest for six months in 2014, when he was 18. He said he had no choice but to fight so he would not be seen as weak. “I don’t want to do time in the box, but eventually, due to the circumstances, I had to. ” The entire time he was being interviewed, an inmate nearby in Cell 11 screamed profanities. Mr. Busgith said he did not hear it anymore. “He do that all the time,” he said. “He’s just killing time. ” Mr. Busgith tries to speed up time. “You take your medication so you just sleep all day,” he said. “You talk with your peers, your colleagues. I’ve been locked up a long time. Lot of colleagues. You’ve got to be crazy to be in a cell 23 hours a day. Some people get locked up for shelter and food. I’m not one of those type people. I got a life outside. ” He has an older brother, Michael, serving time upstate at Southport Correctional Facility, in Pine City, N. Y. a   prison where all of the inmates are held in solitary. “He in the box right now, too,” Mr. Busgith said. “He’s got to do a year and a half. ” Though Mr. Busgith has never been upstate, he says his brother has told him it is better doing time there than at Rikers. Mr. Busgith said that at upstate prisons, “you get longer visits” and more recreation time. “You get to do better, you get commissaries better. Everything’s better upstate. It’s open, you in the open. Fresh air. You don’t breathe none of this Rikers Island stuff. ” “If we had the same privileges as general population, I wouldn’t mind staying here,” Mr. Waddy said. “It’s quiet, you get to stay to yourself. You’re safe. Got your own space, your own bed, your own toilet. You get to have your ‘me’ time. Get in population, you’ve got to worry about different personalities and everything else that comes with jail. ” Mr. Waddy had been in solitary confinement for about 30 days. This is his first stint at Rikers. He has been there for two and a half years awaiting trial and spends a lot of his days reading books, “like gangster stuff,” and working out: “Fifty   then 50 situps, 50 dips, 50 jumping jacks. Relieves stress. ” When he looks through the small window of his cell, he says, he can just barely see a television that hangs on a support column in the center of the cellblock, though there is no sound. He said he did not care about the closing of the solitary unit. “I’m just trying to go home,” he said. “I don’t pay attention to what’s going on. ” Though Mr. Martinez has been in this country only three years, he is on his fourth stint at Rikers. He fled to the United States from Honduras, he said, after a group of men murdered his father. “I saw when they killed him,” Mr. Martinez said. “I was there. ” To break the solitude, inmates lean against the steel cell doors  —   “getting up on the gate,” they call it  —   and shout back and forth to one another. They yell through the vents. During their one hour outside, spent alone in a bare recreation pen, they talk through the chain link fencing. Mr. Martinez speaks only Spanish, isolating him more than most. In solitary, inmates are at the mercy of guards for their most basic needs  —   meals, a shower, a sick call. They scream and bang their cell doors to get a guard’s attention. “I can’t talk to people someone has to translate,” Mr. Martinez said in Spanish. “It’s stressful. Sometimes the guards shout at you. It’s hard to use the phone, get things. ” He thinks it is good that the city is ending solitary confinement for inmates his age. “It gives people a second chance,” he said. “Someone gets brought here, they might not understand it. ” To pass time, he reads if he has a book or magazine National Geographic is a favorite. And he thinks about his case. “I’m facing an offer of three and a half years,” he said, “and I have to choose it or not. ”'"}, "time": 1742561789.2116435}