{"duration": 0.14069557189941406, "input_args": {"text": "'Everyone’s talking about the Deep State now.  The other day, Virgil searched  “deep state” and found, just in the Google News section, no less than 3. 86 million hits.  Republican politicians are using the phrase, and so are Democratic pols.  In fact, one Democrat, Rep. Ted Lieu of California, chose to “own” the phrase, tweeting, “We are #Deep State. ”  Translation: Trump, we are coming for you. [Indeed, the Deep State hashtag is now busy, used by both fans and foes of the DS.  There are even a bunch of Twitter accounts on the Deep State theme —  which may or may not have any connection to reality.   And there are even plays on the phrase, such as DeepStateGate, which by now is familiar to Breitbart readers, and also “Shallow State,” an   coinage from David Rothkopf, an appointee in the Clinton administration.  It was different back on December 12, when Virgil first started writing about the Deep State back then, references were scarce.  Yet today, if one goes to Google Trends and types in “deep state,” this is what one sees: a recent sharp spike in usage.  It’s fun to have company!  And speaking of company, I’ll hope you’ll continue to join me on our tour of the Federal Triangle, the heartland of the Deep State.  We started our tour at the Department of Commerce, and so next we’ll visit the federal bureaucracy in the next building over.   That would be the Environmental Protection Agency, which fills up, in fact, three different buildings, stretching from Constitution Avenue to Pennsylvania Avenue, from 14th Street to 12th Street.  (Plus, of course, the EPA has myriad satellite offices all over the country the total   is more than 15, 000, not counting contractors and grantees.) The EPA, of course, is right in the middle of the ongoing DC power struggle, which has spilled into open bureaucratic revolt.  On February 16, for example, The New York Times reported that EPA employees had brazenly been calling senators to urge them to vote against Scott Pruitt, President Trump’s pick to head the agency.  It was, the Times’ Coral Davenport observed, “a remarkable display of activism and defiance that presages turbulent times ahead for the EPA. ” Speaking of turbulence, the career staff at EPA is feeling it.  On March 7, Axios’ Jonathan Swan tweeted a picture of a sign at EPA, offering counseling sessions to fearful careerists:  Feeling Pressured?  Worried About Change at EPA?  The EPA’s Employee Counseling and Assistance Program presents a 45 min. seminar on “Dealing with Change. ” Yes, the delicate snowflakes at the agency need help —  your tax dollars at work. Yet whether they have had counseling or not,   seem to be girded for battle.  A rogue Twitter account, AltEPA, billing itself as the “resistance,” has 382, 000 followers —  and there are many more such accounts in existence.  It’s possible, of course, that some, perhaps most, of these accounts are fakes.  But probably not all.   In the meantime, some EPA people, long ago, developed their own “resistance strategies. ”  For instance, Lisa Jackson, the EPA administrator in Barack Obama’s  first term, had a nifty Deep State tactic —  she hid her identity, even with her own agency. As far back as 2009, Jackson was using a fictitious name, “Richard Windsor,” for her   in a seeming attempt to evade the requirements of the Freedom of Information Act and other transparency laws.  By some reckonings, such evasion might be counted as a crime, but Jackson suffered no ill consequences.  In fact, she is now a   vice president at Apple.   Given that sort of   precedent, it’s little wonder that a pervasive culture of clandestine operating still permeates EPA.  To illustrate, we might recall an EPA inspector general’s report prepared at the behest of the House Republicans: In   EPA employees sent or received 3. 1 million text messages on   devices of these, just 86 were archived for the federal records.   So what were all the rest of those    texts about?   Maybe they were all personal, or maybe they were leaks, or maybe they were    with Lisa Jackson —  we’ll never know.   And we can underscore: that’s just on government equipment who knows what’s been happening on personal equipment, and on personal accounts.   So as we can see, secrecy is one weapon that EPA lifers can deploy.  Another weapon is complexity.   The same Times reporter on the environmental beat, Coral Davenport, recently interviewed Jackson’s successor at EPA, Gina McCarthy, who served from 2013 to 2017.  McCarthy was eager to outline the torturous process that the Trump administration would have to follow to undo Obama regulations: If you want to do these executive orders that require a whole rewrite of the rule, you have to get that right, legally.  It took years to do those rules. To now ask for those things to be undone with less staff and low morale —  how are they going to do it? Yes, that’s standard Deep State stuff.  As bureaucrats like to say to the political appointees of any administration, “We were here when you arrive, and we’ll still be here when you depart.  In fact, by the time you figure out how things really work, it’ll be time for you to go!”  In other words, the Deep State is eternal, and throughout that eternity, Deepists have mastered the arcane procedures needed to make any sort of change.  So the message to interlopers is simple: Do it our way, or else face frustration, or even failure.     Moreover, perhaps more than any other government agency, the Deep Statists at EPA can call upon powerful outside allies —  in the media, in partisan politics, and in the realm of litigation activism. Let’s take a look, starting with the media.  On March 8, that same Times reporter, Coral Davenport, printed the names of five aides  that Scott Pruitt, having been confirmed for his post, now plans to bring with him.  Just a hunch: Davenport didn’t get those names from Pruitt instead, most likely, she got them from some EPA worker with inside access to his doings.  And so the Democratic war rooms, joined by so many others, can get to work building their “oppo” dossiers on each new hire.   Meanwhile, other media outlets, too, are piling on. Thus we get dozens of     headlines every day.  For example, here’s Slate: “Trump’s EPA Plans Are ‘Just Racist. ’” And MinnPost: “Trump’s EPA cuts would undo local efforts to restore iconic places —  like the Great Lakes. ” And Quartz: “Leaked document details plan to starve an already malnourished EPA budget. ”   Ah yes, there’s the “l” word again —  “leaked. ”  Indeed, it seems that back on March 3, the National Association of Clean Air Agencies got its hands on a Trump administration document calling for $2 billion in cuts at EPA, and then shared it with various publications, including The Oregonian.   And then on the second bounce of that particular   as reporters sought to give it “legs,” we saw headlines such as this, in Science: “Trump plan for 40% cut could cause EPA science office ‘to implode,’ official warns. ”  The EPA official doing the warning, of course, was unnamed.  Meanwhile, the internal communications at EPA have been leaking out in near  . That’s how things work in DC, every day.  Warning to Trumpsters at EPA: You’re going to be parachuting in far behind enemy lines, and they know where to find you.  Now we come to a second ally of the permanent regime at EPA, the increasingly greened Democratic Party.  Yes, it’s the Democrats who put the wind beneath the wings of the   (anti) industrial complex.  We can recall that it was not always this way: As recently as the 1960s, the Democrats cared cared more about growing the economy than greening the environment.   That is, Democrats worried about workers and their wages, and to that end, they focused on the development —  the word often used back then was “reclamation” —  of natural resources.  For example, the 1960 Democratic platform, the one that helped elect John F. Kennedy, was emphatic:  The new Democratic Administration will develop a comprehensive national water resource policy.  In cooperation with state and local governments, and interested private groups, the Democratic Administration will develop a balanced,   plan for each major river basin. Indeed, in those days, the Democrats attacked the outgoing Eisenhower administration for its alleged cheapness when it came to funding new projects: We will erase the Republican slogan of “no new starts” and will begin again to build   dams, hydroelectric facilities,   works, navigation facilities, and reclamation projects to meet mounting and urgent needs. By contrast, the 2016 Democratic platform offered a much different worldview: workers and wages were an afterthought, well behind penguins and polar bears.   In fact, the old concept of “reclamation” never appears at all instead, we get 16 paragraphs, for instance, on “climate change. ”  Of course, at this precise moment, in 2017, the Democrats lack the political power  fully to protect their friends at EPA, although they’ll certainly always be trying.  And now to a third ally of Deep EPA: the activist litigators.  As every conservative knows, the left has been far more effective, in recent decades, at winning in the courts than winning at the ballot box.  And yet on many issues, a win is a win: If a judge orders the government to take action of a certain kind, well, oftentimes that’s it —  that’s the ballgame.  No wonder the left is so tight with the lawyers!   And as a sign of the     flood to come, on March 8, nearly three dozen green groups filed a formal legal petition with EPA, demanding that the agency tighten the regulations on concentrated   operations (CAFO) also known as “factory farms. ”  As the lead plaintiff, Wenonah Hauter, executive director of Food  Water Watch, declared,  This petition paves the way for EPA to finally regulate CAFOs as required under the Clean Water Act, and explains that allowing CAFO pollution to continue unabated by maintaining the woefully inadequate status quo would violate federal law.   That petition, we might note, is 58 pages of closely argued legalese, boasting 294 footnotes.  And there’s a clear call to action in the document’s conclusion as it reads, “Petitioners believe that EPA has an obligation pursuant to its [Clean Water Act] duties to [take new action against CAFOs] without further delay. ”   In other words, it’s a serious legal demand, aimed at forcing EPA to take additional regulatory action.  Or, failing that, to persuade a judge somewhere to order such additional regulation into existence.  So now Virgil wonders: Who among Team Trump at EPA is actually going to have time to read this petition, let alone develop an appropriate legal  ?  And so what might happen if the Trump people choose to delegate the handling of this case to the EPA career staff?  Well, we know what could easily happen: The Deep Statists at EPA could consult with their   friends, neighbors, and former   classmates —  quite possibly, including the very people who filed the CAFO case —  and come up with a nice green answer.   That is, it’s easy to see EPA Deep Statists communicating with their friends —  perhaps even their spouses —  in the activist legal world.  Suppose, for example, that two grocery shoppers at the Whole Foods in Northwest DC’s Tenleytown neighborhood just happen to have a friendly ex parte conversation?  You know, about maybe, legal strategy in the CAFO case?  What would be the policy upshot of such a chat?  As an answer, here’s one scenario that we’ve seen many times before: The career legal staff tells the thin layer of political appointees at an agency that the plaintiffs have a strong case, and so it’s best to settle.  That is, except for maybe a few   tweaks, give the plaintiffs what they want.  After all, the careerist could be saying to the politicals, if you choose to fight, it could get really messy, and, in the end, you’d likely still lose.  So why not do it the easy way?  Why not do it our way?    That’s the pitch that’s been heard a million times within the Deep State.  And while it doesn’t always work, since it’s the path of least resistance, it’s a familiar course of action.  And so we see how the Deep State so often wins.   '"}, "time": 1742628431.5067291}