{"duration": 0.13076400756835938, "input_args": {"text": "'Activist Post \\nA month after the last ceasefire in Syria fell apart as a result of the failure of the United States and its terrorist proxies to adhere to just one of their obligations under the agreement, the United States government is still claiming that the reason there is no ceasefire ongoing in Syria is entirely the fault of President Bashar al-Assad and, of course, the scary Russians. \\nIn fact, on October 20, infamous narcissist, State Department Spokesman John Kirby openly stated that the “only thing” standing in the way of a “permanent ceasefire” in Syria is the “regime” of Bashar al-Assad. \\n“The only thing that stands between where we are now and a permanent and enduring ceasefire in Syria is Bashar al-Assad and his supporters,” he said. \\nIn other words, “If Assad would just step down and let us have our way with his country, we wouldn’t have to keep killing civilians, funding proxy terrorists, and bombing Syrian infrastructure.” Doesn’t Assad understand that the U.S. owns his country and that he is supposed to follow the dictates of Washington regardless of what the Syrian people desire? The nerve of Assad, trying to defeat terrorists and maintain the sovereignty of his nation! \\nKirby did, at least, acknowledge the presence of al-Nusra, but only tepidly. “We recognize Al-Nusra as a spoiler, we have concerns about co-mingling, I’ve talked about this ad nauseam,” he said. \\nOf course, al-Nusra is more than just a mere “spoiler,” it is open terrorist organization that the United States armed, funded, and trained to act as a proxy force that is no ideologically (or even physically) different than ISIS, Ahrar al-Sham, or the “moderates” of the Free Syrian Army. It is also an organization that the United States was supposed to separate from the groups of these shadowy “moderates” we have heard so much about over the course of the last five years but who are apparently phantoms lurking about in the rafters of the Syrian theatre. \\nThe very fact that the United States blamed Russia (along with Assad) for the collapse of the ceasefire and argued that the U.S. was not supposed to separate the “moderates” from the “extremists” until after seven days is thus an admission that, without the requirements of the ceasefire in place, the U.S. would never have separated them at all. But this was the crux of the U.S. position; essentially that it knew who the “moderate” cannibals were and that they were different from the extremist cannibals. If that is the case, then wouldn’t separating the two be the goal all along? Why did the United States need to be required by a ceasefire agreement (as a concession no less) to separate the two different elements of the “opposition” if it was truly in support of defeating the “extremists?” \\nAs Joseph Thomas writes for New Eastern Outlook , \\nIt also appears to be no coincidence that this scenario now openly unfolding in Syria fulfils warnings published by Western journalists as early as 2007 ( Seymour Hersh, The Redirection ) in which it was revealed that the US was already at that time providing material support to extremist organisations “sympathetic to Al Qaeda” toward the end goal of overthrowing the governments of both Iran and Syria. \\nWhile the US now claims Russia has sabotaged US efforts to bring an end to hostilities in Syria, Washington is also illogically attempting to argue that the failure of its feigned “peace talks” has also somehow prevented the US from targeting terrorists organisations in Syria, the alleged pretext of America’s presence in Syria to begin with. \\nDespite strained relations with Russia, the US is still cooperating with Moscow regarding the use of Syrian airspace to avoid unintentional confrontations. While the cessation of hostilities may have collapsed, is there really any excuse as to why separating designated terrorist organisations from militant groups the US and its allies are providing billions in weapons and equipment to is still not an absolute and urgent priority? \\nThe answer is, no — there is no excuse. Or perhaps it is more accurate to say, it is simply an excuse for the US to continue funnelling men and materiel into Syria Washington knows with absolute certainty will end up in the ranks of Al Qaeda, whom the US admittedly intended to use as early as 2007 to overthrow the Syrian government with. \\nAs a result, the State Department’s ridiculous leveling of the blame for the failure of the ceasefire on Assad can be chalked up to yet another statement based in absolute falsehood and intentional deception. Indeed, this is the type of statement the U.S. State Department is becoming renowned for the world over, from blaming Russia for bombing a convoy even if it didn’t bomb the convoy , claiming Russian aggression in Ukraine, asserting that Assad is “killing his own people,” “barrel bombing civilians,” and attacking hospitals, what little shred of credibility the State Department may have left outside of American borders is rapidly disappearing. \\nBrandon Turbeville – article archive here – is the author of seven books, Codex Alimentarius — The End of Health Freedom , 7 Real Conspiracies , Five Sense Solutions and Dispatches From a Dissident, volume 1 and volume 2 , The Road to Damascus: The Anglo-American Assault on Syria, and The Difference it Makes: 36 Reasons Why Hillary Clinton Should Never Be President . Turbeville has published over 850 articles on a wide variety of subjects including health, economics, government corruption, and civil liberties. Brandon Turbeville’s radio show Truth on The Tracks can be found every Monday night 9 pm EST at UCYTV . His website is BrandonTurbeville.com He is available for radio and TV interviews. Please contact activistpost (at) gmail.com . \\nThis article may be freely shared in part or in full with author attribution and source link . This entry was posted in propaganda . Bookmark the permalink . The U.S. National Bird Is Now a Drone → MyWikiDisQus \\nKirby the human Furby communicates in Furbish to confuse and deflect the reporters’ questions in the press secretary briefing room. He stated that, ‘the “only thing” standing in the way of a “permanent ceasefire” in Syria is the “regime” of Bashar al-Assad.’ \\nYes, the well worn political science propaganda phrase, “the only thing standing in the way of a permanent ceasefire is …” has been used across the centuries to twist the truth in favor of the aggressor. Imagine England’s King George III proclaiming this to the American colonists or the Nazi’s dictating it to the French Maquis, or in more modern times, the Israelis persuading the Hamas resistance in Zionist occupied Palestine. \\n“Surrender to U.S. hegemony and relinquish all sovereign rights to Syrian land and its natural resources so our corporations can exploit it,” is what the stark message really means. \\nAt the end of the session, Kirby left the journalists dumbfounded with his favorite Furbish goodbye, “u-nye-way-loh-nee-way” which translates to, “You go sleep now”. The whole world is in a slumber, insouciant to the ground swell of evil slime that flows out of the Potomac’s foggy bottom to spread tyranny everywhere. madrino \\nMr. Swanson’s research of America’s history of coups, wars and similar acts identifies to me, not to expect change to come from the power structure that has been in place since the country’s inception. Syria, Libya, Iraq, Afghanistan and countless others are under the boot of the war of terror. Those of us that want peace must wage peace since all other organizations that claim to be such have proven otherwise. Since the creation UN, the wealth gap between rich and poor nations has gotten much greater, and the movement of wealth within rich nations is concentrated at the top .01% as so aptly described by Carl Herman. Charles Hugh Smith has promoted ideas and solutions to change the current system of privlage of the few, to opportunities for all willing to put in the effort to succeed socially and economically. twinfishfour . \\nThe US has left Iraq and Libya in chaos, and it intends to leave Syria in chaos, with portions of the spoils promised to Israel and other portions promised to the Kurds. The chaos inflicted on Syria by US policy with help from the Saudis and others will not resolve immediately, but it will resolve a lot sooner if the US ceases to attempt regime change in Syria. Which is more “convert to failed state” than regime change if you look at the pattern established in Afghanistan, Iraq, and Libya. Even Ukraine, in spite of the conversion of property and power to the Fortune 500 and crony capitalists from the west, is worse off than it was before US attempts (through proxies) at regime change. So, now, when it comes to foreign policy, if Uncle Sam’s lips are moving, they are telling lies. Irony of ironies. skygroup \\nApply online in just minutes, with no impact to your credit score. You can instantly review the loan offers that you qualify for, and you’ll never need to visit a branch to complete your application.Flexible financial tool. Contact Donate'"}, "time": 1742562296.0120301}