{"duration": 0.045868635177612305, "input_args": {"text": "'Facebook reported a group of BBC journalists to the police after they highlighted and sent the social network images posted on Facebook that broke the site’s terms of service during an investigation on pedophiles. [“As part of an investigation into pedophile groups on Facebook, the BBC flagged 100 pieces of infringing content via the report button,” Gizmodo reported. “Despite its own rule that ‘nudity or other sexually suggestive content’ is forbidden, Facebook removed just 18. ”  “When the BBC pointed this out to director of policy Simon Milner and asked for an interview, he agreed on the condition the BBC provided examples of the images  —   for which Facebook then reported the journalists involved to the National Crime Agency,” they continued. “To add insult to injury, after reporting journalists for complying with its request for examples of images that moderators had not removed, Facebook then canceled the promised interview. ” In a statement, Facebook accused the BBC of breaking the law while distribution images of “child exploitation. ” “It is against the law for anyone to distribute images of child exploitation,” said Facebook. “When the BBC sent us such images we followed our industry’s standard practice and reported them to CEOP (Child Exploitation  Online Protection Centre). ” The BBC claims that some of the content found on Facebook included: “I have been very disturbed by what I have seen, very disappointed that one year on we are still seeing images that are very sexualised, totally in my view unacceptable,” said the Children’s Commissioner for England, Anne Longfield. “The moderation clearly isn’t being effective, I would question whether humans are moderating this, are looking at this, and also I think it is failing to take account of the context of these images. ” Facebook’s response was also criticized by the National Society for the Prevention of Cruelty to Children (NSPCC). “Facebook’s failure to remove illegal content from its website is appalling and violates the agreements they have in place to protect children,” declared the charity in a statement. “It also raises the question of what content they consider to be inappropriate and dangerous to children. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564000.4054642}