{"duration": 0.09964823722839355, "input_args": {"text": "'Ang Lee’s new film, “Billy Lynn’s Long Halftime Walk,” contains sights perhaps never so vividly rendered in a movie. When bullet casings fly from a machine gun, each one is clearly visible rather than appearing in a blur. When Billy Lynn (Joe Alwyn) a soldier on leave from Iraq, tears up at the national anthem or experiences battle flashbacks during the smoke bombs of a Destiny’s Child performance, the emotions in his eyes register with uncommon clarity. On the other hand, when Steve Martin mugs as the owner of a pro football team, his face contains a level of detail normally preferred by dermatologists. These are the   of working at a high frame rate, the speed at which a film is shot and, in some cases, projected. The rate has a strong effect on an image’s sharpness. Mr. Lee shot “Billy Lynn” at 120 frames per second, far faster than 24, the standard for about 90 years. Few theaters are presenting it at that rate, so most viewers are out of luck  —   or perhaps better off, depending on your views on frame rates. For some directors, like Peter Jackson  —   who shot “The Hobbit” at 48 frames per second, to largely negative reaction  —   and James Cameron, higher frame rates are the future of movies, an opportunity to correct the motion blur that afflicts   action sequences shot at the standard rate. Introducing “Billy Lynn” at the New York Film Festival last month, Mr. Lee, who won a directing Oscar for his work with   digital cinema on “Life of Pi,” expressed trepidation about reaction to what he called “kind of an experimental movie” and asked the audience to keep an open mind. He had reason to worry. David Rooney of The Hollywood Reporter offered a typical reaction. The film, he wrote in his review, had the “somewhat distancing   sharpness of many outsize     TVs. ” High frame rates aren’t new they’re used in video games and on television. And that’s the problem: Viewers, accustomed to the softer texture of movies, see the extreme sharpness of    cinema and feel intuitively that they’ve stumbled into a theatrical broadcast or a football game. “If you start increasing the frame rate of the movie, whether it’s 48 or 60 or 120, it can tend to start looking like a television show,” said Douglas Trumbull, a director and special effects expert who has been a pioneer in high frame rates. In the 1970s, he developed the Showscan process, which ran at 60 frames per second. Still, he said, there is no need for that association: “I can guarantee you that we can make a    movie that does not look like television. ” The 24    rate, at which most movies, even digitally projected ones, are shown, was always something of an accident. At the dawn of sound, when the rate was standardized, going more slowly would have muddied the audio and going faster would have exceeded the sensitivity of existing film stocks, said Dean Goodhill, one of the editors of “The Fugitive” and an inventor of MaxiVision48, a    process from the late 1990s that never got beyond a demonstration clip. There were other experiments with frame rates in the celluloid era. The   process of the 1950s ran at 30 frames per second. Cinerama used three simultaneous projectors and ran at 26 frames per second. In both cases, the higher rates were needed to accommodate outsize screens that made flicker and blur more visible. Tim J. Smith, an academic who studies visual cognition at Birkbeck, University of London, said there is no scientific reason 24 frames per second should be more appealing to viewers. “What we’re coming into the cinema with is the same audiovisual sensory system we have before we go into the cinema,” he said. In theory, he said, the move to a higher frame rate should “lead to more natural, more effortless processing by the viewer’s visual system. ” Acculturation may be the main reason moviegoers find the sharpness  . “It’s interesting that people are sensitive to it,” Mr. Smith said. “They’re seeing a crispness to the image, which is unfamiliar in the cinema context. Their main frame of reference seems to be TV or video, and kind of implied by that association is ‘cheapness’ or ‘documentary’ or ‘immediacy.’ Is it good to have that? It’s hard to know. ” But the film historian David Bordwell said that high frame rates have only   as a solution to a problem that is specific to digital cinema, particularly murky digital   which grows less murky when frames are added. He noted that at least on a   screen, there was never any of the dreaded stammer in the panning shots of Kenji Mizoguchi, Max Ophüls or Jean Renoir. “People who doubt it should see the films (on film, not video) to check,” he wrote by email. For Mr. Trumbull, who demonstrated   rates for Mr. Lee but did not take part in the production of “Billy Lynn,” the increased film speed of his Showscan process was a natural outgrowth of the move toward bigger screens and bigger spectacles in the 1950s and 1960s, but a faster rate was never taken up as the industry moved toward multiplexes and tiny auditoriums. He was effusive about Mr. Lee and his willingness to experiment  —   a “wonderful, brave and courageous effort,” he said. But after watching the movie at the New York Film Festival, he wasn’t pleased. “I was really upset when I was at the premiere of ‘Billy Lynn’ that it was in a very narrow,   theater,” he said. He felt that it was projected with too much illumination, that it needed dark time between frames. (We don’t perceive them as such, but movies are successions of still images  —   and on most projectors, each flash is interspersed with moments of darkness.) “Billy Lynn” has almost no darkness. In response, Ben Gervais, the film’s technical supervisor, said, “We found that there was no real advantage in terms of the way that the movie felt” with added dark time. Mr. Trumbull also said that it was crucial to present the film on a screen that filled a wider frame of vision, like Imax, to show the benefits of   rates and to keep cinematic texture. “We shouldn’t draw conclusions about high frame rates as a result of ‘Billy Lynn’ being incorrectly presented,” he said. “It would be really tragic. ” Mr. Trumbull has a competing   rate format, Magi, which is different from Showscan. But he said Magi has solved what he sees as the problems of “Billy Lynn. ” It may also be necessary, he added, for filmmakers to alter their approaches to suit the format. He recalled his own experience working on the visual effects of “2001: A Space Odyssey,” for which the camera motion was slowed so that the visuals would look smooth on a giant screen. “That’s what kind of led to the style of the movie,” he said. Like Mr. Trumbull, Mr. Goodhill said that it was possible to retain the cinematic texture while gaining the clarity of the higher frame rate. MaxiVision48  —   lavishly praised in 1999 by Roger Ebert, among others  —   looked “both new and traditional at the same time,” he recalled. But he emphasized that he doesn’t necessarily regard that texture as the right one. “That’s up for the individual artist to decide. ”'"}, "time": 1742562384.9237027}