{"duration": 0.02556586265563965, "input_args": {"text": "\"(Before It's News)\\nThis is a good article :\\n“When Donald Trump rode down an escalator at Trump Tower to launch his presidential campaign in June 2015, he began galvanizing a populist version of the Republican Party.\\nBut he didn’t create it.\\nThe GOP that carried Mr. Trump to the presidential nomination was formed by waves of new voters who washed onto Republican shores in the last four decades: George Wallace Southerners, Ronald Reagan Democrats, Pat Buchanan pitchfork populists and tea-party foot soldiers.\\nThe Republican establishment was happy to have the votes of these newcomers, many from America’s working class, and accommodated their cultural preferences on social issues from guns to abortion to gay marriage. What the establishment didn’t do was adjust the GOP’s economic approach to match the populist impulses—or even seem to consider such a shift necessary. …”\\nRich Lowry put it well here :\\n“Our basic argument about Trump is simple and unassailable: He is a populist, not a conservative. Conservatism has always had a populist element, but it has been tethered to conservatism’s animating causes of liberty, limited government and the Constitution. Trump inveighs against elites and tramples on political pieties, but these causes are afterthoughts to him, at best.”\\nRoss Douthat put it better here:\\n“Sometimes this interdependency has worked out well. At its peaks of political success, the conservative intelligentsia has channeled and directed populism, responding to grass-roots passions without being ruled by them.”\\nThe goal of the conservative intelligentsia has always been to CUCK the populist vote so that all of its anger and energy can be “tethered” or “channeled” into advancing the conservative agenda (read: classical liberal agenda) of the “governing wing” of the Republican Party. The role of populist voters in the GOP is to show up on election day and vote for a handpicked establishment candidate like Mitt Romney or ¡Jeb!\\nIn this way, the conservatives can pass new free-trade deals for their corporate backers in the US Chamber of Commerce, start massive new destructive, unending wars in the Middle East, and keep the border wide open so that an endless influx of Third World cheap labor can further enrich the plutocracy. They figured all those yokels would just keep voting for them indefinitely because Democrats want to abort babies and seize guns.\\nGive them lip service! Give them token gestures! Give them round after round of failure theater! You know, it kind of worked too until their whole signaling structure broke down. That’s what happens when an elite loses its legitimacy. To borrow an analogy, the falcon doesn’t respond to the Falconer anymore and the elite falls.\\nIt is only a matter of time.\""}, "time": 1742628585.7370803}