{"duration": 0.0073089599609375, "input_args": {"text": "'BOBIGNY (FRANCE) (AFP)  —   Police fired tear gas after clashes erupted in the suburbs of Paris as demonstrators protested over the assault of a young black man who was allegedly anally raped with a truncheon while being arrested. [Surrounded by a heavy police contingent, about 2, 000 protesters, some carrying placards saying “Police rape” and “Police kill innocent people,” gathered in Bobigny, northeast of the French capital, to demand “Justice for Theo”.  Theo, a    black youth worker, required surgery after his arrest on February 2 in the “3, 000” estate in the gritty suburb of    when he claims a police officer sodomised him with a baton. Projectiles were thrown at police on a footbridge with several vehicles torched and windows smashed on the sidelines of the protest, police said. “Several hundred violent and very mobile individuals” committed various “acts of violence and damage,” said the Paris police prefecture. In a statement it listed projectiles thrown against public buildings, four vehicles torched, two shops and a bus station damaged and several bins burned. “The police had to intervene to rescue a young child in a burning vehicle,” the police said, adding however that no injuries had been reported so far during the protest. Two media vehicles were also attacked, with no casualties reported. The demonstration ended in the evening after police fired tear gas. Theo, who is still in hospital, and his family have appealed for calm after several days of protests over the alleged assault. Rape charges have been filed against the officer and all four police involved in Theo’s    have been suspended pending an investigation. With a presidential election this year, the incident has become highly politicised. It has also underscored the breakdown in trust between young people and the authorities in French suburbs. “All the time, we get checks, we get assaulted, they talk trash to us, we say, ‘Shut up’  …     We are given little slaps,” a young man of about 20 named Kenzo told AFP. “I didn’t think it still exists,” said    Anissa. ”How can they say it’s an accident?” Rallies took place in other French cities, including Rouen where some 200 people demonstrated, while around 250 gathered in Toulouse and more than 300 in Nantes.'"}, "time": 1742628565.1910114}