{"duration": 0.10464835166931152, "input_args": {"text": "'CANNES, France  —   Filmmakers find inspiration in love, nature, faith, trauma, other people, other movies. The German director Maren Ade discovered a muse for her latest, the sensational “Toni Erdmann”  —   a critical favorite at the 69th Cannes Film Festival  —   in an American comic who died in 1984: “I fell in love with Andy Kaufman. ” Maren Ade (pronounced    ) also fell for Kaufman’s most outrageous creation, the belligerent insult comic Tony Clifton, whose first name she borrowed for the title character of her new movie. Toni is the fabrication of Winfried (Peter Simonischek) a music teacher who uses this outsize persona to infiltrate the life of his only child, Ines (Sandra Hüller) a corporate strategist on assignment in Bucharest. Toni emerges after Winfried pays a brief, awkward visit to Ines, who barely makes time for her father. Exit Winfried, enter Toni, a lout with a wolfish leer, a fright wig and false teeth who claims to be a “consultant and coach” for the chief executive of Ines’s company. “Toni Erdmann” quickly lifted the festival mood and Ms. Ade’s international profile, though it was shut out on awards night. “It’s nice and weird at the same time,” she said of the attention the day after her movie’s first press screening. While here, she racked up 30 hours of interviews with 60 journalists from more than 15 countries. Seated on a terrace in the festival headquarters overlooking a   marina, she seemed remarkably at ease, especially given that she had been working on the movie days before the festival opened. “It was very, very crazy to just get it here. ” We met again a few days later in a small Italian restaurant. She was at once alert and relaxed, although also hoarse, either from all the interviews or, she thought, tending to her   . She had brought both her sons  —   the other is 6 months old  —   along with her partner and assorted grandparents. That afternoon, she and her family planned to take a boat to a nearby island for a break before heading to a friend’s house. Sipping warm milk with honey to soothe her throat, and speaking in English, she seemed pleased by the praise, if somewhat exasperated that the movie had been described as arriving out of the blue. “In your own life,” Ms. Ade said, “nothing is out of the blue. ” Some of this surprise doubtless stems from the movie’s comedy, a quality not always associated with German cinema, especially in a temple of seriousness like Cannes. In addition, until now, Ms. Ade, 39, has been largely known only inside rarefied cinephile circles and it has been seven years since her last feature, “Everyone Else. ” Since then, she has produced movies and had her children she was pregnant with one son while writing “Toni Erdmann” and pregnant with the second while working on it in postproduction. As she once put it, “I became a mother, which is also like making one film at least. ” The textured realism in “Toni Erdmann” also needed time. “It took long to develop the characters and to really find that story,” Ms. Ade said. “It came step by step, going deeper and deeper into the game they’re playing. ” As a character, Toni enables Winfried to insinuate himself into Ines’s   life. He barges into her workplace and social events, becoming a classic trickster, that mischievous, subversive figure who upends the status quo. Lewis Hyde, a scholar of tricksters, argues that they emerge from need: “There are large, devouring forces in this world, and that trickster’s intelligence arose not just to feed himself but to outwit these other eaters. ” With a demented smile and oversize teeth, Toni the trickster sets out to sabotage the forces devouring his daughter. Most obviously, “Toni Erdmann” is a   story, if one thankfully without the familiar therapeutic platitudes and psychological tidiness. Ms. Ade had been interested in the   dynamic “for a long time,” she said. “I found out that during writing it’s difficult to escape your own family. ” The inspiration for Toni’s teeth came from a gag set she was given at a premiere of “Austin Powers” when she was 20 and working for a production house. She gave the teeth to her father, who she knew would make good use of them, and together they, with Andy Kaufman and Tony Clifton, became part of her exploration of role playing. “Toni Erdmann” is only Ms. Ade’s third feature, after “The Forest for the Trees” (2003) and “Everyone Else,” which shared the Silver Bear (second place) at the 2009 Berlin Film Festival. Ms. Ade began making amateur movies with a camcorder when she was a teenager and attended the University of Television and Film Munich. There, she and another student, Janine Jackowski, founded Komplizen Film, which produces Ms. Ade’s work along with those of other   names like Miguel Gomes. (A third partner, Jonas Dornbach, joined Komplizen in 2010.) Having her own company, Ms. Ade said, gives her the freedom she wants  —   and the control she seems to like  —   including the luxury to rehearse on location. “Everything had to come out of the characters,” Ms. Ade said. “Maybe that’s also why the film needs time. ” The movie runs a comfortable, perfectly calibrated two hours and 42 minutes, although she did try to shorten it. “I went back into the editing room three weeks after giving birth, because I wanted to be sure that it’s the right length. ” But when she tried to cut it, she felt the movie lost its complexity. It makes sense. Ms. Ade is a pointillist, and over the span of “Toni Erdmann,” you don’t only watch Ines and Winfried, you also learn to read their looks, to inhabit their silences and to recognize the weight of their seemingly meaningless moments. Last November, after her second son was born, Ms. Ade sat down with her   and asked them to be honest about whether the film had a shot at being selected for Cannes. It’s an index of this event’s significance to a filmmaker like Ms. Ade, whose importance isn’t measured in box office numbers, that she powered ahead to finish the movie by the festival’s deadline. Her persistence and work paid off, because long after this year’s juries have disbanded and the world has forgotten who won this year’s awards, the 2016 edition will best be remembered as the year Ms. Ade gave us “Toni Erdmann,” a work of great beauty, great feeling and great cinema.'"}, "time": 1742561779.3068871}