{"duration": 0.03141188621520996, "input_args": {"text": "'Written by Franklin C. Spinney   Pentagon’s five year plan has been planted (or in Pentagon-speak, “front loaded”) with the seed money for a top-to-bottom modernization of our nuclear forces — a new bomber, new inter-continental ballistic missiles (ICBM) (even though the Minutemen III has just been completely modernized and is essentially a new missile), new nuclear-powered ballistic missile submarines (SSBM), upgraded (read “new”) submarine-launched ballistic missiles (SLBM), a new cruise missile, and big upgrade (read “new”) to the B-61 dial-a-yield nuclear bomb (including precision guidance which implies going back to the looney tit-for-tat nuclear war-fighting doctrines of late 1970s), a new nuclear-hardened satellite based command and control system to manage all these goodies in a nuclear war, even more money for the strategic defense initiative (SDI) (the shield to protect the aforementioned swords), and a rebuilding of the nuclear lab infrastructure. The current estimate for all of this is one trillion dollars, with a spending tail out to at least 2080. That number is surely a grotesque underestimate, because no one really has a clue what these as yet undesigned systems will cost to buy, much less to operate in the distant future. And if the problem-plagued F-35 has proven anything, it is that the Pentagon’s ability to predict the future budgetary consequences of high-complexity weapons development programs is laughable. If you were a Russian with proud and painful memories of the bloodletting, terror, bravery, and patriotic myths of the 1812, WWI, WWII, and the Cold War, how would you react when a possible adversary becomes hell-bent on shoveling money into such a program? Would you believe it is for deterrence only? These nuclear modernization programs need time (at least 3-5 years) to gestate — i.e. to impregnate the US body politic with a politically-engineered flow of money to as many congressional districts as possible. Once the congressional districts become addicted to its money flows, the nuclear modernization program will become unstoppable for the same reason the F-35 is unstoppable, and an escalating cold war will be necessary to justify them over the long term. Should that happen, we won’t see the end of Cold War II in our lifetimes. Think of the front-loading, political engineering power games (as I explained in a 1990 pamphlet and again in congressional testimony in 2002) as a programmatic right-to-life politics, Pentagon style. Hence the central warmongering role of think tanks, the press, and self-styled foreign policy mandarins described by Dennis Kucinich’s this excellent opinion piece . Their hyped hysteria will distract attention away from the Pentagon’s systematic front-loading operation. The goal is to buy time for the Pentagon and its contractors to infiltrate the political system to build the politically-engineered social safety net of dependent congressional districts from the bottom-up. I’ve seen this kind infiltration operation before (in the late 1970s and again in early 1990s) from the perspective on the inside of the “giving end,” just as Members of Congress like Dennis Kucinich have seen the effects of the politically engineered result before from the “receiving end.” The name of the game is to create an unstoppable one-two punch for higher defense budgets — as became evident in the early 1980s and late 1990s. Unless it is nipped in bud, this will become evident again in the next few years. Finally, once the Cold War II gets legitimated, and tensions are heightened by Russia’s natural reaction to the US nuclear “modernization” program, it will become easier to inflate conventional threats (say to the new NATO countries in Eastern Europe) to create the permanent state of fear needed to justify a high-tech, high-cost expansion and modernization of our conventional military forces — e.g., an F-22 follow-on, more Ford-class carriers, a new family of armoured vehicles, etc. So, yes, money is at the center of America’s sleepwalk into a New Cold War — and time is rapidly running out to stop the current generation of sleepwalking mandarins who think they can steer the ship of state while the boys and girls in the boiler room of the Pentagon are busy cutting the cables connecting the steering wheel to the rudder. Franklin “Chuck” Spinney is a former military analyst for the Pentagon and a contributor to Hopeless: Barack Obama and the Politics of Illusion , published by AK Press. Related'"}, "time": 1742628593.5457306}