{"duration": 0.11067318916320801, "input_args": {"text": "'Young Pioneer Tours, a travel operation that brings Western communist sympathizers into North Korea, Cuba, and other danger zones, announced Tuesday it will no longer accept Americans on its trips to North Korea following the death of Otto Warmbier. [Warmbier, 22, died Monday following his release from North Korean custody last week. He had traveled to Pyongyang with Young Pioneer Tours and stood accused of attempting to steal a communist propaganda poster from his hotel.  In a March 2016 hostage video, Warmbier “confessed” to the crime and claimed that the U. S. government had bribed him to tamper with the poster. In that confession, he also thanked North Korea for its “humanitarian” treatment of a “severe criminal” like him. In a blog post on its website, Young Pioneer Tours announced, “We will no longer be organising tours for US citizens to North Korea. ” “The devastating loss of Otto Warmbier’s life has led us to reconsider our position on accepting American tourists. There had not been any previous detainment in North Korea that has ended with such tragic finality and we have been struggling to process the result,” the statement reads. “Now, the assessment of risk for Americans visiting North Korea has become too high. ” While the group condemns the “way” that North Korea handled the detention as “appalling” and a “tragedy,” it does not condemn the North Korean regime for arresting Warmbier in the first place or for its record of detaining Americans to be used as diplomatic bargaining chips. The company also claims that it made “constant requests” to North Korean officials for information on Warmbier but was told only that “he was fine. ” Warmbier arrived in the United States last week with “extensive brain damage” according to American doctors that cared for him in Ohio before his death. North Korean officials claimed that he had been in a coma for about a year after contracting botulism and taking a sleeping pill, but American doctors said they saw no evidence of botulism. Warmbier’s father, Fred, attacked Young Pioneer Tours and its ilk in the press conference he hosted last week, following Otto Warmbier’s return to Ohio. “The North Koreans lure Americans to travel to North Korea via tour groups, run out of China, who advertise slick ads on the internet proclaiming, ‘No American ever gets detained on our tours’ and ‘This is a safe place to go,’” he explained. At the time, the New York Times reported, the Young Pioneers website read that being American was “not at all” a problem in traveling to North Korea, despite U. S. State Department warnings against such travel. Since the change in policy this morning, the site notes that it will not accept American travelers on its North Korea trips. Other than that minor change, the group’s misleading portrayal of North Korea, clearly designed to appeal to impressionable youth, remains on the site. “Despite what you may hear, for most nationalities, North Korea is probably one of the safest places on Earth to visit provided you follow the laws as provided by our documentation and   briefings,” the website claims. It applauds North Korea’s not allowing foreigners to go anywhere in the country without a communist chaperone because it “adds to the mysticism of the country. ” It warns tourists not to speak too much during the trip: “If you’re quiet and listen you’ll be surprised just how much you can learn. ” Young Pioneers also still boasts “budget tours to destinations your mother wants you to stay away from” and a blog replete with praise for a dizzying array of oppressive regimes ranging from Cuba (“We’re taking you to Cuba this December for our annual Che Guevara Revolutionary Tour! ”) to Myanmar (“One of the most special and unique travel experiences, due to its stunning geography, rich and varied culture and warm, proud people”) and China (“Once in a lifetime Maoist adventure”). Young Pioneers, named after the communist equivalent to the Hitler Youth, calls itself “a company that craves communist kitsch. ” Its founder, British   Gareth Johnson, writes in his biography that his “  love for the people and culture of the DPRK” led him to establish the group and praises North Korea’s “great, plentiful, and cheap!” seafood. At least one American, Amanda Moore, is listed as an official in the company. While the company is in the public eye for leading Warmbier to his death, Young Pioneers is not the only group preying on the curiosity of young Westerners with North Korea trips. One tour group, the Koryo Group, also claims on its website that North Korea is “probably one of the safest countries in the world for a tourist. ” New Korea Tours promises “a tour of communism which starts with the 1950’s reconstruction.   …     Every tourist who has traveled with us has said it has been one of the highlights in their world travels. ”'"}, "time": 1742562154.4046605}