{"duration": 0.032219648361206055, "input_args": {"text": "'Across U. S. college campuses, “diversity” is a sacred creed, to the point of absurdity, even. But of all things that “diversity” covers  —   gender, race, religion, or even what bathrooms should be made available  —   diversity of thought isn’t one of them. [If you dare question the (il) liberal orthodoxy, you’re a pariah. And an adjunct professor at UCLA is in danger of becoming another victim.  Keith Fink has taught classes on free speech, contemporary issues, and entertainment law at UCLA for a decade. A lawyer by trade, Fink went on Fox News Channel’s “Tucker Carlson Tonight” show earlier in May to discuss the school’s attempt to fire him in a “star chamber” review meeting that excluded him and his representatives.  “The administration doesn’t like what I have to say,” Fink told the Los Angeles Daily News. “I also support students’ basic rights to due process and the school doesn’t like that.   …     I show the students how their rights are violated.   …     I don’t believe in trigger warnings. I don’t walk on eggshells. I don’t believe in safe spaces. I run against that current. ” The “current” at UCLA, as well as at most American colleges, is to stifle free speech  —   or anything that runs contrary to the politically correct dogma now practiced on many campuses. Last June an appearance by former Breitbart Tech editor Milo Yiannopoulos at the school was canceled after protesters blocked the entrance at the beginning, followed by a bomb threat. Another Milo event at UCLA earlier this year was also scuttled after the school claimed that it could not provide adequate security. Fink is now undergoing a review process that he said probably will lead to his dismissal, since he’s not a tenured professor at UCLA. His plight has drawn the attention of his students, who held a rally on campus Friday with signs saying “free speech is under attack” and “keep your agenda out of our classroom” to support him. UCLA officials issued a statement Friday with regard to Fink’s employment, claiming that “(t) he content of his courses has never been curtailed.   …     UCLA’s process for reviewing instructors is comprehensive and fair,   …     and he has been afforded the full due process considerations mandated by the collective bargaining agreement. ” Fink teaches in the Communications Studies Department, which happens to be the same one that your humble correspondent taught nearly 20 years ago as a teaching assistant while a graduate student at UCLA. I taught several communications classes on journalism, and one time was asked to give a lecture for an adjunct professor who needed the day off. Before delivering my presentation in front of about 300 students, I carefully reviewed the course material and couldn’t help but laugh at the boilerplate liberal talking points about the state of journalism. The most galling item was the claim that the media establishment had an overwhelmingly conservative bias  —   keep in mind that this was at a time when Fox News was in its infancy and the Internet was still being invented by Al Gore. I ripped apart that lecture and instead gave a talk on the media’s liberal bias, backed by my own experience as an actual practicing journalist (as opposed to most professors who teach in communications, including the one I was subbing for). Near the end, I held a    QA session and gladly answered each and every question. My presentation was received very well, with a number of students commending me for a “refreshing” and “ ” discourse afterward. Needless to say, I was not asked back for more. That might be the fate awaiting Fink at UCLA as well since he clearly holds a view on free speech that’s no longer acceptable in academia. That would be a shame, said Mick Mathis, a senior at UCLA who attended Friday’s rally. “This is supposed to be a marketplace of ideas,” Mathis told the Daily News. “And it’s not a marketplace of ideas if they’re trying to get rid of somebody with a contradictory viewpoint. ” Follow Samuel Chi on Twitter @ThePlayoffGuru.'"}, "time": 1742628565.2389736}