{"duration": 0.0434267520904541, "input_args": {"text": "'\\nLast December, Project Veritas caught NYC Democratic Commissioner of the Board of Elections Alan Schulkin on hidden camera at a United Federation of Teachers holiday party admitting that there is widespread voter fraud in New York City. He explained how Muslims can use burkas as a way to commit voter fraud.\\nProject Veritas wanted to test this theory by sending an undercover journalist dressed in full burka to Huma Abedin’s polling location to see if they could vote. Shockingly, an election official offered the PV journalist Huma Abedin’s ballot.\\nPV Journalist: “Not even just voter ID because of people voting twice, but people can like cover their faces, you know what I’m saying?”\\nAlan Schulkin: “The Muslims can do that too. You don’t know who they are.”\\nPV Journalist: “The Muslims, yeah. Especially, all those Burkas. Someone could claim oh it’s my religion, but you don’t know if they are pretending or not.”\\nAlan Schulkin: “Exactly.”\\nAlan Schulkin: “Your vote doesn’t even count even, because they can go in there with a burka and you don’t know if they are a voter. Your vote gets discounted because they come in there with a burka on and they can vote. People think that it’s a liberal thing to do, but I take my vote seriously, and I don’t want ten other people coming in negating my vote by voting for the other candidate when they aren’t even registered voters.”\\nElection Offical: “Goodmorning. Last name.”\\nPV Journalist: “Abedin.”\\nElection Official: “Abedin.”\\nElection Official: “And that’s your last name?”\\nElection Official: “And how do you spell Abedin?”\\nPV Journalist: “A B E DI N.”\\nElection Official: “I don’t know honey. I’m looking for it in the books. But your name is not in the book. For some reason it’s not here, but that doesn’t mean you can’t vote by paper ballot. You just can’t vote by machine”\\nPV Journalist: “Ok so I can vote today?”\\nElection Official: “By paper.”\\nPV Journalist: “So I can vote as Huma Abedin, but just with the paper ballot?”\\nElection official: “If that’s the name you voted with in the last election, and you haven’t changed your name?”\\n\\nSource \\n'"}, "time": 1742561782.659928}