{"duration": 0.06827282905578613, "input_args": {"text": "'Somali Muslim Refugee Makes History In U.S. Election Nov 11, 2016 1 0 \\nIlhan Omar has made history this November by becoming the first Somali-American lawmaker in U.S. history. Ilhan is a former refugee from Somalia, is Muslim and is a mother of three. Ilhan Omar has made history in the U.S. \\nIlhan won House District 60B in southeast Minneapolis with 80% of the vote. \\nIlhan, who is 34 and a Minnesota resident said: “This really was a victory for that 8-year-old in that refugee camp. This was a victory for the young woman being forced into child marriage. This was a victory for every person that’s been told they have limits on their dreams.” \\n“I think I bring the voice of young people. I think I bring the voice of women in the East African community. I bring the voice of Muslims. I bring the voice of young mothers looking for opportunities.” \\nShe is the youngest of seven children who fled from the Somali civil war and spent four years in a Kenyan refugee camp. In 1995 she and her family arrived in the U.S. and Ilhan spoke only Somali. Shortly after, her English improved and she began translating for her grandfather at local political events. Ilhan Omar gives hope to her supporters. \\nOmar’s husband also spoke and began to describe his wife as a strong, Muslim woman: \\n“For those men — wooo! — let me tell you something. When you see a strong, African, Muslim woman, don’t be afraid, no, you know what, appreciate that. That’s the model, that’s the new 2016, going into 2017.” \\nIlhan’s focus will be on renewable energy, sustainability, justice and the common good for all people. \\nAlso making history on Election Day was Stockton, CA Michael Tubbs, who is 26 and is Stockton’s first black mayor. Michael Tubbs became Stockton, CA’s first black mayor. \\n“We have a great opportunity to show the nation, ‘How do you reinvent yourself?’ I’m tired of talking about where we’ve been. I’m more interested in talking about where we’re going. We have to mature as a community and start demanding solutions.” \\nWhile the Presidential Election has many outraged, perhaps we can look at the positive that has come from this election as well as intend for more positive results to come from all elected leaders. What we need now more than ever is unity and focus towards building a better world. This must begin now and it must include us all. Share this good news with everyone you know! \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742562904.249151}