{"duration": 1.6591262817382812, "input_args": {"text": "'RT : \\nFor the first time since its inception in 2006, Russia has lost an election to the UN Human Rights Council (UNHRC) after being narrowly beaten by Croatia in a vote. Saudi Arabia was successfully re-elected, despite criticism from human rights organizations. \\nThe 47 places on the council are distributed on a regional basis, with staggered ballots seeing a third of the body re-elected each year. Russia had finished its three-year term and was running against Hungary and Croatia for the two available seats from Eastern Europe. \\nWith Hungary far ahead, Croatia received the votes of 114 of the 193 member countries, and Russia was selected on 112 ballots. \\n“We’ve been in the UNHRC for several years, and I am sure next time we will stand and get back in,” said Russia’s UN envoy Vitaly Churkin. Russia is eligible to run next year, against a new set of countries. \\nSaudi Arabia sailed through the Asian ballot with 152 votes, and will represent the region on the UNHRC alongside China, Japan and Iraq for the next three years. \\nSouth Africa, Rwanda, Egypt and Tunisia were chosen from the African group, Cuba and Brazil from Latin America and the Caribbean, and the US and the UK will represent the Western bloc, which comprises Western Europe and North America. \\nRussia is a normal Western country. \\nSaudi Arabia tortures and stones people to death for minor crimes. \\nSaudi Arabia has floggings for bloggings. \\nThey are allowed to marry little girls and have sex with them when they’re nine. \\nThey have public beheadings with swords. \\nThey have a special machine to mutilate the hands of people caught reading the Bible. \\nThey have a special machine for hanging homosexuals. \\nOkay, that one I basically agree with, but I don’t agree with brutally torturing them first, which they also do. \\nTo have a “human rights council” and include Saudi Arabia is like some kind of sick joke. \\nAnd okay, I get that Russia wasn’t running directly against Saudi Arabia. But the whole thing is totally politicized in the first place. This is all manipulated based on favorite-picking. \\nAnd Saudi Arabia was running against a whole bunch of other countries which don’t do what they do – they are included in Asia . \\nThere are a whole bunch of other countries which don’t do what Saudi Arabia does that could have been included on this list. In fact, no other country in the world does what Saudi Arabia does, including other Moslem countries, besides the Emeritae (also on the council) and Qatar. \\nThis could have been to Lebanon, Iran, Syria, Uzbekistan, Kazakhstan – or any yellow Asian country. \\nThe UN is a friggin joke.'"}, "time": 1742562489.9365509}