{"duration": 0.15831470489501953, "input_args": {"text": "'ST. LOUIS  —   At the end of the United States women’s gymnastics championships here on Sunday night, so many gold medals hung around Simone Biles’s neck that when she walked, they clinked so loudly it made her giggle. A few times, she grabbed her medals to silence them and laughed yet again. “I always have so much fun,” Biles said later, after she had won her fourth straight national title in the   event and gold medals in three of the four individual events. The last time a woman had won a fourth consecutive national title in the   was 42 years ago. “People think you have to be serious to do a good job,” she said. “But I think if you’re having fun, you can do better. You can look back someday and say, wow, I had a good time instead of being so stressed out. ” That’s easier said than done in elite gymnastics, a sport that can be a dangerous endeavor. One slip could break bones or tear ligaments, or possibly something worse. But this    attitude in a grueling, often solemn sport works for Biles, the   defending world champion in the  . And it makes perfect sense that it works. After all, it’s fun to compete when you win and win and when the word around the sport is that you’re the best gymnast ever. Mary Lou Retton, the Olympic gold medalist in the   in 1984, has called Biles the top gymnast in history. Nastia Liukin, the Olympic gold medalist in 2008, has said that Biles is a lock for the gold medal at the Rio Games in August and that the real competition is for second place. During the   national championships here, which were a   for next month’s Olympic trials in San Jose, Calif. Martha Karolyi, the women’s national team coordinator, watched Biles’s routines closely  —   often with eyes opened extra wide. After several of Biles’s big performances  —   and nearly all of them were big performances  —   Karolyi said, “Wow!” It was a substantial reaction from a woman who is the opposite of effusive: She gave two slow claps to Gabrielle Douglas’s floor exercise on Sunday, and Douglas is the reigning Olympic champion in the  . Could it be that Karolyi was saving her applause for Biles, who can perform feats more difficult than those of any other woman Karolyi has seen in her   years in the sport? “She’s definitely on top of my list,” Karolyi said when asked where she would rank Biles on the list of history’s top gymnasts. “She’s a great combination of physical abilities and strong mind. Oh, that’s what we want. That’s a package!” Her husband, Bela Karolyi, a legendary gymnastics coach, got to the heart of why Biles is often smiling and joking when other gymnasts look stoic or pained. He, too, said that Biles was phenomenal and that he had “never seen anyone like her. ” “She can afford to enjoy it: She’s   she’s doing so easily what other people are struggling to do,” Bela Karolyi said. “Of course she could be happy. Son of a gun, I’d love to be that way, too!” He added that it was “almost a certainty” that Biles would win the gold medal in the   in Rio. Based on her performance at nationals and most of her performances of the last, let’s estimate, 1, 068 days, at least, that appears to be true. At nationals, Biles, 19, beat   Aly Raisman, who won two gold medals at the 2012 Olympics, by nearly 4 points. That means by a mile. It also means Biles could have fallen during several of her routines  —   even   on the uneven bars  —   and still have won such is the high degree of difficulty of her routines, something that sets her apart from her competitors. But there was no   stumbling from Biles this time around. While she did have some bobbles on her final two events  —   the uneven bars and the balance beam  —   she still scored 125 points in all. That’s an improvement from last year, when she won the title by nearly 5 points. It’s hard to believe that someone so good is getting even better. Maybe that’s what has put her in such a sunny mood. Biles smiled nearly the whole way through her floor exercise on both days of nationals, as if she were dancing barefoot on the lawn of her backyard, with no one watching. While waiting for her turn on the vault, she started laughing just seconds before sprinting down the runway. That’s just before she landed one of the world’s hardest vaults  —   an Amanar, which has one flip and two and a half twists. Judges awarded her effort with a nearly flawless 9. 9 for execution. Biles’s control and execution are just so crisp that her competition can’t keep up. Raisman, who was in her rotation group, watched and marveled at the ease with which Biles floated from event to event while Raisman and the other gymnasts fought to stay focused. Both train about 30 to 34 hours a week, but with much different attitudes. “I could never be as relaxed as she is, never,” Raisman said before explaining that her coach, Mihai Brestyan, had warned her not to let Biles’s   attitude rub off on her. “Mihai said when you can vault like Simone, then you can relax. Until then, you just focus. ” For Biles, the sport may just be simpler for her than for anyone else. She was made for gymnastics, with a tiny yet powerful body that makes it easier for her to launch herself into the air and twist and flip. She also has an uncanny ability to understand where her body is in the air in relation to the ground, an awareness that was noticed by her coach, Aimee Boorman, soon after she started taking lessons as a young child. Biles is 4 feet 9 inches and so springy that she might have springs for joints, although that suspicion remains unproven. The Karolyis said that the last time they had seen someone as naturally gifted as Biles was 40 years ago, when they coached Nadia Comaneci, the Romanian gymnast who won an Olympic gold medal in 1976 and scored the first perfect 10 at a Games. Comaneci was not bubbly the way Biles is, though. Far from it. When she performed her routines, she looked like a somber scientist following the steps of an equation, so careful not to misstep. She was great at what she did, but it looked like work. “Nadia kept everything inside,” Bela Karolyi said. “You had to guess what she was feeling. ” You don’t have to guess what Biles is feeling. Her grins and giggles say it all. You don’t have to guess what a massive impact she has made on the sport, either. For that, her collection of clinking medals says it all. Her 14 medals make her history’s most decorated American woman at the world championships. Reminded of that, Biles, of course, grins. “Gymnastics is a very good sport because you get to smile a lot if you want to, rather than running around on a basketball court or something, where it’s kind of hard to run around and smile,” she said. “So I like the personality of this sport. ” It’s loud and clinking, and it’s clear that the sport likes her back.'"}, "time": 1742563049.9068472}