{"duration": 0.06158900260925293, "input_args": {"text": "'Videos Right-Wing Militiamen Aquitted In Armed Takeover Of Malheur Refuge The standoff at a wildlife refuge in Oregon was never branded \"domestic terrorism\" by authorities or the media. | October 28, 2016 Be Sociable, Share! Ammon Bundy, center, one of the sons of Nevada rancher Cliven Bundy, walks off after speaking with reporters during a news conference at Malheur National Wildlife Refuge headquarters Monday, Jan. 4, 2016, near Burns, Ore. Bundy, who was involved in a 2014 standoff with the government over grazing rights told reporters on Monday that two local ranchers who face long prison sentences for setting fire to land have been treated unfairly. (AP Photo/Rick Bowmer) All seven far-right militiamen who led an armed takeover of a federal wildlife refuge in Oregon in January that led to a standoff with police were found not guilty of all charges stemming from the action. \\nThe seven anti-government men, including brothers Ammon and Ryan Bundy, began their 41-day occupation of the Malheur National Wildlife Refuge on Jan. 2 with at least a dozen armed men, in the latest flare-up in a nearly century-old conflict over federal control of millions of acres of public land in the West. \\nThey surrendered when a spokesman for the group, Robert “La Voy” Finnicum was shot and killed by state police. \\nCharges included conspiracy to threaten, force and intimidate park officials trying to end the standoff, theft of public property and the use and carrying of a firearm. \\nteleSUR journalist Arun Gupta, who reported from the scene during the occupation, said that charging the militia group with conspiracy instead of what by definition is “domestic terrorism,” is an example of the “hypocrisy and double standards of the U.S. government.” \\nDeliberations continued until Thursday morning after a juror was dismissed over accusations of bias — the juror, a former employee of the Bureau of Land Management, had allegedly told others he is “very biased.” The federal judge told the 12-person jury to “disregard entirely” previous discussions and start anew. \\nAccusing the federal government of stealing land in Oregon, the group has refused to pay for cattle-grazing permits. They were demanding that the federal government hand over the rights to the refuge to individual states and residents for their own use. \\nBoth Bundy brothers had been in jail since being arrested after the standoff ended. A separate trial will take place in February 2017 for a second group of defendants charged in relation to the standoff.'"}, "time": 1742564612.1899712}