{"duration": 0.11202025413513184, "input_args": {"text": "\"— Libertarian Larry (@Libertarian5000) October 28, 2016 @CNNPolitics So! Definition: A part of a city, especially a slum area, occupied by a minority group or groups. \\n— Patrick Driver (@PDriverKC) October 28, 2016 \\n“Slum area” sounds pretty sketchy as well. Let’s see; the Associated Press suggests that reporters use section, district, quarter, or … slum area? Come on. @CNNPolitics Yeah, so? That's what a ghetto is. You're grasping at straws. \\n— Naly (@nalywid) October 28, 2016 \\nWhen you’re at Starbucks they let you do it. Grasp straws by the handful. You can do anything. @CNNPolitics I guess this is more important than pay to play and government corruption which should disqualify @HillaryClinton Good work CNN \\n— Andrew Mack (@5MACKnIT) October 28, 2016 @CNNPolitics any email news lately to report? 🤔 \\n— Lois Lasseigne (@LoisLasseigne) October 28, 2016 @CNNPolitics you just don't get that the rest of America is sick of your PC bullshit. #DrainTheSwamp #WikiLeaks \\n— Deplorable Mike (@wrenchboy) October 28, 2016 \\nWhere did Trump even pick up such a word? @CNNPolitics Maybe he heard it in a rap song. \\n— Nick Titan (@nicktitanmill) October 28, 2016 \\nChances are pretty good that Donald Trump has never heard a rap song, unlike West Coast rap aficionado Hillary Clinton . Trending Flip-flop: Vox warns of serious risk of Election Day violence, and not the good kind either \\nShe certainly knows that ghetto is not OK in mainstream political discourse, but hopefully there’s an exception for Jay Z’s Get Out the Vote concert on her behalf in Cleveland … C-town is going to be counting on Hova to deliver classics like “Hard Knock Life (Ghetto Anthem)” and “So Ghetto.” \\n* * * \\nRelated : BIG PIMPIN’. Guess who’s headlining a concert JUST for Hillary? [hint, he raps about b*tches and ho’s] https://t.co/seRszhM4yE\""}, "time": 1742564013.0257208}