{"duration": 0.1445016860961914, "input_args": {"text": "'Last week, Michael D. Shear and Julie Hirschfeld Davis, White House correspondents for The New York Times, went to see “Southside With You,” the new feature film that is a fictionalized account of President Obama’s first date with the woman who would become his wife. The movie, set in 1989 in Chicago, stars Parker Sawyers and Tika Sumpter as Barack Obama and Michelle Robinson. Mike: So, what did you think? Julie: It was an unusual way to see President Obama because you’re watching all these mannerisms and verbal tics that are very familiar to us as people who see him every day, but it’s all in the service of wooing a woman. We’re used to seeing him put his oratorical skills to work to persuade and inspire. Mike: What, you didn’t like seeing him use those skills to hit on Michelle? Julie: It was just a little weird! Right? Mike: None of the trappings were there. He was driving around in that yellow,   car and there’s a hole in the floorboard. He’s not wearing the suit we’re all used to, and the presidential podium and all that  —   it’s odd to see this guy who is so familiar in those settings. I don’t want to be too harsh, but the only reason to care about these two people is that you know who they will become. If you didn’t know that this was the leader of the free world, nothing happens that is all that interesting. Julie: It wasn’t that great of a date! Mike: It sure went on a long time. I found myself paying more attention to the mimicry that was there for both of them. Julie: I thought his Barack Obama was pretty good. He had a little bit of the intonation, and the delivery, and even sort of the body posture  —   how he holds himself and a bit of his swagger. Mike: I really thought she captured the arched eyebrow that Michelle does sometimes. Michelle Obama has a look when she gets annoyed, when her fierce side is about to emerge. Julie: It was jarring for me, though, as someone who covers him at the White House and travels with him, to see him in such different settings. In the opening, he’s in his undershirt,   in his house. That is an image of Barack Obama that we’ve never seen. Then there’s driving a car. Mike: We actually saw him drive with Jerry Seinfeld [in a December episode of “Comedians in Cars Getting Coffee”]. There’s the way that he casually hangs his hand on the top of the steering wheel. I think they got that right. What you also never see, and it’s hard to even imagine, is Barack Obama or Michelle Obama being anonymous. In the movie, you see them going in and out of a theater or a bar, and nobody pays them any mind. That doesn’t exist for them anymore. Julie: The filmmakers plant these seeds of foreshadow or backshadow  —   I’m not even sure what to call it  —   where you’re hearing and seeing things that will become part of their public lives. There’s that scene where they’re walking in the park and they come upon a drum circle and Michelle starts dancing with the crowd, and that is something she does so often in public now that she even has that   bit she does with Jimmy Fallon. Mike: Or that moment when Michelle asks about his religious beliefs and Obama says, “Let’s just say I’m still evolving,” which of course is an echo of the way he described his development on gay marriage. Julie: There’s lots of exploration of race here, too. She talks about going from her home on the South Side of Chicago into the Loop to go to work at this fancy law firm, and she feels like she’s leaving Planet Black and entering Planet White. That resonates with him. Then she asks whether he prefers dating white women or black women, and he tells the story of his white girlfriend at Columbia, who he was very happy with but decided that he couldn’t be with because he felt like an outsider in her home. These are stories we’ve heard before  —   he’s written about them himself  —   but the movie resurrects them. And of course, part of the date is seeing “Do The Right Thing,” which is this movie that conjures up all those issues. But also, I wonder if you think it’s too soon to make a movie like this? I found myself at various moments feeling uncomfortable watching some of it. Mike: You just didn’t like the kissing scene! Julie: The making out, yes, not something you associate with the commander in chief. But in the beginning of the film, she’s walking around in her bra. He’s in this tank top getting dressed. It’s a way of seeing the president and the first lady that feels a little wrong. Mike: We are accustomed to the one degree of separation, where people make fictional movies that are so thinly disguised  —   a black president clearly modeled after Barack Obama. Or you get into life at the White House  —   like in the movie “Dave,” where we see all sorts of intimate things, but it’s all fictional. This was different. Mike: Let’s talk about the centerpiece of the movie  —   this community meeting that is the pretext for the whole date, which she keeps insisting is not a date. Julie: Right, this is where he was a community organizer before he left to go to Harvard Law. It feels very contrived, like the writers were   the Obama we all know. Obama gets up, and he makes this very classic Barack Obama speech about fighting for the community center and how we need to take the long view and build one piece at a time, block by block, and he has this line about how when our opponents’ needs align with our needs, that’s when things get done. It sounds so much like the speeches we hear him give now about Congress and the Republicans and the Democrats. You have to really wonder: Did he really sound like that? Mike: It felt kind of lazy on the part of the filmmakers. Shouldn’t you have gone back and tried to find the friends and people there at the time, to help you find the real Barack Obama at 29 rather than just transplant President Obama back in time? Julie: But that’s the audacity of this movie, right? There are only two people on earth who know what that first date was like. And neither one of them is going anywhere near the production of this movie. I did find myself wondering the whole time whether either one of them would ever watch it. How strange would that be? Mike: Totally strange. Totally uncomfortable. You do wonder whether either of them will write about this date in their memoirs, maybe just to correct the record. Maybe you actually want to describe your first date. Julie: Or maybe you don’t.'"}, "time": 1742563669.04245}