{"duration": 0.30970263481140137, "input_args": {"text": "'VINEYARD OF THE SAKER T he AngloZionst Empire’s propaganda machine, otherwise known as the corporate media, has had great difficulties deciding what it should say about the Russian naval task force which has been sent to Syria. The Americans have decided to express their usual contempt for anything Russian and describe this force as centered on the “geriatric” aircraft carrier Admiral Kuznetsov, while the Brits chose to describe it as a formidable “armada” about to completely obliterate the moderate terrorists in Syria. Illustration above: The Nuclear Battle-Cruiser Peter The Great My friend Alexander Mercouris has recently written a superb analysis explaining that, in reality, this task force was neither geriatric nor that formidable. Rather than repeating it all here, I prefer to write what I will consider a follow-up to this excellent piece with a few more details added to it. The first step will be to debunk a few fundamental misconceptions. Let’s begin by the Russian aircraft carrier. The “Heavy Aircraft-Carrying Cruiser Admiral of the Soviet Fleet Kuznetsov” Did you know that the Russian don’t even call the Admiral Kuznetsov an aircraft carrier. The official designation of the Kuznetsov is “Heavy Aircraft-Carrying Cruiser”. It is important to understand why. What is, in your opinion, an aircraft carrier? Or, let me put it this way, why does the United States maintain a force of 10-12 heavy aircraft carriers? If you believe Ronald Reagan, it is to “forward deploy” and bring the war to the Soviets (that was, then, the rationale for a 600 ship navy and US carriers in the northern Atlantic). Nothing could be further from the truth. The reality is that US, British, French aircraft carriers are a colonial rule enforcement tool . You park one or two aircraft carrier battle groups a few hundred miles from a disobedient country, and you bomb the shit out of it until it rolls over. That is, in reality, the only rationale for these immense structures. And the beauty of it is that you can threaten most of the planet and that you do not depend on allies agreeing to your mission. So, we can say that US and other western aircraft carriers are a long range power projection capability to be used against weak and poorly defended countries. Why weak and poorly defended only? Here is the ugly secret that everybody knows: aircraft carriers cannot be defended against a sophisticated enemy. Had the Cold War turned hot, the Soviets would have simultaneously attacked any US carrier in the north Atlantic with a combo of Air launched cruise missiles Surface ship launched cruise missiles Submarine launcher torpedoes I cannot prove the following, but I can just testify that I had plenty of friends in the US military, including some who served on US aircraft carriers, and they all understood that US carriers would never survive a Soviet saturation attack and that in case of a real war they would have been kept away from the Soviet shores. I will only add here that the Chinese apparently have developed specialized ballistic missiles designed to destroy carrier battle groups. That was then, in the early 1990s. Nowadays even countries like Iran are beginning to develop capabilities to engage and successfully destroy US carriers. The Soviets never built any real aircraft carriers. What they had were *cruisers* with a very limited amount of vertically launched aircraft and, of course, helicopters. These cruisers had two main purposes: to extend the reach of the Soviet air defenses and to support a landing of a force from the sea. One very special feature of these aircraft carrying Soviet cruisers is that they had very large (4,5-7 tons) cruise missiles designed to strike at a high-value enemy ships, including US aircraft carriers. You can read up on the “Kiev-class” aircraft carrying cruiser here . Another key characteristic of these Soviet aircraft-carrying cruisers is that they carried a rather lame aircraft, the Yak-38 which was plagued by problems and would have been a very easy target for US F-14. F-15, F-16 or F-18. For that reason, the Kiev-class air-defenses were centered on its surface-to-air missiles and not on its complement of aircraft. By the time the Kuznetsov was built, the Soviets had developed aircraft which were at least equal, if not superior, to their western counterparts: the MiG-29 and, especially, the SU-27. And that gave some of them the idea to build a “real” aircraft carrier. T he decision to built the Kuznetsov was an extremely controversial one which faced a lot of opposition. The Kuznetsov’s “selling points” were that she was a much superior air defense platform, that she could carry vastly superior aircraft and, last but not least, that she could compete for prestige with the US heavy aircraft carriers, especially the planned but never built nuclear-powered follow-on generation. I find that argument wholly unconvincing and nowadays I am pretty confident that most Russian naval force planners would agree with me: Russia does not need US-style aircraft carriers and if she needs any aircraft carriers at all, then they would have to be designed around a *Russian* mission requirement and not just to copy the Americans. [Sidebar: I would love to get on my favorite soapbox and tell you all the bad things I think about aircraft carriers in general and why I think that the Russian Navy should be submarine and frigate centered, but this would take up too much space. I will just say that I much rather have many frigates or corvettes than a few heavy cruisers]. So the Kuznetsov ended up being a mega-compromise and, as compromises go, a pretty good one. Think of it: even though the Kuznetsov packs 12 massive Granit anti-ship missiles, it has, at least potentially, a complement of aircraft bigger than the French Charles de Gaulle (50 vs 40). Initially, the Kuznetsov carried 12 pure air to air SU-33, but now these will be gradually replaced with 20 much more modern MiG-29K and its 24 Ka-27 helicopters will be replaced by the most advanced reconnaissance and attack helicopter on the planet, the Ka-52K . The Kuznetsov still has two major weaknesses: a frankly dated propulsion system (see the Mercouris article) and a lack of on-board AWACs aircraft. The latter is a direct consequence of the design philosophy of the Kuznetsov which was never designed to operate much beyond 500-1000 km from the Russian border (again, the crucial roughly under 1000 km Russian force planning philosophy ). To sum this all up: the Kuznetsov is a fine aircraft carrier which nevertheless reflects a compromise design philosophy and which was never intended to project Russian power at long distances the way western, especially US, carriers have . Now let’s turn to the rest of this Russian naval task force The rest of the Russian naval task force around the Kuznetsov One big name immediately stands out: the Heavy Nuclear Rocket Cruiser Peter the Great. The nuclear battle-cruiser Peter the Great This is one heavy beast and currently the most heavily armed ship on the planet. I won’t even go into all the details here, check this article for a list of armaments if you are interested, suffice to say here that this battlecruiser can do everything: anti-air, anti-ship, anti-submarine. She is packed with top of the line sensors and advanced communications. Being the flagship of the Northern Fleet she is also the de-facto flagship of the entire Russian Navy. Last, but not least, the Peter the Great carries a formidable array of 20 Granit anti-ship missile. Please note that the combined firepower of Granit anti-ship missiles of the Kuznetsov and Peter the Great is 12+20 for a total of 32. I will explain why this is important below. The rest of the task force is composed of two Large Antisubmarine Ships (destroyers in western terminology), the Vice-Admiral Kulakov and the Severomorsk, and a number of support vessels. The Kulakov and the Severomorsk are based on the Udaloy design and are modern and all-around capable combat ships. All these ships will soon merge into one force, including two small missile ships (corvettes in western terminology) which carry the famous Kalibr cruise missiles and which specialize in attacking surface ships. Finally, though this will not be advertised, I believe that this task force will include at least two Akula-class nuclear attack submarines, one Oscar-II cruise missile submarine (armed with another 12 Granit cruise missiles) and several Kilo-class diesel-electric submarines. To sum this all up. The Russian naval task force is a Russian attempt to bring together a number of ships which were never designed to operate as a single naval task force far away from Russia. If you want, it is a clever Russian “hack” . I would argue that it is also a rather successful one as this task force as a whole is a very impressive one. No, it cannot take on all of NATO or even the USN, but there are a number of things which it can do very effectively. Now we can turn to the big question, What can the Russian naval task force in Syria really do? The 7 ton Granit P-700 (3M45) Before looking at the bigger picture, there is one detail which I think deserves to be mentioned here. Just about every article I read about the Granit cruise missile says that it is an anti-ship cruise missile. I also wrote that above in order to keep things simple. But now I have to say that the Granit probably always had a “B” mode, “B” as in “beregovoy” or, if you prefer, “coastal” or “land” mode. I don’t know whether this mode existed from day 1 or whether it was added later, but it is now certain that the Granit has had such a mode. It was probably a fairly minimalistic capability, without fancy guidance and other tricks (which the Granit has in its main anti-ship mode), but the Russians have recently revealed that the upgraded Granits now have a *real* (“complex”) land attack capability. And that requires a totally new look at what that means for this task force. This is what we know about the new and improved Granit (which the Russians refer to as 3M45): Mass: 7 tons Range: 500-600km Warhead: 750kg (conventional and nuclear capable) The Granit is also capable of some very advanced things, including having one missile flying at 500m or higher to detect the target and the rest of them skimming the surface while receiving the data from the high-flying one. These missiles are also capable of automatically attacking from different directions to better overwhelm air defenses. They can fly as low as 25m and as high as 17’000m. What this all means is that these Granits missiles are very capable tactical-operational range missiles of their own right . And considering that there are at the very least 32 such missiles in the Russian task force (46 if a Oscar-II class sub is also present), that means that this task force has a tactical missile firepower similar to an entire rocket brigade! Should things go very wrong, this task force could not only seriously threaten any USN/NATO surface ship within 500km of Syria, but also every single city or military base in this range . I am rather surprised that the western fear-mongers missed this one because it ought to scare NATO pretty badly :-) To be honest here, some specialists are expressing big doubts about the land-attack capabilities of the Granit. Everybody knows that these are relatively old and very expensive missiles, but nobody knows how much effort was really put in their modernization. But even if they are not nearly as capable as advertised, the fact that 32 to 46 of such missiles will be sitting just off the Syrian coast will be a formidable deterrent because nobody will never know what these missiles can do until they really do it. Next: T he combined capabilities of the Russian naval task force and the S-300/S-400 missiles deployed in Syria give the Russians a world-class air-defense capability. If needed the Russians could even throw in A-50 AWACs from Russia protected by MiG-31BMs. What most observers do not realize is that SA-N-6 “Grumble” which forms the core of the air defenses of the Peter the Great is a S-300FM, the modernized naval variant of the S-300 . It is also capable of the amazing Mach 6 speed, has a 150km range, an added infrared terminal capability, a track-via-missile guidance system which allows it to engage ballistic missiles and an altitude envelope of 27’000m. And, guess what – the Peter the Great has 48 such missiles (in 20 launchers), roughly the equivalent of 12 S-300 batteries (assuming 4 launchers per battery). One of the major weaknesses of the Russian deployment in Syria has been the relative low number of missiles the Russians could fire at any one time. The US/NATO could simply saturate Russian defenses with large numbers of missiles. Frankly, they can still do it, but this has now become much, much harder. Can the Russians now stop a US attack on Syria? Probably not. But they can make it much harder and dramatically less effective. First, as soon as the Americans fire, the Russians will see it and they will warn the Syrian and Russian armed forces. Since the Russians will be able to track every US missile, they will be able to pass on the data to all the air defense crews who will be ready by the time the missiles arrive. Furthermore, once the missiles get close, the Russians will be able to shoot down a lot of them, making necessary for the Americans to conduct battle damage assessment from space and then re-strike the same targets many times over. Second, stealth or no stealth, I don’t believe that the USN or the USAF will risk flying into Russian controlled airspace or, if it does, this will be a short-lived experiment. I believe that the Russian presence in Syria will make any attack on Syria a “missile only” attack. Unless the Americans take down the Russian air defenses, which they could only if they want to start WWIII, US aircraft will have to stay outside the Syrian skies. And that means that the Russians have basically made their own no-fly zone over Syria and that a US no-fly zone is now impossible to achieve . Next, the Kuznetsov will be brining a number of fixed and rotary wing aircraft including 15-20 Ka-27 and Ka-52K helicopters, and 15-20 SU-33K and MiG-29K (I don’t think there has been an official figure announced). What the Russians have said is that the fixed-wing aircraft will be upgraded to be able to attack ground targets. Will all that make a difference? Maybe, on the margins. It will definitely help dealing with the expected influx of moderate terrorists coming from Mosul (courtesy of the US operation to flush them down into Syria), but the Russians could have simply moved more SU-25 or even SU-34 to Khmeimin or Iran at a much smaller cost. Thus in terms of its air-wing, I fully agree with Mercouris – this will be mainly a real-life training opportunity and not a game changer. Conclusion T his deployment is highly uncharacteristic of what the Russians have been training for. They have basically found a way to reinforce the Russian contingent in Syria, especially against Hillary’s “no fly zone” nightmare. However, this is also a case of making virtue out of necessity: the operation in Syria was always too far from the Russian border and the Russian force in Syria always too small for its task. Furthermore, this deployment is not sustainable in the long term, and the Russians know it. They have successfully imposed a “Yankee no fly zone” over Syria long enough for the Syrian to take Aleppo and for the Americans to vote for their next President. After that, the situation will either get dramatically better (Trump) or dramatically worse (Hillary). Either way, the new situation will require a completely different Russian strategy. —The Saker PS: I am aware of the semi-official Russian announced plans to build a modern aircraft carrier, probably a nuclear one, with catapults and all. For whatever it’s worth, I am very much opposed to this idea which I find wasteful and which does not fit the Russian defense doctrine. The new generation of Russian subs (SSNs and SLBMs), however, gets my standing ovation. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP INSTALLATION ABOUT THE AUTHOR The Saker is the nom de guerre of a former Russian-born military analyst and founder of the Saker network of sites. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”] Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?'"}, "time": 1742562440.5629272}