{"duration": 0.06139087677001953, "input_args": {"text": "'Donald Trump construirá un muro alrededor de cada mexicano SE CONSTRUIRÁN DOS \"O QUIZÁ TRES\" MILLONES DE MUROS racismo \\nAsegurando que es la forma más efectiva para evitar que la comunidad hispana se “disperse libremente” por el territorio estadounidense, el nuevo presidente americano, Donald Trump, ha informado esta semana que ha modificado su proyecto de construir un muro en la frontera y que, en vez de eso, se rodeará a todos los mexicanos con un muro circular de carácter individual. \\n“Los mexicanos estarán a un lado del muro y los americanos al otro lado, no va a haber mayor problema”, insistía Trump ayer en una entrevista a la CNN. El muro será circular y cerrado en sí mismo, por lo que las labores de construcción se llevarán a cabo alrededor de cada ciudadano mexicano y de dentro hacia fuera. \\nGritar “construye el muro” cerca de la cara de cualquier ciudadano con aspecto extranjero conllevará beneficios fiscales \\nTrump ha pedido a los mexicanos que residen actualmente en Estados Unidos que elijan un lugar “que a ellos les guste, en el que estén bien, cómodos y donde se vean viviendo una larga temporada” y que esperen a que diversos operarios construyan una pared circular a su alrededor. Con 3.200 kilómetros de largo, la frontera entre México y Estados Unidos es una de las más transitadas del mundo y cruza desiertos y montañas, por lo que la construcción de muros individuales parece una alternativa más barata y efectiva que el jaleado muro que prometió Trump durante la campaña. \\nEl nuevo presidente ha querido tranquilizar a la oposición asegurando que el plan es que los mexicanos que lleven diez años en el país y hayan contraído matrimonio con ciudadanos estadounidenses puedan optar a un muro “de matrimonio” o familiar. \\nFuentes de la Casa Blanca han informado que Trump también está pensando construir muros alrededor de todos los ciudadanos estadounidenses que él considere unos perdedores.'"}, "time": 1742564243.4204237}