{"duration": 0.15713047981262207, "input_args": {"text": "'‘Trump Unveiled’ Reveals the Big Con of Donald Trump’s Presidential Run Posted on Nov 1, 2016 \\nBy John K. Wilson ( OR Books ) \\nEditor’s note: The following is an excerpt from “Trump Unveiled: Exposing the Bigoted Billionaire,” by John K. Wilson. “Trump Unveiled” is published by OR Books. Click here for details. \\nWith his casino background, Trump is an expert at attracting gamblers, people who are willing to throw the dice with the irrational hope it will make their lives better. Trump understands how to recruit gamblers—by evoking hope and concealing facts. A casino doesn’t tell you that you’re likely to lose; a casino tells you that anything can happen, and you might just win, and what the hell, you’ll have some fun along the way. That’s the appeal of Trump’s campaign: take a chance on me, and I’ll give you everything. \\nIn fact, Trump literally promised “everything” to his followers. Trump promised workers in Michigan, “I’ll get you a new job; don’t worry about it.” If the cost of supporting Trump is so small (a mere vote) and the potential economic benefits are so great (a new job, economic prosperity, and global dominance), why not go for Trump? Trump is the cheapest lottery ticket you’ll ever buy. And even if the odds that he’ll keep his word are very small, why not take a gamble on Trump? \\nThis explains why Trump is so committed to denouncing America. He claims (despite all the evidence to the contrary) that the economy is a disaster, that the unemployment rate is really 42 percent, that everything is terrible, and that only he can make America great again. If you’re trying to recruit a gambler, you need to make them feel like normal life is boring and miserable. Trump tells America that their lives are horrible, and even though it’s factually not true for the overwhelming majority, they begin to wonder if he might be right. Everyone can imagine being richer and happier, and that’s precisely the core appeal of gambling. \\nAs Trump the real estate developer put it: “I play to people’s fantasies. ... The more unattainable the apartments seemed, the more people wanted them.” Trump is applying the same principles to politics: Trump is presenting a fantasy of what people want from a president, and the more unattainable and unrealistic his promises are, the more people will want him even if they know they are being irrational. \\nTrump’s own lavish lifestyle serves his message. Trump loves to have rallies at airport hangers; it’s not just the convenience of flying in and out quickly. The true appeal of it to Trump is that it reminds his audience how incredibly wealthy he is: he has a giant plane with his name on it. Trump is telling supporters, I’ve got a plane. Do you? Vote for me, and who knows, maybe you will. Might Trump’s ostentatious display of extreme wealth turn off potential voters who are angry at financial inequality and the rigged system that favors the rich? The opposite is true: Trump is telling them the system is rigged and they’re right to be angry at the rich, but Trump is the only one who can offer the salvation of getting rich yourself. Trump University was another form of shafting suckers gambling on Trump. Give Trump thousands of dollars to learn his secrets, and maybe, just maybe, you’ll get really rich, too. \\nTrump also understands that the best way to bring people to a casino is with a distraction, and the best kind of distraction is a fight. A big boxing match attracts crowds who stick around to toss some coin at the casino. And so Trump is always provoking fights: with his opponents, with protesters, with the media, with Twitter critics, with anyone and everyone who irritates him. Distraction is essential to any casino. You want bright lights and noisy machines, free drinks and sexy waitresses. You want fancy palaces with shimmering chandeliers. You want the customer paying attention to everything except the fact that it’s all a giant, flashy scam. As the slogan of the Trump Taj Mahal says, “Excitement Returns.” Distractions make people more willing to gamble. In an environment of calm analysis, rational thinking tends to prevail. \\nTrump explained his approach to The Apprentice: “I rant and rave like a lunatic and the crazier I am, the higher the ratings.” This is also Trump’s approach to his presidential campaign, because it is his way of life. \\nCasinos are a legal con. The gamblers always lose, collectively, and everyone knows that. But individuals can sometimes win. The key for any casino is to convince gamblers to imagine that they will be the exception to the odds. They don’t even have to believe something so irrational is likely, they just have to hope. \\nTrump is gambling on the idea that he can convince the voters that the world they live in is a rigged game. They keep trying to play fair, and they get screwed. Trump is promising to play this rigged game, but says he will rig it on behalf of America. Nobody thinks Trump is an honest person; but the more he lies, the more his supporters can imagine that he’s going to lie for us. He’s going to be a lying son of a bitch, but he will be our lying son of a bitch. He’s a con man working for us to take the rest of the world’s money after they stole it from us. \\nThe trick of Trump’s con is that he implicitly admits to being a con man. Trump’s book, The Art of the Deal, could easily have been titled The Art of the Con. The book is full of examples of how Trump misleads (“truthful hyperbole”) and manipulates people to take advantage of them. Trump has bragged, “I’ve taken advantage of the banks probably more than any other human being on earth.” To Trump, conning people is a credential. \\nAs a con artist, Trump believes in nothing but himself. Only a con artist could propose the largest tax increase on the wealthy in human history just a few years ago and now propose the largest tax cut on the wealthy in human history while simultaneously claiming that he’s going to make the rich pay more. Trump will say anything to get elected. \\nTrump has only a few consistent positions he has held for decades. Because Trump is a con artist, he will never believe in free trade. The concept of mutually beneficial agreements is alien to him; someone is always taking advantage of someone else in Trump’s world. You’re either the con artist or the victim. \\nThe fact that Trump is a con artist does not mean he is plotting as president to steal a trillion dollars and run off to a remote island. Trump, after all, is a narcissist who dreams of being president and imagines himself the greatest leader in history. But Trump can never escape his con artist instincts. He is unable to change, and incapable of self-criticism. He will govern as a con artist, as someone who deceives and manipulates and seeks to control everything around him. As a con artist, Trump imagines that everyone is organizing a con as well, which leads to his conspiratorial thinking. Only the naïve fail to understand they’re the victim of a con. \\nCasting a vote is as easy as buying a lottery ticket, and it’s free, too. Why not take a chance that Trump can deliver what he says, even if you know he can’t? The odds are against you, but hope matters more than probabilities. As the Powerball ad slogan says, “anything’s possible.” \\nTrump once said, “My life is like a game of poker.” As a gambler, Trump knows how to take risks with other people’s money. But he shows a dangerous tendency to follow instinct rather than reason. The only hope for Trump to emerge victorious is if he can convince the American people to be the same kind of gambler he has been. \\nDonald Trump is a pathological liar, a sexist pig, a hateful racist, a corrupt businessman, a pandering populist, a conspiracy nut, and a vicious bully. Trump’s cynical narcissism explains why he wants to be president, but his political success reflects much deeper problems in America: the inequality of wealth that makes a man like Trump so powerful, the celebrity-obsessed media that gave Trump an uncritical platform for his ideas, and the failure of our political system to address America’s flaws, which has allowed a bigoted demagogue to seize control of the Republican Party.'"}, "time": 1742561717.1194298}