{"duration": 1.4535574913024902, "input_args": {"text": "\"What’s that spell? What’s that spell? Schadenfreude!! Schadenfreude! What’s that spell? Schadenfreude!!! [cheers]. \\nThe Democrat establishment was warned about their weak candidate, and they were presented with a popular and well-funded alternative: Bernie Sanders. Instead, as the Podesta emails show in lavish detail, they used their control of the party machinery and their service providers in our famously free press to rig the election in their favor at every turn. When their candidate was nominated, the Democrat establishment tacked right, and proceeded to explain to Sanders voters that their voters were not needed because, as #BernieBros, they were racist and sexist. Sanders supporters have every right to say #WeWereRight and #WeToldYouSo. \\nIf this were Japan, we’d be seeing Democrat Party leaders committing seppuku, or cutting off their little fingers or — supposing them not to be gangsters — ritually and tearfully bowing to the people they betrayed. This being America, and these being Democrats, they are feverishly deploying the Blame Cannons at racist and sexist #BernieBros, Johnson, Stein, and the dogs who wouldn’t eat the dog food. These assclowns will only leave office if they’re whipped with scorpions. So get to it, Sanders supporters. This is your time. \\nStats Watch \\nMBA Mortgage Applications, week of November 4, 2016: “Purchase applications for home mortgages rose a seasonally adjusted 1 percent in the November 4 week as activity by home buyers stabilizes following a decline to the lowest level since January in the previous weeks” [ Econoday ]. \\nWholesale Trade, September 2016: “Inventories at the wholesale level rose 0.1 percent in September vs a revised 0.1 percent decline in August: [ Econoday ]. “In a special positive, wholesale inventories of autos fell 1.7 percent in a draw, based on last week’s very strong results for October vehicle sales, that will have to be rebuilt. The risk that inventories may be too high are a key concern for the economic outlook, specifically that high levels of unwanted inventories could slow fourth-quarter production and employment growth.” \\nWages: “The Atlanta Fed’s Wage Growth Tracker came in at 3.6 percent in September, up from 3.3 percent in August and 3.4 percent in July, but the same as the 3.6 percent reading for June. By this measure, there are no obvious signs of an acceleration in wage growth for continuously employed workers during the last few months” [ Econintersect ]. “However, the headline wage growth tracker is a three month moving average of each month’s median wage growth. Interestingly, for September, the median wage growth (using data that are not averaged, sometimes called “unsmoothed”) was 4.2 percent, up from 3.6 percent in August, and the highest since late 2007.” \\nReal Estate: “Leading Index for Commercial Real Estate “moves higher” in October” [ Calculated Risk ]. ” According to Dodge, this index leads “construction spending for nonresidential buildings by a full year”. In general, this suggests further increases in CRE spending over the next year.” \\nRetail: “With the US holiday shopping season now in full swing, the latest monthly Global Port Tracker report produced by the National Retail Federation and Hackett Associates predicted major US retail ports would handle 4.4% more imports this month than a year earlier. And volumes are expected to show a 4.5% year-on-year gain in December” [ Lloyd’s Loading List ]. That’s the retailers story and they’re sticking to it. \\nShipping: “The number of idle containerships has reached yet new highs, even with the current acceleration of vessels heading to the breakers. According to the latest survey conducted by Alphaliner, there were as many as 397 ships above 500 teu awaiting employment on October 31” [ Lloyd’s List ]. \\nShipping: “Who needs a warehouse when you have a printer?” [ DC Velocity ]. “Will demand for warehouse space shrink as manufacturers print the parts they need on demand instead of making them ahead of time and storing them in DCs? Will express parcel carriers see a drop in business as shippers e-mail digital designs instead of mailing physical parts? Or will 3-D printing be reserved mainly for filling niche demand for prototypes and replacement parts (the approach taken by a New Zealand airline that prints out replacement tray tables)?” \\nShipping: “The American Trucking Associations, the largest group representing trucking companies in Washington, said Wednesday it has already started meeting with the Donald Trump transition team as the industry prepares for a possible new look at regulations due to hit operators next year” [ Wall Street Journal , “Trucking Group Starts Meeting With Donald Trump’s Transition Team”]. “Trucking companies are preparing to meet a Dec. 31, 2017 deadline to equip all trucks with electronic logging devices measuring their hours on the road. The rule has divided segments of the industry, with smaller truckers complaining about the cost and shipping customers arguing that it will drive some companies out of business and leave bigger operators free to raise prices.” \\nShipping: “Airlines for America (A4A) has welcomed Donald Trump as US President-elect and said that it looks forward to collaborating with his Transition Team on ‘modernising the infrastructure of the skies to meet the needs of a growing US economy'” [ Air Cargo News ]. They want to reform the Air Traffic Control system… \\nHoney for the Bears: “The growth in U.S. imports of goods has been stubbornly low since the second quarter of 2015, with an average annual growth rate of 0.7 percent. Growth has been even weaker for non-oil imports, which have increased at an average annual rate of only 0.1 percent. This is in sharp contrast to the pattern in the five quarters preceding the second quarter of 2015, when real non-oil imports were growing at an annualized rate of 8 percent per quarter” [ Liberty Stree t]. “How has the recent slowdown in U.S. investment affected U.S. imports? The next chart shows that U.S. capital goods imports are very highly correlated with equipment investment—a category that excludes intangibles, residential investment, and changes in inventories. Equipment investment has been unusually weak, with its four-quarter percentage change falling into negative territory, which is unusual outside a recession period. These data suggest that the slowdown in import growth likely stems from whatever is behind the weakness in equipment, rather than from trade-specific factors such as trade policies or higher trade costs.” Well, we do have a capitalist economy… \\nPolitical Risk: “Trump’s victory in the US presidential race adds an exclamation mark to the concerns over anti-globalisation and protectionism expressed by the shipping industry in Copenhagen at the end of October, Norden chief executive Jan Rindbo told Lloyd’s List on Wednesday” [ Lloyd’s List ]. Globalization has been weakening for some time. It’s not just Trump. \\nPolitical Risk: “It really does now look like President Donald J. Trump, and markets are plunging. When might we expect them to recover? If the question is when markets will recover, a first-pass answer is never” [Paul Krugman, New York Times ]. Sure, “first pass” is faux Nobel-worthy weasel wording. But come on. \\nPolitical Risk: “Dow Makes Miraculous 1,000 Point Recovery From Trump-Fueled Overnight Lows” [ ETF.com ]. “The most short-lived major market crash of all time ended as quickly as currency manipulator” [ Politico ]. “Even if congressional Republicans demonstrated the will and actually managed to approve the TPP in the lame-duck session that begins Monday, the chances of which appear next to nil with Trump headed to the White House, the president-elect would not implement the 12-nation pact, University of California-Irvine Professor Peter Navarro, a Trump adviser, told Politico in August. That makes the Trump presidency the worst-case scenario for the Obama administration and other trade proponents who have been clinging to the hope that the Asia-Pacific pact could pass before the end of this year.” Sad! \\n“‘I think the TPP is dead, and there will be blood all over the floor if somebody tries to move that through the Congress any time soon,’ Sessions said. ‘Both candidates opposed it, Hillary Clinton and Donald Trump'” [ Observer ]. \\n2016 \\nThe Rending of Garments and Gnashing of Teeth \\n“An American Tragedy” [David Remnik, The New Yorker (2:40AM). “That the electorate has, in its plurality, decided to live in Trump’s world of vanity, hate, arrogance, untruth, and recklessness, his disdain for democratic norms, is a fact that will lead, inevitably, to all manner of national decline and suffering.” Notice the flaccidity of the language: “democratic norms”; “all manner of”; “a fact… that will lead to.” Remnik really needs an editor. Sad. \\n“Homeless in America” [Thomas Friedman, New York Times ]. “How do I explain Trump’s victory? Way too soon to say for sure, but my gut tells me that it has much less to do with trade or income gaps and much more to do with culture and many Americans’ feeling of “homelessness.'” And then Friedman spirals off into abstractions about the “feelings” people have when they lose their homes, while somehow omitting to mention the fact that millions of Americans literally lost their homes in a foreclosure crisis caused by scamming banksters Obama never brought to justice, and who, if they were foolish enough to enter Obama’s “foam the runway” HAMP program, were further screwed. \\n“Americans are not and have never been united by blood or creed, but by allegiance to a democratic system of government that shares power, cherishes the rule of law and respects the dignity of individuals. We hope our newly elected president will show respect for that system. Americans must stand ready to support him if he does, and to support the system whether he does or does not” [Editorial Board, WaPo ]. Would that any of those things were true. Perhaps for the individuals on WaPo’s editorial board, they are. \\n“Political scientists have long recognized that most ordinary citizens have only a tenuous grasp of ‘the presuppositions and complex obligations of democracy, the rights it grants and the self-restraints it imposes.’ Thus, political elites ‘serve as the major repositories of the public conscience,’ if anyone does” [Larry Bartels, New York Times ]. I’ve always wondered why the Democrats never really work to extent the franchise. Here at least we have the ideological justification. \\n“Today the world has seen the end of two centuries of Anglo-Saxon dominance – a hundred years of Britain, from the Battle of Waterloo in 1815 to the Battle of the Somme, and a hundred years of the United States, ending today, with the election as president of the US of a fascist ‘television personality’ married to a nude model” [ Splash 247 ]. “‘Decadence’ is the term that we need, here – decadence on a scale not seen in the world since the fall of the Roman Empire – which fell in much the same way, for much the same reasons.” \\nWe have now seen a hat trick of ‘democratic’ events in which men who come from the elite, and who have betrayed their class – Roderigo Duterte, in the Philippines, on May 9, was the straw in the wind, he was followed by Boris Johnson and Nigel Farage in the UK, on June 23, and today by Donald Trump in the US, and they have, with the use of the internet social media, most especially Mark Zuckerberg’s Facebook, successfully suckered the soggy mass of lazy, ill-educated, ill-read and ill-informed proles, and a good supply of what V.I. Lenin called “useful idiots”, in three nations, into putting them into power, by telling lies and by promising the proles what they want. \\nWhat the proles want is ‘good jobs’ but with the ability to buy the stuff they buy now at cheap prices, because it is made by under paid, hardworking, men and women in other countries who have ‘stolen their jobs’, and they want ‘no foreigners’. They can’t have this, of course, but no matter, they don’t read, they just look at ‘memes’, and the damage is done. \\nLeave it to the Brits to work in the class angle, quote Lenin, and toss in an Orwell reference! \\n“Trump voters will not like what happens next” [Garrison Keillor, WaPo ]. “America is still the land where the waitress’ kids can grow up to become physicists and novelists and pediatricians, but it helps a lot if the waitress and her husband encourage good habits and the ambition to use your God-given talents and the kids aren’t plugged into electronics day and night.” Help me. \\n“Americans have done a very dangerous thing this week. Because of what they have done we all face dark, uncertain and fearful times” [ Guardian ]. \\n“‘Dear God, America what have you done?’: How the world and its media reacted as Donald Trump became US President-elect” [ Telegraph ]. A nice round-up of front page images. \\nPolicy \\n“Trump won largely because people couldn’t bring themselves to vote for Clinton, and not so much because anyone like him or his presumed agenda. And along the way he destroyed the Republican party, which may or may not sit so well with Republicans in Congress” [ Mosler Economics] . “So it’s not like he has a mandate to do anything or that he can rely on Republican support for anything.” I’m not so sure; I see the Republican primary and the general taken together a repudiation of both party establishments and the political class in its totality. That said, this is important: \\nRegarding his proposed tax cuts, under current law bills can’t be introduced in Congress unless they are ‘paid for’, so, for example, to introduce a tax cut it has to be paid for by spending cuts. Yes, Congress could change the law or override it but that would require Senate approval, and that takes a 60% majority that Republicans don’t have. \\nSo my point is that at best it’s going to take a very long time to get anything done. And the way all the charts are decelerating it could all get pretty ugly waiting for the kind of fiscal adjustment needed to reverse course. \\n“The new Senate’s Republican majority will remain short of the 60 votes needed for a full repeal. But Congress demonstrated in the past year that it could use the upper chamber’s reconciliation process — requiring just 50 votes — to send a bill undoing major ACA elements to the White House. Last winter, President Obama vetoed that legislation” [ WaPo ]. Meaning, of course, that the Democrats could have done exactly the same thing in 2009, but passed HR676 or SB703. That, throwing a bankster or two in jail, and a decent stimulus package instead of the one Larry Summers deked Obama into approving, and the Democrats might control all three branches of government today. And so it goes. \\nThe Voters \\n“As of 11:55 a.m. ET, Clinton had amassed 59,458,295 votes nationally, to Trump’s 59,265,380 — a margin of 192,915 that puts Clinton on track to become the fifth U.S. presidential candidate to win the popular vote but lose the election” [ NPR ]. But the first woman! \\nhttps://www.theatlantic.com/politics/archive/2016/11/how-trump-won/507053/ \\nButterfly \\nIn the great state of Maine, Trump won Maine Second, and Clinton won Maine First [ Politico ]. Maine voters also passed the following ballot measures: Legalize Marijuana\""}, "time": 1742563023.1973472}