{"duration": 0.1084737777709961, "input_args": {"text": "'Posted on November 2, 2016 by DCG | 1 Comment Hollyweird actor Bryan Cranston From Daily Mail : He spent years as America’s lovable dad in Malcolm in the Middle before starring on one of the most-watched cable shows in the country – Breaking Bad. But Bryan Cranston could be saying farewell to the United States after the election results are announced. The 60-year-old actor has warned he will move to Canada if Donald Trump becomes the next president.\\n‘I would definitely move,’ he told The Bestseller Experiment podcast when asked what he would do if Trump was elected over Democratic rival Hillary Clinton. ‘It’s not real to me that, that would happen. I hope to God it won’t,’ he added. ‘It wouldn’t be a vacation. I’d be an expatriate,’ Cranston added. \\nThe Emmy-award winning actor is the latest Hollywood celebrity to pledge to leave the country if the Donald wins the election next week. He joins the likes of Clinton supporters Barbra Streisand, comedian Chelsea Handler and Girls creator and star Lena Dunham who have all said they will move abroad if the Republican presidential candidate wins the vote. No comment necessary We will have to wait and see whether they will keep their promises.\\nBut the opportunity to test them is becoming more and more likley as Trump closes ground on Clinton after the FBI announced it was re-opening the investigation into her email scandal. An ABC News/Washington Post tracking poll released Sunday showed Clinton ahead 46 per cent to 45 – narrower than Saturday’s 2-point Clinton edge. \\nCranston, who more recently played Democratic President Lyndon B. Johnson, has been an outspoken critic of Trump, branding him a ‘supreme narcissist’ and an ’emperor without any clothes’ following his controversial campaign . \\nThe Emmy Award-winner said previously the billionaire tycoon’s rise in politics had ‘slapped’ Americans in the face and he would eventually be ‘swept to the side’. ‘I don’t want to join the vitriol that Donald Trump represents,’ Cranston told the Press Association. ‘He’s crude and crass and empty headed . If it weren’t serious, it would be laughable. Here we have a reality show, game show guy who’s now at the top of one of the two parties. That there are millions of people who are going to vote for him says something about, perhaps, disenfranchisement. People who are left out. People who don’t feel they are being listened to.’ \\nCranston revealed that he’s met both Trump and Clinton, but his facetime with the billionaire Republican was 20 years ago. ‘As he was saying hello it was like he was thinking of three or four or five other things, so it didn’t feel like he was actually present,’ Cranston recalled. Obama showing maturity and introspection His meeting with Clinton and another with her husband were improvements. ‘She asked me questions and I gave my opinion. And I think that’s what I want, I want a president, quite frankly, with what our current president has shown – diplomacy, restraint, introspection, a maturity – he’s not any of those things ,’ Cranston said, moving on to Trump. Hillary showing maturity and introspection ‘He’s the antitheses of what you’d want a president to be as far as behavior and comportment,’ the actor added. He added that university courses will be taught, books will be written and movies will be made in the future about Trump and this bizarre election.\\nCranston, who is a Clinton supporter, said he did not care if his views cost him fans, but that it was his responsibility as a public figure to talk politics as well . ‘I am willing to take those risks, I don’t want to sit on the sidelines. \\nThe socially-conscious Cranston joins the growing list of stars who have spoken up for Clinton which also includes Elizabeth Banks, actress America Ferrera and Scandal star Tony Goldwyn, all Hillary Clinton regulars on the campaign trail. \\nMore than 100 celebrities have also signed on to a MoveOn.org campaign launched on Monday to urge voters not to put Trump in the White House , with Mark Ruffalo, Neil Patrick Harris, Shonda Rhimes, and Macklemore added to the mix. \\nDCG'"}, "time": 1742564298.5694814}