{"duration": 0.08207011222839355, "input_args": {"text": "'On Monday, the White House announced Army Lt. General H. R. McMaster as the replacement for Michael Flynn as National Security Adviser. [McMaster was not one of the top candidates suggested by administration sources after President Trump’s first choice, retired Vice Admiral Robert Harward, declined the position. Over the weekend, President Trump began interviewing three new candidates, along with the current temporary occupant of the position, retired General Keith Kellogg. McMaster was one of the three, along with former U. N. Ambassador John Bolton and West Point superintendent Lt. Gen. Robert Caslen.  According to the White House announcement, Kellogg will continue serving under McMaster as chief of staff for the National Security Council. Thomas Ricks at Foreign Policy predicted McMaster would be Trump’s choice for National Security Adviser on Monday morning, describing him as “smart, energetic, and tough. ” “He has good combat experience, he was a good trainer, and he led the 3rd Armored Cavalry Regiment well in his deployment to Iraq, most notably in pacifying Tell Afar, to the west of Mosul,” Ricks wrote, adding that McMaster was supported to a “surprising degree” by people who had worked for him in the past. McMaster is the author of a   book on Vietnam, Dereliction of Duty: Johnson, McNamara, the Joint Chief of Staff, and the Lies That Led to Vietnam. The book strongly argues that military leadership should be willing to stand up to civilian political leaders when war is not waged successfully, and also criticizes   military leadership for becoming distracted by bureaucratic infighting. McMaster’s leadership at the famed Battle of 73 Easting in Operation Desert Storm was an important part of the U. S. military’s resurgence, poetically described as “exorcising the ghosts of Vietnam” at the time. In that battle, a vastly outnumbered American unit defeated Iraqi forces with superior tactics, coordination, and technology, without suffering a single casualty. Last February, McMaster wrote an extensive account of the battle, and the lessons it provides for future conflict, for The National Interest. He is noted as an advocate of both strong conventional military forces and   capability. Concerned by cuts to both manpower and equipment modernization, he warned the Senate last year that “we are outranged and outgunned by many potential adversaries  …     our Army in the future risks being too small to secure the nation. ” One of the lessons he recommends learning from the Battle of 73 Easting, a   on, is that American forces may never again have such a pronounced technological advantage over enemy ground forces. One of the adversaries McMaster particularly worries about is Russia. Defense One reported in May 2016 that he believes the Ukraine conflict has “revealed that the Russians have superior artillery firepower, better combat vehicles, and have learned sophisticated use of UAVs for tactical effect. ” McMaster feared American military planners have invested too much effort in “winning   missile duels,” proclaiming such tactics of limited use against the “dispersion, concealment, intermingling with civilian populations  …     the ability to disrupt our network strike capability, precision navigation and timing capabilities” demonstrated by Russian forces in Ukraine. He was also concerned about Russia’s advantages in battlefield artillery. He was also concerned about Russia’s advantages in battlefield artillery, including their use of cluster munitions, thermobaric warheads, and heavy use of electronic warfare, citing reports of Russia’s astonishing effectiveness at shutting down Ukranian tactical radios, drones, and even the electrical fuses on their artillery shells. Even the vaunted American technological edge in air supremacy, tanks, and armored fighting vehicles has dangerously eroded, in McMaster’s estimation.'"}, "time": 1742562452.6894925}