{"duration": 0.059403419494628906, "input_args": {"text": "'The NFL Draft has turned into a zoo, literally, and NFL Network draft guru Mike Mayock is having none of it. [The NFL has recently endeavored to spice things up and enhance the entertainment value of the draft. Long gone are the days of a bunch of       football nerds sitting around a hotel ballroom calmly scribbling names on sheets of paper, to be carried by runner to the commissioner at the podium so he could announce the name of the player in which the franchise had entrusted its future hopes and dreams.  Oh no, say goodbye to suspender moustache guy, and say hello to skinny jean wearing,   having purveyor of social media guy. In short, the draft has become an entertainment event geared towards the   NFL fan. An entertainment event that, especially in light of the recent,   financial demise of ESPN, has to attract   viewers in order to draw ratings and raise revenues. One of the new entertainment innovations of the marketing and advertising department of the NFL Network was to have   draft pick announcements made  . The Texans had their draft picks read from the International Space Station, the Chiefs had picks read from Whiteman Air Force Base, and the Colts had their picks made by  …    well  …    an orangutan at the Indianapolis Zoo. The orangutan announcing the #Colts selection is the pick of the #NFLDraft pic. twitter.   —   Jeffrey Kahn 247 (@jkahn247) April 29, 2017,  This latter innovation did not sit well with Mayock. Following prompts from a zookeeper, the orangutan then tapped a TV screen, which then displayed the name of the player the Colts had selected. Funny, right? I thought so. Mike Mayock did not. According to Pro Football Talk, Mayock said, “If we’re going back to the zoo, I’m walking off the desk. I’ve about had the zoo, OK? Enough. Enough. I mean, is this good TV?” NFL Network’s Rich Eisen introduced the zoo segment with some sarcasm, saying, “If we don’t go to the zoo, the world will stop spinning. ” When the orangutan revealed the Colts’ selection of defensive tackle Grover Stewart, Mayock indicated he thought it was unfair to Stewart to turn one of the most significant moments of his life into a circus. “I think we’ve got to be a little respectful,” Mayock said. “It’s a big day for Grover Stewart, and rather than talking about that chimp, let’s get back to some football here. It’s a big day for him. ” While one can certainly see how having an orangutan announce the fulfillment of your life’s dream to reach the NFL could be considered disrespectful, at some point Mayock also has to understand that he’s in the entertainment business, and not just the sports business, which is something that’s probably quite easy to forget when you’ve been immersed in game tape and analysis of over 400 draft prospects for the last several months. The financial collapse of ESPN has heralded in the start of a new era for much of the sports world. Gone are the salad days when you could just name a price and the   monster would pay it, then eagerly ask for more. Sports leagues and their affiliated news networks can’t be lazy anymore, relying on the financial largesse of the “Magic Kingdom. ” Instead, they’re going to have to make their products more entertaining, lucrative, and productive in order to pay the freight. Does that mean the NFL Network did the right thing in having an orangutan announce a draft pick? No. Personally, I found it funny and thought Mayock completely overreacted about a moment of levity in the midst of      bonanza about football players, the overwhelming majority of whom the country has never heard of before. Maybe I’ve got that wrong, and that’s fine. Here’s what I don’t have wrong: Gimmicky draft selection ideas aren’t going away, and Mike Mayock will not be receiving a Christmas card from the Indianapolis Zoo anytime soon. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742562058.4896853}