{"duration": 0.450336217880249, "input_args": {"text": "\"By Gordon Duff, Senior Editor on November 3, 2016 Hoover and Tolson \\nWhen Supreme Court Justice John Scalia died, under mysterious circumstances, FBI officials were there. It was the FBI that blocked the autopsy of a Supreme Court Justice, required by law to be supervised by the Surgeon General of the United States. \\nThe organization Scalia belonged to and was with when he died, or was murdered as some assert, includes top leaders of all American business sectors along with government officials, both elected and “career,” who regularly meet and plan the overthrow of the American government. \\nThe Trump team includes the public persona of Rudy Guiliani, tasked with organizing the FBI revolt, wielding bushels of cash from the Saudis and the Adelson gambling/trafficking empire. Guiliani and his friends control most post-retirement employment for FBI agents, all of which filters through firms connected to or represented by his law firm. The FBI is, in fact, controlled by Rudy Guiliani, according to some sources. \\nWe saw the tip of that this week when Rudy Guiliani, according to the Daily Beast , reached inside the FBI and moved them clearly into the Trump campaign. Illegal though these acts are, as you may read below, they openly bragged about it. You see, with Congress and the FBI under control, investigations are a tool of punishment and intimidation only: \\n“Two days before FBI director James Comey rocked the world last week, Rudy Giuliani was on Fox, where he volunteered, un-prodded by any question: “I think he’s [Donald Trump] got a surprise or two that you’re going to hear about in the next few days. I mean, I’m talking about some pretty big surprises.” Pressed for specifics, he said: “We’ve got a couple of things up our sleeve that should turn this thing around.” \\nThe man who now leads “lock-her-up” chants at Trump rallies spent decades of his life as a federal prosecutor and then mayor working closely with the FBI, and especially its New York office. One of Giuliani’s security firms employed a former head of the New York FBI office, and other alumni of it. It was agents of that office, probing Anthony Weiner’s alleged sexting of a minor, who pressed Comey to authorize the review of possible Hillary Clinton-related emails on a Weiner device that led to the explosive letter the director wrote Congress. \\nHours after Comey’s letter about the renewed probe was leaked on Friday, Giuliani went on a radio show and attributed the director’s surprise action to “the pressure of a group of FBI agents who don’t look at it politically.” \\n‘The other rumor that I get is that there’s a kind of revolution going on inside the FBI about the original conclusion [not to charge Clinton] being completely unjustified and almost a slap in the face to the FBI’s integrity,” said Giuliani. “I know that from former agents. I know that even from a few active agents.'” \\nKey to understanding the problem is understanding the nature of the “independence” of the FBI. Established at a time when organized crime ran rampant across the nation, the FBI, operating outside any constitutional authority and in direct contravention of constitutional law, grew from small number of unarmed legal consultants to a government within the government. \\nWith the advent of World War II, the FBI grew to massive strength and began operating around the world. They were given broad powers to mete out justice, unlimited powers of search and arrest, of surveillance and even summary execution when they deemed in the national interest. \\nWith the Cold War, the FBI rode the Red Menace scare to infinite power while partnering with organized crime. J. Edgar Hoover often denied that organized crime existed and was later to have been discovered a victim of blackmail at the hands of Meyer Lansky. From VT: \\n“No provision was established within the constitution to regulate or oversee a national police force, it didn’t take long for the FBI to become the Cheka within a short period after it’s creation, J. Edgar Hoover, turned ‘the bureau’ into a monstrosity blackmailing politicians and cozying up to crime figures while Hoover’s FBI chased ‘commies’ both real and imaginary, it protected not only the mafia but powerful international crime cartels as well, becoming the real ‘Murder Inc.’ Taxpayer financed strong-arm thugs supported by a disinformation campaign. \\nHoover gained control of the press almost immediately, keeping files on his press enemies, threatening and blackmailing; some of this was to protect his own secrets – mob ties and his notorious penchant for sexual deviance, now long in the public domain, but it went further – it was all about power. \\n‘Mary’ Hoover liked to dress as a woman and was infamously covertly photographed along with his longtime companion and lover Clyde Tolson in flagrante delicto; those photographs came into the possession of mob kingpin Meyer Lansky, thus ensnaring Hoover, and by extension the entire FBI in a dangerous marriage with the mob. There is no evidence they ever got divorced, though from time to time the relationship may have been somewhat rocky.” \\nWith the Watergate scandals, the FBI made the case for being made “unanswerable” to executive authority, even the President or Attorney General. Instead, their only oversight is within the House of Representatives. \\nHowever, with the Tea Party takeover of the House, financed by gambling boss Sheldon Adelson, and based on illegal reapportionment of the House districts, defended by a radicalized Supreme Court in continual 5/4 deadlock, the House got out of control, running continual investigations based on internet rumors and conspiracy theories. \\nToo offset their zeal and insanity, a well run FBI might well have investigated the House itself, finding drug and gambling/human trafficking funds filling its coffers, opened and placed above the law by the 5/4 Citizens United Supreme Court ruling that legalized unlimited unaccounted offshore funds used to bribe officials. \\nAccording to informants, this cabal, including FBI and Pentagon officials, has discussed assassinations of American leaders, military and intelligence support for terror groups and maintains strong ties, through Cuba, with the drug cartels of Mexico and Columbia. \\nWhen the Oregon “Standoff” defendants were found “not guilty,” it was the FBI that scuttled the case because it was the FBI, through informants that run the majority of the violent anti-government supremacist/anti-Semitic groups, that planned the takeover of Federal land at gunpoint. \\nFrom a Spencer Ackerman article in the UK Guardian, November 3, 2016 \\nOne agent called the bureau ‘Trumplandia,’ with some colleagues openly discussing voting for the Republican nominee. \\nDeep antipathy to Hillary Clinton exists within the FBI, multiple bureau sources have told the Guardian, spurring a rapid series of leaks damaging to her campaign just days before the election. Current and former FBI officials, none of whom were willing or cleared to speak on the record, have described a chaotic internal climate that resulted from outrage over director James Comey’s July public decision not to recommend indictment over Clinton’s maintenance of a private email server on which classified information transited. \\n“The FBI is Trumpland,” said one current agent. \\nThis atmosphere raises major questions about how Comey and the bureau he is slated to run for the next seven years can work with Clinton should she win the White House. \\nThe currently serving FBI agent said Clinton is “the antichrist personified to a large swath of FBI personnel,” and that “the reason why they’re leaking is they’re pro-Trump.” \\nThe agent called the bureau “Trumplandia,” with some colleagues openly discussing voting for a GOP nominee who has garnered unprecedented condemnation from the party’s national-security wing and who has pledged to jail Clinton if elected. \\nOn the other side is the Pentagon. The conspiracy theories and rumors are still flying about “Barksdale/Minot.” Back in 2006, a B52 took off from Minot Air Force Base with a full load of hydrogen bombs. They were “illegally” or “improperly” authorized and were being flown out of the United States, we are told, to Diego Garcia. \\nSince that time, hundreds of officers, including the entire American nuclear command, have been replaced. We have it on reliable authority, at the highest levels, that officers inside the Pentagon, many recruited into religious extremist organizations operating at the service academies, West Point, Annapolis and the Air Force Academy in Colorado Springs, had been channeled into positions of authority by a religious cult that sprung up in the early 1980s at the Presidio, a one time Army base in San Francisco, California. \\nAmong the founders of that movement were General Paul Vallely, who along with Michael Aquino (rank unknown at this time), founded America’s psychological warfare capability but also founded the Temple of Set, a Satanic cult that spread through the American military. Remember, it was the FBI that in 1992 declared that the ritual satanic killings of the 1970s and 80s including the alleged abuses on 15 military bases tied to the Temple of Set, were only “conspiracy theories.” \\nIt is Vallely’s group, Stand Up America, that has attracted so many pro-Trump FBI agents. This is one of the paths that tie the FBI to the Pentagon, through Montana’s “patriot elites,” many military and intelligence contractors, all right wing, many anti-government and all closet militia backers. \\nBefore that, it was the FBI’s SSAIC (Supervising Special Agent In Charge) from the FBI’s massive Los Angeles office, Ted Gunderson, that the fight against ritual abuse and human trafficking that led to a series of quashed investigations that led into the highest levels of Washington. After his retirement,Gunderson went on a personal crusade against the FBI for covering up ritual child abuse. Gunderson was approached by a number of informants and volunteers, who turned out to be his undoing. Two came to live with him, Tim XXXX and Stew XXXX, who looted his files and turned them over to the FBI. \\nThese individuals, who still work with the InfoWars organization run by Alex Jones, a Trump advisor and confidant, who also helped organize the Oregon Standoff. \\nConclusion \\nWe are told that we have at least 100 FBI agents who have submitted resignations if Hillary Clinton is not arrested. They claim, we are told by former Representative Tom Delay, they have extensive knowledge of her case and a coverup within the FBI. \\nOnly a few short years ago, the same story of FBI resignations was based on another assertion, that the FBI was involved in a criminal coverup of President Obama’s foreign birth. \\nWhat we do know is this, the FBI is not just politicized. They are working hand in hand with obstructionists in congress, adding to the legislative abuses of separation of powers something far more sinister. The FBI is abusing the justice system as well, fabricating evidence, planting emails, intimidating witnesses, quashing investigations and openly involving themselves in the political process. \\nThere is currently NO public confidence in the FBI, in its director and, similarly, there is no public confidence in rank and file agents as well. The barrel is all rotten apples, there is nothing else but. \\nPresident Obama has cited the FBI for politically oriented leaks. We fear that Obama, who should be obligated to act, with do nothing out of fear of being accused of “leadership.” \\nWe wonder what he has to lose.\""}, "time": 1742628331.9893801}