{"duration": 0.11833524703979492, "input_args": {"text": "'« L’art de la guerre »\\nComment voter « Non » aux armes nucléaires par Manlio Dinucci Les États-Unis viennent de faire rejeter —par leurs alliés au sein du Premier comité de l’Assemblée générale de l’Onu— une proposition visant à l’élimination totale des armes nucléaires. Cependant, il est possible pour les États abritant illégalement des bombes atomiques états-uniennes d’en exiger leur retrait de leur territoire en application de l’article 2 du Traité de non-prolifération.\\nRéseau Voltaire | Rome (Italie) | 2 novembre 2016 italiano « Merci, président Obama. L’Italie va continuer avec une grande détermination son engagement pour la sécurité nucléaire » : c’est ce qu’écrivait le Premier ministre Matteo Renzi dans un message tweeter historique. Six mois après, aux Nations Unies, Renzi a voté « Oui » aux armes nucléaires. Se mettant à la queue des USA, le gouvernement italien s’est rangé contre la Résolution, approuvée à grande majorité dans le premier comité de l’Assemblée générale, qui demande la convocation en 2017 d’une conférence des Nations Unies pour « négocier un outil légalement contraignant pour la prohibition des armes nucléaires, qui amène à leur élimination totale ».\\nLe gouvernement italien a ainsi mangé son chapeau sur ce qu’il avait promis à la Conférence de Vienne, il y a deux ans, aux mouvements antinucléaires « exigeants », en les assurant de sa volonté d’opérer pour le désarmement nucléaire en jouant un « rôle de médiation avec patience et diplomatie ». Ainsi tombe dans le vide l’appel « Exigeons le désarmement nucléaire total », dans lequel on demande au gouvernement « la poursuite cohérente de l’engagement et de la lutte pour la mise au ban des armes nucléaires », dans un parcours « humanitaire et juridique vers le désarmement nucléaire », dans lequel l’Italie pourrait jouer « un rôle plus qu’actif, possiblement de pointe ».\\nPar conséquence tombent dans le vide aussi les motions parlementaires de la même teneur. Les appels génériques au désarmement nucléaire sont facilement instrumentalisables : il suffit de penser que le président des USA, artisan d’un ré-armement nucléaire de 1 000 milliards de dollars, a été décoré du Prix Nobel de la Paix pour « sa vision d’un monde libéré des armes nucléaires ».\\nLe mode concret à travers lequel en Italie nous pouvons contribuer à l’objectif du désarmement nucléaire, énoncé dans la Résolution des Nations Unies, est celui de libérer notre pays des armes nucléaires états-uniennes. À cette fin il faut non pas en appeler au gouvernement, mais exiger qu’il respecte le Traité de non-prolifération (TNP), signé et ratifié par l’Italie, qui à l’article 2 stipule : « Chacun des États militairement non nucléaires, qui soit Partie au Traité, s’engage à ne pas recevoir de quiconque des armes nucléaires ou autres engins nucléaires explosifs, ni le contrôle sur de telles armes et engins explosifs, directement ou indirectement ». On doit exiger que l’Italie cesse de violer le TNP et demande aux États-Unis de retirer immédiatement toutes leurs armes nucléaires de notre territoire et de ne pas y installer les nouvelles bombes B61-12, fer de lance de l’escalade nucléaire USA/Otan contre la Russie, ni d’autres armes nucléaires. Il faut exiger que des pilotes italiens ne soient plus entraînés à l’utilisation d’armes nucléaires sous commandement états-unien.\\nC’est l’objectif de la campagne lancée par le Comité No Guerra, No Nato et d’autres sujet. La campagne a obtenu un premier résultat important : le 26 octobre, au Conseil Régional de la Toscane, a été approuvée à la majorité une motion du groupe Sì Toscana a Sinistra (Oui, Toscane à gauche) qui « engage la Junte à demander au Gouvernement de respecter le Traité de non-prolifération des armes nucléaires et faire que les État-Unis retirent immédiatement toute arme nucléaire du territoire italien et renoncent à y installer les nouvelles bombes B61-12 et autres armes nucléaires ». À travers ces initiatives et d’autres on peut créer un vaste front qui, avec une forte mobilisation, impose au gouvernement le respect du Traité de non-prolifération.\\nIl y a six mois nous demandions sur les pages du Manifesto s’il y avait quelqu’un au Parlement disposé à exiger, sur la base du TNP, le retrait immédiat de l’Italie des armes nucléaires états-uniennes. Nous sommes encore en attente de la réponse.\\nManlio Dinucci Traduction\\nMarie-Ange Patrizio\\nSource\\nIl Manifesto (Italie)'"}, "time": 1742563166.421481}