{"duration": 0.1455674171447754, "input_args": {"text": "'Getty - Andrew Theodorakis \\nAs more and more internal emails and documents show up through Wikileaks and other sources, America has seen the curtain pulled back dramatically on the current state of politics. \\nIn one of the most recent emails that the Daily Caller obtained through Citizens United, the receding curtain shed more light on Hillary Clinton\\'s tenure as Secretary of State. \\nThe email exchange, dated December 4, 2012, began with a request from Paul McElearney — head of member development at the Clinton Global Initiative (CGI) — to Huma Abedin. He wanted to meet face-to-face with Clinton during his trip to Ireland a few days later. \\nIn addition, McElearney asked Abedin if Clinton would meet with four others — two of whom were CGI sponsors. Abedin forwarded his request to Bill Clinton aides Doug Band, Jon Davidson, and Justin Cooper, and asked if they had ties to CGI: Image Credit: State Dept/Citizens United via The Daily Caller \\nAbedin asked Clinton\\'s aides: \\n“Are these legit CGI people? I know Denis O\\'Brian but not the others. Everyone is asking to see her.” \\nDavidson responded by confirming that two of the names on the list — O\\'Brian and Michael Carey — were connected to CGI, but that the other two names on the list were not. \\nAnother email obtained by Citizens United showed Bill Clinton aide Doug Band asking Abedin to invite an executive from the Dow Chemicals Japanese office (to whom both Band and Clinton were connected financially) to a State Department meeting between Hillary Clinton and the Japanese Prime Minister: Image Credit: State Department/Citizens United via The Daily Caller \\nThis is not the first time that Abedin has been implicated in Clinton\\'s alleged efforts to leverage her position in the State Department to the financial advantage of CGI. \\nJudicial Watch obtained a series of emails between Clinton aides Doug Band and Huma Abedin that detailed a number of times when people who donated or were connected to CGI were granted special or expedited access to Clinton while she served in the State Department. \\nAmong the most notable exchanges involved Crown Prince Salman of Bahrain, who had attempted access through normal channels and was denied. But Judicial Watch reported that everything changed once a donation was made: \\n\"Included among the Abedin-Band emails is an exchange revealing that when Crown Prince Salman of Bahrain requested a meeting with Secretary of State Clinton, he was forced to go through the Clinton Foundation for an appointment. \\nAbedin advised Band that when she went through \\'normal channels\\' at State, Clinton declined to meet. After Band intervened, however, the meeting was set up within forty-eight hours. \\nAccording to the Clinton Foundation website, in 2005, Salman committed to establishing the Crown Prince’s International Scholarship Program (CPISP) for the Clinton Global Initiative. And by 2010, it had contributed $32 million to CGI. \\nThe Kingdom of Bahrain reportedly gave between $50,000 and $100,000 to the Clinton Foundation. And Bahrain Petroleum also gave an additional $25,000 to $50,000.\" \\nAbedin also revealed, in an email obtained by Wikileaks , a direct “pay-for-play” exchange involving CGI and the king of Morocco — just weeks after Clinton had announced her run for the presidency. Fox News reported on the link: \\n“Abedin wrote that \\'this was HRC\\'s idea\\' for her to speak at a meeting of the Clinton Global Initiative in Morocco in May 2015 as an explicit condition for the $12 million commitment from the king.” \\nClinton campaign manager Robby Mook stalled and attempted to redirect when he was asked about this exchange in a recent interview with Fox News\\'s Chris Wallace. '"}, "time": 1742563347.125745}