{"duration": 0.10176420211791992, "input_args": {"text": "'November 3, 2016 -  By Eduard Popov for Fort Russ - translated by J. Arnoldski -  \\n\\n\\nOn November 1st, the news came from the Hague that the Netherlands, in exchange for ratifying the association agreement between Ukraine and the EU, could demand that the EU guarantee in writing that this agreement will not be the first step to making Ukraine a real member of the community. A bit earlier, the Dutch government stated that it had postponed the decision on agreeing to the EU-Ukraine association agreement. Moreover, in April, a referendum was held in which more than 60% of Dutch citizens voted against the EU-Ukraine agreement. All of the parliaments of the EU’s member countries have already ratified it, except the Netherlands. \\nThe ruling circles of the Netherlands are trying to circumvent the results of the nationwide referendum that put a barrier in the way of Ukraine’s path to the EU. Figuratively speaking, this is to slide between the Scylla of the Eurobureaucracy’s pressure and the Charybdis of the Dutch people’s opinion.  \\nBrussels is trying to pressure Russia by supporting Ukraine. Hence why the results of the Dutch referendum, which said “no” to Ukrainian Eurointegration, are of much more than mere local significance.  \\nThe opinion of this Dutch people is the opinion of all the peoples of Europe who do not want to see such a problematic country of 40 million people - with war on its territory and a history of downing planes - in the European Union. But the Eurobureaucracy and European politicians, if necessary, will wipe their feet on the results of the people’s self-expression as long as the free trade zone between Ukraine and the EU is operating and benefiting only one side - the European exporters of finished products and European importers of raw materials. \\nEven more recently, abolishing the anti-Russian sanctions was discussed in European capitals. However, the aggravation of antagonisms between the US and Russia in Syria has forced Europe’s Washington-dependent leaders to reconsider the fate of sanctions policy.  \\nBack in early July, in an interview published on Fort Russ, the Italian columnist Max Bonelli expressed skepticism over the prospects of the anti-Russian sanctions being abolished. His words sounded a discordant note for the Russian reader, since the belief prevails in Russia that the sanctions will soon be lifted, or at most prolonged for only half a year. After a series of interviews with prominent European experts, I became convinced that Bonelli’s opinion is correct. \\nAlexander Gegalchiy, a well known activist of the Russian World in Czech Republic, even believes that European countries (especially Eastern European ones) could open the door for Ukrainian migration. In their opinion, this would be better than accepting refugees and pseudo-refugees from the Middle East. This dilemma calls for a different view on the possibility of a visa-free regime between Ukraine and the EU.  \\nEarlier, I categorically denied this possibility. But now, following my European partners, I’ve come to the conclusion that Europe could opt for this step. And not for a better life, as we say in Russia, but in order to avoid the greater evil of uncontrolled migration from the countries of the Middle East.  \\nMeanwhile, Turkey will probably not achieve its tactical goal of establishing a visa-free regime with the EU, as it has a population two times larger than Ukraine and is a strong power in political, military, and economic terms. And it is a country with a Muslim population. Europe, despite talk of tolerance, is afraid of Muslim migration and is not in a position to integrate even the Muslim community already living on its territory. Therefore, it is a paradox that weak Ukraine has greater chances of achieving a visa-free regime than strong Turkey. \\nA visa-free regime is, of course, not membership in the EU, but is a significant step in the direction of Europe. If it is introduced, then the leaders of the Ukrainian state will have a major argument for propagandizing the successes of the “path to Europe.” Millions of Ukrainians will go to the EU (specifically Eastern European countries) and take the place of Muslim migrants. The EU could create obstacles on the ground level, but even so, the doors to Ukrainian migration will be open. I’ll repeat: this will not be a victory of Ukraine’s Eurointegrationists, but a necessary concession in the face of unpleasantries considered graver than those posed by Ukrainian migration. \\n\\nRelations between Russia and the EU are most likely to go downhill. The leader of the EU, Germany, in the face of Chancellor Angela Merkel, is literally coercing Europe to travel down the harmful path of anti-Russian sanctions and anti-Russian policies overall.  \\nThis situation can only be changed by a simultaneous victory in several countries of more sane political forces, not necessarily pro-Russian, but pro-European. Next year, 2017, is election year in the locomotive countries of the EU - France and Germany. Will we see a sensation in these elections? I’m not sure, but there will be surprises for sure.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563677.7431633}