{"duration": 0.27114200592041016, "input_args": {"text": "'Just how many Hamiltons can “Hamilton” make? Broadway’s new blockbuster has only been open for 10 months, but already, this   musical about America’s founding fathers is one of the great successes in recent theatrical history. The show’s cast members were invited to the White House and have become regular guests on   talk shows.   Miranda, the musical’s creator, was on the cover of Rolling Stone. Fans and enterprising   camp outside the theater around the clock, hoping to snag   seats. Tickets are almost impossible to come by, except those resold at highly   prices. And celebrities have streamed in: Beyoncé. Barbra. Bernie. All that enthusiasm means a lot of money for the men and women who brought the show to Broadway. Months ago, “Hamilton” recouped the $12. 5 million it cost to mount. It is now making an estimated $600, 000 a week in profit, and every indication is that its touring productions, which begin in Chicago in September and in San Francisco next March, will be highly profitable, too. Producers and investors together stand to make tens or even hundreds of millions of dollars. Mr. Miranda will become quite wealthy. And a diverse group of collaborators  —   from the lighting designer to Mr. Miranda’s    father  —   will share in the bounty. Even if “Hamilton” isn’t playing in Bangkok decades after its debut (as was the case with “Phantom of the Opera”) it’s not unreasonable to expect that Mr. Miranda’s unlikely hit will ultimately generate upward of $1 billion in sales. Of course, nothing is certain: Theater history is dotted with fizzled triumphs. (“The Producers,” for example, was a   on Broadway and toured, but lost steam.) After the June 12 Tony Awards, “Hamilton” will face a new set of challenges, with new cast members and new markets. But there is a demonstrated path to riches for the few musicals able to translate Broadway success into   and international popularity: “The Lion King” and “Phantom” each claims to have grossed more than $6 billion worldwide, and “Wicked” has passed $4 billion. Forecasting the future for “Hamilton” is risky, but the show’s current fortunes, and the model provided by other shows, are instructive. Here, based on documents filed with government agencies and interviews with people familiar with various aspects of the musical’s finances, is a look at how “Hamilton” makes money and where that money goes. ‘The revolution’s happening in New York.’ On Broadway, “Hamilton” is consistently selling out all 1, 321 seats at the Richard Rodgers Theater and is currently grossing about $1. 9 million a week in ticket sales. Simply by maintaining that pace, the show would bring in nearly $100 million a year (that’s grosses, not profits). But there is reason to expect that figure to rise. In a bid to blunt profiteering  —   the widespread scalping of tickets at highly   prices  —   the show may soon raise prices above the current ceiling of $475 for premium seating. At $100 million a year, the Broadway production of the show would pass the $1 billion mark in a decade. The show’s current pace will be tough to sustain, but not unimaginable  —   “Wicked” this year set a record by reaching the $1 billion mark on Broadway in just over 12 years, and “Hamilton,” although running in a smaller theater, has higher ticket prices. ‘We create. You just wanna move our money around.’ The hottest ticket on Broadway cost, on average, $172 during the week that ended June 5. But that’s just what the initial purchaser paid. Many theatergoers pay considerably more by purchasing resold tickets on sites like StubHub, Craigslist and Ticketmaster. Those tickets are being listed for as much as $5, 018 each, but most are sold for considerably less. The average resale of “Hamilton” tickets on StubHub is roughly $872, according to a New York Times analysis, a markup of $700 above the current average original ticket sale price. For any given performance, roughly 13 to 22 percent of the seats at the Richard Rodgers  —   somewhere between 180 and 300 tickets  —   are available on the secondary market, according to The Times’s research and interviews with ticket sellers. So for each performance of “Hamilton,” ticket sellers and brokers are reaping roughly $150, 000. With the Broadway cast putting on more than 400 shows per year, that means these sellers could reap about $60 million per year, just in New York  —   money the producers, investors and Mr. Miranda will never see. ‘Tomorrow there’ll be more of us.’ If “Hamilton” follows the pattern of other recent theatrical megahits, its profits will substantially increase when it plays outside of New York. The big money goes to shows that globalize by running productions in multiple countries, often at the same time. (“The Phantom of the Opera,” for example, has been mounted in 13 languages in 151 cities in 30 countries.) “Hamilton” is moving quickly to take advantage of its moment. The Chicago production will begin just 13 months after the Broadway opening and run indefinitely. The PrivateBank Theater in Chicago, where “Hamilton” will play, is much bigger than the show’s Broadway house, meaning that even if ticket prices are somewhat lower, revenues could be strong, and that run could nearly double the show’s weekly profitability. “Hamilton” is also planning two separate North American touring productions: one beginning in March in San Francisco, and one beginning in Seattle in 2018. The theaters on the road are likely to price tickets lower than in New York, but many of them hold more people, so these two tours, on top of Chicago, could dramatically increase the show’s current revenues and profits. The show’s producers will soon announce a fifth production, in London, and if “Hamilton” follows the path of other monster musicals, it will eventually explore the possibilities of productions in Asia, Australia or Continental Europe. Profits from foreign productions are difficult to forecast, and given that “Hamilton” is a lyrically dense musical about American history, its appeal outside the United States, and in languages other than English, is uncertain. ‘Can I buy you a drink?’ From   to CDs to books, fans cannot get enough “Hamilton. ” The cast album has sold over 428, 000 copies domestically, according to Nielsen. Track downloads have topped 212, 000   streams from sources like Spotify and Apple Music have eclipsed 365 million. Together, that’s roughly $11 million in gross retail sales. More music is on the way. Mr. Miranda is working with the Roots’ drummer, Questlove, on a new recording of “Hamilton” songs, and more, featuring pop stars like Busta Rhymes, Ben Folds, Regina Spektor and Chance the Rapper. “Hamilton” can even sell books. “Hamilton: The Revolution,” a    book about the creation of the musical by Jeremy McCarter and Mr. Miranda, went on sale in April with a list price of $40. In less than two months, it sold more than 101, 000 copies, according to Nielsen, and hit the No. 1 spot on the New York Times hardcover nonfiction   list. (Other authors have benefited from “Hamilton” fever, too: Ron Chernow’s 2004 biography, which inspired Mr. Miranda to write the musical, has spent 33 weeks on the paperback   list. This fall, Three Rivers Press will publish Jeff Wilser’s   book “Alexander Hamilton’s Guide to Life. ”) Many of those who manage to get inside the Richard Rodgers Theater visit the gift stand, which sells hats, magnets and mugs. And goodies are available even to those who can’t get inside the theater. Bloomingdale’s is selling “Hamilton” apparel in New York, and plans to do the same in other cities as the show tours. Online, there is a thriving market for unlicensed “Hamilton” tchotchkes: perfume, dolls and key chains made by enterprising fans. There is even a beer. Gun Hill Brewing in the Bronx has made a “Hamilton”  pale ale. The brew won’t enrich Mr. Miranda and his team instead, some profits are going to Graham Windham, the social services organization   by Alexander Hamilton’s wife, Eliza. Dave Lopez, a partner at Gun Hill, says, “Anything ‘Hamilton’ sells these days. ” ‘Who provided those funds?’ The vast majority of profits from “Hamilton” is going to the producers and investors who put up the $12. 5 million to finance the show. Jeffrey Seller, the lead producer, will reap big financial rewards. A veteran of other Broadway hits, including “Rent” and Mr. Miranda’s first musical, “In the Heights,” Mr. Seller splits 42 percent of the net profits from the show with its other producers, Jill Furman and Sander Jacobs. (They are not saying how they divvy up their share.) That means the producers are splitting about $13 million annually from the current Broadway production. The producers are also entitled to 3 percent of the adjusted gross from “Hamilton,” which amounts to about $52, 000 weekly, or $2. 7 million annually, from the Broadway production. (Producers commonly get both a royalty and a share of profits.) For Mr. Seller, it doesn’t end there. His production company, Adventureland, is entitled to another 5 percent of net profits, or about $1. 6 million a year, from the current production. Adventureland receives these   torchbearer points in recognition of his role in the show’s development. The investors who backed “Hamilton”  —   a group of about 100 people that includes Robert Greenblatt, the NBC Entertainment chairman, as well as the power publicist Ken Sunshine  —   split another 42 percent of the profits, or about $13 million annually, from the Broadway production. (The list of “Hamilton” investors has not been made public.) Those are big numbers for the theater world, but they are likely to get much bigger in the coming years, as the show opens productions beyond New York. ‘Why do you write like you’re running out of time?’ Mr. Miranda, the show’s    creator, wears an unusual number of hats: He came up with the idea he wrote the music, book and lyrics and he is, for now, the star. That means he gets a salary (as an actor) as well as authorship royalties and profits that ordinarily would be split among multiple people. He is expected to leave the cast this summer and will then lose his salary (an undisclosed amount) but he will continue to receive the royalties and profits for as long as the show runs. He is likely to make at least $6. 4 million from the Broadway production over the next year his earnings will grow considerably when the other productions begin. The show has also dramatically transformed his earning potential. Disney has proved particularly enthusiastic: Mr. Miranda wrote a cantina song for “Star Wars: The Force Awakens,” is writing music for the animated film “Moana” and has been cast to star opposite Emily Blunt in a   sequel to “Mary Poppins. ” A film version of “In the Heights,” which had stalled in Hollywood, is back in development and a film version of “Hamilton” is likely. Mr. Miranda is also the ultimate rights holder for “Hamilton. ” After the show’s commercial life ends, he will own the rights for productions in regional theaters and schools, which can generate considerable revenue over time. ‘I never had a group of friends before. I promise that I’ll make y’all proud.’ Mr. Miranda rewards loyalty. The director, choreographer and orchestrator for “Hamilton,” as well as the show’s costume, lighting and sound designers, all worked on “In the Heights. ” All of them  —   and the show’s set designer  —   are entitled to royalties, and all are likely to make millions of dollars over the life of the show. Thomas Kail, the director, has known Mr. Miranda since the two were introduced after both graduated (a few years apart) from Wesleyan University. Mr. Kail helped develop “In the Heights” and “Hamilton. ” He is entitled to 2. 5 percent of the adjusted gross revenue from “Hamilton,” or about $2. 3 million a year just from the New York production. Mr. Kail also receives 1. 5 percent of net profits, currently about another $470, 000 annually. Andy Blankenbuehler, the show’s choreographer, receives 1. 75 percent of gross sales and 0. 5 percent of profits  —   currently totaling $1. 7 million or so annually. Mr. Miranda’s musical partner, Alex Lacamoire, gets just under 1 percent of gross sales, currently about $790, 000 annually. And the show’s costume, lighting and sound designers  —   Paul Tazewell, Howell Binkley and Nevin Steinberg  —   receive between 0. 37 and 0. 5 percent of gross sales, currently worth about $336, 000 to $454, 000 per year. As with all of the royalty and   arrangements associated with “Hamilton,” the value of the creative team’s cut will increase significantly when the productions in Chicago and beyond begin. ‘We’ll give the world to you, and you’ll blow us all away.’ This is the one late addition to the “Hamilton” profit plan: Mr. Seller agreed in April to share some of the show’s earnings with the performers who helped as the musical was being developed. The details are still being ironed out, but probably the   casts at the Public Theater and on Broadway, and perhaps participants in   workshops at the Public Theater, will share 1 percent of the profits from the Broadway production and will also share a portion of the profits of touring productions. The   is likely to affect about 30 people, including not only actors and dancers but also stage managers. It’s not clear how much they would get, but perhaps about $10, 000 a year from the Broadway production alone. That is not a lot of money compared with what others are earning, but it is still significant to performers, many of whom work for relatively low salaries and have long periods between roles. (On Broadway, actors make a   minimum of $1, 900 a week the performers in “Hamilton” are making more than that. But many performers spend much of their careers Off or Off Off Broadway, where salaries are considerably lower.) The “Hamilton” performers worked hard to get a   promise  —   after they were unable to negotiate a deal as the Broadway production was opening, they hired a lawyer to represent them. It took them eight months after the Broadway production opened to win an agreement they had argued that it was not fair, given their contributions to the show, to exclude them from sharing in its success. ‘Don’t forget from whence you came.’ “Hamilton” has proved lucrative for three others who helped along the way: Ron Chernow, a historian whose biography of Alexander Hamilton inspired and formed the basis for the musical the Public Theater, the Off Broadway nonprofit that nurtured the show’s   development and presented its   production and, most surprisingly, Luis A. Miranda Jr.   Miranda’s father. Mr. Chernow, who is the musical’s historical consultant and its tireless champion, gets 1 percent of the show’s adjusted grosses as a royalty  —   currently about $900, 000 a year. The Public Theater, which famously lived for years off the profits from transferring “A Chorus Line” to Broadway, gets 5 percent of the profits and 1 percent of the adjusted gross  —   currently totaling about $2. 5 million a year. The Public says it is putting most of the money into its cash reserves rather than its operating budget. Luis Miranda Jr. a political consultant, is the most unusual beneficiary. He is an unabashed fan of musical theater who collects cast recordings and sings in the car, and he introduced his son to the genre. He is often present at his son’s side, accompanying him to events and helping him manage many aspects of his life and career. He is getting 1 percent of the show’s profits  —   currently about $312, 000 a year. In each case, the value of their share will increase as the show adds productions. ‘The art of the trade. How the sausage gets made.’ Even before the profits or the royalties for “Hamilton” are distributed, there is a more fundamental expense: the cost of putting on the show. Winches and chain motors are $3, 200 a week. Dressers are $20, 000 a week. And electrics and sound cost $28, 000 a week. “Hamilton” pays about $295, 000 per week for the Richard Rodgers, a fee that covers rent as well as the house staff, musicians, stagehands and more. The show’s cast and crew are paid about $220, 000 altogether a week. Advertising costs a relatively low $80, 000 per week, thanks to all the free publicity. But things like taxes, pensions, lawyers and equipment rentals add up. On the scale of Broadway musicals, “Hamilton,” with its modest set and midsize cast, has moderate running costs. All in all, it costs about $650, 000 a week to present the show on Broadway, or about $34 million a year. But it’s proving to be one of the best investments in town.'"}, "time": 1742561877.0324821}