{"duration": 0.328352689743042, "input_args": {"text": "'SUNNYVALE, Calif.  —   Back in the   before Google even existed, the world’s best guides to the internet sat in Silicon Valley cubicles, visiting websites and carefully categorizing them by hand. They were called surfers, and they were a collection of mostly    —   including a yoga lover, an   a divinity student, a recent college grad from Ohio hungry for adventure  —   all hired by a   called Yahoo to build a directory of the world’s most interesting websites. Today, with more than one billion websites across the globe, the very notion seems mad. Even then, there was a hint of insanity about the enterprise. Yet, sitting in the shadow of a     sculpture of Elvis, the surfers built Yahoo. com into the home page for a generation of web users. Their work helped define the early internet. Two decades after Yahoo’s founding  —   the equivalent of several lifetimes in Silicon Valley  —   Elvis still serenades the surfers at the headquarters here in Sunnyvale, and Yahoo is at a crossroads. The company, long since eclipsed by Google and Facebook, now commands just a tiny fraction of people’s attention and advertisers’ dollars. Yahoo is auctioning itself off. Bids are due on Monday, the same day the chief executive, Marissa Mayer, is expected to report yet another quarter of dismal financial results. Most, but not all, of the surfers have scattered across Silicon Valley and the world. The careers of some followed the arc of the tech world’s obsessions and idiosyncrasies over the last 20 years. Others took their stock windfalls and dropped out to pursue other passions. Taken together, the surfers, about 10 of whom are still in the building, embody the technological and cultural changes that transformed the valley and the world  —   and left Yahoo in the dust. Back in 1994, when the directory was born, search engines were rudimentary and ineffectual. Newbies were just learning how to navigate the World Wide Web. The very idea of a website was novel. Two Stanford graduate students, Jerry Yang and David Filo, saw opportunity. Working from a trailer on campus, they began compiling websites into a list, organized by topic. They eventually named it Yahoo, an acronym for Yet Another Hierarchical Officious Oracle. It quickly became one of the most important gateways to the web. The value proposition was simple, said one longtime surfer, Dave Sikula: “We’ve done the work for you  —   we’ve gone through the web and these are the best sites. ” That required an army of people, said Srinija Srinivasan, employee No. 5 at Yahoo, who was hired to build the original surfer team. It was serious work, deciding how to label things and where to put them. What do you call a category that includes skinheads and the Ku Klux Klan? What kind of pornography should be considered for inclusion, given that “sex” was the most popular search term from the start? Much was left to individual judgment. Matthew Mustapick, who quit a job at Wells Fargo to become a surfer in 1995, recalled creating the “cannibalism” category. He found sites explaining how to butcher a human body but decided they were too distasteful to include. Amey Mathews, who worked as a Yahoo surfer from 1998 to 2002 (and is now married to Mr. Mustapick) discovered in the course of her work that the Irish originally carved their  ’  from turnips, not pumpkins. After that, the surfers held a   contest every Halloween. The directory survived until 2014. But by then, most of the surfers’ time already went to other projects. Many of them worked to improve Yahoo’s search engine as it battled with Alphabet’s Google subsidiary. Still, Yahoo’s star continued to fade, particularly with the rise of smartphones and social applications like Facebook and Twitter. Today, some former surfers ponder the company’s fate with sadness and a hint of regret at opportunities missed. “Yahoo Mail is still my primary email. My home page is still My Yahoo. I still look at the sports page,” said Mr. Sikula, who is a stage director and freelance editor after being laid off in 2010 as part of a big surfer cutback. “But I don’t know why the company exists. And I think that’s what they are trying to figure out, too. ” Srinija Srinivasan‘THE NATURE OF BEING’ If she hadn’t chosen to study Japanese at Stanford, Srinija Srinivasan would never have found herself in charge of building Yahoo’s directory into a guide to the internet for a curious world. Ms. Srinivasan, who grew up in Kansas, was an undergraduate attending a   Stanford program in Kyoto, Japan, when she got to know two fellow students over shared meals  —   Jerry Yang and David Filo. After graduation, she was working on the Cyc Project, an early effort to create artificial intelligence, when the pair asked her to help them turn their directory into a real company. “Jerry and David knew that I alphabetized my CDs,” Ms. Srinivasan, 44, said in an interview in her Palo Alto, Calif. home. “My sock drawer is quite beautiful. ” When she joined, her business card read Ontological Yahoo, a term reflecting her philosophical approach to the job. “This is not a perfunctory   exercise. This is defining the nature of being,” she said. “Categories and classifications are the basis for each of our worldviews. ” Faced with the vastness of the web, Yahoo surfers hoped to identify the most complete, relevant or interesting sites on a given subject. To choose which topics to focus on, the surfers relied in part on a daily log of visitors’ top queries. Once in a while, surfers made mistakes. For instance, they initially categorized Messianic Judaism as a Jewish sect, failing to notice that its adherents, who follow many Jewish traditions, believe that Jesus Christ was the Messiah, a defining trait of Christians. “We had faxes coming in nonstop from rabbis,” Ms. Srinivasan said. Yahoo also offered automated search tools by teaming up with various companies, including AltaVista and Google. Eventually, though, Yahoo realized that it had to develop its own version of the technology. Human judgment  —   what Mr. Yang referred to as “the voice of Yahoo”  —   remained a core value of the company. When the Grateful Dead musician Jerry Garcia died in August 1995, Yahoo searches on him spiked immediately. The surfers put a Garcia link on the home page. “That was the birth of Yahoo News,” Ms. Srinivasan said. Today, it remains one of the most popular online news portals. The surfers’ role as corporate conscience expanded with the company. They worked on a   version of Yahoo, called Yahooligans. They selected the news headlines worthy of   display. Over time, Ms. Srinivasan and her team even fielded questions like how much cleavage to allow on   ads. Despite its efforts, Yahoo kept losing ground to Google in search. Microsoft made an unsuccessful hostile bid to buy the weakened company in 2008. Ms. Srinivasan left two years later, soon after Mr. Yang stepped down as chief executive. “In Japan, they have a saying: Leave when the cherry blossoms are full,” she said. Ms. Srinivasan now splits her time between Palo Alto and Brooklyn, where she is working on a music   Loove. The company is trying to revamp how the music industry works and help audiences understand the full story behind what they listen to, much as the    movement did for food. She also sits on the board of trustees of her alma mater, Stanford, a school that has churned out several generations of Silicon Valley moguls. But unlike many former technology executives, Ms. Srinivasan focuses her attention there on the arts and humanities. “Tech is sexy. It’s employable. Parents love it,” she said. “All of that isn’t worth a hill of beans unless we know why, to what end. We call it the humanities for a reason. ” Seana MeekCAPTAIN CANADA Yahoo, like the early web itself, was largely focused on American content. But it had global ambitions. Seana Meek, an Alberta native and a single mother, was working for Futurekids, which taught children computer basics, when Yahoo hired her to organize the Canadian sites in its directory. For Ms. Meek personally, it kicked off a   career odyssey through modern Silicon Valley and some of the tech industry’s most significant trends:   virtual reality,    —   even a mobile haircut app. When she started, Yahoo was fumbling in Canada. Technically, it had a separate Canada site, but it relied on the American directory for its searches. Employees asked her why the most popular search term among Canadian users was the word Canada. “That’s not a mystery,” Ms. Meek, 41, recalled saying. “In Canada, you do ‘government’ and you get American results. So you do ‘government Canada.’ You do anything and then you add ‘Canada’ to it. ” After the   bubble burst in 2000, Yahoo’s dysfunctions began to surface. In 2002, the company transferred Ms. Meek’s job to Toronto. Less than 90 days later, it closed that office and sent her and two engineers back to the American headquarters. She got a promotion from the mess: Yahoo put her in charge of the content, ads and business deals for Yahoo Canada. She was nicknamed Captain Canada and had a ringside seat to one of the company’s biggest decisions  —   dumping Google as a search partner and switching to technology from its Inktomi acquisition instead. “They were scared to do it. So they did it in Canada first,” she said. In 2008, she left the company, embarking on a journey through Silicon Valley’s laboratory of business ideas, big and small. First she joined a tiny   Picateers, that was trying to reinvent the school portrait business. It folded a year later. From there she went to Linden Lab, the creator of Second Life, the tech industry’s first big foray into virtual reality. Players interacted with one another online in a   simulated world, where they could buy and sell things, make friends, or just gawk at the scenery. Second Life was an extraordinary experiment in human behavior, she said. An employee could change something in the virtual world, then just watch what happened. “You are literally a god,” she said. Next for her was Eventbrite, an online   and ticketing company. There she worked to protect against credit card fraud. In 2013, she abandoned the corporate life to make a movie, a   indie thriller, called “Veracruz. ” Now she runs her own   firm, Snare Labs, which helps small merchants detect suspicious transactions. She is also working with her nephew on an app, Sharpcut, to summon barbers on demand. And she says, she is casting about for the next challenge. “It’s a funny time in my life where there is definitely no script,” she said. Matthew Mustapick and Amey MathewsYOGA AND ACOUSTIC GUITARS Working long hours in close quarters, it was inevitable that some surfers would find romance. For Matthew Mustapick and Amey Mathews, working at Yahoo didn’t just lead to love. The lessons they learned  —   and the money they made from the stock they received as early employees  —   allowed them to achieve a different kind of Silicon Valley dream: dropping out of tech to do their own thing. Ms. Mathews, who had a fine arts degree from Stanford, joined in 1998 after responding to an ad looking for a speaker of Scandinavian languages. “I told them I didn’t speak any Scandinavian languages  —   but I speak Italian and you should have someone who speaks Italian,” she recalled during an interview at the couple’s home in Soquel, Calif. Yahoo had an Italian speaker already, but she got a job anyway. Mr. Mustapick sat in a nearby cubicle, and they eventually became a couple. Surfers were free to reflect their personal interests in the directory. Ms. Mathews loved animals and indexed all the dogs, cattle, even miniature donkeys, she could find. Mr. Mustapick was fond of cataloging oddities like prosthetic testicles for pets that had been neutered. Mr. Mustapick left Yahoo in early 2002. Ms. Mathews followed later that year. Ms. Mathews, who became a yoga teacher while at Yahoo, started teaching full time when she left. Yahoo, in fact, became one of her first clients. The Yahoo stock provided a vital cushion. “I could afford to lose money for a whole year when no one came to my class,” she said. Mr. Mustapick turned toward music. “I always wanted to learn how to play electric guitar like Scott Henderson,” he said, referring to the jazz and blues guitarist. That interest led him in an unexpected direction  —   he began building acoustic guitars with an eye toward selling them. Having looked at hundreds of thousands of websites while at Yahoo, he had a good sense of how to market online, well before the era of Twitter and   as a national pastime. He built a website and posted photos of guitars he was building so customers could watch the progress. And he consciously befriended the right people. “They just put the word out for me,” he said. “That was the sort of thing I learned at Yahoo that you could do. ” He ended up making about 100 guitars, selling them for $3, 000 to $10, 000 apiece, before closing the business a few years ago. Mr. Mustapick, 47, is now studying jazz piano. Today, neither of them wishes to return to an office job. Ms. Mathews, 43, has found her bliss teaching yoga, blogging about veganism and painting. Still, she remembers Yahoo fondly. “I loved being around that many smart, interesting, engaged people,” she said. “I actively miss that in my daily life  —   not enough to go get a job and give up what I’m doing, but I do miss it. ” Gordon HurdBACK FOR ROUND 3 Nine years ago, Gordon Hurd quit Yahoo for the second time. In June, he began working for the company again  —   Round 3  —   this time as a freelance writer. In the intervening years, Mr. Hurd toured the struggling   landscape  —   first, the Yahoo archrival AOL then, Interactive One, a network of black news and culture sites later, First Look Media, created by the eBay founder Pierre M. Omidyar and most recently, a men’s fashion site, Man’s Life. There was even a brief stint at McKinsey  Company, the consulting firm and “the most corporate place you could go,” he said. He is one of many surfers who left, then came back through the revolving door, sometimes unexpectedly. One group of   jumped to Polyvore, a social shopping   founded by three Yahoo engineers in 2007, only to wind up back at Yahoo last year when it bought the company. Mr. Hurd’s first run with Yahoo started in 1998 when he was hired to organize the business and finance parts of the directory. The starting pay was only $35, 000 a year, he recalled. But there were stock options. “I didn’t make millions by any means,” said Mr. Hurd, 45, in a phone interview from Brooklyn, where he lives. But he bought a house. A restless soul, he left Yahoo in 2002 to become an investigative reporter for a local magazine. Less than a year later, with a second child on the way, Mr. Hurd returned to Yahoo, eventually helping run the influential home page. In 2007, he hopped to McKinsey and then quickly to AOL, where he ran Asylum. com, a lifestyle site aimed at men age 18 to 34. The business model was to create vast amounts of content in the hope that visitors would click on ads. That didn’t happen. “What it underlined is how much of a commodity content was,” Mr. Hurd said. Asylum was shut down. Mr. Hurd moved on to Interactive One, the digital arm of Radio One, the largest   radio broadcaster in the United States, which struggled to crack the content code, too. Volume trumped quality. “You know people will click on a   video, but you want to talk about what it’s like to be a millennial of color,” Mr. Hurd said. First Look Media, although funded by a tech billionaire, was plagued by internal strife. Man’s Life wound down after less than a year. Which is how, today, Mr. Hurd is back at Yahoo, writing articles for its style site while he ponders his next move. More than ever, he thinks there is a need for the type of work that Yahoo’s surfers did 20 years ago. “The web has gotten so big that you need people to curate it,” he said. However, he sees that curation coming from subject experts, not   sites like Yahoo. Niche sites with a devoted following could work with select sponsors hoping to reach a particular audience, he said. “If you’re a person who’s really dedicated to the art of handmade knives, and you set out to categorize the sites of handmade knives, only you can do that. Google can never do that,” Mr. Hurd said. Becky UlineA GRAND ADVENTURE When Becky Uline graduated from Bowling Green State University in Ohio in 1996, she didn’t really know what she wanted to do with her life. A friend was raving that he had discovered paradise  —   living in Northern California and working for a company few people had ever heard of, Yahoo. She and another Bowling Green graduate, Michelle Heimburger, thought it would be a grand adventure. They both got hired as surfers and rented an apartment together. The building was so empty at first that surfers would zip through it on   skates. “We would sleep under our desks,” Ms. Uline, 42, recalled during an interview at her current home in Oakland, Calif. Her roommate, Ms. Heimburger, made headlines a few years later when she spent $350, 000  —   part of her Yahoo stock windfall  —   to buy the   Franklin Castle in her hometown, Cleveland. To celebrate, she threw a huge housewarming party, inviting all of Yahoo and the Cleveland Indians baseball team to the festivities. In 2001, Ms. Uline gave her notice. She wanted to travel the world, financed in part by her Yahoo nest egg. Paris became a favorite haunt. “I would sublet my apartment out for a few months and just go and work from wherever,” she said. She freelanced for Yahoo and also tapped the vast network of surfer alumni, landing work at the     SearchMe and elsewhere. Six years ago, she stopped wandering and decided to focus on her music. The year 2013 was big: her band, the Northerlies, released its debut album she married the guitar player, Brian Anderson, who had worked at Excite, another early search site and their son, Neil, was born. Yahoo’s decline is sad, Ms. Uline said, but she still feels a connection. Her closest friends are former Yahoos, including Ms. Heimburger, who married yet another surfer and lives in London. A few months ago, Ms. Uline, said, she dropped Yahoo as her home page, but she missed it and changed it back. “I still use Yahoo search. I want them to get the revenue,” she said. ConnieAlice HungateSURFING BY ANOTHER NAME When Yahoo set out to hire surfers, it invented a new job category. The closest match may have been bookstore clerk  —   and Kepler’s Books in nearby Menlo Park turned into a recruitment hotbed. About a dozen surfers were hired away from the shop, including ConnieAlice Hungate. Ms. Hungate, 46, is still at Yahoo more than 18 years later, supervising what remains of the surfer team. She said the group, renamed content analysis and management, is still vital to the company’s ambitions to remain a player in web search. Search ads bring in nearly half of Yahoo’s revenue. Under a 2010 deal with Microsoft, Yahoo uses Microsoft’s Bing search engine for most basic queries and ads. Ms. Mayer, Yahoo’s chief executive, has devoted vast resources to search technology  —   particularly on mobile devices  —   in an attempt to leapfrog Google, though the company has little to show for it so far. Ms. Hungate said her team helped train Yahoo’s search algorithms to provide more relevant results. The mobile search app, for example, now automatically pulls up suggestions for nearby places to eat when lunchtime rolls around. The surfers also worked on the recent release of Yahoo’s Radar travel app, which uses a   interface to recommend restaurants and activities based on data from TripAdvisor and Yelp. “We’re doing all kinds of experiments every day,” Ms. Hungate said. The Elvis sculpture, a 1998 gift from a Yahoo user, still watches over the department, and the   contest is held every Halloween  —   with results posted on Flickr, the   service owned by Yahoo. Ms. Hungate said she was not worried about what would happen to the surfers if the company was sold. “Information management is a core need in technology,” she said. “We’ll adapt. ”'"}, "time": 1742563287.5470786}