{"duration": 0.04501199722290039, "input_args": {"text": "'\\nEverybody always knew Gary Johnson is kind of crazy but what he just did to a Guardian reporter who interviewed him a few days ago, may cause you to pee yourself laughing!\\nWell he didn’t really try to bite the reporter, the title its more of a joke to amplify what you are about to see next but be warned, first empty your bladder!\\nIf everyone voting for Gary Johnson saw this video, I promise you they would ALL change their mind. The man is a zombie, literally, watch his facial expressions.\\nI have honestly NEVER seen someone flip out like this. The first 20 seconds Gary Johnson has his neck veins inflated and all angered up, screams like a zombie, then, he admits to the reporter that he’s an idiot:\\n“Well I’m an idiot, you know?? Really! I’m the dumbest guy you ever met in your whole life!”\\nPaul Lewis, the reporter looks stunned and for a while there, doesn’t know how to react to his open admission of being a dumb idiot, but finally the reporter snaps out of it and says “I’m trying to work out if that’s sarcasm.”\\nGuess what Gary Johnson said… “It is… I hope it’s sarcasm”. So he’s not sure if he’s really a dumb idiot or he is just being sarcastic. He hopes… then he says “How do you respond when you’re being called a dummy? I’m not a dummy, I’m n t! And yeah I’m human!” Are you sure there Gary? Or you’re just hoping again? Well that’s it! That’s how you answer when someone calls you a dummy: “I’m not a dummy, I’m n t! And yeah I’m human!” Paul Lewis looks stunned as if he was expecting a more complex answer…\\nThen for a few minutes or so Gary Johnson is cordial, even polite and even exposes Utah’s Evan McMullin as a Hillary Clinton shill, who has recently officially endorsed Hillary Clinton and admitted that he’s just a shill . Paul Lewis asked Gary why is he doing so poorly in the pools. Gary insisted that he’s doing fantastic and that he is at 24% in New Mexico.\\nThe reporter then asked Gary, “Then why is Evan McMullin currently tied with Clinton and Trump in Utah?” Gary Johnson responded: “Well he’s from Utah, he’s on the ballot in 11 states, so he can’t win the presidency, ummm he’s a Utahan. He’s ensuring that Hillary Clinton will win Utah and you know what? He is what he is, and you know I hold no grudge on anyone for entering the race… Look you ask me, I’m not labeling it spoiler, I’m just telling you what I think the reality is.”\\nThen SUDDENLY out of NOWHERE, he flips and goes ABSOLUTELY BATS#IT CRAZY AGAIN when he’s asked about taxes.\\nWatch MENTALLY ILL Gary Johnson EXPLODE! But don’t go, scroll down to laugh even harder!\\n\\nWe’ve just discovered that taking screenshots of Gary Johnson while he’s in crazy mode and at the right moment is an art! Here’s a couple of perfectly timed screenshots for you: \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n'"}, "time": 1742561779.1454318}