{"duration": 0.09585928916931152, "input_args": {"text": "'Rep. Marsha Blackburn ( ) discussed the possible elimination of the FCC’s 2016 broadband privacy rules on Tuesday’s Breitbart News Daily with SiriusXM host Alex Marlow. [“The Senate, under the leadership of Sen. Flake, took this up last week,” Blackburn said. “What we are doing is recalling a privacy rule that the FCC issued right at the end of the Obama administration, and the reason we are doing this is because it is additional and duplicative regulation. ”  “The FCC already has the ability to oversee privacy with broadband providers,” she explained. “That is done primarily through Section 222 of the Communications Act, and additional authority is granted through Sections 201 and 202. Now, what they did was to go outside of their bounds and expand that. They did a swipe at the jurisdiction of the Federal Trade Commission, the FTC. They have traditionally been our nation’s primary privacy regulator, and they have done a very good job of it. ”  “What the FCC did was clearly overreach. It gives you two sets of regulators that you’re trying to comply with, not one. So we are recalling the FCC’s rule, and that authority will go back to the FTC,” she said. Blackburn said Congress wants to ensure “privacy is being overseen, protected, and that when there is a necessity for enforcement, that it’s being exercised  —   if there is a necessity for penalties, that they are being placed. ” “In the physical space, that has rested with the FTC,” she noted. “So if someone were to abridge your online privacy and sell your information without your knowledge, without your consent, that would be something that the regulators would go after. Let’s say if someone starts to wholesale sell your data, and you said, ‘Do not share my data. Do not share my information,’ that’s the kind of effect that it has. ” She said Congress was aware of the need for more privacy and   legislation, as opposed to regulations promulgated by agencies. “The other thing with the broadband providers, let’s say your ISP which is holding data, and they were to scoop up that data and then begin to sell that history without your knowledge. They are prohibited from doing that, and the FCC currently has the authority to go after them. The FTC has the ability to protect consumers, and that is what they do. They are the primary regulator. But let’s say an ISP begins to sell that data, then there would be complaints filed, and the FCC would go after that broadband provider under the regulations that are on the books,” Blackburn said. Marlow raised criticism that Internet users will be exploited by aggressive advertisers if the 2016 FCC rule is recalled. “What the Obama administration did  —   and I will say they did this against this, against the wishes of a lot of Democrats  —   they reclassified your Internet service as Title II, which is a common carrier classification. It is the rule that governs telephone usage,” Blackburn responded. “Those rules were put on the books in the thirties. So what the Democrats did, and this was pushed by the White House in the last administration, they reclassified Internet, which is an information service, as a telephone service, and then put those   rules on top of your Internet service. ”  “They did that so they could tax it, so they could begin to regulate it. Then one of the additional regulations  —   which is going to cost money for compliance and paperwork and additional bureaucrats  —   one of those regulations is privacy. But as we say, the authority that they need to oversee broadband is already articulated in Section 222 of the Communications Act,” she said.  “You don’t need another layer of regulation. It’s like flashing alerts: We don’t need net neutrality. We don’t need Title II. We don’t need additional regulations heaped on the Internet under Title II. The Internet is not broken. It has done just fine without the government controlling it. That’s the way it should stay,” she contended. Blackburn said Democrats “think government is the solution for all things. It should be either the bureaucracy or the courts that are solving the problems. ” “To them, another added layer of regulation, where you are having a federal agency require compliance of businesses, so now they’re having to file compliance papers with two regulators, not one  —   they don’t see a problem with that,” she charged. “What we’re saying is, it is unnecessary it’s an added cost to doing business. Who pays those costs of doing business? It’s the consumer. It’s the end user. ” Blackburn said Ajit Pai is “doing a great job as chairman of the FCC. ” “He was my pick to lead the FCC, and I’m thrilled that he is there,” she said. “He understands the utilization of the Internet, all the   components. He understands the backbone of the Internet and what and how it works. He understands why we need to be careful with spectrum so that we increase broadband deployment and utilize that spectrum in the Internet of Everything. Ajit knows that these components are critical for economic growth and jobs growth in this country. ”  “We are very fortunate to have someone with skill set and understanding as we turn the corner and put the focus on broadband expansion in the country. I’m looking forward to working with him. I talk with him regularly,” she said.  “We are going to go through reauthorization of the FCC, which has not been done since the early nineties. We are going to go through reauthorization of the NPIA. We’re going to put some emphasis on spectrum management and spectrum utilization from a government and also a private sector standpoint and do what we can to get broadband into these unserved areas across the country. We’re full steam ahead on that,” she promised. Marlow suggested unsolicited robocalls are an annoyance the American public would like to see controlled more tightly. “That is something that’s called the TCPA. Looking at how individuals interface with their customers is what we will do in that,” Blackburn replied, referring to the Telephone Consumer Protection Act of 1991. “We’ll pull that up after we do reauthorizations and then do a revisit on some of the components of the TCPA. ” “People who want to work with their customers need the ability to do   with them, but we also want to make certain that people are not harassed, if you will, by unwanted marketing calls,” she said.  Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742561899.3854563}