{"duration": 0.11868429183959961, "input_args": {"text": "'The Grammy Awards may come down to a battle of the superdivas. Beyoncé leads the nominations for the 59th annual Grammys, announced on Tuesday, with nine nods for her album “Lemonade. ” But in each of the three top categories she will square off against Adele, who was nominated five times. Both women had extraordinary years. “Lemonade,” an ambitious album and film, tackled issues of race and infidelity, and its release became the kind of   cultural phenomenon that perhaps no artist but Beyoncé could muster. Adele’s album “25” sold more than 10 million copies in less than a year, a blockbuster that eclipsed all others. With enormous commercial success and the adoration of fellow musicians, those stars represent the very best of how the music industry sees itself, which should make their competition tight. “Lemonade” and “25” are both nominated for album of the year, and Beyoncé’s track “Formation” will go up against Adele’s “Hello” for both record and song of the year. This year’s Grammys, on Feb. 12 in Los Angeles, will mostly hew to the biggest pop hits of the moment  —   itself a notable development for a show that has often celebrated aging stars at the expense of vital young talent. The other leading nominees include Drake and Rihanna, each with eight nods, and Chance the Rapper, who climbed the charts as an independent and had seven nominations in five categories, including best new artist. Yet every list of Grammy nominations comes with surprises. For album of the year, “Lemonade” and “25” will compete against Drake’s “Views,” a monster streaming hit “Purpose,” Justin Bieber’s comeback vehicle and, in what might be the year’s wild card, “A Sailor’s Guide to Earth,” by the country singer Sturgill Simpson, a critical favorite but modest seller. For record of the year, an award for the performer and producers of a single track, “Formation” and “Hello” face off against “7 Years,” a mellow hit by the Danish group Lukas Graham “Stressed Out,” by the   pop duo Twenty One Pilots and Rihanna’s “Work,” which features Drake. (“Formation,” “Hello” and “7 Years” are also up for song of the year, which recognizes songwriters.) When the nominations were announced early Tuesday, many artists took to social media to express thanks or surprise. The Chainsmokers, a D. J. duo, are up for three awards, including best new artist. When they got the news, they said on Twitter, they were in line at a Dunkin’ Donuts, “and   everyone in the store. ” Kanye West, whose album “The Life of Pablo” and related tour also drew wide attention, received eight nominations in five categories like Drake and Chance, he is up for all four rap awards. But members of the Recording Academy, the organization that presents the Grammys, did not choose Mr. West  —   a frequent Grammy critic  —   in any of the top categories for his own work. He is, however, one of the 20 credited producers on Drake’s “Views. ” On the other hand, Beyoncé was nominated for seemingly every award possible. Besides the top fields, she is up for awards in the pop category (“Hold Up,” pop solo performance) rock (“Don’t Hurt Yourself,” with Jack White, for rock performance) RB (“Lemonade,” for urban contemporary album) and rap (“Freedom,” with Kendrick Lamar, for best   performance). “Lemonade” was also nominated for best music film, and “Formation” for best music video. Beyoncé has been nominated 62 times in her career, more than any other female artist. She has already won 20 awards, and if she wins eight this year, Beyoncé would surpass Alison Krauss as the   woman in Grammy history. Members of Twenty One Pilots are up for a total of five awards David Bowie, who died in January after releasing his album “Blackstar,” is up for four. In his lifetime, Mr. Bowie won only one Grammy, along with a lifetime achievement award. In recent years, the Recording Academy has worked, with mixed success, to better reflect the diversity and pulse of current pop music. “There was a time when the membership of the academy may have skewed a little older,” Neil Portnow, its president, said in an interview. “But as we have evolved and the community of membership has broadened, you probably see some reflection of that in how the nominations come out. ” Yet there were still some striking absences from this year’s nominees, including Drake’s song “One Dance. ” By far one of the biggest hits of the year  —   it was No. 1 for 10 weeks  —   the song received no nominations. (“Hotline Bling,” Drake’s other pop smash, had two nominations.) Another absence is the result of an apparent protest. The Grammys have fared far better than the Oscars and other awards in recognizing diversity, yet have also been criticized for favoring white artists in the top categories. Frank Ocean, the RB singer and songwriter whose album “Blonde” was another major pop event, declined to submit his material for consideration. In an interview with The New York Times last month, Mr. Ocean called the Grammys’ nomination system “dated,” and added: “I’d rather this be my Colin Kaepernick moment for the Grammys than sit there in the audience. ” In response to that, Mr. Portnow said, “If you look at the   entries in our process, it’s pretty clear to me that the vast majority of artists feel that we are important, that they do aspire to be honored by their peers, and that the process we’ve created is democratic and transparent. ” Mr. Ocean’s stance makes him an exception, with many artists and their business representatives spending months campaigning for the nominations. This year Chance the Rapper benefited from a rule change that allowed   albums like his “Coloring Book” mixtape to be considered for awards. In a “for your consideration” ad in Billboard, Chance asked simply, “Hey, why not me?”'"}, "time": 1742562278.7461116}