{"duration": 0.1166081428527832, "input_args": {"text": "'BBC News A group of warships including Russia’s only aircraft carrier, the Admiral Kuznetsov, is reportedly refuelling at sea off North Africa en route to Syria. \\nPlans for some of the ships to dock at a Spanish port were cancelled after Nato allies voiced concern. \\nNato is concerned planes from the carrier could be used to attack civilians in the Syrian city of Aleppo. \\nPresident Vladimir Putin also hinted that an aerial bombardment of rebel-held east Aleppo could resume. \\nRussia and its ally, the Syrian government, had said earlier that they would continue a moratorium on the bombing. \\nAt an international conference in the Russian city of Sochi on Thursday, Mr Putin said other parties to the conflict had not been keeping their promises. \\n“Where is the disengagement of terrorists from the healthy part of the opposition?” Mr Putin asked. \\n“So far we have been restrained, and we have not been rude to our partners, but everything has its limits. We could respond.” \\nThe Admiral Kuznetsov can carry dozens of fighter bombers and helicopters. It has been sailing for the past week from Russia to the Mediterranean. \\nThe BBC’s Jonathan Marcus reports from Brussels that the battle group is currently at anchor off the North African coast and taking on fuel. \\nThe group has two “oilers” (tankers) with it and it is not clear which of the vessels is actually refuelling, he adds. \\nThe Russian embassy in Madrid formally withdrew a request to Spain for refuelling after being approached by the Spanish foreign ministry. \\n“Given the information which appeared on the possibility that these ships would participate in supporting military action in the Syrian city of Aleppo, the ministry of foreign affairs requested clarification from the embassy of the Russian Federation in Madrid,” the Spanish foreign ministry had said on Wednesday in a statement to the BBC. \\nIt added that permission had been granted in September for three Russian ships to dock in the port of Ceuta between 28 October and 2 November. It said such stops for Russian naval vessels had taken place for years in Spanish ports. \\nNato had said the final decision on resupply rested with Spain. \\n“We are concerned and I have expressed that very clearly about the potential use of this battle group to increase Russia’s ability and to be a platform for air strikes against Syria,” Nato’s Secretary-General Jens Stoltenberg told journalists on Tuesday. Image copyright EPA Image caption The warships came down the Channel \\nThe naval group also includes a nuclear-powered battle cruiser, two anti-submarine warships and four support vessels, probably escorted by submarines. \\nThe battle group is expected to join about 10 other Russian vessels already off the Syrian coast. \\nSome 2,700 people have been killed or injured since the Russian-backed Syrian offensive started last month, according to activists. \\nWestern leaders have said Russian and Syrian air strikes on Aleppo could amount to war crimes, an accusation rejected by Russia. \\nAbout 250,000 civilians who live in Aleppo have been trapped by the fighting. Moscow announced last week a “humanitarian pause” in attacks as part of a plan to allow civilians and fighters to leave the area.'"}, "time": 1742563435.9673347}