{"duration": 0.09546804428100586, "input_args": {"text": "\"\\nHillary Clinton’s ties to satanic rituals and the occult have been well-documented for decades.\\nClinton insider Larry Nichols told Infowars that Hillary Clinton used to attend a “ witch’s church ” in Los Angeles during Bill’s presidency.\\nThe currently serving FBI agent said Clinton is : “the antichrist personified to a large swath of FBI personnel,” and that “the reason why they’re leaking is they’re pro-Trump.”\\nAlso, DC insider Doug Hagmann broke the news that the NYPD found a blackmail sex network on Anthony Weiner’s computer.\\nFurthermore, the latest bombshell to come from WikiLeaks connects Clinton campaign head John Podesta to top occultist Marina Abramovic .\\nMarina Abramovic is a Crypto . She does not publicly admit her putrid roots but her name gives her up. Oligarch Roman Abramovich who managed to escape justice in Russia and fled to the UK is also Jewish but he is public about it.\\nAbramovic is a common name among Jewish people living in Slavic countries, because they like to brag that they are the descendants of Abraham. Abramovic is a derivation of Abraham. In the Holy Bible, John 8:39-44 there is actually a very revealing conversation about this specific issue:\\n“ Abraham is our father ,” they (Jews) answered. “ If you were Abraham’s children ,” said Jesus, “ then you would do what Abraham did. \\nAs it is, you are looking for a way to kill me, a man who has told you the truth that I heard from God. Abraham did not do such things.\\nYou are doing the works of your own father.” “We are not illegitimate children,” they protested. “The only Father we have is God himself.”\\nJesus said to them, “If God were your Father, you would love me, for I have come here from God. I have not come on my own; God sent me.\\nWhy is my language not clear to you? Because you are unable to hear what I say.\\nYou belong to your father, the devil , and you want to carry out your father’s desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.\\nThis email comes shortly after we previously had another email where Jennifer Palmieri, Campaign Chairman John Podesta and John Halpin discuss about how much they HATE Christians, especially Catholics and Evangelicals .\\nInfowars reporter Paul Joseph Watson breaks down the “spirit cooking” ritual:\\n\\nThe Clinton Satanic network has now been exposed on a national level thanks to WikiLeaks.\\n\\nAbramovic in particular invited Podesta to a “spirit cooking” dinner, an occult ritual started by infamous Satanist Aleister Crowley, which involves eating semen, blood and breast milk.\\n\\nHere are some examples of what a “spirit cooking” dinner with Marina Abramovic looks like:\\nCan't wait to go #SpiritCooking with @HillaryClinton and @JohnPodesta again!\\nWhere do you get so much blood? #PodestaLeaks #WikiLeaks pic.twitter.com/GckBmIfHjL \\n— Viva Europa (@realVivaEuropa) November 4, 2016 \\n\\nAnother email from WikiLeaks even shows Abramovic being invited to Hillary Clinton’s campaign launch party.\\nThe Drudge Report linked this article at the top of the site propelling the hashtag #SpiritCooking to the top of Twitter’s trending hashtag section.\\nThe internet exploded this morning after the news broke.\\nWhen you click on the top trending hashtag #SpiritCooking on Twitter, Hillary Clinton’s page comes up.\\nHere’s Abramovic pictured hanging out with top musicians Jay-Z and Lady Gaga.\\nThe Elites are Satanists. Ppl have been called conspiracy theorists for DECADES & it's true. Jay Z w/ Maria Abramovic herself #SpiritCooking pic.twitter.com/Dn70eD5daS \\n— ALWAYS TRUMP! (@Always_Trump) November 4, 2016 \\n\\nIt's perfectly normal that this woman is close friends with Hillary campaign leaders. #SpiritCooking pic.twitter.com/uC4agv7kz1 \\n— Paul Joseph Watson (@PrisonPlanet) November 4, 2016 \\n\\nDuring the RNC in Cleveland, Republican presidential candidate Dr. Ben Carson called out Clinton on her Luciferian ties.\\n\\nSimilarly, an article from CNN in 1996 discusses Hillary’s affiliation with dark magic.\\nMore information on that article can be found here .\\nBill Clinton’s book My Life: The Early Years describes their trips to Haiti where they participated in “voodoo rituals.”\\nSo far, all these revelations has hurt the Clinton campaign and Hillary is already losing voters.\\nI'm seriously am about to call the board of elections and see if I can change my vote #SpiritCooking \\n— Aniyah ✨ (@aniyah_vernisha) November 4, 2016 \\n\\nI just recently switched to Trump, & glad I did\\nWon't have none of that devil worship in my white house #SpiritCooking pic.twitter.com/SXOGjA7fUy \\n— Erma Jackson (@ErmaJackson20) November 4, 2016 \\n\\nSource \\n\""}, "time": 1742562377.3223324}