{"duration": 0.07020282745361328, "input_args": {"text": "'Election WASHINGTON, DC - MARCH 23: Former U.S. Secretary of State Hillary Clinton speaks at the Center for American Progress March 23, 2015 in Washington, DC. Clinton joined a panel in discussing challenges facing urban centers in the United States. (Photo by Win McNamee/Getty Images) FBI Investigators “99% Sure” 5 Foreign Intelligence Agencies Hacked Clinton’s Private Server Shane Ashton November 2, 2016 FBI Investigators “99% sure” 5 Foreign Intelligence Agencies Hacked Clinton’s Private Server. Hillary Clinton has a lot of explaining to do! As reported by Lou Dobbs on Fox News: \\nBreaking new developments tonight in the FBI investigation. Investigators are now, as I said to you at the outset, 99% sure that as many as five foreign intelligence agencies, were able to hack into the Clinton email server and did put national security in jeopardy. That according to FBI sources. A direct contradiction, of course, of president Obama’s assertion to CBS News just last October. \\nPrevious reporting from FBI Director James Comey in his July 5 press conference concluded that there was no evidence that any foreign enemies had gained access to the server. \\nPerhaps the newly discovered laptop owned by former Congressman Anthony Weiner and top Hillary Clinton aide Huma Abedin contained new information that shows that foreign actors did indeed gain access to the server. \\nRepublicans were dismayed at the original decision to not charge Secretary Clinton, arguing that just the mere presence of a private server put national security at risk. Director Comey argued that there was no evidence of intent to unknowingly share classified information. However, 18 U.S. Code § 798 – Disclosure of classified information states: \\nWhoever knowingly and willfully communicates, furnishes, transmits, or otherwise makes available to an unauthorized person, or publishes, or uses in any manner prejudicial to the safety or interest of the United States or for the benefit of any foreign government to the detriment of the United States any classified information […] Shall be fined under this title or imprisoned not more than ten years, or both. \\nThis statute could be argued that intent is not necessary for prosecution, merely the making available of classified information is grounds for prosecution. \\nThese new developments will be another boon to an already horrible week for the Clinton camp, as the new FBI investigation has led to the tightening of polls. \\nREGATED will cover the latest developments as they come along. The following two tabs change content below. Latest Posts Shane Ashton Shane Ashton is a writer for REGATED, interested in political theory, conservatism, and all things Boston. He is consistently seen at Fenway Park and has been known to sleep outside for World Series tickets. You can follow him on Twitter @ShaneRegated Latest posts by Shane Ashton ( see all ) '"}, "time": 1742562209.3003542}