{"duration": 0.05635499954223633, "input_args": {"text": "'Dueling Drills Further Increase NATO Russia Tensions November 03, 2016 Dueling Drills Further Increase NATO Russia Tensions \\nIrked by NATO\\'s disaster-relief drills in Montenegro, Russia held special forces exercises with its Balkan neighbour Serbia on Wednesday. In Montenegro, which split from Serbia a decade ago, NATO is on Friday due to wrap up a five-day disaster-relief drill of 680 unarmed personnel from seven NATO members and 10 partner countries including Serbia. \"It is in the interest of Montenegro, in the interest of NATO, and also in the interest of the region, to be part of NATO and promote Euro-Atlantic values in the Balkans, and these values benefit each and every one of us,\" Montenegro\\'s deputy Prime Minister Dusko Markovic , said about the exercise. Across the border, in Serbia, Russia flew in its paratroopers along with allied Belarus for an exercise called \"Slavic Brotherhood\", which according the Serbian defence ministry focuses on \"fighting terrorism\". \\nThe drills are set to last until November 9 and will include 212 Russian, 450 Serbian and 56 Belarusian troops. Three Russian transport planes have already landed in Belgrade on Wednesday bringing in soldiers and equipment. \\nDrills in the two former Yugoslav republics reflect mounting tensions between Russia and the West over a variety of geopolitical issues including conflicts in Syria and Ukraine. \\nREAD MORE: RUSSIA IS MOVING NUKES WEST IN RESPONSE TO CONTINUING NATO AGGRESSION \\nIn Serbia, NATO is hugely unpopular after its 1999 bombing ousted Belgrade\\'s armed forces out of its former southern province of Kosovo. \\nBut as part of its integrations with the West, Serbia last year signed the Individual Partnership Action Plan (IPAP), the highest level of cooperation between NATO and a country not aspiring to join. \\nAn EU candidate, Serbia insists that it is militarily neutral, but maintains close ties with Russia, its Orthodox Christian and Slavic superpower ally, the biggest gas and oil source and an obstacle to Kosovo\\'s membership in the United Nations. \\nLast year Montenegro accepted an invitation to join NATO, a move that soured relations withRussia. Ahead of October\\'s parliamentary vote Montenegro\\'s outgoing Prime Minister Milo Djukanovic accused Moscow of meddling in country\\'s elections and of financing the opposition. A fifth of the votes in the poll went to an anti-NATO, pro-Serbia bloc. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742561628.2692895}