{"duration": 0.04741716384887695, "input_args": {"text": "'BRICS muss sich US-Finanzkrieg stellen von Ariel Noyola Rodríguez Um dem von den USA provozierten Finanzkrieg entgegentreten zu können, sollten die BRICS dringend ihre Kooperation im Bereich Wirtschaft und Finanzen verstärken. Die \"Neue Entwicklungsbank\" der BRICS sollte ihr Kreditvolumen sowie ihren Reservefond erhöhen. Außerdem sollten die BRICS so schnell wie möglich ihre eigene Ratingagentur einrichten. Um den wirtschaftlichen Zusammenhalt zu intensivieren könnte eine Freihandelszone die Wechselkursbarrieren zu Fall bringen und damit den Handel merklich erhöhen. Fazit: Wenn nicht so schnell wie möglich geeignete Maßnahmen ergriffen werden, laufen die BRICS in Gefahr beim nächsten Finanz-Orkan zu sinken.\\nVoltaire Netzwerk | Mexiko-Stadt (Mexiko) | 29. Oktober 2016 français русский italiano Español Am 15. und 16. Oktober fand im indischen Bundesstaat Goa der achte BRICS-Gipfel statt - Brasilien, Russland, Indien, China und Südafrika. Nun muss eingestanden werden, dass die Zusammenkunft im Kontext einer für die Weltwirtschaft tiefgreifenden Krise stattfand. Indessen haben, aus einem strategischen Blickwinkel gesehen, die BRICS einmal mehr ihre außerordentliche Fähigkeit unter Beweis gestellt, einen schlechten Zeitpunkt umzuwandeln zu einer Gelegenheit ihre Beziehungen zu vertiefen.\\nNachdem die Wirtschaftsbeziehungen der BRICS im Lauf der letzten Jahre ein Goldenes Zeitalter genossen haben, sind die Wachstumsraten drastisch eingebrochen. Angesichts dieser schwierigen Lage, müssen die BRICS, mehr denn je, Nutzen aus den Finanzinstitutionen ziehen, welche sie der Welt vor einigen Jahren in Fortaleza (Brasilien) zu ihrem sechsten Gipfel präsentiert haben [ 1 ].\\nErst im April diesen Jahres hat die NDB (New Develoment Bank = Neue Entwicklungsbank der BRICS) ihren ersten Kredit über mehr als 800 Mill. Dollar ausgegeben [ 2 ] und man geht davon aus, dass 2017 d Gesamtkreditvolumen 2,5 Mrd Dollar erreichen könnte [ 3 ]. Darüber hinaus hat diese Finanzinstitution im Juli diesen Jahres mit der Ausgabe von \"green bonds\" - grünen Obligationen - in Yuan im Wert von 450 Mill Dollar eine historische Premiere verwirklichen können [ 4 ]. Diese Finanzierungsinstrumente dienen, wobei sie den Einfluss der chinesischen Währung auf Weltwährungsebene ausweiten, dazu große Investitionsprojekte zu finanzieren.\\nWährenddessen ist der CRA (Contingent Reserve Arrange = Reservefond der NBD) dotiert mit 100 Mrd Dollar, bereit die ersten Kreditlinien, freizugeben mit dem Ziel, wie es der indische Finanzminister, Arun Jaitley angekündigt hat, die Zahlungsbilanz der BRICS zu stabilisieren [ 5 ]. Jedes Mal, wenn die FED der USA, wie gewöhnlich, eine Zinserhöhung ins Gespräch bringt, die wiederum eine neue Finanzkrise nach sich ziehen würde, ist es dringend geraten, dass die BRICS so schnell wie möglich die monetären Reserven ihres Stabilisations-Fonds erhöhen, damit sie nicht in Gefahr laufen großen Schaden durch die Spekulationen der großen Investitionsbanken zu erleiden.\\nGleichzeitig müssen die BRICS neue Fronten eröffnen um offen die Hegemonie der USA und des Dollar im internationalen Finanzsystem herauszufordern [ 6 ], nicht nur indem sie mit den lokalen Währungen handeln, sondern zum Beispiel auch über den Umweg der Erhöhung der Yuan-Reserven ihrer Zentralbanken. Genauso wurde auch die Aufnahme der Volkswährung - des Renminbi in China - am letzten 1. Oktober, in den Währungskorb der Spitzenwährungen genehmigt, wobei sie die Sonderziehungsrechte des Internationalen Währungsfonds (IWF), die Ende der 1960 er Jahre eingeführt wurden, stützen konnte [ 7 ].\\nDarüber hinaus haben die BRICS die Kapazität, dank mächtiger geopolitischer Verbindungen zwischen Lateinamerika, Asien, Afrika und dem Mittleren Orient eine Finanz-Allianz zu formulieren. Die regionalen Entwicklungsbanken, die in erster Linie von umliegenden Ländern gestaltet wurden, können sehr gut zu diesem Ziel genutzt werden, sei es die Asiatische AIIB (Asian Infrastructure Investment Bank), sei es die ALBA (Alliance bolivarienne pour les peuples de Notre Amérique) und sogar die Süd-Bank, die endlich noch vor Jahresschluss starten soll.\\nAuch die Einrichtung einer eigenen Rating-Agentur ist für die BRICS ein dringendes Bedürfnis geworden, um sich endlich von der erdrückenden Dominanz zu befreien, welche von den USA über Fitch, Moody’s und Standard & Poor aufrechterhalten wird [ 8 ]. Diese drei Ratingagenturen, agieren in erster Linie, statt ihre Bewertungen auf technische Kriterien zurück zu führen, aus (ferngesteuerten, NdT) politischen Impulsen. Diese Funktionalität macht daraus eine echte Kriegsmaschine: Die Kurse von Staats-Obligationen werden herabgesetzt und erhöhen auf spektakuläre Weise die Zinssätze für Kredite in Ländern wie Griechenland, Russland oder Venezuela.\\nDer wirtschaftliche Zusammenhalt ist eine weitere wichtige Herausforderung, obwohl es keinen Zweifel daran gibt, dass er sich im Lauf der letzten Jahre zwischen 2001 und 2015 substanziell entwickelt, da sich der Handel zwischen den BRICS, im Verhältnis zu ihrem Gesamthandelsvolumen, von 6 auf 12% verdoppelt hat [ 9 ]. China ist die weitaus am stärksten in die anderen BRICS-Staaten integrierte Wirtschaft. Dafür sind die Beziehungen zwischen Ländern wie Indien und Südafrika marginal. Dieselbe Wahrheit gilt für Russland und Brasilien. Genau dies weist auf die ungeheure Bedeutung der baldigen Einrichtung einer Freihandelszone für die BRICS [ 10 ]. Indessen müssen, mit dem zunehmenden Abbau der Handelsschranken untereinander, die BRICS zusammen, durch die Integration ihrer Produktionssysteme, den Aufbau neuer Wertschöpfungsketten fördern, mit dem Ziel die Industrialisierung weniger begünstigten Länder zu unterstützen.\\nZusammengefasst zeichnen sich zahlreiche Herausforderungen für die fünf aufstrebenden Mächte am Horizont ab. Ich bin überzeugt, dass im Weiteren, der Erfolg der BRICS abhängen wird, von ihrer Fähigkeit sich stets neu zu erfinden und der Kreativität mit welcher sie neue Dimensionen der Kooperation, um ihre Ziele auf längere Zeit zu erreichen, zum Ausdruck bringen können. Gegenüber dem neuen Finanzkrieg, den Amerika vorbereitet, ist es für die BRICS-Staaten erneut an der Zeit zum Angriff überzugehen.\\nAriel Noyola Rodríguez Übersetzung\\nRalf Hesse\\nQuelle\\nRussia Today (Russland)'"}, "time": 1742628528.010343}