{"duration": 0.09543228149414062, "input_args": {"text": "'HONG KONG  —   As fewer than 1, 200 electors were casting ballots on Sunday for Hong Kong’s next leader, Sampson Wong was tagging Facebook videos that showed city residents making breakfast, riding trains and playing with cats. The scenes were unremarkable, and that was the point: Mr. Wong and other members of the Add Oil Team, an artists’ collective, were broadcasting the videos of people engaged in activities that did not include voting as a critique of an unrepresentative political process. “No Election in Hong Kong Now,” the title of their Facebook Live stream said. The Add Oil Team plans to turn the videos into a   work that could be exhibited in a gallery. “Although it’s an angry protest gesture, it’s also kind of peaceful,” Mr. Wong said, flanked by laptops and coffee cups in a minimalist design studio. Nearly three years ago, this semiautonomous Chinese city of 7. 3 million was roiled by months of   protests, known as Occupy Central or the Umbrella Movement, that stoked an existential debate over its political future. The protests ended without achieving their goal of greater public participation in the election of Hong Kong’s leader, and several organizers now face criminal charges. In July, Hong Kong will inaugurate its new leader, Carrie Lam, Beijing’s preferred candidate, as the former British colony commemorates the 20th anniversary of its handover to Chinese rule. All of that leaves local artists struggling to find meaning in the city’s upheavals, art professionals said in interviews. And while some of their recent works are more overtly political than others, many are infused with a sense of helplessness toward what is widely seen here as the city’s increasing subjugation to Beijing’s authoritarianism. “The expression of frustration, or the acceptance of failure, could be the key words of the artwork which reacts to the Umbrella Movement,” said Chow Chun Fai, who paints scenes from films in which characters comment on Hong Kong’s relationship with the mainland. “Three years ago, we had to be very quick and loud” during the street protests, he added. But recent artwork is “more sentimental, and we have the distance to tell the story and to listen to the story. ” Artists and curators in Hong Kong say that some of the themes coursing through local art have been present for decades. But the 2014 protests, they say, were an important catalyst for many artists, particularly those who came of age in this century. “Somehow the Umbrella Movement unfolded a lot of layers of the political and social problems” that Hong Kong faces, said Clara Cheung, a   of CG Artpartment, an art space in the Kowloon district. Recent artworks that address Hong Kong politics vary widely in message and delivery. Some are intended for public spaces, rather than commercial galleries, and feature loaded commentaries on the “one country, two systems” framework that guarantees the city its civil liberties and a high degree of autonomy until 2047. A prominent example is the   light show Mr. Wong and Jason Lam mounted last year that counted down the seconds until “one country, two systems” was due to expire. The display was exhibited across the face of Hong Kong’s tallest skyscraper to coincide with a visit by Zhang Dejiang, a member of China’s governing Politburo Standing Committee  —   but pulled after the artists explained its subversive message. In a similar vein, “Controlling Device,” by Kacey Wong, shows a pair of nooses, one bronzed, and one coated in red wax. Mr. Wong has said the piece is a commentary on recent crackdowns on free expression in Hong Kong, including the apparent abductions of several prominent booksellers to the mainland in 2015. “We’re fighting a war that we cannot win, so how to fight it?” Mr. Wong asked on a recent afternoon in his studio. “You fight it with grace. ” Other artworks comment on Hong Kong’s relationship with Beijing in more roundabout ways. Ocean Leung, for example, incorporates police and   political banners into   works that intentionally distort the banners’ original messages. The works are not overtly   and Mr. Leung said that his art illustrated how difficult it was to take clear positions on political questions. “It’s an embrace of failure,” he said. Similarly oblique commentaries run through “Breathing Space: Contemporary Art From Hong Kong,” an   show on view through July 9 at the Hong Kong Center of the Asia Society, which in November canceled a planned screening of a documentary about the Umbrella Movement, citing political concerns. One piece, “Defense and Resistance,” by South Ho, shows photos of the artist walling and then unwalling himself in with bricks marked with “Made in Xianggang,” the word for Hong Kong in Mandarin, the mainland’s dominant tongue. The bricks are also stacked up in the center of the gallery, with a chunk missing, and it is unclear whether the wall is structurally sound  —   a possible metaphor for Beijing’s power over the city. An especially haunting work, “If the Moment Came,” is a   black box with a top made of wired glass and a murky interior that shows a looping video of a hand playing with a kendama, a Japanese toy featuring a wooden handle and a small ball. The artist, Chloë Cheuk, said that she created the installation after making an audio recording of boys playing with kendamas at one of the 2014 protest sites. She added the wired glass, she said, as a reference to protesters who smashed a window at the Legislative Council complex around the same time. Ms. Cheuk, 27, said that the ball’s inevitable failure to break through the glass was intended to evoke the feeling of helplessness that she said was now familiar to many young Hong Kongers. But that feeling transcends politics, she said, and her artistic practice is primarily guided by her emotions. “When people see my work, they can respond because they can really feel it,” she said on a recent evening in Yau Tong, an industrial area in eastern Kowloon. “They feel that they’ve been understood. ”'"}, "time": 1742562965.1178138}