{"duration": 0.09026837348937988, "input_args": {"text": "'Waking Times \\nThe global depopulation agenda stated explicitly on the Georgie Guidestones , but furtively inserted into every matter of our personal affairs is becoming harder to deny. Kenyan doctors in 2014 uncovered mass-sterilizing, infertility-causing chemicals in a widely used tetanus vaccination promoted for use by the United Nations , causing a tense stand off between Catholic bishops and the Kenyan government. \\nThe Kenya Catholic Doctors Association (KCDA) is charging UNICEF and the World Health Organization (two United Nations organizations) with sterilizing millions of girls and women under the auspices of an anti-tetanus vaccination program which was sponsored by the Kenyan government. \\n“We sent six samples from around Kenya to laboratories in South Africa. They tested positive for the HCG antigen,” Dr. Muhame Ngare of the Mercy Medical Centre in Nairobi told LifeSiteNews. “They were all laced with HCG.” \\nAnti-HCG or anti-human chorionic gonadotropin is part of documented anti-fertility vaccine trials which sterilized animals on the first injection, and that have been used in human contraceptives . \\nThe Kenyan government has claimed that the tetanus vaccines are safe to use, but the KCDA found otherwise. \\nAccording to the Nairobi Standard, Robert Pukose, the vice-chairman of Kenya’s National Assembly of Health Committee has said, “We are at loss about who to believe since both sides have tabled conflicting results. That is why we need new tests conducted jointly for us to give final and conclusive results.” \\nDr. Ngare raised some important questions of the vaccines since the were found to be laced by anti-fertility drugs: \\n“Usually we give a series of shots over two to three years,” said Ngare. This included men, women, and children alike. Without the fanfare that is usually accompanied with other vaccination programs, Kenyan agencies were targeting women in their child-bearing years, starting at the age of 15 and giving them five doses of ‘tetanus.’ \\nDr. Ngare argues that the only other time a five-dose vaccination program has been used was when it is utilized as a carrier in fertility regulating vaccines laced with the pregnancy hormone, Human Chorionic Gonadotropin (HCG) developed by WHO in 1992. \\nAll six samples of the vaccine that were sent to laboratories at the University of Nairobi and another in South Africa were found to contain HCG. This mimics a natural hormone produced in pregnant women which causes them to develop antibodies. Their own bodies begin to produce HCG and thereby trigger their own miscarriages . \\nThis is possibly a furtherance of the Nazi sterilization attempts which largely influenced American eugenics laws and practices in the past century, leading to more than 350,000 forced sterilization programs and the legislation which would support them. \\nAs Kevin Mugur Galalae attests simply in his paper written after a 75-day hunger strike in which he protested the global depopulation agenda, \\n“Births have been prevented by interfering with the reproductive system so as to lower human fertility, while deaths have been promoted by weakening the immune system so as to increase morbidity and mortality.” \\nIf chemical sterilization doesn’t work – by adding fluoride to the water supply, bispehnol A (BPAs) to all manner of food and water, the spraying of aerosol aluminum via chemtrails, genetically modified foods, or manufactured virus, like HIV/AIDS, swine flu, bird flu, Zika, etc. – then you have to depopulate by the use of vaccines . \\nAnd if that doesn’t work? Micro-chipped, remotely controlled contraceptive implants are already an option being readied for roll-out in 2018. About the Author \\nChristina Sarich is a freelance writer, musician, yogi, and humanitarian. Her insights appear in magazines as diverse as Weston A. Price, Nexus, Atlantis Rising, and the Cuyamungue Institute, among others. She was recently a featured author in the Journal, “Wise Traditions in Food, Farming, and Healing Arts,” and her commentary on healing, ascension, and human potential inform a large body of the alternative news lexicon. She is also a staff writer for Waking Times . This article ( Kenyan Doctor Feared UN Promoted Vaccine Was ‘A Mass Sterilization Exercise’   Waking Times and is published here under a Creative Commons license with attribution to Nathaniel Mauka and WakingTimes.com . It may be re-posted freely with proper attribution and author bio.  '"}, "time": 1742564299.5311892}