{"duration": 0.0862879753112793, "input_args": {"text": "'WASHINGTON, D. C. —  Democratic lawmakers have responded with mixed reactions to President Donald Trump’s decision to carry out military strikes on a Syrian air base that was the site of a chemical attack on Syrian civilians this week. [Approximately 59 Tomahawk missiles targeted Shayrat Airfield near the Syrian city of Homs.  “I support the administration’s strike on the air base that launched the chemical attack. I hope this teaches President Assad not to use chemical weapons again,” Sen. Bill Nelson ( ) wrote on his Twitter feed: I support the admin’s strike on the air base that launched the chemical attack. I hope this teaches Assad not to use chemical weapons again.  —   Bill Nelson (@SenBillNelson) April 7, 2017,  Senate Minority Leader Chuck Schumer ( ) praised the strike but chided Trump for not consulting with Congress before carrying it out: Making sure that Assad knows that when he commits such despicable atrocities he will pay a price is the right thing to do. It is incumbent on the Trump administration to come up with a strategy and consult with Congress before implementing it. I salute the professionalism and skill of our Armed Forces who took action today. Please see my statement following the US military strike in Syria: pic. twitter.   —   Chuck Schumer (@SenSchumer) April 7, 2017,  The chemical attack killed least 72 civilians. Many of the victims included small children. Part of House Minority Leader Nancy Pelosi’s statement read, “Tonight’s strike in Syria appears to be a proportional response to the the regime’s use of chemical weapons. ” She also sounded off on the president’s decision to proceed without Congress, saying, “If the President intends to escalate the U. S. military’s involvement in Syria, he must come to Congress for an Authorization for Use of Military Force which is tailored to meet the threat and prevent another   war in the Middle East. ” However, in a   letter, she implored House Speaker Paul Ryan to “call the House back in session immediately to debate any decision to place our men and women in uniform in harm’s way. ” She added, “As heartbreaking as Assad’s chemical weapons attacks on his own people was, the crisis in Syria will not be resolved by one night of airstrikes. ” House Speaker Paul Ryan called the strikes “appropriate and just“: Earlier this week the Assad regime murdered dozens of innocent men, women, and children in a barbaric chemical weapons attack. Tonight the United States responded. This action was appropriate and just. These tactical strikes make clear that the Assad regime can no longer count on American inaction as it carries out atrocities against the Syrian people. Resolving the   crisis in Syria is a complex task, but Bashar   must be held accountable and his enablers must be persuaded to change course. I look forward to the administration further engaging Congress in this effort. While the strikes were lauded as a stark change from six years of inaction on Syria under former President Barack Obama’s administration, some Americans expressed opposition to the move fearing it might provoke another ground war. Rep. Tulsi Gabbard ( ) said, “It angers and saddens me that President Trump has taken the advice of war hawks and escalated our illegal regime change war to overthrow the Syrian government. ” She added, “This escalation is   and will lead to more dead civilians, more refugees, the strengthening of   and other terrorists, and a direct confrontation between the United States and Russia —  which could lead to nuclear war. ” Progressive Sen. Elizabeth Warren ( ) used the occasion to push for greater admittance of Syrian refugees into the United States. “The Syrian regime must be held accountable for this horrific act, and its actions underscore why the United States should embrace innocent people who are fleeing in terror. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742563787.093867}