{"duration": 0.045059919357299805, "input_args": {"text": "'Venezuela is currently in an economic collapse . Food shortages have driven the now 83% of Venezuelans that live in cities to grow their own produce as a means of survival. Socialist President Nicolás Maduro’s calls for “food sovereignty,” meaning that he wants urban people to start small farms and raise chickens in their homes in order to feed themselves, but his policies have only caused economic depravity, resulting in starvation and homelessness throughout the country. To add insult to injury, many believe these urban “ victory gardens ” will fail due to the lack of gardening skills urban dwellers possess.\\nLearn about the 7 Laws of Gardening Too Little Too Late? Venezuelans think Maduro’s strategy is a sorry excuse for a solution to solve the country’s dire food shortages and crippling inflation. Critics of Venezuelan economic policies have taken to social media to accuse government officials of downplaying the impoverished situation across the country.\\n#ThisIsVenezuela Urban farming in #Venezuela . Thanks to @NicolasMaduro . Image via @OvarioV pic.twitter.com/d2n6quZOt9 \\n— Michael Welling (@WellingMichael) July 16, 2016 \\n\\nAn increasingly common sight in Caracas, a picture posted to Twitter shows a man and dog sifting through trash for food with the caption “Urban Farming in Venezuela. Thanks to @Nicolas Maduro.” Many people think that Maduro is not fixing the problem but ignoring it altogether.\\nAnother tweet shows a picture of a woman shopping inside a Venezuelan grocery store with the caption “#ThisIsVenezuela”, and the shelves are nearly empty.\\n \\n#ThisIsVenezuela #TalkingDoesntWork #MoreAction #Venezuela #NadieSeRindeCarajo #Democracia #SacaLaBasura #MaduroPaFuera pic.twitter.com/vb9FP1oRz6 \\n— Mariana Gordon (@MarianaGordon_) November 2, 2016 \\n\\nOthers are enthusiastic about the plan. “If all communities began to cultivate, it would help to combat the high cost of living and food shortages,” said Luisana Galvis, 69, in a Reuters report . “If we sell and cultivate in our own home, nobody can take that away from us, and nobody is going to sell it to us. And so, we reduce the cost of living.”\\nIn 3 months time, only 273 tons of food have been grown, and this falls far short of the 3,500 ton annual goal of Venezuelans to feed their country. Some seeds that the Venezuelans are most likely growing are those that are easy to cultivate .\\n‘An Impending Humanitarian Crisis’ This past week, lawmakers in Venezuela declared a “food emergency” after reports of widespread shortages in milk, meat, bread and produce.\\nMaduro blames an “economic war”, but many Venezuelans are condemning Maduro’s socialist economic policies for causing the inflation and subsequent market instability.\\nPhil Gunson , a member of the International Crisis Group based in Caracas, warns of an impending humanitarian crisis.\\n“At least one in 10 people is eating two meals a day or less. There isn’t starvation. We are not talking about famine,” says Gunson. “But we are talking about malnutrition, particularly in the case of children.”\\nWith crime on the streets of Caracas at an all-time high, some are happy to be starting an indoor garden for the sake of staying away from thieves and violent crime. For Iraima Pacheco de Leandro, 54, a government opponent who was once kidnapped and held for ransom, farming is a great way to circumvent the chaos, but it may not be a long-term solution for Venezuela’s economic crisis. Her terrace is filled with vegetables as a measure of self-suffiiciency, but she still thinks that “agriculture should not be a solution,” and the real problem lies in government policy and the inflated markets they created. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 4th, 2016 How Would You Survive Hyperinflation in Venezuela? Stockpiling of Food Banned in Venezuela Venezuela: A Prepper’s Nightmare Come to Life Bartering to Eat: How People on the Streets of Venezuela are This Is What a Real-Life Economic Collapse Looks Like '"}, "time": 1742562255.319021}