{"duration": 0.11799263954162598, "input_args": {"text": "'Saturday Night Live star Michael Che is not apologizing for calling Boston, Massachusetts the “most racist city” he has ever visited. [Che had originally made the remarks during a “Weekend Update” segment on the NBC show the night before the Super Bowl. “I just want to relax, turn my brain off, and watch the blackest city in America beat the most racist city I’ve ever been to,” Che told SNL viewers.  @GerryCallahan @KirkAndCallahan yep figured you appreciate this one from SNL last night. pic. twitter.   —   Junk_That_Jersey (@junkthatjersey) February 5, 2017,  The controversial comment came up again Thursday during an appearance at Boston University. Che explained that he had received a ton of angry feedback over his Boston remarks, the Boston Globe reports.  He said he had responded to one woman, who was exceptionally outraged by the line, by insisting that she “talk to your closest black friend and ask them to explain it to you. ” “Touche,” the woman replied, according to Che. The    New York native also slammed Trump Thursday, telling the audience that it would be better if Trump was running another country instead of being in “our own little slice of crazy. ” Che reportedly made it a point to tell the audience that he never apologizes for his comedic language or for his controversial statements because he’s “just trying to be more presidential. ” After the presidential election, Che told Esquire magazine that he agreed with President Trump’s criticism that SNL is politically “biased” and    —   opting to ding Republicans and conservative viewpoints far more than Democratic and liberal dogma. “Oddly, I agree with him,” he said. “We try to write that way. But I do agree with him. I think the show should show all views and we make a conscious effort to do so. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564326.3550434}