{"duration": 0.04455137252807617, "input_args": {"text": "'\\nDuring an investigation into former New York congressman Anthony Weiner’s lewd texting with an underage girl, new communications were uncovered on the congressman’s computer which have given FBI Director James Comey cause to re-open the investigation into Hillary Clinton’s handling of classified information.\\nOn Friday, Comey notified the leaders of the congressional oversight committees that the investigation has been re-opened. In his letter, he wrote:\\nIn connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation. I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.\\nAccording to FBI officials, the emails were discovered after the bureau seized a device which was used by both the former congressman and his estranged wife, Huma Abedin, a top aide to the Clinton Campaign, which contained related information to their investigation into Weiner’s “sexting” escapade with a 15-year-old girl in North Carolina.\\nHillary Clinton seems to be confident that the FBI will not bring charges against her.\\n“[FBI Director James Comey] himself has said he doesn’t know whether the emails… are significant or not,” Clinton said to reporters on Friday. “I’m confident whatever they are will not change the conclusion reached in July. Therefore it’s imperative that the bureau explain this issue in question, whatever it is, without any delay.”\\nDonald Trump, speaking to a crowd in New Hampshire on Friday afternoon, tipped his hat to the FBI for having the “courage” to correct “the horrible mistake that they made.”\\n“Hillary Clinton’s corruption is on a scale we have never seen before,” Trump said. “We must not let her take her criminal scheme into the Oval Office.” Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Daily Sheeple of www.TheDailySheeple.com . \\nThis content may be freely reproduced in full or in part in digital form with full attribution to the author and a link to www.TheDailySheeple.com. '"}, "time": 1742562012.952252}