{"duration": 0.02183079719543457, "input_args": {"text": "\"Scientists believe that our magnetic poles are shifting. In fact, they could even flip in our lifetime. The South Pole has changed its location drastically, and the North Pole is moving across the Arctic Ocean at a pretty rapid pace. If this keeps occurring the Earth’s magnetic field could collapse and cause power outages on epic levels.\\n\\n\\nThe Earth’s magnetic field is also what shields us from much solar radiation. It appears to be weakening, and experts don’t know why. At a rate of around 5% per century, the Earth’s magnetic field has been diminishing for the last 400 or so years.\\n\\nWhat would happen if the magnetic poles were to flip? \\n\\nFirst, the magnetosphere would weaken, and our planet would no longer be protected from solar radiation. In turn, the radiation would burn off large portions of our atmosphere and make Earth uninhabitable for mankind. In the process weather patterns would drastically change and entire power grids would go down and not be able to be brought back on line.\\n\\nIs it really happening? Many people believe so, and you can see from the attached video that unprecedented insights have been formed on the Earth’s magnetic field. Also, accompanying reports show trends of our planets magnetic field weakening and it’s poles moving at a rate of around forty miles a year.\\n\\n\\nWith a pole shift we can expect weather patterns that would be unlike anything expected before. Floods, hurricanes, and tornados will be much more common and will happen in areas where they did not use to occur. Earthquakes and other planetary happenings will be on par to bring about extinction events . \\n\\nMeasurements do confirm this to be true; the North Pole appears to be heading towards Siberia and the South Pole will follow suit at the opposite end of the planet. So, Yes, Yes it is happening, and it has already started. This is true, though while the field is weak, it allows more space debris to come our way a lot more often, the magnetic field also helps to deflect objects. Mars may have been hit because it lost its shield and then most of its atmosphere. If life has once flourished on Mars then life reestablished itself here then I hope we learn from the mistakes and don't repeat them.\\n\\nWATCH THE VIDEO: \\n\\n\\nDisclose TV SOURCE \""}, "time": 1742628486.3372798}