{"duration": 0.017127275466918945, "input_args": {"text": "'Pablo Gomez, Jr. a   Berkeley student activist arrested in January for allegedly stabbing a popular French elementary school teacher to death, and severely injuring another woman, insists on being referred to as “they. ”[Gomez’s preference to be called “they” and “them” as opposed to “he” has been “sucked up into the debate over gender identity,” according to the Associated Press.  The incident has reportedly   talks surrounding the use of gender pronouns, particularly in a city seen as the bastion of liberalism and progressive   in America. Emile Inman, 27, was reportedly found dead in her home this past January after allegedly being stabbed by Gomez, Jr. Another woman, Kiana Schmitt, 24, was rushed to the hospital after Gomez allegedly stabbed her hours earlier. However, Berkeleyside, which first reported on Gomez’s pronoun preference, began referring to the   campus activists as “they” and “them” once the publication learned of that preference from one of his friends. Berkeleyside updated its January 6 article to read, “According to Gomez Jr. ’s Facebook page, they are a UC Berkeley student who lives in Berkeley. [A friend contacted Berkeleyside after publication to say that Gomez Jr. uses the pronoun “they. ” This story has been updated. ]” Popular conservative columnist Ann Coulter reacted to Berkeleyside’s decision to satisfy the murderer’s pronoun request over social media: Berkeley student arrested https:  . .  Article calls Gomez ”they.” Did newspapers call John Hinkley ”Jodi Foster’s boyfriend”?  —   Ann Coulter (@AnnCoulter) January 8, 2017,  The AP reported, “After Raguso’s report, conservative commentator Ann Coulter ridiculed the pronoun change and mocked Gomez’s activist background. Breitbart. com and other conservative political websites picked up the story. ” Breitbart’s article can be found here. Frances Dinkelspiel,   of Berkeleyside, told Heat Street, “We decided to use ‘they’ for Pablo Gomez Jr because that is Gomez’s preferred gender pronoun. It’s as simple as that. We have used ‘they’ in other stories about    people. ” Similarly, Heat Street pointed out that Andrea Platten, managing editor of the Daily Californian, also adopted “they” as a singular pronoun at the publication last February. “We believe that any person’s preferred pronoun should be honored, regardless of whether they are accused of committing a crime,” Platten told Heat Street. Not everyone agreed that Gomez should have the right to decide which pronoun is used to describe him. “I think you give away your right to make a demand like that when you are arrested for killing somebody,” UC Berkeley junior and College Republicans member Jonothan Chow told the AP.   Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742628478.1871061}