{"duration": 0.0714716911315918, "input_args": {"text": "'First ever Hindu was elected to the US House of Representatives. She will take the oath of office over the Bhagavad Gita. \\n\\nDuring election, Hawaii elected Japan-born Mazie Hirono to be the first ever Asian-American woman elected to the Senate. Hawaii also elected Democrat Tulsi Gabbard as the first ever practicing Hindu to the US House of Representatives. Because of this, Fox News have declare Hawaii a “disaster zone”. \\n\\nGabbard is the daughter of two conservative Hawaii politicians. She first ran, and was elected into office at the age of 21. After her first term, she served on a 12 month tour of duty with Hawaii’s National Guard, and then became the first woman in history of the Accelerated Officer Candidate School at the Alabama Military Academy to be designated a “distinguished honor graduate”. \\n\\nShe was then deployed to Baghdad as a medical operations specialist in 2004, and she was deployed to Kuwait in 2008. \\n\\nHistory has proven that not everyone is comfortable with a Hindu elect. When Hindu statesman Rajan Zed was asked by the Senate to open with a prayer in 2007, the American Family Association called the prayer “gross idolatry” and urged people to protest. Three protesters interrupted the prayer with shouts from the gallery. \\n\\nWhen she is sworn this January, Gabbard will take her oath of office over the Bhagavad Gita, a sacred text for Hinduism or Sanatana Dharma. \\n\\nGabbard hopes to assist the US in fostering a better relationship with India, the world’s largest democracy with a growing economic and nuclear power. She also hopes to work on veteran’s affairs, and environmental issues. \\n\\nOther non-Christian people in Congress include Minnesota’s Keith Ellison, who took his oath of office over the Qu-ran. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742562060.5821042}