{"duration": 0.0752413272857666, "input_args": {"text": "'Without Bold Agenda, Warn Progressives, A Clinton Presidency Won’t Stand Chance Posted on Nov 3, 2016 \\nBy Lauren McCauley / Common Dreams Progressive leaders, including Sen. Bernie Sanders and 350.org co-founder Bill McKibben, promise there will no honeymoon period for the centrist Democrat should she be elected. ( Daniel / (CC BY-ND 2.0) ) \\nWhile the whole country appears to be on edge ahead of next week’s presidential election, the Left is “increasingly confident” that, should a Hillary Clinton presidency come to pass, the Democratic nominee won’t be able to turn her back on progressive campaign promises—as many argue President Barack Obama did—because she will need that grassroots support if she hopes to stay in office beyond four years. \\n“If she wants to be more than a one-term president, she’s going to have to work with the left. Period,” Murshed Zaheed, political director of CREDO, told The Hill for a new report published Thursday. \\nSpeaking with progressive activists, The Hill reports that the Left is entering a post-election season “emboldened and empowered,” and ready to fight for implementation of the Democratic platform, said to be the most progressive in the party’s history. \\nAnd unlike Obama, a hypothetical President Clinton won’t be in a position to attempt a “‘post-partisan’ approach to seeking deals with Republicans.” \\nAdvertisement Square, Site wide \\n“We’re hoping that she will be smart enough to know that if she were to go that route…there’s going to be a political price to pay for it, because it will demoralize her base heading into 2018 and, honestly, it may even jeopardize 2020,” said Zaheed. \\nBen Wikler, Washington director at MoveOn.org, predicted that the Democratic party is potentially moving “from an electoral storm into a governance storm.” \\nClinton, Wikler told The Hill , “will find ‘tremendous grassroots support if she goes to the mat’ for her liberal campaign platform. And if she doesn’t, those same grassroots liberals are ‘emboldened and empowered’ and ‘ready to hold her to account.’” \\nAnd Clinton seems to be aware of this dynamic. \\nAdam Green, co-founder of the Progressive Change Campaign Committee (PCCC), points to the fact that the Clinton campaign has Sen. Elizabeth Warren (D-Mass.) as well as her former primary rival, Sen. Bernie Sanders (I-Vt.) aggressively campaigning on her behalf the last full week before the election, with stops in a number of pivotal battleground states. \\nAnd while both are doing all they can to ensure that her presidential rival, Republican nominee Donald Trump, is not elected, Green is hopeful that the two progressive firebrands will provide “‘a pre-emptive chilling effect on bad behavior’ if she does win the presidency,” The Hill reports. \\nIndeed, Sanders has said that he intends to “leverage” the popularity he gained during the primary to ensure that Clinton enacts the party agenda and does not nominate the “same old, same old Wall Street guys” for regulatory positions. \\nAnd emails from Clinton’s campaign chair John Podesta recently leaked by WikiLeaks illustrated how she sought Warren’s approval and support. In one instance, her staff expressed concern that the by opposing a new Glass-Steagall Act, Clinton would appear too pro-Wall Street and thus “antagonize and activate Elizabeth Warren.” \\nProgressive leaders, including Sanders and 350.org co-founder Bill McKibben , have vowed that there will no honeymoon period for the centrist Democrat, should she be elected—and campaigners say that Clinton would be wise to heed their advice and go for those “big, bold ideas,” like tuition-free college, a higher minimum wage, a just transition to renewable energy, and Medicare for all. \\nAs Green told The Hill , Clinton’s success will be largely determined by two factors: How aggressively she pushes the progressive party platform in the first 100 days of her presidency and how effectively she rallies public support for those policies. “The absolute best way to get something done is to push big, bold ideas, get the public on your side and force Republicans to the table,” Green said. If she adopts that strategy, “the Republicans will cave,” Green said. “It’s just that simple.” \\nLauren McCauley is a staff writer at Common Dreams. TAGS:'"}, "time": 1742562636.829218}