{"duration": 0.052263736724853516, "input_args": {"text": "'Walt Disney Company CEO Robert Iger has quit his role on President Donald Trump’s Strategic and Policy Forum in the wake of the president’s decision to withdraw the United States from the Paris Climate Accord. [In a brief statement on his Twitter account, the    executive said he would resign his position on the advisory council as a “matter of principle. ”  As a matter of principle, I’ve resigned from the President’s Council over the  #ParisAgreement withdrawal.  —   Robert Iger (@RobertIger) June 1, 2017,  “Protecting our planet and driving economic growth are critical to our future, and they aren’t mutually exclusive,” Iger said in another statement issued through Disney. “I deeply disagree with the decision to withdraw from the Paris Agreement and, as a matter of principle, I’ve resigned from the President’s advisory council. ” Iger  —   who was a major contributor to former Democratic presidential candidate Hillary Clinton’s unsuccessful campaign  —   became the latest executive to resign his position from the council, after Tesla founder Elon Musk also announced he would quit the council in the wake of Trump’s decision. “Am departing presidential councils. Climate change is real. Leaving Paris is not good for America or the world,” Musk tweeted Thursday. Am departing presidential councils. Climate change is real. Leaving Paris is not good for America or the world.  —   Elon Musk (@elonmusk) June 1, 2017,  President Trump announced the United States’ withdrawal from the Paris agreement in a speech from the White House Rose Garden Thursday afternoon. “This agreement is less about the climate and more about other countries gaining a financial advantage over the United States, ” Trump explained. “I was elected to help the citizens of Pittsburgh, not Paris. ” The President’s Strategic and Policy Forum was established by    Trump in December. The council is chaired by Blackstone CEO and   Stephen A. Schwartzman and also includes JPMorgan Chase CEO Jamie Dimon, BlackRock CEO Larry Fink, General Motors CEO Mary Barra, General Electric CEO Jack Welch, Boeing President and CEO Jim McNerney, Walmart CEO Doug McMillon and several other business and industry leaders.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561909.5982358}