{"duration": 0.12291169166564941, "input_args": {"text": "'BARCELONA, Spain  —   A year ago, Oscar Camps, a Spaniard, was a lifeguard who traveled with a colleague to the Greek island of Lesbos to see what he could do to help as thousands of Syrian refugees washed up from Turkey. He had tried to volunteer for different European organizations and embassies, but was turned down, and arrived on the island with little more than swim fins. Mr. Camps said he had no idea how critical the situation in Lesbos had become. Within two hours of their arrival, he and his friend were taking off their shirts and shoes to jump into the sea to save people from drowning, after watching a boat sink close to the island’s rocky northern coast. Lesbos “changed my view on almost everything,” Mr. Camps recalled in a recent interview. “I realized that Europe’s inaction was absolutely deliberate  —   a decision by the European Union to use the Mediterranean and the Aegean as dissuasive tools, to send the message to people that they shouldn’t try to come because they would drown. ” The situation spurred him to action, and he decided to start his own nongovernmental aid group, Proactiva, through a crowdfunding campaign. Initially, he reused rickety vessels abandoned by refugees on the shores of Lesbos, and he invested 15, 000 euros, or about $16, 600, himself to buy equipment, as well as to bring two Jet Skis to Lesbos from Spain. But a big break came last May, when Livio Lo Monaco, the Italian owner of a Spanish mattress company, donated his yacht, the Astral. Since it started prowling the Mediterranean, the repurposed luxury sailing yacht has helped rescue about 15, 000 refugees and migrants trying to reach Europe by boat, mostly from Libya, Mr. Camps estimated. The Astral’s work has made Mr. Camps something of a celebrity in Spain, as well as the subject of a recent documentary film that helped raise funds for his organization, which now has an annual budget of about €1 million. He is due to travel to New York in November after his group was nominated for two separate awards for its humanitarian work. The Astral was originally built in 1970 by Philip Rhodes, a top yacht designer, and initially sailed by Cornelius Vanderstar, the owner of an aluminum company. Mr. Camps and his team have refitted the boat and stripped it of its luxury elements. Today it is operated by a team of volunteer lifeguards and doctors, and uses two dinghies in its    missions. It is designed to take about 60 refugees on board, but carries 600 life jackets. The boat’s crew helped save about 6, 000 people in the Mediterranean on a single day last summer, Mr. Camps said. Before jumping into the waters off Lesbos, Mr. Camps, 52, had already built a successful private company of lifeguards, monitoring beaches in four regions of Spain. He also has another business that supplies showers, watchtowers and other beach furniture. Mr. Camps decided to set up his own lifeguard company after standing among a group of helpless lifeguards, who could only watch from the beach as a teenager drowned off one of Barcelona’s beaches in 1993. The accident occurred in part because of unfamiliar sea currents, Mr. Camps said, resulting from the breakwater infrastructure added for the Olympics that Barcelona hosted the previous summer. At the time, Mr. Camps was working for the Red Cross. “I realized on that terrible day that sea rescue in Spain had to become a lot more professional,” Mr. Camps said. Spain was in the midst of a tourism boom, he added, “but we continued to believe that huge responsibilities could be handled only by volunteers. ” Mr. Camps said he sought to follow “the American model,” drawing on advice from the Los Angeles lifeguards. He is now back in touch with lifeguards in Los Angeles and Hawaii to see whether they can contribute to his work with refugees in the Mediterranean. “I want the Astral to be the flagship of human rights on the sea, but the needs are immense,” he said. In fact, Mr. Camps is hoping another rescue vessel will be donated to his group soon. The Astral’s rescue efforts have highlighted not only the scale of the catastrophe but also the failure of European governments to respond adequately, Mr. Camps said. More than 3, 500 people are estimated to have drowned this year while trying to reach southern Europe, even after each paid traffickers hundreds of dollars to guarantee a safe passage. On Nov. 3, two more shipwrecks left another 239 migrants missing at sea. Mr. Camps, however, claimed that European governments “are constantly lying about the number of dead,” notably by refusing to include in their estimates those believed to have disappeared at sea. When dealing with a boat sinking, “it’s pretty meaningless to use only the number of bodies found,” he argued. But for European countries, the scale of the problem and the policy calculus is not an easy one. Several photojournalists have recently traveled on the Astral, helping raise awareness of the tragedy at sea. Mr. Camps said he was at times shocked by the “media circus” generated by Europe’s refugee crisis, but he also acknowledged that it was thanks to such media coverage that he and others first heard about the chaos in Lesbos. Underlining this paradoxical situation, he recalled one occasion in Lesbos when “you had nine guys with cameras around one of my lifeguards who was saving a child, and nobody was helping but all were just taking photos. ” Unless the European Union resumes a   rescue program like Mare Nostrum, which was masterminded and funded by Italy, drownings are likely to rise significantly, Mr. Camps predicted, particularly if European land borders stay closed, pushing more refugees to cross by boat or dinghy. “The sea is being converted into an extermination center, with a lot of people dying and nobody really knowing how many,” Mr. Camps said. “The sea is like a carpet that governments are now lifting to brush underneath their dirt. ”'"}, "time": 1742564518.4140697}