{"duration": 0.10085654258728027, "input_args": {"text": "'WEST PALM BEACH, Fla.  —     Donald J. Trump said on Thursday that the United States should greatly “expand its nuclear capability,” appearing to suggest an end to decades of efforts by presidents of both parties to reduce the role of nuclear weapons in American defenses and strategy. Mr. Trump’s statement, in a midafternoon Twitter post, may have been a response to President Vladimir V. Putin of Russia, who in a speech to his military’s leadership in Moscow earlier on Thursday vowed to strengthen Russia’s nuclear missiles. Mr. Putin said nuclear forces needed to be bolstered so they could “reliably penetrate any existing and prospective missile defense systems,” apparently a reference to the Pentagon’s efforts to develop systems capable of shooting down   rockets. Shortly after Mr. Putin’s comments were reported by the news media, Mr. Trump said on Twitter that the United States must “strengthen and expand” its nuclear forces “until such time as the world comes to its senses regarding nukes. ” He did not elaborate. The vagueness of Mr. Trump’s posting made it difficult to assess its possible impact on American foreign policy, and further illustrated the potential dangers in setting policy, especially on such grave matters, in Twitter bursts and offhand remarks. Nuclear weapons are so fearsome that only a president can order their use, and deterrence is normally a complicated subject debated in academic treatises and negotiated over years by diplomats. Aides to Mr. Trump, asked to clarify what the   meant by the need to “expand” the nuclear ability of the United States, responded with a statement that did not address that point. Jason Miller, the incoming White House communications director, said in the statement that Mr. Trump was referring to “the threat of nuclear proliferation and the critical need to prevent it  —   particularly to and among terrorist organizations and unstable and rogue regimes. ” Mr. Miller added that the   had in the past “emphasized the need to improve and modernize our deterrent capability as a vital way to pursue peace through strength. ” It was the second time in two days that aides had tried to recast a statement from Mr. Trump. On Wednesday, he appeared to say that recent terror attacks in Europe had vindicated his campaign pledge to bar Muslims from entering the United States. Aides later said he was merely restating his promise to implement strict vetting and suspend the admission of people from countries associated with terrorism. With his Twitter post on nuclear arms, it remained unclear from his use of the word “expand” whether Mr. Trump would try to reverse agreements such as the New Start treaty, which Russia and the United States signed in 2010 and which commits both nations to modest reductions in strategic nuclear forces. But the implications of Mr. Trump’s post  —   if it signals the beginning of a new era of nuclear weapons expansion in the United States  —   could be profound. Derek Johnson, the executive director of Global Zero, a group that seeks the elimination of nuclear weapons, accused Mr. Trump of calling for a “new nuclear arms race,” even as Mr. Putin appears eager for a major expansion of Russian nuclear abilities. “The use of even a single nuclear weapon, anywhere in the world, would be a global humanitarian, environmental and economic disaster,” Mr. Johnson said in a statement. “A nuclear buildup in the U. S. and Russia only makes that nightmare scenario more likely. ” The United States and Russia are already racing to modernize their existing nuclear arsenals, replacing aging missile systems with smaller, more modern weapons that are harder to stop and more precise. That effort by Moscow and Washington, while allowed by current arms control treaties, has nonetheless caused fears of renewing a kind of Cold   arms race as the two nations seek technological dominance. The United States is also moving ahead with a modest system of missile defenses in Europe, a program that has deeply angered the Kremlin, which rejects arguments that it is aimed solely at the threat from Iran. But if Mr. Trump also intends to increase the number of America’s nuclear weapons, it could represent a significant break in strategic policy that dates to talks between the two nations that began under President Richard M. Nixon. It could also be a drastic reversal of President Obama’s approach. In one of his first major speeches in 2009, Mr. Obama told a cheering crowd in Prague that the United States would lead an effort to pursue rules and treaties that would result in a world without any nuclear weapons. Mr. Obama has had some limited success in pursuing that vision during his eight years in office. He convened a regular nuclear nonproliferation summit meeting aimed at stopping the spread of nuclear material with special concerns about terror groups gaining access to these materials. Mr. Obama negotiated a deal with Iran that his administration says would delay that government’s ability to develop a nuclear weapon. But during Mr. Obama’s time in office, North Korea has conducted several nuclear weapons tests. Contrary to Mr. Obama’s own conciliatory nuclear posture, and concrete steps in that direction, his administration has also embarked on a sweeping modernization of the American nuclear arsenal that may cost up to $1 trillion over three decades. It features new factories, refurbished nuclear arms and a new generation of weapon carriers, including bombers, missiles and submarines. The bombers are to carry a new   cruise missile meant to slip through enemy air defenses. During the presidential campaign, Mr. Trump said that he would not rule out the use of nuclear weapons even though he called their potential use “a horror. ” In an interview with The New York Times in March, the   also suggested that Japan and South Korea might have to obtain their own nuclear weapons, which would be a reversal of an American policy that for decades extended promises of protection to allies and foreclosed the need for them to go nuclear. John R. Harvey, who from 1995 to 2013 held senior positions overseeing nuclear weapons programs in the energy and defense departments, said Mr. Trump’s Twitter post on Thursday had several possible meanings, ranging from the routine to actions that could exceed current treaty limits. For example, Mr. Harvey said, Mr. Trump could have simply been voicing support for continuing the “nuclear modernization” program. But Mr. Trump might also have been suggesting that he wants to substantially increase the number of bombers, missiles and submarines. The United States currently has about 7, 000 nuclear weapons in the stockpile, including about 1, 750 strategic warheads deployed in missile silos, on bombers and in submarines around the world, according to the Federation of American Scientists. That is down from more than 30, 000 warheads at the height of the Cold War. Russia has about 7, 300 nuclear weapons, the federation says. Under the New Start treaty, both countries have committed to reducing the number of deployed nuclear weapons to 1, 550 by 2018, though that figure can be exceeded because each bomber is counted as a single weapon even if it carries more than one. David Wright,   of the global security program at the Union of Concerned Scientists, expressed dismay at Mr. Trump’s choice of Twitter to discuss nuclear weapons policy. “It’s a pretty blunt instrument to be trying to say something intelligible on what his plans are,” he said. “It sounded to me more like an advertisement to appear to be strong to the world as opposed to an assessment of what the U. S. may or may not need. ”'"}, "time": 1742564306.3867338}