{"duration": 0.15587115287780762, "input_args": {"text": "'NTEB Ads Privacy Policy To The Hollywood And DC Liberals Who Said They Would Move If Trump Won, Your Train Is Outside Liberal rape hoaxer Lena Dunham told Andy Cohen at the Matrix Awards that “I know a lot of people have been threatening to do this, but I really will. I know a lovely place in Vancouver.” The star and creator of HBO’s “Girls” has been a vocal advocate for Hillary Clinton, the Democratic nominee. by Geoffrey Grider November 9, 2016 Dozens of celebrities vowed to leave the country if Donald Trump won the White House, saying they’d flee to everywhere from Canada to Jupiter. \\nEDITOR’S NOTE: One of the great blessings of Trump’s campaign is that he exposed all the fakers, and phonies, pretend Republicans and wealthy, global elites who have been milking this country dry while actively working against it. Now we, the American people, humbly ask you to keep your promised to leave the country if your candidate lost. She did. Now get out. You’re with her, right? \\nThe threat is a common one after any election outcome: Canada’s immigration website crashed from heavy traffic as it looked increasingly likely that Donald Trump would win. But after the real estate mogul clinched the presidency in a stunning victory early Wednesday morning, some of those stars will face questions about making good on their promise. \\nHere is a list of some of the celebs who claimed they would move out of the U.S. under a Trump administration. Liberal Actors \\nBryan Cranston said he hopes he doesn’t have to pack his bags, but would “definitely move” if Trump won. “Absolutely, I would definitely move,” the “Breaking Bad” star said on “The Bestseller Experiment” podcast. “It’s not real to me that that would happen. I hope to God it won’t.” Trump’s dominating victory in under 2 minutes and Hillary supporters crying: \\nSamuel L. Jackson slammed Trump for running a “hate”-filled campaign and said he would move to South Africa if he wins. “If that mother becomes president, I’m moving my black ass to South Africa,” the movie star quipped to Jimmy Kimmel. \\nRape hoaxer Lena Dunham told Andy Cohen at the Matrix Awards that “I know a lot of people have been threatening to do this, but I really will. I know a lovely place in Vancouver.” The star and creator of HBO’s “Girls” has been a vocal advocate for Hillary Clinton , the Democratic nominee. \\nNeve Campbell, an actress on the political drama “House of Cards,” vowed to move back home to Canada, while “Orange is the New Black” actress Natasha Lyonne said she would hightail it to a mental hospital. Liberal Singers \\nCher tweeted this summer that if Trump gets elected, “I’m moving to Jupiter.” \\nMiley Cyrus wrote in an emotional Instagram post in March that tears were running down her cheek and she was unbelievably scared and sad. “I am moving if he is president,” the young pop star said. “I don’t say things I don’t mean!” \\nBarbara Streisand, a vocal Clinton supporter, told “60 Minutes” that “I’m either coming to your country if you’ll let me in, or Canada.” \\nNe-Yo told TMZ last month that he’d move to Canada and be neighbors with fellow R&B singer Drake if the country elected Donald Trump. Liberal Comedians \\nComedian Amy Schumer said in September that Spain would be her destination of choice. \\n“My act will change because I will need to learn to speak Spanish,” Schumer said in an appearance on the BBC’s “Newsnight.” “Because I will move to Spain or somewhere. It’s beyond my comprehension if Donald Trump won. It’s just too crazy.” \\nChelsea Handler said she already made contingency plans months ago. \\n“I did buy a house in another country just in case,” the comedian and talk show host said during an appearance on “Live with Kelly and Michael” in May. “So all these people that threaten to leave the country and then don’t — I actually will leave that country.” Former “Daily Show” host Jon Stewart said he would consider “getting in a rocket and going to another planet, because clearly this planet’s gone bonkers” if the real estate mogul wins. \\nWhoopi Goldberg, co-host of the “The View”, said on an episode of the talk show earlier this year that if the country elects Trump, “maybe it’s time for me to move, you know. I can afford to go.” Keegan-Michael Key said he would flee north to Canada. “It’s like, 10 minutes from Detroit,” the comedian told TMZ in January. “That’s where I’m from; my mom lives there. It’d make her happy too.” \\nHispanic comedian George Lopez said Trump “won’t have to worry about immigration” if he takes the White House because “we’ll all go back.” Liberal Political Figures \\nSupreme Court Justice Ruth Bader Ginsburg joked in an interview with The New York Times in July that it’d be time to move to New Zealand if Trump were to win. \\n“Now it’s time for us to move to New Zealand,” she said quoting her husband who died in 2010. “I can’t imagine what the country would be with Donald Trump as our president. For the country, it could be four years. For the court, it could be — I don’t even want to contemplate that.” \\nGinsburg later apologized for her comments, calling them “ill-advised.” \\nCivil rights activist Al Sharpton told a reporter earlier this year that he’s “reserving my ticket out of here if Donald Trump wins.” source \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742564449.8070045}