{"duration": 0.03199481964111328, "input_args": {"text": "'Home / News / Trump prepares to fill out security, economy teams Trump prepares to fill out security, economy teams Heisenberg 11 mins ago News Comments Off on Trump prepares to fill out security, economy teams \\nAfter a busy weekend interviewing job candidates, President-elect Donald Trump prepared Monday to begin filling out his economic and national security teams and outline his emerging White House agenda. \\n“We’ve made a couple of deals,” Trump told reporters after a weekend of meetings with with no less than 21 job candidates at his golf resort in Bedminster, N.J. \\nTransition aides said they would release a video Monday in which the president-elect discusses plans and “legislative priorities” for the Trump administration that begins Jan. 20. \\nTopics include trade, notably Trump ‘s opposition to the now-probably-defunct Trans-Pacific Partnership with Asian nations; energy development and “job-killing” regulations governing shale and clean coal; national security, with an emphasis on cybersecurity; and immigration, including alleged abuse of visa programs to undercut American workers, said transition aide Jason Miller. \\nTrump has more meetings on Monday, including one with Rick Perry. The former governor of Texas and ex-rival in the Republican primaries has been mentioned for a number of slots in Trump ‘s Cabinet, including the departments of Defense, Veterans Affairs, Energy, and Agriculture. \\nThe president also met with a fairly prominent Democrat: U.S. Rep. Tulsi Gabbard of Hawaii, who backed Bernie Sanders over Hillary Clinton during the Democratic primaries. A military veteran, Gabbard has been a vocal critic of VA medical services. \\nIn a statement released Monday Gabbard said “while the rules of political expediency would say I should have refused to meet with President-elect Trump , I never have and never will play politics with American and Syrian lives. \\n“President-elect Trump and I had a frank and positive conversation in which we discussed a variety of foreign policy issues in depth,” Gabbard said. “I shared with him my grave concerns that escalating the war in Syria by implementing a so-called no fly/safe zone would be disastrous for the Syrian people, our country, and the world,” Gabbard continued. \\nAlso Monday Trump met with former Massachusetts senator Scott Brown. After the meeting Brown told reporters that he spoke with Trump about being head of the VA. \\n“He’s obviously going to take my application, or interest, under consideration. I’m glad that he called. He’s going to obviously meet other folks, and we should know, I would think, probably after Thanksgiving,” Brown said. “I think I’m the best person, but there are some tremendous people out there and I don’t look at it as a competition.” \\nTrump also met with Oklahoma Gov. Mary Fallin who said she was not offered a position but that the meeting was just a start. '"}, "time": 1742628578.052911}