{"duration": 0.12723445892333984, "input_args": {"text": "'Susan Estrich is known for being first. A celebrated feminist legal scholar, Ms. Estrich was the first female president of The Harvard Law Review. Working for Michael S. Dukakis in 1988, she was the first woman to manage a presidential campaign. And in 1991 she coined the term “nuts and sluts” to describe the campaign Clarence Thomas supporters waged to discredit Anita Hill. Ms. Estrich took a different position in a 1998 opinion column defending President Bill Clinton. She wrote, “The reason men resort to the ‘nuts and sluts’ defense is because it may be the only way to undermine the credibility of a woman who is not, in fact, telling the truth. ” And that seems to be part of her strategy as the chief defender of the former Fox News chairman Roger Ailes, who lost his job after a number of women accused him of sexual harassment. Ms. Estrich, the author of the 1988 book “Real Rape: How the Legal System Victimizes Women Who Say No,” is now one of the last voices vigorously insisting that Mr. Ailes did nothing wrong. Even the owner of Fox News, Rupert Murdoch, seems not to agree. And that twist is bringing her back into the spotlight, and is puzzling, not to mention enraging, some of the people who once saw her as a role model. When the accusations first surfaced this summer, it shocked many feminists that Ms. Estrich, of all people, would represent Mr. Ailes, a    political operative and the guiding force of Fox News. But it wasn’t entirely surprising. For many years, Ms. Estrich was a lively liberal commentator on Fox News and she has defended another Republican man accused of sexual misconduct, Arnold Schwarzenegger, the former governor of California. In a phone interview, Ms. Estrich described Mr. Ailes  —   whom she met on the campaign trail in 1988, when he was advising George W. Bush  —   as a close friend. “In the 18 years I was at Fox News, Roger has never told me what to say, what to do or what to wear,” Ms. Estrich said. “He kept me on the payroll for seven months when I was too sick to work. ” But what really turned heads was Ms. Estrich’s zeal in attacking the New York magazine reporter who first broke the scandal. Interviewed for an article in The Daily Beast, she said, “Ultimately, it will become clear that the real enemy of women is Gabe Sherman. ” That sounded a little like a “jerks and perks” defense, and Ms. Estrich went on to suggest that Mr. Sherman, who published an unflattering biography of Mr. Ailes in 2014, had his own agenda for pursuing the story. She told The Daily Beast that Mr. Sherman was willing to “use and abuse” vulnerable women to pursue a vendetta against Mr. Ailes. (Mr. Sherman declined to comment.) The response on social media was vivid, to say the least. “Everyone knows @GabrielSherman is a brilliant journalist and Susan Estrich is a Fox hack,” is how Joan Walsh, a Washington political reporter, put it. Those close to Ms. Estrich say that she is staunchly supportive of her friends and clients and feels particularly beholden to Mr. Ailes for the way he stood by her when she fell gravely ill after a botched gastrointestinal operation in 2014. “Susan is fiercely loyal, to a detriment,” said Cathy Moran, a nurse in Los Angeles who took care of Ms. Estrich during her illness. “She will not bail on him. ” Ms. Moran said that as a friend, she wished Ms. Estrich wasn’t involved in defending Mr. Ailes but that once she takes on a cause, she won’t let it drop  —   even after 21st Century Fox reached a $20 million settlement with Gretchen Carlson and apologized to her publicly. Ms. Moran grimly likened Ms. Estrich’s position to an unwanted pregnancy: “At some point you reach the point where you can’t terminate. ” Ms. Estrich, a partner in the Los Angeles office of the litigation firm Quinn Emanuel Urquhart  Sullivan, said that she first heard the allegations against Mr. Ailes on her return from London, and that by the time she got to her apartment there were 10 messages from her old friend on her home voice mail. She didn’t hesitate to take the case, aware that some feminists say that she sold out. “It is painful, but at the same time I am a lawyer: Once she takes on a case she stands by her client,” Ms. Estrich said in a phone interview. “Roger needs someone to help him through this extremely difficult process. The last thing any client needs is a lawyer sitting in judgment. ” Ms. Estrich is a busy lawyer. In addition to her work at Quinn, Emanuel, she is a professor at the University of Southern California Gould School of Law and writes a syndicated political column. Although Mr. Ailes has been advising the Republican nominee, Donald J. Trump, Ms. Estrich recently referred to “the demagogue’s angry rants” and his “feet of clay. ” Ms. Estrich, who understandably is less visible on television these days, has a strong, somewhat disconcerting   presence. She speaks in a raspy,    day voice (although she no longer smokes) has an intense gaze and a disarmingly animated manner  —   as if Ruth Bader Ginsburg, in her Supreme Court decisions, put a circle over the I instead of a dot. Her writing is eclectic. In “Real Rape,” a book often cited in legal papers on sexual assault, she describes her own rape by a stranger wielding an ice pick. Ten years later, she published “Making the Case for Yourself: A Diet Book for Smart Women. ” In 2006 she had two more books, “The Case for Hillary Clinton” and one on the conservative writer Ann Coulter, “Soulless: Ann Coulter and the Right Wing Church of Hate. ” Ms. Coulter said that she likes and admires Ms. Estrich  —   and that she had forgotten about the book. “She is one of the few lawyers I have debated on TV who actually knew what she was talking about,” Ms. Coulter said. She said she understood her decision to defend Mr. Ailes. “Getting her was a brilliant move on Ailes’s part,” she said, and noted that no matter how alarming the allegation, “this is what lawyers do. If she were doing it pro bono, I would have a different assessment. ” Ms. Coulter noted that she had long dismissed the rumors about Mr. Ailes’s mistreatment of female employees. “I figured that if even one tenth of it were true, there would be a lawsuit. ” She paused. “Then there was a lawsuit. ” There could be a case to be made that Ms. Estrich is being held to a higher standard than male litigators. There was no such outcry when a male colleague at her law firm briefly took on Bill Cosby as a client in 2015. But some feminists say they do expect more of Ms. Estrich. “She has a higher level of accountability,” said Andi Zeisler, a   of Bitch Magazine. “For someone who was such a pioneering legal scholar to make Ailes an exception to the trenchant line she has drawn is a depressing irony. ” But there are some amusing incongruities as well. Andrea Tantaros, a former Fox anchor who also filed a suit, thanks Mr. Ailes in the acknowledgements of her     “Tied Up in Knots: How Getting What We Wanted Made Women Miserable. ” Mostly, she complains about how successful women compete with one another, writing, “In my experience, men in positions of power tend to be less inclined to act as roadblocks. ” While Ms. Estrich’s reputation is hotly debated, few observers believe the Ailes case will hurt her practice. “I think in many respects it will increase her status as a lawyer,” said Richard Sauber, a Washington litigator. “There will be people who will never hire her again, but there may be more who will say, ‘That’s the kind of lawyer I want. ’”'"}, "time": 1742563236.0730195}