{"duration": 1.2667698860168457, "input_args": {"text": "'“Multicultural” establishment candidate Emmanuel Macron endangers France, and “sorcerers of globalism” have put the West in a state of decay warns engineer, writer, and integration expert Malika  . [Noting that Germany received more than a million migrants in 2015 alone, the Algerian engineer and writer highlighted how former investment banker Macron “travelled to Berlin to pay tribute to Angela Merkel’s welcome policy” and warns Macron’s approach to migration is “dangerous”.  Drawing attention to the globalist   president’s declaration that “there is no French culture” in her interview with Le Figaro   said he also has a “blind spot” with regards to integration policies. The engineer, who was a member of France’s High Council of Integration, went on to contend there is “hardly any” common ground between Macron and his   rival, Francois Fillon. “For one, French culture does not exist, when the other is part of a desire to continue France from a cultural point of view,” the author of Decaying France told the broadsheet newspaper. “[Macron has] repeatedly made clear the fact his line on these issues is globalist and multicultural, and so his positioning on migratory flows and French culture is coherent. “[He sees France] as a country with open doors and windows, under the reign of a ‘buffet culture’ under which everyone places his and her dishes on the table and people only take what suits them. ”   also drew attention to remarks in which Macron described France’s colonisation of Algeria as a “crime against humanity” writing that the   president’s objective was to “seduce” voters of North African descent. But, noting the accusation “is likely to pit different groups against each other” she warns: “[The comments were] extremely serious at a time when France is at war, targeted by terrorists who justify their acts with what [the nation] is and what it has been. ”   said Macron represents a continuation of the ‘Terra Nova’ strategy on the left, referencing the “progressive” think tank whose name has become synonymous with a strategy in which minorities are encouraged to band together to fight against “an electorate that defends against change”. Last year, Wikileaks revealed Macron, a former Rothschild banker, was working on an alliance with Hillary Clinton before her shock defeat in the U. S. presidential election. The globalist candidate had requested the Democratic presidential candidate’s presence at a private roundtable dinner in October with several European politicians, according to an email published by Wikileaks. Breitbart London reported Macron announced the world has entered an age of mass migration which will be inescapable for Europe. “We have entered a world of great migrations and we will have more and more of it [migration]” he declared during a debate on climate change. And earlier this month, maintaining that the mass migration of people from the third world to Europe will only accelerate, the establishment favourite to win the election said immigrants are good for France and bring “fresh bursts of creativity and innovation” to society.'"}, "time": 1742564391.9646459}