{"duration": 0.1404561996459961, "input_args": {"text": "'Revolutions rarely give way to gracious expressions of defeat. And so, despite the crushing California results that rolled in for him on Tuesday night, despite the insurmountable delegate math and the growing pleas that he end his quest for the White House, Senator Bernie Sanders took to the stage in Santa Monica and basked, bragged and vowed to fight on. In a speech of striking stubbornness, he ignored the   achievement of his Democratic rival, Hillary Clinton, who became the first woman in American history to clinch the presidential nomination of a major political party. Mr. Sanders waited until 15 minutes into his speech to utter Mrs. Clinton’s name. He referred, almost in passing, to a telephone conversation in which he had congratulated her on her victories. At that, the crowd of more than 3, 000 inside an aging airport hangar booed loudly. Mr. Sanders did little to discourage them. Tuesday was, undeniably, Mrs. Clinton’s night, a milestone for women in politics and civic life 95 years after the 19th Amendment guaranteed their right to vote. But by Wednesday morning, all eyes were on Mr. Sanders. Would he be generous or petulant? Would he let go or keep battling? At almost every turn, he was grudging toward Mrs. Clinton, passing up a chance to issue the kind of lengthy salute that many, in and out of the Democratic Party, had expected and craved. “It’s a blown opportunity to build bridges that are going to be extremely important in the fall,” said David Gergen, an adviser to four presidents, both Democratic and Republican. He worried that Mr. Sanders was becoming “a grumpy old man. ” The raw math is brutal and indisputable: Mrs. Clinton has not just crossed the threshold of 2, 383 delegates needed to secure the nomination. As of Tuesday night, she had succeeded in winning a majority of pledged delegates, a majority of the states that have held primaries, and the popular vote. This would be the time, under normal circumstances, for a primary rival to acknowledge insurmountable odds, pay tribute to a prevailing opponent and begin the work of stitching together a divided political party. That was the conciliatory message that a vanquished Mrs. Clinton delivered eight years ago to the day, on June 7, 2008, four days after Barack Obama had sealed his party’s nomination  —   a contest that was mathematically closer than the one with Mr. Sanders now. “We all know this has been a tough fight,” Mrs. Clinton said at the time. “But the Democratic Party is a family. And now, it’s time to restore the ties that bind us together. ” On Tuesday, she was effusive in her praise of Mr. Sanders and in her outreach to his supporters, mentioning him by name three times in her victory address in Brooklyn. “Let there be no mistake,’’ she said. “Senator Sanders, his campaign, and the vigorous debate that we’ve had about how to raise incomes, reduce inequality, increase upward mobility have been very good for the Democratic Party and for America. ’’ But Mr. Sanders, who calls himself a revolutionary, is openly skeptical of the traditions and expectations that govern the party whose nomination he covets. Throughout his campaign, he has regarded the Democratic Party itself with suspicion and distrust. Party unity, it seems, is the farthest thing from his mind at the moment. Far from backing down, Mr. Sanders promised to take his campaign to the Democratic convention in Philadelphia this summer, raising the possibility that he could remain in the race, without ever conceding defeat, until July. “We will continue to fight for every vote and every delegate we can get,” Mr. Sanders thundered. Declaring that the movement he has begun is “more than Bernie,” Mr. Sanders sounded at times messianic. “Our vision,” he said, “will be the future of America. ” Inside the airport hangar in Santa Monica, anger at Mrs. Clinton, and at the establishment she exemplifies, was visceral and abundant, overshadowing her electoral advantage and   night. Freddie Paull, a    filmmaker from Glendale, Calif. was not interested in milestones. He said he thought Mrs. Clinton was a crook. “She could be indicted literally tomorrow if the system is not corrupt,” he said. “I would love to see a woman in office,” he added. “But I do not want to see Hillary Clinton in office, because she has no honor. ” Should Mr. Sanders drop out, he said, he was prepared to vote for Mr. Trump. Amid chants of “Bernie or Bust” and loud boos as election results rolled in, Alison Bacon, an actress living in Los Angeles, assailed Mrs. Clinton for having proclaimed victory before the Democratic Party had formally bestowed it on her at the convention. “I think it’s absolutely unjust, undemocratic, ” she said. “What kind of example is that setting?” Of course, ending a campaign is always painful, especially one that so consistently defied expectations and openly challenged the political order. From its humble start in April 2015 outside the Capitol in Washington, in a sparsely attended and hurried announcement speech (“We don’t have an endless amount of time,” he warned the gathered reporters, “I have to get back”) Mr. Sanders built a rollicking national movement whose crowds,   and devotion upended the Democratic race. And Mr. Sanders was not merely a candidate to his supporters. With his Everyman appearance and unvarnished anger, he embodied the message that thrilled his followers: that it was time for working Americans to rise up and reclaim a country that was being corrupted by elites and their wealth. “When we began this campaign a little over a year ago, we were considered to be a fringe campaign,’’ Mr. Sanders said on Tuesday, adding wryly: “I think that has changed, just a little bit. ” But even as he acknowledged a “very, very steep fight” to winning his party’s nomination, he did not signal an end for now  —   still electrified, it seemed, by the crowds chanting his name. Howard Dean, a Democrat and a former governor of Vermont, can sympathize. “It’s very hard to concede,” he said. “You are tired. You are cranky. You’ve worked your butt off for two years. ” Nobody, Mr. Dean said, resisted ending a presidential campaign more than he did. Once a     he had a string of setbacks that left him feeling, by February 2004, much as Mr. Sanders does today: furious at an unfair system and determined to fight on. Then Al Gore called. Mr. Dean fulminated, uninterrupted, for 10 minutes, “ranting and raving,” he recalled. But Mr. Gore, schooled in the art of painful concessions, was blunt. “You know, Howard,” he said, “This is not really about you. This is about the country. ” Mr. Dean, taking the advice to heart, quit the campaign a few days later. “The minute he said it,” Mr. Dean recalled, “I looked like an idiot to myself. ” He said he wonders whether Mr. Sanders will heed the warning. “Bernie has changed politics, but his changes are not going to be realized unless he leads  —   and leading is not going to mean tilting at windmills at the convention,” Mr. Dean said. “He has to switch into the mode of a statesman. ” “You don’t get any points for carrying on or complaining about it,” Mr. Dean added. “You get points for sucking it up. ”'"}, "time": 1742563709.511954}