{"duration": 0.06957817077636719, "input_args": {"text": "'By Tim Hjersted / filmsforaction.org \\nIt\\'s hard to believe Films For Action has been around now for 10 years. From our early years focusing on local film screenings to our more recent years, focusing on raising awareness globally via our website and social media, our mission has been to provide a DIY alternative to the corporate mass media, which censors, erases, sanitizes, attacks and ignores the diverse voices of humanity in favor of a narrow spectrum of elite, faux left-right consensus that favors the status quo and puts the interests of profit over people and planet. \\nThe mass media claims to be neutral and strives to be objective, but it has always been anything but. FOX News is famous for claiming they\\'re \"fair and balanced\" - a line of propaganda so transparent it\\'s been mocked for years. But the deeper truth is that all media has some form of bias. The major news networks and newspapers of the old media - ABC, CNN, MSNBC, CBS and the New York Times, to name a few, all mask their bias for elite perspectives (both corporate and state) behind a veneer of \"objectivity.\" To present oneself as unbiased, while having bias is, of course, one of the hallmarks of any good, persuasive propaganda. \\nBut the old media is lying to itself for another reason. As one of our heroes, Howard Zinn once famously said, \"You can\\'t be neutral on a moving train.\" Neutrality in the face of injustice, in the face of racism, environmental destruction, corruption, colonialism, empire and plutocracy, cannot and will never be neutral. \\nMedia cannot be neutral on this moving train. Too much is at stake when we are quite literally facing a planetary emergency that is reaching its major turning point. We must pick a side. \\nDoes this mean Films For Action has bias? Yes it does. But it is bias rooted in the desire for justice. Our bias is rooted in our love for Pachamama, our Mother Earth, and all living beings. Our bias is rooted in our desire for a society that\\'s just, egalitarian, peaceful, healing and truly democratic in ways that the present system will never offer. That is the big difference between the old media and the new media. Whereas the old media feigns neutrality and objectivity while promoting a spectrum of thought that benefits their bottom line, the new media is transparent about its values and who it stands for. \\nIt is for this reason that Films For Action will forever stand in solidarity with Black Lives Matter, Indigenous First Nations people, Queer and Trans Folkx, and all other people and movements fighting oppression and struggling for collective liberation all over the world. \\nUltimately, our mission as a media network is simple. We\\'re here to support all of the global movements working to change the present system. We believe many hands make light work, and we need all of us helping our \\'movement of movements\\' in whatever way feels right for each other. We need both a diversity of tactics and a diversity of efforts, so the more we can support each other and see how our efforts complement each other, the stronger we\\'ll be. \\nThis idea that \"I am because you are\" - that your happiness is my happiness, that your suffering is my suffering - this is the guiding principle of love, of ubuntu that is what keeps our feet moving and our hearts in action. We are all one human family in relationship with each other and the rest of the community of life on Earth. So long as there is suffering in the world, our work is not done.'"}, "time": 1742562004.4361672}