{"duration": 0.058443307876586914, "input_args": {"text": "'People on both sides of the aisle are concerned that this election might pose an existential threat to society. But did you know there’s one particularly dangerous time of day to vote? It has nothing to do with voter intimidation  —   but everything to do with how you get to the polls. Hear about the hazards of Election Day  —   and other types of “Strange Danger”  —   on the debut episode of Tell Me Something I Don’t Know with its host, Stephen J. Dubner. In everything he’s done, Mr. Dubner has made it his mission to tell people about things they thought they knew but didn’t, and things they didn’t think they wanted to know but do. This manifesto has informed his “Freakonomics” books (authored with Steven D. Levitt, an economist at the University of Chicago) and his Freakonomics Radio podcast. Now Mr. Dubner has a new way to carry on that mission: hosting a New York Times podcast, Tell Me Something I Don’t Know. On each episode, contestants get up onstage, in front of a live audience, and present an “IDK”  —   “I don’t know”  —   which might be a strange fact, some groundbreaking research or a forgotten piece of history. Three celebrity panelists poke and prod the presenters, and ultimately choose a winner. It’s still factual and still journalism, but disguised as a game show. For our debut show, the theme is “Strange Danger,” with these panelists: Debora Spar, president of Barnard College of Columbia University and author of “Wonder Women: Sex, Power, and the Quest for Perfection. ” She speaks faster backward than you do forward. Anthony Marx, president of the New York Public Library and former president of Amherst College, who, in his youth, crossed a border illegally. Andy Zaltzman, comedian, political satirist and host of The Bugle podcast, who moonlights as a midwife very occasionally. Our “  Human Fact Checker” is Jody Avirgan, who hosts FiveThirtyEight’s Elections podcast. Election Day is just one of the strange dangers featured on this episode. We also have a sleep specialist from Atlanta with a theory on why we need our zzzzs. Also: An emergency room doctor describes the (shall we say) unusual actions of people about to freeze to death. And a Princeton professor tells us why supermarket shelves went empty in the early 1970s. (Hint: This was around the time Johnny Carson made a joke that led to   hoarding.) From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “Tell Me Something I Don’t Know” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for “Still Processing” and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742562287.1740253}