{"duration": 0.08586406707763672, "input_args": {"text": "'An appeals court in New Jersey on Friday threw out the conviction of the former roommate of Tyler Clementi, the Rutgers University freshman who killed himself six years ago after he was spied on while having sex with another man. The Appellate Division of the Superior Court of New Jersey in Newark overturned a lower court’s conviction of the   Dharun Ravi, on several counts of bias intimidation because of a change in state law. The court called for a new trial of Mr. Ravi on 10 other counts that included invasion of privacy and tampering with evidence. Mr. Ravi was convicted in 2012 in a case that drew international attention to the bullying of gay teenagers after Mr. Clementi jumped to his death from the George Washington Bridge. Mr. Clementi’s life and death were taken up by advocates for lesbian, gay, bisexual and transgender rights, and the case delved into the risks that are sometimes associated with coming out as Mr. Clementi had struggled with questions about his sexuality. Mr. Clementi’s suicide at age 18 came just days after he learned that Mr. Ravi had used a webcam to spy on him and had used social media to invite others to watch a sexual encounter in the dormitory room Mr. Clementi shared with Mr. Ravi. Mr. Ravi was not charged in his roommate’s death, and Mr. Clementi did not leave behind an explanation of what drove him to kill himself. Some of the charges on which Mr. Ravi was convicted fell under a state statute on bias intimidation that was unlike any other in the United States. The statute said defendants could be convicted if their victims “reasonably believed” that they were harassed or intimidated because of a characteristic such as race or sexual orientation. But last year, the New Jersey Supreme Court ruled that the   law was unconstitutional. The court threw out those charges and concluded that the evidence that prosecutors presented to prove them had “tainted the jury’s verdict on the remaining charges” and deprived Mr. Ravi of a fair trial. Lawrence S. Lustberg, a lawyer who argued that the   law was unconstitutional, said that the appeals court had little choice but to decide that the convictions reached using that statute were wrong. Having done that, it was “pretty straightforward” to conclude “that the whole trial was deeply infected by that error,” Mr. Lustberg said. The Middlesex County prosecutor’s office will now have to decide whether to appeal or to try Mr. Ravi again on the other 10 charges. After apologizing for his actions, Mr. Ravi served 20 days in jail on some of the charges and was ordered to pay $10, 000 to a program to help victims of hate crimes. But Mr. Clementi’s parents, Joe and Jane, rejected the “  apology” as a “  piece. ” They also criticized the judge, Glenn Bermen of State Superior Court, for not sentencing Mr. Ravi to jail for bias crimes, saying he missed a chance to highlight their seriousness. A spokesman for the Middlesex prosecutor’s office did not respond to requests for comment. Mr. Ravi’s lawyer, Steven D. Altman, also did not reply to requests for comment on Friday. Joe and Jane Clementi responded to the ruling with a statement released through the Tyler Clementi Foundation, which they founded to help end bullying. “In light of today’s decision, we will do what we encourage all people to do before they push that send button, and that is to pause and consider the implications of their message,” the statement said. “Does it encourage and build someone up or does it destroy and harm another person? Our world moves very fast which pushes us to be impulsively spontaneous and sometimes harsh. ” Reached by phone on Friday evening, Ms. Clementi said the prosecutors told her that they would notify her family next week about how they would proceed. She said she did not have an opinion on whether the litigation should continue. “Social media is a great tool, but it can be used for good and it can be used for harm and destruction,” Ms. Clementi said. “This just fosters my desire to keep moving and make sure that other people hear this and know this. ” The appeals court judges did not minimize their disapproval of what Mr. Ravi had done. “The social environment that transformed a private act of sexual intimacy into a grotesque voyeuristic spectacle must be unequivocally condemned in the strongest possible way,” the opinion said. “The fact that this occurred in a university dormitory, housing   college students, only exacerbates our collective sense of disbelief and disorientation,” it continued. “All of the young men and women who had any association with this tragedy must pause to reflect and assess whether this experience has cast an indelible moral shadow on their character. ”'"}, "time": 1742561812.15099}