{"duration": 0.06379270553588867, "input_args": {"text": "'Zimbabwe Headed for Hyperinflation…Again Posted on Home » Headlines » Finance News » Zimbabwe Headed for Hyperinflation…Again \\nWe’re sure this time will be different… \\n\\nFrom Simon Black, Sovereign Man : \\n\\nSome people just don’t learn. \\nAfter becoming the most famous case of hyperinflation in modern history roughly ten years ago, Zimbabwe is about to have another go at conjuring paper money out of thin air. \\nI’m sure this time will be different. \\nYou know the story. Starting in the late 1990s, the Zimbabwe government’s policies under Robert Mugabe began to have some devastating effects. \\nHe confiscated private property from established (mostly white) farmers and redistributed the land in very tiny tracts to his supporters, most of whom had no experience in farming. \\nUnsurprisingly, Zimbabwe’s once-booming agriculture exports collapsed almost overnight. \\nThis destructive, authoritative control pervaded across nearly all industries, and by the early 2000s, the economy was in dire straits. \\nUnemployment and inflation skyrocketed. \\nIn 2001 alone, retail prices doubled. But that was just the beginning. \\nInflation rose so quickly that the government was having to constantly print new denominations of currency– thousand Zimbabwe dollar notes, then ten thousand Zim dollar notes… then million dollar notes… even trillion dollar notes. \\nBy 2007, the hyperinflation was so bad that prices were doubling roughly every day. \\nMy friends here in Zimbabwe tell me stories of going out for drinks at a bar; they’d drink a few beers for an hour or so, after which the bartender would inform them that the price of a beer had just increased by 50%. \\nPeople learned very quickly to spend money as soon as possible, and long lines formed at grocery stores as an entire nation desperately tried to turn their paper currency into something useful. \\nEven a simple loaf of bread became a store of value. \\nOne friend told me how he would buy a loaf of bread in the morning with his spare change, and then sell it in the afternoon so that he would have enough money to pay the bus fare back home. \\nSome economists estimate that Zimbabwe’s hyperinflation peaked at more than 500 BILLION percent– an incomprehensible figure unless you’ve lived through it. \\nIn 2009 it all ended. The government stopping printing money, and Zimbabwe became a ‘hard currency’ economy. \\nUS dollars, euros, pounds, South African rand, and even Chinese renminbi have been circulating here ever since; merchants and consumers basically use whatever currency they can to engage in transactions. \\nEssentially there is no Zimbabwe dollar anymore. \\nBut that hasn’t solved any of the country’s problems. \\nIn the late 1990s, Zimbabwe’s GDP was roughly $30 billion. Today it’s just $13.5 billion, than $1,000 per capita. \\nIndependent agencies estimate the unemployment rate here at over 80%, and the average worker makes just a few dollars per day. \\nIt’s not hard to understand why. Taxes, fees, and absolutely insane regulations abound in Zimbabwe. \\nAnd even at age 92, Robert Mugabe still maintains dictatorial power and a tight (albeit arthritic) grip over the economy. \\nTo give you an example, the mere possession of a radio in your car (if you’re lucky enough to be able to afford a vehicle) requires an annual fee of $50. \\nThe same applies if you have a television set in your home. \\nMany imports have been banned outright (leading to major shortages given that domestic production is practically nonexistent). \\nAnd whatever few goods are allowed to be imported typically come with a tax bill of 100%. \\nA friend of mine is in the farming business here in Zimbabwe; every time he tries to invest and improve production, he’s punished with a string of exorbitant taxes on capital and equipment. \\nAnd it’s not just the taxes and fees… it’s the mountains of paperwork and bureaucracy that are required across dozens of offices and agencies. \\nThis is literally the exact opposite of what any government should do, especially one that’s experiencing such a prolonged depression. \\nBut apparently these politicians have memories like goldfish. Because their grand solution now is to go back to the roaring 2000s and start printing money again. \\nThey’re calling them “bond notes”, and as you can imagine, the government has already promised that they’ll exercise restraint and print these new bond notes in very limited quantities. \\nOf course, that’s the same thing they said 15 years ago. \\nAnd it’s the same thing that every government and central bank says when they embark on an initiative to print money. \\nThis is such typical thinking, and sadly not limited to Zimbabwe \\nPeople in power across the world, including in North America and Europe, rely on this incredibly limited playbook. \\nThey think they can engineer prosperity by going into debt and conjuring money out of thin air. \\nThey think they can legislate and regulate their way to a quality healthcare or education system. \\nAnd when the majority of their initiatives fail, or even have the exact opposite effect as intended, they don’t learn from their mistakes. \\nThey simply print more money, pass more laws, and go deeper into debt. Do you have a Plan B? \\nIf you live, work, bank, invest, own a business, and hold your assets all in just one country, you are putting all of your eggs in one basket. \\nYou’re making a high-stakes bet that everything is going to be ok in that one country — forever. \\nAll it would take is for the economy to tank, a natural disaster to hit, or the political system to go into turmoil and you could lose everything—your money, your assets, and possibly even your freedom. \\n2017 Gold Pandas and 2017 Silver Pandas Are Now Available! Secure Your 2017 Panda Coins Today at SD Bullion!'"}, "time": 1742628457.210172}