{"duration": 0.1732625961303711, "input_args": {"text": "'Wakame Seaweed Salad May Lower Blood Pressure VN:F [1.9.22_1171] Close   Wakame Seaweed Salad May Lower Blood Pressure \\n  \\nI used to think of seaweed as just a beneficial whole food source of minerals—like iodine, for which it is the most concentrated dietary source. And, indeed, just a half-teaspoon of mild seaweeds, like arame or dulse, or two sheets of nori a day, should net you all the iodine you need for the day. \\nBut, “the intake of seaweeds is advised” not only as a whole food source of iodine, but also, evidently, “for the prevention of lifestyle-related chronic diseases.” Based on what? \\nWell, you’ll see this kind of reasoning; the Japanese live long, and they eat seaweed. And so, they speculate that seaweed might have something to do with it, based on suggestive reports. But, when you see lists, like this, of all the supposed biological activities some food has, you want to know is this based on clinical data (meaning on actual people) or so-called preclinical data (based on test tubes and lab animals)? When a study like this is published, talking about the “Effects of seaweed-reconstructed pork diets” on rats, what do you do with that information? Seaweed is one of the ingredients they’re trying to use to improve the “image” of meat products. So, they try to add grape seeds, or flax seeds, or walnuts, or purple rice or, whatever this is. I had to look it up: thong-weed. How’s that for an image booster? \\nYou can look at epidemiological studies (meaning looking at populations). And, indeed, Japanese preschoolers who eat seaweed tend to have lower blood pressures, suggesting seaweed might have beneficial effects—which would make sense, given all the minerals and fiber. But, you can’t prove cause and effect with that kind of study. Maybe it was the other components of the diet that went along with the seaweed-eating. \\nIt’s even harder to do these kinds of studies on adults; so many people are on high blood pressure medications. University of Tokyo researchers took an innovative approach by comparing the diets of people on low-dose, versus high-dose, versus multiple blood pressure medications. And, although they all had artificially normalized blood pressure, those that ate the most fruit and sea vegetables tended to be the ones on the lower doses—supporting a dietary role for seaweed. But, why not just put it to the test? \\nA double-blind crossover trial found that seaweed fiber lowered blood pressure, apparently by pulling sodium out of the system. I know they couldn’t use real seaweed, because then you couldn’t fool people with a placebo; but, why not just, like, put whole powdered seaweed in pills? This was finally attempted, ten years later. \\nCompared to doing nothing, they got beautiful drops in blood pressure. But, if you look deeper into the study, they desalinized the seaweed—meaning they took out two-thirds of the sodium naturally found in it. So, that still doesn’t tell us if eating seaweed salad is actually going to help with blood pressure. What we need is a randomized controlled trial with just plain, straight seaweed. But, no one had ever done that study—until this study out of Ecuador. \\nSix grams of wakame, natural sodium and all, led to a significant drop in blood pressure, especially in those who started out high. Side effects were all minor, and what one might expect increasing fiber intake. And, the nice thing about whole food, plant-based interventions is you sometimes get good side effects as well, such as the resolution of gastritis—stomach inflammation that they’d been having—as well as the disappearance of chronic headaches.   Close Sources Video Sources \\nMy next video, Salt of the Earth: Sodium and Plant-Based Diets , will further address the sodium question. \\n  Roxy \\nI’ve read that only asians, for the most part, have the bacteria (macrobiome) to properly digest seaweed. And by properly digest I mean….”to properly breakdown the seaweed to allow usability of the nutrients and such in seaweed.” \\nSome sort of genetic trait asians have? Evolutionary? \\nTruth in this? Joe Caner \\nIt would seem that gut flora has more to do with what one eats as opposed to genetic factors. Asian populations are better able to handle seaweed in their diets precisely because they eat more seaweed so their gut flora adapts accordingly: \\n“Recent studies analyzed the gut flora of people across multiple countries and continents and identified two enterotypes. Enterotypes correlate with our diet and can change as our diet changes. Diets rich in animal protein and saturated fat are associated with the Bacteriodes enterotype, while diets rich in healthy carbohydrates are associated with the Prevotella enterotype.” http://nutritionfacts.org/topics/microbiome/ Roxy \\nSo did the Okinawans have both of these types of enterotypes? How about some of the other cultures (longest lived) that include animal products/fish in their diet? Do they also have a healthy, varied enter type that of both baceriodes and prevotella? Roxy \\nAnd, apparently, the seaweed/gut bacteria macrobiome evolved over thousands and thousands of years, unlike, I think, the enteretype issue you are referencing that has more to do with our gut bacteria changing quickly, daily, weekly, due to the diet. Apparently seaweed might be a different issue, and for whatever reason takes a culture thousands of years to adjust. Richard W \\nPerhaps it is beneficial but, like fish oil, seaweed probably comes with a dose of pollutants too. Roxy \\nI am curious about all the plastic-residue showing up in fish….and if seaweed would then accumulate these plastics-chemical residues. Ishay \\nUnfortunately, most natural food will contain at least trace levels of pollutants, even those grown organically in ‘natural’ soil. It doesn’t mean, however, that this is always a palpable cause for concern. Theoretically, even though all seas and oceans are polluted to a degree, sea vegetables are low in the food chain, so there is less bio-accumulation of most contaminants. \\nThe biggest concern in seaweed is inorganic arsenic. Hijiki is known to have high, potentially harmful levels, but moderate consumption of most other sea vegetables, including wakame, shouldn’t pose a significant risk: \\nI don’t know if seaweed that’s grown in indoor tanks is commercially available (similar to microalgae used for DHA/EPA pills), but that might become a safer alternative one day. Wade Patton \\nI shared the transcript. nonyabizzz \\nok, but the seaweed salad shown obviously has a sizable amount of oil on it, possibly counteracting some of the health benefits… \\nThe frame rate seems off in this video? rjs \\n  small study that hasn’t been replicated (with seaweed that hasn’t been desalinized). Given the high sodium content of commercially available seaweed, I still feel reluctant to try it. \\nI’m already doing as many lifestyle things as I can to lower my BP such as eating a whole plant vegan diet, restricting sodium, drinking hibiscus tea, consuming fax seeds daily, avoiding BPA, doing daily aerobic exercise, and exercising with hand grips. Anyone have any other ideas? Matthew Smith \\nHello! You are doing everything exactly right. Dr. Greger suggests “beans, whole grains, other legumes, beets, beet juice, cocoa, flaxseeds, greens, hibiscus tea, purple potatoes, and the seaweed, wakame,” in his hypertension page. Have you tried Vitamin D and Magnesium (watch out for diarrhea)? How long have you been on a low sodium diet? Since they add Iodine to salt, I have avoided it, and I developed in my opinion low Iodine levels. I had just one half teaspoon of salt and could no longer feel my heartbeat in my chest. I have since fallen in love with some salt. It takes at least a gram of salt a day to be healthy. I love Iodine. Dr. Greger recommends it. Beware of its heart benefits. Doctors say it is ideal to not be able to feel your heartbeat. Perhaps it is Iodine that modulates this. Darryl \\nPotassium Blood pressure response to changes in sodium and potassium intake: a metaregression analysis of randomised trials \\nSodium reduction (median: -1.7 g/d) was associated with a change of -2.54 mmHg in systolic blood pressure…Corresponding values for increased potassium intake (median: +1.7 g/d) was -2.42 mmHg \\nIn the context of a WFPB diet, increasing potassium means favoring tubers and beans over cereal grains as staple calories, more greens & tomatoes, and using “lite-salt” (50/50 mix KCl & NaCl) where possible. I mail-order sun-dried tomatoes (the most concentrated potassium source) in bulk, and they’re my main “dried fruit”. Previous Video'"}, "time": 1742561878.9081094}