{"duration": 0.09262871742248535, "input_args": {"text": "'Written by Peter Van Buren Saturday November 19, 2016 In the end, the emails mattered. How much they mattered — how many votes went to Trump, how many would be-Clinton supporters stayed home, how many voted third party — we’ll never know.Clinton supporters were surprised the emails mattered at all, because they had been fed a regular and often fully-factually wrong diet by the majority of the media. There was some good reporting on what the emails meant, and how classification works, but it was almost all on right-of-center websites Clinton people did not read, and blithely dismissed as biased when the sites were brought to their attention. And yeah, sometimes things got a bit too partisan in tone, but the facts were also there.After holding a security clearance for some 23 years, I tried, for some 18 months, to write as intelligently as I could about the damn emails. I tried to explain, in detail, what the whole thing meant, and that it was a significant problem for Clinton. Not bragging, just telling. If you’d like to read back through what I’ve had to say and judge yourself, here it is . There’s a lot there, so if you just want a taste, here .But I do want to make this as clear as possible, so… — All (not insignificant) questions of legality aside, the emails were about judgement, especially poor judgement. Clinton skirting/violating all rational thought and rules to set up a fully independent email server unprecedented in scope and scale, bypass federal records laws and the requirements of the Freedom of Information Act, and establish no oversight on the flow of classified information, is not the level of judgment a president must display. Yeah, I know, Trump, but this is about why Hillary Clinton emails mattered and whether anyone likes it or not Trump is the president-elect in part because of the emails.— The most basic tenant of the classified world is that you simply do not expose classified material on an unclassified system. That’s why classified systems exist. This is at the “duh” level. Opinions differ on what should be classified, over-classification is a big problem, yada yada, but those issues are not resolved by circumventing the classified world. To more than a few voters, that seemed obvious. It also again speaks to judgement. There were many experts who explained this, but it seems most Clinton supporters listed to John Oliver instead.— Nobody (the Republicans, the FBI, etc.) created any of the core mess except Hillary Clinton. She then seemingly took every chance to dig the hole deeper, shifting her explanations, allowing information to drip drip drip out over the length of the campaign, and all the rest until everything collapsed around the pathetic human wreckage of Anthony Weiner. — As an added problem, “the emails” in many voters’ minds became shorthand for a range of issues related to trust, ethics, and propriety, including the Clinton Foundation, pay-for-play, and the Goldman-Sachs speeches. — Clinton’s opponents inside and outside the government took advantage of the emails — kinda what opponents do — but none of that would have been possible if Clinton had not created all of this herself. Take this campaign, put up Sanders or Biden instead of Clinton, subtract out all of the negatives associated with the emails, and run a little thought experiment on how many votes that may have been worth. Reprinted with permission from WeMeantWell.com . Related'"}, "time": 1742563520.937836}