{"duration": 0.05725884437561035, "input_args": {"text": "'Pop singer Joy Villa arrived Sunday at the 2017 Grammy Awards wearing a simple white outfit —   until she removed it on the red carpet, revealing a dress in the style of Donald Trump’s “Make America Great Again” presidential campaign posters. [Before she arrived at the Grammys, Villa shared a “sneak peek” of the decoy outfit, as well as a message that her “whole artistic platform is about LOVE!”   Sneak Peek  …    😱😝🎉💋#grammys2017 #grammys #joyvillagrammys #joyvilla #singerlife #singersongwriter #singer #style #grammysfashion #blessings #beautiful, A photo posted by Joy Villa (@joyvilla) on Feb 12, 2017 at 12:30pm PST,   💥My whole artistic platform is about LOVE! 🎶💕💋 I couldn’t be where I am today without the love and tenderness of those beautiful supporters and friends around me. Thank you ❤️ I hope you enjoy tonight’s @grammysawards2017 and remember to forget your problems and focus on your future! You are infinite and beautiful and no one can stop you but you. 💋So go out and celebrate yourself as a winner no matter what, together with those you adore! #happygrammysday #blessings #beautiful #love #grammys2017💝 #happyvalentinesday #celebration #style #postivevibes #love, A photo posted by Joy Villa (@joyvilla) on Feb 12, 2017 at 12:40pm PST,  However, love was the last thing on the minds of many leftists reacting to the young star’s fashion statement: . @Joy_Villa is just doing this for attention.  let’s give her some. screw you @Joy_Villa pic. twitter.   —   Jay Franzone (@JayFranzone) February 12, 2017,  @Joy_Villa you’re cancelled,  —   steven j. horowitz (@speriod) February 12, 2017,  Here’s the coon with the Trump dress. I’m truly outdone. @Joy_Villa,  —   . (@eIectricgold) February 12, 2017,  But  …     why, Joy Villa? #GRAMMYs pic. twitter.   —   TV Guide (@TVGuide) February 12, 2017,  Attention seeking @Joy_Villa is cancelled #GRAMMYs pic. twitter.   —   Karen Civil (@KarenCivil) February 12, 2017,  I think I speak for everyone when i say ”who the fuck is Joy Villa and why is she so thirsty?”  —   Damian Holbrook (@damianholbrook) February 12, 2017,  Uh oh, someone’s been at Joy Villa’s Wiki  …     pic. twitter.   —   Alex Hannaford (@AlHannaford) February 12, 2017,  Everyone please be aware that Joy Villa is the worst. pic. twitter.   —   Sammy Nickalls (@sammynickalls) February 12, 2017,  who the fuck is Joy Villa and why is she wearing that godawful Trump dress at the #Grammys??  —   Kevin Allred (@KevinAllred) February 12, 2017,  Villa has a modest entertainment résumé and social media following where she promotes herself as an actress,   and vegan bikini bodybuilder. In past years, the entertainment world has ranked her as one of the “Worst Dressed” at Grammys for skimpy and outlandish outfits. In a recent vlog, Villa shares how she overcomes much of the criticism she has received. She encourages aspiring performing artists to “tell the haters to eff off, because they have no say over your life  —   and as a performing artist, people are going to criticize you ’til you’re black and blue. ” '"}, "time": 1742563725.1133823}