{"duration": 0.04749798774719238, "input_args": {"text": "'By Paul Craig Roberts on October 18, 2016 \"...it would be extremely dangerous to have in the White House a person susceptible to uncontrollable rage\" HILLARY MELTDOWN! THROW A GLASS OF WATER AT THE FACE OF HER ASSISTANT DURING RAGE AT MATT LAUER’S UNAPPROVED EMAIL QUESTION DURING NBC PRESIDENTIAL FORUM \\nby Paul Craig Roberts \\nUntil I viewed the video in the URL below, I had concluded from my time spent with Republicans that the Republican Party was more corrupt than the Democratic Party. But after watching this 16 minute video report, which seems too much to be faked, the Democratic political establishment —not necessarily the Americans who vote Democrat—seem to be corrupt beyond the meaning of the word. Make up your own mind. \\n“In this explosive new video from Project Veritas Action — a Democratic dirty tricks operative unwittingly provides a dark money trail to the DNC and Clinton campaign. The video documents violence at Trump rallies that is traced to the Clinton campaign and the DNC through a process called birddogging.” \\nPublished on Oct 17, 2016 Matt Lauer , NBC \\nThis second video report — purports to be based on reports by the NBC TV crew that filmed Hillary’s September 7 interview by Matt Lauer. \\nLauer departed from the pre-agreed script, and the result was a meltdown by Hillary following the interview. \\nThis 8 minute report confirms Secret Service agent Gary Byrne’s account of Hillary’s explosive, uncontrollable temper in his book Crisis of Character. \\nEx-Secret Service Agent: “People Need to Know The Real Hillary Clinton And How Dangerous She Is” \\nFormer Secret Service officer Gary Byrne, author of the new book Crisis of Character , which examines Hillary Clinton’s conduct under his watch, appeared on FOX News Channel’s Hannity. \\nIf these reports are true, at this time of heightened tensions between Washington and the two other major nuclear powers, it would be extremely dangerous to have in the White House a person susceptible to uncontrollable rage, especially a person who would be staffed with neoconservative warmongers. Architects of “Regime Change” wars \\nA vote for Hillary could be a vote for nuclear war and the end of life on earth. \\nSee: Hannity Published on Oct 17, 2016. \\nJames O’Keefe video exposes Democrats inciting Violence at Donald Trump Rallies, Newt Gingrich interview with Sean Hannity as a Reaction to James O’Keefe Video: \\nAlso see:'"}, "time": 1742564353.8128254}