{"duration": 0.2053666114807129, "input_args": {"text": "'The standard for   artistic statements in pop music is now so high that you need a pilot’s license to compete with the Beyoncés, Kanyes and Kendricks of the world. But when Janet Jackson craved ascent, she didn’t go to flight school. She went to Flyte Tyme. That was the Minneapolis production company Jimmy Jam and Terry Lewis operated and where the three came up with “Control,” Ms. Jackson’s third record and the first of their subtly strange, sonically complex thematic carnivals. The album turned 30 in February, peaked in popularity right about this time that year (hitting No. 1 in July) and still sounds today as much like 1986 as it does 2056. Some producers make hooks. These three made wedgies. “Control” is a work of confidence, cleverness and justifiable irritation. It’s also full of weird, amazing sounds that, 30 years later, it’s easy to take for granted as the way   pop music has always been: polished in a factory to a gemlike gleam. But most of the nine songs on this album  —   nine songs!  —   weren’t just   they were performed by almost entirely aggressive, attitudinal heavy machinery that was new for both Top 40 and the outer limits of mainstream RB. Meanwhile, for any number of reasons (that Super Bowl scandal, the long shadow of other stars, our cultural amnesia) the woman behind the wheel has been demoted to the back seat. And that, of course, warrants a correction. Ms. Jackson was around 20 when she entered the recording studio after a stint as a sitcom star (poor Penny on “Good Times,” richer Charlene on “Diff’rent Strokes”) an annulled marriage and a split from her notoriously oppressive father, Joe. So a decree was in order: “When it’s got to do with my   want to be the one in control. ” That’s from the opening song, “Control,” which begins with a spoken proclamation of  : “This is a story about control. ” Jimmy Jam and Mr. Lewis orbited Prince, and that opening has always sounded like a counterpoint to the mania of “Let’s Go Crazy,” which had just completed devouring America the year before. In the face of collapse, Prince demanded chaos. Ms. Jackson’s idea of anarchy was, well, control. In the middle of the title track, Ms. Jackson sings, “First time I fell in   didn’t know what hit me,” and you can hear a car screeching into a collision. The next song starts with a demand: “Gimme a beat!” And the beat she gets is like no beat you’ve heard. It’s a bunch of drums punching themselves silly, then five notes of metallic, pipelike noise, joined by a strange, constant click. This is “Nasty,” and its violence is delicious. If the song has one climax, it must have four. Here was America’s Penny sounding like the proudly nasty funk artist Millie Jackson (no relation not biologically, anyway). The song is part antichauvinist call to arms, part street fight, part “had it up to here” exasperation, part wink  —   each a mood Ms. Jackson would deploy for most of her career. That constant click starts to make a lot of sense. It’s the first No. 3 hit built around the sucking of teeth. For two happy weeks, my favorite song on “Control” was also America’s. “When I Think of You” hit No. 1 in October 1986, but it began its hike toward the top in July and sounds the most like summer. It’s wearing the lightest clothes of any of the tracks and it dons them very slowly: first a plink of keyboard, then some jabs of bass, drums and percussion, hopscotching vibes, and, finally, a blast of artificial horns that sound an alarm that Ms. Jackson is going to do some of her prettiest singing. Hearing her here is like being able to see the seafloor from the shore. Ms. Jackson has a soufflé of a voice  —   thin, delicate, pleasurably sweet. Sometimes she, Jimmy Jam and Mr. Lewis could bury it with layers of sound, but not here. After about three minutes and 18 seconds of straightforward, daydreaming pop, she says, “Break,” and the bottom falls out, leaving just the keyboard and percussion, and a new, primal energy takes over. Then the bass reappears, some chanting builds to a squawking wail, the music explodes, and Ms. Jackson laughs and sings, “Feels so   I think of you. ” Seconds later, the song’s over. So what’s it about? “You,” but probably what Ms. Jackson does when she, uh, thinks of you. It makes sense to admire “Control” as an album about independence. It’s a compelling tale of freedom in which Ms. Jackson liberates herself from the demands of suffocating men to make her own demands. She granted herself permission to define her sexiness. Even now, the excitement of “When I Think of You” is the sight of a cherubic Janet Jackson   across a soundstage in a silky,   jacket and bustier, matching pants, heels, that hoop earring with the key on it, and the mane of three lions. That was also the summer of Madonna’s “Open Your Heart” video, in which she seduced with just the bustier, some fishnets and a peep show. Despite, or more likely because of, all those clothes, Ms. Jackson’s dancing seemed all the freer. One reason to revisit “Control,” aside from its general excellence and a milestone anniversary, is to consider Ms. Jackson’s value as a pop artist, which doesn’t happen often enough. Her most recent album, “Unbreakable,” hit No. 1 last fall, but the gleam of her stardom never recovered from that evening in 2004 when Justin Timberlake ripped open her costume, exposing her breast at the Super Bowl. The logistics and intent of the moment are still ambiguous Ms. Jackson publicly apologized. It didn’t matter. The stain had set. She went from a steady maker of big hits to some kind of postlapsarian   seemingly overnight. But it still feels less like she’s fallen and more like she was pushed. The album she released soon after the Super Bowl, “Damita Jo,” remains underrated as a result. But so does Ms. Jackson, who’s made several great records, including “The Velvet Rope” (1997) and “All for You” (2001). The punitive racial and gender politics of the halftime show partially explain her diminishment. She’s spent the latter part of her career as a vital member of Tyler Perry’s movie troupe and opted for more discreet attire than she used to. Another explanation is that her natural demureness and inclination toward privacy have made her seem more reclusive in a   age in which an artist like Madonna  —   or her and Ms. Jackson’s proliferating progeny  —   seems more omnipresent. Really, though, the narrative history of popular music tends to narrow with distance, regardless of how many tens of millions of albums you’ve sold or how vertiginous your fame. We often think of pop’s top echelon in terms of Prince, Madonna and Ms. Jackson’s brother, Michael, each of whom tends to overshadow what makes Ms. Jackson crucial. For one thing, she was as necessary as Michael Jackson and Prince for the integration of MTV. And she should have been: She was the superior   artist. Only Madonna was keener about the power of  . Ms. Jackson’s hits might be less distinctive, too, in collective hindsight. I rarely hear her at parties, even at nostalgic ones. There is, apparently, no “1999,” “Holiday” or “Wanna Be Startin’ Somethin’” in her trove. It could just be that for a song as fed up as “What Have You Done for Me Lately” or as fun to sing along to as “Escapade,” from “Rhythm Nation 1814” (1989) the music might just be too quirky to lure you to the dance floor. So say certain D. J. s and   algorithms, anyway. Eventually, Ms. Jackson made blackness an important part of her music and presence, too. Her “Janet. ” album (1993) includes a song with Chuck D called “New Agenda,” in which she denounces racism and declares that, as an   woman, “I stand tall with pride. ” When “Control” reached the top of the Billboard 200, the second and third positions were held by Patti LaBelle and Whitney Houston. And Tina Turner had just mounted a legendary second act as a solo artist. America seemed O. K. with black women dominating different areas of pop music. Ms. Jackson just inserted politics. She recorded “New Agenda” the year after the Rodney King beating and the riots that followed. The only difference between then and now is that Ms. Jackson would have built a concept video around the song and put it on HBO. As it is, the premiere of her   “Rhythm Nation” video was pretty much the “Lemonade” of its day. Thirty years of “Control” is a useful, if contrived, excuse to argue for Ms. Jackson’s necessity, especially as someone who knew the power of an image. Take that hoop earring with the key. It was as iconic as L L Cool J’s Kangols, George Michael’s stubble and Steven Tyler’s scarves. It was the perfect symbol for both a project called “Control” and a woman whose guard has gone down and up over the decades. People thought that key was a potential invitation, something sexy. But what if it was just  ? What if she was never looking for someone to give it to? What if she was her own lock?'"}, "time": 1742564600.0972066}