{"duration": 0.05478954315185547, "input_args": {"text": "'Israeli official secretly visits Dubai: Report By Press TV on November 4, 2016 Israel envoy to the United Nations (UN) Danny Danon (R) and a purported Emirati official (file photo) \\nA high-ranking delegation from the Israeli regime has secretly traveled to the United Arab Emirates (UAE), even as the Emirati government has no diplomatic relations with Tel Aviv. \\nDanny Danon, the Israeli regime’s ambassador to the United Nations (UN), made a three-day secret visit along with his staff to Dubai to participate in a development conference organized by the UN, reported the Israel Channel 2 television station on Thursday. \\nThe UN conference was held in Dubai from October 30 to November 3. \\nThe report said Danon’s visit to the UAE was conducted “under heavy secrecy and tight security so as not to arouse the anger of UAE citizens.” \\nThe Emirati government does not officially recognize the Israeli regime, which would mean that Israelis cannot obtain passports to travel there. However, Emirati authorities reportedly provided special visas for Danon and his staff to enable their trip, reported the Israeli channel. \\nBarring Jordan and Egypt, which have open, diplomatic relations with the Tel Aviv regime, Arab governments claim that they do not recognize Israel. They say they would normalize relations with the Tel Aviv regime only when it reaches a deal with the Palestinians, whose lands the Israeli regime has occupied. \\nHowever, there have been numerous reports and public statements indicating covert ties between the Arab governments and Israel. \\nIn Mid-March, Israeli Prime Minister Benjamin Netanyahu said his regime’s relations with regional Arab countries was “ dramatically warming .” Moshe Ya’alon, Israel’s minister of military affairs, also in February pointed to open channels between the regime and Arab states. \\nAlso in July, a Saudi delegation headed by a former military general visited Israel and met a senior Israeli foreign ministry official and a number of Knesset members. \\nAnwar Eshki, the Saudi former general, met Israel’s foreign ministry director general Dore Gold, and Yoav Mordechai, who coordinates the Israeli regime’s activities in the occupied territories. \\nIn November 2015, AP cited an Israeli foreign ministry spokesman as saying that Tel Aviv would “soon” open a “permanent mission” in Abu Dhabi. The mission, it said, would operate as part of the International Renewable Energy Agency (IRENA) based in the Emirati city. Related Posts:'"}, "time": 1742564137.489987}