{"duration": 0.14380812644958496, "input_args": {"text": "'Don’t worry about Hillary: BuzzFeed confirms she remained totally super awesome while under siege Posted at 5:54 pm on October 29, 2016 by Brett T. Share on Facebook Share on Twitter \\nWell, this wasn’t altogether unexpected. After news broke Friday that the FBI had uncovered new information pertinent to its investigation into Hillary Clinton, it wasn’t long before reporters, as predicted, began filing stories about Republicans “pouncing” on the news . \\nThat’s all well and good — everyone knew those mean Republicans would attack. As always, Clinton put up a brave front, challenging the FBI to go public with whatever it had, possibly including classified documents related to an ongoing federal investigation. \\nBut did anyone think to really check on the Democratic candidate? How was she holding up behind the scenes? Pretty well, it seems. BuzzFeed’s Ruby Cramer provided readers with an insider’s look at Hillary’s super-weird day under siege. Your guide to the *weirdest* yet most totally normal day on the plane w/Clinton—a candidate unfazed when under seige https://t.co/i3xwJ1T4Bn \\n— Ruby Cramer (@rubycramer) October 29, 2016 \\nSo relax, everyone: there’s no need whatsoever to lose sleep on Clinton’s behalf. Even while besieged by the continuing fallout of a scandal of her own making, she was “almost bizarrely unfazed by crisis.” @rubycramer @maggieNYT this woman is tougher than any man i no of \\n— allen stubbs (@NASTY4HRC) October 29, 2016 \\nOMG, right? Totally. @rubycramer \"a candidate unfazed when under siege\" \\nThat\\'s what I like. \\n— Jaymes Winn (@jaymeswinn) October 29, 2016 @rubycramer @maggieNYT This woman is a rock of strength! That is the mark of a true leader! \\n— M. Stein (@MStein2016) October 29, 2016 @rubycramer @BuzzFeedNews good piece. She\\'s made of steel, our Hillary.'"}, "time": 1742562183.9780278}