{"duration": 0.05234217643737793, "input_args": {"text": "'SAN FRANCISCO  —   During the long presidential campaign, the most resolutely   part of the country was the narrow strip of land south of this city. Silicon Valley shunned the Republican candidate and all he stood for. It mobilized its technology for his defeat and warned of dire consequences if he should somehow win. Now that the impossible has happened, tech’s day of reckoning is here  —   next Wednesday afternoon, to be precise. The   is summoning leaders of the biggest tech companies to New York for a   discussion, according to a transition official who has seen the invitations. The agenda is undisclosed and perhaps still under consideration, but it is unlikely to produce the sort of love fest that existed between President Obama and Silicon Valley. Tech culture celebrates disruption as the tool that produces a better future for all. Many of Donald J. Trump’s supporters, on the other hand, see it as pushing them down. How to reconcile these views is the task of Peter Thiel, the billionaire investor and Facebook board member whose role is to formulate a tech policy for the new administration. Mr. Thiel secured this position by making a contrarian bet on Mr. Trump’s candidacy, which paid off. The   invitations are from Mr. Thiel Jared Kushner, Mr. Trump’s    and Reince Priebus, the incoming chief of staff. If the past is any precedent, Mr. Trump might suggest or even order the tech overlords to do what he thinks necessary. The   met on Tuesday with Masayoshi Son, the founder and chief executive of SoftBank Group, which recently created a new investment fund that could invest up to $100 billion in tech companies worldwide. Afterward, Mr. Trump posted on Twitter that Mr. Son agreed to invest $50 billion in the United States and create “50, 000 new jobs. ” Two Silicon Valley chief executives appeared willing to test the waters: Safra Catz, of the software maker Oracle, confirmed her participation in next week’s meeting with Mr. Trump. So did Chuck Robbins of Cisco Systems, the networking gear maker. Representatives for other leading tech companies, including Amazon, Microsoft, Facebook, Google and Apple, declined to comment. A Trump spokeswoman did not immediately reply to a request for comment. Mr. Thiel has said in interviews that the benefits accruing to tech investors like himself should be more widely shared outside a few ZIP codes in New York and around San Francisco. One role of the meeting is to spur ideas for changing this situation. A spokesman for Mr. Thiel declined to comment. In Apple’s case, Mr. Trump has said he told its chief executive, Timothy D. Cook, in late November that he wants the company to build “a big plant” in the United States  —   or even better, “many big plants. ” Apple itself does not do any manufacturing in the United States. A contractor, Flex, manufactures   desktop computers on its behalf in Austin, Tex. employing about 2, 000 people. A vast majority of Apple’s production is in China, where there is an enormous ecosystem devoted to it. Many economists say that reproducing such an interlocking web of suppliers here would push the cost of iPhones up considerably. Mr. Trump also tangled with Jeff Bezos, the founder and chief executive of Amazon, during the campaign, saying that Mr. Bezos has “a huge antitrust problem because he’s controlling so much. ” Amazon is overwhelmingly the dominant force in  . In its original business of books, for example, it is by far the most important retailer of both physical and electronic books. In several spheres, it is developing technology that eliminates the middleman  —   in other words, jobs. This week, the company debuted a new system for operating stores without cashiers. How much Silicon Valley is reconciling itself to the thought of President Trump is a complicated question. Last week, David O. Sacks, the chief executive of the   software   Zenefits, said he was stepping down after having had discussions about helping Mr. Trump’s transition team. Mr. Sacks is a longtime associate of Mr. Thiel’s. If there are some overtures being made in Silicon Valley, there are also some lines being drawn. Chris Sacca, a prominent venture investor, said there was only one path for those attending next week’s meeting: defiance. “If an attendee wants to maintain their integrity and preserve their company’s ability to recruit the best talent, then there is only one purpose for a trip to Trump Tower: to deliver the message that our industry will not be complicit in the systematic disgrace of our democratic institutions, the establishment of an authoritarian kleptocracy nor the oppression of citizens, including the minority of Americans who elected him,” Mr. Sacca said. Or perhaps everyone will get along fine. Some in Silicon Valley speculate that the rough moments between Mr. Trump and the tech industry come not because they are so different but because they are at the bottom so similar. “Trump embodies the harsher aspects of Silicon Valley  —   a brash and arrogant disrupter, convinced that the world is all wrong as it is and only he can change it for the better,” said Shiva Ramesh, a longtime Silicon Valley entrepreneur. Even Mr. Trump’s    plans have a familiar ring. “Sounds like the pitch of some  : ‘It is all there in my head and in a   plan, it will all work out, I can do it, trust me,’” Mr. Ramesh said.'"}, "time": 1742628588.6495461}