{"duration": 0.02550816535949707, "input_args": {"text": "'Source: Common Dreams \\nArctic is losing ice and heating up despite seasonal onset of 24-hour darkness—phenomena that break all previous records \\nAs 2016 continues on its march toward becoming the hottest year on record , the Arctic is seeing extreme warmth beyond anything previously recorded at this time of year—prompting alarm from climate scientists around the world. \\n\"Folks, we\\'re in a climate emergency,\" tweeted meteorologist Eric Holthaus. Yeah, this isn\\'t normal. Follow @ZLabe @Weather_West @Climatologist49 for more. Folks, we\\'re in a climate emergency. Tell everyone you know. pic.twitter.com/BKuD7H4qfD \\n— Eric Holthaus (@EricHolthaus) November 17, 2016 \\nThe temperature at the North Pole as of Thursday was a stunning 36ºF (20°C) above normal. \\nThe bizarre heat is fueling the rapid melt of the pole\\'s ice caps, and it is particularly unusual because it\\'s all happening during the polar night—the time of year when the North Pole never sees the sun, observed UCLA climate scientist Daniel Swain: Despite onset of #PolarNight , temperatures near #NorthPole increasing. Extraordinary situation right now in #Arctic , w/record low #seaice . pic.twitter.com/zpS8hDK2nG \\n— Daniel Swain (@Weather_West) November 16, 2016 \\nOther meteorologists on Twitter highlighted the abnormality of the situation: Today\\'s latest #Arctic mean temperature continues to move the wrong direction… up. Quite an anomalous spike! pic.twitter.com/C93cQWUKV9 \\n— Zack Labe (@ZLabe) November 15, 2016 \\nThe cause? According to the Washington Post , it\\'s the result of an elongated jet stream propelling hot air farther north than normal—which is caused by climate change. \\n\"The Arctic warmth is the result of a combination of record-low sea-ice extent for this time of year, probably very thin ice, and plenty of warm/moist air from lower latitudes being driven northward by a very wavy jet stream,\" Jennifer Francis, an Arctic specialist at Rutgers University, told the Post . \\nThe Washington Post continued: \\nFrancis has published research suggesting that the jet stream, which travels from west to east across the Northern Hemisphere in the mid-latitudes, is becoming more wavy and elongated as the Arctic warms faster than the equator does. \\n\"It will be fascinating to see if the stratospheric polar vortex continues to be as weak as it is now, which favors a negative Arctic Oscillation and probably a cold mid/late winter to continue over central and eastern Asia and eastern North America. The extreme behavior of the Arctic in 2016 seems to be in no hurry to quit,\" Francis continued. \\nAnother culprit is that areas of open ocean water are showing unusually hot surface temperatures, according to Mark Serreze, director of the National Snow and Ice Center, who was quoted by environmental writer Hannah Waters on Twitter. \\nSerreze commented to the Washington Post : \"There are some areas in the Arctic Ocean that are as much as 25 degrees Fahrenheit above average now. It\\'s pretty crazy.\" \\nThe alarming Arctic weather happens during the United Nations climate conference in Morocco , and as environmentalists and climate scientists in the U.S. grapple with the prospect of a president-elect who denies the existence of climate change. Things are indeed not looking good for the planet, experts warn .'"}, "time": 1742628446.5841928}