{"duration": 0.12455940246582031, "input_args": {"text": "'On a rainy night in Queens, Armani Graves leapt into the swirling ropes and started to move her feet. Soon the ropes  —   and her orange knee socks  —   were a blur as she jumped faster and faster in a cavernous gymnasium echoing with her teammates’ encouragement. “Knees up!” “Push!” Armani, 13, and her teammates were practicing competitive double dutch, the schoolyard game that was adopted and perfected by black girls in urban American communities after World War II. In recent decades, double dutch has evolved into a competitive sport, complete with rules, score sheets and tournaments. But it has also fallen out of favor in the neighborhoods where it was born and once flourished. “I’m one of the only kids who does double dutch in my school,” said Armani, a member of Stan’s Pepper Steppers, a   club, who lives in the East New York neighborhood of Brooklyn. But even as double dutch has declined in popularity in New York City and across the United States, its appeal has surged beyond the country’s borders, with the number of teams from abroad soaring and many of them beating American teams at a sport that was invented here. Perhaps nothing illustrates double dutch’s international spread as much as the Double Dutch Holiday Classic, an annual tournament at the Apollo Theater in Harlem that bills itself as the Super Bowl of double dutch and will have its 25th anniversary on Sunday. In addition to teams from Queens, Brooklyn, Connecticut and South Carolina, there will be competitors from France and Japan. “The Double Dutch Classic is a perfect example of what’s happened,” said Kyra Gaunt, a professor of sociology and anthropology at Baruch College and author of “The Games Black Girls Play: Learning the Ropes From   to  . ” “For the last 15 years, almost every freestyle competition has been won by groups that are outside the United States. ” As Stan’s Pepper Steppers were practicing Wednesday night in a community center in Queens, five teams from Japan were aboard a   flight to New York. On Thursday, a Japanese team called Big Up, still   rehearsed in Central Park for this weekend’s tournament, the Midtown skyline looming behind them. While the Queens team is known for its swiftness  —   members hold various speed records  —   Japan’s competitors are renowned for their choreographed,   style. Two of the five members of the coed team Big Up, including Koichiro Sugawa, were trained as dancers. Mr. Sugawa, 21, first tried double dutch when he began college. “I simply thought it was cool,” he said. The organizer of the Japanese trip, Jun Haratake, was a competitor in high school and then at his   university in Tokyo, where the double dutch club had 100 members. Now 36, Mr. Haratake is the director and   of the Japan Double Dutch Association, a nonprofit organization. From 2004 to 2008, Mr. Haratake studied English in New York and worked as a physical education teacher in a Japanese school. He recalls taking the subway to the Brownsville section of Brooklyn and joining teenage girls in   jam sessions  —   akin to a golfer traveling to St. Andrews in Scotland. Double dutch, he said, is still ascendant in Japan. “It’s continuing to grow in popularity,” he said. In New York City, its transformation into a competitive sport started in the 1970s, when a former police sergeant in Harlem, David A. Walker, decided that girls needed a way to channel their athletic skill. He founded the National Double Dutch League, a nonprofit group that sponsors the annual tournament at the Apollo. He also developed rules and worked with the city’s schools to incorporate double dutch into gym classes and intramural programs. “In the 1970s, there were not a lot of programs for girls,” said Lauren Walker, Mr. Walker’s daughter, who assumed leadership of the league after his death in 2008. “Boys had baseball, basketball and football. My father saw some girls jumping double dutch in a schoolyard one day and said, ‘Hey, let’s turn an urban activity into an actual sport. ’” In 2009, the city’s Department of Education made double dutch a varsity sport in nearly a dozen high schools, mostly in predominantly black neighborhoods like   and Harlem. The idea was to increase the number of students, girls in particular, who participate in competitive sports. Yet despite the imprimatur of school officials, and clubs like Stan’s Pepper Steppers, double dutch veterans and observers of black youth say the activity has slowly lost its appeal as a spontaneous form of play. They blame the lure of social media and video games. “Back in the day, there were no computers,” Ms. Walker said. “Kids are just not as physically active anymore. ” Dr. Gaunt, who is an ethnomusicologist and social media researcher, agreed. “Most girls spend most of their time on Instagram or Tumblr, or with games online, rather than outside,” she said. “That’s true across all demographic groups. But double dutch is a street sport. It’s so common now to meet    girls who have never  . That wasn’t the case 20 years ago. ” But in countries from Latin America to Asia, the sport has been embraced as part of a love affair with   culture. (The impresario Malcolm McLaren put it on the map as far back as 1983 with his hit song “Double Dutch. ”) Since the 1980s, double dutch organizations and competitions have emerged across the globe. In the last decade in Europe, championship tournaments have been held in Denmark, Hungary, the Netherlands and Sweden. In Japan, it has spread though clubs in high schools and colleges. Mr. Haratake said that at least half of the members of his university’s double dutch club were studying physical education, adding that they would most likely spread the sport as future teachers. But double dutch still casts a spell on some teenagers in New York  —   mostly girls, but the occasional boy, too. Young competitors say it combines art and athleticism and also improves their performance in other sports. Armani Graves, for example, plays flag football and runs track. “I’m one of the fastest runners in my school because of double dutch,” she said. During practice, Javon Langston, 14, a member of the Pepper Steppers, had just pulled off a series of tricks inside the swirling ropes, including an aerial, a   and a flip, and he did not get tangled. “I like the freestyle the most because it shows your creativity,” he said modestly. His mother, Reneé Langston, nodded her approval. “It keeps him positive and active and off the streets,” she said. “It has definitely made him a better young adult. ” Dr. Gaunt lamented that there weren’t more funds available to allow the city’s double dutch champions to travel to international competitions. “The girls here who jump don’t get to go to Morocco and France and Germany,” she said. “A lot of the teams in Far Rockaway and Brooklyn don’t have that kind of money. So the descendants of the culture from which double dutch emerged do not have the same resources to compete. ”'"}, "time": 1742563193.5057771}