{"duration": 0.15921354293823242, "input_args": {"text": "'Wednesday on his nationally syndicated radio show, conservative talker Rush Limbaugh said President Donald Trump’s decision to fire FBI director James Comey was “an epic troll” on the Democrat Party.  Partial transcript as follows: LIMBAUGH: Hi, friends. This is great. I have been laughing all morning long. I have been laughing starting with last night. Can we agree that Donald Trump is probably enjoying this more than anybody wants to admit or that anybody knows? So he fires Comey yesterday. Who’s he meet with today? He’s meeting with the Soviet, the Russian foreign minister, Sergey Lavrov! I mean, what an epic troll this is. The Democrat Party is going bananas  —   completely, totally unhinged  —   on the road to literal insanity. Do you realize  …    ? Let me tell you what’s happened here. The Democrat Party has once again thrown Hillary Clinton overboard. Hillary Clinton is the most   woman in America by people in her own party, and it’s happened again. If you’re wondering what I’m talking about, stand by I’m gonna explain all of this. But they have just chosen sides and, once again, Hillary gets thrown under the bus. And not only that, the Democrats are rolling that bus backwards and forwards. She’s finished! She’s over with. The Democrat Party and the media have made it clear that she is fodder. She is irrelevant here. It is amazing. Two days ago, they were all talking about how Comey needs to be fired because of how he was mistreating Hillary, and the Hillary people were running around claiming that Comey’s a bad guy. And now Comey gets fired, and all of a sudden they do a 180! You know, my friends, I’ve often spoke of the connection Donald Trump has with his audience, with his supporters. I understand it because  …     Well, I just understand it. (  Right Scoop) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742561665.8011346}