{"duration": 0.11626744270324707, "input_args": {"text": "'Why Is It So Hard to Reduce the Pentagon Budget?   \\nBy William D. Hartung / TomDispatch David B. Gleason / CC BY-SA 2.0 \\nThrough good times and bad, regardless of what’s actually happening in the world, one thing is certain: in the long run, the Pentagon budget won’t go down. \\nIt’s not that that budget has never been reduced. At pivotal moments, like the end of World War II as well as war’s end in Korea and Vietnam, there were indeed temporary downturns, as there was after the Cold War ended. More recently, the Budget Control Act of 2011 threw a monkey wrench into the Pentagon’s plans for funding that would go ever onward and upward by putting a cap on the money Congress could pony up for it. The remarkable thing, though, is not that such moments have occurred, but how modest and short-lived they’ve proved to be. \\nTake the current budget. It’s down slightly from its peak in 2011, when it reached the highest level since World War II, but this year’s budget for the Pentagon and related agencies is nothing to sneeze at. It comes in at roughly $600 billion — more than the peak year of the massive arms build-up initiated by President Ronald Reagan back in the 1980s. To put this figure in perspective: despite troop levels in Iraq and Afghanistan dropping sharply over the past eight years, the Obama administration has still managed to spend more on the Pentagon than the Bush administration did during its two terms in office. \\nWhat accounts for the Department of Defense’s ability to keep a stranglehold on your tax dollars year after endless year? \\nAdvertisement Square, Site wide \\nPillar one supporting that edifice: ideology. As long as most Americans accept the notion that it is the God-given mission and right of the United States to go anywhere on the planet and do more or less anything it cares to do with its military, you won’t see Pentagon spending brought under real control. Think of this as the military corollary to American exceptionalism—or just call it the doctrine of armed exceptionalism, if you will. \\nThe second pillar supporting lavish military budgets (and this will hardly surprise you): the entrenched power of the arms lobby and its allies in the Pentagon and on Capitol Hill. The strategic placement of arms production facilities and military bases in key states and Congressional districts has created an economic dependency that has saved many a flawed weapons system from being unceremoniously dumped in the trash bin of history. \\nLockheed Martin, for instance, has put together a handy map of how its troubled F-35 fighter jet has created 125,000 jobs in 46 states. The actual figures are, in fact, considerably lower, but the principle holds: having subcontractors in dozens of states makes it harder for members of Congress to consider cutting or slowing down even a failed or failing program. Take as an example the M-1 tank, which the Army actually wanted to stop buying. Its plans were thwarted by the Ohio congressional delegation, which led a fight to add more M-1s to the budget in order to keep the General Dynamics production line in Lima, Ohio, up and running. In a similar fashion, prodded by the Missouri delegation, Congress added two different versions of Boeing’s F-18 aircraft to the budget to keep funds flowing to that company’s St. Louis area plant. \\nThe one-two punch of an environment in which the military can do no wrong, while being outfitted for every global task imaginable, and what former Pentagon analyst Franklin “Chuck” Spinney has called “ political engineering ,” has been a tough combination to beat. \\n“Scare the Hell Out of the American People” \\nThe overwhelming consensus in favor of a “cover the globe” military strategy has been broken from time to time by popular resistance to the idea of using war as a central tool of foreign policy. In such periods, getting Americans behind a program of feeding the military machine massive sums of money has generally required a heavy dose of fear. \\nFor example, the last thing most Americans wanted after the devastation and hardship unleashed by World War II was to immediately put the country back on a war footing. The demobilization of millions of soldiers and a sharp cutback in weapons spending in the immediate postwar years rocked what President Dwight Eisenhower would later dub the “military-industrial complex.” \\nAs Wayne Biddle has noted in his seminal book Barons of the Sky ,the U.S. aerospace industry produced an astonishing 300,000-plus military aircraft during World War II. Not surprisingly, major weapons producers struggled to survive in a peacetime environment in which government demand for their products threatened to be a tiny fraction of wartime levels. \\nLockheed President Robert Gross was terrified by the potential impact of war’s end on his company’s business, as were many of his industry cohorts. “As long as I live,” he said , “I will never forget those short, appalling weeks” of the immediate postwar period. To be clear, Gross was appalled not by the war itself, but by the drop off in orders occasioned by its end. He elaborated in a 1947 letter to a friend: “We had one underlying element of comfort and reassurance during the war. We knew we’d get paid for anything we built. Now we are almost entirely on our own.” \\nThe postwar doldrums in military spending that worried him so were reversed only after the American public had been fed a steady, fear-filled diet of anti-communism. NSC-68 , a secret memorandum the National Security Council prepared for President Harry Truman in April 1950, created the template for a policy based on the global “containment” of communism and grounded in a plan to encircle the Soviet Union with U.S. military forces, bases, and alliances. This would, of course, prove to be a strikingly expensive proposition. The concluding paragraphs of that memorandum underscored exactly that point, calling for a “sustained buildup of U.S. political, economic, and military strength… [to] frustrate the Kremlin design of a world dominated by its will.”'"}, "time": 1742561916.148999}