{"duration": 0.054872751235961914, "input_args": {"text": "'There can’t be many “Jeopardy!” champions easier to root for than Cindy Stowell. Ms. Stowell has won six times in a row on taped episodes of the quiz show that began broadcasting last week. Ms. Stowell has developed a fan base like few other contestants. But she is unable to enjoy her performance on TV, or the outpouring of love from “Jeopardy!” watchers. That’s because she died on Dec. 5, just over a week before her episodes began showing. She was 41. When the science content developer from Austin, Tex. began recording her episodes on Aug. 31, she had Stage 4 colon cancer, a fact known by only a few of the show’s staff members and the host, Alex Trebek. Her competitors were unaware. The show has not announced how long Ms. Stowell’s streak of victories will continue. A “Jeopardy!” champion continues playing until unseated by a contestant. On Tuesday, she won again, bringing her total prize money to $103, 803. Her boyfriend, Jason Hess, and her relatives Greg Stowell and Carole Stowell said in a statement, “Cindy came on ‘Jeopardy!’ to play the game she loved, and in doing so, she was able to make a contribution to cancer research in the hopes that no one else would have to go through what she did. ” The money will go to the Cancer Research Institute, according to KXAN, a TV station in Austin. “She knew she wasn’t going to be around, and so she felt like the best thing she could do was try to help do what she could to help get us to a cure faster,” Mr. Hess told the station. After passing an online contestant test early this year, Ms. Stowell was invited to an audition in Oklahoma City. At that point, she reached out to a producer. “Do you have any idea how long it typically takes between an   interview and the taping date? I ask because I just found out that I don’t have too much longer to live,” she wrote, according to the show’s website. “The doctor’s best guess is about six months,” she continued. “If there is the chance that I’d be able to still tape episodes of ‘Jeopardy!’ if I were selected, I’d like to do that and donate any winnings to   …     charities involved in cancer research. If it is unlikely that the turnaround time would be that quick, then I’d like to give up my tryout spot to someone else. ” A producer told her to go to Oklahoma City for the interview, and if she qualified she would be booked three weeks later, the fastest turnaround possible. She competed on painkillers while fighting a blood infection, according to Mr. Hess. “Competing on ‘Jeopardy!’ was a lifelong dream for Cindy, and we’re glad she was able to do so,” Mr. Trebek said in a statement. In her first performance, she won $22, 801, defeating an editor from Vermilion, Ohio, who had won $107, 499 over seven days. She won $8, 199 in her second episode, and on Thursday she came from behind, adding $8, 600 to her   total. While it’s not unusual for the show to establish back stories for the contestants, the viewers’ knowledge of Ms. Stowell’s condition “is to share a sad secret with her,” Seth Rosenthal wrote at SB Nation. “I sit in awe of a brilliant woman earning every last dollar she can for the causes dearest to her building a sum of infinite potential in the face of her own finality,” he said. “I have never rooted harder for anyone to win anything. ”'"}, "time": 1742628307.4669843}