{"duration": 0.06351709365844727, "input_args": {"text": "'CNN anchor Don Lemon chugged tequila, had his ear pierced, and launched into a rant about how “awful” 2016 was during a drunken live New Year’s Eve performance that ended with producers cutting off his microphone. [Comedienne Kathy Griffin and CNN anchor Anderson Cooper kicked off the bizarre sequence of events by debating whether Lemon should get a tattoo or have his ear pierced.  “What are you thinking?” CNN anchor Brooke Baldwin asked Lemon, who was reporting live from New Orleans. “Nipples! Nipples! Nipples!” Griffin screamed suggested a nipple piercing, as Lemon began to unbutton his shirt. He eventually settled on getting his ear pierced. “Is this going to hurt?” a tequila   Lemon asked Chris, an   tattoo artist who was hold a piercing gun in his hand. “It’s not going to hurt me,” Chris said. “You’ll be fine. ” “Mama Lemon,” a seemingly embarrassed Baldwin said, while looking into the camera,” I don’t know what he’s thinking. At least it’s just his ear, you know what I’m saying?” After the needled was in and Lemon was sporting a fleur de lis earring, Baldwin said “this is what happens when a lot of tequila happens. ” About 30 minutes later, as the clock struck midnight and the New Year had finally arrived, Lemon (now drinking champagne) began to rebuke 2016. “I can’t hear a damn thing,” Lemon said. “So, 2016 was awful,” he added just before his microphone was abruptly cut off.  What exactly was so “awful” about 2016, we may never know. But perhaps CNN cut off Lemon’s mic because it didn’t want to relive the public relations nightmare it endured last month after one of the network’s producers was heard offscreen joking about the possibility of   Donald Trump’s plane crashing. And, of course, 2016 was the year Lemon was called “dumb as a rock” by none other than Trump. . @dbongino  You were fantastic in defending both the Second Amendment and me last night on @CNN. Don Lemon is a lightweight  —   dumb as a rock,  —   Donald J. Trump (@realDonaldTrump) August 10, 2016,  Oddly though, in a year where CNN had seen steep ratings declines and had been dubbed the “Clinton News Network,” Lemon’s   antics received rave reviews on social media as #drunkdonlemon trended online. CNN needs to be cutting to #DrunkDonLemon every 10 minutes, if not 5. #CNNNYE,  —   Ashleigh Virginia (@ashvirginia_) January 1, 2017,  Don Lemon wasted on @CNN getting his ear pierced in a bar is the perfect way to end 2016. #DrunkDonLemon,  —   Tim Baker👨🏻\\u200d💻 (@IAmTimBaker) January 1, 2017,  Honestly, #drunkdonlemon is the best thing ever on TV. 2016 finally gave us a solid.  —   Nicole McDaniel (@nicoleann75) January 1, 2017,  Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742564111.1152692}