{"duration": 0.08269762992858887, "input_args": {"text": "'LOS ANGELES  —   First came the anxious calls in the days after the election of President Trump. Now, people begin lining up before 8 a. m. and crowd the waiting rooms inside the Mexican Consulate here. Mexican citizens come to renew passports that have been unused for more than a decade. They desperately ask lawyers if they can do anything to help them stay in the United States. They register their children for Mexican citizenship, just in case they are sent back and decide to move their whole family with them. When the consulate began to get reports of dozens of Mexicans being arrested by immigration officials last week, they immediately dispatched lawyers to the federal detention center downtown. Officers closely monitored social media, simultaneously trying to get information and quash unfounded rumors. In one case, they helped a man whom immigration officials had quickly sent to the border for deportation return to Los Angeles for a hearing in immigration court. These are demanding times for the 50 Mexican consulates scattered throughout the United States. With Mr. Trump’s promise to crack down on immigrants living in the United States illegally and an executive order that vastly expands who is considered a priority for deportation, Mexicans living here illegally are increasingly on edge. And consulates are moving quickly to help. As official representatives of the Mexican government in the United States, the consulates can provide legal guidance and resources for people and families dealing with immigration issues. Mexicans make up about half of the country’s 11 million undocumented immigrants. The relationship between Mexico and the United States is at its lowest point in years. After a    mother of two American citizens was deported in Arizona last week, the Mexican government warned their citizens living in the United States of a “new reality. ” It urged “the entire Mexican community” to “take precautions” and be in touch with the nearest consulate. Mexican officials say they are eager to keep families already living in the United States together. There are economic concerns too: Mexicans living abroad send more than $25 billion back home, with most of the money coming from the United States, according to Mexico’s central bank. Perhaps nobody is as busy as Carlos García de Alba, the consul general in Los Angeles, one of the largest offices in the country. He has begun to train nearly every employee in basic legal services and expects to bring in many more immigration lawyers. Still, in recent months, Mr. García has felt torn between his efforts to increase services to worried constituents and trying to calm their nerves. “We don’t want to provoke and feed a kind of paranoia among our nationals here,” Mr. García said in an interview. “There is a kind of psychosis, people are really scared. Up to now we haven’t seen anything that is really different than the last several years, but the environment is making people panic and they are completely fearful. They want to know what is going to happen and how to protect themselves. ” In the last week, the Mexican government has created a   hotline to help answer any questions for Mexicans in the United States. Last month, Mexican President Enrique Peña Nieto announced that he would spend $50 million to pay for lawyers at every consulate to help people facing deportations. And consulates have been distributing fliers detailing what to do if someone is approached by deportation agents  —   advising them not to open their doors without proof of a warrant or speak to officers without a lawyer. Foreign service officers who have spent decades in the United States said in interviews that they had all encountered increased anxiety among undocumented immigrants, as several states have passed their own laws to deal with illegal immigration. But they said this was the most hostile national atmosphere for Mexicans in recent memory, making their jobs both more difficult and more urgent. Scared by rumors and rhetoric, some consulates have heard of immigrants taking drastic steps to avoid the authorities, like keeping their children home from school, quitting their jobs or selling their homes for cash. And many immigrants may not immediately consider turning to the Mexican government for help. “There is an inherent feeling of vulnerability that comes with being undocumented in this country, and that vulnerability moves you to get away of anything that is official government,” said Carlos González Gutiérrez, the consul general in Austin, Tex. who estimates that about half of the 200, 000 Mexicans living in the region are undocumented. “The first challenge for us is to make sure that immigrants understand that the consulate is a safe place where they can get accurate information. ” Like other consuls, Mr. González has tried to assuage fears by appearing frequently on   television and radio, offering information that American officials may not be willing to share. He has been careful to emphasize that the operations appeared to be targeted, not widespread raids as some feared, but also pointed out that several people without criminal records had also been arrested. Many of the consulates’ most pressing concerns now are defensive. In several cases last week, immigration agents were “unwilling to provide our nationals with the option to talk with our consulate and the obligation to notify us,” said one Mexican official, who spoke on the condition of anonymity because the issue was still under investigation. Under the Vienna Convention, a 1963 international treaty, any citizen of another country should be offered a chance to speak with their consulate. Felipe Carrera oversees the department of protection in the Los Angeles consulate, where dozens of lawyers assist with immigration cases. For years, the office has sent a lawyer to the federal immigration center daily, monitoring who is taken in and talking to as many as 15 people a day. Minutes after he heard reports of dozens of arrests last week, several lawyers went there to talk with as many Mexicans as they could. “Our main purpose is to find out if there have been violations of due process,” Mr. Carrera said. “People need to know they have constitutional rights. We want them to know about the Fifth Amendment and make sure they are properly advised about what happens if they plead guilty. ” Claudia Franco, the consul general in Phoenix, said much of her time these days was spent offering a kind of psychological support to immigrants, answering basic questions and calmly listening to their fears. “We want people to consider   scenarios, to be prepared and have a plan,” she said. The    national hotline, based in Tucson, received more than 1, 500 calls one day this week, more than double than the average number of calls before Mr. Trump was inaugurated. Consulates throughout the country said requests for legal assistance had also spiked in the last two months  —   some come from people who received deportation orders years ago that were never enforced. Others have criminal convictions for using fake Social Security cards still others may be eligible for special visas because they were victims of domestic abuse or other crimes. “Most people do not understand what their legal options are,” said Javier Díaz de León, the consul general in Atlanta. “There are a number of people who don’t really have a legal recourse, but it’s much more preferable to know that before you get detained so you can make a wise decision. ” While many people are looking for advice have plans to stay here, many parents of   children are now registering them for Mexican citizenship  —   a kind of insurance in case they are deported and want their children to join them. The Mexican government has offered this kind of dual citizenship for more than a decade. Before the election, Mr. Díaz said, the office handled about 15 applications a day, now they receive double that. Other offices have experienced similar increases. Monica Sanchez, 26, came to Los Angeles from Morelia, Mexico, more than 10 years ago. Although she has stayed out of legal trouble, she said she was constantly worried that things would change quickly and she would be forced to move back. “I want to do something, whatever I can do to feel safer and less scared,” she said. “We all want help to take the control we can get, to have some power. ”'"}, "time": 1742628456.6210835}