{"duration": 0.03769373893737793, "input_args": {"text": "'Pinterest \\nFrom Sierra Marlee : Laws for thee, but not for me. \\nThe FBI’s Hillary Clinton decision may just make it impossible to prosecute anyone caught in wrongful possession of classified information. \\nFor instance, let us look at the case of Petty Officer First Class Kristian Saucier, who was discovered to have taken pictures of the inside of a classified U.S. nuclear submarine. He is making a plea for leniency based on the fact that former-Secretary of State Hillary Clinton didn’t see any jail time for getting caught in a similar situation. \\nThe 29-year-old man is to be sentenced Friday on the felony charge of “retaining national defense information without permission,” according to Politico . \\nWhile it is clear that being in violation of this law calls for a sentence of 63-78 months, Saucier’s defense attorney claims that his client should only receive probation, based on precedent created by the FBI’s decision to not indict Hillary Clinton, despite acknowledging that she was in possession of classified emails on her home server. \\n“In our case, Mr. Saucier possessed six (6) photographs classified as ‘confidential/restricted,’ far less than Clinton’s 110 emails,” Hogan wrote. “It will be unjust and unfair for Mr. Saucier to receive any sentence other than probation for a crime those more powerful than him will likely avoid.” \\nThere are distinctions in the two cases – for instance, Saucier plead guilty to the charge, admitting that he knew his actions were illegal, and destroying evidence after being confronted about his possession of the classified photos. However, it is clear that his will not be the last case to cite Hillary Clinton’s lack of jail-time as a reason for a criminal to go free. The FBI and federal government as a whole have opened up a can of worms that will potentially put all of America at risk. \\nWill America be able to punish any federal employee or member of the military for gathering classified information, or with the FBI be forced to re-open the investigation into the Clinton server and recommend indictment of Hillary? \\nThis young man should absolutely go to jail for what he did, because he knew it was against the law, and I’m holding all federal employees to the same standard. There is no way one can become Secretary of State and not be told what the parameters and limitations are when exchanging classified information. \\nIf they choose to jail this man, but excuse the actions of the Clintons, there are going to be a lot of angry Americans come November, and it could potentially lead to a Trump presidency. \\nOnly time will tell.'"}, "time": 1742628557.1733084}