{"duration": 1.2834410667419434, "input_args": {"text": "'. War In The Matrix — How Our Minds Are Programmed To Create This Sick Reality Just how much of what we see and think is visual and mind manipulation? This current reflection of t... Print Email http://humansarefree.com/2016/11/war-in-matrix-how-our-minds-are.html Just how much of what we see and think is visual and mind manipulation? This current reflection of the Earth plane; the matrix of our perceived reality; is overshadowed by a projection of war. For several years now we the inhabitants of this reality have been receiving the programming for war and diseases through movies, television video games and the media. We receive our programming for every aspect of our lives from love, hate, happiness, clothes, food, mates, careers, cars, insurance, and reminders of our human limitation and so on.What we fail to remember is the holographic nature of reality based on the human brain.Everything in our visual path is a holographic composition presented by the brain , as the lens of the eyes reflect tones of light back to the optic enter in the brain, the optic nerves then projects the brains frequency translation through the cones and rods in the eyes, capturing and bringing form to frequency patterns. Modern day scientists have achieved a level of understanding regarding the manipulation of brain wave patterns. Our weaknesses are understood as we exist as beings operating within fields of emotions. The strongest of which is FEAR .It is also understood that we are a society of beings struggling to understand who we are spiritually or non physically. Innocence of our spiritual history has made us vulnerable as we continue to seek for a higher power separate from ourselves. We have been conditioned to accept what has been defined as human limitations combined with the impossibility to reach outside of time and space. We have not been encouraged to educate ourselves on the function of the brain, the nervous system and the energetic construct of thought. A thought is the activation of a certain group of neurons within the brain transported through the spinal fluid. Spinal fluid is produced in the ventricles of the brain.In the words of Dr. Stone, founder of Polarity Therapy: \"The cerebrospinal fluid seems to act as a storage field and a conveyor for the ultrasonic and the light energies. It bathes the spinal cord and is a reservoir for these finer energies, conducted by the fluidic media through all the fine verve fibers as the first airy mind and life principle in the human body. The cerebrospinal fluid conveys the energies of the mind throughout the body! Mind energy is considered to be the first principle of life. Mind functions in the body as the light of \"intelligence\". Here we can see the importance of the thought process as every thought is being processed throughout every cell in the body.What does this have to do with \"war in the matrix\"? As quoted from The Dancing Wu Li Masters : According to a number of scientists, \"What is \"out there\" apparently depends in a rigorous mathematical sense as well as philosophical one, upon what we decide \"in here\". The new physics tells us that an observer cannot observe without altering what he sees. Observer and observed are interrelated in a real fundamental sense.The exact interrelation is not clear, but there is a growing body of evidence that the distinction between the \"in here\" and the \"out there\" is illusion. Access to the physical world is through experience. The common denominator of all experiences is the \"I\" that does the experiencing. In short, what we experience is not external reality but our interaction with it.\"We most often forget that we are tied into this reality based on our emotional output. Emotions determine the electromagnetic input and output within the human body and all surrounding energy fields. Emotions are electromagnetic wave patterns inextricably combined with thought. They form the skeletal structure of our belief system which is reflected in the manner which we live our lives. Emotional impulses determine the chemical/hormonal production within the ventricles of the brain. Once an acceptable perception of reality is solidified in our minds it becomes the only probability and perception within our minds. Being the observer we solidify reality through emotion expressed through thought.Thought is energy in motion, solidifying and becoming our reality. Human thoughts are trapped within lower frequency waves resulting in human confinement to this matrix. Perceivable reality is simply a state of consciousness. It is the field of thought or thought field in which we become entranced. Each moment of reality is being reflected from the field of energy radiating from thought. Ultimately we exist in our MIND . We exist in an individual mind space while sharing an overall collective space of mind. It is the collective state of mind that holds this holographic/virtual reality in its present existence.This is a chess game, a scientifically layered design of rulers and subjects, an illusion of power and the battle for your WILL. It is the great deception of the true rulers and subjects. We exist in an uncertainty of the ownership of ones Will. It is of utmost importance that an understanding of WILL is incorporated into our endless quest for spiritual identity. It is the Will that is the driving force of our descent through time into matter. WILL is the thrust of Energy that provides the force needed to reach into the VOID to bring forth the essential codes of light to create that which has been born in the imagination, the image-in-action.There are multiplicities of those known as ascended masters who continue to operate in deception, subtly enforcing and maintaining control over the vulnerable minds of humanity. Each organization or individual may justify such embracement of attachment as different from his/her brother. Within all religions , occult and new age truths are held numerous predecessors of man who remain GAME keepers of this plane. Man\\'s need to worship outside of himself has been the signature of approval for on going control of his mind. Such entities that are no longer apart of this plane are stuck and exist within the planes that surround the playing field of Earth. They sustain their existence by feeding off of the emotional output of humanity; intercepting human thought field by continued injection of frequency patterns of fear, guilt, shame, pain, doubt, jealousy, lack and attachment.The deception is of such a heightened nature that such beings create a level of comfort within the human mind by providing a balance of insightful knowledge. This creates continued trust, loyalty and attachment to the parasitic entity that has been providing an illusion of freedom. The Sovereignty of humanity is a feared occurrence as it will bring an end to the actions of the puppeteers and the smoke and mirrors.We exist in the age of ENLIGHTENMENT which has been born out the cosmic timer of cycles; cycles representing shifts in frequencies spiraling down from inconceivable cycles, beyond light years in the future, which is our past. Within our realm of understanding we can catch a glimpse of such unfolding through the four quarters of 26,000 year cycles, the end of which we are now experiencing. It is because this great time of cosmic graduation that has opened the door to the surrounding planes, bombarding our time, our current reality with numerous entities coming forth through various channels. The lives of many have become dependent on the instructions of these beings. This becomes an interception of alignment to the ONE.The confusion of the structure of over souls and the necessity to be identified with figures of prominence identified in human history is of great distraction and deception. The alter ego becomes the target and the driving force of the journey. The GAME encompasses all things, seeking life through human emotion. The human need to belong and to be accepted drives the ego to find and provide this candy to the human child.We need only change our mind, our collective perception of this impending war. Humanity collectively holds the key to the release of the illusion of war. Although this is a planet filled with many warlords from other parts of our galaxy, many have laid down their swords and have transcended the need to participate in probable wars. The power lies within the minds of humanity. The self appointed officials of this reality are counting on the spiritual ignorance of the planet. They have developed technology that will now allow numerous holographic projection much of which can be done through the alteration of brain waves through sound and light projection. HAARP is one such technology that is capable of such brain modifications.It is essential that we educate ourselves on this vessel/ship called a human body. Much of this vessel has been deactivated for quite sometime. Melatonin for example is essential to the harmonic balance of the body. After mid night melatonin is converted into pinoline. We then enter into a space of amnesia. By 3:00 am we begin to experience what is know a prophetic or lucid dreaming. As stated by Tao Gardens: \"The darkness actualizes successively higher states of divine consciousness, correlating with the synthesis and accumulation of psychedelic chemicals in the brain. \"Melatonin,; a regulatory hormone, quiets the body and mind in preparation for the finer and subtler realities of higher consciousness. The hormone Pinoline affects the neuro-transmitters of the brain, permits visions and dream-states to emerge in our conscious awareness. \"Eventually the brain synthesizes the \\'spirit molecules\\' 5-MeO-DMT and DMT, facilitating the transcendental experiences of universal love and compassion\". — The Prana Program – Effective & Enjoyable Evolution Belief systems based on the emotional output of fear shuts down the production of these major chemical that were once produced in the womb and in infancy through the age of 7 and 12. These chemical/hormones are known as 5-Meo-DMT and DMT. These are amino acids. The pharmaceutical and food industry have played a major role in providing suppressive inducement to the human brain. We have become a society obsessed with food , mainly cooked food, fast food and junk food. All of which alter the harmonic function of the brain and the nervous system, both of which are essential in the awakening process.When heat is applied to food through the process of cooking, this becomes a chemistry experiment as heat immediately destroys essential enzymes and amino acid Tryptamines serotonin, melatonin, pinoline, 5-MeO-DMT and DMT. Tryotamines and beta-carbolines are known as psychoactive indoles both interacting with the nervous system through the synthesizing of neurotransmitters. As essential enzymes are destroyed the natural progression or conversion of these hormones are inhibited, lessening the probability of the natural occurrence of transcendental experiences. We become disconnected from the awareness of the connected force of the energies beyond linear time. We exist purely in an external reality. It is said that the body is addicted to approximately 20 amino acids or more; consisting of the enzymes MAO which destroy our neurotransmitters while stimulating an addiction for foods that encourage the repetition of this cycle.This is the manner in which the food industry manipulates our existence and or belief system.Through ignorance we have become the fuel that drives the vehicle of the corporate world . Our minds are controlled through numerous measures. We must however understand that we have allowed it, for we have given our permission even in our defence of ignorance. This is not about blame, but it is about awakening and recognizing the choices that we have made and to change those choices for the enhancement of our own evolution. No one can save us; no one is coming to save us. This is an individual journey and we must find our own way back to the state of alignment, the state of Oneness . \"To further define reality; reality is \"I\" projected outward as multiple characters, viewed through the window of my mind. From the Apex or point zero, the One has descended down the ladder of time becoming the many\". By Sonia Barrett , DreamcatcherReality.com Sonia is the author of The Holographic Canvas: The Fusing of Mind and Matter . Her insights are cutting edge with much of it supported by quantum physics. Sonia Barrett’s work bridges the gap between science and spirituality in a simplified format. She addresses the programming, beliefs and concepts by which we have lived our lives, both individually and collectively. You can contact Sonia via e-mail or Facebook. Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562611.4544797}