{"duration": 0.20867156982421875, "input_args": {"text": "\"Source: ForeignPolicy.com \\nEncroaching waters off the coast of Togo, Ghana, Mauritania, and others are destroying homes, schools, fish, and a way of life. \\nFUVEMEH, Ghana — The tide is just starting to come in when David Buabasah begins nervously checking the waters creeping up the coastline toward his partially destroyed home. \\nAs the high tide mounts the steep shore of this small Ghanaian fishing village perched on a shrinking peninsula between the Atlantic Ocean and the Volta River estuary, he and other inhabitants prepare for the worst. \\n“When the big waves come, they can easily kill you. Last week, the ocean took away part of my house while my family was sleeping inside,” says the 32-year-old fisherman, gesturing toward a crumbling brick wall and a pair of door frames, the only remains of his family’s compound. \\nGrowing stronger by the minute, the tide begins to push wave after wave into the village, pounding the dilapidated dwellings with unrepentant force. House walls collapse under the fury of the ocean, and huge pools of saltwater fill the center of town. Those whose houses are the closest to the shoreline can only watch as the waves carry away all of their belongings. \\nTwenty years ago, Fuvemeh was a thriving community of 2,500 people, supported by fishing and coconut plantations that are now completely underwater. But in the past two decades, climate change and industrial activity — such as sand mining and the construction of dams and deep-sea ports, which trap sediments and prevent them from reaching the coastline — have accelerated coastal erosion here. Gradually but inexorably, the ocean has swallowed up hundreds of feet of coastline, drowning the coconut plantations and eventually sweeping away houses. \\nFor a time, villagers retreated, rebuilding destroyed houses farther away from the advancing shoreline. But eventually they ran out of land to fall back on: The narrow peninsula is now less than 1,000 feet across, and high tides routinely wash over the entire sandy expanse. The last trees have been uprooted by the waves and lie dead along the shore, a grim omen of what awaits fishermen like Buabasah, who have seen their livelihoods destroyed in the span of a single generation. A young boy carries his two turkeys to save them from the flood caused by the rising sea level in Fuvemeh. \\nFuvemeh is one of thousands of communities along the western coast of sub-Saharan Africa, stretching more than 4,000 miles from Mauritania to Cameroon, at risk of being washed away. Spurred by global warming, rising sea levels are causing massive erosion — in some places eating away more than 100 feet of land in a single year. Sea levels around the world are expected to rise by more than two-and-a-half feet by the end of the century, but they are expected to rise faster than the global average in West Africa, according to the West African Economic and Monetary Union. In a region where 31 percent of population lives along the coastline, generating 56 percent of total GDP, according to the World Bank , this is a potentially catastrophic problem. \\n“In West Africa, infrastructure and economic activities are centered along the coastal region, so as sea levels continue to rise, it threatens our very existence and source of income,” says Kwasi Appeaning Addo, a professor in the University of Ghana’s department of marine and fisheries sciences. “We are sitting on a time bomb.” Togbe Agbavi Koffi, 60, is the chief of village of Agbavi in Togo. “The sea advances all year long,” he said. “It has devastated our villages and many of our people have already left.” \\nAnd it’s not just small fishing villages that are being threatened. Low-lying areas in Lagos, the Nigerian megalopolis that is the seventh-fastest growing city in the world, as well as in the Ghanaian capital of Accra, whose annual economic output is around $3 billion, are at risk of inundation. Already, both cities are grappling with more frequent — and severe — flooding than in the past. Low-lying areas of Accra now flood every year during the rainy season. Last year, at least 25 people died as a result. \\nThe southern parts of Nouakchott, the capital of Mauritania, lose up to 80 feet of beach every year, and coastal erosion has already damaged several hotels in Gambia and Senegal,as well as vital water treatment facilities in Cotonou, Benin’s economic hub. The situation is the same in neighboring Togo, where last year the coast retreated 118 feet in some places, according to local authorities. On the outskirts of the capital, Lomé, rows of destroyed buildings line the beach in the town of Agbavi. \\n“The national route used to pass there, just beside my first and second house,” says Togbe Agbavi Koffi, the town’s 60-year-old chief, pointing to the faint outline of a highway that is now submerged deep in the ocean. “My third house is about to crumble into the sea as well. I would like to cry, but a chief cannot cry.” Local boys stand on the terrace of the UNESCO World Heritage Site Castle. Originally built in 1653, it was an important slave trading post along the West Africa coast; now it’s one of Ghana’s main attractions. \\nBut it’s not just homes and businesses that are being swept away. Livelihoods, cultural heritage, and the social fabric of entire communities are disappearing as well. Rising temperatures have precipitated the migration of fish stocks while erosion and salinization have reduced arable land and contaminated freshwater reserves. Near Fuvemeh in Ghana, breeding grounds for sea turtles are disappearing, and the populations of dolphins, sharks, and whales are rapidly dwindling. At risk also are the UNESCO-protected colonial forts along the coasts of Ghana and Ivory Coast that served as conduits for the slave trade. \\nStripped of their livelihoods and their heritage, coastal communities lose their most resourceful young people to migration while unemployment fuels drug and alcohol consumption at home. In Agbavi, the situation is so desperate that droves of young men have joined criminal syndicates involved in fuel smuggling and beach-sand mining, an illegal enterprise that worsens erosion. \\n“Some of our children go mining as soon as they come back from school, in order to gain some money,” Koffi says. “People are hungry, and small kids are forced to steal. We are suffering a lot.” People living in Fuvmeh walk across the village flooded by the rising sea level. A little girl stands on a traditional fishing boat holding her doll in Baguida, on the Togo coastline. The town is experiencing massive coastal erosion, forcing the local population to relocate away from the sea. Tanks filled with petrol are lined along the ocean. As fishing has become less remunerative due to the effects of climate change on the fish stocks, several local fishermen have resorted to fuel smuggling, a highly lucrative but illegal practice which consists in trafficking jerrycans of petrol from Nigeria through Benin and Togo by sea. Alice Kwashi, 68, sits outside her house in the village of Blekusu. The ocean has destroyed part of her house, filling it with sand and contaminating the freshwater well with saltwater. In order to prevent water from seeping into the house, the woman built a small barrier of soil just outside the entrance. ´“When I fall sleep, I don't know if the sea will come and take me away” she said. Two schoolgirls stand on the ruins of their school. Two years ago, the Dzita EP Basic School had one of its four compounds destroyed by coastal erosion during the rainy season. Four classrooms were lost, forcing the school management to combine classes in order to shelter all the 670 students. \\nInstead of investing in ecologically sustainable techniques to manage rising sea levels, like developing aquatic farms or restoring mangrove shrubs, governments in West Africa have so far largely resorted to engineering less time-intensive defenses like sea walls and groins. When built properly and maintained well, groins — vertical structures erected perpendicular to the coastline that trap sediments and prevent them from moving along the coast — are an effective short- to medium-term solution. But because they disrupt the natural flow of sediments, they can worsen erosion elsewhere on the coast, sometimes starving neighboring communities of much needed sand. \\nThe eastern coast of Ghana offers a stark illustration of the trade-offs involved with groins. Once a thriving trading hub, the city of Keta has suffered massive coastal erosion in recent decades that forced more than half of the population to flee. Fort Prinzenstein, a landmark Danish castle that was once at the center of town now teeters on the shoreline, partially destroyed by the waves. A late government intervention allowed the construction of a sea defense wall and a series of groins that have saved what remains of the city’s elegant colonial buildings, which retain the eerie atmosphere of a ghost town. \\nBut the last-ditch effort to save Keta has further exacerbated erosion in the village of Blekusu, located a little more than six miles to the east. “We are having so many problems because of those groins,” explains 68-year-old Alice Kwashi, a widow whose house has already been partially damaged by the waves. “The ocean has destroyed electric[al] lines and contaminated water wells. Every time I go to sleep, I know it could be my last night, because the waves could take me away.” A home destroyed by rising sea levels in the village of Agbavi in Togo. \\nA more environmentally friendly method of replenishing the coast involves pumping enormous amounts of sand from the seabed back on shore. But beach nourishment, which has been tried in the United States, Mexico, Australia, and the Netherlands,among other places, is extremely expensive and has to be repeated every few years in order to keep pace with erosion. Even without such costly interventions, adapting to coastal erosion by rebuilding infrastructure farther inland and resettling endangered communities is expected to cost between 5 and 10 percent of GDP in affected countries, according to the United Nations. It’s an open question how one of the poorest regions in the world should come up with the resources for costly sea walls and beach replenishment schemes. \\nAnd as long as man-made climate change continues, such costs will continue to incur. That is why countries around the world face the challenge not only of pursuing projects to help manage the environment, but also of exploring new ways to better live in harmony with it, and thus slow the rate of global warming. \\n“If we can’t find a balance between our insatiable appetite for modernity and allowing nature to replenish itself,” says Fredua Agyeman, the environment director at Ghana’s Ministry of Environment, Science, Technology, and Innovation, “we will always run into problems, no matter the advancements in modern science or engineering.” \\nThe people of Fuvemeh are among hundreds of millions who are paying a heavy price for a problem they didn’t create. At the current erosion rate, villagers predict that their homes will disappear in less than six months. Left with the bitter choice of staying to be swept out to sea or abandoning his land, history, and way of life, Buabasah doesn’t know what to do. He has moved his wife and children to another village, but he can’t follow them because Fuvemeh serves as his fishing base. Migrating would mean giving up on his job and his ability to feed his family, since the government will only facilitate resettlement to inland communities. \\n“I am very afraid for the future of this place,” he says in despair. “Sooner or later we will have to leave, but we have nowhere to go.” \\nView the photo essay companion piece on the devastating effects of climate change on the region “ The Waves Will Take Us Away ,” by Matilde Gattoni.\""}, "time": 1742562552.3579848}