{"duration": 0.14603352546691895, "input_args": {"text": "'. Electromagnetic Control Grids, Division Mindsets, Healing Timeline I said it before, the way people are controlled is through setting them in opposition with each othe... Print Email http://humansarefree.com/2016/11/electromagnetic-control-grids-division.html I said it before, the way people are controlled is through setting them in opposition with each other. The only way people regain control is if they work with each other for a beneficial future. The only way this falls apart is if people are fighting each other over petty things.It’s all so much deeper than we are told. They didn’t just invent petty products’ for this “world” this “universe,” they introduced a whole spiritual soul-trading system by the use of electromagnetic frequency nets. The state of the original human is eternal, but with this system the population is recycled over and over in time.Active DNA is a physical thing that pulls information from what is called the “aether” (other realities) and manifests it physically in this reality. If DNA is targeted , i.e. by the system just mentioned, then other realities can also be manipulated in instances where the DNA is active. That is what this is all about: The Universe, time, and the Earth are naturally a multi-dimensional existence of which those other realities, times and planes were influenced because of the manipulation that took place here.To say it another way, the divisive control grid has had access to higher dimensions and therefore the soul-energy of Humanity, and the non-physical realms we are connected with.This is out of balance and cannot remain this way forever. It is leading up to a fulcrum of experience in which the forces at play must reach a completion of cycles.The way we can fix this is by becoming aware of the hidden knowledge which is literally the invisible energy of the mental and emotional bodies. We must see how Humanity is being manipulated, or blocked from our higher awareness.The off-the-wall explanation is that physical reality manifests out of the collective unconscious.Which also means that when each person on Earth clears their unconscious of all the debris and toxins stuck in their ‘fields’ then we all will experience life on Earth at a frequency which reflects that healing.To get to this healed “timeline” we have to go through a healing process. This process is cathartic and involves expelling the toxins of mind and body and is painful in and of itself.In previous times this has been a “washing machine” cycle where people get tossed in and every so many thousand years some people get out while the rest are recycled.This time may be the fulfillment of those cycles where the entire bunch gets released at once.The idea is that if people are not prepared for this they will experience the chaos of a simultaneous clearing and healing.Instead of painful healing spread out over months or years, it would all occur in a matter of days or weeks.This is the time to take steps to represent ourselves. The follow the herd mindset is how people are manipulated and controlled mentally and physically.We have to connect and work together, really work together, not just messaging and posting meme pictures which is just another way of control.To the credit of this process it can be said that truth is spreading so fast because of that ability to convert the topics and knowledge into meme images and other quick bits of information that can be shared and understood within seconds. Instead of minutes to hours of discussion or documentary, condensed images with captions can describe a complex situation to the fullest of its true exaggeration without having to explain hours of backstory and research.However, few people own it all. Fewer people still have advanced technology that allows for a “futuristic” existence without the problems people are challenged by today. And even fewer people than that have the knowledge of the true human history.What is not realized is that the shock of Humanity finding out about the origins of time and space is going to be far greater than figuring out that they were manipulated this entire time by people with greater knowledge.The real truth under all the supposition is a complete disconnection from every school of thought which is currently accepted. It’s completely beyond normal into the realm of paranormal, time loops, altered consciousness and DNA, soul-knowledge, eternity, quantum superimposition guided by imagination and attitude, and that it all happens right here… but is invisible to the 5-senses .Currently the development of that which interprets energy from beyond the 5-senses has been purposely ridiculed and categorized to push people away from finding the truth so easily. One could say this is for control as much as it is protection of the current system as much as it is for a challenge of their own spiritual values.To take this a step further, imagine we are in a simulator of sorts, designed by the intelligence behind the “Multiverse” (or even something more personal).If so, then what does it mean when people fight and hurt each other for material things? Do we say, they were just doing what they needed to or they are just in a simulator?Or is this is a way of seeing who would do what, in what kind of situations, in a way that cannot be repeated, or in a way that cannot be falsified without dumping self-responsibility?Or it may be a test, a manipulation, a challenge or a learning process all at once using confusion and fear to control Humanity.In truth we have the capabilities and tools to remove this mental confusion and fear. In reality the mind is naturally beyond polarity as it is capable of abstracting from eternity.Right now or minds are polarity based and this is the source of disturbance in our world. By doing so we are trading that transcendence, our true heritage, for a polarized world by being disconnected from that eternal source which is the emanation of the soul and spirit through our body.That is also why people say there are souled beings and non souled here because the other beings came from a Universe that is not connected with the source of this Universe. It is as if they cut across timelines to get to us.Our completion out of polarity, our expansion out of paradox and into eternal meaning, would not be the same as the non-souled. Actually one would cancel out the other, for if we reached completion and they did not then their occurrence of interjection would be experienced as a time loop which does not complete.If they reached completion and ours did not, we would experience the completion cycle of another Universe’s being which would not resonate or return “soul-knowledge” to the source people are connected with.This is in part why people are saying “ascension” is the way out. Because if the time loops are severed then it would be a planck time fractal repetition into infinite and those without the ability to navigate “hyperspace” would become one of with the void. If this is to happen or either way, one must learn to navigate the spiritual world because that is the real playing field.The big issue is not that we have stuff happening on Earth.The issue is that the real playing field, the spiritual planes, have been targeted and infiltrated as far as this imbalance goes. When we become aware of the knowledge of experience on the soul level we can bring harmony back to the overall system and when enough people do this “the grid” (or spiritual soul-trading system) cannot work with the harmonious energy.There is no way to use harmonious energy and manipulate it to serve a personal need, it always serves the whole. By Augtellez  '"}, "time": 1742563490.6951587}