{"duration": 0.08281946182250977, "input_args": {"text": "'MANILA  —   President Rodrigo Duterte of the Philippines suggested on Friday that 19 police officers accused of killing a politician should spare themselves a lengthy trial and plead guilty because he planned to pardon them anyway. “I can’t leave these officers behind. If they are convicted? No problem,” Mr. Duterte said. “They can call me and say they have been convicted, and I’ll tell the judge to pardon them all. ” He said the officers would be not only reinstated, but also promoted. Mr. Duterte’s comments were criticized by opposition leaders and human rights groups, who have accused him of abusing his powers in a monthslong crackdown on drug dealers and users that has left thousands of people dead. Leila de Lima, a senator and former rights commissioner who was jailed in February on what she says are   charges, said Mr. Duterte’s pledge to free the police officers was “extremely disturbing. ” “It’s crass impunity,” Ms. de Lima said in a statement smuggled out of jail. Senator Paolo Benigno Aquino, an opposition leader, said Mr. Duterte’s comments meant there were some “individuals and groups who are above the law. ” He added: “It would be better to let justice takes its course before issuing promises. ” The 19 officers were arrested after the November shooting death of Rolando Espinosa Sr. the mayor of Albuera, a town in the central Visayas region. Mr. Espinosa was killed in his jail cell after being arrested on a drugs charge in October. Mr. Duterte had accused him of being one of 150 local officials involved in the drug trade. The officers, led by Marvin Marcos, a police superintendent, have claimed that a gunfight broke out in the provincial jail after the mayor pulled a gun, which he had concealed in his cell, on the men who were there to serve a search warrant. Mr. Espinosa was the second politician on Mr. Duterte’s list killed by officers in less than two weeks. In October, another mayor, Samsudin Dimaukom, was gunned down by police officers after reportedly firing at them at a checkpoint. A Senate investigation into Mr. Espinosa’s death said both mayors had been killed under “suspicious circumstances. ” The Senate report said 19 officers were guilty of a “grave abuse of authority,” adding that Mr. Espinosa’s death appeared to be premeditated and carried out by people who wanted him silenced. Despite these findings, Mr. Duterte has stood by the officers and insisted that scores of mayors and village chiefs, including Mr. Espinosa, have profited from the drug trade. “Why do you grieve for the son of a bitch?” Mr. Duterte asked on Friday at an event commemorating Women’s Day at the presidential palace. “He destroyed half of the Visayas. How many have been left crazy and unattended, their family already gone? Then you grieve for this idiot who was killed inside his cell,” he said, adding an expletive. Mr. Duterte said it was well within his presidential powers to grant conditional or absolute pardons with agreement from Congress, which is controlled by a majority of his allies. The case highlights Mr. Duterte’s attempts to silence and kill not only criminals actively involved in the drugs trade, but also leaders who may oppose his policies and tactics.'"}, "time": 1742561732.1263833}