{"duration": 0.04053926467895508, "input_args": {"text": "'Reverend Al Sharpton thinks that in order to win elections, Democrats must stop trying to get the “Archie Bunker” vote and instead focus on maximizing the party’s minority vote.  During a Friday afternoon MSNBC appearance, Sharpton railed against elected officials and consultants who want Democrats to “try and become elephants with donkey skin on,” emphasizing that it was pointless to appeal to “Archie Bunker” voters who support President Donald Trump. Sharpton insisted that these “Archie Bunker” voters will never cast their ballots for Democrats. He made his remarks a day after Republican Greg Gianforte won his special election for Montana’s open House seat by six points even after he allegedly   a reporter the day before the election. In a recent interview with BuzzFeed, Sharpton said Hillary Clinton’s biggest mistake in 2016 “was that she did not mobilize in the black community. ” “You lost Michigan, by what, 15, 000, 20, 000 votes? You could’ve got that if you mobilized two housing projects or three churches,” he told the   outlet. “Never touched them. So in many ways I think that the whole question of, ‘Oh we gotta reach out to the Appalachian and the blue collar workers and stop the identity politics’  —   well, that’s one strategy. But what I’m saying is that you never worked your own base. You took your base for granted, so it’s not that you need to go another way, you didn’t identify with those in identity politics, that’s why you had the lowest turnout you had around blacks in a long time. ” Sharpton said though Clinton came to his National Action Network convention, her campaign “never engaged us in the campaign. ” “And I think that’s where they did the wrong math in the Clinton campaign. They assumed that we’ll go get all of this because everybody will stay here: young voters, black voters, Latino voters, like Obama, and it didn’t happen,” he said. As Democrats plot their electoral strategies for 2018 and 2020, the party is split between those who want to double down on identity politics and those who think Democrats need to appeal more to   white voters.'"}, "time": 1742561652.9972293}