{"duration": 0.11085176467895508, "input_args": {"text": "'Go to Article \\nNothing ought to be plainer, and yet nothing is more obscured, than the meaning of the Islamic concept of jihad. Even if its meaning were at all unclear, every day Islamic jihadists do their best to remind us of what it is. The confusion arises, of course, from the fact that jihad and related concepts are the object of a massive misinformation and disinformation campaign, making books such as William Kilpatrick’s The Politically Incorrect Guide to Jihad so vitally necessary. \\nKilpatrick covers that propaganda campaign ably in this lucid and genial book, which not only explains from Islamic texts and teachings why ISIS and Boko Haram (and other jihad terror groups) are not only not un-Islamic, as is frequently claimed, but quintessentially Islamic – for the Qur’an, as Kilpatrick explains, commands jihad, and Muhammad, who is considered in Islamic theology to the perfect man, to be imitated by Muslims whenever, wherever, and however possible, not only commanded jihad warfare but waged it himself. \\nKilpatrick also helpfully takes up common objections to this line of argumentation – notably the question of why, if Islam really teaches warfare against unbelievers and their subjugation under the hegemony of Islamic law, most Muslims are peaceful. “Peaceful Islam,” Kilpatrick points out, “which Western leaders are counting on to win out over the more violent versions touted by the terrorists, is a holdover from the long-dead colonial era.” Indeed so: the formulation of jihad as primarily an interior spiritual struggle was touted by Islamic scholars at the height of the colonial period, so as to allow for accommodation of the colonial occupiers, who weren’t going away in the foreseeable future. Once they did abscond, however, the conditions that called forth such accommodative teachings no longer existed, and Saudi-funded jihad preachers traversed the globe calling Muslims back to jihad, “the forgotten obligation” of warfare against unbelievers. \\nThe Politically Incorrect Guide to Jihad shows that this transition had nothing to do with poverty among Muslims or discrimination against them, and indeed, that no conciliation or concession on the part of Western non-Muslims will ever blunt the force of the jihad imperative, since it is rooted in Islamic theological principles that are not susceptible to the prevailing political winds. \\nThe most valuable sections, however, of this useful and engaging book are the second, “Jihad Without Bombs,” and the third, “Defeating Jihad.” For even as violent jihad becomes an increasingly common feature of the Western landscape, more insidious and damaging in the long run may be the stealth jihad that proceeds due to the appeasement policies that Western governments indefatigably pursue, and the politically correct straitjacket on the public discourse that has for well over a decade now hindered, and usually prevented outright, honest discussion in the mainstream media of the nature and magnitude of this threat. Kilpatrick points out that “according to Reporters Without Borders, the U.S. has dropped to forty-sixth place in press freedom.” One of the principal ways in which the press today reveals itself to be a mouthpiece of moneyed elites is in its deliberate attempts to obfuscate the ideological roots of the jihad threat, and its ongoing campaign, every time there is a jihad attack, to inundate us with articles explaining that Islam is really quite wonderful and has nothing to do with this violence, nothing at all. \\nBut Kilpatrick details how the media and governing elites are not in the least singular in appearing determined to foster complacency and ignorance among the people they should be enlightening and protecting. The churches are in on the act as well: “Christians,” writes Kilpatrick, “have been lulled into complacency by the oft-repeated emphasis on the similarities between their faith and the faith of Muslims” – an emphasis all too many Church leaders, including, of course, Pope Francis, relentlessly hammer home, heedless of the danger in which they are putting their flock by leaving them intellectually, spiritually, and physically defenseless in the face of an advancing and growing threat. \\nThat’s why the most apposite sentence in this entire book is the second sentence of the chapter headed “Strategies for Victory”: “First we’ve got to get serious.” The West suffers from a collective lack of seriousness that could, in the end, be fatal. The frivolity is at the top, fueled by globalist internationalists who are using the complacency the media, the government and the Church are fostering for their own ends. The Politically Incorrect Guide to Jihad is the perfect book for those who don’t know just how bad things are, and how likely they are to get even worse – as well as for all who wish to chart a way out of this madness. It can be done. William Kilpatrick does it, quite well, in this book.  '"}, "time": 1742562800.7476711}