{"duration": 0.02348470687866211, "input_args": {"text": "'The Utah state legislature has passed a joint resolution calling for a return to federalism in general, and, in particular, the end of the federal Education Department. [The measure passed the Utah State House with a vote of   and the State Senate,  . It was enrolled on March 17.  State Rep. Ken Ivory sponsored HJR 017, titled “Joint Resolution to Restore the Division of Governmental Responsibilities Between the National Government and the States. ” The resolution “urges the President of the United States and Congress to recognize state authority and take action to restore power to the states. ” The measure specifically urges that Congress end the federal Education Department and block grant funds for education to the states: WHEREAS, the [federalism] Commission received the following summary of federal overreach: EDUCATION, The resolution also: In addition, the resolution “encourages other states to join with the state of Utah in documenting issues of federal overreach. ” Two bills have been introduced into Congress that call for the abolishment of the U. S. Education Department. In February, Kentucky Republican Rep. Thomas Massie introduced H. R. 899, a measure that contains only one sentence: “The Department of Education Shall Terminate on December 31, 2018. ” North Carolina Rep. David Rouzer (R) introduced another measure in March, H. R. 1510, that “proposes a responsible dismantle of the Department of Education by reallocating its billions in funding to be proportionally distributed to the respective states to be used for any education purpose as they see fit. ” President Donald Trump recently signed legislation that rolled back two   education regulations, one regarding teacher training programs and another focused on state requirements in meeting some directives of the federal Every Student Succeeds Act (ESSA) which was enacted in 2015 to replace No Child Left Behind.'"}, "time": 1742628494.474888}