{"duration": 0.03234457969665527, "input_args": {"text": "'GOP: We Will Be United Against Any Supreme Court Nominee Of Hillary Clinton (VIDEO) By Karen Shiebler on October 27, 2016 \\nWhen Supreme Court Justice Antonin Scalia died last February, it threw the United States Supreme Court into chaos. The unexpected death meant that the Court was reduced to only eight members, making the likelihood of tie votes a real possibility. \\nA tie means no decision, rendering the Supreme Court essentially powerless. \\nPresident Obama quickly nominated a replacement for the super conservative Scalia. He chose the very moderate Judge Merrick Garland for the position. He hoped that his choice of a middle-of-the-road, white male might soften Republican opposition to the appointment. \\nNo such luck. As stiff necked as always, Senate Majority Leader Mitch McConnell (R-Ky) dug in his heels and refused to allow the Senate to even hold a hearing on Garland’s nomination. \\nWhy, you ask? Because Sen. McConnell and the rest of the GOP leadership insisted it would be better to allow the next President to choose the new Justice. \\nDemocrats were frustrated, but there was nothing to be done. The Republicans wanted to wait for the “next President,” so that’s what would happen. \\nNow, however, to the surprise of absolutely no one in the word, the GOP is backing away from its own proposal. It looks more and more likely that the “next President” will be Hillary Clinton, and the Republicans want to eat their words. \\nLast week Sen. John McCain (R-Az) said this : “I promise you that we will be united against any Supreme Court nominee that Hillary Clinton, if she were president, would put up. I promise you.” That shocking statement was at first denounced by some in the GOP, but now it is gaining support within the Party. Some conservative legal scholars are giving their support to the outrageous idea. Ilya Shapiro of the Cato Institute says that the Senate would within its legal rights to simply refuse to approve any nominee of the Democratic President. He writes that the Constitution is silent of the question of whether or not the Senate is required to fill vacant seats on the Court. Other legal experts agree that the Constitution would technically allow the Senate to leave the Court essentially powerless, with eight seats divided between the two parties’ points of view. Most also agree that leaving the Court divided would be disastrous. Justice Sonia Sotomayor said : “ I t’s much more difficult for us to do our job if we are not what we’re intended to be ― a court of nine.” This level of obstructionism is completely unprecedented in American history. If in fact the Republicans chose to ignore any nominee, no matter who it might be, then they are stating an intention to upset the entire balance of power in this country. Republicans love to refer to the Founding Fathers, and they love to claim that they adhere to the principals those founders introduced. To eliminate one entire branch of our three branch government system would be far beyond irresponsible. It would be completely unAmerican. Watch here as CNN’s Jeffrey Toobin discusses the Republican threat. \\nFeatured image by Matt Wade via Flickr . Available through Creative Commons Attribution Share-Alike Generic license 2.0 About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742628540.5821342}