{"duration": 0.015854597091674805, "input_args": {"text": "'This is Why You Should NEVER Put Crocs On Your Feet Again Ξ [November 2, 2016] BLOG He Was Walking When He Saw This Penny… So He Picks It Up And Realizes It’s Actually A Very Rare Coin posted by Eddie Most of us walk down the street, see a penny, and leave it there. Pennies are like the ‘extras’ of our society; nobody really wants them. In fact, the US government has even discussed getting rid of pennies for good, but it has yet to happen. One Reddit user thought he had just another normal penny, until he took a closer look at it. There are scores of stories of people finding old coinage, but few of somebody finding a blank penny! That’s right, this Reddit user came across a penny with no face on it. I guess Abe Lincoln had to go for a walk. Turns out that “blankface pennies” are not super rare, but they are a cool find. When a minting press misses a coin to be stamped, it is left without an imprint on it, and thus looks like the penny below. Minting presses typically end up giving these coins away on tours because they are not up to par with the rest of their production. Here is a side by side comparison of an old and new penny, in case you forgot what the face is supposed to look like: Other Reddit users responded with much vibrancy, saying things like, “I never wanted a penny more!” or “That looks super cool! Nice find there.” As it turns out, blank face or “blank planchet” pennies sell for between $1 and $2, thus making them a 10,000% return on investment! According to About.com, “A blank coin, technically called a blank planchet if it has an upraised rim on it, is worth a few dollars, perhaps $2 to $4 if it’s clad, more if it’s silver. The Sacajawea, Presidential, and Native American Dollar coins all use the same type of planchet. These coins are worth anywhere from twelve dollars to fifteen dollars.” The value of blank face coins will also vary depending on if the coin has a rim or edge on it. About.com says, “If your blank coin doesn’t even have the upraised rim yet, it’s technically a coin blank. If it is made of silver, it is almost impossible to authenticate, but if it’s clad, an expert in error coins could probably authenticate it, in which case (if authentic) it’s worth maybe $50 or more.” If you would like to see more “error coins” and learn more about blank planchet pennies, check out the video below and let us know your thoughts on this unnaturally smooth coin! \\nSource:'"}, "time": 1742628509.8887467}