{"duration": 0.03195929527282715, "input_args": {"text": "'On Wednesday, for the second time this month, someone called the Jewish community center outside Wilmington, Del. and said a bomb was on the property. For the second time this month, children were evacuated from schools, gym patrons had their workouts interrupted and police dogs searched the campus. And for the second time this month, it turned out to be part of a frightening nationwide hoax targeting Jewish facilities. “It’s concerning, it’s frustrating,” said Seth J. Katzen, the chief executive of the Jewish Federation of Delaware, whose staff trains several times a year for emergencies. “But as in any J. C. C. across the country, safety and security is our primary concern. ” There were as many as 27 bomb threats on Wednesday at Jewish centers in 17 states, according to the J. C. C. Association of North America. Last week, 16 Jewish facilities received bomb threats. No injuries were reported, but nerves were rattled and routines disrupted. As in other places, the police in Delaware said they were investigating and were in contact with the federal authorities. An F. B. I. official said the bureau and the Justice Department’s Civil Rights Division were investigating “possible civil rights violations in connection with threats” to Jewish community centers across the country, but declined to provide further details. Jewish leaders called the threats a sickening sign of the times, but said individual centers had trained to address them. Both Wednesday and last week, a national alert system for leaders of Jewish centers was activated as the menacing calls poured in. After the threats last week, Jewish leaders said they had held an online training session with law enforcement officials that included tips on how to respond to bomb threats. Jewish community centers “have prepared for situations like this,” said David Posner, a vice president with the J. C. C. Association who helps local centers refine their security protocols. “It’s unfortunate, but it’s necessary. ” In Birmingham, Ala. where a call about a bomb led to an evacuation on Wednesday, Betzy W. Lynch said the wave of threats “reinforces the importance of the work” of the centers across the country. “We are required to look at these things and take these threats very, very seriously, but at the same time, our goal is to improve the world and build relationships with people,” said Ms. Lynch, the executive director of the Levite Jewish Community Center in Birmingham. Lt. Sean Edwards, a spokesman for the Birmingham Police Department, said that the call on Wednesday appeared to be a robocall and that he believed federal officials were investigating. He said the Birmingham authorities had not increased patrols around the center. “We’re keeping our eye on it,” Lieutenant Edwards said, adding that new intelligence from the F. B. I. could lead to changes. The threats led to calls for heightened awareness at Jewish facilities. The   League issued a security advisory and urged Jewish institutions “to take these threats extremely seriously. ” Mr. Posner, of the J. C. C. Association, said local leaders were heartened by the law enforcement response but were still rattled by the experience. “They can do damage without actually even having to plant a bomb, which I believe is what they are looking to try to do,” he said. Leslie M. Sax, the executive director of the Gordon Jewish Community Center in Nashville, which, like the center in Delaware, has received two threats in two weeks, acknowledged that the calls had been unnerving. “If their goal is to incite fear and disrupt our business, they’ve done that,” she said. Ms. Sax, who declined to discuss specific security procedures in Nashville, said officials remained uncertain of whether the threats signaled troubles that might linger. “We’ve had two in two weeks, so we’re starting to question, ‘Is this the new norm?’ But we don’t know that,” she said. “We haven’t had enough time to even talk about it, but I think people are disheartened and a little frustrated. ”'"}, "time": 1742628600.0091603}