{"duration": 0.050322771072387695, "input_args": {"text": "\". This is Why Your Vote for President in the U.S. Doesn’t Count Do you think your vote for president in the United States counts? Think again… Ultimately, the Ele... Do you think your vote for president in the United States counts? Think again… Ultimately, the Electoral College votes determine who becomes president, not the majority or popular vote. So, what is the Electoral College? The Electoral College process consists of the selection of the electors, the meeting of the electors where they vote for President and Vice President, and the counting of the electoral votes by Congress. The Electoral College consists of 538 electors. A majority of 270 electoral votes is required to elect the President. (1) The popular vote, on the other hand, is to appease the masses in thinking that they actually have a say in who gets elected. The above image is from NBC affiliate WRCB TV in Chattanooga, TN who apparently already have the results from the election that hasn’t occurred yet. (2) So, how is this possible? In 2012, the National Defense Authorization Act (NDAA) legalized the use of PROPAGANDA on the American public. (3) This includes ANYTHING the mainstream media “reports” including the election results before they happened. This is reminiscent of the BBC announcing that World Trade Center building 7 collapsed before it actually collapsed on 9/11. (4) Related: British Man Won Law Suit Against BBC for 9/11 Cover Up As reported by Top Right News and other outlets, during a recent interview with Bloomberg News, Soros – a Democrat mega-donor – openly admitted that Trump will win the popular vote in a “landslide.” However, he said that none of that would matter, because a president Hillary Clinton is already a “done deal .” In the interview, which is now going viral, Soros says with certainty that Trump will take the popular vote , despite what the polls say now (which are completely rigged to oversample Democrats), but not the Electoral College, which will go to Clinton . When the reporter asks if that is already a “done deal”– that Clinton will be our next president no matter what – Soros says “yes,” and nods his head. (5) George Soros is most likely one of the main cogs in the shadow government . Look no further than all of the money his “Open Society Institute” donated to “ Black Lives Matter ” (6). His main agenda is to keep America living in the premise of “Divide and Conquer”. As long as America is divided, we cannot come together under a united cause. A George Soros company, Smartmatic, has provided voting machine technology in 16 states including battleground zones like Arizona, Colorado, Florida, Michigan, Nevada, Pennsylvania and Virginia. You can read more about George Soros and his dark allegiance here . Other jurisdictions affected are California, District of Columbia, Illinois, Louisiana, Missouri, New Jersey, Oregon, Washington and Wisconsin. Its website includes a flow-chart that describes how the company has contributed to elections in the U.S. from 2006-2015 with “57,000 voting and counting machines deployed” and “35 million voters assisted.” After this report’s publication, Smartmatic updated its website to remove the flow chart and declare that “Smartmatic will not be deploying its technology in any U.S. county for the upcoming 2016 U.S. Presidential elections.” (7) I’m not buying it. Are you? My “vote” is for a council of elders to replace ALL governments and politicians . The current system is corrupt, broken, and outdated. It's time to evolve! (8) Source & References:\""}, "time": 1742563576.4003808}