{"duration": 0.10732150077819824, "input_args": {"text": "'November 10, 2016 Next Steps: Clean Up The Democratic Party, Oppose Trump \\nPeople have now learned and accepted that Trump is inevitably the new president of the United States. They try to figure out what that means. We do not know, neither does anyone else. A lot of rumors and speculation are circling of who will take up this or that job in a Trump administration. These rumors are mostly created by those who would like that job, or their personal lobbies. They should be ignored. \\nThe mainstream media is barely able to issue a mea culpa for their extreme pro-Clinton campaign and total failure of reporting the real state of the union. It is now looking for obfuscations like claiming no one could have gotten it right. That is a cheap excuse for incompetence. \\nIt is astonishing that THE media outlet that did the most to shine lights on Clinton is ignored in any of the main stream after-election reporting. I am talking of Wikileaks and Julian Assange who did their very best, under high personal risk, to report the truth about Clinton\\'s and the DNC\\'s utter corruption. A big thank you to them! \\nClinton in her very late concession speech, found no words for her culpability or that of the campaign she ran. But the loss of the running is her personal failure. The \"bernie bros\" and \"deplorables\" thanked her hostility by not showing up to vote. She had 6 million votes less than Obama while Trump got about the same number as Romney! Instead of focusing on Trump\\'s disastrous economic program she ran a warmongering \"blame Putin\" campaign. Her economic program was tinkering on the margins of the neoliberal status quo. Certainly not what voters in difficult financial situations, and there are a lots of those in today\\'s U.S., needed to hear. There are now attempts to get Clinton pardoned for breaking classification laws and rules with her private email server as well as for her tax cheating, private slush fund \"charity\", the Clinton Foundation. If the Democrats want to keep at least some appearance of uprightness they should fight all such attempts. Let her pay a very heft penalty for her shenanigans. \\n  apparatus is corrupt and was completely on Clinton\\'s side. It cost the party the presidency as well as the House and any progress in the Senate. I find it very likely that Sanders would have won the primaries if the party apparatus had acted as neutral as it should have. He had a much better chance of beating Trump. With Sanders as candidate in the general election House and Senate seats would have been easier to keep or to win. There is an urgent and thorough cleanup needed in the party from top to bottom. Sanders should be given the lead of the party and be tasked to again win a majority in the House and/or Senate in the 2018 midterm election. \\nTrumps true program will now come to the fore. A lot of stuff he said during the campaign will soon be forgotten. His economic program is a repeat of Reaganomics with a dose of isolationism in trade. How that is going to work out with the pivot to Asia and countering China is a mystery . His stand against Muslims was fake, as he let the embassies of the Gulf states know early on. \\nThe military will get more money for lots of funny programs. That is nothing new. It just build some $7.5 billion a piece battleships solely for their new, very special guns which now will not be used because their special ammunition is, at $800,000 a shot, too expensive. A total waste of money but at least it paid for some good jobs. (More jobs could have been created with that money in more important, non-military programs.) \\nTrump will cut taxes for big enterprises and the rich. He will cut social programs. The general budget will go deep into red. In a few years he will have to, just like Reagan, increase taxes to regain some budget balance. \\nHis campaign unleashed a new wave of racism. Racism had not vanished - indeed it was very much in the open during Obama\\'s time. But open hostile incidents against \"the other\" will probably increase. It will be difficult and take some time to reign it in again. \\nIt will be important to oppose Trump as much as possible. He is a somewhat megalomaniac and he currently has party majorities in both houses. He will have to be taught that not everything he tries is good or even possible. Trump will want a reelection and another four years as president. He can face opposition on the ground, from people who voted for him, if those people can see a plausible alternative . Clintonian tinkering on the edges of the status quo is no such alternative. There needs to be broad stroke economic policy, plausible and explainable, that offers a better world to them. If the Democrats, or a third party, can develop and present such a program there is good chance that the era of Trump will be a short unremarkable chapter in the history books.   10, 2016 at 02:09 PM | Permalink'"}, "time": 1742564598.4472148}