{"duration": 0.06802606582641602, "input_args": {"text": "'Posted on November 4, 2016 by Gilad Atzmon \\nIn her recent Washington Post Article , Jewish academic Cheryl Greenberg makes one valid observation. Trump’s criticism of the Jews is far more subtle than his disapproval of other groups and identities (Mexicans, Muslims, Women etc). Though Trump is not known for pulling his punches, when it comes to the Jews, Trump chooses his words very carefully. Trump, according to Greenberg, is so careful “that it’s not clear that Trump himself fully understands the implications of what he’s saying.” I guess that the Jewish academic couldn’t restrain herself from looking down at the Goy candidate. \\nGreenberg sees Trump as a puppet-master who controls his audience by means of ‘dog whistling.’ “Trump’s references to money, bankers and international conspiracies appear to be deliberate anti-Semitic dog whistles, and his alt-right supporters recognize (and celebrate) that.” \\nGreenberg elaborates on her observation, “first of all, dog whistles serve when overt expressions are not an option; they communicate to those who are familiar with the conspiracy theories but maintain plausible deniability.” According to Greenberg, when Trump wants to communicate a message about the Jews, he uses an indecipherable code intelligible only to half of the Americans . . . Greenberg and the ADL. \\nIf Greenberg is correct, if Trump says ‘international Bankers’ but really means Jews, then both the Republican candidate and half of the American people are fearful of the Jews. They must very well understand what a confrontation with Jewish institutions may entail. They know that, in America, criticism of Mexicans, Women, and Muslims is a kosher territory but even a subtle criticism of Jews may cost them dearly. One may wonder, how did this happen? What is the substance of that magical power that empowers half of Americans to speak in codes when they think about Jews? \\nGreenberg seems to raise the right question just to come up with the wrong answer. “Why would anti-Semitism not be an overt option, while racism, sexism, and xenophobia are?” \\n“Americans are less willing to accept blatant anti-Semitism than racism,” Greenberg’s answers. \\nWhat Greenberg really wants to say is that Americans can be racists and can say whatever they like about whoever they want. But when it comes to Jews, they refrain. Americans do know very well the geography of the boundaries of correctness. Jewish power is for them a taboo, at least momentarily. America and Americans are fully aware of the enormous power that is bestowed in the hands of just a few Jewish oligarchs within the ubiquitous industries of media, finance, politics, and culture. \\nAmerica would have loved to dissolve the situation peacefully but it can’t. Jewish power can’t be contained or suppressed because we are not even allowed to allude to it, let alone point it out. \\nJewish power is defined as the power to silence criticism of Jewish power. Jewish power, as such, is a ticking time bomb. It is a unique form of self-destructiveness. The history of the Jews proves this point. Time after time it is Jewish power that sets the path towards a glamorous Jewish golden age that leads to the most severe tragic consequences. \\nThe Jewish phobia of anti-Semitism is not driven by fear of the gentile. It is actually the other way around. The Jewish fear of anti-Semitism is the result of Jews being fearful of their own might. Jews tend to recognise that there is something in themselves that evokes animosity from others. This is the true meaning of the Jewish “Pre Traumatic Stress Syndrome.” It is the acceptance that from here forward, things can only get worse. Many Jews see in Trump’s popularity a symptom of a fatigue of their own power. They interpret the nostalgic yearning for ‘America being great’ as a pining for a Christian past. Something that predates Goldman Sachs’ and Soros’ dominion. The Jewish aggression towards Trump can be realised as an expression of Jewish guilt. Yet, Trump himself has very little to do with it. He married his daughter to a Jew. He trades with Jews, he loves Israel. He is almost as Jewish as the Clintons. \\nGreenberg is optimistic. For her, Trump’s popularity is “the final gasping of white supremacy.” His voters—pretty much half of the American people—are dogs reacting to a man with a whistle. I am not as optimistic as Greenberg. I think that exploring such contempt towards half of the American people in the name of a vague progressive mantra is a very dangerous game. It suggests to me that progressives have reached a state of complete detachment. \\nGilad Atzmon is an Israeli jazz musician, author and political activist. His new book, “The Wandering Who,” may be ordered from amazon.com or amazon.co.uk . '"}, "time": 1742563988.0331903}