{"duration": 0.04733538627624512, "input_args": {"text": "'Share on Twitter \\n36-year-old Chrissy Metz has finally gotten her breakout role as Kate Pearson, a woman who\\'s struggling with her weight, on the new hit show “This Is Us.” \\nThe show revolves around the lives of several couples whose lives intertwine in unexpected ways. Like her character, Metz has also struggled with her size ever since she was a little girl. \\nIn an interview with People Magazine this week, Metz revealed that she has felt the exact same pains that 8-year-old Kate experienced in the flashbacks sequences shown on TV. \\nFor Metz, even as a child her weight “was always something I was cognizant of. I’ve had pictures of when I was 3 and 4 years old, and I’ve always been chubby.” \\nThen she discovered that her weight was something she was supposed to be ashamed of. Image Credit: David Livingston/Getty Images \\nIn fact, she was enrolled in Weight Watchers at just 11 years old: \\n“I remember being at Weight Watchers at, like, 11 years old and my mom just trying to figure it out for me. \\nIt’s one of those things where it’s heartbreaking because, as a parent, you want your child to have the best life possible and you want them to be protected and in this little bubble where everybody finds them to be beautiful and perfect and their lives to be amazing. \\nBut that’s not always the case.” \\nWhen she was young she would starve herself, but then as soon as she had the opportunity she would binge on unhealthy food. \\nThe resulting weight gain perplexed her parents, because she hid her binges from them: \\n“I would not eat, and then, of course, I would get so hungry I would binge...and it was difficult because my parents were like, ‘I don’t understand, if you’re not really eating, why are you gaining weight?’ I would be at one of my good friend’s house and her mom would literally make us a tray of brownies and split it down the middle, and we would go to town.” Image Credit: David Livingston/Getty Images \\nAt 30, Metz realized that she doesn\\'t have to stress and worry about what others think about her body. She called that a life-changing moment: \\n“I had this epiphany that my life is my own and my choices are my own.” \\nPrior to “This Is Us,” Metz appeared in only a few things , and certainly not as a lead actress. \\nShe played Ima \\'Barbara\\' Wiggles on “American Horror Story: Freak Show,” described as the “fattest woman of all time” by the show. \\nEven then, she had to wear a fat suit on set: \\nHer newfound fame and honest portrayal of a woman struggling with her weight has not gone to her head, though. She\\'s staying grounded and grateful: \\n“I just feel really grateful that I can pursue my dreams and also reach people in ways that I never expected.” \\nMetz told Refinery 29 last month that women have already reached out to her and praised her touching portrayal of Kate. \\nIn reality, 67% of American women are a size 14 or higher, but these women only make up about 2% of the images portrayed in the media, according to Refinery 29 . \\nResearch has also shown that dieting is more likely to cause obesity than solve it, according to the New York Times : \\n\"After about five years, 41 percent of dieters gain back more weight than they lost. Long-term studies show dieters are more likely than non-dieters to become obese over the next one to 15 years. \\nThat’s true in men and women, across ethnic groups, from childhood through middle age. The effect is strongest in those who started in the normal weight range, a group that includes almost half of the female dieters in the United States.\" \\nWhile she\\'s not the first, Metz\\'s performance has the potential to open more doors for plus-sized actresses who are trying to find their place in Hollywood. Other actresses such as Rebel Wilson, Queen Latifah, and Melissa McCarthy have also helped pave the way. '"}, "time": 1742628426.0595083}