{"duration": 1.1863155364990234, "input_args": {"text": "'The grass of a baseball field in Prospect Park shuddered under the blades of a New York Police Department helicopter on Friday afternoon. Dust flew in the air. Soon, Mayor Bill de Blasio clambered aboard. In a car, it might have taken 30 minutes or longer for him to make the roughly   drive from his old Brooklyn stamping grounds to an event in Queens. By air, the trip  —   a fantasy of nearly every New Yorker ever caught in traffic on the   Expressway  —   was considerably shorter. But the headache it caused Mr. de Blasio on Monday might not have been worth the trip, as a photograph and a video of the copter incongruously parked in the middle of a city park ricocheted around the internet, and reporters waited outside City Hall to ask him about it. The attention to his flight presented a   situation for Mr. de Blasio, a Democrat who has been criticized for arriving late to events and now finds himself justifying his attempts to arrive on time. The mayor, like his predecessors, has occasionally availed himself of the Police Department’s helicopters to get to important events. Former Mayor Michael R. Bloomberg, an experienced helicopter pilot, did not hesitate to use city helicopters when necessary, or his own private helicopter. In 2012, Mr. Bloomberg, a political independent, was caught using a helipad in Midtown Manhattan for weekend jaunts during times when it was closed. Mr. de Blasio, for his part, has been less of a fan. Last year he told Grace Rauh of the news channel NY1 that riding in a helicopter was “not my thing. ” And in January, he announced a reduction in flights of tourist copters, citing “the nonstop din of helicopters” as a “major    issue for New Yorkers living near heavily trafficked routes. ” Eric F. Phillips, the mayor’s top spokesman, said Mr. de Blasio had flown to Rikers Island to Jacobi Medical Center, to be at the bedside of injured firefighters and to Hofstra University, for the first presidential debate last month between Donald J. Trump and Hillary Clinton, whose campaign Mr. de Blasio has ardently supported. He traveled by plane to campaign for her in Ohio on Saturday. In each case, Mr. Phillips said, the decision to go by helicopter was made by the mayor’s police detail. He described the flights as “infrequent,” and directed questions about the total number of trips to the Police Department, whose officials declined to provide the data, saying it would have to be requested under the state Freedom of Information Law. “The security and transportation of the mayor are determined by the N. Y. P. D.,” the department said in a statement attributed to John Miller, the deputy commissioner for counterterrorism and intelligence. “We do not discuss the specifics of security. ” Besides saying Mr. de Blasio had a “series of meetings,” City Hall officials would not describe the mayor’s preflight activities in Brooklyn, where he regularly travels to go to the gym and also goes for meetings at favorite restaurants in his old neighborhood. His public schedule listed a morning speech and two   radio appearances earlier in the day. “We don’t detail internal or personal meetings,” Mr. Phillips said, raising the possibility that Mr. de Blasio had been engaged in a personal errand that delayed him enough to necessitate air travel over the   Expressway. “He had a series of meetings in Brooklyn. ” Pressed as to whether the meetings were personal or city business, Mr. Phillips repeated himself: “I’m saying he had a series of meetings in Brooklyn, and I’m declining to make public the details of nonpublic meetings. ” Maggie Lehrman took video of the helicopter landing in Prospect Park just before 4:30 p. m. on Friday as she walked her    son in a stroller near 15th Street in Park Slope. “I’ve never seen that before in Prospect Park I’ve lived in Park Slope for a long time,” she said. “I don’t want to judge too harshly. It was definitely unusual. It seemed a little odd. ” The mayor took the helicopter and landed in another city green space, Hunters Point South Park, in Long Island City, Queens, before traveling to a training center in the area for a 6:30 p. m. event hosted by the Joint Industry Board of the Electrical Industry. The administration’s explanation that the police detail had made the decision to use the helicopter recalled the mayor’s response early in his tenure when, after unveiling a traffic safety plan that included lowering of the speed limit on most city roads, his city vehicle was caught speeding. “I have great respect for N. Y. P. D. security training and protocols,” Mr. de Blasio said after the incident, pointing to a remark by the commissioner at the time, William J. Bratton, who said the detail had been moving with the flow of traffic as it was trained to do. “I’m very comfortable with what Commissioner Bratton said, and I refer you to his comments. ” As the mayor arrived at City Hall on Monday afternoon  —   by   sport utility vehicle  —   Mr. de Blasio was asked about his helicopter trip. He declined to comment.'"}, "time": 1742562478.7802331}