{"duration": 0.11241006851196289, "input_args": {"text": "'Good morning.  Here’s what you need to know: • President Obama commuted most of the sentence of Chelsea Manning, the army intelligence analyst convicted of an enormous 2010 leak to WikiLeaks that revealed U. S. military and diplomatic activities around the world. She will be free in five months. The decision will likely come up at Mr. Obama’s final news conference today, along with other legacy issues, like the fight to preserve the Affordable Care Act. A report found that repealing major provisions of Obamacare would cost 18 million people medical insurance in the first year, a number that could increase to 32 million in 10 years. _____ • President Xi Jinping of China continues a visit to Switzerland, with stops at the U. N. in Geneva and the International Olympic Committee in Lausanne. Mr. Xi, who made a forceful argument for free trade, international integration and climate responsibility at the World Economic Forum on Tuesday, appears to be positioning China as a global leader in sharp contrast to the incoming U. S. president, Donald J. Trump. _____ • “Rigged. ” Mr. Trump hit back at a poll that put his favorability rating at 40 percent, compared with President Obama’s 79 percent before inauguration and George W. Bush’s 62 percent. Senate hearings for Mr. Trump’s cabinet picks continue on a packed schedule. And officials are putting the final touches on days of celebrations for his inauguration on Friday, which will also be surrounded by protests. Security costs could  top $100 million. _____ • Australia’s transport minister did not rule out future underwater searches for missing Malaysia Airlines Flight 370, but said that investigators were certain the jet is not on the seabed in the area that searchers had scoured for nearly three years. The decision, while expected, drew criticism from families of the 239 people who were on board _____ • Jay Y. Lee, the Samsung vice chairman, is expected to attend a hearing and then be held in detention  —   possibly overnight  —   to await the decision of a judge in Seoul on whether he should be arrested. Mr. Lee has denied accusations that he paid more than $36 million in bribes to organizations linked to Choi   the unofficial adviser at the center of the corruption scandal that engulfed President Park  . • British American Tobacco is buying all of Reynolds American that it did not already own. The $49 billion deal, if approved by shareholders and regulators, will reshape the global tobacco industry. • General Motors  became the latest company to highlight initiatives following Mr. Trump’s pressure to bolster U. S. manufacturing, announcing a $1 billion investment in American factories. •   the maker of aircraft engines and   turbines, agreed to pay $817 million to resolve corruption inquiries by Britain, the U. S. and Brazil, including accusations of wrongdoing in Indonesia and China. • The New York Times released a review of its newsroom and a blueprint for the future created by a team of seven of its journalists. • U. S. stocks were lower. Here’s a snapshot of global markets. •  Prime Minister Theresa May charted a “clean break” for Britain from the European Union and stressed her country’s determination to regain control of migration. [The New York Times] • A Nigerian fighter jet that meant to strike Boko Haram militants bombed a refugee camp. Doctors Without Borders counted more than 50 dead and 200 injured. [The New York Times] • The widow of the gunman who killed 49 people at an Orlando, Fla. nightclub last year was charged under antiterrorism laws. “She knew he was going to conduct the attack,” a federal prosecutor asserted. [The New York Times] • NASA and the National Oceanic and Atmospheric Administration are expected to announce that 2016 set the record for the hottest year globally. [Climate Central] • The head of Air India was quoted as saying that the carrier planned to set aside seats to allow more protection for women traveling alone. [The Economist] •  Cambodia canceled military exercises with the U. S. for two years, a decision announced weeks after its   exercises with China. [The Cambodia Daily] • Bhutan has struggled to persuade other nations to adopt its Gross National Happiness index as a measure of social ills. [The New York Times] • Fifty years ago this month, Vo Thi Mo led three commando squads against a U. S. Army battalion in the Vietnam War. Here is her story of resilience and survival. [The New York Times] • Maybe don’t skip your workout this morning  —   it just might help your brain grow stronger. • Here is a guide to help you teach young people about philanthropy and offer them the tools to give. • Recipe of the day: For a simple side dish, try braised greens spiced with red pepper flakes. • India’s democracy includes 287 million illiterate people, so party symbols matter. This week, a feud over the image of a bicycle that had split a powerful political dynasty was resolved. • Each spring, poplar trees planted by the millions under Mao blanket Chinese cities with cottonlike balls of fluff. In Beijing, the government hopes to eliminate the fuzz forever. • And we introduce The Long View, in which the historian Jon Meacham looks at books that speak to historical and cultural moments. This first installment looks at the chaotic U. S. of the 1930s. The Oval Office is often used as shorthand for the U. S. presidency, but did you know that fewer than half of the presidents have worked there? During President Theodore Roosevelt’s term ( ) the West Wing was added to hold the executive branch’s growing staff. He had a   office in the addition (now called the Roosevelt Room). Earlier leaders worked in the residence, mostly in what is known as the Lincoln Bedroom. Roosevelt’s successor, William H. Taft, had the Oval Office built and was its first occupant. The design wasn’t novel. George Washington had   rooms in Philadelphia in 1791, allowing him to greet guests circled around him. The pomp mimics an English court tradition called the levée. There was a White House precursor, too. The Blue Room is rounded and used for diplomatic receptions. In the family quarters, there’s a Yellow Oval Room. On Christmas Eve in 1929, the Oval Office was badly damaged in a fire. President Franklin Roosevelt renovated it, moving it closer to the residence. The “commute” is under a minute. Presidents can redecorate, but there are limits. One is that the presidential seal must remain on the ceiling. And there’s an other tradition: the outgoing president leaves a letter on the desk for his successor. Adeel Hassan contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742562202.1116576}