{"duration": 0.052901268005371094, "input_args": {"text": "'On Friday’s broadcast of MSNBC’s “All In,” Representative Maxine Waters ( ) stated that she believes “there was a connection between Donald Trump’s campaign and the Russians” and “I think there is a trail, and I think that the Obama administration has done everything that it can possibly do  …    to make sure that enough people have seen some of the meetings and some of the connections, so that they have something to go on when the investigations are really underway. ”  Waters said, “I’m going to continue to do my work, to do everything that I possibly can, to help connect the dots, to help encourage independent investigation or commission. I’m going to do everything that I can to keep my colleagues interested enough to want to fight to see exactly what happened. Because I believe that there was a connection between Donald Trump’s campaign and the Russians and the Kremlin. And I do believe that those connections are there for a reason. And I think that the work that has already been discovered, that was done, in order to have Trump, should be followed up. We shouldn’t say  —   let our intelligence agency say, yes we discovered that the DNC was hacked, and that efforts were made to help Trump in this campaign and to undermine Hillary Clinton, and that’s it. We don’t have to do anything else. No, this is serious and I think that we must continue this struggle to dig deeper, to drill deeper. ” She continued, “I think there is a trail, and I think that the Obama administration has done everything that it can possibly do, and that’s probably been verified somewhat by the New York Times, to make sure that enough people have seen some of the meetings and some of the connections, so that they have something to go on when the investigations are really underway. ” Waters added, “What we know is that, we can’t trust the AG. We can’t trust the FBI. We can’t trust Comey. We can’t trust Sessions, and so, we’ve got to get an independent overseer of some kind in here to get going with these investigations. ” (  Grabien) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742561773.9460242}