{"duration": 0.0838623046875, "input_args": {"text": "'Comments \\nAs the protests against the Dakota Access Pipeline continue to escalate, the crackdown from law enforcement has grown harsher and harsher. Hundreds have been arrested by Morton County police, many of them without charge, and have had their civil rights violated by shockingly cruel police officers, who are sexually humiliating their prisoners by strip-searching them and leaving them naked in their cells. \\nWhen getting booked at the jail, they were all strip searched, forced to “squat and cough” to demonstrate they had nothing hidden in their rectums, then were put in orange jumpsuits. The treatment was the same for Chairman of the Standing Rock Sioux Tribe Dave Archambault, to a pediatrician from the reservation, Dr. Sara Jumping Eagle, to actress Shailene Woodley, star of the films “Divergent” and “Snowden,” among others. \\nThe use of a strip search for those arrested on trumped-up charges like “trespassing” and “rioting” is a clear intimidation tactic that shows the the United States government still sees Native Americans as savages to be abused. \\nLaDonna Brave Bull Allard told The Young Turks how her daughter was arrested, stripped of her clothes by three male and one female officer, and then left naked in a cell overnight. “They’re targeting our families” she said. Human rights abuses have been widely committed by police and security forces as they try to discourage the protesters. \\nRebecca Kemble, Alderwoman from Madison, Wisconsin, recounts how arrested protesters are beaten and thrown into pieces of the very pipeline they are protesting. “I saw the Marathon County deputy push her down the hill and slam her body and head into the transport van after this.” \\nGeorgianne Nienaber of the Huffington Post knows where to point the finger for these outrageous crimes. \\nSheriff Kyle Kirchmeier is the official who sets the tone for police actions in Morton County North Dakota. He alone determines how prisoners are treated. He holds the authority to enforce humane treatment or encourage cruelty designed to instill fear, humiliation, embarrassment and shame. And shame is the ultimate weapon—utilized by the narcissist in a pitiful attempt to gain control and break the spirit of his victims. \\nThis kind of systematic violence is the way the U.S. government has always treated the native inhabitants of the American continent. Very little mainstream news coverage is documenting these crimes, instinctively taking the side of the corporation plotting to desecrate the sacred grounds of the Standing Rock Sioux in order to make a quick buck off of climate-warming and water-poisoning fossil fuels. We cannot allow the police state to squash the will of the people. \\nListen to LaDonna Brave Bull Allard tell her story here:'"}, "time": 1742562033.3362868}