{"duration": 0.06822657585144043, "input_args": {"text": "'Why Save American Politics? By Daily Bell Staff - October 29, 2016 \\nFour Steps to Save American Politics … Donald Trump has taken a battering ram to longstanding political norms — the unwritten conventions that make governance possible … Immediately after the election, one of the most pressing questions will be how to restore them. To answer that question … what are the minimal norms on which we might agree? Here are four suggestions. -Bloomberg \\nCass R. Sunstein is disturbed that “unwritten political conventions” have not been adhered to in the current presidential election. \\nFrom our point of view, the disintegration of such conventions is good news. Anything that impedes the political system from working in the US is probably a net positive. \\nThe current political system has virtually bankrupted the US and especially the middle class, many of whom have less than $1,000 in savings and over $100,000 in debt. Some 90 million potential workers don’t have formal employment. \\nThe US continues to engage in serial, undeclared wars that have killed and wounded tens of millions overseas. And in the past few years, the military-industrial complex, facilitated by Congress and the executive branch, has embarked on a series of provocations abroad that have heightened tensions with both Russia and China. \\nThe political system itself is held in low repute, with Congressional approval in the single digits. The US justice system and even the executive branch are not held in high regard. \\nYet for some reason Sunstein is worried that “normal” American politics won’t be “restored.” \\nHe makes four points. \\n1: Civility now … Right after the election, the losing and winning candidates should strike notes of humility and grace, and Democratic and Republican leaders should join them. \\n2: Compromise, early and often. 2017 could be the year of splitting differences. On gun control, for example, Clinton has a number of ideas, such as forbidding the sale of guns to people on the terrorist watch list, that many Republicans could accept. \\n3: Identify a set of attractive proposals from “the other side,” and champion them. With a compromise, one party yields to another; it gives something up. But there is an even more appealing possibility, which is to find domains in which the two parties agree with one another, and no one has to yield a thing. \\n4: Ease up on the process for confirming executive-branch nominees. This is more important than it may seem, because the current system, in which nominations are held up for months or even years, discourages good people from entering public service, wastes time and money, creates acrimony, and makes it much harder for government to serve the American people \\nLet’s take these points one at a time. \\nWhy should civility return to a process that has bankrupted the American people, put six million of them in various stages of incarceration and murdered millions abroad in serial, illegal wars? Civility presumably makes the system less dysfunction. Our take: the more dysfunctional the better. \\nWhy should the system seek out compromise? This assumes that compromise will actually be beneficial to those being governed. But compromise merely facilitates the secret goals of those who run the federal political system from behind the scenes – especially banking and military interests. Why ease their way? \\nChampion proposals from the other side? The US is $20 million in debt, is viciously divided and increasingly provides a government that is actively adversarial to the people it is supposed to “serve.” The FBI and IRS are only two elements of governance that have proven dysfunctional in the immediate past. Why support such a system or advance it? \\nConfirm executive-branch nominees? These individuals for the most part ease the way to more effective federal actions domestically and abroad. Yet when one examines what the federal government does, it become hard to make an argument that much of it, or almost any of it, supports the civilian population it is supposed to aid. Why facilitate federal government actions when those actions are most often destructive? \\nSunstein concludes his editorial by claiming that the current rancor in federal government and its heightening dysfunction has made the American people “the real losers.” He suggests that immediately after the election, those involved should rebuild the “institutional norms that have long served the nation well.” \\nAgain, as is normal, when we discover a Sunstein editorial, we find his speculations highly questionable . To sum up: The US struggles with unpayable debt, is run by shadowy military and banking forces with their own agenda and increasingly the federal government is hostile to its own civilian population. \\nConclusion: The most troubling issue is that larger international interests are apparently trying to destroy Western civilization in order to install globalism. Governments generally are employed as part of this destructive process and the US federal government is no exception. To enhance its utility only supports this destructiveness. Better that it remains dysfunctional. Paralysis is not an enemy when it comes government.'"}, "time": 1742628370.491285}