{"duration": 0.04812431335449219, "input_args": {"text": "'Posted 10/31/2016 2:03 pm by PatriotRising with 0 comments Republican nominee Donald Trump told an audience of roughly 8,000 cheering fans that if he had cheated in presidential debates the way rival Hillary Clinton had, he would be sent to the “electric chair.” \\n\\nTrump was commenting on the revelation by Wikileaks on Monday that CNN commentator Donna Brazile, who is now the chair of the Democratic National Committee, had been caught again passing debate questions from the network to the Clinton campaign during the Democratic primary. \\n\\nBrazile had been exposed earlier doing the same — passing a question to the Clinton campaign in advance of a town hall debate against Sen. Bernie Sanders (I-VT). \\n\\nAt the time, Brazile was not yet DNC chair, but was a regular CNN contributor. \\n\\nCNN fired Brazile on Monday, releasing a statement: ““We are completely uncomfortable with what we have learned about her interactions with the Clinton campaign while she was a CNN contributor.” \\n\\nTrump noted that Brazile was not the core issue — “I don’t care” about her, he said. Rather, he argued, Hillary Clinton should have reported Brazile the first time she tried to pass debate questions to her. \\nTrump also talked about cheating at the polls, telling supporters that the only way to overcome voter fraud would be to vote by the “millions.” \\n\\nHe cited 1.8 million dead people on the country’s voter rolls, and 2.75 million who are registered in more than one state. (The statistics appear to be based on a Pew Research Center study.) \\n\\nTrump challenged journalists in the room to ask Hillary Clinton why she had not reported Brazile after being provided with the debate questions. \\n\\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle , is available from Regnery through Amazon. Follow him on Twitter at @joelpollak . Do you enjoy reading Patriot Rising?'"}, "time": 1742564119.54973}