{"duration": 0.03228878974914551, "input_args": {"text": "'  \\nOh, the politics are strong with this one. FBI Director James Comey just sent out a letter to the Republican Congressional Committee informing them that the FBI will be looking into more of Hillary Clinton’s emails. The discovery of the new emails was “in connection with an unrelated case.” \\nAs Think Progress points out, all the letter really means is there are emails that were discovered that the FBI had not reviewed. It doesn’t mean a case is being “re-opened.” This does not say the FBI will be reexamining the information of the previous investigation. And, it doesn’t mean that all of a sudden criminal charges are going to be forthcoming. It means nothing, except, the FBI needs to read a few more emails that were missed in the previous investigation. \\nEven Comey says in his letter: \\n“The FBI cannot yet assess whether or not this material may be significant.” \\nRead Republican James Comey’s letter, here: \\nYet, the reality of this statement is lost on not only major media outlets who are reporting that the case has been “reopened,” but also our politicians. Paul Ryan’s response takes the cake, though. The Republican Speaker of the House went full knee-jerk with this one. He said in a statement : \\n“Yet again, Hillary Clinton has nobody but herself to blame. She was entrusted with some of our nation’s most important secrets, and she betrayed that trust by carelessly mishandling highly classified information. This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators. I renew my call for the Director of National Intelligence to suspend all classified briefings for Secretary Clinton until this matter is fully resolved.” \\nSo, 11 days before our presidential election, we’ve had the FBI Director, who happens to be a Republican, release an ambiguous letter which touches on an unsubstantiated scandal for which the Democratic presidential candidate came out of clean as a whistle because charges couldn’t be justified. And now we’ve had the Speaker of the House call for the candidate’s intelligence briefings to be suspended “until this matter is fully resolved.” \\nWhich, by the way, the FBI Director says he “cannot predict how long it will take to complete this additional work.” \\nYeah, ok. Like this doesn’t have political ploy written all over it. How pathetic. \\nFeatured image via Getty Images/Win McNamee/Staff Share this Article!'"}, "time": 1742562315.7166438}