{"duration": 0.09842991828918457, "input_args": {"text": "'BAROLO, Italy  —   Few places in Italy, and perhaps the world, have been so gifted with exquisite natural abundance as Barolo and its surrounding region. Not only does this land produce some of Italy’s best, and most expensive, wines. It is also home to the famed Italian white truffle, which can run 200 to 500 euros (about $225 to $560) for a   knob that will sit in the palm of your hand. But what happens when those resources compete? Vines require clear hillsides, and truffles need thick and damp yet clean woods. Today, hillside after hillside of Barolo is planted in neat rows of   vines more valuable than anything else that could be put on them. The forests, on the other hand, have been shrinking. Enter “Save the Truffle,” the brainchild of Carlo Marenda, 34, daytime project manager and passionate truffle hunter, and his associate, Edmondo Bonelli, 35, an environmental consultant. A year ago, the two men met in a chance encounter in a hilltop wood near Alba, the main town of this region in Piedmont, where Barolo is situated. They knew almost immediately that they shared a common goal and complementary skill sets. While Mr. Marenda had inherited two dogs and much knowledge from an older truffle hunter, Mr. Bonelli had the scientific skill to save the tasty tuber for future generations. “We both knew the time was ready to promote a new culture,” Mr. Bonelli said. Soon the two men started meeting with hundreds of truffle hunters and wine producers, and created a website under the “Save the Truffle” name, where they laid out their mission to restore the region’s woods. As they explain it, their mission is not about preserving merely a luxury product, but also the balance of the environment. “We don’t do it for the truffles. You might have only two trees in a hectare where they grow,” Mr. Marenda said. “If these abandoned trees get sick, it’s easy for the parasite to travel to the nearby organic wine production. The whole area is in danger. ” They started working with some wine producers who said they understood the importance of protecting the uncultivated forests around their vineyards and tending to them. Last month, “Save the Truffle” inspired a wider crowdfunding campaign, “Breathe the Truffle,” started by the Alba Truffle Show, an    truffle fair in the autumn that allows hunters to sell their mushrooms directly. It hopes to fund the cleanup of four once   woods in southern Piedmont, and is the first tangible sign of the community’s rising awareness of the need for greater harmony in the environment. “Truffle hunters were complaining more and more,” Mr. Bonelli explained. “Vineyards and wine sales were doing well, and they had time to focus on something that has a   large fallout: environmental preservation. ” Especially in the past decade, the woods in and around Barolo have increasingly been neglected. As wine production has become more profitable, an estimated 30 percent more land has been converted to vineyards in the past 10 years, at the expense of surrounding areas. And the problem is not just that woods are under pressure. Farmers have also stopped collecting forest wood for heating, reducing their incentive to clear the forest floor. On a recent day, Mr. Marenda gave a brief tour of the mounting challenges for truffle hunters, pointing out one of the many slopes of Barolo’s mountains, often angled like the facets of a gem. On one side were rows of nebbiolo grapes, which make Barolo’s wine. On the other was an abandoned, untended wood of oak and poplar trees. The forest floor was so thick with weeds and underbrush there was no way for truffle hunters to enter. “Seven or eight years ago, we could walk into that wood,” Mr. Marenda said. “Now it’s hard even for dogs to explore it. ” Truffles, already tricky to find and certainly no cafeteria food, have become even scarcer. Still, they are big business here. In Italy, the largest zone in Europe for white truffle production, the overall truffle business, which includes the still delicious but less prestigious black truffle, can generate €400 million a year (nearly $449 million). Yet truffle hunting is an ancient activity whose success largely depends on increasingly fickle elements, like the weather and pollution. Climate change, while providing this region’s winemakers with some warm, dry years that have yielded excellent vintages, has not necessarily favored the truffle. Over the long term, if the trends continue, truffle production in certain areas may be reduced or even eliminated, hunters lamented. “White truffles need fresh soil also in the summer, and rain,” said Francesco Tagliaferro, an agronomist at Piedmont’s Institute for Plants and the Environment. “If it’s too hot, truffles do not grow much, or are not very tasty. ” But Mr. Tagliaferro explained that they can only estimate a production loss because official data is scarce. “There is the widespread vow to secrecy about the zones where hunters pick the truffles,” he explained. “And much of the production is sold by private individuals to their own private clients. ” Truffles are a mysterious universe. Italians use dogs to sniff out white truffles underground, and can only guess whether they will still grow in the same area the following year. Many call truffle hunting more of a craze or passion than a job. It is a secretive culture rooted in experience that in Alba has been passed from generation to generation for centuries. Mr. Marenda inherited some knowledge and his two hunting dogs from Giuseppe Giamesio, a   truffle hunter in Alba, who believed that depleting the woods and polluting the environment did not damage just the truffle picking, but also the area’s beautiful hills and the planet. Mr. Giamesio used to travel to truffle fairs showing a handmade sign reminding hunters to be proud of and loyal to their territory. “The project is on the internet now,” Mr. Marenda said. “And so is his legacy. ” It is already reaching a wider audience. Their crowdfunding effort offers   rewards for benefactors, and they hope to raise €50, 000 by the end of the year to help restore the local ecosystem. Through the Alba Truffle Show website, donors contributed €10, 260 in the first two weeks. “It’s a change in mentality that we also want to promote, and so we set the good example,” said Liliana Allena, the president of the Alba Truffle Show. “You may think we are raising money for a luxury product like truffle,” she said, “but we are actually raising environmental awareness for the entire territory. ”'"}, "time": 1742561864.878779}