{"duration": 0.04707813262939453, "input_args": {"text": "'Children are known for being picky eaters. But what happens when these picky eaters grow up? Many children leave behind their quirky eating habits as they get older. But “what is less certain are the predictors of who will remain a picky eater in adulthood,” said Nancy Zucker, a psychologist and director of the Duke Center for Eating Disorders. She is the lead author of a 2015 study that linked picky eating in some preschoolers with emotional problems. Adults may hang on to their youthful food dislikes  —   at the top of the list are vegetables  —   but then add more restrictions, such as consuming only smooth foods or limiting their diet to bland, white meals. Dr. Zucker said that in a sample of 2, 600 adults who identified themselves as picky eaters, 75 percent reported the pattern started in childhood. The estimates of picky eating in childhood vary widely, ranging from 5 percent to more than 25 percent, depending on the definition of selective eating. But “there is no consensus on the prevalence in adults,” Dr. Zucker said. One reason is that many adults try to keep their picky eating a secret, a common source of stress that can lead to personal or professional problems. As a child, Stephanie Lucianovic, the author of “Suffering Succotash: A Picky Eater’s Quest to Understand Why We Hate the Foods We Hate,” would hide vegetables or hold her nose during meals. As an adult, her selective eating posed new challenges when she fell in love with a man from a “foodie” family. “It’s a really scary thing to overcome,” she said. “People aren’t choosing to dislike food. There’s a lot of shame involved. There’s not a lot of empathy for picky eaters. ” Ms. Lucianovic said the key to ending her pickiness at the table was having the support of a nonjudgmental partner and learning how to cook. She still avoids steamed vegetables, but now enjoys them roasted or sautéed. “You can reset the pattern of likes and dislikes,” she said. “I did it by continuing to try things in different ways. ” Researchers at Duke and the University of Pittsburgh are studying adult picky eaters via an online questionnaire. Among the questions: “Do you get anxious about social situations because you will be expected to eat?” and “Do you gag when tasting a disliked food?” About 40, 000 adults have completed the survey. The causes of   picky eating, however, remain poorly understood. In some cases, a childhood dining scare from choking or vomiting may cause lingering fear of one or more foods. “Food memories are very powerful memories,” Dr. Zucker said, adding that social anxiety associated with picky eating seems to increase with age. Other people may have a heightened sensitivity “or even somewhat distorted perception to certain tastes and smells,” said Juyun Lim, an associate professor of food science and technology at Oregon State University whose research has focused on the role of the senses in food preferences. All foods contain tens to hundreds of volatile compounds that determine aroma and flavor, she said. But the same food can be perceived differently by two individuals. “Depending on your genetics, a food can smell pleasant or unpleasant,” Dr. Lim said. While one person may enjoy the taste of cilantro, for example, another might find it soapy. Another example is pork, which contains a compound that some people can’t detect, or describe as pleasantly floral, while others characterize it as smelling like sweat or urine. Sometimes we learn to like something the more we are exposed to it. “The first time you drink beer, it never really tastes good,” Dr. Lim said. Texture also plays a role in food acceptance. One example is okra, with its slimy quality that many find disagreeable. Jane Kauer, an anthropologist at the University of Pennsylvania, was surprised when research revealed that some adults rejected raw tomatoes for reasons that had nothing to do with flavor. Participants described being turned off by the “gross thing that happens when you pierce a tomato and the guts come out of it. ” Many adult picky eaters want to change, but they find certain foods too unappealing to even put on a plate. In extreme cases, they may shun nearly all foods, a condition the American Psychiatric Association calls   food intake disorder, or Arfid. Dr. Zucker said some adult picky eaters come to the Duke center for help when they are concerned about being poor role models for their children, for example, or they panic about attending business dinners. Psychologists and social workers help patients gain insight into the biological, emotional and social factors behind their selective eating. “A person’s experiences often need to be validated and fully understood before changes are even considered,” Dr. Zucker said. New foods are then slowly introduced in an effort to expand the palate. Dr. Zucker compared the process to physical rehabilitation for an injury, requiring much work and practice. Patients who have eaten only smooth foods may, for example, need to consult with an occupational therapist to learn how to chew and swallow more effectively. They are also taught ways of handling situations like eating in public or explaining their food preferences to others. One thing experts advise: Don’t push food at adult picky eaters. “It’s incredibly stressful to them, because most of us are perfectly happy to say, ‘Come on, try it. It really tastes great,’” Dr. Kauer said. While loved ones’ concern is understandable, selective eaters consider it intrusive and an attack on their sense of self, Dr. Kauer said. “It’s getting into their space, and it has nothing to do with you. ”'"}, "time": 1742628462.2874205}