{"duration": 0.11066389083862305, "input_args": {"text": "'BOSTON  —   During a men’s hockey game between Boston University and Providence College in early December, Brittany Miller sat in the press box near center ice. She tracked statistics and typed notes in her laptop. Across the rink, Theresa Feaster kept a close eye on the game, logging video of the action. They could have been mistaken for reporters or merely diligent fans. But Miller and Feaster are much more than devoted followers of their beloved teams. They are    trailblazers. Last fall, Miller and Feaster became the first women to serve as   members of an N. C. A. A. Division I men’s hockey coaching staff when they were hired by their alma maters. But Miller, Boston University’s director of hockey operations, and Feaster, the coordinator of hockey operations at Providence College, say their gender rarely comes up in conversations with coaches or players. “I’m just on the staff and come to work every day and work hard,” Feaster said. “That’s all there is to it. It’s not really something that crosses my mind. ” Miller and Feaster had noticed each other during games when they both worked as student managers, first as undergraduates and then as graduate students. But they did not formally meet until a meeting of the Hockey East Association, the teams’ conference, after both had been hired full time. “It’s nice to have someone else who worked hard as a manager and proved herself to her coaching staff,” Miller said. “It shows that Hockey East is really moving forward in hiring females. ” Each has been around hockey for as long as she can remember, though they came to their new jobs from opposite directions. Miller grew up on the ice, learning to skate at age 3 and playing competitive hockey through her high school years at Boston Latin School. Feaster did not play, but she began learning the game while bouncing around the minors with her father, Jay, and gained a newfound interest when his job as general manager of the Calgary Flames led to a connection to Providence while she was studying there. Miller, who had followed her older brother into the game and was coached by her father, started working as a manager at B. U. during the first semester of her freshman year, attending all of the Terriers’ practices and games while still managing a full class load. She was finishing up her master’s degree and working as an intern for a sports marketing research company in London last summer when she received calls from Coach David Quinn and the athletic director, Drew Marrochello. The Terriers had an opening on their coaching staff, and both men thought Miller was the perfect candidate. Now she is in charge of all of the teams’ travel logistics, ensures players handle their academic work and helps track statistics. Miller said Quinn and the rest of the staff had treated her as an equal since she accepted the job in September. “They trust me to do a good job, and they know that I can do this job just as good if not better than any guy,” she said. Marrochello said he had known early on that Miller would be successful in any endeavor she chose. “I’m frankly glad it is in hockey, in college sports,” he said. “I know she’s got a high ceiling. ” While Miller’s love for hockey has burned since her youth, Feaster’s was more like rekindling an old flame. As a young child in the   Feaster was a regular at the rink and aboard the team bus when her father was the general manager of the Hershey Bears of the American Hockey League. Jay Feaster remembered his    daughter sitting on the training table talking hockey with Mitch Lamoureux, a center who had played parts of three seasons in the N. H. L. but was by then a   lifer on the wrong side of 30. “I’ll see that in my mind until the day I die,” Jay Feaster said. “It was like two players just sitting there having a conversation. ” As Theresa Feaster grew older, she would pepper her father, who helped the Tampa Bay Lightning win the Stanley Cup as their general manager in 2004, with questions about the game. But she did not think seriously about getting involved in the sport until she attended the 2012 N. H. L. draft. Jay Feaster was Calgary’s general manager at the time, and the Flames selected two players who ended up at Providence. Theresa Feaster introduced herself to Friars Coach Nate Leaman, told him that she was entering her junior year and asked if she could volunteer with the team. She was soon attending coaches’ meetings and helping the program with anything it needed. She made such a good impression that Leaman hired her full time in October. Her new role is similar to the one she had as a student. She works on video and statistics projects, makes travel arrangements and helps with administrative tasks. “I feel like every day I’m learning more,” Feaster said. “One of the rewarding parts of this job is you come to the rink every day and you know that you’re going to learn and you’re going to get better. I find that incredibly rewarding. ” Although Miller and Feaster are technically members of their programs’ coaching staffs, N. C. A. A. rules prohibit anyone in their position from working with players on the ice or sitting on the bench during practices or games. Still, they are interacting with the coaches and players daily and gaining valuable experience. Both women aspire to management roles and, possibly, the N. H. L. They would again be an anomaly: Few women have worked in   roles in an N. H. L. front office, and none have been a general manager. Jay Feaster has spoken with his daughter about the grueling nature of hockey: the scarcity of   positions, the long hours and the lack of job security. It is not an easy road, but if it is the one she chooses, she is off to a good start. “I give her a hard time about, ‘You’re too smart to be in this racket. Do you want to be in the hockey business? You’re too smart for that,’” Jay Feaster said. “But I’m very, very proud. ”'"}, "time": 1742561934.946747}