{"duration": 0.06958580017089844, "input_args": {"text": "'Email \\n“But I’m desperate to work.” With these words Daniel Blake enters the consciousness of the UK taxpayer. Until he utters them, imploringly in a fictional branch of a Newcastle jobcentre office, he is simply another scrounger. To earn acknowledgment, let alone respect, he must first confirm his status as a consumer of the services on offer. \\nIt doesn’t matter. He is a carpenter by trade, shown knowledgeably inspecting the components of his labour in the film’s early scenes. He lives alone, he had a heart attack, his doctors say he cannot work. He must sign on for benefits, but is found capable of work under the benefits regime which assesses a man with a history of cardiac arrest as being suitable for production, on the basis that he can reach for his top pocket and walk fifty metres unaided. \\nDescribing the benefits system in the UK as Kafkaesque would be to miss the point. Bureaucracy was a byword for existential trauma in Kafka, not something designed by people to be deployed, en masse but in the shadows, against whole swathes of people in their jurisdiction. The benefits system as we know it in the UK assumes its beneficiaries to be immoral scroungers, perniciously ripping off the hardworking people who deign to pay tax in marginal constituencies prayed on by political image consultants who attended the ancient universities. More crucially, when the response to this film focuses on the efficiency of the system and not the devastation it wreaks on people, it affirms the distance which makes misery so profitable in today’s United Kingdom. \\nSo when Daniel Blake is denied the benefits package which should cater to people who cannot work because of ill health, he must sign up to Jobseekers allowance, a necessary condition for which is the admission that a person is liable for their productivity. Consequently he must spend as much time looking for work as he is deemed able to work – in this case thirty five hours a week. He attends a CV building workshop, run by a man as reputable and cogent as any of the political consultants who ministered Tony Blair’s ascendancy to the Northern masses, but with an accent which lets you know he’s provincial. The whole film begs us to ask who is its intended audience. \\nThe vagaries of Blake’s experience beyond this are unexceptional, to any of the audiences which might be viewing this film. Those who have to directly interact with the system are likely to face hurdles in attending a screening in enough numbers to generate the kind of social upheaval people might want to see – the cinema being a costly, far-away form of entertainment for many in the UK. As for those who, like the author, work with people affected by the system; assisting in claims, trying to maintain mental health throughout the months of assessments, writing letters and making calls to dispute the lies peddled by private companies tasked with diminishing the number of claimants? They have likely seen worse cases than that of Daniel Blake – people driven past the boundaries of mental anguish they thought possible, and left there while an appeal or a ‘mandatory reconsideration’ hangs in the balance. \\nInstead this film seems to have hit its mark when the Times , Rupert Murdoch’s broadsheet flagship in the UK, announced that it “might change things.” Any portrayal of the benefits system which could be of use to the libertarian right, or even mainstream media, must now be so skewed as to be unrecognisable to those who have seen it. \\nIncreasingly the benefits system, and the people whose lives it lays waste to as politicians demand, at the behest of their constituents, operates behind a glass wall whose opacity just clouds the identities of the damned. As Daniel Blake is plucked from the obscurity of fiction to represent an entire system, proudly taking his singular place on behalf of the many, the others are ignored. \\nWomen like Katie – the university student and mother who spent two years trying to raise a family in a homeless hostel before moving the length of the country to an unfamiliar city in search of difference when it became obvious there was nothing but repetition where she knew. Women like Sheila, the jobcentre assistant who interprets Katie’s desperation the only way anyone can anymore: as aggression, and earns the ultimate mark of British social disdain: silent disapproval. Was this the life she envisaged as a child? What does she think when she goes home? Does she suppose she might be the crux of an evil system? Women like Ann, the kindly woman at the jobcentre who faces disciplinary action from bosses for the crime of helping a man fill in a benefits claim, even if it means transgressing silly rules. What does she think about having to stay at the jobcentre? Does she see any hope for the future? What would she think about the film’s implication that Sheila, her colleague, is all that is wrong with the world? \\nNone of these stories are explored. Katie’s moments of angst are some of the film’s most affecting – including her admirable restraint in not maiming Daniel Blake when he insists “she doesn’t have to do this,” when he walks into the brothel she works at because there is manifestly no other option. In this, Daniel’s apotheosis to everything the Right needs him to be. A man, who built things with his hands, and still has more good, old-fashioned morals than sense. Without these things he would be just another scumbag, pilfering the system of their hard-earned pennies. He even goes to the trouble of containing his grief at the death of his partner – a woman whose mental illness he tolerated for years until her apparent suicide. She is at peace now, and so are the Tories – safe in the knowledge that the UK’s premier leftist filmmaker has gifted them the fictional icon they always wanted but did not know they could have: Daniel Blake is the facsimile of masculinity, working class nostalgia and British reserve that they might see in themselves, if they needed to bother to look. \\nFortunately for them, they don’t – unfortunately for the rest of us, there’s only the Labour Party between now and an eternity of their rule.'"}, "time": 1742628403.779141}