{"duration": 0.09770703315734863, "input_args": {"text": "'President Donald Trump made the end of Common Core and the return to local control of education the primary items of his campaign’s education agenda, but the woman leading his education department claims Common Core has not existed in the country’s schools since 2015. [I will end common core. It’s a disaster. https:  . #MakeAmericaGreatAgain #Trump2016 pic. twitter.   —   Donald J. Trump (@realDonaldTrump) January 26, 2016,   On Monday, Education Secretary Betsy DeVos said, “There really isn’t any Common Core anymore,” citing the federal Every Student Succeeds Act (ESSA) which was passed in 2015. ESSA, she claims, “does away with the whole argument about Common Core. ” The secretary’s comments came just several weeks after Trump returned to his   campaign statement that he wanted to end Common Core and make education policy once again the domain of state and local governments. “Common Core, I mean, we have to bring education more local,” Trump said at the White House. “We can’t be managing education from Washington. ” The president continued: When I go out to Iowa, when I go out to the different states and I talk, they want to run their school programs locally and they’ll do a much better job  …     And I like the fact of getting rid of Common Core. You know, Common Core, to me, we have to end it. We have to bring education local, to me. I’ve always said it, I’ve been saying it during the campaign, and we’re doing it. While campaigning in 2016  —   after the enactment of ESSA  —   Trump listened to millions of grassroots parents and teachers who asked him to cut off federal funding for and end the superstructures that made Common Core possible in the first place. “Common Core is a disaster,” Trump noted time and again. While he provided few details of his education plan, he acknowledged the frustration of parents in their attempt to eradicate the Common Core system of math and English language arts standards and tests, and the accompanying massive student data collection, in their states. “For the first time in any presidential campaign, an education issue claimed a place of importance with grassroots citizens,” writes American Principles Project senior fellow Jane Robbins at the Library of Law and Liberty, explaining the basis for the grassroots’ ire at the progressive Common Core policies: In the early days of Common Core, almost no one outside the federal and state education bureaucracies or the insular world of “education reform” had ever heard of it —  even though the standards would ignite the largest   grassroots movement in American history. Common Core was adopted by state executive branch officials in response to “incentives” from federal executive branch officials, with (in almost every case) no consent from or even notice to elected state legislators. In a joint statement to Breitbart News, parent activists Heidi Huber of Ohio and Jenni White of Oklahoma agree “the very reason   billionaire Donald Trump appealed to the everyday   Core mom is because he appeared to understand the kitchen table politics of grassroots America. ” Toward the end of his campaign, Trump’s message about ending Common Core was overshadowed by a new message about school choice  —   one that received significant attention with the announcement of DeVos as his selection for federal education secretary. DeVos had been a major backer of school choice and school vouchers in her home state of Michigan. She had also been a supporter of Jeb Bush and his education foundation, and, ultimately, served as an   delegate for establishment Republican candidate John Kasich at the GOP convention. Meanwhile, grassroots parent groups in Michigan also noted that DeVos lent financial and service support to organizations that promoted the Common Core. Upon her nomination by Trump, however, DeVos denied she supported the Core. “I do support high standards, strong accountability, and local control,” she said. “When Governors such as John Engler, Mike Huckabee, and Mike Pence were driving the conversation on voluntary high standards driven by local voices, it all made sense. ” DeVos’s nomination was accompanied by a level of controversy rarely seen for an education secretary. The left  —   led by teachers unions  —   began to work against her because of her support for school choice which, they claimed, would redirect funding from public schools. The mainstream media focused its energy on the battle between its own leftwing public school supporters and “conservative” DeVos. As the left often does, it also often made the decision to mock the secretary unfairly, rather than deal with her on the actual issues. After a very shaky confirmation process  —   which required Vice President Mike Pence to break a tie vote in the Senate  —   DeVos was finally confirmed. But the controversy continued within the GOP as the secretary began to fill her department with many individuals with ties to   Core Jeb Bush, as well as Indiana  —   where Common Core was “repealed,” but then simply “rebranded” with a new name. Trump’s constitutionalist base continued the drumbeat on eliminating the U. S. Education Department and Washington bureaucrats’ influence on local education policy. Two bills were introduced in Congress with that end in mind, one by Kentucky Rep. Thomas Massie (R) and the other by North Carolina Rep. David Rouzer (R). Though DeVos has continued with comments that Common Core is no longer an issue because of its elimination through ESSA, those who have studied the federal law and observed the secretary’s choice of staffers say her comments are typical of the establishment GOP. According to Huber and White, “Trump’s selection of Betsy DeVos was not only disappointing, it telegraphed more of the same tone deafness of the previous administration. ” “Betsy DeVos was confirmed and began assembling a team of staffers, most of whom represent pretty establishment Republican experience and positions,” Joy Pullman, managing editor at The Federalist, also tells Breitbart News. The author of a newly released book, The Education Invasion: How Common Core Fights Parents for Control of American Kids, Pullman notes that while school choice is a positive goal, the idea that the federal government should be involved in regulating it in any way suggests the Trump education department is not planning on reducing its influence, as Trump had originally promised. She explains: Everyone without financial or political incentives to the contrary, such as teachers unions, knows that choice exists and it generally works. The real conversation is whether government will destroy it by using laws and regulations to commandeer private and charter options or stay true to the promise of the word “choice” and truly let parents control the style and content of their children’s curricula. Many questions remain unanswered about the Trump administration’s leadership on these issues, and there has been absolutely no action on Trump’s repeated campaign pledge to “eliminate Common Core. ” On the plus side, Trump signed legislation in March that, via the Congressional Review Act, rolled back two   education policies  —   one regarding teacher training programs, and another regarding meeting some ESSA directives. The ESSA rule concerned states’ accountability in identifying failing schools and reporting their plans for improving them to the federal government. Nevertheless, ESSA still requires states to submit their overall education plans to the U. S. Education Department. In March, DeVos’s office released a new guide on how states may fulfill their requirement to the federal government. The guide features a “revised template” offered by the education department itself, and adds that two private groups  —   the Council of Chief State School Officers and the National Governors Association  —   both of which own the copyright to the Common Core standards, may assist states with an “alternative template. ” Ann Marie Banfield, education liaison with the New   Cornerstone Research and Policy Institute, tells Breitbart News DeVos’s messages are at odds with how Trump campaigned on education issues: Trump campaigned with the promise to get rid of Common Core and even referenced Gov. Jeb Bush as someone who supported the federal education reform that parents never asked for. The appointment of Betsy DeVos has left many of us underwhelmed and disappointed. You don’t appoint a Jeb Bush crony and expect parents who’ve been fighting against Common Core to be thrilled. In February, conflict between Trump and DeVos was reported by the New York Times, as the president and Attorney General Jeff Sessions overturned Obama’s   directive, which effectively permitted children to change their sex by simply declaring they have the “gender identity” of the other sex. DeVos reportedly objected to changing Obama’s policy, but was overruled by Trump and Sessions. Pullman observes that Trump’s rollback of Obama’s Title IX guidance is “a win, but it was done over the objections of Secretary DeVos, which is worrisome. ” “Even if you think it’s okay to force naked boy bodies and naked girl bodies into the same private facilities, the federal government has no authority to do what Obama’s Education and Justice departments did in this regard,” she adds. “We would ask president Trump  —   as he completes the first 100 days of his administration  —   to consider the tens of thousands of parents who believed his promise to end Common Core, and implore him to invite leading parent activists to the table,” say Huber and White. “It would undoubtedly benefit President Trump, but more importantly, it would serve the children he promised to deliver from the special interests of the FedEd complex. ” Emmett McGroarty, senior fellow at American Principles Project, tells Breitbart News DeVos is not supporting Trump in his stated education agenda. “Secretary DeVos is undermining the Trump presidency,” he asserts. “Great presidents have a great vision and are able to bring it into reality. That invariably means overcoming the timid in their own administration and in Congress. That’s the hurdle President Trump faces. ”'"}, "time": 1742628313.5199955}