{"duration": 0.16932129859924316, "input_args": {"text": "'  FBI Director Confirms that Hillary Lied, and Mishandled Classified Material FBI Director Confirms that Hillary Lied, and Mishandled Classified Material November 8, 2016, 11:27 am by Roger Aronoff Leave a Comment 0 \\nBy: Roger Aronoff | Accuracy in Media \\nOn Sunday, FBI Director James Comey sought to put a cap on the bottle he opened on October 28 when he announced that the FBI was once again investigating Hillary Clinton’s emails, based on a device they had discovered containing what turned out to be approximately 650,000 emails. The device was the shared computer of sexting pervert and former congressman Anthony Weiner and his long suffering wife, Huma Abedin, top aide to Hillary Clinton and a woman with deep ties to the Muslim Brotherhood. \\nComey caused an uproar in the campaign, on both sides of the aisle. Democrats and their allies in the media were outraged that Comey would drop this bomb into the campaign with 11 days until the election, and not explain the urgency or the substance of his findings. Many Republicans, and their allies, who were outraged by Comey’s conclusions back in July—namely that Hillary Clinton was guilty of serious violations of the law, but that he didn’t believe that she had any criminal intent, nor that “any reasonable prosecutor” would attempt to prosecute the case against her—were saying that maybe Comey was going to implicate Hillary in serious criminal activity after all. He wouldn’t have reopened this matter, they believed, if he didn’t have something new and serious that he had seen. \\nNow, the roles are reversed again, with Democrats claiming that Comey’s latest statement represents a complete vindication for Hillary, while Republicans are questioning the timing and point of the whole exercise. Did the FBI, even with their high-tech reading devices, actually go through 650,000 emails in a week, and conclude that there is no there there? And why is the State Department only able to process 500 emails per month? The wheels of justice seem to turn at whatever pace the Democrats need them to. \\nI have a bit of a different take. In the November 6 letter to Congress, Comey stated: \\n“I write to supplement my October 28, 2016 letter that notified you the FBI would be taking additional investigative steps with respect to former Secretary of State Clinton’s use of a personal email server. Since my letter, the FBI investigative team has been working around the clock to process and review a large volume of emails from a device obtained in connection with an unrelated criminal investigation. During that process, we reviewed all of the communications that were to or from Hillary Clinton while she was Secretary of State. \\n“Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton.” \\nWhile Comey did, in fact, argue back in July that he was not recommending an indictment or prosecution of Hillary, he also drew other “conclusions that we expressed in July with respect to Secretary Clinton.” He had concluded that she lied when she said that she hadn’t sent or received classified materials on her private, unsecured server. She lied when she said that nothing that she sent or received was marked classified. She lied when she said that she only used one device, when in fact she used at least 13 devices, at least two of which were destroyed by hammers. And she lied when she said that she had turned over all of her work-related emails. No, in fact Comey said that there were “thousands” of work-related emails they found that she had not turned over. You can watch here to see Comey draw all of these “conclusions” back in July. \\nThis is what the Clinton campaign is wearing as a badge of complete exoneration, and a closing of the books on her so-called email scandal, which is actually a national security scandal. As we have often pointed out, others have gone to jail, been fined, lost their security clearances and were run out of public life for far less egregious examples of mishandling classified material. \\nAndy McCarthy, the former U.S. Attorney who successfully prosecuted the Blind Sheikh for his involvement in the first World Trade Center bombing, argued back in July that Comey basically rewrote the law. Comey “conceded that former Secretary Clinton was ‘extremely careless’ and strongly suggested that her recklessness very likely led to communications (her own and those she corresponded with) being intercepted by foreign intelligence services.” \\nMcCarthy added that “Comey recommended against prosecution of the law violations he clearly found on the ground that there was no intent to harm the United States.” \\n“In essence,” wrote McCarthy, “in order to give Mrs. Clinton a pass, the FBI rewrote the statute, inserting an intent element that Congress did not require. The added intent element, moreover, makes no sense: The point of having a statute that criminalizes gross negligence is to underscore that government officials have a special obligation to safeguard national defense secrets; when they fail to carry out that obligation due to gross negligence, they are guilty of serious wrongdoing. The lack of intent to harm our country is irrelevant. People never intend the bad things that happen due to gross negligence.” \\nBut this has been a corrupt process. The fix was in . It had to be to protect President Obama as well, who knowingly exchanged emails with Hillary on her private server. As Politico pointed out , “President Barack Obama used a pseudonym in email communications with Hillary Clinton and others, according to FBI records…” Those FBI records, released in late September, confirmed what McCarthy had earlier predicted: “As I explained in February,” wrote McCarthy, “when it emerged that the White House was refusing to disclose at least 22 communications Obama had exchanged with then-secretary Clinton over the latter’s private e-mail account, we knew that Obama had knowingly engaged in the same misconduct that was the focus of the Clinton probe: the reckless mishandling of classified information.” \\nIt is possible that America will be electing someone as president on Tuesday who has committed serious crimes that could all be wiped away by a presidential pardon. The media’s failure to accurately cover this story could very well be the cause of a major constitutional crisis, the likes we’ve never witnessed before. Roger Aronoff \\nRoger Aronoff is the Editor of Accuracy in Media, and a member of the Citizens’ Commission on Benghazi . He can be contacted at roger.aronoff@aim.org . View   Roger Aronoff . 0'"}, "time": 1742563044.690767}