{"duration": 0.06405210494995117, "input_args": {"text": "'Home / Badge Abuse / Cop Fired After Reporting Supervisor’s Practice of Rating Female Drivers on ‘Rapability’ Scale Cop Fired After Reporting Supervisor’s Practice of Rating Female Drivers on ‘Rapability’ Scale John Vibes October 31, 2016 Leave a comment \\nNew Boston, N.H. – After she was fired for exposing the predatory behavior of one of her superior officers, a female cop has gone public with her case and filed a lawsuit against her former employer. According to the former officer, Alexandra Drake, her supervisor, Michael Masella, a lieutenant with the New Boston Police Department, was sexually threatening multiple female officers and would brag about he preyed on women at traffic stops. \\nDrake blew the whistle about her superior’s behavior and filed a report along with another employee who witnessed his behavior. However, instead of looking into the allegations, the department fired Drake and accused her of lying. \\nAccording to a recent lawsuit , Drake noticed Masella’s disturbing behavior while she was training under him at the New Boston Police department. The department alleges that she was fired for incorrectly filling out a police report, but she says she filed the report exactly as she was ordered to, by her superior, Masella. \\nAccording to the lawsuit, “ After completing the stop, he told Drake that he wanted to just take them out and ‘rape’ them rather than issue a citation. Masella would routinely make comments about female drivers whom he thought found him attractive or good looking. He has apparently developed a ‘rapability’ scale about female drivers and would test Drake whether a particular driver was ‘rapable.’ ” \\n“Masella spoke very negatively about the two former female employees, which made Drake nervous. Drake was certain that the slightest slip could make her a target of severe harassment, termination of employment or even rape, ” it continued. \\nDrake says that Smith made inappropriate advances towards her on several occasions while they were on and off-duty. \\n“Masella arrived in a cruiser while he was on duty wearing a full police uniform. When Drake opened the front door, Masella asked her if she was naked. Drake told Masella she ‘was not’ at which point Masella stated ‘Oh, alright I will come back later.’ ” the lawsuit stated. \\nCounty attorney Donald Smith denied commenting on behalf of the police department, telling NECN that, “ As a policy, the Town of New Boston does not comment on pending litigation. The Town is in the process of preparing a response to the allegations brought forth by Ms. Drake.” \\nIn the statement to the press, Smith denied the charges. \\n“The complaint contains inaccurate information which will be addressed as part of the ongoing legal process,” Smith said. \\nWhen Drake made a complaint to the police chief about the issue, she was the one who was interrogated instead of Masella, and she was fired shortly after. \\n“During this interrogation of Drake, she was subjected to a barrage of questioning lasting for over an hour while the offending supervisor, Masella stood close by,” the lawsuit stated. \\nTo add insult to injury Drake was issued a warning for violating the county’s sexual harassment policy with her termination. \\nUnfortunately, this type of response to good cops, who try to call out corruption in their department is the rule, not the exception. \\nPreviously, the Free Thought Project brought you the story of Laura Schook, who tried to call out corruption in her department. Naturally, they tried to run her through the mud and fire her. \\nPrior to Schook, we broke the story of a cop in Buffalo, NY who was beaten and fired after she stopped a fellow cop from nearly killing a handcuffed man. She is still fighting for her pension. \\nIn Kentucky, a sheriff’s deputy was fired for “insubordination” after pointing out that the sheriff had planted drugs in another deputy’s car. Even though the sheriff was indicted, the deputy was still fired. \\nIn September of 2014, we exposed the Baltimore police department’s attempt to intimidate a whistleblower officer. Detective Joe Crystal became a target of intimidation for his entire department after testifying against other officers in a misconduct case. Following his testimony, he received threats from other officers and even found dead rats on he and his wife’s cars. \\nThe thin blue line, it seems, is akin to the mafia — cross it and you will be snubbed out by the rest of the gang. John Vibes is an author and researcher who organizes a number of large events including the Free Your Mind Conference. He also has a publishing company where he offers a censorship free platform for both fiction and non-fiction writers. You can contact him and stay connected to his work at his Facebook page. John is currently battling cancer naturally, without any chemo or radiation, and will be working to help others through his experience, if you wish to contribute to his treatments please donate here. Share'"}, "time": 1742562319.7502148}