{"duration": 0.0478208065032959, "input_args": {"text": "'  \\nIt’s almost statistically impossible that you haven’t heard at least one person threaten to move to Canada if Donald Trump won the presidential election. Well, he did. And it appears that at least some of those would-be emigrants weren’t kidding. At around 11 pm Tuesday night – just as things really went to hell for Hillary Clinton – Canada’s immigration website began to receive record breaking traffic. It then crashed completely. \\nIn case you were wondering, moving to Canada can be quite difficult . It may even take years. To some degree it depends on what profession you’re in and how desired the work you do would be to the nation of Canada. Upon writing this the website still will not load reliably; but in the off chance it’s running properly by the time you read this I’ve included a link ( HERE ). \\nThe world’s stock markets have been sent into turmoil at the shocking news that reality tv star Donald Trump actually pulled off the win. But if you’re thinking of moving to Canada just because of the impending stock market Armageddon, don’t bother. It’s likely that the whole world will go into another recession if Trump really scraps the trade deals he’s promising to. Sort of like a Brexit on a much bigger scale. In fact, many are saying that the combined influence of the UK’s departure from the EU and ours from the majority of our trade relationships might spell a very wide-spread fiscal crisis. \\nTrump, for one, tried to calm these fears in his victory speech. He said that he plans to deal with everyone “fairly.” But this is unlikely to work. The market ultimately responds cautiously to change and whether that change is going to be fair or not doesn’t really make much difference. Trump has promised to do away with the establishment. And that’s likely to scare economists. One can only hope that as our new president, he proceeds with the cautious tone he could not find during the campaign. Or we could just all move to Canada. \\nFeatured Image via Michael Reaves/Getty Share this Article!'"}, "time": 1742563891.1480238}