{"duration": 0.06533670425415039, "input_args": {"text": "'The actress Carrie Fisher, who spoke openly about her struggles with mental illness, once joked that she wanted to start a “Bipolar Pride Day” to help erase the stigma of the disease. Legions of fans seemed to grant her wish on Tuesday in the hours after her death at age 60. One after another, in words both   and deeply personal, admirers paid tribute to Ms. Fisher by “coming out” on Twitter with their own stories of mental illness. [ Read the obituary | Carrie Fisher and “bipolar pride” ] Ana Marie Cox, senior political correspondent for MTV with 1. 3 million followers on Twitter, was among the first to tweet. “I really did think, ‘What would Carrie do? ’” Ms. Cox said in a subsequent telephone interview, as she described trying to decide how open to be about her own health. Choking back tears as she spoke, Ms. Cox continued: “I really did identify her as a feminist icon, a model for being a tough smart girl. But where she really pushed the boundary of what we could talk about in polite company or impolite company was her mental illness and her openness about that. ” Almost immediately after her tweet, some of Ms. Cox’s followers began sharing their own stories about mental illness. Jeremy Hitchcock, 34, a computer programmer from Manhattan, was seeing the new movie “Rogue One: A Star Wars Story” on Friday when he heard other audience members sharing the news that Ms. Fisher had suffered a heart attack hours earlier. Mr. Hitchcock, who was so devoted to the space saga that he named his son Luke after the character Luke Skywalker, said in an interview that he was devastated by her death. After seeing Ms. Cox’s tweet, he decided to do something he’d never done before, something that terrified him. He announced publicly that he has bipolar disorder. The Chicago radio personality Julie DiCaro also followed Ms. Cox’s lead, tweeting to her 31, 000 followers that she suffers from depression. She also began the hashtag #InHonorOfCarrie. Within a couple of hours, the hashtag had reached 182, 000 unique viewers as people began opening up about their struggles with bipolar disorder, depression, anxiety, suicide  —   often for the first time in such public fashion. “I wanted to do something that wasn’t about her being beautiful or a sex symbol,” Ms. DiCaro said of Ms. Fisher, “but about her being a woman who wasn’t afraid to speak out about mental illness. She became a hero to me because of who she was off the screen more than who she was on the screen. ” “People who struggle with these issues often feel like they’re going it alone,” Ms. DiCaro continued. “But it’s comforting that Carrie, or Princess Leia  —   who’s cooler than Princess Leia?  —   was comfortable speaking publicly about her struggles. It made me feel comfortable. ” Ms. Fisher has said that she was first given a diagnosis of bipolar disorder at the age of 24, but that it wasn’t until five years later that she actually accepted it. In time, she spoke often about her lifelong struggles with both addiction and bipolar disorder and her desire to erase the stigma of mental illness. She wrote her 1987 novel “Postcards From the Edge” after a stint in rehab following a   drug overdose. It was during her autobiographical   stage show, “Wishful Drinking,” that she first posited the idea for “Bipolar Pride Day. ” Dr. Barron Lerner, a medical historian, said that while public outpourings are common after a celebrity’s death, the nature of the tribute to Ms. Fisher is unusual. “The fact that they are outing their mental illness needs to be acknowledged as it remains far more stigmatized than other diseases,” said Dr. Lerner, an internist at New York University Langone Medical Center and author of the book “When Illness Goes Public. ” “Rather than just saying ‘R. I. P. Carrie,’ it is much more powerful to take a courageous step oneself to honor the memory of someone famous who also struggled with what you have,” he added. Ms. Cox, who also writes the “Talk” column for The New York Times Magazine, said that while it felt risky to tweet about her bipolar disorder, she received a number of emails and tweets from people close to her who also cope with mental illness. And the overwhelming response on social media has convinced her it was a fitting tribute to Ms. Fisher. “I think she would be floored,” Ms. Cox said. “I think she would be happy. It’s a powerful thing. ” Ms. Fisher’s efforts to destigmatize mental illness and addiction took new form this year as she started writing the column “Advice From the Dark Side” for The Guardian. Characteristically funny and cleareyed, Ms. Fisher fielded questions from readers on bipolar disorder and dysfunctional marriages, among other topics. She ended one memorable exchange with a line that was often tweeted on Tuesday:'"}, "time": 1742628372.8554273}