{"duration": 0.14232873916625977, "input_args": {"text": "'AUSTIN, Tex.  —   A fascinating story emerged about Netflix last week. The Daily Mail reported that the streaming television service was developing new interactive technology allowing viewers to direct the plots of certain television shows,     style. The company later told me that the experiment was focused on children’s programming, more as a developmental learning tool than as some new twist on the modern media sphere’s rush to give you exactly what you want when you want it. No matter how far the experiment goes, Netflix is again in step with the national zeitgeist. After all, there are algorithms for streaming music services like Spotify, for Facebook’s news feed and for Netflix’s own program menu, working to deliver just what you like while filtering out whatever might turn you off and send you away  —   the sorts of   honey traps that are all the talk at the South by Southwest Interactive Festival going on here through this week. So why not extend the idea to the plots of your favorite shows? The Mail even went so far as to envision viewers of the British historical drama “The Crown” making it so that Princess Margaret gets to marry her sister’s equerry, Peter Townsend. Of course, as Princess Margaret knew all too painfully, history saw no such union. But that’s no big deal anymore  —   at least if you consider the way people are being primed to shape the arc of the narratives on their highly personalized electronic screens to suit their own tastes, even if it means banishing inconvenient facts. As Dan Wagner, the Obama campaign data wiz and current Civis Analytics chief executive, put it when I bumped into him here during the weekend, “You used to be a consumer of reality, and now you’re a designer of reality. ” Understanding how that is playing out more broadly will help explain why you and your aunt’s new boyfriend can see the same events unfold in Washington and have utterly different ideas about what just happened. Allow me to direct you to the       news media misadventure of the past week, which I’ll call “POTUS45, Episode 6: The Presidential Wiretap That (A) Was, (B) Wasn’t, (C) Was Because He’s a Russian Agent and Oh, Sister, Is He in Trouble. ” It started with President Trump’s Twitter posts accusing former President Barack Obama of having wiretapped his phones at Trump Tower. Game on. If you were inclined to believe that Mr. Obama did what Mr. Trump said he did  —   indeed, if you wanted to believe it  —   you probably would have tuned into “Fox  Friends” that Sunday morning for Adventure A. There, you would have seen the radio host Mark Levin, whose show was credited with helping to spur Mr. Trump’s accusations, laying out the case for Mr. Trump, declaring, “This is about the Obama administration’s spying. ” The proof, you would have heard him say, was already out there in the mainstream media  —   what with a report on the website Heat Street saying that the Federal Bureau of Investigation had secured a warrant to investigate ties between people in Mr. Trump’s campaign and Russia, and articles in The New York Times, in The Washington Post and elsewhere about intelligence linking people in Mr. Trump’s campaign to Russia, some of it from wiretaps. “These are police state tactics!” Mr. Levin would tell you. The next day, perhaps your Twitter or Facebook feed turned up a post from the Gateway Pundit  —   recently granted a White House press credential  —   speculating that maybe, just maybe, the F. B. I. director “Let Hillary Off the Hook Because She Knew About F. B. I. Wiretapping. ” As the week unspooled, you would have seen commentary on why Mr. Trump’s charge was so believable (Breitbart) and, shockingly, how it’s even possible that the C. I. A. hacked Clinton campaign email but made it look as if Russia had done it (Bill Mitchell, Ann Coulter, Sean Hannity). Sure, you would have picked up static from other sources that made some of this seem ridiculous. But that stuff is for the followers of Adventure B, relying on   journalism from seasoned reporters with deep contacts and established (and, yes, sometimes imperfect) protocols for    —   all of which the Adventure A people view with deep suspicion that the president is only too happy to stir. If you were among the Adventure B folk, maybe you saw James Clapper Jr. the former national security director, tell Chuck Todd on “Meet the Press” that Sunday that the F. B. I. had not secured a FISA warrant to spy on Mr. Trump’s aides. You probably would have seen the news, first reported by The Times, that the F. B. I. director, James B. Comey, had asked the Justice Department to deny Mr. Trump’s charge (to no avail) and the viral video of George Stephanopoulos of ABC News telling a presidential aide, “That’s false,” as she tried to reprise the Adventure A argument that mainstream news reports backed Mr. Trump’s wiretap accusation. You would have seen PolitiFact’s    rebuttal of the same argument  —   and, finally, a week later, reports about how evidence for Mr. Trump’s charge still had yet to surface. Or, lastly, were you an Adventure C kind of person? If so, you couldn’t get enough about how Mr. Trump’s wiretap allegation and the Russian connections could lead to his impeachment (MSNBC, The Independent, Maxine Waters) and your Facebook feed probably included the learnprogress. org headline “The F. B. I. Is Now Officially CRIMINALLY Investigating Donald J. Trump. ” (Nothing in the posting it links to shows evidence for any such thing.) As Mr. Stephanopoulos told me when we spoke by phone over the weekend, the trend may have been heading this way for a while  —   you don’t need an algorithmic feed to turn on Fox News or to catch Rush Limbaugh. But in the era of the curated digital news stream, the    phenomenon has “ended up in a whole new place,” Mr. Stephanopoulos said. It’s easy to overdo it, he noted, given that no specially tailored plotline can fully tune out the contradicting details of another one. “Filters do have to contend with each other in some way, too,” he said. Really, arguments between adherents of the different adventure plots are the stuff of cable news programming, with each narrative vying for supremacy in debates that too often become arguments over established facts that should be indisputable. Because, after all, one of the plots we’re talking about here is of the sort that democracy depends on  —   that would be Adventure B, the one based on established facts that exist in the real world  —   and the others are of the sort that threatens to undermine any shared sense of truth while driving us into our corners. At South by Southwest here, a lot of words have been spilled on what to do about it, and just how urgently this multidimensional view of reality needs to be addressed  —   and how to do so. At a Mediapost event on the “  era” I participated in on Saturday, the editor of PolitiFact, Angie Drobnic Holan, said the truth would always come out, eventually. “At some point, evidence and facts will win out over an idea that has no substance,” she said. Our Mediapost conversation wandered into whether the big platforms could inject individual information streams with more   items that might run counter to a person’s baseless beliefs. Intriguing. But there’s not a ton of economic incentive for the platforms to give people what they don’t want. Late Sunday, I checked out a   exhibit presented at the Austin Motel by the digital creative collective the Future of StoryTelling. You could throw on the goggles, become a bird and fly around. If virtual reality can allow a human to become a bird, why couldn’t it allow you to live more fully in your own political reality  —   don the goggles and go live full time in the adventure of your choosing: A, B or C. Just watch out for that wall you’re about to walk into IRL (in real life). Or, hey, don’t  —   knock yourself out.'"}, "time": 1742564540.8834798}