{"duration": 0.08009171485900879, "input_args": {"text": "'Just days before his inauguration,   Donald J. Trump stood beside his tax lawyer at a Midtown Manhattan news conference as she announced that he planned to place his vast business holdings in a trust, a move she said would allay fears that he might exploit the Oval Office for personal gain. However, a number of questions were left unanswered  —   including who would ultimately benefit from the trust  —   raising concerns about just how meaningful the move was. Now, records have emerged that show just how closely tied Mr. Trump remains to the empire he built. While the president says he has walked away from the    operations of his business, two people close to him are the named trustees and have broad legal authority over his assets: his eldest son, Donald Jr. and Allen H. Weisselberg, the Trump Organization’s chief financial officer. Mr. Trump, who will receive reports on any profit, or loss, on his company as a whole, can revoke their authority at any time. What’s more, the purpose of the Donald J. Trump Revocable Trust is to hold assets for the “exclusive benefit” of the president. This trust remains under Mr. Trump’s Social Security number, at least as far as federal taxes are concerned. Since his election, there have been widespread calls for Mr. Trump to sell his assets and put the proceeds in a blind trust. He has resisted those calls, stressing that the president has no legal obligation to do so. While the trust structure, outlined in documents made public through a Freedom of Information Act request by ProPublica, may give the president the appearance of distance from his business, it drew sharp criticism from experts in government ethics. “I don’t see how this in the slightest bit avoids a conflict of interest,” said Frederick J. Tansill, a trust and estates lawyer from Virginia who examined the documents at the request of The New York Times. “First it is revocable at any time, and it is his son and his chief financial officer who are running it. ” It is not uncommon for people to place assets in a trust with themselves as beneficiaries for   purposes. But Mr. Trump’s situation is unprecedented because it involves a wealthy president acting to avoid an appearance of conflict of interest. The Trump Organization declined to comment for this article. The most immediate test of Mr. Trump’s legal moves to separate himself from his company, the Trump Organization, pertains to the ownership of the new Trump International Hotel in the Old Post Office Building in Washington. The trust documents, which were prepared last month, argue that “all beneficial ownership in the licensee previously held by Donald J. Trump, personally, now is held derivatively and beneficially by The Donald J. Trump Revocable Trust,” which is legal language intended to suggest that Mr. Trump no longer has a personal tie to the hotel lease. A provision in the 2013 lease for the building, held by Mr. Trump and his three oldest children, appears to prohibit a federally elected official, including the president, from benefiting from it. But lawyers who specialize in federal contracts say the trust arrangement simply creates an additional legal step between Mr. Trump and the hotel  —   meaning he will still profit from it. Robert H. Sitkoff, a professor at Harvard Law School, said the new details in the trust documents were unlikely to resolve the apparent legal problems with the Old Post Office site. “Formally he is no longer the owner, but functionally he still is,” he said. Representative Elijah E. Cummings, Democrat of Maryland, the ranking member on the House Committee on Oversight and Government Reform who has called for a congressional investigation into the lease, said he remained unsatisfied that Mr. Trump had addressed his conflicts. “This is smoke and mirrors,” he said of the new documents. While Mr. Trump may have to take additional legal steps to avoid violating the terms of the Old Post Office lease, he is exempt from laws that prohibit federal employees from participating in government matters that will directly affect their own financial interests. At the Jan. 11 news conference in which she outlined the plans for Mr. Trump’s assets, Sheri A. Dillon, his tax lawyer, called the steps he had already taken significant, adding there was an agreement governing the president’s trust that “sharply” limited the amount of information about his company that he could access. “The   will have no role in deciding whether the Trump Organization engages in any new deal,” she said, “and he will only know of a deal if he reads it in the paper or sees it on TV. ” Ms. Dillon added that an asset sale by Mr. Trump would also be fraught with issues. “Whatever price was paid would be subject to criticism and scrutiny,” she said. “Was it too high? Is there pay for play? Was it too much pay to curry favor with the  ?” The Trump Organization, which is privately held, has also released a list of 488 Trump companies that Mr. Trump has held positions at, saying he resigned from all of them. Public records show that he has severed ties from some of these entities. The Trump Organization has pledged not to pursue new business deals overseas, though it plans to expand within the United States. Last month the company named Bobby Burchfield, a longtime Republican Party lawyer and corporate litigator, as an “independent ethics adviser. ” The Donald J. Trump Revocable Trust has existed since at least 2014, records show. By 2016 it was the only shareholder in DJT Holdings, one of Mr. Trump’s main limited liability companies, according to documents filed by Mr. Trump as part of his bid for president and released by the Federal Election Commission. That company holds some of Mr. Trump’s largest assets, including his Old Post Office lease, golf courses and residential properties including a house in Beverly Hills, Calif. New York City property records show that in recent weeks Mr. Trump has transferred several residential condominiums he owns into the trust.'"}, "time": 1742564599.280558}