{"duration": 0.03146553039550781, "input_args": {"text": "'President Donald Trump broke the Internet once again during the inauguration of the Global Center for Combating Extremist Ideology Sunday in Riyadh, the capital of Saudi Arabia. [To signify the official start to the facility’s operations, Trump touched a brightly lit globe with Saudi King Salman bin Abdulaziz and Egypt’s president Abdel Fatah  . An   Saudi TV screen grab quickly went viral, with the Internet quickly dubbing the object “the Trump orb. ”  And, just like that, a meme was born. Do 👏 not 👏 touch 👏 the 👏 orb 👏 unless 👏 you 👏 understand 👏 and 👏 respect 👏 the 👏 history 👏 of 👏 orb 👏 cultureThis 👏 is 👏 appropriation pic. twitter.   —   Siobhan Thompson (@vornietom) May 21, 2017,  WILL THE ORB MAKE A #TWINPEAKS APPEARANCE DO WE KNOW? pic. twitter.   —   William J. Simmons (@WJ_Simmons) May 21, 2017,  All this orb GIF is missing is Hank Scorpio pic. twitter.   —   CJ Fogler (@cjzero) May 21, 2017,  This is Riyadh HOT101. 5’s version of a Touch the Truck contest. Last one touching the orb wins it, and 25 million barrels of crude oil. pic. twitter.   —   Matt Bevan 🎙 (@MatthewBevan) May 21, 2017,  the glorious orb, he’s a great guy, he has purified me with his serene energy many times,  —   Matt Pearce (@mattdpearce) May 21, 2017,  I hate Trump as much as anyone does, but I can’t criticise his desire to hold a mysterious glowing orb,  —   Ahir Shah (@AhirShah) May 21, 2017,  You vs. the Orb she told you not to worry about. pic. twitter.   —   Jacob Bacharach (@jakebackpack) May 21, 2017,  when the orb is good pic. twitter.   —   martin rickman (@martinrickman) May 21, 2017,  pic. twitter.   —   Breitbart News (@BreitbartNews) May 21, 2017,  Watch a video of the ceremony here.'"}, "time": 1742562934.4452696}