{"duration": 0.06679153442382812, "input_args": {"text": "'Nigel Farage Fears Brexit ‘Betrayal’ and Warns of ‘Public Anger’ Following Historic Article 50 Ruling Chris Kitching, Mirror, November 3, 2016 \\nNigel Farage has warned fellow politicians that any attempt to block or delay Britain’s exit from the European Union will be met with untold anger from the public. \\nIn a statement released after the historic High Court ruling on Article 50 the interim Ukip leader said he fears a Brexit “betrayal” is on the horizon. \\nThe judges ruled that the government doesn’t have the power to trigger two-year exit process Article 50 without a vote by MPs. \\nFarage campaigned vigorously for Brexit and declared the June 23 referendum Britain’s “independence day” after the shock result was confirmed. \\nAfter the High Court ruling was announced on Thursday morning Farage said: “I worry that a betrayal may be near at hand. \\n“Last night at the Spectator Parliamentary Awards I had a distinct feeling that our political class, who were out in force, do not accept the 23rd of June Referendum result. \\n“I now fear that every attempt will be made to block or delay the triggering of Article 50 . \\n“If this is so, they have no idea of the level of public anger they will provoke.” \\nThree of England’s top judges gave the ruling after a costly three-day hearing. \\nThe Government immediately announced it would appeal to the Supreme Court. \\nUkip millionaire donor Arron Banks accused the “legal establishment” of “declaring war on British democracy”. \\nHe added: “Parliament voted six-to-one in favour of letting the people decide. \\n“They didn’t get the answer they wanted, and now they’re going to use every dirty trick in the book to try to sabotage, delay or water down Brexit.” \\nUkip leadership hopeful Suzanne Evans blasted the judges and said the court ruling “undermines democracy”. \\nThe former party chair urged the government to appeal. \\nShe wrote on Twitter : “How dare these activist judges attempt to overturn our will? It’s a power grab & undermines democracy. Time we had the right to sack them. \\n” Article 50 is an EU trap we must not fall in to. It will tie us into the EU for years. The government must appeal. People power must win.” \\nLabour Leader Jeremy Corbyn said: “This ruling underlines the need for the Government to bring its negotiating terms to parliament without delay. \\n“Labour respects the decision of the British people to leave the European Union. \\n“But there must be transparency and accountability to parliament on the terms of Brexit . \\n“Labour will be pressing the case for a Brexit that works for Britain, putting jobs, living standards and the economy first.” \\nLiberal Democrats Leader Tim Farron welcomed the ruling. \\nHe said: “Given the strict two year timetable of exiting the EU once Article 50 is triggered, it is critical that the government now lay out their negotiating to Parliament, before such a vote is held.”'"}, "time": 1742562719.794236}