{"duration": 0.025838136672973633, "input_args": {"text": "'Nuclear war may break out for reasons that no one speaks about 01.11.2016 Print version Font Size Scientists from the United Nations University named a place in the world, where a nuclear conflict may break out already in the near future.\"The Indus river basin may be seen as a water time bomb, which may go off any time with increasing water scarcity, variability and progressively changing climate. There are similar water-related accumulating tensions and issues in other major river basins and UNU-INWEH has embarked on the scrupulous analysis of those to ensure peaceful and sustainable trajectory of river basin developments,\" UNU-INWEH Director Vladimir Smakhtin said. It goes about two warring countries, both being nuclear powers - India and Pakistan .A month ago, India announced the termination of the work of the bilateral Indus River Commission. The commission had been in charge of water relations between India and Pakistan since 1960, when the countries signed the Indus Waters Treaty. Islamabad, in turn, declared it a hostile action on the part of New Delhi and said that such a move of the Indian government would be regarded as \"an act of declaration of war.\"The problem remains serious not only because of the irreconcilable hostility between India and Pakistan, but also because of the growing consumption of water in China and Afghanistan - the adjacent countries to India and Pakistan.The Indian subcontinent already has water supplies problems, and the further increase of the shortage of water resources may give rise to internal political instability in the country. The instability will in turn push the country\\'s leadership to a move to \"solve all problems at once.\" In March of 2016, former Minister for Foreign Affairs of Russia (in 1998-2004), Igor Ivanov, said that the danger of a nuclear war in Europe was higher than it was in the 1980s.Ivanov, who now heads the Russian Council for International Affairs, noted a high risk of confrontation with the use of nuclear weapons in Europe. According to the Stockholm Peace Research Institute, Russia and the United States currently own fewer nuclear weapons than they did during the Cold War. However, even though both Russia and the USA have 7,000 warheads each, the countries still own approximately 90% of all nuclear weapons in the world.The former minister, speaking in Brussels to foreign ministers of Ukraine and Poland and a US congressman, said: \"We now have fewer nuclear warheads , but the risk that they will be used, is increasing.\"He also accused the United States and Europe of raising such risks by deploying the European missile defense system. A part of the nuclear shield is being built on one of the bases in Poland. The missile defense system will be deployed in 2018, which is particularly sensitive for the Kremlin, as the US missile defense system will be taken very close to Russia\\'s borders. Pravda.Ru Read article on the Russian version of Pravda.Ru USA gets ready for nuclear war?'"}, "time": 1742628573.8731368}