{"duration": 0.06524276733398438, "input_args": {"text": "'Helen of Troy, according to the Odyssey, was “the face that launched a thousand ships,” prior to the Greek invasion of Troy. You and I, on the other hand, are the faces that launch an army of CCTV cameras ready to capture our images when we walk past them. ReadyNutrition Readers, we just covered winter camouflage tips and techniques. Camouflage is an important part of your prepping, in terms of being able to effectively hide yourself and your supplies from prying eyes.\\n( Sign up for our FREE newsletter to get prepper advice, homesteading tips, and more delivered straight to your inbox!) One of the biggest problems that we encounter is not blending in with the terrain in a wilderness environment, however, but what we face in an urban and suburban environment. As mentioned in previous articles, you have to camouflage in accordance with the environment you find yourself within. It would not be intelligent to stroll down the sidewalk of Hollywood Boulevard dressed up in Realtree-patterned garb with a holstered sidearm and a hunting knife. You would undoubtedly be “noticed,” and probably take a ride in a black and white, courtesy of the police department.\\nThere’s an article that gives some very stark details about the 250 million security cameras in existence throughout the world. The article entitled “ Opinion: Facial recognition will soon end your anonymity , ” written by Tarun Wadwha on 6/4/2016 explains this in detail and how new developments in software and the ever-growing number of cameras everywhere are reducing your chances to remain anonymous. Chances are that your face has already been scanned and entered into a database without your knowledge. Knowing these things, there are a few measures that we can take…and these are directed toward urban and suburban dwellers to give them an edge.\\nWhat these Statists are trying to do is to create a “map” of where you are and what you’re doing, along with the times and dates of your activities. Go and see (or rent out) the latest “Jason Bourne” movie to really get a feel for the intricacies of how these Law Enforcement agencies, the government, and other interests utilize the public domains to tie into their surveillance of you and your family.\\nPrepare for any disaster with this step-by-step manual 6 Ways to Dodge Biometric Verification Here are some things you can do, and keep in mind to help lower your signature:\\nWear sunglasses during the daylight hours …breaking up the potential to photograph your eyes, the way they are set into your face, and any eye movements that might give away what you are doing (what you’re getting ready to do). Wear a hat , especially one that covers up the ears. Baseball caps are fine, but they really focus on the ears – their shape and proximity to the side of your head – for identification purposes. The caps also bust up the curvature of your head and also hide the hair and hair patterns. Wear scarves, turtlenecks, and other clothing such as balaclavas to break up the outline of the neck. Gloves : hide the hands, your marital status, and scars, fingernails, or other prominent features…even the fingerprints can be photographed. Layered clothing : yes, this is great to protect from the cold, but I’ll give you another reason to wear it. The Doctrine of Contrasting Colors . For a “real-time” view of this look no further than the movie “The Recruit” with Colin Farrell and Al Pacino. Farrell escaped from his pursuers by shedding the outer layer of his clothing and reversing the jacket. You can do the same. Make the green sweatshirt disappear when the need arises with a change to a tan polypro top with a zippered neck. Rule of Thumb: “When the Need Arises.” Yes, you can pack yourself a small “kit” with darker-toned makeup/lighter-toned makeup such as skin cream, and also hats of various types different from the ones you normally use. A wig may be a quick fix to turn your hair from brown to blonde. There are also movie supply sites you can visit that will sell you real mustaches actually made from human hair. Sound stupid? It won’t if you use it and it keeps you out of a cell. This measure is for when it’s really hitting the fan…not for “day to day” activities. Another big problem to overcome with all of this surveillance is the fact that most people have their constantly clicking and snapping little phone-cameras to take pictures of every single thing on the planet within their “biome,” and it’s these individuals who serve as “silent witnesses” to help the surveillance state gather as much info as they can. In addition, let’s not forget that every photo you post, twitter, place on Facebook, or download in any capacity does indeed become “scarfed up” by the government. That $50-billion-dollar facility in Utah wasn’t built to help out Olan Mills with their photography work.\\nBe aware, and not just of others but of yourself . Reduce the “footprint” you put out by learning where the cameras are where you work and on your trips back and forth to your house. Disable the little camera-dot on the top edge of your laptop with 2 layers of aluminum HVAC duct tape pieces. Disable the microphone within it as well. Bottom line: you have to pull security for yourself and on yourself to reduce the chances of them cataloguing your every move. Don’t give them what they need to build up their files.\\nWe are entering into a phase in our country with a moment of decision to come with the U.S. elections. Martial law is always just around the corner, waiting to be inflicted on us. These are techniques you’ll have to incorporate into your daily routine and they’ll take some practice. Awareness and the ability to act on what is happening around you are the keys you’ll need to be able to make it all work. We’d like to hear any suggestions you have on the matter that may work for others. Keep fighting that good fight, and stay away from those cameras! JJ out! \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published October 27th, 2016 This is Why Our Anonymity is a Thing of the Past Winter Survival: How to Blend into a Winter Environment Hardcore Survival: What To Wear in the Harshest Conditions Don’t Wave: Hacker Uses Online Photos to Replicate… 5 Ways Coconut Oil Can Bring Out Your Natural Beauty '"}, "time": 1742628479.442426}