{"duration": 0.08692622184753418, "input_args": {"text": "'Saturated Fat and Heart Disease: “The Greatest Scam in the History of Medicine” \\nby Brian Shilhavy Editor, Health Impact News \\nDr. Malcom Kendrick is a Scottish doctor and author of the book The Great Cholesterol Con . \\nRecently he wrote a blog post on saturated fat and cardiovascular disease. He commented on how the science actually proves the opposite conclusion from what is commonly believed about saturated fats: \\nTo be honest, I have studied saturated fat consumption many, many… many, many, times. The one thing that has always stood out, most starkly, is the complete lack of any real evidence to support the idea that it causes cardiovascular disease. \\nOn the other hand, evidence contradicting it arrives on an almost daily basis. \\nKendrick goes on to quote from a recently published study which showed, in Kendrick’s words: \\nThe more saturated fat you eat, the lower your risk of dying of cardiovascular disease, and vice-versa. \\nSo why is this hypothesis about saturated fat and heart disease so entrenched in medical circles? \\nKendrick draws an interesting parallel between the recent attacks against Dr. Waney Squier and her exposure of the theory of “Shaken Baby Syndrome” as having no scientific merit. \\nMy thoughts were drawn to this issue by something seemingly unconnected. Which is a legal hearing in the UK concerning shaken baby syndrome. Most experts in paediatrics are absolutely convinced that there is such a thing. It is quoted in textbooks as an undisputed fact. Many parents, and other adults, have been convicted, and sent to jail, for shaking their babies so hard that it caused the ‘triad’ of shaken baby syndrome: subdural hematoma, retinal bleeding, and brain swelling \\nOn the other hand, we have Dr. Waney Squier, a paediatrician who used to provide expert opinion on child abuse cases in the UK. She was struck off by the General Medical Council (GMC) for, well the exact judgement is, as per Derrida, impossible to understand. \\nLeaving the machinations of the GMC aside, the main issue is simple. Dr. Waney Squier does not believe that shaken baby syndrome exists. Of course she knows that the triad of subdural haematoma, retinal bleeding and brain swelling exists. But she believes there could be other explanations. Including, perish the very thought, an accidental fall. \\nBecause she does not believe in shaken baby syndrome, she has presented evidence in court which has tended to undermine the prosecution case against parents and carers, accused of shaking a baby and causing severe brain damage. Much to the annoyance of the police, and they then, for it was indeed them, reported Dr. Squier to the GMC. \\nNow, I know what most of you are thinking. Surely ‘shaken baby syndrome’ exists. This must have been proven. Well, it has not. If you think about it, how could it be proven? How do you think a study on shaken baby syndrome could ever be done? Get five hundred children, shake them forcefully and see what happens to their brains. I suspect you might find gaining ethical approval for a such a study might be tricky. Shaken Baby Syndrome: Saturated Fat Consumption \\nKendrick goes on to explain what he sees as the rationale in both scientific theories that seem to have very little evidence to support, and yet is widely held in medical circles. Regarding Shaken Baby Syndrome: \\nOn the fact of it shaken baby syndrome and saturated fat consumption have very little in common. However, from another perspective the parallels are clear. Both are seductively simple ideas that appeal to common sense. That most deadly of all senses. \\nMost people can clearly see how a small, vulnerable, baby will suffer significant brain injury if it is shaken too hard. Close your eyes and you can virtually see it happening. If you can bear having that image in your head for any length of time. \\nMost parents, I think, can almost see themselves doing it, or having done it – when their child will ‘just not dammed well stop crying.’ In short, shaken baby syndrome can easily be visualised, and it triggers a kind of visceral horror. We can easily see how a feckless parent may lack the self-control required to stop themselves doing it. ‘Shut up, shut up, shut up….’ \\nAnd that, dear reader, is as scientific as shaken baby syndrome gets. A hypothesis based on visceral fear, prejudice, and knee-jerk judgement. This makes it almost perfectly resistant to any contradictory evidence. Try to argue against it, and you will meet anger and bluster and the idée fixe. \\nRegarding Saturated Fats causing Heart Disease: \\nThe ‘saturated fat causing heart disease hypothesis’ comes from a very similar place called – well, it’s obvious isn’t it, just common sense. Heart disease is basically a build up of fat in the arteries, isn’t it? Where can that possibly come from? Fat in the diet. Especially the thick, sticky, gooey stuff that you get on a pork chop, or suchlike. That’s got to be it hasn’t it? The thick horrible squidgy gooey fat that you eat, ends up as thick horrible squidgy gooey fat in your arteries. Serves you right for eating fat, and McDonald’s, and suchlike. \\nThere rests the entire scientific argument against saturated fat. As such it is difficult to argue against. Facts simply bounce off. \\nComment on this article at CoconutOil.com. Published on November 9, 2016 Share This Story, Choose Your Platform! \\nGet the news right in your inbox ! Choose your options:'"}, "time": 1742561706.8742573}