{"duration": 0.1868135929107666, "input_args": {"text": "'LONDON  —   The London newsroom and studios of RT, the television channel and website formerly known as Russia Today, are ultramodern and spacious, with spectacular views from the 16th floor overlooking the Thames and the London Eye. And, its London bureau chief, Nikolay A. Bogachikhin, jokes, “We overlook MI5 and we’re near MI6,” Britain’s domestic and foreign intelligence agencies. Mr. Bogachikhin was poking fun at the charge from Western governments, American and European, that RT is an agent of Kremlin policy and a tool directly used by President Vladimir V. Putin to undermine Western democracies  —   meddling in the recent American presidential election and, European security officials say, trying to do the same in the Netherlands, France and Germany, all of which vote later this year. But the West is not laughing. Even as Russia insists that RT is just another global network like the BBC or France 24, albeit one offering “alternative views” to the   news media, many Western countries regard RT as the slickly produced heart of a broad, often covert disinformation campaign designed to sow doubt about democratic institutions and destabilize the West. Western attention focused on RT when the Obama administration and United States intelligence agencies judged with “high confidence” in January that Mr. Putin had ordered a campaign to “undermine public faith in the U. S. democratic process,” discredit Hillary Clinton through the hacking of Democratic Party internal emails and provide support for Donald J. Trump, who as a candidate said he wanted to improve relations with Russia. The agencies issued a report saying the attack was carried out through the targeted use of real information, some open and some hacked, and the creation of false reports, or “fake news,” broadcast on   news media like RT and its sibling, the internet news agency Sputnik. These reports were then amplified on social media, sometimes by computer “bots” that send out thousands of Facebook and Twitter messages. To many Americans, the impression that RT is an instrument of Russian meddling was reinforced when its programming suddenly interrupted  ’s online coverage of the House of Representatives in January. (  later called it a technical error, not a hacking.) Watching RT can be a dizzying experience. Hard news and   graphics mix with interviews from all sorts of people: well known and obscure, left and right. They include favorites like Julian Assange of WikiLeaks and Noam Chomsky, the liberal critic of Western policies odd voices like the actress Pamela Anderson and cranks who think Washington is the source of all evil in the world. But if there is any unifying character to RT, it is a deep skepticism of Western and American narratives of the world and a fundamental defensiveness about Russia and Mr. Putin. Analysts are sharply divided about the influence of RT. Pointing to its minuscule ratings numbers, many caution against overstating its impact. Yet focusing on ratings may miss the point, says Peter Pomerantsev, who wrote a book three years ago that described Russia’s use of television for propaganda. “Ratings aren’t the main thing for them,” he said. “These are campaigns for financial, political and media influence. ” RT and Sputnik propel those campaigns by helping create the fodder for thousands of fake news propagators and providing another outlet for hacked material that can serve Russian interests, said Ben Nimmo, who studies RT for the Atlantic Council. Whatever its impact, RT is unquestionably a case study in the complexity of modern propaganda. It is both a slick modern television network, dressed up with great visuals and stylish presenters, and a content farm that helps feed the European far right. Viewers find it difficult to discern exactly what is journalism and what is propaganda, what may be “fake news” and what is real but presented with a strong slant. A recent evening featured reports of Britain refusing to condemn human rights violations in Bahrain and a “mainstream media firestorm” over Attorney General Jeff Sessions’s chats with the Russian ambassador to the United States. Other reports included the “liberation” of Palmyra by the Syrian Army with “the support of the Russian Air Force” an interview with former British ambassador to Syria and a United States critic, Peter Ford and a report about a London professor decrying the fall in British living standards. There are “clickbait” videos on RT’s website and stranger pieces, too, like one about a petition to ban the financier George Soros from America for supposedly trying to “destabilize” the country and “drown it” with immigrants for a “globalist goal. ” Mr. Bogachikhin and Anna Belkina, RT’s head of communications in Moscow, insist it is absurd to lump together RT’s effort to provide “alternative views to the mainstream media” with the phenomena of fake news and social media propaganda. “There’s an hysteria about RT,” Ms. Belkina said. “RT becomes a shorthand for everything. ” For example, she says, while RT was featured heavily in the American intelligence report, it was largely in a   annex (of a   report) that was written more than four years ago, in December 2012, a fact revealed only in a footnote on Page 6. She flatly denies any suggestion that RT seeks to meddle in democratic elections anywhere. “The kind of scrutiny we’re under  —   we check everything. ” For RT and its viewers, the outlet is a refreshing alternative to what they see as complacent Western elitism and   representing what the Russian Foreign Minister Sergey V. Lavrov recently called a “  world order. ” With its slogan, created by a Western ad agency, of “Question More,” RT is trying to fill a niche, Ms. Belkina said. “We want to complete the picture rather than add to the echo chamber of mainstream news that’s how we find an audience. ” Nearly all the mainstream media came out against Mr. Trump during the campaign and much of the news coverage about him was negative, she said. “This is why we exist,” Ms. Belkina said. “It’s important to watch RT to hear alternative voices. You might not agree with them, but it’s important to try to understand where they’re coming from and why. ” A French legislator, Nicolas Dhuicq, who has appeared on RT and went to   Crimea in 2015 as part of a delegation of French legislators, said that RT’s aim was “to make the voice of Russia heard, to make the Russian point of view on the world heard. ” Still, Mr. Dhuicq said, “the impact of RT, in my opinion, is very low. ” He added: “There is enormous paranoia when we imagine that RT will change the face of the world, influence national or other elections. ” Afshin Rattansi, who hosts a talk show three times a week called “Going Underground,” came to RT in 2013 after working at the BBC, CNN, Bloomberg, Al Jazeera and Iran’s Press TV. “Unlike at the BBC and CNN, I was never told what to say at RT,” he said. There have been two cases of RT announcers quitting because of what they said was pressure to toe a Kremlin line, especially on Ukraine, but not in London, Mr. Rattansi said. Michael McFaul, a Stanford professor who was the United States ambassador to Russia during the Obama years, said that RT should not be lightly dismissed. “There is a demand in certain countries for this alternative view, an appetite, and we arrogant Americans shouldn’t just think that no one cares. ” But there is a considerably darker view, too. For critics, RT and Sputnik are simply tools of a sophisticated Russian propaganda machine, created by the Kremlin to push its foreign policy, defend its aggression in Ukraine and undermine confidence in democracy, NATO and the world as we have known it. Robert Pszczel, who ran NATO’s information office in Moscow and watches Russia and the western Balkans for NATO, said that RT and Sputnik were not meant for domestic consumption, unlike the BBC or CNN. Over time, he said, “It’s more about hard power and disinformation. ” The Kremlin doesn’t care “if you agree with Russian policy or think Putin is wonderful, so long as it does the job  —   you start having doubts, and of 10 outrageous points you take on one or two,” he said. “A bit of mud will always stick. ” Probably more important than RT, Mr. Pszczel said, are Sputnik and local language outlets sponsored by Russia, like the Slovak magazine “Zem a Vek,” known for its conspiracy theories. Sputnik is the largest source of raw news in the Balkans, he said, “because it’s a free product in local languages. ” And “then they set up some friendly association, at some small university, which holds seminars, and then a number of strange websites start promoting the product, like an industrial marketing operation. ” But RT is also helpful in another traditional Moscow effort: making friends with useful people, and not just Mr. Assange, Mr. Pomerantsev said. “RT made Mike Flynn feel good after losing his job” as head of the Defense Intelligence Agency, he said, paying him a reported $40, 000 to come to RT’s anniversary celebration in Moscow and sit near Mr. Putin. And Mr. Flynn, for a time, was national security adviser of the United States. Mr. Nimmo of the Atlantic Council noted RT’s small reach in Germany, where Angela Merkel, a Putin critic, is facing a tough   fight, and where there are up to 3. 5 million Russian speakers. “I strongly suspect that RT Deutsch has a trivial effect compared to   Germans watching Russian television,” he said. Stefan Meister, who studies Russia and Central Europe for the German Council on Foreign Relations, agreed that “we shouldn’t overestimate RT. The main success of the Russians is the link to social media through bots and a network of different sources. ” That network, he said, is “increasingly well organized, with more strategic and explicit links between sources and actors  —   Russian domestic media, troll factories, RT, people in social networks and maybe also the security services. ” “Open societies are very vulnerable,” Mr. Meister said, “and it’s cheaper than buying a new rocket. ” RT is part of the reality of the 21st century, Mr. Pomerantsev said. “Everyone will do it soon. It’s the world we have to live in. ” Hacks and leaks are much more disruptive, he said. “If you can take out the electrical grid in Ukraine, that’s scary. It’s hard to get too scared about Larry King on RT. ” Mr. Pomerantsev agrees with Ms. Belkina that RT is not inventing popular mistrust about Western democracy. “The Russians are about sowing mistrust about institutions that is there already, feeding it,” he said. “How do we make our institutions more trustworthy?”'"}, "time": 1742563586.6343338}