{"duration": 0.07653975486755371, "input_args": {"text": "'Last month, on the day after a gunman killed 49 people at a gay nightclub in Orlando, Fla. The Orlando Sentinel ran a   editorial with the headline, “Our Community Will Heal. ” And on Sunday, three days after a sniper killed five police officers during a protest in downtown Dallas, The Dallas Morning News responded with its own   editorial, featuring an image of an eye shedding a tear. “This city, our city, has been tested before,” the editorial said. “Now we face a new test. ” As spasms of violence continue to tear apart cities across the country, newspapers have been using   editorials as a salve for healing   communities. But more than that, the front page has come to reflect the rising frustration of a fractured country reeling from bloodshed. “There’s no doubt that   editorials have come more into some prominence in the last year or so,” said Al Tompkins, a senior faculty member at the Poynter Institute. “I think it’s a way of trying to tap into the public consciousness. ” In the last several months, The Boston Globe and The New York Times have both printed   editorials calling for stricter regulation of guns in the aftermath of mass shootings. It was the first time since 1920 that The Times had run an editorial on Page 1. The   which had its own mass shooting to cover when a student at Virginia Tech shot and killed 32 people and wounded 17 others on campus in 2007, ran a   editorial on Saturday that pleaded for a détente of sorts. “Let’s just stop and mourn and wonder how in the world America became this unspeakably, relentlessly terrorized place,” it said. The Daily News of New York has used its front page in recent months as an editorial vehicle to inveigh against violence and congressional inaction in the face of it, including one last month with the image of the dome of the Capitol soaked in blood. While many   editorials are intended to soothe and promote resolve, other bold decisions by news organizations have been criticized as sowing divisiveness. The New York Post, for instance, was excoriated on Friday for deciding to use the headline “Civil War” on its front page on the Dallas shooting. A headline on the conservative Drudge Report, “Black Lives Kill,” also drew harsh rebukes. Like other editorials, the one in The Dallas Morning News addressed the violence gripping the country. “We are surely not alone in asking, as our hearts break, what kind of country are we creating where such violence has become so frequent?” the editorial said. But it also acknowledged the city’s deep divisions and urged more compassion. “We live together, but we do not often understand one another. This is because of class, sometimes geography and often race,” it said. “There will be time later for anger and for justice  —   anger whose purpose is served in justice,” the editorial added. “But for now we need to learn to understand each other, to really hear one another, to learn from each other. ” Mike Wilson, the newspaper’s editor, said in a statement that the editorial was intended to provide a “quiet place” for reflection. “After two days of covering violence and heartbreak, we felt the need to pause for a moment and speak directly to the community,” he said. “We had two simple questions: What kind of city are we? What kind of city do we want to be? “In the midst of so much noise and pain, we needed a quiet place for that conversation,” he added. “Sunday’s front page is that quiet place. ”'"}, "time": 1742564511.6507294}