{"duration": 0.04987597465515137, "input_args": {"text": "'Barron Trump, President Donald Trump’s    son, reportedly “panicked” and became distressed after seeing Kathy Griffin’s   “beheading” photograph because he didn’t know who Griffin was or understand the context of the photo. [According to TMZ, Trump’s youngest son was watching television Tuesday when he saw the image of Griffin holding a fake, bloody decapitated head meant to resemble the president’s head.  Sources told the gossip outlet that Barron “panicked” and began calling for his mother, First Lady Melania Trump. “He’s 11. He doesn’t know who Kathy Griffin is and the head she was holding resembled his dad,” the source told TMZ. The photo of Griffin holding up Trump’s severed head  —   taken during a photo shoot with L. A.  artist Tyler Shields  —   was first published Tuesday morning by TMZ and sparked a firestorm online, with backlash coming from both sides of the political aisle and thousands of people calling for a boycott of Griffin’s national comedy tour. The president responded Wednesday morning, saying the photograph had been particularly difficult for his children, including Barron. “Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!” Trump tweeted. Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!  —   Donald J. Trump (@realDonaldTrump) May 31, 2017,  Griffin apologized in a video posted to her Twitter account Tuesday, in which she said she “crossed the line” and that the photo had gone “too far. ” The Secret Service has reportedly opened an investigation into the circumstances surrounding the photo shoot. Meanwhile, the fallout from the incident has continued CNN, where Griffin has   a live New Year’s Eve broadcast with Anderson Cooper since 2007, announced it was “evaluating” her future role in the program, while the comedian’s scheduled performance at the Route 66 Casino in Albuquerque, New Mexico has been cancelled.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564439.6817439}