{"duration": 0.08928871154785156, "input_args": {"text": "'Obama Won’t Vote With America at the UN Under Obama, the United States won’t defend the United States. November 1, 2016 Daniel Greenfield \\nDaniel Greenfield, a Shillman Journalism Fellow at the Freedom Center, is a New York writer focusing on radical Islam. \\nA generation ago the Communist tyranny in Cuba demanded that the United Nations condemn America for the embargo. The brutal Castro regime’s rant accused the United States of threatening “nuclear annihilation,” “countless acts of sabotage and plans to assassinate Cuban leaders.” \\nOn a cold day in October, the European left-wing activist serving as UN Ambassador announced to applause that her administration would no longer be voting to defend the US at the UN. \\n\"UN Member States have voted overwhelmingly for a General Assembly resolution that condemns the U.S. embargo and calls for it to be ended. The United States has always voted against this resolution. Today the United States will abstain,\" Samantha Power said. \\n\"Thank you,\" she added, acknowledging the applause. \\nUnder Obama, the United States would no longer defend the United States. A generation ago the Communists had been in Cuba. Now they were in Washington D.C. \\nInstead of defending America, Obama’s chosen representative agreed that our Communist enemies had a point about our lack of human rights and our imperialist foreign policy. \\n“Let me be among the first to acknowledge – as our Cuban counterparts often point out – that the United States has work to do in fulfilling these rights for our own citizens. And we know that at times in our history, U.S. leaders and citizens used the pretext of promoting democracy and human rights in the region to justify actions that have left a deep legacy of mistrust,” she said. \\nIf the Cuban representative had been in her place, he could not have done much better. Communist Cuban propaganda was now being parroted by Ambassador Power. If the Castro dictatorship wanted to save money, it could shut down its propaganda department and outsource the labor to Washington D.C. \\nThe Cuban ambassador boasted that Cuban Communists had “rid ourselves of US imperialism” and proclaimed that, “We will never go back to capitalism.” He declared that the resolution was a powerful message to “the peoples of the world.” The message is indeed unmistakable. \\nBen Rhodes, the close Obama adviser who sold the media on the Iran sellout, curtly tweeted his justification, “No reason to vote to defend a failed policy we oppose.” \\nWho is this “we”? \\nThe Cuban embargo is the “law of the land”. It’s the official policy of the United States. It’s based on laws passed by Congress and implemented by President John F. Kennedy and his successors. \\nThis “we” certainly isn’t the United States government, its elected representatives in the legislative and executive branches working together to end the old policy and implement a new one. \\nOne member of the “we” must be Ben Rhodes because he tells us so. Who is Rhodes? An “aspiring” novelist who pushed Obama to back the Muslim Brotherhood takeover of Egypt, the Iran nuke sellout and now, apparently, choosing Communist Cuba over America. \\nNo one has ever elected Rhodes to anything, but under left-wing rule, he outweighs Congress, President Kennedy, the law of the land and the national interests of the United States. \\n“We” is Obama who made the final decision. It’s Ambassador Samantha Power. It’s a number of other functionaries all of whom derive their power from a single elected official who is only one third of the government. This is the “we” that announced its treasonous opposition to the US at the UN. \\nAmerica has a “we” problem. \\nIf the “we” of the American left wants to vote its own way, it should secede to form its own country. \\nWhen President John F. Kennedy proclaimed the “Embargo on All Trade with Cuba”, he based it on authorization from “the Congress of the United States”. That is how our system used to work. \\nThese days El Teleprompte in D.C. decides that he wants to sign a nuclear treaty with Iran, mandate transgender bathrooms, legalize millions of illegal aliens or open relations with his brother tyrant in Havana and he does so on his own authority. And Congress is dismissed as a bunch of obstructionists. \\nThat’s not how America is supposed to work. That’s how Iran works. That’s how Cuba works. \\nThe first word in the introduction to Obama’s Presidential Policy Directive on Cuba after the date was “I”. Obama’s basis for his authority is his 2014 announcement. L\\'etat c\\'est moi. Obama is the State. \\nJFK, no humble shrinking violet, mentions “I” only in the fourth paragraph, after Congress. What is the context of Kennedy’s “I”? “Now, Therefore, I, John F. Kennedy, President of the United States of America, acting under the authority of section 620(a) of the Foreign Assistance Act of 1961.” \\nThe “I” of JFK can only act as a servant, not a master. \\nIn Obama’s “Directive”, Congress exists only to be berated or badgered for its obstructionism. There is no source of authorization for anything other than Barack Obama. There is no law. Only Obama. \\nNow the big “we” in Washington have decided that they will oppose America at the United Nations. But Ben Rhodes, who aspires to excel at novelistic narratives, made an unfortunate slip. Obama has been accused of Louis XIV’s L\\'etat c\\'est moi mentality. But Ben Rhodes isn’t saying, “We are the state”. Instead he tells us that there are two powerful political entities in America. One is US. The other is We. \\n“We” does not yet entirely control the state. But “we” also feels no obligation to the United States. If “we” agrees with America, then “we” will vote with it at the UN. If “we” opposes America, then “we” votes against it. “We” will choose patriotism or treason based on its own interests. Not ours. \\n“We” happens to run America. But it isn’t America. It’s the parasite humped on America’s back. \\nYou can call “we” by many names. Deep State is one. It’s a coalition of left-wing special interests networking through politics, the non-profit sector and media corporations to control America. \\nPresident Kennedy was quite familiar with the enemy . “We are opposed around the world by a monolithic and ruthless conspiracy that relies primarily on covert means for expanding its sphere of influence--on infiltration instead of invasion, on subversion instead of elections, on intimidation instead of free choice.” \\nKennedy was speaking after the recent Bay of Pigs crisis. The Foreign Assistance Act, mentioned by him, was passed by Congress that year. While the Cuban embargo limited the ability of the Castro regime to sponsor and spread terror around the region and the world, it didn’t stop the “we” in Washington D.C. \\nIt is easy to sit here in the distant future of 2016 and wonder whether Cuba matters at all. But the truth is that we are still enmeshed in the same fundamental struggle of the Cold War. That struggle did not end when the Berlin Wall fell. It is a battle over whether nations will be ruled by “We the People” or by the nameless “We” of the monolithic and ruthless conspiracy of the Nomenklatura of the left. \\nBy backing away from America at the United Nations, the “we” have announced their independence from the laws, responsibilities and duties of the country whose government they have hijacked. \\nBut the “we” offer us no such independence from their treasonous rule. Instead they impose on us the collectivism of Yevgeny Zamyatin\\'s novel “We” in which everyone suffers under the stifling progressive tyranny of the One State that controls every aspect of human life. That novel inspired 1984. \\nWhat “we” offer us is what Cuba’s Castro, We’s One State and every Communist regime offer us. It\\'s what George Orwell in 1984 summed up as, “A boot stamping on a human face — forever.” \\nPresident Kennedy dated his embargo proclamation from the “one hundred and eighty-sixth” year of “the Independence of the United States of America.” At the United Nations, Ambassador Power cheerfully declared America’s enforced submission to the Communist demands for Cuba. \\nThe Cuban people show no signs of winning independence from their Communist overlords. The question is will the United States of America be able to regain its independence from the “we”?'"}, "time": 1742628570.081177}