{"duration": 0.055680274963378906, "input_args": {"text": "\"  \\nIf there’s one thing that’s been missing during this bizarre 2016 election cycle, it’s former Daily Show host Jon Stewart. That’s not to say that his replacement, Trevor Noah, hasn’t done a good job, but there’s nothing like watching Stewart’s magical brilliance. \\nHowever, Stewart hasn’t completely stayed out of election talk; after all, he appeared on The Late Show with his friend and partner in crime Stephen Colbert. On Tuesday night, Stewart left us with another comedic treat – and of course the target of his relentless mockery was GOP presidential nominee Donald Trump. \\nAt the “Stand Up for Heroes Benefit” in New York City’s Madison Square Garden, Stewart wasted no time in lighting into Trump. He began: \\n“I’m not as much of a political analyst. But if I could ask you a question that I’ve been saying to my television, it’s ‘What the fuck? What the fuck is going on? What is happening?!'” \\nStewart then went on to recall a Twitter war Trump started with him, complete with Trumpian anti-Semitic dog whistles, in which Trump called Stewart “Jonathan Leibowitz” and said that he needs to be “proud of his heritage.” Of course, Stewart trolled Trump harder than Trump could ever troll him, saying: \\n“So I start to think to myself, Oh, I think this guy is trying to let people know I’m a Jew. And I think to myself, doesn’t my face do that? Honestly, like, where have you seen this face other than a poster for Yentl ? In what world are people like, Stewart, that’s a Scottish name, but there’s something about that fella that looks a little schmeary. It would be funny if it wasn’t so toxically fucking crude and horrible, but. So I decide to tweet back at him, “Many people don’t know this, but Donald Trump’s real name is Fuckface Von Clownstick. I wish you would embrace the Von Clownstick heritage.” \\nThis is just TOO GOOD. Hopefully, Trump has a complete meltdown over this one; after all, we know how thin Trump’s skin is, and he won’t be able to resist responding. \\nWatch the magic of Stewart trolling Trump below: \\nFeatured image via Kevin Mazur/Getty Images for The Bob Woodruff Foundation Share this Article!\""}, "time": 1742561803.559677}