{"duration": 1.9043452739715576, "input_args": {"text": "'55 Reasons Why California Is The Worst State In America   December 12th, 2012 \\nWhy in the world would anyone want to live in the state of California at this point? The entire state is rapidly becoming a bright, shining example of everything that is wrong with America. It is so sad to watch our most populated state implode right in front of our eyes. Like millions of Americans, I was quite enamored with the state of California when I was younger. The warm weather, the beaches, the great natural beauty of the state and the mystique of Hollywood all really appealed to me. At one point I even thought that I wanted to move there. But today, hordes of Californians are racing to get out of the state because it has become a total nightmare. It is the worst state in the country in which to do business, taxes were just raised even higher, unemployment is more than 20 percent higher than the national average and the state government is drowning in debt. Meanwhile, poverty, gang activity and crime just seem to get worse with each passing year. On top of everything else, the insane politicians in Sacramento just keep on passing more laws that make the problems that the state is facing even worse. Unfortunately, what is happening in California may be a preview of what is coming to the entire nation. The old adage, “as California goes, so goes the nation”, has been proven to be true way too many times. \\nIn dozens of different ways, the state of California is showing the rest of us what not to do. Will we learn from their mistakes, or will we follow them into oblivion? Please share the list below with as many people as you can. In addition to a large amount of new research, this list also pulled heavily from one of my previous articles and from outstanding research done by Richard Rider . The following are 55 reasons why California is the worst state in America… \\n1. One survey of business executives has ranked California as the worst state in America to do business for 8 years in a row . \\n2. In 2011, the state of California ranked 50th out of all 50 states in new business creation. \\n3. According to one recent study, California is the worst-governed state in the entire country. \\n4. Thanks to Proposition 30 , California now boasts the highest state income tax rate in the nation. \\n5. Even though California just raised taxes dramatically on the wealthy, state revenues are falling like a rock . State revenue for November 2012 was 10.8 percent below projections. \\n7. California has the 8th highest corporate income tax rate in the country. \\n8. California has the highest “minimum corporate tax” in the country. Each corporation must pay at least $800 to the state even if a corporation does not make a single dollar of profit. \\n9. California is tied with New York for the highest gasoline tax rate in the country. \\n10. California is the only state in America that taxes carbon emissions . \\n11. The state of California issues some of the most expensive traffic tickets in the nation. This is another form of taxation. \\n12. As of October, only Nevada and Rhode Island had higher unemployment rates than California. \\n13. The unemployment rate in California is more than 20 percent higher than the overall unemployment rate for the rest of the nation. \\n14. The state of California requires licenses for 177 different occupations (the most in the nation). The national average is only 92. \\n15. California teachers are the highest paid in the nation, but California students rank 48th in math and 49th in reading . \\n16. California accounts for 12 percent of the U.S. population, but a whopping 33 percent of Americans that receive TANF (Temporary Assistance for Needy Families) live there. \\n17. Only the state of Illinois has a lower bond rating than the state of California does. \\n18. Including unfunded pension liabilities, the state of California has more than twice as much debt as any other state does. \\n19. Average pay for California state workers has risen by more than 100 percent since 2005. That is good news for those state employees, but it is bad news for the taxpayers that have to pay their salaries. \\n20. More than 5,000 California state troopers made more than $100,000 last year. \\n21. One highway patrol officer ended up bringing home almost $484,000 in 2011. \\n22. One state psychiatrist in California was paid $822,000 in 2011. \\n23. Since 2007, the number of children living in poverty in the state of California has increased by 30 percent . \\n24. Sadly, an astounding 60 percent of all students attending California public schools now qualify for free or reduced-price school lunches. \\n25. The American Tort Reform Association has ranked the state of California as the worst “judicial hellhole” in America. \\n26. Businesses all over the state of California are being absolutely suffocated to death by ridiculous regulations. \\n27. According to the Milken Institute, operating costs for California businesses are 23 percent higher than the national average. \\n28. According to CNN , the state of California had the worst “small business failure rate” in America in 2010. It was 69 percent higher than the national average. \\n29. The number of people unemployed in the state of California is roughly equivalent to the populations of Nevada, New Hampshire and Vermont combined . \\n30. Residential customers in California pay about 29 percent more for electricity than the national average. \\n31. So many poor people and illegal aliens have taken advantage of the “free” healthcare at emergency rooms that many of them have been forced to shut down in California. As a result, the state of California now ranks dead last out of all 50 states in the number of emergency rooms per million people. \\n32. Political correctness is totally out of control in California. \\n33. One California town is actually considering making it illegal to smoke in your own backyard . \\n34. The traffic around the big cities is horrific. \\n35. Los Angeles \\n40. The rampant gang activity in the state gets even worse with each passing year. \\n41. Crime continues to rise all over the state. \\n42. Just recently, the city attorney of San Bernardino, California told citizens to “ lock their doors and load their guns ” because there is not enough money to pay for adequate police protection any longer. \\n43. The murder rate in San Bernardino is up 50 percent this year. \\n44. In Oakland, burglaries are up 43 percent so far this year. \\n45. Today, Oakland is considered the 5th most violent city in the United States. \\n46. There have been more than 250 gold chain robberies in Stockton, California just since the month of April. \\n47. In Stockton, the police budget cuts got so bad that the police union put up a billboard at one point with the following message : “Welcome to the 2nd most dangerous city in California. Stop laying off cops.” \\n48. Jerry Brown. \\n49. The absolutely insane California state legislature. \\n50. Wildfires. \\n51. Mudslides. \\n52. The state of California lies directly along the infamous “ Ring of Fire “. Approximately 90 percent of all the earthquakes in the entire world happen along the Ring of Fire and the “Big One” could hit the state at any moment. \\n53. According to the U.S. Census Bureau, approximately 100,000 more people moved out of the state of California in 2011 than moved into it. \\n54. During 2011, more than 58,000 people moved from California to the state of Texas . \\n55. Overall, the state of California has experienced a net loss of about four million residents to other states over the past 20 years. Sorry Protesters: Your Jobs Are Being Sent To China And They Aren’t Coming Back » Mark \\nWe left California in 2001. That was the best move we ever made. California would be a beautiful place with about 5 million people. Give then all to texas. Mondobeyondo \\nCalifornia is a beautiful state. Nice place to visit. Wouldn’t want to live there though. Jagrick \\nIt sure is. Northern California is about the most beautiful place in this country. I would never want to live in LA. I have been there several years ago and it had a creepy feeling so nowadays i assume it’s even worse. San Diego back in the 80’s was absolutely beautiful. Joseph Kool \\nYou don’t get out much do you Jarrett Wilson \\nwas going to say the same thing! California is UGLY, it’s bests and I mean absolute best is up north. rest is crap The Truth \\nYeah Yosemite is such crap isn’t it? Only perhaps the most beautiful place in the lower 48 but yeah it’s crap. richard \\nDEPENDS ON WHERE YOU LIVE. I WOULD AVOID THE BIG CITIES BUT TO BE HONEST THE BIG CITIES ALL OVER THE COUNTRY HAVE TROUBLE. THE PROBLEM WITH CALIF IS THERE ARE 37,+ MILLION PEOPLE LIVING HERE.AND THERE ARE QUITE A FEW BIG CITIES!! WERE OVER RAN WITH ILLEGALS THAT CAN’T SPEAK ENGLISH AND THERE KIDS ARE BEHIND BECAUSE OF THAT, THIS IS THE REASON OUR TESTS SCORES ARE SO LOW. I HAVE LIVED ALL OVER THE COUNTRY AND CALIF HAS IT’S BAD POINTS BUT I WOULDN’T LIVE ANY PLACE ELSE. I CAN BE AT THE BEACH IN 45 MIN. I CAN GO TO THE SNOW IN 45 MIN AND LEAVE IT THERE AND GO TO THE DESERT IN 45 MINS. ELECT RATES ARE HIGHER BUT WE DON’T USE AS MUCH GAS I SPENT 15 DOLLARS THIS MONTH CAN ANYONE ELSE OUT OF STATE SAY THAT..MY ELECT WAS 48 DOLLARS AND I DON’T LIVE IN A SHACK,. I THINK THIS BLOG IS A LITTLE UNFAIR..I THINK GASOLINE IS HIGHER IN HAWAII THEN NEW YORK OR CALIF #41 CRIME IS GOING UP EVERYWHERE. #50-51-52 YOU DON’T HAVE TO WORRY ABOUT MUDSLIDES IF YOU DON’T LIVE IN THE HILLS. FIRES, DIDN’T HALF OF COLORADO BURN DOWN THIS YEAR HOW ABOUT NEW MEXICO.VERY FEW FIRES HERE THIS YEAR. EARTH QUAKES YEP WE GET THEM. WE DON’T GET FLOODS VERY MUCH HERE AND NOT TO MANY TORNADO’S. YOU HAVE YOUR PROS AND CONS Handog \\nYou can get your point across without using all caps. Easier to reed as well. quercus454 \\nAs a Calif native much of what you say is true. Population increases by a mostly low educated foreign population is probably one of the biggest contributors to the state’s decline. While many people rightfully assume that Ca is the illegal alien capital of the country, legal immigrants contribute a larger amount towards population growth. With current immigration rules not refining who we allow in, many legal immigrants are not much better educated then the illegal variety. Lack of education means lower incomes that pay little in the way of taxes and because an immigrant is legal they are eligible for social services. \\nThe children of foreign born immigrants, both legal and illegal often require special ESL classes that cost the taxpayer extra. Some districts have ESL teachers for more then 4 or 5 languages. Population growth has rewarded California with over crowded class rooms and failing students. \\nIncreased population has swamped government resources that were designed to handle a population half today’s size. Whether it be social services, infrastructure needs, health care or the judicial system, all have been adversely affected by increased numbers of people. More people needing more resources leads to two things: rising costs and shortages. \\nCalifornia is the canary in the coal mine. It is a perfect example of what happens when you continually add more and more people who contribute less then they take. Along with feel good government policies to garner votes and the high taxes to support those policies you have California, a failing state. \\nWho is to blame? The people of not only California, but the people of the entire country. While the voter’s in Ca certainly carry a majority of the blame, immigration is supposedly a federal concern. The Federal government is supposed to regulate immigration and secure the border. Current and past politicians have neglected and even obstructed meaningful enforcement of immigration laws.The repeated re-election of the same inept/corrupt people has put California in the hole and the rest of the country on the edge. \\nCalifornia is a warning. Continually electing people who have no regard for the citizens of this country, who place their own careers above what is best, the rest of the country will mirror Ca. arizonadiane \\nExcellent post. You are so right, and the blame really does go back to our increasingly inept and wasteful federal governement Randy Townsend \\nCA resident here who agrees with your take on the situation. The government, however, accurately reflects the public’s embrace of the leftist agenda. Higher taxes, enormous deficits, and greater spending are exactly what Obama is going to give the rest of the country. Take a good look, America: CA is YOUR future. liberranter \\nNow if only you could keep them confined to the state that they’ve made such a mess of. They made their proverbial bed hard, now LET THEM SLEEP IN IT! molon_labe \\nLot of them moving to Texas, and immediately try to turn it to commiefornia. So, you move because commieforniaI a disaster, and now you wamt to do the same thing here? Roaches I tell you. Feed and move on is what they do. Durgys Ramirez \\nTotally AGREE with You on the Roaches part. Mike McCormack \\nI hope those that try to escape the blight leave behind their voting habits. Donald \\nWe do vote against this crap but we are over run by voter fraud, illegals and libtard indoctrinated schools. Now they just voted for $15 an hour to flip burgers which = Junior Web Developer right out of college. I’m moving to Texas because I feel I have better support numbers and don’t feel like such an outkast. By moving to Texas I will help make sure Libtard philosophies don’t spread to the other states. PS I wasn’t born in california either! Plus I love Guns! JustanOguy \\nAnd take a look at how many people are bailing out of California. 600,000+ population decrease last year. \\nIt’s obviously not working out too well… \\nJust to be clear: I’m not endorsing it. As an extreme conservative, I haven’t been represented in government for years. DW \\nYour numbers are all wrong. That many may have left, but they were replaced by the 1 mill illegals welcomed in by Obama and company. Your mama \\nSounds good, lets burn one to celebrate LazyIke \\nThis is a good commentary. What we have seen is thousands of former Midwesterners who moved here after WWII leave and being replaced will illegals from south of the border many of whom are illiterate in Spanish and drop out of high school at high rates and reproduce at high rates. Sugarsail1 \\ngood post, but another major contributor is the same thing that killed Detroit; unfunded union pension liabilities is a GIANT expense as well. Unions hijacked the government long ago and we are reaping what we sow. kayaker \\nGood grief….you don’t have a freaking clue what’s going on if this is what you actually think. No wonder the country’s in such deep trouble. Durgys Ramirez \\nTotally AGREE with your Post. cherylmeril \\nDon’t write in all caps, it’s hard on the eyes. You aren’t being read richard Ana Hernandez \\nin all honesty, lol. I skipped over your post to. read hers and went back to find out what she was referring to. i don’t care either way, but in my case it was true, I skipped over the post in all caps. sorry. it makes you seem angry so people don’t listen [or read] what you said. honestly…i still haven’t read it.lol richard \\nit is easy for me to type with the cap locks on. broke my pinkie in a motor cycle accident about 14 years ago and it really hurts to reach that shift key with that finger. sorry i have offended so many. i will just type with out it on. of course i won’t capitalize like a lot of you. hope that doesn’t offend anyone. CHiP \\nWait, you only have one pinkie? Or, one of those crappy keyboards, with only one shift key. I don’t like those keyboards – you can’t even type a capital letter if you’ve got a broken pi… oh, wait. (Pssss, Richard, we won’t tell anybody, but “motor cycle” is one word.) Marian \\nI read your post in caps. I didn’t give a hoot how you wrote it. lol…it’s just letters. I was planning on moving there.. was interested to see what people had to say. I already live somewhere with the highest taxes and fuel consumption, but starting a business here is amazing. I figured I’d go there once my business can settle me down. I live in Quebec. \\nI don’t capitalize always.If I missed it then it stays lower case. richard \\nsounds good to me. Life is to short to worry about the small stuff. danny \\nWho the %@#! writes in all caps anymore! I refuse to even read it. JustanOguy \\nI love California…. to visit. I live in Nevada and visit California all the time but it’s really gone downhill over the past 20 years and I don’t see it getting any better. (Quite frankly, I’m visiting less and less nowadays because all of the taxes on everything is going through the roof.) \\nI guess the 600,000+ other people that bailed out of California last year don’t see it getting any better either. Rod \\nI was born in SoCal. Family left when I was about to enter elementary school. My two older sisters were already in the horrible schools system with rampant gang activity even back in the mid 60’s! I went back after graduating college to start a career. Left again in 1992 and have never looked back. I lived in the Bay Area (San Jose), LA area (Long Beach) and San Diego. I will NEVER live there again and do not even like to visit. Sugarsail1 \\nI’m a Cali native and very disappointed with my home state as well. Other than my elderly mother and the nice weather I have no reason to be here and have been looking to move but I don’t know where. I’ve seriously considered Mexico…any recommendations? BGenie \\nGood for You to Never Look Back. California is All Corrupted anyways. Willowville \\nThe illegals are there to fill the low-wage employment gap. Education has little to do with it. There are plenty of college-educated people earning low pay. Jordan \\nWERE OVER RAN WITH ILLEGALS THAT CAN’T SPEAK ENGLISH AND THERE KIDS ARE BEHIND BECAUSE OF THAT, THIS IS THE REASON OUR TESTS SCORES ARE SO LOW. \\nReally? With this grammar, punctuation, and spelling you are targeting those who are learning a second language as being problematic? Work out your past participles, your contractions, the difference between “their” and “there,” and your English syntax in general before you start blaming others for low test scores. Andrew Taylor \\nBroken caps lock key? Or do you simply believe bigger=better? Personally I find it annoying, grammatically incorrect, lazy and space consuming without a proper reason. I’d have to say I disagree with your logic on California. By agreeing with it I feel like you are agreeing with the problem with this country. Uncontrolled debt, corruption, lawful theft and crime is everywhere in California. How can you agree with that? CitizenX \\nDon’t want you here. thomas moloian \\nand i agree with you since my wife and i stuck here for now but will change within next 5 yrs. davidmpark \\nAny chance Disnelyland might relocate to a better place? Like Texas or South Utah? It’d make life easier. Mondobeyondo \\nMaybe Phoenix? We could use a decent amusement park around here. I’m tired of hunting lizards as a recreational activity. liberranter \\nWhat, no rattlesnakes up in your neighborhood to hunt (I didn’t find any this year on my property either)? mleblanc138 \\nI’m happy as long as California doesn’t send their problems and policies up north to Utah. SLC/Provo is about a 10 hour drive away from SoCal, and yet the two are worlds apart. Unfortunately, Mexican drug cartels have set up grows on some remote land across Southern Utah. richard \\nI LOVE SOCAL I WOULDN’T LIVE ANY OTHER PLACE BUT I LIVE 50 MILES EAST OF L.A. IN A SMALL AG COMMUNITY. Mondobeyondo \\nMichael’s human, and being a human being, he has his hits and misses. Just like any of the rest of us. Believe me, I’ve had some misses as well. Not everyone is going to hit a home run 100 percent of the time. \\nSan Francisco has this reputation for being the liberal capital of America. Perhaps that’s true. I don’t know. I’ve never been up there. SoCal, I know rather well. Yeah, it’s different there – from what I understand, Los Angeles is to San Francisco, as Phoenix is to Flagstaff. Same states, vastly different communities. And no, I don’t believe everyone in San Francisco is gay or liberal. [Common misperception of an entire community]. MeMadMax \\nUp in north california you have all the insane white people, down in the southern areas, you have, basically, mexico… \\nWhat could POSSIBLY go wrong? lololololololol! And yes, I do live there, in Van Nuys, a sub of Los Angeles chilller \\nA fence should be erected around CA to keep them all from leaving and bringing their poisonous ideas into Texas and other neighboring states. Those people moved there because they agreed with CA’s insane ideas. They’re only leaving because they have to but they still have those insane ideas stuck in their heads. Syrin \\nAmen. We need to wall liberals in their own states and keep people from leaving and destroying their neighbors. Up north they’re called Massholes. They leave MA, then keep voting democrat in their new haven only to have the same end result. \\nLiberals are truly too stupid to understand cause and effect, history, facts, figures or basic economic analysis. Bad_Mr_Frosty \\nWe need to put a scarlet letter on liberals so no matter where they go we know who they are and what they stand for. liberranter \\nNo tattooing is needed. Just spend sixty seconds in the company of one, and you’ll know by what they vomit out of their mouths what kind of creature you’re dealing with. Sheryl \\nYou’ve hit the nail on the head, Syrin (hope that reference isn’t considered too offensive or PC-incorrect, or deemed as promoting toolshed violence, for all you uber Liberals out there) Zen \\nThey have already ruined Nevada. My advise is keep them out! They are like a parasite. They have damn near killed their host and so they are leaving it and bringing their liberal disease with them. Next thing you know you’re a blue state. JustanOguy \\nSpot on… they have ruined Clark Country / Las Vegas but the backlash has started. \\nLibs are not welcomed in Nevada. The Dude \\nBe careful what you wish for. \\nAs someone who lived in California I understand the sentiment. Living their transformed my political outlook. A poor man can live better in Montana, then a rich man can in California. name \\nyou know texas doesnt border california, right? Mondobeyondo \\nTrue. It’s sad to see what’s happening on the Left Coast. Syrin \\nWhen these liberal douche bags come to US for a bail out for their fiscal INSANITY, all endorsed by GARY, that’s when secession talks take on a SERIOUS tone. \\nI for one think we should wall in the entire state. We would allow anyone or any business that did not vote for Obama or contribute to his campaign to leave. Otherwise, they have to STAY in their cesspool, and not go pollute their neighboring states, because as we all know, liberals are too stupid to understand cause and effect. We’d allow anyone to ENTER the state, but leaving would be very very difficult. 2Gary2 \\nsecession is treason. How many dies in the civil war and now you d-bad repubes want to take your toys and go home. Grow the F up. Bad_Mr_Frosty \\nUm, stealing all the wealth of the middle class and giving away all the nation’s jobs to Chinese and Mexicans is treason. If it takes secession or a revolution to end this nightmare, so be it. liberranter \\nPlease, don’t dignify the moron’s verbal vomiting by arguing with him. It’s beneath us. Jobless_1 \\nI don’t know about you, but I sure have a hard time finding a job in California. I don’t think that the state was a place to earn/find a living. I don’t know how to do gangsta stuff either so I suck. I guess I would have to join the military as the ticket out. I would settle in a colony/territory if necessary. SOS! One warning, beware of its ripping debt, it’s one of its plagues. Handog \\n58 watch the video. “Chief Economist says CA. Is going in the right direction. LOL \\nThanks, I needed a good laugh since I just lost my job recently. \\nThe reverse gold rush will turn TX. Into CA. It’s a temporary safe haven at best. By the way, if you think the cost of living is cheap here in TX. Your in for a rude awakening. Rent, food, gas is sky high. Toll roads taxing you to death…. liberranter \\nHaving lived in various localities around the country over the last 30 years, I’ve come to the conclusion that the idea of disparate “costs of living” in Amerika is a myth. Honestly, I have not seen evidence of significant cost of living differences between, say, Arlington, Virginia and Albuquerque, New Mexico. The cost of living ANYWHERE in Amerika has become almost prohibitive – thanks in large measure to that moron Ben Bernanke and his Federal Reserve counterfeiting machine, aided and abetted by state and local political machines, Kalifornia’s being the absolute worst. Davethewave \\nI had to comment on your job loss. Sorry you got fried. What could the reason be that you were canned. It must be because of your winning positive personality that we have observed. Perhaps it was your world views. Maybe your ideas on those God given rights you love to spew on about.It must have be great to be with you at lunch. I am sure your former co-workers miss you. Handog \\nLiberals always use petty insults when they lose a debate. Pathetic. Davethewave \\nIf that comment is all you got then I just handed em to you. you still have not replied to my other question. Where can I find out about your God Given Rights. Handog \\nWhatever Captain Kirk. Or should I say captain numnuts. LoL Davethewave \\nYou got nothiin get a job! Handog \\nI give Michael an A + I don’t need statistics on everything. Perhaps you were truant the day your 8th grade class talked about the San Andreas fault. The one that runs right thru SF. It’s a real threat. Erin \\nThen get the hell out and give the rest of us our much needed space. Oklahoma sounds like a good place for you… Richard \\n“17. Only the state of Illinois has a lower bond rating than the state of California does.” Does what?? Again, don’t you mean, “Only the state of Illinois has a lower bond rating than that of California”? Richard \\n“18. Including unfunded pension liabilities, the state of California has more than twice as much debt as any other state does.” Does what?? Don’t you mean, “Including unfunded pension liabilities, the state of California has more than twice as much debt than that of any other state”? El Pollo de Oro \\n2Gary2: Thanks for that link. Thirty years ago, I would have laughed my head off if someone described the USA as a banana republic. Now, I call it The Banana Republic of America because in so many respects, that’s exactly what it has become. As I’ve often said, Canadians who want a visit a Third World banana republic needn’t travel far. All they have to do is keeping driving south until they cross the border. Gerald Celente is right: this is an UN-developing country. By the way, I noticed that Chile is the highest ranking South American country on that list. That makes sense because Chile and Uruguay are the least banana republic countries in South America (Argentina, sadly, shot itself in the foot, like the BRA). Hoppytoo \\nSurely you know that JFK believed that lower taxes result in greater revenue. otter1111 \\nGary, if you just read the article above, you can read about the state the liberals have been in charge of for many years. Many of the above facts are due to the liberal policies. California is in no way conservative, it’s pretty much completely run by liberals. Just like Detroit. This country really hasn’t been run by conservatives either. Obama had complete control in his first two years in office, with the house and senate having strong democrat majorities. Really Bush was not a fiscal conservative, and Obama is out of control as far as spending. What policies exactly are you talking about, anyway? And shouldn’t Obama have fixed them after 4 years? arizonadiane \\nI was born and raised in Pacific Beach part of San Diego. In the 50’s-70’s it was wonderful. Then more people began to move in. Who wouldn’t want to live in beautiful San Diego. Unfortunately, we see the results. Especially bad on all the oceanfront properties. Can’t even see the ocean. \\nI left there in the 70’s but still had parents there. They moved to the “country”– which is now Rancho Bernardo. Wall to wall houses. \\nI now have no reason to go back because everyone is gone, but the last few times was there, was 2010. HORRIBLE traffic, horrible influx of illegals and you name it. It is sad. And then, what idiots put Jerry Brown in for the 3’rd time? He was the one who started the mess in his first term. \\nSome people just don’t get it. cherylmeril \\nSan Francisco’s a booming city. Its politicians are idiots but you shouldn’t have listed this city as a reason why California is the worst state. No credibility. cherylmeril \\nElections may be manipulated with hackers. cherylmeril \\nI agree however San Francisco is very dangerous for pedestrian and bicylists injuries and deaths. It’s an epidemic level here, the #1 city for these kind of accidents . cherylmeril \\nThe court system in California is full of a lot of corruption, particularly bad is San Diego. The courts are also entrapping victims they suspect have money through mentally ill people in a desperate attempt to bring money into the legal community. The courts play politics like never before and anything goes, the law and procedure is secondary much of the time. Court’s also rely on those who obviously commit perjury not giving it a second thought. It’s all about cash flow. arizonadiane \\nHowever, so far none of the cities are looking like Detroit, but few may start. The ones that have already gone bankrupt. \\nDon’t like California? Don’t live here. \\nA far easier solution than whining. \\nDon’t be so negative, Kurt. Remember, “your kind” needs someone to steal from. Ingrates that they are, many prosperous people will choose not to pay for your free lunch — and will reluctantly follow your advice. El Pollo de Oro \\nCalifornia is a mess, but then, so is The Banana Republic of America in general. And California’s woes are not only bad for California—they’re also bad for the rest of the country because California is the world’s 9th largest economy. When an economy of that size is in deep trouble, the pain will be felt thousands of miles away. It’ll be felt here in the Northeastern BRA 3000 miles away, and for that matter, it’ll be felt in Europe. This is a global economic nightmare with one major economy after another sinking into the Third World abyss. California’s in trouble, the rest of the BRA is in trouble, big chunks of Europe are in trouble. All this economy misery around the world will lead to violent unrest, major riots, violent crime galore, political extremism, and World War III (which might go nuclear). \\n“The presstitutes aren’t reporting this, but there are massive demonstrations going on in Spain, in Portugal and in Greece. Tens of millions of people in dozens of different cities are taking to the streets. It’s breaking down worldwide.”—Gerald Celente \\nYes, it is breaking down worldwide. No doubt. And the worse the misery becomes, the bloodier the future will be. The money, as Celente says, is not flowing down to the man in the streets, and the blood will flow in the streets. It will flow like tidal waves. Say a prayer for Europe and a prayer for The Banana Republic of America because we need all the help we can get. liberranter \\n…California is the world’s 9th largest economy. \\nAmazing that that’s still true, given the lengths to which Kalifornians have gone in trying to destroy their own economy. Given the deteriorating present conditions, methinks that the “world’s 9th largest economy” standing won’t be true for very much longer. Shahhe \\nCalifornians* I hate to be the one to say that, but you can’t even spell. So your not really in the position to be saying what you think is going to happen to California’s standing as the 9th largest economy in the world. Alice Donati \\nSo goes California, so goes the nation? We know that California is too big to fail, so a huge bailout is coming. Everyone will get bailed out at the expense of the States who live within their means…Dah….Responsiblity is for fools, right? Cose dell’altro mondo…. \\nI left my home state of California in 1993. The place is beyond repair… give it to Mexico and seal the border… permanently. JustanOguy \\nSell California to China to pay off the debt and make them work!! Durgys Ramirez \\nThe problem is the mobility of the rich. While few will leave the U.S. for tax purposes, they often WILL leave a state. \\nAnd do. And are. \\nYou may not like such facts, but don’t let such facts change your mind. liberranter \\nSince the economic tyranny in Amerika is spreading like cancer through all 50 states, I predict that those with money will soon be leaving the country once they run out of states to flee to. Richard Rider \\nYou may be right — eventually. But most CA departees will first move to more friendly states. LATER as the country deteriorates, they may try to flee the good old U.S. of A. \\nBut remember, the U.S. is the only developed country in the world that all but criminalizes anyone permanently leaving the country. All appreciated property is IMMEDIATELY taxed, even if not sold. We operate like a banana republic. \\nMoving to another state triggers no such penalties. \\nYet. MichaelfromTheEconomicCollapse \\nYour research was excellent Richard. Hopefully my little plug sent a lot of extra traffic to your outstanding article. \\nMichael Undecider \\nNow, for Californians who leave the state, embrace your destination. If you’re going to Texas, don’t turn it into California. If you’re going to Nevada, don’t turn it into California. However, I’m sure if you’re reading this article, you’re likely not part of the population that would do that. liberranter \\nIf you’re going to Texas, don’t turn it into California. \\nAs long as enough REAL TEXANS remain in Texas, that will NEVER be allowed to happen. Adam \\nI agree. Michael gets more stupid with each post. I believe he is running out of posts. You know, he needs one the US is about to end’ post a day. Talk about a negative idiots! Sure some of what he posts is true, but plenty of it is inflated overly negative crap. Mudslides? What a tool. I wonder what his post will be tomorrow? I can see the title now: ‘The US will collapse at any minute even though I have been wrong over and over, time and time again, seriously, I will be right this time, trust me. Maybe he will just post: ‘You will die someday, so why even live?’ He is running out of overly negative things to say to keep his sheep coming to his site. Again, Michael is a crazy Christian, out of touch, overly negative tool. liberranter \\nThank you for helping prove that all of the negative stereotypes about the creatures that populate the most dysfunctional state in the union are 100 percent true. Deborah \\nI disagree Micheal Deborah \\nMichael, I am a teacher and I have SERIOUS problems with the factor of my failure. can u please do an article about how difficult our jobs as teachers have become during the downturn of society? I am a big fan. Thanks in advance… liberranter \\nYou are wrong on about every level, here are a just a few of your factual errors. \\n1. What Survey? The Bureau of Disgruntled Bloggers? \\n2. Yet Silicon Valley is here. Chevron Oil is here. The movie and television is here.The agriculture industry is here. Yet people start companies every day. You know why? BECAUSE ALL THE PEOPLE ARE HERE! \\n4. We are not afraid of taxes. We know our schools suck so were are willing to pay a little more for them. We especially are smart enough to know that the rich need to pay their fair share. \\n7. I agree this is wrong. It should be number one. \\n10. You didn’t live in LA in the ‘60’s. You could cut the air with a knife. Taxing polluters is the reason we can breath. \\n11. Tickets are NOT a tax. They are a fine. They are optional. Don’t wanna pay them? Don’t do anything wrong. \\n14. Call me crazy, but I want my hair-cutter and my chiropractor and yes, even my tattoo artist to be licensed. I’m funny like that. \\n16. How many of the TANF recipients are illegal aliens? \\n20. I agree with this one too. $100k a year for anyone who puts his life on the line for us is too little. It should be a least doubled. \\n22. Talk radio’s been foaming at the mouth over this one. I don’t have enough time to go over how wrong you are. Our prisons are bursting, in no small part to the deplorable lack of mental health care for those at risk. Yet you would fault the pay for an MD who would care for these people? I know it ‘s Christmas, but have you checked to see if your heart is two sizes too small? \\n41. Crime is down overall in Los Angeles. \\n52. Yet Japan, Chile, Italy,Mexico, Washington DC and New Jersey have had bigger earthquakes than we have.And don’t get me started on Hurricanes and blizzards. \\nI’m too tired to go through the rest, but I suggest this. If you don’t like it, leave. \\nyes, people are leaving. what remains are illegals, criminals, and hollywood bizzaros 2Gary2 \\nFormer Republican: 6 Reasons the GOP Is Doomed \\nThe formerly Grand Old Party needs to change to survive. But all we’re seeing are botox solutions. \\nThank God the country could move forward with out the conservatives trying to pull us back to the 17th century. \\nLMAO, you are a racist democrat Bad_Mr_Frosty \\nThe liberals and conservatives are both right. It’s the over-sized soviet government (conservatives) and the over-sized soviet corporations (liberal) that are killing the middle-class. The system will not allow people to vote for candidates that would address the problem (Ron Paul). Bad_Mr_Frosty \\nDemocrats are far-leftists, Republicans are a center-left party. There hasn’t been conservatives in US politics for decades. Apparently, they’re all “racist”. \\ni still want to visit there. atlanta sucks Ralphieboy \\nPretty much all you state is true. We moved our business from California to Texas in 2000 – best decision we ever made. No, we are not liberals who are foisting our ideas on Texas– just two conservatives who were smart enough to know that California would eventually kill our business. \\nWe still maintain a home in Newport Beach – where 87% are registered as republicans. Spend almost six months a year there – especially to escape Texas summers. Beach is a one minute walk from our house, and the weather is as close to perfect as is possible. No, we don’t fight traffic, and yes, we pay no California state income tax. In fact, I bet that most of our neighbors pay no California income tax either. Many are folks who maintain “vacation” homes there – but were smart enough to put their primary homes our of state. \\nOf course, the morons in Sacramento – like liberal morons everywhere, never understand that when the rich are taxed, the rich always find ways to legally avoid it. Of course, California lost us as taxpayers when we fled the state in 2000. The state also lost our employees and that tax base as well – and they continue to lose by chasing small business away. \\nGuess I will never understand why Californians continue to vote these idiots in. Prior to moving to Newport Beach, we lived in a suburb just south of here. All of our neighbors were liberals save one or two. Once our neighbors discovered we were conservative/libertarian – they had absolutely nothing to do with us, and quite frankly, some got downright nasty. Then again, we are small business owners – and they are corporate or government workers who never have had to make payroll. liberranter \\nGuess I will never understand why Californians continue to vote these idiots in. \\nBecause most Kalifornia “voters” are lazy, freeloading, economically ignorant sheepletards, like most of the rest of the nation. Obviously they’re just present in greater numbers in KA than in the rest of the country. Shahhe \\nCalifornia* Yet again, you insult a whole category of people’s intelligence, yet your spelling is that akin of a 2nd grader. pentachronic \\nKalifornia is a mockery word to show communism and California as one and the same. Maybe you should stop being overly PC like the rest of Kalifornia. YOU are the problem. PC-ness allows politicians to make stupid laws and add stupid taxes on the premiss of doing the ‘right’ thing for everyone !! mh \\nif you’re going to live here half the year, pay income taxes. all of you are complaining about the “illegals” who drain the system by not contributing tax money, etc – yet here you are, making a significant income, splitting your life between two states, and only contributing to one. dilligaf \\nThey’re taking advantage of the system, just like the illegals are. So what? Is there a separate set of rules? Austin \\nMy family spends all our time here but for a couple year (since we still own out GA home) d not pay the CA income tax… Why? It’s ridiculously expensive. We do now unfortunately Frank Lucci \\nI am Los Angelean, born and raised. As a kid, I saw this great state get bombarded by folks like you. Yah- you wanted the beaches and the weather, and I guess you thought it was for the taking. However you came, you saw, and you destroyed whatever you could. So good-ridden to the millions who came, saw and destroyed. It would be a welcomed event for those of us natives to purge the rest of you non-natives, including the representatives you brought with you. Whoever wrote this must have had a really bad experience here. The good news is it is about time! Like I used to say as a kid while the planes flew overhead, “Go home and don’t come back!” Kathy \\nFrank, I’m guessing you are Italian American from your name. I too am Italian American, the great grand child of immigrants . So you may be a native of Los Angeles but your ancestors and mine weren’t born here my friend. They are from Italy. Don’t you feel that people coming here to Cali LEGALLY or any place in the US to work hard should be welcomed? They can contribute to the state’s economy just as hard working, driven immigrants who are now third or fourth generation helped make this country great. When immigrants first came to the US many people spat at them because they weren’t “natives”. They said “go home!” Now you want to do the same? drbuzzsaw \\nCan the rest of us, VOTE California OUT of the union??? liberranter \\n53. According to the U.S. Census Bureau, approximately 100,000 more people moved out of the state of California in 2011 than moved into it. \\nAnd, having rendered their own state uninhabitable, they’re looking for new places to destroy by polluting neighboring states with Nanny-State nonsense and high-handed arrogance. We’re flooded with Kalifornia refugees here in SE Arizona and I do my part to make them feel as unwelcome as possible. liberranter \\nAnother Kalifornia Krazy in denial. Sorry, pal, but it doesn’t wash. Go bark your delusions up some other tree. pcmustgo \\nOne reason- They let in too many Mexicans who are illegal, don’t earn much, if they work at all, don’t value education, are prone to gangs and theft and corruption, have too many children out of wedlock , born into poverty , at way too young an age,e tc. \\nMAIN REASON- SHIFTED FROM A MAJORITY WHITE PLACE TO A MAJORITY BROWN, LOW IQ KIND OF PLACE. \\nTHIRD WORLD POPULATION CREATES THIRD WORLD CONDITIONS. \\nNo offense to Mexicans, but it’s the truth. Mexicans and their behavior/genetics are why Mexico is Mexico. Terry Smith \\nCALIFORNIA IS THE BEST STATE IN THE UNION!!!! PEOPLE WHO HATE IT, CAN’T AFFORD IT!!! AND THATS OK, MOVE YOUR BROKE @SS TO THE TRAILER TRASH CRAPPY MIDWEST, OR THE SMELLY TRAILER TRASH RUSTBELT! IF YOUR NOT PULLING IN OVER A $100K ANNUALLY .LOL,LOL,LOL Lily \\nI hear ya. Brother. Right on. I love ca Mark \\nMarky its time to rotate the tires on your mama’s single wide! Mark \\nYour not, lmao Lynn \\nI live in San Diego, where almost year round I am able to take in a beautiful walk. Neighbors are friendly. There’s a sense of community, and we all watch out for each other. Crime in San Diego is way down from the ’80s and ’90s, I don’t live in a planned urban development, but in the heart of the city. I love the diversity, the languages, the people. Traffic is heavy, but at least it moves, and most drivers I find are polite. The state is still beautiful… Our city, state and national parks are gems. Sure, we have our problems, but Californians are feisty and independent. I’m sure Michael could write the same article on any of the other 49 states and list their problems. I for one love the uniqueness of CA. And you haven’t lived until you’ve tried a fish taco. Richard Rider \\nBad as our CA taxes are, that’s just ONE factor. We are extremely anti-business, have sky-high utility costs (not even counting AB32 increases) and are now rated the “worst judicial hellhole” in the nation. Aside from the weather (which is great along the coastal zone), there is EVERY reason to leave this state — especially if one is engaged in commerce. \\nCalifornia? It’s politics, fruit cakes, liberals, entitlement infested population, taxes, and rules! Doesn’t even rate a comment! Dominik \\nYes all of this is true, but don’t forget about the successful companies here. California is the most unique state in the union. From the food to the fashion. Of course the most beautiful state (in my opinion) gets stuck with all the insane politicians and way to many regulations and…well everything stated above. California still does have the largest textile factory that makes clothes in America by American workers and nothing is shipped from other countries to American Apparel Inc. which is the last great American clothing company. kurt cobain \\nI like how someone else other than me is identifying the illegals by what they are; mexicans. Or is the term mexicans too politically incorrect? Sandra Bell \\nMany are central and south american too. W Dawes \\nActually there is a lot of Illegal Chinese in California too Danny_Sunset \\nand a lot of illegal Israelis and other middle easterners. nimrod \\nBorn and raised in Socal during the golden period (1960-1980’s) left in 1988, returned in 1994-2002, then left for good. Low crime, nice people, great place to live, go to school, safe to walk around back then….But since early-mid 1990’s this is all gone. My old high school turned into a prison camp, my old city into a little Tijuana, the traffic is bad 24-7, high costs for everything! Moved to the southeast: low crime, low cost of living, 10 minutes to work, low/no traffic, morals and values are taught and practiced. I went out for an interview in CA lately, even Norcal looks like Tijuana now. The freeways were littered with trash, the beach cities were unkept, people were not friendly, businesses were run down. I told them don’t bother making me an offer as I was not interested in living in the state. So not only is CA losing businesses, they are now becoming uncompetitive for the best employees. because of the squalor, it will get much worse, maybe NEVER get better. we need to flush the system clean, stop attracting freeloaders and get on with life without being dragged down. There is no reason that we need to provide any free lunches and bring in more legal or illegals until we find jobs for the 25Million people that are out of work. lou \\nCalifornia is overpopulated, period….. due mostly to foreigners, especially mexicans and koreans here illegally. They trashed their own countries and are now doing the same in California David Salter \\nYou forgot one very important fact, and one that the rest of the world is looking at with bemusement; California had the chance recently, with Prop 37, to catch up with Europe (I live in UK) and enforce labelling of GMO foods. And they blew it! Why on earth would you not want to know what is in the food you eat? This shows complacent trust in a government that continues to screw you over at every opportunity. And a complete failing to notice the corruption between big business, government and the media. Brian Johann Schuler \\nCalifornia sucks the list is endless also the weather even along the coast its either really hot really cold super windy really dry or really wet the weather is terrible and boring its all extremes its too dry and it does not snow in la i cant wait to leave Jimi \\nIf it wasn’t for the fiscally socialist welfarism I’d move to California in a heartbeat. Bogmire \\nSure its pretty, but its full of self-righteous fools who have shown how poorly they run a government, I WANT OUT, As soon as I am out of college, Im out of Cali. Shahhe \\nNo seriously, we want you gone. girlswagger \\nNOTICE HOW THIS IS THE ONLY SITE THAT STATES HOW HORRIBLE CALI IS. LMFAO openeye \\nThere is more.then nust Mexicans, if that someone else wasnt blind, there are, chinese, russians, and many different race coming here, also from way down south past Mexico. Unless your a reneck “ahmercin”.then you should understand that there is alot more people who come.here illegaly. angel \\nHey im not mexican but not all mexicans are undocumnted as u think…. Anon \\nI don’t care if they are or not. It’s terrible that they come in to help ruin (note the help) the country. We don’t need anymore migrant workers that dodge taxes while having the state spend thousands on them. I say this as an unfortunate hypocrite who has one clean the house every Friday. Steven P Chiolan \\nAt least you’re honest. Tom \\nDon’t forget about all the Indians and Chinese that come to our universities and then stay in our country and take the top paying jobs. pentachronic \\nThe educated people are not an issue. They pay large amounts of taxes as they are typically high-end workers who have good qualifications. The problem is that the State puts nothing back into Education. They reap what they sew. Bad Government is the key issue. The-Truth-Hurters \\nYou sound like just another ignorant white Republican spewing hate without knowing any real facts. First of all, you’re an immigrant in this country too because you stole it from the Native Americans don’t forget that redneck joe. \\nSecond, your country was built by immigrants in the first place like the Chinese who came here and built the railroads and ifrastructure, and the Indians are the only reason you even have a Silicon Valley at all. \\nThird, no one is stealing your jobs… You are losing them because these people are more qualified, smarter, and work harder than fat/racist/ignorant/poorly educated white hick Americans. You can’t blame an Indian or Chinese for taking your jobs when they study and work hard all day long while you’re out drinking beer and eating burgers, and riding around in your pickup truck saying “America f**k yeah!” while demanding higher salaries for doing less work and more vacation time. \\nWhat has happened is that the world today is a lot more interconnected with the advent of social media, the internet, gloablization, and many of the new technologies… This makes it easier for people from all over the world to migrate where they will have a better life just like you honky Americans did when you came from the UK to America. The only difference is that for years you have been saying America is the best everything and now you can’t just simply say that anymore; now you actually have to back it up and all you uneducated Republican Americans are finding out you’re actually not the best at anything and that most of the world is quite smarter and harder working than you are and you simply can’t deal with it so you blame the immigrants, eventhough you yourself are immigrants in the first place. \\nThe truth is that many of the immigrants that come here have had much worse circumstances and a far harder life which has taught them a good work ethic. We as Americans have been spoiled by our luxuries and now when these people that have a better work ethic than us come here we find it hard to compete and all we do is bitch and moan. \\nIf you want your jobs back then work harder and learn to compete with those that are better qualified and you will get them back. \\nLastly, the people that are hiring the the immigrants who are better qualified and that work for less are the white people anyway, so it’s actually your own kind whos selling you out. glorp \\nwow the-truth-hurters appears to be a hate mongering ignorant liberal…. so sad you call someone ignorant and hateful but ignore your own hate you spew from your poisoned mind… Ben \\nLiberals like the truth hunters are destroying this country. Illegal immigrants are taken food off legal Americans plates . These corrupt politicians are destroying are legal system. No legal citizen that own an real property is safe stand up dont support this don’t buy into this! If u don’t feed it it can’t survive The-Truth-Hurters \\nYeah, anyone who has actual knowledge and some coherent logic of whats really going on in the US; and who doesn’t just find some one to point their fingers at is a “liberal.” What a well put together argument you made, that’s exactly why you’re kind is become obsolete. You’re just another entitled white american conservative, who cant open their eyes and adapt to change… By the way I’m not a liberal either, so try again. \\nThe greedy and immoral investment banks/corporations/corrupt politicians (conservative & liberal alike) are what has ruined this country, not immigration. If you have any education you’d understand the complexity behind whats going on behind the scenes. It’s wealthy white CEO’s and investment bankers who control Washington, the FDR, our policies and politicians; and they are the ones who are selling your own kind out. \\nThe truth is you’re misinformed and uneducated on how your government really works, and you are being brainwashed by your false american patriotism; which is exactly what the powers that be are depending on to control and manipulate you. I have nothing against you personally, and you don’t have to agree with me and you’re entitled to your own opinion… But come on, how can an immigrant who has no establishment/resources in a new country affect or control anything… That’s ludicrous and things are not so black and white as you make them out to be. \\nCorporate white America and investment banks are the cause of all this. Wake up! The Vile Maxim by Adam Smith is what has ruined our country, not a handful of immigrants. Pedro A Lopez \\nI like the way you think. I am not illegal but I am from central, born an rase and the ignorance in this great country is sad. Charles Diemont \\nThey come here for work, and then send all the money back south. The-Truth-Hurters \\nLOL! No they don’t. Do you have any empirical data to prove your ignorant claim? Any statistics to show? By the way, are you even aware that your avatar is an afghan fighter holding an ak47; which ironic since you’re against foreigners. No personal offense intended, but it seems that you’re not very bright or observant. \\nAnd so what if immigrants send money back home to help their families? I’m a US born American and I would too if I was in the same situation. Nothing comes before family, definitely not patriotism to a country that’s selling out its own citizens for corporate greed. If you were struggling in your home land and could have a better life in another country, don’t tell me that you wouldn’t migrate to where you could have a better life and do whats best your family… After all, that’s what America’s founders did in the first place when they founded this country. \\nTHIS LAND WAS THE NATIVE AMERICANS LAND, AND EVERYONE ELSE IS AN IMMIGRANT HERE! Let’s see you prove that wrong… You have no right to say who can be here and who can’t because this is not your country to do so! \\nFurthermore, you’re so concerned about immigrants sending what little money they make back home, yet your “American” corporations and investment banks are evading taxes and siphoning billions of dollars offshore… Yet that’s fine! What an immigrant makes has no affect on the economy, however dirty companies like Apple and Google have enough money to end poverty and hunger worldwide (look it up -its a fact) and yet they don’t put anything back into our economy and that’s the real reason behind our crumbling economy. \\nYour lack of education is scary especially when considering a lot of “patriotic” Americans like you are so uneducated and full of hate; and then they go and vote being completely misinformed. Please open a book and read about how our economy works and what the Vile Maxim is. Understand what’s going on behind the scenes and how the privately owned FDR manipulates currency and inflation. Learn about how corporate and special interest lobbyists have demolished the ideals that this country was founded on, and you’ll start to see that immigrants are nothing but a scapegoat and that you are being brainwashed and led astray by your gov. \\nThe population of this country is so dumb that a hateful fear monger like Trump may actually win the election! Why, because this is a nation of uneducated morons who have no clue about how their country really works. Southpark totally nailed it with their “Dey toook r jobs!” Pull your head out of the sand and LEARN THE TRUTH! I love my country, but I hate the people in charge and the rampant ignorance among the general population. molon_labe \\nDo you have any empirical data to prove your ignorant claim that I’m uneducated? And speaking of ignorant, it’s a red dawn avatar dumbass lol get back to your bull prepping kayaker \\nIt’s the CORPORATIONS and the WEALTHY that do the tax dodging. Wake up!!!! The-Truth-Hurters \\nYes I agree 100%. The greedy and immoral obscenely wealthy individuals/corporations/investment banks are the real problem. You are one of the few enlightened ones out there and that gives me hope that others will catch up and see also see the truth. Pedro A Lopez \\nWow help ruin the country. You are so stupid but whatever makes you happy at night. molon_labe \\nThen they are American. Not Mexican. And you saying other wise is why we have the problems we do with immigration from Mexico. John \\nRepublicans Californiarules \\nCalifornia is the greatest place to live and work. Economy was and is the largest in the U.S., and your opinions are not shared. Jealousy and unhappiness is comes through your ariticle. WE LOVE CALIFORNIA. Alexbella \\nIn the words of my science teacher, “I rathef be in an 8.5 earthquake than a stage 1 tornado”. Californias the best, 20 minutes from everything! I can snowboard and go to the beach in one day! Each weekend I have 10 amusment parks to choose from, the beach, venice, concerts, snowboarding, ect! Maybe it costs more to live here but I moved away for a year, and never again will I live anywhere other than California. frog \\nget a life or get off of the computer frog \\nstop picking on other states where all a nation and that’s coming from a 13 year old ya’ll just got served nockout99 \\nI AGREE WITH FROG Oklahoma \\nYes..it’s a canary…like China, India and Africa “perfect example[s] of what happens when you continually add more and more people”…to the planet. vic \\nAll people talk about is the weather. I have lived in Mexifornia for 42 years and the people who run this state have killed it. What’s sad is that the UNIONS have taken control and these sheeple keep believing their lies so they keep voting for bull crap. Pelosi, Boxer, Feinstein, Moon-Beam Brown, Newsom, Waters, these are some of the biggest morons to ever hold office. They even shut down our farm lands to save a freaken fish. Stupid people and I can’t wait to leave…. B \\nMeh, the author doesn’t live here. More than half of that rant is opinion, another 45% doesn’t make sense/is not substantiated. Plenty of work, the state govt isn’t broke (in fact we now have a surplus), people here are still alive, lots of big business STILL here (intel, apple, google, Levi’s, Tesla, Hollywood, Napa Valley, thd entire central Cali agricultural business, and so on…). We STILL have TWO world class cities, so much natural beauty that songs, movies, poetry, have been created about it, people travel from the other side of the earth to see it, and residents get to see it daily. You can travel thru 5 climates in less than 3 hours. Nothing’s free bitch. If u like nice things ya gotta pay for ’em. California is one of the largest states, is THE most populous, and by far the best looking – that’s gotta be maintained… If ur a cheap-ass, move to fugly-ass Texass or some other Midwestern/southern donkey-#%€er state where taxes are cheap but half the state is on welfare and in poverty and “edumacation” is not a priority according to the state representatives… \\nSo, Californians aren’t leaving in “droves” (so stupid). We are still here in CA enjoying life and laughing at the fools who are jealous and therefore feel the need to knock this awesome and crazy, delicious and beautiful, one-of-a-kind place. Erin \\nRIGHT ON BABY! YOU TELL ‘EM! Austin \\nI moved to California 3 years ago this month, my sophomore year of highschool. I love it here and am not leaving for any reason other than travel when I can afford to. I have now graduated highschool and I’m attending college in a quaint costal city. The first 15 years of my life was spent in a suburb of Atlanta and it is much better here IMO. I live on the border of Encinitas and south carlsbad (la costa) and use the beach as a daily getaway. While the tourism gets annoying its wonderful meeting so many people everyday. There are very few cops away from the freeway I drive at least 30 minutes a day and usually see one cop but there is very very little crime in this area of San Diego county. I know big cities can be fun if you’re visiting but they are the majority of reasons you have listed to not live here. I definitely felt more of a sense of community where I’m from in Georgia but once you make friends out here and fall in love with the ocean and bays/activities you can do around them you realize it’s a different kinda love. & where I live there are very few Mexicans. Just find the right area if you wanna live here (preferably on the coast not in a major city) and you may love it like me. I’m 18 and hope to live past 50 stayin in this beautiful state. Most importantly if you want to get away from people there are canyons even in the coastal cities with trails all over the place and there’s few to none people and they’re usually gorgeous. Checkout Encinitas if you want to get away from big city lifestyle. Later everyone! Fr33th1nk3r \\nThe biggest thing I cannot stand since moving here from Pennsylvania 10 years ago– is the overwhelming conformity and materialism here. Everybody in California seems to listen to the same terrible mainstream music, the same crappy trendy movies and TV reality shows, and they all spend more time talking about their iPads and mobile devices than worrying about education or the nation as a whole.– \\nEverything here, from the pizza to the beaches, is overhyped and made out to be the best thing to happen since sugarless gum– but in reality, you will get the cheapened, watered down, overmarketed and overpriced California version.– Everything is overregulated. You can’t even enjoy a beer on the beach without getting a citation. You can’t even change a doorknob in your house without some local government code enforcement type trying to tack on fees and fines for your troubles.– The graduation rate for public schools in California is abyssmal. Rai \\nHey, could you do me a favor and link reliable sources and stuff that actually backs up your claims more often? Because when I see breitbart and articles that don’t really prove your point upon closer inspection I tend to think you’re a liar. The carbon tax article you linked had “could” in the title, meaning it doesn’t prove it’s even happening in the first place. \\nThen again, when I look at this blog title you’re probably just as reliable as breitbart. Anonymous \\nI am a fifth generation northern Californian and all I have to say is that some of these issues can happen ANYWHERE. For example, you can’t prevent earthquakes, mudslides, or wildfires and its not like we WANT them to happen, we just can’t control them. I’m not trying to rag on anyone, so please keep the negative comments out of this. I do agree that at this point in time our government and school systems are screwed up and that illegal immigrants are also screwing up our state’s balance, but everyone just focuses on CA with immigrants… What about Arizona, New MEXICO, and Texas? While I’m at it, the traffic is only bad in SOUTHERN CA (I know this because I’ve lived in the Bay Area my ENTIRE LIFE, never moved never wanted to) and this whole thing is blown out of proportion. By the way, I know about that city that banned smoking and it was for the good of the people, smoking causes lung cancer and cigs have such harmful things in them that they should be banned ALL OVER THE COUNTRY. I also know that Oakland is one of the worst cities in CA and that its also one of the most dangerous cities, too, but that doesn’t mean that ALL of CA is dangerous. Also, even though it doesn’t state it here, keep your stereotypes to yourself! Californians aren’t blonde moron surfers with nose jobs and Botox, we are actual people, not the fake characters on tv shows. pysco \\nI forwarded the article to Boxer, Brown and Feinstein, and told them have a nice day. I urge everyone to do the same. Vaggieburger \\nI L❤VE CALIFORNIA! I have lived in the sf Bay Area ALL my life, BORN & RAISED! (3rd generation San Franciscan 😉 I dont agree w/what our Government is doing, nor do I feel good about it BUT I love Ca w/all my heart! WEST SIII-EEED! Lol \\nLol jelous much? Now name the great things about cali Ahmed \\nillegals? The whole country is illegal, so stop being a republican about it. “This country was founded by a group of slave owners who wanted to be. Am I right? A group of slave owners who wanted to be free! So they killed a lot of white English people in order to continue owning their black African people, so they could wipe out the rest of the red Indian people, in order to move west and steal the rest of the land from the brown Mexican people, giving them a place to take off and drop their nuclear weapons on the yellow Japanese people.” Carlin, G. commonsense \\nthank you for posting a/b a subject almost over 200 years old, as if it pertains anyway what so ever to the present decline of California… Anon \\nImmigrants built this country but that does not mean they can tear it down. Get off your historically correct high horse and see what they are doing NOW. molon_labe \\nFunny how they always bring up we’re a nation of immigrants. Yes, of course we are. But look at the difference the two brought to the table. Built some of the largest cities in the world. These immigrants from south of our border, well, one just go to a once thriving city to see the effect they have. Utter filth and destruction. Educated_Person_101 \\nBecause Geroge Carlin is the final word on perfect political harmony. You are influenced by the wrong people. Comedians’ opinions on politics are worthless. molon_labe \\nEveryone in this room is now dumber from having read that. I award you no points, and may God have mercy on your soul. \\nYou must have learned that in a California school. During white privilege class. MA \\nI am a native to California, and I still live here. I do not plan to leave or move any where else any time soon mainly because I love this state. There is so much to do. I would hate living in, for example, Georgia. Not only is there nothing to do there, but there are racist people, and well I would not want to deal with that considering that I’m not white. It is more excepting here. Mainly in Southern California, because there is everyone. I would hate to be surrounded just be one race. Plus, weather is unbeatable compared to other states. It does get hot, and cold, but not nearly as much compared to other states. \\nI love California (Mostly Southern) and I am not leaving. Blue Blooded Californian \\nWow so biased its funny. No state is perfect, that being said this person failed to talk about some other things. California accounts for 15% of the U.S gdp, this state alone makes more then Canada, or Russia. If California was a country it would be the eight largest economy in the world. Texas as everyone seem to be talking about, let me say some things about that. Highest un-insured rate, and one of the highest poverty rate, No state minim wage which means that they follow the fed min wage, which is $7.25 (San Francisco min wage $10.75) oh and lets not forget how much federal aid Texas has and still keep getting. Where as for California, who does have problem (I admit that) is giving more back to the govt then its taking in. Based on several economist California is on track for a surplus in 2014. California has movies, tech, agriculture, its own cuisine I can go on and on. Texas and every other conservative states takes more then its gives out. Which really makes one to rethink, the premise about takers and givers does it!! \\nSo stop your bitching because everyone who has every come to California would love to move here, they just can’t afforded it. If you don’t like it, leave. CitizenX \\nI’m still waiting for the rest of the people that don’t like California to move out of the state. \\nPlease. anonymous \\nNot sure how everyone in the comments can’t see what how blatantly ignorant and completely absurd this article is… for example “32. Political correctness is totally out of control in California”. Great use of evidence there, not biased at all! I can acknowledge that the economy in California is suffering, but at least educate yourself on what’s really going on before you mindlessly bash all the “liberal douchebags”. Bob Dole \\nnot just liberals, we have plenty of douchbag republicans, in fact most of our states problems were caused by republicans and their corporate interests, not liberals. Anon \\nAnd yet our state has been run by liberals for the last couple of decades, AT LEAST. Now, we have a Democrat super majority in the state… Re-read the list and see what they have done to drive businesses out of the state. Most of that was because of the liberals. The cities with the most liberal policies (in California) are the most expensive and crime-ridden places to live in. Also, some of the most successful businesses in California tend to be Democrat-leaning. www dot goodguide dot com slash contributions. sinjonsmith \\nIf its so bad, then why to real estate values continue to go through the roof? Real Estate is like any other market or commodity. People pay high prices for highly desired goods. People pay high prices for California real estate because its a desirable place to live and although it has a LOT of problems, I can name 10 other states with worse problems including all the rust belt states (iowa, wisconsin, mich, indiana, ohio, illinois) where there is an exodus of people to get away from failing infrastructure, corruption and rising taxes to pay for it all..not to mention bad weather..and extremely poor southern states that have NO economy..mississippi, alabama, south carolina and Florida where the education system is worse than california…as well as some states with huge budget problems out east like Jersey…I’ll take california any day over any of these other states..California’s economy alone is the 12th largest in the WORLD and the US would take a huge hit if it didn’t exist..I don’t live in CA, but imo if you want to start a page on how much a state sux, start elsewhere…oh another thing about everyone crying about illegals…like cali is the ONLY place where that happens…its the ONLY place where people come over the border…Its a National issue idiots..and we have plenty in Chicago…I own real estate and without them, id have to pay some other white fat dude 5 times as much to work half as hard and do 1/10 as quality of work who’s probably in a union…oh which this page ironically hates because probably because unions are left leaning… James \\nEvery time the state legislature de-funds or disapproves a highway/bridge/public university repair project on the annual budget, people pass a $1B bond ballot measure during the next election to get the state into more debt and re-fund that particular effort. Voters in CA fail to realize that a new university center or highway overpass is nice, but somebody has to pay for it by raising state debt (often paid for with new taxes). I used to live there, and every election had millions of new bonds to be raised for somebody’s pet project on the ballot. My rule when voting was 99% of the time “No” if it required a new municipal bond to be raised, especially if it was an attempt to circumvent the regular budget process in Sacramento. James \\nCA is also one of the few states where a $100K income may not be enough to buy real estate. A down-payment on a CA home can pay the loan in full for an average home in many other states. People in high cost living areas (LA, SF, SD, etc…) take out huge mortgages and cram 10 people in a small home to pay their mortgage every month. It’s no coincidence that many of the homes shown being flipped on HGTV are located in CA. Unless you’re rich, bought a home 25 years ago, or inherited property from a relative, or resort to shady funding methods (i.e. share mortgage payment with 6 people, take out multiple loans, etc…) it’s tough to buy real estate in CA. Fornian’ \\nOk first of all California is the best state of all. Second you are unworthy. bynx110 \\n1. It’s California not KALIFORNIA. 2. Do you know how ignorant and prejudice you sound? It’s disgusting really. Yes our state has major problems but we are ALL U.S citizens. Treat others as you wish to be treated. Did it ever cross your small mind that maybe people from California treated you poorly because of the way you decided to treat them? Treat people with respect, we all come from different places and different walks of life. Do you agree with the Holocaust, slave trade, Native American treatment, and all the other major in tolerances in history? Think before you write….because you are clearly defining how NOT to be a decent human being. EmeraldStar \\nI’ve lived in Southern Cali all my life. After graduating college and going on to graduate school I decided it was time to leave. I moved to MI six months ago! Yes Detroit is bad, but it’s like that one city is pulling the entire states reputation down. No matter how bad Detroit is, the rest of the state is SO much better than anywhere I’ve been in southern Cali. Yes, I miss the diversity of people but here are some reasons a person my age would leave. The U’s in Cali can take up to six months to let you know if you’ve even been accepted. WMU let me know in less than two weeks. The cost of tuition and books are ridiculous when compared to the type of education you will be receiving (a BAD one). About 75% of students care about taking their education seriously and the rest are there for the financial aid. In SoCal it can take you months if not years (depending on what you do) to find a job, I found a job in less than a week in MI. The weather in amazing in CA and I miss the different cultures and their awesome food, but the pace is too fast, too many people are stressed out and are either jaded or jerks (not all, but there is a overhanging stress level you can’t really escape) When your worried about being laid off or making ends meat no wonder… Also, the crime! Theft is a huge issue in SoCal. Be it car, private property, or downright armed robbery. Gangs are a major problem in the L.A. area especially. Taxes are ridiculous and because larger companies know jobs are slim pickings they use it as an excuse to treat you like garbage. What are you going to do? Quit? Too bad you have kids to feed. Welcome to Cali, the suck it up things aren’t getting any better soon state. Don’t get me wrong, if it wasn’t for the people and the politics Cali is my home and I love it in a weird “that’s MY ugly baby” kind of way lol. Beautiful beaches, amazing deserts and mountains. I miss it sometimes. Then I read about a family that was murdered two miles from the high school I went to and NOPE! Glad I left. Best place to visit, but once you get past the fascination with this glamorous Hollywood lifestyle you’ll realize that it’s all a lie. Hollywood and L.A. are full of hobo’s and the whole city smells like urine and garbage. Except that small complex in little tokyo, then it smells like amazing asian food lol! Get the Golden state idea out of your head, that golds been tarnished for years : Shahhe \\nOh good god. I’m fairly certain your what’s causing the poor education rating in whatever part of California your living in. Please leave this wonderful state and the education rating will probably rise in literacy at least by tenfold. stassia \\nPlease stay there and everyone will be happy. Shahhe \\nIt is spelled with a C. And one wonders why Arizona scores lower than the rest on literacy. Shahhe \\nYou keep saying that yet you’ve yet to leave. I don’t think you realize that your wanted gone, please, feel free to go to Oklahoma or Utah, or even Texas or Florida. It matters not! All that matters is that you are to leave, as you claim you wish to, and as you are deeply wanted to by those in California before people like you came here hoping for free everything, then shocked when it turned out that the presence of so many like you tarnished it. So hopefully, with you gone, and staying gone this time, California will become fully back to the days of yore. So please, leave and don’t come back once that happens. Not ever. Sorry. Davis Rivas \\nThe best thing about California is all the Freebies you can get, welfare, food-stamp, medicaid, free lunches, housing, etc.. Even prisoners in California live better than middle classes in other countries. The tax payers in CA are SO generous. Thanks guys. john \\nBOTTOM LINE–Those that can’t afford the California luxuries move to lesser states than bash California, cause THEY could not make it or be happy. I would NEVER leave California. Enjoy the snow, rain and cold. I WILL NOT! Have fun with all that. We have the best weed, the best weather and the hottest women. BOTTOM LINE–There is always a story behind the story when someone bashes California. Some crazy people move from California to Oregon and convince themselves that 290 days of rain a year is better, GIVE ME A BREAK! lol @ the true Californians like me that laugh at you all. Have fun in your other state and remember when you are complaining about the cold or snow or grey sky, I’m smiling with my shirt off smoking weed laughing at you fools. Melissa \\nI was born in San Diego 45 years ago and have never left. Oh, I wish you would get the word out so more people would leave California, and less people would come here. Then I could have less crowds, more parking, more room at the beach. Me and the millions of Mexicans will stay here in San Diego, we get along fine. Everyone who doesn’t like it, please go awa . It’s great because whenever I visit anywhere else I always notice: the weather really sucks and everything is so cheap! No sales tax? No state income tax? I am always blown away by states like this. That makes my dollar go a lot farther when I travel so fine by me. Orisha \\nThe drought is caused by The Hight Priest of the world in Solidarity against Gov. Brown and all the states unions in Solidarity against AwoGbade. He is a shaman from Sacramento California who created a crime prevention youth program that Ex. Gov. Choose as his personal legacy program. Multiple murder attempts were made on this innocent High Priest and his father was murdered on Jan.5th 2013. The high pressure system blocking rain in Pacific Ocean are the Ancestors spirits in Solidarity against the injustice of Gov. Brown and police/corrections union and the denial of civil rights to AwoGbade over last 8 year period. This is only the start to what the Myans forecast. Since 12-12-12. The date Union members in Californias Department Of Justice tracked Awogbade and hitmen inserted Aids blood into him. No Justice No Water! It’s only starting in California. Without a thorough FBI investigation into Yeshua Awogbade court case in Sacramento…the forces of nature will wipe Americas Slate Clean. Miaeka \\nThanks, as an European this post convinced me that California is definitely less retarded than rest of America. I’m looking forward to supporting their economy by visiting them some day. \\nI love the stable and civilized societies we Europeans have managed to create through high taxation. I hope California will reach the same level of civilization some day. Bob Dole \\nYou can keep it, we prefer liberty and freedom, and yes we will invade you no questions asked if you threaten that. Shango!!! \\nYESHUA AWOGBADE is my son. Ive had full custody 4 years because Shoshana Robertson in a active alcoholic and meth addict. According to Shoshana she was molested by her first cousin Mayor Kevin Johnson since age 12. After her July 2nd suicide attempt she told the Mayor, my son is his and if she dont get custody back and 2 million dollars she woukd expose him. The Police Union got behind there Mayor and multiple attempts have been made on my life. After the first attempt on my life I called upon the forces of nature for protection and punishment to those responsible. Last year was the worst drought on record because of police union actions and violation of my civil rights for 8 years. WITHOUT A REAL FBI INVESTIGATION THE NATIONS WEATHER WILL BE THE WORST. Jack \\nThe state stinks for real…its a commie-liberal pisshole. Callie \\nHonestly CALIFORNIA lifestyle is the best in the country. No where else will ever compare. As someone who has traveled and lived in other places, I can honestly testify that there’s no better place to spend this precious life in. It’s a beautiful place with beautiful souls. Not California \\nThe best thing I ever did was to move my family and company out of California. \\nI tried for years to sell my company, few were interested but none would buy it as long as it remained in California, and to be honest, selling it in California would has set us back two careers. \\nFound out by moving to Nevada we saved all the tax money California would have robbed from us. After a year in Nevada company was sold. we no longer live in Nevada but I will say we did leave Nevada a better place, and Nevada made us better people, Nevada gave use back the humanity California stole at every chance it could take. \\nCalifornia has the worst schools, the worst people the worst cops, the worst opportunity, brought on by the worst government, the worst everything you could image, it just plain sucks. \\nI went to court one time my attorney had everything laid out and the judge said I don’t recognize that law, the attorney said here is a brief, judge said I don’t recognize that law. \\nattorney said here is the law book already marked all you need to do is read it, judge said,,, you got it. he didn’t recognize the law. \\nTo the judge my attorney said, you have already decided haven’t you, the judge smiled, to make it short we won on appeal, the money held by the state was returned I moved it into Nevada, my company and my family, the guy that bought my company divested all the California holdings, big loss to the people of the state. \\nI have a buddy that is doing the same thing, pulling his company out of California and going to headquarters it in Nevada then divest all California holdings at a loss of another 900 jobs to the state. \\nWhen you look up the word looser, California is on the top of the list. \\nI should say I was born and raised in California, what I used to think was the best place on earth, Santa Clara, Then as we did better Dad moved us to Los Altos Hills. \\nI went for a visit to Northern California to see some friends, I bought a truck that ran on propane with a big tank, I didn’t have to spend a dime on anything in that state. \\nI hate that state so much I will never spend a dime there. JULIA Dunkee III \\nThe Disney Hall Complex on that picture is usually under sold for concerts. The bar is lame, the restaurant prentious and overpriced, and it has all the chic of an airplane hanger. It has good acoustics and some great people come through but it is like mostly closed up during week. Poor Mex student work the usher roles and the mostly older elite types aren’t interesting and dress like 1800’s. It has these Sheriff deputies guarding I guess the 1% and they always look at me with why am I here faces. Sad place. Homeless vets live underneath bridge it sits on. That says it all. JULIA Dunkee III \\nHollywood is supported by the economic engine of Nail Salons, Tattoo Parlors, Weed Shops, and Hooker Wear type stores. At night it has some Blade Runner type nightclubs that are from the low level to Hollywood crowds, but unlike other cities the PAPS can do whatever so it’s always crazy that way. Tourists keep coming though it is grimy, dirty and no stars except on premieres which are hugely policed and controlled. All Hollywood Blvd. has hidden cams that are watched from a special station. The LA is considered a “gateway” city and employs the TrapWire Surveillance system. Plus it is usung drones now to like Arizona. JULIA Dunkee III \\nIt is not well understood by most but the Hollywood smarter money has left LA or is trying to. It is more than taxes. Many people come in for the Media Industry but there is a sizable exodus judging by home listings in any real estate listing service. The LA TImes is total BS propaganda that even locals call out all the time. It is strange because a lot of the moneyed are exiting fast. ANd it gives me creeps cause these people already can avoid most things. I think some event is scheduled here. I think others are aware of that too. Stephanie S \\nI moved to the Midwest a year ago from L.A. and just went back for a visit. Yes, it’s nice and pretty and the weather is great. Cool place to visit, I don’t want to live there again. Crime, “diversity”, materialism, frantic pace, traffic…no thanks. A short visit is pleasant but living there was becoming a nightmare. Calilove \\nI’ve lived in CA most of my life and I have to say I have never seen a Mexican beggar asking for money or food or anything. Selling oranges, flowers, etc by the freeway? Absolutely! I just had to point out observation after reading all of these racist comments. If you’re not a CA resident, you are reading some random stats that do not necessarily reflect the economic status of my neighborhood. Also, CA is a “horrible” state because of wildfires and earthquakes?! Get real! I haven’t witnessed any awful blizzards, huge hail storms or tornados destroying huge trailer parks in CA. Oh wait! Not many trailers here, our homes are constructed to withstand earthquakes & are built on a foundation! Christian \\nso much hate against the mexicans, have you ever been in a migration office? there’s many asian people middle eastern, also European people, so take your comment back and insert it inside your butt hole. molon_labe \\nI don’t see Asian, Arab or European migrants leaving ghettos of once great cities in their wake. Monsatan \\nNever been across the pond, I take it? BGenie \\nYou missed the Russian and Ukrainian immigrants here in N.CA. They are productive, going to college, taking ESL classes, working and opening stores. \\nThe Mexicans come here, expect us to learn their language, live off welfare, spray-paint graffiti, rob stores/banks, and deal drugs. I worked in an ER; a mexican family on welfare brought in a 10y/o girl who was ‘feeling sick’. Turns out she was pregnant… by her uncle, and they were happy because they were purposely breeding her for more welfare money. Mexicans are parasites, we need to close the border. Mike McCormack \\newww gross. Uncle daddy. Sandra Bell \\nDid you report this situation to child abuse authorities? The girl should have been legally and permanently removed from the home and the rest of the family deported as criminals with no chance of future citizenship. DW \\nI hope to hell you sterilized her Christian \\nnope, cali is very nice, your life sucks haha Michael Hansson \\nWhy do Californians keep voting on these politician that is turning their beautiful state into a hellhole? Funruffian \\nThe physical geography of California is vast and beautiful. The terrain and natural landscapes are magnificent. Unfortunately, it has too many crappy people and crappy leaders. rogersan \\nYou forgot the epic drought going on right now… allfab \\nA reason why it is one of the best: the writer of this article doesn’t live here. taylor \\nThis articles retarded. Its repeats the sames stuff over and over again. We have higher wages anyhow to hiving higher taxes makes sense, derrr. sdreal \\nWow, I might as well just leave the CA after reading this. Haha. – I love living in Southern CA and I have a well paying job selling software to high tech industries. I can travel anywhere in the west, but I mostly choose to stay in CA because that is where most of the money is… and who wants to go anywhere else unless absolutely necessary? Certainly, Texas is always lowest on my list of places to visit. Outside of Austin, it’s a cultural vacuum and in the summer it’s hotter than an oven. Plus, outside of oil, the industries aren’t nearly as robust and dynamic as those in CA. – Don’t you think it’s interesting that some of the biggest and most innovative companies on the planet, like Apple and Google, are based in California? Guest \\nAs all those people leave, the nutty liberals remain behind and their power grows. The growing number of poor will go along with whatever they say so long as the benefits keep coming and increasing. Eventually the state is going to bust and then they’ll howl for DC to bail them out, and DC probably will. Anon \\nArizona especially is awful. You want to talk about a piece of trash, it’s Phoenix burning rubber smell and angry, flaring inferno environment in July. izzycafe \\nWe have a democratic super majority and they are driving our great state into the likes of Detroit city.. only it will be the whole state. The thinking is tax and put fees and regulations on everything.. they need, more and more and more, they think it will produce more revenue to help with the unsustainable retirement and pensions of government worker. The thing is, that never ever works.. and like a horrible cancer it kills all things that are good. molon_labe \\nBeen there. Beautiful state, nice people up north, but the cities, I wouldn’t go near there if you paid me 7 figures. I was so disgusted I will literally cheer if an earthquake breaks it off into the ocean. I’ll stick to the lone star state and the south where the people have manners. Chin Sims \\nNo, New Jersey is the worst. Way f__king worse. christopher umsted \\ndont even need to read this to say that california life sucks only reason y i did cuz of a hw assignment even though me and my fellow classmates are living it Smeagel4T \\nOdd how housing prices just keep rising, and rising, and rising… which is a very clear free market indication of demand. Lee \\nI can create a list about every state in the union and tell you why it’s the worst state….it’s not hard to do. To me it just looks like this website is about fear. It promotes the idea that the world economy it’s going to collaps and so you need to buy Good and Silver. Sugarsail1 \\nBorn and raised in California…it sucks for all the reasons mentioned above. Too many socialist politically correct fascist enviro-whack jobs from the bay area running the show and the anti-business regulation has killed the middle class and the job market. The only people that do well here is people on some kind of government subsidized business, like healthcare, welfare, or green boondoggles or Limousine Liberals in Hollywood with more money than brains. Sooner or later they will run out of other people’s money and they will have to build a wall to keep Californians from escaping to Mexico. The only reason to live here is the weather and the weed and even the weather sucks in the North (the weed doesn’t). molon_labe \\nCalifornians. Since your voted for it, please keep yourself confined within it’s borders. It’s only right to make you deal with the issues you brought upon yourselves. Moving to a different place and dragging that down too isn’t fair to people whovote with common sense. inverse137 \\nThere are some good points in this article and a lot of stupid personal opinions. You are better off sticking with facts than conjecture. Conjecture makes you look stupid and weak. \\n34, 35, 36, 37, 38, 39, 40, 41, 48 and 51 are just whining without facts. NUMBERS. You cannot dispute hard numbers. I would have listed it like: the average commute time in california is XX and the national average is YY. \\nWhat is listed in those instances is just filling space. New York boy \\nEveryone dissing California sounds like a bunch of bitches! And would lay out your incredible boring lives. kayaker \\nWhat a biased piece of propaganda. CA is way ahead of the rest of the nation in addressing climate change, re-localizing of food growing, promoting solar, etc., etc., etc. It has lots of problems, but at least is doing things a lot smarter than the vast majority of the U.S. which is going backwards. Tyler \\nAre these statistics even real? Some seem a little bias. However I am California Native, Los Angeles to be exact and will all of the problems that we do have going on, I love my state! When I travel people are amused and want to be surrounded by beaches and celebs. Many others states hate and I can’t relate. Vacationing to other states is wonderful however, I will NEVER ever move out of California. Guest \\nHave you Californians ever thought about independence? you are an economic global power house on your own! (the state has the 8th largest economy on the planet even larger than India and nearly as large as Russia!!!) cgoofies \\nIt is very competitive, with people I don’t believe should be holding these jobs I went to school for. Then they can’t leave because they are like sardines usually commuting and not spending quality time working. Beautiful I agree, needs to be demolished and rebuilt, possibly. jackass \\nyou can say that about any politician, not all dems are bad, not all reps are bad. DW \\nAll Dems are bad in California, because there is no competition for them and they know they will be re-elected no matter what as long as they hold out that welfare check and keep on letting in illegals. Working class families are in the minority now, so the welfare and public assistance crowd are in charge of who gets elected. In other words, the inmates have taken charge of the mental institute. TangoWhiteTrash \\n#54 though. Why is it so hard to understand, we don’t want you! I’m sure you’re all wonderful people, but bringing the same ideologies which caused the problems you’re now running from with you will only ruin us too. Please, solve your problems, we’ve got our own things to worry about. Thor \\nAccording to Californians, Cupernicus was wrong. All of the planets ,moons, stars, etc. do not revolve around the sun…. The sun, moon, planetss and all of the heavens revolve around california!! I dont live there and wouldnt want to visit since california attempts to control how every other state operates, why bother TheTruthburns \\nI lived in California when it Was The Golden State – I now refer to it as the Golden Toilet Bowl. Sadly if enough states act like California then those of us who can’t take it will have to move to another Country. Man – what the hell ever happened to the Good Ole USA? Gregory Chandler \\nCalifornia’s government leaders tend to have the attitude, this is California so we do as you please. This attitude is the same among liberals and conservatives. Many people who live in California conduct a substantial amount of business elsewhere. Therefore, you get the beauty of California without all of the silliness. Craig Hempfling \\nCan’t wait for a good 9.9 quake to get rid of Gov. Brown and the rest of you idiots a-0 \\nI have been traveling to Nor cal for years for work. I consider all of california north mexico at this point. I conceal a firearm against state laws due to the out of control crime situation. I am also starting to pull all of my buisness out of state, if only i could do it sooner. Jules \\nForgot one huge thing on this list. California has the worst worker’s compensation in the country. It’s pro employer and con injuried worker. 90% of all major claims are denied even though multiple doctors including state issued QMEs (Qualified Medical Evaluator) agree that care is needed. In addition after a claim is denied an anonymous IMR (independent medical review) can deny the claim without reasoning nor can ever be identified. Also worker’s compensation payouts are the worst in the country even though we pay the most into it and have one of the highest cost of living. TexanForever \\nAfter working there for 40 years I retired back to west-central rural Texas and haven’t regretted it one moment. I miss the beaches, ocean, “Catalina Eddy,” and the sound of seals barking at night as I go to sleep. But the crazyness brought on by the gang-bangers, the crazy Southbay Curve on the 405, the feel-good looney libs, the overly complex rules, the taxes, and Governor Moonbeam (not once but twice), makes it just not worth it. \\nDeer now come up into my yard at night to graze on the bermuda grass lawn. People drive down the streets at an unhurried laid-back 20 mph and wave at each other, whether sitting on porches or in pick-ups. … even though they might not know each other. Kids say “yes ma’am” and “no ma’am,” and adults do too, regardless of age differences. It’s a more civil way of life. There are loaded pistols, rifles, and shotguns in every house but there is virtually no crime, and no one ever gets shot. I can go to town and leave all my doors open and unlocked. \\nCan’t say I don’t miss California, but it’s the old California I miss, not the insane place it has become, thanks entirely to the Marxist liberals. Fembot220 \\ni don’t like California that much. Nor cal is a hard place to live and off the charts when it comes to cost of living. I’m moving to the Midwest where people are conservative and you can rent a house for what you would pay for a crappy closet sized apartment out here. Wayne baumback \\nSounds like a little jealousy. Facebook, Apple, twitter, google, tesla, Intel, eBay, craigslist, oracle, and can go on forever are doing so poorly, high taxes and govt regulations. Even mitt Romney campaigned against high taxes and govt regulation, then lost the election and moved to calif.'"}, "time": 1742562101.2406294}