{"duration": 0.03388547897338867, "input_args": {"text": "'Montag, 14. November 2016 Autobahn-Privatisierung: Linke Spur bald nur noch für Premium-Maut-Zahler Berlin (dpo) - Die Bundesregierung plant die Privatisierung deutscher Autobahnen. Nun wurde bekannt, dass Großinvestoren wie Versicherungen und Banken bereits konkrete Pläne haben, wie Deutschlands Fernstraßen profitabler werden: Die Spur ganz links darf bald nur noch von Autofahrern genutzt werden, die eine erhöhte Pkw-Mautgebühr (Maut Premium) bezahlen. \"Für Autobahn-Kunden, die sich nur den günstigen Maut-Basic-Tarif leisten wollen oder können, ändert sich nicht viel\", erklärt Sandra Bauske, die Sprecherin des Investorenkonsortiums, das sich an der privaten Autobahngesellschaft des Bundes beteiligen will. \"Sie müssen lediglich auf die Spur ganz links verzichten.\" Überholmanöver seien für sie weiterhin möglich, sobald die Autobahn über drei oder mehr Spuren verfüge. Die Nutzung der linken Spur jedoch ist nach der Privatisierung ausschließlich jenen Autobahn-Kunden vorbehalten, die bereit sind, den fünfmal so teuren Maut-Premium-Tarif zu bezahlen. Da sich vermutlich nur wenige Pkw-Fahrer diesen exklusiven Luxus leisten werden, ist mit deutlich kürzerer Reisezeit zu rechnen. Die Investoren sprechen von einem \"königlichem Überholvergnügen\" und kündigten bereits an, Straßenschäden auf der Premium-Spur besonders schnell auszubessern. Fahrer, die nur Maut Basic gezahlt haben und trotzdem die Spur ganz links nutzen, müssen mit empfindlichen Strafen rechnen. Überwacht wird das System durch ein Netz aus Überwachungskameras und Sensoren, die jedes unbefugte Überfahren der Premium-Linie registrieren. Ungeklärt ist noch, wie an Baustellen, an denen sich die Fahrbahn auf eine Spur verengt, verfahren wird. Derzeit prüfe man, ob es legal ist, Basic-Kunden in solchen Fällen auf Feld- und Waldwege neben der Fahrbahn umzuleiten, damit Premium-Zahler nicht unnötig ausgebremst werden. ssi, dan; Foto [M]: Shutterstock Artikel teilen:'"}, "time": 1742561841.4937584}