{"duration": 0.08999824523925781, "input_args": {"text": "'Read by 1,225 people \\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\nEditor’s Comment: Would anything the Clinton’s allegedly did be enough to constitute a “scandal”? It is questionable whether even (rumored) video of Bill Clinton engaged in sex acts with minors would raise media eyebrows. It isn’t a question of what “is” is anymore, it is a question of what the supposed ‘watchdogs’ of the political scene (in all their official and self-appointed capacities) are willing to put on the table. For Alt-Right supporters of Trump, anything and everything is fair game, and there is plenty of detritus to bring to the surface; but for CNN and even FOX, many of these bombshell scandals may well not even exist. \\nThe establishment is in the battle of its life to spin the great political realignment and rebuke of its powers into a new mandate for control. Whether that plays out in Hillary, or in some bastardized control of Trump’s administration after the fact, it is quite clear that the “Teflon” candidate is being allowed to sweep everything under the carpet. No matter what Wikileaks emails, Guccifer 2.0 hacks, whistleblowers and witnesses reveal, it is smooth sailing for Big H. \\nFor any other politician, a mere fraction of the dirt piled up on this family would have ended careers, stirred media scrutiny and ended in prosecution, even if it is all just formality ending in suspended sentences. Instead, Hillary only becomes more inevitable in spite of, or possible even because of, the scandals that have emerged (both inside and outside the White House, the federal government, the State Department and the rigged DNC process). It is entirely possible that the electoral college is so locked-up that literally nothing could block her path. Let’s see how they tally the score come Tuesday night… \\nDoug Band Accuses Chelsea Of Using Clinton Foundation Money To Pay For Her Wedding \\nby Tyler Durden \\nA couple of days ago we shared a Podesta email from Doug Band about Chelsea talking openly in public about her “internal investigation” into the Clinton Foundation. \\nAs with many of the Doug Band email chains , the rabbit hole just got a little deeper today with Band accusing of Chelsea of “using foundation resources for her wedding and life for a decade” among other accusations. He also concludes with another veiled threat on the consequences “once we go down this road….” \\nThe investigation into her getting paid for campaigning, using foundation resources for her wedding and life for a decade, taxes on money from her parents…. \\nI hope that you will speak to her and end this \\nOnce we go down this road…. \\n\\nThe implications are troubling: as our friends from the Southern Investigative Reporting Foundation point out, “* If true* people (then) worth well into 8 figures used 501c3 $ to pay for a wedding. ” *If true* people (then) worth well into 8 figures used 501c3 $ to pay for a wedding. #PodestaEmails32 @wikileaks https://t.co/xpYZbDN4C0 \\n— SIRF (@SIRF_Report) November 6, 2016 \\nThe latest Band email comes after he previously accused Chelsea of talking about her “internal investigation” in the Clinton Foundation with “one of the bush 43 kids.” \\nI just received a call from a close friend of wjcs who said that cvc told one of the bush 43 kids that she is conducting an internal investigation of money within the foundation from cgi to the foundation \\nThe bush kid then told someone else who then told an operative within the republican party \\nI have heard more and more chatter of cvc and bari talking about lots of what is going on internally to people \\nNot smart \\nSomething tells us that Chelsea and Doug may not be on speaking terms for a while after all the WikiLeaks revelations. \\nThis article was written by Tyler Durden and originally published at Zero Hedge . Click here to subscribe : Join over one million monthly readers and receive breaking news, strategies, ideas and commentary. Please Spread The Word And Share This Post \\nAuthor: Tyler Durden Views: Read by 1,225 people Date: November 7th, 2016 Website: http://www.zerohedge.com/news/2016-11-06/doug-band-accuses-chelsea-using-clinton-foundation-money-pay-her-wedding \\nCopyright Information: This content has been contributed to SHTFplan by a third-party or has been republished with permission from the author. Please contact the author directly for republishing information.'"}, "time": 1742562235.5887446}