{"duration": 0.08705687522888184, "input_args": {"text": "'Welcome to Watching, The New York Times’s    guide. We comb through releases big and small to email readers twice a week with our timely recommendations. You can browse previous guides here, and to receive recommendations straight to your inbox, sign up here. Stay tuned for our coming website. I took a short vacation and now I feel utterly unable to function in normal society. Breakfast should begin slowly and quietly around noon, all sandwiches should be lobster rolls and every day should include some kind of beach excursion. But real life beckons, as it always does. The good news is that real life includes some exciting new TV shows this weekend  —   time to turn our brains toward the television future and embrace what comes next. That’s never really been my strong suit, though, so I’ll also probably rewatch a few episodes of “Mad Men,” since I found myself thinking about that show an awful lot in the last few weeks. I can’t help it  —   I still miss it. Have a joyous weekend, friends. “The Hindenburg Explodes! ,” Adult Swim (free, but it’s only up until Monday select it from the “Now Showing”   menu). Watch if you wish “Children’s Hospital” was set on a doomed airship. Adult Swim has posted four pilots for new, short shows  —   three cartoons and one   piece. The   “Hindenburg,”   by and   Rob Corddry, is the best of the bunch. John Cho, Lauren Lapkus, Leslie Bibb, Nate Corddry, Kevin McDonald and Danny Pudi among others play passengers, time travelers, “adventurers” and historical figures on this silly, occasionally crass, spoof. It’s not clear how exactly the show would be expanded past these 10 minutes, but let’s try to believe that we live in a world full of good surprises. “The Jim Gaffigan Show,” Sunday, 10 p. m. TV Land. Watch if you like loosely autobiographical showbiz stories. “The Jim Gaffigan Show” has improved tremendously since its premiere last year, finding a little more edge and identity  —   though perhaps we have hit full cultural saturation on “comic plays comic in show about him or herself. ” This week brings the series’   season finale, and the show works just fine episodically. Don’t feel a need to “catch up,” but if you want to orient yourself a little, watch the surprisingly profound Season 2 episode, “The Calling,” in which Jim searches for meaning in his life. “I Love Dick,” “The Tick” and “  Van Johnson,” Amazon.  Watch if you want to participate in the voting process or already like the creators and stars of these shows. Welcome to another round of Amazon pilots. The streaming platform’s “system,” in which viewer votes allegedly affect which shows go to series, ultimately seems as capricious and   as the old network model: This spring, the platform introduced one compelling and one snoozy drama, “The Interestings” and “The Last Tycoon. ” And yet “Tycoon” is the one that’s moving forward. Alas! The world is cruel. But “I Love Dick” is pretty great. It’s based on Chris Kraus’s book of the same name, and (broadly) adapted by Jill Soloway, the creator of “Transparent. ” Soloway teams with her frequent muse Kathryn Hahn, who plays a stymied filmmaker spending a season in Marfa, Tex. with her academic husband (Griffin Dunne) when she meets the alluring, confounding Dick (Kevin Bacon, almost comically eroticized). Soloway’s loose, empathetic style and passion for slightly irritating characters are in full force. But “Dick” is less languid than “Transparent,” and has a steadier beat than her film “Afternoon Delight. ” Here’s hoping it goes to series. “The Tick” is the newest reboot in the cult “Tick” franchise  —   first a comic book, then an animated series, then a   series and now another   series. This version stars Peter Serafinowicz as the titular superhero, and Griffin Newman (“Vinyl”) as Arthur, a dweeby accountant who becomes the Tick’s sidekick. Originalists will probably grumble about this darker spin’s lack of camp and flair, but there’s plenty to like here, even with so many   options. Finally, “  Van Johnson,” starring   Van Damme as an   star who moonlights as a secret operative, did absolutely nothing for me, but if you are a JCVD   your mileage will almost certainly vary. Enjoy an   summer blockbuster from the near comfort of your A. C. unit with “Mission: Impossible  —   Rogue Nation. ” In this latest “Mission: Impossible” edition, Ethan Hunt (Tom Cruise) goes under the radar to try to thwart yet another covert organization bent on destroying his colleagues at the Impossible Mission Force (IMF). Boasting incredible stunts, car chases, explosions and a talented cast that includes Alec Baldwin, Jeremy Renner, Simon Pegg and Rebecca Ferguson, the fifth movie in the franchise pushes the boundaries of   feats at every turn. You don’t need to have seen previous installments of this spy caper series’ to enjoy “Rogue Nation. ” But remember to breathe during the movie’s excruciating underwater scene and daredevil plane sequence. (Watch on Amazon Prime)  —   Monica Castillo ‘The Nightly Show With Larry Wilmore’ Comedy Central announced this week that Thursday would be the final night for “The Nightly Show With Larry Wilmore. ” Based on the ratings, this isn’t a huge surprise  —   the show never found a big audience. It also never quite found its ideal form: While Wilmore’s openers were sharp, they often covered the same clips as “The Daily Show” had a   earlier, and   panel conversations are the worst possible format for telling jokes or conveying information. Here’s hoping there’s another, better show in Wilmore’s future. He spoke with The New York Times earlier this week about the abrupt end to the show and the work he’s most proud of. I’ve raved about this doc in the newsletter a lot, but, all five parts of ESPN’s fascinating, fantastic documentary “O. J. Simpson: Made in America” are now streaming on Hulu.'"}, "time": 1742563529.6440778}