{"duration": 0.1252427101135254, "input_args": {"text": "'Comments \\nFBI Director James Comey is being publicly criticized by former Deputy Attorney Generals and others from the law enforcement community over breaking his agency’s neutrality to release a vague memo Friday afternoon which amounted to official slander against Democratic candidate Hillary Clinton. Newsweek’s Kurt Eichenwald reported first that University of Minnesota law professor and former Bush Administration White House ethics counsel Richard Painter filed an official ethics complaint with the Department of Justice’s Office of Special Counsel against the FBI Director for abusing his office with pernicious political activity. \\nRichard Painter’s new filing against Comey is similar to the complaint filed by the Democratic Coalition Against Trump , lodged against the FBI Director for violating the Hatch Act , which restricts most federal employees from engaging in any partisan activity. Hours after originally filing this story, Professor Painter wrote this op-editorial in The New York Times to explain why the FBI Director’s actions must not go unpunished: \\nOn Saturday, I filed a complaint against the F.B.I. with the Office of Special Counsel, which investigates Hatch Act violations, and with the Office of Government Ethics. I have spent much of my career working on government ethics and lawyers’ ethics, including two and a half years as the chief White House ethics lawyer for President George W. Bush, and I never thought that the F.B.I. could be dragged into a political circus surrounding one of its investigations. Until this week. \\nAn official doesn’t need to have a specific intent — or desire — to influence an election to be in violation of the Hatch Act or government ethics rules. The rules are violated if it is obvious that the official’s actions could influence the election, there is no other good reason for taking those actions, and the official is acting under pressure from persons who obviously do want to influence the election. Absent extraordinary circumstances that might justify it, a public communication about a pending F.B.I. investigation involving a candidate for public office that is made on the eve of an election is thus very likely to be a violation of the Hatch Act and a misuse of an official position. Serious questions also arise under lawyers’ professional conduct rules that require prosecutors to avoid excessive publicity and unnecessary statements that could cause public condemnation even of people who have been accused of a crime, not to mention people like Mrs. Clinton, who have never been charged with a crime. This is no trivial matter. We cannot allow F.B.I. or Justice Department officials to unnecessarily publicize pending investigations concerning candidates of either party while an election is underway. That is an abuse of power. Allowing such a precedent to stand will invite more, and even worse, abuses of power in the future. \\nIronically, the Hatch Act was passed because Republicans thought that employees from one of FDR’s New Deal agencies were involved in partisan electioneering. Little did they know that, today, a registered Republican FBI Director was going to violate it blatantly right before an election. Painter and Comey were colleagues in the Bush Administration when the latter held a position as Deputy Attorney General. \\nHigh ranking current Department of Justice officials discouraged Comey from going public just 11 days before a general election. \\nShamefully, it’s been revealed that the FBI doesn’t even have a warrant to view these newest emails yet. \\nFormer Deputy Attorney Generals Jamie Gorelick and Larry Thomspon, who served Administration with both parties, issued a harshly worded op-ed in The Washington Post today entitled, “ James Comey is Damaging Our Democracy .” They opined: \\nAs former deputy attorneys general in the Bill Clinton and George W. Bush administrations, we are troubled by the apparent departure from these standards in the investigation of Hillary Clinton’s email server. First, the FBI director, James B. Comey, put himself enthusiastically forward as the arbiter of not only whether to prosecute a criminal case — which is not the job of the FBI — but also best practices in the handling of email and other matters. Now, he has chosen personally to restrike the balance between transparency and fairness, departing from the department’s traditions. As former deputy attorney general George Terwilliger aptly put it , “There’s a difference between being independent and flying solo.” \\nAt the same time, Attorney General Loretta E. Lynch — nominally Comey’s boss — has apparently been satisfied with advising Comey but not ordering him to abide by the rules. She, no doubt, did not want to override the FBI director in such a highly political matter, but she should not have needed to. He should have abided by the policy on his own. \\nThe FBI Director broke policy to inform Congress about details of an investigation without any actual details, or having even seen the new evidence that was so urgent that he had to break decades of policy in order to disclose it. \\nEven stone age conservatives knew that these latest allegations are nothing more than a partisan political ploy, describing the Trump campaign’s reaction in grim terms: In Trumpworld as Hitler\\'s Bunker terms, this is probably like when Goebbels thought FDR\\'s death would save the Nazi regime. \\n— Ross Douthat (@DouthatNYT) October 28, 2016 \\nWithin hours of Comey’s official memo breaking, he released an internal “cover your ass” memo admitting that the letter could be misinterpreted, which was instantly leaked to the Washington Post and proved that the FBI Director understood fully the foolishness upon which he had embarked by interfering with an election. \\nNewsweek pointed out that Republican President George W. Bush had undergone FBI investigation himself before being elected, but nobody in the Clinton White House or the FBI used it to torpedo his 2000 presidential campaign. Bush investigated in 96. Cleared. Imagine if FBI came out in 2000, just be4 election, said \"new evidence, dont know what it means.\" Horrible \\n— Kurt Eichenwald (@kurteichenwald) October 30, 2016 \\nAmazingly, a blogger made requests in 2004 before the election and did get the FBI to release some files about then-President Bush in April of 2005, only five months after the election, but he suspected that they didn’t provide everything and the records show that his requests to expedite release because of the election were denied. The Bush FBI files contained nothing about the events reported by Kurt Eichenwald. \\nThe two former Deputy Attorney Generals said it best : \\nAs it stands, we now have real-time, raw-take transparency taken to its illogical limit, a kind of reality TV of federal criminal investigation. Perhaps worst of all, it is happening on the eve of a presidential election. It is antithetical to the interests of justice, putting a thumb on the scale of this election and damaging our democracy. \\nNow, the FBI’s top leadership is in open revolt over the Director’s political meddling as bipartisan condemnation is raining down upon the FBI Director, as his colleagues are openly telling the press that their boss compromised their agency to play partisan politics. \\nIt’s probably only a matter of time before Comey resigns and faces his own investigation for this entire sordid affair.'"}, "time": 1742562138.9425762}