{"duration": 0.16313409805297852, "input_args": {"text": "'NTEB Ads Privacy Policy More Differences Between The Pretribulation Rapture And The Second Coming Of Jesus Christ There are so who ignorantly assert that the doctrine of the Pretribulation Rapture of the Church was \"unknown before John Nelson Darby taught it\". I say \"ignorant\" because people make comments like these seemingly unaware that there are recorded accounts of it being taught all the way back to the 4th century AD. by Geoffrey Grider November 21, 2016 The doctrine of the Pretribulation Rapture appears over and over again, in both Old and New Testaments. Take Enoch for example. \\n“For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first: Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord.” 1 Thessalonians 4:16,17 (KJV) \\nFor a reason that eludes me , the Bible doctrine of the Pretribulation Rapture of the Church of Jesus Christ is a highly-despised subject in these Laodicean times we find ourselves in. Perhaps one of the reasons why it is so hated is because so many preachers stopped preaching on it years ago, because the idea of trying to live your life with a daily expectation of Jesus’ return is unpalatable to so many. Yet, the doctrine of the Pretribulation Rapture appears over and over again, in both Old and New Testaments. Take Enoch for example. \\n“And all the days of Enoch were three hundred sixty and five years: And Enoch walked with God: and he was not; for God took him.” Genesis 5:23,24 (KJV) Enoch is a type of the gentile believer raptured out before the time of Jacob’s trouble \\nWho was Enoch? Glad you asked, Enoch was a gentile believer and follower of God. The Bible says that Enoch’s walk with the Lord was a really good one, and one day out of the clear blue, God raptured old Enoch up and out of this world, and translated him straight to the throne room of Heaven. Just a few verses later we read about the Flood of Noah, a type of the Great Tribulation which came upon the Earth. Something else about Enoch, he was also a street preacher who preached Jesus to lost people. \\n“And Enoch also, the seventh from Adam, prophesied of these, saying, Behold, the Lord cometh with ten thousands of his saints, To execute judgment upon all, and to convince all that are ungodly among them of all their ungodly deeds which they have ungodly committed, and of all their hard speeches which ungodly sinners have spoken against him.” Jude 1:14,15 (KJV) \\nSo, in type, we see the Pretribulation Rapture and the time of Jacob’s trouble happening thousands of years before the coming time when those events will take place in real time, and not just in typology. In the New Testament, the apostle John is taken up to Heaven in yet another type of the Rapture. On the Last Times, the Antichrist, and the End of the World \\nThere are so who ignorantly assert that the doctrine of the Pretribulation Rapture of the Church was “unknown before John Nelson Darby taught it”. I say “ignorant” because people make comments like these seemingly unaware that there are recorded accounts of it being taught all the way back to the 4th century AD. \\nA sermon entitled “ On the Last Times, the Antichrist, and the End of the World “, ascribed to a man by the name of Ephraem Syrus, taught the doctrine of the Pretribulation Rapture quite plainly. Here is a snippet from that sermon: \\n“For all the saints and elect of God are gathered, prior to the tribulation that is to come, and are taken to the Lord lest they see the confusion that is to overwhelm the world because of our sins” \\nThat sermon would be the last bit of light from scripture before the Roman Catholic Whore of Babylon would swallow up the Christian Church for over a thousand years. There’s a reason why that period of time used to be taught in schools as the “ dark ages “, and the time corresponding with the advent of King James Bible in 1611 as the “age of enlightenment”. \\nSo as you can see , God has given types, examples and preaching on the Rapture for thousands of years. Now let us take a quick look at some of the major difference between the Pretribulation Rapture of the Church, and the Second Coming of Jesus Christ. THE SPIRITUAL TEMPERATURE OF THE CHURCH: Jesus says plainly in Revelation 3 that the last version of the Christian Church right before the Rapture is a self-centered, self-focused, lukewarm mess of a Church that locks Jesus on the outside. (Revelation 3:14-22 KJV). This is in stark contrast to Revelation 7 which shows an on-fire dedicated group of believers who “follow the Lamb wherever He goes”. There will not be anything “lukewarm” in the time of Jacob’s trouble. SATAN STILL FREE TO ROAM AFTER THE RAPTURE: In the first three chapters of Revelation, we plainly see the Church Age. That comes to an end in Revelation 4:1,2 where John, a type of the Church, is taken to Heaven in a type of the Rapture. Match those verses with 1 Corinthians 15:50-57 and 1 Thessalonians 4:15-18 (KJV). No where there do we see Satan’s reign coming to an end, in fact, we see the appearance of Antichrist just two chapters after the Rapture in Revelation 6:1. Compare that with all the places that mention the Second Coming, which ends in Satan being bound for a thousand years. (Revelation 20:1-4 KJV). JESUS DOESN’T LAND AT THE RAPTURE: Paul tells us in both 1 Thessalonians 4 and 1 Corinthians 15, that the Body of Christ is brought UP to “meet the Lord in the air” in the Rapture. According to Revelation, the Church stays up with the Lord all the way until Revelation 19:14 (KJV). But at the Second Coming, it is all about Him landing on the ground, and bringing His saints with Him . THE RAPTURE BRINGS COMFORT, THE SECOND COMING BRINGS DISTRESS: The apostle Paul, teaching on the Rapture to first century Christians, said that the doctrine of the Pretribulation Rapture was one designed to bring comfort to the hearer. “Wherefore comfort one another with these words.” 1 Thessalonians 4:18 (KJV) . But not so with the Second Coming/Day of the Lord, not by a l ng shot. “Woe unto you that desire the day of the LORD! to what end is it for you? the day of the LORD is darkness, and not light. As if a man did flee from a lion, and a bear met him; or went into the house, and leaned his hand on the wall, and a serpent bit him. Shall not the day of the LORD be darkness, and not light? even very dark, and no brightness in it?” Amos 5:18-20 (KJV) . If you’re looking for comfort there, brother, you’re in the wrong place. SECOND COMING PLAINLY TAUGHT WHILE RAPTURE WAS A ‘MYSTERY REVEALED WITH PAUL: In hundreds of places all through the Old Testament, the doctrines of the Second Coming and the Resurrection of the Dead are clearly and plainly taught as doctrine. In Job, the very first book every written, we see that clearly proclaimed. “For I know that my redeemer liveth, and that he shall stand at the latter day upon the earth: And though after my skin worms destroy this body , yet in my flesh shall I see God: Whom I shall see for myself, and mine eyes shall behold, and not another; though my reins be consumed within me.” Job 19:25-27 (KJV) . So many of the Old Testament prophets, like Daniel, Jeremiah, Ezekiel, Zephaniah, Zechariah and Joel all teach the Second Coming. But though we see types of the Rapture with Enoch and Solomon (Song of Solomon 2:9-12 KJV), the Pretribulation Rapture as teachable doctrine remained a “mystery” until it was revealed through the apostle Paul. “Behold, I shew you a mystery; We shall not all sleep, but we shall all be changed,” 1 Corinthians 15:51 (KJV) . \\nI love to teach on the Pretribulation Rapture because the evidence for it flows all though the Bible, it couldn’t be more clear. So why do so many “Christians” reject this doctrine? Let me go ask Jesus, He’s currently locked outside His own church at the moment (Revelation 3:20 KJV). But He promises that if I open the door unto Him, He will come in and be happy to show me a few things. \\nCan’t see a Pretrib Rapture in the Bible? Maybe it’s because you got Jesus on the wrong side of the door…don’t let the Bible correctors and the “scholars” steal your Blessed Hope. Jesus is coming to get us one Day very soon, as He promised to do. Keep looking up! \\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV) \\n '"}, "time": 1742561991.8516643}