{"duration": 0.08599114418029785, "input_args": {"text": "'David Brooks: Whites are “voting their gene pool” after being “ruined” by globalization, immigration, and feminism November 7, 2016 at 1:09 am By Dr. Patrick Slattery \\nOn the PBS News Hour on Friday, David Brooks said white people are “voting their gene pool.” Wow. Just wow. This is the same David Brooks who wrote in his New York Times column about a Jewish woman who came up to him after a speech, and knowing that he was Jewish too told him that his speech was a description of how Jews had taken over America, which he acknowledged in the column was indeed the case.One of my Jewish professors once boasted that “Jews earn like Episcopalians but vote like Puerto Ricans.” In other words, they voted their gene pool. Of course, they eventually bought out the Republican party as well, which gave their gene pool’s vote a choice.\\nBlacks famously vote their gene pool. Hispanics are expected to vote their gene pool. But when whites and whites alone consider their ethnic interests in voting, it is something that Brooks and the rest of the Zio elite and their Goyish lackey find “deplorable.” \\nBasically, less educated or high school-educated whites are going to Trump. It doesn’t matter what the guy does. And college-educated going to Clinton. \\nSometimes, you get the sense that the campaign barely matters. People are just going with their gene pool and whatever it is. And that is one of the more depressing aspects of this race for me. \\nBut what Brooks said about the reasons for whites (besides the college-indoctrinated whites) voting their gene pool was even more interesting. \\nWe had a lot of good things over the years that were really good for America. I think globalization has been really good for America. I think the influx of immigrants has been really good for America. Feminism has been really good for America.” \\nBut there are a lot of people who used to be up in society, because of those three good things, are now down, a lot of high school-educated white guys. And they have been displaced. \\nWhen David Brooks was growing up, whites make up close to 90% of the American population. So it doesn’t really make sense to say that the displacement of the bulk of the American population is good for America. \\nOf course, he did specify “high school-educated white guys.” Well, were blacks helped by globalization, immigration, and feminism? What did that do for their employment rates, crime rates, illegitimacy rates, etc.? \\nAnd white women? Well, maybe all they ever wanted in the first place was to have blue hair, nose rings, tattoos, and raise cats instead of babies. I guess we never asked them. \\nAnd college educated white guys? Well, they used to go to Harvard and Yale. Now, with affirmative action for blacks and Hispanics, competition from Asians, and massive Jewish nepotism, a white guy is lucky to get into a second-tier state school. \\nBrooks conclusion was even more breath taking: \\nAnd shame on us for not paying attention to that and helping them out. And, therefore, as a result, what happened was, they were alienated, they got super cynical, because they really were being shafted. And so they react in an angry way. \\nWell, that’s not a shock, given the last 30 or 50 years of American history. And so, for us going forward, it’s to not reverse the dynamism of American society and the diversity. It’s to pay attention to the people who are being ruined by it, and so this doesn’t happen again. \\nHere he admits that whites got shafted. That we are being ruined by diversity. But the weird thing is that line about “so this doesn’t happen again.” What? Is he concerned that Hispanics might be Jewed out of the America they inherit from whites? \\nThe rest of his appearance was just a poetic rant against Donald Trump. With any luck, on Tuesday Trump will be elected president, and we can make begin the process of making America America again.'"}, "time": 1742564587.2992496}