{"duration": 0.1080484390258789, "input_args": {"text": "'Posted on October 28, 2016 by Edmondo Burr in Sci/Environment // 0 Comments Scientists have found 19 pieces of alien DNA in the human genome \\nAccording to a new study by researchers from Tufts and University of Michigan Medical School and published in the Proceedings of the National Academy of Sciences , our DNA is not all human. \\nThe researchers examined 2,500 people and found eight percent of our DNA is non-human. \\nAncient Code reports: \\nExperts discovered that our DNA is less human and that nineteen pieces of Ancient Viral DNA exist within our own genome. \\nMost strikingly, experts discovered the full genetic mockup for an entire virus within 2 percent of the people they examined. According to sciencedaily.com , whether or not the virus can be replicated or reproduced, isn’t yet known. But other studies of ancient virus DNA have shown it can affect the humans who carry it. \\nScienceDaily reports that the study offers new insight on human endogenous retroviruses. HERV’s are actually antique diseases which possess eerily similar characteristics to human immunodeficiency virus, the precursor to AIDS. \\nExperts believe that this ‘Viral DNA0 has been passed down through thousands of generations of human beings. The study’s authors are still unsure whether the ancient strains of DNA could cause infections. \\n“This one looks like it is capable of making infectious virus, which would be very exciting if true, as it would allow us to study a viral epidemic that took place long ago,” says senior author and virologist John Coffin, Ph.D. of the Tufts University School of Medicine. “This research provides important information necessary for understanding how retroviruses and humans have evolved together in relatively recent times.” \\n“Many studies have tried to link these endogenous viral elements to cancer and other diseases, but a major difficulty has been that we haven’t actually found all of them yet,” says co-first author Zachary H. Williams, a Ph.D. student at the Sackler School of Graduate Biomedical Sciences at Tufts University in Boston. “A lot of the most interesting elements are only found in a small percentage of people, which means you have to screen a large number of people to find them.” \\n“This is a thrilling discovery,” says co-first author Julia Wildschutte, Ph.D., who began the work as a Ph.D. student in Coffin’s lab at Tufts. “It will open up many doors to research. What’s more, we have confirmed in this paper that we can use genomic data from multiple individuals compared to the reference human genome to detect new HERVs. But this has also shown us that some people carry insertions that we can’t map back to the reference.”'"}, "time": 1742563775.8511186}