{"duration": 0.0612797737121582, "input_args": {"text": "'When Masayoshi Son, the billionaire Japanese technology investor, solidified his control over his SoftBank internet conglomerate last month, he told shareholders he still wanted to “work on a few more crazy ideas. ” One of those ideas materialized on Monday, when SoftBank unveiled an audacious $32 billion deal to acquire ARM Holdings, the British semiconductor designer. The deal  —   one of the biggest of the year  —   would give the Japanese company control of a firm whose chip designs can be found in most of the world’s mobile gadgets, from iPhones and drones to a growing array of smart devices and appliances for the home. The deal is the first major   transaction in Britain since it voted to exit the European Union last month. Worries over the impact to the British economy have weakened the value of the country’s currency and made it cheaper for foreign companies like SoftBank to hunt for deals there. Compared with this same time in 2015, for example,   assets are 30 percent cheaper for buyers holding yen. For SoftBank, the deal signals another reinvention, this time with a major bet on a future filled with interconnected devices. While major technology companies see a future in smart thermostats and toasters, the technology has not yet become widely available. At the same time, global sales of smartphones have slowed, showing the mobile future has limits. “ARM and SoftBank have an overlap on how we see the future,” Simon A. Segars, ARM’s chief executive, said in an interview. But he left the door open for another offer. “Now that the offer is in the public domain, if anyone wants to make a counteroffer, they are more than welcome to do so,” he said. “There’s always a possibility of someone counterbidding. ” British leaders, under pressure to address global worries about the country’s future outside the European Union, portrayed the deal as an endorsement. “Softbank’s decision confirms that Britain remains one of the most attractive destinations globally for investors to create jobs and wealth,” Philip Hammond, the new chancellor of the Exchequer, said in a statement. Mr. Son said he was a “strong believer in the U. K.,” and he added that he had spoken with Mr. Hammond and Theresa May, Britain’s new prime minister, about the deal on Sunday. The deal is the   proposed corporate merger this year, behind Bayer’s offer for Monsanto and a Chinese   company’s proposal for Syngenta, according to the   firm Dealogic. If completed, it would also be the   chip deal on record, after Avago Technologies’ $37 billion deal for Broadcom. SoftBank already has ties to ARM through Sprint, the American wireless carrier that it controls. Mr. Son said he first spoke with ARM’s chairman about two weeks ago regarding a possible takeover, and added that the deal came together quickly. The two sides eventually agreed to a price  —   more than 70 times ARM’s net earnings in 2015. The deal is expected to close in November. Mr. Son described the deal as a bet on the “internet of things,” a new stage in the evolution of network technology, when cars, buildings and household items may be connected through embedded electronics. He framed the social and economic implications in grand terms. “First there was the internet, then the mobile internet and next there will be the internet of things, which is going to be the biggest paradigm shift in human history,” he said at a news conference. “I’m making this investment at the very beginning of this shift. ” ARM Holdings may not be a household name, but it is most likely that one of the company’s chip designs powers your smartphone, tablet or other mobile device. It devises chips and parts of chips that use less power so that they can be used in smaller gadgets. ARM had a market capitalization of about $22 billion as of Friday’s close, and the proposed acquisition represents a 43 percent premium over the company’s closing share price last week. Started in 1990 as a spinoff from Acorn Computers, a   British computer maker, ARM has gone from a small   of fewer than 20 people to a global leader whose technology is used in more than 90 percent of smartphones produced by Apple and Samsung, among others. ARM took an early lead on chips for mobile devices, while the growing popularity of smartphones and tablets has been more challenging to traditional chip makers like Intel. Unlike Intel, ARM forgoes the high margins  —   and equally high production costs  —   of directly manufacturing microchips. Instead, its engineers design chips, which are then licensed to larger technology companies like Qualcomm that pay ARM fees and royalties for manufacturing the chips. The company’s revenue totaled a mere $1. 5 billion last year, compared with $55. 4 billion for Intel over the same period. But as ARM’s chips have become increasingly powerful, the company’s stable of customers have begun to create devices that directly compete with those powered by Intel. That can be seen in particular in the world of computer servers, which have become the lifeblood of the internet as people’s online activities move into the cloud. As smartphone sales have slowed, ARM has invested millions of dollars in chip designs aimed at new customers, including automakers and household product companies, that are looking to add internet connectivity to their existing products. Mr. Son said he intended to double the number of employees at ARM in the next five years, and he said he would make that pledge a legally binding commitment enforceable by Britain’s takeover panel. SoftBank had been signaling that it was preparing for a major move. Last month, Mr. Son reasserted control over SoftBank’s overseas investment portfolio, easing out a former Google executive whom he had been grooming as his successor. In a statement announcing the departure of the executive, Nikesh Arora, Mr. Son said he had decided to stay on as SoftBank’s chief for at least five or 10 more years. SoftBank has recently been selling assets and raising cash. Last month, it sealed an agreement to sell its majority stake in Supercell, the developer of Clash of Clans and other mobile games, to China’s Tencent Holdings for about $8. 6 billion. It also recently sold about $10 billion of shares in Alibaba, the Chinese internet giant. Until now, SoftBank has invested mostly in the services side of the technology business  —   internet companies like Yahoo Japan and Alibaba, and mobile phone carriers like Sprint and Vodafone, whose Japanese arm Mr. Son bought in 2006 and turned into one of Japan’s dominant carriers. But abrupt changes in direction are part of SoftBank’s DNA. Mr. Son founded the company in the 1980s as a distributor of computer software. When he broke into the mobile phone market with the Vodafone purchase in 2006, many predicted disaster  —   SoftBank lacked experience in the industry, and the $15 billion deal loaded it with debt. But the business, renamed SoftBank Mobile, soon became a cash cow. Raine Group, Robey Warshaw and Mizuho Securities advised SoftBank on the deal, while Lazard and Goldman Sachs advised ARM Holdings.'"}, "time": 1742628576.7524526}