{"duration": 0.0962378978729248, "input_args": {"text": "'When the S. U. V. was recovered, two days after it was stolen, everything inside was gone, a long and bizarre list. More than 100 Brioni neckties. A fur coat that had been a gift from the Onassis family. Two bronze urns that had been in the trunk, and their precious contents. And a 1977 New York Yankees World Series ring, a personal gift from George Steinbrenner. It was inscribed, “To my friend, Bill White. ” That would be Bill White, the philanthropist and former chief executive of the Intrepid Sea, Air  Space Museum. The same Bill White who hosted a   with President Obama in his home in 2014. Guests included Rosie O’Donnell, Aretha Franklin and Mark Wahlberg. He spoke on Tuesday by telephone from the Jacob K. Javits Convention Center, where he was attending the Clinton campaign’s   events, the outcome still unknown. But amid the excitement Mr. White, 49, sounded like just another New Yorker angry at himself. “This is the tale of three idiots, and I’m all three of them,” he said. “I get it. ” On Nov. 2, Mr. White had parked the truck outside his building in Manhattan around 2 a. m. after having dinner with his husband, Bryan Eure. He had loaded a lot of property and memorabilia, like photographs of Barbara Walters with Yitzhak Rabin aboard the Intrepid, into the G. M. C. Yukon to take to his office later that day. And the vehicle contained something more precious, he said: the cremated remains of his parents, inside those bronze urns. The vehicle’s windows were tinted, and everything inside was covered, so he felt it was safe to leave his belongings there for the trip the next morning. “Like an absolute idiot,” he said. “I’ve left my car on the street for 15 years and never had it broken into. ” A familiar figure in social and political circles in the city, Mr. White guided the Intrepid through financial troubles during his five years as president. He resigned abruptly in 2010, and was under investigation by Andrew M. Cuomo, then the state attorney general, for his role in   for Alan G. Hevesi, the former state comptroller. That same year, he settled and agreed to pay $1 million to the state. He knows a lot of people. When he had seen that the S. U. V. was gone that morning, Mr. White picked up the phone and called the police. Sort of. “I called Commissioner Bratton,” he said, referring to the city’s former police commissioner, William J. Bratton. “And Ray Kelly,” who was Mr. Bratton’s predecessor. “I even texted my friend Bill de Blasio. ” The vehicle was recovered on East 89th Street in Canarsie, Brooklyn. It was taken to a police lot for processing and fingerprinting. “I said, ‘You’ve got to tell me, what’s in the car? ’” Mr. White said. “They said, ‘A sock.’ That’s when I lost it. ” “I’m just trying to get my parents back,” Mr. White said. “The other stuff, you can live without. ” The police released an image from a surveillance camera of a man stepping out of the Yukon, but it showed no sign of the property. Did he stop along the way and dump it somewhere? What could he have done with the urns? “I think he thought it was gold,” Mr. White said. “He opened it and saw dust. ” Mr. White’s father, William J. White, died in 2015 and was cremated. His son, an only child, said they were very close and had spoken every day, and that it continued after the father’s death. “People will think that’s weird, and I don’t care,” Mr. White said. “I used to drive him around. ” He kept the remains in the trunk area, out of sight. His mother, Patricia White, died in September. Mr. White placed her remains beside her husband’s. “Until I think about what to do with them, I want them to be with me,” he said, “and I’m in the car a lot. ” He planned to have both urns placed under a memorial bench with his parents’ names inscribed on it, in a park in Point Lookout, N. Y. where they had lived. The thief can keep the rest, he said. Even the ring. Once, in 2008, Mr. White was talking on his phone when a stranger approached and asked, “Where the hell did you get that ring?” It was Reggie Jackson, who said, “I was on that team, my friend, and you definitely were not. ” Mr. White just wants the urns. His parents’ names are inscribed on them. “I’m in a state of depression over it,” he said. “If he’s just returning the urns, then I will not press charges, and if he wants $25, 000, I’ll give it to him,” Mr. White said. He said goodbye, and returned to the Clinton event.'"}, "time": 1742563537.6819654}