{"duration": 0.12643671035766602, "input_args": {"text": "'Other Writers By STEVE HENDRICKS Most Trump supporters are not monsters. They just wanted to give the “liberal elites”—or the Establishment—the middle finger. ‘Take that, you bastards!’ \\nAs the articles rain down from liberals explaining how Trump won his astonishing, appalling plurality, we can at least give thanks that we’re spared the canard that all of his supporters are racists, xenophobes, and misogynists. Neo-Blackshirts, of course, make up a frighteningly large share (sixty percent? seventy? eighty?) of his supporters, but thanks to months of Brexit analysis and now days of exit interviews here at home, it’s clear that a great many Trump voters aren’t monsters. They merely voted with the monsters because they saw no other way to give the establishment a proud, powerful middle finger. \\nThe non-monstrous supporters of Trump mystify liberals. How could people who are not depraved, people who have a measure of decency, choose to align themselves with America’s Mussolini and his hordes, no matter how deep and well-placed their grievances against neoliberalism, greed, and corruption, which is to say grievances against Clintonism? \\nThis liberal bewilderment bewilders me. \\nOne dear friend in particular comes to mind—a brilliant fortysomething progressive of uncommonly sound judgment who voted for Ms. Bombalot. My friend was not among the liberal dupes who saw in Clinton a pantsuit paladin. She knew, for instance, that Hillary was the supreme embodiment of the American killing machine, a cowboy Crusader who, in the words of rightwing blowhard “Morning Joe” Scarborough, was “the neocon’s neocon. . . . more of a sabre-rattler and more of a neocon than” any of the Republicans contenders for Slayer-in-Chief. \\nMy friend knew that not only did Clinton lustily back the wars that killed hundreds of thousands in Iraq and Afghanistan but that she also bayed for expanding the slaughter years after anyone with a few neurons or a hint of morality knew we should get our troops the hell out of there. My friend has expounded with eloquence on the idiocy of Clinton’s push for imperial adventures in Syria, Lybia, and beyond, and she speaks just as fluently about the big fat kiss that Clinton slobbered all over the brutal right wingers who overthrew the elected government of Honduras. \\nMatters domestic outrage my friend no less. \\nHillary’s role in the awesome expansion of our Orwellian surveillance state is a horror to her, as is her incomparable whoring for big banks and fat cats. (I use the word “whoring” androgynously: Clinton is outdone in financial hooking only by our current POTUS, the Prostitute of the United States.) Then there is Hillary’s stalwart opposition to the Fight for $15, to Medicare for All, to forgiveness of college debt, to free tuition, and, companion to these, her ruthless despoliation of the working class via free-trade agreements (so called, of course, because they make labor free for the industrialists who own our country). \\nThe long memory of my friend holds a special place for Clinton’s support of her husband’s ravaging of black America—the punitive drug sentences, the broader war on crime, the evisceration of welfare. Nor has she forgotten Hillary’s ridicule of the women who accused her sweet Willy not merely of serial philandering but of sexual harassment. (Do you recall Hillary’s charming comments about, say, Gennifer Flowers: “trailer trash,” “I would crucify her”?) Few liberals could tell you, but my friend could, that as senator, Clinton herself once voted to wall off the better part of 1,000 miles of our southern border and that she declared herself “adamantly against illegal immigrants.” And my friend has been near tears when holding forth on the greatest issue of our time, the devastation of our climate, on which Clinton has proven herself a vandal—leading the sabotage of our last best chance, at Copenhagen, to mitigate our climactic disaster, nestling ever deeper into the cozy pocket of Big Oil, from which she peeks out now and again to ferociously defend the interests of the oilmen, the fracking barons, and the oil-soaked sheikhs who’ve lavished her with money—rapists and pillagers all, Kochs in all but name. And yet, knowing all this, my friend still voted for Clinton. \\nShe sympathized with the argument that the only chance for the Left to rise again is to kill off the rightwing imposter called the Democratic Party and replace it with a leftist party, perhaps a reincarnated Democratic Party, perhaps something else altogether. She saw the logic of denying Clinton her vote and giving it, as I urged, to Jill Stein or another protest candidate. But she could not abide throwing the election to Trump and so aligned herself with someone she knew to be vile on most issues of importance but who might once in a while do good on a few big issues like abortion and other women’s rights. Millions of nose-holding liberals made the same choice Tuesday. \\nWhy then is it a mystery to them that other decent-ish people, people with no more hate in their hearts than the rest of us, allied themselves with foul Trump? Is it so hard to see in these members of the Trump Nation the other side of the same coin, voters who swung to a different brute because Clinton was more dreadful on issues of importance to them? \\nThe stocker at Safeway may loathe Trump’s vilification of Latinos, Muslims, women, and on and on, but it was Hillary, not Donald, who shipped his $60,000 unionized factory job to Juárez. For that matter, although she has no vote, try convincing the Pakistani mother whose child was murdered by a Clinton-backed drone that Trump is worse because he wants to ban Muslims from America. \\nThe prescription for understanding how non-racist, non-sexist, non-xenophobic men and women—women, for Christ’s sake—made themselves Trump’s willing executioners, is simple: \\nLIBERAL, KNOW THYSELF!'"}, "time": 1742561802.8679461}