{"duration": 0.039347171783447266, "input_args": {"text": "'By Ryan Banister\\nProject Hemisphere, a secretive program developed by AT&T, searches trillions of call records in order to analyze cell phone data, spying on the activity of private individuals in order to identify who they are speaking with and why, as well as GPS tracking on the location of each individual connected to the call, and it transmits this information to the Department of Justice (DOJ).\\nIn 2013, Project Hemisphere was shown in a PowerPoint presentation produced by the Drug Enforcement Administration. The New York Times reported this as a partnership between AT&T and the DOJ, primarily deployed for drug-enforcement task-forces. All information collected in this program is accessible to the federal agencies authorized by the DOJ.\\nAT&T specifically developed and marketed this product for use by the DOJ, who would promise hundreds of millions in funds on behalf of taxpayers, using the taxpayers’ own money to spy on their every move. This is an invasion of privacy without a warrant. This is a federal spy program by proxy, working through corporations.\\nAT&T promises law enforcement that it will not disclose Project Hemisphere’s involvement in active investigations that are made public. AT&T is is attempting to lower liability for their customer and limit scrutiny to information transmitted to federal agencies through their network.\\nWhile it should not be surprising that your cell phone company is working with bureaucrats to collect incriminating evidence on you, there is a staggering number of people who still carelessly use their cell phone as if the information being transmitted through the device will be kept private.\\nNews flash! It’s never been private. They have always wanted to use your information as a product to sell to the highest bidder. Your data is their product, and you are paying them to take it from you.\\nVideo Report: \\nSource: The Daily Sheeple\\nVia: Activist Post \\n'"}, "time": 1742561962.0809839}