{"duration": 0.6603753566741943, "input_args": {"text": "'Archives Michael’s Latest Video What Is Causing The Strange Noises In The Sky That Are Being Heard All Over The World? By Michael Snyder, on March 22nd, 2012 \\nDuring the second half of 2011, a lot of people all over the planet started reporting hearing really strange noises coming from the sky. In some instances the noises produced a loud rumbling such as a train, a thunderstorm or the slamming of a heavy door would make. In other instances, the noises sounded more like “groaning”. In yet other instances the noises sounded almost as if a trumpet was playing. Dozens of videos went up on YouTube purporting to document this phenomenon, but the truth is that you can fake almost anything on a YouTube video and many dismissed these strange “strange sounds” as an Internet hoax. However, now entire towns in the northern part of the United States are hearing strange noises in the sky and the mainstream media is reporting on it. In fact, one U.S. town is planning to spend thousands of dollars to hire an engineering firm to investigate where these strange sounds are coming from. At this point a lot of theories about these strange noises are being floated, but so far scientists have not been able to give us a definitive explanation for the source of these strange noises. So exactly what in the world is going on? \\nThis phenomenon made national news again this week because of what has been going on in Clintonville, Wisconsin. Hundreds of residents of Clintonville reported hearing incredibly loud noises coming from the sky for several nights in a row. Even CBS News is reporting on what is happening in Clintonville…. \\nSince Sunday, the residents have been disturbed by “booming” noises loud enough to wake them from their sleep. \\nLast night, hundreds of people attended a public meeting to get to the bottom of booms. But they aren’t any closer to the truth. \\nOne resident told CBS News, “The last few days we’ve been having (a) booming shaking noise.” \\nAnother resident said, “(For) a lot of people the house is rattling, you can feel the ground rattling, and it’s booming all the time. It’s kind of like, what’s going on? You don’t know what’s happening.” \\nSo what is causing these noises that are so loud that even the ground is shaking? \\nAccording to Fox News , the town has investigated every possible explanation that they can think of for these strange noises…. \\nCity officials say they have investigated every possible human cause. They checked water, sewer and gas lines, contacted the military about any exercises in the area, reviewed permits for mining explosives and inspected a dam next to City Hall. They even tested methane levels at the landfill in case the gas was spontaneously exploding. \\nSo far no explanation has been found. So Clintonville has decided to spend $7,000 to hire an engineering firm to investigate the cause of these strange noises. \\nAccording to geologists, the town does not sit on any fault lines and the ground beneath the town is very solid. Some geologists are claiming that “ micro-quakes ” could have been responsible, but others find this explanation to be very unsatisfying. \\nFor many town residents, solving the mystery is not as important as getting these strange noises to stop so that they can get some sleep. \\nThe following comes from the recent Fox News article mentioned above…. \\n“My husband thought it was cool, but I don’t think so. This is not a joke,” said Jolene Van Beek, who awoke early Sunday to a loud boom that shook her house. “I don’t know what it is, but I just want it to stop.” \\nBut Clintonville is not the only town in Wisconsin where strange sounds are being reported. \\nMysterious noises are also being reported in a town called Montello which is 80 miles away from Clintonville. \\nPosted below is a local news report that discusses the strange noises that are being reported in Clintonville and Montello…. \\nThese strange sounds have made the mainstream news up in Canada as well. \\nRecently, strange noises caused such a violent shaking that they actually brought down a barn on Vancouver Island in British Columbia. \\nGeologists say that no earthquake occurred at the time that the barn collapsed. \\nSo what caused the barn to collapse? \\nThat is a very good question. \\nAnd this is not just a North American phenomenon. \\nIf you go on to YouTube and you do a search for “strange sounds” or “strange noises” you will find dozens of videos from all over the world. Yes, there are definitely a few videos that appear to be hoaxes, but is that true with all of them? \\nThe evidence for this phenomenon is mounting and it is getting really hard to deny that there really are large numbers people all over the globe that swear that they are hearing really strange sounds coming from the sky. \\nSo exactly what in the world is going on? \\nWell, there are a lot of theories floating around on the Internet. The following are some of the most prominent theories about what is causing these strange noises: electromagnetic noise, earthquakes, “fracking”, rock bursts, venting of high-pressure gas that has been trapped underground, meteor showers, HAARP or directed energy weapons, and some believe that all of this is just a giant publicity stunt. \\nPerhaps the biggest reason why these strange noises have so many people alarmed is because humans generally have a great fear of the unknown. \\nIf the cause of these strange noises is revealed, the hysteria will die down. \\nBut if these strange noises continue (or even become more intense) and there continues to be no scientific explanation for them, then the hysteria may turn into full-blown panic. \\nWhat is clear is that our planet is becoming increasingly unstable. As I have documented previously, earthquakes are becoming more frequent and more powerful. The “ Ring of Fire ” is becoming a lot more active and we have been seeing a disturbing amount of volcanic activity lately. \\nSo could earth changes have anything to do with these strange noises? \\nWe just don’t know at this point. \\nMost of the time when I write an article I like to have some answers. But I do not know what is causing these strange sounds. \\nSo what do you think about these strange noises? \\nDo you believe that you know why they are happening? \\nHave you heard strange sounds coming from the sky where you live? \\nPlease feel free to share your thoughts by leaving a comment below…. \\nIt is necessary to determine the origin of these sounds: natural or artificial. I think these sounds are artificial, for nature as it is not natural. But I admit that I could be wrong. ScoutMotto \\nI don’t doubt that some of the videos are valid, however I heard one from I think Hungary where amidst the groaning sounds, there was a piece of music played backward for a couple seconds. I sampled the soundtrack, played it backward in Goldwave, and it sounded like a short percussion piece. Hard to take that one seriously, which causes doubt to be cast on others of like style. But, I’m not writing it all off just yet. Guido Heraldsofthemorn \\nThe destruction of Jerusalem in AD 70 is an example of the destruction of the world at the end of time, see Matthew 24 and the book The Great Controversy. Here is a paragraph from the book Great Controversy that tells of signs and wonders before the destruction. \\n“Signs and wonders appeared, foreboding disaster and doom. In the midst of the night an unnatural light shone over the temple and the altar. Upon the clouds at sunset were pictured chariots and men of war gathering for battle. The priests ministering by night in the sanctuary were terrified by mysterious sounds; the earth trembled, and a multitude of voices were heard crying: “Let us depart hence.” The great eastern gate, which was so heavy that it could hardly be shut by a score of men, and which was secured by immense bars of iron fastened deep in the pavement of solid stone, opened at midnight, without visible agency.”—Milman, The History of the Jews, book 13. – {GC 29.3} \\nCould these sounds that are being heard be part of the signs and wonders before the end? Mike Ayala \\nGreetings, \\nYou have no idea how unstable the earth really is! Humanity is going to have a wake-up call one day that is going to make the movie 2012 look patheticly simplistic and relatively uneventful in comparison. \\nThe problem stems from the release of heat as rock falls through magma: the volume of the rock decreases as it melts, and at the same time it releases enough heat energy to melt many times its original volume – some suggest enough heat to melt 88-times the original volume. (You should gasp about now.) Up to the present we have enjoyed relative stability, a sort of sliding equillibrium, but that is changing at an increasingly rapid exponential rate which can be quantified by examining the increasing rate of “Great” earthquakes (8-plus) over the last 100 years which is startling to say the least. \\nSome parts of the crust will be affected more than other, but all will feel the pain. The worst economic collapse ever will be remembered as the “good old days” in comparison to the run-away stage of this process. The recognition of this process gives new meaning to the prophecy, “There will be famines, pestilences, and earthquakes in various places.” \\nThe noises and shakings noted in the article probably do not have anything to do with this crust-contraction phenonenon, but there is coming a day when all who dwell on the earth will fear for the things they see and experience coming upon the earth. Hence, the most important preparation one can make is to prepare to meet God. For some it will be a time of exceeding joy; For the rest it will be the time of judgement and eternal torment and regret. \\nSend me an email, and I will get you more information about this topic. \\nGod bless and protect you all. \\nMike Ayala JR \\nSo, Mike, how do we contact you, then? Or can you point us to the source of your information? Thanks! Mike Ayala \\nHi JR, \\nThe easiest way is to call and order a copy of a recent lecture given at Calvary Chapel Costa Mesa at the February Creation Science Investigation conference on 20120218. They are not a lot of money. The particular lecture covering this topic was: \\nEarthquakes Kevin Lea 2/18/12 \\nThis one was a real eye-opener. I knew about the exponential increase in great earthquakes, but the magma details and the Pacific Ocean abberation/collapse/indentation were new to me. \\nAnother great presentation given at the same conference was by John Sanford: \\nGenetic Entropy Dr. John Sanford 2/18/12 \\nThis one is about how the human gene pool is decayng at an astounding rate of conservatively 100-200 mutations per generation plus transcription errors in every cell division and what is the significance of these two factors. It does not paint a pretty picture. \\nThe bottom line is that we have no hope in this present world: All that we take for granted and hold dear will perish. We need to have our hope firmly rooted on the Rock of Jesus Christ who will regenerate our bodies and renew our minds and make a new heaven and earth in which righteousness will dwell. \\nGod bless and protect you and your family. \\nMike Ayala Ken West \\nyes I would like to read more about this subject. Would appreciate what info. you have. Thanks \\nHollow earth theory coming alive. Underground civilizations in which all of our gold and other PMs are transfered to are having underground wars that are heating up, similar to the quakes on the east coast in VA to NY MB92083 \\nJust saw on Fox news (Gretta V.S.) that the mystery was solved. They said it was caused by a minor (1.something) earthquake. This only applied to the WI incident. Blustery Day \\nAnd of course you never change the channel. Fox is not reliable. They tell you what they want you to believe. PandaStar \\nand that is different from any other news or network? Curtis \\nIn October of 2011, my wife and I were on our way to Lake Tahoe on highway 88 coming down the mountain toward highway 50 when we suddenly heard within our car (windows up), a sound so loud that it sounded as if a freight train was right next to our vehicle. This is an area that is pristine. There are no trains around. It was unexplainable. mondobeyondo \\nThere is still a lot more about our planet that we don’t know, than what we do know. Just like any arrogant teenager, we think we “know it all”… mark \\nThe only sounds that we hear on our ranch at his time of year are frogs and the creek that runs by our house. Oh yes, we can’t forget about the dogs, the coyotes, owls at night,cows,birds, a car or truck once in a while and sometimes a chain saw. Let’s not forget the sound of the wind in the trees or the rain hitting the roof. I guess we have not heard the groans of the earth yet. Gary2 \\nAll the strange sounds are coming from all the echo from Rush in conservatives empty heads. \\nAnd yet another study showing conservatives to be dumb. \\nDon’t Drink and Vote: New Study Says Alcohol (And General Thoughtlessness) Makes People More Conservative \\nGetting drunk is known to cause erratic, irrational, and, overall, thoughtless behavior — public urination, bar fights, tears in the streets. Now, go ahead and add political conservatism to that list. \\nA new study, published in the Personality and Social Psychology Bulletin, tested whether low-effort thought promotes political conservatism, and part of the study measured alcohol’s effects on political positions. Researchers found that the higher the blood alcohol content, the more conservative the views on sex, education, and political identification became. \\nResearchers hypothesized that drinking turns people Republican because political conservatism arises in the absence of deliberate thought. People with a lot on their minds, under time constraints, or told to respond in a cursory manner, rather than think deeply and use “recognition memory — an indicator of effortful thought — were also more conservative. \\n“Together these data suggest that political conservatism may be a process consequence of low-effort thought,” the study concluded. \\nThe less you think (or more you drink), the more conservative you become? Shocker! Cheers to the right-wing. Guido \\nThat doesn’t sound subjective at all… DownWithLibs \\nSo, you WERE dropped on your head when you were born…only explanation!!!! Justa Guy \\nI don’t know about groans of the earth, but I think I’m hearing groans of the blog right about now… Drunk Gary2 \\nIn other words DRINK UP and PARTY ON DUDE! \\nP.S. – This explains why Berkeley and other party spots are such bastions of conservatism. Those damn conservatives are having too much fun. Its time for liberals to lighten up an tie one on. Guido \\nI don’t think this is inexplicable. Years ago, in the 1980s, San Francisco’s boat people all reported loud, unusual noises coming from the bay. Theories ran wild, including Soviet subs, until scientists figured out it was the toadfish mating call. \\nThere are also lots of stories over the years about inexplicable humming in certain towns and areas. http://abcnews.go.com/US/story?id=91912&page=1#.T2v9XdlVXTc Here’s an article on the Kokomo Hum. I don’t know if there’s any similarity, but it wouldn’t surprise me. Perhaps the region sits on a nice piece of rock that can resonate like a tuning fork when it gets the right signal. Perhaps it is geological activity-we have seen a lot of earthquake activity in recent years. Who knows? Guido \\nI watched one of the videos. It reminded me of the gag at the end of Red State where the kids fool the extremist church holdouts with trumpets played over an old fire department horn and convince them it’s the end of the world… Gary2wannabe \\nMeeshall has been farting. Kannibal \\nIn Fresno, CA, this is a daily occurrence. The sound happens suddenly without any build up. It is extremely loud like 10 Jets, and shakes my walls and windows. Sometimes it suddenly just stops without fading away like a jet normally would. Sometimes it rumbles the sky for minutes at a time. I’ll be outside sometimes when it happens and look up in the sky but there is never anything there. Clear skies and no airplanes. \\nI once heard a rumble at around 2am and ran outside to see if I could spot anything. What I saw was in the sky to the southwest. It was about 14 red lights it the formation of a boomerang and you couldn’t see between them. The space they took up was about the size of a football field. It was traveling very slowly as if it were slowly descending continuing southwest. I have never seen anything like this in my life. It sent a chill down my spine and I called out for my wife. She ran out and started freaking out. I know this sounds crazy but maybe it was just our government playing with there new toys. GunRights4US \\nClearly God’s pissed, and rightfully so. Sodom and Gomoarah had nothing on modern man in terms of pure evil. Man has an appointment to keep, whether he likes it or not. John \\nYou are about the only one who is closer to the truth than anyone could ever imagine… David M \\nMaybe it’s an SSTO. Single Stage To Orbit spacecraft. Being run by our government making runs to orbit. \\nIt would have powerful engines to accelerate to orbit and would leave a long thunderous noise trail. Including sonic booms, that would shake the Earth, as it got up to a minimum of several thousand miles an hour. \\nSomeone should compare the sounds to a Shuttle launch. Ripplewind \\nMother Earth is preparing for war against us. Andrew Kind \\nGod is shaking what can be shaken before His Son returns. karen \\nIt’s Mother Earth giving you warning signs, but of course most will say it’s all a joke. And for christains it’s the same as in the bible… And the trumpets shall sound, you are being given a warning of things to come real soon. even the goverment knows this, they just don’t want you to know, that’s why a new executive order just came into effect 16 Mar 2012 National Defence Resources Preparedness they own everything you have now right down to a chicken in your yard. There is a great video out called 5 reasons why America will have the worst riots in the world, awesome truth!!! Anna \\nOn January 23rd I heard the noises , the deep and high trumpet/ groaning type, not the boom, but I was terrified, it was omnidirectional, not point of origin. When I compared what I heard to the sound of some of the Shofar videos , my hair stood on end. It was nearly identical, only on a much grander scale. Could be a deception, we are warned, Let no man deceive you, could be the real deal as well. Only God know and that is enough for me, He says 365 times in His Word, do not fear, so I have to trust Him. Walk with Christ and He will keep you fearless. Emily \\nI do not say this lightly or with humor, Mother Earth is in pain and we are hearing her sorrow. Please remember, YAHWEH brought forth all life from Earth and she cries out for her children. JR \\nCould it be the sound of our economy imploding under the feckless administration of Jimmy Carter Obama? \\nSome people are talking about a coming magnetic poleshift (nothing new, has happened before), maybe the magnetic field are making those sounds? Intresting article Michael. Sunshine \\nYes, curious on magnetic shifting for possibility. Consider that one of the things said to be saturating the atmosphere through SRM, Solar Radiation Management is aluminum particles. Now, as far as I know, aluminum is NON magnetic. Disrupting the electromagnetic waves of the sunlight could be a factor in “climate change” since the sun plays a very big part in natural weather patterns. Could interfering with magnetic waves also cause strange noise? Now, why go to this great effort with such great risk? It could cause extreme weather patterns including melting the north pole. \\nHAARP, the Aurora spy plane, fracking, and Biblical end of age signs? jason \\nIn january of this year i herd a noise coming out of the sky. I live in the wisconsin dells and at that time i could sweare a T-rex was going to come charging out of the woods at any moment. it was a little unsettling to see videos on youtube that show the same sound all over the world. at first i passed the sound off to be some kind of amplification to the mile away freeway but at 3 am the freeway is not that active. so what the hell is it? Newman Noggs \\nAuroras can cause strange sounds from a distance, but usually they crackle, not boom. I would look for evidence of electromagnetic activity: increased ground voltage, St. Elmo’s fire, etc. From what I’ve read this is not a new phenomenon. Look up Seneca Guns. http://earthquake.usgs.gov/learn/topics/booms.php Billy \\nNote to Gary2: You are indeed an idiot. MB92083 \\nI’ll second that! He’s a nice guy, but delusional and brainwashed. Benjik \\nI’m thoroughly convinced Gary2 is actually an extreme right-winger dead-set at portraying liberals/progressives to be extremely foolish and misinformed. That’s the only rational explanation….. Proftel \\nBecause only in the Northern Hemisphere? \\n? Jim \\nIt is the US gov playing with thier reversed engineered alien stealth spacecraft. I have also heard (with my sister) what sounded like a large flying spacecraft right over our heads with NOTHING around but sky. It was NOT a natural phenominum as soulded “man” made. \\nRemember, the Gov tells us 10% of what we really should be knowing. Rosenkreuz \\nHow do you know what a large flying spacecraft sounds like? Denali \\nIt’s our Founding Fathers turning over in their graves. bruce smith \\nBe Warned.. GOD is giving everyone a chance.. Signs and wonders are to allow people that have doubted in HIM to wake up.. When HE does return soon, it will be to gather the followers of HIS SONS teachings home with HIM..After that earth will be a living hell.. laura4basics \\nI would never accuse people of making this up or of creating a hoax for attention. I will suggest looking up Tesla Technology GMA215 \\nThe so-called “experts” have now announced that the noises in WI are from a “swarm” of “mini-earthquakes.” Yeah. Sure they are. Saq \\nIt’s called the government. Possibly drilling more underground tunnels??!! babygirlway \\nThursday morning I woke up at around 5:00 a.m. hearing some sort of loud pounding noise coming from outside. It was repetitive. Our windows were open because it has been unusually warm for March in the Indianapolis area. So warm in fact that I had my large, remote control fan on next to my bed that I purchased last summer to help with my middle aged night sweats. LOL. Anyway, I had enough time to wake up and hear the noise above the fan, turn off the fan and still hear it going….it woke my husband up as well. It was not a construction noise. I never did figure out what it was. Did anyone else in the Indy area hear it? Benjik \\nSomething I have wondered about for years and never received a valid explanation on is what are the effects of pumping billions of barrels of oil out of the Earth with nothing to replace it? Wouldn’t that internally effect the general mass of our planet? How does that void effect the Earths rotation, gravitational properties, points of axis, etc? Think of the old “spinning egg” science experiment. When the internal properties of an egg are altered (boiled vs. raw), it has a direct effect on how it reacts to spinning it on a hard surface. Could this may be happening on a global scale? Any feedback would be appreciated. OldManNoal \\nFINALLY SOMEONE IS ASKING THE RIGHT QUESTIONS!!! you’re onto something MASSIVE Benjik Marilynn \\nThe other night I had difficulty sleeping. I can always hear the “hum,” although it varies in volume, but I just ignore it. This time it was accompanied by an occasional groaning sound. It wasn’t very loud and I know it wasn’t a vehicle driving by or an airplane because it didn’t increase and diminish. Just a few seconds of a low “groaning,” then five to 10 seconds later it repeated about five or six times. \\nThe next day I read about the noises in Wisconsin. My guess is that it has something to do with military testing, perhaps some sort of sound wave experiment. This much is not theoretical: The government is ALWAYS engaged in experimentation of all sorts—chemical, biological, nuclear, electro-magnetic, geo-engineering, mind control, etc.—and they have no ethical qualms about testing this crap on human populations. \\nyes,it is all in the new book, MAYDAY IN JOPLIN Gary2 \\nI figured out what the noises are…Gog and Magog are tusseling over who gets to kick the beasts ass. mackie \\nSounds are the results of vibrations. And vibrations can be a result from many different events. Such as ‘space quakes’, which are the magnetic field lines which do compasses our earth and out into space. When we recieve a solar flare from the sun, these magnetic field lines are push or moved, and when two of these magnetic field lines touch each other they cause what is called a space quake. A space quake is a loud vibrating sound which is from the sky, and can be felt through the air, ground, and can even rattle your house. Another thing which can influence as well our earth is a heavy object such as a dwarf star, or planet x, or even a comet. These will either pull or push our orbital cycle, or even casue the earth to real to and fro like a drunkerd. Even thirdly, the earth’s core could be heating up, just like the rest of the planets in our solar system due to the sun’s output which has changed so much and is effecting all the planets. A warmer core would cause the increase of rotation of the earth. There is also the “fluff” in space as well which is effecting the sun, and everything else. There is so many things which we are not taught, but the information is out there for the learning if one wishes to go out and research it. We are blessed to have such a great resource through the internet. In life It is always a cause and effect. A.S. \\nMichael, you already gave one reason, which is the most likely one: HAARP. It is the U.S. using HAARP for whatever selfish purposes, like attempting to subvert countries like China, Russia, Saudi Arabia, etc, to trade between themselves with their own currencies. The U.S. did it before and they will do it again. Jes \\nhttp://endoftheamericandream.com/archives/what-are-the-strange-noises-in-the-sky-being-heard-all-over-the-world Booming Sounds could this be the result? – Here’s an excerpt on what really happened at the time of the Great Deluge (Noah’s Flood). It was a cataclysmic. – Geologists have recognized that these ridges are fracture lines on the earth’s crust. They have estimated some 200 million years ago the continents were joined together as one piece, and they have named this supercontinent Pangea. A model of the Pangea was presented in the section, Creation Mysteries. Since then Pangea broke up as a result of the earth’s Crust breaking up into pieces, or plates, which have since been drifting from each other or drifting towards each other. Thus the Americas are moving at a rate of an inch from Europe and Africa per year. The present separation is about 3,000 miles. The major mountain chains of the world such as the Alps and the Himalayas were formed by the collision of plates bearing these continental masses against each other. In other areas the collision caused one plate to go under the other as in the case of the Pacific plate moving under western edge of the US continent. This process is still continuing, hence the periodic earthquakes in California… Read more here… http://www.biblediscoveries.com/content/view/17/34/ Yeshua(Jesus) did say: Matityahu (Matthew) 24:37-41 As it was in the days of Noah, so it will be at the coming of the Son of Man. For in the days before the flood, people were eating and drinking, marrying and giving in marriage….. The End will be cataclysmic just as was the Beginning. Tesla2011 \\nHaha, its sad billions or millions of earthlings have no clue. Its clear, what this is and I would only say this, the earth magnetic pole shifts and the layers of earth are all being testes and purposley being manipulated by mad scientist. Ofcourse, already its sounds mad bc, you ppl can’t belive it or the science of mechaniscim. This object is the one and only worlds most dangerous weapon… \\nThat’s High frequency Auroa Atmosphere Reasearc Program. The man, who created is the worlds genuis of all centuries. His name is Nikola Tesla and is the inventor of the electromagnetic transmitter gha would be later deveolped as a top notch weapon. Guido \\nI suggested earlier the noise could be large rock formations underground resonating from earth movements. Beneath Wisconsin and other states in the region is a massive granite formation called the Superior Upland Shield. The US Navy exploits the resonating qualities of the shield to transmit Extreme Low Frequency communications with submerged submarines. They’re broadcasting at about 8 watts. The ELF transmitters are slow, but they can use the planet itself to transmit their signals to subs underwater in any ocean. Perhaps this sheild, or some other piece of rock can pick up earth movements and magnify them into those peculiar sounds. One of the ELF antenna arrays is located at Clam Lake, WI, which is only 20 miles’ drive from Clintonville, WI. I have no proof, but the idea is no less plausible than other ideas I’ve heard… Bruce \\nThe Bible says in Romans 8 that “all of nature groans ( waiting for the return of Jesus) and in Matthew 24 that ALL these things…earthquakes, wars and rumors of wars, a decline in morals (and I am quite certain, even strange sounds)…when you see ALL these things beginning to happen “look up for your redemption isn’t too far off”…time to get your heart right with God. BluButterfly \\nI keep hearing a lot of really far out theories, and I find them all fascinating. However, the best answer is sometimes the simplest and most obvious. Has anyone ever tried correlating these strange noises to the increasing solar activity? Recently we have been seeing lots of solar flares, suspots, etc and they are definitely affecting the high incidence of Northern Lights in the past year. Some geologists (in Finnland and Germany) are saying the sun has not been this magnetically active in over 1000 years. One of the best sites to read about and track this solar activity is http://www.nasa.gov/mission_pages/sunearth/index.html . I am trying to find out if anyone has cross referenced the dates of high solar activity, the dates of solar storms, and the areas where the magnetic flares have reached the earth. Josh \\nEveryone bringing religion into this is dumb. Truthfully im a christain but seriously science proves more than a bible can prove thats jsut fact. You people say the world wil lend and it doesnt why because all you have is a book backign you up. Thats incredibly outdated. Time to stop believeing in fairytail and start believeing in facts. Ducrider900 \\nBefore you call other contributors here “dumb”, it might behoove you to learn how to spell, and how to string a few cogent words together – it’s called using grammar to communicate. Too bad it’s no longer taught in the government schools…you and your pathetic attempt at communication are collectively, exdhibit one of this sad fact.. hippiekarl \\nWhat’s ‘dumb’ is calling theories that have become dogmas through nothing more than repetition ‘proofs’ or ‘facts’. ‘Science’, painted into a corner by its mutually-contradictory ‘facts’, can’t even explain such things as why sea-water is salty (the ratio on this planet of sodium to chlorine doesn’t allow the oceans’ current salinity), or why (if iron was always on the surface of the Earth) the Bronze Age preceeded the Iron Age…or why the world’s highest mountains are the youngest, and are covered–beneath their ice–with sea sediment. ‘Science’ (which gets together and VOTES on what the ‘facts’ are) is full of hubris but short on ‘the truth’, which it periodically changes, changes back, and changes again. Physics is not a democracy, and majority-belief is NOT the benchmark of ‘fact’ or ‘truth’. Max \\nI live in Wisconsin and the local news reports had residents claiming the booms came from the ground, not the sky. Regardless, why do these tremors occur mostly at night? We had a massive chemtrail blitz last Oct and then again late Jan (that we could see) which was very unsettling. So the idea of a sound weapon makes sense somewhat — I think the government is messing with us for not rolling over on the Union destruction plan. Chopper \\nWell finally someone is getting very close to the truth…. Mackie…. I think everybody should read what he is saying… Magnetic flux lines… I personally think everybody should do some reading …. Fast! Lol. JJ \\nExcept hallucinations are generally not recordable. These sounds are recordable. JC Vaughan \\nI tell you, Krypton is merely shifting in its orbit. James \\nThe Bible gives information on the end times, and if you check out Daniel and the New Testament, especially Revelations. You will see most of the things we are experiencing now, are in there with more things to come. harold hutchison \\ngod said that in the last days he would shake the earth he said there would be signs in the earth and from beaneath the earth, also signs in the sun the moon just look around and see what is going on, it also says the whole creation groans in pain wanting to be delivered from the curse that is on it, people like to make fun of the bible but that will soon come to a end, the bible says its a fearful thing to fall into the hands of the living god unprepared, gods son paid a terrible price for our sins and i urge everone to make sure you are ready before its to late . h. hutch Renee \\nGlad I came upon this, I heard a almost deep noise, not loud from inside my house, the windows were open, my dog heard it and cocked his head at it, the next day my mom was bruching her hair and litterly, no shiz, her hair started rising, I tryed brushing it out and noticed it was litterly lifting, yesterday I also was so hyper it was crazy, like magnitized. This is a rather interesting article, our alignment with Jupiter, being maybe alittle closer causing a magnetic shift? It sounding almost like blades, its gotta be our Magnetic field, also it feels like July, we could be sliding in location perhaps? Stephanie White \\nNow to me that is interesting – that your dog heard it. From everything I have read, no animals appear to hear it – or react to it. jeremy archer \\nI went out on the night of the hurricane last August. It was 10pm and the wind had not really kicked up yet. It was raining but I did not wear a hat and I had no umbrella. It was quite warm so the rain on my head did not bother me. I walked from 99th and Broadway along 100th st to Central Park. As I entered the park I followed a path over a little bridge and down to a lake. There were a few ducks at the edge of the pond that stood and gazed at me. It was very quiet; hardly any traffic was passing down Central Park West. All I could hear was a torrent of water coming down the hill that passed under the bridge. I stood and looked at the reflection of the street lights on the lake. After some time, I walked back up the hill over the bridge and walked along 100th st. Just before I got to Manhattan Ave I started to hear a low groaning sound, like some old man breathing. I could not tell if the sound was coming from the sky or from below me. I crossed the street to see if I could still hear it, since the sound was not loud. I stood under a tree and the volume was the same. I walked over to Columbus Ave and turned south. There is an entrance there to a new building and 3 doormen were standing outside talking. I asked them if they could hear any sound. One of them ignored me but the other 2 said they could hear it. I was not sure if they really did or if they were just humoring me. We talked for a minute and one of the doormen offered to show me a book he was reading. When I entered the building, due to the absence of any exterior noise from the rain and traffic I was able to hear the sound much more clearly and at that moment I felt that the sound was coming from beneath me. The doorman made no comment on the fact that the sound was any more audible. I did not mention the sound to him again but I did wonder why he did not mention the increase in the volume. He showed me his book and I left the building and continued walking south to 97th st, where I turned and walked west for about half a block, listening intently to the sound that I felt sure now was coming from beneath my feet. Then the sound stopped, so I turned and walked back to see if I could pick it up again but I could not. I returned home to 99th st without hearing the sound again. drezdin \\nMid-michigan… Heard strange sound last night which sounded most similar to a helicopter, or an uneven, overloaded washer during spin cycle. no copter in sight and sound did not at all seem to get closer nor further away, but did weaken for a few seconds at times while also intensifying for a few seconds periodically as well. lasted from at least midnight until 7am at which time my wife could still hear it several miles away upon arrival at work. we live in apt. complex and two neighbors (one next door, one downstairs) were out on their balconies and either could not hear or were ignoring (hard to imagine) the sound because their conversations didn’t even give mention of the noise from what I could tell ( which wasn’t much bcuz the noise was LOUD and ANNOYING and OMINOUS!! Thank You Jesus for CHOOSING me before I even was, and pulling me out of the wilderness after 37yrs. threescore and 3days! (Baptized 12/9/11 immersed in water in Jesus’ name for the remission of my sins, and to receive the gift of the Holy Ghost, evidenced by the initial outward sign of speaking in tongues 12/20/11). \\nOne baptism. One God. One Name. Be One..with Christ, in Christ, of Christ. Forever. Amen. Apostolic Pentecostal and rapture ready! Paladin \\nI’m responsible for the strange loud noises in Clinton……well, actually it was that'"}, "time": 1742563456.7039318}