{"duration": 0.049843788146972656, "input_args": {"text": "'Fans of Megan Fox have had to exercise patience: The actress, by her own admission, doesn’t work much. “I’ve never made more than two movies a year,” she said. Her recent arc on the Fox series “New Girl,” was, then, an unexpected treat, and she will reappear next season, she said, as a love interest and   comic foil. And she returns as April, the adventurous reporter and stalwart buddy in the sequel “Teenage Mutant Ninja Turtles: Out of the Shadows,” out on Friday, June 3. A case of bronchitis caused her to miss the premiere in New York, where the movie was filmed, but Ms. Fox spoke afterward by phone from Los Angeles about her unambitious career path and her working relationship with the producer and director Michael Bay, who first propelled her to stardom in “Transformers,” and is behind the “Turtles” movies. As a mother of two young sons, with a third child on the way (with the actor Brian Austin Green) Ms. Fox, 30, long ago gave up playing Halo, but she still gravitates toward the fantasy universe. “If I got sent 10 scripts and one of them was for an action or   or gaming movie, that’s the first one I’m gonna read,” she said. These are edited excerpts from the conversation. Is it important for you to play women who are both strong and physically attractive? I don’t get a whole lot of say in terms of character development on movies like these. It’s not like I’m in there helping them write the script saying, “April should do this, because this is what a real feminist would do. ” In terms of what’s available for women to play in general in Hollywood, it’s pretty scarce. You have these stereotypes that still dominate films: the nag, the trophy, the escort. [Laughs.] I haven’t been sent a nag script yet, but I do get plenty of, like, “interesting stripper. ” Or, “She’s super funny, but she’s also an escort, but that’s what makes it funny!” Would you rather have more say? [On “Ninja Turtles”] if I had said, I feel like my integrity is being compromised wearing this schoolgirl uniform, they would listen to that, of course. But that wasn’t something that affected me in a negative way at all. On a movie like this, I don’t mind doing [the scene] as written, but I do do a lot of improv. I’m sort of a   ballsy talker, and so I bring that to the character whenever it’s appropriate to the scene. That never makes it in. How did the “New Girl” role come about? I don’t watch a lot of television, so I didn’t know about it. They wanted to pitch it to me, and I thought that was so bizarre, because I’m not known for working in television, and not known for comedy, even though I’ve done a couple. And I loved it. I was taken aback by how weird and offbeat and fun [the show] is, and the character falls right in line with how I like to play to my own comedic timing. You’ve said that you’re not very ambitious as an actress. Why not? I know [that] idea is a very strange thing because usually actresses are all ambition, and are driven to achieve and they’re workaholics, for the most part. And I’ve never been that way. I’m not necessarily very passionate about acting per se. I don’t feel validated by being on a set or making a movie. I have a lot of fun making these movies, but it’s not a representation of my innermost being. You and Michael Bay had a public falling out after you compared him to Hitler in an interview. You weren’t in the fourth “Transformers. ” How did you mend fences? I had to ride out two years of very negative press. There’s this perception that I was sort of thrown out of Hollywood. The positive thing was that it forced me to be very introspective and go, ‘You were not totally right in this situation.’ I reached out to him, and we had a very genuine exchange. From that point forward, it was good. What kind of movies would you like to do? I actually prefer doing these kind of movies, which always surprises people because they always assume that everyone wants to be the suffering artist, making these festival pieces. There’s something that’s more athletic about the process of making these movies, there’s more adrenaline involved, there’s more risk factor, there’s more chaos, and so I just find it to be a more exciting experience. These are also the kind of movies that I prefer to watch, because they’re an escape into a supernatural world, which has always been where I prefer to daydream, anyway.'"}, "time": 1742628316.5754874}