{"duration": 0.09939885139465332, "input_args": {"text": "'WASHINGTON  —   For a fifth consecutive night, American warplanes and drones on Monday pummeled suspected Qaeda targets in Yemen as the Pentagon said an earlier attack in the country had killed a former prisoner held at the United States detention center at Guantánamo Bay, Cuba. Capt. Jeff Davis, a Pentagon spokesman, said an airstrike last Thursday  —   the first night of a larger Pentagon campaign to roll back gains made by Al Qaeda in the Arabian Peninsula, or A. Q. A. P.  —   killed the former detainee, who was using the name Yasir Ali Abdallah al Silmi. While at Guantánamo, he was held as Detainee No. 679 and went by the name Mohammed Tahar, according to military records. Including an airstrike overnight on Monday that Captain Davis said killed seven Qaeda fighters, the United States has conducted more than 40 attacks across central and southern Yemen in the past week. By comparison, the military carried out 41 strikes in all of 2012, the most in a single year against the Qaeda affiliate in Yemen. Soon after taking office, President Trump authorized the   air campaign against the Qaeda branch, one of the deadliest in the world, at the same time he approved the   Special Operations raid in January that left one member of Navy SEAL Team 6 dead and three others wounded. An estimated two dozen civilians were killed in that raid. “It’s a reflection of growing concern about the reconstitution of A. Q. A. P. in Yemen,” Gerald M. Feierstein, a former United States ambassador to Yemen who is now at the Middle East Institute in Washington, said of the flurry of airstrikes. “The key issue is how they identify targets, the fidelity of the intelligence, and the care they take to maintain the standard of near certainty on no collateral damage,” Mr. Feierstein said, referring to civilian casualties. “I don’t know the answer to those questions. ” The Senate Foreign Relations Committee has scheduled a hearing for Thursday on Yemen, the first since the raid in January. Mr. Tahar was imprisoned at Guantánamo Bay from 2002 to 2009. Because Yemen was in chaos at that time, officials were reluctant to repatriate detainees there. But Mr. Tahar was among a small group the Obama administration repatriated in December 2009 as part of an experiment. Later that month, however, after the attempted bombing of a   airliner by Al Qaeda’s Yemen branch, President Barack Obama halted further repatriations to Yemen. Years later, the Obama administration resettled many Yemenis in other countries. Military records show that Mr. Tahar’s brother, who went by the name Ali Abdullah Ahmed, was also a Guantánamo detainee. He was among three detainees who died in June 2006 in what the military said was a coordinated suicide. Captain Davis said that Usayd   whom he described as a “longtime explosives expert who served as the organization’s emir” within Abyan Province, was killed in the same March 2 strike as Mr. Tahar. Yemeni civilians in three provinces where Al Qaeda has strongholds described the American bombing campaign as unrelenting. For three days beginning Friday, American drones and attack planes extensively hit the rugged mountains and valleys in central Baydha Province, where Qaeda military camps have long existed outside the control of the weak central government in Sana, the capital, according to residents reached by phone. “They appear on the sky at nearly the same time and quickly launched heavy fire against Al Qaeda gatherings,” said Nayef, a resident who for security reasons preferred to be identified only by his first name. “The U. S. planes become more aggressive when Al Qaeda militants fire back,” he said. “We can see balls of fire on the sky when the Americans exchange fire with Al Qaeda. ” Abdul Aziz Awadh, a resident of Abyan Province in the south, the birthplace of Yemen’s president, Abdu Rabbu Mansour Hadi, said that an American drone struck a taxi carrying a number of Qaeda militants on Thursday afternoon. “The airstrike completely burned the car and killed at least four Al Qaeda,” he said. “We later learned that they came from Aden to Abyan. The U. S. drone chased them until they passed through a farm and hit them. ”'"}, "time": 1742563888.9185126}