{"duration": 0.4259614944458008, "input_args": {"text": "'The Anti-Empire Report #146 By William Blum – Published November 6th, 2016 L ouis XVI needed a revolution, Napoleon needed two historic military defeats, the Spanish Empire in the New World needed multiple revolutions, the Russian Czar needed a communist revolution, the Austro-Hungarian and Ottoman Empires needed World War I, Nazi Germany needed World War II, Imperial Japan needed two atomic bombs, the Portuguese Empire in Africa needed a military coup at home, the Soviet Empire needed Mikhail Gorbachev … What will the American Empire need? ABOVE: Nuremberg tribunal. A new one is in order to try most of the political leaders, CEOs, media barons and their prostitutes, and similar agents of domination, exploitation, endless war, and imperialism for the past 100 years. “I don’t believe anyone will consciously launch World War III. The situation now is more like the eve of World War I, when great powers were armed and ready to go when an incident set things off. Ever since Gorbachev naively ended the Cold War, the hugely over-armed United States has been actively surrounding Russia with weapons systems, aggressive military exercises, NATO expansion. At the same time, in recent years the demonization of Vladimir Putin has reached war propaganda levels. Russians have every reason to believe that the United States is preparing for war against them, and are certain to take defensive measures. This mixture of excessive military preparations and propaganda against an “evil enemy” make it very easy for some trivial incident to blow it all up.” – Diana Johnstone, author of “Queen of Chaos: The Misadventures of Hillary Clinton” ALL IN THE FAMILY Just pals, all of them, just pals. It’s all been such a joyful ride. Obviously neither Clinton, nor Obama, or Carter, find anything amiss in celebrating George W Bush, one of the worst criminals in modern history. (George W. Bush Presidential Library and Museum on the campus of Southern Methodist University in Dallas, Texas, April 25, 2013. Official White House Photo by Pete Souza) In September 2013 President Obama stood before the United Nations General Assembly and declared, “I believe America is exceptional.” The following year at the UN, the president classified Russia as one of the three threats to the world along with the Islamic State and the ebola virus. On March 9, 2015 President Barack Obama declared Venezuela “an unusual and extraordinary threat to the national security and foreign policy of the United States”. Vladimir Putin, speaking at the UN in 2015, addressing the United States re its foreign policy: “Do you realize what you have done?” Since the end of World War 2, the United States has: Attempted to overthrow more than 50 foreign governments, most of which were democratically-elected. Dropped bombs on the people of more than 30 countries. Attempted to assassinate more than 50 foreign leaders. Attempted to suppress a populist or nationalist movement in 20 countries. Grossly interfered in democratic elections in at least 30 countries.* Plus … although not easily quantified … has been more involved in the practice of torture than any other country in the world … for over a century … not just performing the actual torture, but teaching it, providing the manuals, and furnishing the equipment. *See chapter 18 of William Blum, “Rogue State: A Guide to the World’s Only Superpower” On October 28, 2016 Russia was voted off the UN Human Rights Council. At the same time Saudi Arabia won a second term, uncontested. Does anyone know George Orwell’s email address? A million refugees from Washington’s warfare are currently over-running Europe. They’re running from Afghanistan and Iraq; from Libya and Somalia; from Syria and Pakistan. Germany is taking in many Syrian refugees because of its World War Two guilt. What will the United States do in the future because of its guilt? But Americans are not raised to feel such guilt. “ The Plan is for the United States to rule the world. The overt theme is unilateralism, but it is ultimately a story of domination. It calls for the United States to maintain its overwhelming superiority and prevent new rivals from rising up to challenge it on the world stage. It calls for dominion over friends and enemies alike. It says not that the United States must be more powerful, or most powerful, but that it must be absolutely powerful.” Vice-President Dick Cheney – West Point lecture, June 2002 Two flew over the cuckoo’s nest: “We are, as a matter of empirical fact and undeniable history, the greatest force for good the world has ever known. … security and freedom for millions of people around the globe have depended on America’s military , economic, political, and diplomatic might.” – Dick Cheney and Liz Cheney, “Why the world needs a powerful America” (2015) State Department spokesperson Mark Toner: “Assad must go even if Syria goes with him.” Many of the moves the Obama administration has made in terms of its Cuba policy are in lockstep with Bill Clinton’s, as expressed in the recommendations of a 1999 task force report from the Council on Foreign Relations. The report asserted that “no change in policy should have the primary effect of consolidating, or appearing to legitimize, the political status quo on the island.” A successful American regime change operation in Syria would cut across definite interests of the Russian state. These include the likely use of Syria as a new pipeline route to bring gas from Qatar to the European market, thereby undercutting Gazprom, Russia’s largest corporation and biggest exporter. Assad’s refusal to consider such a route played no small role in Qatar’s pouring billions of dollars in arms and funds into the Syrian civil war on behalf of anti-Assad forces. “War with Russia will be nuclear. Washington has prepared for it. Washington has abandoned the ABM treaty, created what it thinks is an ABM shield, and changed its war doctrine to permit US nuclear first strike. All of this is obviously directed at Russia, and the Russian government knows it. How long will Russia sit there waiting for Washington’s first strike?” – Paul Craig Roberts, 2014 Iran signed the nuclear accords with the United States earlier this year by agreeing to stop what it never was doing. Any Iranian nuclear ambition, real or imagined, is of course a result of American hostility towards Iran, and not the other way around. If the European Union were an independent and rational government it would absolutely forbid any member country from stockpiling American nuclear weapons or hosting a US anti-ballistic missile site or any other military base anywhere close to Russia’s borders. Full Spectrum Dominance , a term the Pentagon loves to use to refer to total control of the planet: land, sea, air, space, outer space and cyberspace. Can you imagine any other country speaking this way? Henry Kissinger at the Paris Peace Talks, September 1970. “I refuse to believe that a little fourth rate power like North Vietnam does not have a breaking point.” In 2010, WikiLeaks released a cable sent to US embassies by then- Secretary of State Hillary Clinton. She wrote this: “Saudi Arabia remains a critical financial support for Al Qaeda, the Taliban, al Nusra and other terrorist groups … worldwide.” Surely this resulted in at least Washington’s much-favored weapon: sanctions of various kinds. It did not. US General Barry McCaffrey , April 2015: “Because so far NATO’s reaction to Putin’s aggression (sic) has been to send a handful of forces to the Baltics to demonstrate ‘resolve,’ which has only convinced Putin that the alliance is either unable or unwilling to fight. So we had better change his calculus pretty soon, and contest Putin’s stated doctrine that he is willing to intervene militarily in other countries to ‘protect’ Russia-speaking people. For God’s sake, the last time we heard that was just before Hitler invaded the Sudetenland.” No, my dear general, we heard that repeatedly in 1978 when the United States invaded the tiny nation of Grenada to protect and rescue hundreds of Americans who supposedly were in danger from the new leftist government. It was all a fraud, no more than an excuse to overthrow a government that didn’t believe that the American Empire was God’s gift to humanity. Since 1980, the United States has intervened in the affairs of fourteen Muslim countries, at worst invading or bombing them. They are (in chronological order) Iran, Libya, Lebanon, Kuwait, Iraq, Somalia, Bosnia, Saudi Arabia, Afghanistan, Sudan, Kosovo, Yemen, Pakistan, and now Syria. How our never-ending mideast horror began: Radio Address of George W. Bush, September 28, 2002: “The Iraqi regime possesses biological and chemical weapons, is rebuilding the facilities to make more and, according to the British government, could launch a biological or chemical attack in as little as 45 minutes after the order is given. The regime has long-standing and continuing ties to terrorist groups, and there are al Qaeda terrorists inside Iraq. This regime is seeking a nuclear bomb, and with fissile material could build one within a year.” Yet … just six weeks before 9/11, Condoleezza Rice told CNN: “Let’s remember that his [Saddam’s] country is divided, in effect. He does not control the northern part of his country. We are able to keep his arms from him. His military forces have not been rebuilt.” The fact is that there is more participation by the Cuban population in the running of their country than there is by the American population in the running of theirs. One important reason is the absence of the numerous private corporations which, in the United States, exert great influence over all aspects of life. “The U.S. is frantically surrounding China with military weapons, advanced aircraft, naval fleets and a multitude of military bases from Japan, South Korea and the Philippines through several nearby smaller Pacific islands to its new and enlarged base in Australia … The U.S. naval fleet, aircraft carriers and nuclear submarines patrol China’s nearby waters. Warplanes, surveillance planes, drones and spying satellites cover the skies, creating a symbolic darkness at noon.” (Jack A. Smith, “Hegemony Games: USA vs. PRC”, CounterPunch) Crimea had never voluntarily left Russia. The USSR’s leader Nikita Khrushchev, a native of the region, had donated Crimea to Ukraine in 1954. Crimeans were always strongly opposed to that change and voted overwhelmingly to rejoin Russia after the US-induced Ukrainian coup in 2014. Russian President Vladimir Putin refers to the Ukrainian army as “NATO’s foreign legion”, which does not pursue Ukraine’s national interests. The United States, however, insists on labeling the Russian action in Crimea as an invasion. Putin re Crimea/Ukraine: “Our western partners (sic) created the ‘Kosovo precedent’ with their own hands. In a situation absolutely the same as the one in Crimea they recognized Kosovo’s secession from Serbia legitimate while arguing that no permission from a country’s central authority for a unilateral declaration of independence is necessary… And the UN International Court of Justice agreed with those arguments. That’s what they said; that’s what they trumpeted all over the world and coerced everyone to accept – and now they are complaining about Crimea. Why is that?” Paul Craig Roberts: “The absurdity of it all! Even a moron knows that if Russia is going to put tanks and troops into Ukraine, Russia will put in enough to do the job. The war would be over in a few days if not in a few hours. As Putin himself said some months ago, if the Russian military enters Ukraine, the news will not be the fate of Donetsk or Mauriupol, but the fall of Kiev and Lviv.” In a major examination of US policy vis-à-vis China, published in March 2015, the authoritative Council on Foreign Relations bluntly declared that “there is no real prospect of building fundamental trust, ‘peaceful coexistence,’ ‘mutual understanding,’ a strategic partnership, or a ‘new type of major country relations’ between the United States and China.” The United States, the report declares, must, therefore, develop “the political will” and military capabilities “to deal with China to protect vital U.S. interests.” “John F. Kennedy changed the mission of the Latin American military from ‘hemispheric defense’ – an outdated relic of World War II – to ‘internal security,’ which means war against the domestic population.” – Noam Chomsky Cuban baseball players who are paid a million dollars to play for an American team are not “defectors”, a word which has a clear political connotation. Boris Yeltsin was acceptable to American and Europeans because he was seen as a weak, pliable figure that allowed Western capital free rein in the newly opened Russian territory following the collapse of the Soviet Union. Yeltsin’s era was also a time of rampant corruption by Russian oligarchs who were closely associated with Western capital. That corrosive culture came to a halt with the election of Vladimir Putin twice as president between 2000-2008, and again in 2012. Many ISIS leaders were former Iraqi military officers who were imprisoned by American troops. The fight isn’t against ISIS, it’s against Assad; at the next level it isn’t against Assad, it’s against Putin; then, at the next level, it isn’t against Putin, it’s against the country most likely to stand in the way of US world domination, Russia. And it’s forever. Connecting to the US-based Internet would mean channeling all of Cuba’s communications directly to the NSA. George W. Bush has been living a comparatively quiet life in Texas, with a focus on his paintings. “I’m trying to leave something behind”, he said a couple of years ago. Yeah, right, George. We can stand up some of the paintings against the large piles of Iraqi dead bodies. Seymour Hirsch: “America would be much better off, if, 30 years ago, we had let Russia continue its war in Afghanistan … The mistake was made by the Carter administration which was trying to stop the Russians from their invasion (sic) of Afghanistan. We’d be better off had we let the Russians beat the Taliban.” ( Deutsche Welle , April 2, 2014 interview) We’d be even better off if we hadn’t overthrown the progressive, secular Afghan government, giving rise to the Taliban in the first place and inciting the Russians to intervene on their border lest the Soviet Islamic population was stirred up. The former Secretary of State Madeleine Albright in an interview in 1998 summed up exactly what the US thinks of the UN: “The UN plays a very important role. But if we don’t like it, we always have the option of following our own national security interests, which I assure you we will do if we don’t like what’s going on.” She is now a foreign-policy advisor to Hillary Clinton. “A leader taking his (or her) nation to war is as dysfunctional in the family of humankind as an abusive parent is in an individual family.” – Suey Kane “It would be some time before I fully realized that the United States sees little need for diplomacy. Power is enough. Only the weak rely on diplomacy … The Roman Empire had no need for diplomacy. Nor does the United States.” – Boutros Boutros-Ghali , Secretary-General of the United Nations from January 1992 to December 1996 “Interventions are not against dictators but against those who try to distribute: not against Jiménez in Venezuela but Chávez, not against Somoza in Nicaragua but the Sandinistas, not against Batista in Cuba but Castro, not against Pinochet in Chile but Allende, not against Guatemala dictators but Arbenz, not against the shah in Iran but Mossadegh, etc.” – Johan Galtung, Norwegian, principal founder of the discipline of peace and conflict studies “No mention was made that Iraq’s Christians had been safe and sound under President Saddam Hussein – even privileged – until President George Bush invaded and destroyed Iraq. We can expect the same fate for Syria’s Christians if the protection of the Assad regime is torn away by the US-engineered uprising. We will then shed crocodile tears for Syria’s Christians.” – Eric Margolis, 2014 “Jewish Power is the capacity to silence the debate on Jewish Power.” – Gilad Atzmon “We need a trial to judge all those who bear significant responsibility for the past century – the most murderous and ecologically destructive in human history. We could call it the war, air and fiscal crimes tribunal and we could put politicians and CEOs and major media owners in the dock with earphones like Eichmann and make them listen to the evidence of how they killed millions of people and almost murdered the planet and made most of us far more miserable than we needed to be. Of course, we wouldn’t have time to go after them one by one. We’d have to lump Wall Street investment bankers in one trial, the Council on Foreign Relations in another, and any remaining Harvard Business School or Yale Law graduates in a third. We don’t need this for retribution, only for edification. So there would be no capital punishment, but rather banishment to an overseas Nike factory with a vow of perpetual silence.” – Sam Smith “I have come to think of the export of ‘democracy’ as the contemporary equivalent of what missionaries have always done in the interest of conquering and occupying the ‘uncivilized’ world on behalf of the powers that be. I have said that the ‘church’ invented the concept of conversion by any means, including torture and killing of course, as doing the victims a big favor, since it was in the interest of ‘saving’ their immortal souls. It is now called, ‘democratization’.” – Rita Corriel “It is more or less impossible to commemorate the war dead without glorifying them, and it is impossible to glorify them without glorifying their wars.” – Paul Craig Roberts Any part of this report may be disseminated without permission, provided attribution to William Blum as author and a link to williamblum.org is provided. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE ABOUT THE AUTHOR Veteran political analyst and foreign policy critic Bill Blum is the author of Rogue State, among other books. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742563208.8239386}