{"duration": 0.03751873970031738, "input_args": {"text": "'Print version Font Size On Wednesday, October 26, Russian President Vladimir Putin took part in the plenary session of \"Forum for Action. Crimea\" in Yalta. Putin paid special attention to urgent problems for residents of the peninsula.The forum is organized by the All-Russian People\\'s Front with over 300 people participating - People\\'s Front activists, federal and regional experts, representatives of executive authorities and journalists.Putin reminded that the People\\'s Front was the first public association to have started working in the Crimea after the referendum on the status of the peninsula. A lot has been done since then, but there is even more to do, the Russian president said. According to Putin, one needs to focus on sensitive issues in the first place. It goes about such issues as the modernization of social infrastructure, transport sector update and creation of new jobs.\"I hope that activists of the People\\'s Front will continue their work to monitor and analyze most pressing problems that the people of the Crimea worry about most,\" said Putin. Previous forums (\"Forum for Action\" took place in Stavropol and Yoshkar-Ola this year - ed.) have shown that such events provide an opportunity not only to exchange views, but also to find ways to solve problems.Putin spoke about the measures to overcome attempts to blockade the peninsula .According to him, the issues of energy and water blockade of the peninsula have been solved and removed from the agenda within the shortest period of time possible. The construction of the transport passage across the Kerch Strait continues according to schedule, the president added. \"I hope that all approaches to the bridge and all the necessary infrastructure will be ready on time and with quality,\" he added.In the future, the Crimean bridge will allow to transport up to 14 million travelers and 13 million vehicles a year.Those who try to blockade the Crimea are \"amazing idiots,\" Putin said. \"Did they think that the people would kneel and beg in front of them? Amazing idiots,\" Putin said. \"With regard to the termination of water or electricity supplies - all this stands on the verge of a crime against humanity. Let\\'s take a sufficiently large region with many millions of people living in it - 2.6 million people live in the Crimea - and cut the region from water and electricity supplies in winter,\" the president said. \"It appears that our human rights organizations have swallowed their tongues and sown up their mouths and do not say a word, but as a matter of fact, it goes about a serious crime,\" Putin stressed out. Putin stressed out the importance of the process of the rehabilitation of Crimea\\'s indigenous people. The federal program of development of the peninsula will assign ten billion rubles for the purpose. \"First of all, we are talking about the socio-economic support, because political issues have been resolved. It goes about language, culture and education in people\\'s mother tongue,\" Putin said.The president noted that many villages of the Crimean Tatars remain in a deplorable state and lack even essential merits of civilization, such as electricity and roads. This resource, the president said, is limited and would only embrace the indigenous peoples who live on the peninsula at the moment.\"Any funds allocated by either the Russian Federation or a republic, or by Sebastopol should be kept under public control,\" the president said.Vladimir Putin has the right to visit any Russian regions, including the Crimea, official spokesman for the Russian president, Dmitry Peskov, said commenting on a note of protest from Kiev. Ukraine sent a note of protest to Moscow in connection with Vladimir Putin\\'s visit to the Crimea. \"Ukraine traditionally protests, as we traditionally do not take these protests into account. The President visits the regions of the Russian Federation that he considers necessary to visit. This is an internal affair of Russia, and it does not concern any other state, including Ukraine,\" Peskov added. According to the Ukrainian Foreign Ministry, the visits of Russian top officials to the Crimea demonstrate Russia\\'s disregard of the state sovereignty of Ukraine. The Crimea became part of Russia as a result of the referendum held on March 16, 2014. According to the electoral commission, 95% of the population of the Crimea voted to reunite with the Russian Federation. Anton Kulikov'"}, "time": 1742628596.3547115}