{"duration": 0.050992488861083984, "input_args": {"text": "'By Wes Williams Election 2016 , Miscellaneous , Politics , Videos October 28, 2016 ‘I Could Sue You’: Trump’s Spokeswoman Slanders Angela Rye On Live TV – Gets Epic Smack Down (VIDEO)   \\nOver the past few months, the on-air battles at CNN between Trump’s dumb-as-a-stump surrogate Katrina Pierson and liberal commentator Angela Rye have become legendary. On Friday morning the two put on the gloves to go another round. \\nThe conversation starts out innocently enough, with a discussion about new economic numbers that show the economy is growing and getting stronger. Great news for Americans — except those like Donald Trump, who are looking to benefit politically from the lie that record numbers of people are suffering. Then host Carol Costello plays a clip of Trump telling an Ohio rally that he wants to do something about the inner city “ghettos.” She observes to Pierson that many black Americans would observe that Trump is not looking at “the whole of the black population.” \\nPierson responds that some members of the black community have been consulting with Trump about the problem. The look on Rye’s face when she says that is classic. When she gets a chance to respond, she says, \\n“I think it’s really important that when we have conversations like this they’re rooted in facts. Let’s talk about what Donald Trump could be saying to black people that would resonate and be based in truth.” \\nRye goes on to explain how people like Trump, who have access to capital, don’t seem to appreciate that everyone can’t get their hands on money to improve their lives. Then she talks about Trump’s history as a real estate mogul, who has actually contributed to the creation of the “ghettos” which he now says he wants to fix. \\nPierson responds that Trump has worked with members of the black community, including Jesse Jackson, to help members of the black community create and build businesses. That promotes a hearty laugh from Rye. Costello notes that Rye was a former director of the Congressional Black Caucus, as she asks her to respond. Pierson cuts in, remarking “And [she] ran it [the CBC] into the ground.” At that point, the two women drop all pretense of liking each other and the battle is on. Rye unloads on Pierson with a barrage of facts that her poor little Trump-addled brain was probably having difficulty processing. And when Costello tries to rein her in, Rye hits Pierson with a comment right out of Trump’s playbook. Referring to the charge she “ran the CBC into the ground,” Rye says: \\n“That’s slander. I could sue you, Katrina!” \\nHere’s the latest round in the Rye-Pierson war of words, via YouTube: \\nFeatured image via screen capture Share this Article!'"}, "time": 1742562082.8287227}