{"duration": 0.06005144119262695, "input_args": {"text": "'Research could ‘potentially serve as a curative approach for patients with HIV’, scientist says \\n\\nScientists have managed to remove DNA of the HIV virus from living tissue for the first time in a breakthrough that could lead to an outright cure.\\n\\nAt the moment, treating the disease involves the use of drugs that suppress levels of the virus so the body’s immune system can cope.\\n\\nNow researchers in the US have revealed they used gene-editing technology to remove DNA of the commonest HIV-1 strain from several organs of infected mice and rats.\\n\\n\\nIn April, the same team reported that they had successfully eliminated the virus from human cells in the laboratory, but a paper in the journal Nature Gene Editing revealed they had managed to do the same thing in live animals for the first time.\\n\\nThe researchers’ team leader, Professor Kamel Khalili, of Temple University, said: “In a proof-of-concept study, we show[ed] that our gene-editing technology can be effectively delivered to many organs of two small animal models and excise large fragments of viral DNA from the host cell genome.”\\n\\nThe current antiretroviral drugs for HIV are not able to eliminate HIV-1 from the infected cells.\\n\\nAnd if treatment is interrupted, the virus can start replicating quickly, putting patients of risk of getting full-blow AIDS. \\nThis is because it is able to persist in immune system T-cells and other places where it is not actually active and is unaffected by the current treatments. \\n\\nThe researchers used a specially adapted virus to deliver the gene-editing system into the cells.\\n“The ability of the rAAV delivery system to enter many organs containing the HIV-1 genome and edit the viral DNA is an important indication that this strategy can also overcome viral reactivation from latently infected cells and potentially serve as a curative approach for patients with HIV,” Professor Khalili said. In a statement, Temple University said the implications of the new study were “far-reaching”.\\n“The gene-editing platform by itself may be able to eradicate HIV-1 DNA from patients, but it is also highly flexible and potentially could be used in combination with existing antiretroviral drugs to further suppress viral RNA. It also could be adapted to target mutated strains of HIV-1,” it added. Professor Khalili said a clinical trial could happen within the next few years, but he first planned to carry out a similar study involving a larger group of animals.\\n\\nTMZ Breaking \\nSOURCE '"}, "time": 1742563953.1668854}