{"duration": 0.06421422958374023, "input_args": {"text": "'Leaders from 60 national and state   groups are calling for a swift confirmation of Judge Neil Gorsuch to the U. S. Supreme Court. [In a letter to the U. S. Senate Monday, the leaders say:  Judge Gorsuch is widely recognized as a jurist possessed of deep intelligence and true fairmindedness. In 2006 the U. S. Senate recognized these qualities, confirming Gorsuch without dissent to his current position on the 10th Circuit. After a decade of constitutionally sound and clearly written rulings and opinions, Judge Gorsuch deserves once again the swift approval of the Senate. The leaders observe Gorsuch “has consistently applied an originalist approach to the Constitution, and a respect for the separation of powers, reminiscent of the late Justice Antonin Scalia. ” They continue: Many of our organizations applauded Judge Gorsuch when he evinced a keen understanding and respect for religious liberty in cases involving Hobby Lobby and the Little Sisters of the Poor, concluding that application of the Affordable Care Act’s preventive service mandate, coupled with massive fines on religious objectors to elements of the mandate, substantially burdens religious liberty. The letter was organized by the Susan B. Anthony List and signed by members of the   Court Coalition which has been working at the grassroots level  —   both online and on the ground  —   in support of Gorsuch. One of the signers, Father Frank Pavone, national director of Priests for Life, said in a statement, “The last election was, more than any other single issue, about the Supreme Court. ” “The American people voted to have Donald Trump select the next justice and he has made an excellent choice,” Pavone explained. “Today should begin a swift confirmation process for Judge Neil Gorsuch, whom everyone agrees is eminently qualified. ” Senate Judiciary Committee hearings began Monday on Gorsuch’s confirmation. Gorsuch himself delivered a statement during the initial hearing. #Gorsuch: I want to thank my fellow judges across the country  …     Their work helps make real the Constitution and laws of the US for all of us. pic. twitter.   —   Fox News (@FoxNews) March 20, 2017,  Planned Parenthood president Cecile Richards said Gorsuch “has a disturbing history” on abortion rights and women’s issues. . @CecileRichards: Judge Gorsuch has a disturbing history on access to family planning. WATCH: https:  .  #WeObject,  —   Planned Parenthood (@PPact) March 20, 2017,  “Judge Gorsuch will be an excellent addition to the Supreme Court, which desperately needs his sound judgment and vast experience,” Pavone said, nevertheless. “The Senate should act quickly to approve him. ”'"}, "time": 1742561787.2283194}