{"duration": 0.1725013256072998, "input_args": {"text": "'When Gov. Mike Pence of Indiana was in college, he found himself admiring a gold cross hanging from the neck of his fraternity “big brother. ” The response he received left such a powerful impression that he would recall it decades later on the floor of Congress. “Remember, Mike, you have got to wear it in your heart before you wear it around your neck,” Mr. Pence said his fraternity brother told him. Soon after this exchange, at a Christian music festival in Kentucky, Mr. Pence took a very different sort of pledge from the one he had taken to join Phi Gamma Delta. “I gave my life to Jesus Christ,” he recalled years later, “and that’s changed everything. ” It was a decision that would redefine Mr. Pence, setting him on the path to becoming an evangelical Christian and one of the country’s most outwardly religious and socially conservative legislators. But it also caused him to break with two institutions that had been central to the Pence family: the Roman Catholic Church and the Democratic Party. Mr. Pence, 57, who accepted the Republican nomination for vice president on Wednesday night, is the only one of six Pence siblings who is no longer part of the Catholic Church. Though the family remains close, his embrace of evangelical Christianity was long a source of disappointment to his mother, according to the Rev. Clement T. Davis, the priest at the church in Columbus, Ind. where Mr. Pence was baptized. The family’s Irish Catholic roots run deep. Mr. Pence’s maternal grandfather, with whom he was especially close, came to America in 1923 from Ireland and settled in Chicago, where he eventually became a bus driver. The family idolized John F. Kennedy, the nation’s first   president. As a teenager, Mike Pence was the youth coordinator for the Bartholomew County Democrats. All four of the Pence brothers were altar boys at their church, St. Columba, and attended its parochial school. They were at church six days a week, sometimes seven, if they were serving Saturday Mass. Even after they all went off to college, the church would call the Pence house during vacations or over the summer when it was in need of an altar boy. “Our life revolved around the church,” Gregory Pence, one of Mr. Pence’s two older brothers, said in an interview, adding that he still went to morning Mass there a few times a week with his mother. But at Hanover College, a small   college in Indiana near the banks of the Ohio River, Mr. Pence came to feel that something was missing from his spiritual life. The Catholicism of his youth, with its formality and rituals, had not given him the intimacy with God that he now found himself craving. “I began to meet young men and women who talked about having a personal relationship with Jesus Christ,” he said years later in an interview with the Christian Broadcasting Network. “That had not been a part of my experience. ” Still, it was not easy for him to leave behind the church in which he had been raised. After graduation, he worked as a Catholic youth minister and even considered becoming a priest. He described himself for years as “an evangelical Catholic. ” Friends say he wrestled with how to square his religious past and his religious future. “He was part of a movement of people, I’ll call it, who had grown up Catholic and still loved many things about the Catholic Church, but also really loved the concept of having a very personal relationship with Christ,” said Patricia Bailey, who became close to Mr. Pence when she and her husband, Mark, worked with him at a law firm in Indianapolis in the  . Mr. Pence’s wife, Karen, was also part of that movement. They met when he was in law school at Indiana University. After they started dating, she bought a gold cross with the word “Yes” engraved on it, and kept it in her purse until he proposed. “She’s been very much a part of his faith journey,” said Mark Bailey, who often started his day by praying with Mr. Pence in one of their offices at the law firm. “He would refer to his wife as the prayer warrior of the family. ” By the   Mr. Pence and his wife were attending an evangelical church in Indianapolis. Years later, the break from Catholicism still stung his mother, Nancy, according to Father Davis, who has been the priest at her church, now called St. Bartholomew, since 1997 and has grown close to her. “You could see Nancy just shake her head about it,” Father Davis said inside the rectory before Mass on Saturday. “She was disappointed. She had hoped he could find his way back to the church. ” Others in Columbus who knew the Pence family were also surprised. “They were just known as such a big Catholic family,” said Janie Gordon, a friend of Mr. Pence’s from high school. Mr. Pence’s mother declined to comment. The governor also declined to be interviewed about his conversion, but he authorized his brother to speak about his family’s faith. As Mr. Pence’s faith was changing, so were his politics. He voted for Jimmy Carter in 1980 but soon gravitated to Ronald Reagan, and to the Republican Party’s staunch opposition to abortion. His evangelical Christianity is now the driving force behind his political agenda, whether he is working to deny federal funds to Planned Parenthood or to make it legal for religious conservatives to refuse to serve gay couples. “I sign this law with a prayer that God would continue to bless these precious children, mothers and families,” he said in March, putting his pen to a sweeping abortion bill prohibiting a woman from aborting a fetus because it has a disability such as Down syndrome. (A federal judge blocked the law last month.) “Pence doesn’t simply wear his faith on his sleeve, he wears the entire Jesus jersey,” Brian Howey, a political columnist in Indiana, once put it. During Mr. Pence’s days on Capitol Hill, he would not attend events without his wife if alcohol was being served. Fellow representatives sometimes joked about the need to clean up their language when he appeared. Mr. Pence would not even engage in attack ads, having sworn off negative campaigning after running a particularly nasty and unsuccessful congressional race earlier in his political career. “Christ Jesus came to save sinners, among whom I am foremost of all,” he wrote after the election, quoting a line from Scripture. When Mr. Pence was in a tight race for governor in 2012, his media strategist, Rex Elsass, invoked a different line from the Bible in an effort to persuade him that attacks from his Democratic opponent justified a direct and forceful response, as long as it was truthful, Mr. Elsass recalled. Mr. Pence refused. In recent days, however, he has not hesitated to hammer Hillary Clinton, the presumptive Democratic nominee: He has called her “corrupt Hillary,” mimicking Donald J. Trump’s label “crooked Hillary. ” When Mr. Pence returned to his alma mater in 2008 to deliver a commencement address, his speech built toward what he considered to be the most profound experience of his college career. “There was one other person I met during my years here who changed my life more than all the friends and family combined,” he said, referring to Jesus Christ. “Thirty years ago this spring, I embraced the truth,” he continued, before quoting a verse from Scripture. Today, Mr. Pence and his wife often worship at College Park Church, an evangelical megachurch in Indianapolis with three huge video screens, colored spotlights and Christian bands. On Sunday, the day after Mr. Trump formally introduced Mr. Pence as his running mate in Midtown Manhattan, they sat in the balcony of the   auditorium there, standing and clapping in rhythm with the music. Several church members talked about their experiences of deepening their faith in God. There was no talk of Mr. Pence or the election, but one song, its lyrics flashing across the big screens, encouraged the faithful: “Set your church on fire, win this nation back. ” It was a far cry from the wooden pews and kneelers of St. Columba, the austere Catholic church of Mr. Pence’s youth. Gregory Pence said he did not see his brother’s turn to evangelical Christianity as a rejection of their Catholicisim, but rather as a reflection of the fact that he had different spiritual needs. The two of them still pray together, just not usually in church. Indeed, Gregory said that when his brother called after learning that Mr. Trump had chosen him as his running mate, they wept and swapped verses from Scripture. (“Well done, my good and faithful servant,” Gregory Pence told his brother.) He declined to say whether he had been supporting Mr. Trump before his brother joined the ticket. But asked if he thought his brother might have had some doubts about signing on with a man whose résumé includes three wives and a casino empire, and who liberally invokes coarse language and imagery, he answered without hesitation. “Judge not lest ye be judged,” he said.'"}, "time": 1742562224.4915342}