{"duration": 0.03367209434509277, "input_args": {"text": "'A Florida man has been charged with murder after strangling his wife during an argument and then posting messages on her Facebook page under her name to try to fool her friends and family about her absence, the police said. The man, George J. McShane Jr. was trying to “convince her friends and family she was still alive,” according to the Orlando Police Department. Mr. McShane, 42, who a police report said worked at a resort, was arrested on Jan. 11 and charged with   murder and battery by strangulation in the death of Kristen McShane, 30, the police said. For several days this month, Ms. McShane’s Facebook page was updated with cheerful photographs documenting her life in Florida: a portrait of her smiling in front of an easel, paint brush in hand and another of her enjoying an outing with friends. On Jan. 7, a Facebook message informed friends and relatives why she had not been in touch: “I can’t believe I dropped my phone in the toilet. I am such an idiot. Message me here, til I can get it fixed. ” Friends replied with advice (“Put it in rice”) or with offers to lend her a phone. This week, the police in Orlando, where the McShanes lived, revealed that the author of some of those messages was not Ms. McShane, who was 30, but her husband. Mr. McShane posted the Facebook message about her phone so that others would not become alarmed because she “was not returning their phone calls or text messages,” the police said. Officers were called to the house on Jan. 10 by a relative of the couple who had been concerned about them, according to a police affidavit. They found Mr. McShane sitting in his car in the garage with the engine running. Then they found Ms. McShane’s body in a bedroom. The authorities said Mr. McShane told them that he had “lost his temper and jumped on Kristen, using his two hands to choke her until he realized she was dead. ” The reason for the argument was not available on Friday. Mr. McShane had not yet been arraigned on Friday, a court official said in an email, but appeared in court on Jan. 11 to hear the charges, court records showed. Robert Larr, a public defender assigned to Mr. McShane, declined to comment on the case on Friday. The Florida murder case is the latest example of someone assuming the social media identity of another person to deflect suspicion from family and friends after a crime. In December, Shanna Golyar of Iowa was arrested and charged with murder in the 2012 killing of Cari Farver of Nebraska, the Omaha police said. Ms. Golyar had posted messages on Ms. Farver’s Facebook account posing as the victim, a Douglas County prosecutor said on Friday. In October, the Facebook pages of a missing South Carolina couple suddenly became active with updates that family and friends did not believe were written by them. Todd C. Kohlhepp, 45, was later charged with murder in the death of the man and with kidnapping the woman, who had been held chained in a container, the police said. In the Orlando case, Ms. McShane’s Facebook page was updated on Jan. 7 with a photograph showing her next to a man at a social event. “Who’s your friend?” someone wrote. “That’s my new guy,” came the reply in the comments section under Ms. McShane’s name. Another post the same day described her dropping her phone in the toilet. Both posts appeared after 3:30 a. m. that day  —   the time that Mr. McShane told the police the couple had started to argue, according to the police. Her Facebook profile was updated twice again on Jan. 8 with posts showing a photo of her painting and another image including the sleeping face of a little girl, apparently the couple’s daughter. By Jan. 11, after Mr. McShane’s arrest, there were only condolence messages.'"}, "time": 1742628524.1524622}