{"duration": 0.12639975547790527, "input_args": {"text": "'THERE’S something about pop culture that loves a coupling. Kim and Kanye. Brad and Angelina. Bill and Hillary. Batman and Robin. An exhibition at the Folger Shakespeare Library in Washington is adding a twist to the formula, and contemplating the enduring star power of another dynamic duo: Will and Jane. That’s Jane Austen, you rattlepate. True, she and William Shakespeare never met in person (outside the kinkier reaches of fan fiction, that is). But their parallel cultural afterlives illuminate the process by which some great authors are transformed into icons, beloved almost as much for their imagined personalities and our feelings of intimacy with them as for anything they wrote. That, at least, is the argument made by “Will  Jane: Shakespeare, Austen, and the Cult of Celebrity,” a cheeky assemblage of the sometimes exuberantly goofy material objects that centuries of fandom have left behind. The show, which opens on Saturday, is the first Folger exhibition to pair Shakespeare with another writer, and the first to dig deep into some of the odder artifacts  —   antique bellows carved with Will’s face, anyone?  —   in its vaults, which are better known for treasures like 82 First Folios. They are shown alongside Austenalia sourced from all over, ranging from personal objects on loan from Jane Austen’s House Museum in Chawton, England, to modern tchotchkes more redolent of eBay.   Shakespeareans may blanch at seeing Will and Jane bobbleheads on the exhibition poster  —   to say nothing of the prospect of   Janeites flocking to the Folger’s hushed   halls to swoon over the shirt worn (wet) by Colin Firth in his indelible turn as Mr. Darcy in the 1995 BBC adaptation of “Pride and Prejudice. ” But the global   sparked by that production, the show argues, has a striking parallel in the wave of Bardolatry kicked off by the 1769 Shakespeare Jubilee, which created Shakespeare as a symbol of Englishness, and inspired its share of souvenir mugs and other kitschy tributes. “Shakespeare was almost a kind of cheesy   phenomenon in the 18th century,” said Janine Barchas, an Austen expert at the University of Texas who curated the show with Kristina Straub, a Shakespeare scholar at Carnegie Mellon University. “When you look at how his reputation was formed, and then grew,” she continued, “it’s very similar to what we’re seeing with Austen now, and the way that pop culture creates a foundation for high culture. ” The   cookie cutters in one display case may lack a patina of age. But they are not, Ms. Straub added, inherently more absurd or less   than an   mug bearing Shakespeare’s portrait  —   or, for that matter, a bundle of   wood gathered at Shakespeare’s Birthplace in    reputed to be remnants of a chair he may have sat on. “At the end of the day, they’re just sticks,” Ms. Straub said. “But they’re also being treasured in a vault, taking up valuable real estate. It should make you laugh, but it also tells you something about the nature of celebrity that you need to take seriously. ” The exhibition was born out of a rather unserious conversation four years ago over a breakfast burrito. Michael Witmore, the Folger’s director, was in Austin, Tex. for a conference, and caught up with Ms. Barchas, who teased him about the fact that “my author is really giving your author a run for his money,” as she recalled it. After a rambling debate they hit,   on a loose concept. “What if these two people were lovable roommates, like Will  Grace, or Laverne  Shirley?” Witmore recalled. “It really just started with the title. There was absolutely no scholarly thinking. ” The resulting show, which arrives during the 400th anniversary of Shakespeare’s death and a year ahead of the 200th anniversary of Austen’s, mixes deep scholarship with serious whimsy. It does not tell a linear story but instead groups its artifacts thematically, taking care to keep the two writers alongside each other. Even beyond sheer literary genius, the curators argue, Shakespeare and Austen have a lot in common  —   starting with their scantily recorded intimate lives, which leave tantalizing holes to fill. One display tracks the way devotees of both authors, who were captured in only a handful of portraits, improved their images. (The likeness of Austen that will appear next year on the British   note is based on a Victorian portrait commissioned by the family in 1869, more than 50 years after Austen’s death, to prettify a casual sketch made by her sister, Cassandra.) Fans have also tended to prettify their love lives with embellished or invented romances, whether a forged love letter from Shakespeare to his wife, Anne Hathaway, that was created in the 1790s, or films like “Shakespeare in Love” or “Becoming Jane,” which depicts Austen’s falling in doomed love with a penniless lawyer, only to end up pursuing the lonely creative life. The show also examines how both authors’ names have been used in marketing, whether on a signboard for the Shakespeare’s Head tavern, from the   or   century, or an empty shoe box from a 1970s line of women’s footwear named, for obscure reasons, Jane Austen. “That one sort of broke my heart,” Ms. Straub said of the box, among several items on loan from Goucher College, a major American repository of Austenalia. “It’s just a plain cardboard shoe box. ” “The Shirt,” as the label calls Mr. Firth’s chemise, may appear just to be a shirt. But the announcement in March that the Folger had secured it drew palpitating headlines around the world. (A satirical “tour rider” published in The New Yorker spelled out the   garment’s contractual demands, including: “Selfies with THE SHIRT shall only be granted to persons who read actual works by Jane Austen, not just books about people who enjoy Austen books. ”) The Shirt is displayed near a series of homages, like a photographic   featuring Benedict Cumberbatch, and as a parallel Shakespearean example, a series of   porcelains showing famous actors as Richard III. Repetition “is a powerful reinforcing mechanism of celebrity,” a display text explains. “The cultural value of an image increases the more it is copied. ” Literary celebrity is also reinforced by brushes with other forms of fame. Consider the case of Austen’s turquoise ring, which became a cause célèbre after the American singer Kelly Clarkson bought it at auction, prompting the British culture minister to declare it a national treasure that could not be exported. Jane Austen’s House Museum, which now owns the ring, declined to lend it to the Folger, forcing the exhibition to make do with a gold copy. But it did send a collection of domestic objects discovered under the house’s floorboards, including a nail and a clay pipe. It also sent a framed lock of Austen’s hair, now displayed alongside a single strand of auburn hair attributed to Shakespeare, which first surfaced for sale in the early 19th century. “We didn’t’ have it ” Ms. Barchas said jokingly. “We didn’t want to dispel the myth. ” The show doesn’t entirely neglect more traditional literary artifacts. There are Shakespeare and Austen volumes owned by famous people, like James Joyce’s   copy of “As You Like It” and the actor Stephen Fry’s student paperback of “Mansfield Park,” complete with “strange annotations, circa 1977,” as an inscription explains. A display called “The End?” looks at the way some admirers seek total communion, even in death. The curators quote a letter from the director of Jane Austen’s House Museum, who in 2008 implored Janeites not to direct their heirs to scatter their ashes on the grounds. “It is distressing for visitors,” she noted, “to see mounds of human ash. ” But the Folger itself is a mausoleum. As the show notes, the ashes of Henry Clay Folger and Emily Folger, the library’s founders, are interred in the nearby reading room behind a plaque paying tribute to “the glory of William Shakespeare and the greater glory of God. ” “With that kind of idolatry, your first instinct may be to snicker,” Ms. Barchas said. “But then you have to stop and think seriously about what it is that you yourself love about literature. ”'"}, "time": 1742563323.0069888}