{"duration": 0.06899666786193848, "input_args": {"text": "'MANILA  —   President Rodrigo Duterte of the Philippines said on Saturday that   Donald J. Trump had endorsed his brutal antidrug campaign, telling Mr. Duterte that the Philippines was conducting it “the right way. ” Mr. Duterte, who spoke with Mr. Trump by telephone on Friday, said Mr. Trump was “quite sensitive” to “our worry about drugs. ” “He wishes me well, too, in my campaign, and he said that, well, we are doing it as a sovereign nation, the right way,” Mr. Duterte said. There was no immediate response from Mr. Trump to Mr. Duterte’s description of the phone call, and his transition team could not be reached for comment. Since his election last month, Mr. Trump has held a series of unscripted calls with foreign leaders, several of which have broken radically from past American policies and diplomatic practice. A call on Friday with the president of Taiwan, Tsai   appeared to be out of sync with four decades of United States policy toward China and prompted a Chinese call to the White House. Mr. Duterte has led a campaign against drug abuse in which he has encouraged the police and others to kill people they suspect of using or selling drugs. Since he took office in June, more than 2, 000 people have been killed by the police in what officers describe as drug raids, and the police say several hundred more have been killed by vigilantes. The program has been condemned by the United States, the United Nations, the European Union and others for what rights organizations have characterized as extrajudicial killings. In rejecting such criticism from the United States this fall, Mr. Duterte called Mr. Obama a “son of a whore. ” In a summary of the phone call with Mr. Trump released by Mr. Duterte’s office on Saturday morning, Mr. Duterte said the two had spoken for just a few minutes but covered many topics, including the antidrug campaign. “I could sense a good rapport, an animated   Trump,” Mr. Duterte said. “And he was wishing me success in my campaign against the drug problem. ” Mr. Duterte added: “He understood the way we are handling it, and I said that there’s nothing wrong in protecting a country. It was a bit very encouraging in the sense that I supposed that what he really wanted to say was that we would be the last to interfere in the affairs of your own country. ” Mr. Duterte, who has said he was seeking “a separation” from the United States, a longtime ally, and has threatened to bar American troops from his country, also said, “We assured him of our ties with America. ” He did not elaborate on that comment. Mr. Duterte also said that Mr. Trump had invited him to visit New York and Washington, and that Mr. Trump said he wanted to attend the summit meeting of the Association of Southeast Asian Nations next year in the Philippines. Mr. Duterte has often been compared to Mr. Trump for his blunt speech and populist positions. “I appreciate the response that I got from   Trump, and I would like to wish him success,” Mr. Duterte said. “He will be a good president for the United States of America. ”'"}, "time": 1742564152.2511451}