{"duration": 0.07239508628845215, "input_args": {"text": "'We Are Change \\nOne day after Julian Assange officially revealed for the first time that the source of hacked Podesta and DNC emails in Wikileaks’ possession is not Russia, in the second excerpt from the John Pilger Special, to be broadcast by RT on Saturday Julian Assange accuses Hillary Clinton of misleading Americans about the true scope of Islamic State’s support from Washington’s Middle East allies.\\nAs previously reported, in an August 17, 2014 email made public WikiLeaks last month, Hillary Clinton, who had served as secretary of state until the year before, urges John Podesta, then an advisor to Barack Obama, to “bring pressure” on Qatar and Saudi Arabia, “which are providing clandestine financial and logistic support to ISIS and other radical Sunni groups.”\\n“I think this is the most significant email in the whole collection,” Assange, whose whistle-blowing site released three tranches of Clinton-related emails over the past year, told Pilger in the interview.\\n“All serious analysts know, and even the US government has agreed, that some Saudi figures have been supporting ISIS and funding ISIS, but the dodge has always been that it is some “rogue” princes using their oil money to do whatever they like, but actually the government disapproves. But that email says that it is the government of Saudi Arabia, and the government of Qatar that have been funding ISIS.” \\nAs recounted by RT , Assange and Pilger, who sat down for their 25-minute interview at the Ecuadorian Embassy in London where the whistleblower has been a refugee since 2012, also talked about the conflict of interest between Clinton’s official post, her husband’s nonprofit, and the Middle East officials, whose stated desire to fight terrorism may not have been sincere.\\nJohn Pilger: The Saudis, the Qataris, the Moroccans, the Bahrainis, particularly the first two, are giving all this money to the Clinton Foundation, while Hillary Clinton is secretary of state, and the State Department is approving massive arms sales, particularly Saudi Arabia.\\nJulian Assange: Under Hillary Clinton – and the Clinton emails reveal a significant discussion of it – the biggest-ever arms deal in the world was made with Saudi Arabia: more than $80 billion. During her tenure, the total arms exports from the US doubled in dollar value.\\nJP: Of course, the consequence of that is that this notorious jihadist group, called ISIL or ISIS, is created largely with money from people who are giving money to the Clinton Foundation?\\nJA: Yes.\\nThe conversation then turns to the imminent presidential election: Pilger questioned Assange over increasingly frequent accusations from the Clinton camp, and Western media, that WikiLeaks is looking to swing next week’s US presidential election in favor of Donald Trump – perhaps at Russia’s behest.\\nHowever, just as he did last week, Assange again dismissed the prospect of Trump, who is almost tied in the polls, winning as unlikely, and not necessarily due to his standing with the electorate.\\n‘Trump won’t be permitted to win’ “My analysis is that Trump would not be permitted to win. Why do I say that? Because he has had every establishment off his side. Trump does not have one establishment, maybe with the exception of the Evangelicals, if you can call them an establishment,” said Assange. “Banks, intelligence, arms companies, foreign money, etc. are all united behind Hillary Clinton. And the media as well. Media owners, and the journalists themselves.”\\nJP: The accusations that WikiLeaks is in league with the Russians and you hear people saying, “Well, why doesn’t WikiLeaks investigate and publish emails on Russia?” \\nJA: We have published over 800,000 documents of various kinds that relate to Russia. Most of those are critical. And… a great many books have come out of our publications about Russia, most of which are critical. And our documents have gone on to be used in quite a number of court cases, refugee cases of people fleeing some kinds of claimed political persecution in Russia, which they use our documents to back up.\\nJP: Do you take yourself a view of the US election? Do you have a preference for Clinton or Trump? \\nJA: Donald Trump – what does he represent in the American mind and in the European mind? He represents American “white trash,” deplorable and irredeemable. Basically, the same thing. It means, from a… establishment or educated, cosmopolitan, urbane perspective, these people are, you know, like the rednecks, and you can’t… like, they are just… you can never deal with them. And because he so clearly – through his words and actions and the type of people that turns up at his rallies – represents the people who are not the upper-middle-class-educated, there is a fear of seeming to be associated in any way with that, a social fear that lowers the class status of anyone who can be accused of somehow assisting in any way Trump, including criticizing Clinton. And if you look at how the middle class gains its economic and social power, it makes absolute sense.\\nHe is right, but the same was said about Brexit. \\nSources; http://www.zerohedge.com/news/2016-11-04/julian-assange-says-trump-wont-be-allowed-win-clinton-and-isis-are-funded-same-money \\nhttps://www.rt.com/news/365405-assange-pilger-full-transcript/ \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post Julian Assange Says Trump Won’t Be Allowed To Win, “Clinton And ISIS Are Funded By The Same Money” appeared first on We Are Change .\\n'"}, "time": 1742563106.277267}