{"duration": 0.11992454528808594, "input_args": {"text": "'. The New Spin on Aspartame If you google “aspartame,” the results will take you literally days to wade through-believe me, I kn... Print Email http://humansarefree.com/2016/11/the-new-spin-on-aspartame.html If you google “aspartame,” the results will take you literally days to wade through-believe me, I know. I’ve been sifting through it for days. There’s more than enough information, research, and speculation out there on the subject to fill volumes, and this is just a small article. So rather than simply rehash everything that has been written about aspartame (I’ve included some links at the end of this article, and within it, for those who want more information), I wanted to take a different approach. I wanted to focus on a small part of the debate, and then follow it through to wherever it took me. I wanted to look at the folks who keep assuring us that it’s safe: the experts.Experts in the government, experts in the medical field, the people who keep patting us on the head and telling us not to worry, that if aspartame was dangerous, they’d tell us. The problem was, I’ve always been something of a skeptic. The more someone pats me on the head, the more I start looking for something up his sleeve. But, as skeptical as I am, what I found startled me: a concerted effort, on the part of those at the highest levels of our government and those at the highest levels of the medical community, to mislead us about the safety of aspartame. Let me be clear: We have been deceived about the safety of a dangerous product, and all in the name of corporate profits. Before you read on, check out this video: Where did aspartame come from? It was first developed by the pharmaceutical company G.D. Searle. But Searle had difficulty getting their product approved by the Food and Drug Administration, the federal agency responsible for making sure our food and drugs are safe: Apparently, the monkeys and mice the substance was tested on developed brain lesions, tumors, and seizures, and even died from it. The company’s applications for approval were rejected for 16 years, but they persisted in offering their “proof” that aspartame was safe until the FDA finally asked the Department of Justice to prosecute G.D. Searle for submitting fraudulent test data in their efforts to get the substance approved. (An FDA senior toxicologist, Dr. Adrian Gross, once told Congress, “Beyond a shadow of a doubt aspartame triggers brain tumors.”) But then G.D. Searle, producer of aspartame, made Donald Rumsfeld its CEO-yes, that Donald Rumsfeld. When Ronald Reagan took office and brought Rumsfeld with him as part of his transition team, a new FDA commissioner was appointed immediately. In one of his first acts as head of the federal agency, the new FDA commissioner approved aspartame, the artificial sweetener made by the company that Donald Rumsfeld was now the head of, over the objections of the FDA scientific board. And here’s a strange bit of trivia: When it looked like aspartame would be approved later on for use in carbonated beverages, the National Soft Drink Association itself objected, saying it wouldn’t be safe because aspartame is very unstable in liquid form and breaks down into, among other things, formaldehyde. Monsanto bought G.D. Searle and Co. in 1985, and the NutraSweet Company operated as part of Monsanto until 2000, when Monsanto sold it to J.W. Childs Equity Partners, where it remains today. And in all this time, the FDA has compiled a list of 92 symptoms associated with aspartame consumption, including nausea, dizziness, blindness, deafness, weight gain, and even death. And aspartame is still here, and it’s showing up in more and more products. In fact, the Aspartame Resource Center, at www.aboutaspartame.com, notes that it is found in more than 6,000 products worldwide. And they should know: the Aspartame Resource Center is actually a public relations and “information” arm of Ajinomoto, one of the world’s largest producers of aspartame, the other being the NutraSweet Company. (Ajinomoto is also known for its other additive, monosodium glutamate, or MSG.) The ARC site is full of cheerful information on the safety of aspartame, and they even have a section labeled “Meet the doctors,” which lists their “medical advisory board.” In that section, the ARC says: “The Aspartame Information Center Expert Medical Advisory Board was created to help guide the Center’s communications to health professionals and the public about aspartame benefits, safety and role in a healthy diet. “The board members provide counsel on current medical and nutrition science, as well as insight on tools that help address the needs of health professionals in their work. Their backgrounds span critical areas of medicine and science, and each has unique experience in health and nutrition.” But, wait. Are they confused about who they are? What is this “Aspartame Information Center” they mention? I looked it up: www.aspartame.org . They, too, have a laundry list of “experts” they use to back up their claims that aspartame is safe, including our very own FDA and something called the Calorie Control Council. In fact, the Calorie Control Council owns the Aspartame Information Center site and is listed on the bottom of every page as the copyright holder. But back to the ARC. The Aspartame Resource Center offers all sorts of “fact” sheets you can download, including one called “Straight Answers About Aspartame.” It was prepared by the American Dietetic Association... and the Calorie Control Council. At the bottom, the fact sheet notes that it has been sponsored by aspartame.org, that is, the Aspartame Information Center, a.k.a. the Aspartame Resource Center, a.k.a. Ajinomoto, one of the world’s biggest producers of aspartame. Ajinomoto, in cahoots with the American Dietetic Association? Let’s see who’s behind the Calorie Calorie Control Council. Here’s what their own site, at www.caloriecontrol.org , says: “The Calorie Control Council, established in 1966... represents 60 manufacturers and suppliers of low-calorie, low-fat and light foods and beverages, including the manufacturers and suppliers of more than a dozen different dietary sweeteners...” Go further, and you’ll see another site connected to the Calorie Contol Council, called Calories Count, at www.caloriescount.com, which lists as its sponsors... wait for it... Ajinomoto, NutraSweet, Splenda, and Sweet ‘N Low. You can take a look at their sponsorship page here: http://www.caloriescount.com/support.html . Because it’s hard to keep the players straight in the aspartame follies, let’s recap. The folks at the FDA thought aspartame was dangerous, so they wouldn’t approve it. They changed their minds when the president at that time and his buddy, Donald Rumsfeld, who just happened to be the head of the company that made aspartame, appointed a new head of the FDA. Miraculously, aspartame was approved not long afterward, after sixteen years of being rejected. And when we look for information on aspartame, to allay our concerns, we find Web sites full of comforting information showing us how safe the stuff is, written by reliable organizations like the American Dietetic Association, and sponsored by... aspartame. Got that? Okay, but there’s more. Because I was trying not to get lost in the organizational rabbit hole, I backed out again to the Aspartame Resource Center and its expert medical advisors. After all, these were the medical professionals, the people who had the scientific knowledge, not to mention the connections with both the governmental agencies that protect our health and the largest medical and health organizations. Surely, they were to be trusted. Skeptical, I started with the first name on the list, and I fell into yet another rabbit hole that seems, even now, to have no end. In fact, I never got past that first name. The first name on the list? C. Wayne Callaway, M.D. I went first to his own Web site. Once you get past the introductory quote from Hippocrates, you can find all sorts of interesting information there. In fact, he has very helpfully posted his entire curriculum vitae for all and sundry to see. C. Wayne Callaway, M.D., received his medical training at Northwestern University, Mayo Graduate School of Medicine and Harvard University. Very impressive. He’s board certified in Internal Medicine, Clinical Nutrition, and Endocrinology, Diabetes and Metabolism and has held academic appointments at Harvard Medical School, Mayo Medical School, and George Washington University. He also works with the Mayo Clinic, the National Institutes of Health, the U.S. Department of Health and Human Services, and the USDA; he was an advisor to the U.S. Surgeon General and helped develop dietary guidelines for the USDA. He served as chair of the Public Information Committee of the American Society for Clinical Nutrition and the American Society for Nutrition Sciences, has been a member of the Board of Directors of the American Board of Nutrition, has been a committee member at the American Heart Association, has been an advisor to the American Medical Association. And he’s served on the editorial boards of the American Journal of Clinical Nutrition, among other medical journals. Whew-busy man. Want more? His publications have appeared in the Journal of the American Medical Association, the Annals of Internal Medicine, the Journal of the American Dietetic Association, and the International Journal of Obesity, among others. The separate biography on his site tells us that Dr. Callaway “has offered his expert views on nutrition on NBC, ABC, CBS, CNN, PBS, ESPN, and numerous affiliates, and has appeared on the McNeill-Lehrer Newshour, the Today Show, Good Morning America, Phil Donahue, Larry King Live, and other nationally syndicated news and talk programs.” His opinions on nutrition and health are “frequently published in the New York Times, Washington Post, Chicago Tribune, LA Times, and Wall Street Journal, as well as in numerous magazines (Time, Newsweek, U.S. News & World Report, Business Week, Vogue, Elle, Glamour, People, Self, Health, Prevention, and others).” You know, the mainstream media. Callaway’s bio says, “Dr. Callaway is a member of the American Society for Clinical Nutrition.” And remember, we also saw that he served as chair of the Public Information Committee of the American Society for Clinical Nutrition. But looking for the American Society for Clinical Nutrition takes you directly to the American Society for Nutrition, www.nutrition.org . They publish the American Journal of Clinical Nutrition, “the highest ranked peer-reviewed journal in nutrition and dietetics,” and the Journal of Nutrition, “which provides the latest research on a broad spectrum of topics of vital interest to researchers, students, policymakers and all individuals with interests in nutrition.” Sounds impressive, until you start poking at it, as I did. If you keep going deeper down that particular rabbit hole, you find that the American Society for Clinical Nutrition, A.K.A. the American Society for Nutrition, is supported by what they call “sustaining members,” which, they say, “[provide] corporate financial support for the society’s activities in education/training, scientific programs and professional outreach.” The site says that sustaining members have “the ability to sponsor educational opportunities, grants and other items.” Oddly, they don’t specify what those “other items” might be, but I’d be willing to bet that research is one of them. Would you like to know who some of the sustaining members are? Get ready: The National Cattlemen’s Beef Association. Cadbury Schweppes.'"}, "time": 1742628461.392084}