{"duration": 0.0971994400024414, "input_args": {"text": "'The Russian Embassy in the UK upset   journalists and social justice warriors after posting a picture of internet meme “Pepe the Frog” on Twitter. [“In today’s papers: pundits call on @Theresa_May to disrupt possible   thaw,” wrote the official embassy account, along with a picture of Pepe. “No trust in Britain’s best friend and ally?”  In today’s papers: pundits call on @Theresa_May to disrupt possible   thaw. No trust in Britain’s best friend and ally? pic. twitter.   —   Russian Embassy, UK (@RussianEmbassy) January 9, 2017,  The post led to   social justice warriors claiming that the Russian Embassy had just shared a “white nationalist” symbol, despite their claims being based off of discredited “evidence” featured in an interview with two notorious trolls. “[H]i there, reporter here. are you aware of that image’s popularity among white nationalists?” responded Talia Jane, a reporter for Mic —   the site that sabotaged a fundraiser for a gay military charity in October due to the fact that it was taking place at a   art show. @RussianEmbassy hi there, reporter here. are you aware of that image’s popularity among white nationalists?  —   talia jane (@itsa_talia) January 9, 2017,  “Hi there, someone who actually understands the internet here,” replied another user to Jane in defense of Pepe. “Are you aware that you’re a complete moron?” “Whatever Pepe started as, it’s now a white   dog whistle  @RussianEmbassy is tweeting it  …    ” claimed another verified user, who also pointed out that the embassy was “‘liking’ the tweets of the trolls defending pepe. ” Whatever Pepe started as, it’s now a white   dog whistle  @RussianEmbassy is tweeting it  …     https:  .   —   Joel (@JoelNihlean) January 9, 2017,  And the @RussianEmbassy is ’liking’ the tweets of the trolls defending Pepe. But he’s still a hate symbol: https:  .  pic. twitter.   —   Joel (@JoelNihlean) January 9, 2017,  “Stop spreading lies. Pepe (Kek Be Upon Him) is a meme of peace,” replied one user in response to the false claims that Pepe is a “hate symbol,” while another simply commented, “It’s a fucking meme you dolt. ” @JoelNihlean @RussianEmbassy Stop spreading lies. Pepe (Kek Be Upon Him) is a meme of peace.  —   STBill🐸 (@SoreThumbsBill) January 9, 2017,  @JoelNihlean @RussianEmbassy It’s a fucking meme you dolt,  —   Brandon (@Fearknight29) January 9, 2017,  Other accounts also insinuated that Pepe the Frog was a hate symbol, seemingly unaware of the discredited source behind these claims. @RussianEmbassy Nice of you to embrace Hitler.  How many Russians did he kill?  —   Bruins73 (@Bruins1973) January 9, 2017,  @RussianEmbassy This is grossly offensive. Pepe is a recognised symbol of Neo Nazis . U people are in the gutter with them obviously,  —   Spartacus (@Livlonanprsper) January 9, 2017,  Popular internet meme Pepe the Frog was added to the   League’s hate symbol database in September, where it currently sits alongside the swastika, Nazi SS lightning bolts, and various Ku Klux Klan imagery. Hillary Clinton, George Stephanopoulos, NBC’s Katy Tur, and Heat Street have also branded the cartoon frog a symbol for white supremacy, seemingly basing their claims on a Daily Beast article that interviewed two notorious trolls, Jared Taylor Swift and Paul Town. During the interview, Swift and Town attempted to link the meme to white supremacy, with Swift boasting that he had managed to trick the media on his   Twitter account afterwards. Following this interview, Pepe has been used as a scapegoat by the left to brand   conservatives, libertarians, and even Donald Trump, Jr. as racist. The branding has prompted many users to fight back against the Clinton Campaign, mainstream media, and ADL’s ruling that Pepe is an offensive icon, branding it a “war on memes. ” Several popular YouTubers have also defended the cartoon frog, while   iPhone game Build the Wall: The Game was rejected from Apple’s App Store for featuring Pepe, and eventually even his silhouette. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561849.0497284}