{"duration": 0.06146240234375, "input_args": {"text": "'Hillary HQ Gets Massive Surprise Outside Right After FBI Announcement Posted on October 30, 2016 by Amanda Shea in Politics Share This Hillary Clinton \\nHours after the FBI announced that they are reopening the investigation into Hillary Clinton’s e-mails, the liberals holed up at the Democratic headquarters in Ohio opened their door to a massive surprise outside that they weren’t expecting. Now, they’re getting the police involved as they fear this is the start to much more unwanted attention from Donald Trump supporters. \\nWhile Trump headquarters in various states have become targets of violence from angry Hillary supporters who don’t know how to handle themselves, when the tables are turned, the response is much different. “What reasonable person thinks this is OK????” party chair Bethe Goldenfield complained in a post in the Greater Cincinnati Politics facebook group with the hashtag #TrumpLovesHate. “I won’t be responding to anyone who thinks this is acceptable behavior. It is ILLEGAL!” she said of what she’s taking as a terror attack on their party, but apparently didn’t seem to think the same when Trump’s party office was firebombed a few states away. \\nSending a very fitting message about what people think not only of Hillary but of the Democratic Party, an unknown individual unloaded a massive mound of manure in the parking lot. Obviously, this person was just giving back a small portion of what Dems have been feeding Americans for years and is symbolic of what comes out of Hillary’s mouth, which is why the FBI is now re-investigating her. However, Goldenfield doesn’t see the humor in it since it wasn’t a molotov cocktail at a Republican office. Manure pile left outside the Democratic Headquarters in Lebanon, Ohio \\nAccording to Cincinnati.com , Goldenfield was alerted to the manure pile by the police in Lebanon who called her at about 7:45 on Saturday morning, which she took full advantage of by urging a widespread investigation to nab the person responsible. “Hopefully the perps will be held accountable for their actions,” she said, repeating her inaccurate #TrumpLovesHate hashtag. \\nThe local GOP office came under some speculation of involvement, but not only did they announce that they had nothing to do with this, they offered to help clean it up — something that Democrats didn’t offer in Indiana and North Carolina when both offices suffered actual destructive damage, unlike this case of a nonviolent attack that didn’t damage property.'"}, "time": 1742562171.1854796}