{"duration": 0.04876136779785156, "input_args": {"text": "'Posted on October 27, 2016 by Sean Adl-Tabatabai in News , US // 0 Comments \\nFBI bosses are deliberately choosing to ignore the contents of the ‘missing’ 33,000 Clinton emails after officials were told their location. \\nInvestigative journalist Paul Sperry says that newly released FBI documents prove that federal agents know the whereabouts of the missing emails – claiming that they exist in several locations and can be easily recovered. \\nBreitbart.com reports: \\nThe emails were created during Clinton’s use of a home-built and largely unprotected email system for her personal and government emails, and also for her management of the scandal-wracked, foreign-funded foundation while she was working as Secretary of State. \\nClinton insists she’s handed over all of the government emails — which actually belong to the taxpayer — and insists she didn’t break the law by mixing personal and government business or by storing and swapping classified information on her own email network. The hidden 33,000 emails are just emails about her personal life, she says. \\nTop Democrats have quietly slammed Clinton for her recklessness and ethical short-cuts, but the FBI leadership decided that she should not be charged with crimes in the run-up to the 2016 election. \\nSince that decision was announced, there’s been growing evidence that the FBI and the Department of Justice handcuffed the FBI investigators and granted favorable treatment to Clinton’s staff. \\nNow Sperry shows how Justice Department and FBI officials have also declined multiple opportunities to find copies of the missing 33,000 emails that would provide more evidence about whether Clinton was obeying or violating many federal laws: In a May interview with FBI agents, an executive with the Denver contractor that maintained Clinton’s private server revealed that an underling didn’t bleach-clean all her subpoenaed emails, just ones he stored in a data file he used to transfer the emails from the server to Clinton’s aides, who in turn sorted them for delivery to Congress. The Platte River Networks executive, whose name was redacted from the interview report, said PRN tech Paul Combetta “created a ‘vehicle’ to transfer email files from the live mailboxes of [Clinton Executive Services Corp.] email accounts [and] then later used BleachBit software to shred the ‘vehicle,’ but the email content still existed in the live email accounts.” Unless one of Clinton’s aides had the capability to log in to the PRN server as an administrator and remove a mailbox, her archived mailboxes more than likely still reside somewhere in that system. And they may also materialize on an internal “shared drive” that PRN created to control access to the Clinton email accounts among PRN employees. PRN has been under FBI order to preserve all emails and other evidence since the start of its investigation last year. Clinton’s missing “personal” emails may also be captured on a Google server. According to FBI notes, Combetta “transferred all of the Clinton email content to a personal Google email address he created.” Only the FBI never subpoenaed Google to find out. The FBI documents also reveal that Hillary’s server was mirrored on a cloud server in Pennsylvania maintained by Datto Inc., a tech firm that performs cloud-to-cloud data protection. When PRN contracted with Datto, it requested that Hillary’s server be backed up locally and privately. But the techs forgot to order the private node, and they sent the server backup data “remotely to Datto’s secure cloud and not to a local private node.” The FBI never subpoenaed Datto’s server, either. \\nRead it all here .'"}, "time": 1742628562.8360386}