{"duration": 0.05222058296203613, "input_args": {"text": "'November 7, 2016, 10:26 pm A+ | a- Warning   \\nSee, earlier, by Peter Brimelow: T he Trump Wrecking Ball, The Washington Cartel, And The Jews and GOP Should “Thank Heaven Fasting” For Trump But Instead Plans To Shoot Self In Testicles \\nSeveral hundred years ago, when I began attending a– completely white –“Grammar School” (= academic Middle and High School) in the north of England , it was the custom to have a “Speech Day” (= Commencement, but in the middle of the school year) at which a first-year student was publicly tortured by having him recite from memory the resounding passage from Ecclesiasticus that begins Let us now praise famous men, and our fathers that begat us. It was an annual agony waiting to see if the victim would forget his lines —in which case he would be prompted in a stage whisper by the Headmaster on the dais behind him—but agonizing suspense is not the main reason I think of that scene this Election Day. Whatever happens, it’s time to say: let us now praise famous Trumps. \\nElection Day suspense may be agonizing, but one thing at least is certain: The next President is not going to be Jeb Bush. Or Marco Rubio. Or even the tragically-misguided Rand Paul. \\nYet at one point it appeared absolutely certain that Bush or Rubio would get the GOP nomination. (And it’s not at all clear they could have done better in the general election: for example, WikiLeaks has revealed that the Clinton campaign had even bigger opposition research files on Rubio than it did on Trump– Presidential Horse Race 2016: Wikileaks proves Trump was the best Republican to run against Hillary , by Jeffrey A. Rendall , Conservative HQ, October 26, 2016.) \\nTrump single-handedly destroyed every Establishment candidate. He thus gave America at least another chance to avoid the Amnesty/ Immigration Surge that the GOP elite, in combination with the rest of the Ruling Class, has been conspiring to unleash for more than fifteen years. \\nIndeed, by exposing to the Republican base their own party Establishment’s selfishness, spite, and sheer treachery in the face of the very real threat of a third Obama term, Trump may have finally rescued his country from the apparently endless Blight of Bush —to say nothing of the horrible prospect of a Curse of Kasich. \\nDonald J. Trump is infinitely better than all previous GOP nominees on VDARE.com’s key issue of immigration, in the sense that one is infinitely more than zero (I think that’s right—have to check the details with John Derbyshire ). Nevertheless, Trump has frequently driven us crazy by forgetting to use the issue, not exploiting it enough , not remembering the details , not exploring build-outs like the deeply unpopular birthright citizenship, the need for Official English , etc. etc. \\nBut all of that fades in the face of of his extraordinary unflinching will–in defiance of literally the entire world, including an illegal alien would-be assassin promptly dispatched down the Main Stream Media Memory Hole—and the breathtaking relentless fury of his closing campaign. \\nTo adapt sprint coach Sam Mussabini’s line to come-from-behind winner Eric Liddell in the old movie Chariots Of Fire: It’s not the prettiest race we’ve ever seen, Mr. Trump—but certainly the bravest. \\nLike a lot of British emigrants—I came to the U.S.in 1970 — I am mildly Anglophobic . And, although I guess I prefer slick Oxbridge Righties—let’s make that “Righties”— like Professor Andrew Roberts (pro- Thatcher , pro- Brexit ) to slick Oxbridge Lefties like Andrew Sullivan and the late Christopher Hitchens , I still found Roberts’ recent Wriston Lecture, sneering snobbishly at Donald J. Trump and indeed at the whole 2016 U.S. election process, hard to take. (The Manhattan Institute has posted a video here ; there’s a synopsis, and a link to an adaptation that appeared in the Wall Street Journal , here .) \\n(Interestingly, I’d say at least a few of the glittering crowd of New York fat cats seemed to agree). \\nThe Wriston Lecture is black tie, which meant that my young wife began kicking me under the table with a particularly sharp-toed shoe when the Manhattan Institute’s genial President, Larry Mone , [ ] asked for questions. I don’t usually ask questions at these events—I lack evangelical zeal—but I did obediently get up and try to catch Larry’s eye. \\nI’ve known Larry for many years, but despite this (or perhaps because of it) he didn’t call on me. \\nBut this is what I would have asked: Professor Roberts, as one Limey to another—I have to say I don’t think you get these Yanks. This is not the Cambridge Union. It’s the Wild West. You may think Donald Trump is uncouth. But he’s nowhere near as uncouth as Lyndon B. Johnson—I presume you’ve read Caro ’s biography—and he was one of the seminal Presidents in American history, for better or worse. It wasn’t pretty, but there was a real debate on principles in the Republican primaries. Trump is against these managed trade deals. The GOP Establishment —and the entire political class—is for them. Trump is against promiscuous interventions overseas—in fact, he’s against what both George Washington and Thomas Jefferson warned against: entangling alliances. The GOP Establishment—and the entire political class—is for them. Above all, Trump is against current immigration policy, which on current course will reduce whites into a minority by 204 0—a demographic transformation without precedent in the history of the world. The GOP Establishment—and the entire political class—is for it. So there was a debate about principles—and Donald Trump won. I can’t recall any such principled debate in Britain—with the exception of Brexit. The Establishment has got things sewn up pretty tight there. How can you not see this? (You were right about Brexit, though). \\nAs I write this, I have no idea if Donald Trump will win the Presidency. I do know that if he loses, the GOP Establishment, amid the cooing of the MSM/ Democrats, will go back to sleep on immigration, as it did after Proposition 187 in 1994, Arizona’s Prop 200 in 2004, and SB 1070 in 2010, Montana’s Legislative Referendum 121 in 2012 , Oregon’s No On 88 initiative in 2013, and Dave Brat’s primary defeat of Majority Leader Eric Cantor in 2014 .'"}, "time": 1742628463.8515368}