{"duration": 0.259796142578125, "input_args": {"text": "'RIO DE JANEIRO  —   About the same time that the future United States Olympic volleyball player Carli Lloyd was born 27 years ago, her uncle was discovered by a talent scout in a Southern California gym. Galen Tomlinson was invited to try out for a new show called “American Gladiators” for a chance to be one of the     superheroes, taking on mortal contestants in an imaginative series of physical contests. Tomlinson won a role. He was rechristened Turbo and became a cult hero. But the bravest role he played was far off camera: stepping in to help raise Lloyd and mold her into an Olympic athlete. It is debatable which one is more famous, today’s United States Olympian or yesterday’s American gladiator. But it is clear how much they mean to each other. “She understood his belief in her, and it made her believe in herself, and those two went off and conquered the world,” Cindy Lloyd, Carli’s mother and Tomlinson’s half sister, said. “It was awesome to sit back and watch. ” The United States women’s volleyball team is trying to win a gold medal at the Olympics for the first time. Carli Lloyd, often confused with the American soccer star with the same name, is a backup setter. Tomlinson, still as fit as a gladiator at 55, with tiny streaks of gray in his   dark hair, is a big presence in the stands. “I attribute me being here to him more than anyone else,” Lloyd said. They are practically inseparable. He was her first coach and her constant workout partner. When she moved on to other coaches and left for college, he was still there at every match, sitting in his usual spot, giving nods and signals in a language that only the two of them share. Lloyd calls him “Uncle. ” But Tomlinson is the only father figure she has ever known. Lloyd was 4 when her father committed suicide, leaving Cindy Lloyd to raise three children on her own. Tomlinson, by then a   father and a star on “American Gladiators,” had time on his hands. The show taped for three weeks a year, and his only job the rest of the time was to stay fit. Tomlinson and his daughter, then 10, moved in with Cindy Lloyd and her three children in Bonsall, Calif. north of San Diego. The move was considered temporary, to help Cindy get her life reorganized. Tomlinson never left. “After a couple of months, it dawned on me, and I said after the kids went to bed, ‘Cindy, I want to talk to you,’” Tomlinson said. “I said: ‘Everyone’s getting really comfortable with this. I think it would be wise for us to either leave now, before they lose another male role model, or we’ve got to make a commitment that our extracurricular activities get put on hold until the youngest’  —   Carli  —   ‘graduates high school. ’” Tomlinson and Cindy Lloyd, who had the same father but different mothers, still live together more than 20 years later. “I can’t get rid of him,” Lloyd said with a laugh. “Why would I leave?” Tomlinson asked. “Now the kids are all gone, she’s got the biggest one left at home. ” When Tomlinson’s daughter, Kourtney, was in fifth grade, she wanted to play volleyball. Lloyd’s oldest daughter, Coral, about a year younger, followed. Tomlinson soon decided he could do a better job than their coaches. He taught himself the intricacies of the game and studied respected coaches at tournaments. When Carli started playing the game a few years later, Tomlinson was an experienced coach. “Unfortunately for the older ones, they were the test subjects,” Tomlinson said. “By the time Carli came around, she was able to hit the ground running. ” Tomlinson also oversaw her workouts. From the beginning, he trained her in track and field, his first love among sports. Lloyd became a standout hurdler and long jumper in high school. “Through high school and into college, you could tell just by looking at her that there was a maturity in her muscles that other kids just did not have,” Tomlinson said. “It’s because she’s been lifting with me since she was 8 years old. ” There were no summers off. Eventually, Lloyd’s only request to her uncle was to do the workouts early and quickly so she could move on with her day. Hurt me as much as you want, she would tell him, but do not make me stay out there long. Tomlinson appreciated her willingness. “I said, ‘If you don’t want to put your head on the pillow when you’re 30 years old and wonder what if, then this is the stuff that has to be done now,’” he said. “And she bought into it. ” It was not always harmonious. The relationship between a child and a parent who also coaches can be fraught with frustration, disappointment and resentment. “I wouldn’t say it was perfect,” Lloyd said. “We’re both pretty sensitive and stubborn. But it works. I love him, and he loves me, and it works because we want it to. ” The biggest disagreement came when Lloyd was 15. She made a nationally ranked   club team. Tomlinson became an assistant coach and asked the head coach if he thought Lloyd, now    had a better future as a setter or an attacker. The coach said she could be a great college hitter but an elite setter. That was enough for Tomlinson. He told Lloyd that she would immediately devote herself to becoming a   setter. It is a position not unlike point guard in basketball, or catcher in baseball  —   an   leader controlling the pace and distributing the ball to others. “For the first month, she was really unhappy with me,” Tomlinson said. “Everyone wants to hit the ball. That’s the fun stuff. It wasn’t until the first tournament, where she was running the team as a setter, a little sophomore with these seniors out there, that she realized it was a good thing. ” When Lloyd got to Fallbrook Union High, Tomlinson left club team coaching behind to go with her. His niece was his best player, on her way to an   career at the University of California, Berkeley, where Lloyd helped the Golden Bears to the best   stretch in their history. There were two trips to the national quarterfinals, one to the semifinals and another to the national final. Lloyd was named national player of the year as a senior. Tomlinson saw every match from the stands (preferably down the right line at the end, eye level with the top of the net) except one, when his daughter got married. Lloyd has spent winters playing professionally in Italy, and Tomlinson has gone with her, for at least a few weeks each time, to help her settle in. His presence has not always been welcomed by coaches, but it is by Lloyd. “Galen is so honest, brutally honest,” Cindy Lloyd said of her half brother. After a match, she said, she will offer unmitigated praise. Tomlinson will offer unvarnished opinions. “And she just really appreciates that,” Cindy Lloyd said. “Just the other night against the Netherlands, I heard her say, ‘Uncle, what did you think?’ To this day, she values what he’s saying. I’ve watched this relationship develop. And it’s worked. ” There have been strains. A combination of stress fractures in her shins and struggles fitting in with the United States national team, coached by the volleyball legend Karch Kiraly, sent Carli Lloyd into a spiral of depression. Lloyd, with Tomlinson’s encouragement, had grown up setting with quick movements of her fingers and wrists. The team wanted her to adopt a method with more arm extension  —   a change of form not unlike asking a pitcher to alter a throwing motion or a basketball player to adjust a shot. Lloyd struggled. Her standing on the national team dropped in a couple of years, until it looked as if her longstanding Olympic aspirations had evaporated. She was in a kind of funk that Tomlinson had never seen. “I remember telling her mom: ‘I’ve lost my little girl. She’s not the same,’” Tomlinson said. But Lloyd pulled through during the past year, developing the mental toughness to match the physical prowess that she had always had. By last winter in Italy, she seemed to Tomlinson to be her old self, dedicated to trying to make the Olympic roster. “I’m going to make their decision as hard as I can,” she said. In July, Kiraly named his   team. Three setters, instead of the usual two, made the squad. Lloyd was one of them. Kiraly said she represented a new breed of physical setter  —   fast enough to chase every ball, big enough to block and hit. Now the gym that Tomlinson hangs around is the Maracanãzinho, Rio de Janeiro’s famous volleyball arena. People  —     men, mostly  —   still ask if he used to be Turbo. But far more attention is on today’s Olympian, not yesterday’s gladiator. Still, Tomlinson cannot help but think that Lloyd would have fit right in on the old television show. “She’d have killed it,” he said with a   smile. “Killed it. ”'"}, "time": 1742564491.1707437}