{"duration": 0.055405378341674805, "input_args": {"text": "'A stark white background. Unfamiliar faces.   phrases reducing women to their body parts. Priorities USA, the Democratic “super PAC” supporting Hillary Clinton’s presidential campaign, is kicking off its advertising for the general election on Wednesday with a new ad, titled “Speak,” that uses Donald J. Trump’s own statements against him to depict him as a misogynist and unworthy of the White House. It is strikingly similar to a commercial broadcast in March by Our Principles PAC, a Republican group that sought unsuccessfully to derail Mr. Trump’s march toward the party’s nomination. The two ads cast a spotlight on many of the same remarks, with one essential difference: the voice that viewers hear. The Republican ad, “Quotes,” was released just before the Florida and Ohio primaries, and sought to spur outrage at Mr. Trump on behalf of “our mothers,” “our sisters,” “our daughters. ” On the screen, seven different women take turns reading aloud Mr. Trump’s remarks, their expressions and inflections conveying their disdain, or outright disgust, for the lines they were asked to deliver. The Democratic ad, “Speak,” grew directly out of “Quotes,” after tests by Priorities USA found that of all the   commercials, that one had resonated particularly well with voters that Priorities was hoping to persuade. But rather than hire actresses, Priorities said, it employed voters  —   male and female  —   who had not previously been familiar with Mr. Trump’s more offensive remarks about women. A more noticeable tweak: Rather than have them deliver Mr. Trump’s lines for him, these people merely lip sync Mr. Trump’s is the only voice heard. Message Our Principles PAC portrayed Mr. Trump’s utterances as offensive to the women in voters’ lives, appealing to viewers’ sense of chivalry, in a way. Priorities USA puts the question more directly: “Does Donald Trump really speak for you?” Priorities also brings men on camera. One, standing beside a young girl,   as Mr. Trump suggests that if Ivanka Trump were not his daughter, “perhaps I’d be dating her. ” Style The Priorities USA ad includes a percolating soundtrack, but it steals slightly from the impact of the words. Our Principles let each quote sink in. Bottom Line By using audio clips of Mr. Trump’s voice, the Priorities USA ad heightens the immediate sense of authenticity. But the actresses in the Republican ad had greater freedom to add their own vocal interpretations  —   which hammered home the point more effectively than a gesture or arched eyebrow can accomplish on its own.'"}, "time": 1742563501.989506}