{"duration": 0.01979994773864746, "input_args": {"text": "'“The Art of War”\\nCrystal Clear Agreements: Enduring subordination by Manlio Dinucci Voltaire Network | Rome (Italy) | 27 October 2016 français italiano First, President Obama called upon the Italians to vote “yes” in the referendum, thus interfering in our national politics with the silent complicity of the parliamentary opposition. Then he went on to confirm to his “good friend Matteo” that the US has “clear agreements, long friendship” with Italy.\\nNoone would question that these agreements were crystal clear, especially the Atlantic Treaty that places Italy in a position of subordination to the U.S.A. The US President always appoints the Supreme Allied Commander in Europe and all the other key commands are in US hands.\\nWhen the disintegration of the USSR brought the Cold War to an end, Washington declared the “fundamental importance of preserving Nato as a channel of influence and US participation in European Affairs so as to prevent the creation of exclusively European structures that would threaten the Alliance’s chain of command”, that is the US command. An idea reiterated by the NATO Secretary Stoltenberg during the recent round table on the “Big Idea for Europe”:\\n“We must ensure that building up Europe’s defense does not duplicate Nato’s defence and [Europe] does not become another Nato”.\\nStoltenberg’s idea is guaranteed by the fact that 22 of the 28 EU member states (21 of 27 following Great Britain’s departure) are part of the US-led Nato, which is recognized by the European Union as “the foundation of collective defense”.\\nThus the EU foreign and military policy is fundamentally subordinated to the US strategy and the European powers have aligned themselves to it. Their conflicting interests are ironed out when their fundamental interest is at stake: maintaining Western predominance, increasingly faltering when confronted by the emergence of new state and non-state subjects. All we need to do is to recall to our minds that the Shanghai Cooperation Organization, created through a strategic China-Russia agreement, pools resources that makes it the biggest integrated economic area in the world.\\nIn the context of the US/Nato strategy – reports the White House – Italy stands out as a “steadfast and active ally of the United States”. This is demonstrated by the fact that “Italy hosts more than 30,000 soldiers and civil officers of the US Defence Department in military establishments positioned all over the country”.\\nAt the same time, Italy is “a US partner for global security”, supplying military forces and funding for a wide range of “challenges”: in Kosovo, Afghanistan, Iraq, Libya, Syria, Baltic and elsewhere, that is, wherever the USA/Nato war machine has been and is deployed.\\nA final fact to confirm the nature of the US-Italian relationship – scheduled to arrive at the Amendola base (Puglia), probably on 8 November, are the first two of the 90 fighter planes supplied by Lockheed Martin (a US company), that Italy has undertaken to purchase.\\nThe cost of Italy’s participation in the F-35 programme as a second-tier partner is officially calculated in the Stability Law of 2016: 12 billion 356 million euro of public money, plus additional costs for the continual updates to the fighter plane that still is not fully operative and will require constant modernization. Despite this – confirms Analisi Difesa – Italy will have “limited sovereignty” over the F-35 planes that form part of its own Air Force. A US law prohibits that “mission information” (software for managing the fighting systems of the fighter planes) is communicated to others. Thus the US will control the Italian F-35 which have been fitted out to use the new nuclear bombs B61-12 that the Pentagon will deploy against Russia, substituting them for the existing B-61, on our “national” territory.\\nManlio Dinucci Translation\\nAnoosha Boralessa\\nSource\\nIl Manifesto (Italy)'"}, "time": 1742628560.2397776}