{"duration": 0.12372994422912598, "input_args": {"text": "'WASHINGTON  —   In the rhetorical battle over Judge Neil M. Gorsuch, President Trump’s Supreme Court nominee, senators in both parties have been selectively arguing the facts on the jurist and overstating the Senate’s procedural history. Senator Mitch McConnell, Republican of Kentucky and the majority leader, promised on Sunday that Judge Gorsuch would be confirmed this week, even if it required changing longstanding Senate practice to require only a simple majority vote. Here is an assessment of claims from Democratic and Republican lawmakers. THIS IS MISLEADING To reasonably claim a   standard, filibusters would have to be a factor. It takes only a majority, 51 votes, to confirm a nominee. Two current Supreme Court justices, Samuel A. Alito Jr. and Clarence Thomas, did not receive 60 confirmation votes. But under current Senate rules, ending debate or a filibuster over a Supreme Court nominee  —   called a cloture vote  —   requires a   majority. Eight Democrats would need to vote for cloture to end debate over Judge Gorsuch and bring his nomination to a straight    vote. The Senate has moved to invoke cloture only four times in history for Supreme Court nominations, most recently for Justice Alito’s confirmation in 2006, when it voted   to end debate. Factoring in cloture votes to end filibusters, Mr. Schumer is right that the most successful nominees have met the   bar at some point. Justice Thomas is the one exception since 1949. According to the Congressional Research Service, Democrats chose not to filibuster him: “In 1991, five days of debate on the Thomas nomination concluded with a   confirmation vote. The 48 opposition votes would have been more than enough to defeat a cloture motion if one had been filed. ” In three other cases, they chose not to filibuster, but the nominees failed the    vote. Why does this matter? In 2013, the Senate majority leader at the time, Harry Reid, “went nuclear” and reduced the cloture threshold for all other judicial and executive nominees to a simple majority. Mr. McConnell has signaled willingness to change the debate rules for Supreme Court nominees as well, and he rejected the idea of a   standard. “It’s a shot across the bow, so to speak,” said Joshua Huder of the Government Affairs Institute at Georgetown University. “You’re seeing hardball tactics in the Senate accompanied by hardball language dressed up as procedural nuance. This is about as intense as a showdown in the Senate gets. ” THIS IS MISLEADING Last year, Republicans repeatedly justified their decision not to consider President Barack Obama’s nominee, Judge Merrick B. Garland, by citing tradition. But a Supreme Court vacancy during the “last, final months” has happened only one other time in modern history. In 1968, President Lyndon Johnson nominated Associate Justice Abe Fortas to replace Earl Warren as chief justice. The Senate did consider Justice Fortas for the position. Justice Anthony M. Kennedy was also confirmed during President Ronald Reagan’s last year in office, though he was nominated the year before. Looking further back, seven nominations in the 19th century were made by a “lame duck” president between the election and inauguration of his successor. THIS NEEDS CONTEXT  The debate over Justice Fortas in 1968 also serves as an example of a successful filibuster, as noted on the Senate’s website. During hearings, Justice Fortas’s ties to the president, judicial philosophy and outside activities lost him support, and the Senate failed to invoke cloture by a   roll call vote. Nine Democrats and three Republicans did not vote. His nomination was then withdrawn. The filibuster was technically bipartisan, with 19 Democrats voting against cloture. But 15 of them were Southern Democrats, who were part of the conservative coalition and “who stood apart from the regular Democratic Party and would be Republicans today,” said Russell Wheeler of the Brookings Institution. Filibusters are not always a factor in unsuccessful nominations. President Ronald Reagan’s pick, Judge Robert Bork, was outright rejected, as were two of President Richard M. Nixon’s selections. “In modern practice, nominees more often withdraw if it looks like their confirmation is in jeopardy,” Mr. Huder said. “That’s what happened with Harriet Miers, Bush II’s nominee. ” THIS IS MISLEADING Judge Gorsuch had long exchanges with Senator Richard Blumenthal, Democrat of Connecticut, about the school desegregation case during his hearings. While he never simply stated that he agreed with the decision, Judge Gorsuch offered praise several times: ■ “It is one of the shining moments in constitutional history in the United States Supreme Court. ” ■ “It’s a great and important decision. ” ■ “It was a seminal decision that got the original understanding of the 14th Amendment right and corrected one of the most deeply erroneous interpretations of law in Supreme Court history, Plessy v. Ferguson, which is a dark, dark stain on our court’s history. ”'"}, "time": 1742562203.0199602}