{"duration": 0.07338738441467285, "input_args": {"text": "'PARIS  —   The German director Maren Ade’s breakout film, “Toni Erdmann,” has won over audiences and racked up awards across Europe. An uncharacterizable   story that’s also about neoliberal economic reforms in Romania and the clash between the generation of 1968 and its capitalist children, the film is exceptional for another reason: It’s hilarious. Germany has generally not been known for exporting comedies  —   and, to outsiders, has a perhaps undeserved reputation for humorlessness  —   but “Toni Erdmann,” which has been sold around the world, upends that. “I said to my producer, ‘I’m sorry, this will not be a comedy, this will be a very long and sad film,’” Ms. Ade said in a recent interview. “But we were very happy that the comic aspect came out while editing. ” The film, which opened recently in New York, has been loved by critics since its debut at the Cannes Film Festival in May. It won no prizes there but recently made the shortlist for the   Academy Award, has been nominated for a Golden Globe, and won every top prize at the European Film Awards. (The New York Times’s chief film critics, A. O. Scott and Manohla Dargis, included it in their year’s best lists.) It tells the story of Ines (Sandra Hüller) a   workaholic German management consultant posted to Bucharest, who receives an unexpected visit from her father, Winfried (Peter Simonischek) a music teacher and practical joker who eventually assumes the persona of “Toni Erdmann,” a life coach, and deploys a wig, fake teeth and whoopee cushions in a complex subterfuge to bring Ines back to her old self. In Germany, where “Toni Erdmann” has been a   success for an   film, Ms. Ade (pronounced  ) 40, is seen as an outlier whose sui generis vision doesn’t fit into any established comic traditions. She herself has said that her inspirations include the American comic Andy Kaufman, as well as the Hollywood films of Ernst Lubitsch and Billy Wilder, and the Berlin theater troupe Gob Squad. “In Germany, mainstream comedies are rather vulgar,” said Katja Nicodemus, the film critic at Die Zeit, a German weekly. “Maren Ade, for me, is closer to Wilder and Lubitsch than to contemporary German comedy because she’s closer to that deep humanism  —   the masquerades, the salaciousness, the wit, the social critique of those comedies, in a subconscious way. ” “For me, what makes the film so exceptional is that it’s a tragedy, where in this tragedy the father plays the comedy,” Ms. Nicodemus added. While most German comedies tend toward   slapstick humor, “Toni Erdmann,” which is 162 minutes long, makes use of repetition and time, drawing out awkward moments to the point of comic discomfort. The film’s kooky humor stands in contrast to Germany’s top box office hit of the year, “Welcome to the Hartmanns,” a mainstream comedy about a wealthy Bavarian family adopting a Nigerian refugee  —   touching on a   issue in Germany, where an influx of migrants has been testing society and the political establishment. Written and directed by Simon Verhoeven, that film has received mixed reviews (as well as criticism for posters that omitted Eric Kabongo, who plays the Nigerian) but it has also been praised for pulling off a complex feat. Mr. Verhoeven “undertakes something that is very rarely achieved in German cinema,” Wolfgang Höbel wrote in Der Spiegel. “He treats as uproarious entertainment a political and social conflict that has split the country into two somewhat irreconcilable camps: the   and those who are enemies of Angela Merkel’s ‘We can do this’ slogan,” Mr. Höbel added, referring to the statement by Ms. Merkel, the German chancellor, that Germany could handle the refugees. In an interview, Mr. Verhoeven agreed that his film was critical of Ms. Merkel. “It definitely is, because I am critical of her,” he said, “not so much because I’m critical of the basic direction that she led the country in, but I was in so many refugee homes, I saw how much people were struggling and how many people tried to help refugees, but there wasn’t a master plan. There wasn’t a vision of how it’s going to work. ” “Welcome to the Hartmanns” has not received distribution overseas yet, and it’s rare for a German comedy to find international success. Those that have include Tom Tykwer’s 1999 hit, “Run, Lola, Run,” which isn’t, strictly speaking, a comedy Sandra Nettelbeck’s 2002 romantic comedy, “Mostly Martha,” which was later remade by Hollywood with Catherine Zeta Jones and Wolfgang Becker’s 2004 “Good Bye, Lenin!” Ms. Ade is the first director in what has been called the Berlin School  —   a loose affiliation including Christian Petzold and other filmmakers who came of age in the 1990s and make closely observed dramas  —   to delve into comedy. One of the great comic moments in “Toni Erdmann” is a party scene in which Ines, on the spur of the moment, transforms a “team building” brunch into what she calls “a naked party”  —   stripping off her clothes and telling her guests, including her boss, to get naked, too. “Standing in a bright room naked is really the worst thing that can happen to you,” Ms. Ade said. “That was really courageous. I had a feeling the character is at a point where it’s almost physically not possible for her to put on her clothes and go into that role again. ” She added: “This nakedness doesn’t lower her status. She discovers while doing this that it raises her status it makes her independent again. ” While “Welcome to the Hartmanns” directly tackles a tough contemporary issue, “Toni Erdmann” is also slyly political, about the differences between those in Winfried’s generation, who came of age in the ’60s and rebelled against parents from the Nazi era, and those of Ines’s generation, who grew up in a   War capitalistic society. “They’re very political they raised their children with a lot of human values,” Ms. Ade said of Winfried’s generation. “He wanted her to be free,  . They believe in a world without borders. Then he’s confronted with things turned into the opposite. ” In using comedy, the film takes a new approach to German history. “The big myth in German cinema is that you have to wear a Nazi uniform to talk about the past, and it’s more complicated,” said Ms. Nicodemus, the Die Zeit film critic. “Toni” also represents a change from the German films that normally appear on the international festival circuit: works by directors from the 1968 generation, including Werner Herzog and Wim Wenders. “When the international film community thinks about German films, there are these old big ’68 moviemaker heroes, and they stand for a certain seriousness and dealing with historic issues in Germany,” said Tobias Kniebe, the chief film critic at Süddeutsche Zeitung, a daily in Munich. Ms. Ade’s film “kind of broke a mold,” Mr. Kniebe added. “To be able to make this kind of movie with that kind of complexity and accuracy and still get the big laughs and be the toast of Cannes, and sell it to more than 100 countries, that’s kind of like saying now, if you’re German, you can do anything. It’s up to you, there’s no prejudice anymore. ”'"}, "time": 1742628599.8168495}