{"duration": 0.11470222473144531, "input_args": {"text": "'Sitting on the windowsill behind Paul Simon’s desk in his Midtown office was an instrument shaped like a teardrop: a gopichand from India, with one string down the middle and two flexible bamboo sides. At an interview there, Mr. Simon demonstrated how to pluck the string and squeeze the sides to get the “boing” that’s the first sound on “Stranger to Stranger,” his 12th solo studio album and his first since 2011, which is due for release June 3. “Stranger to Stranger” is a set of songs that crack jokes and ponder questions about love, death, spirituality, baseball, economic inequality, brain chemistry and music itself. It’s the latest ambitious, tuneful installment in a career that has had far more to do with curiosity than  . Along the way, Mr. Simon has sold millions of records, with Simon and Garfunkel in the 1960s and in a   solo career ever since. He has racked up Grammy Awards and accolades he has also received scathing receptions for projects like his 1998 Broadway musical, “The Capeman,” although revivals concentrating on the songs rather than the storytelling were praised. “I’m a wanderer,” Mr. Simon said. “So much of this record, and the way I record, is about just going there to see: What is it? What can you learn?” At 74, Mr. Simon could be comfortably retired, savoring the continuing popularity of his older songs like “America,” which he donated to  ads for the Bernie Sanders campaign, or “The Sound of Silence,” which became a hit last year for the   band Disturbed. Or he could stay on the road performing his oldies just the way his original   fans remember them (though he recently said any reunion with Mr. Garfunkel is “out of the question”). He could also keep trying to write new songs in the style of those oldies. Instead, Mr. Simon’s recent albums are as experimental as anything he has ever recorded. “He trusts himself and he pushes himself. That’s a very good combination,” said the composer Philip Glass, a longtime friend and occasional collaborator. “If one part of that equation isn’t there, then you’re in trouble. ” Mr. Simon has a clear imperative. “To make a pop record, if you don’t make it really interesting, nobody’s going to listen to it,” he said. On “Stranger to Stranger,” Mr. Simon is, above all, playing by ear. “The sound is what led me to everything,” he said. “The theme of this album  —   it’s not a lyrical theme. It’s a sound theme. This is the time that we’re living in and this is what it sounds like to me from the sources that I find interesting. In a way it’s not that different from   guys that are interested in sound, like Kanye or Kendrick. ” In hindsight, Mr. Simon arguably brought a sampling mentality to songwriting long before the concept had a name or a technology. He has always incorporated nuggets he comes across, from folk songs like “Scarborough Fair” and “El Condor Pasa” to vintage gospel like the Swan Silvertones’ “Oh Mary Don’t You Weep” and imported records like the ones that led him to South African music for his “Graceland” album. “They come from different cultures, but they all have something that makes you say, ‘I’m not listening to a weird thing,’” he said. After some early recriminations  —   he is still resented by British folkies he heard and echoed in London in the 1960s  —   Mr. Simon has made sure to share credit with his sources or compensate them upfront. “But if someone hears a line, ‘I’ll be your bridge over deep water if you trust in my name,’ in ‘Oh Mary Don’t You Weep,’ that doesn’t mean they’re going to write ‘Bridge Over Troubled Water,’” he noted. (Among the neat arrays of photographs and memorabilia on the walls of Mr. Simon’s office, he keeps a framed copy of the string arrangement for “Bridge Over Troubled Water” its title, misheard from the demo by the arranger, is “Like a Pitcher of Water. ”) Mr. Simon still prizes the   ideal of an album as two connected   sides, which he considers a “natural form. ” Yet he recognizes the ways streaming and randomly shuffled playlists can provide instant gratification. “The whole listening process changed,” he said. “What’s harder is to say to somebody, I know you’ve got it, but if you give it a little while longer you might actually find a pleasure that exists in music that you haven’t experienced, because they keep cutting it shorter and shorter before you get to the pleasure. They just keep giving you shots of adrenaline, not serotonin. ” He explained: “Serotonin is the drug that puts you in the situation where you feel safe and comfortable. The drug that gives you the awe is the dopamine. And the adrenaline is the thing that keeps you going. ” When they arrive together, he said, “I think it’s so incredible, it’s an addiction, and that’s why artists keep doing it. ” “Stranger to Stranger” opens with “The Werewolf,” a jovial shuffle that gibes at the rich getting richer amid “Ignorance and   national debate” it was written well before the current presidential campaign, Mr. Simon said. “Cool Papa Bell” is named after the fastest runner in the Negro Leagues, before baseball was integrated, while “The Riverbank” depicts the funeral of a veteran who committed suicide. The title song reflects on songwriting and romance: “Love endures all the carnage and the useless detours,” Mr. Simon sings. The music on “Stranger to Stranger” exults in percussion four of the album’s first six tracks don’t use guitar at all. The songs often stretch beyond pop’s typical four minutes and take startling (but in the end logical) twists. They subtly cohere, with some songs sharing rhythmic elements they also continue to expand Mr. Simon’s sonic vocabulary with unique instruments as well as with electronics, loops and samples. Mr. Simon has often been called a perfectionist, but Mark Stewart, a guitarist in Mr. Simon’s band since 1998, calls that a “ ” description. “It’s more of a sonic safari,” Mr. Stewart said. “You’re looking for the rare bird. And he’s just so consistent in his finding the bird. And of course, we’re all assembled to help. But you can’t finish a musical sentence for the guy. He’s going to stay on the trail till he finds it. ” The album’s snappiest song, “Wristband,” starts as a fictional anecdote and turns into a larger metaphor for privilege. Its narrator is a singer who goes out for a smoke, hears the stage door lock behind him and realizes he left behind his   wristband as he faces a bouncer who’s “a     . ” Eventually, riots ensue among “Kids that can’t afford the cool   anger is a   you’ll never get a wristband. ” The music for “Wristband” grew out of the sliding tones of a West African talking drum track. Mr. Simon asked Carlos Henriquez, from the Lincoln Center Jazz Orchestra, to duplicate them on the bass, and found a stretch that felt like a montuno, a Latin dance vamp. Mr. Simon’s son Adrian pointed him toward the electronic music of an Italian producer, Digi G’Alessio, who calls himself Clap! Clap! Mr. Simon met with him while touring Europe with Sting and later visited his studio in Sardinia to choose some bubbling electronic syncopation. There are also handclaps from a flamenco group  —   Mr. Simon recorded the whole group together and isolated the clapping, then slowed it down digitally  —   along with percussion and horns from Mr. Simon’s touring band. And the whole multitracked assemblage simply jumps. The album’s sounds also include instruments invented by the composer Harry Partch  —   among them chromelodeon and   bowls  —   that divide an octave into 43 steps, which are used to bend the harmonic ambience of “Insomniac’s Lullaby. ” And they include the gospel voices of the Golden Gate Quartet, recorded in 1939,   and played forward and backward. Listening to the group’s vocals in reverse, Mr. Simon heard the words, “Street Angel,” giving him a song title and a character mentioned in two of the album’s songs: a homeless,   schizophrenic who ends up in the hospital. “Too much dopamine, and you’re schizophrenic,” Mr. Simon said. “But just over here, and you’re a visionary. ” “Proof of Love” features a     groove and intertwining guitar parts that Mr. Simon worked out with the Cameroonian guitarist Vincent Nguini, who has been part of his band since he made “Graceland” in the 1980s. Its lyrics grew out of a trip Mr. Simon made to a spiritual healer in Brazil in 2014. “I like spiritual adventures,” he said. “I half believe it and I half don’t believe it. But the half that believes it really likes it. ” At one point, Mr. Simon was asked to make music for some of the healer’s other visitors. Someone handed him a guitar and he started to play “The Sound of Silence,” approaching one person at a time. “As I walk toward people they start to weep and fall down,” he recalled. “I walk from room to room and everywhere it happens the same way. This is a big energy thing that’s going on, but I’m not controlling it. I don’t know why they’re doing this, and I don’t know if it’s good or bad. ” Mr. Simon is already on tour, mostly playing theaters, although his New York City date is on June 30 at Forest Hills Tennis Stadium in Queens, where he grew up. His band convenes Africans (Mr. Nguini and Bakithi Kumalo, from the Graceland band) contemporary classical musicians (from YMusic, Bang on a Can   and the Philip Glass Ensemble) a percussionist (Jamey Haddad) who’s versed in jazz, Middle Eastern and Indian music, a   saxophonist (Andy Snitzer) an accordionist adept at   zydeco and blues (Joel Guzman) and a drummer from Nashville, Jim Oblon, who “knows the sound of rockabilly and ‘50s blues that I’m always trying to get,” Mr. Simon said, noting that all his influences “mesh together” live. “So all kinds of forms can coalesce in some way that breaks this feeling that we’ve been dumbed down. ” With the band, Mr. Simon also finds new grooves for older songs. “He wants to honor the story of the song, not necessarily the original arrangement,” Mr. Stewart said. “How do you honor that story now? That’s the question he asks himself, and how can he do that song for the 2, 000th time and believe it. ” Mr. Simon is well aware that he’s had an exceptionally long career. “I often think, I don’t have to do this. I’m doing the idea I had when I was 13,” he said. “Sixty years later, it’s a   ’s idea. Do I still want to do it? That’s a good question. I usually ask it when I start off on each album. Then I start. I grumble, I grumble, and then some idea comes along. And I always say this after every album: I really don’t know if I want to do it again. But this time I really do mean it. ” He shrugged. “But I always mean it. ”'"}, "time": 1742628450.451705}