{"duration": 0.016049623489379883, "input_args": {"text": "'By Sean Colarossi on Mon, Oct 31st, 2016 at 9:52 pm Trump used a “tax avoidance maneuver so legally dubious his own lawyers advised him that the Internal Revenue Service would likely declare it improper if he were audited.” Share on Twitter Print This Post \\nWhile Donald Trump has repeatedly said he took advantage of loopholes that allowed him to legally pay nothing in federal income taxes for decades, the New York Times reported on Monday that Trump may have actually crossed a legal boundary to avoid paying his fair share. \\nAccording to the Times, the Republican nominee used a “tax avoidance maneuver so legally dubious his own lawyers advised him that the Internal Revenue Service would likely declare it improper if he were audited.” \\nThe report: \\nTax experts who reviewed the newly obtained documents for The New York Times said Mr. Trump’s tax avoidance maneuver, conjured from ambiguous provisions of highly technical tax court rulings, clearly pushed the edge of the envelope of what tax laws permitted at the time. “Whatever loophole existed was not ‘exploited’ here, but stretched beyond any recognition,” said Steven M. Rosenthal, a senior fellow at the nonpartisan Tax Policy Center who helped draft tax legislation in the early 1990s. \\nMoreover, the tax experts said the maneuver trampled a core tenet of American tax policy by conferring enormous tax benefits to Mr. Trump for losing vast amounts of other people’s money — in this case, money investors and banks had entrusted to him to build a casino empire in Atlantic City. \\nThe reason that Trump bent over backward – and potentially broke laws – to avoid paying these taxes is because he was scrambling to “stave off financial ruin.” \\nThis is the same man who claims he would be a great president because of his “successful” business background. \\nYet, he calls himself the “king of debt.” His businesses have declared bankruptcy six times. He has spent decades paying zero dollars in federal income taxes. He lost a billion dollars in a single year running a casino business. Reporting out tonight even suggests that he has direct financial ties to Russia. \\nAll of this is just the tip of the iceberg when it comes to his business background. \\nEven as all of this information is out there, American voters still know very little about Donald Trump’s finances because he has refused to be transparent about them. \\nAnd consider this: What Trump is hiding in his tax returns must be much worse than the already damning information that keeps coming out through good reporting. If it weren’t, he would have already released them. \\nThe latest New York Times story is just the latest installment of Trump’s shady business background. The media should spend the remaining week of this campaign demanding more answers from a man who wants to be in charge of the country’s pocketbook.'"}, "time": 1742628495.3569398}