{"duration": 0.015810489654541016, "input_args": {"text": "'Betsy DeVos has accepted the position of education secretary for President-elect Donald Trump’s cabinet. On Nov. 23, 2016, the Trump transition team verified the appointment, according to NBC News. Trump stated, “Betsy DeVos is a brilliant and passionate education advocate.”\\nThe 58-year-old hails from Michigan where she is the chairman of the board for the American Federation for Children. DeVos is a strong proponent of education vouchers and charter schools.\\nTrump believes they will end the political stranglehold that prevents American children from succeding. He further states the overall plan is to establish programs that will bring the schools up to par with the rest of the world.\\nSince DeVos contends that charter schools and vouchers are a good idea, enacting this policy will likely bring school choice for every child and family in America.\\nJohn F. Kirtley, the vice chairman of the foundation issued a statement of congratulations for his colleague’s appointment. “We applaud [Trump] for choosing and placing his trust in Betsy DeVos to serve as the next U.S. Secretary of Education,” wrote Kirtley.\\nThe American Federation for Children is a national advocacy organization that promotes the fact that family choice for the education of children, kindergarten through grade 12, is essential. They support Education Savings Accounts (ESAs), which is a voucher program that allows parents to choose whatever school they deem best for their children, particularly private and home schools. They further advocate the need for school choice and scholarship tax credit programs.\\nWritten by Cathy Milne\\nSources:\\nNBC News: Trump Selects Charter School Advocate Betsy DeVos as Education Secretary\\nAmercian Federation for Children Website: Mission Statement\\nAmerican Federation for Children Website: AFC Congratulates Betsy DeVos on Nomination for U.S. Secretary of Education #CMJournalist , DeVos , Donald Trump , Education Savings Accounts , Michigan'"}, "time": 1742628487.8244815}