{"duration": 0.05565476417541504, "input_args": {"text": "\". Chelsea Clinton Being Groomed to Buy Seat in Congress by NWO Handlers —& 'Clinton Cash' Documentary While some pundits are declaring the Clinton political dynasty dead, sources tell us that it is far ... Print Email http://humansarefree.com/2016/11/chelsea-clinton-being-groomed-to-buy.html While some pundits are declaring the Clinton political dynasty dead, sources tell us that it is far from over. Chelsea Clinton is being groomed for the New York seat held by Rep. Nita Lowey. Chelsea Clinton could run for the seat in NYC’s 17th Congressional District once Lowey, a respected, 79-year-old career politician with nearly 30 years in office, decides to retire, we have exclusively learned. Lowey’s district includes parts of Rockland and Westchester counties and, conveniently, Chappaqua, the Clinton family home base. Continuing the Clinton Crime Brand If you thought for one, fleeting second that the Clintons would just somehow walk away after Crooked Hillary’s rejection by the American people, think again. There are many more billions to be made, and many more state favors to sell and trade. So the baton gets passed to Chelsea. Congresswoman Chelsea Clinton. Thanks for the Congressional seat, mom and dad! In August, Hillary and Bill Clinton purchased a home next door to their primary residence in Chappaqua for $1.16 million, which is intended for Chelsea, her husband, Marc Mezvinsky, and their two children, Charlotte and Aidan. While Chelsea currently lives, and is registered to vote, in Manhattan, she could easily make Chappaqua her legal residence in order to run for Lowey’s seat when it becomes vacant. A source told us: “While it is true the Clintons need some time to regroup after Hillary’s crushing loss, they will not give up. Chelsea would be the next extension of the Clinton brand. “In the past few years, she has taken a very visible role in the Clinton Foundation and on the campaign trail. “While politics isn’t the life Hillary wanted for Chelsea, she chose to go on the campaign trail for her mother and has turned out to be very poised, articulate and comfortable with the visibility.” The source continued: “There has been a lot of speculation within New York Democratic circles about Lowey’s retirement and Chelsea running for the seat. There is a belief that Chappaqua is a logical place for Chelsea to run, because it would be straightforward for her to raise money and build a powerful base.” A spokesperson for Lowey — who is serving her 14th term in Congress and was first elected to the House of Representatives in 1988 — declined to comment. A spokesperson for Chelsea didn’t get back to us. Clinton Cash — Official Documentary By Emily Smith  \""}, "time": 1742561861.8020334}