{"duration": 1.2879233360290527, "input_args": {"text": "'It Is Mathematically Impossible To Pay Off All Of Our Debt   May 21st, 2015 \\nDid you know that if you took every single penny away from everyone in the United States that it still would not be enough to pay off the national debt? Today, the debt of   exceeds $145,000 per household, and it is getting worse with each passing year. Many believe that if we paid it off a little bit at a time that we could eventually pay it all off, but as you will see below that isn’t going to work either. It has been projected that “mandatory” federal spending on programs such as Social Security, Medicaid and Medicare plus interest on the national debt will exceed total federal revenue by the year 2025. That is before a single dollar is spent on the U.S. military, homeland security, paying federal workers or building any roads and bridges. So no, we aren’t going to be “paying down” our debt any time in the foreseeable future. And of course it isn’t just our 18 trillion dollar national debt that we need to be concerned about. Overall, Americans are a total of 58 trillion dollars in debt. 35 years ago, that number was sitting at just 4.3 trillion dollars. There is no way in the world that all of that debt can ever be repaid. The only thing that we can hope for now is for this debt bubble to last   before it finally explodes. \\nIt shocks many people to learn that our debt is far larger than the total amount of money in existence. So let’s take a few moments and go through some of the numbers. \\nWhen most people think of “money”, they think of coins, paper money and checking accounts. All of those are contained in one of the most basic measures of money known as M1 . The following definition of M1 comes from Investopedia … \\nA measure of the money supply that includes all physical money, such as coins and currency, as well as demand deposits, checking accounts and Negotiable Order of Withdrawal (NOW) accounts. M1 measures the most liquid components of the money supply, as it contains cash and assets that can quickly be converted to currency. \\nAs you can see from the chart below, M1 has really grown in recent years thanks to rampant quantitative easing by the Federal Reserve. At the moment it is sitting just shy of 3 trillion dollars… \\nSo if you gathered up all coins, all paper currency and all money in everyone’s checking accounts, would that even make much of a dent in our debt? \\nNope. \\nWe’ll have to find more “money” to grab. \\nM2 is a broader definition of money than M1 is, because it includes more things. The following definition of M2 comes from Investopedia … \\nA measure of money supply that includes cash and checking deposits (M1) as well as near money. “Near money” in M2 includes savings deposits, money market mutual funds and other time deposits, which are less liquid and not as suitable as exchange mediums but can be quickly converted into cash or checking deposits. \\nAs you can see from the chart below, M2 is sitting just short of 12 trillion dollars right now… \\nThat is a lot more “money”, but it still wouldn’t pay off our national debt, much less our total debt of 58 trillion dollars. \\nSo is there anything else that we could grab? \\nWell, the broadest definition of “money” that is commonly used is M3 . The following definition of M3 comes from Investopedia … \\nA measure of money supply that includes M2 as well as large time deposits, institutional money market funds, short-term repurchase agreements and other larger liquid assets. The M3 measurement includes assets that are less liquid than other components of the money supply, and are more closely related to the finances of larger financial institutions and corporations than to those of businesses and individuals. These types of assets are referred to as “near, near money.” \\nThe Federal Reserve no longer provides charts for M3, but according to John Williams of shadowstats.com , M3 is currently sitting somewhere in the neighborhood of 17 trillion dollars. \\nSo even with the broadest possible definition of “money”, we simply cannot come up with enough to pay off the debt of  , much less the rest of our debts. \\nThat is not good news at all. \\nAlternatively, could we just start spending less than we bring in and start paying down the national debt a little bit at a time? \\nPerhaps that may have been true at one time, but now we are really up against a wall. Our rapidly aging population is going to put an enormous amount of stress on our national finances in the years ahead. \\nAccording to U.S. Representative Frank Wolf , interest on the national debt plus “mandatory” spending on programs such as Social Security, Medicare and Medicaid will surpass the total amount of federal revenue by the year 2025. That is before a single penny is spent on homeland security, national defense, paying federal workers, etc. \\nBut even now things are a giant mess. We are told that “deficits are under control”, but that is a massive hoax that is based on accounting gimmicks. During fiscal year 2014, the U.S. national debt increased by more than a trillion dollars . That is not “under control”– that is a raging national crisis. \\nMany believe that that we could improve the situation by raising taxes. And yes, a little bit more could probably be squeezed out of us, but the impact on government finances would be negligible. Since the end of World War II, the amount of tax revenue taken in by   has fluctuated in a range between 15 and 20 percent of GDP no matter what tax rates have been. I believe that it is possible to get up into the low twenties, but that would also be very damaging to our economy and the American public would probably throw a huge temper tantrum. \\nThe real problem, of course, is our out of control spending. \\nDuring the past two decades, spending by   has grown 63 percent more rapidly than inflation, and “mandatory” spending on programs such as Social Security, Medicare and Medicaid has actually doubled after you adjust for inflation. \\nWe simply cannot afford to keep spending money like this. \\nAnd then there is the matter of interest on the national debt. For the moment, the rest of the world is lending us gigantic mountains of money at ridiculously low interest rates. However, if the average rate of interest on U.S. government debt was just to return to the long-term average, we would be spending more than a trillion dollars a year just in interest on the national debt. \\nSo the best possible environment for “paying down our debt” that we are ever going to see is happening right now. The only place that interest rates on U.S. government debt have to go is up, and our population is going to just keep getting older and more dependent on government programs. \\nMeanwhile, our overall debt continues to spiral out of control as well. According to CNBC , the total amount of debt that Americans owe has reached a staggering 58.7 trillion dollars… \\nAs the nation entered the 1980s, there was comparatively little debt—just about $4.3 trillion. That was only about 1.5 times the size of gross GDP. Then a funny thing happened. \\nThe gap began to widen during the decade, and then became basically parabolic through the ’90s and into the early part of the 21st century. \\nThough debt took a brief decline in 2009 as the country limped its way out of the financial crisis, it has climbed again and is now, at $58.7 trillion, 3.3 times the size of GDP and about 13 times what it was in 1980, according to data from the Federal Reserve’s St. Louis branch. (The total debt measure is not to be confused with the $18.2 trillion national debt, which is 102 percent of GDP and is a subset of the total figure.) \\nAs I discussed above, there isn’t enough money in our entire system to even pay off a significant chunk of that debt. \\nSo what happens when the total amount of debt in a society vastly exceeds the total amount of money? \\nIs there any way out other than collapse? \\nYou can share what you think by posting a comment below… Greece Says That It Will Default On June 5th, And Moody’s Warns Of A ‘Deposit Freeze’ » kfilly \\nNope, we are a run away freight train gaining speed before we get to Dead Man’s Curve. This is not going to end well. As usual, this is another great article. MichaelfromTheEconomicCollapse \\nThank you for the kind words kfilly. SunnyFlaSnotress \\nYou know other countries owe us money too This is a very one-sided, biased article. fortunato \\nNot my problem and I don’t care how much money our government racks up in debt. \\nAfter all what can we the people do about it? Nothing. Absolutely nothing. \\nThis problem will never end and the debt will only grow larger and larger. All governments all over the world are the same way. State and local too. \\nIf the majority of people started doing the underhanded things that the elites do I can guarantee you that the scales would tip back in our favor not theirs. \\nThey did a study on the human brain and it showed that the more money a person has the greedier and self centered they became. Google it to read the article. df NJ \\nYou’ve probably heard that power corrupts. I read in a psychology book an idea called the metamorphic effect of power. The idea is whenever someone successfully influences another person it changes the powerholder’s psyche. We the powerholder develops a contempt for the person they perceive they have power over. The greater the power the more contempt. Eventually the powerholder thinks the people under their influence as non-human being insects who can be killed or squashed without any moral consequence. gts58 \\nYou’ve just described Obama perfectly! Cannonfodder2010 \\nHe described EVERY politician perfectly. Donald Trump would take it to a much higher level. none \\nThank God President Obama has been taking his multi-million dollar vacations. At taxpayer expense. It will not cost the taxpayers anything! Since they cannot pay it back. And with all the money that he has and will make from his investments in the stock market. Along with his pension and other investments he should end up doing very well. goldfinger \\nNot only that but we the people also fund the generous pension and health insurance plan that congress choose for themselves. \\nHeck even in congress if you get convicted of a crime you never lose your pension or health benefits. \\nIsn’t American wonderful? Thomas Keith \\n“It will not cost the taxpayers anything! Since they cannot pay it back.” First, you need an English lesson, since you obviously don’t know the difference between a clause and a sentence. That aside, yes, there will be payment in the form of a deeper, longer depression. _aleph_ Nemnor \\nfortunato, you stated –“…After all what can we the people do about it? Nothing. Absolutely nothing…”. \\nActually, Governments do as they do, as long as the mass of the people let it be. As long as the people do not have the will and the courage to demand the change they want. \\nHowever, people are kept under “control” by using various means to divide and distract them. The major Media Networks and the Educational system are the two main non-violent “arm” the Ruling Class use to “control” the masses. AND, where the non-violent “arm” fail, then the violent “arm” (i.e. the Army and Police) is used accordingly. \\nSo it takes UNITY and a lot of COURAGE for the masses to have the change we want, and we CAN do something, but it begins with having the WILL to do what we wish to do.. \\nDon’t forget the corporate toxic food chain which leads to the mass addiction to pharma mafia given the dis-ease/obesity epidemic that fuels medical costs….everything IS connected to ‘dummy’ down the masses. gts58 \\nYour second paragraph says it all. Thomas Keith \\nYou don’t care how much debt your government racks up? Fool, it’s you and the rest of the citizenry who the world will look to for repayment. The world honors the US’s request for more credit (for no. at least) because of the US government’s ability to tax its peoples. Keeping your head in the sand won’t save you. _aleph_ Catman \\nThis is why the politicians have no plan to do deal with the national debt: it cannot be fixed. They already know what you so well explain. The economies of the world depend on more debt through fractional reserve banking and treasury bond purchases to create more money to pay the interest and keep from sliding into a depression. This will not end with a fiscal policy. There is no brake on this rig. I recently had a dream where I was driving a car on which the brakes did not work. Very frustrating. Well, I have no debt, but perhaps it speaks to the sense of being carried along with little recourse other than to just keep the car in the middle of the road and try not to hit anything or anyone. I think a lot of us feel like that in life: we have no control, we can’t get off the roller coaster, and one way or the other we’re all in this together. Christoph Weise \\nPoliticians are not in the drivers seat. It is certain that 99% of them do not understand money policy and central bank politics. It is the central banks that drive the developments Rukander \\nOnly 4.3 trillion before Ronald Reagan and de printing money. df NJ \\nWhen disaster strikes most Americans stick together and help each other. My hope is when the time comes we rise above our petty partisan politics and unite as one people with one country under God. \\nWe the People   in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America. \\nAre we really going to let a small group of sadist European bankers destroy this once great country? Christoph Weise \\nThe path is set by the FED, although agreeably the Bank of Japan (BoJ) was the first to introduce QE. European central bankers look to be followers. df NJ \\nJapanese sadists are just as bad as the European sadists. sherlock32555 \\nYep Just look around you and you will answer your own question. The people stood by and let it happen. Their is no self preservation anymore. It was lost years ago when the people knew that the government would take care of us. jsmith \\nDon’t forget to include the tribal 5th column that owns the country. Mike \\nWhose the tribal 5th column? jsmith \\nAre you playing coy or just being ignorant? I’m sure someone will enlighten you. Nemnor \\ndf NJ, a “…small group of sadist European bankers …” (as you put it) are only a symptom of a much wider and more fundamental cause of the issues facing the USA. \\nThe main root cause of the worsening socioeconomic issues in the USA (and the World), is – the Capitalist system itself – which has became decadent, is at a “dead end” and is NOT able to generate long-term recovery by economic means alone . \\nThe world-wide Capitalist system became decadent as it reached a level of general over-production . With over-production, it became harder and harder for the Capitalist to sell their products/services, for even what the Capitalist consider a reasonable profit. \\nHence, the reason the Capitalists (irrationally) engage more and more in “Share Repurchase”/”Stock Buyback” (to ARTIFICIALLY raise the value of a company’s stock), and/or invest in “financial bubbles”, “derivatives” and other exotic “financial instruments” ( even lend money to people that are not credit worthy ), and with many of these “investments” having little or not relations to the real economy!!! \\nThere is NO going back to the “good ole days” of the USA, or going back to “real”/”pure”/”free market” Capitalism , because Capitalist USA already passed it’s progressive stage and is now at a “dead end”. \\nThe real solution can only be with a fundamental change away from Capitalism , as no amount of “reforms” could ever fix Capitalist USA. HeyAHuman \\nThis has been an economic system built upon debt since the creation of the Federal Reserve. It would have been easily known beforehand that this would burst and cause chaos. Why has it been allowed for so long? Insane. Bill \\nSame reason we have an imposter in the White House. We the sheeple do not have the fortunes needed in order to run for an office that would allow us to make a difference. Voting is too manipulated to make a difference. \\nRobots are the future of sheeple who don’t require daily feeding. Bob332 \\nThis country is now officially in the toilet. Will the last person to flush, please turn off the bathroom light. nekksys \\nJust have the attendant do it as you flip him your last coin… Christoph Weise \\nWe have long passed the point at which repayment of debt could have been possible. Maybe it was never possible. I have heard that there is always more debt in the system than money to repay it. That is the nature of the fractional reserve system. Central banks world wide have decided 2009 not to bother about racking up debt. They are printing money and providing it to financial institutions as needed. We have now two different circulation systems. One is the old system. It comprises of individuals and corporations. The traditional debt limits apply. Bankruptcy and insolvency are possible. Than we have the newly created second circulation system. It comprises of central banks and systematically important lenders. These organisations can not bankrupt or become insolvent. They have escaped from the ordinary circulation system and are eternal. De facto we are faced now with a two class system. This is the departure from market economy. And it is problematic in many aspects. Some of them: (1) The change to our system has never been properly explained and is kept as a secret (2) The political bodies never made a decision on this change (and thus it is illegal and because of its illegality central banks are engaged in criminal activity) (3) Before the law all people should be equal. This principle is violated by the introduction of the principle of eternal economic life and could only be trumped by the introduction of eternal biological life for a limited set of individuals. The question arises if the second circulation system is indeed eternal. There may be limits but I never saw a comprehensive discussion of the topic. I presume it would take a single global currency to avoid a systemic default. But I am not sure. It looks like the can kicking strategy has a very long life. GSOB \\n“I presume it would take a single global currency to avoid a systemic default. ” \\nMe too. JailBanksters \\nIronically, Every dollar in your Wallet had to be loaned into existence for you to have it, it represents Debt not Wealth and it belongs to the Banking Cartel. You could take that dollar back to the Club FED to extinguish that loan, but you have to pay the Interest on that Dollar. Where do you get the Money from to pay back the Interest on that Dollar, the Club FED of Course. And then you’d have to pay the Interest on that as well. By all definitions of a Ponzi Scheme, the Club FED is a Ponzi Scheme where you pay one debt by creating another debt to infinity. This ensures that nobody can never own more than the Banking Cartel. It’s an absolute brilliant scam, and it’s been going on for 100 years, with one re-invention for Gold-Standard and another time for Credit Cards to overcome the 45 year limit on Fiat Money. Richard \\nI can’t help wanting to thank you, Michael, for adjusting the manner of your prose in recent posts. They have become a joy to read. You seem to have removed all the cliches and annoying repartee. Maybe nobody else appreciates this but I can only express own, continued appreciation for the “New You”! Thank you. \\nDidn’t you write this before? nobody \\nActually Michael is wrong: it’s perfectly possible to pay off the entire debt in less than 5 years. All they need to do is to cut all welfare and military funds and eliminate all tax discounts. But that will never happen. nekksys \\nThis idea doesn’t account for paying off PERSONAL debt as opposed to GOVERNMENT debt. \\nAnd, as someone already pointed out, when the first $11T is paid back, the “money” it represents disappears, therefore a vast amount of the M1 will vanish into thin air leaving only the hard currency which can not be distributed sufficiently throughout the population to effect an further debt payments. \\nIn other words, no matter how you slice it, we’re all pretty much F’d in the A thanks to the recklessness of our government and the banksters. nobody \\nSo a bunch of banks will go under – more power to the big ones, you lose, they win. Actually it won’t disappear since it has never existed to begin with and it will just be created elsewhere. BTW your hard currency has stopped having any power a long time ago, now it’s just a bunch of paper and it’s worth only what the issuing bank says it’s worth. And no, gold by itself isn’t worth anything since it can be taken from you at the whim of the government. nekksys \\nHard Currency = Paper and Coin… I wasn’t referencing buying power either. I was referring to the ACTUAL M1. \\nPlease try to keep up. nobody \\nActually that’s incorrect: a hard currency is a means of payment (usually a currency but it can also be a commodity) that is well and widely trusted and used for savings. Also called safe-heaven currency. Please use the correct terms from now on. nekksys \\nTypical… When folks like yourself start losing the debate, you shift and try to muddy the waters. Nice try, though! Considering your previous statement “BTW your hard currency has stopped having any power a long time ago” in light of your most recent redefinition of “hard currency,” I guess that means all commodities in my possession are worthless as well? Last I checked, a pound of iron was still a pound of iron and still possesses the same value. \\nAgain, the M1 was what I was referencing. The M1 is the actual, hard currency in circulation. M1 doesn’t consider commodities as part of the equation. \\nPlease, if you choose to redefine something, make sure you haven’t used the same term previously… And do keep up with the conversation. nobody \\nNo, a pound of iron is an asset, that has it’s own value. No, M1 isn’t a representation of hard currency, it’s just an index detailing the total amount of money in an economy – which includes absolutely everything, even those that exist only as electronic vapour. Please try to keep up, or at least get a basic economy/banking course at your local free college. nekksys \\nAwww… Look! It can read (a little)… Again, judging by the current value of the M1, there’s no way it includes everything you claim. \\nFurthermore, you are still forgetting that once debt is repaid, ALL the currency it represents (whether real or “electronic vapour”) vanishes. Once the repayment process is underway, the available currency supply continues to diminish eventually leading to a ZERO currency state WITH remaining debt… nobody \\nAnd you know there’s no way because a little birdy told you so, right? Let’s be real, M1 is a government decided value and you will never have a say on it. Wrong again, it doesn’t disappear, it goes into the bank’s accounts as an asset, which is in turn used to create even more money by lending it/investing it at least twice its value. The problem appears when they no longer have legit ways to invest it so they invent things like the derivatives to absorb the surplus of money they have created. Yes you can, you can claim it will be used to make 1000 knives and sell derivatives on that in excess of $1k on it. For everybody that $1 lump of iron will now be worth $1k – and this procedure is entirely legal and legit. We’re not talking about honesty here, remember. alan \\nWhere are those trillion dollar coins they had about two years ago? \\nMint a couple hundred of them and we’re good. XSANDIEGOCA \\nAs long as we refuse to return to the Gold Standard, we shall continue to suffer. China understands this implicitly. All they have to do to drop us without firing a shot is to just threaten to tie the Yuan to Gold. Game Over. (BTW, the interest on our debt to China underwrites their entire Defense Budget!) Today the $20 bill is the equivalent to the $5 bill of my youth. Now there is serious talk of replacing the visage of Andrew Jackson, the man who saved America in the War of 1812, on that bill with a Slave. How utterly appropriate. Genada \\nAndrew Jackson would despise the idea of being on a bank note and especially of the modern day version of the one he destroyed. \\nFun fact about Jackson: Only president EVER to retire the national debt. XSANDIEGOCA Dwain Dibley \\nBack when Andrew Jackson was the president Gold was the money, somewhat hard to come by and it would be reasonable to assume a national debt. Today the money is Fiat, and all they have to do is print it. How can a government that can print the money to pay it’s bills, ever get into debt? And, what is it borrowing and what does it owe? This whole government “debt” thing seems kind of fishy to me….. Tranqual \\nHe killed the central bank and said it was his most important accomplishment. Then the bankers crashed the economy and blamed him. jsmith \\nYou seem to have connected the dots X, however you are probably very young because I’d like to think of the $20.00 bill as the new $1.00 bill. Back in 1963 whe I was 14, I could go to downtown Lost Angeles by bus to the movies, and see 3 matinee flics including milk duds and still have money left over from the 4 silver quarters my mom gave me! And yes, how appropriate that you noticed Andy Jackson being replaced by a slave. Why, Andie’s greatest quote is that he killed the bank and is one of America’s greatest heroes! And to quote Michael’s “The real problem, of course, is our out of control spending” yet we have one of our greatest termites in the form of John McCain and the others who want to increase defense spending because the Russian’s and primarily the Chinese are building up their defense spending, with our money. Insane. I was kind of hoping for a gradual collapse due mainly to money printing and inflation, but I’m afraid things are speeding up as the symptoms of impending crisis are being overlooked and exacerbated by our moronic president and termitic Congress. Either they are puppet fools, or part of the conspiracy to destroy our country. America is kaput! XSANDIEGOCA \\nAh, those were the daze! Actually, you are right. In my mind today’s 20 was yesterday’s 5. Anyway, too many “disturbances” in the Force. One good shove will do it, send the boulder crashing down the hill. Pick your scenario. Another terrorist attack. China moving on Taiwan. Iran heaving one into Israel. Then it will be “look out below!” Zenithon \\nAnd still if I pull out a $100 bill and try to pay for something, more times than not I get to hear that they won’t take anything larger than a $20. You can’t hardly get lunch or buy a movie ticket for less than $10 bucks and stores still act like that $100 bill is worth something. I could buy more at a grocery store with a $20 bill 25 years ago then I can get today with that c-note. Crazy. Tranqual \\nMoney masters know what they are doing.“Inflation has now been institutionalized at a fairly constant 5% per year. This has been determined to be the optimum level for generating the most revenue without causing public alarm. A 5% devaluation applies, not only to the money earned this year, but to all that is left over from previous years. \\n“At the end of the first year, a dollar is worth 95 cents. At the end of the second year, the 95 cents is reduced again by 5%, leaving its worth at 90 cents, and so on. By the time a person has worked 20 years, the government will have confiscated 64% of every dollar he saved over those years. By the time he has worked 45 years, the hidden tax will be 90%. The government will take virtually everything a person saves over a lifetime.” \\n— G. Edward Griffin \\n“By remaining behind the scenes, they (the Rothschilds) were able to avoid the brunt of public anger which was directed, instead, at the political figures which they largely controlled. This is a technique which has been practiced by financial manipulators ever since, and it is fully utilized by those who operate the Federal Reserve System today.” \\n– G. Edward Griffin \\n“[The] abandonment of the gold standard made it possible for the welfare statists to use the banking system as a means to an unlimited expansion of credit…. In the absence of the gold standard, there is no way to protect savings from confiscation through inflation. There is no safe store of value. If there were, the government would have to make its holdings illegal, as was done in the case of gold…. The financial policy of the welfare state requires that there be no way for the owners of wealth to protect themselves…. [This] is the shabby secret of the welfare statist’s tirades against gold. Deficit spending is simply a scheme for the ‘hidden’ confiscation of wealth. Gold stands in the way of this insidious process. It stands as a protector of property rights.”- Alan Greenspan in an article he wrote in 1966. \\nAnd then Greenspan went over to the dark side and worked for the Fed. \\n“By a continuing process of inflation, governments can confiscate, secretly and unobserved, an important part of the wealth of their citizens. By this method, they not only confiscate, but they confiscate arbitrarily; and, while the process impoverishes many, it actually enriches some. The sight of this arbitrary rearrangement of riches strikes not only at security, but at confidence in the equity of the existing distribution of wealth. Those to whom the system brings windfalls . . . become ‘profiteers’, who are the object of the hatred of the bourgeoisie, whom the inflationism has impoverished not less than the proletariat. As the inflation proceeds . . . all permanent relations between debtors and creditors, which form the ultimate foundation of capitalism, become so utterly disordered as to be almost meaningless.”– From pages 220-233 of The Economic Consequences of the Peace (1919), by John Maynard Keynes. You probably already know all this. XSANDIEGOCA \\nI did. I will send this on. States it all in one place. Tranqual \\npersonally I don’t think there’s anything we can do. Ultimately it’s God’s judgment. When Jackson killed the central bank they just crashed the economy. It would take a miracle for most people to even understand the screw job. If any leader came on the scene and tried to kill the Fed the bankers would just constrict the money supply crash the economy. Frankly I believe we are in the end game. Only repentance and revival would give us more time as a nation. Sadly I’m not optimistic about that either. We are already seeing the birthing of the apostate church. Trusting God will take care of the faithful remnant. Not looking forward to the days ahead. I wish Christians would have their eyes opened. We may be able to take part in a great harvest after America goes down. Maybe then people will listen…to the GOOD NEWS!! \\nWe shall have all eternity to celebrate the victories, but we have only the few hours before sunset in which to win them. Amy Carmichael \\nAgreed. Sadly, we face Gotterdammerung but that may be God’s plan too. XSANDIEGOCA \\n1971. We went off the Gold Standard. What happened next was utterly predictable. A dollar today is worth a fifth of a 1971 dollar. Nixon was the One! Preparequickly Dwain Dibley \\nThe legal tender dollar is worth exactly the same as it has always been worth, 100 cents. Now, the bankster’s “Credit Dollar” is another matter, it’s only worth 4 cents (excluding Wall Street and shadow banking system generated credit). But because people are too stupid and lazy to discern the difference, they equate the two as being one in the same and are apparently willing to die economically, firmly holding onto that erroneous belief. Tranqual \\nNixon was just following orders. The price of being president. They are all sock puppets. Obama, McConnell and Boehner all spooning together are the latest screw job is a perfect example. They are all treasonous traitors willing to sell their souls for a mess of pottage. O is dumb enough to think he’s creating his communist utopia. XSANDIEGOCA \\nThe betrayal on the TPP is truly astonishing! I would like to see a Third Party if only to vent my frustration. As I see it, Hillary wins. I write this with great sadness. Tranqual \\nvoting for an agreement we aren’t allowed to see! Is this America? We will see what congress will do, I’m not holding my breath. Horiboyable . \\nIt seems that the USA is using the Roman Template of self destruction. Over spend on your military and run up large debts. What next? Well Rome turned on its own people for cash which has happened many times in different societies. This leads to less freedoms and economic totalitarianism or they will take you to war to divert the issue. I think by the end of the year the average US citizen will begin to see how your government will treat you. I myself find this whole situation a little funny because I left my country of birth because of economic mismanagement of the state, that used laws to limit my freedom. I immigrated to the UK only to find myself facing the same situation. The UK has debts that they can never pay back and it will be interesting to see how they deal with it here. The honest way is to default. It is a bit sad when you have to keep moving countries just to survive. Genada \\nOnly choices on debts that can not be payed is either to default or to inflate them away. \\nYou can pay off the debt anytime you wish, it doesn’t mean it will be worth anything tho. df NJ \\nIt’s not going to end well. Hank Sullivan \\nMichael, the kicker is that each dollar that, because the entire currency supply is borrowed into existence, when one of those dollars gets paid back to the original issuer, which is your goal, that dollar ceases to exist. And so once $11 trillion, M2, is paid off to the original issuer, THERE’S NO MORE CURRENCY IN CIRCULATION TO RUN THE ECONOMY. Like the Germans during the Battle of the Bulge, the economy would completely run out of fuel. And we would still have $49 trillion left to pay. HedgeHog \\nRead Modern Money Mechanics, and part of the picture becomes clear, think of it this way, and it becomes crystal; if you and I are talking, and I ask to borrow a dollar, and there is no other money in existence, and you want to charge me 10 cents of interest, if I give you back the dollar to pay off the debt, where am I going to get the 10 cents? because every monetary instrument in circulation has debt attached to it, is the reason why the debt can never be repaid. Put the power to take care of the money supply back in the hands of congress, dissolve the fed, and several other adjustments that need to be made, and we might have a chance of coming out of this relatively unharmed. Maneb \\nHyperinflation is the answer. COMPLETLY destroy savers and persioners. Reward the reckless and lazy drug addicted street bums. That’s the way out. That’s what the U.S. HAS been doing. Become Zimbabwe! Obama’s model in well run Africa. His ancestral homeland. Transforming America! Congratulations suckers. Oh, did I mention martial law and tyranny…coming up soon. Just look around. Who cares about the rule of law or the constution? Again, that’s for poor suckers. Catch me if you can. Marx and Alinsky showed the way. nekksys \\nWow, that’s relevant… A lot has changed since that article was written in 2011… SunnyFlaSnotress \\nThank you for your style of constructive criticism /s While up-to-date numbers are difficult to find, the link DOES point out the blind spot in the article that makes it unbalanced and somewhat irrelevant. It totally ignores the fact that the USA is also owed massive amounts of money. guest \\nHow is it mathematically possible to get so far into debt that it’s mathematically impossible to get out of debt? df NJ \\ngoogle “fractional reserve banking system” \\nWe just can’t compete with the Federal Reserve’s power to put us into poverty. \\n“Give me control of a nation’s money and I care not who makes it’s laws” — Mayer Amschel Bauer Rothschild folgers22 \\nIt’s government. Anything is possible. folgers22 \\nSome of the brightest thinkers on their side actually believe debt is a sign of strength. They think the more debt we run up, the better it is for us. JackNMeovslo \\nAND THE ANSWER IS …. Democrats~ g13man \\nthey both agreed for each others spending , so they are both culpable ! Thomas Keith \\nThat’s easy. Fool your creditors into thinking you actually can pay back the loans plus interest. _aleph_ folgers22 \\nAnyone heard of Beppe Grillo? He’s a comedian/politician in Italy whose rants against debt and the EU have made him a hero to many Italians. He did a semi-serious bit years ago in which he explained Italy’s debt problems and discussed how to solve them. Here’s some of what he said: If there’s a borrower, there is supposed to be a lender, correct? Who do we owe this money to? TO OURSELVES! Fine, I owe it to myself. I claim it is nothing anymore and we’re square. Go to Hell!” Right? It’s a debt system, this is an awful system!– They issue money, but to whom does it belong? We are the state, so it belongs to us, don’t you agree? If the money belongs to us, then why do they lend it to us? There’s something not adding up, right? Once we used to have gold coins, they were ours. We had some gold and it was ours. Now we have a note that says 1000 Lira. Who does it belong to? On the bill it says “Bank of Italy” and “Payable to the Bearer on Demand.” If I go to the bank to demand that money, they won’t give me anything!– The bank of Italy is a private joint-stock company…we wil never know who they are. They issue money out of thin air and lend it to us. It’s the state that is supposed to issue it. The state should keep money circulation stable, keep prices stable. Yet, our money is issued by a joint-stock company. Money shouldn’t look like that! It shouldn’t say Bank of Italy, it should say Republic of Italy! It shouldn’t be signed by the governor of the Bank of Italy, it should be signed by the President! That would bring satisfaction to us all!– \\nLOL joe oberr \\nSimple question. Why does the gov’t have to borrow from a private financial institution, aka “the Fed”, in order to spend more than it takes in in taxes and thereby place this debt’s liability on future generations? Was not the gov’t able to, at least at some points in our history, simply print Treasury notes off the federal printing press and incur no consequential debt? folgers22 \\nI think the book explaining it is called, “The Monster from Jekyll Island.” The banksters 100 years ago met in secret in South Carolina to plan a better system. and their pets in Congress made it a reality. Here we are. JustanOguy \\nJust to let you know… Jekyll Island is in Georgia. df NJ \\nPolitics are pretty irrelevant at this point. But I thought this was funny: \\n“I’m still waiting to get trickled on by Reaganomics. It’s been more like a number 2. \\nCartels, monopolies, low wages, VOTE REPUBLICAN!” Lord Rainchild of LinkToIt-com \\nHi DJ, I really like your posts, and would like to stay in touch with you. I was trying to find that post where you mentioned ‘metamorphic contempt.’ I don’t know any other way to contact you except posting here. I was wondering if you can post to my disqus thread on linktoit-com – so I can dialog with you once in a while. I think tapping your mind would be helpful for the new news portal website that I am working on and also a booklet I am putting together that i intend to entitled What a Joke! – would really like to invite you there to linktoit dot com… + any others who might be reading this. Thank you! folgers22 \\nI’m not sure who has a better deal in this day and age-the prudent man who has no debt, or the debtor who totally throws caution to the wind and goes into hock up to his ears and takes out credit cards on his cat’s name, too. When the house of cards collapses, the prudent man with the bank account full of savings will probably see his money seized to pay for the emergency, while the debtor will probably be bailed out by the government using the prudent man’s money. What a Country! wheel \\nAin’t that the truth. Just like all the bailouts from the housing collapse with homeowners and speculators just walking away and leaving the taxpayer to pick up the pieces. \\nThe fact is if we could time it and know exactly when the collapse would happen I would recommend going hog wild on the spending and borrowing and give them all the finger when I declared bankruptcy. Gay Veteran \\nthe banksters gave out loans to people they knew could not pay, we should have let the banksters go bankrupt. we need banks, not any particular bank Nemnor \\nThe ‘banksters’ felt “compelled” to (IRRATIONALLY) “invest” as they do, not so much so because they are greedy or stupid, but rather, it is more so because of the Capitalist system in the USA (and the World) that has became DECADENT . \\nThis decadent Capitalist system is often labeled as –“corporatism”, or “socialism” or “crony capitalism” or “communism” or “fascism” or “welfare(ism)”, etc.. But regardless to the label, for the past 500 years or so, the the economic system in the World firmly remained Capitalism (in it’s ESSENTIAL form) . \\nThe Capitalist system became decadent as it reached a stage of general over-production . With over-production, it became harder and harder for the Capitalist to sell their products/services, for even what the Capitalist consider a reasonable profit. \\nHence, the reason the Capitalists (irrationally) engage more and more in “Share Repurchase”/”Stock Buyback” (to ARTIFICIALLY raise the value of a company’s stock), and/or invest in “financial bubbles”, “derivatives” and other exotic “financial instruments” ( even lend money to people that are not credit worthy ), and with many of these “investments” having little or not relations to the real economy !!! \\nOnce one becomes aware that the main root cause of the major socioeconomic issues facing the USA and the World is – Capitalism itself – which had became DECADENT (but labeled as “corporatism”, “socialism”, “fascism”, etc.), and that there is NO “real”/”pure”/”free market” Capitalism to go back to (because Capitalism ALREADY passed it’s progressive stage), then it becomes clear that any REAL/effective solution MUST include a fundamental change away from Capitalism (as no amount of “reforms” can ever fix Capitalism – which is now at a “dead end”). GSOB \\nHow Lovely are Your Dwellings! \\nFor a day in Your courts is better than a thousand outside. I would rather stand at the threshold of the house of my God Than dwell in the tents of wickedness. For the LORD God is a sun and shield; The LORD gives grace and glory; No good thing does He withhold from those who walk uprightly. O LORD of hosts, How blessed is the man who trusts in You! \\n\\nPraise to God for a Living Hope \\nPraise be to the God and Father of our Lord Jesus Christ! In his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead, and into an inheritance that can never perish, spoil or fade. \\nThis inheritance is kept in heaven for you, who through faith are shielded by God’s power until the coming of the salvation that is ready to be revealed in the last time. \\nIn all this you greatly rejoice, though now for a little while you may have had to suffer grief in all kinds of trials. \\nThese have come so that the proven genuineness of your faith — of greater worth than gold, which perishes even though refined by fire — may result in praise, glory and honor when Jesus Christ is revealed. \\nThough you have not seen him, you love him; and even though you do not see him now, you believe in him and are filled with an inexpressible and glorious joy, for you are receiving the end result of your faith, the salvation of your souls.'"}, "time": 1742562424.3968272}