{"duration": 0.09465312957763672, "input_args": {"text": "'The U. S. general in charge of the Middle East and North Africa said Thursday he has found no evidence of incompetence, poor   or bad judgment in a January special operations raid in Yemen. [Army Gen. Joseph Votel, the commander of U. S. Central Command, told the Senate Armed Services Committee that he conducted an “exhaustive”   review to understand exactly what happened on the January 28 raid, during which a U. S. Navy SEAL was killed and a $70 million aircraft was destroyed.  “I am looking for indicators of incompetence or poor   or bad judgment.   …     So what I can tell you is that we did an exhaustive   review on this,” he said. “It went down to a level including people who were on the specific objective. As a result of that, I was satisfied that none of those indicators that I identified to you were present,” he said. The ground raid to collect intelligence on   in the Arabian Peninsula (AQAP) the first ordered under the Trump administration, has become the source of significant controversy. Critics of the Trump administration have called the raid “botched,” claiming it had gone off track from the start. Navy SEAL Senior Chief Petty Officer William “Ryan” Owens was killed in the raid and three others injured. In addition, a   Osprey was destroyed. And in a messaging snafu, Centcom sent out a video obtained from the raid to show the significance of the intelligence collected, but journalists quickly discovered that the video had already been available online for years. Some unnamed U. S. officials have also told NBC News that the raid led to no significant or actionable intelligence. Owens’ father has also questioned the raid, which was reportedly approved five days into Trump’s administration, over dinner with his top military and national security advisers. Pentagon officials have pushed back hard, saying the intelligence found has been valuable and “potentially actionable. ” Trump further stoked controversy after an interview where he said “they lost Ryan,” referring to his generals, fueling critics who said he was shifting blame for the death. It is not clear exactly what Trump approved during dinner. A Pentagon spokesman said earlier this week Trump had delegated authority to approve missions, including the raid and airstrikes against AQAP, to Votel. According to a CNN extensive account of the raid’s approval, Votel recommended the mission during the Obama presidency to get a better intelligence picture of AQAP, considered the most dangerous   affiliate. Votel delivered the plan to the Pentagon on November 7, where Pentagon lawyers reviewed and approved the plan. The Pentagon signed off on the plan and sent it to the National Security Council on December 19. The Obama administration reviewed and discussed the plan but never approved it, former officials told CNN. A current White House official said the former administration discussed the raid on January 6 and decided it would be best conducted during a moonless night, which would occur after Trump’s inauguration, so the raid was not approved. Defense Secretary Jim Mattis received the plan on January 20, reviewed it, and sent it back to the NSC on January 24. It was presented to Trump on January 25. He reportedly gave the   during dinner but asked that deputy officials review it. He signed off on the plan the next day. The raid occurred two days later, on January 28. At a Washington, D. C. briefing Thursday, Votel took full responsibility for the raid and said it yielded “valuable” intelligence. “First and foremost, I am responsible for this mission. I am the Centcom commander, and I am responsible for what’s done in my region and what’s not done in my region, so I accept the responsibility for this. We lost a lot on this operation,” he said. He added: We lost a valued operator, we had people wounded, we caused civilian casualties, [and] lost an expensive aircraft. We did gain some valuable information that will be helpful for us. Our intention here was to improve our knowledge against this threat  —   a threat that poses a direct threat to us here in the homeland. And that was what we were focused on. Votel also announced that there were between four to 12 civilian casualties during the raid. He said he has not communicated with Owens’s family yet.'"}, "time": 1742562338.7295551}