{"duration": 0.07551717758178711, "input_args": {"text": "'Videos Saudi ambassador gives bizarre answer to illegal Yemen cluster bomb question:’It’s like asking if you’ll stop beating your wife Prince Abdullah Al-Saud clumsily dodges question about the Kingdom’s role in the 19-month-old Yemeni civil war, which has left more than 10,000 people dead.   Saudi Arabian ambassador to the US Prince Abdullah Al-Saud speaking to reporters at the 25th Annual Arab-US Policymakers Conference in Washington DC, October 27 2016 Screenshot via Zaid Jilani/YouTube \\nSaudi Arabia ’s ambassador to the US has evaded answering a question about Saudi Arabia’s alleged use of cluster munitions in the Yemeni civil war by answering, “This is like the question, ‘Will you stop beating your wife?’” \\n“Will you continue to use cluster weapons in Yemen?” a reporter from The Intercept asked Prince Abdullah Al-Saud, the Kingdom’s ambassador to the US, at the annual Arab-US Policymakers Conference in Washington DC last week. \\n“This is like the question, ‘Will you stop beating your wife?’” Mr Saud replied, laughing. When pressed on the same point, the prince said, “You are political operators… I’m not a politician.” \\nMr Saud went on to say that the Kingdom would contine bombing Houthi rebels in Yemen “no matter what it takes.” \\n“If anyone attacks human lives, and disturbs the border, in whatever region, we’re going to continue hitting them, no matter what,” he said. \\n“Anyone who wants to solve the Yemen problem should understand who is making all the problems.” \\nA Saudi-led coalition of Middle Eastern states began bombing Shiite Houti rebels in Yemen at the request of the exiled internationally recognised goverment in March 2015. \\nThe intervention has been heavily criticised by humanitarian groups, who allege that the Kingdom has dropped illegal cluster munitions – banned under international law because of the indiscriminate damage they cause – and also that the Saudi military capabilities are not sophisticated enough to avoid targeting civilian infrastrucutre, causing unneccessary loss of life. \\nMore than 10,000 people have died in Yemen’s conflict to date, the majority because of bombing on the capital Sanaa and other rebel-held cities, the UN says. \\nRebel counter attacks across the border have killed nearly 500 Saudi citizens, the Saudi envoy to the UN Abdallah al-Moallim said last month. \\nSaudi Arabia has opened an investigations task force into human rights violations caused by coalition bombing, but Human Rights Watch and several other international bodies have pressed for an independent inquiry. \\nRights groups have also called on Western nations to stop selling arms to Saudi Arabia and other Gulf nations, which they say are destined for use in Yemen’s 19-month-old civil war. \\nMr Saud was the keynote speaker at the 25th annual Arab-U.S. Policymakers Conference, which is funded by – among others – oil companies Chevron, ExxonMobile, and ConocoPhillips, and weapons manufacturers Lockheed Martin, Raytheon, and Boeing. \\nFormer Director of the Director of the Central Intelligence Agency, David Petraeus, also spoke at the summit, attended by business figures and US military officials. \\nThis article originally appeared on The Independent. Be Sociable, Share!'"}, "time": 1742563101.7550104}