{"duration": 0.09638261795043945, "input_args": {"text": "'Good morning.  Here’s what you need to know: • South Korea’s Parliament voted to impeach President Park   over a corruption scandal. Ms. Park has been suspended from office as the Constitutional Court considers whether to formally remove her from office. The court has six months to decide whether the charges are true and merit her ouster. Here are the accusations against her. Hwang   the prime minister, is the acting president while Ms. Park is suspended. And here are some of the contenders to replace her, including Ban   the departing United Nations secretary general. _____ • In the U. S.   Donald J. Trump is expected to name Andrew F. Puzder, a   executive, as secretary of labor. Mr. Puzder has opposed expanding overtime and raising the minimum wage. Here’s the latest on the transition. _____ • “This is all uncharted territory. ”  That’s the feeling in America’s auto industry, which expects to be reshaped by the Trump administration. A chief concern is Mr. Trump’s threat of tariffs on the millions of vehicles sold in the U. S. each year that were built in Japan, Korea and other countries. In Britain, Asian automakers want assurances from the government that “Brexit” won’t block their access to the European Union. _____ • President Hassan Rouhani of Iran has signed a wave of oil deals with Asian and European energy companies in recent weeks. “Our officials are in a rush to sign contracts with big oil companies in order to have leverage when Trump enters the White House,” said an economist with close ties to the government. _____ • A   state of emergency has been declared in the Aceh province of Indonesia, where a powerful earthquake on Wednesday killed more than 100 people and injured hundreds of others. “All the victims were crushed in collapsed buildings,” said a spokesman for the national disaster management agency. _____ • The dollar has surged since the U. S. election: up 8 percent against the Japanese yen and 10 percent against the Mexican peso. Against the Chinese yuan, the move has been less pronounced  —   just 1. 5 percent. But for emerging markets, accustomed to cheap dollar debt, the surge may signal instability in the future. • Michael Jordan owns the right to his name in Chinese characters, China’s highest court ruled, in a landmark decision for future trademark cases. • Microsoft acquired LinkedIn for $26. 2 billion. But there are ample reasons to be skeptical that the deal, the biggest by far in Microsoft’s history, will pay off. • Airbnb has faced regulatory battles in cities around the world. But New Orleans was able to gain concessions from the company that few other towns have received. • The gadget age is over, our columnist writes, and it could make life a lot less fun. • U. S. markets were up. Here’s a global snapshot. • Nguyen Ngoc Luong, a journalist who was essential to The Times coverage of the Vietnam War and refused an offer to be relocated, died in Ho Chi Minh City. He was 79. [The New York Times] • Foreign diplomats in India have lodged protests over the country’s limit on bank withdrawals. [CNN Money] • A recent cyber attack has Germany concerned about becoming a target of Russia’s campaign to destabilize Western democracies. [The New York Times] • Satellite imagery shows that Vietnam is dredging on a disputed reef in the South China Sea, which could anger Beijing. [Reuters] • Here’s a look at how the Pearl Harbor attack, 75 years ago this week, shaped the modern world. [The New York Times] • The Democratic Party may want to look to California in its search for future leaders. [The New York Times] • A city in Japan is keeping track of elderly dementia patients by sticking bar codes with personal data to their fingers and toes. [BBC] • Traveling to Sydney, Australia? We’ve got recommendations on how to spend 36 hours in the city. • John Glenn, the first American to orbit Earth, died on Thursday. He was 95. • In a Myanmar market, a paleontologist discovered a     chunk of amber with the feathered tail of a dinosaur trapped inside. • The recovery of a woman with advanced colon cancer, after treatment with cells from her own immune system, may help doctors develop new treatments for other patients. • And remember the trend of new bank notes featuring women that we told you about yesterday? Canada’s finance minister announced that Viola Desmond, a civil rights pioneer, will be the first Canadian woman on a note. On this day in 1917, the First World War was entrenched in some of its darkest days. The Allies were in a stalemate on the Western Front, and good news was in short supply. So it was a huge morale booster for the Allies when Turkish forces surrendered the holy city of Jerusalem to Britain’s Gen. Edmund Allenby. Prime Minister David Lloyd George called it “a Christmas present for the British people. ” The New York Herald’s front page proclaimed: “Jerusalem is rescued by British after 673 years of Moslem Rule. ” Jews in the city, inspired a month earlier by Britain’s Balfour Declaration in support of a Jewish homeland, rejoiced. Some Arabs, many of whom had been conscripted by the Ottomans, danced in the streets. Two more details: When General Allenby entered the Old City, he did so on foot and unfurled no flags, in a sign of respect. He also deployed Muslim troops to ease sectarian tension. Until he arrived, the mayor of Jerusalem had been scrambling to find a British official to whom he could cede control. An army cook who got lost while looking for food was initially asked. He declined, saying “I don’t want the city I want eggs. ” _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563583.4567096}