{"duration": 0.023856163024902344, "input_args": {"text": "'Wyoming (Wyo Stat SS22-19-108) \\nAs that same page writes: \\nOver the years, however, despite legal oversight, a number of electors have violated their state’s law binding them to their pledged vote. However, these violators often only face being charged with a misdemeanor or a small fine, usually $1,000. Many constitutional scholars agree that electors remain free agents despite state laws and that, if challenged, such laws would be ruled unconstitutional. Therefore, electors can decline to cast their vote for a specific candidate (the one that wins the popular vote of their state), either voting for an alternative candidate, or abstaining completely. The same corrupt democrats that have rigged the debates, rigged the polls, rigged the news media and rigged the justice system are now about to STEAL the election through bribery of Electors \\nNow it’s all becoming clear. Having failed to destroy Donald Trump despite the world’s most vicious barrage of lies and defamatory news slander, George Soros and the corrupt democrats have bribed enough Electors to “lock in” a victory for Hillary Clinton no matter what happens on election day . \\nWhat you’re going to see the night of Nov. 8th, in other words, is a landslide popular vote victory for Donald Trump , immediately followed by electoral votes handing the official election victory to Hillary Clinton. \\nThe theft of the presidency will be achieved thusly. And as you might expect, the American people are going to REVOLT en masse. We the People will not accept the theft of power and the nullification of democracy \\nWe the People will not accept the theft of power by a corrupt, criminal regime run by deceptive leftists who lie, cheat and steal their way to power at every election. The bribery of Electors is, of course, the nullification of democracy in America , since it means wealthy globalists can simply buy off the electoral votes and put anyone they want into the White House… the voters be damned. \\nWhen the American people realize their votes have just been nullified through massive bribery and corruption, they are going to revolt like we’ve never seen before. They will take to the streets in protest, and the greater the margin of victory in the popular vote by Donald Trump, the more angry the voters are going to be. \\nWe have quite simply reached the point in American history where the people will no longer tolerate the theft of power and massive election fraud that’s now routinely pursued by democrats (and especially Clinton operatives). If this election is stolen by George Soros via the bribery of Electors, I anticipate a full-on revolt where the military, the police and the citizens storm Washington and depose the corrupt Obama / Clinton regime and install the proper election winner as President. That would be Donald J. Trump, of course. \\nFrankly, We the People have every right to demand that democracy be restored . It is time to take America back from the thieving, lying commie bastards running the democrat party today.'"}, "time": 1742628475.2843058}