{"duration": 1.4840562343597412, "input_args": {"text": "'It’s hard to remember a time when the tense 2016 presidential campaign didn’t hog the airwaves and social media feeds. It has also sucked the oxygen at social gatherings, according to a number of New Yorkers who are regulars on the party circuit. At any recent outing, the acrimonious contest between Hillary Clinton and Donald J. Trump is the elephant in the room, the uninvited guest. The subject can derail restaurant conversation, make hostages of   guests and drive a wedge between host and guest. At a dinner with friends Saturday, the literary agent Chris Calhoun, thinking the conversation would be about a play they were about to see, found himself in a heated discussion of poll numbers,   races, the rise to celebrity of Kellyanne Conway and the barbs swapped by Mrs. Clinton and Mr. Trump at the recent Al Smith dinner, which, to his amazement, all of his fellow diners had watched live on CNN. “We were at the Library at the Public Theater, having dinner before seeing ‘Plenty,’” Mr. Calhoun said, “and we sort of agreed not to talk about politics, because we were exhausted by the subject. “But then someone remembered that one of the plot turns in the play revolved around the Suez crisis and the fall of the British government. But none of us could remember exactly what had happened and who the prime minister was then. So we went on Wikipedia and started to read out loud the bio of Anthony Eden, which included the description of him as the ‘puppet’ of the U. S. government. ” The word immediately reminded everyone present of the moment in the third presidential debate when the two nominees accused each other of being a puppet to President Vladimir V. Putin of Russia. “‘Puppet!’ we all cried out, and the next thing you know we were talking about the debate  —   ‘Putin’s puppet,’ ‘No, you’re the puppet’  —   and then went on to the Al Smith dinner,” he said. “We ended up spending the next hour rehashing the entire campaign, after we had sworn not to. Luckily, we finally realized that the curtain was about to go up or we might have been there all night. ” Alex Badia, the style director at Women’s Wear Daily, had a similar experience while dining with friends at Soho House. “At one point we said, ‘We have to stop talking about this,’” Mr. Badia said. “We talked about what we’re doing for Thanksgiving and very quickly we went back to Trump, back to the election. All roads lead to Trump. I just think it is so present in people’s minds. ” The subject of the campaign became so loaded for the novelist Jay McInerney that his wife, the publishing heiress Anne Hearst, has told him to steer clear of campaign conversation at the dinner parties they have hosted. Ms. Hearst made the request not long after Mr. McInerney lost his cool at a Southampton gathering where the guests were split between Mr. Trump and Mrs. Clinton. “The host went around the room and asked everybody who they were voting for and why,” Mr. McInerney said. “And emotions ran really high, to the point that I felt it kind of cast a little bit of a pall at the dinner party. Almost everybody gave an opinion, and mine was stridently  . ” He has tried to rein it in since then. “I think the subject became kind of toxic,” Mr. McInerney said. “We give a fair number of dinner parties out there, and Anne sort of cautioned me, ‘No politics.’ That’s never happened before. Usually, we do talk politics. A certain ‘don’t ask, don’t tell’ policy went into effect. ” Even among   party guests, the talk no longer flows as it used to during previous election cycles, instead devolving into   rants that can function as conversation killers. “It always comes up at some point,” said Wendy Goodman, a design editor at New York magazine who supports Hillary Clinton. “But even if people agree, I think this has been the most toxic, deranged campaign year I have ever known in my life. I think everybody is so beaten down by how depressing it is. ” Christophe Lirola, an investment banker in New York who supports Mr. Trump, has found himself in odd social situations because of his preference. He recalled a party at the Waverly Inn restaurant in Greenwich Village during which his boss sought him out on behalf of a guest who wanted to see a Trump supporter in the flesh, as if he were an exotic creature in the Manhattan wild. Mr. Lirola has also endured the awkwardness of finding himself among fellow party guests who come to realize he does not share their disdain for the Republican nominee. This happened recently, he said, when he was found himself among a group that included the socialite Lucy Sykes. “We were outside of the party, just catching some air, and they all started talking about the election, and it had just slipped her mind that I was supporting him,” Mr. Lirola said. “And then she just stopped herself and said, ‘Oh, my God, I’m so sorry.’ And I was like, ‘That’s O. K.’ That stuff happens. ” Asked if he found it difficult, when others in his circle assume he shares their views, Mr. Lirola said: “Well, no one wants to be called a racist. I’ve been called a racist because of this. Online and in person. ” Rachel Hruska MacPherson, a founder and the chief executive of the society and fashion website Guest of a Guest, bemoaned the effect of the campaign on the quality of social conversation. “My favorite thing is to go to a dinner party and talk about politics,” Ms. Hruska MacPherson said. “I love when there’s a healthy difference of opinion and it gets heated. In the past, everyone’s done this so respectfully, because we’ve had candidates who at least have had some substance. But this race has been unlike anything any of us have seen. ” She blames Mr. Trump for this side effect. “We want to talk about what Hillary’s campaign has done wrong,” Ms. Hruska MacPherson said. “Instead, he’s brought everyone down, and we’re forced to just rehash, like, ‘Can you believe it? ’” In that case, why not avoid the subject at social events? “We can’t help ourselves,” she said. “It’s the topic of conversation at every single thing I go to. ” The fashion publicist Bonnie Morrison has grown weary of all the campaign talk. “Everyone’s saying the same thing, and I think everyone has used their social media platforms to become pundits,” she said. “No one’s saying anything original. People are just baiting each other and trying to get reactions out of each other. There’s no real activism. What you actually had, I feel, with Obama is that people were really motivated to be involved. ” So what should people be doing instead of discussing the campaign? “People should be giving money to Haiti,” Ms. Morrison said. In previous campaign seasons, people interviewed for this article said, those who found themselves at different points on the political spectrum could voice their views with less risk of creating problems in social settings. Such is not the case this time around. The actor and director Lake Bell and her husband, the tattoo artist Scott Campbell, endured an awkward few days recently when a longtime friend of Mr. Campbell’s was staying at their Los Angeles home. The problem set in when the couple asked the houseguest to join them for their Sunday night ritual of watching “Last Week Tonight With John Oliver,” a show that consistently skewers Mr. Trump. “We retired to the comfy couches in the TV room with our   beverages and our kale popsicles that we pretend to like,” Ms. Bell said. “We said, ‘Do you watch John Oliver?’ And he’s like: ‘I’ve never heard about. Sounds interesting. I’d love to see it. ’” A few minutes into the show, they could sense something had gone awry. “We noticed he was getting really uncomfortable,” Mr. Campbell said of his friend, whom he has known since his youth in Texas and Louisiana. Ms. Bell tried to defend Mr. Oliver as an   satirist, to no avail. “At that point he got up and said, ‘Gosh, you know I’m feeling pretty tired and I feel like I might go to bed now, just because I don’t want my head to be clouded with all this kind of business before I go to sleep,’” Ms. Bell said. “So that was the polite sort of Southern gentleman way of excusing himself. ” As part of his work, Darren Walker, the president of the Ford Foundation, often attends social events with all kinds of people. Partly because of his experience in this regard, he has figured out how to defuse disagreements before they become standoffs. At a luncheon in Austin, Tex. where he had given a graduation speech for the University of Texas School of Law, he found himself seated next to a woman from South Texas. “She had the largest Rolex watch with diamonds I have ever seen,” Mr. Walker said. “And what happened was, she said: ‘Oh, you’re with the Ford Foundation? I’m sure I won’t agree with you on many things.’ And I said: ‘Actually, I’m sure we have lots in common. We both love our country. We both are proud to be Texans. And we’re both proud graduates of the University of Texas. ’” After having thus disarmed his tablemate, Mr. Walker managed to pull of a rare feat: a calm and candid conversation between ideological opponents. “It was a   conversation, punctuated by her sharing with me her views of why America is going to hell in a handbasket,” he said. “And my response was to try to understand her motivation. I genuinely wanted to understand how she and I saw things so differently. ” During the course of the conversation, the woman mentioned that her husband had warned her not to discuss politics in social situations. But Mr. Walker was glad she did, and his method may work for those who find themselves in a similar predicament in the days between now and Election Day. “I don’t think it’s helpful to vilify people you don’t agree with,” he said. “And I don’t see her as a villain. What I saw in listening to her was a privileged, white woman who is deeply disturbed by an America that looks less like her and more like me. “I can empathize with how threatening it must be to imagine an America that is more diverse. I said that to her. And she said: ‘I don’t have a problem with diversity. I just don’t like special treatment for some Americans over other Americans.’ It was a great conversation. And as she and I talked, she became more and more comfortable sharing things like that. ”'"}, "time": 1742563707.342732}