{"duration": 0.03761005401611328, "input_args": {"text": "'  ‘Steve   Star’ Posted at 9:03   \\nJoshua Green and Sasha Issenberg have a new piece out today for Bloomberg Politics that sure to make a few waves today. \\nFor the article, Green and Issenberg were given access to the Trump campaign’s data operation, which has been likened to a “political death star”: My takeaway from this @JoshuaGreen / @sissenberg joint: Steve   Star https://t.co/kX7sPMaDqz \\n— Blake Hounshell (@blakehounshell) October 27, 2016 \\nThis is actually a startling level of access, right? Especially with “12 days to go.” This seems like Trump has allowed Dems to see his actual playbook and what he’s going to do in these final days: 1. @sissenberg + I got exclusive access for our new @bw cover, “Inside the Trump Bunker, With 12 Days to Go” https://t.co/SW0StqXRep \\n— Joshua Green (@JoshuaGreen) October 27, 2016 2. Trump camp shared strategy, polling, ads, fundraising + showed off secret data ops, code-named “Project Alamo” https://t.co/SW0StqXRep \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nTrump’s son-in-law Jared Kushner has emerged as a huge player in all of this: 3. Led by Kushner, Trump team drew data from RNC, Cambridge, FB to make Alamo small-donor money machine w/list of 12 million names, BUT… \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nBut Trump knows he’s behind: 4. Trump campaign’s own internal election models show results “similar to” Nate Silvers — i.e. they know they’re losing badly. Single digits \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nTeam Trump does see a path to victory, however, with targeted negative ads: 5. They’ve ID’d 13.5 million persuadable voters in 16 battleground states + say they think they can still win — but not by going positive. \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nThis is the quote we’ll be hearing on every cable network today: “We have three major voter-suppression operations under way”: 6. Trump advisor: “We have three major voter-suppression operations under way,” including one targeting African-American voters: pic.twitter.com/Oz6UggoWal \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nThe campaign intends to use targeted Facebook ads to reach these folks, and by their own words, suppress the vote: 7. So Trump camp is targeted Facebook \"dark posts\" at Dem-leaning, but infrequent black voters to discourage them into staying home. \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nGreen and Issenberg go on to speculate on the future of Trump TV, arguing that what the Trump campaign has built fits perfectly into a new media launch of some sort: 8. Another takeaway from our story is possible plan for future Trump TV network. Trump\\'s spending campaign $ to build massive support list. \\n— Joshua Green (@JoshuaGreen) October 27, 2016 9. He\\'ll have 12-14 million emails, 2.5 million donors + because paid for with campaign funds, he\\'ll own it — a future audience for TrumpTV \\n— Joshua Green (@JoshuaGreen) October 27, 2016 10. Bannon, on the record: \"This is the pipe that makes the connection btwn Trump + the people…connects him to an ever-expanding audience\" \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nTrump TV is being compared to a U.S version of Britain’s UKIP party: 11. If Trump loses, here\\'s nightmare GOP scenario: he merges with Bannon to start a political-media movement, an American UKIP. Sound crazy? \\n— Joshua Green (@JoshuaGreen) October 27, 2016 12. Breitbart\\'s London editor, Raheem Kassam, just quit to run for leader of UKIP. His slogan: \"Make UKIP Great Again.\" \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nAccording to the article, the idea for Trump TV started as a sort of threat to Roger Ailes because of what Trump thought was negative coverage, but it’s morphed into something more realistic: 13. From the piece: \"Trump TV\" was Kushner\\'s idea, posed as a threat to Roger Ailes during primaries when Trump was unhappy w/Fox coverage \\n— Joshua Green (@JoshuaGreen) October 27, 2016 14. But idea has taken off, and five media companies have expressed interest pic.twitter.com/yod5XhCylY \\n— Joshua Green (@JoshuaGreen) October 27, 2016 15. Bottom line: Trump ain\\'t walkin away empty-handed, has grifted GOP + donors to build list worth as much as $112 million that he now owns \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\nHere’s the kicker — The RNC helped build it: Oh, I should add that the RNC also played a big role in all this –> pic.twitter.com/RYusrjZ4sW \\n— Joshua Green (@JoshuaGreen) October 27, 2016 \\n*** Trending'"}, "time": 1742628599.8840144}