{"duration": 0.07389140129089355, "input_args": {"text": "'It sounds like a science fiction script for an upcoming movie about NASA, Astronauts, and aliens on the moon. However, according to several reports, and alleged transcripts between the command center and Apollo astronauts on the moon, mankind encountered otherworldly technology upon setting foot on the lunar surface. \\nVia AncientCode \\nInteresting details about what astronauts may have encountered on the Moon comes from an interview by an unnamed Professor and Neil Armstrong at a NASA symposium:\\nProfessor : What really happened out there with Apollo 11?\\nArmstrong : It was incredible … of course, we had always known there was a possibility … the fact is, we were warned off. There was never any questions then of a space station or a moon city.\\nProfessor : How do you mean “warned off”?\\nArmstrong : I can’t go into details, except to say that their ships were far superior to ours both in size and technology – Boy, where they big! … and menacing … No, there is no question of a space station.\\nProfessor : But NASA had other missions after Apollo 11?\\nArmstrong : Naturally – NASA was committed at that time, and couldn’t risk a panic on earth…. But it really was a quick scoop and back again. (Above Top Secret , p. 186)\\nScroll Down For Video Below! Is it possible that Apollo astronauts actually encountered alien beings and UFOs while exploring the lunar surface? There are a lot of reports, interviews, and documents that suggest it’s possible. In fact, according to Dr. Vladimir Azhazha, a physicist and Professor of Mathematics at Moscow University:\\n“Neil Armstrong relayed the message to Mission Control that two large, mysterious objects were watching them after having landed near the moon module. But his message was never heard by the public – because NASA censored it.” ( Above Top Secret, p. 384) According to numerous sources, Armstrong claimed that there was an alien presence on the moon, and astronauts were ORDERED away.\\nReports indicate that Apollo astronauts stumbled across numerous ‘shops’ and structures on the moon which were obviously not man-made. Many UFOlogists claim that Buzz Aldrin even filmed the strange structures and all of the details were reported back to mission control, which deliberately ‘censored’ the information in order to prevent chaos and panic among the general population\\n'"}, "time": 1742564190.4698367}