{"duration": 0.14994049072265625, "input_args": {"text": "'DRIFTWOOD, Tex.  —   On a blistering day last August, the novelist Philipp Meyer was at a cattle ranch in the grassy Hill Country of Central Texas, standing in a field that had been turned into a replica of a Comanche camp. The makeshift village  —   with about 20 tepees, wooden racks holding strips of drying meat and buffalo hides spread on the ground  —   was the backdrop for a grueling scene from AMC’s adaptation of Mr. Meyer’s 2013 novel, “The Son,” an epic Western about a Texas ranching family. The series stars Pierce Brosnan as Eli McCullough, the family’s steely patriarch, who was captured by Comanches as a teenager in 1849 and later becomes a cattle rancher with a violent, vengeful streak. Mr. Meyer watched as makeup artists applied fake blood and ash to the prosthetic limbs of a white buffalo hunter who had been captured and tortured by the Comanches. “This is great!” he said. He studied the scene more closely, and then suggested making the charred ground around the actor’s limbs bigger. After all, he noted, the fires would have been burning for hours. It’s rare for novelists to wield this much influence over screen adaptations of their work. They may get an executive producer credit and an occasional ceremonial visit to the set, yet typically they just cash their checks and move on to their next novels. But Mr. Meyer is far from typical. Bald and muscular, with a square jaw and thick beard, he’s handy with pistols, rifles and hunting bows, and looks more at home on a working cattle ranch than most M. F. A. graduates. He wrote three of the episodes in the first season, and rewrote the rest. And he was a near constant presence on the set throughout the five months of filming, weighing in on casting, props, costumes and the choreography of battle scenes. “He was heavily involved in everything,” Mr. Brosnan, who spoke admiringly of Mr. Meyer’s “swagger,” said. “He’s a   weapons nut, with his own arsenal, and he was very specific in the choice of weapons I would use. ” Mr. Meyer admits his obsession with historical details was “probably annoying” to the other writers and producers. But his scrupulous oversight of even minute aspects of the production was always part of the bargain. “He’s definitely put his fingerprints on the show,” said Joel Stillerman, the president of original programming and development for AMC and SundanceTV. “It was clear that he was not comfortable just walking away, and he felt like he had something to contribute. ” [ Texas TV: From the Sublime to the Ridiculous ] “The Son” is the first big project from El Jefe, a production company that Mr. Meyer founded with the writers Brian McGreevy and Lee Shipman. The three men, who met at the University of Texas at Austin’s M. F. A. program, created the company in 2014, with the aim of giving authors, who are often sidelined in Hollywood’s creative hierarchy, greater control over the adaptations of their work. The company is developing TV shows based on Mr. Meyer’s debut novel, “American Rust,” Wil S. Hylton’s World War II book, “Vanished,” and “Fourth of July Creek,” a novel by Smith Henderson. (Mr. Meyer also plans to write and   the adaptation of “American Rust. ”) “Novelists, who are the most qualified people when it comes to the world of the books they’ve written, are the first people to be benched in this process,” said Mr. McGreevy, who was a writer and executive producer on the Netflix adaptation of his horror novel, “Hemlock Grove. ” Television has become an increasingly attractive medium for novelists (like Richard Price, Tom Perrotta and Nic Pizzolatto) who see it as an ideal form for teasing out long story arcs and subtle character development. But it’s rare for them to have as much of a creative stake as Mr. Meyer does in “The Son,” and he’s feeling the pressure. Whether “The Son” succeeds, critically and commercially, could determine whether El Jefe becomes a big player in the already heated competition for literary properties, which have become a staple of prestige television. “There’s this sinking feeling of, ‘Oh, this is years of my life,’” he said, using an expletive. “It almost feels like writing a first novel. ” Mr. Meyer had been in development purgatory before, and was determined not to go through it again. His 2009 debut novel, “American Rust,” was optioned for a feature film, but the production never went anywhere. So when “The Son,” which became a critically acclaimed best seller that sold 300, 000 copies and was a finalist for the Pulitzer Prize, caught the interest of several production companies, he agreed to Mr. McGreevy’s pitch. “I said, you can go with these heavy hitters who will back up dump trucks of money to your house but will likely marginalize you in the process, if the thing gets made at all,” Mr. McGreevy said, “or you can take the risk of us doing this together. ” Mr. Meyer chose the riskier option. In the spring of 2013, he and Mr. McGreevy and Mr. Shipman wrote a   script for “The Son” and started shopping it to TV networks. Microsoft’s Xbox Entertainment Studios made on offer on the series but never followed through, and the fledgling studio later shut down. Even after AMC picked up “The Son” as a series in early 2016, with a role for Mr. Meyer as a series writer and executive producer, there were other hiccups. Last summer, the actor Sam Neill, who was playing Eli, dropped out for personal reasons, soon before shooting was scheduled to begin. Mr. Brosnan took his place, and had to prepare for the role on the fly. He read passages of the novel out loud to capture Eli’s cadences, and listened to speeches by famous Texans including Lyndon B. Johnson, Rick Perry and the Texas congressman Ted Poe. (In the first few episodes, Mr. Brosnan’s labored accent is never quite convincing. ). To make the multigenerational epic work dramatically, the source material underwent some major changes. In the show, one of the book’s major characters, Jeanne Anne, is Eli’s granddaughter, rather than his   which compressed Mr. Meyer’s sprawling novel into two parallel narratives, in 1849 and 1915. (The original story spans more than 160 years.) “Philipp understood that anything we did to his book didn’t unwrite the book,” said Kevin Murphy, the showrunner and executive producer for “The Son. ” Still, Mr. Meyer wasn’t content to cede control. “Philipp has zero   experience, zero television experience, but his ideas are taken, they are valuable,” Mr. Murphy said. Mr. Meyer takes a   approach to writing. While researching the book, he went to extreme lengths to learn about Comanche customs and life in   Texas. At a ranch in Southwest Texas, he shot a buffalo and drank a mug full of its blood, so that he could accurately describe the taste when young Eli eats a raw buffalo liver. He studied animal tracking, fire building and plant identification at a   school, and learned enough Comanche to write dialogue. Mr. Meyer brought the same obsessive attention to detail to the show. He set up an archery program to teach the actors how to shoot a traditional Comanche bow, which is shorter than most other bows and designed to be used on horseback. And he brought in Juanita Pahdopony, a Comanche educator and artist, to advise the set designers on the tepees and costumes, and to help translate the dialogue and coach the actors on their pronunciation. “It’s taken me weeks to memorize,” said Zahn McClarnon, who plays Toshaway, a Comanche warrior who takes Eli under his wing. “We, as native actors, don’t get any credit for that. It’s like Tom Cruise learning Japanese. ” Occasionally, Mr. Meyer’s commitment to historical accuracy created uncomfortable moments. Some of the Native American actors expressed concern that the Comanches were portrayed as savages who relished rape and torture. Mr. Meyer and the other writers made some changes to the script, like cutting the depiction of a rape. “As native people, we have been portrayed in a certain way throughout the history of television, with stereotypes,” said Mr. McClarnon, who is of Lakota descent. “The producers were very open about changing things and listening to the cast and to the native advisers, and that’s the way it should be. ” Standing near the mangled body of the buffalo hunter on the set, Mr. Meyer said he was aiming to capture a bloody chapter in American history, from which no one emerged innocent. That day, they were filming some brutal scenes from an episode that takes place in the Comanche camp. The episode features Jacob Lofland as young Eli, who’s been living with the tribe and feels torn over the fate of another captive, a white buffalo hunter who is being tortured to death. “They were pretty inventive with torture stuff,” Mr. Meyer said. “The best political stance to take is honesty. White people did horrible things, Native Americans did horrible things. ” Working on a TV show has taken a bit of a toll on his fiction writing. Mr. Meyer said he’s been struggling to finish his next novel, which is overdue to his publisher. “The crazy thing is, now I have to make sure I have time to write novels,” he said.'"}, "time": 1742561990.4247077}