{"duration": 0.08872246742248535, "input_args": {"text": "'Black Female Trump Executive Publishes Personal Email Address As Olive Branch to Disenchanted HRC Supporters Black Female Trump Executive Publishes Personal Email Address As Olive Branch to Disenchanted HRC Supporters Breaking News By Amy Moreno November 12, 2016 \\nThere’s a false narrative floating around on the internet about Donald Trump being anti-gay and racist. \\nThis could not be further from the truth. \\nLynne Patton, a strong, bold black female executive at Trump Organization and Vice President of The Eric Trump Foundation became a power player in the election when she wrote an amazing open letter about her experience working for the Trump family. \\nThe letter, which was turned into a video, went viral. \\nPlease watch: \\nAfter the election, Lynne wrote a compelling and powerful Facebook message to her dear friends and family who supported Hillary. \\nHer heartfelt words speak to the TRUE character of Mr. Trump – not the lying, false narrative spread by our dishonest, North Korea-style, government-run propaganda media that existed solely to help Hillary Clinton get elected. \\nI agree with Lynne . \\nDonald Trump’s America First agenda is an all-inclusive movement for every American – all races, colors, genders, and sexual preference. \\nMr. Trump is a “big tent” type of man – the more the merrier! \\nHe’s the first candidate to appeal to such a wide variety of people from so many differing walks of life. \\nDonald Trump is the first Republican to invite an openly gay man, Peter Theil, the co-founder of Paypal, to be a keynote speaker at the GOP convention. \\nIn addition, Mr. Theil is also an intricate part of President-elect Trump’s transition team. \\nOf course, the media portrays Trump’s movement as racist, and bigoted – a basket of deplorable mean people – but that’s not true . \\nWe are a melting pot of differing views and cultures who have come together to take our country back from establishment globalists who, for decades, have destroyed the country. \\nMr. Trump understands that we are a country divided. \\nThe people protesting the election right now are hurt. \\nIt’s understandable – their candidate lost. \\nHowever, what we hope, as we move forward, is that these folks will keep an open mind and an open heart to the positive ideas and exciting changes that Mr. Trump has in store for the country – stimulating the economy, bringing back jobs, providing everyone a safer and more secure country, and much more! \\nI don’t work for the Trump family, but as someone who is deeply involved with the Trump “Online Army,” I can tell you that Donald Trump’s LGBT support is real and it’s powerful. \\n— Scott Presler (@ScottPresler) June 13, 2016 \\n….and with good reason. \\nMr. Trump is a loving man who is looking out for the well-being of the gay community when he strongly condemned Hillary Clinton for taking money from, and supporting countries like Saudi Arabia and Qatar, who routinely persecute, abuse, and execute gays. \\nMr. Trump challenged Hillary to return the money to these abusive countries as a symbol of support for the LGBT community. \\nAnd what did Hillary do? \\nShe laughed. \\nThis is a man who vowed to halt Muslim refugees hailing from parts of the world that are terror hotbeds and foster anti-gay cultures. \\nMr. Trump is not perfect – no one is – but he truly wants to be everyone’s President . \\nSo, to the protesters and the folks who feel apprehensive – it’s ok and understandable to feel angry and sad, and express yourself lawfully- but when you’re done, please give America First a chance – I think you’ll be pleasantly surprised at how great it will be. Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Presidency and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742562947.1939013}