{"duration": 0.06126093864440918, "input_args": {"text": "'. This Is How Much Turmeric You Actually Need To Eat For Arthritis, Cancer And Other Diseases Turmeric is an ancient herb that comes from the root of the curcuma longa plant. While you may be ... http://humansarefree.com/2016/10/this-is-how-much-turmeric-you-actually.html Turmeric is an ancient herb that comes from the root of the curcuma longa plant. While you may be familiar with its warm, peppery and bitter flavor when used as a cooking spice — often in curry — it has actually been used for over 4,000 years as a medicinal remedy for countless conditions. Researchers today claim turmeric is not only a powerful anti-cancer, anti-bacterial and anti-inflammatory agent but also a potent remedy for digestive issues. How Much Turmeric Should You Take? Depending on the reason you are using this herb and the form in which you take it, the dosing for turmeric will change. But here are some specific guidelines from some well-established health professionals and institutes. The first thing you should know is that there are essentially two types of turmeric dosing: Preventive — Preventative dosing is typically a low dose that can be taken for as long as needed or even indefinitely. Curative — A curative dose is typically much higher than a preventative one and is used for a specific diagnosis. A large dose is not meant to be taken indefinitely, but until the issue is resolved. In the below recommended doses, you will notice that some of the larger, curative doses are recommended for people suffering from extreme pain as in case of arthritis or for cancer patients. Turmeric is also available in the following forms: Cut root: This is essentially fresh turmeric that still contains the plant’s natural moisture (water). You can add this to other foods such as salads or even a vegetable dish. Do not cook or heat it however as that will destroy the valuable nutrients in it. Dried root: Turmeric powder is made by freeze drying the fresh cut root and then grinding it into a powder. Supplements are typically in this form. Curcumin is extracted from the turmeric and then concentrated to make standardized powders (each dose must contain the exact amount of active ingredients to be called standardized.) Fluid extract: This is a liquid form of the active ingredients typically mixed with vegetable glycerin, and water. Tincture: Tinctures are made with alcohol as the delivery method. Tinctures can range in strength but the basic ingredients are turmeric, distilled Water and 20% alcohol Tea: Turmeric root is available as a tea. Some people like to add a little coconut oil/milk and black pepper or you can add milk and honey. Note: Piperine, the active ingredient in black pepper will increase significantly the bioavailability of curcumin by 2000%. As will the use of coconut oil. Ideal Turmeric Dosage According to the University of Maryland Medical Center, the following are standard doses for adults: 5—3 g fresh cut root, daily 1—3 g dried powdered root, daily 400—600 mg, curcumin (standardized powder) 3 times daily (1:1) 30—90 drops fluid extract, daily (1:2): 15—30 drops, tincture, 4 times, daily According to WebMD, the following turmeric dosages are required for each specific ailment: Upset stomach: 500 mg of turmeric, four times daily Osteoarthritis: 500 mg of a specific turmeric extract for this condition that contains 95% standardized powder, twice daily Rheumatoid arthritis: 500mg of curcumin, extract for this condition that contains 95% standardized powder, twice daily According to Dr. Weil: 400mg – 600 mg curcumin (standardized), 3 times daily. The dosing instructions can also vary in cases if you are in an acute stage, where you are in severe pain for instance. In such a case you may need a higher turmeric dose for a few days to get things under control until you are feeling better, then the standard dose will be suggested. HOW MUCH TURMERIC FOR CANCER Week 1: Start with a small dosage of 1 gram of curcumin per day. If you see no side effects, take it for a week and proceed to dosage of week 2. Week 2: Increase the dosage of curcumin to 2 grams/ day. Again check for any issues side effects etc. If everything looks fine, take it for a week and proceed to dosage of week 3. Week 3: Double the dosage again to 4 grams/ day. Again if things look fine, continue for a week and go for the final step. Week 4-8: Double a final time to 8 grams/ day. Continue this dose for 5 weeks. POSSIBLE SIDE EFFECTS OF LARGE, LONG-TERM TURMERIC DOSES Turmeric can lower blood sugar as such diabetics and hypoglycemic should consult their doctor before taking. In high doses, turmeric lowers blood pressure as such do not take it with herbs that have a similar effect or with drugs such as antihypertensives that artificially lower your blood pressure. Do not take turmeric if you are taking cholesterol lowering medications as turmeric also lowers LDL (bad) and raises HDL (good) and can boost the effect of these drugs. Turmeric is a natural blood thinner and should not be taken in conjunction with blood thinners such as warfarin, coumadin, clopidogrel, or aspirin, or with herbs such ginko biloboa or garlic, all of which have blood thinning properties. Stop taking turmeric at least a week prior to surgery as turmeric thins the blood and can make it harder to stop bleeding during medical procedures. Turmeric can cause nausea if taken on an empty stomach. People having problems with the gall bladder or gall stones should avoid therapeutic doses of turmeric as it increases the bile production. Turmeric is very safe in general. Side effects rarely occur and usually only when extremely high turmeric doses are taken for very long periods of time. As such, if you are taking high doses, you should consult your health practitioner, especially if you will be taking it long-term. Reference: healthylifecentar Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742628523.3609624}