{"duration": 0.03536629676818848, "input_args": {"text": "'While the United States sits on the edge of its collective seat as Donald Trump gains an electoral vote majority in his bid for the White House, its neighbor to the north seems to be getting a little cheeky. \\nVia Unilad \\n\\nReminding America of the Great White North’s cultural acceptance and freedom, the country’s official Twitter account wrote on Tuesday evening: “In Canada, immigrants are encouraged to bring their cultural traditions with them and share them with fellow citizens.”\\nIn Canada, immigrants are encouraged to bring their cultural traditions with them and share them with their fellow citizens. pic.twitter.com/MOuStZbSX7 \\n— Canada (@Canada) November 9, 2016 \\n\\nAs a Canadian, I can attest to this. It’s a stark contrast to much of what Trump has proposed in the last 16 months: A border wall between the U.S. and Mexico, a ban on Muslims entering the country, and racial profiling.\\nBut it looks like most Americans are taking it as an invitation: \\n@JasonABowman Maybe they meant that as an invitation to join them, just in case?\\n— Jaimie Michelle (@JaimieMichelle) November 9, 2016 \\n@Canada do you mean Americans too?\\n— Stephen Whyno (@SWhyno) November 9, 2016 \\n\" @Canada : In Canada, immigrants are encouraged to bring their cultural traditions with them and share them with their fellow citizens.\" pic.twitter.com/162lvBnKaN \\n— bonafiedhoe (@pettyyonceh) November 9, 2016 \\n\" @Canada : In Canada, immigrants are encouraged to bring their cultural traditions with them and share them with their fellow citizens.\" pic.twitter.com/162lvBnKaN \\n— bonafiedhoe (@pettyyonceh) November 9, 2016 \\n\\nThe tweet comes just after Canada’a immigration site crashed in light of the now-looking-very-likely possibility of a Trump win.\\nThis is what it used to look like: \\n\\nAnd this is what it looked like Tuesday night, as the US election results rolled in, with Donald Trump in the lead: \\n\\nSearches of ‘how to move to Canada’ surged starting at 6 p.m., according to Google Trends. And Quartz published a list of jobs in Canada that would be easy for Americans to apply for if they wished to relocate, Oregon Live reports.\\nLooks like Canada’s population is going to double soon…\\n'"}, "time": 1742563570.277468}