{"duration": 0.047922372817993164, "input_args": {"text": "'Superbugs: Big Pharma to blame for coming death of 700,000 people annually \\nSunday, October 30, 2016 by: Ethan A. Huff, staff writer Tags: superbugs , antibiotics abuse , Big Pharma (NaturalNews) As new guidelines set forth by the U.S. Food and Drug Administration (FDA) to curb antibiotic overuse and abuse on factory farms slowly come into effect, the drug industry is apparently setting its greedy sights elsewhere – towards countries where restrictions on antibiotic use are looser, or simply where \"anything goes.\"Livestock are the single biggest consumers of antibiotic drugs in the U.S. – not by choice, of course, but because farmers have long been sold a bill of goods by Big Pharma when it comes to using them to bulk up their cattle more quickly and get them to market as fast as possible. It\\'s a common practice that generates a lot of money in the short-term, but a whole lot of problems in the long-term.The use of antibiotics on farms is arguably the biggest contributor to antibiotic resistance among humans, where drugs that used to treat deadly bugs no longer do. The result is the emergence of so-called \"superbugs\" that are capable of outsmarting even the most potent antibiotics, a phenomenon that\\'s killing people by the hundreds of thousands.Some of the latest reports indicate that the superbug epidemic is claiming the lives of some 700,000 people annually all around the world. And if nothing is done now to stop the drug industry from continuing to poison the well, so to speak, then this number is expected to balloon more than 14-fold to 10 million lives lost by the year 2050.According to the World Health Organization (WHO), there are very few countries in the world with any sort of formidable plan in place to address antibiotic resistance. Even with the U.S. somewhat taking the lead with voluntary FDA suggestions on the matter, none of this will stop drug companies from preying on the developing world that has yet to enact any sort of restrictions on antibiotic use.\"They\\'re international companies,\" Gail Hansen, a veterinarian and consultant who works with drug companies, governments and nonprofit organizations, told Bloomberg . \"What happens in the U.S. does certainly make a difference, but it\\'s not the only market they have.\" Antibiotic resistance kills 10 times more people than opiate overdoses While it\\'s become common practice for factory animal rearers to exploit antibiotics as a way to fatten their stocks more quickly and supposedly keep them healthy, the use of these drugs for such purposes is disastrous for public health. Comparatively speaking, only 69,000 people die from opiate overdoses globally, which translates to 10 times more people dying from superbugs than from the most deadly pharmaceuticals on the market.Antibiotics are also overused in the realm of human medicine, with some one-third of all prescriptions, according to the U.S. Centers for Disease Control and Prevention (CDC) and the Pew Charitable Trusts, being completely unnecessary. This translates to roughly 47 million prescriptions that aren\\'t even helpful, either because the patients have a viral infection, or don\\'t have an infection at all.The only way anything is going to change is if Big Pharma is barred from selling antibiotics to farmers whose only desire is to rush their animals to market for maximum profits. Doctors must also be reigned in and stopped from indiscriminately handing out antibiotics whenever their patients feel any kind of ailment – and again, these measures must have a global reach.\"If some of the biggest responsible parties – namely the companies making the products – are still selling the antibiotics in other countries, it just underscores that this has to be a change that happens across the entire world,\" David Wallinga, a senior health official and physician at the Natural Resources Defense Council (NRDC), told Bloomberg .\"And the companies bear a big responsibility for that approach.\" Sources for this article include:'"}, "time": 1742562357.2360663}