{"duration": 0.03150296211242676, "input_args": {"text": "'\\nThis past week, peaceful protesters were brutally arrested at Standing Rock in North Dakota attempting to protect their water from the Dakota Access Pipeline, which threatens the water of more than 18 million people in the US. Journalists and medics were arrested, cars were impounded and personal possessions were seized by police.\\nOnce again, government officials brutalize and raise up arms against native people in a fight to steal yet more land and destroy it. It is clear to see that Morton County Sheriff’s office is the primary security protecting the construction of this pipeline.\\nHowever, amidst the chaos, many forgot a small victory that occurred last week; nearly 50 water protectors stood against more than 250 police on a bridge on County Road 134.\\nAs Desiree Kane of Yes! Magazine reports:\\nIt was a strategic juncture because police vehicles couldn’t cross the narrow embankments on their way to the raid. If they were stopped at this bridge from the east, they could only come from the north. In the morning, police did come, and from both sides. When I arrived, this blockade had already stopped an LRAD… Even as police numbers grew, eventually well beyond 200, the water protectors held their ground, fearless. Then the dancing began. People began dancing to a hand drum, entranced by the power of prayer.\\nOne elderly man continuously proclaimed in a loud voice, “Send one unarmed like I am out here to negotiate. Please. We are protecting the water for our children and yours. Send one out here to negotiate. Let’s talk! Please!”\\nThe police refused to negotiate, but after hours of this peaceful display of non-cooperation, the police retreated.\\nThis means that those 250 jackbooted thugs could not make it from the east to join in the brutalizing of peaceful protesters. This is a victory, no matter how small. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Ryan Banister of The Daily Sheeple . '"}, "time": 1742628539.9361174}