{"duration": 0.1136159896850586, "input_args": {"text": "'Anti-Trump US Color Revolution Includes Soros and Clinton ‘Purple’ Takeover? By `Daily   12, 2016 \\nBillionaire Globalist Soros Exposed as Hidden Hand Behind Trump Protests — Provoking US ‘Color Revolution’ … Billionaire globalist financier George Soros’ MoveOn.org has been revealed to be a driving force behind the organizing of nationwide protests against the election of Donald Trump — exposing the protests to largely be an organized, top-down operation — and not an organic movement of concerned Americans taking to the streets as reported by the mainstream media. -Free Thought Project \\nTwo recent articles may illustrate a determined attempt to overthrow the Trump victory and substitute a new regime, presumably Hillary’s. \\nOne article, excerpted above, is a clever analysis of the “organic” protests against Trump now taking place in the US, which can certainly be perceived as a domestic “color revolution.” The second article, excerpted below, tells us about a “Purple Revolution” now being conducted by the Clintons. \\nTogether, these efforts, if credible, comprise a formidable challenge to the Trump administration, which has not yet even begun to coalesce. \\nThe original color revolutions were conducted against countries abroad to bring them into line with globalist strategies as promoted via American power. US intelligence agencies, the Pentagon and other internationalist facilities domestically and abroad were utilized. \\nIt could be that the same coalition is now at work inside of the US. While this “color revolution” may be led by Soros and even partially funded by him, it may be a large effort is underway that includes elements of the US “shadow government.” \\nMore: \\nIn light of the protests and rioting that have transpired since the election of Trump, a closer analysis of the dynamic at play is warranted to gauge whether it’s an organic grassroots movement, or something much more organized, sophisticated and potentially dangerous. \\n… Now come reports from various protest locations that reveal a substantially coordinated effort, and not the organic grassroots showing by concerned Americans, as the mainstream media is reporting. \\n[Moveon.Org] is one of a number of progressive organizations affiliated with Soros’ Open Society Foundation. Soros-affiliated organizations across the world are deeply connected to various color revolutions, the Arab Spring, and a number of other political uprisings across the globe. \\nThis color revolution, if it formally (if secretly) exists, will certainly extend itself, thus proving it is not simply a series of spontaneous expressions. While the article was posted earlier in the week, as of this writing more protests are now being reported via CNN and other media: \\nAnti-Trump protests spread across nation … Protestors in Atlanta burned a flag near the Georgia capitol … Thousands took to the streets of cities across the United States late Friday and early Saturday as anti-Donald Trump protests saw highways and interstates blocked, numerous arrests — and a shooting at a march in Portland, Oregon. \\nAngry crowds gathered once again outside the 58-story Trump Tower, the President-elect’s home in New York. Protester Shoshi “Rabin” Rabinowitz explained her motivation for being there: “Words can’t describe how disgusted I am that he was elected over Hillary (Clinton),” she said. \\nMarry this sudden “color revolution” to a recently reported and comprehensive “purple revolution” that has just been initiated by the Clintons and you are presented with a broad-based, efficient, ant-Trump program. Here from Wayne Madsen (also available at ZeroHedge): \\nDefeated Democratic presidential candidate Hillary Rodham Clinton is not about to «go quietly into that good night». On the morning after her surprising and unanticipated defeat at the hands of Republican Party upstart Donald Trump, Mrs. Clinton and her husband, former President Bill Clinton, entered the ball room of the art-deco New Yorker hotel in midtown Manhattan and were both adorned in purple attire. \\nThe press immediately noticed the color and asked what it represented. Clinton spokespeople claimed it was to represent the coming together of Democratic «Blue America» and Republican «Red America» into a united purple blend. \\n… The Purple Revolution will resist all efforts by the Trump administration to push back against the globalist policies of the Clintons and soon-to-be ex-President Barack Obama. The Purple Revolution will also seek to make the Trump administration a short one through Soros-style street protests and political disruption. \\nThese two initiatives are separate but together they indicate considerable planning and foresight, One way to look at them is as a formidable reaction to an unexpected Trump victory. Another way is to see them as a planned reaction to a Trump victory that was actually preordained. Everything was prepared, in other words, and now the trigger has been pulled. \\nWe are yet partial to the latter conclusion, believing that both Brexit and the Trump victory could be part of a larger elite manipulation (as we’ve suggested several times already). \\nThe idea behind this latter manipulation would be to create an administration that is seen by people as representing a victory over globalism, but one that is then gradually destroyed and ultimately removed. People would thus realize that there is no alternative to the globalist paradigm they have struggled against. \\nIf this latter perception is correct, then the Trump administration may continue to coalesce and take effect, but it will be accompanied by significant agitation, turmoil and economic and even military violence. You can see some of our other recent articles here and here . \\nTrump may well be dedicated to his cause of “Making America Great Again,” but the forces arrayed against him are formidable and dedicated to turning his victory into a message of defeat. This would be a classic form of the kind of “directed history” that we often analyze. It is always married to a dominant social theme – a meme – developed as elite propaganda and purveyed by the press. \\nConclusion: In this case the meme informs us that Trump is an impossibly racist and brutal individual who will turn the US into a dictatorship that is easily slotted into a larger, international technocracy. In fact, the danger of this sort of social manipulation comes from Soros and the Clintons – and the larger shadow state itself. Trump on the other hand is the target.'"}, "time": 1742561862.7061577}