{"duration": 0.08115386962890625, "input_args": {"text": "'U. S. Secretary of State Rex Tillerson told reporters in Seoul on Friday that the Trump administration is open to military action against North Korea as a last resort, and that the   policy of “strategic patience has ended. ”[“The policy of strategic patience has ended. We are exploring a new range of diplomatic, security and economic measures. All options are on the table,” Tillerson told reporters at a press conference with South Korean Foreign Minister Yun  . “If North Korea takes actions that threaten South Korean forces or our own forces, that will be met with an appropriate response. ”  “If they elevate the threats of their weapons program to the level that we believe requires action, that option is on the table,” Tillerson added. He emphasized that the United States would attempt to avoid to the extent possible any military actions against North Korea, particularly those that may put North Korean civilian lives in danger. “We hope that that will persuade North Korea to take a different course of action. That’s our desire,” Tillerson concluded. Tillerson also took the opportunity to once again call for China to take on a larger role in containing North Korea’s escalating belligerence and objected to China cutting economic ties with South Korea over the deployment of the America Terminal High Altitude Area Defense (THAAD) missile defense system. “While we acknowledge Chinese opposition, its economic retaliation against South Korea is inappropriate and troubling. We ask China to refrain from such actions. Instead, we urge China to address the threat that makes that necessary,” Tillerson said. Tillerson is currently in the middle of a   trip to Asia, having left Japan on Thursday and scheduled to meet with leaders in China on Saturday. The Secretary of State’s remarks regarding potential military action against North Korea follow remarks in Japan that emphasized a “different approach” to the rogue government in Pyongyang. “Part of the purpose of my visit to the region is to exchange views on a new approach,” Tillerson noted on Friday in a press conference with his Japanese counterpart, Foreign Minister Fumio Kishida. The Trump administration has hinted at a change in America’s approach towards Pyongyang in other venues, as well. Earlier this month, UN Ambassador Nikki Haley told reporters in New York that the White House is “not ruling anything out” to keep North Korea from developing and using nuclear weapons. Haley described the THAAD system as a necessary response to Pyongyang’s insistence on violating UN sanctions with missile launches that could threaten Japan and South Korea. “We are not going to leave South Korea standing there with the threat of North Korea facing them and not help. The reason for THAAD is because of the actions of North Korea,” she said in response to Chinese and Russian opposition. Following Tillerson’s remarks Friday, President Trump himself issued a warning to North Korea on Twitter: North Korea is behaving very badly. They have been “playing” the United States for years. China has done little to help!  —   Donald J. Trump (@realDonaldTrump) March 17, 2017, Tillerson’s message towards China was also similar in Japan: as its largest trading partner, take a more prominent role in containing North Korea. “We look to China to fulfill its obligations and fully implement the sanctions called for,” he said. Anticipating Tillerson’s visit, Chinese Premier Li Keqiang told reporters Wednesday he was “optimistic about the future of   relations” and anticipated a positive outcome from Tillerson’s visit. President Donald Trump is reportedly working with Chinese officials to plan a U. S. visit by President Xi Jinping next month. These statements represent a nearly complete shift away from what former Secretary of State and   presidential candidate Hillary Clinton described as “strategic patience“: a policy of waiting for the North Korean economy to implode and Pyongyang finding itself no longer able to afford to ignore UN sanctions and the rejection of the international community. This policy largely failed because China continued to trade with North Korea, providing the fellow communist regime a vital lifeline. The response in Seoul to the new, robust U. S. policy is largely divided along partisan lines, according to the South Korean news agency Yonhap. Conservative leaders have expressed gratitude for Tillerson’s strong support for their country. “We highly appreciate his comments as he expressed a strong willingness to respond to North Korea’s reckless behavior,” Liberty Korea Party spokesman Rep. Choung   told Yonhap. One   leader, in contrast, told Yonhap: “We are supporting the U. S.’s move to strengthen the effectiveness of sanctions against the North through cooperation with relevant countries, but we cannot help expressing concerns about the U. S. stance that there will be no dialogue until North Korea gives up (nuclear weapons). ”   North Korea appears to have responded to Tillerson’s presence in the region with the publication of a “human rights white paper” condemning the United States as a serial violator of human rights, condemning the presidential election itself as a human rights violation against the American people and labeling the nation a “human rights desert. ”  '"}, "time": 1742628606.4051673}