{"duration": 0.08954858779907227, "input_args": {"text": "'LONDON  —   The Conservative Party (and by extension, Britain itself) is moving a step closer to a new leader. Members of the opposition Labour Party are wondering if their leader, Jeremy Corbyn, will save them or plunge the party into irrelevancy. Here’s what’s happening in today’s Brexit news: • Among the Conservatives, Boris Johnson, the former mayor of London, has decided not to run to replace David Cameron as party leader (and therefore prime minister). That leaves the favorite as Home Secretary Theresa May, but Michael Gove, the justice secretary, has also thrown his hat in the ring. A leaked email showed Mr. Gove’s wife to be no fan of Mr. Johnson, and both candidates criticized him while announcing their candidacy. Plenty of others plan to run as well. • On the opposition side, Labour is not happy with its leader, Jeremy Corbyn, who appears more concerned with remaking the party into a revolutionary socialist movement than achieving power. Members of Parliament, including Mr. Corbyn’s predecessor as party leader, want him to resign. He has refused. The party is also awaiting the release of an internal investigation into claims of  . • Where could it all lead? Steven Erlanger, the London bureau chief for The New York Times, says there could be an early general election in Britain. • The Bank of England may be forced to cut a key interest rate this summer as it grapples with economic uncertainty created by Brexit, Mark Carney, the central bank’s governor, said on Thursday. “It now seems plausible that uncertainty could remain elevated for some time, with a greater drag on activity than we had previously projected,” Mr. Carney said. He added that, in his view, “the economic outlook has deteriorated and some monetary policy easing will likely be required over the summer,” though he was careful to say he was not prescribing what other members of the bank’s Monetary Policy Committee would eventually decide. “The charge that central banks are out of monetary ammunition is wrong, but the widespread absence of global price pressures demands that our firepower be well aimed,” he said. • A new runway at Heathrow Airport in London won’t be decided on until a new prime minister is in place, the BBC reports. The Financial Times has published a “business tracker” on how companies are responding to the vote. • A series of tweets by the Economist Intelligence Unit outlines the negative possibilities for the British economy. • In the markets, the pound was mostly flat in morning trading in London. British stocks, which had fallen sharply after the referendum result on Friday morning, closed above their   levels on Wednesday. The same goes for share prices in Continental Europe. • Internet search patterns indicate many people are still looking up what “Brexit” is and what it means to leave the European Union. Plenty is still unknown, but we have an article that explains the basics. • Tony Blair’s former chief of staff wrote in The Guardian that Britain’s withdrawal can still be reversed, but that it will take courage. An academic wrote on Medium that most English and Welsh lawmakers would have to go against the wishes of their constituents. • Is the European Union “democratic”? Campaigners who sought to leave the bloc said it was not, but my colleague Amanda Taub argues it is  —   it just doesn’t feel that way. Philip Stephens, looking at another European country that had an   portmanteau, worries in The Financial Times that Britain is behaving more like Greece. • Could Britain’s influence in Hong Kong wane? The Guardian’s Beijing correspondent asks if Britain’s fledgling “golden relationship” with China could be in jeopardy. And in China, a censorship notice has told editors not to “hype the story, speculate or comment” on the exit. There will be plenty more to come throughout the day.'"}, "time": 1742561746.5959744}