{"duration": 0.1215810775756836, "input_args": {"text": "'About Media skeptic After Abandoning Kurds to Erdogan\\'s Invasion US Now Expects Them to Win the \\'Race to Raqqa\\' for It \\nBut the Kurdish militias are saying they don\\'t intend to expose themselves to a Turkish stab in the back Donate! The failure to give Turkey a red light comes back to bite \\nUS Secretary of Defense explained yesterday that the push to take ISIS capital in Raqqa, eastern Syria will begin within weeks. (And BTW Russia is not invited .) \\n\"It starts in the next few weeks,\" he said, referring to the timeline for an assault led by Arab and Kurdish fighters on ISIS\\' Syrian stronghold of Raqqa. \"That has long been our plan and we will be capable of resourcing both.\" \\nCarter added: \"It\\'s been long a part of our plan that the Mosul operation would kick off when it did. This was a plan that goes back many months now and that Raqqa would follow soon behind. \" \\nTake from this what you will. Perhaps this is empty talk to boost the Democrats\\' ISIS-fighting credentials and help Hillary on November 8. Perhaps it is a ruse of war meant to prevent ISIS from reinforcing Mosul from Syria. \\nOr perhaps Ash Carter is actually serious. In which case I fear for Ash Carter. \\nAmericans have explained that when they mean they\\'re going to take Raqqa that really means that Syrian Kurds are going to take Raqqa for them: \\n\"The only force that is capable on any near term timeline are the Syrian Democratic Forces, of which the YPG are a significant portion,\" said Army Lieutenant General Stephen Townsend in a news briefing. \"We\\'ll move soon to isolate Raqqa with the forces that are ready to go.\" \\nIn fact the Kurdish YPG are more than a \"significant portion\" of the SDF, they\\'re easily 75% of its fighting strength, probably more. And herein lies the problem because even as US officials acknowledge Kurds aren\\'t exactly eager to die so US can claim credit for expelling ISIS from a wholly non-Kurdish city. \\nArab forces are expected to be the ones to take the city itself, U.S. officials say. \\n\"Truthfully, the Kurds that I’ve dealt with don’t intend – they’re not comfortable going into Raqqa. They know they can play a role in shaping and isolating Raqqa but it’s not their intent to be involved in the actual seizure of the city,\" the U.S. military official said. \\nHere is a fact. If YPG doesn\\'t want to enter Raqqa, then SDF can not enter Raqqa. The satellite Arab formations of the SDF have nowhere the strength to face off against the Caliphate. \\nIn fact what the Kurds have been saying recently is that they may be willing to march on Raqqa but it is going to cost the US a lot more in political support and military supplies than what they\\'ve been getting so far. SDF Spokesman Talal Ali Silo: \\nOur target is wherever ISIS occupies. Currently, our targets are Dêra Zor and Raqqa. However, al-Bab Military Council is demanding our help. We will meet their demands for militaristic and logistic help. Raqqa Operation requires great power and opportunities. It requires a lot of preparation. \\nWe receive some aid, but it is limited and done covertly. We demanded that International Coalition forces and the US give militaristic and political support overtly and officially. We demanded advanced weaponry, missiles, armored vehicles, panzers etc. They have been promised, but not delivered. \\nThis was two weeks ago, however. Ie, before the Turkish and US-backed rebels attempted an offensive against the Kurdish Afrin enclave. -- Their most ferocious assault against the SDF so far. \\nAs Turkish artillery and aircraft pounded the Kurds in support of attacking Islamists the US limited itself to \\'expressing concern\\', \\'calling on all sides to stand down\\'. US State Department spokesman John Kirby : \\n“We are concerned about reports of civilian casualties in recent air and artillery strikes in northern Syria. We call on all sides to stand down and focus on greater threats.” \\nIn other words, as far as we know the US didn\\'t lift a finger to protect the SDF against Erdogan\\'s \\'Euphrates Shield\\'. Instead it was actually forced to issue denials that it was part of the offensive. \\nIf Turkish media is to be believed Assad actually did more to support the Kurds than the US. Turkish pro-Erdogan media claimed that a Syrian helicopter struck the Turkish-backed rebels killing 2 and wounding 5. Kurds also captured footage ( 1:18 ) of what appeared like a Russian Su-30 fighter in the area -- perhaps as a cover for the helicopter if such a strike indeed took place. \\nAt this point the Kurds aren\\'t worrying about Raqqa. They\\'re worrying about the next Turkish offensive, and how a push to Raqqa would expose them to that : \\nSyria\\'s Kurds fear a \"stab in the back\" by Turkey if they join a push to drive Islamic State from its Syrian capital of Raqqa, one of their chief political leaders told Reuters on Tuesday. \\n\"It is very important that Raqqa is liberated. But one point which is bothering us is that, if we go toward Raqqa, we will be stabbed from the back ,\" he said. \\nSo here is the deal for Syrian Kurds from the American Empire: Accept only limited recognition and political support. Only limited supplies of weapons of the type you already have. Expect even this limited support to not extend to your Afrin enclave. And in return you get to lose fighters you might very well need against Turkey so US can claim credit for expelling Islamist fanatics from an Arab city before Russia does. \\nGood deal? Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742563361.281212}