{"duration": 1.2421469688415527, "input_args": {"text": "'There is good reason that “‘Master Harold’   …     and the Boys” ranks among the South African writer Athol Fugard’s most celebrated and popular plays. As the sterling new production that opened on Monday at the Signature Theater attests, this quiet drama remains a powerful indictment of the apartheid system and the terrible human cost of the racism it codified and legalized. At a time when systemic racism and its roots are once again a subject of national discussion in America, it feels particularly, and sorrowfully, pertinent. The   play, here directed with care by Mr. Fugard himself, takes place in 1950, in a modest tea shop in the town of Port Elizabeth. Sam (Leon Addison Brown) in his 40s, works in the shop and wears a waiter’s uniform his   Willie (Sahr Ngaujah) about Sam’s age, does more of the rough work and is dressed accordingly. They are black the    Hally (Noah Robbins) the son of the tea shop’s owners, is white. He arrives from school on a rainy afternoon and greets Sam and Willie cheerfully. The relationship among them is warm, although Willie calls Hally “Master Hally,” while Sam calls him by just his name. But unsettling news spoils Hally’s friendly demeanor, at least temporarily. He learns that his mother has gone to the hospital to bring home his ailing father, for whom Hally clearly has little affection. When Willie tosses a rag in mock anger at Sam, and it hits Hally, he says sharply: “Cut out the nonsense now and get on with your work. And you too, Sam. Stop fooling around. ” Their relationship is dictated not by their age or intelligence or behavior, but by the color of their skin. Generally, Sam’s rapport with Hally is almost fatherly in a particularly touching passage, they recall with affection a day they shared flying a kite. After Hally talks about being punished for an infraction at school, he is aghast when Sam describes what it’s like to be caned by the police. His intelligence tells him that the racist system his country lives by is morally wrong. “I oscillate between hope and despair for this world as well, Sam,” he says, when Sam expresses a cynical view of the future. “But things will change, you wait and see. One day somebody is going to get up and give history a kick up the backside and get it going again. ” The emotional power of the play resides at first in the affection Sam shows toward Hally. Mr. Brown gives an understated and deeply touching performance. Although Sam was never educated  —   as he flips through Hally’s textbooks, he marvels at the words he doesn’t know  —   Mr. Brown underscores his acute moral intelligence. Faith in his dignity as a human being shines in Sam’s every word and act  —   and, what’s more, a compassion for Hally that allows him to put up with the young man’s slips into casual condescension. As the more juvenile Willie, Mr. Ngaujah, best known for creating the title role in the musical “Fela! ,” is bubbly and likable. His obsession with a coming dance contest brings humor into the play, as Willie rants about his girlfriend’s leaden feet. Perhaps it would help, Sam sternly suggests, if he didn’t beat her when she makes a wrong move. Mr. Robbins is superb, as well, as Hally. Beginning with a fine South African accent, his performance brings out all the nuances in the character: his innate good nature, which has been nurtured by Sam, although Hally doesn’t recognize it his natural intelligence, despite those lousy math scores his submerged guilt and sorrow over his relationship with his father and the hints of patronization that occasionally creep into his conversation. The play moves to a harrowing conclusion when Sam gently admonishes Hally for saying disrespectful things about his father, and Hally lashes out. The moment is shocking, and heartbreaking, too, as we watch a stricken Hally absorb the enormity of what he has done: Mr. Robbins’s face grows ashen, and he sits in his chair with a deathlike stillness. The moment illustrates, too, how it is often our inner demons that stoke our disrespect  —   or worse  —   for others. With his outburst, it seems that the kind but callow boy has suddenly and inadvertently taken the first steps to becoming a man. But the question remains: Having grown up absorbing the racism that is endemic in his culture  —   its omnipresence is subtly symbolized by the rain we hear pelting down throughout the play  —   what kind of man can he become?'"}, "time": 1742563018.2501628}