{"duration": 0.07445931434631348, "input_args": {"text": "'HUNTINGTON BEACH, Calif.  —   Beth Webb remembers talking with friends at her sister’s Christmas party several years ago, wondering aloud if she would support the death penalty if someone she knew were murdered. Then, in 2011, her sister, Laura Webb Elody, was killed along with seven other people  as she worked at a hair salon in nearby Seal Beach. For weeks, Ms. Webb wanted revenge. And the local district attorney promised she would get it in the form of the death penalty. But five years later, the man who killed her sister and wounded her mother is still alive, and Ms. Webb is now helping to lead the campaign to abolish the death penalty here. Tami Alexander has waited even longer. The man who killed her    and    has been on death row for more than two decades. The death penalty has long been one of the most contentious issues in the state. Though California has executed only 13 people since the 1970s, it has sentenced hundreds to death and has more prisoners on death row than any other state. California has repeatedly been criticized for keeping those people in a suspended state for years, costing Californians billions of dollars. There have been attempts before to reform the system  —   just four years ago a ballot proposition failed in its effort to abolish the death penalty entirely. Now voters are being presented with their latest choice in the matter: Should the state get out of the business of capital punishment completely or enact a plan to make executions happen more quickly? Both proposals accept that the state’s death penalty system  —   which costs an estimated $150 million a year for trials, appeals and death row facilities  —   is broken. The state’s process is so prolonged, “with only the remote possibility of death,” that it is tantamount to cruel and unusual punishment, a federal judge wrote in a 2014 ruling, calling the system dysfunctional and arbitrary. The 747 inmates on death row remain in a legal limbo: There has not been an execution in the state since 2006, as the state’s lethal injection protocol remains tied up in the courts. This year, voters will decide between two competing ballot measures: Proposition 62, which would end the death penalty and replace it with life without parole, and Proposition 66, which would speed up the executions by accelerating appeals for inmates on death row. A victory for either side will transform the state’s system for capital punishment. When the death penalty was last on the state ballot, the focus remained primarily on money  —   with opponents arguing that the state was spending billions without executing anyone. In California, most inmates spend at least two decades on death row. Far more have died from natural causes or suicide than have been executed. After the measure to repeal it lost by four percentage points in 2012, supporters of the death penalty quickly pulled together to find a way to get their proposal to voters as quickly as possible. “We knew we needed to say to California voters as quickly as possible that we have to get this fixed,” said Mike Ramos, the San Bernardino district attorney and one of the leading proponents of Proposition 66. “Citizens are getting rightly frustrated that we are holding the worst of the worst, people who are evil, on hold indefinitely. The families would like justice, the people want justice, and what we have does not work. ” This time, the arguments are as much about moral and philosophical issues as financial, with Ms. Webb and Ms. Alexander each seen as key advocates for the opposing measures. “There is no way to know how much hatred you have in your heart until someone you know is murdered,” Ms. Webb said in a recent interview. “That’s what the people who want this understand  —   the frustration of somebody doing this to you and you not being able to do anything is overwhelming. ” Though national polls show that a majority of voters favor the death penalty, there have been notable victories in attempts to repeal it. In the past decade, legislatures in New Jersey, New Mexico and Illinois have all voted to end it, and other governors have declared moratoriums on executions. And two other states  —   Oklahoma and Nebraska  —   will also vote on ballot propositions this year. “There are a few counties that are overproducing death penalties, and it is coming at an enormous cost to everyone in the state,” said Robert Dunham, the executive director of the Death Penalty Information Center. “You no longer have to be against the death penalty in theory to be against the way the death penalty is practiced in the United States. We used to look at it dogmatically, and now we are looking at it pragmatically. ” While opponents of the death penalty argue that eliminating death row would save $150 million, supporters similarly argue that speeding up the process would save the state more money in the long run. Proposition 66 would force courts to process death penalty cases more quickly, but opponents of the measure say there are not enough lawyers with the ability to handle the cases to move cases off the docket. “Our family doesn’t care if it takes 100 years if it’s a case where the innocence is in question, but that’s not what happens,” Ms. Alexander said. “What happens is that we wait an eternity for someone who is already found guilty and that a jury found deserves to die. They can appeal over and over again on things that have nothing to do with the crime itself. ” And the delays in execution, once an exception, are now routine for myriad reasons. In addition to the guilt phase of a criminal trial, the penalty phase can go on for years as lawyers compile thick histories of the suspect’s criminal and mental health record, and few defense lawyers are interested in taking on such cases, said Ellen S. Kreitzberg, a law professor at Santa Clara University who has studied how the death penalty is carried out in California. “In the counties where you have a lot of death penalty cases, you’ve got 35 percent of a court’s staff time spent on those,” she said. “That means the system is not working. It’s not equipped to deal with this. ” Ms. Webb said it was not until her sister’s case began to drag on that she began to rethink her views on the death penalty. “The offer that the death penalty is somehow going to relieve your pain is on so many levels unfair,” she said. “Because what they are saying is that if you hold on to that anger long enough we are going to release it for you when we murder this person. But I cannot live with the idea that somebody else’s death is going to set me free. It would validate the very thing that he did. ” Ron Briggs, who helped draft a ballot measure expanding application of the death penalty in 1978 and was one of the leading proponents of the attempt to repeal it in 2012, said that despite the narrow loss, he thought a quick return to the ballot was the best way to persuade voters to end capital punishment in the state. “That gives all the closure the family needs and ends these endless appeals,” Mr. Briggs said. “I think Republicans and fiscal conservatives are really beginning to get the message that this is costing a lot of money and not doing a lot of good. ”'"}, "time": 1742628597.186859}