{"duration": 0.09998154640197754, "input_args": {"text": "'$23 FBI Given Go-Ahead to Begin Review of Latest Batch of Emails in Clinton Case as Political Feuds Roil Posted on Oct 30, 2016 Out of line? FBI Director James Comey restarted the public controversy over Hillary Clinton’s emails and is now under fire from Democrats and other detractors. (FBI) \\nHere’s the least surprising news of the day: FBI Director James Comey’s decision to announce his agency’s renewed investigation into Democratic presidential candidate Hillary Clinton’s emails has sparked a highly politicized battle in various sectors of the U.S. government, with just over a week to go before the Nov. 8 presidential election. \\nAs of Sunday, the intelligence agency obtained a warrant to begin sifting through some 650,000 emails stored on a computer shared by embattled former Congressman Anthony Weiner and his estranged wife, Clinton aide Huma Abedin, to determine whether any of them were sent to or from Clinton’s private server or contained classified material. According to The Wall Street Journal, the FBI, which had first learned of the newly discovered emails in early October, had already been dealing with internal tensions before this latest development occurred: \\nThe new investigative effort, disclosed by FBI Director James Comey on Friday, shows a bureau at times in sharp internal disagreement over matters related to the Clintons, and how to handle those matters fairly and carefully in the middle of a national election campaign. Even as the probe of Mrs. Clinton’s email use wound down in July, internal disagreements within the bureau and the Justice Department surrounding the Clintons’ family philanthropy heated up, according to people familiar with the matter. \\nComey’s move was framed instantly by mainstream outlets as a “bombshell” after the story broke on Friday, and predictably, Clinton’s camp questioned the timing and the hype it caused while calling for more details, and GOP nominee Donald Trump swiftly seized upon it as further evidence of his rival’s corruption. \\nOn Sunday, outgoing Nevada Sen. Harry Reid echoed a former Bush White House ethics lawyer, Richard W. Painter, who in a New York Times op-ed published Sunday suggested Comey may have violated the Hatch Act and stated that he had filed a formal complaint through government channels: \\nThe F.B.I.’s job is to investigate, not to influence the outcome of an election. \\nSuch acts could also be prohibited under the Hatch Act, which bars the use of an official position to influence an election. That is why the F.B.I. presumably would keep those aspects of an investigation confidential until after the election. The usual penalty for a violation is termination of federal employment. \\nThat is why, on Saturday, I filed a complaint against the F.B.I. with the Office of Special Counsel, which investigates Hatch Act violations, and with the Office of Government Ethics. I spent much of my career working on government and lawyers’ ethics, including as the chief White House ethics lawyer for George W. Bush. I never thought that the F.B.I. could be dragged into a political circus surrounding one of its investigations. Until this week. \\n(For the sake of full disclosure, in this election I have supported Jeb Bush, Marco Rubio, John Kasich and Hillary Clinton for president, in that order.) \\nPainter added that considerations of intent are immaterial when it comes to Hatch Act violations; rather, emphasis is on the outcome, on whether it is clear that the official in question could sway the election. \\nSen. Reid had this to say about Comey and the Hatch Act: \\n“Your actions in recent months have demonstrated a disturbing double standard for the treatment of sensitive information, with what appears to be clear intent to aid one political party over another,” the letter says. “I am writing to inform you that my office has determined that these actions may violate the Hatch Act.” \\nThe act bars government officials from using their authority to influence elections. \\nReid also accused Comey of shielding Republican presidential nominee Donald Trump from scrutiny over his connections to Russia, saying “it has become clear that you possess explosive information about close ties and coordination” between Trump and his advisers and the Russian government. \\nAlthough FBI investigators have eight full days to scrutinize the contents of Weiner and Abedin’s laptop, it is likely to take weeks before they conclude their review.'"}, "time": 1742562878.670325}