{"duration": 0.05335831642150879, "input_args": {"text": "'President Donald Trump spent much of his Sunday sending unfiltered messages on Twitter, despite reports that said White House attorneys would start vetting his messages and tweet less. [“The Fake News Media works hard at disparaging  demeaning my use of social media because they don’t want America to hear the real story!” Trump wrote on Twitter on Sunday night.  Trump remained mostly idle on Twitter during his trip overseas, using his account to thank his foreign hosts for an excellent trip. That caught the attention of reporters, who speculated that Trump would be more filtered in the future. “I’ve been told a factor in the lack of tweeting abroad overall was the presence of Melania Trump,” wrote a Politico reporter on Twitter. Trump was expected to travel on Saturday, presumably to his golf course, but the trip was canceled, likely due to rain. Instead, the president spent his afternoon on Twitter challenging the accuracy of stories about the White House. “It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media,” Trump wrote on Twitter. “Whenever you see the words ‘sources say’ in the fake news media, and they don’t mention names it is very possible that those sources don’t exist but are made up by fake news writers. #FakeNews is the enemy!” Trump also highlighted another big victory for Republicans in Montana, despite   hysteria suggesting that the Republican candidate would lose a special election in the state after “body slamming” a reporter. “Does anyone notice how the Montana Congressional race was such a big deal to Dems  Fake News until the Republican won?” Trump wrote, calling the story “poorly covered. ” He also criticized leaks of British intelligence from American sources to the news media. “British Prime Minister May was very angry that the info the U. K. gave to U. S. about Manchester was leaked,” he wrote. “Gave me full details!” The president also wrote about his plan for health care and tax cuts. “ObamaCare is dead  —   the Republicans will do much better!” he wrote, floating the option of adding more money to fund health care and promised that tax reform was moving along swiftly. “The massive TAX   that I have submitted is moving along in the process very well, actually ahead of schedule. Big benefits to all!” he wrote. Trump sent 10 messages on Twitter on Saturday, one of the busiest days on the social platform as president. Trump’s social media director Dan Scavino confirmed for reporters that Trump’s use of Twitter would continue. “Various news reports of attorneys vetting Donald Trump’s tweets are compliments of your #FakeNewsMedia  terrible ‘sources,’” he wrote. “#FACT”'"}, "time": 1742564056.379933}