{"duration": 0.09504318237304688, "input_args": {"text": "'CLEVELAND  —   In his unlikely rise to the Republican nomination Donald J. Trump attacked lobbyists, disparaged big donors and railed against the party’s establishment. But on the shores of Lake Erie this week, beyond the glare of television cameras, the power of the permanent political class seemed virtually undisturbed. Though Mr. Trump promises to topple Washington’s “rigged system,” the opening rounds of his party’s quadrennial meeting accentuated a more enduring maxim: Money always adapts to power. At a downtown barbecue joint, lobbyists cheerfully passed out stickers reading “Make Lobbying Great Again” as they schmoozed on Monday with Republican ambassadors, lawmakers and executives. At a windowless bar tucked behind the   hotel, whose rooms were set aside for the party’s most generous benefactors, allies of Mr. Trump pitched a clutch of receptive party donors on contributing to a   “super PAC. ” And on Tuesday night, as Republican delegates formally made Mr. Trump their   presidential nominee, a few dozen lobbyists and their clients instead sipped gin and munched on Brie puffs in an   room at the Union Club. They had come to witness a more urgent presentation: Newt Gingrich, a top Trump adviser and Beltway fixture, painting an upbeat picture of the deals they could help sculpt on infrastructure projects and military spending in the first hundred days of a Trump administration. “It is the business of Washington,” said Michael J. Anderson, a Democratic lobbyist who represents American Indian tribes, after watching Mr. Gingrich speak. “Mr. Trump is talking about changing the paradigm. It’s not changing one bit. The political and influence class is going on as before. ” In Cleveland, even some of those who had worked against Mr. Trump’s candidacy now saw opportunity. In dozens of private receptions, behind a scrim of barricades and police officers, they inspected their party’s new Trump faction with curiosity and hope. There were spheres of influence to carve out. There was money to raise and money to be made, whether or not Mr. Trump ended up in the White House. There were new friends to make and old relationships to nurture. “This is an event like no other  —   there are governors, senators, members of Congress,” said Eric J. Tanenblatt, a longtime ally of the Bush family whose law firm, Dentons, hosted Mr. Gingrich’s remarks on Tuesday. “For people who operate in and around government, you can’t not be here. ” And so, far above the din of protesters and delegates, on the 49th floor of the Key Tower, Squire Patton Boggs, a lobbying and legal powerhouse, held packed receptions honoring Ohio and Florida officials. Not far away, Mike Leavitt, the former Utah governor turned consultant for pharmaceutical companies and health insurers, was slated to lead a panel on policies to spur the development of prescription drugs. As Speaker Paul D. Ryan helped tamp down   efforts on the convention floor, his political operation ran a daily series of receptions and hospitality lounges for members of the “Speaker’s Council,” the top donors to House Republicans. “You have these two worlds colliding a little bit here,” said David Tamasi, a lobbyist at the firm Rasky Baerlein and a top Republican   on K Street, who joined Mr. Trump’s team after his preferred candidate, Gov. Chris Christie of New Jersey, went down to defeat. “That’s what’s going to be interesting: How do the establishment guys make those folks feel at home?” They are doing so, in part, by footing the bill. While some of the party’s elite donors have shunned Mr. Trump’s coronation this week, they are still paying for it. Roughly 500 wealthy Republicans poured close to $16 million into the Republican National Committee’s convention account leading up to this week, according to disclosures made to the Federal Election Commission through last Friday. The biggest donors, giving more than $100, 000 each, are also a veritable roll call of the   movement, among them the billionaire investor Paul E. Singer and Marlene Ricketts, who bankrolled early efforts to deny Mr. Trump the nomination. Mr. Singer did not attend, though his political advisers made the rounds in Cleveland, as did representatives for other megadonors who remain opposed to Mr. Trump. And there were growing signs that at least some of the party’s biggest givers were warming to him:   of Monday’s super PAC reception at the   included Harold Hamm, a billionaire oil tycoon and former energy adviser to Mitt Romney, and Stanley Hubbard, a Minnesota television station owner and prominent donor. Among the guests was Foster Friess, the   mutual fund investor and super PAC donor, who expressed optimism at his party’s prospects. “I think it could be a landslide,” Mr. Friess said in an interview. “Donald Trump has the ability to reach all the plumbers and carpenters and factory workers who usually vote Democratic. ” Mr. Trump, of course, remains unpopular among many Republican donors, and it is unclear how many will ultimately open their wallets to help fund his campaign. Some events were more sparsely attended than they would have been four years ago, Republicans said. It was a little easier to get tickets to concerts in Cleveland, a little easier to get bumped up to the premium hotel rooms. And there is no question that Mr. Trump’s blasts against unfettered trade and Wall Street banks have unsettled powerful business interests  —   and are now, to some extent, reflected in the party’s own DNA. In recent days, Trump activists have helped install new planks in the party platform calling for tougher trade negotiations and for reinstating the   Act, the   law that walled commercial banking off from investment banking. Yet those same power brokers won a more consequential victory even before the convention started, when Mr. Trump’s team helped them quash a rule proposed by some conservative delegates that would have banned lobbyists from serving as Republican National Committee members. The proposal by supporters of Senator Ted Cruz of Texas pitted Tea Party conservatives against the party’s business wing the conservative delegates were soundly defeated. “It is disappointing,” said Mary Anne Kinney, a New Hampshire state representative and Cruz delegate, who was among those who pushed for the ban. “Some of us had heard things that maybe Donald Trump was not a fan of the lobbyists. They are not always for the interest of the people. ” In fact, many of them are for the interests of Mr. Trump, at least this week. Among the floor whips prowling the convention floor in Cleveland in neon yellow baseball caps, managing and corralling delegates, were a number of volunteers from Washington government affairs firms or Capitol Hill. Many had supported other candidates during the primary. Now they were working for their party’s nominee. One of them was Robert Hoffman, a Republican lobbyist at Heather Podesta and Partners. Earlier in the week, the firm hosted a barbecue brunch for friends and delegates, where Mr. Hoffman and his colleagues handed out “Make Lobbying Great Again” stickers. Mr. Hoffman seemed to see Mr. Trump’s policy agenda more in terms of possibilities than threats. The convention, he noted, was a chance to learn more about Mr. Trump’s   plans, and perhaps to help shape them. “We want to be a sounding board,” Mr. Hoffman said. “Not just for our clients, but for our campaign. ”'"}, "time": 1742562110.3003337}