{"duration": 0.05339670181274414, "input_args": {"text": "'Home | World | Vive la Révolution – Marine Le Pen France’s New Jeanne D’Arc Vive la Révolution – Marine Le Pen France’s New Jeanne D’Arc By Gaston 21/11/2016 13:17:50 \\nORLÉANS, – France – Like a Phoenix from the flames, soon France may find liberty and freedom again from the stifling octopus grip of the socialists and EU unelected swine. \\n\\n\\nAu revoir Sarko, you have had your day. Marine Le Pen is sweeping to the helm of the right wing candidates and Fillon will be swept aside too in the upcoming French election in May, 2017. \\nTo be set free from the shackles of euro slavery, and for her economy to shoot up into the outer reaches of space, can the French maiden let loose from the darkness and reach her hand into the light to free France once and for all? \\nCould this be another Trump/Brexit moment at the polls? \\nThe EU and its ludicrous Schengen policy has stifled France, muffled her voice and condemned her to the wild tax mad ramblings of the clinically insane Francois Hollande — a puerile man whose idea of economic embellishment is to categorically destroy everything with socialistic punitive taxes and burdensome mass unfettered migration. \\nCan the rising Joan of Arc save France from being marginalised forever? The French are understandably fed up with the EU communist entity and will do or vote for a saviour from the filthy dank EU prison. The boulevards of Paris may once again be something to be proud of, instead of a stinking piss filled camp of degradation. \\nThe Bastille gates will be breached and the EU technicians taken to the guillotine for some swift justice. \\nVive La France, they will shout as the heads roll into the baskets, these bringers of EU monstrosities onto a land that once coined the phrase Liberté, égalité, fraternité, only to be given Contraite, inégalité, haine. Share on :'"}, "time": 1742564618.326332}