{"duration": 0.1184537410736084, "input_args": {"text": "'Apart from being a tetchy, hotheaded, rude, bullying, cackhanded, ignorant, malevolent and embarrassingly useless excuse for a scientist, Professor Michael Mann  —   the guy behind the   Hockey Stick  —   is also the most outrageous liar. [Mann used often to claim that he was a Nobel Prizewinner  —   till someone unhelpfully pointed out that he was but one of hundreds of scientists who contributed to Assessment Reports by the IPCC (which did win the Nobel Prize in 2007)  This week the   shyster was up to his old tricks again, telling a string of porkie pies at a climate science hearing of the House Committee on Science, Space and Technology. Given how litigious the mendacious, bloviating poltroon can be  —   he’s currently engaged in at least two defamation suits: one against Tim Ball, the other against Mark Steyn  —   I obviously have to tread very carefully here. So I’d just like to say, as delicately and politely as I can to the Distinguished Professor of Atmospheric Science at Penn State University: “Liar, liar. Your pants on fire. ” Here’s the evidence: Porkie Number One, Mann told the Congressional hearing he had no association or affiliation with the Climate Accountability Institute (one of the numerous ad hoc organisations formed in order to give the harassment of climate sceptics an air of scientific credibility). Yet according to his CV he sits on the Climate Accountability Institute’s advisory board and has done since 2014. Porkie Number Two, Mann denied having called his fellow climate scientist and special witness, former Georgia Tech Judith Curry, a “denier”. “A number of statements have been attributed to me. I don’t believe I’ve called anybody a denier,” he solemnly told the hearing. To which Judith Curry, sitting next to him, replied: “It’s in your written testimony. Go read it again. ” You can watch the moment where Curry smacks him down below: Mann then proceeded indignantly to quibble that though he might have called Curry a “climate science denier” he hadn’t called her a “climate change denier”. [As if there’s any meaningful distinction between the two slurs]. But this claim  —   as Stephen McIntyre notes  —   was also a lie. confronted with written evidence that he called Curry “climate science denier” Mann said he hadnt called her “climate CHANGE denier”. #FAKE pic. twitter.   —   Stephen McIntyre (@ClimateAudit) March 29, 2017,  Porkie Number Three, Mann  —   busily trying to develop the case that climate scientists like himself are the innocent victims of vicious slurs  —   was asked whether he’d ever dismissed another of the expert witnesses on the panel, Roger Pielke Jr with the phrase “carnival barker” “You’d have to provide me with the context. I don’t remember everything I have said or done,” said Mann. Here’s one example: Mann said that he didn’t remember calling @RogerPielkeJr a “carnival barker”. But https:  .  pic. twitter.   —   Stephen McIntyre (@ClimateAudit) March 29, 2017,  And here’s Mann again using the insult  —   clearly a personal favourite  —   on Judith Curry: Mann also called @curryja a “carnival barker” pic. twitter.   —   Stephen McIntyre (@ClimateAudit) March 29, 2017,  Porkie Number Four, Mann, in yet another bid to present himself as a persecuted martyr of   Republicans, claimed that Joe Barton  —   the Chair of the House Energy and Commerce Committee  —   had demanded all his “personal emails and correspondence with other scientists. ” This, again, was a lie. Barton had asked for Mann’s funding sources  —   which Mann, in his congressional testimony, said was fair game  —   but not for his personal emails. Here, once again, Steve McIntyre has the evidence. Mann: #fake claim tht Barton demanded “all of my personal emails and correspondence”. Barton: funding info, which Mann said “fair game” pic. twitter.   —   Stephen McIntyre (@ClimateAudit) March 29, 2017,  Michael Mann claims to be an expert on climate change and is frequently called on by official panels like this Congressional committee to speak on behalf of the scientific establishment. Is there anyone who still takes this guy seriously?'"}, "time": 1742563697.8291492}