{"duration": 0.08653068542480469, "input_args": {"text": "'November 20, 2016 - Fort Russ -  Ruslan Ostashko, PolitRussia - translated by J. Arnoldski -  \\n\\n\\nI’ve already taken note of the fact that one only has to mention some problems of the European Union and the reactions of our Westernists will boil down to one argument: “Yeah, sure, Europe is rotting, but it still hasn’t rotted since the times of the USSR.” Now, if I say that the EU is faced with the prospects of a real collapse, then our Westernists will probably write something similar to me and accuse me of belonging to Kremlin propaganda. \\nNo matter what, I will say that the EU risks collapsing in the foreseeable future. In the end, there is nothing wrong with being considered a Kremlin propagandist, especially since I am joined by French Prime Minister Manuel Valls, who yesterday said the same thing. Yes, he even used the word “collapse.” What do you think - did Putin buy him or does he really think this? \\nThe French prime minister made such a statement in Berlin, where he went to discuss with Angela Merkel how to live in the new epoch of Trump. to be honest, the tone of his interview in the German newspaper Sueddeutsche Zeitung suggests that his talks with Merkel are more reminiscent of a collective therapy session than a brainstorming session. Let me tell you what this really reminded me of. \\nFollowing Trump’s victory, many American universities held special psychological support events for students who couldn’t cope with the grief of Hillary Clinton’s defeat. Volunteers and university employees created a pleasant atmosphere for suffering American youth, comforting them and handing out coloring books for adults, brought special therapeutic dogs to pet, and gave students the opportunity to cry a river. Some tests and exams have even been cancelled. \\nThe actions of European politicians following the US elections really remind me of this kind of collective therapy: they cry together, grieve together, convince each other that everything will be fine, but don’t come up with anything concrete. In the interview with the French prime minister, it is difficult to find any kind of concrete action plan. The statement that “France and Germany should be the leaders of Europe” is not an action program. France and Germany have already long since been the leaders of Europe, and the problem is once again that many European don’t like where they’ve brought them. The English and part of the English political elite disliked this situation to such an extent that they voted to leave the European Union. Even Manuel Valls already suspects that Britain won’t be the last country to ask to disembark from the European Titanic. \\nThe prime minister of France suddenly realizes that the EU is faced with the problem of migrants. This is big progress, but with whom is he going to solve this problem? With Merkel? With the very same Merkel who has flooded Germany with migrants and whose approval rating is collapsing for this reason? \\nThere is the theory that France’s prime minister went to Germany to give Frau Chancellor much needed moral support. Western analysts have declared Merkel the “savior of the free world,” but she is the last person who would fit this role, and she herself is not very comfortable in it. Western analysts are at least correctly writing that Merkel does not have the charisma, army, or economy to be the “leader and savior of the free world,” and the EU is falling apart. \\nLet me recall several events which could finish European stability. In December, there will be presidential elections in Austria which could be won by the candidate that is inclined to recognize Crimea and inaugurate Austria’s exit from the EU. Also in December, there will be a referendum in Italy, the results of which could send Renzi’s government into resignation, thus causing a political crisis and a practical paralysis of decision-making at the EU level as long as Italian politicians can’t agree with each other.  \\n2017 will bring even more interesting events. There will be presidential elections in France that might be won by Sarkozy or Marine Le Pen, both of whom are bad enough for Merkel. Merkel herself could lose the chair of Chancellor, although she will try to run for a fourth term. \\nIn fact, I want to ask the fans of Western democracy and peaceful transfer of power: how will a fourth term for Merkel pan out? Democratically? What about a fourth term for Putin? No? The double standards are revealed. \\nJudging by the experience of the US election campaign and the Brexit referendum, I already know who will be blamed. Do you think that Obama has just kindheartedly declared Russia a superpower capable of influencing the world? Of course not. This is an artillery barrage preceding a massive information campaign with the message “Putin is undermining the EU!” After all, Europeans wouldn’t understand how the EU could be undermined by a “regional power” with an economy “torn to shreds.” \\nEverything will be clear. I don’t even rule out that our Kiev opponents will send the next set of fakes to Berlin or Paris in the form of a stolen letter from Surkov, only for BBC and Euronews to then expose some kind of plan to scare voters. This will be, of course, hilarious, but it won’t help European politicians.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564168.6398497}