{"duration": 0.25037288665771484, "input_args": {"text": "'By Rahul Manchanda, Esq. on November 10, 2016 There has never been a better-suited and more experienced President when it comes to these issues... \\nby Rahul Manchanda, Esq. \\nNow that Donald Trump has been elected President of the United States of America, there are a lot of things he needs to do. \\nHe has seen firsthand the unseemly underbelly of the various Deep State actors that have fought tooth and nail to both undermine and character assassinate him, as well as destroy him personally and professionally. \\nBut Donald Trump is made of legendary stuff, and not only endured these constant and underhanded attacks, but also exposed and destroyed them all, one by one. \\nHowever the problems facing him and his administration still exist, and part of his mandate needs to not only “make America great again,” but to also ensure that the cancers that plague American society are dealt with and destroyed, once and for all: \\nThe Media \\nDonald Trump needs to somehow dismantle and break up control of the American media by only 6 major corporations. \\nHe needs to light a fire under the collective asses of the Federal Trade Commission (“FTC”) and force them to do their job. \\nNo agency in the United States is so important but has been so asleep at the wheel than this one. \\nProblems with the FTC and its lack of teeth or motivation has resulted in some of the most heinous consolidations of illicit power in the hands of an evil greedy few, devastating and hurting the American people, and Donald Trump and his family as well. \\nLarge behemoths such as the Hillary Clinton/Deep State allies such as Google and the Major Media need to be first on the chopping/neutering block. \\nThe Big International Banks \\nSimilarly, the awesome power and monetary capital of the big banks, hedge funds, investment banking houses, and other financial institutions have also been left to their own devices, allowed to grow like a cancer without any FTC or Treasury oversight, to the point where they literally threaten American democracy and its people on a daily basis – indeed they, just like the Major Media, got behind Hillary Clinton, even in the face of all her crimes and conspiracies, to unseat Donald Trump to ensure that he never got into Presidential Office. Hillary Clinton’s Wall Street Fundraising Benefited From Loophole In Federal Anti-Corruption Rule \\nThis lesson Donald Trump should never forget – because as long as they are allowed to continue their domestic and global hegemony unchallenged, they will also pose an existential threat not only to the American people and their civil liberties/human rights/constitutional guarantees, but also to Donald Trump and his efficiency as President himself. \\nOne of his first orders of business should be the reinstatement of the Glass-Steagall Act , previously repealed by Bill Clinton in 1998, which separates investment banking money from mom and pop checking/savings accounts, so that risky investments by banking houses will, and should, result in their bankruptcy, rather than being bailed out by the American taxpayer. \\nMany argue that this repeal, coupled with the forced reduction of credit standards of Fannie Mae and Freddie Mac by Bill Clinton through his HUD Director Andrew Cuomo to buy a home, created the mortgage crisis and crashed the American economy (some say deliberately) in 2008. Goldman Sachs sickeningly created a reverse credit swap derivative, betting on the impending housing mortgage crisis, and made billions in the Glass-Steagall repeal that was pushed by their own Robert Rubin, Larry Summers, and Gene Sperling, when they were US Treasury Secretaries and Economic Policy Advisors under Bill Clinton. RUBIN, GREENSCAM, AND SUMMERS \\nDonald Trump also needs to take on the Federal Reserve, audit them, and if he finds any irregularities or shady behavior (which he most assuredly will), then he needs to immediately repudiate and/or renegotiate the insanely ridiculous 23 Trillion Dollars in American Debt, delivering the American People from the yoke of financial and tax slavery by the Central Bankers of America, Europe, and Overseas. \\nOptimally he might consider issuing American currency from the US Government, rather than by a secret closed-off cabal of illicit and greedy private international citizens/corporations. President Bill Clinton promotes NAFTA at the United States Chamber of Commerce in November, 1993. \\nBring Industry and Manufacturing Jobs Back to the USA \\nAs Donald Trump so effectively and succinctly repeated while on the campaign trail over the past 2 years, the North American Free Trade Agreement (“NAFTA”) was single-handedly one of the most devastating and disruptive treaties ever placed on the books of American jurisprudence, thus resulting in the mass loss of tens of millions of American jobs, industries, manufacturing facilities, revenue, and self-confidence of the American people – \\nDonald Trump needs to rebuild and re-establish American pre-eminence in industry, manufacturing, and hardcore goods for services, all made and manufactured in the United States of America. \\nStupid Foreign Wars \\nDonald Trump has also echoed the American overwhelming cry of anti Neo-Conservative bloodlust by keeping America out of stupid, foreign wars geared only for the benefit and power of a few, endangering the safety and welfare of the many. \\nTo do this Donald Trump must revamp and refresh the US Department of Defense, the Pentagon, the Intelligence Services, and the Military. \\nHe must ensure that not one single drop of American blood be shed for another hopelessly stupid war – if the United States has become a National Security State with its greatest source of income and revenue being the weapons, artillery, and products of the Military Industrial Complex (“MIC”) then he needs to find alternative and supplemental sources of revenue such as what was described above in terms of manufacturing and industrial jobs and factories being re-established within the United States. Section 60 of Arlington National Cemetery Offers Tragic Testimony to America’s Most Recent Wars \\nDonald Trump needs to value the heroism and self-sacrifice of American soldiers, military and veterans, and stop sending them on unnecessary stupid wars for the sake of the wealth and power of the Deep State, and also to ensure that once our soldiers return home, that they are treated like the true heroes and privileged class that they are, and always should be (jobs, health care, benefits, and utmost respect). \\nNo one has better described the predicament facing the American People in this regard than Dr Paul Craig Roberts in his stellar work, “The Neoconservative Threat to World Order.” \\nThis also means developing working and effective relationships with other great world powers such as Russia, China, and India, in the spirit of mutual respect and friendship, to jointly take on the world’s problems and terrorists together, based on mutual consultation and consensus, rather than with the United States “policing the entire world.” \\nReversing Divide and Conquer \\nOne of the first things that Donald Trump said upon accepting his election as President was that he wanted to listen to everyone, and bring everyone together under the fabric of the United States of America. \\nRight off the bat, he declared that he would be a uniter, and not a divider. \\nTo that end he needs to now undo the “special protected classes,” chock full of con-artists and whiners who use their protected class status to get special privileges, abuse others, trample on the right of others not lucky enough to be different, or oppress the constitutional, civil, and human rights of the rest of America. From undermining the Second Amendment and influencing elections to sponsoring color revolutions in Eastern Europe and the Middle East, the ominous footprint of George Soros is everywhere.— reclaimourrepublic \\nThese protected classes have been revealed to be the “henchmen” and agents of the Deep State, by the likes of such men as arch-manipulator and “color revolution” social engineer, George Soros, who use these unwitting “protected classes” to do their dirty work, in their ongoing assault on the American people with their “divide and conquer” rhetoric, pitting men against women, children against their own parents, gays against straights, minorities against majorities, and different races/religions against one another. \\nThe only ones who benefit from this intra-American infighting have always been the Ruling Class Deep State Plutocrat Elite, who have watched with smiles, rubbing their hands, as they kept the American people fighting amongst themselves, so that the People are too busy fighting and killing each other to notice or challenge the crimes and conspiracies of the Deep State Elite themselves. \\nCriminal Justice and Family Court Reform \\nNo single “American Industry” has been so lucrative to the Deep State Elite, and debilitating to the American People, than the horrific butchering process known as the American Criminal Justice and Family Court system – indeed many would argue that the dismal state of race relations in America have their origins in the disparate treatment of racial and religious minorities by the state-sanctioned and wholesale criminality of the American Police State as implemented by Bill Clinton and Joseph Biden’s Crime Bill of 1994 and its corresponding draconian legislation pertaining to the family and criminal courts and its privatized prison industrial complex. Surrounded by lawmakers, President Bill Clinton hugs then-Sen. Joseph Biden after signing the $30 billion crime bill at the White House on Sept. 13, 1994. Dennis Cook/AP \\nAll too often, fundamental constitutional rights and guarantees have been squelched and squashed by the “American Stasi ” as formulated by the 1994 Crime Bill, and its corresponding US Department of Justice state-sanctioned “Community Oriented Policing” gang-stalking program, resulting in 1/3 of all African-Americans, 1/6 of all Latinos, and 1/10 of all Whites having been unfairly and without due process, probable cause, or evidence arrested, incarcerated, with families destroyed, resulting in over 70 million Americans with permanent criminal records (more than the entire population of France) – something is wrong here, and Donald Trump needs to do something about the fact that Biden and Clinton et al have transformed our once great and proud country into a “Nation of Criminals.” \\nDonald Trump needs to take the immediate measures and remedies to undo and reverse the American Police State as described by John Whitehead in his seminal book and treatise, “Battlefield America.” \\nForeign Relations \\nAs Donald Trump echoed while on the campaign trail, he is a subscriber to the Thomas Jefferson school of thought of “Peace, commerce, and honest friendship with all nations – entangling alliances with none.” I am sometimes asked if I have any regrets about publishing our book. As of today, my only regret is that it is not being published now. After the humiliations that Obama has endured at the hands of the Israel Lobby and the Hagel circus, we would sell even more copies and we would not face nearly as much ill-informed criticism. — Stephen Walt, co-author of the book. \\nDonald Trump is an “America-Firster,” and will not allow the United States to get embroiled and enmeshed in unnecessary foreign stupid wars, treaties, and other entanglements which tend to negatively affect American sovereignty, weighing us down like a rock around our collective necks – foreign nations need to put their “big boy pants” on and deal with their own internal skirmishes, civil wars, financial problems, and other internecine conflicts on their own, without the constant hand-holding (and financial and military support) of the United States and its hard working taxpayers. \\nUnless the sovereignty or security of the United States is directly at risk, the USA needs to stay the hell out of the worlds’ problems and to focus on our own people, economy, and issues. \\nThe sentiments echoed herein can be attributed to legendary libertarian statesmen such as Dr Ron Paul and his protege Daniel McAdams. \\nRe-injecting and Reinforcing American Moral Standards \\nNo area of American life has been so undermined and impacted as the deterioration of fundamental American values, morals, and character in the past few decades of American society, disastrously affecting American individuals, families, cities, states, and eventually the nation itself. \\nThis has been augmented and exacerbated by the constant, irresponsible, and disgusting messages in the American media, movie industry, Hollywood, by the undermining of organized religion in America, and the disruption of common value systems as brought on by unregulated mass immigration and non-assimilation by various foreign elements. \\nA nation’s moral health and compass is absolutely essential for it to be considered a “Shining City on a Hill” as described by legendary President Ronald Reagan himself. \\nFor this, Donald Trump must use his “bully pulpit” as a leader to identify, isolate, target, and then take on the purveyors of common filth and disrepute by the American Hollywood movie and television industry, media, and other enemies of common human decency and morality. \\nAmerican Infrastructure \\nAs Donald Trump is the ultimate and consummate “builder,” it will be awe-inspiring to watch him re-build American infrastructure, such as our railroads, transportation systems, airports, roads and highways, hospitals, schools, buildings and cities. \\nThere has never been a better-suited and more experienced President when it comes to these issues, and Donald Trump will not disappoint in this very important arena of America’s pride, patriotism, self-confidence, and self-respect. Incumbent Attorney General Loretta Lynch \\nCleanse The Judiciary \\nIt is no secret that the last 8 years of steady Obama appointments have stocked the American Judiciary, federal state and local, with either Deep State bankster agents, or their “protected class” useful idiot appointees, who all report back to the same Deep State Oligarchy/Plutocracy anyway. \\nThe only thing these appointees have in common is that they generally have no respect for or understanding of the US Constitution or the Bill of Rights. \\nThe direct Deep State judicial appointees, usually hailing from the big law firms who in turn represent the big banks/corporations, know exactly who their masters are, while the ambitious “protected class” judicial appointees are either imbalanced activists, or too stupid to realize that their biased, unconstitutional judicial opinions serve the same Deep State Elite anyway, as they help to eviscerate and destroy the protections afforded and guaranteed by the US Constitution. \\nEither way, a major house cleaning is in order, and Donald Trump needs to re-stock the judiciary with learned, educated, and constitutionally minded judges in the federal and state courts all throughout America, beginning with the major cities first, “pruning the judicial tree” as he goes along. \\nAlso see:'"}, "time": 1742562687.5192833}