{"duration": 0.13885760307312012, "input_args": {"text": "\"Teacher's Letter To Students Holds The Formula To World Change Nov 15, 2016 0 0 And we don’t have to be president to help make the world a better place either. For a very long time now, we have wanted change to be served to us on a silver platter. And I’m not just talking about “the sheeple” here; who still believe in the current political system. I’m mostly talking to us, “conscious”, “awakened” and informed “truthers” as we sometimes call ourselves. See, we might complain about others sitting on their couches, being brainwashed by the news and cheering for a next savior. Now let’s make sure we aren’t just sitting behind comput ers, waiting for “the people to wake up” before we can ourselves embody the love, compassion, kindness and healing we wish to see reflected in the world. We are “the people”, aren’t we? So why should we expect so much of “them” (whether we are talking about the government or “the people”) as if they are this separate “thing” that, once changed, will allow US to change? As Mrs. Nagy said in this beautiful letter, decision-making is far from being a job exclusive to a president. Actually, the biggest decision-making job has always been ours. All of our small choices and actions combined are what make society. Nobody is forcing us not to show compassion, help the needy or cooperate with our fellow brothers and sisters for a better community and world. Nobody is forcing us not to raise our children with wisdom, love and compassion so that they become better stewards of the Earth. Our egos may readily want to dismiss this (and I know because mine did for the longest time)… but the truth is, we change the world by HOW we live our lives , not what we intellectually understand or spend time arguing about. Our Main Project Should Be… When we understand that the world is like one big body, and each and everyone of us are a cell within it, we understand that our primary “project” isn’t so much about external doings. Our primary project is ourselves. It’s about being that one healthy cell. And as we evolve into our most authentic, kindest, wisest and most compassionate self; our actions and the way we use our gifts will not only uplift the world around us, but will have that much more power. Coming from this space, we allow life’s higher intelligence to flow through us. We let go of the countless self-limiting and fearful stories we have told ourselves. In other words, we “get out of our own way”. This is when floods of synchronicities, soul mates and opportunities to do what we came here to do (and most importantly be who we came here to be) enter our lives. And this is when we get to be the change we wish to see in the world. “These little decisions you make that you think aren’t a big deal, are the biggest deal. These things that feel lighter but we ignore, are all part of the big picture. Are all part of a sign towards what you’re really here to do. The more you listen to your calling rather than your old story, the more it’s going to guide you to an incredible amount of you impacting the world.”– Kyle Cease \\nTrying to “change the world” without seeing ourselves as part of that equation is as if we are one unhealthy cell trying to “fix” all surrounding cells. Biology shows us that it takes one healthy cell to trigger all nearby cells to start healing. What if our actions came from a place of inner-transformation, as opposed to us trying to transform the world while we remain unchanged? Imagine if more of us chose to be that one healthy cell… Easier Said Than Done Yes, Of course. I know, because I have preached about “world change” for years before I very recently realized that the quality of my state of being, actions and relationships did not reflect the degree of love, harmony and compassion I wished to see in the world. It is hard, because it requires a personal revolution. A personal “detox” of everything that has been holding us back from being our greatest expression here on Earth. And as we all know, detox symptoms aren’t always easy. As we open our hearts, our egos might tell us it is unsafe. As we think about being generous and giving, our egos might scream “what’s in it for me?”. As we seek to collaborate with and help one another, our egos might sense a threat to its own “success”. As we choose to be fully authentic and true to our calling, our egos might fear there won’t be anybody to catch us “on the other side”. That is because a sense of scarcity, lack and “not enoughness” has been drilled into our skulls by a culture that runs on the glamorization of superficiality and lies. A culture that pits us against ourselves and each other. But haven’t we noticed how even some of the most successful, popular, respected and validated individuals on earth end up ridden with anxiety, depression and a deep loneliness of the spirit ? Perhaps this is a cue that self-maximization — at the expense of a sense of community with our larger human family — isn’t what we truly desire. Maybe we are wired for connection. Maybe we are wired “for each other”. “We’ve adopted a toxic philosophy that shapes our society: To the winner belongs the spoils”. The idea that if you don’t win, you’re going to lose. You’re going to starve. Your kids aren’t going to eat. It’s not going to be your world, it’s going to be the winner’s world. And that’s exactly why we have the world that we have. But as parents, would we tell our children that if one of them succeeds, the other would starve? Would any parent do that to their children? No, because they are a family. At what point does the human family stop being a family?”– Tom Shadyac This all may sound fluffy, cliché or naive, but I am pretty sure that as young children— before we got indoctrinated into “toughening up” and trampling over others to get ahead and find security — we just wanted love. We just wanted to share and rejoice in the community of our own family. We just wanted to play, express ourselves, love and care for one another. We felt a deep resonance with our interconnection that got twisted and severed along the way. Obviously, the world isn’t short of dysfunctional families, challenges and influences that kick the softies, givers and lovers out of us all. But really, these influences just added layers of pretence, beliefs and defence mechanisms over what we have always been and yearned for. So who is going to be the brave one and put their mask down first? It doesn’t really matter who. It really only matters if you will. Because… well… not to add any pressure or anything, but the entire world would rejoice in your light. “Whether you accept it or not, each life is linked to all life. Your thoughts, words and actions create a ripple effect; much like a stone thrown into a pond. The quality of that ripple effect… is your legacy” – Kosta Stoyanoff If you resonate with this message, stay tuned for the beautiful work that is to come over at Uplifted Life . We are making it our mission to help bring this consciousness into the lives of many — not only through words, but through practical tools and support.\""}, "time": 1742563460.504705}