{"duration": 0.04620671272277832, "input_args": {"text": "'When Irish golfer Rory McIlroy accelerated his rehab for a stress fracture to his ribs to play a round of golf with the newly elected 45th president of the United States, Donald Trump, he took a pounding from fans and the press. [Now McIlroy is saying that the juice may not have been worth the squeeze. “Would I do it again?” he said on Tuesday. “After the sort of backlash I received, I’d think twice about it. ”  Fans tweeted the    Irish golfer, ranked #2 in the world, and accused him of “normalizing this lying, racist scumbag. ” Lefties from across the globe expressed that they lost all respect for McIlroy.  USA Today writer Christine Brennan can’t understand why Rory, who says “he won’t be having many cups of tea” with the members of the Honourable Company of Edinburgh Golfers because they took so long to admit women members to Muirfield golf club, agreed to play with someone as horrible as Trump in the first place.   Brennan wrote, “But wasn’t it natural to wonder why he said he wouldn’t be having tea with the sexist members of that stodgy club, yet still felt comfortable playing a round of golf with a man who bragged about sexually assaulting women, mocked a disabled person and carried on a   battle with a Gold Star family, among other things?”  McIlroy said about his golf outing with Trump, “there was not one bit of politics discussed in that round of golf. He was more interested talking about the grass that he just put on the greens. “But, yeah, look, it’s a difficult one. I felt I would have been making more of a statement if I had turned it down. It’s not a tough place to be put in, but it was a round of golf and nothing more. ” McIlroy has already expressed on his twitter feed that, ”This wasn’t an endorsement nor a political statement of any kind, It was, quite simply, a round of golf. ”'"}, "time": 1742562174.6960351}