{"duration": 0.10534095764160156, "input_args": {"text": "'Since its origin in Entebbe, Uganda, in 1947, the Zika virus has spread through Brazil, into South and Central America and the Caribbean.\\nThe Zika virus is contracted through a bite from an Aedes aegypti or Aedes albopictus mosquito, native to Brazil. It can also be transferred through sexual intercourse with an infected person. The virus was first found in a monkey, in 1947, and finally released as the Zika virus in 1952.\\nIn 1954, a human in Nigeria was infected. From then until 2015, there have been minimal cases of the Zika virus, around the world, including Africa and Asia, in 2007. At first, the virus was mistaken for dengue fever, which is also spread through mosquito bites. It is viral and transmitted throughout the tropics. Side effects include a rash, conjunctivitis, and arthralgia. Serum taken from the patients showed ribonucleic acid (RNA) from the Zika virus, even though both conditions are similar.\\nThe symptoms of the Zika virus are usually mild and most of those infected do not even notice. However, a few adults have experienced temporary paralysis. Unfortunately, the virus can cause severe birth defects in the brain of the baby, as it develops. It can cause the infant to have brain damage and a smaller head. Pregnant women have been urged by the Centers for Disease Control (CDC) not to return to areas that have been affected by the virus, and women who are looking to get pregnant have been told to get tested for the virus. In three months, Brazil reported over 3,500 cases of birth defects, and some have led to death.\\nIn late July 2016, the Florida State Department of Health released information reporting that four people were discovered to have contracted the virus, revealing that it had reached the U.S. The location was limited to a small area in Miami, but according to the CDC there are travel-related virus cases in all the states. The worst was Florida.\\nUnlike these four patients, over 1,600 people in America have been infected by the Zika virus due to travel to an affected area. These four people were infected by a mosquito located in Florida. Researchers have said this was inevitable due to the state’s close proximity to Puerto Rico and the Caribbean, which are both highly infected areas.\\nThey believe that the mosquitoes in Florida are not the original mosquitoes that carry this virus since their travel is limited to 500 feet. Instead, researchers think the mosquitoes bit people already infected with the virus, and that is how it began to spread, in southern Florida. In an effort to rid the Miami area of these mosquitoes, Wynwood, a small part of the city, has been aerially spraying pesticides to kill the pests.\\nPublic health officials are fairly confident that the number of infected people would be limited since most homes in the south have air conditioning, unlike many of the other countries that have been infested. The Aedes aegypti mosquito is rare in the U.S. and is not often found in the northern hemisphere. This newly reported information has led to a push for Congress to allow more funding to battle this virus. In July 2016, Congress left for recess without approving any funding for the virus.\\nHowever, in late September, due to the continuing outbreak of the Zika virus, the U.S. Senate approved $1.1 billion in funding to battle the virus. This money will go toward rebuilding Louisiana, increased control of the mosquitoes, continue to fund research on the virus, and hopefully find a possible vaccine.\\nMost recently, the Florida Department of Health stated there were 878 cases of the virus. In the U.S. alone, there have been 3,358 cases. It is even more staggering in the U.S. territories, where the number of infected people reached close to 20,000, as of September, according to the CDC website. The virus is becoming a serious health issue in the U.S. Federal and state agencies are working together to battle this virus from spreading any further.\\nBy Allison Murphy\\n \\nCDC: Case Counts in the US\\nThe New York Times: 4 Zika Cases in Florida Were Likely Spread by Local Mosquitoes, CDC Says\\nZika Virus: History\\nLocal 10 News: Senate approves $1.1 billion to fight Zika virus\\nCBS News: Zika warning lowered for part of Miami, as spraying continues\\nCBS News: Florida triples Zika transmission area as new cases reported\\nImage by Master Sgt. Brian Ferguson Courtesy of Airman Magazine’s Flickr Page – Creative Commons License    Congress , florida , spot , Zika'"}, "time": 1742564317.9822206}