{"duration": 0.07377982139587402, "input_args": {"text": "'  RT \\nThe record shows Hillary “We Came, We Saw, He Died” Clinton is the ‘Queen of War’. \\nShe is fully supported by virtually the whole US establishment; a bipartisan, neocon/neoliberalcon, regime change/”humanitarian” imperialist axis. \\nOn the opposite side, for all his personal pathology problems and incoherent twitter-mouth ramblings, Donald Trump seemed to be on the money when he said that if elected, Hillary would use Syria to unleash WWIII. \\nTo check out if that holds, let’s start with an essential backup. \\nThe ‘Queen of War’, at the final US presidential debate in Las Vegas: \"A no-fly zone [in Syria] can save lives and hasten the end of the conflict.\" \\nThe ‘Queen of War’, in one of her 2013 speeches to Goldman Sachs, published by WikiLeaks: a no-fly zone would \"kill a lot of Syrians.” \\nThe Chairman of the Joint Chiefs Marine Gen. Joseph Dunford, speaking to the Senate Foreign Relations Committee: a no-fly zone in Syria “would require us to go to war, against Syria and Russia.\" why_hillary_won_t_unleash_wwiii_-_rt_op_edge.png \\nPredictably, the Clinton (cash) machine has been relentless promoting Hillary’s no-fly zone. Whenever cornered, the machine switches the narrative to Russian hacking of the DNC. Edward Snowden, who knows a thing or two about cyberwarfare, stresses there is no solid proof Russian intel hacked the Democratic/Clinton machine. And if they actually did it, the NSA would know. The fact the NSA is mum reveals this is no more than information war. \\nPass the missile launchers, please \\nTrump seems to have been more on the money when he insisted how Hillary will be outsmarted – as she already was in the past – when dealing with President Putin, who she has demonized as Hitler. \\nI have shown how Hillary will be prevented from launching WWIII because her no-fly zone is already implemented in Syria by Russia. And the Pentagon – reflecting Dunford’s comments - knows it, no matter how emphatically soon-to-be-unemployed Pentagon head Ash Carter threatens “consequences.” \\nThe Pentagon ranks Russia and China as the number one and two “existential threats” to US national security, in that order. And the US government reserves for itself the privilege of a nuclear “first-strike”– which Hillary supports (but not Trump); this is part of the 2002 Full Spectrum Dominance doctrine. \\nThe relentless hysteria now crystallized as Cold War 2.0 has led scores of analysts to game the actual – terrifying - possibility of a US-Russia hot war. As much as the Cold War MAD (Mutually Assured Destruction) doctrine may now lie in the dust – exactly because Washington refuses to back down from “first-strike”– only armchair Dr. Strangeloves get their kicks with the possibility of fighting a nuclear power. Dunford does not seem to be one of them. \\nWhat Hillary Clinton will certainly do is to double down on proxy wars, Vietnam/Afghanistan-style. So expect a President Clinton to authorize full weaponization of those Beltway-loved “moderate” Al-Qaeda-in-Syria rebels with plenty of shoulder-held missile launchers. This could easily get out of control – with lethal, yet not nuclear, consequences. \\nThat’s exactly the point made by Mikhail Rostovsky in Moscow daily Moskovsky Komsomolets; if Hillary ratchets up tensions, “things could get out of hand.” \\nAlso expect not so proxy ratcheting up of tension in the South China Sea; after all it was Hillary who claimed ‘mothership’ of the pivot to Asia; and it was Hillary who steered intra-South East Asian maritime disputes into the boiling cauldron of wider US-China competition. \\nAnd if that was not hard boiled enough, US frustration will be at an all-time high after Philippines President Rodrigo Duterte’s own pivot to China. \\nSay hello to my new Sarmat \\nA case can be made that official Moscow is carefully getting ready to work with a Clinton – as in Obama III – presidency, with Hillary, a devil they know well when she was Secretary of State, to be dealt with as a pragmatist, unwilling and unable to plunge US-Russia relations into total incandescence. \\nA Clinton presidency for its part should know better than overestimate Russia’s financial “weakness.” \\nThe national debt of Russia is only 17.7 percent of GDP; for the US it is a whopping 104.17 percent of GDP, or $19.2 trillion. Russia in 2015 had a trade surplus of $150 billion, while the US had a trade deficit of $531.5 billion. The current account surplus of Russia was 5.1 percent of GDP, or 65.8 billion, while the US ran a current account deficit of 484.1 billion, or 2.7 percent of GDP. \\nBesides, Russia has all the natural resources it needs; unlike the US government, which believes it needs an empire of bases overseas and ten aircraft carrier task forces to secure the resources it lacks. \\nMoreover, as much as the Pentagon may continue to be infested by neocon cells, sound generals are also able to identify key Russian signals – such as the unveiling of the RS-28 Sarmat nuclear missile, which NATO calls Satan 2. The Sarmat delivers monster warheads of 40 megatons; boasts a top speed of seven kilometers per second; and is able to outfox any anti-missile shield system anywhere.'"}, "time": 1742564139.0863264}