{"duration": 0.047414302825927734, "input_args": {"text": "'When writing for the weddings pages of The New York Times  —   which I have done since 1992, at first on a weekly basis and now occasionally  —   the job is to walk into a room full of   strangers and collect the best descriptions you can find about love and marriage, mostly love. It isn’t easy. For one thing, people sense a stranger in their midst as acutely as a herd of gazelles might, and they tend to scatter, or stare from a distance in a menacing way. Over the years, I have filled many spiral notebooks with quotations. On the subject of love, clichés are hard to avoid. I have heard, “  are like two pieces of a puzzle,” or “It was     to be” thousands of times, or that’s how it feels anyway. Occasionally, though, people say something original and sparkly about love, and as a reporter, I want to hug them. It’s like finding a diamond in the sand. As a sort of   to all of those whom I have written about, and those whom I have written for, here are 10 of those jewels: 1. “In a sense, the person we marry is a stranger about whom we have a magnificent hunch. ” This is my   favorite quotation about marriage, spoken during a 1992 wedding in a small, unheated chapel in Cold Spring, N. Y. and sourced from the 1991 book “Weddings From the Heart” by Daphne Rose Kingma. In its own way, the quotation also explains a lot about divorce. 2. This remark, from a Vows column about the 1995 wedding of Elizabeth Burbank and LaMott Britto, describes how it feels to finally find a partner: “I’ve always felt like a fish out of water, and when I met LaMott it was like he was the same fish. ”  3. According to Stacy Cor, who became engaged to Dan Polner 10 days after they met on an airplane in 1993, examination should not be necessary to determine if love is real. “When you know you know, and don’t believe it any other way,” she said. “When someone asks you to marry them, you shouldn’t have to make a list of pros and cons. You just know. You jump into their arms and say, ‘Yeah! ’” 4. For some, “knowing” is not so obvious. This is how Patricia Durkin knew Kenneth Wignall, whom she would marry in 1995, was right for her: “One night, a moth was flying around a light bulb and he caught it and let it out the window. I said: ‘That’s it. He’s the guy. ’” This quotation also speaks to the fruitlessness of trying to impress someone with a certain look, attribute, political affiliation or apartment décor. The things that spark attention and interest are often mysteries, even to ourselves. So throw out the list. 5. When brides and grooms describe their first or second meetings, they often say they feel as if they have known each other forever, possibly even in former lives. “I feel like Sean and I have known each other since the beginning of time,” Meghan Milewski said of Sean Yeaton, whom she married in 2013. “I always tell him, ‘After we die, we have to find each other in our next life.’ I also tell him if I die before him, I really want him to fall in love again. But in our next lifetime, he has to find me, not her. That’s the deal. ”  6. Sometimes, you only learn what love is by breaking up. Before Eames Yates and Pamela Taylor were married in 2006 in Snowmass, Colo. they separated for a period of time that was especially excruciating for Mr. Yates. It was also illuminating: “I now know what love is,” he said. “It’s when someone becomes part of every breath, in what way I do not know. But I couldn’t breathe without her. ”  7. Billboards and big diamonds are not necessary for proposals to be romantic. This is how Gabriela Power Porto described the marriage proposal Peter Castaldi put forth, more than two decades ago, one of the sweetest I ever heard: “When he gave me the ring, he said: ‘It’s not a big stone you can’t carry around. This ring won’t put you in danger on the subways.’ He said, ‘This is a solid ring, like my promises. ’”  8. How should you feel on your wedding day? There are no rules, but this is how Ryan Baker described the day of his 1995 wedding to Brett Savage: “It was like a dream. It was surreal. In life, you don’t have to search for bad things  —   they find you without a problem. Disasters always seem to know your address, even if you move. But the good times, they’re hard to find, and this one was one of those truly spectacular times. ”  9. Of all the homemade vows I’ve heard, one spoken by Melissa Richard during her 1996 wedding to Frank J. Oteri sums up the reason we continue to marry, against the odds: “Of my own accord, I present myself, my days, my nights and my life. I present them freely and willingly because they cannot be better spent than in your company. ” More than a few couples I’ve interviewed have described love as a good conversation that lasts. 10. However, nothing lasts forever (unless you believe in reincarnation). The Rev. William G. Kalaidjian, who was known as Reverend Bill and died in 2015, was the officiant at one of the first weddings I covered, in 1992. He lived in a house full of noisy clocks. “I like to hear the tick, tick, tick of clocks,” he said. “I always tell the couples I marry, ‘Take time before time takes you. ’”'"}, "time": 1742628587.4857104}