{"duration": 0.1425321102142334, "input_args": {"text": "'E-mails - Hillary Clinton and the Muslim Brotherhood by Thierry Meyssan The FBI investigation into Hillary Clinton’s private e-mails is not directed at a case of negligence in the face of security regulations, but at a conspiracy attempting to eliminate any trace of her correspondence which should have been archived on the servers of the Federal State. It could include exchanges about illegal financing or corruption, and others concerning the links between the Clintons, the Muslim Brotherhood and the jihadists.\\nVoltaire Network | Damascus (Syria) | 1 November 2016 ελληνικά Español français Türkçe русский Deutsch Hillary Clinton and her chief of staff Huma Abedin. The reprise of the FBI investigation of Hillary Clinton’s private e-mails no longer concerns questions of security, but rather acts of skulduggery and cheating which could be as serious as high treason.\\nTechnically, instead of using one of the secured servers of the Federal State, the Secretary of State had ordered the installation of a private server in her home, in order to be able to use the Internet without leaving any trace on a machine belonging to the Federal State. Mrs. Clinton’s private technician had voided the server before the arrival of the FBI, so that it was impossible to know why she had set up such a network.\\nFirst of all, the FBI noted that the private server was not protected by the same security system as the State Department server. Thus Mrs. Clinton had only committed a security fault. Secondly, the FBI confiscated the computer of former Congressman Anthony Weiner, the ex-husband of Huma Abedin, Hillary’s chief of staff. The FBI found e-mails from the Secretary of State on his computer.\\nAnthony Weiner is a Jewish politician who is very close to the Clintons, and who harboured the ambition of becoming mayor of New York. He was obliged to resign following a very Puritan scandal – he had sent erotic SMS’s to a young woman who was not his wife. Huma Abedin officially separated from him during the scandal, but in reality, did not leave him.\\nHuma Abedin is a US citizen who was raised in Saudi Arabia. Her father is director of an academic revue – of which, for many years, she was the sub-editor – which regularly prints comments from the Muslim Brotherhood. Her mother is president of the Saudi association of female members of the Brotherhood, and worked with the wife of Egyptian President Mohamed Morsi. Her brother Hassan works for Sheikh Yusuf al-Qaradawi, the religious authority of the Brotherhood and spiritual counsellor of Al-Jazeera.\\nDuring an official journey to Saudi Arabia, the Secretary of State visits Dar al-Hekma college, accompanied by Saleha Abedin (mother of her chief of staff), president of the association of the Sister members of the Brotherhood. Huma Abedin is today a central figure of the Clinton campaign, alongside the campaign director, John Podesta, ex-General Secretary of the White House under the Presidency of Bill Clinton. Podesta is also the appointed Congressional lobbyist for the Kingdom of Saudi Arabia – for the modest amount of $200,000 per month. On 12 June 2016, Petra, the official Press agency of Jordan, published an interview with the crown prince of Arabia, Mohamed Ben Salmane, in which he affirmed the modernity of his family, which had illegally financed Hillary Clinton’s Presidential campaign to the tune of 20%, despite the fact that she is a woman. The day after this publication, the agency cancelled the dispatch and claimed that its Internet site had been hacked.\\nAccording to the official Jordanian Press agency, Petra, published on 12 June 2016, the Saudi royal family illegally financed 20% of Hillary Clinton’s Presidential campaign. Mrs. Abedin is not the only member of the Obama administration linked to the Brotherhood. The US President’s half-brother, Abon’go Malik Obama, is the Treasurer for the Brotherhood’s missionary work in Sudan, and also President of the Barack H. Obama Foundation. He is under the direct orders of the Sudanese President, Omar el-Béchir. A Muslim Brother is a member of the National Security Council - the highest executive position in the United States. From 2009 to 2012, this was the case of Mehdi K. Alhassani. We do not know who succeeded him, but the White House denied that a Muslim Brother was a member of the Council until the proof surfaced. A Muslim Brother, Rashad Hussain, is also US ambassador to the Islamic Conference. The other Brothers who have been identified occupy less important functions. However, we must name Louay M. Safi, a current member of the Syrian National Coalition and ex-advisor to the Pentagon.\\nPresident Obama and his half-brother Abon’go Malik Obama in the Oval Office. Abon’go Malik is the Treasurer of the Missionary work of the Muslim Brotherhood in Sudan. In April 2009, two months before his speech in Cairo, President Obama secretly received a delegation of the Brotherhood in the Oval Office. During his induction, he had already invited Ingrid Mattson, the President of the Association of Muslim Brothers and Sisters in the United States.\\nFrom their side, the Clinton Foundation had employed Gehad el-Haddad as director for his «Climate» project - he is one of the world leaders of the Brotherhood, and had until that time been director of a Koranic TV programme. His father was one of the co-founders of the Brotherhood, when it was created by the CIA and MI6 in 1951. Gehad left the Foundation in 2012, when he became the spokeman for candidate Mohammed Morsi in Cairo, and then the official spokesman for the Muslim Brotherhood world-wide.\\nGiven that all the jihadist leaders in the world have either come from the Muslim Brotherhood or the Sufi Order of the Naqshbandîs – the two components of the Muslim World League, the Saudi anti-Arab nationalist organisation – we would like to know more about Mrs. Clinton’s relations with Saudi Arabia and the Muslim Brotherhood.\\nAs it happens, in the team of her challenger, Donald Trump, we note the presence of General Michael T. Flynn, who attempted to oppose the creation of the Caliphate by the White House, and resigned from the direction of the Defense Intelligence Agency in order to signal his disapproval. He works alongside Frank Gaffney, a historical «Cold Warrior», now qualified as a «conspiracy theorist» for having denounced the presence of the Brotherhood in the Federal State.\\nIt goes without saying that from the FBI’s point of view, any support for jihadist organisations is a crime, whatever the policy of the CIA may be. In 1991, the police – and Senator John Kerry – had provoked the ecollapse of BCCI, a Pakistani bank (although it is registered in the Cayman Islands), which the CIA used for all sorts of secret operations with the Muslim Brotherhood and also the Latino drug cartels.\\nThierry Meyssan Translation\\nPete Kimberley'"}, "time": 1742563795.4656231}