{"duration": 0.12548232078552246, "input_args": {"text": "'Did the Clinton Foundation Personally Enrich Barack and Michelle Obama? Did the Clinton Foundation Personally Enrich Barack and Michelle Obama? \\nBy Judi McLeod \\nDid the pay-for-play Clinton Foundation personally enrich Barack and Michelle Obama? \\nA question well worth thinking about because the corruption of Hillary Clinton is the horse that bolted out of the barn on the watch of Community Organizer President Barack Obama. \\nIn her own words, Hillary Clinton went from “being broke” in 2001 to a net worth of $350 million and still counting in 2016. \\noo many forget that Clinton enriched personal friends and foreign powers while she would be under scant suspicion as Obama’s chosen Secretary of State. It is vital to ask before Tuesday were Barack and Michelle two of the friends enriched by the corruption that flowed from the Clinton Foundation? \\nDuring the time of Hillary Clinton’s corruption at work, Obama did not just keep looking the other way, he actually corresponded with Clinton on her private basement server under a fake name of. \\nHow like him to operate under a fake name as that’s what he’s been doing since 2008! \\nWhere’s the forensic investigation to tell us how much money has been siphoned off to the bank accounts of Barack and Michelle Obama through the Clinton Foundation? \\nStanding in for the MIA mainstream media, radio talk show host Rush Limbaugh is asking the questions the voting public need need answered: \\n“Have the Clintons been selling United States foreign policy? \\n“Have the Clintons been engaging in pay for play? Meaning: You pay them and they’ll play ball with you by giving you policy considerations or what have you.” Have the Clintons been selling United States foreign policy? Engaging in pay for play? \\n“There is little doubt in the layman’s world that that has been going on. Proving it is quite another matter, but there’s little doubt, especially in the political world. There’s no doubt in my mind that that’s what’s been going on and that’s why she set up the server in the first place. The entire reason for the server in her basement was not because she wanted privacy per se. It’s not because she wanted convenience. It’s not because she didn’t want to go to the hassle of having a StateDepartment.gov email address. It’s not because she didn’t trust people. ( Rush Limbaugh Nov. 3, 2016) \\n“The reason she set up the server in her basement was specific, and it was to be able to conduct business for the foundation and keep those emails from ever being seen by anybody, including Freedom of Information Act requests. And what the Clintons have been doing via their foundation is where the real criminality is. There’s negligence and intent over on the email server side with classified data being trafficked and so forth. But over here at the foundation, that is where the Clintons have been engaging…” \\nThere can be little doubt that Obama’s a valued player of the Bill, Hillary, Huma and Anthony Weiner baseball team. \\nIndeed we can see for ourselves that the Obamas are proud of what Hillary has done in the shocking and revolting pay-for-play game. Both president and First Lady have been out on the campaign trail telling Americans Hillary’s the ONLY option for president. \\nIn praising his former Secretary of State, Obama has been telling outright lies, including the whopper that “the fate of the world is teetering” because of Donald J. Trump. \\n“The fate of the world is teetering” because Obama seeks to kill off all life for Western society. \\nHow conniving Obama is in his ‘Elect Hillary’ stumping: \\n“You know what? She’s not flashy. She’s not going around spending all the time giving big stemwinders. And as a consequence, sometimes she’s underappreciated here at home,” he said. “But she made me a better president,” Obama told an audience of university students in Chapel Hill, N.C. \\n“Obama became most animated, and spent the most time, on the topic of Trump – a person he views as an existential threat to not only his legacy, but the world. \\n“I am not on the ballot. But I tell you what, fairness is on the ballot, decency is on the ballot, justice is on the ballot, progress is on the ballot,” he warned, his voice noticeably rising. “Our democracy’s on the ballot right now!” Clinton didn’t make Obama a better president but most likely only a richer one \\nClinton didn’t make Obama a better president but most likely only a richer one. \\nObama IS “On the ballot” because he’s going for a third term through the election of the country’s biggest liar. \\nCivil unrest is being planned by community organizers everywhere should Donald Trump be elected, and the draining of the swamp will be epic. \\n“For unto whomsoever much is given , of him shall be much required ,” reads Luke 12:48 in the King James Version of the Bible. \\nTrump’s first job should be return the White House, now a den of inequity, to the people. America needs a White House that belongs—not to the perps but to the people. \\nWhen global masters inflicted the community organizer president on the world back in 2008, it did not include a right to dictate who would follow him as president. \\nToday’s the last ‘Friday Dump’ until after election and millions wait for the other shoe to drop. \\nNo matter what today’s dump brings, millions who want a better America will survive it and go on to fight the Obama-Clinton cabal to the finish. \\nGod help us all because the devil is now running as freely in the White House as he is at the Vatican. \\nH/T – CanadaFreePress \\nSupport the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742564358.397002}