{"duration": 0.04941606521606445, "input_args": {"text": "'Share This An Eritrean asylum seeker to Orsa, Sweden, was found guilty of repeatedly beating and raping a young woman, ultimately impregnating her. However, the court’s final ruling proves they are more concerned with the migrant convict than his permanently traumatized victim. \\nAn asylum seeker brutally beat, raped, and impregnated his traumatized victim only to return later and sexually assault her once more, telling her that he would kill her if she reported him. Unbelievably, the court has not only ruled that he is allowed to stay in the country as a refugee but are about to grant him an outrageous “consolation prize.” \\nAs Europe continues to welcome the ceaseless flow of tired, poor, and hungry migrants, a devastating amount of the so-called asylum seekers are using the warm embrace to sink the knife of multiculturalism deep into the backs of their progressive hosts. The left is shocked that the tolerance and respect they bestow isn’t returned. Instead, the same brutality and oppression perpetuated in their homelands are brought with the migrant flow. Unfortunately, liberals still haven’t figured out that no matter how much they appease their guests, their hospitality will not change millennia of cultural and religious savagery. \\nOn August 14, 26-year-old Zaid, an asylum seeker from Eritrea, was arrested for the repeated rape and physical torture of a young woman in Sweden. Amina, who is also from a third-world country, suffered severe trauma after Zaid attacked and sexually assaulted her. \\n“The kicks hit the thighs, legs and upper body. She screamed for help from neighbors, but she does not know if they heard. The blows and kicks hurt. She tried to break free, but she could not,” the prosecution stated. \\nOn September 4, Zaid broke into Amina’s home in Orsa, poured a pot of boiling coffee over her chest, and punched and kicked her until she was subdued. Again, the migrant raped the poor young woman, this time impregnating her. \\nAmina was so terrified that Zaid would keep his promise to murder her that she refused to go to the authorities even after she had an abortion. The abuse finally came to an end when police discovered what Zaid had done, prompting the court to sentence him to a paltry 3 years in prison. However, it’s what the court is allowing him to do after 2 rapes, repeated physical assault, kidnapping, and torture that has even some on the left disgusted. \\nFria Tider reports that although Zaid was given 3 years in prison, the liberal judge denied the prosecutor’s request for deportation. Not only will Zaid be out in no time and allowed to remain in Sweden on benefits, the court is considering letting him bring his wife and 2 children to Sweden to live with him on welfare as well. \\nAs Zaid serves his meager sentence, the Swedish Migration Board is already looking over his family members’ asylum applications. The board is now considering allowing them residence permits, meaning that they will likely be provided a taxpayer-funded home while their patron is still in jail. Of course, Zaid will be out in no time to live comfortably with his family, never having to lift a finger for his welfare. \\nZaid has shown no remorse for either raping or beating his victim. In fact, he told police that he shouldn’t be punished for the sexual assault because “we just played â\\x80\\x94 we played a love game.” \\nZaid and his victim had met in an asylum center before he began stalking the woman. Ultimately, Amina sustained punches and kicks to the body and face each time before Zaid raped her. Although he was only sentenced for two rapes, investigators believe he subjected Amina to many other sexual assaults. \\n“She screamed and screamed but no one came to her rescue. There are neighbors to her apartment. No one has come and responded,” reads the judgment. \\nSadly, this type of leniency is far too common when it comes to migrant criminals in Sweden. On October 19, Mad World News reported that the Swedish Court of Appeals not only freed 3 migrant gang rapists from a 4-year prison sentence but also granted one of them $15,827. \\nThe appeals court ruled that the district court sentence was illegitimate because the evidence didn’t prove “who did what.” The appeals court concluded that since the third rapist had not acted as aggressively as his accomplices, he should be compensated for wrongful conviction. Of course, the other 2 are also expected to receive financial compensation. \\nEarlier this month, a Swedish court freed 5 migrant rapists , concluding that there was no “probable cause” that they had forced a wheelchair-bound woman to have sex with them against her will. The court deemed that the gang rape could not be legally considered rape because the migrants had not issued “violence or threats.” \\nLikewise, an 18-year-old Muslim asylum seeker was freed after the court found him guilty of raping a 12-year-old Swedish girl . The judge argued that because the rapist had “some trouble with anxiety and sleep problems,” he should be given just 180 hours of community service instead of jail time. \\nLike the rest of Europe, Sweden is sacrificing its own civilians and culture to the most savage foreign nations, all in the name of multiculturalism.'"}, "time": 1742628458.868244}