{"duration": 0.22035503387451172, "input_args": {"text": "'The Lesser of Two Evils(image by Mark John Maguire) License DMCA \\nIt has become common in recent days, in which the 2 leading candidates for the US Presidential election have achieved unfavourable poll ratings, to regard voting for either candidate as a vote for the \"Lesser of Two Evils\" (LEV). Tempting though it may be to vote for a candidate simply in the hope of excluding another, this is a questionable ethical policy with potential risks for democracy. The \"Lesser of 2 Evils\" principle (LEV) has a long history of application in US Foreign Policy in promoting intervention in wars to exclude a \"worse evil\". So ingrained has this aspect of Realpolitik become in the US political psyche that it has become axiomatic of US public polity in the conduct of government. It has recently been promoted as such by Noam Chomsky who, in an uncharacteristically weak argument, has exhorted the left in the US to vote for Hillary Clinton. \\nBut Chomsky is wrong as is the political philosophy underpinning LEV which prevails as a result of its widespread acceptance in the US political Establishment and his argument exhibits many of the blind assumptions made concerning LEV. The principal area in which LEV is cited is in US Foreign Policy and a casual glance at its operation here gives a sense of the problems with it as an ethical system: Vietnam, , Afghanistan, Iraq and Libya have all been subjected to horrific bombing, invasion and military degradation by successive US governments on the basis that to do so represented the LEV. There are few today even in the US who, with the benefit of hindsight, would concur that in its application in the US Foreign Policy sphere LEV can be supported as a sound ethical principle. There are indeed, many outside of the US who would regard its support of LEV to be an evil in itself. Clearly, there are other motivations for US invasions other than LEV considerations - not least geopolitical motives - but the adherence to LEV has enabled successive US govts to conduct a programme of widespread military aggression which it would otherwise have had few means of justifying. It has come to be the primary means of justifying a brutality that is rampant in the US and which successive Presidents have subscribed to wholeheartedly with disastrous consequences for the world. \\nCertainly LEV is a persuasive argument to governments facing complex issues and situations both domestically and abroad, but it is fraught with difficulties. A clear example of a sound application of LEV could be considered to be with the institution of the police force: police forces restrain liberty for the benefit of all because without them there would be a degree of lawlessness not compatible with the functioning of civilised society: it may thus be said that police forces are the LEV: a loss of liberty (evil) is incurred to avoid lawlessness (greater evil). But that brings us to the crux of the matter: LEV seems to have a reasonable application where there are 2 options and not more. If we apply it to situations were there are more than 2 options then we run into difficulty. In the case of policing it is apparent that there is no third way - or at least no-one has yet found one. LEV can therefore be safely applied in this instance. Again, in the situation where a knife-wielding madman approaching a group of school children can be disabled by running him down in a vehicle, we see an appropriate application of LEV because there seems to be no third way - and thus a great evil may be avoided by opting for a lesser evil. Were it possible to prevent the knifeman by, say, shutting the school gates, then this would remove the act of running him down from the LEV principle, because there would be 3 possibilities. If a policeman with a taser device was observed approaching then we would be in possession of a number of options: we would then have a complex moral decision to which LEV would be an unhelpful and possibly harmful remedy. That is because we would be seeking to apply a simple response to a complex problem which would potentially be detrimental and may result in a poor moral choice being made. Scaling up to the case where a conflict between the US and another country arises, there are myriad options available and by virtue of this LEV is not a good moral principle to apply. The situation in any of the recent examples of countries attacked by the US in the past 50 years has never been an either/or situation. Indeed, such situations have been subject to widespread arguments and protests concerning other options. The fact that LEV has been used to justify war, bombing, intervention etc is a testament to its misapplication rather than its wrongness as a principle per se, but given the complexity of international relations it is probably safe to regard LEV as unlikely to be applicable to most issues. \\nThere are also severe problems with LEV in its application in the public sphere aside from these practical considerations: \\n1. By suggesting that evil can be right when it is the \"lesser evil\" it unwittingly endorses the principle of \"the end justifies the means\". This principle, which has been central to Western ethical thinking for at least 2000 years, is deeply flawed and it has - unsurprisingly - been used by many dictators as a means to justify an act, however bad, provided the ultimate outcome is good. For whom that outcome may be judged to be good, in what circumstances, by what measure and in what timescale are some of the many just criticisms of this notion of \"consequentialism\". It seems wrong intuitively for finite humans to accept such an indeterminate version of \"consequentialism\" in ethical decision making. There must be an applicability of timescale for consequences; there needs also to be a measure of the act in its intention as well as its consequence if we are to have a well balanced and sound ethical principle. By placing the matter of the ethical value of an act on the consequences alone, the intentions are effectively removed and an act is judged entirely on its outcome - it is not hard to imagine malign circumstances which have worked out well by chance. For example, if we judged a bank robbery which had gone awry by the inadvertent consequence of uncovering a stash of terrorist weapons in the bank vault, we may be pleased to have discovered the plot, but we would hardly be likely to applaud the robbers. It does seem that the consequence must, at the very least, be intended and it seems reasonable to argue that the end of a moral act cannot be the sole measure of its value - of course there is also a practical difficulty in that by the time the outcome of many acts can be weighed against the acts themselves, it is no longer of much practical use to do so! In such cases we must rely heavily on intention . \\n2. LEV involves another major problem: if both options consist of evil consequences it could only be justifiable to select one on the basis that there was no other choice . If there were other choices available then it may be argued that the LEAST evil choice was the ethical option, although the introduction of a third element would cause exponential difficulties because it would introduce other considerations such as expediency, practicality and judgements concerning relative likelihood of successful outcome. Where LEV is applied to multiple choice complex situations involving moral decisions, it is therefore a crass and inappropriate response to a situation, since it simplifies and deliberately excludes other possible solutions. - Advertisement - \\n3. LEV also requires heavy qualification because it is frequently used as an excuse to justify doing evil, rather than considering other options - thus in this sense it is an unethical principle when inappropriately applied. LEV must be applied to dire exigencies by its very nature for if the exigency were not urgent then action would hardly be necessary. We should also be careful to ensure that situations are properly identified as LEV situations. If we take the situation where I am in a lifeboat and there is room for only one other passenger apart from myself and there is an old man in the water and a child - which of these should I save? The other must drown. Certainly there are 2 evils present and prima facie we have a LEV situation, but on closer examination we see that there are undoubtedly other options available - I may give up my own place to them both and accept my own drowning, or I may try to accommodate both even though we may all drown and accept the increased risk of this etc. There are a number of judgements here which must be made and which affect the decision - judgements based on assumptions of what will happen; that one is more worthy of saving than the other and so forth: it is thus a complex moral decision which will require a difficult choice but is deserving of a complex consideration for that reason. Given that such decisions would be unusual in the extreme and that we would be required to act quickly rather than to sit in the boat considering the matter while both drowned, it is unlikely that the impact on the world would be great! Certainly it does not assume the great impact that LEV takes on in its application in the Public sphere where large numbers of people are affected. \\nThis brings us to the use of LEV in democratic elections and it proves to be as dubious in its application here as it is in its use in Foreign affairs. Representative democracy is dependent on the notion of freedom of choice so that the best candidate may be elected. Anything which inhibits this undermines that principle. LEV, by its very nature, does so: rather than promoting contest between the best in the freest manner possible, it promotes the least bad option from a narrow choice, constraining and distorting the freedom of choice of the voter. That is a denial of democratic principle; if it is applied when there are other choices available, that distortion becomes even greater so that we may justly inquire whether the limited form of democracy we possess in its representative form is worthy of the name democracy at all. We should also consider that democratic elections require myriad assumptions and judgements to be made and are not therefore susceptible (nor should they be) to evil and \"less evil\" considerations. Furthermore, b ecause ethical values are by no means clear in themselves or invested simply in one candidate or another, then such judgements made are themselves complex and deserving of such treatment. \\nNoam Chomsky, with John Halle, has argued that LEV should be used in the 2016 US Presidential election and his argument is worthy of examination: Chomsky provides some general caveats by way of providing a soft-landing for his assumption of LEV and these are deeply flawed. First, to the argument that Clinton\\'s Foreign Policy may be worse than Trump\\'s, he advances the claim that \"following the logic through seems to require a vote for Trump\"! That is an astonishing non-sequitur! It makes no such requirment and can be used simply as a means of eviscerating the claims that Clinton IS the LEV in this respect, without leading to an endorsement of Trump in the wider aspect. It may equally contribute to a decision to abstain from voting or to vote for a 3rd party. \\nSecond, he refers to \"The politics of moral witness\" (the argument that LEV remains evil and should not be engaged) which he counters by stating that the point of voting for LEV is to do \"Less\" evil which is an \"obvious rejoinder\". Perhaps it may seem so, but it is a \"circulus in demonstrandum\" type of fallacy to make such a criticism! It only seems right to someone who is already signed up to the notion of LEV - but to others it is simply evincing a premise as a proof of that which it seeks to confirm! \\nThirdly, Chomsky goes on to state \"The basic moral principle at stake is simple: not only must we take responsibility for our actions, but the consequences of our actions for others are a more important consideration than feeling good about ourselves\". The first proposition is good - the second half has strayed from its purpose somewhat: it appears in part to try to lessen the effect of personal responsibility by stating that consequences should be regarded as more important than intentions. That is a dangerous argument. Even at a common sense level intention is given great value in human relations - often to the detriment of consequences: and this is right, because as we have seen, consequences by their nature are often unpredictable and involve many assumptions, prejudices and involve many matters not always relevant to the decision itself. \"I will bomb Iraq because it will lead to a safer world and rid us and its people of an evil regime\" (I purposely introduce a contentious and familiar issue here) plays out like this: my intention is good, but I have introduced some assumptions which involve great leaps of faith and logic: ie, the consequence of bombing (bad) in producing a safe world (good) justifies my action. We can see very easily where such an argument goes awry in its practical and recent application in human history. It is not safe or justifiable to take arguments beyond their remit. Viewed by intention alone the decision may be seen as good or bad depending on one\\'s point of view; by the consequences alone (deaths of many innocent people, destruction of a nation and its infrastructure) it is clearly an evil: does this imply that had the outcome of the war been good the war would have been a good one? It seems that the intention must play heavily on the judgement and a proper balance must be observed between intention and consequence in judging the action, especially as we could not possibly know the outcome. Of course we are setting aside the notion that Iraq was not a true LEV situation since there were actions which could be taken which were considerably less evil, but the example serves to demonstrate that intention and consequence cannot easily be separated in weighing the ethical value of an action. Therefore it seems fair to alter Chomsky\\'s proposition to \"We must take responsibility for our actions which should have intrinsic good as their basis and CONSIDER the consequences as a corollary to this\". That is as far as an ethical argument can take us. - Advertisement - \\nA final criticism of LEV, says Chomsky, is equating it with \"passive acquiescence to the bipartisan status quo\" and he attacks this by stating that LEV can be defended by the fact that \"poorly considered electoral decisions impose a cost\" and then goes on to give some subjective examples of Nixon\\'s continuation of the Vietnam war. But this is unjustifiable by the same measures we have considered in applying assumptions and prejudices to previous arguments, for it can quite as easily be argued that an alternative to Nixon MIGHT have produced a different adminsitration; indeed, that it MIGHT have produced an alternative ending to the Vietnam war - but it might not: recent US history is not over-filled with instances in which different electoral results produced different policies! In the case of Vietnam it can be argued that the war was a war of the US Establishment - and surely no-one prosecuted that war with greater vigour and determination than democrat President LBJ? The difficulty with such examples is that we move into the realms of pure speculation in guessing what the alternative might have been. We could equally claim that the 1968 outcome may have averted nuclear war due to the initiation of the SALT negotiations by Nixon - but we should not do so, because to bring such unknowns which are dependent on so many different variables into the equation, takes us into the arena of pure political speculation and little else. \\nCritique of Chomsky\\'s 8-point argument: \\n1) \"Voting should not be directed as a form of personal self-expression or moral judgement directed in retaliation towards major party candidates who fail to reflect our values, or of a corrupt system designed to limit choices to those acceptable to corporate elites.\" \\nThe immediate response to this is to ask: \"Is not it a matter for my personal integrity to choose my reason for voting?\" Surely my reasons for voting (or not doing so) should be determined by my view of the system, the candidates and other matters and it should not be dictated to me that I must vote, in any circumstances, whosoever the candidates may be?\" There may be very good reasons why a voter may wish to vote for a candidate including those of moral, social or personal affinity and such reasons should be respected as legitimate - even though I may have my own personal view of why and how people should vote. It seems perfectly reasonable to vote as a means of self-expression, moral judgement or even of disapprobation towards one or more candidates and certainly as part of the calculation in making a judgement as to who to vote for. Chomsky\\'s personal injunction here is no more than an expression of his personal preference and has no validity beyond that, evinces no proof in support of its validity and is of questionable morality.'"}, "time": 1742628508.9095163}