{"duration": 0.07993078231811523, "input_args": {"text": "'At the Golden Globes afterparties, hoi polloi who aren’t invited to the ceremony descend by the thousands on the Beverly Hilton to whoop it up and stalk celebrities. Hosts of this year’s Hilton parties  —   held in ballrooms and massive tents around its compound  —   included HBO, the Weinstein Company, Fox, NBCUniversal, Netflix, Amazon, Warner Bros. and InStyle. The biggest stars often skipped those parties altogether, and instead beelined to the exclusive talent agency fests, held at the Sunset Tower Hotel and the Chateau Marmont. Confined to the Hilton, the Bagger joined the star stalkers herself, seeking answers to the burning question: What did celebrities think of Meryl Streep’s speech? (For a general idea, click here). The Bagger first cornered the preternaturally glamorous Joan Collins, as the British actress was carefully ascending a small flight of stairs at the Fox party. “I think she is one of the greatest actresses of a generation,” Ms. Collins said of Ms. Streep. “She has the right to say whatever she wants. And I think if you look at people’s faces in the audience, people went along with her. ” At the HBO party, Eddie Redmayne said he found Ms. Streep’s speech “incredibly emotional,” but was so distracted by her presence in the audience while presenting the award for best musical or comedy that he almost forgot to read the nominees. He wouldn’t say whether he thought Hollywood should take a page from Ms. Streep and speak out politically. The Bagger nabbed Bryan Cranston at the HBO party, too. Mr. Cranston, who has spoofed a Donald J. Trump presidency on “Saturday Night Live,” got a little misty just speaking about Ms. Streep’s words. “She was able to deliver an important message that resonated with all of us, with grace and dignity and no vitriol or hyperbole,” he said, “It was just beautifully delivered, to convey the anxiety that we are feeling, and the concern. ” Vince Vaughn, who has supported Republican presidential candidates in the past, was chatting a few feet away, so the Bagger asked him, too. Did he think Ms. Streep’s speech was an example of how Hollywood should respond to the politics of our time? “I think people should say what they want to say, and what she said was beautiful,” Mr. Vaughn said. The Bagger’s eyes then fell on John Corbett, a. k. a. Aidan from “Sex and the City. ” Was Hollywood the platform to address politics? “A whole lot of ‘Apprentice’ watchers just elected the president of the United States,” Mr. Corbett said, breaking into a dazzler of a grin, “so I guess it is!” The night ended on a high note, with Kerry Washington, who was at the party with her husband, Nnamdi Asomugha, agreeing to weigh in. (“One question!” her manager told the Bagger.) Ms. Washington said she found Ms. Streep’s speech beautiful too, adding that in a democracy, there’s never a time when citizens, whatever their stripe, shouldn’t speak out. “I don’t think that people of Hollywood should be silenced because of what we do for a living,” Ms. Washington said. “I don’t think it’s important that she said what she said because she’s an actress. I think it’s important she said what she said because she’s a citizen. We all have a First Amendment right of free speech. ”'"}, "time": 1742563756.8962026}