{"duration": 0.10388064384460449, "input_args": {"text": "\"Gültan KisanakGültan KisanakAprès l’arrestation mardi soir de Gültan Kisanak et de Firat Anli, les deux co-maires de la grande ville kurde de Diyarbakir, les représentants du HDP en Europe appellent les parlements et les institutions internationales à exprimer leur opposition aux pratiques illégales du gouvernement turc.Selon les informations recueillies par les représentants du parti kurde HDP ( Parti Démocratique des Peuples ), Firat Anli, l’un des deux maires de Diyarbakir a été interpellé à son domicile, tandis que sa collègue Gültan Kisanak, était arrêtée à l’aéroport de Diyarbakir à sa descente de l’avion qui la ramenait d’Ankara. Les domiciles des deux maires ont été fouillés, ainsi que les bâtiments du conseil minicipal.Gültan Kisanak a été en 2014 la première femme élue maire de Diyarbakir, la grande ville du sud-est de la Turquie, considérée comme la « capitale » de la région kurde. Officiellement, c’est elle qui est maire de la ville, mais la tradition kurde veut qu’il y ait toujours un homme et une femme à la tête d’une commune, pour respecter la parité.Ancienne journaliste, Gültan Lisanak est une figure très connue du mouvement pour les droits démocratiques en Turquie. Co-présidente de l’ancien parti BDP ( qui deviendra par la suite le HDP ), elle est aujourd’hui la présidente de tous les maires des villes du Sud-Est de la Turquie, qu’elle représente auprès dans les discussions auprès des instances officielles.Gültan Lisanak avait déjà été arrêtée lors du coup d’état militaire de 1980, et torturée pour avoir refusé de renoncer à son identité kurde.« Chaque jour était un combat pour survivre », a-t-elle expliqué au site de presse Al Monitor, pour décrire ses conditions de survie dans l’ancienne prison de Diyarbakir, qu’elle décrit comme un « enfer » où « les abus avaient pris des proportions barbares. »Gültan Kisanak a déjà passé en tout quatre années et demi de sa vie en prison.En l’interpellant hier, c’est donc à une figure politique majeure de la Turquie et du peuple kurde que s’en prend le gouvernement d’Erdogan. Son collègue, Firat Anli,est avocat, c’est un militant connu des Droits de l’Homme.Le HDP parle d’une volonté d’Erdogan et de son parti l’AKP, « d’anéantir la volonté politique du peuple kurde et de l’opposition démocratique dans le pays. » Au cours d’une conférence de presse qui a suivi l’arrestation des deux co-maires de Diyarbakir, le procureur a accusé, sans présenter de preuve, les deux élus de collaborer avec les combattants kurdes du PKK, accusation rituellement avancée dès qu’il s’agit d’arrêter ou de destituer des élus kurdes.26 élus locaux kurdes ont déjà été démis de leurs fonctions par les autorités turques depuis le mois de juillet.Pour le HDP, la détention des deux co-maires de Diyarbakir est « contraire aux droits de l'homme, » et « contredit de nombreuses conventions internationales dont la Turquie est signataire. »Le parti kurde appelle toutes les organisations non gouvernementales, les partis politiques, les « forces de démocratie et de paix », les institutions internationales et parlements « à ne pas rester silencieux face à cette illégalité, et à exprimer leurs réactions par la voie démocratique. »Passée en 20 ans de 250 000 à un million 600 000 habitants, la ville de Diyarbakir est une ville emblématique de l’Anatolie du sud-est. Elle a été marquée l’hiver dernier par des affrontements violents entre des jeunes habitants de la ville, soumis à un régime de couvre-feu et de contrôles permanents, et les forces spéciales de l’armée turque, qui avaient déployé des très importants moyens militaires ( véhicules blindés, barrages, militaires lourdement armés.. ) Le quartier historique de Sur, a été le lieu des affrontements les plus violents avec les forces spéciales turques.\""}, "time": 1742563439.1576452}