{"duration": 0.07897734642028809, "input_args": {"text": "'Share This Abdul Barati, a 43-yera-old Afghan migrant, was arrested after investigators noticed something sinister about his house fire. \\nWhen neighbors awoke to strange noises and the smell of smoke coming from a Muslim family’s house, they quickly rushed over to see what was happening. However, as soon as they looked in the window, they immediately notified the authorities of the unspeakable horror they witnessed. \\nNo matter what heinous crimes Muslims commit, there is always a leftist more concerned with preserving the already unsalvageable reputation of the religion that demands their submission. So, when a Muslim man carried out his gruesome plans in the middle of a suburban neighborhood in Australia, his neighbors were “shocked” to find that an adherent of the world’s most deadly religion could be so barbaric. \\nThe Daily Telegraph reports that Sydney residents awoke at 3:35 a.m. on October 18 to blood-curdling screams and thick smoke filling the air. They rushed outside to find Abdul Barati, a 43-year-old Afghan migrant, using water from a tap in a half-hearted attempt to extinguish a massive blaze tearing through his home. Instantly, their eyes were drawn to the bedroom window where his wife, 30-year-old Adelah, was banging on the pane and screaming in agony as she slowly burned to death. \\nDesperately scrambling to save her life, neighbors told Abdul that they were going to try to help get his wife out of the house. Almost nonchalantly, he told them everything was “fine” and that he didn’t need their assistance except to call the fire department. It was not long after horrified residents were forced to watch the last few seconds of Abelah’s life that they realized this was all part of Abdul’s plan. \\nAfter the fire department quenched the flames, Abdul was arrested and charged with murder. Investigators quickly discovered that the migrant had locked his young wife in their bedroom, removed their 6-year-old and 9-year-old sons, and set the property on fire, the Daily Mail reports. Abdul then pretended to fight the blaze as petrified onlookers watched his poor wife burn to death. Even more appalling is that the two children were also on the front lawn watching their mother engulfed in flames. Neighbors and the Baratis’ two young sons, aged 6 and 9, helplessly watched Adelah burn to death through the bedroom window. \\n“There’s a lady screaming, but when my husband arrived to wake her up the screaming stopped already,” Manni Chen told Channel 9, according to News.com.au . “My husband tried to help the man, he said ‘do you need help?’ he said ‘no, no, no, just call the fire station’ and then my husband said ‘let the two kids get out’ and the man said ‘no we are fine.’ The man tried to use a water tap to get the fire down, but he just told my husband call the fire station.” \\nWe expect liberal apologists to come out in full force, either excusing this behavior as the fault of “mental illness” or blatantly denying its ties to Islam. Of course, if this had happened in a Sharia country instead of Australia, things would play out much differently. \\nEarlier this month, a Pakistani Muslim father pardoned himself for the murder of his daughter after the Sharia court found him guilty of honor killing the young woman. In accordance with the country’s Islamic law, Faqeer Muhammad was granted acquittal after shooting and killing Kiran Bibi and Ghulam Abbas for their unapproved relationship, according to the Daily Pakistan . \\nAccording to the Sharia legislature, a murderer can be completely pardoned of his crime if the family of the victim forgives and excuses them. In many cases such as this, the family members are able to pardon themselves for killing their dishonorable kin. \\n“The deceased, Kiran Bibi, was my real daughter. She was a spinster at the time of her murder. There are no other legal heirs of the deceased except her mother, Bushra Bibi, and me,” Muhammad told the court. “I have forgiven the accused persons in the name of Almighty Allah, and have no objection to their acquittal. I also waive my right of Qisas (retribution) and Diyat (blood money).” \\nAlthough legislation passed in 2015 outlaws the pardoning of murderers in honor killings, Islamic law reigns supreme in Pakistan, still allowing many Muslim killers to walk scot-free. \\nFurther proving the violent nature of Islam, fathers who murder their own children without a good Islamic reason are given more brutal sentences. At the same time as Muhammad was pardoning himself, Khalid Mehmood was sentenced to death for killing his 12-year-old daughter for not being able to make perfect bread. If only Mehmood would’ve told the court that he murdered the child for cursing Allah, he could’ve pardoned himself as well. \\nGood Muslims cannot coexist anywhere in the world because as long as they are trying to follow their religion, they must call for the destruction of all other laws, religions, and cultures until their ideology reigns supreme. It’s nothing short of incredible that so many Westerners still find it shocking when they do just what the Quran commands.'"}, "time": 1742628454.3047478}