{"duration": 0.09935474395751953, "input_args": {"text": "'WASHINGTON, DC  —   Some of the Democratic Party’s biggest names convened on Tuesday at the Four Seasons Hotel in Georgetown to speak at the Center for American Progress’s (CAP) 2017 Ideas Conference, where they called for even greater resistance against President Donald Trump and his White House. [House Minority Speaker Nancy Pelosi, Sen. Elizabeth Warren ( ) Sen. Kamala Harris ( ) DNC Deputy Chairman Keith Ellison, and Gold Star father Khizr Khan were among major Democrat players present who devoted their time on stage to attacking President Trump and showing no signs or efforts to work with the other side.  The event evoked a stirring response from the Republican National Committee. RNC spokesman Michael Ahrens responded to the Democratic lawmakers’ rhetoric and said they were out of touch with millions of everyday Americans who are tired of seeing and hearing divisive politics. “As they plot their strategy of resistance, Democrats continue to ostracize the millions of Americans who want their representatives to work together, not sit around and come up with ways to say no,” Ahrens said. “Their allegiance to CAP’s extreme,   policies shows how out of touch Democrats are with   Americans all across the country. ” “It is time to resist. It is time to fight back,” Sen. Warren said from her pulpit at the Four Seasons, where she called for greater campaign finance reform. Rep. Maxine Waters ( ) called, once again, for Trump to be impeached. “Maxine Water was right. You’ve got to impeach him. ” Booker, who is seen as a rising star in the Democratic Party, gave a rousing and passionate speech about the struggle Americans in disadvantaged parts of the nation face. He delivered the conference’s closing remarks. However, he also made a push for bigger government and welfare, citing people in his own community in New Jersey who live at or beneath the poverty line and who rely on handouts to afford their next meal. Of the Democrats who spoke, Booker seemed to be the most willing to work with Republicans. He asked the Democrats to focus their attention on their constituents and back away from their incessant attacks on President Trump. “I want to dedicate myself, but we cannot just be a party of resistance. We’ve go to be a party that’s reaffirming the American Dream,” Booker said. “We can’t just be a party that’s focused on the person in the White House. We’ve got to be focused on those folks in inner cities, in factory towns, in the grassroots of our country. ” Khizr Khan told the crowd that had gathered, “My offer to Donald Trump to read the Constitution remains standing,” referring back to the time he held up a   version of the Constitution at the DNC in July 2016. “One more time he has proven that he is unfamiliar with the basic tenants of our democracy,” he claimed. After apologizing in advance for possibly raising his voice, Khan said, “Maybe this voice will reach 1600 Pennsylvania even now. ” He added, “l am from Charlottesville, Virginia. Charlottesville, Virginia, was declared several months ago by my courageous mayor, Mike Signer, to be the capital of resistance of the United States. ” DNC Vice Chair Keith Ellison said, “If there is one blood bath that we have been suffering in elections, it is secretaries of state. ” Ellison then questionably suggested, “Democratic secretaries of state don’t actually try to favor a party. They just try to make sure there’s a fair election. Republican secretaries of state   …     they absolutely tilt the tables in terms of their side. ” Meanwhile, outside of Tuesday’s conference, the divided Democratic Party splintered further as rhetoric from within its own ranks exposed how truly out of touch its leaders are. Chicago Mayor Rahm Emanuel slammed the Democrats in a Politico article, saying they come off as a “party disdainful of [the middle class].   …     We don’t talk about and fight for the middle class like we are. We believe we’re for them, but they don’t —  if they don’t hear we’re for them, then we got a problem,” Emanuel reportedly said. He added that the Democrats are so   on the narrative surrounding President Donald Trump that they are blinded to what’s actually going on inside their own party. “Talking to ourselves and persuading ourselves,” Emanuel said, “is not going to be the way you get to a majority. ” Democrats lashed out at Sen. Bernie Sanders ( ) saying he “made a mockery” of the unity process and blamed him for dividing the party more than before. “The fact that Tom Perez has given Sanders a platform without Sanders genuinely agreeing to work toward ‘unity’ has made a mockery of the whole process and literally divided the party more than it was before the tour began,” Markos Moulitsas, the founder of the liberal Daily Kos site, told Politico. “It has been a disaster. ” He added, “Yes, Perez and company are clearly afraid of Sanders and his followers, but letting Sanders make a mockery of the party doesn’t exactly help it build in the long haul. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742562018.7430418}