{"duration": 0.015742778778076172, "input_args": {"text": "'By April Hamlin Election 2016 , Miscellaneous , News , Politics , Videos November 4, 2016 Obama Had The Best Reaction To A Protester Ever, So Trump Lies And Says He Did The Exact Opposite   \\nPresident Obama was interrupted by a protester while he was speaking at a campaign rally for Hillary Clinton. Suffice it to say, Obama had the best reaction to a protester ever. Hands down. So, of course, Trump had to start lying about what happened. \\nSpeaking to a crowd in Hershey, PA, Trump said that the president had done quite literally the exact opposite of what he actually did . \\n“You saw it today on television, right? He was talking to the protester, screaming at him, really screaming at him. By the way, if I spoke the way Obama spoke to that protester, they would say, “He became unhinged! He became –“You have to go back and look and study. And see what happened. They never moved the camera. And he spent so much time screaming at this protester and frankly, it was a disgrace.” \\nOkay, so let’s “go back and look” at just how President Obama handled the situation today. When the protester interrupted him, the crowd was not having it. He struggled to quiet them as they chanted “Hillary,” and when he succeeded, he began by reminding them of all the reasons they should treat this man with respect. Obama defended the protester’s First Amendment rights and then told those in attendance that this is what he means when he says they aren’t “focused.” He concluded with his now trademark phrase, “Don’t boo, VOTE!” \\nWatch President Obama show how to handle a protester with class, here: Obama just lost control of the crowd in North Carolina which was shouting down a Trump supporter; Obama defended the guy’s right to protest pic.twitter.com/bTjHPvadcj \\n— Bradd Jaffy (@BraddJaffy) November 4, 2016 \\nFeatured image via Chip Somodevilla/Getty Images and Joe Raedle/Getty Images Share this Article!'"}, "time": 1742628510.0947363}