{"duration": 0.10012412071228027, "input_args": {"text": "'It was bad enough late last month when the Education Department, in a legal filing, informed the nation’s public servants that they shouldn’t trust its administrator’s word about whether their student loans qualify for its debt forgiveness program. But the panic among borrowers that the newfound uncertainty unleashed helps illuminate an additional problem with the public service loan forgiveness program: Many people who believe that they qualify  —   and entered graduate school, borrowed piles of money and chose employers accordingly  —   may not realize that they are not making qualifying payments or that certain loans are not eligible for forgiveness. The program, which began in 2007, was enacted with what was supposed to be a   proposition: People who worked for 10 years in public service jobs and made regular payments would have the remainder of their federal student loans forgiven. A wide variety of jobs were supposed to qualify, from nonprofit work to teaching in a public school or practicing medicine at a public hospital. But now, 10 years later, the legal filing has sown all manner of confusion  —   which itself comes in the wake of a disheartening amount of misdirection given to borrowers. The Consumer Financial Protection Bureau receives plenty of complaints about loan servicers offering incorrect information. And   employers may also pass along bad advice. “This is one of the most complex programs ever concocted by Congress,” said Rohit Chopra, a former Education Department employee who also served as the student loan ombudsman for the Consumer Financial Protection Bureau. “So many people who are counting on getting some help are going to be flatly rejected on a technicality. ” People who are in the loan forgiveness program, who think they are or who are contemplating trying to enter it ought to use this scare as an opportunity to step back and   their assumptions. At least four basic things need to happen for someone to get in the program and stay in: He or she must make payments in the right way, have the right kind of employer, be in the right loan category and have the right kind of payment plan. What follows is a mere summary, and the pitfalls, tripwires and exceptions are legion. Mandatory additional reading includes the Education Department’s fact sheet, its list of 56 questions and answers, and the Consumer Financial Protection Bureau’s tool kits for employers and employees. Let’s take those four requirements in order: THE RIGHT WAY TO PAY For starters, you need to make 120 payments in order to qualify. They need to be made on time and in full, and you must be working full time. The count can get complicated for people in school, or just getting out, or in financial trouble, as well as for those with qualifying undergraduate loans who go back to school. Question 21 on the department’s list addresses some of these issues. THE RIGHT KIND OF EMPLOYER This is what the lawsuit is about. All of the Education Department’s guidance on the topic suggests that people who work for the government or for a nonprofit with 501( c) 3 status should be eligible for forgiveness. Anyone who wants to be certain that an employer qualifies can (and should) file an employment certification form with a loan servicer. Do it every year, and every time you change jobs or servicers. Also check to make sure your payments are going correctly toward that goal of 120. The lawsuit involved some employers with more esoteric nonprofit statuses, and the Education Department’s filing in response declared that approval of an employment certification form “does not reflect agency action on the borrower’s qualifications” for the public service loan forgiveness program. Additionally, the brief said that borrowers should not expect a truly final decision until after their 120 payments were made. Cross your fingers, everybody! And cue the justifiable panic. Dr. Jordan   33, an emergency room physician at a nonprofit hospital in New York City, fired off a letter to the Education Department demanding final word now about the fate of his more than $300, 000 in student loans. While he had previously received letters saying that his employer qualified, he was primed to be wary. At one point, his human resources person mistakenly told him that his hospital might not qualify. “I was going to throw up,” he said. Jessica Schreiber, 28, the founder and sole paid employee of a nonprofit, has her own concerns. She left New York City’s Sanitation Department last year to start Fabscrap, which helps local businesses recycle their fabric. Before starting graduate school, she plotted her loans, payments and career choices according to the rules of the loan forgiveness program. So when she heard the news about the lawsuit, she posted the following on Facebook: “THIS IS TERRIFYING. ” She has asked for her servicer’s blessing on the eligibility of her nonprofit, and has not heard back yet. Since the legal filing, the Education Department has told reporters that it cannot comment on pending litigation. I didn’t ask about that. Instead, I simply asked if its servicer’s letters about whether an employer was eligible were something that borrowers should believe. Its three spokesmen did not answer by my deadline for this article. Let’s call the Education Department’s refusal to clarify the matter exactly what it is: meanness. If the department has made mistakes with the litigants and misclassified their employers, it can fix them quickly and settle the suit without freaking out untold numbers of other borrowers. THE RIGHT KIND OF LOAN The Education Department’s instructions, via another information page on its website, are pretty clear: You need to have what the agency refers to as a “direct” loan. As the site explains, if the word “direct” isn’t in the title of your loan, it probably doesn’t qualify. If you aren’t sure what kinds of loans you have or whether your statement from your servicer describes them correctly, you can log into the department’s website and look them up. If you’re making payments on, say, a Federal Family Education Loan (F. F. E. L.) or a Perkins loan, those are not counted toward your 120 payments, even if you work for a qualifying employer (though the Perkins loan has its own cancellation program). You can fix this by consolidating your loans into a direct consolidation loan. Be careful, though: If you consolidate direct loans with nonqualifying loans, any   payments you made on that old direct loan won’t count anymore. The count to 120 resets. When Dr. Darius Amjadi, a    pathologist and Iraq war veteran in Portland, Ore. began his work with a veterans’ hospital, he thought he had a shot at loan forgiveness from the Veterans Affairs Department’s own program. At the same time, his employer informed him that his loans would be eligible for public service loan forgiveness. But the department’s forgiveness has not come through. And it turns out he had not been in the right kind of federal loan to qualify for forgiveness under the public service program, despite what his employer said. “If anyone had said, ‘Check your loans,’ it would have put me on notice,” Dr. Amjadi said. Now, he’s got a balance of $40, 000 and has missed out on years of eligibility for forgiveness. THE RIGHT KIND OF PAYMENTS This is the category that so worries Mr. Chopra, the former Education Department and Consumer Financial Protection Bureau student loan expert, who is now a senior fellow at the Consumer Federation of America. For starters, he points out that if you are not in some kind of   repayment program (check the Education Department’s website for the names of all of the different ones) you’re not going to benefit from forgiveness and there’s a good chance that your payments don’t qualify. A standard repayment term for student loans is 10 years, or 120 payments. Those payments may be technically eligible if you have the right employer, but if you’re making them in full (and not on an   plan) you’ll have paid off the loan in 10 years and there won’t be any loan left to forgive. Mr. Chopra worries about people working for eligible employers and making payments in something called graduated or extended repayment plans that are not income driven. If you think that sounds like you, call your servicer and ask, then ask again at a different time to be sure. He points to data in an Education Department presentation from late last year that is available online showing that about half of the people enrolled in public service loan forgiveness have not made a single payment that qualifies toward their goal of 120. He suspects that many just don’t realize they’re in the wrong kinds of payment plans. My inquiries to the Education Department about this matter yielded no replies. To review, we’ve promised to help our public servants by forgiving their student loan payments after a decade. But the program is confusing, the government’s legal filings contradict its websites, and its representatives aren’t answering questions. This is no way to treat the people who do some of the most important work in our country. But it’s also yet another reminder that as we build more complexity into our financial systems, we’re sending the message to those who must navigate them that they are on their own. It’s a shameful message at any time, but it’s particularly galling when it’s firefighters, librarians and nurses on the receiving end.'"}, "time": 1742628323.2567477}