{"duration": 0.11172866821289062, "input_args": {"text": "'By Tom Leonard with pictures, captions, and comments by Lasha Darkmoon \\nHillary Clin\\xadton faced an up\\xadset in her run for the White House two days ago af\\xadter the FBI an\\xadnounced a fresh probe into her emails. In\\xadves\\xadti\\xadga\\xadtors will examine new mes\\xadsages to see whether she sent clas\\xadsi\\xadfied in\\xadfor\\xadma\\xadtion on a private server. Just ten days be\\xadfore Amer\\xadi\\xadcans go to the polls, the Demo\\xadcrat candidate’s bid to be\\xadcome the first woman US pres\\xadi\\xaddent may be de\\xadrailed if it is de\\xadcided she should face crim\\xadi\\xadnal charges. ‘I AM INNOCENT!’ Recent Polls sug\\xadgest Mrs Clinton will trounce Repub\\xadli\\xadcan ri\\xadval Don\\xadald Trump, who has been strug\\xadgling to fight al\\xadle\\xadga\\xadtions about grop\\xading women. But Mrs Clin\\xadton will now be forced on the de\\xadfen\\xadsive her\\xadself in the fi\\xadnal days of their vi\\xadcious elec\\xadtion bat\\xadtle. LD : The latest news is that Hillary’s 12-point lead has been “ wiped out ” within the last 24 hours, with Hillary now just one point ahead of Trump. This could of course change at any moment, with rapid fluctuations, depending on the volatility of the situation. FBI di\\xadrec\\xadtor James Comey had rec\\xadom\\xadmended ear\\xadlier this year that the Department of Jus\\xadtice not press charges over emails sent by Mrs Clin\\xadton when she was sec\\xadre\\xadtary of state un\\xadder Barack Obama. But he said ‘re\\xadcent de\\xadvel\\xadop\\xadments’ had prompted him to take an\\xadother look. The agency has ob\\xadtained new emails from an un\\xadre\\xadlated case that ‘ap\\xadpear per\\xadti\\xadnent’ to the in\\xadves\\xadti\\xadga\\xadtion, said Mr Comey. A ju\\xadbi\\xadlant Mr Trump hailed the dra\\xadmatic de\\xadvel\\xadop\\xadment of a re-opened investigation as ‘big\\xadger than Water\\xadgate’, a ref\\xader\\xadence to the cor\\xadrup\\xadtion scan\\xaddal that brought down Richard Nixon. ‘Bigger than Watergate’ The con\\xadtro\\xadversy has weighed heav\\xadily on the cam\\xadpaign, chal\\xadleng\\xading Mrs Clinton’s key con\\xadtention that – un\\xadlike her opponent – she would be a safe pair of hands in the White House. Mr Comey an\\xadnounced in July that the FBI’s 12-month investigation into Mrs Clinton’s con\\xadtro\\xadver\\xadsial email traf\\xadfic while secretary of state was over. She was crit\\xadi\\xadcised for us\\xading a pri\\xadvate email server rather than the of\\xadfi\\xadcial system to trans\\xadmit clas\\xadsi\\xadfied in\\xadfor\\xadma\\xadtion, but escaped prose\\xadcu\\xadtion. In a harshly-worded crit\\xadi\\xadcism of her ‘ex\\xadtreme care\\xadless\\xadness’ and ‘gross negligence’, Mr Comey said it was pos\\xadsi\\xadble that hos\\xadtile for\\xadeign govern\\xadments had gained ac\\xadcess to her poorly-pro\\xadtected ac\\xadcount. He also flatly con\\xadtra\\xaddicted var\\xadi\\xadous Clinton claims al\\xadthough – in ex\\xadplain\\xading why he had not rec\\xadom\\xadmended pros\\xade\\xadcut\\xading her – he ac\\xadcepted there was no evidence she had in\\xadten\\xadtion\\xadally jeop\\xadar\\xaddised state se\\xadcrets. The scan\\xaddal has been bran\\xaddished by Repub\\xadli\\xadcans as ev\\xadi\\xaddence of Mrs Clin\\xadton’s dis\\xadhon\\xadesty and in\\xadcom\\xadpe\\xadtence. Mr Comey informed Congress by let\\xadter that his agency had ob\\xadtained new emails. They will be re\\xadviewed to see if they are sig\\xadnif\\xadi\\xadcant and if new ac\\xadtion against Mrs Clin\\xadton is re\\xadquired. Mr Comey did not give a time\\xadframe for how long this in\\xadves\\xadti\\xadga\\xadtion will take. The orig\\xadi\\xadnal FBI probe found that of 30,000 emails Mrs Clin\\xadton handed over to the State Depart\\xadment, 110 con\\xadtained in\\xadfor\\xadma\\xadtion that was clas\\xadsi\\xadfied at the time she sent or re\\xadceived them. How\\xadever, an\\xadother 33,000 emails went miss\\xading. They were pre\\xadsumed to have been per\\xadma\\xadnently deleted but newly re\\xadleased FBI notes sug\\xadgested they still ex\\xadist in sev\\xaderal locations and could be re\\xadcov\\xadered. It is un\\xadclear whether any of these are in\\xadvolved in the new FBI in\\xadquiry. Law en\\xadforce\\xadment of\\xadfi\\xadcials said the newly dis\\xadcov\\xadered emails were taken from the elec\\xadtronic de\\xadvices of se\\xadnior Clin\\xadton aide Huma Abe\\xaddin and her dis\\xadgraced hus\\xadband An\\xadthony Weiner dur\\xading an in\\xadves\\xadti\\xadga\\xadtion in the lat\\xadter’s ‘sex\\xadting’ of girls. ANTHONY WEINER AND HUMA ABEDIN \\nNote by LD : Huma Abedin is an American Muslim of Indo-Pakistani descent. Weiner is a disgraced Jewish politician who has been involved in a series of sex scandals. When Huma found out about her husband’s sleazy sexual activities, she was forced to divorce him. This was in August 2016. The unlikely couple had been married for just over six years. \\nAs for Huma, her relationship with Hillary Clinton has been an extraordinarily close one for almost 20 years, so much so that there have been sensational rumors of a lesbian liaison . The view for popular consumption is that Hillary is Huma’s “mentor” and “mother figure”. Hillary once compared Huma to her own daughter Chelsea. “I have one daughter,” she said. “But if I had a second daughter, it would be Huma.” Huma’s real mother, noting that Hillary had now replaced her in her daughter’s affections, once told Hillary jokingly, “I’m jealous of you!” (See here ) \\nJohn Lennon’s widow, Yoko Ono ( pictured ), claims to have had a lesbian affair with Hillary in the 1970s. “We met many times,” Yoko boasts, “and became very intimate !” (LD) \\nTOM LEONARD continues : \\nWeiner, a for\\xadmer Demo\\xadcrat con\\xadgress\\xadman for New York, be\\xadcame em\\xadbroiled in a se\\xadries of scan\\xaddals over ex\\xadchang\\xading sex\\xadu\\xadally ex\\xadplicit text mes\\xadsages with a string of women. \\nHe sep\\xada\\xadrated from Miss Abe\\xaddin, vice chair\\xadman of the Clin\\xadton cam\\xadpaign, in Au\\xadgust. \\nIt is un\\xadder\\xadstood the FBI is in\\xadves\\xadti\\xadgat\\xading Weiner af\\xadter it was re\\xadvealed that he had been sex\\xadting a high school stu\\xaddent who was 15 at the time. Mr Trump re\\xadacted with de\\xadlight to Mrs Clin\\xadton’s 11th-hour elec\\xadtion night\\xadmare. \\nAd\\xaddress\\xading a ju\\xadbi\\xadlant crowd in New Hamp\\xadshire, Trump said: \\n‘ Hil\\xadlary Clin\\xadton’s cor\\xadrup\\xadtion is on a scale we’ve never seen be\\xadfore. We must not let her take her crim\\xadi\\xadnal scheme into the Oval Of\\xadfice.’ Mr Trump had pre\\xadvi\\xadously crit\\xadi\\xadcised the FBI and Depart\\xadment of Jus\\xadtice for not bring\\xading charges against his elec\\xadtion opponent. His run\\xadning mate, Mike Pence, called on the FBI to im\\xadme\\xaddi\\xadately re\\xadlease all the emails per\\xadti\\xadnent to the investigation, adding: ‘The Amer\\xadi\\xadcan peo\\xadple have a right to know.’ The Repub\\xadli\\xadcan vice pres\\xadi\\xadden\\xadtial can\\xaddi\\xaddate told a rally in Penn\\xadsyl\\xadva\\xadnia, that he and Don\\xadald Trump ‘com\\xadmend the FBI for hav\\xading the courage to re\\xadopen the case’. Chants of ‘Lock her up!’ came even be\\xadfore Mr Pence ref\\xader\\xadenced the FBI investigation. Mrs Clin\\xadton ig\\xadnored shouted ques\\xadtions from re\\xadporters about the new FBI investigation as she walked off her plane in Cedar Rapids, Iowa. House Speaker Paul Ryan, the most se\\xadnior Repub\\xadli\\xadcan in Congress, said she had be\\xadtrayed Amer\\xadi\\xadcans’ trust for han\\xaddling ‘the na\\xadtion’s most im\\xadpor\\xadtant secrets. HOT NEWS! (just sent in by our Far Eastern correspondent ‘FM’) LATEST! . . . 4-minute VIDEO'"}, "time": 1742563540.767188}