{"duration": 0.05014944076538086, "input_args": {"text": "'Trinh Thi Ngo, a   radio announcer known as Hanoi Hannah who entertained American forces during the Vietnam War while trying to persuade them that the conflict was immoral, died on Friday in Ho Chi Minh City. She was believed to be 85. Nguyen Ngoc Thuy, a former colleague of Mrs. Ngo’s at Voice of Vietnam, the state broadcaster where she worked for decades, confirmed her death in a telephone interview on Tuesday and said she had been treated for liver ailments. Mrs. Ngo, who broadcast in English, was a propaganda weapon for North Vietnam as it battled the United States and the South Vietnamese government. Her work was in the tradition of Tokyo Rose and Axis Sally, whose radio broadcasts were intended to damage the morale of American troops during World War II. Mr. Thuy said that Mrs. Ngo was both a national celebrity and a role model to her younger colleagues, including himself. “We admired her perfect voice and her legendary role” in the war effort, he said in the interview. Mrs. Ngo was born in Hanoi, the capital, in 1931, when Vietnam was a French colony. (Her exact birth date could not be learned, nor was there information on survivors.) She learned English from private tutors in the early 1950s  —   partly, she later recalled, because she loved watching Hollywood films like “Gone With the Wind. ” “I always preferred American movies to French films,” she said in an interview with The New York Times in 1994. “The French talked too much. There was more action in American movies. ’’ Mrs. Ngo began broadcasting for Voice of Vietnam in 1955, a year after Vietnamese revolutionaries defeated France at the Battle of Dien Bien Phu, forcing the French from Indochina. Early in her career she used the name Thu Huong, or Autumn Fragrance, because it was easier for her   listeners to pronounce, she told The Times. “Fewer syllables,” she said. Her broadcasts aimed at United States forces began in 1965, and she was still on the air in 1975, when North Vietnam captured Saigon, the South Vietnamese capital, and renamed it Ho Chi Minh City. As part of her programs, each 30 minutes long, Mrs. Ngo would announce the names of American soldiers who had died in battle the previous month. Her listeners included the Navy pilot John McCain, the future United States senator, who was a prisoner of war in Hanoi for five and a half years after his plane was shot down in October 1967. On a visit to Hanoi in April 2000, Senator McCain said he had listened to Mrs. Ngo’s broadcasts on loudspeakers that hung from the ceiling in a cellblock illuminated by a single bulb. “I heard her every day,” he said. “She’s a marvelous entertainer. I’m surprised she didn’t get to Hollywood. ” Mrs. Ngo’s broadcasts included music by Pete Seeger, Joan Baez and other antiwar American folk singers, and she took a friendly approach to her listeners, Mr. Thuy said. But beneath her gentle tone, he added, was a steely confidence in the North Vietnamese cause. Nguyen Van Vinh, a Vietnamese cameraman who filmed Mrs. Ngo’s meeting the actress and antiwar activist Jane Fonda in Hanoi in 1972, said Mrs. Ngo had “talked in a whisper to the G. I. s. ” “Soldiers used a gun, but in Hanoi, in North Vietnam, she used her voice,” he said. Mrs. Ngo acknowledged as much in the 1994 interview with The Times. “My work was to make the G. I. s understand that it was not right for them to take part in this war,” she said. “I talk to them about the traditions of the Vietnamese, to resist aggression. I want them to know the truth about this war and to do a little bit to demoralize them so that they will refuse to fight. ” She said the Americans had called her Hanoi Hannah for a simple reason: alliteration. “The Americans like nicknames,” she added.'"}, "time": 1742628360.9942522}