{"duration": 0.05695676803588867, "input_args": {"text": "'TEL AVIV  —     Donald Trump confirmed that his Jewish    Jared Kushner will work to “broker a Middle East peace deal. ”  [In an interview with The Times of London, Trump said that as part of his role as senior adviser, Kushner would be appointed to handle negotiations between Israel and the Palestinians.  Trump also told the German daily Bild that Kushner has “an innate ability to make deals. ” “Jared is such a good lad, he will secure an Israel deal which no one else has managed to get. You know, he’s a natural talent, he is the top, he is a natural talent,” he added, according to a translation from the Guardian. In the past, Trump has hinted that tapping Kushner for the role was a natural choice, saying his    “knows the region, knows the people, knows the players. ” Kushner was the chief speech writer for Trump’s address to Israel lobby AIPAC, and had a hand in Trump’s foreign policy throughout his campaign. Israeli ministers have hailed the prospect of Kushner as peace broker. “We would be so happy if someone could bring peace to the Middle East. We welcome him,” Deputy Foreign Minister Tzipi Hotovely said last month. Israel’s Defense Minister Avigdor Liberman echoed Hotevely, saying, “What we know, he’s a really tough, smart guy, and we hope he will bring new energy to our region. ” Kushner and his wife, Trump’s daughter Ivanka, are Orthodox Jews. Speaking to Bild, Trump slammed the Obama administration’s decision to forego the U. S. veto on an   UN Security Council resolution as “terrible. ” He added that he hoped Britain would use its veto against any additional resolution in the next few days, saying he wasn’t sure the U. S. would play ball despite Secretary of State John Kerry’s assurances to Prime Minister Benjamin Netanyahu during Sunday’s peace summit in Paris that the Obama administration would prevent further action at the UN. “I’m not sure if the U. S. would do so  —   extraordinarily enough. They won’t do it, right? Do you believe the U. S. will place a veto?” he said, according to the Guardian’s translation. “I have Jewish friends who organized a donor event for Obama. I say to them: ‘What on earth are you doing? Okay  —   what are you doing? ’” he added.'"}, "time": 1742561808.743745}