{"duration": 0.40726161003112793, "input_args": {"text": "\"#DONBASS Editor's choice 25.11.2016 - 374 views 5 ( 2 votes) MH17 Ukraine Plane Crash: Additional Details Revealed (+Exclusive Photos from the Scene) 5 out of 5 based on 2 ratings. 2 user reviews. MH17 Ukraine Plane Crash: Additional Details Revealed (+Exclusive Photos from the Scene) Donate \\nSouthFront received this text in Russian via email. It reveals additional details about the MH17 shot down in Ukraine in 2014. SouthFront Team decided to translate it into English and publish at our website so that our readers acquire a more complete picture of events that took place on the ground directly after the incident. Photos below have never been pulished online until now. \\nThe text below is recorded by Aleksandr Netyosov . He’s a member of the Union of Journalists of Russia, chief department editor of the Military Herald of the South of Russia newspaper, author of dozens of military history publications, and a native of Donetsk. \\nThe events from more than two years ago, concerning the MH17 Boeing 77 that crashed on the territory of former Ukraine (currently the Donetsk People’s Republic) are now part of history. An investigation team from the Netherlands working on this case which has promised to publish the results of its investigation in October in the end made general statements in which, contrary to facts, the law enforcement from the “land of tulips” placed the responsibility for this crime on the Donbass militia and Russia. The author of this essay personally learned that the accusation is baseless when he spent a vacation in his home region, in the capital of the coal country, and now the capital of the DPR, the lovely city of Donetsk. \\nMy schoolmates who now occupy high DPR posts and who know about my journalism career, arranged for me to meet interesting people who, by dint of their service at the time, were the first to arrive at the Boeing crash and to carry out an inspection of the crash site which is necessary in such cases. I spent several days with Donetsk law enforcement who fulfilled their duties to the last, in spite of the fact that Ukraine all but abandoned its responsibilities and tried to use a variety of administrative and psychological measures to first delay the investigation and then to stop it altogether. This is a very telling indication of who was the beneficiary of all the noise concerning the “Russian trail” in the MH17 tragedy that unfolded on July 17, 2014 in the skies above the villages of Grabovo and Rassypnoye, in the Shakhtyorsk district of the Donetsk Region of Ukraine. \\nThe internal political situation at the time appeared confused and even odd. The civil war on the Donbass was escalating, the first blood was already spilled, but in Donetsk Ukraine’s law enforcement on the Donbass were still peacefully coexisting with the DPR which was making its baby steps. Until a bolt from the blue, in a very literal sense, which divided the professional lives of fellow servicemen from local law enforcement into a “before” and “after”. Unfortunately, the work of Donetsk investigators who spent two days on the Boeing 777 crash site were not used by anybody. Which means this is the first attempt to bring their words and deeds to the attention of broad range of readers in order to cast light on events that took place more than two years ago. \\nPlease get acquainted: Senior Justice Councillor Aleksandr Vasilyevich Gavrilyako, DPR Prosecutor General Office’s department head, a high-grade professional with 32.5 years of flawless service under his belt, against whom the post-Maidan leaders of “sovereign Ukraine” launched a criminal charges for maintaining his professional integrity in a new political reality. During that time, Colonel of the Police Gavrilyakko was the head of the investigative department of the Makeevka Regional Office of Internal Affairs, and was considered one of the top investigative department heads in the entire Ukraine MVD. Here’s what he said: \\n– I learned of the Malaysian Boeing crash from TV news. I caught myself thinking that it might be good to inspect the site. When I was about to leave for duty, I got a phone call. It was from Aleksandr Vasilyevich Mostovoy, DPR’s Internal Security Service head, who suggested that I take a group of investigators to conduct a site inspection. I asked him: why was I chosen? To which he responded that I was recommended as the best specialist. So I had to reply that as an active-duty Ukraine MVD officer, I can’t make that decision on my own, I need sanction from higher authorities. \\n– Upon arriving at work, I received a directive from the director of the Main Directorate of Internal Affairs of the Donetsk Region MVD, Major General Pozhidayev, to assemble an investigative team and take it to the crash site. This directive was confirmed by Col. Goncharov, the head of the Investigative Directorate of the Donetsk Region Internal Affairs Directorate, whom I called shortly after receiving the directive to remind him that the site is outside of my official jurisdiction. “The locals will help you”, he encouraged. And I was permitted to assemble a team of whoever I chose, which included two people from each of the five Makeevka regional departments. Which made a total of 10, plus me and two investigators from Makeevka City Internal Affairs Directorate. I asked my higher-ups for expert support and received it. \\nOur group worked with four experts, including Bogdan Olegovich Maklakov and the head of the Donetsk Regional Medical Forensics Bureau, Dmitriy Anatolyevich Kalashnikov. \\nOn the morning of July 18, we were met by DPR Prosecutor General office representatives with two cars to take us to the site. Although at that time Ukraine prosecutor’s office still function and DPR MVD entities were not yet formed. While in transit, I got a call from Col. Goncharov who wanted to learn where we were? “Where are you?” he asked insistently. I, naturally, told him about the route we were taking, together with DPR colleagues, toward Rassypnoye and Grabovo to the crash site, where Ukraine’s Emercom was already beginning to function. Goncharov then categorically ordered me to return, citing orders he received from Ukraine MVD not to inspect the crash site. Naturally, I refused, since I was in a vehicle that belonged to DPR colleagues. They even made a bit of fun at me, proposing I jump off from a moving vehicle. \\nI have to add that at that time there was an ongoing cadre reshuffle, with the regional MVD leadership in toto moving to Mariupol, with their direct subordinates, the law enforcement officers in Donetsk and Makeevka, continued to work as before. There was no sense of division into us and them, though there was some alienation in interpersonal relations. Upon arriving at the site, we were greeted by Emercom and local self-government who already had a basic idea of what happened. It turned out that the main wreckage mass, including the tail section, engines, wings, and most of the corpses were on the outskirts of Grabovo. They were scattered all over the field. \\nBut we, upon the request of local authorities, started with inspecting Rassypnoye and its surroundings where, according to the reports from inhabitants, there were corpses in the back yards and even on the streets. The cabin with remains of the crew was also found there. Therefore we quickly started to investigate in the village, and the surrounding fields only later. Even as we were resolving all manner of questions, including organizational ones, it was almost evening. Therefore I decided that, given the huge volume of work, to inspect corpses, of which there were 36 in the village, note where they were found, and enter them into protocol. I was taking into consideration the heat, the pouring rains, and the livestock, all of which were threatening to nullify our efforts. Moreover, I earlier discussed with Col. Goncharov and Col. Miroshnichenko, the head of Makeevka UVD, who ordered me to go to the crash site, various technical aspects of working on the site. \\nIn particular, this concerned obtaining a truck with a crane, a refrigerator for corpses, and a hangar to store aircraft remains so that they could be subsequently laid out. Particularly since we already knew what caused the crash, which meant a more thorough inspection of crash site in order to locate killing elements which could be inside the bodies of the passengers, the fuselage skin, or the topsoil, and to find traces of the explosives. In order to identify the munition which brought down the Boeing. \\nWe already had the sad experience of similar type of work, when we investigated crash sites of several airliners in the Donetsk Region though, to be sure, we experienced no outside interference in those cases. The most recent such crash took place in 2006, when a Tu-154 with 176 passengers flying from Anapa to St. Petersburg went down. Therefore the initial crash site inspection is crucial to any such investigation, because it contains all the clues to reconstructing the tragedy. \\nThe regional center assigned us a facility on the territory of a vehicle park in their jurisdiction, complete with vehicles and a crane. So we began inspecting the site. What we saw shocked us. In one house, a female corpse broke through the roof and was stuck in the ceiling tiles, though one leg broke off and landed directly on a bed. On another property, six sets of passenger remains landed on garden vegetables. The shattered pilot cabin crashed just outside the village. The remains of the crew were scattered nearby, and we recognized them by the remnants of their uniforms. Having placed our investigators throughout the site, I called Col. Goncharov. He did not even want to listen to me, demanding that I explain why I disobeyed his order to turn around and not to investigate the site. In response, I said literally the following: first of all, the group was traveling on a vehicle belonging to DPR Prosecutor’s Office, secondly, how could I have done that in the presence of armed people, and moreover the inspection had already begun. \\nThen he demanded that I sabotage the investigation in any way possible and create delays. Naturally, I asked him why the confusion. One minute I’m ordered to go, and now I’m to return. So he explained that orders came from Kiev not to inspect anything, because the SBU will look into it. But he did allow me to carry away the 36 corpses found in Rassypnoye. \\nNaturally, we haven’t seen any SBU people, ever, because they left Donetsk already in May. We, of course, packed up the found and labeled human remains and sent them to the morgue at the Kalinin regional clinic. At the last minute, we were brought the corpse of a child found somewhere in Grabovo. We sent it to the morgue with the others. Our activities were curtailed by that very same Goncharov who first approved of us visiting the site, and then categorically forbade to inspect it. Then everything became clear to me. If Ukraine were interested in investigating this case in which, according to the official Kiev version, both local militia and Russia were implicated, nobody would have held us up. Rather to the contrary, they’d be asking us to leave no stone unturned to find every last piece of evidence, monitoring my every move confident in my thoroughness and professional ability. We arrived at the local Emercom HQ, located in Grabovo, close to the evening. Naturally, I told DPR Prosecutor’s Office about orders from higher up, but I responded in the affirmative to their question whether I’d continue, believing that the innocent victims of this tragedy ought to be collected and inspected, otherwise who would do it otherwise. After that, we departed. On Saturday morning of July 19, we returned to the site as if nothing had happened yesterday. While traveling, I once again got a call from Goncharov who wanted to know where I was, and then we engaged in verbal sparring. I told him point blank: fields are littered with corpses of innocent people, we can’t just leave them, which we’d do had we obeyed Kiev’s orders. “In that case, Aleksandr Vasilyevich, you have made your choice,” he replied and ended the conversation. I never heard his voice again. \\nOur first find that day was part of fuselage skin, in which some penetrating objects left punctures, with edges bent inward. This suggested the penetrations were made from the outside. Upon our arrival in Rassypnoye, we continued inspecting the site, though we were immediately warned not to wander into the woodline unless necessary. Because of tripwire mines placed there by both warring parties. At that time, volunteers from among the miners came up to help, so that we could cover as much of the site as possible. It was then that 20 corpses were found in a wheatfield on the edge of Grabovo. But, as a rule, the corpses were scattered: one here, another or a few somewhere else. \\nIt was then that members of the OSCE mission, accompanied by Berkut troops and the deputy director of Donetsk Region MVD, Colonel Aleksey Aleksandrovich Dikiy, arrived. \\nI turned to Dikiy for help, because I did not have enough people to do everything necessary: inspecting, extracting, packaging and, most importantly, recording all these actions in the protocol. He connected me to Gen. Pozhidayev, who initially was surprised by my presence there contrary to orders. He silently listened to my arguments about Christian and human duties, but was curious to know where we were sending the bodies, and directed to send them to Kharkov instead of Donetsk. But he did not explain how to do that, given the ongoing fighting, particularly since cannon fire was drawing closer. After he learned of DPR officials’ presence, he hung up. But in any event a group of investigators from Shakhtyorsk, 4 total, came to help me. \\nIn a command tent I was shown an announcement on some Ukrainian site which stated that local Emercom workers and the Donetsk investigative group went over to the separatists, helping them hide the corpses. Nevertheless, all the remains found on July 19 were properly inspected, in accordance with all the relevant procedures, and sent to Kharkov. Subsequently we suspended our work on the insistence of our security force, because gunfire was clearly approaching our location. After that we went home, but ended up in Rassypnoye. In order to question the witnesses of Boeing’s crash among the local inhabitants who were quite happy to see us. \\nBut it is the actions of the Ukrainian side that give reasons to wonder. First they approved the inspection, then forbade it. If the militias were involved in that, the situation would have looked very different. It’s no coincidence that two days later all law enforcement officials received orders, of which I did not know, to take back roads to Slavyansk. The majority obeyed, but some, mainly those born on the Donbass, stayed. \\nThe conclusion practically asks to be drawn, in accordance with the ancient “cui bono?” maxim. If one looks at who the beneficiary was, then it makes no sense for Russia to have instigated the shoot-down. Given the international situation, it drew no benefit from it. Rather to the contrary, the Russian side was the most interested one in a transparent investigation. But it was labeled the guilty party already on the next day by the Western media. There is likewise little to point at the militia. There are all kinds of people among them, certainly. But downing a Boeing—pardon me, that’s a whole different ball game. Because they would have been labeled terrorists on the international level. Shooting down a plane flying at an altitude of 10km is beyond their ability even now, let alone two years ago when some of them were carrying hunting shotguns. Promoting hysteria aimed at Russia was very telling in itself. As usual, the guilty party usually yells “stop thief!” the loudest. But the whole story was very convenient for Ukraine and its sponsors. The Americans have long mastered similar provocations. Black rectangles were added to hide the graphic content \\nI can’t even call the Dutch specialists, who picked up where we left off, proper investigators. To be honest, they picked all manner of rejects for this important task. It may be they were in law enforcement of some sort. But they are no specialists. I came to that conclusion for one simple reason. After their departure from the crash site, they left behind a lot that would have drawn attention of professional investigators. In such cases, not only the wreckage and corpses are transported away, but also a layer of topsoil underneath. The Dutch did not hing of the kind, having collected only big pieces and leaving the rest behind. They did not even ask anyone for help, considering the large territory on which the wreckage was scattered. Therefore the site inspection was done in an unprofessional manner by the Dutch. After their visit, the locals kept finding pieces from the plane.” \\nThe next direct participant of the investigation is the director of the DPR Medical Forensics Bureau, Dmitriy Anatolyevich Kalashnikov. At the time, he led the same bureau, though at the time it was the Donetsk Regional Bureau. Some 27 departments scattered all over the region answered to him. Now there are only 13 left in DPR, the rest are on the territory controlled by Ukraine. Here’s what he said: \\n“I received the news of the crash on the evening of the same day from a worker at a local office, who lived in Rassypnoye. She saw everything with her own eyes. It’s then that I started to get ready to go to the site. I had some experience with such work, when a Tu-154 crashed in our region in 2006. Moreover, I had to deal with the victims of major accidents in coal mines. At times, there were 30-40, or even 80 corpses to examine. \\nWe worked around the clock, without breaks, due to the ongoing fighting. It took about a day and a half before a decision was made and coordinated with other agencies. The weather at that time was very humid: heat interspersed with showers, which also played its role. On the site, I worked jointly with criminal investigators. I didn’t think it necessary to bring along my subordinates, who were busy themselves, therefore I went alone. I expressed my view at the Emercom field HQ on how I viewed my responsibilities. In order to thoroughly record all the finds, I proposed to divide the area of the crash into squares. For example, one spot with burn spots had dimensions of 200 by 200 meters. Quite a large area. \\nAnother such spot was near Rassypnoye, where the crew cabin was. We decided to go there first, record the location of everything, and start describing the corpses. Because the corpses were scattered among the village houses. These are old buildings, and human remains falling from great height literally broke through roofs. I numbered every square and labeled all the pieces of evidence, corpses, fragments, personal effects, naturally with coordinates. Human remains were described in a most detailed fashion, including such details as tattoos, jewelry, and other important visible characteristics. \\nMost of the corpses were found naked. It later led to the speculation that the Boeing was loaded with dead corpses. In actuality, the corpses fell from great height, and the air resistance stripped clothing off them, except for tight articles. For example, shorts, underwear, and watches. That’s why we found them that way. Practically without any visible injuries—few external injuries and heavy internal ones. It was a sign that the fall came from a great height, when the plane broke apart. I won’t affirm whether the plane was downed by an external or internal action, but everything suggests it broke up in midair. If one examines, by comparison, the crash of the Russian airliner, it fell like a leaf following engine failure. Which is why its crash site could fit in a single photo. The Tupolev’s remains were all togehter and the corpses of 176 passengers were inside the cabin. But here everything was scattered over a big territory, which immediately prompted me to say the explosion took place at great height. During the inspection, as I went from one spot to another, I was told the crew remains were discovered. They were near Rassypnoye, together with pilot cabin wreckage which confirmed by theory it was an explosion (internal or external) at great height while the plane was over this village, causing the separation of pilots’ cabin from the rest of the plane. That’s why I believe the blow happened near the cabin, which led to the further disintegration of the plane whose fragments were so widely scattered. At first I was surprised by the sheer amount of seemingly unrelated personal belongings from passenger baggage. And also by one corpse that clearly was not a member of the crew. But everything became clear after I studied the Boeing 777 design on the internet, and realized that the baggage compartment begins right under the pilots’ cabin. \\nCharacteristically, one of the pilots was tightly buckled into his seat. Which means he was not running around the cabin at the time of the explosion but was behind the controls. Several other crew bodies were next to him. We identified them by the remains of the uniforms still on their bodies. We discovered 37 corpses in Rassypnoye, all of which were sent to the Donetsk morgue. Out of that total, we inspected 27 sets of remains, before receiving an order to send all remains to the Kharkov morgue in a specially assigned refrigerator. I was leaving body inspection for later. Now I regret doing that. Because we would have definitely found pieces of shrapnel and all manner of other things that could have shed light on this tragedy. But who would have believed us then, or now for that matter. They would have said we planted the evidence. \\nIncidentally, nobody has said anything about evaluation of human remains in Netherlands. Apparently they have something to hide . But I can show photographs which clearly show penetrating punctures in the corpse of the crew member who was strapped into his seat. His uniform shirt looks like a sieve. Two months later we were visited by an international commission, 6 people total, interested in that question, which contained Dutch and Canadian specialists, and I don’t know who else. We provided them with all the collected materials and photographs. We don’t understand why they are keeping quiet about it. Perhaps they contain evidence that’s inconvenient for the West. Even though we did not dissect the corpses for ethical reasons (most of the passengers were Muslim) as well as political ones (because they were foreigners), instead we performed an external inspection to ascertain external injuries. We had no right to act as we pleased. We were waiting. For someone from a diplomatic post, but nobody ever showed up. \\nDutch specialists appeared only a week after the crash, when all the corpses were in Kharkov. Morgues in Europe, including Netherlands, are much better equipped than ours. With the aid of x-ray machines, they could have easily discovered the multiple fractures or the metallic shrapnel inside human remains or inside airliner parts. But since the Dutch have so far not shown anything of the sort to the rest of the world, it seems that they have something to hide. Moreover, we took samples from all the corpses for future DNA analysis. The Dutch categorically refused to take them along, and I barely managed to force them to take them. I also insisted on a formal transfer of the remains. They did not want to sign any official papers.” \\nThe general picture of the July 17, 2014 tragedy is completed by the words of the members of the investigative team headed by Col. Gavrilyako. They are now law enforcement officials at DPR. They are Evgeniy Anatolyevich Bazilskiy, Andrey Yuryevich Mozgunov, and Aleksandr Aleksandrovich Murvyov, currently still serving with Col. Gavrilyako, and Bogdan Olegovich Maklakov, currently the deputy director of the Criminology Scientific Research Center at the Main Directorate of Internal Affairs of Donetsk Region. \\nThey said they divided themselves into pairs and began to inspect the site with the help of the locals. They were following the routine procedure of entering everything into a protocol, including the human remains and aircraft fragments. It was a sad sight, many corpses looked terrible, but they were “fresh.” They began to smell the next day. On the first day, the Makeevka investigators were exclusively describing the found corpses. Punctures were found in the wing found at a farm near Grabovo, which looked like entry holes from shrapnel. Returning from a second working day, the investigators talked to the eyewitnesses in Rassypnoye. Here’s what they said into the protocol. First of all, they heard multiple aircraft. In one of the houses, its owners, husband and wife, said that they saw a Ukrainian fighter fall down, nose up, behind a forest on Ukraine-controlled territory. They even watched two pilots descend by parachute. \\nSimilar testimony was given by another inhabitant of Rassypnoye, a former soldier, who was even offended when he was being checked using leading questions. He even observed the explosion at the fighter’s crash site. Though he couldn’t confirm it, because the whole woodline was full of tripwire mines. But here’s the most important thing: several witnesses heard the sound coming from another plane which circled for some time above the crash site of its colleague, then flew toward Debaltsevo. It couldn’t be seen due to the low clouds. But it could be heard. This testimony was, naturally, entered into the protocol. And they are kept in DPR Prosecutor’s Office archives. So the mystery of the Malaysian Boeing’s death on July 17, 2014, is still awaiting its day. Without any doubt, the facts discovered and recorded by the experts listed above, all of whom are acknowledged professionals, and whom Ukraine hastened to call traitors due to their honesty in discharging their professional duties, will play an important role. \\nMore photos from the scene:\""}, "time": 1742563322.734028}