{"duration": 0.11847853660583496, "input_args": {"text": "'As some Democrats push harder for the impeachment of President Trump, with some threatening to bring it to the House floor, Democratic leaders are pushing back  —   apparently concerned about the risk of overreaching. [Rep. Brad Sherman ( ) and other members of the Democratic caucus have been pushing for a vote on impeachment  —   the natural consequence of months of   claims about Trump’s actions in relation to alleged Russian interference in the election. Politico reported earlier this week that Sherman is prepared to buck his leadership in bringing a vote to the House floor.  Sherman claims that Trump’s alleged request for former FBI Director James Comey to drop the investigation into former National Security Adviser Michael Flynn amounts to an obstruction of justice and is, therefore, an impeachable offense. His motion would almost certainly be    in the House. But Sherman isn’t the only Democratic lawmaker to float impeachment. Fellow California Rep. Maxine Waters was seen chanting “Impeach 45” on Sunday. Earlier this month, Rep. Al Green ( ) also called for impeachment and wants there to be a vote in the House. “Obstruction of justice by the president is the problem,” Green said. “Impeachment by Congress is the solution. ” Yet, while impeachment is always a popular word among Democrats’   base whenever a Republican is in the White House, Democratic leaders are concerned about something Republicans are frequently accused of when the tables are turned  —   overreaching. According to the Hill, leaders are worried that an aggressive push for impeachment will further politicize the investigation and undercut both the probe and Democrats’ midterm election chances. Famously, Republicans were stung in the late nineties by accusations of overreach when they sought the impeachment of President Bill Clinton. Rep. Steny Hoyer ( ) the minority whip, said that talk of impeachment was “not timely,” according to the Hill. Meanwhile, Former Democratic National Committee Chair Donna Brazile was forced to deny Sunday that Democrats were overreaching. “First of all, I don’t think the Democrats are overreaching. I mean this is about the integrity of our democracy  —   democratic process. It’s about what happened in 2016,” she said on ABC’s This Week. Axios reported that Democratic leadership wants to be careful using the   as the “investigations haven’t revealed enough yet”  —   a possible sign that Democrats were disappointed with Comey’s testimony in front of the Senate Intelligence Committee last week and that it revealed no apparent obstruction of justice. Other Democrats believe that the way to political victory is by focusing on the issues likely to decide the midterm race and the issues they were beaten on in 2016  —   such as jobs and health care reform. “We need to be looking at the issues that matter to families at home, and that starts with jobs, health care, addressing the opioid crisis,” Rep. Katherine Clark ( ) said earlier this month. “We can file articles of impeachment, we very well may have a basis, but Republicans have shown they’re unwilling to criticize, to hold this president accountable,” Clark said, according to the Boston Globe. “Let’s mobilize, get to the streets, register voters, and change the majority in the House. ” Other lawmakers though, while cautious for now, are still licking their lips at the chance of impeachment  —   even egging Trump on to do something to trigger such a push. “You want a   car to impeachment? Fire Mueller,” Rep. Luis Gutiérrez ( ) according to the Hill. “I dare you to do it. ” Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742563655.2553585}