{"duration": 0.10445904731750488, "input_args": {"text": "'  Donald Trump’s latest shot across the bow of NATO hit close enough to leave some European leaders dripping with “astonishment and agitation,” as German Foreign Minister   Steinmeier put it. [“I said a long time ago that NATO had problems,” Trump said during the interview with the Times of London and Germany’s Bild. “Number one, it was obsolete, because it was designed many, many years ago. Number two, the countries weren’t paying what they’re supposed to pay. ”  Trump expanded on the latter point by explaining that “countries aren’t paying their fair share so we’re supposed to protect countries but a lot of these countries aren’t paying what they’re supposed to be paying, which I think is very unfair to the United States. ” Specifically, he said Britain was one of five countries “paying what they’re supposed to,” out of 22 members. Trump nonetheless stressed that NATO is “very important to me,” and that he feels “very strongly toward Europe,” comments that appear to have been omitted from or dismissed by many reports on the interview by American and European media outlets. Another part of Trump’s remarks quoted by very few outlets reporting the Times and Bild interview is his stern criticism of Russia’s intervention in Syria. Monday’s Twitter streams are filled with mockery of Trump as a Russian pawn or collaborator, because the Russians swiftly agreed with his description of NATO as “obsolete,” but he was quite tough on what they have been doing to Syria: Nah, I think it’s a very rough thing. It’s a very bad thing, we had a chance to do something when we had the line in the sand and it wasn’t  —   nothing happened. That was the only time  —   and now, it’s sort of very late. It’s too late. Now everything is over  —   at some point it will come to an end  —   but Aleppo was nasty. I mean when you see them shooting old ladies walking out of town  —   they can’t even walk and they’re shooting ’em  —   it almost looks like they’re shooting ’em for sport  —   ah no, that’s a terrible  —   that’s been a terrible situation. Aleppo has been such a terrible humanitarian situation. He followed this up by saying he trusts German Chancellor Angela Merkel as well as Russian President Vladimir Putin, “but let’s see how long that lasts, it may not last long at all. ” He was responding to a question about whether he understands the historical importance of NATO to Europeans, and their continuing apprehension about Russia, when he described the alliance as “obsolete. ” He was not saying there is no need for caution or defense against Russia he was saying NATO, as currently constructed and funded, is not the ideal tool for the job. CNN writes that Putin spokesman Dmitry Peskov “agreed with Trump’s assessment of NATO” by saying “the systematic goal of this organization is confrontation. ” That is not what Trump said, but apparently the media had decided any and all attacks on NATO, from everyone, constitute agreement with Trump. Various levels of pushback and panic fill the bulk of CNN’s article, including the   German Foreign Minister,   Steinmeier, portraying the alliance as “rattled” by Trump’s remarks, and relaying “concerns” from NATO Secretary General Jens Stoltenberg. “A strong NATO is good for the United States, just as it is for Europe,” declared NATO spokeswoman Oana Lungescu. CBS News cites French Foreign Minister   Ayrault calling for Europeans to “stay united, together as a bloc” in response to Trump’s remarks. AFP describes Chancellor Merkel’s response to Trump’s comments as “sharp,” but she merely said, “We Europeans have our fate in our own hands. ” “I am personally waiting for the inauguration of the U. S. president. Then of course we will work with him on all levels,” she added. If that is a “sharp” response, then Trump has already won his political struggle with Europe, and he is not even sworn in yet. Europe “taking its fate in its own hands” appears to be what Trump wants when he objects that the NATO burden on the United States is too high. Europe reeks of obsolescence right now, far beyond NATO headquarters. If the election of Donald Trump jolts Europe’s leaders into action, then American voters have done the people of Britain and the Continent a huge favor.'"}, "time": 1742563676.3716202}