{"duration": 0.09029531478881836, "input_args": {"text": "'by Yves Smith \\nBy Gaius Publius , a professional writer living on the West Coast of the United States and frequent contributor to DownWithTyranny, digby, Truthout, and Naked Capitalism. Follow him on Twitter @Gaius_Publius , Tumblr and Facebook . Originally published at at Down With Tyranny . GP article archive here . Originally published at DownWithTyranny A little confusing, but follow the gray lines. The above figure illustrates how the duration of the copyright that the Walt Disney company claims in Steamboat Willie — marked by the solid gray line — has twice approached expiration — by the dashed gray line. In both instances, federal lawmakers amended the Copyright Act to extend the duration, both of copyrighted works generally and works, such as Steamboat Willie , that predated the amendments ( source ; click to enlarge). In 2023, expect copyright protection in general to be extended again. This law is colloquially called “The Mouse Protection Act.” \\nNormally when we think of “free trade,” us lay people, we think of removing barriers to the exchange of goods and services. Removing barriers is the “free” part of “free trade.” Of course, there really is no such thing as a “no barriers” market, since even the simplest of markets always has rules, and those who write the rules are “picking winners and losers” by definition. \\nConsider, for example, a flea market held in the parking lot of a local fairground on a Saturday. To participate, you have to register for a space with the organizers (the parking lot isn’t infinitely long or wide), set up an approved tent or table, and usually, if your goods are sold by weight or volume, have your weights and measuring devices certified by the organizers as honest. \\nAll of the restrictions above place limits on the “market” — put it under control of the organizers — but consider for a minute just the last one, certified weights and measures. How is that not “picking winners and losers”? Winners — Vendors with honest scales. Losers — Vendors who cheat their customers. \\nOr consider a flea market without that requirement. Winners — Vendors who cheat their customers. Losers — Vendors with honest scales. \\nA lot has been written, in fact, about the non-existence, by definition , of anything resembling a “free market,” including much by the writer Masaccio (main site here ). \\nMonopolies and “Free Trade” \\nBut that point aside, let’s consider TPP from another standpoint. Monopolies are the enemies of so-called “free trade” since, by definition, they destroy competition and invert the usual assumptions about pricing power. In a well-supplied market, a market with much available product, pricing power is with the buyers, the customers, since it is they who, in the aggregate, set the limits of “what the market will bear.” \\nBut in a market in which the supply of something essential for life — water, food, life-saving medical supplies and care, even apartment housing in an old-style “company town” — is not “well-supplied,” but is instead controlled and constrained by a single supplier or a small cartel of non-competing suppliers, that’s just the opposite of a “free market.” It’s in fact the least free a market can get. \\nThus it is with TPP. Very little actual trade will be freed up if TPP is passed, since barriers to “trade” among the many of the potential signing nations are nearly non-existent. \\nOn the other hand, one of the most important outcomes of theTPP will be the destruction of a competitive market, the one for life-saving drugs and other “intellecual property.” For these products, the TPP raises barriers as surely as tariffs would do. \\nEconomist Dean Baker calls the TPP a “protectionist” agreement. Baker (my emphasis): \\nThe TPP And Free Trade: Time To Retake The English Language \\nThe proponents of the Trans-Pacific Partnership (TPP) are planning to do a full court press in the lame duck session of Congress following the election. We will be bombarded with speeches and columns from President Obama and other illustrious figures telling us how it is important to approve the TPP for a variety of reasons. \\nWe can be certain that one of the reasons will be the inherent virtues of free trade. They will not be telling the truth. \\nThe TPP is not about free trade . It does little to reduce tariffs and quotas for the simple reason that these barriers are already very low. In fact, the United States already has trade deals with six of the other eleven countries in the TPP. This is why the non-partisan United States International Trade Commission (ITC) estimated that when the full gains from the TPP are realized in 2032, they will come to just 0.23 percent of GDP. This is a bit more than a normal month’s growth. \\nAgain, the full gains from the TPP will come to just 0.23% of GDP — one month’s growth. So what is going on with the TPP? Why do people like Barack Obama (and Pfizer, etc.) want it to pass so badly? Among the reasons is this one: \\n[T]he TPP goes far in the opposite direction, increasing protectionism in the form of stronger and longer patent and copyright protection . These forms of protection for prescription drugs, software, and other products, often raise the price by a factor of a hundred or more above the free market price. This makes them equivalent to tariffs of several thousand percent. \\nThese forms of protection do serve a purpose in promoting innovation and creative work, but we have other more efficient mechanisms to accomplish this goal. Furthermore, the fact that they serve a purpose doesn’t mean they are not protectionist. \\nTilting the playing field toward Money, a scheme that protects the holders of intellectual property … forever, if they can get away with it. For example, consider this: \\nCopyright Length And The Life Of Mickey Mouse \\nLast week, we reported on Rep. Zoe Lofgren’s statement that copyright law has become equal to the life of Mickey Mouse . Tom Bell has a couple of recent posts exploring issues related to Mickey Mouse and copyright, that seem worth exploring, given Rep. Lofgren’s recognition of this fact. While he notes (as we have) that there’s ample evidence to suggest that the earliest Mickey Mouse cartoons really are in the public domain , he first explores how the length of copyright has followed the age of Mickey Mouse : \\nBottom line: Until the current, neo-liberal capital-protecting political regime falls or is taken over, Mickey Mouse will never be in the public domain. \\nWhat About a “Free Market” for Doctors Too? \\nBaker finds something else significant about our so-called “free trade” agreements — they’re very selective about which markets are “freed.” Consider, for example, the market for relatively powerless manufacturing labor and the market for much more powerful (and wealthy) doctors. \\nBaker: \\nThe other point to be made about free trade and protectionism is that our push for free trade has always been very selective. NAFTA and other trade deals were explicitly designed to make it as easy as possible for U.S. corporations to manufacture goods in the developing world and ship them back to the United States. … \\nBut [while] manufacturing workers in the developing world are willing to work for much lower pay than manufacturing workers in the United States, so are doctors in the developing world . \\nUnlike manufacturing workers, doctors are powerful enough to get protection. It is not generally possible for a doctor trained in another country to practice medicine in the United States unless they pass a U.S. residency program — for which there is a strict quota on foreign trained students. As a result of this restriction, doctors in the United States earn on average twice as much as doctors in Canada, Germany, and other wealthy countries . This protectionism costs the United States roughly $100 billion a year (around $700 per family) in higher health care costs. \\nIf our trade negotiators actually were interested in “free trade,” they would have constructed a system whereby foreign trained doctors could be certified as meeting U.S. standards. They would then have the same freedom to practice as any doctor born and trained in the United States. \\nAgain, a straight-up wealth protection scheme. Baker goes on to note that the “market for doctors” really is a trade issue, not an immigration one, since many German, Canadian, French and Indian doctors could most like get into the U.S. and get jobs — as waiters, for example — they just couldn’t work as doctors. \\nBaker’s conclusion is exactly right, that calling a deal like the TPP a “free trade agreement” is just propaganda: “When reporters call the TPP a ‘free trade’ deal, they are acting as advocates, not reporters. The TPP is a protectionist pact for those at the top who are worried that free trade will undermine their income — like it did for those at the middle and bottom.” \\nThere’s No “Free Market” for Political Parties Either \\nI think if Democrats think that the Trumpist revolt against “free trade” deals is just an expression of anti-immigrant racism — and that they can pass TPP in the lame duck session without consequences — there may be a surprise in store for them. After all, there’s no “free market” for U.S. political parties either — we have a carefully protected two-party monopoly — and there are only two ways to disrupt and revolt against it that I can think of. Neither is pretty, neither is orderly, and neither will be good for Democrats. \\nForewarned? Let’s hope so. The lame duck session is just weeks away. 0 0 0 0 0 0'"}, "time": 1742628464.72385}