{"duration": 0.06495118141174316, "input_args": {"text": "'Last year, after some players used the sport to protest against the country, the U. S. Women’s National soccer team added a rule requiring all players to stand for the playing of the national anthem. But, one of the players whose actions forced the rule by refusing to stand, Megan Rapinoe, is insisting that she won’t stop speaking out about social issues no matter what rules the team implements. [Rapinoe, 31, took flack last season for joining former San Francisco 49ers   quarterback Colin Kaepernick in his   protests by taking a knee instead of standing during the anthem. But, after several players indulged the protests, the national team added rules requiring all players representing the U. S. to stand during the anthem.  The player, who has been on national teams since 2003, says she will obey the new rule but it won’t stop her from speaking about about the “inequality” she claims to see in the U. S. A. “What has surprised me the most, especially   is that people are still sort of arguing against it. It’s really obvious that we have very serious inequality in this country across many different spectrums,” Rapinoe told the U. K. Guardian. “Yes, we can talk about the form of protest, or the way it’s done, or this or that. But it’s still not really the conversation that I think we desperately need to have more of in this country. ” Rapinoe insisted that the anthem protest is not the only way to speak out against the United States. “I don’t think there’s any perfect way to protest. I think if there was something else being done, something else would have been said about it,” Rapinoe exclaimed. “I can’t look back and say that I would have done this different, this different or this different. ” But the player also said that she was not sorry for her protests. “I can sleep at night knowing that I genuinely tried to have a really important conversation, or at least tried to open it up,” she said. “I think I came to it with an open mind, an open heart and tried to get as many people to talk about it as I could. ” “God forbid you be a gay woman and a person of color in this country because you’d be really fu**ed,” she added. Rapinoe also said she is widening her protests after “learning” more about the “inequalities” in the U. S. “As I got more into gay rights, I got more into equal pay and you just see that it’s all connected. You can’t really speak out on one thing and not another without it not being the full picture,” she insisted. “We need to talk about a larger conversation in this country about equality in general and respect  —   especially with the recent election and subsequent narrative that’s coming from the White House right now. ” “I hope to continue to have the conversation,” Rapinoe concluded. “Hopefully people who disagree with me continue to have the conversation and we can kind of open each other up even more than we already have. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564189.018546}