{"duration": 0.14435911178588867, "input_args": {"text": "\"Posted on October 28, 2016 by Jay Syrmopoulos \\nPortland, OR – The group of men who seized the Malheur National Wildlife Refuge , in rural Oregon were found not guilty late Thursday, vindicating brothers Ammon and Ryan Bundy after the 41-day standoff that brought nationwide focus to long-running dispute over federal control of rural land in the Western United States. \\nAccording to a report in by the Associated Press : \\nA jury found brothers Ammon and Ryan Bundy not guilty a firearm in a federal facility and conspiring to impede federal workers from their jobs at the 300 miles southeast of Portland where the trial took place. Five co-defendants also were tried one or both of the charges. Ammon Bundy has a house in Emmett. \\nDespite the acquittal, the Bundys were expected to stand trial in Nevada early next year on charges stemming from another high-profile standoff with federal agents. Authorities rounding up cattle at their father Cliven Bundy’s ranch in 2014 because of unpaid grazing fees released the animals as they faced armed protesters. \\nThe Bundy family initially made headlines in 2013 when the Bureau of Land Management brought armed agents in to seize rancher Cliven Bundy’s cattle after his refusal to pay federal authorities a massive debt – which he claims is illegitimate. \\nIn response to the militarized response in Nevada by the BLM, militia from across the U.S. mobilized and coordinated a response which saw hundreds of armed Americans stand up to what they perceived as vast federal overreach. \\nWhat the government thought would be an open-and-shut case was anything but. The group never denied they seized the refuge while armed or that they made demands of the government. \\n“Ladies and gentlemen, this case is not a whodunit,” Assistant U.S. Attorney Ethan Knight said in his closing argument, making the argument the group illegally commandeered a federal building. \\nThe AP reports: \\nOn technical grounds, the defendants said they never discussed stopping individual workers from accessing their offices but merely wanted the land and the buildings. On emotional grounds, Ammon Bundy and other defendants argued that the takeover was an act of civil disobedience against an out-of-control federal government that has crippled the rural West. \\nFederal prosecutors took two weeks to present their case, finishing with a display of more than 30 guns seized after the standoff. An FBI agent testified that 16,636 live rounds and nearly 1,700 spent casings were found. \\nAmmon Bundy spent three days testifying in his own defense, focusing on the fact that federal overreach is destroying rural Western communities that have relied on the land — for generations in many cases. Bundy made clear that the plan was to simply take control of the refuge by occupation, while eventually returning it to local control. \\nOriginally, 26 occupiers were charged with conspiracy. Eleven pleaded guilty, while another had the charge dropped. Seven defendants have not yet been tried. Their trial is scheduled to begin February 14, according to the AP. \\nShortly after the verdict was announced, an Oregon-area reporter posted to Twitter that Ammon Bundy’s attorney Marcus Mumford was tackled by U.S. Marshals after insisting that Bundy should be allowed to be released from custody, with the judge subsequently ordering the courtroom cleared. \\nThe armed occupiers took control of the remote bird sanctuary on January 2, in response to the prison sentences given to two local ranchers, Dwight and Steven Hammond, after being convicted of arson in relation to an ongoing dispute with the BLM. Upon occupying the refuge the group demanded that the father and son be freed and that federal officials cede control of publicly held lands to local control. \\nUltimately, the Bundy brothers and a number of their fellow occupiers were arrested in an ambush style attack, while on the way to negotiate with a Sheriff. It ended with officers gunning down Robert “LaVoy” Finicum – a charismatic group spokesman. Currently, numerous federal SRT agents are under investigation for lying about firing at the occupiers’ vehicle during the ambush. \\nThe majority of the remaining occupants left the refuge in the wake of Finicum’s killing , with four holdouts negotiating their surrender until February 11. \\nIn the wake of the verdict, both the FBI and U.S. Attorney’s Office also expressed disappointment. \\nU.S. Attorney Billy J. Williams said his office “respects the verdict of the jury and thanks them for their dedicated service during this long and difficult trial.” \\n“For many weeks, hundreds of law enforcement officers — federal, state, and local — worked around-the-clock to resolve the armed occupation at the Malheur National Wildlife Refuge peacefully. We believe now — as we did then — that protecting and defending this nation through rigorous obedience to the U.S. Constitution is our most important responsibility. Although we are extremely disappointed in the verdict, we respect the court and the role of the jury in the American judicial system.” – Greg Bretzing, Special Agent in Charge, FBI Oregon \\nRegardless of the sentiments of those in government and law enforcement, the jury carried out justice — with this verdict solidifying that the killing of LaVoy Finnicum was nothing less than criminal . \\nRevealing exactly why the 2nd Amendment is so important to a free people, Bundy testified that the reason occupiers chose to carry guns was because they understood that they would be immediately arrested otherwise and needed to protect themselves against possible government violence. \\nThere is no mistaking the difference in law enforcement’s response to unarmed protestors — versus those that exercise their right to bear arms. One need look no further than the ongoing protests against the Dakota Access Pipeline at Standing Rock – which has been met with numerous militarized and violent crackdowns on non-violent water protectors – to see exactly how differently armed protesters are treated. Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742563444.6590319}