{"duration": 0.06739354133605957, "input_args": {"text": "'Microsoft founder Bill Gates called for a robot tax to offset the loss of jobs done by humans as a result of advancements in automation during an interview with Quartz. [“Certainly there will be taxes that relate to automation. Right now, the human worker who does, say, $50, 000 worth of work in a factory, that income is taxed and you get income tax, social security tax, all those things,” declared Gates. “If a robot comes in to do the same thing, you’d think that we’d tax the robot at a similar level. ”  “There are many ways to take that extra productivity and generate more taxes. Exactly how you’d do it, measure it, you know, it’s interesting for people to start talking about now,” he continued. “Some of it can come on the profits that are generated by the   efficiency there. Some of it can come directly in some type of robot tax. I don’t think the robot companies are going to be outraged that there might be a tax. It’s OK. ” Gates added that “you ought to be willing to raise the tax level and even slow down the speed of that adoption somewhat to figure out, ‘OK, what about the communities where this has a particularly big impact? Which transition programs have worked and what type of funding do those require? ’” “You cross the threshold of   of certain activities all sort of at once,” Gates concluded. “So, you know, warehouse work, driving, room cleanup, there’s quite a few things that are meaningful job categories that, certainly in the next 20 years, being thoughtful about that extra supply is a net benefit. It’s important to have the policies to go with that. ” Billionaire and entrepreneur Mark Cuban also claimed robots are going to “cause unemployment,” posting, “Automation is going to cause unemployment and we need to prepare for it,” to Twitter on Sunday. Last week, Tesla and SpaceX founder Elon Musk warned that deep A. I. could potentially be dangerous to the human race, who he described as already  . “One of the most troubling questions is artificial intelligence. I don’t mean narrow A. I   —   deep artificial intelligence, where you can have AI which is much smarter than the smartest human on earth,” proclaimed Musk during the World Government Summit in Dubai. “This is a dangerous situation. ” “Pay close attention to the development of artificial intelligence,” he continued. “Make sure researchers don’t get carried away. Scientists get so engrossed in their work they don’t realize what they are doing. ” In November, Musk also predicted that automated robots would lead to mass unemployment, which he claimed could eventually create a universal wage from the government. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561838.502552}