{"duration": 0.19945073127746582, "input_args": {"text": "'DALLAS  —   The gunman who killed five police officers in Dallas had enough   materials in his home to lead the authorities to believe he was planning a larger attack, the city’s police chief said on Sunday. He provided new details of how, during two hours of negotiations, the gunman sang, laughed and asked how many officers he had killed before he was killed by a   robot. David O. Brown, the police chief, said evidence showed that Micah Johnson, 25, an   Army Reserve veteran who told the police that he wanted to kill white officers, had been practicing detonations and that the explosive material had the potential “to have devastating effects throughout our city and our North Texas area. ” “We’re convinced this suspect had other plans and thought that what he was doing was righteous,” Chief Brown said on CNN’s “State of the Union. ” Mayor Mike Rawlings of Dallas, in an interview near the shooting site, described Mr. Johnson as having employed tactics designed to cause as much harm to people as possible. “He was really well trained in becoming a killing machine, O. K.?” he said. “Shooting low, fighting    at that one point, going high, shooting down another street. This guy trained himself not for that exact location, but he knew how to elicit pain on people. ” The details emerged as the nation was immersed in protests, vigils and calls for peace from many pulpits after a week of unsettling violence that began with the fatal police shootings of Alton Sterling, in Baton Rouge, La. and Philando Castile in Falcon Heights, Minn. The attack on officers on Thursday night in Dallas turned a peaceful demonstration against the earlier shootings into a scene of bloodshed and chaos. President Obama cut short an overseas trip and planned to travel on Tuesday to Dallas, where he, along with former President George W. Bush, will address a memorial service. Vice President Joseph R. Biden Jr. and Laura Bush will also attend, the White House said. Mr. Obama, speaking in Spain, urged protesters to avoid inflammatory words and actions, but also defended the right to demonstrate, saying that one of the nation’s great virtues is its openness to protest and efforts to speak truth to power. He said Black Lives Matter had grown out of a long protest tradition that dated to the abolitionist movement. In such movements, Mr. Obama said, “there’s always going to be some folks who say things that are stupid or imprudent, or overgeneralize, or are harsh. ” Demonstrators gathered again on Sunday in cities as scattered as Dallas, Falcon Heights, Memphis, Baton Rouge, Atlanta and New York City, where 300 people marched silently, fists raised in the air, from Times Square to Union Square, with signs proclaiming “Stop police terror!” and “Stand together. ” In Baton Rouge, police officers in riot gear and flanked by SWAT trucks were trying on Sunday evening to turn back protesters who had come from a peaceful rally earlier and were trying to march to the Police Headquarters a few miles away. A Baton Rouge police spokesman said 48 arrests had been made by about 10 p. m. most for obstructing a roadway. No weapons had been confiscated, he said. News outlets in Memphis reported that protesters there had blocked traffic on the Interstate 40 bridge spanning the Mississippi River after a rally downtown. Some activists began circulating text messages asking   around the country to boycott major retailers and to deposit $100 into a   bank as a means of economically stopping the “slaughtering of black lives. ” Hundreds of demonstrators had been arrested Saturday night and into early Sunday in San Francisco, New York, Chicago, St. Paul and Baton Rouge, including DeRay Mckesson, a prominent activist in the Black Lives Matter movement who was released Sunday afternoon. In Phoenix, officers used pepper spray to disperse crowds. In St. Paul and Baton Rouge, the mood had been tense overnight Saturday into Sunday morning. In St. Paul, protesters had shut down an interstate highway for hours. At least 20 officers were injured as people threw rocks, bottles and bricks, the police said. The authorities in Baton Rouge, where Mr. Sterling was fatally shot early Tuesday, said they had arrested more than 100 people, charging most with obstructing the road. Among them were three members of the news media and Mr. Mckesson, who filmed his encounter with the police using the   app Periscope. John Bel Edwards, Louisiana’s governor, said Sunday that the vast majority of protesters had behaved lawfully and that the police response had been moderate. He said some of the disturbances had been caused by demonstrators from outside Louisiana, but pledged that “they will not be allowed to incite hate and violence. ” Pastors across the nation called for reconciliation and compassion. At St. Patrick’s Cathedral in New York, Cardinal Timothy M. Dolan spoke of a country “worried, frustrated and fatigued over senseless violence. ” “From Minnesota to Louisiana and Texas, one nation under God examines its soul,” he said. “Sadness and heaviness is especially present in our   and law enforcement communities. ” He added, “We pray with and for them. ” In his television appearance, Chief Brown provided new details of the two hours of negotiations that the police conducted with Mr. Johnson, saying he had demanded to speak to a black negotiator, had sung and laughed, and had asked how many officers he had killed. Mr. Johnson also wrote the letters “R. B. ” in blood on the walls of the parking garage where he had hidden, Chief Brown said, an indication that he may have been wounded. It was not clear what those letters referred to, the chief said. Chief Brown said Mr. Johnson “obviously had some delusion. ” He described the gunman as doing “quite a bit of rambling at the scene. ” The police chief said investigators were examining Mr. Johnson’s laptop, journal and cellphone and had not completely ruled out the possibility that others were involved. He said he believed Mr. Johnson’s aim was to “make us pay for what he sees as law enforcement’s efforts to punish people of color,” including the fatal police shootings of   in Louisiana and Minnesota in the days before the ambush. Those deaths, Chief Brown said, prompted Mr. Johnson to “fast track” plans to kill police officers. Describing the moments that occurred just before Thursday’s shootings, Chief Brown said that once the protesters had started to march through downtown Dallas, Mr. Johnson had driven his vehicle, a black Chevrolet Tahoe, well ahead of the group to prepare for the attack on police officers escorting the demonstrators. “You could easily see the march coming down the street they were walking, and saw an opportunity with some   positions, a couple of buildings in the pathway of the marchers, and decided to take the high ground and start shooting right away,” Chief Brown said. “And we had to scramble to block intersections, which did expose our officers to this attack. And this suspect took advantage of that. And once he was in a   position, officers did not know where the shots was coming from. ” Officials in recent days have revealed that Mr. Johnson, who served in the Army Reserve from 2009 to 2015, had   materials, ballistic vests, rifles, ammunition and a journal of combat tactics in his home. His journal described a method of attack in which a gunman can keep moving to confuse the enemy. The chief and Mr. Rawlings, the Dallas mayor, defended the Police Department’s use of the robot bomb that killed Mr. Johnson. Critics have raised questions about the episode, which may have been the first time a local law enforcement agency in the United States had used such a device to kill a suspect. Chief Brown said that the suspect had hidden in a corner in the garage and that deploying a sniper would have exposed the police to “great danger. ” “We believe that we saved lives by making this decision,” he said. Mr. Rawlings, in the interview Sunday, described Mr. Johnson as having employed tactics designed to cause as much harm to people as possible. The mayor, who heard portions of Mr. Johnson’s discussions with police negotiators, said the gunman was “just talking about how he was just upset with the whole world and upset with police, upset with white police. ” He added, “I believe he was mentally ill. ” Mr. Rawlings added: “I believed he wanted to kill officers. He did it, and a person like that would never be satisfied usually until they were taken down. ” In a separate interview on CBS’s “Face the Nation,” he said that he supported the department’s use of the bomb, and that the authorities had opted to use it only after negotiators had been unable to persuade Mr. Johnson to surrender. “It was a difficult decision because the safety of our police officers were in our mind,” Mr. Rawlings said. “The chief had two options, and he went with this one. I supported him completely because it was the safest way to approach it, and we talked to this man a long time and he threatened to blow up our police officers. We went to his home, we saw that there was   equipment later, so it was very important that we realize that he may not be bluffing. ” The Dallas Morning News published a   editorial urging the city to emerge as an example of how to bring the nation together. “Today our country seems capable of pulling apart in ways that have not seemed possible in many decades,” the editorial said. “Dallas, again, has been bathed in blood and grief. How we respond will help show a path forward to a divided, reeling nation. ” Chief Brown called for Americans to support police officers, but acknowledged that “we’re not perfect. There’s cops that don’t need to be cops. ” And he had a message for the protesters: “We’re sworn to protect you and your right to protest. And we will give our lives for it. ”'"}, "time": 1742564569.2179537}