{"duration": 0.03148484230041504, "input_args": {"text": "'BERLIN  —   Throughout the almost 11 years Chancellor Angela Merkel has been in office in Germany, her nation has been reassuringly stable in the midst of tumult throughout Europe, maintaining a steady economy and stolidly predictable politics. But it is becoming increasingly clear that Ms. Merkel’s decision last year to allow hundreds of thousands of migrants to enter the country has set off aftershocks that continue to upend politics in Germany and beyond. And on Monday, a day after voters in Berlin dealt her party another stinging loss in the second regional vote in two weeks, she was left to convince voters that she was not out of touch with their anger and anxiety over the flood of immigrants. “If I could, I would turn back time by many, many years to better prepare myself and the whole German government for the situation that reached us unprepared in late summer 2015,” Ms. Merkel said after meeting with leaders of her party, the   Christian Democratic Union. “Nobody, including myself, wants a repeat of this situation. ” In a speech that was at times personal, Ms. Merkel took responsibility for her party’s   showing in balloting in Berlin. She also acknowledged a role in the party’s humiliating   finish, behind the Social Democratic Party and a nationalist party, Alternative for Germany, two weeks ago in her home state,  . She pledged to work to regain voters’ trust. Since her decision to welcome refugees from Syria and other poor and   countries, the effects across Germany and Europe have only grown more intense. The main political beneficiary of the backlash in Germany has been Alternative for Germany  —   a trend that has played out across much of the Continent, where     parties are on the rise in many countries. The question of how far to go in assimilating the migrants has exposed a deep rift between Eastern and Western Europe, and the economic and cultural challenges of absorbing so many people have contributed to rising nationalism in countries including France, the Netherlands and Austria, and to Britain’s decision to leave the European Union. On Monday, instead of gathering with President Obama and other world leaders in New York at the United Nations, Ms. Merkel stayed home to shore up her political standing a year before general elections, deflecting questions about whether she would even run again. The chancellor defended her decision as “absolutely right,” but she acknowledged that “ultimately, it led to a time when we did not have enough control over the situation. ” She pointed to legislation and efforts since then aimed at helping to regain control and integrate the new arrivals. Her conservative party’s loss on Sunday in the state elections in Berlin, she acknowledged, was the result of the mass arrival of refugees and a resulting protest vote against the party. But there were several other reasons, she said, including the emergence of “a   world, where people are not necessarily interested in facts, they are just following their feelings. ” The   behavior of voters and politicians this year  —   most stunningly seen in Britain’s vote to leave the European Union  —   has upset faith in opinion polls and in institutions developed since World War II to contain the   or   thought that is now attracting populist support. Many Germans found their country’s chaotic response to the influx of migrants worrying to the point that they felt a threat, whether real or perceived, to their personal stability and prosperity, said Constanze Stelzenmüller, a senior fellow at the Brookings Institution. “To many, the German state appeared not to be capable of handling this wave of migrants,” Ms. Stelzenmüller said. “That raised questions of safety of their own personal life. That showed, right or wrong, their country’s institutions were not as strong as people thought they are. The shock of the initial wave is still in people’s bones. ” Ms. Merkel said it was vital to recognize the economic roots of insecurity, suggesting that globalization and new trade patterns could have profound effects on people, from the German farmer to the young population of Africa. Making that connection, she argued, is essential for a decent future. Germany “won’t let itself be rattled to its core,” she said, adding, “That didn’t happen even in such a   indeed extremely unsettling, year as the past one. ” Germans in rural areas  —   where Christian Democrats hold more sway than in cities  —   are deeply worried that even if they are doing well, they have lost faith in their prospects for the future, she said. “When the young people all leave the villages, when one can only with difficulty sell one’s home,” she noted, there is drama and uncertainty “which thicken into a fear, or at the very least a worry about the future. ” After 1989, the fall of the Berlin Wall and the spread of freedom across Europe, she said, made it seem that Europe was on a victorious course and could not be overtaken. Now, she added, “something has developed where we notice that in the globalized world, we are not necessarily in the forefront. ”'"}, "time": 1742628594.546718}