{"duration": 0.15472960472106934, "input_args": {"text": "'Normally, you’d be confused. Why would HBO lower the curtain on Season 5 of “Girls” with two episodes on Sunday rather than the usual one at a time? Why not give the show’s 10 episodes a full 10 weeks? But there are the mysteries. Then there are the realities. And the presumable reality is that decks needed clearing and hatches needed battening for next weekend’s simultaneous resumption of “Game of Thrones,” “Veep” and “Silicon Valley”  —   and the Saturday unveiling of whatever this    Beyoncé “Lemonade” thing is supposed to be. So Sunday’s   “Girls” finale points to the national indifference that’s accrued around a show whose fealty to discomfort, poor choices and social cannibalism, which felt new in 2012, are now just part of television’s oxygen. In the last two seasons, the show’s senses of satire and pathos are stronger and more pungent than everBut it’s true: Funny narcissists are indeed easy to come by (even on HBO). Perhaps instead you’re watching “Unbreakable Kimmy Schmidt,” “Veep” “Transparent,” “Togetherness” “Crazy  ” and “You’re the Worst. ” And “Girls” didn’t invent them. There they were, for instance, on “The Golden Girls,” “Will  Grace,” “Sex and the City” and “30 Rock. ” But “Girls” keeps finding ways of dramatizing its satire so that it doesn’t always seem satirical. Few shows better explore the complications of personality and behavior. Even if it doesn’t appear as robust, refined and specific an achievement as, say, “Transparent,” the show still has the confidence to jump along a tightrope of displeasure. [ Has “Girls” gotten better? Read our discussion. ] The show’s   ringmastered by its chief protagonist, Hannah Horvath (Lena Dunham) pinball off one another, going from friends to lovers to frenemies. What set the show apart this year  —   from both its previous seasons and most of its peers  —   is the use of the space, place, framing, allusion and mood to house that narcissism. Bad manners are met with mannerism. Shoshanna’s first adult job landed her in Tokyo and, for a few episodes, the show went with her. Her intoxication with the culture  —   without her Japanese pals losing sight of her foreignness  —   felt like a gentle rebuke of the incurious insularity of a movie like “Lost in Translation. ” She wasn’t a citizen. Nor was she a tourist. This season’s seventh episode was particularly handsome. Written by Sarah Heyward and directed by Richard Shepard, it turned the 1964 murder of Kitty Genovese into a piece of immersive theater staged inside and around a stately apartment complex, which was meant to evoke the building near where Genovese was killed, while her neighbors went about their business. The killing inspired decades of   research the show used the case as an ideal test for the characters’ own emotional nearsightedness. (“Hello Kitty” is the episode’s title.) Hannah enters the building lobby   with her current boyfriend, Fran (Jake Lacy) and leaves devastated that her ex, Adam (Adam Driver) might be sleeping with one of her best friends, Jessa (Jemima Kirke). As usual, the comedy comes, in part, from Hannah’s obnoxious rebellion against propriety, which tends to be represented by poor Ray (Alex Karpovsky). His morality, civic engagement, loyalty and earnestness (culturally, he’s a generation older) are constantly disrupted, compromised and exploited by everyone else. This time he just wants to lose himself in some theater and no one will let him. The small silences in this episode are rich and absorptive. They’re too much, though, for Hannah, who keeps breaking them to muse about the artifice of it all. When her friend Marnie (Allison Williams) enters one apartment, newly single and almost radioactively aglow, she doubles the obliviousness. It’s unclear she even knows she’s at a play. They’re there to see Adam perform as half of a squabbling married couple, but by the time the play reaches its grisly climax, none of these people are really paying attention. Adam looked across the courtyard at Jessa, who’s vamping at him on a fire escape, while Hannah watches them both in disbelief. They ignore the screams and barely notice the amateurish plaster statues that stand in for the victim and her killer. There’s just Brenda Lee misting up the soundtrack. Basically, a   crime loses out to a figurative one. It’s one of the show’s most sophisticated and most intricately filmed gags about selfishness. The camera glides toward windows. It cranes downs at the plaster  . It oscillates from Jessa to Adam to Hannah. Perhaps you think about “Rear Window,” “Monsieur Hire,” “Stakeout” or any other movie involving voyeurism, danger and a little melodrama. And the atmosphere is so rich you can practically feel the balm of warm spring air. But Hannah and Marnie peel off to commiserate. And by the time you see these two spread out on somebody’s bed, they’ve cast themselves in their own sitcom: “The Sorrow and the  . ” But the show manages to maintain the gravity of both transgressions: an ambitious if seemingly dumb take on real tragedy and the tragedy that Hannah thinks is her life. It’s a kicky, poignant   of television  —   half of which is spent elsewhere at a Manhattan party, featuring Hannah’s roommate, Elijah (Andrew Rannells) who is trying to hold his own among greasy gay celebrities. Each plot warranted its own episode, but that was “Girls” this year: so many good ideas, so little space to unfurl them. There were moments during the series’ underrated fourth season when, between Hannah’s damningly indulgent stint at the Iowa Writers’ Workshop and the invention of a carnivorous   named   (Gillian Jacobs) the show looked as if it had found its groove as a   farce. This fifth season ended on a   note, after Hannah runs into Tally (Jenny Slate) a college classmate, with a dark cloud of hair, who has become a literary star. She’s like Bizzaro Hannah: Her narcissism doesn’t repel success it vacuums it up. Tally encourages Hannah to steal a guy’s unlocked bike (it’s a sign, Tally says) and through two montages  —   set first to Vanity Fare then to Nicki Minaj and Beyoncé  —   they take a ride, smoke a joint on Hannah’s bed, and dance in her apartment. And for half an episode, as Tally and Hannah pedal and puff, “Girls” is no longer “Girls. ” It’s “Broad City. ” On that show, Ilana Glazer and Abbi Jacobson mount a perfectly calibrated celebration of millennial obnoxiousness, while also nailing the ridiculousness of   consumer culture. The two shows have unruly young women and Brooklyn in common. That’s about it. But the way Ms. Slate is made to look resembles  —   passingly, cartoonishly  —   Ms. Glazer. These scenes between Ms. Slate and Ms. Dunham suggest a lunatic road not taken. “Girls” has some great slapstick. But it’s bending toward maturity that “Broad City” doesn’t care about. When it started, “Girls” was received as an anthem for entitled white women. Detractors had a field day with Ms. Dunham, who created this show and has written and directed much of it, for privileging privilege, as if she couldn’t be aspiring to the withering heights of Luis Buñuel or Carrie Fisher. Through 52 episodes of television  —   some of them, like that Kitty Genovese episode, marvelous  —   “Girls” has never stopped looking for the grander, harsher psychological picture. It’s never stopped looking for tough laughs. It fights   American absurdity with its own version of it, as it does in the final episode of the season, in which Shoshanna (Zosia Mamet, a crayon turning at last into a scalpel) rebrands Ray’s coffee shop as a   haven for people who actually work  —   that is, for “adults,” in other words. But in its highest gear, the show peerlessly vanishes the line between sociocultural satire and mental instability, between send up and crack up. That business with Hannah, Adam and Jessa closes the season with an unnerving cliffhanger. Hannah performs her pain for the storytellers’ radio hour “The Moth,” which obviously she takes to like a    to a flame. The night’s theme is jealousy. In her tale, she proves she’s overcome it by delivering a peace offering in the form of a fruit basket. But the story deepens and darkens a deranged argument that took place a few minutes earlier. Suddenly, Hannah’s narcissism seems terroristic. Her personality disorder has the power to disorder other people’s personalities. Maybe, she’s the disorder. One of the last shots hovers about a demolished living room. But it’s not exactly a cliffhanger for the show’s next and final season. It’s a   view of the wreckage in the canyon. Plus, there’s something about the way the camera lingers on the basket outside the door that makes Hannah’s offering seem more than a gift. It looks like a bomb.'"}, "time": 1742561642.0993083}