{"duration": 0.06918954849243164, "input_args": {"text": "'Posted on October 26, 2016 by Dr. Eowyn | 7 Comments \\nHillary Clinton is like a chameleon. \\nDilbert cartoonist Scott Adams , who’s a trained hypnotist and observer of facial nuances, calls it an “unusual level of variability” in her physical appearance. In his words, Hillary “looks like an entirely different person every few days. See “ Chameleon Hillary Clinton is back to looking like sh*t — and the return of her medical handler ” and “ Hillary Clinton’s teeth, tongue-hole & now-you-see-it-now-you-don’t wrinkles ” \\nOn Monday, October 24, 2016, Hillary Clinton was in St. Anselm College in Manchester, New Hampshire for a rally , accompanied by “Fauxcahontas” Sen. Elizabeth Warren (D-MA). \\nClose-up images of her face show that she’s morphed again, back to yellow teeth and a face crisscrossed with wrinkles. What happened to the porcelain-doll Hillary with dazzling-white teeth of the July 2016 Democratic National Convention? \\nBut this time, at St. Anselm College in Manchester, New Hampshire, there’s something even stranger. \\nYesterday, Matt Drudge tweeted two close-up images of Hillary at the NH rally, which show something embedded under the skin of her right cheek . Here’s the tweet: \\nHere are the two images again, enlarged. I painted yellow arrows pointing to the lumps: \\nAccording to plastic surgeons , Botox injections don’t cause lumps under the skin. Dr. Richard Baxter explains that “Botox relaxes muscles that are hyperactive and so wrinkles caused by those muscles are smoothed,” but don’t lead to lumps. Dr. Janet Turkle says that although “Botox injections can result in temporary bumps due to the injection,” the bumps last “only a few minutes”. \\nAccording to the American Academy of Facial Esthetics , however, “some of the risks of facial injections are lumps (granulomas/nodules) which are a potential risks [sic] associated with Radiesse, Sculptra, Juvederm, and ArteColl.” \\nFacial injections are injections of facial fillers such as collagen, hyaluronic acid and calcium hydroxyl apatite that rejuvenate facial skin by reducing or eliminating wrinkles, raising scar depressions, enhancing lips and replacing soft-tissue volume loss. \\nH/t FOTM ‘s TPR'"}, "time": 1742561831.7442412}