{"duration": 0.06308746337890625, "input_args": {"text": "'Videos Should Third Parties Support ‘Vote Pacts’ To Avoid ‘Spoiling’ Elections? Unlike other vote swapping schemes which pair a voter in a swing state with a voter in a ‘safe’ state, a vote pact pairs voters across party lines who each promise to cast their ballots for a third-party candidate instead.   Green party presidential candidate Jill Stein, foreground, meets her supporters during a campaign stop at Humanist Hall in Oakland, Calif. on Thursday, Oct. 6, 2016. \\nAUSTIN, Texas — Third-party candidates are often accused of acting as “spoilers” by siphoning votes from the two major parties’ nominees and potentially tipping the balance in an election. \\nPerhaps the most notable example of this is Ralph Nader. The former Green Party candidate is frequently accused of helping George W. Bush win the 2000 presidential election by diverting votes which otherwise would have gone to Democratic nominee Al Gore, although this theory has been disproven many times . \\n“A lot of people have basically grown to depend on the confines of the two-party system and have a hard time getting their brain around a constructive, strategic path out of it,” Sam Husseini, a political activist, told MintPress News. \\nHusseini proposed an alternative strategy in which voters form “voting pacts” across party lines. For example, a Democrat and a Republican might each agree to vote for a third-party candidate of their choice, rather than the two major parties’ candidates. The strategy reduces the potential for “spoiling” votes, as long as voting pacts don’t cross state lines, because each of the major candidates loses voters equally. \\nHusseini operates the website VotePact.org to encourage this method of vote sharing or vote pairing. Letter in Wash Post: “VotePact Offers Voters a Sensible Alternative” — how #NeverTrump & #NeverHillary can pair up: https://t.co/HB3CtnGGdi \\n— votepact (@votepact) August 30, 2016 \\n“It has the potential for being a catalyst for genuine realignment and perhaps even for a victory for a so-called third party or independent candidate creative enough to use such a strategy,” Husseini said. \\nThird-party candidates frequently urge voters to follow their conscience rather opt for one of the “lesser of two evils” selected by the two-party system. As Green Party nominee Dr. Jill Stein frequently says , “We need to stand up and fight for the greater good like our lives depend on it.” \\nHusseini said he’d like to see third-party candidates embrace vote pacts instead of dismissing spoiler claims. He suggested they should also urge their supporters to form vote pacts as a way to safely support third-party movement building. Here’s how Husseini imagines the idea being pitched by a candidate: “There’s a way out of this. You feel like you gotta vote for Clinton because you hate Trump. I get that. Lots of people are like that and lots of people are on the other side. Well, they should pair up and both vote for me.” \\nHe continued: “I’ve never seen any third-party candidate do that, which is why I think they’re going to remain in single digits” in the popular vote. \\nOther forms of “vote swapping” have been proposed during this and previous elections, usually seeking to pair a voter from a swing state with a voter from a state “red” or “blue” state. The voter in the so-called “safe state” agrees to vote for a third-party candidate in return for securing a vote for their preferred candidate in a state where the election is in play. \\nThis “safe state” strategy was especially popular in 2000, when voters sought to trade Nader and Gore votes. That election prompted a court case in which the 9th Circuit Court of Appeals ruled that that vote swapping is “clearly protected by the First Amendment.” \\nLast month, Husseini told Bustle’s Amée Latour that the “safe state” strategy just “kicks the can down the road.” Third parties often hope to secure 5 percent of the popular vote in presidential races, which would unlock millions in additional federal funding for future elections, but Husseini thinks by embracing vote pacts they could potentially win elections outright. \\n“The other so-called ‘strategies’ are basically a way of minimizing the so-called ‘damage’ of third-party runs,” he told MintPress. \\nWhile Husseini said he hopes alternative candidates will someday make vote pacts a key part of their campaign strategy, he also stressed that it isn’t too late for voters to embrace the idea in the 2016 election. Vote pacts require mutual trust between political opponents, so he recommends forming them with family members, close friends, and coworkers across party lines. \\nHe also said voting pacts could spur political change by encouraging people to engage in challenging political conversations across party lines rather than simply shutting out opposing views. \\n“Instead unfriending that guy who said he might vote for Trump because he hates Clinton, reach out to them.” Be Sociable, Share!'"}, "time": 1742562044.586126}