{"duration": 0.13539838790893555, "input_args": {"text": "'WASHINGTON  —   Scientists and environmentalists reacted with fear this week as the Trump administration purged nearly all mention of climate change programs from the White House and State Department websites and ordered a freeze on federal grant spending at the Environmental Protection Agency and other government agencies. Memos ordered employees of at least four agencies not to send out news releases or to create social media posts, blog entries or official website content, and to consult with senior officials before speaking to the news media. Such memos or oral communications landed this week at the E. P. A. and the Departments of the Interior, Agriculture and Health and Human Services, in a broad halt to external communications while the Trump administration struggles to put political appointees into position. Small   of communications  —   apparently in dissent  —   appeared on Twitter, but they were quickly stopped. The Twitter posts of the social media division of the Badlands National Park broadcasting the threat of climate change became something of a cause célèbre before they disappeared from the platform on Tuesday. A White House spokesman, Sean Spicer, attributed those Twitter posts to a former park employee who had commandeered the park’s account. Longtime employees at three of the agencies  —   including some career environmental regulators who conceded that they remained worried about what President Trump might do on policy matters  —   said such orders were not much different from those delivered by the Obama administration as it shifted policies from the departing White House of George W. Bush. They called reactions to the agency memos overblown. On Wednesday, Douglas Ericksen, a spokesman for the E. P. A. said that grants had been only briefly frozen for review, and that they would be restarted by Friday. “I’ve lived through many transitions, and I don’t think this is a story,” said a senior E. P. A. career official who spoke on the condition of anonymity because he was not authorized to speak to the news media on the matter. “I don’t think it’s fair to call it a gag order. This is standard practice. And the move with regard to the grants, when a new administration comes in, you run things by them before you update the website. ” But the White House and State Department did delete nearly all mentions of climate change policy  —   which had been a top priority for Mr. Obama  —   and have begun replacing them with pages detailing Mr. Trump’s plans to roll back those policies  —   a top priority for the new president. It is standard practice for new administrations to make changes to their websites to reflect their different policy positions. The full contents of the Obama administration’s White House and State Department websites, including working links to climate change reports, have been archived and are readily available to the public. But environmental advocates and Democrats took advantage of the moves, noting that they appeared to target agencies that focus on environmental protection and scientific research, and calling them a chilling signal that the Trump administration intends to suppress communication about science and environmental policy, and possibly scientific data. If nothing else, the memos and ensuing reaction furthered the impression of turmoil throughout the government as Mr. Trump tries to assert control. Scientists said that even if no climate or other scientific data has been deleted from government websites, they remain fearful that it could be. Mr. Ericksen wrote in an email on Wednesday that the Trump administration team is now “reviewing” the E. P. A. ’s climate change page for changes. “People can’t tell whether data is being purged or not  —   it’s a confused situation,” said Michael Oppenheimer, a climate scientist at Princeton University and a member of the Intergovernmental Panel on Climate Change, which supplies scientific reports to world governments. “If the Trump administration doesn’t want rumor, invective and anxiety running amok, they should get out there and say publicly and firmly that they believe in science and have no intention of hiding science from the public. And they haven’t done that,” Mr. Oppenheimer said. Environmentalists also criticized what appeared to be a Twitter war between some Interior Department employees and their new bosses, as the agency appeared to delete Twitter posts by National Park Service employees that highlighted the smaller attendance at Mr. Trump’s inauguration than at Barack Obama’s 2009 inauguration, as well as facts about climate change. Rebellious posts on social media became so plentiful from so many obscure sites that the management of the Interior Department appeared powerless to find them all. The Golden Gate National Park tweeted out concerns over a warming planet. After the Badlands Twitter posts were taken down, employees at the Theodore Roosevelt Inaugural Site in Buffalo ended Tuesday evening by quoting the first President Roosevelt on free speech  —   “a necessity in any country where the people are free. ” But it is far from clear how realistic the response has been. The Agriculture Department memo to employees was modeled after one written by Tom Vilsack, President Barack Obama’s agriculture secretary. “In order for the department to deliver unified, consistent messages, it’s important for the office of the secretary to be consulted on media inquiries and proposed responses to questions related to legislation, budgets,   policy issues and regulations,” wrote Mr. Vilsack, a former Democratic governor of Iowa, in 2009. “  statements should not be made to the press without notifying or consulting with the office of the secretary. ” Michael Young, the acting deputy secretary of the Agriculture Department, who has worked as a career civil servant in the department for 33 years, wrote a memo to employees telling them to consult the secretary’s office when responding to news media inquiries, and he said the memo was little different than the one that was issued during the transition to Mr. Obama’s administration. “This memo is not some sort of creative writing exercise,” he said. “This is almost exactly what was issued eight years ago. I just updated it a bit. ” Asked about the memos at a news briefing on Tuesday, Mr. Spicer said, “I don’t think it’s any surprise that when there’s an administration turnover that we’re going to review the policies. ”'"}, "time": 1742561878.4937458}