{"duration": 0.04152870178222656, "input_args": {"text": "'Home › US NEWS › YOUTUBE BANS ‘CLINTON’S BLACK SON’ YOUTUBE BANS ‘CLINTON’S BLACK SON’ 0 SHARES \\n[10/27/16] YouTube on Wednesday terminated the account of Danney Williams, the 30-year-old man who has claimed since the 1990s to be the black son of former President Bill Clinton. \\nBut YouTube suddenly reversed its decision on Thursday amid public outcry and reinstated the account in the early morning hours, posting a notice that said only: “After a review of your account, we have confirmed that your YouTube account is not in violation of our Terms of Service. As such, we have unsuspended your account.” \\nWhen it terminated the account on Wednesday, YouTube cited unspecified “repeated or severe violations of our Terms of Use and/or Community Guidelines” and declared the account “cannot be restored.” \\nThe YouTube decision to terminate Williams’ account blocked the nine-minute feature “BANISHED – The Untold Story of Danney Williams,” which had received 1.2 million views since Williams posted it last week. Produced by filmmaker Joel Gilbert, it drew nearly 100,000 views per day and more than 1,000 viewer comments, with the overwhelming majority expressing support for Williams and outrage at the Clintons for not being willing to allow a DNA test to determine paternity. \\n“My YouTube account has been deleted, but the same video appears in 50 other places on YouTube alone,” Williams said on his Facebook page after being notified of YouTube’s decision to suspend the account. “[YouTube] can’t handle the truth! Please share #BillClintonSon.” \\nTwitter also continued to allow Williams to post the “Banished” video on Danney Williams’ page , but the Twitter link to YouTube displayed the message : “This video is no longer available because the YouTube account associated with this video has been terminated. Sorry about that.” \\nThe video is still running on Danney Williams-Clinton’s Facebook page , as well as on the YouTube channel operated by Gilbert. \\nAttempt to silence Danney Williams? \\nGilbert told WND on Wednesday he helped Williams file an online appeal form on YouTube asking why the account was suspended and demanding it be immediately reinstated. Post navigation'"}, "time": 1742562702.924193}