{"duration": 0.0693507194519043, "input_args": {"text": "'You are here: Home / US / BRUTAL Meme Exposes How Government REALLY Works BRUTAL Meme Exposes How Government REALLY Works October 26, 2016 Pinterest \\nDerrick Wilburn writes that if ever there was a governmental agency gone rogue it’s the Obama Environmental Protection Agency. The EPA has now become a faux-legislative body and through its vast overreach the federal government has assumed control over huge swaths of America, American industry and put tens if not hundreds of thousands of Americans out of work. \\nLast year the EPA passed a rule granting itself power over puddles by naming them wetlands which fall under federal jurisdiction. A blatant move to allow environmental groups to sue developers, halt natural resource exploration or any other project they’d like to stop. \\nNow it’s happening again. \\nWhen farmers plow their land in preparation for planting it produces grooves in the earth called “furrows.” These furrows are bordered on each side by small ridges of dirt. \\nThe EPA, in its insatiable appetite for control via new regulatory powers, has come up with another term for furrows: “ mini mountain ranges .” You read correctly. This entirely absurd distinction is extremely important because, like wetlands, guess who has control over the nation’s mountain ranges? The feds. This ridiculous name –mini mountain ranges– could be enough for the federal government to seize control over private land use decisions by U.S. farmers. \\nThis nonsense has come to light as a result of a U.S. Senate committee report . “A Senate Report on the Expansion of Jurisdiction Claimed by the Army Corps of Engineers and the U.S. Environmental Protection Agency under the Clean Water Act” was released September 20th. America’s two largest environmental regulation agencies, the EPA and U.S. Army Corps (that’s pronounced “ core ”, by the way) of Engineers proposed this regulatory rule. \\nThe rule uses the Clean Water Act to give the two federal agencies expanded jurisdiction over private land use decisions. \\nLike any good rogue body the EPA is not responding to inquiries about it activities and is instead referring questions to the Department of Justice. To no one’s surprise, DOJ is also refusing to comment claiming that because the new rule is being challenged in court it cannot. Sort of like a guy claiming he’s not going to publicly release tax returns while the subject of a federal audit. \\nConfused by its title many mistakenly presume the Army Corps of Engineers is in some ways a military or para-military body. Not so much. The Corps is a federal agency charged with oversight of America’s waterways. On its website the agency states that “environmental sustainability” is a “guiding principle.” Tell you all you need to know? \\nJason Hayes, Director of Environmental Policy at the Mackinac Center for Public Policy, said the 1977 amendments to the Clean Water Act specifically exempted plowing as a “normal farming activity.” The EPA is attempting to do away with that exemption. \\n“The Corps even tries to argue that these newly created small mountain ranges hamper the growth and development of wetland plant species, apparently ignoring the fact that farmlands are managed to produce crops, not cattails,” Hayes said. “No reasonable regulation of the nation’s farmland can demand farmers produce crops without moving dirt, or expect farmers to produce wetland plant species instead of corn or wheat.” \\nDaren Bakst, a research fellow in agricultural policy at The Heritage Foundation, said it is not surprising that the EPA and Corps claim furrowing can create small mountain ranges, “Does kicking a pebble next to water create a mini-meteor? Is a puddle a mini-ocean? Who knows?” Bakst wrote. \\nThe Senate report concludes that if the EPA and Corps of Engineers interpretations were allowed, “most if not all plowing” would be considered a “discharge of a pollutant” and require a federal permit. Get that – U.S. farmers required to file for and obtain federal permits in order to plow their own land . And if you think those permits are going to be free or even cheap I’ve got a bridge you may be interested in. \\nBecause this is what liberalism does. \\nIf allowed to stand, in ten years those permits will be too expensive for all but the wealthiest of corporate-run farms and ranches. Why? All because of the left’s insatiable war on “global warming.” They don’t care how many coal-working families are put out of work, how many birds of prey are killed , nor how many family farmers are forced into bankruptcy. NOTHING is more sacred than the war against their boogeyman, climate change.'"}, "time": 1742561950.446691}