{"duration": 0.14850521087646484, "input_args": {"text": "'LOS ANGELES  —   Because he was told that   were box office poison, and he wrote the screenplay for “Hell or High Water” anyway, resulting in one of the few Hollywood films of 2016 to shine a light on   America. Because, as a former actor, he creates vivid characters that are fun to perform. Because he was overlooked by Oscar voters for his last script, the   drug thriller “Sicario. ” Could voting members of the Academy of Motion Picture Arts and Sciences talk themselves into giving Taylor Sheridan the trophy for best original screenplay? With a week and a half to go before ballots are due, the annual Oscar race has officially entered the stage when voters can grow bored with the sure bets  —   repeated for months by prognostication outfits like GoldDerby. com  —   and look for smaller ways to reward films that have little chance of winning bigger prizes. Fitting that bill this time may be Mr. Sheridan, a nominee for “Hell or High Water. ” The   Mr. Sheridan, 47, who quit his journeyman acting career in 2011 and moved to Wyoming, is not the   in his category. Better positioned are the establishment favorite Kenneth Lonergan, who wrote “Manchester by the Sea” and has been nominated by the academy for his writing twice before and Damien Chazelle, the prodigy behind “La La Land” who took home the writing prize at the Golden Globes. [See where to stream “Hell or High Water.] But Mr. Lonergan and Mr. Chazelle are vulnerable. Some voters find Mr. Lonergan’s script overlong. “Manchester by the Sea” is also likely to be honored in other categories, including best actor, where Casey Affleck is a favorite. As for Mr. Chazelle, his screenplay has been overshadowed by his “La La Land” directing (collecting the top prize at the bellwether Directors Guild of America Awards) and the strong likelihood that “La La Land” will win best picture. “Hell or High Water,” a meditation on failure disguised as a    chase movie, has its own disadvantages. It was released by CBS Films and Lionsgate in August, outside the traditional awards corridor. Some dislike its ambiguous ending. And it took in only $27 million at the box office  —   a feat for an art film that cost a lean $12 million to make, but a niche sum all the same. (The final two films vying for the original screenplay Oscar have taken in even less. “The Lobster,” a dystopian story dreamed up by Yorgos Lanthimos and Efthymis Filippou, collected $9. 1 million. Written by Mike Mills, “20th Century Women” has managed $5 million.) But Mr. Sheridan has a shot, partly because giving him a little gold man is a way for voters to sneak some love to the film. Directed by David Mackenzie and starring Jeff Bridges as a twangy Texas marshal, “Hell or High Water” is nominated for best picture but won’t win. Sure, Mr. Bridges could triumph in the supporting actor contest. But Mahershala Ali seems to have that one in the bag for his tender portrayal of a drug dealer in “Moonlight”  —   especially after that emotional speech he gave at the Screen Actors Guild Awards. That leaves Mr. Sheridan. On Monday at the annual Oscar nominee luncheon in Beverly Hills, Mr. Sheridan said that he was still struggling to comprehend his nomination. A win? “You feel so presumptuous to even think about it,” he said quietly. He was wearing a dark suit, but he would probably have been more comfortable in a pair of   cowboy boots. Rather than flying to Los Angeles, he drove from Wyoming  —   a   trip  —   in his   “dually” truck. (For you city slickers, that means it has a set of double tires in the back.) “Hell or High Water” is the story of brothers  —   one younger (Chris Pine) with “a kind face marked by years of sun and disappointment,” as Mr. Sheridan described the character in his script, and one older (Ben Foster) with “an air of danger that attracts as many women as it repels. ” They rob West Texas banks in the throes of the Great Recession to pay back predatory bank loans and save the family homestead. A casually racist lawman (Mr. Bridges) and his part Comanche, part Hispanic deputy (Gil Birmingham) investigate, passing through one dying town after another and meeting various characters, including one of the orneriest waitresses ever put on film. (“That weren’t a question,” she snaps, taking their   steak lunch order.) Mr. Sheridan wrote “Hell or High Water” in less than three weeks. “I don’t outline,” he said. “I sit down to write and I take the ride. If something starts to not feel right, I go back to the last place that felt like jazz to me. ” He wrote what he knew. Mr. Sheridan grew up on a ranch near Cranfills Gap, Tex. population 277. It was a spare existence: His family had no stereo, he said, but they did have Bess, a yellow station wagon with an   player. His parents sometimes sat in the car with a   of beer and listened to Waylon Jennings. The Sheridans lost their property in the   economic downturn. “Otherwise I would still be living there,” Mr. Sheridan said. Instead, he wound up in Austin after flunking out of Texas State University. One day he was approached by a Hollywood talent scout who offered to fly him to Los Angeles. “I figured I might as well take the free trip,” he recalled. To his surprise, Mr. Sheridan began booking small roles on series like “Walker, Texas Ranger. ” By 2011 he had landed a regular part on “Sons of Anarchy,” but he was still struggling to support his family. Conceding that his acting career had peaked, he sat down in his cramped Hollywood apartment and started writing “Sicario,” a dark, morally ambiguous   drama with shifting protagonists. “I had read enough scripts to know what not to do,” he said. “Sicario” rode strong reviews to $85 million in worldwide ticket sales. (A sequel, “Soldado,” may arrive later this year, as may “Wind River,” a thriller about a manhunt on an Indian reservation that Mr. Sheridan wrote and directed.) “Hell or High Water,” Mr. Sheridan’s second script, was equally daring. “A film about rural disenfranchisement and the way that institutions have abandoned people, with a major character in his 60s who spits out racist barbs  —   I never thought it would sell, so I just did exactly what I wanted to do,” Mr. Sheridan said. The film’s racial banter was particularly concerning to the film’s eventual backers. “There was hesitation about that and rightly so,” he said. “But it’s something that exists. That’s how a lot of these guys talk. ” Mr. Sheridan continued: “I think that kind of casual racism comes from insecurity  —   guys who don’t know how to express their affection with each other so they revert to these insults. They think it’s playful. But their words create a divide. ” He paused for a moment, before channeling his inner ornery waitress. “I didn’t want to   these people,” he said gruffly. “I wanted to be really honest  —   take ’em or leave ’em  —   and I think that’s one reason the film has connected. ”'"}, "time": 1742563009.1632884}