{"duration": 0.12294697761535645, "input_args": {"text": "'By Smoking Mirrors on November 6, 2016 Smoking Mirrors — Nov 6, 2016 Dog Poet Transmitting……. It’s Saturday, late afternoon and Tuesday is two days away, if you don’t count the rest of today or Tuesday because it would then be Tuesday and not away anymore. Then again, it will take all day Tuesday for whatever the nonsense is to complete itself and possibly into the next day as well. One thing that this election has done and which hasn’t come to the attention of many people is that it has woken the public up. The public has been able to see first hand the level of media bias and the cynically suckupping celebrities. It has been able to see the intensity of the lies in all those political commercials; like the one that said Trump was walking in on naked beauty contestants, some of whom were only 15 years old. That one amused me. I have never seen the degree of vituperation that has been taking place. I have never seen the media so clearly expose itself for what it is. It did it in such a way and to such a degree that even the wet brain American public was able to see it. Mr Apocalypse is like an expensive watch; a multiplicity of gears turning and each gear is a kind of plot construct and it seems impossible to tell which of them are turning all of the others. You might term it a wheels within wheels kind of thing, or a number of those acts of misdirection from a great magician. All the while a variety of events seem to be taking place but what is happening is that something else, entirely different, is being woven out of them. All the while, as the psychopaths and opportunists are having their way, their every machinations is being recorded for posterity and their every act is being choreographed to a specific end. Destiny is one of those words, one of those concepts, like Karma that has a temporal meaning over a broad surface spectrum, because of the varieties of interpretations given by this one or that one …but these words have much deeper interpretations that exist, according to the depth of the one giving the interpretations. Destiny has an individual application and then various broader applications. Families have destinies, towns and cities have destinies, nations have destinies and even planets have destinies, as do solar systems and galaxies. The gods have a destiny. The gods have Karma and all of the aforementioned do as well. This accounts for some of those who walked out on their families and the towns and cities they were birthed in and grew up in. They were in search of something they carried with them as they went looking. It doesn’t matter where you are. No matter where you are, there you are and the most priceless and valuable thing that it is possible to acquire, you are transporting from place to place as you look for it under the guise of everything else. The first consideration any human being ought to make in this life is to ponder what it is that is distracting them from self inquiry. What is it that makes it so difficult to scrutinize the imponderables of existence. How is it that one can see the Sun and Moon in the sky and the glittering and countless stars and not know that there is some grand and majestic power at work. How can one pass by the Buddhas and Hindu gods in the antique shop window and no wonder about the tales that attend them? How can one not make the connection between the face of a new born baby and an old man sitting in his chair on a porch? How can one attend birthday parties and all those other celebrations and then attend a funeral and not make the connection that since they were present at all of the other events, how could they not expect that a funeral would be held for them? There is a story about the Pandava Brothers where Dharma appears as a stork to one of the brothers and asks him what the greatest mystery is. The brother doesn’t know and the stork says, “That you see men dying all around you and do not think that you yourself will die.” Was that in the Mahabharata? I’m not remembering it that well but it’s been decades since I read the major books from the Hindu tradition; except for The Bhagavad Gita that always seems to be around here somewhere (grin). I cannot shake the feeling that some shocking surprises are looming in the Event Horizon. I also cannot get around the feeling of this unshakable optimism that suffuses the atmosphere all around me. There are threats of earthquakes and tsunamis. There are wars and rumors of wars. There is the specter of economic collapse. The worst of it is the collective immersion of the human psyche in material culture. Without this freakish zombie obsession the self styled elite would have no power over the rest of us but it is like pouring swill into a hog trough with the certainty that the hogs will come a running. It is a form of pornography even worse than the usual fare. It’s the single most difficult hurdle of them all. Human ignorance and indifference are what makes all of the visible evil possible and hardly anyone even sees it. It’s business as usual. It is the daily redundancy of the dream walkers, lumbering up and down the aisles of somewhere in search of something. It is the unexamined lives from cradle to grave with nothing understood and nothing to remember; precious lives wasted and in vain. Few realize the value and privilege of a human birth. Fewer still realize the potential of it. Powerful invisible forces wait at the ready for any and every person who begins to show an interest in the hidden side of existence. They watch to see who awakens to the joy of service. They pray for the opportunity to assist in every righteous endeavor. These days more time is spent publicizing a person’s acts of alleged charity than the act was worth. Wealth is relative and so is the value of one’s contributions. We’ve become a cartoon in so many ways. Bruce Springsteen canceled his North Carolina leg of his tour because North Carolina wouldn’t back down from George Soros’s efforts to create gender neutral bathrooms . Should Hillary succeed in stealing the election, you may be sure that she will continue all of the perversion themes of Bwak! Obama because the same people that own him, own her. I can’t imagine that who becomes president is going to make a great deal of difference because America has a specific Destiny and a specific Karma and we are watching it unwind. In the meantime, regardless of the threats of earthquakes and tsunamis, wars and rumors of wars, economic collapses, political psychopathy and whatever else is out there, a spiritual renaissance is being generated for those so inclined. Anything is possible so I won’t conjecture what might or might not happen. Flying saucers could come out of the skies. The people who live in the Earth might migrate to the surface. The aliens among us might suddenly expose themselves in their real skin. Holographic Jesus could materialize all over the world at the same time. The mist around Shambala could dissolve and reveal itself and then the Destiny of that scenario could play out. Portals could open all over the planet and those who are able to see them could walk through them into another world or dimension. There is no telling what may or may not occur but it goes without saying that it can’t continue to go on the way it has been going and that we are pretty much assured of sweeping and dramatic changes greater than most of us can imagine. The solution is… whatever you come up with based on what you are after or… my version, complete surrender to and reliance on the ineffable who is in absolute control of all of it in the first and… last place and all spaces and places in between. If one is capable of uniting their consciousness with the cosmic consciousness then one enters into the cosmic consciousness and becomes a visible representative of the invisible. There’s a learning curve of course but once muscle memory and all the rest of those memories come on line one is in a positions to sail like a swan upon the river of time. Hassan I Sabbah once said, “Nothing is real, everything is permitted.” Certainly according to appearances (grin). He happens to be right and the only difference between any of us is determined by one’s intention and that decides the good and the bad of it… relatively speaking. It is my hope that all of you not only pass through the flotsam and jetsam that is coming in on the tide but that you absolutely flourish. See you somewhere around Tuesday. End Transmission……. Visible reads from the 6th chapter of“The Way to The Kingdom”'"}, "time": 1742562008.244216}