{"duration": 0.12924957275390625, "input_args": {"text": "'Email \\nWhy does everyone think that presidential campaigns are about “issues,” when anyone over the age of consent knows they are all about sex? But it says a lot about the lasting power of Viagra that this is still the case when we have a couple of seventy-year-olds on the ballot. (“ For an election lasting more than four years, please call your doctor .”) \\nIn last week’s newspaper there was a report on the tenth or eleventh woman (I have lost track) to come forward to say that Donald Trump made suggestive and “inappropriate” advances to her during a golf tournament that took place about ten years ago. \\nThe woman in question is Jessica Drake, who during her press conference announced that at the time of the tournament, she was working in the “the adult industry” (that’s what People Magazine calls porn) for Wicked Pictures (the 20th Century Fox of gang banging) when the randy Donald kissed and hugged her in his room. \\nTrump was already in his pajamas when she knocked on his door, together with two friends. Normally, in the adult business, when three porn stars knock on your hotel door, it’s considered foreplay. \\nWhen Trump’s effusive greeting of Miss Drake did not lead to more snuggling, let alone the suggestion to preview some of her work on the hotel television, he offered her $10,000 to satisfy his suite dreams. \\nDrake again demurred, saying that the next morning she needed to get back to Los Angeles “for work.” By that point in her career she had already notched screen credits for “Extreme Doggie” and “Fornocopia.” I would mention other titles, but as they say at the New York Post , “This is a family newspaper.” \\nThat rejection prompted Donald to offer Jessica an early morning ride (of shame?) on his Trump airliner back to LA, which still didn’t turn the trick. * * * \\nThen last week, in the presence of her lawyer, Gloria Allred (the Perry Mason of many cases against Bill Cosby) Miss Drake tearfully repeated in primetime her shock and dismay that Mr. Trump had tried to take liberties with her reputation, which, after all, includes the 2009 Adult Video News Award for the “Best Double Penetration Sex Scene” in her classic work, “Fallen.” \\nDrake said she was coming forward now to stand in “solidarity” with the other women Trump has manhandled, although there were suggestions that her outing was timed to coincide with the launch of Drake’s new online store, where devoted viewers can purchase such classics as her “Guide to BDSM for Beginners,” among other titles. \\nNormally scenes such as the one I am describing would be consigned to John Oliver, Monty Python, or Saturday Night Live , but in the new normal of presidential politics, even Miss Drake gets a respectful hearing on the issues. \\nFor example, the next day the Huffington Post reported: “Woman Says Trump Sexually Assaulted Her, Offered Her $10,000 For Sex.” \\nThe deadpan New York Times wrote: “Ms. Drake, who appeared Saturday with the women’s rights lawyer Gloria Allred, said Mr. Trump had hugged and kissed her and the other women without permission.” \\nThe headline in New York Magazine read: “Adult Actress Jessica Drake Details Trump Assault, Blasts Him for ‘Uncontrollable Misogyny’.” \\nLook, I have no doubt that Trump is a pig who routinely gropes and propositions women, but since when does the press in a presidential election have to source its stories in the “adult” industry? * * * \\nSadly, the answer to this question dates to winter 1992 when Bill and Hillary Clinton figured out that unless a presidential candidate has a sexual storyline, few of the voters will pay much attention to their positions on nuclear disarmament or welfare reform. \\nDuring the 1992 Super Bowl, the Clintons appeared on a halftime special of 60 Minutes to deny jointly (Bill: That allegation is false ) that he had ever had an affair with Gennifer Flowers, who lived in Little Rock, Arkansas when Bill was governor and often out jogging. \\nIn this vaudeville performance, Hillary played the straight man, adding: “You know, I’m not sitting here—some little woman standing by my man like Tammy Wynette.” (At least she didn’t reference The Eagles.) \\nOnly in 1998, under oath in a sworn deposition, did Bill admit to having a 12-year affair with Ms. Flowers. But neither her allegations in 1992, nor his lying about it, cost him the election that year. \\nJust the opposite: Clinton’s wanderlust might have won him sympathy among the voters (no strangers to sexual boredom) who found they had more in common with a soft-shell Baptist (Bill) than an uptight Protestant (George H.W. Bush). \\nNor did Clinton’s impeachment in 1998 for lying about his affair with Monica Lewinsky under oath in the Paula Jones case hurt his post-presidential career (worth $200 million +) or the electoral prospects of his wife in 2016. \\nBut it did turn sexuality into a mainstream presidential campaign issue, which is one of the reasons why this year’s race seems only to be about sex. * * * \\nNo doubt the Clintons do find some delicious irony in Trump’s groping charges, as payback for what they view as the Republican use of sexuality to impeach Bill in 1998 and, in 2016, for the GOP plan to make his many adulterous affairs fair game for their campaign soundbites. (Cut to an online image of the White House and over it a fading picture of Bill smoking a cigar, with the caption “Here we go again?”) \\nWithout the pageant-loving, casino operating Donald Trump as the Republican nominee in 2016, Hillary Clinton could well have been vulnerable on the sexual front, with Bill’s mistresses steady fodder for negatives ads and the many allegations from his scorned lovers that Hillary organized the slut-shaming. \\nInstead of the 2016 election turning on Hillary’s marriage to Hugh Hefner’s doppelgänger, the storyline that has played best in the media is Donald’s secret life as a groper. \\nThe press actually has given Trump a pass for his adultery (which produced all those wonderful children) but zeroed in on his groping, in part because he confessed to it on an NBC videotape and also because—think of ratings—gropers belong in the same basket of deplorables as child abusers and others lurking on subways, crowed elevators, or near schoolyards. \\nBest of all for the Clintons, politically anyway, is that the charge of groping is impossible for Trump to refute. Even denying it sounds sleazy. \\nAnd it colors all aspects of the campaign. To wit: the New York Times headline when at Gettysburg Trump outlined his vision for America: “Donald Trump Pledges to ‘Heal Divisions’ (and Sue His Accusers).” * * * \\nFor its mud-slinging, I am sure the Trump campaign has spent many long hours brainstorming how to tar Hillary as a lesbian. But even that innuendo has fallen flat, despite the rumor mongering that she’s in a Boston marriage with her assistant Huma Abedin (whose husband, Anthony Weiner, is otherwise distracted in high school chat rooms). \\nSeveral of Bill’s former lovers (Sally Miller, Dolly Kyle, and Flowers) have tried to play up Bill’s pillow talk that Hillary prefers the nighttime company of women. But none of these allegations have gone further than Infowars or the supermarket press. (“ Hillary Hit Man Tells All !”) \\nNor have out-of-wedlock children, a staple of the 1884 campaign (as was chanted to Grover Cleveland: “ Ma, Ma, Where ’ s my pa ?”), gotten much play in this year’s presidential race. \\nTrump and his casino gumshoes have put considerable effort into tracking down the rumor that Danney Williams is Bill Clinton’s illegitimate son by a Little Rock prostitute named Bobbie Ann Williams. \\nTrump invited Danney (a sympathetic man) to the third presidential debate, as if to press on Bill a Scarlet Letter. Despite Williams looking very much like President Bill, the story got no more traction than did the news that Malik Obama, the president’s shunned half-brother, is supporting Trump. He, too, got a debate invitation, to sit in the box presumably marked “Shame.” \\nAlso in the dustbin of history are the allegations that Flowers aborted Bill’s baby in 1977 and the whispering campaign (a great political standby when proof is elusive) that Chelsea is the product of an affair between Hillary and her then law firm colleague, Webb Hubbell. \\nThe Williams and Hubbell stories come with some convincing Internet similarities, at least in the photographs, although in both cases politically, this rumor milling whiplashed against Trump, as voters have only equated such tawdry allegations with his Birther past, something that has stuck as campaign mud. * * * \\nTechnically, Birtherism does’t directly involve sex, although it lingers on its fringes, as it speaks to Barack Obama’s illegitimacy, his foreign allegiances, and possibly disputed paternity, including the claim that Frank Marshall Davis was actually Obama’s biological father (another subterranean creed of Trumpism). \\nAgain, the documentary proof is a series of look-a-like photographs, as close as the Internet gets to DNA. That Davis was an American Communist works well in the campaign, as it suggests the origins of Obama’s political genetic code. \\nIronically, for all his efforts at smear, Trump came out the loser in the debates when Hillary nailed him to Birtherism, which has become a convenient code word for Trump’s racism, misogyny, and intolerance of immigrants, especially muslims. \\nNor, in response, did Trump have any luck in linking the Birther movement to Clinton’s 2008 campaign, when, according to Donald, consigliere-journalist Sidney Blumenthal delighted in the suggestion that Barack was born in Kenya. \\nInstead, the debate claim only made Trump look disingenuous. Clinton got a pass on what her campaign may or may not have insinuated in 2008. And at this point, no one cares. But voters do remember Trump as the Imperial Wizard of Birtherism. * * * \\nRepublicans can only blame themselves for wanting to divide the electorate in 2016 along lines of sexual preference or deviance, although this strategy was based on Hillary being the Democratic nominee and anyone other than Trump standing for the Republicans. \\nHad the GOP nominee been Carly Fiorina, Jeb Bush, or John Kasich, Clinton Inc. might well have been vulnerable to possible storylines about infidelity, illegitimacy, and rape. (Cue up the Paula Jones description of Bill, during a business meeting, exposing himself in a Little Rock hotel and settling her lawsuit for $850,000.) \\nInstead, the Republicans went with the polyamorous Trump, who, in addition to three marriages, has bragged on morning radio about his success with young women and who since 1996 has been leering at Miss Universe contestants—a bit like Austin Powers. ( Shall we shag now, or shall we shag later ?) \\nWith Trump’s resumé of creepy perversion, you might have thought that the Republicans would drop sexual misconduct from the electoral playbook. Instead, they doubled down to make the case that both Clintons, if elected, would turn the White House into a strip club. \\nNot only did the Clintons shrug off such innuendo, but, in response, they said (in effect), if they did, it would be to cater to the likes of players such as Donald J. Trump (leisure suit and open collar optional). * * * \\nFor the moment—and I can’t see anything changing in the last days of the campaign—the accepted wisdom of most front pages is that Donald Trump has groped as many women as Tiger Woods has watched pole dancing in Vegas. Even the gallery of “their women” looks about the same. \\nConversely, few voters seem to care that Bill might have forced himself on several women or that Hillary helped to cover up his brutality. That’s a narrative of the 1990s, which is perhaps the last time Austin Danger Trump read the newspaper. ( I’ve been frozen for 30 years. I’ve got to see if my bits and pieces are still working .) \\nFor most voters in 2016, names such as Kathleen Willey or Juanita Broaddrick are as lost in time as Nan Britton, who just before the 1920 election bore a love child with then candidate Senator Warren Harding. \\nBritton and the child got Republican hush money and a sad little house in Asbury Park, New Jersey. After Harding won, she was invited to the White House but their affair, so to speak, was kept in the closet. * * * \\nIf you think about elections as political sitcoms, in 1960 the Kennedys had to run as Rob and Laura Petrie on The Dick Van Dyke Show , complete with twin beds, long flannel pajamas, and prudent kisses on the cheek to say good-night, even if The JFK Reality Show would make Trump, Bill Clinton, and Tiger look like apprentices at adultery. \\nCome 2016, only something that resembles Modern Family and a desperate-housewives reality show can crack network primetime, and who better to put on air than The Clintons, with their Dallas -like money, communal sexuality, and more illicit storylines than CSI . \\nFor more than twenty years, Bill and Hillary have been bringing us seasons of lust, affairs, “I-did-not-have-sex-with-that-woman”, Vince Foster, Travelgate, foundation slush funds, basement servers, commodity trading, Whitewater, Bosnian snipers, pay-to-play, Benghazi, lost e-mails, and the like, and the ratings only continue to go up. \\nSure, The Apprentice was fun for a few episodes, but the sameness of insulting young people grew tedious. How is that supposed to compete with Bill making a pass at Huma, while her husband goes to prison for airing his junk, and Chelsea finding out about her real father. Next on The Clintons ?'"}, "time": 1742628589.7315388}