{"duration": 0.08724546432495117, "input_args": {"text": "'Not everyone thought that the brawl between the Nationals and the Giants, headlined by outfielder Bryce Harper and reliever Hunter Strickland, was necessarily a great look for major league baseball. [But, don’t count Cubs pitcher Jake Arrieta among them.  While appearing on the Bernstein and Goff Show on 670 The Score in Chicago on Tuesday, Arrieta said he felt that the brawl was “awesome” and “refreshing”: I don’t think anybody is right or wrong. I thought it was awesome. Every once in a while, it’s refreshing to see two teams emotionally charged getting after it. And when something like that happens versus continuing to chirp and talk about it, why don’t you go out there and see somebody? That’s exactly what happened in the game yesterday. Bryce and Hunter went out there, they were a few punches, they landed one apiece, I believe. And then Samardzija comes out of left field and smashes into Morse. I’m pretty sure Harper was lucky that they collided, because Samardzija was coming in to do some damage. Arrieta elaborated further: If two guys want to go see each other, let them be in the middle, let them throw some punches, then break it up. I don’t like to see any sucker punches. I do think in the heat of battle if you’re getting hit on the hip with 98, then you should be able to go out and see somebody. I think the umpires handled it well. They let them exchange for a moment, then they tried to break it up. What I don’t like to see is a lot of chirping and guys just talking crap to each other. If you got something wrong with a guy, go see him. And then they’ll break it up and continue to play the game. One of the most interesting aspects of the brawl between the Nats and the Giants was the fact that Giants catcher Buster Posey didn’t try to stop, or interfere with Harper as he ran out to fight his pitcher. Arrieta liked how Posey handled the situation and hoped his catchers would do the same: If it’s my catcher, I want him to wait and give me an opportunity to do a little damage. I don’t want it broken up right away. If it happens, I’ll let you know. I’ll be ready. You know, I like my chances toe to toe with just about anybody. I know Willson (Contreras) would probably beat whoever charges the mound to the mound, but I’ll tell him and Miggy (Montero) ‘Hey, give me 10, 15 seconds to get some work in and then come out and see me.’ Hardball Talk’s Bill Baer took exception to Arrieta’s perspective on the fight: Unfortunately, Arrieta is wrong for championing continued violence in baseball. Eventually, someone is going to be seriously hurt or killed because a baseball man had his feelings hurt. It’s not good for the game, especially if a star like Harper is involved and gets injured either by the pitch or by joining the fracas. It’s not good for kids watching, who learn that violence is an acceptable response to a perceived slight. It’s great for sportswriters, though, who get something to talk about for a couple days. So, uh, thanks, I guess. The only thing at risk of being killed during this brawl was the art of proper punch throwing. The art of throwing a helmet also took a hit, given that Bryce Harper stood directly in front of Strickland and yet, somehow, threw his helmet perpendicular to him. As for “the kids,” baseball has embraced violence as an acceptable response to perceived slights for over a hundred years. If baseball hasn’t ruined the youth of America yet, chances are it won’t. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563550.0310657}