{"duration": 0.1009368896484375, "input_args": {"text": "'If you’re among the tens of millions of people affected by the winter storm, odds are you’re not going anywhere Tuesday. The good news: The Times has you covered. Below is your   survival guide with everything you’ll need to stay     entertained and a little jolly. Read on for how to make the best of your cozy night inside. (Maybe time for a little hygge?) Just to get this out of the way: No, being cold does not increase your odds of catching a cold. That is a myth that refuses to die, but research has shown that low temperatures do not increase one’s chances of getting sick. There are, however, other winter dangers to watch out for. For example, if you’re going to be out shoveling, make sure to get in a good stretch before you start, push the snow rather than lift it, use your legs and not your back, and stop right away if you feel dizzy or have any tightness in your chest. More blizzard advice from The Times: • 7 Tips for Making It Through the Winter • Our look at general winter safety • A safety checklist from last year’s January blizzard • Last year we asked readers for their best blizzard preparation ideas, and we heard everything from keeping bottle coffee on hand in case the power goes out and making sure you have board games   to a simple recipe of “popcorn, red wine and ‘Mary Tyler Moore Show’ DVDs” • If you’re heading out to pick up some   winter gear, check out this guide to   gadgets compiled by our friends at The Sweethome. Being snowed in can be a great chance to put on your chef’s hat, so start out with our guide to cooking for the storm. Our guide to roasting chicken is another perfect option for a day inside, as is our guide on how to make soup. Other solid choices include: • Casseroles for cold nights • Cheery winter salads for dreary days • Warming stews and soups • Vegetarian soups •   pasta dishes ready in an hour or less • Braises for chilly days You could also channel that cabin fever and pick up some French cooking skills with our new cooking guide here, or keep things simple and get back to basics with our classic chicken soup recipe or tomato soup (just add grilled cheese). The team at Watching, our film and TV recommendation website, have rounded up their picks for what to stream during a blizzard. You could also: • Check out what’s new on Netflix, Hulu, Amazon and HBO this month • Catch up on this year’s Oscar winners • Binge these   wonders • Stream these nature documentaries • Or watch the movies that influenced “Get Out” Still haven’t found something you like? Just tell Watching what you’re what you’re in the mood to watch, and they’ll give you a series of recommendations from across many streaming services. Looking for some background music while you cook? Check out our pop music team’s most recent Playlist and their Popcast podcast. You could also scroll through the Magazine’s delightful annual interactive music issue, featuring 25 songs that tell us where music is going. Or if you haven’t already, tumble down the rabbit hole of “Missing Richard Simmons,” currently the most downloaded podcast on iTunes. For many, it’s a winter tradition: An evening snowed in means an evening of high spirits, emphasis on the spirits. If you’re in the mood for a hot drink to keep you warm as the snow piles up outside, Cooking has rounded up 10 cocktails that will do the trick. Hot drinks not your thing? Try these: • Switch to wine and learn all about it with our guide to drinking wine • If you’d rather go your own way, brush up on your   skills with our comprehensive guide on making cocktails • And if you’re skipping the booze tonight, check out this collection of nonalcoholic drink recipes. • Maybe even try a new type of hot chocolate? What better way to spend night in than catching up on some reading? Every week the Book Review puts together its list of favorite new reads, the most recent of which you can find here. If you’re still catching up on your reading list from last year, check out the 10 books our editors chose as the best reads of the year. You can also look over The New York Times Best Sellers list for ideas on what to dive into.'"}, "time": 1742564102.4759138}