{"duration": 0.08780336380004883, "input_args": {"text": "'\\nShocking video out of Chicago shows a mob of young black men viciously beating an older white man because he voted for Donald Trump, dragging him through the streets as he hangs out of the back of his car.\\nThe clip shows the thugs repeatedly screaming, “you voted Donald Trump” as they assault the victim from every angle while others steal his belongings.\\n“You voted Trump,” the mob screams, “You gonna pay for that sh*t.”\\nAnother woman shouts “beat his ass,” while another man is heard laughing before remarking, “Don’t vote Trump.”\\nA second video of the incident which is dubbed with the “F**k Donald Trump” song, a phrase now being chanted by “protesters” across the country, shows one of the attackers driving away in the man’s vehicle while his hand is still stuck in the window as the car drags him down the street.\\n“The scene is frankly reminiscent of a lynching,” remarks Chris Menahan .\\nIt is not even clear if the victim was a Trump supporter. Presumably, the mob used that as an excuse to beat and rob him.\\nYouTube quickly deleted the video, but it has been mirrored on numerous different websites.\\nIf the roles had been reversed, and Trump supporters had been caught on tape viciously beating a black Hillary voter, this would be a national news story right now.\\nThis is simply unacceptable \\nAs it is, you won’t see this on CNN any time soon. Perhaps blacks should also be deported to Africa… they never seem to be satisfied, no one ever seems to make them happy. They even rioted and protested during Obama, with one of their own as president. Black Lives Matter was formed during Obama.\\nBesides maybe us whites are bad with them and misbehave with them, sometimes willingly and purposefully while other times by mistake. So it would be best if we separate so that we don’t have these ancient conflicts anymore. This man who was beaten so badly never did anything wrong to these people, neither willingly nor unwillingly but these conflicts still happen because we are not compatible with each other.\\nAfter all first Republican president Abraham Lincoln believed in separation , he freed them from slavery but he also said:\\nI will say then that I am not, nor ever have been in favor of bringing about in anyway the social and political equality of the white and black races – that I am not nor ever have been in favor of making voters or jurors of negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say in addition to this that there is a physical difference between the white and black races which I believe will forever forbid the two races living together on terms of social and political equality. And inasmuch as they cannot so live, while they do remain together there must be the position of superior and inferior, and I as much as any other man am in favor of having the superior position assigned to the white race. I say upon this occasion I do not perceive that because the white man is to have the superior position the negro should be denied everything.\\nNow we do disagree with Lincoln’s idea of superior-inferior relationship. It would however be best to separate though. It just doesn’t work. Despite having almost 2 centuries now since the Emancipation Proclamation, conflicts still run rampant and no real friendship has ever been established. They should be resettled perhaps to Liberia, a plan supported by Abraham Lincoln and be helped financially with billions or even trillions of dollars until they can start their own economy and industry. They do deserve that. Anyone intermarried with them should be free to either stay in the US and divorce or simply go along with their families.\\nSource \\n'"}, "time": 1742563361.9428623}