{"duration": 0.12273859977722168, "input_args": {"text": "'On a recent afternoon in Montevideo, a young couple approached the counter at Futuro Refuerzos, a snug sandwich shop that features artisanal breads,   spreads and locally sourced meats. The woman was wearing a   felt halt and carried a vintage leather handbag the man sported tousled curls, forearm tattoos and skinny jeans. There was nothing remarkable about this scene  —   stylish   ordering gourmet sandwiches in a   rustic space  —   except that it unfolded in a destination that has seemed immune to hipsterdom. Montevideo, the capital of Uruguay, is almost invariably described as     and  . But in the past few years, an energetic cadre of entrepreneurs with social media proficiency and a keen awareness of global trends has begun to breathe fresh life into this traditionally sleepy South American city. Most are design and   millennials who are opening up restaurants and boutiques, organizing street festivals and supper clubs, and daring to stand out in a society that has typically rewarded modesty. “Thanks in part to social media, young Uruguayans have a global   and are very motivated,” said Mónica Zanocchi, the founder of a popular fashion and lifestyle blog called Couture. “There are a lot of creative professionals entering the work force, and since established companies can’t absorb all of this new talent, they end up becoming entrepreneurs. ” Futuro Refuerzos is led by Fermín Solana, a food writer and rock musician who grew frustrated with the lack of options in Montevideo. “There was nowhere to eat a decent sandwich beyond the old places that make chivitos,” he said, referring to the traditional steak sandwiches that are offered in neighborhood joints or local   chains. “I looked at Santiago and Lima, where the sandwiches are incredible, and decided to take a risk. ” Soon after opening in late 2015, Futuro Refuerzos had garnered a following thanks to creations like “gol,” handmade pita filled with spiced meatballs, sweet blood sausage and red cabbage. Mr. Solana is part of a group of young restaurateurs and chefs fueling the city’s small but growing foodie circuit, which right now includes over a dozen restaurants, cafes and specialty stores (until recently, Montevidean epicures spoke of living in a culinary wasteland, so this is a noticeable improvement). There is Estrecho, a tiny restaurant in the historic district with simple décor belying a sophisticated lunchtime menu prepared by Cali Diemarch, a chef trained in the United States who invents his daily dishes on the fly, such as a deconstructed chivito made with filet mignon, poached egg, caramelized pancetta and fried onions. La Pasionaria, a concept store and restaurant on a quiet nearby street, recently welcomed a new young chef, Luciana Fia, who makes pasta, ice cream and other food by hand, using fresh, local ingredients. At Sucré Salé Bistro, a casual spot near downtown, on the back patio of the Alliance Française de Montevideo, Florencia Ibarra often sneaks refined dishes like rabbit in mustard sauce with boulangère potatoes into her unfussy   menu. Leading the pack is the   and   Jacinto, headed by Lucía Soria, an alumna of the famed Argentine chef Francis Mallmann. Ms. Soria frequently appears on television, participates in food festivals like Degusto and headlines as the top guest chef in supper clubs like Mesabrava. “Finally, we have good places to eat, good live music and a generation of people who are breaking away from the old molds,” Mr. Solana said. “I think the city’s lighting up. ” Montevideo’s new vibe is closely linked to fashion and interior design, as seen in a surge of shops selling locally made clothes, accessories and home accents. Last year, one of the most dynamic new labels, Rotunda, unveiled a sleek multistory boutique in the Punta Carretas neighborhood, complete with its own photography studio, where the owners, Kevin Jakter and Sofía Dominguez, showcase their expanding line of minimalist women’s clothing, eyewear, shoes, and jewelry. Ten blocks away in the residential and commercial district of Pocitos, a trendy multibrand store, Tienda, sells   labels like Pastiche, which specializes in   denim, and Mutma, a maker of leather shoes and handbags. Casa Baném, a home décor store set in a   villa in upscale Carraco, also stocks a variety of homegrown brands like Don Baez, known for its throws and pillows made with Uruguayan merino wool, and Home Touch, which makes   lighting. This design boom can be gauged at MoWeek, the local fashion week held in April and October, which began in 2010 with six showrooms and now includes more than 60. “They’re all independent brands started by a new generation, which is impressive,” Ms. Zanocchi of Couture said. “Montevideo is still quiet, but there are some very interesting alternative scenes that are seeping into the mainstream. ”'"}, "time": 1742563728.6671917}