{"duration": 0.07029056549072266, "input_args": {"text": "'You are here: Home / US / Major Swing State Dem ADMITS Stunning Truth About Trump and The Polls Major Swing State Dem ADMITS Stunning Truth About Trump and The Polls October 27, 2016 Pinterest \\nFormer Pennsylvania Gov. Ed Rendell, a major swing state Democrat and Hillary Clinton ally, had quite a few commonsense sound bites during an interview with Philadelphia radio host Rich Zeoli, and one of the most notable was his comment about the “hidden Trump vote.” \\n“I think there’s a hidden Donald Trump vote,” Rendell told Zeoli . “All this talk about it being over and now the real contest is the Senate is going to persuade a couple of Hillary Clinton voters and Democratic voters to say ‘Well, what do I have to stand on line for an hour [to vote] for? \\nThe media has pushed rigged polls and shown their massive bias in favor of Clinton — even Rendell had to admit that the media is biased: “The majority of the media’s against Donald Trump and favors Hillary Clinton.” \\nRendell discussed the possibility that the Clinton campaign/media’s strategy could backfire: “There a lot of things that are in motion that are favorable to Donald Trump. I wouldn’t say that it’s over then. The odds are that he’s going to lose, but I wouldn’t bet my life on it.” \\nIn a further discussion about Clinton voters staying home, Rendell told Zeoli: \\nIf you’re an African-American voter and you like Hillary — because you’ve always liked the Clintons — but, you know, it’s not Barack Obama, and you read that Hillary’s got Pennsylvania locked up — the [Philadelphia] Inquirer said that the Trump team had conceded Pennsylvania this morning — you read that and you say she’s going to win anyway. ‘What do I have to stand on line for an hour?’ If I were the Clinton team, I would be desperately worried about that type of talk. Desperately worried. \\nThe media bias has gotten so bad and so blatant that even a Democrat Clinton ally had to admit it. Rendell’s point about possible voter suppression was a very interesting take; however, there’s another more sinister reason why Clinton’s camp and the media (but I repeat myself) are doing this. \\nThe Democrat National Committee rigged the primary for Clinton. If there is something set in motion to steal the election for Clinton — and given the amount of evidence we have about voter fraud it’s likely — it’s imperative for the media to set up the narrative that Clinton is going to win in a landslide. \\nIf the media is able to sell the myth that Clinton has opened a huge lead over Donald Trump, they have a better chance of getting away with stealing an election with minor resistance from the public. \\nWe’ve heard for a while that there is a potential hidden Trump vote of people who won’t say that they’re voting for him because of the massive media bias, but plan to do so in the privacy of the voting booth. \\nHopefully that holds true and the vigorous support for Trump evidenced at his rallies is able to overcome the Democrats’ dirty tricks.'"}, "time": 1742564196.7574606}