{"duration": 0.11189532279968262, "input_args": {"text": "'WASHINGTON, D. C.  —   President Donald Trump held the first National Day of Prayer event at the White House in many years on Thursday in the Rose Garden with approximately 150 guests in attendance. [The President announced his first trip overseas, which will take him to Saudi Arabia, Israel, and the Vatican. The trip will come ahead of the NATO G7. The President thanked all those gathered, spoke of the commemoration of the National Day of Prayer occurring the the White House for the first time in years, and took a moment during the course of his speech to bring the Little Sisters of the poor on stage as he spoke of his new religious freedom Executive Order.  Steven Curtis Chapman opened the ceremonies with a version of the song Great is Thy Faithfulness. He then sang the words of The Lord’s Prayer, inviting those gathered to join in singing along —  which some did. Steven Curtis Chapman singing Great is Thy Faithfulness at White House National Day of Prayer event @StevenCurtis pic. twitter.   —   Michelle Moons (@MichelleDiana) May 4, 2017,  Pastor Paula White then took to the podium thanking those cabinet members present for attending. She noted that this year the National Day of Prayer event is taking place in the Rose Garden at the White House. She spoke of the rarity of holding these prayers this day on the lawn of the White House. VP Pence introduces President Trump for National Day of Prayer @VP @POTUS @WhiteHouse pic. twitter.   —   Michelle Moons (@MichelleDiana) May 4, 2017,  Prayers were given by evangelical pastor Jack Graham to comfort those who are persecuted, that God’s love would be expressed to people. Catholic Cardinal Donald Wuerl offered prayers of God’s promises and leading, that people would walk in the full freedom of God, in the fullness of peace, in the fullness of freedom, mindful of those who do not experience the same freedom. Prayers were offered for President Donald Trump’s leadership. Jewish Rabbi Marvin Hier followed with prayers for President Trump and Vice President Mike Pence, others in the Administration, and others around the country. Vice President Mike Pence recounted the long American history of the National Day of Prayer. Every President has issued a proclamation for the day since it began, Pence noted, but not every President has held a commemoration in the Rose Garden of the White House. President Trump brings Little Sisters of the Poor on stage at National Day of Prayer event at White House #NationalDayofPrayer pic. twitter.   —   Michelle Moons (@MichelleDiana) May 4, 2017,  In his remarks Trump said: We are a nation of believers. Faith is deeply embedded into the history of our country, the spirit of our founding and the soul of our nation,” he added as he thanked the faith leaders. “As we look at the violence around the world, and believe me it’s violent  …    we realize how truly blessed we are to live in a nation that honors the freedom of worship. Today my administration is leading by example as we take historic steps to protect religious liberty in the United States of America. “We will not allow people of faith to be targeted, bullied, or silenced anymore,” said Trump. “We will never ever stand for religious discrimination. Tolerance is the cornerstone of peace. ” The President then announced his overseas trip and that he will meet with leaders from across the Muslim world in Saudi Arabia. Trump mentioned President Abraham Lincoln’s announcement of a National Day of Prayer. “It’s so great to be doing it in the Rose Garden,” Trump said as he announced the proclamation of this year’s National Day of Prayer. The crowd gave a standing ovation upon this announcement. “Freedom is not a gift from government, freedom is a gift from God,” proclaimed Trump. He referred to the founders of the country who enshrined the freedom of religion in the First Amendment. He spoke of his new executive order on religious freedom. “No American should be forced to choose between the dictates of the federal government and tenets of their faith. ” He spoke of the Johnson Amendment and the impediment it imposes on religious leaders. The President declared, “This financial threat against the faith community is over. ” He said he would sign the EO, adding, “You’re now in a position that you can say what you want to say. ” “No one should be censoring sermons or targeting pastors,” said Trump. The President called the Little Sisters of the Poor to the podium and even recognized the lawyers that have been fighting a court case for the group that has faced prosecution for noncompliance with a portion of the Obamacare mandate. The president said to them, “I want you to know that your long ordeal will soon be over. ” “God bless you and God bless America,” concluded President Trump. President Ronald Reagan held observances of the National Day of Prayer in the Rose Garden, as did President George H. Bush and George W. Bush, according to the National Day of Prayer Task Force. President Bill Clinton invited guests for prayer events at the White House on the National Day of Prayer. While President Barack Obama did sign National Day of Prayer proclamations in the standing presidential tradition, he chose “not to personally participate nor host events for the National Day of Prayer at the White House,” according to the NDOP Task Force. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742561724.8645632}