{"duration": 0.06878280639648438, "input_args": {"text": "'A group of attorneys, scholars, and advocates put their names to a letter sent to Attorney General Jeff Sessions Tuesday, urging him to take a serious look at reform as he works with the President to select a new Assistant Attorney General for his Civil Rights Division. [“During the Obama administration, the Division served purely ideological ends with rigidity unmatched in other federal offices. Entrenched federal bureaucrats jettisoned precepts like equal enforcement in favor of political and racialized dogmas with a zeal that risks litigation failure and invites court sanctions,” the letter states.  Signed by such conservative heavyweights as Kansas Secretary of State Kris Kobach, the letter paints a picture of a Division ripe for sweeping reform after eight years under Obama during which “The Civil Rights Division has relegated its leadership role to political activists. ” Hiring practices for the career staff of the Division is one of the letter’s chief concerns. While Tom Perez, now head of the Democratic National Committee, was the Assistant Attorney General for Civil Rights, the Division was the subject of an Inspector General’s review that found the Obama Justice Department’s insistence that   have a “demonstrated commitment to civil rights” led to a perception only   activists need apply. “In this case, perception and reality were synonymous,” the letter insists, noting instances in which Division employees leaked confidential information to civil rights groups, and Perez’s subsequent refusal to implement any of the report’s hiring recommendations. Also among the letter’s complaints is the alleged culture of politically motivated bullying that was fostered during the Obama years. The same Inspector General’s Report found a pattern of personal attacks against, for example, employees who were “openly Christian. ” J. Christian Adams, President of the Public Interest Legal Foundation and a signatory of the letter, added, “For years, a radicalized Civil Rights Division   advanced leftists causes with respect to voting, law enforcement, immigration, and others while constitutional Rule of Law was considered a nuisance. General Sessions has an opportunity to begin the course correction necessary to protect all Americans from civil rights abuses. ” In picking a new head for the Civil Rights Division, the letter’s signatories hope Attorney General Sessions will look for a reformer prepared to return to   civil rights enforcement and tackle the Division’s entrenched cultural problems. “The next AAG certainly cannot be a proponent of the status quo by any means,” they say.'"}, "time": 1742561627.684855}