{"duration": 0.12304401397705078, "input_args": {"text": "'WASHINGTON  —   Several of the Republican Party’s most generous donors called on the Republican National Committee on Thursday to disavow Donald J. Trump, saying that allegations by multiple women that Mr. Trump had groped or made inappropriate sexual advances toward them threatened to inflict lasting damage on the party’s image. To an elite group of Republican contributors who have donated millions of dollars to the party’s candidates and committees in recent years, the cascade of revelations related to Mr. Trump’s sexual conduct is grounds for the committee to cut ties with the party’s beleaguered   finally and fully. “At some point, you have to look in the mirror and recognize that you cannot possibly justify support for Trump to your children  —   especially your daughters,” said David Humphreys, a Missouri business executive who contributed more than $2. 5 million to Republicans from the 2012 campaign cycle through this spring and opposed Mr. Trump’s bid from the outset. Bruce Kovner, a New York investor and philanthropist who with his wife has given $2. 7 million to Republicans over the same period, was just as blunt. “He is a dangerous demagogue completely unsuited to the responsibilities of a United States president,” Mr. Kovner wrote in an email, referring to Mr. Trump. “Even for loyalists, there is a line beyond which the obvious moral failings of a candidate are impossible to disregard,” he wrote. “That line has been clearly breached. ” Mr. Kovner argued that the Republican National Committee should shift its attention to candidates who reflected its core values, like free markets and limited government. “I hope the R. N. C. sticks to candidates who articulate these principles!” he said. Outrage among the party’s largest financiers over Mr. Trump’s behavior has also stirred questions about the leadership of Reince Priebus, the national committee’s chairman, who has remained loyal to Mr. Trump even as dozens of Republican elected officials have abandoned his candidacy. Mr. Priebus told members of the committee on Monday that the party was enthusiastically supporting Mr. Trump, reassuring some of them. But to some leading Republican benefactors who have advocated a tougher line with Mr. Trump, the party should have distanced itself from his candidacy well before the publication of a recording last week in which he boasted profanely about committing sexual assault. “The R. N. C. long ago should have cut ties with Donald Trump,” said William E. Oberndorf, a California investor who has given more than $3 million to Republicans since 2012. “Reince should be fired and replaced with someone who has the competence and leadership skills to rebuild the R. N. C. ” Even some of Mr. Priebus’s longtime associates in his native Wisconsin appear to have reached their breaking point. “Reince Priebus has to ask, how much of his soul does he want to sell for Donald Trump at this point?” said Charlie Sykes, a conservative talk show host in Milwaukee, calling on Mr. Priebus to “man up. ” Mr. Sykes also alluded to Mr. Trump’s repeated denunciations this week of Speaker Paul D. Ryan  —   another Wisconsinite and a close friend of Mr. Priebus’s  —   who said Monday that he would no longer defend or campaign for Mr. Trump. At a   event in Florida on Wednesday night, Mr. Trump told donors that he did not respect Mr. Ryan. Referring to Mr. Priebus, Mr. Sykes asked, “Is he going to allow Donald Trump to throw Paul Ryan under the bus?” For all Mr. Priebus’s public expressions of loyalty, he has been deeply shaken by revelations about Mr. Trump and the rifts within the party, seeing years of Republican organizational work potentially being undone, according to multiple people who described private conversations with Mr. Priebus on the condition of anonymity. He has said he feels adrift, fearing that Mr. Trump is headed for disaster, and told one longtime associate that he was having sleepless nights. Mr. Priebus did not respond to requests for comment. The Republican financial apparatus under Mr. Priebus, sputtering since Mr. Trump claimed the presidential nomination, is wheezing painfully in the final weeks of the race. The committee’s   officials now quietly acknowledge that Mr. Trump is a thoroughly compromised candidate, party donors said, but implore potential contributors to give anyway, stressing graver concerns like control of the Supreme Court. Many donors have stopped giving, though, and some have deserted the party, including two major donors who confirmed on Thursday that they were supporting Gary Johnson, the former New Mexico governor who is the Libertarian candidate for president. Julian H. Robertson Jr. a billionaire hedge fund investor who has directed more than $5 million to Republicans since the 2012 election, is now backing Mr. Johnson, said Fraser P. Seitel, a spokesman for Mr. Robertson. And Jeffrey Yass, a Pennsylvania investor who has given more than $3 million to conservative candidates and committees, said in an email that he was “rooting for Johnson. ” Even some of Mr. Priebus’s allies believe that Mr. Trump is certain to be defeated and that it is time for the party to protect its image by disavowing him. “We’re headed for destruction,” said Al Hoffman, a former Republican National Committee finance chairman and a longtime Florida donor, who plans to host Senator John McCain of Arizona at his house for a   this week. “I just hope we can find a group of conservatives and moderates who are rational thinkers to   the party. ” But other leading Republicans believe the party has little choice but to prop up Mr. Trump, fearing that excommunicating him would be catastrophic for other Republican candidates and all but hand over control of Congress to Democrats. And in some parts of the country, Mr. Trump has been a boon to the party. “He will bring over a minimum of two state House guys and two state senators for us,” said the Pennsylvania state Republican chairman, Rob Gleason, who predicted a record presidential turnout for his party west of the Susquehanna River. While some Republican donors and elected officials have had it with Mr. Trump, another constituency dear to Mr. Priebus remains committed to the nominee: the 168 members of the national committee. In a series of emails shared this week with The New York Times, some Republican state chairmen and chairwomen and national committee members affirmed their support for Mr. Trump and saluted Mr. Priebus for standing by him. “He is our candidate,” Rosie Tripp, the Republican committeewoman from New Mexico, wrote to other members of the committee. “I am dismayed by our own Republicans who are bailing like rats off a ship. He who is without sin can cast the first stone. I am sure they are not as pure as the driven snow, either. ” Juliana Bergeron, the Republican committeewoman from New Hampshire, agreed. “There are worse things in this world,” Ms. Bergeron wrote, referring to Mr. Trump’s conduct, “and Hillary Clinton is near the top of that list. ” The views of the committee members, most of whom are party activists, not political professionals, are important because Mr. Priebus is considering running in January for another term as chairman. And when the party does not control the White House, the chairman is selected by a vote of the members. Should he seek another term, Mr. Priebus is expected to face competition from Mr. Trump’s critics as well as his loyalists. Matt Borges, the Ohio Republican Party chairman and an outspoken Trump detractor, is said to be considering the chairman’s post, as are several   officials supportive of Mr. Trump. Asked about his interest in the job, Corey Lewandowski, Mr. Trump’s former campaign manager, declined to rule out a run, saying only that he was happy in his current work as a CNN commentator.'"}, "time": 1742628402.9859958}