{"duration": 0.12394428253173828, "input_args": {"text": "'COVINGTON, La.  —   “Sour grapes,” explained Bob Marino, 79, weighing in on the recent spycraft bombshell from the corner table of a local McDonald’s. “Sour grapes,” agreed Roger Noel, 65, sitting next to him. “Bunch of crybabies,” Reed Guidry, 64, offered from across the table. The subject of conversation was the report released by United States intelligence chiefs on Friday informing   Donald J. Trump of their unanimous conclusion that President Vladimir V. Putin of Russia ordered an extensive, but covert, cyberoperation to help Mr. Trump win the election. The Russians had hacked and leaked emails, unleashed “trolls” on social media and used their “  propaganda machine” to spread stories harmful to Hillary Clinton. In Washington, the report was viewed as extraordinary, both for its timing, raising sharp questions about the  ’s legitimacy on the verge of his taking office, and for its assertions, describing the operation as Russia’s boldest effort yet to meddle with American elections, to spread discontent and to “undermine the U. S.  democratic order. ” But interviews with Trump supporters here in Louisiana, a state the   won by 20 points, and in Indiana, a state he won by nearly the same margin, found opinions about the report that ranged from general indifference to outright derision. “From the parts of the report I’ve seen,” said Rob Maness, a retired Air Force colonel who twice ran for Senate here as Tea Party favorite, “it seems silly. ” There are genuine concerns about Russia’s cyberoperations, he said, but the notion that they changed the outcome of the election was absurd. (The report made no determination on how they affected the election.) Of the comments he had seen from fellow Trump supporters on Facebook and in emails, he added, “90 percent of them are like, ‘What’s the big deal? ’” The Russians may have very well gotten involved, several people said. They added that kind of interference should be combated. But many assumed that foreign actors had long tried to play favorites in American elections, and that the United States had done the same in other countries’ elections. Even if the Russians did do it  —   which some were more willing to concede than others  —   what difference did it make? People did not need the Russians to make up their minds about Mrs. Clinton, Mr. Trump’s election opponent. Blaming her loss on the Russians was, as one Trump supporter here said, “just being sore losers. ” “I don’t think the Russians posed as big a problem to the Clintons as the Clintons posed to themselves,” said Paul Emenes, 49, while he sold ribs, shoulders and chops at a frigid outdoor farmers’ market in Covington. Russian hacking was concerning, sure, Mr. Emenes said. He added that, as long as Mr. Trump was not involved himself, “it doesn’t change the way I view him. ” Tina Gunaldo, 44, taking blankets off the citrus trees in her Mandeville, La. front yard after the previous night’s frost, had a similar attitude. “Trump is Trump,” she said. “Do I think he’s going to become more of a friend to Russia because of this? No I don’t. I think  —   I hope  —   his focus will be on making America great again. ” Ms. Gunaldo would not reveal whom she voted for, but she did say Mr. Trump’s slogan resonated with her. It apparently resonated quite widely in this parish, which he won by more than 50 points. But it was a quiet support, she said. She knew of only one yard in the whole subdivision with a sign. That yard belonged to Thurston Yates Sr. “I don’t believe it,” Mr. Yates, 78, said flatly of the intelligence report. He was standing in the yard under his “Make America Great Again” flag, which he bought at a gun show several months ago. “Why would Putin even want Trump?” Mr. Yates, who is retired from a career in pharmaceutical sales, was not concerned about what Mr. Trump might do in office, but said he was deeply alarmed about what President Obama might do before he leaves office. It was Mr. Obama who was too soft on Russia, who let Mr. Putin get away with things, Mr. Yates continued. Mr. Trump would be much tougher. But Mr. Yates then added: “Why is everybody so afraid of Russia? I’m not against Putin. ” This last sentiment was not uncommon. Even among those who were troubled by the hacks, few felt that Russia was a serious threat. The country was “a basket case,” and not the powerful foe it once was, said Mr. Marino, from his seat at McDonald’s. Others said that North Korea, the Islamic State and China were the real threats. Russia could even be a potential ally in some fights, suggested Valarie Kubacki, 54, a real estate broker in Valparaiso, Ind. Ms. Kubacki said she perceived Russia as “somewhere in the middle” between friend and enemy, but agreed with Mr. Trump that the United States could work with them to defeat the Islamic State, also known as ISIS or ISIL. “We may have to line up with people who may not be our ‘friend’ to make that happen,” she said. That those on the right seemed to be warming to Russia was not seen as a particularly unusual development, though some joked about the incongruity of the left putting such faith in the Central Intelligence Agency. As they watched their son skate with his Boy Scout group at the public ice rink in downtown Valparaiso, Monty and Mary Willis, both registered Republicans, considered the ramifications of the intelligence report. “The idea of a fair election” had been placed in doubt, Ms. Willis said. “We were concerned about money being involved in the election. Now you’re talking about espionage. ” The Willises, who both work in real estate, might be Republicans, but they were not Trump voters. In fact, they had last voted for a Republican presidential candidate in 2008, when Senator John McCain of Arizona ran. The party seemed to have changed in recent years, they said. And the incoming administration had them deeply worried. “Our president being in cahoots with the Russian government?” Mr. Willis said. “Yes, I’m very concerned about that. ” In Louisiana, David Gubert, 56,   Eagle 20 cigarettes in the cab of his pickup, with stacks of firewood for sale behind him in the bed. Like the Willises, he ruminated on what it would mean if the Russians had gotten involved, and possibly even swung the election. But Mr. Gubert came to a different conclusion. “If that’s what it took,” he said, “I’m glad they did it. ”'"}, "time": 1742563540.3019328}