{"duration": 0.06475615501403809, "input_args": {"text": "'Trump Spokesperson Katrina Pierson Caught In Blatant Lie, Threatened With Lawsuit (VIDEO) By Andrew Bradford   \\nThe Donald Trump for President campaign is filled with liars. From the candidate himself to the people who attempt to defend him on television, the default position for anyone who gets a paycheck from Trump is dishonesty. And perhaps no one better personifies this than spokesperson Katrina Pierson, who went so far on CNN this morning that she was threatened with a lawsuit. \\nPierson appeared, along with Democratic strategist Angela Rye, and Pierson began her lies by saying the American middle class is in trouble due to the economic policies of the Obama administration. Rye countered with facts : “I would like to go back to something Katrina mentioned, which was the middle class is hurting. Well I would go to what we’ve learned from the census bureau last year which is the middle class, and poor people, had the best year they’ve had ever since — in 2015. In quite some time rather. I won’t say ever. It says that real median household income was $56,500 in 2015. That is an increase from $53,700 the year prior. I would also point to you the fact that the unemployment rate is much lower than when President Obama started.” \\nThen host Carol Costello played a video clip of Trump referring to “ghettos,” and that led Rye to comment: “People like Donald Trump actually take for granted the fact that they have readily available access to capital.” \\nPierson began spitting and sputtering, so Rye told her: “I know you don’t want to hear this because the truth burns.” \\nUnable to come up with a reasoned defense, Pierson went personal, alleging that when Rye worked for the Congressional Black Caucus (CBC), she “ran (it) into the ground.” \\nRye replied: “I ran the CBC into the ground? That’s laughable.” \\nWhen Carol Costello asked Pierson exactly what she was referring to, Pierson told her : “The record is out there. Look at where the finances were.” \\nRye: “Let me just help you. Good luck with that lie. That’s crazy, what you’re talking about. That’s slander. I could sue you, Katrina.” \\nOnly problem is, if she did sue Pierson, she might not get much money. Pierson, you may recall, was arrested in 1997 for shoplifting and was also accused of illegally collecting unemployment benefits. Those who live in glass houses should never ever throw rocks at others, Katrina. \\nFeatured Image Via CNN Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742562142.5670574}