{"duration": 0.05346965789794922, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / How Spirits are Connected to Your Health – Swedenborg and Life Essential Reading Did New York Orchestrate The Asian Tsunami? By wmw_admin on October 17, 2008 \\nWith Afghanistan and Iraq already lost, the Wall Street bankers were all desperately looking for other ways to control our world, when suddenly and very conveniently, the Sumatran Trench exploded. Trick or Treat? Joe Vialls investigates 9/11 Masterminds – Explosive Connections By wmw_admin on October 7, 2011 \\nThis brilliant video investigation reveals more incriminating evidence on those behind 9/11. Includes stunning revelation on Bush cousin Jim Pierce’s role. Highly recomended Before and after the “Holocaust”: Jewish population numbers in 1933 and 1948 By wmw_admin on November 30, 2013 \\nDuring the time Hitler was supposed to have killed six million Jews — between 1933 and 1948 — the world’s Jewish population actually increased from 15,315,000 to 15,753,000 Admiral Richard B. Byrd’s, Diary Feb. Mar. 1947 By wmw_admin on December 30, 2007 \\nFact or fantasy? Admiral Richard B. Byrd’s account of his flight over the North Pole and discovery of a “land beyond the poles” is legend. For those still unfamiliar with it we present his classic account and leave you to decide Evidence: Syria Gas Attack Work of U.S. Allies By wmw_admin on August 28, 2013 \\nClear and conclusive evidence that ‘Syrian rebels’ were behind the chemical weapons attack — not the Syrian Army — using toxins supplied by Saudi Arabia. Includes videos Six Million Jews 1915-1938 By wmw_admin on March 4, 2013 \\nYears before Hitler and WWII the iconic figure of six million Jews was being widely promulgated. Here are a few examples Horrifying US Secret Weaponry Unleashed in Baghdad By wmw_admin on September 1, 2003 \\nDU was bad enough, but reports filtering out of Baghdad suggest US forces used a new type of weapon to capture the city. This is the real story behind the fall of Baghdad and it truly is the stuff of nightmares The true inside facts about the 7/7 London bombings By wmw_admin on January 21, 2008 \\nWhat this website has long suspected has been confirmed. James Casbolt, himself a former MI6 operative, gets the inside story from a disaffected member of British Intelligence on who was really behind the 7/7 bombings and why\""}, "time": 1742562170.2297728}