{"duration": 0.031623125076293945, "input_args": {"text": "'0 Add Comment \\nYOU may be considering joining the ranks of the gardaí, teachers, nurses, doctors, bus drivers, stamp lickers, door holding openers, jar openers, cat flap installers, milk men, hat wearers and human taxidermists and commencing strike action some time soon. And WWN is here to tell you that’s exactly what you should be doing! \\nWe have a list of 5 reasons you should be withdrawing your labour until the government or your employers give in to your demands. \\n1) Just think of all the cool shit you could be buying \\nWith that little extra bit of cash, you could buy a giant inflatable kangaroo. It would be a terrible waste of money and you’d regret it, but if you went on strike and secured some extra wonga this is the kind of shit you could do. Paying off debt, plugging holes in your pension and savings, feeding your family…could be a whole lot more fun with a giant inflatable kangaroo! \\n2) Everybody’s doing it \\nCome on, you don’t want to miss out, do you? Cool people don’t miss out, you’re a cool person, right? If you’re not part of a union or even if you’re happy with your pay and working conditions, a day off or two could be fun. Shouting while holding signs up is actually quite therapeutic too. \\n3) You don’t want to miss out \\nRemember, back in the Celtic Tiger days, right at the end of it all when all manner of people were being blamed and vilified for contributing to the downfall of an economy and nation? You don’t want to miss out on being part of that for the first time or for nostalgia’s sake if you’ve done it before, being part of something big is a really fulfilling experience. \\n4) Did we mention sweet, cold hard cash? \\nWhile no one can estimate just exactly how many days you will have to strike for, but trust when we say after 6,7 or 8 years of cuts and increases in the cost of living you’ll be right on track to earning almost as much as you once did. Result! \\nOh, you’re a TD \\nRight, yeah, got ya. Loud and clear. Sure, why would you strike? You get a pay rise even though you didn’t even ask for one. No, fair play, you lot have it sussed. Our bad.'"}, "time": 1742628449.355316}