{"duration": 0.03188037872314453, "input_args": {"text": "'The Federal Bureau of Investigation (FBI) website content devoted to criminal gangs operating in the United States includes staggering figures about these groups’ presence and criminal activities across the country. [“Some 33, 000 violent street gangs, motorcycle gangs, and prison gangs with about 1. 4 million members are criminally active in the U. S. and Puerto Rico today,” the FBI reports. “Many are sophisticated and well organized all use violence to control neighborhoods and boost their illegal   activities, which include robbery, drug and gun trafficking, prostitution and human trafficking, and fraud. ”  “Many gang members continue to commit crimes even after being sent to jail,” the FBI reports. The 1. 4 million figure for the number of gang members is as big or bigger than four of the Top 10 largest cities in the U. S.  —   San Antonio, Texas, 1. 3 million San Diego, California, 1. 3 million Dallas, Texas, 1. 1 million and San Jose, California, 945, 942. The FBI has numerous entities working to combat the gang problem, including the Safe Streets Task Forces, the National Gang Intelligence Center, and Transnational   Task Forces. The NGIC, established by Congress in 2005, “integrates gang intelligence from across federal, state, and local law enforcement on the growth, migration, criminal activity, and association of gangs that pose a significant threat to the U. S. ” That intelligence reveals that the “Mara Salvatrucha ( ) and 18th Street gangs continue to expand their influence in the United States, while transnational (operating across national borders) gangs are present in almost every state and continue to grow their memberships, now targeting younger recruits more than ever before. ” The FBI’s transnational   task forces operate in El Salvador, Guatemala, and Honduras, according to the FBI website. President Donald Trump said in April that his administration is cracking down on violent gangs operating in the U. S. “They are getting the hell out or they are going to prison,” Trump said in an interview with Fox and Friends. Trump praised Department of Homeland Security Secretary John Kelly for enforcing the laws. “I will tell you we have gotten tremendous criminals out of this country,” Trump said. “So many towns and cities are thanking me because we have gotten rid of a burden that you would not believe,” he said. Texas Gov. Greg Abbott announced in April the expansion of the Texas   Task Force (TAG) and the creation of a technical operations center in response to a sharp increase in rape and murder in the Houston area by violent gangs. Abbott and Texas Department of Public Safety Director Steve McCraw singled out   and its connection to human smuggling, drug trafficking, murder, and rape during the announcement. “This recent wave of senseless violence cannot continue,” Abbott told reporters at a press conference attended by Breitbart Texas. “Government’s foremost responsibility is to keep our citizens safe and secure,” Abbott said. “Texas will take action and use all lawful means to put an end to this lawlessness. ”'"}, "time": 1742628522.8644571}