{"duration": 0.04541659355163574, "input_args": {"text": "'Vicar sacked over orgies, hookers & porn after wife exposes his double... Vicar sacked over orgies, hookers & porn after wife exposes his double life By 0 41 \\nA sex addict Church of England vicar who took part in orgies, visited gay saunas and collected “perverted” pornography has been sacked after his estranged wife exposed his double life. \\nReverend James Day’s actions amounted to “conduct unbecoming and inappropriate,” a Church of England tribunal found. It has banned him from ministry for life. \\nRead more \\nSpeaking at the tribunal in London, Birte Day said she had collected evidence showing her husband had taken part in group sex, attempted to set up meetings with prostitutes and used a fake name to meet new partners. \\nShe said her husband had stored “a substantial amount” of porn on his computer, which she collected on memory sticks presented to the tribunal, according to the Telegraph. \\n“There were about 50 short films of men and women in scenes of sexual pleasure and orgies, at least 100 sketches of naked women being tortured and burned, a scene of a gladiator being hit and tortured, many images of naked young men… and other sexually explicit material.” \\nShe said her husband became increasingly open about his “sexual addiction,” adding: “He often said the two most important elements in his life were God and sex.” \\n“I think James wanted to hurt me with his sexual activities and was making me feel guilty as I was just ‘not good enough,’” she said. \\nRead more \\nThe hearing was told the vicar had also been violent towards his wife – tightening a scarf around her neck so she couldn’t breathe, spanking her as punishment for wearing shorts in front of workmen, biting her hand and spitting in her face. \\n“I had to protect myself by gathering evidence to show that he was not normal, because to others outside the marriage he projected himself to be a successful and respectable person,” his wife said. \\nShe also referenced an email she had found from Day – who is also a psychology professor – to his friend. He wrote: “You must never desist on account of my priesthood and all to do with vocation … Perhaps I should send you photos from a gangbang I participated in … to assuage your guilt.” \\nHis wife also found business cards suggesting Day was visiting gay saunas in Brussels, New York and Italy. He had also created email addresses for himself under different names and identities. \\nThe Bishop’s Disciplinary Tribunal for the Diocese of Europe concluded Day’s behavior was not criminal – but that standards for clergy “must be different.” \\nIt said it was satisfied the assaults on his wife took place, adding the allegations made against the priest were proved in their entirety. \\nDay did not attend the tribunal but did not contest the proceedings. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742563429.6104908}