{"duration": 0.04759550094604492, "input_args": {"text": "'Home » Silver » Silver News » It’s Only A Matter of Time: THIS Is What Will Cause Gold Prices to Move in 2017 \\n“If The Fed Has to Hike Interest Rates to Control Price Inflation, It’s GAME OVER!” \\nAlasdair MacLeod Joins Us From London to Warn“Its Only A Matter of Time”: THIS Is What Will Cause Gold to Move in 2017: \\nMacLeod Joins Us For A Crucial Market Update, Discussing: \\nNo Gold and Silver Correction in Pound Sterling – Gold ROARS in 2016 Risk of Price Inflation Driven By MASSIVE Monetary Inflation – Signs Indicate It’s Already Beginning! MacLeod Makes The Case for Gold – Inflation Will Arrive in 2017 – Complete Replica of 1970’s Stagflation! Alasdair Explains Why Just 3% Inflation in America Could Trigger Banking Crisis and Financial Collapse! We’re In a Depression! If You Subtract Inflation, GDP Has Subtracted Ever Since the Lehman Crisis! \\nDOC’S GOLD & SILVER MARKET UPDATE: After delays reported at most of the AP’s and wholesalers on nearly all gold coins with gold’s dip under $1250, tightness in the physical gold market eased this week and most gold bullion investment coins and bars became readily available again at the wholesale level. \\nThe Wholesale Silver Market Remains Tight, Mostly Unchanged: \\n\\nWholesale premiums rose again slightly on 90% Junk Silver Coins this week, with supply remaining scarce and delayed. \\nAfter reporting whopping sales last week of nearly 1.5 million 2016 Silver Eagles coins, the Mint reported only 250,00 Silver Eagles sold this weeking, bringing October Silver Eagle coin sales to 3,675,000, and Year to Date Sales to 34,250,500. \\nThe Sunshine Mint has finally caught up on production of SD Bullion’s most popular silver round, the Sunshine 1 oz Walking Liberty rounds which is now back in stock after experiencing 3-4 week delays in early October. \\nNo major changes to report for the rest of the wholesale silver market over the past week.'"}, "time": 1742562067.5968895}