{"duration": 0.09686779975891113, "input_args": {"text": "'MANILA  —   Samsudin Dimaukom, the mayor of a town in the southern Philippines, was watching television last Sunday after midnight when he was startled to hear the country’s new president call out his name. It was no honor. President Rodrigo Duterte was reading a list of more than 150 officials he said were involved in the illegal drug trade. He ordered Mr. Dimaukom and the others to turn themselves in within 24 hours or be hunted down. “We were really surprised when the president came out to announce it,” Mr. Dimaukom, the mayor of Datu   said by email. “Not once were we involved in drugs. In fact, we were fighting drugs. I support the president’s drug war. ” Since he took office six weeks ago, Mr. Duterte, 71, has roiled the nation with a violent war on drugs that has left hundreds dead, most of them poor and powerless. This week, in what seemed to be a new phase, he took on judges and police generals, military officials, more than 50 mayors and local officials, and three men said to be current or former members of Congress. He stripped them of their weapons permits and, in some cases, their government security details, potentially leaving them vulnerable to vigilantes. The escalation provoked a clash with the Supreme Court, nearly causing a constitutional crisis before Mr. Duterte backed down, and it has raised questions about the list, a McCarthyesque device of uncertain origin and unencumbered by evidence. “How are the lists being prepared?” asked Senator Leila de Lima, a former justice secretary and former chairwoman of the Philippine Commission on Human Rights. “Who are the sources? If they have evidence, they should file charges, and that’s the only time they should disclose the name. ” But if anything, the campaign has made him only more popular. His approval ratings soared to 91 percent in July, according to a Pulse Asia poll, far higher than the 39 percent of the vote he received on Election Day in May. Even some people who have been killed by vigilantes were wearing    “Duterte” wristbands when they were gunned down. “He’s doing what he promised,” said Ramon Casiple, executive director of the Institute for Political and Electoral Reform. “He’s not surprising anybody. People like him because he is an action man. ” Mr. Duterte, a combative former mayor and prosecutor, has repeatedly called for the killing of drug dealers, and an estimated 800 people have died at the hands of police or vigilantes since his election, officials say. Many were gunned down in the street and left with a cardboard sign identifying them as drug pushers. Such killings have become known as “cardboard justice. ” More than 600, 000 drug users and dealers, fearing for their lives, have turned themselves in, the authorities say. Most have been sent home after giving the police a statement and are likely to face investigation later. But his clash with public officials has been less  . On Monday, Chief Justice Maria Lourdes Sereno of the Supreme Court challenged the president over the seven judges on his list, telling them not to submit to arrest without a warrant. The court also announced that it would investigate any allegations of the judges’ connection to the drug trade. “To safeguard the role of the judges as the protector of constitutional rights, I would caution them very strongly against ‘surrendering’ or making themselves physically accountable to any police officer in the absence of any   warrant of arrest,” Justice Sereno wrote. Mr. Duterte angrily warned her not to interfere with his campaign to bring an end to what he calls the “pandemic” drug problem in the Philippines. In a speech at a military camp on Tuesday, Mr. Duterte said she “must be joking” by demanding arrest warrants, which he said could take months to obtain. And he warned her not to create a crisis “because I will order everybody in the executive department not to honor you. ” “Please, don’t order me,” he said. “I’m not a fool. If this continues, you’re trying to stop me, I might lose my cool. Or would you rather I declare martial law?” But on Thursday, Mr. Duterte apologized, saying he never intended his “harsh words. ” He said he had been moved by “the magnitude” of the drug problem and was seeking to solve it within his authority as president. At the same time, questions were being raised about the list of names that Mr. Duterte read on national television and the death threat it carried. Critics pointed to flaws in the list and questioned whether it had been properly vetted. Justice Sereno said that only four of the seven judges on the list were still on the bench. One of them died in 2008. Another was dismissed in 2007. Jeffrey Celis, who was listed as a congressman, never served in the body, according to the local news media. Many of the elected officials quickly denied any involvement in the illegal drug trade. Some volunteered to take drug tests. One vice mayor said he had been the victim of mistaken identity it was probably his brother the police were after, he said. Mr. Dimaukom, the Datu   mayor, said he had been wrongly placed on the list because of false accusations spread by political rivals. Mr. Duterte acknowledged that some names might be on the list by mistake. He said he would take responsibility for anyone who was wrongly accused, although what action he would take was not clear, particularly since the list might be seen by vigilantes or the police as a license to kill. Dionisio Santiago, former head of the Philippines Drug Enforcement Agency, said in an interview that the list was similar to one prepared by his agency that he presented in 2010 to the president at the time, President Benigno S. Aquino III. Mr. Aquino, he said, took no action. Mr. Santiago said some people might have been placed on the list erroneously or because of a grudge. But he said most of the list was accurate, and he defended the inclusion of deceased officials. “Does being dead exonerate you?” he asked. “Dying does not erase your reputation. ” The police said that most of the people the president named had reported to the authorities as he demanded. Mr. Duterte’s presidential immunity may shield him from any repercussions, which is fine with his supporters. “The president’s public shaming of government officials involved in the illegal drugs trade is the best use of the presidential immunity from suit in our history,” Representative Danilo Suarez, the minority floor leader in Congress, wrote in The Manila Standard. Ms. de Lima, who leads the Senate committee on justice and human rights, said the committee would hold hearings this month on the wave of extrajudicial killings. “He’s now a runaway train,” she said. “It’s very revolting to me. So far, the victims of the summary killings are the lowly ones, the powerless, who cannot afford lawyers, who cannot seek audiences with the president. ” Despite Mr. Duterte’s threat, so far that fate has not befallen the officials, suggesting that despite his bravado, he may not want to unleash a civil war. In Datu   a town of about 20, 000 people, Mr. Dimaukom said he was not worried about an investigation. “First, our defense is the truth,” he said. “If you are not guilty, why should you be afraid?” But he was taking no chances. The morning after the list was announced, he reported to the local police, then flew to Manila, the capital, to meet with officials there.'"}, "time": 1742564261.3284733}