{"duration": 0.05016660690307617, "input_args": {"text": "'A family has suffered injuries described as “ ” after ‘strong acid’ was thrown at a two year old boy and his parents on a street in North London. [Emergency services were called to a residential street in Islington on Saturday just after 1 pm following reports of an assault, where they found a 40 year old father, 36 year old mother and their young son suffering effects of having a “noxious’ acid thrown at them.  Acid was thrown at the man, in the attack on Copenhagen Street, with the substance then splashing onto a woman then the child, according to The Sun. All three were taken to hospital by ambulance, and the child found to have slight chemical burns to his face, after firefighters at the scene used water from a hose to cool down the family’s burns. But his father’s injuries were described as “ ” and both parents suffered 15 per cent chemical burns on their hands and bodies as a result of the attack. Shop owner Murat Kayran said: “They were a Chinese family, a woman frantically ran in here when it happened and said ‘there’s been an acid attack’. “She bought one bottle at first and then after that bought three more bottles of 1. 5l water to pour on the man’s burns after a person threw acid in his face. “Then a gentleman came in and bought another three. “About five minutes later and ambulance and police cars turned up, as well as the fire brigade. “It’s such a scary thing to happen” he told the Sun. Authorities have now launched an investigation into the alleged assault and to ascertain exactly what the substance used was. “Tests have found a strong acid and oxidising substance” said a London Fire Brigade (LFB) spokesman of the unknown liquid, which examinations showed to have a PH level of 1. Appealing for witnesses Saturday, a spokesman for the Met Police said: “Three people  —   a man, woman and a    boy  —   were found with injuries consistent with a noxious substance being thrown. “The woman and child suffered minor injuries. The man’s injuries are not being treated as life threatening, however we await an update as to whether they are  . “Enquiries are ongoing to establish the full circumstances and ascertain what the substance is. ”'"}, "time": 1742628361.5437944}