{"duration": 0.122406005859375, "input_args": {"text": "'At the third debate, Donald Trump was asked if he would accept the results of the election. Trump responded that he would have to look at the process to determine if everything was done fairly before he could accept it. The media went berserk claiming that Trump was undermining democracy. But is the US system really rigged? And if it is, can Trump overcome it?\\nWhy rig the system? The elite realize that their time is short.\\nWoe to the inhabiters of the earth and of the sea! for the devil is come down unto you, having great wrath, because he knoweth that he hath but a short time. Revelation 12:12\\nIt is human nature to want to accumulate wealth. It is also human nature to want to keep what you have. One of the ways that the wealthy do that is through influencing the political process to ensure it is favorable to them. A democratic republic is particularly easy to influence. The wealthy elite can “buy” candidates through donations to them or to their superpacs. They can make voting patterns more favorable to them by changing the country’s demographics. Or they can influence voters through the supposedly unbiased news media that they control. In the US, the wealthy elite use every one of these levers to rig the system.\\nFor example, liberal voters often favor a progressive tax system where high earners pay greater percentages than those who earn less. It sounds like a populist policy but it is not. Progressive taxation is put in place to prevent middle class people from rising into the ranks of the truly wealthy who have already accumulated their wealth and are taxed at the much lower capital gains rate. Progressive taxation keeps the rich on top and keeps the plebs down. That’s why no matter which political party is in power, we are still stuck with progressive taxation.\\nEverything goes well as long as both parties don’t rock the boat. But once you get a true wildcard like Trump, the system must spring into action to stop the threat to the established order. That’s what we are seeing now. The elite are using every tool in the arsenal of the rigged system to ensure Trump does not upset their gravy train. The elite sense their time is short.\\nVoter Fraud \\nThe first way in which the election is rigged is through voter fraud. In his Gettysburg address, Trump outlined some of the ways in which this occurs:\\nAccording to Pew, there are 24 million voter registrations that in the US that are either invalid or significantly inaccurate. 1.8 million dead people are registered to vote, and some of them are voting. I wonder how that happens? 2.8 million people are registered to vote in more than one state. These are numbers folks. These are numbers. 14% of noncitizens are registered to vote.\\nLiberals always object to any sort of voter identification requirement. They say that it negatively affects minority voters, who may not have any identification. But this is obvious nonsense. The real reason liberals oppose voter identification is because it would make voter fraud more difficult.\\nBy raising concerns about voter fraud, Trump is firing a warning shot. He is saying that he will fight voter fraud, unlike prior GOP candidates who preferred defeat to calling out cheating by the other side. Simply putting the Democrats on notice may cause them to cheat less than they would have otherwise. The only question is whether Trump will be able to muster enough votes to overcome the amount of cheating that will take place.\\nThe Lügenpresse \\nA second way that the system is rigged is through the legacy news media. These include the three oldest television news networks (ABC, CBS, NBC) as well as the newer ones (CNN, MSNBC, Fox). It also includes the remaining newspapers, especially the New York Times, Washington Post, and the Wall Street Journal. Of these, the only ones that are reliably conservative are Fox and the WSJ, both of which are owned by Rupert Murdock. But even here, it is more accurate to call Fox and the WSJ “neoliberal” rather than conservative as they both push the globalist message of open borders and unenforced trade.\\nTrump is very media savvy. He’s been in the public eye since the 1980s and his philosophy has been that no publicity is bad publicity. Trump has used this to highlight his policies. By making controversial statements, he has been able to force the media to cover his positions. Still, the nonstop smear campaign has hurt Trump’s numbers particularly among older voters who still get their news from legacy sources.\\nNew media outlets like Return of Kings, Breitbart, and Danger & Play have been more favorable to Trump but the most highly funded new media such as Daily Beast, Heat Street, Buzzfeed, and Huffington Post all push the globalist message. The end result that Trump is fighting an ocean of disinformation with only a handful of allies by his side.\\nVoter Discouragement Fivethirtyeight doing its best to discourage Trump voters.\\nAnother way that that system is rigged is that the legacy media conspires to discourage Trump voters from going to the polls. One way they do this is to over poll Democrats to make it look like Trump is losing. For example, one recent poll placed Hillary 12 points higher than Trump. But even Obama was only able to beat McCain by 7 points even though he was packing stadiums of 70,000 people. And Hillary doesn’t command the sort of adulation that Obama did in 2008.\\nThere is a huge motivation gap between Trump and Clinton. Recently, Trump held a rally in Tampa where 28,000 people showed up. Some of these people waited in line for 12 hours for the chance to see Trump. A day later, Hillary hosted a rally in Florida where only 1000 people showed up. And some of those were likely paid plants. Her running mate Tim Kaine did even worse barely getting 30 people to show up for one of his events.\\nOne day before the Brexit vote, polls showed Remain leading by 10 points. Leave ended up winning by 3.5 points.\\nWhy does the legacy media report polls that show Trump losing by a landslide? Because it is designed to dishearten Trump voters.\\nConclusion Will Trump be able to overcome the rigged system? It will be a heroic achievement if he does. One thing is certain: This is not the time to give up but to fight with all of our might. The elites want us to be discouraged, to give up hope, to lie down and die. That is the one thing we will never do. Even if the host of hell rise up to oppose you, go to the ballot box on November 8th. Regardless of what you may hear otherwise, your life will be very different under President Trump than it will be under globalist pawn Hillary.\\nWin or lose, our battle to bring back the patriarchy will not end on November 8 th . A Trump victory would give us breathing room to start restoring our society in the open. A Hillary victory, heaven forbid, would signal that our work will need to be underground. Either way, our battle is just beginning. In future columns I will outline the way forward for traditional men.\\nRead More: Did George Soros Rig The Utah Vote To Help Ted Cruz Defeat Donald Trump? \\n'"}, "time": 1742564504.6929328}