{"duration": 0.04985666275024414, "input_args": {"text": "'Monday on Fox Business Network’s “Varney  Company,” conservative columnist and “In Trump We Trust: E Pluribus Awesome!” author Ann Coulter said if President Donald Trump does not keep his campaign promises, Democrats will take control of the House of Representatives in the 2018 midterm elections and then attempt to impeach him.  Coulter said, “I love the tweets. Almost everything that everyone else dislikes about Trump are what I consider his strong points. I love his tweets. That is how he defends himself. I love that he had steak —  he brought his own steak to Saudi Arabia —  everything others attack him for. What I’m concerned with —  I’m not —  I mean, we had no choice. What were you going to do, vote for Rubio? No. Both political parties for years and years have been pushing whatever Wall Street and elites want. Trump was the only candidate who is going to put Americans first. I just want him to get back to his campaign promises, but I love his 3 a. m. tweets. I think they’re hilarious. ” “I hope Trump notices that if he doesn’t keep his promises, Republicans will be wiped out in the midterm election,” Coulter warned. “Democrats will have the House of Representatives, and they will absolutely impeach him. It doesn’t matter. He could be purer than Caesar’s wife. They will impeach him. The   base is obsessed with that. So Trump better keep his promises. ” She added, “I blame the Republicans in Congress the most, but we always knew that. I know they were traitors again, working for the lobbyists, the Chamber of Commerce and Wall Street, and not for the American people. We knew that Trump would have a tough road to hoe, but he was supposed to go down and be a bull in a china shop. We’re still waiting for the bull in the china shop. I mean, there is obviously still time. It has only been a few months now, but so far, that budget deal, it was, it was like a George Soros practical joke. I mean, sending Washington bureaucracy $18 million to study misogyny in the Marines, funding for a wall specifically prohibited, funding for, you know, Planned Parenthood. No, this isn’t what we voted for, And I do think Trump meant what he said. You wouldn’t go through what he went through for 18 months, being attacked by both political parties, the entire media, the Washington bureaucracy, it is tough when he is up against. It’s what he promised. That is what we want. ” (  Grabien) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742628373.306628}