{"duration": 0.047695159912109375, "input_args": {"text": "'How Deep Will Trump’s Truths Go?   \\nDonald Trump will often be mocked in the coming months as the anti-elitist, anti-establishment disruptor of politics who wants to lower taxes on the elite and who is not above hiring establishment figures such as Republican National Committee Chairman Reince Priebus for his team. The mockery will mostly be misplaced simply because the terms “elite” and “establishment” are understood too broadly: Trump’s movement was only against certain forms of establishment elitism which have nothing to do with wealth, membership in a party hierarchy or even political experience. -Bloomberg \\nIn this editorial we learn that Trump voters were against America’s intelligentsia. These are the people who occupy the bureaucratic rungs in Washington and the tenured chairs in top universities. \\nThese are the people as well that cluster in New York, Los Angeles and Washington. They move back and forth between corporations and “public service.” \\nThese are the folks that set the tone for the cultural attacks that are ruining the United States. These people, as well, constitute the ranks of globalists. Much of what they want for America is intended to destroy it. \\nMore: \\nWhen Trump supporters think about the “elite” or the “establishment” what they really mean is America’s intelligentsia. \\n… Collectively, they — we — were seen as an entrenched, closed, arrogant group that sees fit to tell people what to say and think. \\n… This is the same understanding of “elite” and “establishment” that informed Ayn Rand’s “Atlas Shrugged”: The Trumpists share Rand’s exasperation with teachers, writers and bureaucrats and their fake recipes for social justice, as well as her admiration for the rough but creative doers, the titans of business. \\nOf course this is nonsense, and in fact these perceptions are exactly what’s wrong with Rand. \\nShe saw the world as a place where “doers” were hemmed in and pulled down by their inferiors. \\nBut today’s world is not like that. In fact, one can make a case that the industrial revolution – filled with doers – eradicated an independent peasantry whose lives were a good deal freer than ours today. \\nThe problem with the modern world is simple. It is in the grip of a great conspiracy, the likes of which have probably never occurred on this scale in human history. \\nThe conspiracy is apparently run by a few people who have inherited control central banking around the world and thus are worth trillions. \\nWith this money they have created an almost seamless web of propaganda intended to frighten people and drive them into the arms of international government. \\nThe goal is a single world order with one justice system, one central bank, one currency, one civil police force, etc. \\nThis Bloomberg article is focused not on the top people in this conspiracy but on the “little people” who do the bidding of higher ups and have learned how to survive in an internationalist environment and profit from it. \\nBut in our view, these are probably NOT the people that Trump’s voters really voted against. Many of Trump’s voters, like Trump himself, understand that the problems go far beyond academics, bureaucrats and corrupt tycoons. \\nIn fact, this Bloomberg article is a perfect example of a kind of elite propaganda. It is trying to convince us that we need to “listen” to the anger of Trump voters and then, we are instructed, the intelligentsia needs to react. \\nAmerican intellectuals may violently disagree with the average Trump voter on most things. They may have access to facts that prove that voters wrong. But there’s no way they — we — can go on dismissing and ridiculing these people without dooming themselves to irrelevance and provoking further backlash. \\nThis is in fact the fondest hope, no doubt, of those tasked with defending the REAL culprits from exposure and attack. Such individuals are the ones running the world’s largest corporations and leading the most powerful nation states. \\nAnd these individuals may be found in higher places still, plotting the propaganda that the rest of us imbibe. Also managing central bank strategies and even plotting our gradual progress toward a new world war. \\nThe Bloomberg article ends by suggesting that a lot of the irritation of Trump voters is aimed at political correctness and that the US needs “an open conversation about what ails it, not … one that tiptoes around speech taboos about racism, misogyny and sexual discrimination.” \\nOnce more – hooey. Our guess is that like Donald Trump himself, many of his voters – perhaps tens of millions are quite aware that the world’s problems extend far beyond political correctness and “intellectuals.” \\nOf course we’ll have to wait and see. But Trump called InfoWars to thank them for their support, and InfoWars, for all its controversy, has provided a good deal of reality about the way the world works. \\nIf Trump intends to educate people about the real “conspiracy” – a banking conspiracy located, to begin with, in London’s City – then fairly powerful truths will need to be spoken. \\nIt is quite likely these truths, once uttered, will find a sympathetic audience with many of Trump’s supporters. This isn’t what Bloomberg is hoping for, however. Bloomberg, as this editorial shows, wants a conversation focused on debunking political correctness and bringing America’s – and the West’s – intelligentsia to heel. \\nConclusion: Will Trump’s victory provide us with larger truths, or will the conversation be bogged down and trivialized? This is an important question. We can see the answer Bloomberg hopes for. We hope for something more fundamental.'"}, "time": 1742628591.622318}