{"duration": 0.04778790473937988, "input_args": {"text": "'WASHINGTON  —   President Obama poked fun at Hillary Clinton’s lack of appeal among young people Saturday night, joking at the annual White House press corps dinner that Mrs. Clinton was like an aging relative who cannot figure out how to use Facebook. “Did you get my poke? Is it on my wall?” he said, imagining Mrs. Clinton trying to use the popular social media site. “I’m not sure I’m using this right. Love, Aunt Hillary. ” Mr. Obama also needled Mrs. Clinton for paid speeches she gave for Goldman Sachs. He noted that if his comedy routine, during his final appearance at the White House Correspondents’ Association dinner, was successful, he could earn “serious Tubmans”  —   a nod to Harriet Tubman, the American abolitionist whose image will be printed on future $20 bills. He referred to Senator Bernie Sanders, who was in the audience, as “comrade,” a reference to his political status as a democratic socialist. But the president reserved his most biting commentary for the Republicans running for president, repeatedly turning to the party’s chaotic nominating contest for comedic fodder. Mr. Obama mocked Senator Ted Cruz for calling a basketball hoop a “basketball ring” while campaigning in Indiana. “What else is in his lexicon?” Mr. Obama asked, working hard to contain a broad smile. “Baseball sticks? Football hats?” He paused, then added: “But sure, I’m the foreign one. ” The president showed a picture of Gov. John Kasich of Ohio eating pancakes as he noted that “some candidates aren’t polling high enough to qualify for their own joke tonight. ” And he tweaked Republicans in the audience for their search for an alternative candidate, noting that the options for dinner were steak or fish. “A whole bunch of you wrote in Paul Ryan,” he said. “You may not like steak or fish. But that’s your choice. ” And then there was Donald Trump. Mr. Obama riffed at length about Mr. Trump, the     who was not in attendance. The president wondered aloud why Mr. Trump had chosen not to be there. “You’ve got a room full of reporters, celebrities, cameras, and he said no,” Mr. Obama said. “Is this dinner too tacky for the Donald?” He joked that Mr. Trump had some foreign policy experience because “he has spent years meeting with leaders from around the world: Miss Sweden, Miss Argentina, Miss Azerbaijan. ” And he noted that Mr. Trump may be the best person to succeed in closing the prison at Guantánamo Bay, Cuba. “Trump knows a thing or two about running waterfront properties into the ground,” Mr. Obama said. The president delivered his remarks with deft comic timing in a lengthy monologue that was both ironic and introspective. Members of the news media did not escape the president’s acerbic sense of humor. He joked that the movie “Spotlight,” about The Boston Globe’s investigation into sexual abuse by Catholic priests and holding the powerful accountable, was “the best fantasy film since ‘Star Wars. ’” And he tweaked the news media for giving Mr. Trump “the appropriate amount of coverage, befitting the seriousness of his candidacy. ” Mr. Obama’s most personal jab at a journalist was aimed at Jake Tapper, the host of “The Lede” on CNN. He noted that several journalists had left the White House beat in recent years, and then added: “Jake Tapper left journalism to join CNN,” prompting Mr. Tapper to raise a wine glass. As has been his habit, Mr. Obama made fun of himself. He joked about his age  —   and the common maladies that afflict men over 50  —   suggesting that he felt far older than he did when he became president. “Hillary once questioned whether I’d be ready for a 3 a. m. phone call,” he recalled. “Now I’m awake anyway because I’ve got to go to the bathroom. ” He also noted that he had spent two days in London recently having lunch with Queen Elizabeth II, playing golf with Prime Minister David Cameron, and seeing a Shakespeare performance at the Globe Theater. “Just in case anyone is debating whether I’m black enough, that should settle the debate,” he said. Perhaps the most surprising moment of the president’s appearance came in a video produced by the White House showing Mr. Obama considering how to spend his time after leaving office. In the video, Mr. Obama first turns to Vice President Joseph R. Biden Jr. for advice. But then the president decides to call someone else for help  —   former House Speaker John A. Boehner, a Republican who was once a fierce adversary. The video shows the president and Mr. Boehner sitting in the White House movie theater watching the ending of “Toy Story. ” Mr. Boehner notes that he finally got the “grand bargain” that had eluded the two leaders during budget talks. “On a sweet Chevy Tahoe,” Mr. Boehner says, pulling out a pack of cigarettes and offering one to Mr. Obama, who has spent his presidency chewing nicotine gum to try to kick his smoking habit. The president’s eyes go wide. Mr. Obama closed his appearance on a serious note, saluting Jason Rezaian, the Washington Post reporter who had been held in an Iranian prison, and who attended the dinner Saturday night. He promised that his administration would “continue to fight” for journalists held against their will. And he praised the Washington press corps for trying to resist the commercial pressures to dumb down journalism, saying that “there are so many of you who are pushing against those trends. ” He then offered just two words: “Obama out. ” He dropped his microphone, and turned from the podium.'"}, "time": 1742628598.0983846}