{"duration": 0.574765682220459, "input_args": {"text": "'Email \\nJACKSONVILLE, FLORIDA — President Obama arrived here on Thursday to encourage black Americans to go vote for Democrat nominee Hillary Clinton, but many black Americans — including progressives and prominent voices in Jacksonville — are not buying. Even among black Obama supporters, enthusiasm for Clinton is low to non-existent. And despite the false and potentially racist image painted by the establishment media of a collectivist “black vote” that belongs to Democrats by right, black leaders from across the political spectrum tell The New American that black Americans, like all Americans, are waking up to “crooked Hillary.” One progressive black leader even described Clinton as a psychopathic anti-Christian criminal who represents a mortal danger to blacks. Many black leaders want Clinton jailed. And the feeling is apparently widespread. \\nClinton, Obama, and the Democrat Party all understand how crucial black voters are to their radical agenda and their hold power. A leaked 2007 memo from now-disgraced Clinton campaign boss John Podesta to a group of far-left billionaires, for example, describes blacks as the “most reliable bloc in the Democratic camp,” and urges continued reliance and exploitation of “minority” groups and “demographic trends.” Sounding the alarm as he visited North Carolina and Florida to try to get black voters out to the polls to pull the lever for Clinton, Obama warned that the “black vote,” as if there were just one collective mass of blacks who all belong to Democrats, “is not as solid as it needs to be” for Clinton to win. Bill Clinton has expressed similar sentiments. And the hysterically pro-Clinton establishment media appears to be in a panic. \\nAnd there is a good reason for that. Indeed, while black voters came out in massive numbers to vote for Obama, early-voting data indicates that Clinton is struggling — big time — with the same demographic. The New American reached out to a number of prominent black Americans for comment on Clinton to see what they were thinking and whether black Americans could, should, and would support her campaign. \\nKen Wood III : \\nIn Jacksonville, where Obama went this week to try to get blacks to the polls, Kenneth Wood III, who retired from the U.S. Navy and now does a radio show, blasted Clinton and the Democrat Party. “She is the most corrupt criminal to ever run for office,” said Wood, who is also an ordained minister, a member of the constitutionalist John Birch Society, a Florida State Oathkeepers Military Liaison, and a proud former service member who was deployed to the Persian Gulf eight times. “Investigating the Clinton’s history of crimes sheds some light on Hillary Clinton.” \\nWood actually met Bill and Hillary Clinton during the 50th Anniversary D-Day Celebration onboard the USS George Washington (CVN-73) in 1994. Some years later, though, when Admiral Jeremy M. (Mike) Boorda, the Chief of Naval Operations (CNO), allegedly committed “suicide” under what Wood called “mysterious circumstance,” he began to question his reality. “Having four previous personal encounters with the CNO, neither I nor my shipmates believed the official story,” Wood explained. “The general consensus was that he was murdered. When I investigated his death and found that several other prominent figures in the CIA and FBI also died strange deaths, it piqued my interest.” \\n“Nuclear secrets being stolen from Los Alamos to the same Chinese general that made illegal campaign contributions to the Clinton reelection raised some eyebrows in the military community,” Wood continued. “Together with the death of their longtime friend Vince Foster and the Oklahoma City Bombing, barracks in Riyadh Saudi Arabia and USS Cole bombings, there were a lot of unbelievable official explanations flying around that were clear to those in the military.” \\nWood spent a lot of time investigating the Clintons\\' history, going back to her firing from the Rose Law firm, her role in the Whitewater and File-gate scandals, the massive profits from insider trading, the attack on a 12-year-old rape victim, her college thesis on revolutionary Saul Alisnky (who dedicated his book to Lucifer), and much more. “She lied about being under sniper fire in Bosnia,” he added. “The Clintons stole the furniture when they left the White House. The most dangerous job in the world was to work for them; the military was well aware of the ‘Clinton Body Count’ in real time.” Something was clearly not right. \\nHe also highlighted the Benghazi crimes, Clinton’s openly admission about “taking her marching orders from the shadowy collectivists at the Council on Foreign Relations,” her illegal war in Libya and her bizarre laughter about killing Gadhafi, official Defense Intelligence Agency documents revealing an administration plot to foment jihadist terror in Syria, lying under oath to Congress, and more. “Her missing 33,000 emails are just icing on the cake for the over 100,000 emails dropped by WikiLeaks and the 650,000 more recently obtained by the FBI that show criminal collusion to the core,” Wood added. “This criminality includes working with the media to rig the election, inciting violence at Trump rallies, selling state secrets including multiple independent reentry vehicle nuclear secrets to China, selling 129 ambassadorships to the highest bidder, giving 20 percent of our Uranium to Russia, and her cozy relationship with globalist British Trillionaire Lynn Foster de Rothschild. That’s just a glimpse of what we can prove.” \\n\"Not since Ahab and Jezebel has the world seen a corrupt and powerful couple as the Clintons,\" he said in a follow-up e-mail. \\nA Clinton presidency would be “bad for all Americans, particularly for blacks,” Wood added. “The Podesta emails and DNC workers at the Matt Lauer Commander in Chief forum will attest to her hatred for blacks and the poor. Her connections to the \\'Dixie Mafia\\' and the Klu Klux Klan through Senator Robert Bird are on record. As per her closing statement in the final presidential debate that demonstrated all humans are units of energy for her to consume, particularly blacks who she will disregard after she takes them for granted. Her private position according to her staffers and the Podesta emails is that they are N . Her public position on blacks is that they are ‘Super-predators who must be brought to heel,’ a term used for cutting one of the heels of a slave to prevent them from running while sparing the other to ensure maximum productivity.” Pointing to Clinton receiving the Margaret Sanger Award, named after the racist eugenicist who founded Planned Parenthood, Wood added that “the entire cabal are murderous and disgusting.” \\n“Trump was correct when he said to blacks, \\'The Democrat Party has taken your votes for granted\\',” Wood continued. \\nAs for Trump, Wood said he was “certainly not perfect.” Among other problems, Wood said he did not think Trump would stop the Federal Reserve System. The conservative minister and radio host, known sometimes as the \"Amendment Avenger,\" also disagreed with Trump\\'s support for “stop and frisk,” as well as on some Free Speech issues and Eighth Amendment torture issues. Trump\\'s support for the unconstitutional “no fly, no buy” list that would prohibit gun sales to people arbitrarily placed on a government list is also troubling, Wood noted. \\n“With that said, I have never seen a candidate that was completely self-funded with all the right enemies,” he continued, pointing to the Communist Chinese, the leaders of both political parties, and more. “He has hijacked the Republican Party and that tickles my fancy a bit. ‘Americanism not Globalism, will be our credo,’ and ‘The era of economic surrender is over,’ resonate with me. He is correct when he says Clinton is the mother of ISIS. I also believe that if he does half of what he says he will do, including appointing Supreme Court Justices that will obey the Constitution and restoring respect for the rule of law, that it’s a step in the right direction. I fully understand he will be surrounded by enemies and that will impact his effectiveness. There are eleven specific enumerated powers to the Executive branch in the Constitution and that’s what I’m hiring him to do. America does not need a new savior, we already have one in Jesus Christ. What we need is for the president to not be our enemy.” \\nAnd Trump may be that man. “As misguided as he may be on a few specific issues, he strikes me as someone who could set the proper tone and bring a wrecking ball to global corporate scams in the areas of climate and trade,” Wood continued. “Additionally, his joint conference with Mexican President Pena Nieto was a home run for a demonstration of his diplomacy skills. For decades, he has worked behind the scenes in a charitable fashion towards disabled veterans and other people in need. He was never considered a racist, sexist, homophobe, or Islamophobic until he ran against Democrats. Furthermore, he has run hundreds of companies and defeated 16 career politicians at their own game for the nomination because he’s unbound by political correctness. Clinton only ran against one person for the nomination and she had to steal that.” \\n“The bottom line is that Clinton is clearly the hostile enemy to America who has committed thousands of felonies on record,” Wood concluded. “Trump is not the enemy! At least, not yet.” \\nOf course, the problems America is facing go beyond politics, Wood explained. “To combat the issues plaguing society and restore the republic, we must first deal with spiritual wickedness in high places,” he explained, citing comments by America\\'s Founders to show that the Constitution can\\'t save America from Satan. “This means getting right with God at a personal level before we begin to do battle is absolutely essential.” \\nHe said that, eventually, America needs to get out of the United Nations, abolish the Federal Reserve banking cartel that bleeds the nation and funds the warfare state, and also overhaul the education system to restore the principles of liberty and correct the damage done by Marxist infiltration of academia. Ultimately, all of that will require an informed electorate, which is why Wood said he so appreciated the work of the John Birch Society, The New American magazine, and the Freedom Index that ranks politicians based on the constitutionality of their voting records. \\nMinister Dr. Randy Short : \\nAnother prominent black American who spoke to The New American and expressed revulsion at Hillary Clinton and the Democrat Party comes from the “progressive” side of the political spectrum. Meet Minister Dr. Randy Short, who serves as a Secretary of the Board of the Rebecca Project for Justice and Human Rights, a member of the board of the International Human Rights Association for American Minorities, and the Washington, D.C. Chair of Brothers In Support of the Million Woman Movement. While describing himself as an “independent voter,” Short, who has been involved with the Green Party and holds degrees from Harvard, University of Virginia, and Howard University, said he is “an African Amerindian Nationalist who believes in sovereignty and self-determination of that Black National minority in the United States.” He also said that the Democratic Party and the “blind loyalty” of some blacks “to this evil institution” is a “clear and present existential threat to the survival of African Americans.” \\nIn a series of extended phone interviews and e-mails, Dr. Short explained that Clinton was perhaps the most troubling candidate to ever run for the presidency. “Hillary Clinton and all these people are psychopaths, that\\'s it, they\\'re total psychopaths, criminals, it\\'s incredible,” he said. “She also has this existential hatred of men, Christians, babies, children. She destroys people. We need to stop them.” While he acknowledges that Trump has flaws, he has seen the damage and murder Clinton has unleashed up close and personal. He was in Libya with former Congresswoman Cynthia McKinney when Hillary and Obama\\'s bombs started flying, for example, shortly before the administration\\'s jihadist Arab allies in Libya started ethnically cleansing blacks . “She\\'s a really evil woman,” Short added. \\n“Hillary is the singular most evil female personification and exponent of white supremacy and racism, Darwinian-eugenics, sociopathic hegemonic Eurocentric arrogance, and cultic Wiccan anti-Christian, atheistical-anti-male-lesbian-feminism that is the purest expression of hatred of the unborn, marginal, non-white, and poor,” Dr. Short explained in an e-mail. “Her method of communication is incessant prevarication, and she has neither natural affection or the ability to empathize with others. Clinton is implacable and insatiable in her greed for power, self-glorification, and money. She is wholly bereft of any redeeming qualities, but her dowdy looks and torrid voice cause most to assume a scintilla of decency in her that is non-existent. She is an malignant-narcissistic-egocentric-post-abortive woman who has suffered an incrementally diminished ability to care about others and has characteristics of someone with multiple personality disorder. She is capricious and cruel, incapable of achieving on her own, but gifted in using false attribution and confabulation to manipulate others to attain her goals. Hillary is deserving of a DSM volume to detail her flaws. Clinton’s cruel and inhumane character embodies exponentially the worse traits of: Jezebel, gangster Ma Barker, racist lynch-baiters Victoria Price of Ruby Bates Scottsboro Boys Trial infamy, eugenics maven Margaret Sanger, cruelty of Countess Elizabeth Bathory, power crazed Jiang Qing (aka Madame Mao), male-hatred of Aileen Wuoros, and empathy-devoid Elena Ceaucescu. Hillary\\'s ruthless streak makes her a exemplar of smiling psychopath.” \\nHe also noted that many of the horrors unleashed by Bill Clinton during his term in office were the handiwork of Hillary, whom Short described as the “pants-wearing partner” in the relationship. “Every horrible policy decision that destroyed middle America carried out by the Clinton administration was vetted by Hillary before it was implemented,” he said, pointing to “the Waco massacre, Bosnia bombing, Haitian invasion and deposing of President Aristide, failure to act in Congo-Rwanda, Omnibus Crime Bill of 1994, the rescinding of proposed appointment of Lani Guinier, Shaw v. Reno, Welfare to Work reforms, Ricky Rector’s execution, the destruction of HUD, bombing of a Sudanese pharmaceutical factory, ratification of NAFTA, and the repeal of Glass Steagall.” Hillary Clinton, he added, “is the brains and the cut throat Svengali that directs the steps of her oiled-zippered spouse whom is less adroit than she in hiding his sexual dalliances.” \\nShort said that part of what caused him to reject Clinton and the media spin that blacks must vote for her due to their color is the fact that he grew up in a Christian home. Her ties to eugenics, abortion, and Planned Parenthood are central to his concerns. “At the heart of my full rejection of Hillary Clinton is her obsession with eugenics and sexual identity politics (although she lied about this),” he said. “As a Christian, I am compelled to see abortion as murder, and those that endorse abortion are contrary to the laws of God. Further, the practice of abortion in the United States is not just murder but also, due to the targeting of non-white minorities for abortion, makes infanticide an act of genocide according to Genocide Convention Article II.” \\nLike many black Americans, Short was aghast at Clinton\\'s ties to Planned Parenthood and her support for its racist founder, Margaret Sanger, who openly sought to remove blacks and others from the gene pool . “Margaret Sanger, Hillary Clinton’s greatest hero, is deeply hated posthumously by an ever-growing number of African Americans,” Short explained. “The film Maafa 21 and the growing knowledge of the dangers of Depo Provera (DMPA) purveyed in Black communities by Planned Parenthood of America have brought hatred of Sanger and her legacy to a boil, and it is only the bribes that major corporations pay the NAACP, PUSH, Urban League, Leadership Council for Civil Rights, the National Action Network, and the Congressional Black Caucus Foundation to enshrine and embrace the slow genocide agenda. EMILYS List is a radical eugenics/abortion and LGBTQ-supporting Foundation that funds Black female Democrats seeking to be elected provided they support the slow destruction of their people. This treachery of selfish elitist Blacks with Stockholm Syndrome and Negrophobia has become more known by African Americans which has helped fueled a hiatus from the Democratic party and will be a growing factor in the rejection of so-called civil rights groups assumed to be in service of Black advancement.” \\n“Frankly, African Americans are angry that there is unlimited money to jail, kill, and abort Blacks live and unborn but not a pence for job training, affordable housing, improvements in schools and infrastructure,” he added. “U.S. government funding of Planned Parenthood is a violence of Article II of the Genocide Convention. Nationalistic and religious African Americans see abortion as murder and a sin against God. Economic and political pressures have silenced most \\'successful\\' upwardly mobile Blacks who are dependent on leftist-liberals or state and government employment to improve their lots. The same kinds of manipulations are involved in leapfrogging long-unresolved issues of Blacks and shoving the most extreme demands of LGBTQ down the throats of Americans as more important social needs.” \\nShort also suggested that Clinton was in fact an anti-black racist. “Hillary Clinton and her surrogate ‘Blackneck’ possess called Black Lives Matter/Black Youth 100 support the gradual elimination of Black people,” Short continued. “Clinton supports Gunnar Myrdal’s belief in the slow genocide of Blacks. She hates Black people and this is consistent with her career. She does not see us as equal human beings, and if the opposite were the case her career would be replete with examples of good works — and this is not the case. She also dislikes poor whites and Latinos.” \\nClinton\\'s full-blown assault on men and the family is also deeply troubling, Short explained. “Finally, Hillary’s ascribing to radical anti-male Feminism makes her a partner in the destruction of the traditional family and introduction of \\'alternative lifestyles\\' that militate against the faith and core values of most Americans of all walks of life,” he said. “Perhaps the greatest casualty of this alternative values jihad to eliminate God and faith and traditional concepts of family has been the emergence of the LGBTQ movement that suffocates and strangles the legitimate need for the redress of social injustice experienced by poor and non-whites in general and African Americans in particular.” \\nClinton would also be a disaster for America — and for black Americans in particular. “Hillary is a racist and a liar who has never done anything but betray and bamboozle Blacks, and she shares her husband’s brutal neo-liberal legacy of mass incarceration and unjust and draconian trade deals that de-industrialized the United States and disproportionately hurt Black Americans,” he said. “Hillary is a corrupt grifter and influence-peddling looter whose eponymous Clinton Foundation has unjustly enriched her family and friends and defrauded the people of Haiti, Congo, South Sudan, Libya, West Papua, and other nations. In particular, Hillary and Clinton Foundation has profited off brokering arms deals to human rights violating nations and robber baron pay-to-play deals globally — especially in Haiti where the government was subverted, lands and mineral wealth stolen, spurious development and trade deals forced on a sovereign nation, and aid monies deliberately misappropriated. Haiti after decades of Clinton rule lies in ruins, given the lawless and piratical character of Hillary, Blacks would be victimized anew by this deceitful and greedy and hateful woman.” \\nThe Democrat Party\\'s relationship with black Americans also needs to be re-examined, Short explained. “It is true that the Democratic Party views and treats Blacks less than ignorant plantation slaves and rectal suppositories,” he said. “Blacks need to reject the Democratic Party monopoly. They need to form a Black political party and split their votes between the Republican and Green parties. President Lyndon B. Johnson said in the 1960s his passage of the Civil Rights Bill of 1964 and Voting Rights Bill of 1965 would make Blacks the Democrats political slaves for 100 years. Frankly, the minuscule changes to the economic and political fate of Blacks that the Johnsonian Civil Rights laws made of a half-century ago are undeserving of loyalty — especially since these laws only gave Blacks what they had 100 years before. The Democrats replaced racial discrimination with racial dependency, slavery, hedonism, and mass incarceration. The sooner we dump these people the faster we will find our way back to the road of progress.” \\nEchoing the views of prominent black economists and conservatives , Short also said the Democrat Party had been a disaster for black Americans. “The Black vote does exist, and it is a colonized vote manipulated by the Democratic party which has nothing to offer the masses of America but war, sexuality politics, legalized weed, dependency-inducing handouts and sanctuary for illegal immigrants,” Short opined. “When you look at it, the black people who are for Hillary are those who are tied to the system — they have government jobs, government subsidies. The Democrats have no desire other than to keep us poor and dependent.” \\nBlack men like Trump better than black women, Short said. But despite identifying some flaws with the GOP nominee in phone conversations, Short had a lot of praise for the Republican, too. “I think Donald Trump is what America needs, and he is against globalization,” Short said. “He tells the hard truths unvarnished and it is refreshing. Unlike [the] last ten presidents, he has built something.... Trump is a proud businessman and a man who wants to do great things, and America is in ruins outside a few of its big cities. When Trump gets elected, he will liberate America from the criminal bankers and vicious trade deals and foreign alliance agreements that have bankrupted America.” \\nTrump is “not a saint,” Short pointed out, adding that the candidate has some baggage of his own. “I remain unhappy that Trump has not made peace with the Black men falsely convicted for the Central Park jogger assault in 1989, and Trump’s call for these, then, boys’ execution remains a stain on his reputation, and the sooner he admits he was wrong the better for America,” Short said. “On the other hand, I believe that whatever conscious racial/ethnic and unconscious prejudices that afflict Trump he will mature to meet the demands of office. I believe Hillary and Bill are bigger racists. However, Trump will have to distance himself from Giuliani and be more open to the fact that the police have many racist and dishonest officers who do not protect and serve the public. Furthermore, there is no way that he has been in business worldwide and has the kind of deep-seated hatreds the Clinton-biased media asserts. I have warmed to Trump over the last year, and I believe that the more jobs and strong overtures to Blacks that he has been making, if fulfilled, will smash the Democratic party zombie hex over African American voting patterns.” \\nShort says America needs “peace, reconstruction, and justice.” “We need jobs, housing, and an end to corruption,” he added, calling for an end to the U.S. government\\'s “global policing” and for peace with foreign nations. When asked about whether he supported the U.S. Constitution, he responded: “I support Jesus the Christ, the Bible, and respect the law of the United States, but we are losing all of our rights to an encroaching security state.” Short also said he thinks the Constitution may need some new amendments, such as one that would “protect religious freedom from secularists.” Just as importantly, though, he said it was time for corrupt politicians to be jailed, for NAFTA and TPP to be “trashed,” and for the border to be secured. \\nTo that end, he wants to see Trump win, and “the Soros-funded trouble-makers exposed and their mischief-making stopped.” Noting that black lives “obviously matter,” he blasted the “Black Lives Matter” movement and said many black people realize the organization is using and exploiting blacks. “Do they think we don\\'t know this is George Soros?” he wondered, noting that the paid protesters often do not dare to show themselves in black communities because they would be chased out. \\nÈzili Dantò: \\nOne of the black communities in America that has emerged as relatively strong in opposition to the Clinton dynasty — or crime family — is the Haitian-American community. At a pro-Trump Haitian rally in South Florida, for example, Haitian-descent Americans and immigrants blasted the Clintons and their corruption, meddling, and ongoing crime spree surrounding Haiti . \\nOne of the Haitian activists working to expose and defeat the Clintons is Èzili Dantò, a Haitian-born, U.S.-raised human-rights attorney who works with the Èzili Network to stop colonialism and to support the people of Haiti against predatory globalists. She said that mass-incarceration of blacks “went viral” under Bill Clinton\\'s stewardship, and that Trump is the anti-establishment candidate in this race. While Danto told The New American that she had many disagreements with Trump, and that many even view him as racist due to some of his actions and statements, but that the Clintons are much worse and must be stopped. \\n“Haitians who stand for truth know this but still prefer to deal with the racist who stands up and tells you he/she is a racist (by their actions) than the Slick Willie ones who expresses love for Black folks while gutting the Black communities to pieces as the Clintons have done to Black folks in Haiti since 1994 and in the U.S. with the Crime bill, NAFTA, Repeal of Glass-Steagal and the Welfare Reform Bill since Bill Clinton\\'s first term in office,” she said, blasting the “Internationalists” that have abused and demonized Haiti while imposing crooked rulers such as the Obama-Clinton-backed “former crackhead” and “cross-dresser” Michel Martelly. “It\\'s ironic and paradoxical, that it is the U.S. non-establishment candidate, Donald Trump, the candidate most labeled, by the media to be a fascist and racist, who has given a voice and platform to the Haiti resistance against Clinton-Obama-Bush fascism in Haiti and across the world.” \\nTrump has helped to amplify the voices of Haitians trying to expose the corruption, she said. Trump has helped provide “an access to media and platforms to have our voices heard against the depravities of the Clinton Foundation, which the establishment Democrats and progressives ignored for six years and refused to articulate.” In fact, she added, “the media still excuses the failures and frauds of the Clintons in Haiti even though the evidence is overwhelming. Mr Trump gave Haiti activists the opportunity to access media like The New American with our message and concerns for a more ethical America.” \\nDanto said that some of the activists she and her colleagues work with, such as KOMOKODA, “say publicly Haitians with self-respect should not vote for Hillary Clinton.” Indeed, even before Trump was the nominee, KOMOKODA said “that no matter who faces Hillary, vote for that person: \\'a dog is better than Hillary.\\'” “My organization wishes to stop Hillary, stop World War 3, stop those blocking free Haiti,” she added, saying Obama was just as culpable as the Clintons and eugenicists for hurting Haitian women and children with the “implementation of USAID\\'s depopulation agenda; foul, mercury-laden vaccines and UN-imported cholera.” \\nIf Trump becomes president, she added, he should veto the UN\\'s brutal and deadly occupation of Haiti and use that money to help America\\'s inner cities. “Haiti has less violence than the Dominican Republic, Jamaica, Bahamas, Washington DC, so why is there a UN, Chapter-7 shoot-to kill peacekeeping mission there, for over 12 years? Haiti is not at war,” she added. “We\\'ve written to Mr. Trump because we know that the narcissistic and racist Clintons have no incentive to give back what they\\'ve taken from Haiti, from the Congo, from Honduras, and from the millions of African Americans tossed in jail under unequal sentencing and profiling laws — not at all. Their apologies to the Black community in the U.S. and to Haiti for destroying Haiti food sovereignty are empty, without atonement actions and too regular to have any meaning.” \\n“The Haiti resistance plays the card in front of it,” added the activist. “That card, up until November 8 is Donald Trump. When you\\'re at war, you win one battle at a time. If Hillary Clinton wins, Haiti loses and gets another Martelly replica. If Donald Trump wins, perhaps Haiti gets 6 months to a year, without the DUOPOLY that has been suffocating it since the people took down Duvalier in 1986. It will be Haitians, no matter who wins the fake U.S. elections (remember DNC\\'s actions against Bernie), who must take back the lands the Clinton-Obama puppet president, Michel Martelly ceded to the transnational economic elites.” \\n“Haitian-Americans at the Èzili Network are doing what\\'s necessary, with our various allies, from all sectors of U.S. society, to see that the Clintons\\' crimes in Haiti and their privatization of federal power for personal use, is brought to the highest of scrutiny,” added Danto, who ditched her Western name. “We agree with Mr Trump that Hillary belongs in jail. We are clear about this. Mr. Trump has a loud mouth and does talk nonsense. But he, and his team, gave Haiti\\'s democratic and justice concerns a platform that the bipartisan colonization of the Clinton-Bush folks do not. He does it to win the elections. We\\'re clear on that. But we are also very clear that Donald Trump does not have the body count and state power the Clintons have amassed and brutally used against the world peoples for decades.” \\nThere are concerns too, about election fraud, she said. “Haitians living at home and abroad, know that Hillary Clinton does not respect the sanctity of the ballot,” Danto said. “The fascism is evidenced by Hillary Clinton\\'s record pushing war and chaos in Libya, Iraq, Honduras, Haiti, the Congo and even with Russia towards WW3 with the no fly zone and Syria incursions.” Indeed, while serving as secretary of state, Clinton even helped rig the post-earthquake Haitian elections to bring to power a dictator who then helped sell Haiti out further to globalist organizations such as the World Bank and their cronies without consent of the Haitian people or their elected Parliament. “This was done while the Clintons took over Haiti, one at the UN as UN Special Envoy, the other at the State Department,” she said. \\nLike Wood and Short, Danto also expressed serious concerns about Clinton\\'s links to the depopulation and eugenics agenda. “The depopulation and eugenicist agenda against Black women is evident in USAID [U.S. foreign aid] policies in Haiti, not just in Hillary Clinton\\'s adoring Margaret Sanger,” the attorney told The New American . “Haiti women are constantly used as Big Pharma guinea pigs. The U.S. abortion pill was first tested of Haiti women before it got FDA approval. So was Norplant, Depo Provera and many other foul vaccines like the pre-natal tetanus shots the CDC wished to dispense on behalf of big pharmaceutical and call it ‘aid to Haiti.’ After nearly 60 years of this brutal U.S. infertility, depopulation and anti-life policy program, today Haiti women have one of the highest reproductive organ cancer rates and suffer from the world\\'s worst epidemic of cervical cancer.” \\nAmericans Are Waking Up \\nAmericans of all creeds and colors are waking up to the establishment and its lies. Indeed, the establishment media\\'s credibility has never been lower, according to polls, with just 6 percent of Americans really trusting the mischaracterized “mainstream” media . And so, despite taking the “black vote” for granted for decades, it appears that the strategy used by Clinton and the Democrats may be unraveling as blacks, women, and Americans of all types wake up. The longer this goes on, the more Americans will wake up. Photo of Hillary Clinton: AP Images \\nAlex Newman is a correspondent for The New American , covering economics, education, politics, and more. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . Follow him on Twitter @ALEXNEWMAN_JOU . \\n( The New American never endorses candidates. Our purpose is to inform the electorate and enable them to draw their own conclusions.) \\nRelated articles:'"}, "time": 1742563588.2107785}