{"duration": 0.08797693252563477, "input_args": {"text": "'Republican leaders and President Donald Trump celebrated a legislative victory Thursday as the House passed the American Health Care Act, which, if it clears the Senate and is signed into law, will repeal former President Obama’s signature achievement, 2010’s Affordable Care Act. [But the reaction was substantially different in Hollywood, as celebrities took to social media Thursday afternoon to voice their displeasure with the new bill and to urge fellow liberals to donate to Democratic politicians ahead of the 2018 midterm elections.  Politically outspoken celebrities including Katy Perry, Amy Schumer, John Legend, George Takei, and Mark Ruffalo all tweeted about the bill, while TV personality Andy Richter called House Republicans “soulless pimps” and comedian Patton Oswalt vowed to make the 2018 midterm election a “   nightmare for the GOP. ” “The American people are coming for all of you,” tweeted Beauty and the Beast star Josh Gad. Below, see Hollywood’s reaction to the House passage of the American Health Care Act. 🚨ALERT🚨 House just voted to repeal the ACA  ”defund” @PPFA. Call your Senators to stop the bill→ https:  .  #IStandWithPP,  —   Katy Perry (@katyperry) May 4, 2017,  Has someone put together a list of dem challengers I can donate to to oust republicans in swing districts?  —   John Legend (@johnlegend) May 4, 2017,  FUCK ALL Y’ALL. https:  .   —   Andy Richter (@AndyRichter) May 4, 2017,  This administration might as well wipe its ass with our flag. Our country’s reputation and legacy is being sold out by soulless pimps. https:  .   —   Andy Richter (@AndyRichter) May 3, 2017,  🚨ALERT🚨 House just voted to repeal the ACA  ”defund” @PPFA. Call your Senators to stop the bill→https:  .  #IStandWithPP,  —   Amy Schumer (@amyschumer) May 4, 2017,  Dear #Maga Americans. Making people die without insurance while the rest of the world enjoys coverage  doesn’t Make America Great Again. https:  .   —   Mark Ruffalo (@MarkRuffalo) May 4, 2017,  ”Today we took a poopy and put a gold star on it. we did a win! peeple will die but we keppt promise pleeze vote 4 us.” pic. twitter.   —   josh groban (@joshgroban) May 4, 2017,  Congress, save those sheets for the sick people you are leaving without coverage. https:  .   —   Full Frontal (@FullFrontalSamB) May 4, 2017,  Pregnant women giving birth is literally the definition of the existence and continuation of the human race. #AHCA is all harm, no help. https:  .   —   Elizabeth Banks (@ElizabethBanks) May 4, 2017,  This new healthcare bill is a low blow to the American People. Sad Sad Sad ##AHCA,  —   octavia spencer (@octaviaspencer) May 4, 2017,  This administration is rolling back human rights in America it should come as no shock to anybody that they don’t care about it globally. https:  .   —   Patricia Arquette (@PattyArquette) May 4, 2017,  Shame on GOP Congress. Read how health bill stiffs ppl. Call your Reps  before Senate   be sure they know how you feel      —   Mia Farrow (@MiaFarrow) May 4, 2017,  I feel like every single nauseating day these felons hold power is a test to see how far we need to fall before we wake. Me? Fighting mad.  —   Ron Perlman (@perlmutations) May 4, 2017,  ”Hi hon. How was work? ””Pretty good. Voted to make rape a   condition. ””That’s nice. ””I’m going to go wash up. ””You should.”  —   Michael Ian Black (@michaelianblack) May 4, 2017,  And   ”we” do something about it (aka    on  ) nothing will change. #resist https:  .   —   Don Cheadle (@DonCheadle) May 4, 2017,  The #MAGA C. H. U. D. S. on Twitter right now, cheering the #AHCA being passed.  Cattle cheering McDonald’s.  —   Patton Oswalt (@pattonoswalt) May 4, 2017,  I’ll do what I can to make November 6, 2018 a    nightmare for the GOP. Fuck these smirking, entitled frauds. Tick tick tick.  —   Patton Oswalt (@pattonoswalt) May 4, 2017,  And never forget this moment. And the fact that they trucked in beer to celebrate. The American people are coming for all of you. https:  .   —   Josh Gad (@joshgad) May 4, 2017,  Congrats @GOP! Thank you red staters for sacrificing your health so that people like me might get a tax break. pic. twitter.   —   Kal Penn (@kalpenn) May 4, 2017,  Nice healthcare you got there, Congressman. Would be a shame if anything happened to it. pic. twitter.   —   George Takei (@GeorgeTakei) May 4, 2017,    Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564616.292809}