{"duration": 0.16142916679382324, "input_args": {"text": "'Written by Adam Dick   It is common in presidential campaigns for surrogates to speak at events or take part in media interviews where they vouch for a presidential candidate. Democratic presidential nominee Hillary Clinton has many such surrogates, including her former presidential primary opponent Bernie Sanders, her husband and former United State President Bill Clinton, and First Lady Michelle Obama. Hillary Clinton’s campaign, as is typical of presidential campaigns, also uses Clinton’s vice presidential running mate Tim Kaine as a surrogate. What is unusual is that Bill Weld, the vice presidential nominee of the Libertarian Party, has also joined the ranks of Clinton surrogates. Weld, interviewed Tuesday at MSNBC by Rachel Maddow, said that he was on her show “to vouch for Hillary Clinton.” And vouch for Clinton he did throughout the interview. Asked by Maddow if people should vote for the Libertarian presidential ticket in states where there appears to be a close race between Clinton and Republican nominee Donald Trump, Weld answered that Weld fears “for the country” if Trump is elected, that Trump is “stirring up envy and resentment and even hatred,” and that Trump threatens US foreign policy and the nation’s “position in the world at large.” Weld did not say “vote for Clinton,” but it is easy for viewers of the interview to fill in those blanks. Not satisfied with Weld’s implicit call for voters to support Clinton, Maddow pushed for more explicit direction from Weld. And Weld obliged. Asked why a person would vote for the Libertarian ticket headed by presidential nominee Gary Johnson in a state with a close Clinton versus Trump race, Weld answered that he has “a lot to say” about Clinton to such voters who choose not to vote Libertarian. Weld proceeded praising Clinton who he says he has known for 40 years and has worked with professionally. “I know her well personally; I know her to be a person of high moral character, a reliable person, and an honest person, however so much Mr. Trump may rant and rave to the contrary,” Weld continued. In contrast, Weld, in the interview, argued that Trump behaves like a bully and cannot “competently manage the office of the presidency.” Narrowing in more on Weld’s vote recommendation, Maddow proceeded to ask Weld the following question: “Do you honestly believe that Gary Johnson would be a better president than Hillary Clinton?” Breaking from expectations based on the history of American vice presidential nominees, Weld did not say that the head of his presidential ticket would be the best choice for president and then launch into a list of reasons. Instead, Weld gave lukewarm praise for Johnson while sidestepping the direct question. “I think he’d be capable of being a good chief executive and, yes, a commander-in-chief” said Weld regarding Johnson. Weld then returned in his answer to his focus on how Clinton is a much better choice for voters than is Trump, asserting that a President Trump would bring “chaos to the country” while a President Clinton would bring a “very businesslike and capable and competent approach to our affairs.” Included in Weld’s defense of Clinton is his declaration during the interview that people should “just ignore,” because “there is nothing there,” the Friday disclosure by Federal Bureau of Investigation (FBI) Director James B. Comey that the FBI has reopened its investigation of Clinton for mishandling classified information. Maddow then questioned Weld regarding whether his opinion on the matter conflicts with a press release in which Johnson starts off saying, as quoted by Maddow, “The newest revelations about Hillary Clinton demonstrate why America should be scared of both Clinton and Trump.” Asked by Maddow if Weld agrees with the press release , Weld confirmed that he does not. Weld then immediately proceeded in his answer to list “a number of substantive issues” on which he disagrees with Johnson — something Weld did not do in regard to Clinton. Weld’s divergence from the expected message of a Libertarian Party vice presidential nominee should not be too surprising. On May 19, the day after Johnson declared his preference that the Libertarian National Convention delegates choose Weld for the vice presidential slot, Jesse Walker, writing at Reason, pointed to Weld’s “anti-libertarian positions” on both domestic and foreign issues before concluding “if I wanted to elect an Iraq hawk for gun control, I could vote for Hillary Clinton.” Several months later Weld has come out in the open to effectively answer Walker with a resounding “Hear, hear!” Since his nomination at the Libertarian National Convention, Weld has continued to endorse positions contrary to the Libertarian Party platform and libertarian ideas. These positions include outlawing people listed on the US government’s so-called terror watch lists from buying guns and nominating far-from-libertarian individuals to the US Supreme Court. Weld has also been busy promoting Clinton during his time as the Libertarian vice presidential nominee, though maybe never before so brazenly as in his interview this week with Maddow. In September, for example, Weld declared in an MSNBC interview that he thinks “very highly” of Clinton and that he is “not sure anybody’s more qualified than Hillary Clinton to be president of the United States.” Then, last week, Weld issued a statement , directed to people who are undecided between voting for Clinton or Trump, that goes on and on about how terrible Trump is but neglects to suggest voting for the Libertarian ticket. Weld appears to have been in the tank for Clinton for quite a while. A curious observer would have to wonder if Weld has supported Clinton’s election since before his nomination at the Libertarian National Convention. With so many Republican establishment individuals opposing Trump and even jumping to support Clinton, it is not far-fetched to think an effort would be made to put a Clinton supporter on the Libertarian presidential ticket. Indeed, David French, who Bill Kristol was once promoting as a potential independent presidential candidate to foil Trump, wrote a National Review article expressing his desire that the Libertarian National Convention delegates nominate a presidential candidate that anti-Trump Republicans could support. French suggested that Johnson may be alright in the top spot on the ticket, though French also expressed some reservations. Weld might very much satisfy many such “Never Trumpers” by using his platform as the vice presidential nominee to encourage people to vote for Clinton. Watch Weld’s interview with Maddow, in three segments, here: Copyright © 2016 by RonPaul Institute. Permission to reprint in whole or in part is gladly granted, provided full credit and a live link are given.'"}, "time": 1742563344.4263983}