{"duration": 0.06603646278381348, "input_args": {"text": "'  \\nLast week’s announcement of a record-breaking US aid package for Israel underscores how dangerously foolish and out-of-touch is our interventionist foreign policy. Over the next ten years, the US taxpayer will be forced to give Israel some $38 billion dollars in military aid. It is money we cannot afford going to a country that needs no assistance to maintain its status as the most powerful military in the Middle East. \\nAll US foreign aid is immoral and counterproductive. As I have often said, it is money taken from poor people in the US and sent to rich people overseas. That is because US assistance money goes to foreign governments to hand out as they see fit. Often that assistance is stolen outright or it goes to the politically connected in the recipient country. \\nJust as bad is the fact that much of what we call “foreign aid” is actually welfare for the wealthy here at home. The aid package to Israel is a very good example. According to the agreement, this $38 billion will all go to US weapons manufacturers. So the real beneficiaries are not the American people, and not even Israeli citizens. The real beneficiaries are the US military-industrial complex. Perhaps the money won’t even leave Washington – it may simply go across town, from the Fed to the Beltway bomb-makers. \\nWhile even US government aid to desperately poor countries should be opposed on moral and practical grounds, it is even harder to understand US aid to relatively rich countries. At a nominal per capita GDP of over $35,000, Israel is richer than Japan, Italy, and South Korea. Not long ago Business Insider published a report by the Institute for the Study of War showing that the Israel is the most powerful military force in the Middle East. We know they have hundreds of nuclear weapons, a sophisticated air force, drones, and even nuclear weapons-equipped submarines. \\nSo why is the US giving a rich and incredibly well-armed country a record amount of military aid? Part of it is that the US government believes it can coerce Israel to do Washington’s bidding in the Middle East. History shows that this is a foolish pipe dream. If anything, US aid subsidizes Israeli human rights abuses in Gaza and elsewhere. \\nAnother reason is a very powerful lobby in Washington, AIPAC, that pressures Members of Congress to focus on Israel’s interests instead of US interests. Members of Congress should look at our economy, with effectively zero interest rates, an anemic non-recovery from the 2008 crash, historically low participation in the work force, and inflation eroding the value of the dollar and conclude that this might not be the best time to start handing out billions of dollars in foreign aid. Unfortunately most Members of Congress find it impossible to say no to special interest groups like AIPAC. \\nHere’s a better aid package for Israel: free trade, travel, friendly relations, and no entangling alliances. Israel should be free to pursue its national interests and we should be free to pursue ours. If individual Americans feel compelled to provide assistance to Israel or any other country or cause overseas they should be allowed. But the rest of us should not be forced to do so. Trade, not aid.'"}, "time": 1742562037.060988}