{"duration": 0.01589679718017578, "input_args": {"text": "'Nathan Wellman | November 17, 2016 \\nThe felony charges facing some of the Dakota Access Pipeline protesters who were arrested during last October’s raid have been dismissed by a local judge. \\nThe protesters – who prefer to be referred to as water protectors – clashed with police in riot gear who were under orders to clear them out of the way for the controversial pipeline. The water protectors refused, saying they owned the land according to the Fort Laramie Treaty of 1851 , which gave control of the land to various Native American tribes. (The treaty was quickly broken after its ratification, mostly by the U.S. government, but also by a few rogue tribe members.) \\nThe confrontation lasted for hours, with police deploying ear-damaging sound cannons against protesters, as well as pepper spray and rubber bullets. Protesters set a few contained fires and a few of them threw objects at police. \\nAfter the confrontation, 147 people were arrested, with 139 of them being charged with a felony count of conspiracy to endanger by fire or explosion and two misdemeanor counts. \\nFor the felony charge, prosecutors claimed that some form of informal agreement was made by the accused to set fires throughout the day, putting local state officials and the natural surroundings at risk. South Central District Judge Cynthia Feland noted that the affidavit against the protesters did not name who planned this crime, nor how and when the crime was committed, or even when this agreement was made. “As far as the court can tell from the facts alleged in the affidavit, these fires were set sporadically, at different locations, by different individuals, seemingly at random,” Feland said. “The state has not alleged facts sufficient to show an explicit or implicit agreement between the 139 defendants to commit the offense charged.” While the felony charge was thrown out, protesters continue to be charged with misdemeanor counts of engaging in a riot and maintaining a public nuisance. While the ruling is a victory for the Dakota water protecters, Feland did make a point to note that “the court recognizes the extreme stress under which law enforcement officers and the prosecutors bringing these charges have been operating. This order should not be considered a criticism of their efforts or a suggestion the arrest in this matter was not appropriate.” \\nNathan Wellman is a Los Angeles-based journalist, author, and playwright. Follow him on Twitter: @LightningWOW Filed under '"}, "time": 1742628490.3749242}