{"duration": 0.13689255714416504, "input_args": {"text": "\"USA Has Killed More Than 20 Million People in 37 'Victim Nations' Since World War II Recently, the world commemorated another anniversary of the 9/11 attacks, which changed the world as... Print Email http://humansarefree.com/2016/11/usa-has-killed-more-than-20-million.html Recently, the world commemorated another anniversary of the 9/11 attacks, which changed the world as we knew it, and has since, cast a terroristic haze over the planet. The War on Terror was engaged; the premise was a globally united citizen, freedom was under attack, “God Bless America.” Admitting, in the famous Bush speech , to rally the world to a new war, he stated this:“The Americans have known wars, but for the past 136 years, they have been wars on foreign soil, except for one Sunday in 1941 [ Pearl Harbour ].”It is with this quote that I bring the attention to the countless deaths over not 136 years, but only those since World War II, that the United States of America can be partially held culpable. Proxy wars, particularly, hold some of the highest numbers; there is barely a nation where the U.S. has not permeated its military might through borders. Yes, wars are messy and incredibly complex. But it is important to recognize, that although Russia, China, North Korea and all the other nations accused of bloodshed are guilty in their own rights, the United States must share a large part of the responsibility. One study, compiled by James A. Lucas , explains with hard evidence, 37 nations deeply affected by U.S. involvement. However, anyone with a history book can see for themselves that the self-proclaimed freedom fighter – the U.S. – is not all that it seems. Afghanistan and Russia Most are familiar with the ‘Mujahadeen’ name. It conjures up Russians, war, and the Soviet Union invading Afghanistan. What a lot don’t know is how the proxy war came about, or that Afghanistan – a secular nation at the time – was friendly with its Russian neighbors. So what happened? In 1998, Zbigniew Brzezinski admitted to a CIA-instigated battle which saw 12,000 deaths in Afghanistan directly attributed to the United States. The Carter administration, at the time, had agreed to provide “secret aid” to rebels wanting to overthrow the pro-Soviet regime. Well aware that providing this aid would create a Soviet military intervention, the act was signed off. “Regret what? That secret operation was an excellent idea. It had the effect of drawing the Russians into the Afghan trap and you want me to regret it?” 6 billion dollars later and a 10-year war, over a million were reported dead. The other interventions less talked about… There are smaller nations, less notable in the history books, but equally devastated by the overthrows, coups and interventions that took place, courtesy of the United States. Angola’s civil war lasted 26 years, with a reported 300,000 to 750,000 dead , depending on the literature you read. It was reported that Henry Kissinger [top architect of the New World Order ] had claimed that the US had to intervene in Angola because “the Soviet Union was already providing military aid to the Popular Movement for the Liberation of Angola (MPLA) in the form of Cuban troops.” It was, years later, discovered that he lied and that the Soviet Union was very reluctant to become involved in Angola, in the first place. Chad saw around 40,000 killed and over 200,000 tortured after the CIA assisted Hissen Habre into power in 1982. Then there is the famous CIA intervention with Chile’s elections and Salvador Allende , who became elected president. On Sept. 11, 1973, Allende either killed himself or was assassinated. General Augusto Pinochet rose to power in 1974 – much to Henry Kissinger’s approval, and thousands were murdered, tortured or simply disappeared. In the 1960s the Dominican Republic witnessed 3,000 deaths after a CIA coup overthrew Juan Bosch. When the citizens tried to reelect the man, the U.S. invaded with 22,000 military. Chilean President Salvador Allende, flanked by body guards during the coup on 11 September 1973. Later that day, Allende was reported dead. But you haven’t mentioned… The Korean War? The “ U.S. dropped 650,000 tons of bombs , including 43,000 napalm bombs.” Fatalities stand anywhere between a few hundred thousand to 4.5 million for the Koreans and Chinese, depending on the literature you read. The Vietnam War? If you include Laos, where an estimated 200,000 died from U.S. bombs, it bumps up the already 5.1 million deaths estimated by the Vietnam government – but just a little bit. Cambodia and the Khmer Rouge ? Millions were slaughtered after the U.S. left the country in tatters, providing a vacuum of power for Pol Pot’s psychopathic tendencies. Or we could focus on the pivotal role the U.S. played in placing General Suharto as leader of Indonesia after the East Timor atrocities of 1975, leaving over a quarter of the population dead. That was Gerald Ford and Kissinger’s handy work, providing Suharto with American arms. In 1991 it happened again, with East Timorese protesters in Dili gunned down by Suharto’s military. Notably, we can’t forget the Iraq Wars, post sanctions: “excessive deaths among children” under 5 stand at 227,000 with a real estimate closer to 350,000 , according to some statisticians. Let me say that again: A quarter million children under 5, dead. In Conclusion As one goes through statistics like these, it becomes increasingly difficult to remain impartial. Did the past wars create the build up to the 9/11 tragedy? I don’t say it lightly; the victims of that time, and all the innocent civilians caught up in America’s wrath since Bush’s War on Terror commenced, have suffered greatly. Everyone since, is suffering. Stepping into civil wars, instigating coups, disrupting functional regimes, baiting nations into proxy wars… how did 9/11 not happen sooner? Crimea , Turkey , Syria , North Korea and China… the world edges towards the precipice. By Anon Watcher Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742561739.8524883}