{"duration": 0.15658950805664062, "input_args": {"text": "'Good morning. (Want to get California Today by email? Sign up.) Two European satellites have captured a stunning portrait of the subtle topographical shifts at work in the landscape of the San Francisco Bay Area. The Sentinel satellites, operated by the European Space Agency, have been snapping radar scans of the region since 2015 as part of their mission to collect data on the earth and oceans. Analysts have since compared the movement of physical features over time  —   down to mere millimeters. Among the project’s starkest depictions are shifts along the Hayward Fault, the gradual sinking of reclaimed land in the San Rafael Bay, and the rise of the city of Pleasanton, a possible side effect of replenished groundwater. The images align with already understood geological processes, said Roland Bürgmann, a professor of earth and planetary science at U. C. Berkeley, who was not involved in the project. But scientists believe that the acute level of detail offered by the technology could deepen knowledge in a number of areas, among them structural engineering, earthquake prediction and insurance risk. “It’s developing a new potential for the world that has never existed,” said Dag Anders Moldestad, a senior adviser at the Norwegian Space Center who participated in the project. In the case of the Millennium Tower, it could also become a factor in a court fight as San Francisco wages a legal battle that accuses the developers of failing to disclose issues with the structural integrity of the downtown skyscraper. The Sentinel satellite images  —   captured from early 2015 to September of this year  —   show that the   luxury condominium building is sinking into the soft soil below at a rate of nearly two inches a year. A separate examination this year found that the tower had descended about 16 inches altogether, while tilting roughly six inches, since opening its doors in 2009. The developer has insisted that the building is safe. Nicholas Sitar, a professor of civil engineering at the University of California, Berkeley, said that a small amount of sinking was to be expected among structures on the reclaimed land along San Francisco’s waterfront. The Sentinel satellites, for example, found that the new Salesforce East tower, across the street from the Millennium Tower, was also sinking. The rapid rate of the Millennium Tower’s descent, however, was troubling, Dr. Sitar said. Not least to its concerned residents. • After the Democrats’ demoralizing election defeat, Representative  Nancy Pelosi has become a symbol of what went wrong. [The New York Times] • Higher education leaders in California urged   Donald J. Trump to embrace students who are in the U. S. illegally. [Los Angeles Times] • The median price of a new home in Orange County hit a record: $934, 250. [Orange County Register] • Thousands of workers protested in Los Angeles, Oakland and other cities to demand a $15 minimum hourly wage. [The New York Times] • How a Berkeley graduate student found spyware that could control anybody’s iPhone from anywhere in the world. [Vanity Fair] • Silicon Valley’s biggest failing is a lack of empathy for those whose lives are disturbed by its technological wizardry. [New Yorker] • Three people died and at least 14 were sickened after a Thanksgiving dinner in the San Francisco Bay Area. [SFGate. com] • Die Antwoord, the confrontational South African musicians, have become something entirely unexpected: Hollywood. [The New York Times] • Bill Murray’s mysterious ways, Bryan Cranston’s memoir, Alan Cumming’s photos and more in the best new books about Hollywood. [The New York Times] • The  ’ travel guide to a long weekend in San Diego. [Wall Street Journal] On Tuesday, a photo caption in the newsletter misidentified one of California’s landmarks. About a dozen readers wrote to point out the error: the towering rock in the photograph was Yosemite Valley’s Half Dome, not Sentinel Dome as the caption claimed. That made us wonder if it might be time for a visit. While summer tends to be the park’s busiest time of the year, Yosemite regulars will tell you it is never more blissfully serene than in the winter. Crucially, it’s much less crowded. In the summer, up to 600, 000 people visit each month, said Scott Gediman, a park spokesman. During the winter months, it’s usually fewer than 200, 000. “The park is beautiful right now,” said Mr. Gediman, speaking by phone from the Yosemite Valley on Tuesday. “Yosemite Falls is flowing. You’ve got ice on the canyon walls. It’s just gorgeous and peaceful. ” Most of Yosemite is cloaked by snow in the winter, including at times the valley, which sits about 4, 000 feet above sea level. Visitors can ice skate, snowshoe,   ski or even hit the slopes. Established in 1935, Yosemite Ski and Snowboard Area, formerly known as Badger Pass, is California’s oldest ski area. According to Frank Dean, a former park ranger who lived in the valley for eight years, Yosemite in the winter offers pageants of nature that you don’t get the rest of the year. He recalled once going   skiing with some friends on New Year’s Eve. The sky had just cleared after a storm and a bright moon was illuminating a dusting of snow on the valley’s soaring granite walls. As the group passed by the luxury Ahwahnee Hotel, a onetime host of Queen Elizabeth II, they noticed a holiday celebration inside. “We couldn’t afford to go to that party,” said Mr. Dean, who now runs the Yosemite Conservancy. “But I was thinking, ‘Boy, I think we’re having the better deal out here. ’” California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742561689.3836246}