{"duration": 0.43877434730529785, "input_args": {"text": "'Páginas Libres\\nLuis Banchero: el pez dorado por Jorge Smith Socios | 28 de octubre de 2016 Luis Banchero: el pez dorado Testimonio a manera de prólogo Esta nueva entrega del chimbotólogo Pedro Miranda, complementa su obra publicada hace dos años sobre \"Moncada: El Profeta de la ecología\". Es una segunda parte del abanico de personajes emblemáticos de esa fascinante época que fueron los años 50 y 60 en Chimbote. El ascenso vertiginoso de Luis Banchero y su pronta desaparición en una situación impredecible y de proporciones trágicas, hace más veraz que nunca, aquella máxima que suele volver en los mitos griegos, y que es que cuando los dioses aman a alguien le dan virtudes y habilidades en demasía para triunfar en la vida pero a cambio de eso se los llevan jóvenes.\\nCon la curiosidad de un dentista que quiere ver todos los detalles de una dentadura, Miranda que es odontólogo, indaga sobre esos años a través de estos personajes tan disimiles como lo fueron Moncada y Banchero. Ambos personajes tenían una diferencia de edad de solo 6 años o sea prácticamente pertenecían a la misma generación. Los dos coinciden en Chimbote en un momento cuyo telón de fondo era el boom de la pesca. El puerto vivía en un frenesí de crecimiento económico como el que años después se experimentó en el emporio textil de Gamarra en el distrito de La Victoria en Lima en los años 90. Si en los 50 ó 60´s en Chimbote o en los 90´s en Gamarra, llegabas con un espíritu emprendedor, las ideas claras y objetivos precisos, podías hacer en pocos años dinero para el resto de tu vida.\\nEn los dos extremos de la escala social estaban, en el caso de Chimbote, Luis Banchero, el rey de la pesca, el visionario empresario y por otro lado, el humilde pescador. El uno había nacido en la vecina región de La Libertad y el otro en la sureña y fronteriza ciudad de Tacna. Ambos tenían el gusto del mar y la hermosa bahía de Chimbote fue el escenario inicial de muchos de sus sueños. El pescador Moncada era hábil con sus manos para reparar todo tipo de redes y para reciclar objetos y sin duda para filetear pescado y por otro lado, Banchero era hábil con sus ideas y proyectos para hacer todo tipo de negocios a partir del pescado, ya sea como producto para consumo directo, como harina, como conserva o como fuese. Como cita la obra, muchas veces se le escuchó decir al empresario,\" En el mar no hay que arar, solo hay que recoger\".\\nLuis Banchero sabía recoger el fruto del mar, pero más que eso, generar riqueza a partir de un insumo natural, comprando pescado a buen precio al filo de la madrugada, llevando pescado hasta Lima para venderlo a mejor precio, o en otro caso, ya procesado como harina, venderlo a los mejores precios o como conserva haciendo que el producto llegue envasado a los más recónditos lugares del país. Desde joven no era un simple empresario pesquero sino una máquina para proyectar estrategias de cómo comercializar ese insumo en apariencia inagotable. Cuando tenía solo 26 años ya era propietario de varias lanchas y se perfilaba como dueño de una fábrica. Creativo como ninguno, ideó toda una red de empresas complementarias para así aminorar sus costos en muchas áreas de la industria pesquera, pues la pesca es una actividad que tiene múltiples matices y negocios aleatorios que sólo puedes percibirlos cuando estás en la cúspide. Así el empresario llevó el negocio pesquero a una capacidad de producción de proporciones inesperadas, haciendo que al Perú se le respetase como productor mayor de un insumo como la harina de pescado, que directa o indirectamente, servía para elaborar muchos productos por su altísimo contenido proteico.\\nEs cierto que la vorágine extractiva de esos años, creó las consecuencias ecológicas en la bahía chimbotana, y sobre la cual, en el peor caso, solo podría imputársele al empresario una responsabilidad compartida. De haber tenido más tiempo de vida un hombre visionario como Banchero, hubiese tomado conciencia del daño colateral que genera la actividad pesquera y sin duda con su capacidad de liderazgo en el sector, hubiese incentivado el uso de sistemas de producción que hubiesen reducido la contaminación ambiental o marina y, sin duda, apoyado estrategias globales de descontaminación de la bahía. Pero la historia fue otra, y con su trágica y temprana desaparición, la anarquía reinante en la extracción pesquera continuó y, por ende, también la agravación de la contaminación que sufrimos hasta ahora. Banchero era definitivamente otro tipo de empresario, un hombre visionario, que ya intuía que el pescador y en consecuencia el habitante chimbotano, difícilmente iba a poder coexistir por siempre en una situación contradictoria, en la cual la fuente de su trabajo que era la pesca, fuese también la causa de una catástrofe ambiental. Con Banchero vivo, otra hubiese sido la historia.\\nEstás últimas reflexiones me hacen decir lo justificado que ha sido por parte del autor, incrustar ese diálogo imaginario entre el llamado \"loco\" Moncada y Banchero, en el cual el pescador increpa al empresario responsabilidad en la contaminación de la bahía. El encuentro, si se hubiese producido en la realidad, habría sido, tal vez, un diálogo de sordos, pero al ver Banchero, que todos no vivían en el puerto con el mismo entusiasmo la vorágine extractiva, tal encuentro, le hubiese dado un tema de reflexión y una búsqueda ulterior de soluciones al problema. De allí que las palabras que pone en boca de Banchero el autor son muy precisas , \"Este no tiene nada de loco, veré que puedo hacer, si es verdad que se está contaminando el mar, analizaré qué puedo hacer, tiene que haber una solución y la voy a encontrar, esto no puede seguir así.\"\\nAl haber nacido yo en Chimbote, a comienzos de los años 50, pude ver con mis propios ojos, las transformaciones en el paisaje urbano y costero y también en la vida de la gente, que generó el boom de la pesca. El dinero, efectivamente, corría a raudales y se generó una capacidad de consumo desenfrenado en el puerto. Había trabajo para todos, en todas las profesiones. No es cierto el mito que los chimbotanos solo \"la vieron pasar\", que el dinero que se producía iba a otra parte, a Lima o al extranjero. Como en todo lugar donde hay ese explosivo auge del dinero, hay algunos que saben ahorrar y otros no. Hay algunos que invierten en la educación de ellos o sus hijos y otros se abandonan al despilfarro desbocado o caen en el dispendio irresponsable. Lo interesante es que para todo el que vivió aquella época, queda el recuerdo de haber vivido en un gigantesco laboratorio humano. En el centro de este auge y este laboratorio estaba justamente Luis Banchero.\\nChimbote siempre fue una ciudad poblada de gente sin mucho arraigo. Siempre fue, y no ha dejado de serlo, una ciudad muy horizontal. En muchos casos, diferentes gentes frecuentan los mismos lugares y en el mundo de la pesca, sobre todo, hay una forma de manejar las relaciones laborales. Eso lo captó rápido un observador sagaz y un hombre con una intuición excepcional como lo fue Banchero. El trato entre la gente en Chimbote, es directo, informal y a veces desenfadado. Es el mundo del tú a tú, reacio a las jerarquías o las formalidades innecesarias.\\nQuizás porque bastante joven ya fue exitoso, pero más por su propia personalidad, Banchero sabía mimetizarse con personas de toda condición social y eso es algo muy claro en el recuerdo de los muchos que todavía viven y que trabajaron con él. Su personalidad tenía una magia que te hacía sentirse bien delante de él, nunca intimidado de estar en presencia de un empresario que en su momento era el más poderoso y quizás el hombre más rico del Perú.\\nPodía entrar y preguntar con curiosidad sobre todos los detalles del funcionamiento de una lancha, como también interesarse en visitar todos los recovecos de una planta harinera o indagar sobre cualquier detalle de las fases productivas de una planta conservera. Todo esto combinado con su capacidad de proyectar la venta del producto final en todas sus formas, hacía de él un empresario único, lo más alejado de un especialista, que era el paradigma del gerente o empresario que ya se comenzaba a gestar en los años 60´. Pero lo más importante de Banchero era su trato con la gente, que perteneciese o trabajase en sus empresas o no. En eso todos coinciden. Era increíble la empatía que suscitaba su persona. Por eso, casi medio siglo después de su muerte, la gente que lo conoció y lo trató lo recuerda con mucho afecto y lo que es más, basta darse una vuelta por el cementerio El Ángel donde reposan sus restos, para ver que su tumba sigue siendo visitada por anónimos visitantes que le llevan flores. Como pocos, quizás como ninguno, salvo Haya de la Torre en la política, Luis Banchero es alguien que caló muy hondo en la memoria y el imaginario de los peruanos.\\nPor esas circunstancias de la vida pude conocer a muchos de los personajes citados en el libro de Miranda, los volví a ver a algunos en circunstancias muy diversas después de la muerte del empresario. A él mismo lo pude tratar personalmente solo dos veces.\\nEra el año de 1971 y yo regresaba de Lima a Chimbote un fin de semana a ver a mi familia y mi padre me llevó a cenar al restaurante del vivero forestal y me dijo que se tenía que encontrar también con un tío mío que era uno de los abogados de Banchero. Cuando nos íbamos sentar a cenar, mi padre me dijo \"Ahí esta justo tu tío, conversando con Banchero y quiero presentártelo\". Nos dirigimos a ellos y allí estaba el magnate, a quien mi padre ya conocía y me lo presentó. Mi tío le dijo a mi padre para conversar con él lo que tenían que conversar, mientras yo conversaba algo con el gran Lucho Banquero. El hombre de veras irradiaba una simpatía natural y en los 15 ó 20 minutos que pasamos charlando, me hizo las preguntas mas diversas, sobre qué estudiaba y porqué y qué grado de compromiso tenía con Chimbote y si iba a volver a trabajar allí cuando terminase mis estudios. \"Sabes -me dijo- que recién me he podido titular como ingeniero, después de más de 20 años. Yo en realidad hubiese querido ser investigador. Siempre me interesó la forma cómo se pueden preservar los alimentos en buen estado. Creo que las guerras del futuro serán por alimentos.\" Prosiguió con diversas reflexiones muy visionarias y puntuales que todavía recuerdo y al decirle que mis clases universitarias eran en la Universidad Católica en la Plaza Francia me dijo: \"Mis oficinas están cerca. Llámame un día y pasa a verme. Me dio un número telefónico y ya en ese momento se aparecían mi padre con mi tío.\\nUnas semanas después ya en Lima lo llamé y su secretaria me dijo que le daría el mensaje y lo llamase al día siguiente antes del mediodía. Así lo hice y la secretaria me lo pasó al teléfono y me dijo que si estaba libre me invitaba a almorzar y me citó en el restaurante del Hotel Bolívar. Después supe que él tenía una suite permanente en el Hotel Crillón a pocas cuadras del Bolívar. Cuando llegó yo ya estaba sentado esperándolo.\\n\"En el Crillón, hay en el sótano un excelente restaurante que es La Balsa (donde preparaban el mejor sancochado de Lima), pero allí no puedo almorzar en paz, pues todo el mundo me conoce y no puedo almorzar, a tal punto que pido que me lleven la comida a mi suite\". Bueno, en el Bolívar, me di cuenta que allí también lo conocían y mientras tomábamos el pisco sour de aperitivo, unas 8 personas vinieron a estrecharle la mano o desde una distancia prudente otros lanzarle un \"¡Hola Lucho!\" o \"¡Buen provecho Lucho!\". \"Aquí, los mozos me reservan un sitio en el fondo del restaurante en la parte que da a La Colmena y me siento de espaldas al resto y puedo almorzar tranquilo.\" Fue un almuerzo que duró un par de horas, solo interrumpido por algunos documentos que le trajo para firmar un empleado. Me impresionó la variada gama de intereses que tenía Banchero. Evidentemente era un hombre que le robaba horas al sueño para ilustrarse sobre temas que ni por asomo tenían que ver con su área de negocios específicos que era la pesca. Mucho le interesaba la innovación tecnológica, la organización de la información como la base para tomar decisiones empresariales eficaces. \"Viajo felizmente mucho y eso me tiene informado, pues al regresar a Lima sé que estaré en una involución informativa desesperante. Ahora que conozco a gran parte del empresariado limeño puedo decir que la carencia de curiosidad informativa e intelectual es desesperante. Por eso algunos en sus respectivas áreas se estancan, pudiendo potenciar sus empresas en forma extraordinaria. El limeño está siempre dispuesto a perder su tiempo en banalidades. Los fines de semana cuando no tengo que ir a Chimbote u otro lugar en Perú, me refugio en mi casa en Chaclacayo\". Yo no sabía que estaba frente a un hombre que siete meses después iba a ser asesinado en su vivienda, justamente en Chaclacayo. \"Me dijistes en Chimbote, que has iniciado tus trámites para irte a estudiar a Francia. Lo que más me gusta de ciudades como París y Nueva York es el anonimato. Me ha ocurrido estar con Onassis, almorzar con él en la Avda. de los Campos Elíseos en pleno aire libre y aunque él es más conocido que nadie sobre todo en París, ninguna persona se acercaba a molestarnos. Aquí, como has visto, un poco de popularidad y tu vida se convierte en un calvario. No es que sea malo. Los latinos somos así. Pero llega un momento que te hartas.” Fue la segunda y última vez en mi vida que vi a Luis Banchero.\\nYa en París, en la edición de Le Monde el 2 de enero de 1972 me enteré de lo que había acontecido en Lima. De veras me apenó la noticia. Estoy seguro que otro hubiese sido el destino del Perú, si alguna vez un hombre como Banchero hubiese conducido el país. En muchas áreas, la innovación tecnológica ya hubiese llegado, nos hubiésemos ahorrado por lo menos 10 ó 20 años de retardo. Hubiésemos despegado más y mejor mucho antes.\\nA Eugenia Sessarego la conocí en circunstancias bien especiales en la ciudad de Ginebra en Suiza y luego la volví a ver en Lima en diversas ocasiones y, sobre todo, en dos ocasiones que recuerdo bien, una en mi casa en Miraflores y otra en su departamento en uno de los malecones del mismo distrito.\\nAmbas veces hablamos de los más infinitos temas y me impresionó su inteligencia, su soberbia organización mental y su belleza. Nunca traté, por iniciativa propia, el tema de Banchero, pero sabiendo que yo era de Chimbote, y que por mi edad había vivido el boom de la pesca, sabía que mi curiosidad latente de cómo había percibido al empresario alguien tan cercano a Banchero, como lo fue ella. Una vez, hablando sobre la ineficacia en la toma de decisiones en los dirigentes políticos, ella misma abrió la puerta: \"Ningún empresario que conozco y menos aún ningún político, tiene la lucidez y la capacidad de tomar decisiones eficaces que tenía Lucho Banchero. Yo le organizaba citas hasta de solo 5 minutos en las cuales él podía evaluar alternativas diferentes y tomar una decisión. Era una máquina de tomar decisiones. Era como un láser para ir al meollo del asunto. No solo tomaba decisiones , sino tomaba las más acertadas. Creo que deben haber pocos empresarios que hayan tomado decisiones acertadas con tanta regularidad como Lucho Banchero. Uno podría imaginar que alguien así era el colmo de la arrogancia o la vanidad, pero no. A Lucho no lo cambió el dinero, yo diría más bien que él cambió los usos que le daba al dinero. Quería crear empresas donde la innovación tecnológica pudiese ser introducida en forma permanente y si era posible, inmediata. Su pérdida fue para el país una desgracia. Era un ser extraordinario. Puedo dar fe\".\\nLa segunda vez que la vi, algunos meses después, igual hablamos de muchas cosas. Yo siempre sorprendido por sus atinados juicios sobre cualquier tema. Igual, en ningún momento por iniciativa propia, cité el nombre de Banchero. Ya con los años de distancia sobre los penosos hechos, creo que con Eugenia hubiésemos podido hablar al respecto. Ya había aparecido la estupenda historia novelada de Guillermo Thorndike, ella misma había hecho extensas confesiones en la revista CARETAS y se había publicado mucho al respecto. Me volvió a hablar otra vez, sin que se lo pidiese en la forma en que tomaba decisiones el empresario, pero era imposible no darse cuenta que al pronunciar el nombre de Banchero, una sombra de tristeza se reflejaba en su mirada. Preferí no tocar el tema. No la he vuelto a encontrar.\\nOtra persona a quien frecuente mucho, pues escribí con cierta frecuencia en uno de los diarios que él dirigió, fue a Guillermo Thorndike, un hombre de un talento excepcional a quien le debemos la extraordinaria novela \"El Caso Banchero\", escrita a pocos años de sucedido el crimen. Gracias a él pude comprender mejor la compleja y rica personalidad del magnate pesquero. La novela de Guillermo es estupenda y no tiene nada que envidiarle a la obra maestra del género que es \"A Sangre Fría\" de Truman Capote. Guillermo conoció a Banchero cuando ya éste era un empresario consolidado, un verdadero magnate cuyo negocio ya no era simplemente la pesca y sus derivados sino que precisaba estrategias mediáticas que tenían que estar en manos de profesionales de genio y de ingenio como lo fueron Raúl Villarán y luego Guillermo Thorndike. Ellos lo ayudaron con \"Correo\" y luego con una publicación que fue \"Ojo\", dirigido a un segmento más popular. Allí también las sugerencias de Banchero fueron de una gran creatividad, pues se crearon una de las primeras plataformas periodísticas descentralizadas y \"Correo\" tenía una edición para Lima, pero también ediciones que se sacaban en Huancayo y otras ciudades. Eso era importante para agrandar la audiencia, pues para Banchero las ciudades, ellas mismas querían ser el personaje central de sus noticias. En eso no se equivocaba. Y es cierto pues incluso progresivamente las publicaciones regionales se convirtieron en propulsoras de movimientos regionales que, para bien o para mal, hicieron fragmentarse el panorama político en la forma que lo conocemos ahora.\\nPor lo que me dijo Thorndike, muchos sectores políticos ya comenzaban a percibir a Lucho Banchero como un posible presidenciable, por su éxito personal y un innegable magnetismo mediático, como el que ahora se suele percibir en Gastón Acurio.\\nEs mérito de Pedro Miranda, en su obra “Banchero, El rey de la pesca”, en cortas 69 páginas lograr lo que también consiguió transmitir en sus casi 490 páginas la novela de Thorndike en su momento: captar lo esencial de un personaje tan complejo. Al ser chimbotano el autor, Pedro Miranda, ha podido interrogar exhaustivamente a muchos de los colaboradores de Banchero que todavía viven en el puerto, de escribir con lujo de detalles las extraordinarias habilidades empresariales y comerciales y el ascenso a la cima empresarial de un joven que con solo algo más de 20 años, después de una fase en que vendía de todo, desde forrajes hasta motores, comenzó a forjar un imperio de la pesca.\\nHe titulado este testimonio a manera de prólogo, \"Banchero: El pez dorado\", pues en una última estadía que he hecho en China, observé que muchos de los chinos, que por otro lado adoran las peceras, suelen tener en ellas un pez dorado que, según las leyendas chinas, puede vivir hasta la edad aproximada de 40 años, edad aproximada de la muerte de Banchero. Los chinos llaman también a este pez, el pez de la sabiduría y aquél que lo encuentra puede considerarse sabio y afortunado. Es un pez tranquilo. Es un pez generoso que le gusta compartir y aun cuando está en cautiverio en una pecera, le gusta estar con peces de otras especies, algo que algunas especies de peces aborrecen.\\nLuis Banchero era así, como el pez dorado: sabio, sencillo, comunicativo y le gustaba compartirlo todo. Un gran hombre.\\nJorge Smith Fuente\\nSenal de Alerta (Peru)'"}, "time": 1742564501.015054}