{"duration": 0.07206606864929199, "input_args": {"text": "'LONDON  —   Members of the Driscoll family tend not to fight. If they do, it’s over whose turn it is to vacuum. Leslie Driscoll, 55, sells hot cross buns in an English bakery in London and addresses her customers with “love” or “darling” her husband, Peter, 54, works as a floor layer their daughter, Louise, a    with dyed blue hair, is a barista in a hip coffee shop. But last week, the Driscolls fell out. Badly. They had an argument so big they did not speak to one another for days, Ms. Driscoll said. Shortly afterward, her husband went off in a huff to see friends up north, in Derby. The source of the family drama: whether Britain should exit the European Union, a process often referred to as “Brexit. ” With only days to go until the referendum on membership in the bloc on Thursday, polls suggest that the country is deeply split along socioeconomic and regional lines, with many older and   voters in England favoring leaving, and younger and   Britons, and a majority of those in Scotland and Northern Ireland, favoring staying. As the consequences of the choice come into focus for voters, tensions are bubbling. In the case of the Driscoll family, they are boiling over. “I completely disagree with her,” Louise said on a recent afternoon, looking her mother squarely in the face as they sat in a cafe. “We shouldn’t be leaving, like, an organization that has helped us more than we could ever help ourselves if we were to go it alone. ” Louise is the only one in her family who wants Britain to remain. Her parents and her    grandfather want out. “This is a little island,” her mother said    lighting up a cigarette and letting the ash fall on her glittery sneakers. “We should look after our own first. Charity begins at home. ” “But we are all people!” Louise said. “We should help each other. ” “It don’t work that way, darling,” her mother replied, shaking her head. “If you’re born here, you pass as English. I don’t care whether you’re black, white, green or blue, or purple with pink spots on  —   you’re English. ” Those born abroad, Ms. Driscoll said, “have got their own governments, their own parliaments, whatever. ” Up and down the country, the debate is pitting husband against wife, children against parents, sisters against brothers. The divisions are unlikely to heal easily after the referendum is decided. Even the family of Boris Johnson, the former mayor of London and the most prominent face of the campaign for leaving the bloc, has not been immune to disputes: His father, Stanley sister, Rachel and brother Jo, who is a member of Parliament and who worked closely with Prime Minister David Cameron, favor remaining in the union. Boris Johnson’s mother, Charlotte Johnson Wahl, wants to leave. (Rachel Johnson reportedly tried, without success, to dissuade the former mayor from backing a British exit over a soggy game of tennis.) In Islington, the neighborhood in London where members of the Driscoll family have lived for eight generations, residents are increasingly going public with their voting intentions, which is a rarity in Britain. Rows of houses on some streets have “Remain” posters in their windows. On a thoroughfare filled with butchers, bakeries and     tradespeople nodded their head vigorously when asked if they were planning to vote out. The clash over Britain’s continued membership in Europe has touched on issues as varied as immigration, terrorism, the economy, London’s housing shortage and the fate of the National Health Service. Some of these issues, like immigration, are directly related to the European Union. Others, like the shortage of affordable housing, have little to do with it. Yet those distinctions are blurring. For many, the referendum is as much a chance to register displeasure with the country’s direction as it is an opportunity to reject or embrace Europe. The stance of some voters is being shaped by personal experience and anecdote. There is, for example, a widespread perception that European citizens are flocking to Britain, especially from Eastern Europe, to take advantage of its social welfare system. But Britain’s welfare system is not as generous as those of many other European nations, and fewer than 7 percent of immigrants receive benefits. In Ms. Driscoll’s case, she remembers her grandfather pawning and   his suit to get by. That memory was revived, she said, with the discovery a few years ago that a newly arrived Polish family in her neighborhood had received money to buy a car and move into a   house. “Years ago, we never had social security or anything like that,” Ms. Driscoll said. “You sold your own. ” Her grandmother would get her “granddad’s suit out of pawn when he got paid on Friday, put it back in pawn on Monday,” Ms. Driscoll said. “That’s how they lived. ” Having different cultures and communities is “fantastic,” she said, “but what I don’t like is the fact that, through having that, we’ve now left ourselves open. I feel like a   citizen in my own country. ” Ms. Driscoll is proudly English (not, in her mind, British  —   she crossed out the word on her passport and replaced it with “English”). Her father fought in World War II, and her grandfather in World War I. She has lived all her life in this area of London. Louise grew up in the same area but in a more prosperous, multicultural Britain than earlier generations had experienced. In school, she was one of only two white students. Her friends are Eritrean, Nigerian and South African. Louise voted for the Green Party in last year’s general election and was appalled that her mother, traditionally a Labour voter, had opted for the     U. K. Independence Party. (“Sorry, I know I’m a bit antiquated  —   can’t help it, love,” Ms. Driscoll replied, somewhat sheepishly, after Louise uttered an expletive.) Louise said she understood the pressures that immigration placed on schools and hospitals. But leaving the European Union worried her, she said, because it risked wrecking the economy and making it hard for young people to secure employment. It took her eight months to find work as a barista, she said. “If I wanted to work abroad, it would be a lot easier if England was in the E. U.,” Louise said. Her mother suggested that Louise move to New York, possibly unaware of the paradox that this would make her an immigrant herself. Almost inevitably, the debate over immigration veered into an argument about terrorism. Britain’s porous borders were letting terrorists slip through, Ms. Driscoll said, repeating a message the camp to leave the European Union has relentlessly pushed on voters. Louise asked why she wanted to shut immigrants out of England. “It ain’t the nice ones I’m worried about,” her mother replied. “It’s the nasty ones. ” “To have opened the floodgates, it’s like saying, ‘Come, and come and kill us,’ ” she said, adding that members of the Irish Republican Army had at least notified the public before setting off bombs across Britain during the 1970s and 1980s. “We can get on a bus tomorrow with a bloke with a backpack, and   boom,” Ms. Driscoll said. “Yeah? Nothing to do with what they call their beliefs. ” Louise rolled her eyes. In what sounded like a final plea, she said: “At the end of the day, the E. U. is going to affect my generation more than it will affect your generation. So shouldn’t it be down to us to decide whether or not to stay?” Her mother fell silent and was thoughtful. “I am 55 years of age,” she said slowly. “I know  —   I appreciate that in 50 years’ time, you’ll be here and I won’t, and you’ll have to put up with whatever’s happened. ” She paused. “But I still want out,” she said. “Sorry. ”'"}, "time": 1742628546.428674}