{"duration": 0.050018310546875, "input_args": {"text": "'On Saturday, Jackie Chan, a legend in martial arts cinema, finally received an Oscar. Those movie buffs familiar only with Mr. Chan’s appearances in blockbusters like the “Rush Hour” trilogy and “Shanghai Noon” may not realize just how long a career the Hong Kong native has had as an actor, director and producer. Mr. Chan, 62, who began acting when he was very young, has wowed audiences the world over not only with the balletic,   “Drunken Master” techniques in his early kung fu movies, but also with the complex action sequences and comedic timing that gave his career a long arc. And he has broken many bones doing it, he said, since he has done his own stunts. According to IMDB, the online film website, he has appeared in 134 films as an actor. But if you count his directing, producing and writing, as well, his film credits may number well over 200, as he noted when accepting the Honorary Oscar. “After 56 years in the film industry, making more than 200 films  —   I break so many bones  —   finally, this is mine,” he said, shaking the golden statue. In his acceptance speech, a beaming Mr. Chan told a story about a time his father asked when he was going to win an Academy Award. “Dad, I only make   movies,” Mr. Chan recalled saying. He told how he had become obsessed with the award after seeing one at the home of Sylvester Stallone, and recounted his disbelief upon hearing that he had finally received it. Mr. Chan was among a roster of artists to receive the Honorary Academy Award, whose recipients were announced in September. It’s given to celebrate “extraordinary achievement” and “exceptional contributions” over the course of a filmmaker’s career, and it was roundly celebrated on social media. A comment from Lucius Hale, a    from Kristiansand, Norway, was typical. “I’m really glad that Jackie Chan got an Oscar,” he said. “That man has been part of my life so long, and his movies are so goood. ” Others celebrated Mr. Chan’s status as a trailblazing Asian actor in American films. It was difficult to find anyone on Twitter questioning whether Mr. Chan had earned the award. But for anyone who has doubts about Mr. Chan’s skill onscreen, here are five clips that, together, illustrate some of his most impressive work. 1. The scene is from “Drunken Master,” a breakout film for Mr. Chan, which became a cult classic in the United States years after its 1978 release in Hong Kong. The actor’s remarkable physical abilities are evident in the scene. But so, too, are his comedic skills, demonstrated both through the fighting scenes and his exaggerated facial expressions. The movies he made in China showed him as a canny comedian, whether he was in the midst of a fight scene or just reciting canned dialogue. 2. Here’s a scene from the end of Mr. Chan’s breakout success in America, “Rush Hour” (1998) in which he starred with Chris Tucker. Among other martial arts, Mr. Chan has long been a master of his own brand of Zui Quan, which is sometimes referred to colloquially as drunken fist, or   kung fu. It’s a kind of martial arts in which a person imitates the posture and clumsiness of someone who’s had a little too much to drink. Though it’s ideal for comedy and action films, it’s can also be useful in combat. An article in Vice in 2009 explained the style’s   advantages: “The great strength of drunken boxing as a trick play or philosophy is as a mask for actual fighting ability. ” 3. Mr. Chan’s success paved the way for other martial arts stars from China to break into Hollywood. Three years after Mr. Chan first experienced success in America, with “Rumble in the Bronx,” the Chinese actor Jet Li made his first appearance in an American film, “Lethal Weapon 4. ” Mr. Li went on to become a star in his own right, and he and Mr. Chan teamed up in 2008 for “The Forbidden Kingdom. ” This clip shows their fight from the film. 4. Mr. Chan’s abilities as an action star were not confined to fight scenes. He was extraordinarily adept at navigating space in all its forms, as the video  —   a montage of clips of   and other types of sequences  —   shows. Before Mr. Chan was a star, he was an acrobat and a stuntman, who worked with another legend, Bruce Lee, on the 1972 film “Fist of Fury. ” In an interview with Inside   magazine, Mr. Chan explained that much of his physical skill was intuitive, partly because he had started basic physical training when he was 6 or 7 years old. “After all those years, it becomes very natural,” he said. “It’s actually very hard to tell you how I train, because I just ‘know’ what to do. When I lose my balance, you just know how to get it back. So, this way, when I do a stunt, I do get hurt sometimes  —   but less than some other people. ” 5. Tony Zhou, the movie buff who cocreates the clips on the YouTube channel Every Frame a Painting, narrates this clip, an analysis of Mr. Chan’s ability to combine action and comedy. (Mr. Zhou declined to comment for this article.) In the clip, Mr. Zhou illustrates Mr. Chan’s depth of knowledge about film more generally, including directing and editing, commenting on his framing choices and camera angles. He also elaborates on the difference between movies shot in Hong Kong, where Mr. Chan was often given months to get scenes right, and those made by American directors, which sometimes obscure the actor’s genius.'"}, "time": 1742628427.4541848}