{"duration": 0.04487490653991699, "input_args": {"text": "\"Hillary Campaign Fakes It Most of the Time November 03, 2016 Hillary Campaign Fakes It Most of the Time \\nNewly-leaked emails show that a major figure in Democratic nominee Hillary Clinton’s presidential campaign urged the Democratic National Committee (DNC) to schedule meetings with other prospective presidential candidates to make the process appear less biased. The email, sent January 2015 before the official launch of Clinton’s campaign, is part of the latest dump of John Podesta emails by the online hacktivist group Wikileaks. The message, authored by campaign manager Robby Mook, is about a planned meeting between Clinton and then-DNC Chair Debbie Wasserman Schultz It also describes a meeting between Mook and White House political adviser David Simas. Mook’s message mostly deals with mundane political details, but at the end he makes an interesting comment that suggests an awareness of pro-Clinton bias at the DNC. \\n“I asked [Simas] that he make sure she [DWS] has meetings scheduled with other potential candidates, so they can credibly say they’re meeting with everyone.” \\nThe sentence is brief but carries a clear implication: Mook is urging the DNC to set up meetings for the sole purpose of looking like it isn’t in the tank for Clinton’s campaign. \\nREAD MORE: FOX'S CHRIS WALLACE GRILLS ROBBY MOOK OVER HILLARY CLINTON CAMPAIGN SCANDALS \\nThe emails supplement an ample amount of existing evidence that the DNC overtly favored Clinton during the presidential primary process, despite the fact it is supposed to be politically neutral between different Democratic candidates. For instance, then-deputy DNC Chair Donna Brazile fed primary debate questions to Clinton’s campaign, while leaked DNC emails from the summer showed a great deal of official hostility towards Sen. Bernie Sanders’ campaign. \\nMook’s comment indicates the Clinton campaign was very aware of the DNC’s bias from the beginning of 2015, and was directly advising Wasserman Schultz on how she could make this bias less obvious. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories\""}, "time": 1742563960.1888556}