{"duration": 0.05647444725036621, "input_args": {"text": "'Subscribe \\nComey didn’t close the whole investigation on Hillary Clinton case he only cleared Clinton’s use of private server what he wrote as you can see in the letter below is: “with respect to former Secretary of State, Clinton’s use of a personal email server”… Does not apply to Clinton Foundation investigation, which is ongoing.The mainstream media is trying to protect Hillary before election day and is ignoring this crucial information FBI has three ongoing investigations! \\nHowever, we would be remiss if we didn’t remind everyone about the original Comey letter to congress. \\nEverything is clear here there are three ongoing FBI investigation on Hillary Clinton case: The Clinton Foundation Probe: We’ve learned an FBI probe of the Clinton Foundation for possible financial crimes and influence peddling has been in progress for over a year. The Podesta Brothers: Most of those WikiLeaks bombshells the Clinton media is ignoring with such furious intensity are to, from, or copied to John Podesta, the CEO of Hillary Clinton’s campaign, and probably the most powerful figure in Clintonworld not named “Clinton.” Terry McAuliffe’s Campaign Donations: The Clintons’ old friend Terry McAuliffe, currently the governor of Virginia, has been under FBI investigation for over a year by the Public Integrity unit over campaign fundraising and donations. Part of that investigation involves his time with the Clinton Global Initiative. Comey didn’t say he was closing any case, just that he is not recommending any charges. We know that they will reopen it again if more evidence comes about. She has not been exonerated by a court. Just because crony FBI official is not recommending charges does not mean she is innocent.” Share this article everywhere and help us expose the truth about Hillary Clinton Facebook Comments '"}, "time": 1742561958.3426867}