{"duration": 0.10178589820861816, "input_args": {"text": "'The United States got its first gold of the Rio Games from a teenager who wasn’t expected to medal and its last from the men’s basketball team, an   collection of N. B. A. players who came into the Olympics as the overwhelming favorite. Like the    Ginny Thrasher, who opened the finals of the   air rifle event with a bull’  on her way to the upset victory, the Americans, led by Kevin Durant, were perfect, at least on paper, capping off an   campaign with a   thrashing of Serbia in Sunday’s   game. With the victory, the Americans extended their winning streak in the Olympics to 52 games and sent Mike Krzyzewski into his Team U. S. A. retirement as the first coach to win three Olympic gold medals. The Serbians did not have a scorer reach double figures until late in the fourth quarter. They had given the Americans one of their toughest tests in the preliminary rounds, coming within a missed   of sending the game into overtime before succumbing by  . Despite early foul trouble, Serbia was within four points of the Americans after the first quarter. The U. S. squad earned few style points during the tournament with its isolation offense, but it started to move the ball better as the game went on and wisely got it in the hands of Durant, who finished with 30 points. Durant, who left the Oklahoma City Thunder last month to join his U. S. Olympic teammates Klay Thompson and Draymond Green on the Golden State Warriors, took over the game in the second quarter. His highlight reel included a spectacular   run in the span of less than a minute that included    contested   and a steal that he finished emphatically with a dunk. At halftime, Durant had 24 points, five fewer than Serbia, which trailed by  . “I just tried to go out there and be who I am,” Durant said, adding that in the first few games of the tournament, “I was trying too hard to sacrifice and make the extra pass and it was taking away from my game. ” Durant was finished for the night before any Serbian player reached double figures. “We just wanted to play a good game,” Durant said, adding, “To come out there and play as well as we did against a team that had stepped up its level as well shows that we came together at the right time. ” The Serbian defense that had locked down Australia, holding its semifinal opponent to 14 points in the first half, could not slow the Americans, who made several shots with hands in their faces. The United States shot 44 percent from the field. Serbia, which shot 38 percent, was led by Nemanja Nedovic’s 14 points on 10 shots. Durant, at the urging of his team, had 19 attempts. As Krzyzewski joked, “It’s called the ultimate green light. ” The Serbian coach, Aleksandar Djordjevic, said that from the second quarter on, “Our morale was going down. ” The Americans’ margin of victory in their first seven games was 21. 4 points, which sounds impressive until measured against the gold standard set by the 1992 team, the first to include N. B. A. players, which beat its opponents by an average of 44 points. The U. S. mission to win gold allowed for few frivolities. Citing the energy drain of mixing and mingling with other Olympians, the American men and women players stayed on a cruise ship, eschewing the athletes’ village, where they might have run into Usain Bolt, whose individual star power outshines the Americans’ collective eminence. That is not to say the men lived in a bubble. The Knicks’ Carmelo Anthony ventured into a favela to play   basketball with youngsters and the Pacers’ Paul George met and had his photograph taken with the Brazilian soccer star Ronaldo. Anthony, criticized for his inability to bring an N. B. A. championship to Denver or New York, now has three golds to go with his bronze from 2004 as a member of the only U. S. men’s team since 1992 that failed to win. Anthony had seven points and also finished with seven rebounds for a career total of 125 to pass David Robinson as the   U. S. leader. He struggled to corral his emotions afterward as he reflected the journey that has seen him become the most decorated male player in Olympic basketball history. Anthony, who said this was his final game for Team U. S. A. said, “I don’t think I can explain how I feel right at this very moment. ” During the medals ceremony, Anthony exercised his leadership role one last time, pointing out to his teammates where the flag was during the playing of the national anthem. ”I just told them look at the highest flag,” he said.'"}, "time": 1742563367.990188}