{"duration": 0.03351998329162598, "input_args": {"text": "'November 12, 2016 \\nA Romford man has admitted feigning a cardiac arrest in order to prevent a situation whereby he would have had to thank the same person up to five times for holding a series of doors open for him. \\nOffice worker, Dave Simmons, 35, explained that his workplace contains a number of long corridors, partitioned into sections by a series of five double-doors. \\n“A guy I don’t really know got to the first door before me,” Explained the embarrassed HR assistant. “He noticed I was following so he held it open for me. I thanked him, and you’d think that was that. Well, not by a long chalk.” \\n“When we got to the second door, we both realised what was going to unfold,” Said Simmons who had just been forcibly ejected from the local A&E department. “So he held the second door and I thanked him again.” \\n“As etiquette requires, we both snorted a laugh and shook our heads but by this time we realised that a third door was coming up and we were both crippled with embarrassment – I mean, what’s the protocol here? I don’t know, that’s for sure.” \\n“So after the third door I just laughed too loud and about halfway up the next bit of corridor I grabbed my chest, hit the deck and started making an alarming wheezing noise. I could tell we were both relieved.” \\nThe door-holder in question was an office temp who had only been working at the building for a few days and it was he who called the ambulance. \\n“It’ll take me a while to get over this,” Said the minimum-wage earner. “It was so embarrassing, but thanks to Mr. Simmons’s quick thinking I’ll know what to do next time. Probably put it on my CV.” \\nSimmons says the fact that he may face legal proceedings for misuse of the emergency services does not make him regret his actions. \\n“I’d do it again in a heartbeat – no pun intended.” He said, clearly intending the pun. UniversalExile'"}, "time": 1742562668.580362}