{"duration": 0.1511523723602295, "input_args": {"text": "'WASHINGTON  —   President Trump will instruct federal agencies on Monday to assemble a budget for the coming fiscal year that includes sharp increases in Defense Department spending and drastic enough cuts to domestic agencies that he can keep his promise to leave Social Security and Medicare alone, according to four senior administration officials. The budget outline will be the first move in a campaign this week to reset the narrative of Mr. Trump’s   White House. A day before delivering a   address on Tuesday to a joint session of Congress, Mr. Trump will demand a budget with tens of billions of dollars in reductions to the Environmental Protection Agency and State Department, according to four senior administration officials with direct knowledge of the plan. Social safety net programs, aside from the big entitlement programs for retirees, would also be hit hard. Preliminary budget outlines are usually   administrative exercises, the first step in negotiations between the White House and federal agencies that usually shave the sharpest edges off the initial request. But this plan  —   a product of a collaboration between the Office of Management and Budget director, Mick Mulvaney the National Economic Council director, Gary Cohn and the White House chief strategist, Stephen K. Bannon  —   is intended to make a big splash for a president eager to show that he is a man of action. Mr. Trump’s top advisers huddled in the White House this weekend to work on his Tuesday night   address. They focused on a single, often overlooked message amid the chaos of his first weeks in the White House: the assertion that the   candidate is now a president determined to keep audacious campaign promises on immigration, the economy and the budget, no matter how sloppy or disruptive it looks from the outside. “They might not agree with everything you do, but people will respect you for doing what you said you were going to do,” said Jason Miller, a top communications strategist on the Trump campaign who remains close to the White House. “He’s doing something first, and there’s time for talk later,” Mr. Miller added. “This is ultimately how he’s going to get people who didn’t vote, or people who didn’t vote for him, into the fold. Inside the Beltway and with the media, there’s this focus on the palace intrigue. Out in the rest of the country, they are seeing a guy who is focused on jobs and the economy. ” The budget plan, a numerical sketch that will probably be substantially altered by House and Senate Republicans  —   and vociferously opposed by congressional Democrats  —   will be Mr. Trump’s first big step into a legislative fray he has largely avoided during the first 40 days of his administration. Thus far, instead of legislating, he has focused on a succession of executive orders on immigration and deregulation written by Mr. Bannon’s small West Wing team. Resistance from federal agencies could ease some of the deepest cuts in the initial plan before a final budget request is even sent to Congress. And Capitol Hill will have the last word. To meet Mr. Trump’s defense request, lawmakers in both parties would have to agree to raise or end statutory spending caps on defense and domestic programs that were imposed by the 2011 Budget Control Act. Mr. Trump is in a highly unusual position at a time when most presidents are finding their footing or confronting crisis. Despite his lament that he was handed “a mess” by President Barack Obama, Mr. Trump inherited a low unemployment rate, a lack of international crises requiring immediate attention and majorities in both houses of Congress. By contrast, when Mr. Obama took office, the country was losing 700, 000 jobs a month, and the global financial system was teetering on the edge of collapse. By the time he stepped up to the rostrum for his first joint congressional address on Feb. 24, 2009, he had already accrued an impressive string of accomplishments, including the passage of a massive stimulus bill through the   Congress, a gender   act, a children’s health insurance law and executive actions that would ultimately help stabilize the financial and automotive sectors. With the prospect of a second Great Depression still high, Mr. Obama sought to rally the country, vowing, “We will rebuild, we will recover, and the United States of America will emerge stronger than before. ” Mayor Rahm Emanuel of Chicago, who was Mr. Obama’s first chief of staff, said in an interview Sunday night that Mr. Trump was trying to create a “sense of urgency, which most people aren’t feeling right now, which was a reality to us” in order to generate support for his unspecified economic agenda, including an infrastructure bill and a tax overhaul. “When it comes to all of these executive orders, the question is, does the public view what he’s doing as action or motion?” Mr. Emanuel added. “If you don’t have real action, you create a sense of motion, so the public views it as progress. ” In putting together their budget plans, White House officials are operating under the assumption that the rate of the United States’ economic growth this year will be 2. 4 percent, according to one person who has been briefed on the matter. That is slightly ahead of current projections, but it is well below the 3 percent to 4 percent growth that Mr. Trump promised during the campaign. For next year, the operating assumption is only slightly higher, that person added, a sign that the budget process will not be too out of step with economic reality. The turmoil that has engulfed Mr. Trump’s West Wing is largely of his own devising  —   part of a calculated effort by Mr. Bannon to move boldly despite his team’s lack of experience, and despite the reluctance of many mainstream Republicans to work for a president whom many of them opposed in the party’s brutal primaries. “During his first month in office, President Trump has done exactly what he said he was going to do,” said Thomas Barrack Jr. a longtime friend of Mr. Trump’s who ran his inaugural committee. “No president has worked harder or accomplished as much, even with tremendous political resistance forcing him to operate with a small team of outsiders possessing little government experience. ” Lawmakers in both parties have complained that the president’s big words are not yet matched by detailed policy prescriptions or a legislative affairs team capable of executing such undefined promises as repealing and replacing the Affordable Care Act or rewriting the tax code. The budget outline will give Mr. Trump an opportunity to add some specifics to an agenda that has been defined by bellicose speech and the broadest possible policy strokes. Still, aides said Mr. Trump did not plan to change his style for Tuesday’s address. The speech, they said, is likely to have more in common with his clipped inaugural address  —   in which he declared, “The time for empty talk is over”  —   than the   litanies of policy proposals favored by President Bill Clinton or the   invocations of national purpose preferred by President George W. Bush and Mr. Obama. Mr. Trump’s team, conscious of his recent reversals and a   approval rating that is among the lowest ever recorded, has emphasized his determination to break the partisan gridlock and inaction that has kept congressional approval ratings in the 15 to 30 percent range for years. At the start of an interview last week with Sean Hannity of Fox News at the Conservative Political Action Conference, Kellyanne Conway, the president’s counselor, called him “President Action, President Impact, Donald J. Trump. ” In a   of Sunday show interviews, Stephen Miller, Mr. Trump’s policy adviser, maintained that the president had accomplished more in his first month than most of his predecessors had in their entire administrations. In reality, most of Mr. Trump’s executive actions have had no more effect on actual policy than news releases. And his     order on the   Partnership trade deal came well after the agreement had been put on life support by labor protests and liberal opposition. One West Wing official, who requested anonymity to speak candidly about strategy, said the administration craved the   television images of Mr. Trump at   discussions with business executives every few days on one side, and the vehement protesters of his administration on the other. But his critics say such photo opportunities are all an act, a      rendition of “The Apprentice” by an ineffective rookie president. “This man is not a doer,” said Representative Nancy Pelosi, the House minority leader, who will host a Monday “ ” of Mr. Trump’s Tuesday speech. “Oh, please. He has nothing to show for what he’s been doing in office for 40 days. It’s all been squandered. ”'"}, "time": 1742561635.8968608}