{"duration": 0.06560945510864258, "input_args": {"text": "'TEL AVIV  —   The organizers of Wednesday’s International Women’s Strike, which includes a convicted Palestinian terrorist, have expressed their support for the “decolonization of Palestine” and said they are against the “white supremacists in the current government. ”[“Against the open white supremacists in the current government and the   and   they have given confidence to, we stand for an uncompromising   and   feminism,” the platform published on their website.  “This means that movements such as Black Lives Matter, the struggle against police brutality and mass incarceration, the demand for open borders and for immigrant rights and for the decolonization of Palestine are for us the beating heart of this new feminist movement. We want to dismantle all walls, from prison walls to border walls, from Mexico to Palestine. ” One of the march’s   is Rasmea Odeh, a former member of the Popular Front for the Liberation of Palestine (PFLP) designated by the U. S. as a terrorist group. Odeh was arrested for her alleged involvement in two bombings in the late 1960s. Two Israeli university students were killed and nine more were injured. In 1980, Odeh was freed from an Israeli jail as part of a prisoner exchange deal, and a decade later emigrated to the U. S. She recently made headlines again after being charged with immigration fraud for lying about her terrorist background when applying for U. S. citizenship. In an oped published by the Guardian last month entitled, “Women of America: we’re going on strike. Join us so Trump will see our power,” Odeh and her cohorts urged the mobilization of women  —   including trans women  —   to strike against “attacks on Muslim and migrant women, on women of color and working and unemployed women, on lesbian, gender nonconforming and trans women. ” Odeh has also been invited to deliver an address at the upcoming National Member Meeting for Jewish Voice for Peace (JVP). The leftwing organization said it was “honored to feature the deeply respected Palestinian   …     feminist leader,” and added that the accusations against her “stem from a context of     and   persecution by both the Israeli state and the United States, policies which are escalating under the Trump administration. ” JVP added that that her label as a terrorist is a concoction of “Israeli apartheid. ” At the JVP summit, Odeh will speak alongside Linda Sarsour, the     activist who made headlines for becoming the lead plaintiff in the lawsuit against Trump’s executive order on immigration.'"}, "time": 1742563521.7055733}