{"duration": 0.14059925079345703, "input_args": {"text": "'=By= Zoë Carpenter from The Nation \\nA fter a weekend of mass arrests, people protesting the Dakota Access Pipeline are preparing for another clash with a growing and increasingly militarized police force near Cannon Ball, North Dakota. On Sunday, demonstrators set up a new camp, called Winter Camp, in the pathway of pipeline construction, on what they consider unceded territory belonging to them under the 1851 Laramie Treaty. But Dakota Access LLC, the pipeline developer, said in a statement that they would be “removed from the land,” which the company purchased from a local rancher last month. Police said on Wednesday that they are prepared to carry out that threat. “It’s obvious we have the resources, we have the manpower, to go down there and end this,” Cass County Sheriff Paul Laney said in an interview. \\nAs the prospect of a raid on the Winter Camp looms, human-rights groups are increasingly concerned about law enforcement’s use of force against peaceful pipeline protesters (who call themselves “water protectors”), as well as journalists and legal observers. Demonstrators reported being pepper sprayed, beaten with batons, and strip searched in custody during the weekend’s arrests. Journalists were also arrested, and had their equipment confiscated. \\nIn a Facebook post, Morton County Sheriff Kyle Kirchmeier described Saturday’s demonstration as a “riot,” and wrote that the “situation clearly illustrates what we have been saying for weeks, that this protest is not peaceful or lawful.” But it wasn’t immediately clear what he meant by a riot: The photo that accompanied the Facebook post showed protesters walking calmly through a field carrying banners and signs. Video footage showed people standing together, backing up as police approached. The only supposedly aggressive acts that the sheriff’s department described in any specific form included that two arrows were shot towards law enforcement, one officer was spit on, and that a drone that protesters were using to monitor police activity “attacked” a helicopter. \\nOn Sunday, the Morton County Sheriff called for additional law-enforcement personnel from outside North Dakota. Officers from at least six other states—Wisconsin, South Dakota, Minnesota, Wyoming, Indiana, and Nebraska—have arrived so far. In his call for more resources, the sheriff cited “escalated unlawful tactics by individuals protesting the construction of the Dakota Access Pipeline.” State and local officials also requested, and received , temporary flight restrictions from the Federal Aviation Administration in a seven-mile radius around the protest camps, which may be an attempt to keep away news helicopters, as it was during the 2014 protests in Ferguson, Missouri. \\n“We have heard reports of escalation [from law enforcement], and we continue to be concerned with a number of issues,” said Tarah Demant, the senior director of Amnesty International’s Identity and Discrimination Unit. She cited the “sheer number” of police that have been brought into the area; their use of military-style equipment including riot and camouflage gear, semi-automatic weapons, and armored vehicles; and the force that they’re using to make arrests. “If police are making arrests—for example, for trespassing—they must be done in a way that upholds the rights of the people who are being arrested. And they need to be commensurate with the crime. The idea that police need to come out with pepper spray…is worrisome,” Demant said. “If there is a riot, then police or authorities have to provide evidence of that.” \\nDemant is also concerned with rhetoric coming out of the Morton County Sheriff’s office. The department has repeatedly emphasized that protesters are violent, though there is little evidence to back up its claim. In September, for instance, Kirchmeier spread a rumor that demonstrators were threatening to use pipe bombs against officers. “We’ve seen this in multiple places across the world, and in dictatorships. Declaring that something is a riot is a way to shut down protests,” Demant said. “If there is a riot, then police or authorities have to provide evidence of that.” She said the response from North Dakota officials fits a pattern of increasing militarization of law enforcement across the country, but that it also echoes a long history of official, state-sanctioned violence against indigenous people. \\nLaw enforcement officials have said that they are only responding to illegal activity on private property. “We’re having our hand forced…. we have to defend rule of law, and we have to make those arrests,” Sheriff Laney said in the Wednesday interview. But Jennifer Cook, the policy director for the American Civil Liberties Union of North Dakota, said that, while trespassing is illegal, it’s not a crime that warrants a militarized response. “Even if [demonstrators] are on private land, and the private landowner requests that law enforcement eject them, it is in no way justified for law enforcement to come out and use excessive force against them,” Cook said. She said that officials have been “ramping up” the seriousness of the charges they’re filing against protesters (and against journalists: Democracy Now! ’s Amy Goodman was arrested on a “riot” charge). She sees that as an attempt to “justify the militarized response,” rather than a reflection of demonstrators’ actually acting aggressively themselves. \\nOn Saturday, Standing Rock Sioux chairman David Archambault II called on the Department of Justice to investigate the “strong-arm tactics, abuses and unlawful arrests by law enforcement” in North Dakota. Though officials have consistently denied that they’ve used excessive force, on Wednesday the Morton County sheriff’s office did admit that the dog handlers whose animals attacked protesters in September “were not properly licensed to do security work in the state of North Dakota.” It took nearly two months for them to reach that conclusion.'"}, "time": 1742563908.558764}