{"duration": 0.06427907943725586, "input_args": {"text": "'“…In 5 cities 8 kings; they ruled for 241,200 years. Then the flood swept over…” that is written on the first part of the Sumerian King List. But how is it possible for eight kings to rule for a period of 241,200 years? \\n\\n\\nIf we take a look at the Sumerian King list, we will find fascinating details that contradict everything we have been told about our history. This ancient text describes a time on Earth when Gods ruled humankind for tens of thousands of years. It explicitly says that before the Great Flood swept across Earth, eight ancient kings lived on Earth and ruled for a total period of 241,200 years. Today, this historical fact is dismissed as mythology.\\n\\nMany of us will agree that the most puzzling detail about the Sumerian King list is that it describes EIGHT kings who ruled over planet Earth for a total period of 241,200 years after the ORIGINAL kingship ‘descended from heaven’ lasting all the way until the ‘Great Flood’ which swept over mankind and once more “the kingship was lowered from heaven” after the Flood.\\n\\nSo how is this possible? What exactly are we missing here? How could eight kings have ruled over five cities for hundreds of thousands of years? Where they immortal? Were they otherworldly beings? Or is it possible that we misinterpreted years for days? Or, as many others believe, did these ancient kings really live through such lengthy reigns?\\n\\n\\nAccording to this ancient text its crystal clear: the first part of the Sumerian King List reads : \\nAfter the kingship descended from heaven, the kingship was in Eridug. In Eridug, Alulim became king; he ruled for 28800 years. Alaljar ruled for 36000 years. 2 kings; they ruled for 64800 years. Then Eridug fell and the kingship was taken to Bad-tibira. In Bad-tibira, En-men-lu-ana ruled for 43200 years. En-men-gal-ana ruled for 28800 years. Dumuzid, the shepherd, ruled for 36000 years. 3 kings; they ruled for 108000 years. Then Bad-tibira fell (?) and the kingship was taken to Larag. In Larag, En-sipad-zid-ana ruled for 28800 years. 1 king; he ruled for 28800 years. Then Larag fell (?) and the kingship was taken to Zimbir. In Zimbir, En-men-dur-ana became king; he ruled for 21000 years. 1 king; he ruled for 21000 years. Then Zimbir fell (?) and the kingship was taken to Curuppag. In Curuppag, Ubara-Tutu became king; he ruled for 18600 years. 1 king; he ruled for 18600 years. In 5 cities 8 kings; they ruled for 241200 years. Then the flood swept over. \\nThere are more than a dozen of copies of Sumerian King Lists, found in Babylon, Susa, and Assyria, and the Royal Library of Nineveh from the VII century BC. All of these are believed to originate from one original list believed to have been written during the Third Dynasty of Ur or even earlier. The best-preserved specimen of the Sumerian King List is called the Weld-Blundell Prism, which is a clay, cuneiform inscribed vertical prism housed in the Ashmolean Museum.\\n\\nAncient-Code \\nSOURCE '"}, "time": 1742564109.7355616}