{"duration": 0.2127385139465332, "input_args": {"text": "'Email \\nIt was fifty-four years or so when a classmate at Bard College insisted that I read a short story by Isaac Babel titled “The Reserve Cavalry Commander” that he described to me as a Cossack soldier miraculously bringing a moribund horse to its feet. The Red Cavalry (the title of Babel’s collection of short stories written when the Jew and former Menshevik was imbedded with pro-revolution Cossacks) had been confiscating peasant horses during the Civil War and trading in nags ridden to exhaustion on the battlefield for fresh ones. \\nFor the backward peasants, this was the sort of intrusion that would become the straw that broke the camel’s back. In about a decade, being forced into collective farms like recalcitrant horses drove them into open revolt. For the time being, however, they were inclined to tolerate the Communists who at least had come to power on the promise of peace, bread and land. It was the assault on the gentry’s land that for the time being assuaged the peasants. \\nResponding to an aggrieved muzhik (peasant), Dyakov, the eponymous Reserve Cavalry Commander who was a former circus rider described by Babel as “red-faced with a gray mustache, a black cape, and wide red Tatar trousers with silver stripes”, promised that he could make this “lively little mare spring to her feet again”. The idea that the horse splayed out on the ground could be described as “lively” was almost an insult. The muzhik cried out, “Lord in Heaven and Mother of God. How is this poor thing supposed to get up? It’s on its last legs!”: \\nDyakov’s ability to bring the horse back on its feet was like Jesus raising Lazarus from the dead but all the more miraculous since it likely occurred. Most of Babel’s short stories were based on his experience as a war correspondent. He wrote: \\n“You are insulting this horse, my dear fellow!” Dyakov answered with fierce conviction. “Pure blasphemy, my dear fellow!” And he deftly swung his athlete’s body out of his saddle. Splendid and deft as if in the circus ring, he stretched his magnificent legs, his trousers girded by cords around the knees, and walked up to the dying animal. She peered at him dolefully with a severe, penetrating eye, licked some invisible command from his crimson palm, and immediately the feeble mare felt bracing power flow from this sprightly, gray, blossoming Romeo. Her muzzle lolling, her legs skidding under her, feeling the whip tickling her stomach with imperious impatience, the mare slowly and deliberate1y rose onto her legs. And then we all saw Dyakov’s slender hand with its fluttering sleeve run through her dirty mane, and his whining whip swatting her bleeding ranks. Her whole body shivering, the mare stood on four legs without moving her timid, doglike, lovestruck eyes from Dyakov. \\n“So you see-this is a horse,” Dyakov said to the muzhik , and added softly, “and you were complaining, my dearest of friends!” \\nThrowing his reins to his orderly, the commander of the Reserve Cavalry jumped the four stairs in a single leap and, swirling off his operatic cloak, disappeared into the headquarters. \\nToday, reading this story once again for the first time in fifty-four years, I am reminded of how important Babel was to me at the time. Like Ezra Pound, James Joyce and Thomas Mann, he was a portal into the world of modernist literature that still had an immense attraction for young bohemians in the early 60s. I never thought once about who Babel was or anything about the social reality he was trying to depict. All that mattered to me was Babel’s prose that could evoke the mysterious power of a Cossack resurrecting a dying horse. \\nMy early connections to modernism and my later connections to Marxism that superseded it and just about all the other intellectual baggage I carried around with me from the early 60s converged as I watched a press screening of “Finding Babel” that opens on October 28 th at the Cinema Village in New York. Directed by David Novack, who has a background as a sound engineer, it is a film that will be of great interest to those whose appreciation of Babel is strictly literary as was mine long ago and to those trying to come to terms with the Soviet legacy. Given the prominence of Ukraine today as a possible trigger of WWIII according to some, Babel’s multiple identity as Jew, Ukrainian, Communist and critic of Soviet deficiencies is worth pondering. \\nThe film is structured around the odyssey conducted by Andrei Malaev-Babel, who is the grandson of Isaac Babel and an acting professor in the theater department of the New College of Florida, to see where his grandfather lived and to speak with people who knew him or who have studied or been inspired by his work. Isaac Babel was executed for treason in 1940, having been charged with belonging to a Trotskyist group and spying for France and Austria. Babel’s wife Antonina Pirozhkova, who died at the age of 101 in 2010, is interviewed in the film and provides much of the information about Babel’s personality and his travails as a dissident. After her husband’s arrest in 1939, the Soviet cops told her to forget about him and to “regulate her life” according to the New York Times obituary. She was formidable in her own right. With her engineering degree, she helped to design the Moscow subway system. The obit notes: \\nMs. Pirozhkova recalled Babel’s dismay at her haphazard reading habits, which he tried to correct by drawing up a list of the “hundred books that every educated person needs to read.” It included a volume titled “The Instincts and Morals of Insects.” She recounted evenings spent with Soviet cultural giants like the film director Sergei M. Eisenstein and visits by foreign luminaries like André Gide and André Malraux. \\nIt was Babel’s mistake apparently to adhere to the values of the original Russian revolution rather than to fall in line as a Stalin toady. \\nAs he travels around Ukraine, Malaev-Babel encounters intellectuals and ordinary people who revere Babel as one of their own especially for “Odessa Tales”, another collection of short stories that is as highly regarded as “Red Cavalry”. Written in 1923 and 1924, the stories focus on Jewish gangsters living in Moldavanka, an Odessa slum, hardly the material you’d expect to find written by a partisan of the Russian Revolution but certainly in keeping with the original inspiration of Soviet culture that conformed to Terence’s observation: “ Homo sum, humani nihil a me alienum puto “, or “I am human, and nothing of that which is human is alien to me.” \\nAlthough I have never read “Odessa Tales”, I plan to as soon as I find the time since it is about the same sort of characters my grandfather Louis Proyect probably knew in Byelorussia and who like him escaped pogroms by emigrating to the USA. Unlike my grandfather who made a life out of building hotels in Sullivan County in upstate NY, Abe “Kid Twist” Reles and other members of Murder Incorporated only saw the Borscht Belt as a place where they could dump their victims in Swan Lake, about fifteen minutes from my home town. \\nThroughout the film we hear brief excerpts from both collections narrated by Liev Schreiber that will be a good introduction to Babel’s literary power. There are also interviews with some leading Babel scholars including Stanford professor Gregory Freidin who spent a day traveling around Paris with Malaev-Babel to see places where Babel lived for a few years before returning to Russia. We learn that although he could have avoided becoming one of Stalin’s countless victims by living in exile, he was too attached to Russian culture and language to live abroad. \\nWhile in Paris, Babel wrote a play titled “Maria” that likely put him on Stalin’s shit-list although being a free-thinking intellectual and artist might have condemned from the start. With his theater background, Malaev-Babel is ideally suited to discuss the play with fellow thespians including Marina Vlady, an acclaimed Russian-French actress, who reads a letter from the titular character. \\nIn 2003, Gregory Freidin mounted a production of “Maria” at Stanford University. The play’s program describes major character Isaac Dymshit, a Jewish gangster, as a symbol of capitalist rationality while the eponymous Maria epitomized the pure romance of the revolution. She, like the young Babel, served in the Red Cavalry. \\nNever seen on stage, we only hear from Maria indirectly as her letter is recited by another character in scene five. It begins: \\nAt dawn the bugle from squadron headquarters wakes me. By eight I have to be in the Political Propaganda Division, I’m in charge there–I edit the articles of the divisional newspaper, I run the literacy classes. Our reinforcements are all Ukrainians. They remind me of Italians, the way they talk and act. Russia has been suppressing and destroying their culture for centuries. In our house in Petersburg, opposite the Hermitage and the Winter Palace, we might as well have been living in Polynesia for we knew any\\xad thing at all about our people! \\nIt is writing lines like this that got Babel killed rather than spying for France or Austria. \\nBabel was a friend and protégé of Maxim Gorky, who remained a diehard Stalinist despite sharing Babel’s inclination for writing about the lower depths of Russian society. He was deeply troubled by how “Maria” depicted political corruption, prosecution of the innocent, and black marketeering within Soviet society. Gorky accused Babel of having a “Baudelairean predilection for rotting meat.” Apparently Gorky had forgotten that Baudelaire was Marx’s favorite novelist. \\nDavid Novack, the director of “Finding Babel” has a connection to Odessa but not to its legendary Jewish gangsters. He has an ancestor named David Nowakowsky who wrote liturgical music for a synagogue there. \\nIn an interview given to The Odessa Review , Novack sums up Isaac Babel’s relationship to the Soviet experience that resonates with my own on the left. As someone with roots in the existential “outsider” world of the 1960s that saw Albert Camus as its most eloquent spokesmen, I never found myself comfortable with the Trotskyist milieu that fostered cultish obedience to the Genius Leader. To this day, it has been these youthful affinities with outsider culture that makes it difficult for me to join any amen chorus on the left even though it is the left that remains my homeland. I think that Novack’s description of Babel’s “insider/outsider” sensibility can help me preserve my sanity in a period of deep contradictions within the left: \\nBabel represented the insider outsider, that’s what he was. He got himself all the way inside, up to the upper levels of the NKVD. Up to Beria who ended up supervising his torture in the end, personally. I don’t know if he was in the room, but he had an office in the St. Catharine’s Monastery where Babel was tortured. That monastery was being used as a torture prison, the Sukhanovo prison, which we note in the film, we visited it. He got himself as close to the flame as possible as an insider, but yet he was an outsider because he was from Odessa, he was Jewish. He should not even have been permitted to study under Gorky which is where he really honed his skills. The only reason that he was able to study under Gorky is that he smuggled himself illegally to St. Petersburg when he wasn’t allowed to be there, because it was outside the settlement area for Jews. So Babel was an outsider. He then found himself with Red Calvary with the Cossacks in the Red Army, running through Western Ukraine as he documented brutality against the Ukrainians and the Jews. Brutality brought on by both sides, it was a civil war essentially between the reds and the Poles. Who suffered the most? The Jews and the Ukrainians, the peasantry are the ones who suffered the most in that conflict. There he was again, the outsider insider. It’s from this very unique perspective where all his writing came from.'"}, "time": 1742563264.1760514}