{"duration": 0.216444730758667, "input_args": {"text": "'A Caddo Nation tribal leader has just been freed after spending two days behind bars in North Dakota. Family members say she was simply an innocent bystander in a clash between police and protesters, and was not guilty of anything the police claimed. \\nVia AlternativeNews \\n\\nJessi Mitchell, of local News 9 reports that “family members of Caddo Nation chairwoman Tamara Francis-Fourkiller said an anonymous donor paid $2.5 million late Saturday afternoon to release everyone arrested on Thursday at the Dakota Access Pipeline site.”\\nThey added, however, that Francis-Fourkiller was never supposed to have been arrested in the first place. “An expert on sacred burial grounds , Francis-Fourkiller was one of the tribal leaders visiting the Sioux of Standing Rock to advise them during negotiations with the Dakota Access Pipeline construction team,” Mitchell continues. “Remains were being desecrated in this pipeline, so they had asked a bunch of people to come up there, so there’s a big conference,” Francis-Fourkiller’s sister Loretta Francis explained.\\nOn the visit , Francis said her sister and other leaders decided to tour the protest camps. They never thought they would wind up in jail. Francis said her sister had no access to her medication while in custody in Cass County, North Dakota, and now faces charges of conspiracy and rioting. “Part of my family was removed on the Trail of Tears and they came here to Oklahoma and they suffered,” said Francis. “I always feel like each generation – our parents, our grandparents – try to make it better for the next generation and they certainly didn’t want this for my sister.”\\nDozens of Native Americans from Oklahoma tribes had gathered Saturday afternoon at the state Capitol, according to Mitchell, with the purpose of voicing their “anger at the treatment of the protesters in North Dakota, pointing out this week’s acquittal of armed protesters at an Oregon wildlife refuge earlier this year.”\\n“We’re not holding guns. We’re not armed, and when we see the military right here in the US use that on us, it’s shameful,” Comanche Nation tribal council member Sonya Nevaquaya explained.\\nOne of the fundamentals of all Native American tribes is the protection of the land. Chanting “Water is life!” Saturday, the Oklahoma demonstrators hope to rally people from around the country to stand with those in North Dakota and stop construction on the pipeline project. “These pipelines, you hear of a lot of bursts and leaks and it contaminating the waters. What happens when all of our waters and resources are gone?” Nevaquaya explained. Francis-Fourkiller says she will be traveling back to her home in Norman as soon as possible.\\n'"}, "time": 1742561618.8520632}