{"duration": 0.09087419509887695, "input_args": {"text": "'Jake Turx is a newly minted White House correspondent for a publication that has never before had a seat in the White House press corps: Ami Magazine, an Orthodox Jewish weekly based in Brooklyn. He is a singular presence in the briefing room: a young Hasidic Jew with side curls tucked behind his ears and a skullcap embroidered with his Twitter handle. When President Trump called on him at a news conference on Thursday, saying he was looking for a “friendly reporter,” Mr. Turx was prepared. He had spent an hour crafting a question about a recent surge of   with a preamble that he hoped would convey his supportive disposition toward Mr. Trump. But the exchange did not go the way he expected. A few hours later, with the clip replaying on social media and Jewish groups issuing news releases, Mr. Turx, 30, was still reeling. He said in a telephone interview, “Regretfully, today was a day I wish we could have done over. ” His editor, Rabbi Yitzchok Frankfurter, watched aghast from the magazine’s offices as his young correspondent received a   from the president: “It was a very disheartening moment for us, to watch him being berated. ” The exchange began with Mr. Turx standing up from his   seat and gesturing slightly toward his fellow reporters: “Despite what some of my colleagues may have been reporting, I haven’t seen anybody in my community accuse either yourself or anyone on your staff of being  . We understand that you have Jewish grandchildren. You are their zayde,” which is Yiddish for “grandfather” and often a word of great affection. At that Mr. Trump nodded slightly, and said, “thank you. ” “However,” Mr. Turx continued, “what we are concerned about and what we haven’t really heard being addressed is an uptick in   and how the government is planning to take care of it. There’s been a report out that 48 bomb threats have been made against Jewish centers all across the country in the last couple of weeks. There are people committing   acts or threatening to —   —  ” At that, Mr. Trump interrupted, saying it was “not a fair question. ” “Sit down,” the president commanded. “I understand the rest of your question. ” As Mr. Turx took his seat, Mr. Trump said, “So here’s the story, folks. No. 1, I am the least   person that you’ve ever seen in your entire life. No. 2, racism, the least racist person. ” Mr. Turx tried to interject, realizing how the encounter had turned. He said he had wanted to clarify that he in no way meant to accuse Mr. Trump of   but instead intended to ask what his administration could do to stop the   incidents. But Mr. Trump would not let him speak again, saying, “Quiet, quiet, quiet. ” As Mr. Turx shook his head with an incredulous look on his face, Mr. Trump accused him of having lied that his question would be straight and simple. Mr. Trump said, “I find it repulsive. I hate even the question because people that know me.   …    ” He went on to say that Prime Minister Benjamin Netanyahu of Israel, during his visit to the United States on Wednesday, had vouched for Mr. Trump as a good friend of Israel and the Jewish people and no  . Mr. Trump concluded that Mr. Turx should have relied on Mr. Netanyahu’s endorsement, “instead of having to get up and ask a very insulting question like that. ” “Just shows you about the press, but that’s the way the press is,” Mr. Trump said. At the news conference, Mr. Turx was referring to a rash of incidents that have shaken many American Jews since Mr. Trump was elected. On three separate days in January, Jewish synagogues, community centers and schools across the country received what seemed to be a coordinated wave of telephone bomb threats that led to evacuations and F. B. I. investigations. Other Jewish institutions have seen an uptick in vandalism and graffiti in the last few months. It was the second time in two days that Mr. Trump was asked to denounce   and offer American Jews a dose of reassurance. In his joint news conference with Mr. Netanyahu, Mr. Trump responded to a question about   by breezily recounting the size of his Electoral College victory and then reminding the reporters that his daughter, Ivanka, his    Jared Kushner, and their three children  —   Mr. Trump’s grandchildren  —   are all Jewish. The   League issued a statement on Thursday that said, “It is   why President Trump prefers to shout down a reporter or brush this off as a political distraction. ” David Harris, chief executive of the American Jewish Committee, said, “Respectfully, Mr. President, please use your bully pulpit not to bully reporters asking questions potentially affecting millions of fellow Americans, but rather to help solve a problem that, for many, is real and menacing. ” Surveys show that Mr. Trump was not the choice of the majority of American Jews, who tend to vote for Democrats and came out in force for Hillary Clinton. Many Jews have been critical of Mr. Trump for not more forcefully denouncing   and racists like David Duke, a former leader of the Ku Klux Klan who endorsed Mr. Trump during the campaign. Many Jewish leaders are also wary of Stephen K. Bannon, Mr. Trump’s White House strategist, because of the close affinity between Breitbart News, which he once ran, and the white supremacists in the movement known as the  . On Friday, the leaders of Reform Judaism, which includes more than a third of American Jews and is the largest stream of American Judaism, announced that they opposed the confirmation of David M. Friedman as ambassador to Israel. The leaders said in a statement that Mr. Friedman, who has supported Israeli settlements in the West Bank, was unqualified, intemperate and held “extreme views” on Israel that will endanger “both American and Israeli security. ” Mr. Trump was popular among many Orthodox Jews. They were reassured to see the Orthodox Jews in his family and attracted to his hawkish line on Israel, his support of vouchers for religious schools and his promise to ban Muslim immigrants from entering the country. Rechy Frankfurter and her husband, Rabbi Frankfurter, founded Ami Magazine more than six years ago to serve a conservative Jewish audience. It circulates in the United States, Canada, Europe and Australia and is one of several   news publications serving the   community. Ami Magazine comes out weekly and has three sister publications: one for women, one for teens and a cooking magazine called Whisk. The magazine interviewed Mr. Trump before he declared he was running for president and did so again during the campaign. “We didn’t do a political endorsement of him, but I really wanted the president to be elected, and I do want him to succeed,” said Rabbi Frankfurter, the editor in chief. Mrs. Frankfurter, the magazine’s senior editor, said it was clear that Mr. Trump was not an   and that Mr. Trump “must have misheard the question” from the magazine’s reporter. “The president is very sensitive to such an accusation, and we find the fact that he’s sensitive to it reassuring,” she said, because it means he understands how awful it is to be thought of as an  . Rabbi Frankfurter, whose parents survived the Holocaust, said, “Perhaps the president should speak out more vigorously than he has. He’s got a bully pulpit, and he should use it for good reasons. ” After the news conference, Mr. Turx, a pen name, said that he had had conversations on Thursday evening with White House staff members and that he and members of the Orthodox Jewish community were “extremely confident” that the White House would give “the proper help, guidance and collaboration” on  .'"}, "time": 1742628337.75975}