{"duration": 0.05911397933959961, "input_args": {"text": "'The Pentagon cannot account for $6.5 trillion dollars according to a new Department of Defense Inspector General’s report– raising alarm bells not just because of the obvious lack of accountability and oversight, but because the last time the Pentagon ‘lost’ an enormous sum of money, 9/11 happened. \\nVia UsualRoutine \\n\\nDonald Rumsfeld was due to testify about a missing $2.3 trillion before Congress on September 13 2001, however the case was put on hold after the events of September 11.\\nScroll Down For Video Below The paper trail was destroyed when one side of the Pentagon was blown up, and the $2.3 trillion dollar case was brushed under the rubble. The new case of the missing trillions, and the combustible political climate in the U.S. in 2016, has left many commentators fearing that “something big is about to happen again.”\\nEveryone knows by now that the US military has the largest budget on the planet. It’s so large in fact, that it could pay for China’s military budget 3 times over. Which has to make you wonder, where does all of that money go? You may think that question has an obvious answer, since we are aware of most of the military’s weapon systems, personnel numbers, and equipment.\\nIn reality, we don’t know. And when I say we, I mean even our own government doesn’t really know. In response to Congressional demands that the Pentagon provide a comprehensive audit of their finances for the first time, a Department of Defense Inspector General’s report was published last week. It revealed that the Pentagon could not provide documentation pertaining to $6.5 trillion in transactions.\\nOn top of that, the report showed that the Pentagon “did not document or support why the Defense Departmental Reporting System . . . removed at least 16,513 of 1.3 million records during Q3 FY 2015. As a result, the data used to prepare the FY 2015 AGF third quarter and year-end financial statements were unreliable and lacked an adequate audit trail.” Sounds like the Pentagon is deliberately hiding some of their expenses, doesn’t it?\\nWhich wouldn’t come as a surprise, since the Pentagon has been ignoring a federal law passed 20 years ago, which mandates regular audits for all government agencies. In that time, they’ve never once provided a good explanation for where their our money is spent. Is this money being burned up in fraud and waste, or are they spending it on clandestine activities that would outrage the American people? Since they never get in trouble for ignoring our auditing laws, we’ll probably never know.\\n'"}, "time": 1742562252.8058245}