{"duration": 0.1002953052520752, "input_args": {"text": "'Hans von Spakovsky of the Heritage Foundation, formerly an attorney with the Department of Justice, said he expected “fireworks” at the confirmation hearings for attorney general nominee Sen. Jeff Sessions on Tuesday’s Breitbart News Daily. [“What’s going on here is that, look, professionally, Jeff Sessions has the perfect background to be the U. S. Attorney General  —   from being a line prosecutor working for the Justice Department, to being a U. S. attorney, to being the state Attorney General in Alabama. Professionally, he’s got the perfect background for this,” von Spakovsky said.  “But Democrats really don’t like him because of his views on issues,” he continued. “For example, they really don’t want someone who’s actually going to enforce our immigration laws. They’ve been giving him a hard time in the civil rights area too, even though many of their criticisms really have been false. So they’re going to give him a very hard time, even if they eventually, perhaps, on the Democratic side will vote for him, because they have to make their liberal advocacy groups that support them happy that they gave him a hard time. ” SiriusXM host Raheem Kassam suggested that Democrats would be “uncouth” to Sessions to gin up donations and political support from their base. “Yes, because I think that’s going to anger the same people all around the country that voted for Donald Trump,” von Spakovsky agreed. “And you can tell how this is going because after Sessions testifies, they’re actually pulling up a panel of other witnesses. And who have the Democrats called? They have called the director of the ACLU, the president of the NAACP, and a woman from an LGBT group. All of them are simply going to be critical of him on issues, not his professional background  —   and that’s not a reason to not vote for him for confirmation. ” Kassam asked von Spakovsky to discuss his recent article about how Democrats have tried to portray strong action against voter fraud by Sessions as a nefarious attempt to suppress the minority vote. “When he was a U. S. attorney in Alabama, he prosecuted three local civil rights activists who were accused of voter fraud,” von Spakovsky recalled. “They were stealing absentee ballots from voters  —   black voters  —   and changing the votes. Unfortunately, the jury found them innocent, and so ever since then, he’s been accused of having pushed this for racist reasons he was trying to suppress the black vote. ”  “What all those stories leave out is that the reason this case was prosecuted was because local black voters and local black candidates called the FBI and called Sessions, saying, ‘Look, we think our vote is being stolen by these other black candidates,’” he noted. There was a power struggle going on inside the Democratic party. This was an   county, in these races. The federal grand jury was presented with overwhelming evidence that these three defendants were stealing ballots. ”  “Yeah, a jury found them innocent, but I actually found and interviewed the   career Justice Department lawyer who worked on this case, and he said it was clearly a case of jury nullification,” von Spakovsky said. “These folks were local activists, and the jury wasn’t going to find them guilty no matter what they did. One quick example: a family of six people,   testified in court that one of the defendants had changed their votes without their permission, and yet the jury didn’t believe them. They, instead, believed the defendant when he said, ‘Well, yeah, I did change their votes, but I had their permission to do it. ’” As Kassam put it, Sessions was “opposing the exploitation of minority groups, and this is now being used as a cudgel against him. ” “The NAACP came down to this case, and instead of wanting to get these   convicted, they actually provided lawyers to defend these folks in the lawsuit,” von Spakovsky marveled. He said the Democrats’ position was a combination of instinctively viewing “old white guy” Sessions as a racist in a story of conflict with black activists and crass political opportunism by senior Democrats who know perfectly well what really happened in the vote fraud case. “Their attitude towards any voter fraud prosecutions has always been: if the defendants are black, well, you must be doing it for racist reasons,” he noted. “Remember, we saw that in the New Black Panther story out of Philly in 2008, when Eric Holder came in and immediately dismissed the voter intimidation case against them, despite the overwhelming evidence that the Black Panthers had been intimidating voters and poll watchers. It was dismissed by the Obama Justice Department because they didn’t believe that black defendants should be prosecuted. They don’t believe in the   enforcement of the voting and election law. ” As to Sessions’ prospects of making it through the confirmation process, von Spakovsky pointed out that “there’s not a single Republican that has said he’s going to vote against Sessions. ” “I really think the worst that can happen is the Democrats put up a histrionic, almost hysterical, raising of all these issues, make all these false claims against Sessions  —   but in the end, like I said, the Republicans have the majority, and I think they’re going to be able to vote him in,” he predicted. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742561897.0692382}