{"duration": 0.04486989974975586, "input_args": {"text": "'In an extensive feature in the Hollywood Reporter, CNN Worldwide president Jeff Zucker revealed his ambitious plans to take his cable news empire into the digital domain and beyond. [From the Hollywood Reporter:  “Did you enjoy that?” asks Jeff Zucker as he walks into his   office at CNN’s Manhattan headquarters. By that, Zucker means President Donald Trump’s chaotic   press conference Feb. 16 from the East Room of the White House, which had just finished up. In addition to claiming that his administration is running like a “  machine” despite   scandals and dustups, the president continued his assault on the news media that, a week later, would result in CNN and others being banned from a daily briefing. “I watch CNN,” said Trump. “The tone is such hatred. ” Zucker, whose network has thrived of late despite (or, more likely, in part because of) its status as presidential punching bag, seems to have enjoyed that. By the time I join Zucker in his modest office, Jake Tapper and Wolf Blitzer are offering a recap from the anchor desk in Washington. We watch it on the largest of the 11 screens mounted on the wall opposite Zucker’s desk. “It was unhinged it was wild,” says Tapper. Then CNN contributor and Trump loyalist Jeffrey Lord appears via Skype to offer a counter from Trump land. “I’ve been listening to you, and I think we saw two different press conferences,” says Lord. “He was relaxed, he was funny, he was on point. ”   …     Zucker, known throughout the industry as a masterful poacher of talent, has been relentless in his search for original voices to augment the success of Bourdain and others. In the fall, in the heat of the presidential campaign, he hired away BuzzFeed’s entire   KFile team, which had broken several major stories, including Trump’s appearance in a   Playboy video. In January, that team had the scoop on former Fox News personality Monica Crowley’s brushes with plagiarism, which torpedoed her nomination to a top National Security Council post. Another recent addition is comedian and social commentator W. Kamau Bell, whose show United Shades of America premiered last spring on CNN (the debut episode had Bell interviewing hooded KKK members). Bell, who will launch a new series on the Great Big Story platform this summer, notes that while Trump may dismiss the network as fake news, the standards and practices apparatus at CNN holds even his show to a high bar: “We can’t just say random facts. They’re like, ‘Where did you get that from?’ So the pressure to make things smarter is always a good pressure, and I’ll take care of the making things funnier part. ”   …     Read the full story at the Hollywood Reporter.'"}, "time": 1742562092.456256}