{"duration": 0.025907039642333984, "input_args": {"text": "'More than 130 female activists from 38 countries pressed the leader of the United Nations on Tuesday to fulfill a goal he declared after assuming the job a decade ago: a permanent peace treaty to end the Korean War. In an open letter to Secretary General Ban   a former foreign minister of South Korea whose tenure will expire at the end of the year, the women implored him to “lead the process of bringing formal closure to the longest standing war before you leave your post at the United Nations. ” The letter was   by Women Cross DMZ, a group that organized a peaceful walk last year across the demilitarized zone separating North and South Korea, and the Women’s International League for Peace and Freedom, a prominent antiwar group that is more than 100 years old. Mr. Ban, rumored to be contemplating a run to be president of South Korea after he leaves the United Nations, has often expressed a wish to reduce tensions on the Korean Peninsula. Those tensions have escalated under Kim   the North Korean leader, who has conducted missile and nuclear weapons tests in defiance of United Nations Security Council resolutions that have left the country deeply isolated. Despite hopes that Mr. Ban, 72, might visit North Korea before he leaves the United Nations, he said recently that such a trip was highly unlikely. Mr. Ban, born during the Japanese occupation of the Korean Peninsula, was 9 years old when an armistice halted the Korean War in 1953. The armistice, not a formal peace treaty, has left the war’s principal antagonists in a technical state of war for 63 years. “This war must end,” the women’s letter to Mr. Ban stated. It reminded him of a pledge he made in a 2007 speech: “Beyond a peaceful resolution of the nuclear issue with North Korea, we should aim to establish a peace mechanism through transition from armistice to a permanent peace treaty. ” Mindful of Mr. Ban’s possible presidential aspirations, the letter said he should “aim to conclude this peace process” by 2018, the 70th anniversary of the Korean Peninsula’s division into two states. Christine Ahn, the international coordinator of Women Cross DMZ, said in an email that the letter was sent on Tuesday, the last day of the annual General Assembly session in New York, “in the hopes of encouraging Mr. Ban to uphold this promise long after he leaves the U. N. ” The signers of the letter included a number of prominent women in education, the arts and activism on disarmament issues. They included the filmmaker Abigail Disney, the playwright Eve Ensler, the feminist leader Gloria Steinem and the Nobel Peace Prize laureate Leymah Gbowee.'"}, "time": 1742628488.547305}