{"duration": 1.3670291900634766, "input_args": {"text": "'Here are the top 10 comments of the week on our digital platforms, as selected by our readers and the journalists who moderate nearly every comment. 1. “ ‘And when you’re a star they let you do it,’ Mr. Trump says. ‘You can do anything.’ ” Pay no taxes. Insult whomever you wish. Shoot an immigrant on Fifth Avenue. Fire the losers who support you.  —   SBMD in Florida, reacting to an article about a tape that captures Donald J. Trump speaking in vulgar terms about groping women.  2. A private conversation which reflects his public behavior. The man has no discretion. Other presidents may have been equally interested in scoring with women but they had the grace not to demean them in public. Obviously, marital vows mean nothing to him, which raises the question what vows will he keep, i. e. [to] uphold the Constitution and fulfill the duties of office of the presidency, so help me God?  —   Angela Mogin in San Mateo, Calif. 3. Trump paid exactly what was required of him by law, so what’s the issue? Should he have offered to pay more than what was owed? How many people on here can say that come tax time they wish to pay over and above what they owe?  —   Tom Langlais on The Times’s Facebook page, responding to our reporting about Mr. Trump’s 1995 taxes, which showed a $916 million loss, enough to enable Mr. Trump to avoid paying federal income tax for up to 18 years. This comment received more than 700 likes.  4. It is nobody’s obligation to pay more tax than the law demands. If Donald Trump could order his affairs in such a way that his income tax responsibility was ZERO for any particular year, or series of years, that’s fine with me. But whether or not Donald Trump pays taxes is NOT the issue. The issue is whether or not the tax system is fair. If the law is such that Donald Trump could have the kind of money he has and actually owe no federal income tax, then the law needs to be changed drastically. So ask yourself: Which party, and which candidate, do you think is sincerely interested in changing the income tax laws to make them fairer for the vast majority of us, rather than something to be manipulated by the wealthy?  —   Boneisha in Atlanta.  5. Mr. Kaine brilliantly phrased the only question worth asking when he repeatedly grilled Mr. Pence, “Why don’t you trust women to make this choice?” I was (surprisingly) moved to tears to hear a man say these words with so much force and conviction. In my 45 years I have never heard a politician stick his neck out for women’s rights like he did.  —   Alibumbayay in Washington, reacting to an   essay by Katha Pollitt about the   debate and the candidates’ views on abortion and women’s rights. This comment received more than 1, 700 reader recommendations.  6. It was so refreshing to hear Mike Pence speak about his   position and not apologize for his beliefs. Some may not see this as the most important factor for voting for a presidential candidate but many of us still feel it is necessary to discuss abortion and the threat to innocent human life. To me it is very important and I want my president to respect and value life. I wish the Democrats cared about abortion and the destruction it causes as much as they do about other political issues such as free education and health care.  —   KMW in New York. This comment received more than 40 reader responses. 7. Far from being a distraction from “real issues,” I think looking at the candidates’ marriage histories tells us a lot about how they may govern as president. My takeaway is that Hillary sees all that is good inside a flawed relationship, and instead of abandoning it when unpleasant truths emerge, she confronts the problem, and works to figure out how to save what’s good and change the bad. That’s exactly her approach to governing. Trump, in contrast, appears to view marriage like car ownership. He loves to show it off, and really enjoys the ride, but upgrades to a newer model every six years or so. That same mentality is evident in his policy prescriptions for international treaties, trade agreements, and public policy. Once something stops being 100% favorable to him, it’s time to replace it with something brand new, without any real   analysis or thought to   consequences. I think any voter, regardless of party, who has survived and flourished in a   relationship will clearly recognize how meaningful the wisdom and tolerance, and empathy, and capacity for compromise that marriage engenders is perhaps the most telling qualification for serving as president.  —   DavidH in Brooklyn, responding to an article about Hillary Clinton’s reactions to Bill Clinton’s affairs during their political careers. This comment received more than 700 reader recommendations. 8. I really hope that common ground can be found. A telescope is no   power plant and while it certainly has environmental impacts, those impacts can be reduced to a minimum, when given a little attention and foresight. I believe the protests against this particular telescope, and the telescopes in general, are more of a symptom of how the native [Hawaiians] feel about their general treatment and how little they have been involved in processes affecting their cultural and historical backgrounds. This is a possibility for them to shine some light on their situation and get media attention. If both sides are   a solution can surely be found.  —   Pierre Markuse in Germany, reacting to an article about a clash between astronomers and native Hawaiians over a proposed telescope, which would be the biggest and most expensive of its kind in the Northern Hemisphere.  9. My    mom, when she feels she has been served well, loves to ask for the manager. She then compliments like crazy, whoever it was that was kind to her. Whether it’s the porter in her building, a waiter, a store clerk or a receptionist, she is sure to inform their boss. “People are so fast to complain,” she likes to say, “but it’s so easy to take the time to be thankful. ” Mr. DeMarco’s letter reminds me of my mom. No matter the circumstance, acknowledge and appreciate a job well done.  —   Forbes in New York, reacting to an article about a letter sent to the hospital staff by a man after his wife died following an asthma attack, thanking them for caring for her, their families and himself. 10. A man goes for a walk and finds a bottle on a beach. When he pops the cork a genie appears and says, “I shall grant you one wish. ” The man says, “I want to see peace in the Middle East. ” He then hands the genie a map of the Middle East. The genie studies the map for a while and finally says, “What you wish for is impossible. So I shall grant you another wish. ” The man says, “I’ve always wanted to see the Cubs in a World Series. ” The genie replies, “Let me see that map again. ”  —   Marianne in Edmonds, Wash. reacting to an article about whether the Chicago Cubs might win a World Series title for the first time since 1908.'"}, "time": 1742562432.3352747}