{"duration": 0.08377861976623535, "input_args": {"text": "'As members of Congress wind up their Easter break back in their districts, a website honoring former President Barack Obama is providing “progressives” with the information and tools they need to disrupt town hall meetings that lawmakers are holding over the remainder of this week. [Visitors to the townhallproject. com website can find everything from detailed information on each scheduled town hall meeting to how to make signs and even specific questions to ask to push the agenda on a range of talking points including: investigating President Donald Trump, Trump’s “starvation budget” on foreign policy, climate change, supporting illegal aliens, and LGBT rights.  By clicking on the “about” icon, the first thing that pops up is a quote from Obama’s farewell speech in Chicago on Jan. 10, 2017. “It falls to each of us to be those anxious, jealous guardians of our democracy to embrace the joyous task we’ve been given to continually try to improve this great nation of ours. Because for all our outward differences, we all share the same proud title:  Citizen,” Obama said. The website states: Town Hall Project empowers constituents across the country to have    conversations with their elected representatives. We are campaign veterans and first time volunteers. We come from a diversity of backgrounds and live across the country. We share progressive values and believe strongly in civic engagement. We research every district and state for public events with members of Congress. Then we share our findings to promote participation in the democratic process. The page also reveals the kind of progressives who are manning the town hall effort by naming its “sponsors,” including moveon. org and the Center for American Progress  —   the latter under direction from John Podesta, longtime Obama operative and Hillary Clinton campaign manager. The town hall website links to the websites of both organizations as well as the sponsoring “Indivisible” website, which features a video of Rachel Maddow on MSNBC reporting about the power of the town hall “movement. ” “If the Tea Party was able to take on a historically popular President Obama with a Democratic supermajority to slow and sometimes defeat his federal agenda, we can surely take on Donald Trump and the members of Congress who would do his bidding,” the Indivisible website states. All three of the sponsors of the Town Hall Project website offer instructions. On the Indivisible website, protesters are told: “Your job isn’t to convince your MoC (member of Congress) of anything. It is to create the political conditions necessary to force them into a new position —  or to replace them. This is a marathon, not a sprint and every mark against them will matter —  especially footage of them flailing in a town hall with you and your group. ” The moveon. org instructs protesters on “ ” lawmakers  —   “  is fun and easy!”  —   the website states.  How to bird dog successfully, states, in part: ● Arrive in advance. ○ You want to get a seat close to or in front of the stage or platform to make sure that you have the ability to ask a question and that your MoC can hear you. ○ If your group is protesting and is not invited in, make sure you find all the entrances and know where the parking lot is, if applicable, to try to map out the route your MoC will take in and out of the facility, to increase the chances that they see you. ● Don’t give yourself away. ○ Do not wear clothing or wave signs that will let people know that you are coming to   your MoC. You want to make sure that you have an opportunity to ask your questions. ● Know your MoC’s positions, • Study your MoC’s positions on your topic of issues. You want to make sure that they know that you know what you are talking about. Many times, in an attempt to dismiss and discredit, elected officials look for ways to make you seem less informed and thus not qualified to ask your question. However, it is your right as a constituent to ask your question, and being informed will make it harder for you to be dismissed. CAP’s “Recess toolbox” is entitled “Resist” and provides questions protesters should ask at town hall meetings:       • Will you call on President Trump to release his tax returns? We must know whether he’ll profit from the GOP’s tax reform plan. The long list of town halls promoted on the website totals 87 meetings this week for both Republican and Democrat lawmakers across the country. The website also encourages visitors who can’t go to a town hall in person to call their representative, and contact information for members of Congress is provided. “You have more power than you think,” the website states. “Town halls are one of the most effective ways to use it. ” '"}, "time": 1742562499.0142493}