{"duration": 0.03359723091125488, "input_args": {"text": "'Virginia Gov. Terry McAuliffe says a bill that would have prohibited his state from entering into contracts with Planned Parenthood and other abortion providers “would harm tens of thousands of Virginians,” reports ABC7. [As expected, McAuliffe vetoed a bill that would have allowed Virginia to redirect Medicaid funding from abortion providers such as Planned Parenthood to other federally qualified healthcare centers (FQHCs) that are more numerous and provide more comprehensive care.  During a veto event outside the executive mansion Tuesday, McAuliffe said the mansion was the “brick wall” protecting women’s health care, says a report at Richmond  . “It’s important for women to have access to quality health care,” the governor said. “This is what matters to Virginia families today. ” ”We are here today because I’m going to veto senate bill 2264.”  —  @TerryMcAuliffe #IStandWithPP pic. twitter.   —     (@PPMW_ACT) February 21, 2017,  In his remarks, McAuliffe also likened North Carolina’s bathroom privacy law to the bill he vetoed as another example of discrimination that could harm Virginia’s business interests. “Discrimination breeds hatred and we will not tolerate that in the commonwealth of Virginia,” he said. “We treat everyone equally, with dignity and respect. ” Planned Parenthood tweeted its celebration of McAuliffe’s veto of the bill: It’s a great day to have @GovernorVA as a Planned Parenthood supporter. #HB2264 has been vetoed! pic. twitter.   —   PPAVirginia (@PPAVirginia) February 21, 2017,  The legislation was sponsored by Del. Benjamin L. Cline (R) and passed the state Senate last week on a   vote. “This important legislation would have prioritized taxpayer dollars toward providers of more comprehensive health care services, and the governor’s veto undermines those efforts to improve health care in rural and underserved areas,” Cline said in a statement. Democrat leaders, however, defended Planned Parenthood. “Attacks on Planned Parenthood do nothing to advance health care,” said Virginia Attorney General Mark Herring (D). “They take us in the wrong direction. ” Lt. Gov. Ralph S.  Northam (D) who is making a bid for governor, took the “war on women” approach by saying lawmakers, “most of whom are men,” should let women decide what to do with their bodies. Nevertheless, Olivia Gans Turner, president of the Virginia Society for Human Life, said in vetoing the bill, McAuliffe placed “the abortion lobby” before “the women and unborn children of the commonwealth. ” A similar bill prohibiting Medicaid funds to any abortion provider passed the Virginia state legislature last year. In a strong show of support for Planned Parenthood, McAuliffe went to the abortion business’s facility in Richmond itself to veto the legislation. The Virginia Bureau of Watchdog. org reported that Planned Parenthood contributed more than $1. 7 million to McAuliffe’s gubernatorial campaign in 2013. Abortion industry lobbying organization NARAL donated $56, 000 to his campaign, as well. Federally qualified healthcare centers (FQHCs) provide many more services to   families than Planned Parenthood does. Nationally, there are 13, 000 FQHCs  —   a figure that outnumbers Planned Parenthood facilities 20 to 1. Despite the overwhelming number of FQHCs, however, Democrats who are often supported by the abortion lobby claim that by redirecting funding away from Planned Parenthood, states are preventing   individuals from accessing health care.'"}, "time": 1742628457.338199}