{"duration": 1.059528112411499, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Russia was hit with an extraordinary punishment for its doping scandals: The governing body for track and field barred the Russian team from the Rio Olympics. President Vladimir Putin denounced the decision as politically motivated. It appears possible that the International Olympic Committee might ease or amend the suspension when it meets on Tuesday. _____ 2. Britain’s shock over the killing of a member of Parliament deepened with reports that the    suspect had ties to   and   groups and may have suffered from mental illness. The victim, Jo Cox, had been urging Britons to vote to stay in the European Union, and had been receiving threats ahead of next week’s “Brexit” vote. _____ 3. The Senate’s most moderate Republican, Susan Collins of Maine, drafted a compromise   measure that aims to sidestep partisan stalemates. It would ban gun sales to a smaller portion of people who are on the terrorism watch list than the Democrats’ current proposal but more than the existing Republican plan. _____ 4. This is the most uplifting story we’ve read in awhile. A construction worker happened to get in a New York taxi driven by an old colleague  —   and found out that the city had been trying to find him for years, to award him $50, 000 he was cheated out of by a former employer. And he, in turn, tracked down three other affected men  —   all immigrants  —   who got the same awards. “You never know the things that may be going on inside cabs rolling through the Bronx,” our columnist wrote. _____ 5. George W. Bush has quietly returned to politicking. The former president is helping a handful of Republican senators with   campaigns that have been complicated by the rise of Donald Trump. Mr. Trump is heading to rallies in Arizona this weekend, but a planned meeting with Navajo Indians has been thrown into question over his use of the term “Pocahontas” to deride Senator Elizabeth Warren. _____ 6. The N. B. A fined Stephen Curry and the Golden State Warriors’ coach $25, 000 each for outbursts over officiating in Game 6 of the playoffs on Thursday night. Curry threw his mouthguard into the stands, hitting a fan, after fouling out for the first time in his professional career. His coach, Steve Kerr, called three of the six fouls “absolutely ridiculous. ” Curry’s wife even accused the N. B. A. of rigging the game to ensure a Game 7 with the Cleveland Cavaliers. (Sunday, 8 p. m. ABC) _____ 7. Good news for sustainable air travel: NASA unveiled plans for an experimental   airplane that a top official said would “take the first giant step in opening a new era of aviation. ” The space agency aims to get an early version of the   a craft resembling a Cessna with strangely skinny wings, off the ground in a year. _____ 8. A rift over Syria policy widened between the State Department and the White House. Dozens of diplomats signed an internal memo pushing for a far more aggressive strategy, including strikes to stop the government of President Bashar   from continuing to violate a  . What does the country look like now? Devastation is widespread, but bits of almost normal life remain, according to our correspondent. Check out a startling visual journey of his recent visit. _____ 9. In neighboring Iraq, government forces made decisive gains against the Islamic State, retaking the center of Falluja after weeks of fighting. Thousands of civilians took the opportunity to flee the city, overwhelming aid agencies. “Falluja has come back to the country’s bosom,” the prime minister said. _____ 10. President Obama met privately with Saudi Arabia’s defense minister, above. Officials said they spoke of Saudi economic reforms and the fight against the Islamic State. The meeting came as the Saudis are under new scrutiny for a possible government role in the Sept. 11 attacks. Another Saudi official gave a news conference in Washington to dismiss such accusations. “There is no there there,” he said. _____ 11. Finally, a big, big piece of art is in place. “The Floating Piers,” Christo’s latest   installation, is undulating on the surface of an Italian lake for the next few weeks, inviting as many as 40, 000 visitors a day to, effectively, walk on water. “It’s actually very painterly, like an abstract painting,” he said, “but it will change all the time. ” Have a great weekend. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562715.831417}