{"duration": 0.19014310836791992, "input_args": {"text": "'By Francis Carr Begbie \\nERIC CANTOR , Republican politician, and LISSA MUSCATINE, Hillary Clinton’s former speech writer, were two of the many Jews given free rein to reflect on Donald Trump a few days ago before millions of BBC viewers. \\n“In the end one could not help noticing one interesting if rather awkward fact about that edition of BBC Newsnight. The editor, two out of three of the main presenters, and all seven of the main interviewees in Washington and London were JEWISH. Not bad for a group said to represent less than 0.4% of the British population.” — Francis Carr Begbie \\nYou might think that after a disaster as humiliating as the election of Donald Trump that our anointed elites would take this opportunity for a bit of humility — that this would be an opportunity for introspection and some soul-searching self-reflection. \\nWell, the good news is that you would be wrong. For this would involve a level of self-awareness far beyond our narcissistic elites. All around they are demonstrating a complete inability to understand the forces behind their humiliation at the hands of a man they dismissed as a joke from day one and whose demise they predicted every inch of the way. \\nThis self-deception was wonderfully on display in an immediate post-election edition of the BBC’s flagship current affairs programme Newsnight , broadcast to the nation the day after and including a number of American interviewees. In a specially extended version of the show, programme editor Ian Katz dispatched Emily Maitlis , Mark Urban and David Grossman to find answers on the day after the result. \\nIn both London and Washington a stellar line up of the finest brains from the media and the academy were assembled to help them chew it over. \\nEntertainingly, the vanity, narcissism and entitlement of the BBC presenter-ocracy was fully on view, proud and undented. To the accompaniment of the Beatles tune “Fool on the Hill” anchor Emily Maitlis could barely contain her rage and sputtered about how “a game show host and someone who owned a beauty pageant” could become president. \\nPopulism, uprising, nationalism versus globalism; as with former President Bush’s puzzlement over “the vision thing,” they seemed to be able to mouth the words but comprehension was lacking. \\nWith every guest, Emily Maitlis showed that old habits die hard or not at all. She dripped condescension from the outset, snapping at immigration traitor , pro-Israel fanatic former US Congressman Eric Cantor who was perhaps trying to redeem himself given the new winds in the Republican Party: “We talked about the vulgarity of this man … This is a man who talked of grabbing women by the pussy. Is that a man you are proud [of]?” An angry school teacher furious with the behaviour of her immature, irresponsible charges. \\nEasily the funniest moment in the programme came during a virtuoso splenetic performance from historian Simon Schama who seemed to think it was Germany in 1933 all over again. Race, he said, was more important factor in the election than the economic arguments. SIMON SCHAMA, ASHKENAZI JEW \\nWriggling in his seat, as if it was subjected to regular electric shocks, he said. \\n“It is really weird to me how we pussyfoot around the toxic malodorous element of race which has played an important part of this. Anti-semitism has long been part of populism… [beginning] in the early twentieth century. Even today there were sinister references by the likes of senator Jeff Sessions to George Soros who was singled out as a particularly odious figure in this international banking conspiracy.” \\n(To which many people in the Alt Right might have replied: “couldn’t have put it better myself.”) \\nSchama almost lost it completely when co-interviewee and neocon stalwart Melanie Phillips told him to calm down a bit. \\n“It is not a moment for calm, it is not a moment for calm.” he screeched. MELANIE PHILLIPS, ASHKENZI JEW AND VIRULENT ZIONIST \\nMelanie knows very well what these anti-semitic dog whistles are like. This too is part of populism. We are facing a cataclysmic moment. Melanie is right to say it is a populist revolt. It is nothing to do with conservative republican politics. It amuses me to hear that Eric Cantor imagines that things are going to go on as they always did in the Republican party … [that they] will restrain Donald Trump. They won’t. George Washington warned about despotism and that is what we are facing. \\nMelanie Phillips, for her part, agreed the most important problem was anti-Semitism, but she saw it coming from a completely different quarter. \\nThere are noxious elements around. … Clearly some of the people supporting Trump are anti-semitic and racists but that is also true of people on the left. There is no sign that he (Trump) personally is anti-semitic or racist. People call people racist when they want to restrict as he does, legal immigration. Anti-semitism is now at record levels at liberal universities overseen by liberal professors and liberal vice chancellors. \\nStudio presenter Evan Davies muttered about how they had to give up something to people worried about the loss of their traditional societies and really act on illegal immigration. But Schama wasn’t listening. He was worried about David Duke. \\nDonald Trump re-tweeted a neo-Nazi tweet. It is not a coincidence that David Duke, KKK Imperial Wizard, is exhilarated and rejoicing with the advent of Trump who is his man. We will see race crimes, hate crimes explode now. We will have a far-right supreme court which will reverse Roe [v.] Wade. \\nAs a glimpse into the fevered imagination of at least one strongly identifying Jew, it could not have been more revealing. Before Schama actually self-detonated on air, the programme moved on to more heavyweights. \\nNeoconservative think tanker Danielle Pletka , senior vice president of foreign and defense policy studies at the American Enterprise Institute, complained she had no idea what Trump’s policies were. Which was not very helpful. \\nMary Kaldor , professor of global governance at the London School of Economics, complained that Trump was “wildly unpredictable” in his stated foreign policies. “He says ‘I love Israel,’ then he says he wants to be neutral between Israel and Palestine.” For her the real danger seemed to be peace. Or as she framed it, Trump getting friendly with Putin to create an “alliance of authoritarian right wing leaders.” \\nBut it was the Pulitzer prize-winning historian of communism Anne Applebaum who painted the most apocalyptic scenario. Applebaum, who has never seen a “Deep State” she didn’t like, said that Trump had been disdainful for NATO and cannot understand why America needs to be in Europe. His admiration for Vladimir Putin as an ideal was very worrying. ANNE APPLEBAUM . . . ANOTHER ASHKENAZI JEW \\nEuropeans need to start from the assumption that United States is not a reliable partner. We need to keep repeating that until it sinks into people’s brains. \\nShe really said that. \\nApplebaum said Trump sees no need for a relationship with the UK. He said that Trump, who has spent millions developing his two golf courses, which include Turnberry, is, apparently, “not an anglophile and has no interest in Britain. Hillary Clinton does.” Surely, asked presenter Grossman, the Brexit referendum puts Britain and the USA on the same page? Applebaum: “No, no, no.” \\nBoth these women think it makes the election of Marie le pen more likely. Likely correct, and thank god for that! \\nAlan Greenspan , former chairman of the Fed, was wheeled on to say that he, a lifelong Republican had not voted. He also explained that Trump would not be able to get rid of the current Federal Reserve Bank chair Janet Yellen without a complicated impeachment process. \\nEarlier in the show, Maitlis tried to get Republican Eric Cantor to condemn Trump but got no change. Cantor responded lamely about Trump’s promise to build a border wall. “I’m not so sure that is going to happen” — showing (not surprisingly) that he remains an immigration traitor at heart. And he continues to show his allegiance to Israel. Cantor said he was less interested in Trump’s immigration policies than his Middle East policies, including his intention to get rid of ISIS. \\nLissa Muscatine , Hillary’s former speech writer, assured Maitlis that her old college friend had bounced back as strong as ever. \\nElsewhere David Grossman did a breakdown of the vote to show that women and Hispanics had leaned to Trump in far greater numbers that anyone thought possible. (In fact, a solid majority of White women voted for Trump, proving Schama right: Trump voters are racists.) In the end one could not help noticing one interesting if rather awkward fact about that edition of BBC Newsnight . The editor, two out of three of the main presenters, and all seven of the main interviewees in Washington and London were Jewish. Not bad for a group said to represent less than 0.4% of the British population. \\nI should note, however, that there were a smattering of Vox pop style three-second sound-bite interviewees of men in baseball hats celebrating in bars and so on. There was also an abortive panel of a Hispanic man, black woman and Jewish New York Times reporter, and there was a Latvian politician down the line. But otherwise it was an extremely Kosher programme. \\nThe BBC operates one of the most aggressive affirmative action policies in the Western world. In keeping with its position as the Vatican of political correctness, a finger is kept on the scales of employment opportunity to ensure that jobs are skewed heavily for favoured groups. \\nBut given that self-awareness is one area where the elites are notably deficient, it might be s good idea to remind them of the massive Jewish overrepresentation on display here. This is one very privileged group indeed. Overrepresented and overprivileged, one might say. Like this? Share it now.'"}, "time": 1742564307.2759926}