{"duration": 0.11077690124511719, "input_args": {"text": "'Posted on October 31, 2016 by Carl Herman \\nGuest author Daniel “No Passport” Bruno reports from Rio de Janeiro and Buenos Aires.* Like Donald J. Trump, Daniel has a birth certificate issued in Manhattan. Daniel is an author, inventor, specialist in 9/11 facts and an editor at www.hpub.org and www.huffingtonpostforum.com, which publish over 1000 censored news articles monthly. Follow https://twitter.com/HuffPoClub for insightful news updates 24/7. \\n*Constitutional and Civil Rights attorneys are urged to contact Daniel. Final del formulario \\nI pointed out in April, 2016 , that election probabilities favor the Republican candidate not because of his rhetoric, politics or personality, but because his party is not the incumbent this time around. We have a revolving door “bi-partisan” reality TV show where Democrats and Republicans pretend to be foes. Statistically speaking, it makes no difference what Trump allegedly said about this or that, or how corrupt the blood-soaked Clinton crime family may be. It’s the Republican turn through the turnstile this time, in both White House and House of Representatives . \\nAll the advertising, faux debates, polls, and punditry are for entertainment purposes only. The incumbent Democrat party has at least six keys going against it. For example, the Republicans currently hold the House and the Senate, the incumbent president is not running, there is a third party candidate, and Hillary Clinton is not nearly as charismatic as Obama was. Geopolitically, my conjecture is that Russia is temporarily avoiding further bombardment of Allepo to deprive the NeoCons of an opportunity to add a key in the Democrats favor. No October surprise to make the incumbent party a war hero. Smart man, that Vladimir Vladimirovich. \\nAmerican election outcomes don’t turn on real issues, party loyalty, or any of the things the mass media distract the public with because not only is the United States not a democracy, it also has a ruling elite whose loyalty is split with a foreign country. \\nRegardless of who wins, the NeoCons will continue to own our State Department, and with it our foreign policy, our Army, our Air Force, our Marines and our Navy. The “Federal” Reserve (a privately owned cartel with computer screen reserves) will continue to be run by a very tightly-knit group of special people who openly practice affirmative-action for their group. They are above any law and do not answer to the President or Congress. Wikileaks \\nThe Wikileaks Podesta cache reveals how utterly clueless some of the most powerful Americans really are . \\nHillary Clinton’s use of an unencrypted, private server in her bathroom, connected to her Blackberry after the NSA forbade her to do so, reveals an astonishing lack of sophistication and remarkable hubris for someone who has held top secret clearance for decades. Clearly, she is clueless about how email and wireless communication work, and values her personal convenience over “national security,” that fetish the NeoCons use to commit crimes worldwide. To deflect attention, Clinton revives Russophobia and Biden threatens Russia with cyber attacks. \\nBut Clinton is not alone in her cluelessness. The man who allegedly presides over America’s 17 intelligence agencies, the same agencies spying on 300 million Americans 24/7 in the name of national security, sent and received emails to that server in the bathroom. He knew what he was doing because the emails were addressed to a Clinton.com domain, not a state.gov domain. When asked about this, Mr. Obama said he found out about the private server along with the general public when it was reported in the newspapers, which is obviously not true. That wily Barack Hussein probably knew Hillary was hanging herself, and let her do it anyway. Serves her right after she unleashed the “birther” controversy in 2008. Mussolini Reborn: My Message to Strongman President Trump \\nCongratulations. \\nAmerica will not be great again when Spanish speakers are held in contempt, and no one is available to keep up your hotels. \\nAmerica will not be great again when yet another black person has his life ruined by those who swore a solemn oath to protect it. \\nAmerica will not be great again when more death and destruction are unleashed upon yet another Muslim nation that never raised a hand against the United States. \\nAmerica will be great again when the European-American, NeoCon intellectual authors of the 9/11 attacks are tried in a court of law, found guilty, and receive the sentence of their jury of real Americans. \\nGod bless America. ← Constitutional Law Expert: Comey Did NOT Violate Law By Announcing Email Investigation joe \\n“America will not be great again when Spanish speakers are held in contempt, and no one is available to keep up your hotels.” \\nDistorted truth.Mr Trump spoke about the illegal criminals… Not until long ago there was a handful of American patriots being imprisoned on bogus charges ,though tried by their peers and set free they are still in custody. … Totally agreed with all the other points… \\nTrump 2016! jhnjul \\nThis is no typical swing. It has broken from its normally controlled path of swing. Coming back around for a flank shot. Donate'"}, "time": 1742563783.1573076}