{"duration": 0.05015444755554199, "input_args": {"text": "'War on the Streets of Paris: Armed Migrants Fight Running Battles in the French Capital Nick Gutteridge, Express, November 2, 2016 \\nA migrant turf war erupted into violence on the streets of one of Paris’ trendiest neighbourhoods early this morning as asylum seekers beat each other to a pulp with wooden clubs. \\nThe area around Stalingrad Metro station was turned into a refugee battleground as rival gangs of migrants set upon each other in shocking scenes of violence. \\nAsylum seekers wearing hooded tops wielded makeshift clubs fashioned from lengths of wood which they used to bludgeon each other as horrified pedestrians looked on. \\nThe blood-curdling brawl erupted just yards from the Stalingrad Metro station, where a squalid migrant camp has popped up following the demolition of the Jungle. \\nIt was not immediately clear what sparked the early morning fight, but rival gangs of people smugglers have previously been involved in violent brawls in Calais. \\nAnd despite the horrific brawl, a pro-migrant rally is apparently being organised to take place at the camp at 6pm tonight. \\nThe once peaceful neighbourhood, in Paris’ 10th Arrondissement, used to be a popular area with tourists, boasting a lively nightlife scene bustling with restaurants and bars. \\nBut worried residents have revealed how it has become a no go zone in recent weeks following the establishment of the refugee camp, which has brought squalor and violence. \\nThousands of migrants–mostly from Sudan, Libya, Afghanistan, and Eritrea–have pitched tents under the Metro station after the demolition of the Jungle hampered their attempts to reach Britain. \\nFrench police have tried and failed on many occasions to clear the squalid squat, but asylum seekers simply keep on returning and reestablishing it. \\nThere are now nore than 2,500 migrants pitching up in the makeshift camp, with locals saying the eyesore is ruining their businesses and making life a “living hell”. \\nResidents in the once popular district say that the squatters are now becoming increasingly violent and dangerous, with increased reports of muggings. \\nFaisal, a shopkeeper, told the French daily Le Figaro that Stalingrad locals are living in fear, threatening the future of his business. \\nHe said: “The stench of urine, faeces, and rubbish has made Stalingrad an insalubrious place to live. The place is dead – no-one wants to come here anymore. People are afraid to go out and lock themselves in. \\n“I’m making less than €60 (£53) a day. A few more weeks like this and I’ll go bust! \\n“French people have been kind to them. I know they’re desperate, but the least they can do is respect the law and try and integrate into French society.” \\nJeanne, another Stalingrad resident, told Le Figaro the migrants had become increasingly violent towards locals. \\nShe said: “Brazen migrants are snatching jewellery and handbags off passers-by–they’re even stealing bread. I’ve seen them beat people up too.” \\nPolice have raided the camp some 30 times in the past year, and on Monday French president François Hollande vowed to close the camp for good. \\nBut within 24 hours of a police operation to move migrants on tents had sprung up again, showing the uphill battle authorities in the French capital face to shut down such illegal encampments. \\nFurious locals have demanded that the camp be closed once and for all, describing how they have heard “blood-curdling noises” coming from it in the middle of the night. \\nMarie, who lives right next to the makeshift camp, told Le Figaro: “Life here has become unbearable. More than 2,500 squatters were evacuated in September, and now, less than two months later, they’re back. And now that the ‘Jungle’ camp has been closed, things are about to get even worse.” \\nAnother local, Monique, said that she was at “a loss for words” and “utterly distraught” over the situation. \\nShe said: “The streets are littered with rubbish and faeces. We can hear blood-curdling screams coming from the camp in the middle of the night.'"}, "time": 1742628344.6496859}