{"duration": 0.03164029121398926, "input_args": {"text": "'Pro-Palestinian protesters trap pro-Israel students in London university hall Pro-Palestinian protesters trap pro-Israel students in London university hall By 0 149 \\nPolice were called after pro-Palestinian protesters stormed an Israel event at a London university, yelling “shame, shame” and trapping attendees in the room the talk was being held in, it has been reported. \\nIsraeli activist Hen Mazzig was addressing a group at University College London (UCL) on Thursday about the conflict between Israel and Palestine when protesters from the Friends of Palestine Society tried to stop his speech by chanting: “From the river to the sea, Palestine will be free.” \\nAccording to the Jewish Chronicle, protesters then blocked attendees from leaving or getting into the lecture hall, chanting: “5, 6, 7, 8, Israel’s a terror state.” \\nOfficers reportedly told attendees to not leave the room without police protection. One student claimed she had been “assaulted” and “attacked” by the protesters. I was assaulted. We were attacked. But freedom will prevail. @HenMazzig did a great job sharing his story amidst a whirlwind of hate. #UCL \\n— Devora Khafi (@DevoraKhafi) October 27, 2016 \\nIn a video broadcast on Facebook from inside the hall, Mazzig tells his followers: “The situation is really out of control, we’re hiding in a room and there are protesters outside. \\n“I don’t think that even in my days in the IDF [Israel Defense Forces] it was as bad as it is right now, it’s really scary,” he said. \\nHe later tweeted: “I had to be rushed out of the event at @UCL with security. The campus was the war zone and the streets are the safe place. I’m out. My god.” \\nIn a statement, the Union of Jewish students said: “There can be no excuses for the events that took place at UCL last night. \\n“The fact that such violence and hostility took place only nine months after the incident at KCL [King’s College London], with police having once again to be called, is an absolute disgrace. \\n“UCL Friends of Israel were simply trying to engage students in discussion on Israel, but instead were met with a wall of intolerance and intimidation aimed at shutting down free speech.” \\nEarlier this year, protesters interrupted a talk by Ami Ayalon, an ex-commander of the Israeli Navy and former head of the Shin Bet, at King’s College in London. One protester was later found guilty of assaulting a Jewish student at that protest. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742564416.054016}