{"duration": 0.09626197814941406, "input_args": {"text": "'On Saturday’s broadcast of the Fox News Channel’s “Fox  Friends,” Harvard Law Professor Alan Dershowitz stated that former FBI Director James Comey is “all about preserving his reputation” and said Comey is “using his friends to get his point out. It’s cowardly. ”  Dershowitz said that he’s always liked Comey, but Comey has been “using his friends to get his point out. It’s cowardly. And I think it’s about time that Comey is confronted directly with  . He was a great director of the FBI, but when the whole Hillary Clinton thing began, he cared more about his reputation and his dignity than about what was good for America. ” Dershowitz added, “I’d want to find out if he was the source of the leaks of the memo that he was quoted in. Second, I would ask him why he didn’t talk directly, why he’s using his friends. I would go back to his decisions to speak to the public. ” He continued that while he disagreed with President Trump’s reported characterization of Comey as a “nutjob,” calling him a “showboat” is “not a bad characterization. ” He further stated Comey’s motives are “all about preserving his reputation above everything else. ” Dershowitz further argued that Comey revealed Clinton investigation because thought Clinton was going to win, and he would be faulted by Trump supporters for not revealing the investigation, and so Comey revealed the Clinton investigation to preserve his reputation. Dershowitz also stated that he believes Trump fired Comey due to Comey’s statement that he felt sick over the prospect that he might have influenced the election. Dershowitz concluded that the Russia investigation should be handled by an independent commission, not a special counsel, “because I don’t see any crimes. Let’s take the   scenario, let’s assume that Trump —  which it didn’t happen —  the Trump campaign got together with the Russians and said, let’s make Trump president because he’s better than Hillary Clinton. Terrible politically, what’s the crime?   …     Or he leaks material —  he shouldn’t have —  to the Russians about the Israeli spy. Terrible, he shouldn’t have done it.   …     But there’s no crime. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742563524.0151947}