{"duration": 0.17874956130981445, "input_args": {"text": "'Videos Anti-War Movement Anticipates More War Under A Clinton Presidency ‘Clinton is one of the biggest war-mongers the country has,’ an anti-war organizer tells MintPress News as the candidate’s popularity sinks to record lows ahead of Election Day. | November 7, 2016 Be Sociable, Share! U.S. Secretary of State Hillary Clinton speaks during a news conference at NATO headquarters in Brussels, Belgium, December 5, 2012. \\nNEW YORK — As the bizarre 2016 presidential election nears its end, activists in the United States are considering the prospects for war and peace under the next administration. \\nAnd with Hillary Clinton leading comfortably in most polls, the Democratic nominee’s militaristic record, as well as her promises to expand the use of force, are sparking concern. \\n“Clinton is one of the biggest war-mongers the country has,” Joe Lombardo, co-coordinator of the United National Antiwar Coalition , told MintPress News. \\n“She pushed for the bombing of Libya and the regime change in that country. She has supported a no-fly zone in Syria, which can put the U.S. in direct conflict with Russia.” \\nOn the campaign trail, Clinton has repeatedly advocated a “no-fly zone” in Syria, an aggressive move necessarily accompanied by a widespread bombing campaign, similar to those in Iraq and Libya, which were followed by expanded interventions to impose regime change. \\nSenior U.S. military pilots have warned that the proposal could plunge the United States into direct conflict with Russia, whose air force is currently deployed over Syria. \\nIn September, Joseph Dunford, chairman of the Joint Chiefs of Staff, told the Senate that the prospect “requires us to go to war against Syria and Russia.” \\n‘Kill a lot of Syrians’ \\n“It is critical that we not be confused about what Clinton’s promise of a no-fly zone will mean,” Meredith Aby of the Minneapolis-based Anti-War Committee told MintPress. \\n“It is an escalation of U.S. involvement in the Syrian civil war and it will mean an increase in casualties.” \\nIn 2013, Clinton herself admitted in a paid speech to Goldman Sachs, obtained and released by WikiLeaks in September, that her proposal would “kill a lot of Syrians.” \\n“To have a no-fly zone you have to take out all of the air defense, many of which are located in populated areas,” she said. \\nBeyond Syria, Clinton has also threatened to attack and “totally obliterate” Iran , and she has repeatedly promised to take the United States’ ties with Israel “to the next level.” \\nIn August, after accusing Russia and China of hacking U.S. computer systems, she warned : “We will be ready with serious political, economic and military responses.” \\n‘A voice for war since 2002’ US Secretary of State Hillary Clinton, left, Israeli Prime Minister Benjamin Netanyahu talk in Jerusalem, Israel, Monday, July 16, 2012. \\nThese statements, along with Clinton’s long, unbroken record of supporting military interventions, have anti-war activists eying the future warily. \\n“Many in the anti-war movement understand the dangers of a Clinton presidency,” Aby said. \\n“From her resume it is fairly obvious she will be a hawk, more so than President Obama and President Clinton. She has been a voice for war since 2002 when she voted for war in Iraq.” \\nBeyond Clinton’s explicit threats of wars, her administration may also seek to expand the use of “soft power,” ranging from diplomatic assistance and military aid to subversion and coups, in pursuit of its foreign policy goals. \\n“She has called for boosting U.S. support for Israeli missile defense systems and supports helping Israel with technology to fight in Gaza,” Aby said, adding: “On the campaign trail, she has denounced the Boycott, Divestment and Sanctions (BDS) movement as a threat to Israel. And while she hasn’t campaigned on it, she is no friend of Latin America. Her own emails show the role she played in helping provide support for the coup in Honduras.” \\nLombardo also noted that regions further removed from the headlines than flashpoints like Syria could face similar threats from a Hillary Clinton administration. \\n“The Philippines is heating up and Clinton has a history in Latin America, where there are many places that the U.S. would like to see regime change,” he said. \\n‘A very unpopular president from day one’ \\nIn the waning months of the campaign, both Clinton and her Republican rival, Donald Trump, have emerged as historically unpopular candidates , more so than others in the era of scientific polling. \\nIndeed, while Trump’s aggression has kept his popularity below Clinton’s, she recently surpassed the bellicose billionaire as the least-liked candidate in history. \\nA poll released by ABC News and the Washington Post on Tuesday showed Clinton’s unpopularity had reached a record-breaking 60 percent, while Trump’s stood at 58 percent. \\nDespite her jingoism and promises to expand U.S. military efforts far beyond those of Barack Obama, organizers hope this public disdain may give them room to maneuver. \\n“Although Clinton will win the presidency, she will be a very unpopular president from day one, which will give us the political space to organize opposition to her foreign policy,” Aby said. \\nLombardo agreed. “Clinton is very unpopular, and while the election of Obama put a damper on the anti-war movement, I believe we will see that turn around under Clinton.” \\nHe also noted the growth of domestic social movements, like Occupy Wall Street and Black Lives Matter, that could herald a resurgence in mobilization. \\n“There is a downturn in the economy, distrust of the government and the system as a whole,” Lombardo said. “The connections with the wars abroad and the wars at home is clear to more and more people. I think a movement against increased war can be explosive and powerful during a Clinton administration.” \\nBut he added that there was much work to be done. “Although anti-war sentiment in the U.S. is high, the anti-war movement in weak compared to where it was in the past.” \\n‘No optimism, only apprehension’ A woman with the words “hands off” painted on her face takes part in a protest organized by the Stop the War coalition calling for no military attack on Syria from the U.S., Britain or France, across the road from the entrance of Downing Street in London, Wednesday, Aug. 28, 2013. \\nAs the clock ticks down to the election, numerous organizations have launched new efforts they hope will preempt the war drive expected to start soon after Jan. 20. \\nAlong with other groups and individual supporters, the United National Antiwar Coalition launched a “Hands Off Syria Coalition” and accompanying statement against further U.S. intervention in the war-torn country. \\nThe effort “is getting a tremendous response,” Lombardo said. \\nOther organizations, including the ANSWER Coalition and International Action Center , have called for protests against the inauguration in Washington. \\n“There’s no optimism, only apprehension,” International Action Center co-director Sara Flounders told MintPress. “People know in their bones that a larger war is coming. From the first day of a new administration, we need to send an angry warning.” \\nBut with the United States fatigued from a grueling election season that has left few residents with positive impressions of either candidate, widespread distrust of the political system may deny the new president the mandate he or she would need to embark on new military adventures. \\n“I think people are less naive now then they were eight years ago,” Aby said. “People understand that foreign policy is not an issue that truly separates the two major party candidates.” Be Sociable, Share!'"}, "time": 1742563893.7908998}