{"duration": 0.015825271606445312, "input_args": {"text": "'LAS VEGAS, Nevada  —   Former Vice President Joe Biden smacked failed 2016 Democratic presidential candidate Hillary Rodham Clinton here at the Salt Conference in Las Vegas on Thursday evening. [Speaking to a packed ballroom at the Bellagio conference center on the Las Vegas Strip, the former vice president, who himself declined to run for president, said he believes Clinton was not the “correct” candidate, but he was.  “I never thought she was the correct candidate,” Biden said. “I thought I was the correct candidate. ” The audience erupted into applause. The Salt Conference is an annual gathering of private equity leaders here in Las Vegas, organized by SkyBridge Capital founder Anthony Scaramucci. Scaramucci, last cycle, supported   Donald Trump. Biden declined to run for president last cycle after the death of his son. “No man or woman should announce for the presidency unless they genuinely believe that for that moment in the nation’s history they are the most qualified person to deal with the issues facing the country,” Biden also said. In an exclusive interview with Breitbart News in 2015 in his Trump Tower office, Trump said he expected to face Biden in the general election if Biden ran since Clinton had so many problems. “I think Hillary has got huge problems right now,” Trump said then, adding: “Is she going to make it? I hear this thing is big league. Why did she do it? You use the server? Because they’re always looking to go over the edge, whether it’s Whitewater or anything else. They always want to go over the edge. I’m just looking at it saying, ‘What the hell was she doing?’ You know what she was doing. She was guarding from the president seeing what she was doing. ” Biden did not run, Clinton got the nomination, and Trump smoked her on Election Day in the electoral college.'"}, "time": 1742628579.5371907}