{"duration": 0.04034852981567383, "input_args": {"text": "'A congressional candidate who formerly worked in IT but was replaced by an   guest worker says Americans should have “some input” over their jobs being outsourced. [After being profiled by Breitbart Texas, Connecticut’s 5th Congressional District candidate Craig Diangelo appeared on the Fox Business Network where he explained that currently, Americans have no   if their company wants to replace them with an   foreign worker.   “In the very beginning we did not know that we would be training our replacements,” Diangelo told Fox Business’ Charles Payne. “We had been called down to what they had called a ‘town hall meeting’ and this was in October of 2013. ” “The CIO, said that she would hold a town hall meeting to discuss the future of IT at our particular company, which at that time was known as Northeast Utilities,” Diangelo said. “We all got into the room, all 220 of us, and she proceeded to tell us that ‘Well folks, what we’re going to do is we are going to outsource IT infrastructure and IT development. We have chosen two companies, Infosys and Tata, and the reason that we’re doing this is because global workers can adjust to change a lot faster than the American worker. ’” “Now when you take a look at this, isn’t the American worker also a global worker?” Diangelo said. “Don’t we have some input into what’s we say or what gets said in regards to a global economy? After all, we are a very large market. ” Diangelo also said the foreign workers replacing the Americans, in his experience, were not the   types that the open borders and big business lobby often tout. “As they were bringing over 220 employees, we were told that we would do knowledge transfer to these individuals coming over here,” Diangelo said. “As we found out and as our company, our company at that time found out, the people coming over here from Southeast Asia did not have the job skills to actually take our positions. ” As Diangelo mentioned in an interview last week with Breitbart Texas, he is now looking to unseat      Rep. Elizabeth Esty ( ) saying he wants to revive the region of the state which was hit hard by multinational trade deals like NAFTA. “I identify with the America First agenda,” Diangelo said at the time. “This really is a big issue. ” John Binder is a reporter for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742563957.4616005}