{"duration": 0.07082223892211914, "input_args": {"text": "'PokeTheTruth on November 15, 2016 · at 6:39 pm UTC \\nPresident-elect Trump has much to learn and do but he needs the right people in his administration. The people “in the know” are the ones that must engage with Mr. Trump now, before it’s too late. \\nI want to share a letter written by an anonymous American to the editors of the American Conservative website. \\nTitle: Isn’t Anyone Going to Step Up? \\nDear American Conservative, \\nI’ll be brief. President-elect Trump is looking for a few good men for his cabinet and other key staffing positions. See: : https://www.greatagain.gov/serve-america.html . \\nAs you know, the president-elect is surrounded by militarists who wear a political cloak known as neo-conservatism, a.k.a. “neocons”. They are standard bearers for globalism and the new world order. They use the Pentagon’s Department of War as the overt mechanism to enforce their agenda of what I call the “3-B” foreign policy: Bribing other nations with financial and military aid, Bullying them with economic sanctions when those countries reject the demand of fealty and Bombing their resistance into submission. \\nBribing, Bullying and Bombing is a perversion of statesmanship and must end as America’s platform for relations with other nations. \\nWhat Mr. Trump is currently presented with are Washington beltway insiders and career bureaucratic policy makers. These are NOT the people to be part of his new administration. The brain trust he needs are people like you conservatives, who can think and reason with an intelligentsia based upon commonsense and reason founded in the core of federal republicanism. \\nMy own grandfather and father came to America not because of government subsidies or nationalistic fervor wrapped around a false sense of patriotism, nor for the many freedoms guaranteed in the U.S. Constitution. They came for what Lady Liberty offered with open arms; the opportunity for a better life. My father prospered by working hard, not by scheming to demand the wealth of others. \\nMr. Jon Basil Utley wrote this excellent article about John Bolton (see: http://www.theamericanconserva … ). \\nI ask Mr. Utley to do more, to consider filling out an application to serve in Mr. Trump’s administration. In fact, all you men should step up and submit your C.V. and get an interview. At least one of you might get face time to explain why these militarists (i.e., neocons) are the most dangerous plotters and planners of planetary chaos and must not be hired but instead purged from all forums of power that influence the federal government. \\nThere are many well-educated people in the field of economics, commerce, healthcare, foreign relations, etc. who have never served in a presidential administration and most likely have no interest in doing so. This is understandable. But if there ever was a time that good men such as yourselves were needed by America, it is now. Please think about it, what it would mean to the country, what it would mean to yourselves and posterity. \\nIn the 18th century, a group of men became known as the founding fathers of the federal republic. Those men have passed on and that is why our nation needs new visionaries to guide her back on the right path. Become more than your current station in life; the writers of prose on paper. Become the 21st century paladins to carry on the principles of equal justice under the rule of law, of civil society founded in representative democracy, of prosperity and peace, awaiting in the womb of hope to be born again.'"}, "time": 1742562616.9683046}