{"duration": 0.0847930908203125, "input_args": {"text": "'Diamond Reynolds was cool and composed as an anchorwoman on Wednesday night, her voice strong as she narrated the horrific scene around her into her phone that was streaming live on Facebook. “Please, officer, don’t tell me that you just did this to him,” she said, as her boyfriend, Philando Castile, lay slumped and bleeding in the car next to her, fatally shot by a police officer. “You shot four bullets into him, sir. He was just getting his license and registration, sir. ” By Thursday, Ms. Reynolds had given in to tears, fury and grief. “She’s not calm right now,” said an aunt, Joyce Doty, who lives in Indiana and was rushing to Minnesota to be with her niece. “She’s a hot mess. She is very, very upset right now. ” About Ms. Reynolds’s Facebook video, which had been viewed more than four million times by Thursday afternoon, Ms. Doty said, “She was doing what she had to do. ” Overnight, Ms. Reynolds, 26, has emerged as an extraordinary figure in the latest shooting of an   at the hands of a police officer. Apparently seconds after Mr. Castile was shot, she began to broadcast the scene live on Facebook, pointing her phone in the direction of the police officer, whose gun was still drawn, and at Mr. Castile, who was in the driver’s seat and wearing a seatbelt, his   soaked in blood. In doing so, she became not only a poised and influential witness, but a teller in real time of her own treatment by the police. Ordered out of the car, then to kneel near the car, she was handcuffed and put in the back of a police cruiser. Yet the Facebook report continued, a mix of confusion, outrage, shock and poised determination to tell her version of what had happened. On social media and on television, Ms. Reynolds was praised for her strength. “I truly believe Diamond Reynolds was spared her life because she’s got a greater purpose,” wrote the user @full_of_moxie on Twitter. “She’s going to get justice for #PhilandoCastile. ” Mr. Castile, Ms. Reynolds and her    daughter spent part of Wednesday running errands and going grocery shopping, she told reporters. Around 9 p. m. she said, they were pulled over by the police, apparently for a traffic violation. While she streamed video in the aftermath of his shooting, dozens of friends on Facebook wrote messages of concern. Some said they were praying. Others urged her to stay calm and avoid angering the officer. A few tried to ascertain where she was and coordinate efforts to go pick her up. But she was taken into police custody immediately after the shooting and was not released, she said, until police officers dropped her off at her home at 5 a. m. Hours later, Ms. Reynolds stood in front of the governor’s mansion, surrounded by crowds of people protesting the killing of Mr. Castile, who was a longtime employee of the St. Paul school district. “I didn’t do it for pity, I didn’t do it for fame,” she told the cameras and people assembled. “I did it so that the world knows that the police are not here to protect and serve us. They are here to assassinate us. They are here to kill us. Because we are black. ” It was unclear if Ms. Reynolds had slept since her boyfriend was killed. She met with Gov. Mark Dayton of Minnesota, who later spoke about the shooting in unusually forceful terms, saying that he did not believe it would have happened if Mr. Castile was white. Ms. Reynolds, who goes by Lavish on Facebook, identifies herself on her page as a native of Chicago who works as a housekeeper at a hotel. She said on Thursday that she had no family in Minnesota. Family members said she spent her early childhood living on the South Side of Chicago. “They took my lifeblood,” she told reporters. “That was my best friend. I never got to say my last words to that man. ” Dawn Spikes, Ms. Reynolds’s   said from her home in Chicago that the day had passed in a haze of confusion. For hours early on Thursday, they did not know where Ms. Reynolds was and feared that she had been harmed. By the end of the day, she was surrounded by friends and activists. The Rev. Al Sharpton, Ms. Spikes said, had called to offer plane fare to Ms. Reynolds’s mother so she could travel from Indiana to be with her daughter. Ms. Spikes had not brought herself to watch the full video from Wednesday night. But she said she was not surprised that Ms. Reynolds, who she described as strong and outspoken, reacted the way that she did. “Diamond was calm, and the baby was calm,” she said. “Like they go through this every day. But they don’t. ”'"}, "time": 1742562976.1486769}