{"duration": 0.15973448753356934, "input_args": {"text": "'“I’m a pretty good detective,” Jane Klain said, but she is no     gumshoe. She is in charge of research services for a museum. The latest product of her sleuthing was playing on a computer on the desk behind her  —   a   performance of “The Glass Menagerie” starring Shirley Booth, Hal Holbrook and Barbara Loden that was broadcast 50 years ago. As far as anyone knew, the master videotape was lost. Ms. Klain, who works for the Paley Center for Media, formerly the Museum of Broadcasting and the Museum of Television and Radio, is always on the lookout for lost programs that are sought by scholars and biographers. Late last year, she noticed a   listing that led to four forgotten reels of videotape at the University of Southern California  —   the raw footage from which the original master tape of “The Glass Menagerie” was assembled. She turned to video restoration specialists, who created what amounted to a new master tape. It will be shown on Thursday on Turner Classic Movies, 50 years to the day after the original telecast. “She is one of the heroes of archiving and finding these lost treasures,” said Dan Wingate, who does video reconstructions and put together the new final version of “The Glass Menagerie. ” “It takes someone with real dedication and diligence and being willing to be said ‘no’ to over and over and keep going, and that’s what she has. ” Charles Tabesh, senior vice president for programming and production for TCM and the   site FilmStruck, described her as “knowledgeable, passionate and eager to talk about anything that’s exciting that she has stumbled across or discovered. ” In 22 years with the museum, she has discovered dozens of video treasures, not all from the very earliest days of television. She mentions tracking down a broadcast of the musical “Junior Miss” that starred Don Ameche, Carol Lynley and Jill St. John in 1957, and a kinescope of a rehearsal of Rodgers and Hammerstein’s “Cinderella,” also from 1957. She kept after archivists at the University of Wisconsin until they checked an    closet and found what she was looking for, a videotape of Edward Albee’s play “The American Dream,” recorded in 1963, but never broadcast. She had seen it on a listing of the places in which the producer David Susskind’s programs were housed. “The Glass Menagerie,” also produced by Mr. Susskind, had long been on her wish list, in part because the play is perennially popular and the 1966 telecast stuck in viewers’ minds. “Every time a production of ‘The Glass Menagerie’ bubbles up, people contact me: ‘What about the Shirley Booth one? ’” she said. “The answer has always been, ‘No, it doesn’t exist. ’” The disappearance of the tape was puzzling. The program was praised by Jack Gould, then the television critic for The New York Times. He called it “an evening of superb theater” and described Miss Booth as “fluttery” and “appropriately intrusive as the perennial Mrs. ” although he noted that at times, “her belle seemed a shade mechanized and not intuitively Southern. ” Ms. Klain located the raw footage from another list of Mr. Susskind’s programs. “I looked through it casually,” she recalled. “It said, ‘Glass Menagerie, U. S. C.’ I said, ‘What? ’” She called her counterparts in the university’s cinematic arts library, who found the reels. It turned out that they contained six hours, take after take. “Nowhere did it say they added up to the production,” Ms. Klain said. She arranged to have the tapes restored and digitized at DC Video in Burbank, Calif. Then she turned to Mr. Wingate. Along the way, she made another discovery, of an audio recording of the broadcast, apparently made on a home tape recorder. By comparing sound patterns from the tape recording with the audio from the takes, he could figure out exactly what had gone into the broadcast. “It was daunting,” he said. “Sometimes they would use a part of this take and then they would use a part of that take. You would find a piece of it, and then it would go out of sync and you’d realize you were hearing something from another take. ” Ms. Klain wanted the result seen and approached Mr. Tabesh of TCM. “When she calls and says ‘There’s this amazing program that only aired once and a lot of people are eager to see,’ I take that seriously,” he said, and he scheduled it without screening it himself: “I trust Jane’s judgment enough to feel comfortable putting it on. ” Ms. Klain has not found her   program, a 1967 production of “Annie Get Your Gun” starring Ethel Merman. Some years ago, she found the box that the master tape had apparently once been in. The box  —   in a storage vault leased by NBC, which had broadcast the program  —   was empty. On the label, “‘Annie Get Your Gun’ with Ethel Merman” had been crossed out. As for “The Glass Menagerie,” Ms. Klain remembers watching the original broadcast in 1966, when she was a teenager. She disliked Miss Booth’s performance so much that she threw something at the TV  —   an apple. Her assessment has not changed. Her reaction has. “I’m a ” she said. “I don’t throw things anymore. Also, my sofa is further away from the TV than we were then. I’d really miss with an apple. ”'"}, "time": 1742563655.8669114}