{"duration": 0.1493384838104248, "input_args": {"text": "'Good morning.  Here’s what you need to know: • A powerful earthquake triggered a tsunami off the coast of Japan, near where three nuclear reactors melted down at a plant in Fukushima after a quake and tsunami in 2011. Minor injuries were reported. A cooling system in a reactor in a nuclear plant shut down, but was restored without incident. Tsunami warnings were lifted by early afternoon. _____ •   Donald J. Trump released an   YouTube video in which he asserted that his transition was going “very smoothly, efficiently and effectively” and discussed top priorities for his first day in office. One of them: beginning the process of withdrawing from the   Partnership. Here is the latest on the transition and a look at what he hopes to accomplish in his first 100 days. _____ • The importance of one factor that played into the election is still emerging: the role of fake news. Some false stories are produced deliberately, but some build from misinformed social media posts. We look at how one mistaken tweet by a man with just 40 followers exploded through the hyperpartisan blogosphere. _____ • The fallout from revelations of Russia’s   doping program is rewriting the record books for the Beijing and London Summer Olympics. The retesting of stored urine samples has incriminated at least 40 medal winners, the majority from Russia and other Eastern European countries. Medals from the 2014 Sochi Olympics are also likely to be called into question. _____ • President Obama returns home from the   Economic Cooperation summit meeting with China ascendant. President Rodrigo Duterte of the Philippines said he plans to declare part of the Scarborough Shoal a marine sanctuary, another sign of growing rapprochement between Beijing and Manila. _____ • South Korea’s opposition, the People’s Party, has started collecting signatures in Parliament to impeach President Park   over an   scandal. Many South Korean women worry that Ms. Park’s troubles could make the country, already among the lowest in global   rankings, even more resistant to elevating women to positions of power. _____ • “Fantastic Beasts and Where to Find Them,” cast a spell on international audiences, earning $143 million in a partial release. In Korea, the Harry Potter spinoff accounted for nearly 70 percent of the total weekend box office. The film opens soon in China and Japan. • The Taiwanese carrier TransAsia Airways has canceled all flights and suspended trade on its stocks, pending a major announcement today. • Samsung and Panasonic are investigating allegations that migrant Nepalese workers were abused working in the companies’ supply chain in Malaysia. • A European documentary photographer visited call centers in India and the Philippines, creating a window to the world on the other end of the line. • Quit social media. That’s the advice of a university professor who says that doing so could benefit your career. “If you’re serious about making an impact in the world,” he says, “power down your smartphone, close your browser tabs, roll up your sleeves and get to work. ” • United States markets were higher, and the major indexes were on pace to close at record levels. Here’s a snapshot of global markets. • Afghanistan’s chief executive, Abdullah Abdullah, condemned a suicide bombing in Kabul that killed at least 27 people as “a war crime and an act against Islam and humanity. ” [The New York Times] • Britain’s decision to withdraw from the European Union might have seemed simple at first, but the details are a matter of principles as well as economics. [The New York Times] • The Vatican extended a policy allowing priests to grant forgiveness for abortion, continuing Pope Francis’s aim to make the church more welcoming and inclusive. [The New York Times] • Here’s our look at some of Pope Francis’s other efforts to reshape the Roman Catholic Church. [The New York Times] • As America’s   white nationalists embrace Mr. Trump’s victory, we take a look at how the movement overlaps with white supremacy. [The New York Times] • The award for the world’s best rice went to Thailand’s Hom Mal at a recent industry contest. Cambodia’s Phka Rumdoul took second place, and Japonica rice, from the U. S. was third. [The Phnom Penh Post] • We spoke with Martin Scorsese about his new film, “Silence,” which is based on a novel about missionaries in 17th century Japan. The movie is his ultimate passion project. • The world’s best climber is taking on Yosemite’s Dawn Wall. He wanted to shatter a record. Now he’s just trying to finish. • The next great space telescope spread its wings this month, but it won’t launch until October 2018  —   and it won’t record its first real image until 2019. • A monumental sculpture of a fistful tulips by the artist Jeff Koons will be donated to the city of Paris to commemorate the victims of terrorist attacks. • Our Daily 360: Take a flight over California’s forests, where tens of millions of   trees have created a tinderbox for wildfires. Ah, the family road trip. Every country with cars knows the drill, and this week the United States will see some of its busiest traveling days of the year with the Thanksgiving holiday. AAA predicts that 43. 5 million Americans will be on the roads. What to do as you’re going over the river and through the woods to grandma’s house? While   comforts, apps and     screens have made it easier to pass the time while on the road, the games of yesteryear can offer a twinge of nostalgia for adults and a   option to entertain the kids. Whether it’s spotting roadside novelties  —   as in I Spy or Bingo  —   or vehicles from different states (or countries)  —   as in the license plate game  —   most games are variations on a scavenger hunt. (Punch Buggy, which depends on spotting a dwindling supply of old Volkswagen Beetles, could just be an exercise in frustration.) In Britain, car snooker adapts the rules of the cue sport on which it’s based, requiring players to spot vehicles of different colors. Earlier this year, The Times also collected favorite travel games from readers (one is titled “Guess What I Saw? ”). Perhaps more important, in the aftermath of a contentious election, getting to dinner might be more fun than the destination itself. Chris Stanford contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742561659.2641907}