{"duration": 0.07491493225097656, "input_args": {"text": "'Headlined to H3 10/26/16 - Advertisement - Philippines president Duterte announces \\'separation\\' from US during China visit Philippines President Rodrigo Duterte announced his \\'separation\\' from the United States, expressing his desire for the Philippines to become more dependent ... License DMCA \\nPhilippine President Rodrigo Duterte in Beijing, China announcing separation from the United States Considering US belligerence in the world particularly since 9/11, the idea of a countries elected leader standing up and defying the US hyper power is something to behold. The latest leader to exercise his countries right of sovereignty is Philippine President Rodrigo Duterte. Duterte speaking during a state visit to Beijing, China announced, \"Your honors, in this venue, I announce my separation from the United States...both in military and economics also\".[1] He said, \"America has lost\" while announcing a new alliance the Philippines, China and Russia, \"there are three of us against the world\". Of course Duterte is not the first leader to poke his middle finger at the US imperialist. Fidel Castro did it with Cuba in 1959, as did Hugo Chavez in Venezuela in 1999. Two at least who spoke truth to power, put his people first at great risk to himself when they separated their country from US hegemony over them, survived many US attempts to undermine or assassinate and overthrow them. There\\'s too many others to mention here that didn\\'t survive or were overthrown in CIA initiated coups, color revolutions, regime change et al. Is this somehow subversive coming from an American extolling foreign leaders that have defied the US? Or is it an acknowledgement that we, the US, can\\'t dictate to the world. That it\\'s a countries elected leaders purpose to exercise his judgment to do right by his people, follow an independent course to best serve his people, not be subservient and dictated to by the US. If the people disagree with such a leader they can elect someone else or impeach him for felonious behavior. Maybe that\\'s a bit naive, too ideal for the complex world we live in today. - Advertisement - But we as a country have completely lost our way, been an imperialist bully, initiating illegal wars and occupations, aggression against countries that are no threat, imminent or otherwise to America. Authorized torture, indefinite detention, extraordinary rendition, kill innocents in drone strikes and missile attacks, order the targeted assassination of anyone, anywhere, including American citizens if the president alone so decides. Initiate coups and regime change against any country that defies the US while conducting surveillance of ALL electronic communications of everyone in the world. This is not the behavior of a country capable of having mutual respect for others particularly those countries taking an independent course and not bowing to US diktat. We Americans can close our eyes, pretend or ignore what we have become; a rogue actor on the world stage. Yes rogue. What gave us the right to be the \"indispensible country\", exceptional, entitled, run roughshod against any leader-Putin being the leader now most demonized in US crosshairs. As for the Philippines, we took it as well as Cuba and Puerto Rico; booty from Spain in the aftermath of the Spanish American war of 1898. - Advertisement - Of course earlier in our countries inglorious history we stole much of what is now California, Texas and the southwest from Mexico while committing genocide and stealing most of the arable and tribal lands of the indigenous native peoples all in the name of \"manifest destiny\", as if it was some benign, natural, yet inexorable happenstance. Yeah right. Let\\'s admit it. Today we\\'re the beneficiaries of our countries earlier \"successful\" aggression against the indigenous peoples as well as a country built on slavery; peoples the government has never formally apologized to. We can ignore the truth of this aggressive history, believe it to have been the inevitable consequence overthrowing British colonialism and ridding the country of what the government and most white people then referred to as Indian \"savages\". Then later came the masses of millions of mostly European immigrants; those ancestors who came to America, a consequence of repression, lack of opportunity, religious intolerance they suffered in their native countries. And with them the American demographic changed forever from its colonial past. So now we\\'re a mass of different peoples, mostly adapted to our earlier British colonial heritage, \"connected\" to those who threw off British tyranny, declared their independence, formed a union and soon thereafter a formal constitution of rights under the rule of law. A country that began not wanting to engage in foreign entanglements, fiercely independent, embracing the protestant work ethic, most probably considered inward looking by today\\'s standards. It feels quaint, distant, a different sort of people than most in America now.'"}, "time": 1742561786.971871}