{"duration": 1.453993320465088, "input_args": {"text": "'Oct 26, 2016 3:50 PM 0 \\nSubmitted by Claudio Grass via Acting-Man.com, The U.S. Elections: The Latest Crack in the System \\nThe 2016 U.S. presidential elections are unprecedented: I don’t believe we have ever witnessed before a campaign year so toxic, so dangerously divisive and full of ad hominem attacks. Both camps have vilified the opposition and their followers, creating a schism in society. There has been no rational dialogue on the issues that truly concern the American public. \\nThe schism \\nInstead, we have witnessed personal insults and petty attacks, rumors and gossip. At this point, as a result of this catastrophic campaign, the public will not vote in favor of the candidate they agree with the most or the one they like, but against the one they hate! \\nIn this article, we do not focus on comparisons between Clinton and Trump; enough has been said and written about the candidates themselves. Here, we look at their supporters – the crowd behind the candidates, those that will in fact shape American policy making in the coming four years. \\nHillary Clinton: The Establishment Remains in Control \\nThe most important and formidable group within those backing Clinton belong to the upper echelon of society: Wall Street’s movers and shakers, big business, the top of the political pyramid and the servants and profiteers of the public sector. In one word: the establishment. \\nClinton’s support base includes therefore practically everyone who profits from government regulations and government corruption – they have everything to lose if Hillary doesn’t win. It is the same group that advocates and leads the political correctness movement ; they are those state-bred and fed intellectuals who poison the university campus and mass media circus with their belief that they can transform the U.S. into a “utopia”. \\nThe candidate anointed by the Deep State \\nIn reality, this “utopia” will be created through intense centralization, endless wars and plundering, only to create a totalitarian government where the political elite enforces its will and instructs the public on how to live a happy life, which only benefits the top strata of society that designed it in the first place. Years ago, Jewish American philosopher Hannah Arendt summarized the toxic impact of political correctness as follows: \\n“There is no thought process without freedom. To deprive man of his liberty is to deprive him of his own ideas, and if one is not allowed to think, only subjugation and slavery remain.” \\nThis can only be achieved through a strong foothold on the centralized state and its propaganda engine, the mass media, operating under the doctrine of Edward Bernays, the father of propaganda, better known as public relations. \\nThen there’s the other extreme of Clinton’s supporters: the artificially created underprivileged minorities. These groups have come to depend on the state for support and protection, which has also made it easy for the state to indoctrinate them and reset their mindset to its advantage. \\nThose are the people who have fallen in the trap of thinking that only the state can provide them with what they need for a good life, when in reality it only disempowered them. The globalist Clinton herself accuses Trump of “populism”, casting “nationalism” in a negative light, but she is actually the one promising free lunches for everyone: lenient immigration laws, higher minimum wages, universal healthcare, etc. \\nClinton also preaches against income inequality and condemns Wall Street greed in her speeches, while her campaign cashes in from Wall Street’s finest: JP Morgan, Morgan Stanley, Citigroup and Goldman Sachs. \\nUnder those circumstances… what can you possibly do? Ms. Clinton’s top five donors are Citigroup, Goldman Sachs, DLA Piper, JP Morgan, Morgan Stanley. Somehow we don’t think Wall Street has reason to fear her much. Trump – the Greatest Politically Incorrect Shock in Decades? \\nWhenever people are forced by the government to accept and pay for things they do not want, the outcome is discontent and opposition, typically suppressed and downplayed by the mainstream media in accordance with the state’s agenda of political correctness. This further escalates the situation and things often take unpleasant turns, including the fostering of racist and bigoted subsections that we see within the Trump voting base. \\nBut they are not the majority, not by long shot! One might get this impression, because the mainstream media tend to focus exclusively on this sub-set of supporters through footage and interviews at Trump rallies, because they are considered “interesting” material; after all, they say outrageously horrible things and are therefore great for TV sensationalism. \\nWhat does Donald Trump stand for? From my perspective, for anything and everything! He stands for everyone who is sick and tired of the current system and the political elite who have grown out of touch with ordinary American citizens. You will find them among the working class, small business owners, and the segment of society that used to be known as the middle class before the crisis; they all harbor grievances against the establishment. \\nThere have been a few halfhearted attempts to paint Trump as part of the establishment because he is rich and has always hobnobbed with the elite as a result of his social status, but they have generally failed. For one thing, he is not a politician. For another thing, his consistent political incorrectness and the list of his political enemies (which includes many Republican Deep State zombies) has simply made it impossible to lump him with the establishment. \\n\\nThese are people who understand that the slogan “the Union and the Constitution forever” has been under attack and downgraded to nothing more than an empty phrase by the power elite and the Deep State. We see first hand how the Patriot Act directly violates not only the first amendment’s guarantee of free speech, but also the fourth and fifth amendments, thereby tearing apart the very foundation of a country once based on respect for civil liberties. \\nThere is no doubt that the second amendment will be crushed under Clinton as well, “regulating to extinction” the natural right to self-defense and personal sovereignty. We must never forget that we are born with inherent rights, that can neither be granted nor taken away from us by the State. As Judge Napolitano once put it: \\n“Natural law teaches that our freedoms are pre-political and come from our humanity and not from the government. As our humanity is ultimately divine in origin, the government, even by majority vote, cannot morally take natural rights away from us. \\n\\nA natural right is an area of individual human behavior – like thought, speech, worship, travel, self-defense, privacy, ownership and use of property, consensual personal intimacy – immune from government interference and for the exercise of which we don’t need the government’s permission.” \\nHillary Clinton and Donald Trump face to face in the last of three presidential debates under the banner of “The Union And The Constitution Forever” \\n\\nEven though polls suggest that Trump is trailing nationally, they probably underestimate exactly how big the Trump wave is, and it is significant: between 74% and 83% of Republicans said they will support him (according to polls conducted between Oct 9 th -11 th ). But there is also the silent majority that has been present at his rallies. This silent majority does not necessarily consist of Trump fans, but they do not want to see the country falling into the abyss of state centralization and political correctness. A sign often seen at Trump rallies these days – which continue to attract lots of people. Only recently, 20,000 deplorables came to see Trump at a rally in Tampa, while Hillary Clinton’s running mate Tim Kaine motivated a grand total of 50 people to come and hear him speak in West Palm Beach (reportedly they weren’t particularly enthusiastic; we don’t know how many of the 50 were from the press). \\n\\nThey want to discontinue the economic system that has taken them from bad to worse – they are the American version of the European anti-establishment movement. They are well aware of Trump’s coarse character and crude remarks, but feel they can overlook that, for the sake of his main strategic advantage: Trump’s promise that he does not want America to be controlled by the establishment anymore. \\nA Tale of Two Hatreds \\n“Politics is like sausage being made. It is unsavory, and it always has been that way, but we usually end up where we need to be. But if everybody’s watching… then people get a little nervous, to say the least. So, you need both a public and a private position.” Hillary Clinton, National Multi-Housing Council, April 2013 \\nOne key reason behind the peoples’ hostility towards Clinton is that she personally embodies the hypocrisy and the hubris of the U.S. federal government itself: a government that maims and kills millions with its war on terror, it arms and supports murderous regimes and ideological fanatics and it is known to deploy chemical, biological and nuclear weapons. And yet, it somehow pretends to hold the moral high ground and lectures others on human rights. \\nJust as America is an “exceptional” country, for which normal standards don’t apply, Clinton is its “exceptional” candidate. She accuses her opponent of populism, when her own platform is entirely based on crowd-pleasing promises. \\nShe calls Trump’s policies fascistic while her own would put the final nail on the coffin of free speech. She claims to stand up for the little guy, while she funds her campaign with Wall Street money. She positions herself as the defender of minorities’ and women’s rights, while her Foundation accepts donations from the most oppressive regimes on the planet. \\nDefending the rights of women isn’t cheap, so obviously one can’t be too picky and choosy about one’s donors. \\n\\nAt the same time, the American electorate also feels hostility for Trump; that hate is not equivalent though, as few would argue he is trying to hide who he is. The reason why so many dislike him is very different, and it has to do with the identity he projects. He is the ultimate “anti-intellectual”. \\nOf course the term “intellectual” is quite broad these days, and many intellectuals dislike Trump solely because of what it would say about who they are (in the eyes of their like-minded peers). But these people share a common denominator: they are educated beyond their intelligence and critically depend on repeating what other “intellectual” people say, as they feel (consciously or not) their ignorance would be exposed if they dared to express an original idea. \\nTrump’s world, according to a recent NYT cartoon. The statist intelligentsia certainly feels threatened by Trump. \\nThe Day After: The Legacy of a Bitter Campaign Year \\nUnfortunately, whoever wins, the nation will pay a price for this “divide and conquer” rhetoric. Americans today are too polarized and the tensions that are brewing in the background will not just go away the day after the election: racial and social divisions, as well as the split caused by the choice between a planned vs. a free market economy, a big or a small government. \\nUnder Trump, we can only hope that America will be given time to heal and to overcome these divisions. Free speech is key: Society can only heal if it returns to a culture of debate with a willingness to agree to disagree. \\nFrom what we know from modern American history, we shouldn’t be surprised that the financial markets appear to prefer Hillary over Trump. Wall Street, the bankers and the military industrial complex are expected to continue to thrive under President Clinton. The establishment will live on. Right now the establishment is seemingly pushing for war against Russia and Clinton is undeniably on board with this aggressive narrative. \\nAnd then we have Trump, who is certainly far from perfect. His objectification of women, his comments about Muslims and minorities, his crass demeanor: All these have made it very hard for him to find support for his genuine policy points. Will the “silent majority” be able to actually swing the election for Trump? Although the mainstream media seem to be of one mind regarding the election outcome, we certainly wouldn’t rule it out. If ever there was a candidate provoking the “Bradley effect” in polls, it is surely Trump. Moreover, thanks to Wikileaks it is by now public knowledge that the polls are indeed rigged . Readers may recall that we have expressed doubts about the accuracy of poll sampling methods already some time ago. \\n\\nEven if the actual net effect of his policies were to benefit women, he won’t get them on his side by calling them pigs – there is a difference between free speech and just being plain rude, uncivil and vulgar. We may disagree with his infamous “wall” with Mexico and demands for “a new budget to rebuild our depleted military” (which makes him no different from Clinton). But he is an outsider, a businessman, and most importantly, a crack in system! \\nHe challenges the status quo, and that’s why the status quo attacks him, by trying to ridicule both him and his voters, by painting them as extremists, or as ignorant and racist. The question is, why don’t we just let Trump be Trump? \\nAs he himself said: “It is so nice that the shackles have been taken off me and I can now fight for America the way I want to!” . Consider the boldness of this statement – regardless of whether one agrees with him, he stands confidently for his principles and ideas, even against his own party’s leaders (many of which have withdrawn their support). This is a clear projection of power and independence; it says that no one can dictate their demands to him. It says that he is unafraid to speak his mind. \\nI say, we should trust his followers. It seems clear that most Trump voters are striving to defend the essence of the constitution and its original intent – to be the basis of a free society. And for me as a believer in civil rights and sovereignty, this is enough to give him or let me rather say, his voters, the benefit of the doubt.'"}, "time": 1742563542.409195}