{"duration": 0.08164405822753906, "input_args": {"text": "'in: Civil Rights , Government , Government Control , Government Corruption , Losing Rights , Tyranny & Police State (image credit: http://www.raul-manzano.com/en/aflags.html) On Thursday, Vladimir Putin asked “is America a banana republic?” American writer O. Henry (William Sydney Porter) coined the term. It refers to a politically unstable and/or repressive country where a small percent of the population enjoys a disproportionate share of wealth and power. It’s where ordinary people are exploited, persecuted, imprisoned, murdered or disappeared for daring to challenge ruthlessly corrupt power responsibly, where profits are privatized while ordinary people bear the burden of high unemployment, impoverishment and loss of fundamental freedoms. It’s a kleptocracy run by criminals, complicit with corporate thieves, bribing them to get their way – corrupt, rotten to the core gangsterism, run for personal gain, profiting at the public’s expense. Bill and Hillary Clinton, America’s most notorious crime family, a Machiavellian duo, are heading back to Washington in January for their third co-presidential term, things rigged to assure it. Their excessive corruption rivals how mafia bosses and drug lords amass wealth – the old-fashioned way by stealing it, selling influence, and other disreputable means. Corruption is endemic virtually everywhere, likely nowhere more excessively than in America, given the nation’s enormous public and private wealth, its distribution as disproportionate as in third world countries, special interests grabbing all they can at the expense of most others. Inside the bubble is paradise – outside dystopian hell. America resembles Guatemala, thirdworldized for its privileged few, bipartisan gangsters profiting at the expense of the public they’re sworn to serve. Never with Hillary and Bill in charge, addicted to endless wars, predatory capitalism and self-enrichment. WikiLeaks exposed volumes on how they operate. Even the militantly anti-Trump, pro-Hillary Washington Post took note – on October 26 headlining “Inside ‘Bill Clinton Inc.:’ Hacked memo reveals intersection of charity and personal income.” Written by top Bill Clinton aide Douglas Band, it explained “a circle of enrichment,” involving blurred lines between the Clinton Foundation and “top-tier” corporate clients of his for-profit Teneo Consulting firm. It provided a detailed look at how the Clintons and their top aides operate. It’s not pretty. According to WaPo: “Band’s memo provided data showing how much money each of Teneo’s 20 clients…had given to the Clinton Foundation, how much they had paid Bill Clinton…” “Band wrote that Teneo partners had raised in excess of $8 million for the foundation and $3 million in paid speaking fees for Bill Clinton.” “He said he had secured contracts for the former president that would pay out $66 million over the subsequent nine years if the deals remained in place.” One observer called the Band memo “the Rosetta stone of the Teneo-Clinton Foundation complex” – a revenue generating arm for large Foundation donations, along with highly-paid Bill and Hillary speeches, he after leaving the White House, she in 2013 and 2014 after leaving State, before announcing her presidential candidacy. What’s coming under their leadership should shock and terrify everyone – policies polar opposite ones Hillary promised on the stump. They’ll be broken straightaway once in power, the way GW Bush, Obama and the first Clinton co-presidency betrayed loyal supporters – this time more ruthlessly dangerous than ever. Submit your review'"}, "time": 1742563596.1007912}