{"duration": 0.07904386520385742, "input_args": {"text": "'Originally appeared at Anti-Media \\nAs Russia and the United States approach arguably the most dangerous crossroads in history — and as Western media continues to crucify Russia for its actions within Syria — a closer look at the rationale Putin used for intervening in the Syrian war paints a sane explanation of how we ended up at this juncture of a global conflict. \\nUnsurprisingly, the explanation comes from the Russian president himself and was actually offered over 3 years ago. As expected, the Western corporate media and the Obama administration chose to ignore Vladimir Putin’s explanation for Russia’s stance on Syria and continued a number of policies that have completely exacerbated the conflict. \\nIn a live interview with RT in June 2013, Putin was asked for an explanation regarding Russia’s support for Bashar al-Assad in Syria, even though this support has made some people very angry at Russia. Putin’s response was that Russia does not support the Assad government or Assad himself, but before defining Russia’s official position, he explained what Russia does not want to do within Syria or across the Middle East: \\n“We do not want to interfere into the internal schism of Islam, between Shias and Sunnis. These are internal issues of the Islamic world. We have very good relations with much of the Arabic world, Iran for example, and others.” \\nHowever, according to Putin, what worries Russia can be identified by having a look “at what is going on in the Middle East in general.” \\n“Egypt is not calm. Iraq is not calm – and it is not assured in its continued existence as one state. Yemen is not calm; Tunisia is not calm. Libya is witnessing inter-ethnic, inter-tribal conflict. So the entire region has been engulfed, at a minimum, into a state of conflict and undecidedness. And now Syria, down the same path.” \\nIn Putin’s eyes, these events are no accident. As he puts it, these events happened for a reason: \\n“Some people, from the outside, think that if they can ‘comb’ the region to how they see fit – some of them call this ‘democracy’– then the region will come into calmness and order. That’s not how it is. Without taking into account the history, the traditions, religious particularities, you must not do anything in the Middle East, especially as an outsider.” \\nRussia found this out the hard way when its military intervened in Afghanistan in the 1980s, a war many historians believe to be one of the main reasons for the fall of the Soviet empire. According to Robert Gates , director of the CIA under Ronald Reagan and George H.W. Bush and Secretary of Defense under both George W. Bush and Barack Obama, the U.S. began arming and funding jihadists in Pakistan and Afghanistan six months prior to the Soviet invasion with the express goal of luring the Soviets into a quagmire. \\nSimilarly, and not by accident, the tactic used to draw Russia into Afghanistan is the same tactic being used today in Syria. In fact, Obama warned Putin that Russia’s adventures into Syria would result in the same quagmire the Soviets met in Afghanistan. \\nUnsurprisingly, supporting radical militant groups to overthrow regimes in the Middle East has been a key hallmark of Obama’s foreign policy. As Putin notes: \\n“So they interfered in the internal affairs of Libya. Whether the [Gaddafi] regime was good or bad – but Libya used to have the highest standard of living in the Middle East. And what’s happening there now? There’s a war for resources; an endless inter-tribal war. How is this all going to end – nobody knows.” \\nWhat happened to Libya resonated strongly with Russia due to the fact that in that situation, the West convinced Russia and China not to use their veto power at the U.N. Security Council level — they were told regime change was not part of NATO’s agenda in Libya. As it turned out, however, this was one of the first things that happened as soon as authorization was granted for NATO to bomb Libyan territory. Putin immediately questioned why NATO was attacking Muammar Gaddafi directly despite their promises they would not do so. \\nPutin has therefore drawn the following conclusion: \\n“What worries us is that if the same is done in Syria, then it will be in the same state as Libya. Is it not enough that we already have a small lawless territory between Afghanistan and Pakistan? Nobody governs the area, it’s just groups of rebels. This is very close to our borders, do we want another?” \\nThe role of al-Nusra in the Syrian conflict continues to be the main issue today, as Russia has repeatedly asked for the United States to differentiate between terrorist groups and moderate groups on the ground in Syria. \\nAs Putin said: \\n“You know what [the Americans] can’t answer us? The key armed opposition group…al-Nusra…Yes, this organization is one of the key ones in the armed opposition [against Assad]. The U.S. State Department has confirmed it is a terrorist organization linked to al-Qaeda. Al-Nusra does not hide that fact. And – what are [the Americans suggesting]? For al-Nusra to be in the future parliament?” \\n“Or, here’s another example. They support certain organizations that are fighting against Assad in Syria, yet those same countries [who support them in Syria] fight against these organizations in Mali.” \\nPutin’s reference to fighters in Mali is a direct attack on France’s role in the war on terror. France has been actively bombing Mali since 2013, though this is rarely covered by the mainstream media. As Russian Foreign Minister Sergei Lavrov has noted , the fighters France supported in Libya to overthrow Gaddafi were the same fighters they have supposedly been fighting in Mali. \\n“Often, not only are they the same organizations – they are the same individuals,” Putin added. \\n“They simply leave Syria and go to fight in Mali – where western states do not support them. Then the same people go back to Syria and there they are supported.” \\n“Where is the logic? How will it all end? These are not just empty words.” Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742628422.0012991}