{"duration": 0.08647418022155762, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nFormer Washington Post film critic Stephen Hunter has a depiction of “The Narrative” in one of his novels. Now, here’s former New York Times entertainment industry reporter Michael Cieply with some interesting observations on The Narrative at the NYT . From Deadline : \\nby Michael Cieply November 10, 2016 12:59pm \\nIt’s been a moment for soul-searching, and to some extent repentance, at the New York Times. In much-discussed remarks to his own media columnist James Rutenberg, executive editor Dean Baquet offered a mea culpa for having missed the Donald Trump surprise, though he spoke less for the paper than for journalists in general. “We’ve got to do a much better job of being on the road, out in the country, talking to different kinds of people than we talk to — especially if you happen to be a New York-based news organization — and remind ourselves that New York is not the real world,” Baquet said. \\n… “As The Times begins a period of self-reflection, I hope its editors will think hard about the half of America the paper too seldom covers,” wrote Spayd. \\nShe continued: “The red state America campaign coverage that rang the loudest in news coverage grew out of Trump rallies, and it often amplified the voices of the most hateful. One especially compelling video produced with footage collected over months on the campaign trail, captured the ugly vitriol like few others. That’s important coverage. \\nOr it’s intentionally misleading. \\nBut it and pieces like it drowned out the kind of agenda-free, deep narratives that could have taken Times readers deeper into the lives and values of the people who just elected the next president.” \\nHaving left the Times on July 25, after almost 12 years as an editor and correspondent, I missed the main heat of the presidential campaign; so I can’t add a word to those self-assessments of the recent political coverage. But these recent mornings-after leave me with some hard-earned thoughts about the Times’ drift from its moorings in the nation at-large. \\nFor starters, it’s important to accept that the New York Times has always — or at least for many decades — been a far more editor-driven, and self-conscious, publication than many of those with which it competes. Historically, the Los Angeles Times, where I worked twice, for instance, was a reporter-driven, bottom-up newspaper. Most editors wanted to know, every day, before the first morning meeting: “What are you hearing? What have you got?” \\nIt was a shock on arriving at the New York Times in 2004, as the paper’s movie editor, to realize that its editorial dynamic was essentially the reverse. By and large, talented reporters scrambled to match stories with what internally was often called “the narrative.” We were occasionally asked to map a narrative for our various beats a year in advance, square the plan with editors, then generate stories that fit the pre-designated line. \\nReality usually had a way of intervening. But I knew one senior reporter who would play solitaire on his computer in the mornings, waiting for his editors to come through with marching orders. Once, in the Los Angeles bureau, I listened to a visiting National staff reporter tell a contact, more or less: “My editor needs someone to say such-and-such, could you say that?” \\nThe bigger shock came on being told, at least twice, by Times editors who were describing the paper’s daily Page One meeting: “We set the agenda for the country in that room.” \\nYou can see this in agenda-driven stuff like World War T and the Military / Campus Rape Culture hysterics. These are not news, they are planned campaigns of psychological warfare. \""}, "time": 1742561940.2594142}