{"duration": 0.0559995174407959, "input_args": {"text": "'Share This A photo of Hillary Clinton with some police officers popped up on social media over the weekend, but people were divided in their reaction to it. The post on the Facebook page for the Medford Police Patrolmen’s Association caused controversy and backlash online over the content and what the was seen being done to crooked Hillary. The post showed Medford Police officers at the Fall Festival in Haines Square on Saturday. The photo was done in fun and captioned, “Look who MPD grabbed at the Fall Festival in Haines Square today…” This image is an accurate depiction of what we all would like to see: Hillary in handcuffs. As you can plainly see, the photos show police officers with a woman in an orange jumpsuit, handcuffed. It appears that they are arresting someone, who wore a mask in the likeness of Hillary Clinton. Screenshot from the Medford Police Patrolman’s Facebook page \\nIn a second photo, the police officers posed with a person in a Donald Trump mask, with the caption, “Making America GREAT again in West Medford Square!!” Screenshot from the Medford Police Patrolman’s Facebook page \\nSince a fair amount of overly sensitive pansies made a big deal about the posts, Harry MacGilvray, president of the Medford Police Patrolmen’s Association, decided to apologize for making the post. \\n“These were Halloween costumes. It was meant totally as a joke. I apologize if this offended anyone in any way,” MacGilvray said in a statement. “I never expected this sort of reaction. It was poor judgment on my part.” \\nThe posts have been removed to avoid hurting the feelings of overly-sensitive liberals. While most of us see the humor in these images and understand how insane it was to apologize for the posts that were clearly done in jest, liberals don’t see things this way. \\nThey go out of their way, looking to be offended. If the police posed with a handcuffed Trump, it’s pretty obvious that there would have been no outrage, because conservatives aren’t easily offended by free speech. However, a liberals sole purpose seems to be finding things to be offended over, and they have done it again.'"}, "time": 1742561739.9104936}