{"duration": 0.040457963943481445, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1.   Donald J. Trump  has yet to hold a news conference, but he released what aides said should suffice for now: an   YouTube video in which he asserted that his transition was going “very smoothly, efficiently and effectively. ” He outlined his top priorities for his first day in office, including beginning the process of withdrawing from the the   Partnership trade deal and revoking President Obama’s environmental regulations on the production of coal and natural gas. Here is the latest on the transition and what he hopes to accomplish in his first 100 days. ____ 2. The right wing’s extremist fringe, the   is exulting in Mr. Trump’s victory. At a conference in Washington, its leading ideologue railed against Jews, quoted Nazi propaganda in German and celebrated Mr. Trump’s election. He saw it as a sign that white people were “awakening to their own identity,” and said that now it’s up to the   to formulate policies “that have a realistic chance of being implemented. ” A spokeswoman for Mr. Trump said the   disapproved of all hate groups. ____ 3. The depth of one of the factors that played into the election is still emerging: the role of fake news. Some of it is produced from people seeking to make money off advertising. But false stories can also build off misinformed social media posts. We look at how one mistaken tweet  —   by a man with just 40 followers  —   exploded through the hyperpartisan blogosphere. ____ 4. Law enforcement officials in North Dakota used firehoses in   weather against protesters fighting the Dakota Access pipeline. The local sheriff’s office defended its actions, accusing encamped Native Americans and environmental activists of conducting an “ongoing riot” and setting fires. ____ 5. The fallout from revelations of Russia’s   doping program is rewriting the record books for the Beijing and London Summer Olympics. The retesting of stored urine samples for specific banned substances has incriminated at least 40 medal winners, the majority from Russia and other Eastern European countries. Medals from the 2014 Sochi Winter Olympics are also likely to be called into question. ____ 6. Jurgen Klinsmann was fired as coach of the U. S. national men’s soccer team, less than a week after a humiliating defeat that damaged the team’s chances of qualifying for the 2018 World Cup. U. S. Soccer did not immediately announce a replacement. ____ 7. Pope Francis extended local priests’ authority to grant forgiveness for the “grave sin” of abortion, making permanent the power he gave them on a temporary basis last year. “There is no sin that God’s mercy cannot reach and wipe away when it finds a repentant heart,” he wrote. ____ 8. The largest and most authoritative study of dementia rates confirmed that its prevalence is dropping. That is remarkably good news, as an estimated four million to five million Americans develop dementia every year, and it’s very expensive to treat. Researchers will now try to solve the finding’s many mysteries, like why people who are overweight or obese have a 30 percent lower risk. Above, a brain scan showing signs of Alzheimer’s. ____ 9. More than five years into Syria’s chaotic civil war, the capital city, Damascus, is relatively undamaged and functioning, bustling with commuters, markets and restaurants. But the war has warped the city. On a recent visit, our correspondent recorded short video clips, where you can sometimes hear airstrikes on   suburbs, and people fear random shells falling. ____ 10. More than 600 people signed up for a yoga class with baby goats on an Oregon farm. “They wander around with their collars and name tags, looking for affection, or a bit of grassy kibble (like many yogis, they are vegetarians) and seem entirely unfazed by the sight of 20 or so people posing in   dog,” our correspondent reported after taking a class. ____ 11. Finally, should you quit social media to benefit your career? That’s the advice of a Georgetown professor who says it’s a distraction and harms our ability to concentrate. ”If you’re serious about making an impact in the world,” he says, “power down your smartphone, close your browser tabs, roll up your sleeves and get to work. ” ____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s Friday’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628528.9345162}