{"duration": 0.22397184371948242, "input_args": {"text": "'A few days ago, Cesar A. Hidalgo published a very important article titled, What I Learned From Visualizing Hillary Clinton’s Emails . \\nSo who is Cesar Hidalgo? \\nCésar A. Hidalgo is associate professor of media arts and sciences at the MIT Media Lab and the author of Why Information Grows: The evolution of order from atoms to economies . He has also lead the creation of data visualization sites that have received more than 100 million views, including datausa.io, dataviva.info, atlas.media.mit.edu, immersion.media.mit.edu, pantheon.media.mit.edu, streetscore.media.mit.edu, and others (see chidalgo.com for more details). \\nAt this point, I’m sure you’re wondering why I’m highlighting this guy’s post two days before the Presidential election. It’s for two reasons. First, the piece offers a very good representation of the sort of peer pressure that can come down upon an academic for being seen as having the “wrong” political opinion. Second, and perhaps most important, his email visualization tool taught him that the current state of our government in these United States simply can’t achieve the best outcomes for the public at current scale (size, geographic/cultural diversity, etc). \\nWith all that out of the way, I’m going to highlight what I found to be the most powerful part of his piece. \\nEnjoy: So what did we learn by making this dataset accessible? We learned a few things about what Clinton’s emails said, about how the media works, and about how people interpreted the project. We made clinton.media.mit.edu publicly available last Friday night (October 28, 2016). We launched with a single story , written by Alejandra Vargas from Univision. My intuition was that the story was likely to get picked up by other news sources. After all, the tool facilitated people’s ability to read and understand the content of these emails, and the connections of the people involved in them. But I was wrong—it has been nearly a week since we released the project and no other major news source has picked up the story, despite having been viewed by more than 300,000 people in less than a week. So how did we get so much traffic without any news coverage? The answer is social media. So far, the tool has been shared widely on Twitter, Facebook, and for a brief but intense time, on Reddit. Its spread has been fueled by different motives, and also, has been battled in different ways. Many reporters shared the news on their personal accounts understanding that the tool represents a different form of data reporting, or data journalism: one where people are provided with a tool that facilitates their ability to explore a relevant dataset, instead of being provided with a story summarizing a reporter’s description of that dataset. Another group of people that shared the news were interface designers, who understand that there is a need to improve the tabular interface of present day email clients, and that the inbox we presented in this project was an attractive new alternative. But many people also shared our site claiming that this was evidence of Clinton’s corruption, and that the site supported Trump. More on that later. But the spread of the site was not without its detractors. A few hours after we released the site I received a message from a friend telling me that what I had done was “a huge mistake” and that I should have waited to post this until “later in the year.” A few days later, outside my lab, a member of a neighboring research group called me a “Trump supporter” and told me that I should have only made that site available if it also included Trump’s emails. I told him that I would be happy to include them, but I had no access to the data. In haste, this colleague began emailing me news articles, none of which provided access to the alleged public dataset of Trump emails. Later, a friend of one of my students posted the news on Reddit, where it went viral. And I mean really viral. It became the top story of the Internetisbeautiful subreddit, and made it to Reddit’s front page. It collected more than 3,000 upvotes and 700 comments. But as the story peaked, a moderator single-handedly removed it in an authoritarian move, and justified this unilateral silencing of the post by adding a rule banning “sites that serve a political agenda or that otherwise induce drama.” Of course, the rule was added AFTER the post was removed. Reddit appears to be rampant with censorship these days. So when it comes to media, social or not, I learned that providing information directly to people so that they can inspect it and evaluate it, is a value that many people consider second to supporting their preferred electoral choice. The twist is that I don’t support Trump. In fact, I don’t support him at all. I think he is potentially a threat to global security, and also, a candidate that has shown repeatedly to be a dividing rather than unifying force. He has failed to respect contracts numerous times, defrauding contractors; and he certainly has shown little respect for people’s development by creating a fraudulent university. So I think he is ill prepared for most jobs, including a difficult one like that of being president. I support Clinton in this election, and even though I don’t get to vote (As a green card holder I just pay taxes), I want her to win next Tuesday. I really do. But I understand that this is my own personal choice, a choice that I want to make sure is informed by my ability to evaluate information about the candidates directly, and by a media that is more transparent than the one we now have. Trust me, if I had Trump’s tax records, I would also think it is a good idea to make a tool that makes them more easily digestible. But my reason to make that tool, once again, would not come from my support for Clinton, or my opposition to Trump. It would come from my support for a society where people have direct access to relevant sources of information through well-designed data visualization tools. Now here’s where we get into very important lessons about the future. So what did I learn about Clinton’s emails? One of the advantages of helping design a data visualization tool is that you get an intimate understanding of the data you are visualizing. After all, you have to explore the data and use the tool to make dozens of design decisions. In this case, the development cycle was particularly fast, but nevertheless I got to learn a few things about the data. Of course, the whole point of making this tool is that you can use it to come up with your own interpretation of the data. That said, you might be curious about mine, so I’ll share it with you too. What I saw on Clinton’s emails was not surprising to me. It involved a relatively small group of people talking about what language to use when communicating with other people. Also, it involved many unresponded-to emails. Many conversations revolved around what words to use or avoid, and what topics to focus on, or how to avoid some topics, when speaking in public or in meetings. This is not surprising to me because I’ve met many politicians in my life, including a few presidents and dozens of ministers and governors, so I know that what work means to many people in this line of work, on a daily basis, is strategizing what to say and being careful about how to say it. I am sure that if we had access to Trump’s emails we would see plenty of the same behavior. So what I got from reading some of Clinton’s email is another piece of evidence confirming my intuition that political systems scale poorly. The most influential actors on them are spending a substantial fraction of their mental capacity thinking about how to communicate, and do not have the bandwidth needed to deal with many incoming messages (the unresponded-to emails). This is not surprising considering the large number of people they interact with (although this dataset is rather small. I send 8k emails a year and receive 30k. In this dataset Clinton is sending only 2K emails a year). Our modern political world is one where a few need to interact with many, so they have no time for deep relationships\\u200a—\\u200athey physically cannot. So what we are left is with a world of first impressions and public opinion, where the choice of words matters enormously, and becomes central to the job. Yet, the chronic lack of time that comes from having a system where few people govern many, and that leads people to strategize every word, is not Clinton’s fault. It is just a bug that affects all modern political systems, which are ancient Greek democracies that were not designed to deal with hundreds of millions of people. On another note, this exercise also helped me reaffirm my belief that the best way to learn about the media is not by reading the news, but by being news. I’ve had the fortune, and misfortune, to have been news many times. This time, I honestly thought that we had a piece of content that some media channels would be interested in and that it would get picked up easily. I have many reporter friends who are enthusiastic about new forms of data journalism, and that actually have been positive and encouraging this week. So I imagined that there was a good chance that a reporter would see the site, go to his or her editor, and say: “Hey, I have an interactive data visualization of all Clinton’s emails. Can I write a story on it?” and the editor would say: “Of course, make it quick.” I don’t know if these conversations actually happened, but given the large volume of traffic our project received I would be surprised if they didn’t. I learned that the outcome was not the one I intuited. And this brings me to my final point, which is that while I support Clinton in this election, and I think Trump is a bad choice for president (a really bad one), I still think that we should work on the creation of tools that improve the ability of people to personalize scrutinize politically relevant information. I now understand that much of the U.S. media may not share that view with me, and that I think this is an important point of reflection. I hope the media takes some time to think about this on November 9 (or the week after). Also, the large number of people who were unable to interpret our tool as anything but an effort to support or oppose a political candidate\\u200a—\\u200aand that was true for both liberals and conservatives\\u200a—\\u200aspeaks to me about an ineffective public sphere. And that’s something I think we should all be concerned about. This polarization is not just a cliché. It is a crippling societal condition that is expressed in the inability of people to see any merit, or any point, in opposing views. That’s a dangerous, and chronic, institutional disease that is expressed also in the inability of people to criticize their own candidates, because they fear being confused with someone their peers will interpret as a supporter of the opposing candidate. If you cannot see any merit in the candidate you oppose, even in one or two of the many points that have been made, you may have it. So that’s how this election has muddled the gears of democracy. When we cannot learn from those we oppose, or agree when they have a valid point, our learning stops. We keep on talking past each other. I know that this election has made learning from those we oppose particularly difficult, but the difficult tests are the ones that truly show us what we are really made of. These are the situations that push us to see past all of the things that we don’t like, or don’t agree on, so we can rescue a lesson. You may not agree with me, but I hope at least I gave you something to think about. While his points about media censorship and peer pressure are self-explanatory, I want to take a quick moment to discuss his most meaningful insight, which is the idea that “ political systems scale poorly.” This is hugely important, because as the current status quo system collapses, many of us in the Western world will be presented with an incredible opportunity to do things completely different. Unfortunately, none of the candidates in the 2016 election (including Sanders and Trump) have been promoting the idea of political decentralization, which is the direction I think we need to move toward. In voting for Brexit, that’s exactly what the British people professed a preference for, and it’s what we need here in America. In some important ways, I think we should look back toward the original concept of government as understood by our founders. A loose-knit collection of largely self-governing states that are bonded together in certain important ways, yet independent and sovereign in all other ways. Indeed, I think we can break things up even further than that, but let’s start there for the time being. If we want to stick with representative democracy, I think for it to work best, it needs to be very local. I think the future of mankind depends on us getting our political systems right, and I think governance has to be shifted to the local level as much as possible. This all reminds me of Aldous Huxley’s extremely prescient warning in his 1958 book Brave New World revised (see my review of it), in which he wrote: \\nOr take the right to vote. In principle, it is a great privilege. In practice, as recent history has repeatedly shown, the right to vote, by itself, is no guarantee of liberty. Therefore, if you wish to avoid dictatorship by referendum, break up modern society’s merely functional collectives into self-governing, voluntarily co-operating groups, capable of functioning outside the bureaucratic systems of Big Business and Big Government. Bottom line: We need to decentralize everything, especially government. In Liberty,'"}, "time": 1742562344.6177883}