{"duration": 0.1475675106048584, "input_args": {"text": "'Search What Will Replace ISIS? This is a war to determine whether the future will belong to the West or to Islam. October 28, 2016 Daniel Greenfield \\nDaniel Greenfield, a Shillman Journalism Fellow at the Freedom Center, is a New York writer focusing on radical Islam. \\nBefore long the same administration that declared the fighting in Iraq over several times will claim victory over ISIS. The timetable for its push against the Islamic State appears to have less do with the victimized Christians and Yazidis who have been prevented from coming here as refugees in favor of Syrian Muslims than with the Clinton presidential campaign. Like Obama’s declarations that the wars in Afghanistan and Iraq were over, the announcement that ISIS has been defeated will be premature. \\nIt is based on a profound misunderstanding and misreading of Islamic terrorism. \\nLong before its current string of defeats, ISIS had begun evolving into another Al Qaeda; a multinational alliance of Jihadists scattered around the world. Bombing Mosul isn’t hard, but try bombing Marseille, Brussels or London. There is no doubt that the ability of ISIS to temporarily establish a caliphate allowed it to build a network that could carry out terror attacks from New York to Miami to Nice to Munich. But it would be dangerous to assume that losing Iraq and Syria will stop ISIS. \\nISIS doesn’t matter. The idea of ISIS does. And the idea of ISIS is Islamic supremacism. \\nThe organization we think of ISIS has transformed and rebranded countless times. Even now our leaders vacillate between calling it ISIS, ISIL or, more childishly, Daesh, while it dubs itself the Islamic State. We have been fighting it in one form or another for over a decade. It would be unrealistically optimistic to assume that the war will end just as this old enemy has shown its ability to strike deep in our own cities. \\nThe bigger error though is to think that we are fighting an organization. We are fighting an idea. That is not to contend, as Obama does, that we can debate it to death. It is not the sort of idea that argues with words, but with bullets, bombs and swords. But neither does it just go away if you seize a city. \\nAl Qaeda in Iraq not only survived the death of Zarqawi, but it became even more dangerous under Baghdadi. It would be risky to assume that ISIS will die with him. Instead it may very well grow into a new phase of Al Qaeda, one that ties together some of the world’s deadliest Islamic terror groups into a network that is decentralized enough that it will not suffer from Al Qaeda’s leadership fatigue. \\nThe rise of Islamic terrorism has been an incremental process in which new groups learn from the mistakes of the old and supersede them. If ISIS does recede into a localized oblivion, reemerging only on occasion to suicide bomb something or someone in Baghdad, then a deadlier and even more effective group is likely to take its place. Each group will move one step closer to realizing the caliphate. \\nTo break the cycle, we must confront the idea of the caliphate at the heart of Islamic terrorism. \\nISIS is not un-Islamic. It is ruthlessly and uncompromisingly Islamic in that, unlike its predecessors in the Muslim Brotherhood and Al Qaeda, it makes the fewest compromises to civilizational sensibilities. Its goals are the same as those of every Islamic political organization, including those dubbed moderate. It seeks to restore and enforce an Islamic system in every part of the Muslim world before moving on to conquer and subjugate the non-Muslim world. If this were merely some fringe belief held by a tiny minority of extremists, then it could be bombed to pieces in some Syrian or Iraqi backwater. \\nBut it’s the driving force of Islam. That’s why it won’t go away. No amount of appeasement will banish it. \\nTaking in more Muslim settlers, pressuring Israel and letting the Muslim Brotherhood colonize our foreign policy won’t do it. We’ve tried it and it actually makes Islamic terrorism much worse. \\nWhen the announcement is made, the usual suspects will pat themselves on the back for having defeated ISIS by mobilizing a Muslim coalition. But it wasn’t Obama who mobilized a Muslim coalition. The coalition, such as it was, mobilized them. Obama provided useful support to Islamic state sponsors of terror, such as Iran and Turkey, assorted Islamic Jihadists on the ground, some blatantly associated with Sunni and Shiite terror groups in their internal Jihadist conflict with ISIS over who will fight us. \\nThe “allies” we are aiding today will be the ones bombing us tomorrow. \\nAnd that is why claiming credit for beating ISIS accomplishes nothing. ISIS is an expression of an Islamic impulse encoded in the Koran. Islamic groups differ in the tactical expression of that impulse. ISIS was nastier and uglier than most of the Islamic terror groups we had dealt with before this. Though even it found its Boko Haram affiliate in Nigeria occasionally a little too much to stomach. \\nIf ISIS vanishes from the world stage, Islamic terrorism will be easier to dismiss. Or so the thinking goes. The Islamic State was better at viral videos than the media that tried to whitewash Islamic terror. It was hard to ignore. But a scattering of Islamic terror groups around the world will be forgotten by the public. \\nHistory suggests that’s wishful thinking. \\nIslamic terrorism has shown no signs of receding. Growing Muslim populations, both at home and in Muslim settlements in the West, and the increase in travel and communications, the infrastructure of globalism, spread it from the most backward to the most advanced parts of the world. Wealthy and unstable Muslim countries, rich in oil but poor in power, finance its spread through mosques and guns. \\nThese are the ingredients that give us ISIS or any other combination or letters that stands for Islamic terror. To do anything meaningful about it, we would have to reverse the decline of the West. \\nIslam originally spread into a vacuum created by civilizational decline. Civilizational decline is why it is rising once again. An obscure local terror group eventually turned into ISIS by filling a power vacuum. Even as Obama performs another touchdown dance, some other group will be making that same journey. Its mission will be the familiar one of replacing our civilization with its own. \\nUntil we come to terms with this civilizational struggle, we will go on fighting endless wars in the sand and coping with endless terror attacks in our own cities because we have failed to recognize the nature of the enemy. We are not fighting an acronym, whether it’s ISIS or ISIL; we are fighting an Islamic State. \\nThis is a war to determine whether the future will belong to the West or to Islam.'"}, "time": 1742564233.7066839}