{"duration": 0.08276915550231934, "input_args": {"text": "' Propaganda Alert\\nEx-NATO Chief: We Need US As World\\'s Policeman By Dominic Waghorn SKY \" - The man who led the West\\'s most powerful alliance through most of the Obama administration has told Sky News that the President has not done enough to prevent conflict.\\nFormer NATO secretary general Anders Fogh Rasmussen says America\\'s next commander-in-chief must do more to lead the world. In an interview, he explained: \"I think President Obama has been too reluctant to use military force or threaten to use military force to prevent conflicts in the world.\\n\"We need America as the world\\'s policeman. We need determined American global leadership.\"\\nHis criticism carries more weight in the closing days of the US election campaign, and reveals the frustration of a man tasked with running the North Atlantic Treaty Organisation during the Obama years.\\nRegardless of who wins the presidency in less than a week\\'s time, Mr Rasmussen said the US has no choice but to return to the path of greater interventionism.\\n\"Superpowers don\\'t get to retire. Look around you will see a world on fire. Syria torn by war and conflict. Iraq on the brink of collapse. Libya a failed state in North Africa. Russia attacking Ukraine and destabilising Eastern Europe. China flexing its muscles, the rogue state North Korea threatening nuclear attacks.\\n\"All that requires a world policeman to restore international law and order.\"\\nMr Rasmussen also expressed deep concerns about what Donald Trump might do to the world should he win the presidency.\\n\"It might be very dangerous, of course,\" he said. \"We don\\'t know what will be the concrete policies of a Trump administration - but if his statements were to be taken at face value, I consider it could be very dangerous for the world.\"\\nThe Danish politician\\'s aspirations for greater US global leadership are not shared by millions of Americans, it seems.\\nThey have supported a candidate who has advocated that the US intervenes less in foreign affairs and withdraws more.\\nOn the campaign trail, Mr Trump has said America cannot carry on being the world\\'s policeman.\\nWhether or not Mr Obama could have done more to prevent conflicts is the focus of intense debate in Washington.\\nSome blame him for the turmoil roiling the Middle East. Others say he has skilfully managed its fallout, and greater US involvement would only have made matters worse.\\nAaron David Miller, who has advised both Republican and Democratic administrations on foreign policy, says even superpowers are limited in what they can achieve - as America\\'s next president will discover.\\nHe said: \"(I think) the notion that Mrs Clinton or Mr Trump will somehow be able to come up with comprehensive fixes for the world\\'s problems or America\\'s is an illusion.\\n\"Our constitution talks about creating a more perfect union. Nowhere in the document does it say it is the objective of the American policy to create a more perfect world.\\n\"That does not mean we need to abandon the world. We can\\'t. But it does mean particularly in the wake of Iraq and Afghanistan we need to take a very hard look at what American interests are, and figure out the most effective and smart way of protecting them.\"'"}, "time": 1742561984.9156232}