{"duration": 0.13887715339660645, "input_args": {"text": "'Dispatches from STEPHEN LENDMAN I t doesn’t matter. The Clintons are untouchable. Despite clear evidence of war crimes, racketeering, perjury, and Hillary’s email scandal, along with suspicion of murder, and who knows what else, they’re heading back to the White House in January. Electoral rigging virtually assures it. FBI director James Comey’s announced revisiting of Hillary’s use of her private email server to maintain and send classified information won’t derail her presidential bid. .. Last July, Comey whitewashed her criminality – serious enough to send ordinary people to prison. At the time, Trump was right, saying she “compromised the safety of the American people by storing highly classified information on a private email server with no security.” .. “Our adversaries almost certainly have a blackmail file on (her), and this fact alone disqualified her from service.” She was caught red-handed lying to the FBI and Congress – claiming she didn’t use her home server to maintain or send classified information. Comey confirmed over 100 emails were classified when sent, including top secret ones – maybe hundreds more we haven’t heard about or not yet discovered. .. Deleting thousands of emails compounded her criminality. Yet her road to the White House remains on track. Still, Comey’s Friday announcement was astonishing, less than two weeks before November’s election, an unprecedented act Trump will try using to his advantage – though likely no more successfully than earlier. .. Comey’s letter was disturbingly vague, suggesting having absolved Hillary’s criminality once, he’ll do it again. Announced “investigative steps” take time – likely concluding next year after November’s election and January’s inauguration. Here’s his letter to FBI employees explaining his action: .. “This morning I sent a letter to Congress in connection with the Secretary Clinton email investigation. Yesterday, the investigative team briefed me on their recommendation with respect to seeking access to emails that have recently been found in an unrelated case.” .. “Because those emails appear to be pertinent to our investigation, I agreed that we should take appropriate steps to obtain and review them.” .. “Of course, we don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed. I also think it would be misleading to the American people were we not to supplement the record.” .. “At the same time, however, given that we don’t know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression.” .. “In trying to strike that balance, in a brief letter and in the middle of an election season, there is significant risk of being misunderstood, but I wanted you to hear directly from me about it.” Judicial Watch (JW) has done important work, trying to have Hillary held accountable for her scandalous email practices – criminality without punishment so far, unlikely to change ahead, especially if she’s anointed in November to succeed Obama, a near-certainty as things now stand. .. In response to Comey’s announcement, JW president Tom Fitton issued the following statement: .. “ The FBI’s seeming decision to reopen the investigation into Hillary Clinton’s mishandling of classified information is astonishing. Once again, we suspect our Freedom of Information Act and other investigations have spurred the FBI to act. This decision highlights the corruption, favoritism, and incompetence in the FBI/Justice Department investigation of Hillary Clinton.” .. Her “email misconduct and lies, aided and abetted by the Obama administration, have created a national crisis. The FBI needs to disclose more information about what it found and when – the American voters deserve answers now.” .. “Judicial Watch helped break open the Clinton email scandal and, no matter what the FBI does, will independently continue its historic litigation and investigation.” U S voters go to the polls in 10 days. Millions already voted in advance. Things were likely rigged way ahead of November 8. Hillary is the establishment choice. Power brokers running America picked her last year to succeed Obama. Trump surprisingly emerged last man standing among a deplorable array of GOP aspirants, resembling a police lineup – or an FBI most wanted list. .. Bill and Hillary Clinton belong in prison, not high office for a third co-presidential term. Given everything publicly known, they remain irreparably tainted, a disturbing indictment of a political process too debauched to fix. Voters have no say over who leads them. Powerful interests decide everything. Democracy in America is pure fantasy, not the real thing. .. The only solution is grassroots revolution. Nothing else can work.   ABOUT THE AUTHOR STEPHEN LENDMAN lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net . His new book as editor and contributor is titled “Flashpoint in Ukraine: US Drive for Hegemony Risks WW III.” ( http://www.claritypress.com/LendmanIII.html ) Visit his blog site at sjlendman.blogspot.com .    '"}, "time": 1742564394.7177484}