{"duration": 0.06322193145751953, "input_args": {"text": "'I BRICS resistono alla guerra finanziaria degli Stati Uniti di Ariel Noyola Rodríguez \\nPer affrontare la guerra finanziaria degli Stati Uniti è urgente che i Paesi BRICS rafforzino la cooperazione nell’economia e nella finanza. La Nuova banca di sviluppo dei Paesi BRICS dovrebbe aumentare il volume dei prestiti, ed anche l’Accordo sul contingente di riserva. Inoltre, i Paesi BRICS dovrebbero avviare al più presto possibile la propria agenzia di rating. Per intensificare la coesione economica e realizzare un’area di libero scambio si dovranno abbattere le barriere tariffarie ed aumentare notevolmente il commercio. In breve, se non vengono prese al più presto le misure del caso, i Paesi BRICS rischiano il naufragio nel prossimo uragano finanziario. Rete Voltaire | Città del Messico (Messico) | 27 ottobre 2016 français русский Español \\nIl 15 e 16 ottobre si teneva nello Stato di Goa (India) l’ottavo vertice dei BRICS, sigla per Brasile, Russia, India, Cina e Sud Africa. Va riconosciuto che l’incontro avveniva in una situazione profondamente critica per l’economia mondiale. Tuttavia, i BRICS hanno mostrato, ancora una volta, la straordinaria capacità di trasformare un brutto momento in un’opportunità per approfondire i legami dal punto di vista strategico. \\nDopo che le economie BRICS hanno goduto di un ‘età dell’oro’, negli ultimi anni i tassi di crescita hanno subito un drastico rallentamento. Di fronte a questa situazione difficile, ora più che mai i BRICS devono attingere alle istituzioni finanziarie presentate al mondo un paio di anni prima a Fortaleza (Brasile) al sesto vertice [ 1 ]. \\nLo scorso aprile, la Nuova Banca di Sviluppo effettuava il primo prestito [ 2 ] per più di 800 milioni di dollari, e dal 2017 si stima che i prestiti possano raggiungere i 2500 milioni [ 3 ]. Inoltre, l’istituto finanziario a luglio emetteva per la prima volta “obbligazioni verdi” in yuan per un importo pari a 450 milioni di dollari [ 4 ]. Questi strumenti finanziari, se aumentano l’influenza globale della moneta cinese, finanziano grandi progetti d’investimento. \\nNel frattempo, l’Accordo sul contingente di riserva (CRA, nell’acronimo in inglese) dal valore di 100 miliardi di dollari, è pronto a concedere le prime linee di credito per stabilizzare la bilancia dei pagamenti dei Paesi BRICS, come annunciato dal Ministro delle Finanze indiano Arun Jaitley [ 5 ]. Ogni volta che la Federal Reserve (FED) degli Stati Uniti minaccia di aumentare il tasso d’interesse dei fondi federali, innescando una nuova crisi finanziaria mondiale, è necessario che i Paesi BRICS aumentino al più presto le risorse monetarie del fondo di stabilizzazione perché, in caso contrario, rischiano gravi danni per via delle speculazioni delle grandi banche d’investimento. \\nAllo stesso tempo, i Paesi BRICS devono aprire nuovi fronti sfidando apertamente l’egemonia degli Stati Uniti e del dollaro nel sistema finanziario globale [ 6 ], non solo attraverso lo scambio in valuta locale ma, per esempio, attraverso l’accumulo di riserve in yuan tra le banche centrali, soprattutto dopo che la ‘moneta del popolo’ (‘renminbi‘ in cinese) è stata ammessa ufficialmente, il 1° ottobre 2015, tra i Diritti Speciali di Prelievo, il paniere delle monete d’élite creato dal Fondo monetario internazionale (FMI) alla fine degli anni 60 [ 7 ]. \\nInoltre, i Paesi BRICS possono articolare un’alleanza finanziaria dai forti legami geopolitici tra America Latina, Asia, Africa e Medio Oriente. Le banche di sviluppo regionali, formate per lo più da Paesi periferici, potrebbero servire allo scopo: la Banca d’investimento infrastrutturale asiatica (AIIB, nell’acronimo in inglese), Banca dell’ALBA (Alleanza Bolivariana per i Popoli della nostra America) e anche la Banca del Sud che finalmente aprirà alla fine dell’anno. \\nÈ un requisito urgente per i BRICS realizzare una propria agenzia di rating che spezzi il dominio delle statunitensi Fitch, Moody’s e Standard & Poor’s [ 8 ]. Tali agenzie di rating piuttosto che effettuare valutazioni con criteri tecnici, agiscono su impulso di natura politica; cioè da autentiche macchine da guerra: degradano le note delle obbligazioni sovrane e di conseguenza aumentano drasticamente gli oneri finanziari di Paesi come Grecia, Russia o Venezuela. \\nLa coesione economica è un’altra sfida importante, anche se è chiaro che si è progredito sostanzialmente molto negli ultimi anni: tra il 2001 e il 2015, il commercio tra i Paesi BRICS, nell’ambito del commercio totale, è raddoppiato dal 6 al 12% [ 9 ]. La Cina è di gran lunga l’economia più integrata nei Paesi BRICS. Al contrario, i legami tra India e Sud Africa sono marginali. Lo stesso tra Brasile e Russia. E’ quindi molto importante la prossima creazione di una zona di libero scambio tra i BRICS [ 10 ]. Tuttavia, oltre ad abbattere le barriere commerciali, i Paesi BRICS devono promuovere la costruzione congiunta dei valori; cioè, integrare i propri sistemi di produzione per incoraggiare l’industrializzazione delle economie meno avvantaggiate. \\nIn conclusione, vi sono molte sfide all’orizzonte per le cinque potenze emergenti. Sono convinto che, perciò, il successo dei BRICS dipenda dalla capacità di reinventarsi e dalla creatività nell’articolare nuove dimensioni della cooperazione, affrontando obiettivi a lungo termine. Di fronte alla nuova guerra finanziaria che preparano gli USA, è tempo per i BRICS di procedere…'"}, "time": 1742628351.9641688}