{"duration": 0.22709918022155762, "input_args": {"text": "'WASHINGTON  —   Rudolph W. Giuliani, a top adviser to   Donald J. Trump, said on Sunday that it would be “unrealistic” to remove Mr. Trump’s children from their roles in running his business empire and place the assets into a strict blind trust like the ones used by previous presidents. “I think he’s in a very unusual situation,” Mr. Giuliani said on CNN’s “State of the Union. ” “He would basically put his children out of work,” he added, “and they’d have to go start a whole new business, and that would set up new problems. ” As president, Mr. Trump will not be required to sell his assets, which he has valued in billions of dollars. But the vast scope of Mr. Trump’s assets and business dealings is likely to lead to questions about how his actions as president would affect the financial fortunes of him and his family. Most modern presidents have elected to use a blind trust, which puts their assets under the control of an independent trustee. Ethics experts said Mr. Giuliani’s remarks were misguided on ethical and political grounds. Kenneth A. Gross, a lawyer who advises corporations and members of Congress on ethics issues, said it was important for Mr. Trump “to separate his vast business interests from his official decision making. ” “If not, it is going to be a constant thorn in his side,” Mr. Gross added. “It might even be unfair criticism he will get, as he might be acting in the public interest and still be accused of promoting his business interests because he has not separated them as much as possible. ” Turning his business operations over to his children would not insulate him from ethical questions, Mr. Gross said, and may even exacerbate them. Richard W. Painter, a White House ethics officer during the George W. Bush administration, said it would be problematic if Mr. Trump used such an arrangement, given that he would ultimately retain ownership of the assets. “It is extremely inappropriate,” said Mr. Painter, who has been a critic of Mr. Trump’s candidacy. “In the past 200 years, we have never had a president with such egregious conflicts of interest with family business holdings. ” Mr. Giuliani, a vice chairman of Mr. Trump’s transition team who is believed to be under consideration for various posts in the Trump administration, including attorney general, said fears of a conflict of interest were groundless. Mr. Trump’s three eldest children, who hold leadership positions in his businesses, said in an interview on “60 Minutes” that was broadcast Sunday that they would not work in the administration in any formal capacity. “We’ll be in New York, and we’ll take care of the business,” Mr. Trump’s son Eric said. “I think we’re going to have lots of fun doing it. And we’re going to make him very proud. ” The three children, including Ivanka and Donald Jr. as well as Ms. Trump’s husband, Jared Kushner, are members of the executive council of Mr. Trump’s transition committee. Once Mr. Trump takes office, Mr. Giuliani said, the president will erect “a wall between them with regard to government matters. ” “You have to have some confidence in the integrity of the president,” Mr. Giuliani said. “The man is an enormously wealthy man. I don’t think there’s any real fear or suspicion that he’s seeking to enrich himself by being president. If he wanted to enrich himself, he wouldn’t have run for president. ” The financial arrangement was one of a number of questions surrounding Mr. Trump’s transition efforts, as his team moved toward announcing staff positions, tried to clarify the  ’s agenda and sought to reassure those still questioning his fitness for office. Kellyanne Conway, Mr. Trump’s campaign manager, batted down questions on several television news programs about who would fill critical positions in the coming administration, and she argued that Mr. Trump’s victory had already demonstrated that he could bring together Democrats and Republicans. Ms. Conway went further on “Fox News Sunday,” saying that it was incumbent upon Democrats, including Hillary Clinton, President Obama and Senator Bernie Sanders of Vermont, to calm the passions of their supporters who are objecting to Mr. Trump. She said that many of them were “masquerading as protesters,” and that Democratic leaders should ask those critical of Mr. Trump “to give this man a chance so that this country can flourish. ” She said on NBC’s “Meet the Press” that she disagreed with Mrs. Clinton’s remarks to donors on Saturday in which the candidate blamed the F. B. I. director, James B. Comey, for her election defeat. The Clinton campaign “misread America,” Ms. Conway said, and should take ownership of its loss. “I just can’t believe it’s always somebody else’s fault,” she said. “Sometimes you just have to take a look in the mirror and reflect on what went wrong. ” The House speaker, Paul D. Ryan, seeking to outline a prospective Republican legislative agenda for Mr. Trump’s first days in office, said on Sunday that Mr. Trump’s border security efforts included no plans to create a deportation force  —   a specter raised during the campaign. “That’s not what we’re focused on,” Mr. Ryan said on “State of the Union. ” “We’re focused on securing the border. We think that’s first and foremost before we get into any other immigration issue. ”'"}, "time": 1742563762.8333898}