{"duration": 0.09363961219787598, "input_args": {"text": "'President Donald Trump’s new bipartisan commission on voting security can use federal data to help resolve the bitter partisan dispute about the reality of   fraudulent voting, Commission   Kris Kobach told Breitbart News. [“The issue of voting fraud often gets politicized, and people are making statements with few foundations [of fact, so] this commission will provide a firm foundation [of] information and facts that are verifiable about the issues surrounding voter fraud,” said Kobach, who is the Kansas Secretary of State and is a   opponent of voters fraud and illegal immigration.   “The states are in the drivers’ seat, but this commission can offer recommendations and evidence” for state legislators to debate, he added, adding that many state elections are decided by fewer than 50 votes.  Koch is   of the panel, which is run by Vice President Mike Pence. The panel is expected to include Democrats, but progressive pressure groups are calling for a Democratic boycott.  The commission is vital because it can use federal data about peoples’ citizenship to help states check the eligibility of people on their voting rolls, Kobach said. “The federal government has a database of all known   residing in or visiting the United States   …     never before has that database been used to run [checks] against the databases of voter rolls in each state,” he said.  Some states have asked for federal data to check their   but “we’ve always been turned down” by the federal government, said Kobach. Election watchers in several states, including Texas and Virginia, have concerns about ineligible voters on their rolls, he said.  In part, vote fraud is important because “close races happen all the time,” he said, adding that Kansas has had more than 20 elections for federal or state seats over the last 20 years which were decided by fewer than 50 votes. “That’s true all across the country,” he said, adding that the panel won’t be looking back at prior elections.  Voter fraud is a moral issue, said Kobach. “There’s a broader principle  —   every time  there is a fraudulent vote, it effectively cancels out a legitimately cast vote by the U. S. citizen. ” But the new bipartisan commission is already being scorched by the Democrats’   coalition, including the ACLU, which is pressuring Democrats to boycott the bipartisan panel.  “As President Trump’s own lawyers have said, ‘All available evidence suggests that the 2016 general election was not tainted by fraud or mistake,’” said a statement from Dale Ho, director of the ACLU’s voting rights office. He continued: This commission, to be   by King of Voter Suppression Kris Kobach, is a sham. We call on professional elections administrators, serious academics, and elected officials to refuse to participate in what will be a pretext for disenfranchising Americans. Ho also urged voting rules be loosened to encourage higher election turnout, saying “the United States has one of the lowest turnout rates in the developed world, and we should be doing everything we can to encourage more people, not fewer, to participate in our democracy. ” Kobach’s   measures in Kansas have prompted angry criticism and lawsuits from progressive groups. For example, the ACLU is suing Kobach’s office to detail his   measures, including a requirement that people prove their citizenship when registering to vote, and show identification when voting. Those   measures have improperly pushed 30, 000 people off the voting rolls, and have halted registration by an additional 35, 000 people, claims the ACLU. Chris Carson, the national president of the League of Women Voters, told the Kansas City Star that the commission is “part of a wider effort to suppress the vote, keep certain politicians in power, and undermine our elections by spreading falsehoods. ” The Democrats’ hostility to Kobach is offset by praise from other lawyers. “I’ve had the pleasure to debate him on voting issues and have found that he is a knowledgeable and engaging advocate,” said Mark Johnson, a Kanas City attorney who is leading a lawsuit to overturn Kobach’s   rules. “Kobach is an honorable public servant and as such, I hope he will put aside any personal beliefs and participate in the investigation with an open mind. ” The commission’s “job is to look at the problem, collect data, and see where the facts are and make some recommendations,” said Kobach. Only legislators in the states have the power to change or preserve their voting systems, he said, because “elections are under the control of the states [according to] the constitution. ” '"}, "time": 1742563120.154659}