{"duration": 0.011471271514892578, "input_args": {"text": "'On the unofficial first day of summer, while most Americans are planning their barbecues and trips to the beach, the Democrats have only one thing in mind  —   ramping up their efforts to stop President Trump from enacting his agenda. [Less than a year after Democrats were still complaining about “Republican obstructionism,” the Democratic National Committee is now hyping events for what it is calling “Resistance Summer,” featuring “house parties” with DNC Deputy Chairman Keith Ellison.  “This summer, we’re investing in all 50 states and connecting with every single voter in real life on the issues that matter to them  —   from health care to education to jobs and economic opportunity,” an email to supporters says. It is the first major event by the Democrats since the election of Tom Perez to the role of DNC Chair. Perez called the summer “the starting point” for the Democrats plan to obstruct Trump’s agenda. The “Resistance Summer” will start on Saturday with “house parties” across the country. The event will feature a “kickoff livestream with Keith Ellison and some surprise guests!” according to the email. Keith Ellison was Perez’s main   rival for the nomination to DNC Chair, and was dogged by his ties to the Nation of Islam. “The best way for Democrats to turn the #Resistance into electoral wins is by doing one thing: organizing,” Ellison said in a press release earlier this month. “Resistance Summer is the starting point and will take the Democratic Party’s message of fairness and equality to activists on the front lines and all Americans looking to get engaged. ” The DNC won’t just be hosting   house parties, but will also be pumping money, in the form of grants, into state party programs.   activist group MoveOn. org is planning a similar path with their own “Summer of Resistance. ” A website for the event offers budding Bolsheviks the chance to become a “Resistance Summer MoveOn Mobilizer” and to “win tangible victories this summer against Trumpism and for a hopeful future. ” “Mobilizers” will be matched with 25 others, as well as “an expert Resistance Facilitator” and receive $150 a month for cell phone minutes, transportation, and snacks. The DNC will be hoping that the “Resistance Summer” will go smoother for them than the   “unity tour” featuring Perez and former presidential hopeful Sen. Bernie Sanders ( ). That tour was plagued by division, booing, and a host of its own awkward moments. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628536.6669965}