{"duration": 0.04763913154602051, "input_args": {"text": "\"Palestine Palestinians inspect the damaged house of Zaid Amer, after it was demolished by the Israeli army, in the West Bank city of Nablus, May 3, 2016. (Photo by AP) \\nIsraeli troops have razed to the ground at least three houses in the East Jerusalem al-Quds, in the latest demolition of Palestinian property in the occupied territories. \\nLocal media reported that Israeli forces demolished the buildings in the neighborhoods of Beit Hanina and Silwan on Wednesday without prior notice, displacing at least 44 Palestinians including children. \\nThe United Nations has documented a dramatic rise in demolitions, saying 124 Palestinians, including 60 children, were left homeless in the occupied West Bank in a single day in April. \\nThe UN Office for the Coordination of Humanitarian Affairs (OCHA) also said in August that a total of 726 Palestinian structures had been razed in the occupied West Bank and East Jerusalem al-Quds since January, and that the demolitions had affected 1,020 Palestinians. \\nThe world body noted that there were 533 demolitions and 688 displaced Palestinians in the entire 2015, meaning that demolitions so far this year have increased more than 36 percent. This picture taken on March 14, 2011 shows a general view of a construction site in the West Bank settlement of Modiin Illit. (Photo by AP) \\nThe demolitions have raised alarm among diplomats and human rights groups over Tel Aviv's sustained violation of international law. The demolished structures include houses and schools. \\nThe Israeli razing of Palestinian homes along with its illegal settlement expansion in the occupied Palestinian territories have dimmed hopes of any peace in the region. \\nOver half a million Israelis live in more than 230 illegal settlements built since the 1967 Israeli occupation of the West Bank, including East al-Quds. The settlements are considered by the international community as illegal. \\nThe occupied territories have witnessed increased tensions ever since Israeli forces imposed restrictions on the entry of Palestinian worshipers into the al-Aqsa Mosque compound in East Jerusalem al-Quds in August 2015. \\nNearly 250 Palestinians have lost their lives at the hands of Israeli forces since the beginning of last October. Loading ...\""}, "time": 1742562744.030731}