{"duration": 0.13705086708068848, "input_args": {"text": "'In a move that is likely to roil the art world, and that attests to the increasingly collaborative relationship between private dealers and auction houses, Brett Gorvy  —   long considered the master broker of contemporary art at Christie’s  —   is leaving after 23 years to join forces with Dominique Lévy, the founder of a powerful Madison Avenue gallery. It will now be known as Lévy Gorvy. “It’s quite a coup,” the San   art adviser Mary Zlot said. The pair, she said, “will add that much more firepower” to the marketplace. Mr. Gorvy, the Christie’s chairman and international head of postwar and contemporary art, is widely credited with fortifying the auction house’s reputation for securing A+ quality work and for aggressive deal making, which allowed it to become the market leader in postwar and contemporary sales. Since Mr. Gorvy’s appointment to that position more than a decade ago, Christie’s has achieved the three highest prices at auction: $179. 4 million for Picasso’s “Les Femmes d’Alger (Version ‘O’)” in 2015 $170. 4 million for Amedeo Modigliani’s “Nu Couché” (Reclining Nude) that same year and $142. 4 million for Francis Bacon’s triptych, “Three Studies of Lucian Freud,” in 2013. His move signals the growing alliance between auction houses and dealers where they used to distrust each other as competitors, these days they work together to secure the highest prices for sellers and the   pieces for buyers. Dealers use auction houses for their international reach, and auction houses use dealers to connect with clients who wish to sell at public auction or through private auction sales. Auction houses also work with dealers to establish   guarantees, the minimum bids at which lots are promised to sell. Mr. Gorvy is the latest executive to move between auctions and private sales. In 2014, Amy Cappellazzo, after 13 years with Christie’s, left to start an art advisory business, which was acquired by Sotheby’s in January. According to Sotheby’s, private sales have almost doubled over the last year. In 2013, a prominent Sotheby’s auctioneer, Tobias Meyer, also left, to become a private art adviser. About 16 percent of Christie’s business is now in private sales, it said, and Mr. Gorvy has been active in expanding that division at the auction house, which is privately owned by the French luxury goods magnate   Pinault. As a specialist, Mr. Gorvy said: “You go talk to a client and you say, ‘I’m going to deliver, because I know this painting, I know who’s going to buy this painting.’ I was able to persuade people to sell pictures at times when people were not necessarily even thinking of selling the pictures because of my total belief in my ability and my team’s ability to do that. ” In a joint interview at Ms. Lévy’s home, Mr. Gorvy said he decided to leave Christie’s a year ago because he wanted to start a new chapter. “At the age of 52, you have one more opportunity,” he said. “Even though I hate change, there’s a certain moment when you know in your heart that the time is right. ” “You look at the Roger Federers” of the world, he added, referring to the tennis champion. “At what point do you basically take it to another level?” Jussi Pylkkanen, the global president of Christie’s, said he was sorry to see Mr. Gorvy leave. “It’s a loss for us,” he said. “He’s deeply respected both by collectors and the people who have worked with him. ” At the same time, Mr. Pylkkanen added, Mr. Gorvy has created a strong bench that includes specialists like Loic Gouzer, Laura Paulson, Francis Outred, Sara Friedlander and Alex Rotter (who left Sotheby’s in March and will become chairman of postwar and contemporary art at Christie’s Americas). Having explored several options, including going out on his own, Mr. Gorvy said he was ultimately compelled by Ms. Lévy’s “boutique mentality of what a dealer is,” in the tradition of Leo Castelli, Pierre Matisse and Anthony d’Offay  —   “  galleries who understood new markets. ” In addition, he said, Ms. Lévy  —   who also serves as an art adviser and has galleries in London and Geneva  —   represents some of his favorite artists, including the Italian artist Carol Rama, whose estate recently joined the gallery. He admires Ms. Lévy’s emphasis on female artists and her exhibition program, including her drawings show this year her Calder miniatures show last year and her first show in 2013 about the resonance among Lucio Fontana, Yves Klein and Cy Twombly. “Museums are not doing these things,” Mr. Gorvy said. “They’re looking to the galleries. They can’t afford to do it. ” (He also respected Ms. Lévy’s discretion. “I could never get out of Dominique what the Sotheby’s offers were or the Phillips offers,” he said, referring to the bids made by rival auction houses for artists’ works. “She basically held the line. ”) Ms. Lévy, who is 48, said she had long wanted to team with Mr. Gorvy, whom she knew from her time at Christie’s nearly 20 years ago. “I admire his knowledge,” Ms. Lévy said. “We’re both collectors. We both love the art. ” Ms. Lévy has been on her own since parting with Robert Mnuchin in 2012, opening her gallery in 2013 in a landmark 1930s former bank building on Madison Avenue and 73rd Street. In June, she said she was taking over the entire space. That expansion, to be completed in January, helped to seal Mr. Gorvy’s decision. “Here is someone I feel an incredible kinship with,” he said, “who also has the perfect space. ” Mr. Gorvy is leaving at a time when Christie’s is trying to dominate market share even as it also tries to build profits. Because Christie’s is not a public company, no one knows how much of its margins it gives away through guarantees. Mr. Gorvy gained a reputation for winning prime consignments with little regard for profits, a portrayal he said was inaccurate. “Everyone thinks I’m about market share,” he said. “In fact, I’m much more interested in, did I have the best paintings?” As it happens, Mr. Gorvy said, he grew unhappy at Christie’s three years ago precisely because of the intense competitive pressure. “It was a crazy world, the market was ugly, it was all deal, deal, deal,” he said. “Huge risk was taken on board to maximize the market. You were pushing things to the highest level, and it was incredibly stressful. It was a very tough period from the personal side when you love art and you love exhibitions and the main driver is your passion and your pursuit of excellence. ” More recently, Christie’s has had to rein in spending to adapt to a softening market. Some in the art world have assumed that Mr. Gorvy felt constrained by the   of his bosses, but he said he agreed with this approach. “The last thing that I want is to have a company, which is not actually a business,” he said. “We are a business. We are not art historians. We are not curators. ” Mr. Gorvy said he’s confident that Christie’s will be fine without him. “We’re a team,” he said. “I walked into a vacuum. I’m not leaving a vacuum. ”'"}, "time": 1742561976.9740856}