{"duration": 0.04516458511352539, "input_args": {"text": "'  Sean Adl-Tabatabai in News , US // 0 Comments \\nHillary Clinton has kicked longtime aide Huma Abedin from her campaign plane in Florida, fuelling rumors that Abedin is about to give the FBI information that could lead to an indictment for Hillary. #Hillarysemail Huma Abedin is not on the plane with #HillaryClinton today. She must be freaking out especially since she signed this doc. pic.twitter.com/KOwI5rN1pW \\n— Trump Street Team FL (@ChatRevolve) October 29, 2016 RELATED CONTENT Treason: Clinton Sold State Secrets To Middle East Via Huma Abedin \\nThe news comes on the same day that the FBI obtained a warrant to search emails on Anthony Weiner’s laptop. \\nLaw enforcement sources say that the emails were sent and received through Huma Abedin’s laptop – the same device used to send thousands of emails to Clinton. \\nSpeaking at a campaign rally in Golden, Colo. yesterday, Donald Trump questioned whether Hillary would fire Huma, given the news that she was so heavily implicated in the email scandal. \\n“ Huma’s been a problem … I wonder if Huma is going to stay there and I hope they haven’t given Huma immunity because she knows the real story — she knows what’s going on, ” Trump said. \\n“ How can you have all of this incredible confidential, secret information and have your top person married to this guy? ” Trump asked. “ Everyone said one thing has nothing to do with another — well, it turns out it does .” \\nNbcnews.com reports: \\nAgents will now compare the latest batch of messages with those that have already been investigated to determine whether any classified information was sent from Clinton’s server. \\nClinton called the move an “unprecedented” departure from FBI policy, and on Sunday, Senate Democratic leader Harry Reid scolded Comey for potentially breaking the law. \\n“Your actions in recent months have demonstrated a disturbing double standard for the treatment of sensitive information, with what appears to be clear intent to aid one political party over another,” the letter says. “I am writing to inform you that my office has determined that these actions may violate the Hatch Act.” \\nThe act bars government officials from using their authority to influence elections. \\n— Jeff Pegues (@jeffpeguescbs) October 30, 2016 Image surfaces of Huma Abedin crying on plane as Clinton Campaign finds out the FBI has re-opened the email investigation. #HillarysEmails pic.twitter.com/2yIUgiYOsV'"}, "time": 1742563954.7868123}