{"duration": 0.057358741760253906, "input_args": {"text": "'Posted on October 30, 2016 by Edmondo Burr in Middle East , News // 0 Comments Iranian expert Emad Abshenass says Israel has found a way to bypass international rules and continue to excavate under the Islamic holy site of al-Aqsa Mosque in the Old City of Jerusalem. \\nIsrael continues to ignore international rules and digs beneath al-Aqsa compound in Jerusalem, which could lead to the collapse of the al-Aqsa Mosque, one of the holiest sites in Islam outside of Mecca and Medina in Saudi Arabia, and an apocalyptic conflict with Islam. RELATED CONTENT Hamas Warns It Won’t ‘Sit Idly By’ As Israel Continues Striking Gaza \\nThe excavations are carried out by Israel in the name of science and archaeology to find evidence of Jewish history around the Temple Mount area, but could undermine the foundations of the old Mosque and pave the way for its collapse, which would then draw an anticipated Muslim backlash. \\nAlthough UNESCO recently announced that the al-Aqsa Mosque compound is a Muslim holy site, Israeli Prime Minister Benjamin Netanyahu is “ not paying attention to international rules. “ \\nSputnik reports: \\n“Apparently, Israel couldn’t accept such (UNESCO) position, and plans to continue excavations under the al-Aqsa Mosque. This is contrary to all possible rules, regulations, agreements and international obligations because after the monument was registered as a cultural heritage, any involuntary action that can destroy it is a crime against human rights,” Abshenass wrote for Sputnik Persian . \\nUNESCO’s Executive Committee on Thursday voted for the resolution, which acknowledged Jerusalem to be a holy city for Muslims, Christians and Jewish people, but named the Temple Mount, where the Al-Asqa mosque is located, a Muslim holy site. Following the resolution, Israel decided to halt cooperation with the UN agency. \\n“The Israeli Prime Minister Benjamin Netanyahu seems to have found a way to bypass the decision of UNESCO, according to which this mosque was declared a cultural heritage site of Muslims. He will carry out excavations at the mosque, and later, when the mosque collapses, he will declare it an accident, the consequences of which will be irreversible,” the expert wrote. \\nAccording to Abshenass, if the Israelis continue their policy towards Muslims and don’t change their attitude, “then the level of terrorist activity in the world could increase.” \\nThe expert noted that one of the causes of the Palestinian intifada were “attacks” on Al-Aqsa Mosque. Thus Israel’s actions may again cause “attempts of retaliation” on the side of Muslims, he argued. \\nThe resolution, which was put forward by Palestine along with Lebanon, Egypt, Algeria, Morocco, Oman, Qatar and Sudan, was approved by 24 members of the 58-member organization, including Russia. Twenty-six countries abstained from voting, while only six countries voted against it.'"}, "time": 1742563402.4356554}