{"duration": 0.04286456108093262, "input_args": {"text": "'The awards season leaders whom everyone already knew were awards season leaders became ever more apparent on Thursday when the Directors Guild of America revealed the nominees for its top prize. They are: Damien Chazelle (“La La Land”) Garth Davis (“Lion”) Barry Jenkins (“Moonlight”) Kenneth Lonergan (“Manchester by the Sea”) and Denis Villeneuve (“Arrival”). The real news came further down in the announcement: Nate Parker received a nomination for outstanding achievement for a   director. This signals a redemption of sorts for Mr. Parker, whose awards hopes for his debut film, “The Birth of a Nation,” were torpedoed when controversy emerged around rape charges he faced and was acquitted of nearly 16 years ago. In the   category, nominations also went to Mr. Davis (a second one for his work on “Lion”) Kelly Fremon Craig (“Edge of Seventeen”) Dan Trachtenberg (“10 Cloverfield Lane”) and Tim Miller, whose satirical superhero film “Deadpool” has been a surprise presence in this year’s awards race. In the main feature film category, the notable omissions were Mel Gibson, for “Hacksaw Ridge,” and Martin Scorsese, whose   passion project, “Silence,” received neither a Directors Guild nomination nor one from the Producers Guild, which found room for “Deadpool” in its nominations list this week. Taken with the film’s shutout from the Screen Actors Guild Award nominations, Mr. Scorsese and “Silence” are all but guaranteed to be ignored in the best picture and best director Oscar races this year. (Academy Award nominations are announced Jan. 24.) Guild awards are given far more weight in the Oscars race than awards from critics or journalists because they represent industry sentiment, and because a huge number of guild members also belong to the Academy of Motion Picture Arts and Sciences. The DGA Award nominations capped a busy week that began with the Golden Globes and included nomination announcements from the producers and the British Academy of Film and Television Arts, which also shares members with the American academy (and is now dealing with a #BAFTASoWhite controversy for picking an   slate of lead acting and directing nominees). Taken with Golden Globes wins, the guild nominations make clear the calcification of this year’s race around the leading contenders, with “La La Land” more out front than ever.'"}, "time": 1742561780.6708996}