{"duration": 0.07495880126953125, "input_args": {"text": "'Email \\nGeert Wilders, the Dutch politician best known for his criticism of Islam, won’t attend his own trial that begins Monday. He asserted, Monday, the trial against freedom of speech begins … against a politician who says what the politically correct elite does not want to hear. This trial is a political trial, in which I refuse to cooperate. \\nThe trial concerns two public utterances that he made back in 2014, including one where he spoke to political supporters at The Hague. He asked them if they wanted fewer Moroccans in the country, and they responded “Fewer! Fewer! Fewer!” Wilders responded, “Well, we’ll take care of it, then.” \\nSome 6,400 complaints were filed with local police, mostly from Moroccans living in the country. The court sorted through them and found 35 that were valid to bring charges of discrimination against Wilders. \\nWilders was also charged in 2011 with criminally insulting Islam and inciting hatred as a result. Those charges stemmed from articles that he had penned and statements that he made calling for a ban on the Koran, warning against an “Islamic invasion” of his country and the coming “tsunami of Islamization.” He described Islam as fascist, Moroccan youths as instigators of violence, and compared the Koran to Hitler’s Mein Kampf . \\nHe authored the script for a 2004 film entitled Fitna , a 17-minute-long argument that Islam encourages acts of terrorism, anti-semitism, violence against women, subjugation of infidels, and sanctions against homosexuals. Wilders explained his intentions, saying that the film (which is free on the Internet) was “a call to shake off the creeping tyranny of Islamisation.” \\nWhen he was acquitted of all charges in that trial, Wilders called it victory not only for himself but for freedom of speech. \\nThe present trial is a variation on the same theme: Wilders is being charged with discrimination against a group, not a religion, which in the Netherlands is considered a hate crime. Frans Zonneveld, a spokesman for the prosecution, explained the difference: Islam is an idea, a religion, [and] according to the public prosecution service, you have a lot of room to criticize ideas. But when it comes to population groups [Moroccans make up about two percent of the 17 million citizens in the Netherlands], it’s a whole different matter. His remarks touched the very being of this population group. You cannot choose to be a part of a population group or not; it’s a group that’s decided by birth, so it’s a whole different matter. \\nWilders responded: “It is a travesty that I have to stand trial because I spoke about fewer Moroccans [in the Netherlands]. It is my right and duty as a politician to speak about the problems in our country.” \\nIn the Netherlands, Wilders does not have the guarantees provided Americans under the Bill of Rights to the Constitution, specifically those spelled out by the First Amendment: “Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.” Instead he is faced with a greater likelihood this time around of going to jail, or at least paying a fine or doing some community service, for his “crime.” However, his Freedom Party will face the Netherlands’ ruling party in elections in March. At present the race is too close to call. A conviction of Wilders in this case could work to his party’s advantage, as an increasing number of Dutch citizens are becoming aware of his warnings and potential threats to their culture. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. .  '"}, "time": 1742561915.8472972}