{"duration": 0.18557357788085938, "input_args": {"text": "'WASHINGTON  —   When President Trump chose the Oklahoma attorney general, Scott Pruitt, to lead the Environmental Protection Agency, his mission was clear: Carry out Mr. Trump’s campaign vows to radically reduce the size and scope of the agency and take apart President Barack Obama’s ambitious climate change policies. In his first weeks on the job, Mr. Pruitt drew glowing praise from foes of Mr. Obama’s agenda against global warming, as he moved to roll back its centerpiece, known as the Clean Power Plan, and expressed agreement with those who said the E. P. A. should be eliminated. His actions and statements have galvanized protests from environmentalists and others on the left. But now a growing chorus of critics on the other end of the political spectrum say Mr. Pruitt has not gone far enough. In particular, they are angry that he has refused to challenge a landmark agency determination known as the endangerment finding, which provides the legal basis for Mr. Obama’s Clean Power Plan and other global warming policies. These critics say that Mr. Pruitt is hacking only at the branches of current climate policy. They want him to pull it out by the roots. “The endangerment finding must be redone, or all of this is for naught,” said Steven J. Milloy, who runs a website, JunkScience. com, aimed at debunking the established science of   climate change, and who worked on the Trump administration’s E. P. A. transition team. “If you get rid of the endangerment finding, the rest of the climate regulations just sweep themselves away. But if they don’t get rid of it, the environmentalists can sue, and then there’s going to have to be a Trump Clean Power Plan,” said Mr. Milloy, who is also a former policy director for Murray Energy, a major coal company whose chief executive, Robert E. Murray, was a backer of Mr. Trump’s campaign and his push to undo climate change policy. The 2009 legal finding is at the heart of a debate within the Trump administration over how to permanently reverse Mr. Obama’s climate change rules. The finding concludes that carbon dioxide emissions endanger public health and welfare by warming the planet, which led to a legal requirement that the E. P. A. regulate smokestacks and tailpipes that spew   pollution. Thus, climate policy experts on both sides of the debate say, even if Mr. Pruitt succeeds in the legally challenging process of withdrawing the Clean Power Plan, the endangerment finding will still put him under the legal obligation to put together a replacement regulation. Mr. Pruitt has told the White House and Congress that he will not try to reverse the finding, saying that such a move would almost certainly be overturned by the courts. Last month, as Mr. Trump prepared to release an executive order directing Mr. Pruitt to dismantle the Clean Power Plan, along with nearly every other major element of Mr. Obama’s climate change legacy, Mr. Pruitt argued against including a repeal of the endangerment finding in the order, according to people familiar with the matter. Legal experts outside the Trump White House say that while Mr. Pruitt may face political fire on his right flank for the move, it is nonetheless pragmatic legally, since the finding has already been challenged and upheld by federal courts. But Mr. Pruitt is now being pilloried by conservative allies of the White House. Writing in Breitbart News  —   the conservative website formerly run by Mr. Trump’s senior strategist, Stephen K. Bannon  —   James Delingpole, a writer who is close to Mr. Bannon, said that if Mr. Pruitt refused to undo the endangerment finding, “it will represent a major setback for President Trump’s war with the Climate Industrial Complex. ” “If Scott Pruitt is not up to that task, then maybe it’s about time he did the decent thing and handed over the reins to someone who is,” he added. Legal experts say they can see why opponents of climate change policy want to go after the endangerment finding  —   as long as it remains in place, any efforts to undo climate regulations can always be reversed. “As a matter of theory, they’re absolutely right,” said Richard J. Lazarus, a professor of environmental law at Harvard. “If you want to get rid of the climate stuff, you get rid of the root, not just the branches. They want him to uproot the whole thing. ” But, Mr. Lazarus added, “as a matter of legal strategy, it makes little sense, because the endangerment finding is very strong. ” The original recommendation to make an endangerment finding on carbon dioxide emissions was made by Stephen L. Johnson, a career scientist who led the E. P. A. under President George W. Bush, although the Bush White House did not act on Mr. Johnson’s memo. After the Obama administration did so, the finding was legally challenged but upheld in a federal court. The Supreme Court declined to hear an appeal. Mr. Lazarus said that Mr. Pruitt would have his hands full with the legal challenges of undoing the regulations themselves. Taking on the endangerment finding would probably be futile, he said. “He doesn’t want to spend a lot of time with something that’s a sure loser,” he said. “It wrecks your credibility with the courts. ” Mr. Pruitt has a long history of championing legal efforts to undermine major environmental rules. As Oklahoma’s attorney general, he sued the E. P. A. 14 times in efforts to undo regulations. He believes in stripping power away from the federal government and returning it to states. But during his Senate confirmation hearing, he told senators that despite that, he was likely to draw the line at trying to overturn the endangerment finding. “It is there, and it needs to be enforced and respected,” Mr. Pruitt said. “There is nothing that I know that would cause it to be reviewed. ”'"}, "time": 1742562693.6161168}