{"duration": 1.4175379276275635, "input_args": {"text": "'Part 1 : The Six Stages of the Exorcism Process By LOBRO VAN HELSING PART 1 of this article is authored entirely by Lobro van Helsing and consists largely of graphic details about the exorcism process as described by Malachi Martin in his controversial book, Hostage to the Devil . PART 2 of the article, entitled ‘The Deceiver of the World’, is by Lasha Darkmoon and continues where Part 1 leaves off. This reflects on various apocalyptic issues, such as Armageddon and the Last Days, the problem of good and evil, and the role of the Jews in human history. \\n“The Devil’s finest trick is to persuade you that he does not exist.” — Charles Baudelaire \\nWhy is it so hard to accept, at least hypothetically, that in the words of observant thinkers like Baudelaire, the Devil’s finest trick is to convince us that he does not exist? \\nIt is generally accepted that the Devil preys on human souls. And what do predators do in all the settings, natural, political, online? They all use disguise and it shouldn’t be beyond comprehension that the Devil, if he existed, would use whichever cloak of invisibility was the most effective for the occasion. Therefore, not seeing the Devil or sensing his presence, proves absolutely nothing. \\nFor those who are interested, the material here comes from a book, Hostage To The Devil , by Father Malachi Martin, a trained exorcist in the Roman Catholic tradition. \\nFr Malachi’s material, featuring several cases of authentic demonic possession and their accompanying exorcisms in modern day America, was carefully vetted through use of tape recorders and reinforced later on by lengthy interviews with the participants in the exorcism process. — § — \\nIn 1906 in South Africa , Clara Germana Cele, age 16, reportedly made a pact with the Devil. As a result, her behavior suddenly took a bizarre turn for the worse. In August of that year, the startled nuns at the convent school where Clara was a student witnessed her tearing at her clothes, growling like an animal, and engaging in conversation with unseen entities. \\nNuns reported that the girl’s skin would burn when sprinkled with holy water. She would lash out violently when crosses or other sacred objects entered her presence.She also reportedly developed clairvoyant powers and was able to describe personal details of other people’s lives that she couldn’t possibly have known ab out. \\nThe accounts of several nuns also reported that Clara possessed the ability to speak and understand several different foreign languages to which she had never been exposed, including Polish, German, French, and several others. It was said that Clara had been imbued with superhuman strength as well, easily overpowering authority figures at the school when they attempted to restrain her. \\nAnother seemingly far-fetched assertion from many witnesses was that Clara began levitating up to five feet in the air on a regular basis, her clothes sticking to her body as if they too had managed to defy the laws of gravity. It was claimed that only after being sprinkled with holy water could she be brought back down, during which time she would also temporarily snap out of her possessed state. \\nMost outlandish of all were the claims that the young woman had the ability to transform into a sort of snakelike creature, her body becoming as flexible as rubber as she slithered across the floor. At one point she was said to have bitten a nun on the arm and left puncture marks like those of a serpent’s fangs. \\n(See here ) \\nNote. This case history is not to be found in Malachi Martin’s Hostage to the Devil. I have added it to the article as an afterthought, since it contains within it many of the typical features found in demonic possession. Before you read any further, please watch this 2-minute video in Spanish with English subtitles. WARNING. This article contains material that is deeply disturbing. Those of sensitive disposition are advised to refrain from further reading. \\nApart from the quoted extracts, randomly chosen among many to illustrate various aspect of possession or exorcism, I wish to make the following points: Although the book deals only with cases in the Catholic community, demonic possession is a universal phenomenon and has been noted and researched in countries all over the world. The Possessor (often referring to itself as “the Kingdom” or in plural as “We”) selects victims gripped in some spiritual, emotional and intellectual conflict with the accepted mores of family, society and church, inserting itself undetected into these fault lines and exploiting them with catastrophic consequences. Loss of self identity, soul, or personality follows as a result. There is invariably an element of guilt on the part of the victim who has initially invited possession by his or her aberrant behavior and life style. In extreme cases, the possessed individual has actually made a formal request for possession in order to gain some advantage, e.g., worldly wealth or fame. The process of expelling the possessing malignancy moves through identifiable stages. \\n“One of the most experienced exorcists I have known,” Malachi Martin notes, “who was in fact the mentor of the exorcist in the first case related in this book, gave names to the various general stages of an exorcism. These names reflect the general meaning or effect or intent of what is happening, but not the specific means used by the evil spirit or by the exorcist. Conor, as I call him, spoke of six stages: Presence, Pretense, Breakpoint, Voice, Clash, and Expulsion . Exorcism exacts practically intolerable toll on the priest in charge, not infrequently resulting in his death, at which point the junior helper must take over the task. Demonic possession is not an isolated or freak phenomenon. It seems to be on the rise, especially in the United States. Perhaps this has something to do with the demise of religious authority, the proliferation of Satanist covens, child abuse and sacrifice, the prevalence and glorification of Satanist elements in pop culture, and, finally, the wide acceptance and promotion of sexual perversion as a new norm. \\n“The incidence of Exorcism,” Fr. Martin begins by pointing out, “has been on a steady rise. There has been a 750 percent increase in the number of Exorcisms performed between the early 1960s and the mid-1970s. Over the same period, there has been an alarming increase in the number of requested Possessions – that is, cases in which the Possessed formally request Satan to possess them — in comparison to the cases of incurred Possessions, which result from other sorts of activities of the Possessed that facilitate Possession. \\nEach year, some 800 to 1,300 major Exorcisms and some thousands of minor Exorcisms are performed. For experts in the field, this is a sobering barometer of the increase in known cases of Possession. But it is still more sobering to realize how many more cases of Possession cannot be addressed at all. The thousands of letters I receive from people who are desperate for help — Catholic, Protestant, Evangelical, and unchurched — are eloquent, anguished, and a steadily mounting testimony to the crisis. \\nLaw officers, meanwhile, are increasingly confronted on every side by the incontrovertible signs of crimes committed in the course of ritualistic Satanism, or as a grisly result of an individual’s participation in such rituals. They are very often left out of the shrunken loop of expert advice and assistance. Advice and assistance that was once routinely to be found. \\nTo those who are active in the field of Exorcism, and who therefore acquire a greater than usual ability to uncover and recognize the marks of ritualistic Satanism for what they are, it is clear that in many police precincts the Satanist character of a crime is either relegated to the background or not mentioned at all — at least not in public reports. \\nBy and large, the police have no other choice. They have neither competence nor authority in the rarefied and dangerous field of Satanist behavior.” Most of the above points were made on numerous occasions in mythology and folklore, e.g., vampires, werewolves, and the tale of Dr Faustus adapted by Marlowe and Goethe. Jesus Christ was of course the Grand Exorcist, not only in the Gadarene swine incident but his opus seems to me to have been focused on confronting the Devil in Judaism for which he paid with his life … the tale does not end there in my view but I leave these speculative elements to the reader. — § — THE SIX STAGES OF DEMONIC POSSESSION \\nFrom the moment the exorcist enters the room, a peculiar feeling seems to hang in the very air. From that moment in any genuine exorcism and onward through its duration, everyone in the room is aware of some alien Presence . This indubitable sign of possession is as unexplainable and unmistakable as it is inescapable. All the signs of possession, however blatant or grotesque, however subtle or debatable, seem both to pale before and to be marshaled in the face of this Presence. \\nThere is no sure physical trace of the Presence, but everyone feels it. You have to experience it to know it; you cannot locate it spatially- beside or above or within the possessed, or over in the corner or under the bed or hovering in midair. \\nIn one sense, the Presence is nowhere, and this magnifies the terror, because there is a presence, an other present. Not a “he” or a “she” or an “it.” Sometimes, you think that what is present is singular, sometimes plural. When it speaks, as the exorcism goes on, it will sometimes refer to itself as “I” and sometimes as “WE.” \\nThis is reminiscent of the possessing entity in the Gospel who, when asked his name by Jesus, replied: “I am Legion.” ‘I AM LEGION.’ \\nInvisible and intangible, the Presence claws at the humanness of those gathered in the room. You can exercise logic and expel any mental image of it. You can say to yourself: “I am only imagining this. Careful! Don’t panic!” And there may be a momentary relief. But then, after a time lag of bare seconds, the Presence returns as an inaudible hiss in the brain, as a wordless threat to the self you are. Its name and essence seem to be compounded of threat, to be only and intensely baleful, concentratedly intent on hate for hate’s sake and on destruction for destruction’s sake. — § — \\nIn the early stages of an exorcism , the evil spirit will make every attempt to “hide behind” the possessed, so to speak-to appear to be one and the same person and personality with its victim. This is the Pretense . \\nThe first task of the priest is to break that Pretense, to force the spirit to reveal itself openly as separate from the possessed-and to name itself, for all possessing spirits are called by a name that generally (though not always) has to do with the way that spirit works on its victim. \\nAs the exorcist sets about his task, the evil spirit may remain silent altogether; or it may speak with the voice of the possessed, and use past experiences and recollections of the possessed. This is often done skillfully, using details no one but the possessed could know. It can be very disarming, even pitiful. It can make everyone, including the priest, feel that it is the priest who is the villain, subjecting an innocent person to terrible rigors. Even the mannerisms and characteristics of the possessed are used by the spirit as its own camouflage. \\nSometimes the exorcist cannot shatter the Pretense for days. But until he does, he cannot bring matters to a head. If he fails to shatter it at all, he has lost. Perhaps another exorcist replacing him will succeed. But he himself has been beaten. Every exorcist learns during Pretense that he is dealing with some force or power that is at times intensely cunning, sometimes supremely intelligent, and at other times capable of crass stupidity (which makes one wonder further about the problem of singular or plural); and it is both highly dangerous and terribly vulnerable. \\nOddly, while this spirit or power or force knows some of the most secret and intimate details of the lives of everyone in the room, at the same time it also displays gaps in knowledge of things that may be happening at any given moment of the present. \\nBut the priest must not be lulled by small victories or take chances on hoped-for stupidities. He must be ready to have his own sins and blunders and weaknesses put into his mind or shouted in ugliness for all to hear. He must not make excuses for his past, or wither as even his loveliest memories are fingered by ultimate filth and contempt; he must not be sidetracked in any way from his primary intention of freeing the possessed person before him. And he must at all costs avoid trading abuse or getting into any logical arguments with the possessed. The temptation to do so is more frequent than one might think, and must be regarded as a potentially fatal trap that can shatter not only the exorcism, but quite literally shatter the exorcist as well. \\nAccordingly, as the Pretense begins to break down, the behavior of the possessed usually increases in violence and repulsiveness. It is as though an invisible manhole opens, and out of it pours the unmentionably inhuman and the humanly unacceptable. There is a stream of filth and unrestrained abuse, accompanied often by physical violence, writhing, gnashing of teeth, jumping around, sometimes physical attacks on the exorcist. — § — \\nA new hallmark of the proceedings enters as the Breakpoint nears, and ushers in one of the more subtle sufferings the exorcist must undergo: confusion. Complete and dreadful confusion. Rare is the exorcist who does not falter here for at least a moment, enmeshed in the peculiar pain of apparent contradiction of all sense. \\nHis ears seem to smell foul words. His eyes seem to hear offensive sounds and obscene screams. His nose seems to taste a high-decibel cacophony. Each sense seems to be recording what another sense should be recording. Each nerve and sinew of onlookers and participants becomes rigid as they strive for control. Panic-the fear of being dissolved into insanity-runs in quick jabs through everyone there. All present experience this increasingly violent and confusing assault. But the exorcist is the one who rides the storm. He is the direct target of it all. \\nThe Breakpoint is reached at that moment when the Pretense has finally collapsed altogether. The voice of the possessed is no longer used by the spirit, though the new, strange voice may or may not issue from the mouth of the victim. In Thomas Wu’s case, the alien voice did come from the possessed’s mouth; and that was why the police captain was so startled. The sound produced is often not even remotely like any human sound. \\nAt the Breakpoint, for the first time, the spirit speaks of the possessed in the third person, as a separate being. For the first time, the possessing spirit acts personally and speaks of “I” or “we,” usually interchangeably, and of “my” and “our” or “mine” and “ours.” \\nAnother very frequent sign that the Breakpoint has been reached is the appearance of what Father Conor called the Voice . \\nThe Voice is an inordinately disturbing and humanly distressing babel. The first few syllables seem to be those of some word pronounced slowly and thickly-somewhat like a tape recording played at a subnormal speed. You are just straining to pick up the word and a layer of cold fear has already gripped you-you know this sound is alien. But your concentration is shattered and frustrated by an immediate gamut of echoes, of tiny, prickly voices echoing each syllable, screaming it, whispering it, laughing it, sneering it, groaning it, following it. They all hit your ear, while the alien voice is going on unhurriedly to the next syllable, which you then try to catch, while guessing at the first one you lost. By then, the tiny, jabbing voices have caught up with that second syllable; and the voice has proceeded to the third syllable; and so on. \\nIf the exorcism is to proceed, the Voice must be silenced. It takes an enormous effort of will on the part of the exorcist, in direct confrontation with the alien will of evil, to silence the Voice. The priest must get himself under control and challenge the spirit first to silence and then to identify itself intelligibly. \\nAs in all things to do with Exorcism of Evil Spirit, the priest makes this challenge with his own will, but always in the name and by the authority of Jesus and his Church. To do so in his own name or by some fancied authority of his own would be to invite personal disaster. Merely human power unadorned and without aid cannot cope with the preternatural. (It is to be remembered that when we speak of the preternatural, we are not speaking about what are known as poltergeists.) \\nUsually, at this point and as the Voice dies out, a tremendous pressure of an obscure kind affects the exorcist. This is the first and outermost edge of a direct and personal collision with the “will of the Kingdom,” the Clash . \\nWe all know from our personal experience that there can be no struggle of single personal wills without that felt and intuitive contact between two persons. There is a two-way communication that is as real as a conversation using words. The Clash is the heart of a special and dreadful communication, the nucleus of this singular battle of wills between exorcist and Evil Spirit. — § — \\nPainful as it will be for him, the priest must look for the Clash. He must provoke it. If he cannot lock wills with the evil thing and force that thing to lock its will in opposition to his own, then again the exorcist is defeated. \\nThe issue between the two, the exorcist and the possessing spirit, is simple. Will the totally antihuman invade and take over? Will it, noisome and merciless, seep over that narrow rim where the exorcist would hold his ground alone, and engulf him? Or will it, unwillingly, protestingly, under a duress greater than its single-track will, stop, identify itself, cede, retire, disappear, and be volatilized back into an unknown pit of being where no man wants to go ever? \\nEven with all the pressure on him, and in fullest human agony, if the exorcist has got this far, he must press home. He has gained an advantage. He has already forced the evil spirit to come out on its own. If he has not been able to until now, he must finally force it to give its name. And then, some exorcists feel, the exorcist must pursue for as much information as he can. For in some peculiar way, as exorcists find, the more an evil spirit can be forced to reveal in the Clash and its aftermath, the surer and easier will be the Expulsion when that moment comes. To force as complete an identification as possible is perhaps a mark of domination of one will over another. \\nIt is of crucial interest to speculate about the violence provoked by Exorcism-the physical and mental struggles that are so extreme they can bring on death. Why would spirit battle so? Why not leave and waft off invisibly to someone or someplace else? For spirit itself seems to suffer in these battles. \\nTime and again, in exorcism after exorcism, there occurs that curious thing to do with spirit and place, the strange puzzle mentioned previously in connection with the room chosen for the exorcism. When Jesus expelled the unclean spirits, those spirits showed concern for where they might go. In record after record, as well as in several exorcisms recounted in this book, the possessing spirits wail in lament and questioning pain: “Where shall we go?”“We too have to possess our habitation.”“Even the Anointed One gave us a place with the swine.”“Here . . . we can’t stay here any longer.” \\nEvil Spirit, having found a home with a consenting host, does not appear to give up its place easily. It claws and fights and deceives and even risks killing its host before it will be expelled. How violent the struggle probably depends on many things; the intelligence of the spirit being dealt with and the degree of possession achieved over the victim are perhaps two one could speculate about. \\nWhatever determines the actual pitch of violence, once the exorcist has forced the invading spirit to identify itself, and sustained the first wordless bout of the Clash, and then invoked its formal condemnation and expulsion by the Exorcism rite, the immediate result is generally a struggle tortuous beyond/imagining, an open violence that leaves all subtlety behind. \\nThe person possessed is by now obviously aware in one way or another of what possessed him. Frequently he becomes a true battleground for much of the remainder of the exorcism, enduring unbelievable punishment and strain. \\nIt is sometimes possible for the exorcist to appeal directly to the possessed person, urging him to use some part of his own will still free of the spirit’s influence and control, and engage directly in the fight, aiding the exorcist. And at such moments no animal pinned helplessly to the ground struggles more pathetically against the drinking of its life’s blood by a voracious and superior cruelty. The very nauseous character of the possessed person’s appearance and behavior appears to be a sign of his desire for deliverance, a desperate sign of struggle, evidence of a revolt where once he had consented. \\nIncreasingly what had possessed him is being forced into the open, all the while protesting its victim’s revolt and its own expulsion. The violence of the contortions and the physical disfigurement of the possessed can reach a degree one would think he could not possibly withstand. \\nThe exorcist, too, comes in for full attack now. Once cornered, the evil spirit seems able to call on a superior intelligence, and will try to lure the exorcist on to a field boobytrapped and mined with situations from which no human can extricate himself. \\nAny weakness in the religious faith that alone sustains the exorcist or any fatigue will allow the exorcist’s mind to be flooded with a terrible light he cannot fend off-a light that can burn the very roots of his reason and turn him emotionally into the most servile of slaves desperate to be liberated from all bodily life. \\nThese are only some of the dangers and traps that face every exorcist. His pain is physical, emotional, mental. He has to deal with what is eerie but not enthralling; with something askew, but intelligently so; with a quality that is upside down and inside out, but significantly so. The mordant traits of nightmare are there in full regalia, but this is no dream and permits him no thankful remission. \\nHe is attacked by a stench so powerful that many exorcists start vomiting uncontrollably. He is made to bear physical pain, and he feels anguish over his very soul. He is made to know he is touching the completely unclean, the totally unhuman . “THE TOTALLY UNHUMAN” ( CLICK TO EXPAND ) \\nAll sense may suddenly seem nonsense. Hopelessness is confirmed as the only hope. Death and cruelty and contempt are normal. Anything comely or beautiful is an illusion. Nothing, it seems, was ever right in the world of man. Here is an atmosphere as bizarre as Bedlam. \\nIf, in spite of his emotions and his imagination and his body—all trapped at once in pain and anguish—if, in spite of all this, the will of the exorcist holds in the Clash, what he does is to approach his final function in this situation as an authorized human witness for Jesus. \\nBy no power of his, on account of no privilege of his own, he calls finally on the evil spirit TO DESIST, TO BE DISPOSSESSED, TO DEPART! — AND TO LEAVE THE PERSON POSSESSED. \\nAnd, if the exorcism is successful, this is what happens. The possession ends. \\nAll present become aware of a change around them. The sense of Presence is totally, suddenly absent. \\nSometimes there are receding voices or other noises, sometimes only dead silence. \\nThe recently possessed will wake up as if from a dream, a nightmare, a coma. Sometimes he will remember much of what he has been through; sometimes he will remember nothing at all. — § — Many people could be demonically possessed without knowing it. Here are two individuals who, in my opinion, might benefit from the ministrations of a good exorcist: IS THIS WOMAN DEMONICALLY POSSESSED? Who knows? . . . but many have said so. (Click here for a spooky 2-minute video) IS THIS WOMAN DEMONICALLY POSSESSED? Who knows? . . . but many have thought so. Apart from the demonic expression that disfigures her face, this woman preaches White genocide—the total destruction of the European race. What more do you have to do to qualify for demonic possession? (See HERE for more details on Barbara Spectre’s psychopathy and compare the expression on her face with Figure 1 of this illustration from a medical textbook on demonic possession ) . As I wrote in a recent email to Lasha Darkmoon: “I feel that the entire tribe of Judah is demonically possessed. They always have been for centuries. Jesus made that point over and over again in his homilies. And clearly the Jews’ works bear that out. They are now the Devil’s agents on Earth to promote his policies and spread contagion into the body of the goyim. History bears me out on this.” \\nI will not quote Dr Darkmoon’s response here. It is too long and would require a separate article of its own. Suffice to say that she disagreed with me on several counts, though she accepted my general premise that demonic possession was an authentic and veridical phenomenon and not just a superstitious relic of the Dark Ages. Continued in Part 2: The Deceiver of the World , by Lasha Darkmoon \\nLOBRO VAN HELSING is a retired Canadian academic who is constantly on the move and likes visiting strange places; at present he is living in South East Asia.   2 thoughts on “ Demonic Possession Today (Part 1) ” Franklin Ryckaert says: November 19, 2016 at 10:23 am \\n“…LOBRO VAN HELSING is a retired Canadian academic who is constantly on the move and likes visiting strange places; at present he is living in South East Asia…” \\nThat sounds like “our” Lobro of the commentariat of this website, but I thought he was of Croatian descent and “van Helsing” is a Dutch or Flemish name.'"}, "time": 1742562759.919877}