{"duration": 0.015875577926635742, "input_args": {"text": "'Amid all the inflated headlines about Russian “hacking” of the U. S. the Washington Post was forced to retool an article that falsely claimed a Vermont power plant was hacked by Russian hackers. [Late on Friday, December 30, the Post broke a story originally entitled, “Russian hackers penetrated U. S. electricity grid through a utility in Vermont, officials say. ”  The Post story went on to say, “A code associated with the Russian hacking operation dubbed Grizzly Steppe by the Obama administration has been detected within the system of a Vermont utility, according to U. S. officials. ” But it appears that the paper published the shocking story before actually getting any quotes from the power company in Vermont. It also turned out that the paper’s tale was wildly exaggerated. The Vermont utility in question, the Burlington Electric Department, later released a statement clarifying where it discovered the “Russian code” and it turned out it there was not any “penetration” into the U. S. electricity grid. Later that evening, Vermont Public Service Commissioner Christopher Recchia told the Burlington Free Press that “the grid is not in danger. ” “As commissioner of public service we are very concerned about cybersecurity,” Recchia insisted. “I’ve been working with homeland security and our department of emergency management, homeland security to make sure that we are on top of things like this because this is a real concern. ” Utility officials said that the Russian malware code was found on but a single laptop computer that was not in any way connected to its power grid systems. The utility also issued a statement about the discovery of the code: Last night, U. S. utilities were alerted by the Department of Homeland Security (DHS) of a malware code used in Grizzly Steppe, the name DHS has applied to a Russian campaign linked to recent hacks. We acted quickly to scan all computers in our system for the malware signature. We detected the malware in a single Burlington Electric Department laptop not connected to our organization’s grid systems. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628505.1076834}