{"duration": 0.23289847373962402, "input_args": {"text": "'Leave a reply \\nNanice Ellis – Overwhelming evidence suggests that the world is in dire condition, but, silently behind the scenes, the world crisis is actually igniting a mass global awakening, and for the first time in history, millions of people like you and me are waking up! \\nThere is no denying, we are on the precipice of huge global change, but, although change is inevitable , the exact nature of it is yet to be determined and, in fact, each of us is waking up in order to make this choice for ourselves — so what we do now, and how we think, will determine the course of history. \\nAccording to quantum physics, multiple realities exist simultaneously , and therefore, the future you experience is completely up to you . This means that without your conscious participation, things can go either way. So why choose by passive default and risk living in a dismal and turbulent world, when you have the power to make a conscious choice and decide your own fate? If you want to live in a thriving world of peace, freedom and abundance for all, you must choose this Utopian Reality for yourself — then take action make it happen! Action Speaks Louder than Words \\nIndeed, our thoughts, beliefs and intentions are responsible for the current reality we experience and the future reality we will call forth, but there is more to it than just positive thinking, affirmations and vision boards, and, in fact, we must integrate our thoughts, beliefs and intentions into reality by taking tangible actions that represent the reality of our choice. Our willingness to take inspired action aligns us with our chosen reality, and with every step in this direction, we seamlessly bridge the gap. Bridging the Gap to Utopia \\nNo doubt, the state of our current reality is overwhelming and can easily paralyze us with fear, but making excuses for complacency, or using powerlessness to rationalize paralysis, only perpetuates the reality we want to change. Additionally, if we focus on the negative by complaining or we leverage feelings of victimhood to fight against the problems, we inadvertently fuel those problems with our (fighting) energy. Resistance is not only futile, it is quicksand for the soul! \\nWhy fight against what is wrong, and give energy to what is wrong, when we could use that same power and energy to create something better? Instead of wasting energy opposing the cause of unwanted conditions, we have the ability to consciously use our individual and collective energy to implement solutions. \\nThe truth is, we cannot align with a utopian reality by fighting against or denying the issues of our current reality, and, in fact, the path to Utopia begins in this reality, and, therefore, the first steps require us to solve our current problems. As always, your journey begins exactly where you are ! We Already Have the Answers! \\nAll around the world, revolutionary concepts and innovations are springing forth from individuals, private businesses and groups of like-minded people. Normal everyday people like you and me are providing some of the most pivotal solutions to virtually all global issues, including free energy technology, solutions to world hunger, sustainable methods for building, growing and waste management and various forms of innovation that could literally free humanity! \\nThe World Wide Web is a virtual treasure chest of knowledge and DIY technology, and many of these new technologies and methodologies are even open source – free for anyone to use, copy, share or build upon. There is no telling what jewels a “treasure hunt” might reveal, but although this knowledge is available to anyone who seeks answers, just like the most recent scientific research, most of it is suppressed, and, therefore, a huge percentage of people around the world don’t even know the answers we need already exists. Yet, information is power, and, therefore, informing the majority is an essential key to global transformation. It might be easy to blame the media for suppressing this information, but suppression has a deeper cause, and it comes back to you and me. \\nMany of us already have access to this vital knowledge, but we choose to suppress it from those less-informed because we fear they won’t understand, and we are afraid of being judged. Since it seems safer to withhold information than risk judgment, we rationalize silence as being harmless, but in the big picture silence supports suppression, and suppression of information perpetuates disempowerment. Ask yourself, “Is my fear of judgment more important than sharing ideas that could change the world?” \\nIndeed, the truth is available for all to discover, but until the minds of the majority are saturated with the knowledge and technology to build a new reality, we must be willing to share the truth and spread information to everyone. The Invisible Formula for Disempowerment \\nHumanity is suffering from the invisible disease of disempowerment, but when you look closely, the real cause is not so invisible. On one hand, we have been taught to be self-sufficient and compete with each other for opportunities, status, power, money, and even natural resources, but on the other hand, we have all been entrained into government-run social systems that provide for education, protection, justice, health-care and other primary needs. This means that as we compete with each other for survival, we blindly depend on corrupt systems that perpetuate mass disempowerment. \\nThe combination of separation from each other plus dependency on a system designed for profit and control is the formula for worldwide disempowerment, and, consequently, the devastating issues we experience today. As the Global Alarm Clock gets louder, we know that we must reclaim our power and we must reunite. We have the ability to transcend all obstacles and together we can create Utopia. Collaboration Beyond Borders \\nIn the mid 1800’s Darwin theorized that nature relies on competition in order to survive, and, as a result, our major global systems have been structured to perpetuate competition, but the latest research reveals that in order for life to thrive, nature actually relies on a system of cooperation where members of the species work together harmoniously. \\nMerely surviving is no longer an option for humanity, so if we want the human species to thrive, we must stop depending on social systems that perpetuate disempowerment, we must become fully responsible for all our needs and we must replace individual independence and competition with cooperation, and, furthermore, we must be willing to c ollaborate beyond borders , whether those borders are real or imagined. \\nIt’s time, we must stop competing for limited resources, and we must respond to life as if we are all cells of the body called Earth, and, as such, we must consciously re-create a global structure that supports every man, woman and child, and honors all life. \\nEarth overflows with abundance and can easily provide for every living being, but misuse of resources and capitalism have resulted in a resource crisis, however, by creating sustainable structures that support ongoing abundance, we have the ability to transcend all symptoms of scarcity. \\nThere are endless untapped resources that have yet to be discovered, but in order to access these sustainable treasures, we must approach the Earth from a completely different perspective. Instead of mindlessly taking, until resources run dry, we must implement sustainable solutions that honor and preserve Earth, and are not harmful to human, animal or plant life. \\nAlthough the knowledge, information, and technology necessary to thrive and flourish are already available, in order to turn proven or unproven concepts into real life solutions we need each other. No one person has all the answers, and, in fact, by Divine Design, we are each given one piece of the puzzle, so in order to solve the puzzle, we must work together, and as we align with solutions, we call forth the reality of a thriving planet that easily provides abundance for every living being. Creating Community \\nMillions of people worldwide share a similar dream of building sustainable live-in communities. Many of these people are making that dream a reality. You don’t hear much about it, but communities are popping up all over the world, and there might even be a fully functioning community near you. \\nAlso, consider that the neighborhood in which you now live offers incredible potential. Even people who live independently in a neighborhood can create a conscious community where community members work together growing food in a community garden, developing and maintaining sustainable energy for the whole community and sharing their gifts, skills and talents, as well as other essentials, such as cars, tools, cameras, sporting gear, etc…. \\nDon’t wait for someone else to take charge – if you are inspired to create a live-in community or neighborhood community, follow your inspiration, and don’t delay. Open Source information on community building is widely available, and, in fact, One Community Global http://www.onecommunityglobal.org/ offers hundreds of pages of Open Source material. The Golden Key \\nAs the Global Alarm Clock continues to sound, the deepest part of us remembers that we came here to make a difference and this is the time we have been waiting for! \\nI realize that it is easy to get caught up in the “dark side” of issues and play the victim of circumstances, but these issues are gifts in disguise; without a doubt, life is directing us to a new paradigm, where we consciously live in harmony with each other and with Earth. So, whatever you do to become more independent, and whatever you do to create a more sustainable lifestyle, do it with love. \\nDuring this transition period, it might seem like we are losing conveniences or we must do more work to support ourselves, but when you step back to see the bigger picture, it is clear to see that humanity is being offered the Golden Key to freedom, peace, and harmony, but in exchange for these precious liberties, we must offer conscious responsibility in return, and this means that we must become 100% responsible in every way. \\nThe world is in need of a mass pandemic of information that will spread like wildfire, and, when this happens, it will burn up all the lies and illusions that our current reality was built upon, and as it unlocks the invisible chains of disempowerment, the truth will not only set us free, the truth will call forth the reality of our highest dreams, and we will find ourselves on the precipice of total transformation. O ne World under God, indivisible, with liberty, justice and abundance for all!'"}, "time": 1742562004.7495575}