{"duration": 0.09792542457580566, "input_args": {"text": "'Susan B. Anthony’s grave site, in Rochester, is a perennial destination for women celebrating their freedom to vote, but on Election Day, Woodlawn Cemetery in the Bronx would like to remind New Yorkers to share the love. At Woodlawn, the grave sites of four other prominent suffragists could use some “I Voted” stickers, like those dotting Anthony’s grave, David Ison, the cemetery’s executive director, said on Monday. The cemetery will even provide the stickers. The idea for turning the sites into    destinations came this year after seeing the popularity of Anthony’s grave site grow on social media, Mr. Ison said. The need for some positive messaging after a bruising election season was also important. “We thought, ‘We’re going to do something that’s not all about Trump and all about Clinton,’” Mr. Ison said. On Election Day, visitors will be encouraged to leave their stickers on cardboard signs next to the grave sites of four suffragists buried in Woodlawn: Elizabeth Cady Stanton, Anthony’s friend and a   of the National Woman Suffrage Association Carrie Chapman Catt, who founded the League of Women Voters and who is buried next to Mary Garrett Hay, who assisted and advised her and Alva Vanderbilt Belmont, a multimillionaire who gave her opinions and her money to the movement. On Monday, as the sun was setting and shadows turned the cemetery chilly, the site of Stanton’s grave was lonely. About 15 “I Voted” stickers were posted near the family monument. A single sticker for Hillary Clinton, the country’s first female presidential nominee from a major party, who has nodded to the suffragists’ legacy throughout her campaign, was also posted. Only one visitor passed by, a man who called out “not yet” to a reporter’s remark that no sticker for Mrs. Clinton’s opponent, Donald J. Trump, had been posted. The graves of the three other suffragists were also deserted. The quiet display is in contrast to reports from the resting place of Susan B. Anthony, where women approach every few minutes with their daughters, friends and mothers. This year, the Mount Hope Cemetery in Rochester anticipates so many visitors that it said it would be open extended hours on Election Day to allow voters the opportunity to swing by and leave a sticker. Barbara Selesky, Woodlawn’s director of marketing, said on Tuesday that the cemetery would extend its visiting days, inviting people to leave their “I Voted” stickers until Sunday. For visitors who make the trek to the Bronx, the crew at Woodlawn asks just one thing: Please keep the stickers off the granite. The museum has put up a display next to the tombstone where visitors can leave stickers and other sticky mementos. “Stickers on graves have become a problem,” Susan Olsen, the cemetery’s historian, said. “It’s love and it’s honoring, but it just causes problems. ” At Woodlawn, a cemetery roughly half the size of Central Park, the legacy of four prominent suffragists competes for the limelight with several more famous neighbors, including Miles Davis, Celia Cruz and Herman Melville. When asked to explain the difference in popularity, Mr. Ison and Ms. Olsen both joked in unison, “There’s nothing else to do in Rochester. ” (Also, they said, Anthony was on the $1 coin.) But if the work of the suffragists has taught us anything, it’s that Stanton and Anthony might not have seen this as a competition. In a way, it may be fitting of how they saw their different legacies: Stanton, a married mother of seven who lived in New York, supplied speech material and support as Anthony traveled extensively as a public face of the movement. “They saw their relationship very clearly,” Ms. Olsen, Woodlawn’s historian, said. “She’s in the metropolis, and Anthony goes all over the place. They were brilliant as far as how their partnership worked. ” Neither woman lived to see the ratification of the 19th Amendment in 1920. In Stanton’s obituary, published in The New York Times in 1902, Anthony fondly recalled their dynamic, saying, “She forged the thunderbolts and I fired them. ”'"}, "time": 1742564515.8774288}