{"duration": 1.7305607795715332, "input_args": {"text": "'PART 1 YOUNGSTOWN, Ohio  —   Numbered balls of chance rattle and rise two nights a week down at the cavernous community hall of Sts. Peter and Paul Ukrainian Orthodox Church. It’s called a good bingo when your number comes up. But that last Saturday before Christmas offered no good bingos. The night was reserved for a boxing event billed as Season’s Beatings, which had prompted a newspaper deliveryman named Anthony Taylor to pull up in his clattering Dodge Caravan.   years old, 5 feet tall, 115 pounds, about to turn pro. A fist of nerves, he walked down the   stairwell to the finished basement, a space used for church dances and wedding banquets, but now an open locker room. Chandeliers glittered above the fighters trying to warm up and calm down, while the crowds upstairs cheered on the amateurs, including a      who would knock out his   opponent. Taylor had longed for this moment. All those years of being picked on because of his size, all those street fights, all that anger needing redirection toward something constructive  —   all down to this. He had his hair in ropy dreadlocks and his   shorts,   for $300, pulled high on his hardened torso. Portable curtains in the basement separated the hometown favorites from the    the A’s from the B’s. Someone smart about boxing could walk in cold and tell which side was which. The local fighters are usually a notch above, in better shape, expected to win. But Taylor’s   trainer, Jack Loew, heard this hammering sound, a whap, whap,   from the curtain’s other side. He peeked and saw a sinewy teenager in    shorts pounding the outstretched mitts of his trainer with uncommon discipline.  . “We got a fighter,” Loew said to somebody. Taylor was on his own side of the divide, warming up, when the curtain briefly parted to reveal his opponent. They made eye contact. “Nothing like anger,” Taylor recalled. “Both nervous. Just looking at each other. ” The curtain closed. A Life of Taking Punches and Unleashing His Own “Five foot even. ” That’s how Anthony Taylor describes his height. Not a   higher or lower. Five foot even. When you’re 9 inches shorter than the average man, abuse will find you. But Taylor was determined from an early age to prove his true stature the only way he knew. “Street fighting,” he says. His mother, an   factory worker, and his father, a handyman, split up before he was in kindergarten, so he bounced around a little. Moving from the small Ohio city of Warren to Youngstown, then down to Jackson, Tenn. he learned that broken families were tough on children, and that bullies were ubiquitous. “I was always the smallest guy in the neighborhood, so I had a lot of people picking on me,” Taylor said. “I really didn’t go around looking for trouble. It just seemed to find me because I was so small. ” “And I had a bad attitude,” he added. One day the manager of a gym in Jackson saw this small angry kid giving as good as he got, and invited him to do something with those quick hands and quicker rage. The kid began to learn. “Somebody hit you, hit you really hard, and you want to do something back,” Taylor said. “But when you think about it, you can’t fight when you’re angry. Boxing is a thinking game. ” Taylor followed the amateur circuit  —   Florida, Alabama, Arkansas, Nevada  —   earning a reputation as a boxer who kept on coming. At a fight one night in Little Rock, his trainer called out, “Go get him, Tiger. ” The nickname stuck. He tried a semester of community college, but higher education wasn’t for him, at least not yet. Sometimes the classes would run over time, and he’d be late to the gym. College could wait, he figured boxing could not. He had his career goals. “To be at the top of the ladder,” he said. “Number one. Champion. ” Missing his family back north, Taylor returned to Ohio. He lives with his fiancée, Tiera Glover, their    daughter and her two sons in Warren, in a worn house with green plastic furniture planted under the porch’s sagging roof. They cover the $600 monthly rent by delivering 250 copies of The Tribune Chronicle, a Warren newspaper, every morning. And every afternoon, except on days when he can’t afford the gas, Taylor drives his knocking Dodge Caravan, with its car seat and little girl toys, the 20 miles to Youngstown  —   to Jack Loew’s South Side Boxing Club, his   sanctuary, where boxing gloves hang from nails like holiday ornaments. The club stands out along a   stretch of Market Street. Some years ago, its owner, Jack Loew, hired a resident of a nearby halfway house for convicts to paint the exterior red and black. The artist also painted a pair of boxing gloves, enveloped in a wreath of stars that can convey dreamlike glory or a concussive haze. Loew is 56,   and as squat and solid as his building. He boxed as an amateur before focusing on a college football career that ended after several knee operations. He became a Teamster, lost the warehouse job he thought would last to retirement, worked construction and started his own   company. He also opened this club in 1989, as if in homage to what his hometown had once been. Youngstown was a pugnacious steel city of 167, 000 when Loew was born, with boxing clubs anchored in many neighborhoods. This is where his childhood friend Ray Mancini  —   Boom Boom  —   learned how to become a world lightweight champion. A   later, Youngstown is down to a population of 65, 000, a hemorrhaging of 100, 000 people caused by   closings, a failure to diversify and the absence, so far, of a sustainable second act. Lost in the exodus were some signature parts of the Youngstown culture, including many boxing clubs. But Loew took a shot. He opened his gym on Southern Boulevard, moved to an ancient brick building on Erie Street, then settled here, on the city’s tough south side. No problems so far, save for that time someone removed a massive tractor tire from the gym and rolled it like a determined Sisyphus up and down the hilly neighborhood  —   only to return the tire the next day. His excuse was simple: Just wanted to see if I could do it, Coach. Two decades ago, a scrappy    kid from the south side’s Slovak neighborhood came to Loew’s gym looking to learn how to box. This kid, Kelly Pavlik, went on to become the Ghost, an electrifying, dominant boxer with a drinking problem. He abruptly quit in 2013, saying he feared the   medical impact of his chosen career. “Kelly picked my door to come through,” said Loew, who is called Coach Jack by his boxers. “We were always crowded, but when we won middleweight champion of the world.   …    ” No need to finish the sentence: Pavlik’s success was good for Jack Loew’s South Side Boxing Club. It attracted a lot of locals looking to make their mark, including a superflyweight named Anthony Taylor. “A   Joe Frazier,” Loew said. This is boxing code for saying that Taylor keeps coming at you, takes a punch to give a punch, and has fists that hit like anvils. Taylor couldn’t remain an amateur forever. Loew needed to find him a professional opponent, maybe for the Season’s Beatings event that he had set up for the week before Christmas at the Ukrainian hall. But flyweights and bantamweights  —   who weigh less than half the reigning heavyweight champion, Tyson Fury  —   are hard to come by in this part of the country. A couple of weeks before Christmas, though, a trainer from Detroit who was bringing in two amateurs for the boxing night offered a solution. He said that he could supply a flyweight who, like Taylor, was itching to turn pro. Two Partners Engaging in a Dangerous Dance The ding of a bell in a church hall transformed two slight young men into professional fighters, hired to withstand blows to body and head while trying to pound each other out of consciousness. Their pay for the   fight: $300 for Taylor and $500 for his    opponent, since he was coming in from 200 miles away. Moments earlier they had stood with heads bowed, their coaches massaging their backs as the referee went over final details. Then they had tapped gloves, a gesture conveying   solidarity between strangers, known to each other only through a stolen glance across that parted curtain. Anthony Taylor danced the cautionary dance with his partner, head bobbing, looking for a moment to strike. He prided himself on his patience. But when the opponent tested with a tentative, catlike thrust, Taylor responded with a wild swing that punched only air, betraying his overeagerness. Then came a   scrum, left right left right. Violent contact made. The crowd aahed in approval. More than 700 people had turned out. Loew, the promoter as well as Taylor’s trainer, had charged $20 for general admission and $50 for ringside, while also managing to sell more than two dozen corporate tables. But after covering expenses that included the referee, the hall and ring rentals, and the hotel rooms for    boxers, Loew would take in just $382 for his eight weeks of work. At least his choice of location and timing  —   a Ukrainian church hall in late December  —   ensured a festive touch to the boxing event. A decorated Christmas tree sparkled in the corner. A    Ukrainian flag hung over the water fountain. A Christmas wreath and bright lights hung beside signs that said, “Valid Bingo Is Ball Called  —   Not Off Monitor” and “Early Bird Winner Take All. ” Instead of calls of “ ” and “” though, there arose the grunts of boxers, the whacks of leather against flesh, the cries and sighs of spectators in thrall. Some of the loudest shouts came from Taylor’s friends and family members. “Come on, Ant’! You got this!” Taylor crouched as he stalked, making his   frame even smaller before springing like a    . He connected with a left that sent his opponent back, and kept on coming. He ducked under a swing, came over the top and delivered another left that knocked the fighter in red and white down into the ropes. As Taylor retreated to his corner, fans were shouting: “He’s done, he’s done! Stop the fight!” Seconds later, Taylor struck again. “His guard came down, and I hit him with a straight left hand,” he recalled. A second knockdown, although this time his opponent got up quickly, adjusting his trunks as if the fall had been nothing more than a wardrobe malfunction. Then Taylor found himself reeling backward, almost comically, after taking a hard left to the head. He responded with a punch that he thought connected for a delayed knockdown others saw more of a phantom punch and stumble. Still, Loew recalled, “If the ref had stopped the fight, I don’t think anyone would have complained. ” The bell clanged. Taylor slumped to his corner, exhausted from all that he had expended trying to end the fight. He drank some water and listened to encouraging words from Loew, who struggled to be heard over the    music pounding out of the sound system. Then, again, came the bell’s beckoning. Taylor found his opponent waiting for him at the center of the ring, as if awakened by the knockdowns of the previous round. Soon there came a left that bounced Taylor off the ring’s    ropes. “Anthony!” someone pleaded. But Taylor could not yet find the wind or strength. “I threw out a lot of gas in the first round by me trying to finish him off,” he said later. “You’re trying to hurry up and get done with the fight. And that’s where the turnaround was in the second round. ” “Knock him out,” someone in Taylor’s corner shouted. Then: “Get him! Get him!” And: “Let’s go, Tiger!” And: “Put him down, Ant’!” Taylor took quick rights to the jaw, another hard right that rocked him, then a left and a right. Gloved fists pounded his many tattoos: the “R. I. P. ” on his right shoulder that honors a brother shot to death (“Wrong place, wrong time,” he says) the    on his left shoulder that reminds him he’s a jewel in the rough the dice and playing cards adorning his chest, along with the inscription: “Life A Gamble. ” Tension and Triumph, Confusion and Dread The bell. Another squirt of water. More of Coach Jack’s encouragement, only now sounding urgent. The passing blur of a young woman holding aloft a placard announcing Round 3. The bell. And there was Taylor’s opponent again, at the center of the ring, waiting. Taylor connected with a roundhouse left, but his opponent returned with a   insult to the chin. Taylor seemed   almost disengaged, as if exhaustion had displaced his purpose. “Let’s go, little man!” someone called out. But Taylor’s coach was more concrete. “Breathe, breathe!” Loew was shouting. “You gotta push it, Anthony!” Taylor did revive, holding his own until the bell. He was convinced the round was a tossup, but his coach knew otherwise. “Anthony was gassed in the third round, and took an ” Loew said. Now it was the fourth and last round, the final three minutes, and there again was his opponent, waiting. Taylor knew this was it  —   “an    thing,” he called it. His dreadlocks swayed as he danced and dodged, as he punched and received punches. It went this way, a study in mundane violence, for most of the first two minutes. Toe to toe. But then Taylor suddenly had his opponent near the ropes. He threw a right that either glanced off the boxer or missed him entirely. The opponent fell backward to all but sit on the apron. Trying to capitalize, Taylor threw a left. But the opponent ducked to his right and stumbled forward, head sweeping briefly against Taylor’s chest, arms outstretched, looking for something to hold on to, as if the blue mat had been pulled from beneath him. He looped his left arm around Taylor’s torso as he fell onto his right knee, his lower body gone limp, his black gloves down in sudden vulnerability. The referee waved his arms. Fight over! He bent down to help the opponent, who reached up with his right hand. Halfway to his feet, the boxer wobbled and fell back down. The sudden uncertainty disrupted the order in the ring. The opponent’s coach had slipped through the ropes and was now trying to help his fighter, who struggled again to rise, only to sway and fall back against his coach’s shins. My knee, he was saying. My knee. Loew was also in the ring, yelling to Bernie Profato, the director of the Ohio Athletic Commission, sitting at ringside, that the round hadn’t ended, and you can’t have people coming into the ring, and that was a knockdown.   …     “Your kid’s gotta hit him for a knockdown,” Profato called back. Mere noise. The fight was over. The opponent lay on his back as some people hovered over him, including the ringside doctor  —   a dermatologist  —   now slipping on a pair of surgical gloves. Taylor, meanwhile, knew only that he had won. He raised an arm and took a few courtly bows. But a shadow of dread was settling over this decorated bingo hall masquerading as a boxing arena. A fallen man was not rising, not rising, still not rising. His eyes were closed. Medics were climbing into the ring. “You knew,” Loew said. “You knew right then and there. ” You knew right then and there. The loser, this kid from Michigan named Hamzah Aljahmi, now   was unconscious. And the winner, Anthony Taylor, now   was sobbing. PART 2 DEARBORN, Mich.  —   The amateur boxer slept. Huddled in the passenger seat of his family’s sport utility vehicle, he rocked in slumber as his father drove out of Dearborn, then south and east around Lake Erie, verses from the Quran intoning softly from the speakers. Now and then the boxer would rouse long enough for a snatch of small talk. But soon his eyes would close again, and he would sleep through the December blur of Rust Belt towns and   fields, right to the edge of the Ohio city where he was to fight his first professional fight. Youngstown. This was Hamzah Aljahmi, 19, the oldest child and best friend of the man behind the wheel, Ali Aljahmi. The   permit dangling from the rearview mirror hinted of the father’s   worries, but no matter how bad things got, he knew that he could always confide in this beautiful   beside him, sleeping now to the   rhythms. How could he deny his son’s passionate dream to box his way to fame and fortune? To become the pride of Dearborn? Of Yemeni people everywhere? This was Hamzah’s destiny: to make his professional debut at a Christmastime boxing event called Season’s Beatings. Hamzah’s father had followed a different path. Born in Yemen, he had immigrated to Brooklyn, left high school without graduating  —   joked around too much, he says  —   and begun a life of manual labor. Store work. Factory work. Lifting and moving. He gravitated to Dearborn, the world headquarters of the Ford Motor Company, where   of the nearly 100, 000 residents are  : Lebanese, Syrian, Iraqi, Palestinian, Yemeni. Here are the Henry Ford museum and the Arab American National Museum, plants that make the   truck and restaurants that make fahsa, a seasoned lamb stew that is shared with others and scooped with torn pieces of flatbread. Now Ali Aljahmi was the married father of five, disabled by a   injury and living in a   neighborhood, a block from a massive factory. But he was an Aljahmi, a member of a fiercely proud extended Yemeni family with deep roots in two cultures. The Aljahmis, the Eljahmis, the Algahmis, the Aljahims  —   all there for him, and he for them. Above all, he was there for Hamzah, his elder son, the boxer. Years earlier, when the family was living in Detroit, three kids ganged up on skinny young Hamzah Aljahmi. The boy held his own in the mismatch, prompting an onlooker to give grudging respect: Your son is one tough character. Sensing a purpose in life, Hamzah began training with one of his idols, Brian Mihtar, a prominent   middleweight boxer known as Brian the Lion, who compiled a   record, with 10 knockouts, before suspending his career in 2010. He took a liking to this fledgling boxer, who showed both talent and heart. “Like a brother,” Mihtar said. When Mihtar closed his gym, Aljahmi and his father searched the Detroit area for someone who could make the boy   someday. They eventually chose Mohamed Hamood, or Coach Mo, a muscular former Marine with a shaved head who builds houses to support his family and his boxing fix. The amateur’s determination and focus impressed Hamood. The boy had phenomenal hand speed, an ability to slip punches, and surprising pop for a flyweight. But his tendency to fight with his chin up often left him dangerously exposed it was almost as if he were daring to be hit. Still, Hamood said, “a very hard worker  —   very hard. ” Hamzah Aljahmi fought more than a score of amateur matches, winning most and learning from all. Turning pro became his obsession, his father said: “All the time, his mind go to the boxing. ” He admired the ferocious boxers of Yemeni blood. Sadam Ali, the tough welterweight from Brooklyn. Mohamed Adam, the young superfeatherweight from Dearborn. His former coach, the Lion, Brian Mihtar. And, of course, Prince Naseem, whose image even served for a while as the wallpaper on Aljahmi’s smartphone. True, the young man had other interests. He attended prayer services. Doted on his mother and younger siblings. Abided high school, barely. Kept girls at a safe but friendly distance. Worked at a Tim Horton’s doughnut shop and then at the American Coney Island restaurant, serving hot dogs smothered in chili and onions. But it was boxing that defined him. He craved cranberry juice, shunned bread and spent most of his spare time in Hamood’s gym, in Dearborn Heights, working out, sparring with heavier partners, itching to fight for a living. “He was bugging me to go pro when he was 17,” Hamood, 55, recalled. “And I’d say, ‘Let’s take our time.’ ” Some friends and relatives approached the inherent violence of Aljahmi’s passion delicately, occasionally suggesting that he give up the ring. Others accepted that he knew who he was, and admired him for it. He talked of becoming champion and parlaying his   fame in a way that would help others in need  —   in   Yemen and beyond. Remember when he helped to collect clothes for Syrian refugees? And somehow persuaded his father to donate his three favorite coats? Remember that saying he used to repeat? “You laugh at me because I’m different I laugh at you because you’re all the same. ” Mohammad Yacoubi, 19, a classmate of Aljahmi’s and one of his closest friends, shrugged in mock surrender while trying to explain the young man’s charms. He had no enemies, he was respectful to his mother and father, he loved his siblings, and he was loyal to his friends. “Just a special kid,” Yacoubi said. Opportunity came in early December, when Coach Mo Hamood struck a deal to have Aljahmi fight in Youngstown against another amateur who was also turning pro. “He was ready,” Hamood said of his young flyweight. Aljahmi girded for the day. After telling his father that a door had opened, he posted a photograph on Instagram of his application for a Michigan boxing license, along with a note sharing the date of his debut fight  —   “DECEMBER 19th”  —   and asking people to come support him. “Alhamdulillah. ” Praise be to God. Making Final Preparations and Planning to Celebrate As the S. U. V. approached the outskirts of Youngstown, some three hours after leaving Dearborn, Hamzah Aljahmi stirred into consciousness. Looking around, he said that it was his turn to drive. His father laughed but surrendered the wheel. Father and son headed to the prefight   at a government building in downtown Youngstown. The younger Aljahmi’s     manner impressed the director of the Ohio Athletic Commission, a retired police officer and former referee named Bernie Profato  —   so much so that Profato told him, win or lose, “You’ll be welcome back in Ohio anytime. ” After the   Aljahmi joined his coach and the two amateurs from Dearborn, including an    with a preternatural punching ability, for some   at a Carrabba’s Italian restaurant, not far from their rooms at the Red Roof Inn. Aljahmi had pasta with cream sauce. Before the night was over, the eager boxer posted one last photograph of himself on Instagram. Big smile. Throwing a right fist at the camera. “Ready for 2mrw fight night everyone keep me in ur prayers inshallah,” he wrote. If Allah wills it. The next morning, Aljahmi and his father ate breakfast at an IHOP  —   eggs and turkey sausage for more weight gain  —   then returned to the hotel for a short rest and the long wait. Since the next day would be the father’s 51st birthday, the two Aljahmis talked about getting a cake. “Win and we’ll celebrate twice,” the father promised. With the time drawing near, they drove with Coach Mo and his two young amateurs to the    community hall of Sts. Peter and Paul Ukrainian Orthodox Church, on Youngstown’s west side. Joining them were four friends who had driven from Dearborn in a cramped   Toyota. Down in the hall’s chandeliered basement, where curtains separated boxers from the opponents they were about to meet, young Aljahmi chatted away as his coach prepared him for his debut. While Aljahmi sat with his arms propped on a white towel draped over a chair back, Coach Mo wrapped his boxer’s hands in protective gauze, carefully, almost clinically. He then slipped   gloves over those hands and tied the strings. Finally, to cut down on the rudeness of leather against skin, he applied petroleum jelly with his fingertips to the unlined brow, the fresh cheeks, and the chin too often left exposed in the rashness of youth. There was one last detail. With his first professional fight just moments away, Aljahmi still had no nickname. But if his opponent  —   a short fighter he had seen when the curtain between them suddenly opened  —   was calling himself the Tiger, then how about something just as feral? How about the Lion? Agreed. A protective entourage  —   his father, his coach, a few friends  —   escorted Aljahmi up the basement steps and into the   auditorium, a   bingo hall set up for a boxing event. Now here he was, for the night’s first professional fight, a   in the superflyweight division. In    shorts with matching red shoes, the dynamo from Dearborn. The pride of the   community. His father’s best friend. Hamzah “the Lion” Aljahmi. A Sudden Shift in Mood After the Opening Bell Before the first bell, Aljahmi had told Coach Mo that this was his time. I’m ready, Coach, he had said. Let’s get this thing going. Now it was going, but not well. Aljahmi’s opponent was quick, active, and crouched so small that he made for a difficult target. The sight of their Hamzah being pummeled startled his friends, who had been harboring a more abstract understanding of what it meant to box professionally. Then down Aljahmi went, tagged by a powerful left. His opponent had capitalized on the weakness that Coach Mo had been working on: the “boxing ” he called it, of leaving the chin exposed. “It felt like a movie when he went down,” Aljahmi’s friend Mohammad Yacoubi said. “He had gone into that ring like a superhero. ” A few seconds later, Aljahmi went down a second time, forcing Coach Mo to make quick assessments. His young boxer was more “wobbly” after the first knockdown, the coach later said, after taking a punch that was “right on the button. ” But the second one? “He had a little wobble,” he said. “But he can go. ” Aljahmi did bounce up quickly. He adjusted his trunks  —   as if recalibrating body and mind  —   and went back to work. Becoming more aggressive, he delivered a hard left that had his opponent backpedaling. Then, while trying to avoid a swing that seemed to hit more air than flesh, Aljahmi fell against the ropes. He might have simply tripped, but it was not an impressive way to end the first round. Two knockdowns and one stumble. He returned to his corner charged with energy. What did I do wrong, Coach? “Hamzah, your chin is way up in the air,” Hamood recalled saying. “And your right hand is down. ” Aljahmi went out to own the second round, exploiting his opponent’s fatigue and blocking out the shouts of a Youngstown crowd eager to see this    fall. When the bell rang, he all but ran back to his corner after leaving his weary opponent on the ropes. “Great job,” Coach Mo told Aljahmi. “Let’s keep doing what you’re doing. Use your jab. No need to wrestle with him. ” Aljahmi looked at his clutch of friends in the seats, smiled, nodded his head  —   and returned to the ring to follow his coach’s instructions exactly. Round 3 repeated Round 2. Although his opponent tagged him quickly with a left from nowhere, Aljahmi answered with a hard right to the chin. “There he goes!” Yacoubi, Aljahmi’s friend, shouted. Soon another Aljahmi right found purchase. “There you go! There you go! He’s tired! He’s tired! Hamzah, he’s tired!” This was true. Aljahmi’s opponent was still recovering from having fought so aggressively in the first round. His own coach was shouting for him to push through it  —   which he did, briefly, during a   flurry. The bell rang just as Aljahmi uncorked one more punch. A little late, it seemed, but clearly accidental. He tapped his opponent’s chest in apology. Coach Mo gave Aljahmi water and applied more petroleum jelly, that translucent touch of protection, to his eyebrows, cheeks and nose. “We need this round,” the coach said, as if to make clear to his boxer the tossup closeness of the fight. I got you, Coach. Aljahmi then leaned over, found his father in the crowd, and shook his right glove in a gesture that seemed to say now is the time. Now. He was so jacked up on adrenaline that he hurried to the center of the ring well before the bell. The   referee had to nudge him back a step or two, while his coach called after him that he was the toughest kid he knew. “Go get him,” Coach Mo commanded. The two superflyweights gave it their all, each determined not to lose his professional debut, as the crowd urged them on. “Give him one, Hamzah!” Aljahmi’s friends shouted. “There you go! More! More!” “Get him, get him, get him!” “Hamzah, get him! Hamzah, he’s done! He’s done!” “Keep going!” Then  —   a punch to their friend’s head. “Oooh!” Aljahmi, who had been dominating, was suddenly backed into a corner by his flailing opponent. “Get out of the corner!” a friend yelled. “Get out of the corner!” Too late. Their superhero was squat against the apron, dodging swings, lurching forward, grasping to hold on to something unseen, then falling, drooping, legs not cooperating, arms down. The referee stopped the fight, causing confusion about what had just happened. He tried to help Aljahmi to his feet, but the boxer could not find the strength. Panicking, Coach Mo rushed into the ring. “Good job, Hamzah!” he said, mistakenly thinking the bell had rung. “Get up. You won the fight!” I can’t. My knee. I twisted my knee. He leaned back, or maybe fell back, onto Coach Mo’s shins. Aljahmi’s father and friends had just been shouting that his opponent was “done” now they were mute. A moment ago their Hamzah had been controlling the fight now he was propped against his coach’s legs like a rag doll. A dermatologist serving as the ringside doctor slipped under the ropes and donned surgical gloves. The Lion lay flat on the mat. Then, Coach Mo said, “Hamzah closed his eyes. ” PART 3 YOUNGSTOWN, Ohio  —   The fearless young boxer feared what he would see, feared how he would be received. He lingered at the threshold of the surgical intensive care unit, unable to take those few short steps to the bedside of his comatose opponent. The boxer, Anthony Taylor, known for his        ferocity, froze under the unforgiving lights of crisis care at St. Elizabeth Youngstown Hospital, where a chorus of beeping monitors and exhaling respirators sang of lives at the precipice. He did not want to be here. That is, he wanted to be here, and his coach told him that he should be here, but he was frightened. In his gloveless hands he carried the shield of a bouquet, bright yellow flowers that were like dandelions, only nicer. A nurse asked if he needed help. Soon, a relative of the patient he had come to see invited him into a crowded room. There, in a small bed, with a white bandage wrapped around his head and a blue air tube running from his mouth, was the man Taylor had recently danced and fought with: Hamzah Aljahmi, 19, his eyes still closed. Taylor handed the flowers to someone and sat in a chair near the foot of the bed, stunned. To think that less than 72 hours earlier, he and this person had each been paid a few hundred dollars to fight their first professional fight, a   in the hall of a Ukrainian church. To think how they had stared into each other’s eyes while engaged in a most violent form of intimacy. It could be    Anthony Taylor in that bed, not Hamzah Aljahmi. Now Anthony would be spending the holidays with his family, while Hamzah.   …     The visitor began to cry. Ali Aljahmi, a first cousin, was moved, even impressed, by the sight of this distraught stranger paying his respects. For you to step into this room of anger and grief, Aljahmi thought to himself. For you to come to be with us. Takes a lot of strength. The cousin led Taylor into the hall to offer comforting perspective. Whatever was happening in that hospital room was Allah’s will, he said, and do not doubt that you helped Hamzah to realize his dream of becoming a professional boxer. One more thing, Aljahmi said. “You have become family with me forever for this kind of gesture. ” Taylor returned to the room and, for the next hour, talked with the father, an uncle and a few cousins of the man laid out before them, the black of his eyebrows enhanced by an enveloping whiteness of bandages and blankets. “They told me they wanted me to keep going,” Taylor recalled. “That he would want me to keep going, and that I have to honor him and keep him alive by continuing to box. ” The father, also named Ali Aljahmi, would only vaguely remember Taylor’s visit, so   were his waves of grief. He had been at the fight. He had seen his beloved son, a determined fighter, crumple to the blue mat. Not in direct response to any punch, it seemed, but almost as an afterthought. The elder Aljahmi had been here in this chilling, antiseptic environment ever since, save for when nurses would gently tell him it was time to leave for the night. He’d return to a hotel whose name he would not remember and try to avoid the many anxious telephone calls from family members and friends back in their hometown of Dearborn. How is Hamzah? How is Hamzah? How is Hamzah? The father did not want to answer. If he did respond, it was to tell a version of the truth: “Hamzah is sleeping. ” Finally, the father telephoned a nephew in Dearborn with the same name as his: Ali Aljahmi, Hamzah’s cousin. I need you to bring Hamzah’s mother here to Youngstown, Ali. She needs to see him. The nephew understood what his uncle was not saying. He did as he was told. He packed Hamzah’s mother, Jamilah Aljahmi, and other relatives into a borrowed Chevy Cruze and began to drive, listening to them cry because Hamzah had been injured, but knowing that worse news awaited them in Youngstown. The mother saw her child wrapped in white, as if already prepared for the coffin. She held his feet, felt warmth, and in her profound grief exclaimed that he was alive! All this was too much for her health, it was decided. A relative drove Hamzah’s mother and the other women back to Dearborn. To wait for what was to be. But the father clung to hope as his son had clung to the ropes. He arose one morning in that strange hotel feeling as though all would be well. These efficient people in lab coats and nursing outfits would find some   equivalent of smelling salts, and his son’s eyes would open. Finally, though, the father let go. Shedding his stoicism, he collapsed onto his son’s chest and begged between sobs that Hamzah rise and come with him to IHOP for another restorative meal. Please, Hamzah, he implored. Do not leave your best friend like this. The shaken cousin, Ali Aljahmi, sought out the neurosurgeon and asked to be told straight, so that the family could prepare. “He said in 30 years he hadn’t seen a brain so damaged,” he remembered. “He told me  : Start making arrangements. ” By this point, Anthony Taylor the boxer had said his hospital goodbyes and driven his dented Dodge Caravan the 20 miles back to the weathered white house he rented with his fiancée. Exhausted by it all, he fell asleep, only to awake an hour later to a text message aglow on his phone. Hamzah Aljahmi was dead. A Tribute to a Man Who ‘Was Everything’ After the autopsy, a Youngstown funeral home arranged to return Hamzah Aljahmi to Michigan, retracing his interstate journey past the deadened brown of a Rust Belt December, to a funeral home in Detroit, close to the Dearborn line. A handful of relatives and friends, all men, prepared the young body for burial. They prayed as they tended to their somber task, while verses of the Quran emanated from a loudspeaker. The dead young man was laid upon a table. Fingernails and toenails were clipped. The body was meticulously cleansed and gently rubbed with a scented oil that made the skin glisten  —   “The smell was very beautiful,” the cousin Ali Aljahmi said. Then it was wrapped in three sheets of white cloth. The boxer was placed in a   coffin made of fiberboard and cardboard, in keeping with an adherence to simplicity. A pleasant perfume was sprinkled over the burial cloth. Late the next morning, a dark blue Dodge Caravan hearse carried the body the seven miles to the American Moslem Society mosque, a   building topped with a turquoise dome. Hundreds were already gathering in the parking lot. Family members shelved their shoes and carried the modest coffin up the stairs, past the small brown donation boxes and into a   area reserved for women, at the far back of the cavernous hall. The sounds of weeping escaped the divide. The coffin, draped in a    cloth, was then moved to one side of the long rectangular hall, where mourners paid their respects to many, many relatives: the extended Aljahmi tribe. The father, Ali Aljahmi, sat in the first chair, and in the second, at the family’s insistence, was Mohamed Hamood  —   Coach Mo  —   Hamzah’s   trainer. The mourning paused for the afternoon prayer. Long rows of men and boys, including many not before seen at the mosque, stood shoulder to shoulder on the    carpet with patterns pointing toward Mecca. They spilled into the downstairs space and out into the parking lot. After the afternoon prayer, relatives carried the coffin to the front of the room. The imam led a short funeral service that included prayers for forgiveness, for Hamzah Aljahmi, for all of humankind, and for mercy upon the family. Allahu akbar. God is great. It was time for burial. The shoeless pallbearers descended the stairs to meet the December cold and the jostle of thousands. They walked with purpose across the lot, some slipping into shoes as they went, carving a path through a human crush that was affecting traffic along Vernor Highway. Many vied to touch the coffin, while others competed for an honored turn as a pallbearer. But why so many mourners for a    man? People explain that Hamzah Aljahmi “died in action” that he represented the Yemeni embrace of boxing that he made friends with Arabs and   black, white, male, female that he embodied an infectious liveliness. “He was everything, to be honest with you,” Ibrahim Aljahim, a cousin and community leader, said. Another cousin, Fayez Algahmi, a former honorary consul of Yemen, agreed. “The way he died, and the thing he died for, touched everyone,” Algahmi said. The funeral procession turned right onto Riverside Drive, along which the rusty   fence of Woodmere Cemetery disappears into the distance. Now and then the undulations in the cemetery’s brown grass revealed the   tops of tombstones. Chanting prayers as they walked, the mourners turned left at a gate to enter the cemetery, many of them forming a protective bubble around the raised coffin. The occasional cold breeze ruffled its drape of    cloth. Near the grave site, relatives opened the coffin one more time, so that the father and a few others could say their final goodbyes. “I gave him a bunch of kisses on the forehead,” his first cousin Ali Aljahmi recalled. In keeping with Islamic ritual, the body was turned on its right side to face Mecca, and some dirt was placed beside it. The coffin was closed, and lowered into its concrete rectangular case. Then mourner after mourner threw dirt three times into the hole, signifying the beginning and end of things. God is great, they whispered. To God we belong, and to him we shall return. The communal grieving did not end at the grave. For weeks afterward, streams of people came to the Aljahmi family’s simple home to offer condolences and distraction. Among them were many young people seeking some token or relic of their friend the boxer, Hamzah the Lion. A  . A jacket. A shoe. A ribbon. A trophy. Of course, of course, the brokenhearted father would say. “I don’t close the door,” he explained. A Fighter Finds Comfort in Someone Who Understands On the tough south side of Youngstown, in the squat   refuge called Jack Loew’s South Side Boxing Club, the boxing life continues for Anthony Taylor. He and other   champions punch bags and skip rope, spar with partners and obey the sign that says “no weapon of any kind”  —   other than fists. Taylor had taken some time off after the Hamzah Aljahmi fight to get his body and mind straight. His right hand had been damaged, among other parts. True, the first time Taylor returned to the ring to spar, he froze for a moment. (“I was waiting on him, and he hit me, and hit me again,” he says. “And I was like, O. K. ”) But now the Tiger is back, shorn of his dreadlocks and preparing for his second professional fight, which is scheduled to be at the same venue, Sts. Peter and Paul Ukrainian Orthodox Church. He’ll be taking his chances, once again, in a bingo hall. “I can’t walk in there thinking about what happened,” Taylor says, as if trying to convince himself. “You can’t change what’s happened in the past. I wish I could. ” As Taylor works out, his coach, Jack Loew, sits in his back office, the walls covered with boxing memorabilia, a broken speed bag on his desk. He was the promoter behind that fatal boxing event, and he has wept over Aljahmi’s death. “You don’t think about stuff like that,” Loew says, voice cracking. “A frigging club show with   for four rounds. ” A few loose ends from that night remain to be tied. For one thing, the Mahoning County coroner has yet to release the results of his autopsy (although the weakness in Aljahmi’s right leg that night could be suggestive of a left hemispheric brain bleed). This is why Bernie Profato, the Ohio Athletic Commission’s director, has not formally closed the case, although he says his own inquiry found no lapses of protocol by the commission he oversees. Profato is also haunted by the memory of this polite young man, such a model of respect at the  . But the inherent dangers are made plain in the contracts signed by boxers, including these two   pros, Taylor and Aljahmi. “You’re entering a sport where you could be seriously hurt or injured,” Profato says. “They know that. That’s just the nature of the sport. ” A childhood friend of Loew’s comes through the boxing club’s door: Ray Mancini, the onetime lightweight world champion, known in Youngstown and far beyond as Boom Boom. Unfairly, he is also known for one fight:   Kim, Las Vegas, 1982. Mancini connected with two hard rights to Kim’s head at the start of the 14th round, sending the tenacious South Korean challenger to the canvas and prompting the referee to declare a technical knockout. Incurring a brain bleed known as a subdural hematoma, Kim lapsed into a coma and died four days later. He was 27. Mancini was 21. It took years, but Mancini worked his way through the depression and   that followed. Even though he eventually forgave himself and made peace with the tragedy, he says, others have shown less grace over the years. “Hey, Boom Boom,” he mimics. “Hey, man, let me ask you something. What’s it like to kill somebody in the ring? I mean, what’s it like to see someone go down and never get up?” Mancini is 54 now,   and fit, with various business and entertainment interests. He has come to his friend’s club this evening to counsel the young boxer with whom he shares a sorrowful bond. He wants to talk about forgiveness, and loudmouths, and giving up the game if there is even the slightest hesitation in the ring. Loew heads for the door in search of his boxer Taylor, saying, “I don’t even know where this kid is at. ” Soon Anthony Taylor, fresh from the stutter of speed bags and the whack of skipped rope, is in the   quiet, sitting shyly across from the Boom Boom Mancini like a confessor before a priest. “Really sad for you, man,” Mancini begins. “I never met you before, but.   …    ”'"}, "time": 1742562381.0453267}