{"duration": 0.13297080993652344, "input_args": {"text": "'If we lived in normal political times, our new president would be enjoying his honeymoon period, those few blissful weeks of good will and high hopes that usually accompany the start of an administration. Instead, the election of Donald J. Trump to the nation’s highest office has provoked an opposition movement that is extraordinary in American history, with millions of people devoted to stopping whatever it is he might want to do. The declarations began early on, with one key word echoing across them. “We are going to resist, we are going to oppose,” the filmmaker Michael Moore announced on the Friday after Trump’s election. “This is going to be a massive resistance. ” The following week, the former MSNBC host Keith Olbermann began a new video series titled “The Resistance. ” In December, a group of former Democratic congressional staff members published a   pamphlet titled “Indivisible: A Practical Guide for Resisting the Trump Agenda,” calling on liberals and leftists to emulate the most effective tactics of the Tea Party. On Twitter, hashtags like #ResistTrump, #NewAmericanResistance and #TheResistance document the range of concerns and movements now assembling under one banner: climate change, net neutrality, Black Lives Matter, reproductive and immigrant and disability rights. The   Women’s March made all of this spectacularly visible, with a   show of defiance intended to put the president on notice. “Today is not a concert,” the march organizer Tamika Mallory told the crowd gathered in Washington. “It is not a parade. And it is not a party. Today is an act of resistance. ” Days later, activists unfurled a   banner from a crane behind the White House, with just one word printed on it: RESIST. As the term of choice for the emerging   coalition, “resistance” signals urgency, the desire to stand up and say no before it’s too late. At the same time, it concedes some ground: With Republicans controlling all three branches of government, “no” may be the only position available to Democrats, leftists and liberals. To resist is to do something negative  —   to push back against someone else’s agenda when your own back is up against the wall. It is a desperate word for desperate times, filled with limits as well as possibilities. A call to resist is different from a call to “organize” or  —   to borrow a word from the   Age of Obama  —   to “dream. ” Those words conjure visions of better worlds. Resistance names what you don’t want and leaves the vision thing for another, less urgent situation. It suggests a notably dark story about the next four years, one in which Democrats and liberals spend most of their time in a defensive crouch. Resistance evokes the struggle against totalitarianism, conveying personal defiance and official powerlessness at the same time. So what does it mean to apply that word in an ostensibly democratic system? If you’ve lost at the ballot box but aren’t seeking   revolution, what are the most useful forms of political action? If “yes” seems impossible but “no” seems insufficient, what fills the space between? Before Trump’s election, anyone who claimed to have been a member of “the resistance” was most likely over the age of 85, a veteran of   struggles in France and other   territories during World War II. That resistance involved armed conflict and personal risk of the bleakest sort, with guerrilla fighters hiding in the catacombs of Paris while Hitler’s forces did their worst above ground. Under fascist rule, there were no plausible options for political engagement. It was a fight to the death, and in early 1940s Europe, before the arrival of Allied troops, the outcome was far from certain. Talking about resistance still evokes this sense of honorable struggle against an occupying power. It implies patience as well as militancy, the ability to say no over and over and over again, to refuse to cooperate until the whole system crumbles. After the war, anticolonial movements from South Africa to Northern Ireland found their own strategies of resistance, settling in for long, sometimes bloody fights. The United States introduced its own peculiar twist on this idea, transforming a rallying cry of   liberation into a defense of white supremacy. In 1954, after the Brown v. Board of Education decision, white Southerners opted for “massive resistance”  —   a phrase coined by former Senator Harry F. Byrd of Virginia to describe the determined and bitter campaign to prevent the desegregation of Southern society. “Massive resistance” defended the racial status quo, but it adopted the language of rebellion, casting the federal government itself as an illegitimate occupying power. The American left created a different language of resistance, much of it focused around the   activities of groups like the War Resisters League. This   sensibility reached its peak in the late 1960s, during the Vietnam War, when student activists proclaimed a transition, per one slogan, “from Protest to Resistance. ” As the movement veterans Staughton Lynd and Michael Ferber pointed out in their 1971 book, “The Resistance,” that shift grew out of a desire to embrace “a deeper and riskier commitment, a move that warranted a new term to replace ‘dissent’ and ‘protest. ’’u2009” The goal was no longer simply to object to the war it was to throw a wrench into the war machine and make it stop. Antiwar activists continued to engage in peaceful protest  —   but now some also burned draft cards and firebombed R. O. T. C. centers. A small number, like the Weathermen, took up bona fide guerrilla activity, planting bombs at the Capitol, the Pentagon and other prominent buildings. As the war and its    stakes came to an end, so, too, did the embrace of resistance as a literal armed underground conspiracy. But while it faded as a political strategy, it began to gain prominence as a category of academic social analysis, the sort of thing that anthropologists and historians looked for in their studies of human societies. This was part of a broader trend toward “social history,” with its insistence that ordinary people  —   not just generals and politicians  —   could be the agents of serious historical change. Sometimes this meant studying organized revolts, like slave rebellions or peasant uprisings. By the 1980s, though, “resistance” had come to encompass a much broader set of behaviors. Enslaved or oppressed people might resist by taking up arms, but they might also resist simply by refusing to do as they were told. The political theorist James Scott called these “everyday forms of resistance”  —   a category that could include giving a sullen look to an employer, deliberately misfiling forms or just living life, as much as possible, on terms of your own choosing. Today’s “New American Resistance” seems to embrace at least some of this broader understanding. Joining it does not, thus far, require adherence to any particular ideology or set of tactical preferences. It simply means, in the biggest of   formulations, that you really don’t like Donald Trump, and you’re willing to do something about it. As a   enterprise, designed to achieve the greatest possible participation, this mode of resistance makes sense. But despite its good cheer, it still emphasizes what is not possible: It says that Trump is about to take a sledgehammer to the nation’s finest institutions and principles and that the only thing most citizens can do is shout “no” as loudly as possible. Many organizers have vowed that this yawp of dissent represents a beginning rather than an end  —   and history suggests that they may well be right. Some of the most significant shifts in modern American law and political culture came out of efforts birthed in panic and despair. During World War I, for instance, the United States banned criticism of the government, interned thousands of German Americans and instituted widespread surveillance of immigrants and political radicals. Many Americans supported these policies others feared that the country was abandoning cherished traditions of tolerance and free speech. In response, a small group of alarmed progressives founded an organization that came to be known as the American Civil Liberties Union. They lost many early courtroom battles, but their vision of a nation in which “civil liberties” were taken seriously eventually changed the face of American law and politics. There are conservative versions of this story, too. In the   at a moment when the   liberal consensus seemed to be at its height, William F. Buckley Jr. announced plans to “stand athwart history, yelling ‘Stop! ’’u2009” His new magazine, National Review, did not stop history, but it did provide a crucial platform for conservatives to think about where they wanted history to go. The budding movement set its sights on taking over the Republican Party and spent decades making that happen  —   turning resistance into concrete political success. Today even Buckley’s form of conservatism seems to be under assault by the Trump administration. It is at just those moments when old categories start to collapse, however, that room often opens up for something new. A nascent resistance, right now, is delivering an unusually loud and impassioned “no. ” But the mere act of refusal often turns out to have its own momentum. As people learn that they can indeed say “no,” they may begin to find new ways toward saying “yes. ”'"}, "time": 1742562129.7948883}