{"duration": 0.10857725143432617, "input_args": {"text": "'The office party can be a chance for   to get together in a relaxed setting to celebrate the holidays. Or it can be a memorable event for all the wrong reasons. “Getting on top of the boss’s desk and dancing  —   not a good idea,” John A. Challenger, chief executive of the outplacement consulting firm Challenger, Gray  Christmas, said in an interview. “Making a pass at the C. E. O. ’s spouse  —   not a good idea. These sorts of things have happened and given the H. R. teams great headaches. ” Phyllis G. Hartman, who owns the human resources company PGHR Consulting, said the newly released movie “Office Christmas Party” depicts the worst of all possible behaviors at office holiday gatherings. “For the most part, of all my years in H. R. 90 percent of the parties go fine,” she said, adding, “Bad things happen sometimes. ” To prevent misbehavior that can lead to lawsuits, complaints of sexual harassment or lasting memories that can make things awkward in the workplace, experts offer these suggestions: Employees expect alcohol to be served at parties, and it makes for a better celebration, Mr. Challenger said. Caron Treatment Centers, which treats drug and alcohol addictions, found that 85 percent of 2, 018 adults surveyed  last year said they believed that it was appropriate to drink at a holiday party at work. Of those who attended such parties, 11 percent reported experiencing negative physical and social effects from drinking, including passing out, needing to apologize to colleagues, and having their behavior hurt their standing at work, according to a company statement. “Drinking too much at a workplace party is one of the quickest ways to derail your career,” Doug Tieman, Caron’s president and chief executive, said in the statement. Party organizers should try to strike a balance between treating workers as adults and curbing potentially bad behavior, experts said. “Corporations hope that everyone will drink in moderation” said Laura E. Prather, managing principal of the Tampa, Fla. office of Jackson Lewis, which specializes in employment law. “And that never happens. ” She recalled one supervisor who overindulged in alcohol and loudly “gushed” to a subordinate about the outstanding performance review, raise and bonus she would get. Although the employee did get a bonus and raise, neither was for the maximum, Ms. Prather said. The supervisor’s comments at the party set unrealistic expectations and made another subordinate who was within earshot fear that he would fare poorly because the boss said nothing to him at the party about his performance, Ms. Prather said. Michael C. Schmidt, vice chairman of the labor and employment department at the law firm Cozen O’Connor, suggested that attendees be allowed a limited number of tickets for drinks. Experts also recommended having an early last call, offering vouchers for cab rides or serving a   punch. A survey by the Society for Human Resource Management  last year found that 59 percent of 385 human resources professionals surveyed said their organizations planned to serve alcohol. Ms. Hartman said managers can be enlisted to help supervise the festivities, noting that employees will take cues from their bosses. “If you’re the president of the company, and you’re sliding down tables, your employees will too,” she said. “You need some adults in the room. ” As a human resources manager, she said she did not drink at the parties. “I’ll tell you honestly, I never had a good time, I never relaxed,” she said. “I wanted everyone else to have a good time, but also I had to be aware of what was going on. ” Employers should outline expectations for appropriate conduct in the invitations and send a reminder on the day of the event, Mr. Schmidt said. Employees need to understand that “just because it’s not being held in the four walls of the office setting, it does not translate into becoming the wild, wild West,” he said. The size of the company does not matter, he said, adding: “When you’re the small    shop, you think, ‘I’m not going to have these kinds of issues. It’s a small family atmosphere.’ And then when you’re a big corporation, you think, ‘We have H. R. and these things are not going to happen here. ’” Ms. Hartman said employees should be reminded that the party is a   event regardless of whether it is being held at the office or somewhere else. “It’s silly to say this, but when you don’t say anything, employees take it that they can go crazy,” she said. Remember, what happens at the party does not necessarily stay at the party. With the proliferation of smartphones and social media, there are more ways than ever to document and share bad behavior, which can permanently damage your reputation. Work the room and network. Arrive early. It might be the best opportunity to talk to senior managers while things are relatively quiet. Company parties are a place to introduce yourself to executives who will influence your work life, Mr. Challenger said. “You can’t just go into the office to meet your boss’s boss’s boss,’’ he said, “but at a party it’s very easy to do. ”'"}, "time": 1742563919.2327697}