{"duration": 0.05910229682922363, "input_args": {"text": "'A Detroit judge threw the mother of a drunk driver being sentenced for killing a man out of her courtroom and into jail after she laughed at the victim’s family during a statement from the victim’s sister. [VIDEO: Drunk Driver’s Mom Jailed for Laughing at Victim’s Family,  Amanda Kosal, 25, was awaiting sentencing when Judge Qiana Lillard threw Donna Kosal and her boyfriend out of the courtroom, calling them “clowns” after the victim’s sister gave a statement to the court, the Daily Mail reported. The video showed the judge losing patience with Donna and her boyfriend after she caught them smirking. The judge later brought the mother back in and sentenced her to 93 days in jail for contempt of court. Amanda Kosal pleaded guilty to killing    Jerome Zirker and severely injuring his    fiancee Brittany Johnson. She was sentenced to three to 15 years in prison. Judge Lillard said Donna Kosal and an unidentified boyfriend were acting disrespectfully in the courtroom. “It’s time for him to go,” Judge Lillard said, looking out into the gallery. “And I don’t know who he is, but whoever can sit here at a tragic moment like this and laugh and smile when somebody has lost a family member  …     in the entire time that Mr. Zirker’s sister was speaking that clown, and that’s what I am going to call him, a clown, was sitting there smiling and laughing. ” A guard escorted the man from the room, and Judge Lillard addressed Donna. “You can go too because if you don’t know how to act, you can go to jail, so leave,” she said. When Judge Lillard brought Donna back in, they exchanged a few words and the judge motioned to the bailiffs to take Donna to jail. “Take her, she’s going in the back,” the judge said to the bailiffs. “Anybody else wanna go? You can go, too. ” Donna said something   about the judge’s mouth, to which the judge replied, “Oh, my mouth? Well, thank you, your mouth got you 93 days,” the New York Post reported. The next day, Donna appeared before the judge, and apologized for what she did. “I deeply apologize for what I did. I was under a lot of stress,” Donna said to the judge. The judge took pity on her and reduced her sentence by 92 days, setting her free. Amanda’s vehicle slammed into Johnson and Zirker head on, crossing the center line. Zirker was picking up his fiancee from a    as a care worker at a group home when the accident happened, WDIV reported.'"}, "time": 1742564127.25198}