{"duration": 1.6180808544158936, "input_args": {"text": "'Archives Michael On Television 22 Reasons Why Starting World War 3 In The Middle East Is A Really Bad Idea By Michael Snyder, on August 27th, 2013 \\nWhile most of the country is obsessing over Miley Cyrus , the Obama administration is preparing a military attack against Syria which has the potential of starting World War 3. In fact, it is being reported that cruise missile strikes could begin “ as early as Thursday “. The Obama administration is pledging that the strikes will be “limited”, but what happens when the Syrians fight back? What happens if they sink a U.S. naval vessel or they have agents start hitting targets inside the United States? Then we would have a full-blown war on our hands. And what happens if the Syrians decide to retaliate by hitting Israel? If Syrian missiles start raining down on Tel Aviv, Israel will be extremely tempted to absolutely flatten Damascus, and they are more than capable of doing precisely that. And of course Hezbollah and Iran are not likely to just sit idly by as their close ally Syria is battered into oblivion. We are looking at a scenario where the entire Middle East could be set aflame, and that might only be just the beginning. Russia and China are sternly warning the U.S. government not to get involved in Syria, and by starting a war with Syria we will do an extraordinary amount of damage to our relationships with those two global superpowers. Could this be the beginning of a chain of events that could eventually lead to a massive global conflict with Russia and China on one side and the United States on the other? Of course it will not happen immediately, but I fear that what is happening now is setting the stage for some really bad things. The following are 22 reasons why starting World War 3 in the Middle East is a really bad idea… \\n#1 The American people are overwhelmingly against going to war with Syria… \\nAmericans strongly oppose U.S. intervention in Syria’s civil war and believe Washington should stay out of the conflict even if reports that Syria’s government used deadly chemicals to attack civilians are confirmed, a Reuters/Ipsos poll says. \\nAbout 60 percent of Americans surveyed said the United States should not intervene in Syria’s civil war, while just 9 percent thought President Barack Obama should act. \\n#2 At this point, a war in Syria is even more unpopular with the American people than Congress is . \\n#3 The Obama administration has not gotten approval to go to war with Syria from Congress as the U.S. Constitution requires . \\n#4 The United States does not have the approval of the United Nations to attack Syria and it is not going to be getting it. \\n#5 Syria has said that it will use “ all means available ” to defend itself if the United States attacks. Would that include terror attacks in the United States itself? \\n#6 Syrian Foreign Minister Walid Muallem made the following statement on Tuesday … \\n“We have two options: either to surrender, or to defend ourselves with the means at our disposal. The second choice is the best: we will defend ourselves” \\n#7 Russia has just sent their most advanced anti-ship missiles to Syria. What do you think would happen if images of sinking U.S. naval vessels were to come flashing across our television screens? \\n#8 When the United States attacks Syria, there is a very good chance that Syria will attack Israel. Just check out what one Syrian official said recently … \\nA member of the Syrian Ba’ath national council Halef al-Muftah, until recently the Syrian propaganda minister’s aide, said on Monday that Damascus views Israel as “behind the aggression and therefore it will come under fire” should Syria be attacked by the United States. \\nIn an interview for the American radio station Sawa in Arabic, President Bashar Assad’s fellow party member said: “We have strategic weapons and we can retaliate. Essentially, the strategic weapons are aimed at Israel.” \\nAl-Muftah stressed that the US’s threats will not influence the Syrain regime and added that “If the US or Israel err through aggression and exploit the chemical issue, the region will go up in endless flames, affecting not only the area’s security, but the world’s.” \\n#9 If Syria attacks Israel, the consequences could be absolutely catastrophic. Israeli Prime Minister Benjamin Netanyahu is promising that any attack will be responded to “ forcefully “… \\n“We are not a party to this civil war in Syria but if we identify any attempt to attack us we will respond and we will respond forcefully” \\n#10 Hezbollah will likely do whatever it can to fight for the survival of the Assad regime. That could include striking targets inside both the United States and Israel. \\n#11 Iran’s closest ally is Syria. Will Iran sit idly by as their closest ally is removed from the chessboard? \\n#12 Starting a war with Syria will cause significant damage to our relationship with Russia. On Tuesday, Deputy Prime Minister Dmitry Rogozin said that the West is acting like a “ monkey with a hand grenade “. \\n#13 Starting a war with Syria will cause significant damage to our relationship with China. And what will happen if the Chinese decide to start dumping the massive amount of U.S. debt that it is holding? Interest rates would absolutely skyrocket and we would rapidly be facing a nightmare scenario . \\n#14 Dr. Jerome Corsi and Walid Shoebat have compiled some startling evidence that it was actually the Syrian rebels that the U.S. is supporting that were responsible for the chemical weapons attack that is being used as justification to go to war with Syria… \\nWith the assistance of former PLO member and native Arabic-speaker Walid Shoebat, WND has assembled evidence from various Middle Eastern sources that cast doubt on Obama administration claims the Assad government is responsible for last week’s attack. \\nYou can examine the evidence for yourself right here . \\n#15 As Pat Buchanan recently noted, it would have made absolutely no sense for the Assad regime to use chemical weapons on defenseless women and children. The only people who would benefit from such an attack would be the rebels… \\nThe basic question that needs to be asked about this horrific attack on civilians, which appears to be gas related, is: Cui bono? \\nTo whose benefit would the use of nerve gas on Syrian women and children redound? Certainly not Assad’s, as we can see from the furor and threats against him that the use of gas has produced. \\nThe sole beneficiary of this apparent use of poison gas against civilians in rebel-held territory appears to be the rebels, who have long sought to have us come in and fight their war. \\n#16 If the Saudis really want to topple the Assad regime , they should do it themselves. They should not expect the United States to do their dirty work for them. \\n#17 A former commander of U.S. Central Command has said that a U.S. attack on Syria would result in “ a full-throated, very, very serious war “. \\n#18 A war in the Middle East will be bad for the financial markets. The Dow was down about 170 points today and concern about war with Syria was the primary reason. \\n#19 A war in the Middle East will cause the price of oil to go up. On Tuesday, the price of U.S. oil rose to about $109 a barrel. \\n#20 There is no way in the world that the U.S. government should be backing the Syrian rebels. As I discussed a few days ago , the rebels have pledged loyalty to al-Qaeda , they have beheaded numerous Christians and they have massacred entire Christian villages . If the U.S. government helps these lunatics take power in Syria it will be a complete and utter disaster. \\n#21 A lot of innocent civilians inside Syria will end up getting killed. Already, a lot of Syrians are expressing concern about what “foreign intervention” will mean for them and their families… \\n“I’ve always been a supporter of foreign intervention, but now that it seems like a reality, I’ve been worrying that my family could be hurt or killed,” said one woman, Zaina, who opposes Assad. “I’m afraid of a military strike now.” \\n“The big fear is that they’ll make the same mistakes they made in Libya and Iraq,” said Ziyad, a man in his 50s. “They’ll hit civilian targets, and then they’ll cry that it was by mistake, but we’ll get killed in the thousands.” \\n#22 If the U.S. government insists on going to war with Syria without the approval of the American people, the U.S. Congress or the United Nations, we are going to lose a lot of friends and a lot of credibility around the globe. It truly is a sad day when Russia looks like “the good guys” and we look like “the bad guys”. \\nWhat good could possibly come out of getting involved in Syria? As I wrote about the other day , the “rebels” that Obama is backing are rabidly anti-Christian, rabidly anti-Israel and rabidly anti-western. If they take control of Syria, that nation will be far more unstable and far more of a hotbed for terrorism than it is now. \\nAnd the downside of getting involved in Syria is absolutely enormous. Syria, Iran and Hezbollah all have agents inside this country, and if they decide to start blowing stuff up that will wake up the American people to the horror of war really quick. And by attacking Syria, the United States could cause a major regional war to erupt in the Middle East which could eventually lead to World War 3. \\nI don’t know about you, but I think that starting World War 3 in the Middle East is a really bad idea. \\nLet us hope that cooler heads prevail before things spin totally out of control. It Is Illegal To Feed The Homeless In Cities All Over The United States » Boo-urns \\nThere is no need for a *world* war. Just let them all kill each other; the sooner the world is free from the idiocy that abounds throughout the entire middle east — including Israel — the better off the rest of us will be. 2Gary2 \\nDoes anyone out there see this ending well? \\nMichael Rodster \\nThe US and it’s Allies don’t care what happens in the Middle East. In fact it’s my view that they would prefer absolute chaos and a full blown out war. \\nAs the mantra in 1992 Elections…”It’s all about the economy stupid”. And the same applies here as well. This is all desperation as the US knows what’s coming economically. If they can ramp up their Military Industrial Complex it could help boost the economy. That is the primary business the US is in. It’s all about war and spying. \\nI do hate constantly repeating the man but it’s needed here as well. This all played out during the Great Depression except this time all the fiat based currency nations are in the same boat as the US and this time they have nukes \\n“Trade wars, Currency wars, World wars”– Gerald Celente Adrian \\nOn the contrary, a few may benefit…the CEOS and huge shareholders of Halliburton, Ratheon, etc…but the economy would be hurt by threats to oil, decreased stability in the ME, and so on. They don’t care about the economy, if they did they would have implemented stark programs to bring millions back to work. Instead, it’s been business as usual with downsizing, QE 2,3, 4, and shipping jobs overseas. davidmpark \\nNo. It won’t. Bad Kitty Cat \\nNot at all… and I also wonder how many US allies are going to join in! I truely believe there is a strong desire for war! old fart \\nAs usual they will join in for the first few months then slowly fade away leaving the US stuck with the whole mess. it has happened every time this time we are having a revisit to the crusades,, That mess lasted for 200 years and was never settled it just quieted down for a mutual draw. Hambone \\nShort of the second coming, I see no happy endings to this play. cateye \\nNo good ending. Cataclysm perhaps. I got a bad feeling about this whole thing….like the US is being led like a lamb to slaughter. Colby Williams \\nWe should just back off of the whole Syrian thing, its not worth it. JustanOguy \\nNo. tom \\nNo I don’t Michael. Thank you for keeping us informed on many fronts. I share your work everyday in e-mails and on FB. I hope that people are listening to what you are saying MeMadMax \\nOchooma’s ego will kill us all… lupa \\nThere would be plenty of sand for the building trade! or Rebuilding trade! RICHARD \\nI think we are on the verge of a economic collapse and a world war. With everything going on in just this country i will be surprise if we make in till the end of Oct. I have said this before. The train is just about to go over the cliff. lavista4u \\nYes. true…I believe its a distraction. September is Illuminati New year and they do some crap during the Month of September like 911… \\nWhat is coming to Americans next month could be 100 times worse than what they would do to Syrians. \\nAmericans needs to be more prepared and ready than Syrians it seems …It could be a distraction to cause chaos in America. \\nThey know no one wants war in America and even lame stream is publishing that story and 99% of comments on main stream news sites like CNN is against war…. \\nI believe America is their next target not Syria even though they are making it look like its Syria and Iran…. \\nEven if this does not turn out this way…Americans need to be prepared for all scenarios….as they are center of all problems created by the cabal. good luck….Make friends and join forces….Unity is Strength…. patricia666 \\nmy mother in-law got Dodge Dart Sedan by working parttime from a home pc. see this website w\\xadw\\xadw.K\\xadE\\xadP\\xad2.c\\xado\\xadm old fart \\nHow much was she charging per lay? Sueychop \\nWhen the stuff hits the fan every American should make sure to shoot at least two Russians before they get shot themselves. That way we win. seth datta \\nHow can this not be a part of/prelude to the End Times? And yet ignorance and apathy are the order of the day for most folk. Tim \\n@Richard, I couldn’t agree more. I think this October we will have our eyes opened. This train is in full speed. I have been stocking up for the last 2 years on food, ammo and sanitation. The biggest problem I have run into is income and cost of ammo. The ammo price has come down and some sites are catching up (midland and foxtrotgear seem to be the best prices). The ammo shortage hurt the last year, but my income seems like it has dwindled over the last 2 years. Josh \\nIt has been a rough couple of months. I always check ammoseek and it seems like bulk ammo and foxtrotgear have the best bulk prices. Don’t forget sanitation, food and medical. Keep your powder dry. MeMadMax \\nIf possible, keep a full tank of gas at all times. It seems like things are going faster than what we know. Gay Veteran \\nas Gerald Celente says about the economy: when all else fails they take you to war Beanodle \\nOil at above $150.00 per barrel will decimate many economies. Especially it the suppliers demand Gold or a currency other than U.S. dollars for it. \\nIf Obama starts a foreign war without Congressional approval can he be impeached? Would his impeachment placate Russia and China? Celery Muncher \\nImpeachment didn’t faze Bill Clinton and it certainly won’t faze King Barry the rodeo clown. These people will simply laugh at the impeachment proceedings and there are not enough congressmen with guts to remove the putz from office even if he was impeached. Obama will go on his merry way doing what he pleases because everyone is so scared of being branded a racist that their balls are frozen in their pants…. Gay Veteran \\nThere is bipartisan agreement on empire abroad and the national security/surveillance state at home obama_drama \\nBingo dood! Arkaden \\n“If the President takes us to war without Congressional approval, I will call for his impeachment. The Constitution is clear. And so am I.” -Joe Biden, 2007 \\n“The President does not have power under the Constitution to unilaterally authorize a military attack in a situation that does not involve stopping an actual or imminent threat to the nation.” -Barack Obama, 2007 \\nTHIS time must be different. Hambone \\nIt’s sad, but those lying, two-faced hypocrites will never be held accountable for their words and actions by a great many of the lemmings in this country. We are truly getting the government we deserve. myrna652 \\nmy mom in law just got Hyundai Sonata Sedan by working at home online… see this page w\\xadw\\xadw.J\\xadA\\xadM\\xad20.c\\xado\\xadm Adrian \\nDOUBLESPEAK! CorrectionSir \\nActually, the president can authorize military action, short of declaring war, if it is in support of allies, treaties or through the request of the UN. That’s the way things have been changed and rejiggered. Gay Veteran \\nand NONE of those apply in Syria Ralfine \\nAttacking a sovereign country is an act of war. And an attacked country has the right to defend itself, i.e. by sinking the attacking fleet. squashpants \\nHe said that in 2007? Afghanistan started in 2001, and Iraq in 2003. What war was Biden referring to? MeMadMax \\nProlly georgian conflict. GodHelpUs \\nOver amount of years U.S. prospered with the highest public debt. Without wars on it’s territory and so on.. Economy collapse is inevitable. To hold it over, U.S. needs to seed unstability and war in other countries. To keep ourselves stable country, to keep dollar high value (but without gold – dollar is just a paper). We intentonally made that “Arabic spring”, changed management of all those countries. Who didn’t agree – was murdered (like Kaddafi), who did like Egypt – was changed by our man. Now we expect another wave of economical collapse. We NEED to seed fear and distable east. And it’s not Obama! He’s just a puppet.. We made hugest and well trained army with the top weapons on other countries money 😀 But It won’t last forever… churchill \\no aye pal for sure its diffrent obama changed his bacon for weetabix he goes for a 5 mile run now before thinking about war and fat soldiers not being able to run from their turbo tanks it takes an american soldier at least 2 hours to put his make up on first Elelei Guhring \\nNotice how neonics found in many pesticides most manufactured by Bayer/Monsanto and which have killed up to 70% of bee populations around the world are not an imminent threat to the nation, even though this action is considered Terrorism under US law: any action that endangers the food supply IS terrorism. davidmpark \\nWe accepted our orders for NBC gas masks today. 2 adult sizes; 3 children sizes. Got them online for $6.99 ea/free shipping. \\nAlso got some extra med kits, potassium iodine, and more food. \\nWe will get hit. The US will get struck again and no country will cry for us. Could we take on the international community? Only if we use WMD’s on them, too. China, Russia, and Iran will retaliate. \\nCongress needs to move to stop Obama as this is enough to prove he and his entourage are incapable of ensuring the welfare of the United States. Impeachment needs to be done, arrests need to be made, trials must commence… and sentences if judge and congressional jury find guilty anyone for crimes against this people. \\nWe must support such actions by Congress, or we will pay the price; not them. ?huh \\nWhere did you get the masK? Were filters outdated? That is cheap! davidmpark \\nThey’re IDF leftovers bought on Amazon. I also bought the new canisters – assuming the included cans are expired. ?huh \\nI looked and the Amazon review show the items are old and may not be useful and attack. Some are as old as 40 years. davidmpark \\nIf you are worried about gas attacks, you can make a filter for an air conditioning unit. \\nFirst, get all of the supplies you can: a lot of baking soda and wood charcoal (not briquettes), piece of wood, a scale (any kind), a large pot, 2 pillow cases, a plastic or metal box, and duct tape. \\nPour the baking soda into a pot and weigh it. After recording the weight, place on heat source and cook it for a few minutes. Remove and re-weigh, then repeat. When the scale no longer shows change in weight, pour the powder into a pillowcase and make more if necessary to fill to pillowcase about half way or more. This process converts the sodium bicarbonate into sodium carbonate (soda ash, or activated carbon). \\nNow pour the charcoal onto the pot and use a piece of wood to crush the charcoal into smaller pieces, about the size of wheat grains. Pour into pillow case and make more if necessary to fill to pillowcase about half way or more. Some dust will fall out – let it. \\nNow, drill or cut two holes big enough to snuggly fit the air intake hose of your A/C unit into the plastic or metal box on the shorter sides. Place the bag of soda ash on one side, the bag of charcoal on the other side. Seal with duct tape generously. Now attach the air intake hoses of your A/C unit on the unit with the air entering the charcoal first, and the soda ash second. Duct tape generously on both ends. \\nWe built this last year when the ash and smoke from local wildfires were choking the air around us. We were supremely comfortable with filtered air. Will it work for chemical weapons? The soda ash is the same ingredient used in gas masks, but I really don’t know. Works great for smoke and ash, and chili cook-off’s, but I have no real data that it will work for WMD’s. Can some experts chime in? Truther \\nTwo easy reasons to understand: Racial Guilt and Desire for Something for Nothing. There you go. saintmatty \\nA very good chance that we will get hit. Major city and who knows where else. Get some food and water together. Might be inside for a few days as chaos occurs in the streets. davidmpark \\nOne of those times a carbine would be handy… Keywee \\n“Why did such a good nation decide to #$%& itself over this bad? We’re so much better than this!” I think that as a nation you became complacent, distracted with trivial “entertainment”. The world banking system got it’s claws back into you after all that hard work by the founding fathers to escape it. Hopefully once enough of your own people are affected by the actions of your government you will rediscover your revolutionary roots. Gay Veteran \\n“…Congress needs to move to stop Obama….” you assume they disagree with him davidmpark \\nI’m hoping they’ll do their job for once. Gay Veteran \\nwe will all be disappointed, because there is NO difference between the 2 parties Ralfine \\nAll people have the government they deserve. Syrin \\nHere’s how this could play out. We invade Syria. It’s a leaping point to go to war with Iran who has already threatened war with Israel if we invade. Obama will sign the UN Small Arms Treaty, and Russian troops have already been training on US soil for over a year to disarm Americans. I believe they will stage some false flag event in FEMA region 3 which has been urgently stockpiling by “no later than October 1″ according to all their requests for supplies. (do a search, they are stockpiling a A ton in FEMA region 3) Martial law will be declared enforced by our militarized polive, some Iranian patsy will be blamed, and they will jump from Syria to Iran. Obama had a behind the scenes meeting with the highest level financial people in the US last week. The last time this happened, they took out gold. I think they will use the war and false flag events to perform a simultaneous engineered collapse of the economy because they know we cannot recover from our debt burden hoping the no information GARY voters will blame the evil Syrians for our economic problems. Just like Nazzzi Germany, we become a dictatorship overnight. davidmpark \\nOkay, I looked it up about the stockpiling for region 3. That makes good sense to concentrate around there for the sake of the powers in DC. They’d want to make sure they don’t have any disruptions in their cocktail parties and lasciviousness. \\nThey stockpiled around the furherbunker during the battle for Berlin. Makes sense to do that sort of thing when they make unpopular and more blatant illegal actions against their own people. K \\nExcellent comment. The idea behind Russian troops was, it would be easier to get them to fire on civilians. I wonder if the puppet masters every gave any thought to the fact, that would cut both ways. K \\nE4B spotted in Turkey yesterday. I have never heard of them deploying them outside the Country before. The Check is in the Mail \\nOver the top but I understand the concern. It is not like the fools in DC have earned any trust. old fart \\nHow can that be after all Zero won the Nobel Peace Prize. xander cross \\nI blame white men who are profiting of the weapons dealing. Of course, all of you will ignore that fact. Smh Jason Mckenzie \\n1st Oct came and went, ya rumour-monger.. K \\nEver since they passed that war on terror resolution in 2001. It seems no President feels they need clearance from anyone. Can this end well? Only if a backdoor agreement has been made with Russia and China. A certain number of missiles fired at certain agreed on targets. In exchange they stick to just stern words. If such an agreement does not exist. Then the first salvo, could easily cause everyone in the area, to bring out their new toys. And that will not end well. A D \\nOIL is naturally occurring – GOD created the earth & everything in it. There is enough OIL in the USA, but the eco-nazi’s and other idiots will not allow them to drill. Just like AIR now carbon is a threat, so many idiots believe all of the LIES trumped up by elites. davidmpark \\n“OIL is naturally occurring…” Yeah, the Abiotic Oil process. We won’t ever run out of oil. Ralfine \\nAny idea why it’s called organic chemistry? Trainwreck Coming Fast \\nThat will change. It is ALL going to change once the fur begins to fly domestically and abroad. Things that will be different: \\n–Even the liberal fools will be begging to drill. But they will not understand that decades of no new refineries means terrifying shortages caused by them. \\n–No more discretionary spending on music, entertainment, parties, etc. Sure, it will occur, but a tenth of what is evident now. The boards, extra houses, luxuries, will no longer be part of life. Maybe not so bad. \\n–Roving bands of gangs and criminals will be put down by law abiding citizens with guns. People will no longer accept crime. Bring back the death penalty and frontier justice. It is coming. The “I was disadvantages” growing up will only get a bullet in the head. The nation will no longer be able to afford and tolerate the rape of society. \\n–Healthcare will be a disaster. Obama and the Left will blame it on the GOP but that will only work for the hardcore remnant of his supporters. The rest of the nation will marvel at its stupidity for not pushing back sooner. But they will realize the system has been so destroyed that it will take years to bring back what we had. \\n–WHERE TO STOP? It is so obvious. Gay Veteran \\nat what cost? yeah you can have all the oil you want here at $500 a barrel Ralfine \\nAnd, to get one barrrel you have to spend 5 barrels in energy. Keywee \\nYay! Someone else who actually gets it! A D \\nAIR, WATER, OIL you name it, the eco-nuts and elitist will do whatever it takes NOT to let a good crisis go to waste.. quoted from OHBOMA thugs. ResilientNews \\none of my local tv stations had a poll on their website if the u.s. should strike Syria and the results were 100% NO. Bill \\nBest poll of many asking the same question shows 25% in favor. Still doesn’t show the idiot in chief is listening to we the “real”people!!! Lennie Pike \\nThe thugs who control the U.S. are allied with those who control China! Birds of a feather (elite Godless fascists) have joined forces for totalitarian worldwide rule!!!) \\nOur industry and gold has been intentionally transferred to China. \\nExpect to see Chinese militery in the U.S. – not Russian – if Russia allows it. clemster \\nThe Russians will never look like the “good guys”. Tatiana Covington \\nIt could be that a coup d’etat will be required. \\nI hope not. GodHelpUs \\nOver amount of years U.S. prospered with the highest public debt. Without wars on it’s territory and so on.. Economy collapse is inevitable. To hold it over, U.S. needs to seed unstability and war in other countries. To keep ourselves stable country, to keep dollar high value (but without gold – dollar is just a paper). We intentonally made that “Arabic spring”, changed management of all those countries. Who didn’t agree – was murdered (like Kaddafi), who did like Egypt – was changed by our man. Now we expect another wave of economical collapse. We NEED to seed fear and distable east. And it’s not Obama! He’s just a puppet.. We made hugest and well trained army with the top weapons on other countries money 😀 But It won’t last forever… Bill \\nIt’s ironic that we have a war brewing as the debt limit comes to a head —–again. Big drop in the 10 yr as $ leave the stock market for the “safety” of bonds. Any guess where the 10 yr will be in 90 days? Tobias Smith'"}, "time": 1742563182.325112}