{"duration": 0.03138375282287598, "input_args": {"text": "'Project Veritas Exposes DNC: Rigging the Election Pt. 3 - Killary Wanted \"Ducks on the Ground\" Project Veritas Action has released the fourth video in a multi-part series that is sending shockwaves through the DNC and the Clinton campaign. The first video explained the dark secrets and the hidden connections and organizations the Clinton campaign uses to incite violence at Trump rallies. The second video exposed a diabolical step-by-step voter fraud strategy discussed by top Democratic operatives and showed one key operative admitting that the Democrats have been rigging elections for fifty years. The third video exposed prohibited communications between Hillary Clinton\\'s campaign, the DNC and the non-profit organization Americans United for Change. This latest video breaks down the process of the long-term investigation. In the effort to prove the credibility of the undercover donor featured in the videos and to keep the investigation going, Project Veritas Action made the decision to donate twenty thousand dollars to Robert Creamer\\'s effort . Project Veritas Action had determined that the benefit of this investigation outweighed the cost. And it did. \"First thing, like I said, thank you for the proposal. And I\\'d like to get the $20,000 across to you. The second call I\\'m going to make here is to my money guy and he\\'s going to get in touch with you and auto wire the funds to you,\" said the PVA journalist. Creamer told the PVA journalist to send the money to Americans United for Change. Shortly after the money was released, the \"donors\" \"niece\" - another Project Veritas Action journalist - was offered an internship with Creamer. In an effort to see how far Creamer would go with the promise of more money, another Project Veritas journalist posing as the donor\\'s money liaison requested a meeting with Creamer. During that meeting, Creamer spoke about connections he had with Obama and Clinton. After the release of the previous Project Veritas Action videos, Hillary Clinton and her staff tried to distance themselves from Robert Creamer. However, Creamer doubled down about connection with the campaign. \"Every morning I am on a call at 10:30 that goes over the message being driven by the campaign headquarters,\" said Creamer. The more money that was promised to Creamer, the more access Project Veritas Action journalists seemed to get. Project Veritas Action\\'s $20,000 investment paid off. The story was solid. Robert Creamer, Scott Foval, Jenna Price from the DNC, Brad Woodhouse from AUFC, Cesar Vargas and others opened the door to their smoke filled rooms of illegal and dirty campaign dealings, as seen in the three previous PVA videos. In an unexpected twist, AUFC president Brad Woodhouse, the recipient of the $20,000, heard that Project Veritas Action was releasing undercover videos exposing AUFC\\'s activities. He told a journalist that AUFC was going to return the twenty thousand dollars. He said it was because they were concerned that it might have been an illegal foreign donation. Project Veritas Action was pleased but wondered why that hadn\\'t been a problem for the month that they had the money. After the former stories were released by Project Veritas Action, Americans United for Change fired Scott Foval and Robert Creamer announced to the DNC that he was stepping down from campaign responsibilities. James O\\'Keefe and Project Veritas Action have filed a complaint with the Federal Elections Commission. Project Veritas Action Fund (AKA Project Veritas Action) was founded by James O\\'Keefe to investigate and expose corruption, dishonesty, self-dealing, waste, fraud and other misconduct.'"}, "time": 1742628440.2319822}