{"duration": 0.15425682067871094, "input_args": {"text": "'Welcome Back to a Bipolar World, Courtesy of a Moscow-Beijing-Tehran Axis \\nAmerica\\'s \\'unipolar moment\\' is over, but the long-awaited \\'multipolar world\\' isn\\'t quite yet here either Originally appeared at Strategic Culture Foundation \\n\\nThe transition in the international order, from a pre-WWI multipolar world to a post-WWII bipolar world, cost humanity a world war involving millions of deaths. The next stage, distinct from the conflicts between the USSR and the US, ended with the fall of the Berlin Wall in 1989, but without the tragedy of direct confrontation. This fundamental historical difference has its own intrinsic logic governing the relationship of forces between powers. The USSR was a country in decline, unable to continue its role on the international stage as the premier anti-hegemonic power. \\nThe transition from a bipolar to a unipolar reality could have had nuclear consequences, but an agreement between the powers avoided this danger. The upshot was an unconditional surrender of the USSR, with catastrophic consequences in economic and cultural terms for the superpower to come to terms with, but at least without the explosion of a large-scale conflict. \\nWith the end of the bipolar model, however, began what some historians declared to be the « end of history »: the transition from a multipolar world, to a bipolar world, to end in a unipolar world. From the point of view of Washington, the story ended with only one global power remaining, thereby granting the United States the power to decide matters for the whole world. \\nThe scenario in which we live today, in terms of international law and the balance of forces, is almost unprecedented in history if looked at in the present context. It is true that the current transition from a unipolar to a multipolar reality is something similar to what has been seen in previous decades, with the transition from British hegemony in the late-nineteenth century to a multipolar situation in the period preceding the two world wars. Nevertheless, resorting to this historical analogy is difficult, given the relative absence of international rules compared to a century ago. Therefore it is difficult to use the earlier transition period to make assumptions about future trends. \\nThe causes of change \\nThe attitude of the US over the last 25 years has been focused completely on the achievement of global hegemony. The dream of having control over every event, in every corner of the world, has ironically led to accelerating the end of America’s unipolar moment. Of course the deep meaning of the word \"control\" can be expanded upon, examining the merits of the cultural, economic and military impositions that result from a constant quest for global domination . \\nThe US has chosen an impassable road that is full of contradictions to justify their rise as a global power. In two decades we have witnessed the dismantling of all the key principles of the balance of power between Russia and the United States, necessitating the change in international relations from unipolar to multipolar. Similarly, the ratio of economic and military power between China and the United States has significantly worsened, culminating in the dangerous dispute over the South China Sea. The abandonment of the Kissinger doctrine governing relations with Beijing, and the failure of the Clinton reset with Moscow, have pushed two global powers, Russia and China, to forge an alliance that allows for a world where there are more powers on the international stage and not just Washington as the central focus of global relations. \\nThe failure of the foreign doctrine of the United States was a direct consequence of the arrogance and the utopia of being able to dominate the planet, seeking to extend indefinitely the unipolar moment and forging a worldwide system culturally and economically based on the will of Washington, reinforced by a power and military posture without precedent. \\nConsequences \\nHad Washington thought more carefully about the consequences of their actions, and thereby employed a more considered strategic vision, it would certainly have opted for different choices. As a demonstration of this, we note Washington’s attitude in the Middle East, the deciding ground for prospects of continued US global hegemony. \\nMuch of Washington’s remaining capacity to influence global decisions is attributable to the dollar and the trading of goods such as oil in that currency. With the appearance of a world with more regional or global powers, it is easy to guess that the rise of the Iranian Republic has consequences for the whole of the Middle East region. The odds are evident that Tehran, culturally, economically and militarily, will be the first regional power. Washington has realized this and has decided to reach an agreement with the Islamic Republic in order to remain relevant in the region and not to be cut off from future agreements. Washington also seeks, in doing so, to counterbalance the situation with her most influential regional allies, Saudi Arabia and Qatar. \\nIt is a strategy that in the Middle East has had a negative impact in the immediate present for Riyadh, Doha, and in some ways even Ankara, who have all opted for an autonomous and interventionist approach in the region without much consultation with Washington. Nevertheless, the choice to include Iran as a dialogue partner for the Middle East balance has allowed Washington to conserve the illusion that in the future it will maintain an important role in regional decisions. This is a decision that has created many problems with historic allies, but Washington hopes, with a view to the future, to have made an appropriate choice. This also explains why so many of the neoconservatives and liberals (the promoters of a prolonged unipolar doctrine, the cause of so many failures ) are clearly opposed to this agreement. \\nWashington and its establishment have opted for a cultural and economic confrontation with Moscow, possibly militarily with Beijing in the South China Sea, in the process impelling the emergence of a multipolar world in which more powers have the ability, by joining together, to resist the will of the greater global power. In fact, it is easier to frame the international balance in a multipolar model that is slowly becoming bipolar. \\nWe consider that Russia and China (and to a lesser extent Iran) do not possess the military capability to successfully oppose American power in a conventional conflict on a grand scale. For this reason, it is easy to understand that shaping a multipolar international order perhaps remains quite optimistic at this time. It is similarly optimistic to maintain a unipolar world order that remains anchored in the illusions of the American elite. \\nReality rather shows us a bipolar world, where the alternative pole to the US is represented by the union and alliances (cultural, economic and military) of Beijing, Moscow and Tehran. And their partnership has resulted in a change in the pattern of international relations. The cause of this union is to be found in the will of the US elites to prolong their unipolar moment. Instead of opting for an agreement with another global power (probably China) and seal the international stage in a realistic model with two poles, facing no real opposition, Washington has exacerbated the differences by pushing countries like Russia, China, Iran and India closer and closer together, forging what currently might be termed a temporary bipolar model of world order. \\nThe certainty is that the future will turn fully into a multipolar model, and this obliges Washington to struggle in every way possible to remain relevant. To date, apart from nuclear agreements, every choice has been counterproductive and wrong. Will Washington’s elites ever learn, or will they eventually become irrelevant?  '"}, "time": 1742564515.6526082}