{"duration": 0.11118102073669434, "input_args": {"text": "'  insist that they are the champions of minorities, yet one oppressed group always seems conspicuously absent from their social media    —   Christian minorities in the Muslim world, like the estimated 26 Coptic Christians who were massacred by a Muslim gunman in Egypt earlier today. [Normally, any allegation of mistreatment of a minority, even those of dubious provenance like 2015’s “Clock Boy” incident, will be met with an instant wave of reflexive   virtue signalling from celebrities on social media.  Yet this strangely does not seem to apply to the Christian minority in the Middle East, the   persecution of whom occurs on a regular basis. It’s not because of any Anglocentrism on Hollywood’s part  —   celebrities regularly present themselves as advocates for oppressed groups in the third world, from Rwandans to refugees from Darfur. So why not Christians? Particularly the Coptic Christians, who have been in the Middle East since the time of Christ and are somewhat similar to Native Americans  —   an ancient people who were sidelined by militarily superior and often brutal colonizers. Listed below are seven celebrities who regularly speak out against the alleged persecution of minorities, including Muslims, refugees, the LGBT community and more. Yet so far, they have said nothing about today’s massacre of Coptic Christians. 1. Katy Perry, Katy Perry, in response to the brutal Muslim attack on fellow songstress Ariana Grande’s concert in Manchester, urged for “barriers and borders” to be removed, and for everyone to “coexist. ” She also worries about the persecution of minorities. Following the election of Donald Trump, she produced a PSA featuring a Muslim woman discussing the internment of   during World War II, warning viewers not to let “history repeat itself. ” A UNICEF goodwill ambassador, Perry also cares about oppression in nonwestern countries. So, as someone who 1) recently saw a friend’s concert attacked by an Islamic extremist, 2) worries about the mistreatment of minorities, and 3) is concerned with oppression in the third world, surely Perry must be alarmed by the massacre of Coptic Christians, by an Islamic extremist, in Egypt. Yet so far, Katy Perry’s feeds on Twitter, Facebook, and Instagram say nothing about the massacre. Maybe she just forgot to have an intern read her the headlines this morning. 2. Bill Nye, The “Science Guy” with a bachelor’s degree in Engineering declares in the title of his new Netflix show that he is going to “Save The World. ” And, true to his word, the show is packed with     crusades, from   climate change to sticking up for the right of such overlooked minorities as “flirty pansexual  . ” One would think that someone who knows of such obscure minorities would have a little time to Save the World from the persecution of religious minorities, but so far, the         has said nothing about today’s massacre of Egyptian Christians. 3. Kumail Nanjiani, One of the most outspoken progressives on social media, the    Muslim comedian has said just about everything. He’s said climate change deniers are worse than Holocaust deniers, he’s accused President Trump of “breeding evil” with his repeatedly blocked proposals on Muslim immigration, and he of course Stood With Ahmed. Nanjiani, who frequently complains about his own condition as a famous   celebrity oppressed Muslim minority, makes it clear that we should speak out against bigotry at every opportunity: We can’t let     be normalized. If something happens, be safe, but let it be known we won’t stand for this.  —   Kumail Nanjiani (@kumailn) November 12, 2016,  That’s why, as a prominent Muslim with a massive platform, it must only be a matter of time before he speaks out against the murderous bigotry currently being faced by Egypt’s Christian minority. Let’s keep waiting  —   it’s bound to happen soon! 4. Meryl Streep  Another vocal progressive, Streep hates Trump so much she used her acceptance speech for the prestigious Cecil B. DeMille lifetime achievement award at the Golden Globes to take shots at the president, suggesting he wants to “kick out foreigners. ” She cares about minorities, like gays, people of color, women, and convicted child rapist Roman Polanski so much that the Human Rights Campaign invited her to speak at their annual gala. Streep has yet to say anything about today’s extraordinary violation of human rights in Egypt. 5. George Takei, George Takei has become Hollywood’s   celebrity for boring, mainstream leftist opinions on gay rights. After the Orlando shootings, when 50 attendees of a gay nightclub were shot by a disciple of Islamic State, Takei immediately penned an   calling for more gun control (as opposed to less Islam). He also used the occasion to attack   Donald Trump. Given that he isn’t willing to call out Islam when they target his own community, it’s perhaps no surprise that he’s said nothing about the Coptic Christians. Six of his eight tweets today have been devoted to criticism of the Trump administration. None mention the attack in Egypt. 6. Lena Dunham, After the election of Donald Trump, Hollywood’s    penned an essay expressing her support for “those in the prison system, those with undocumented American relatives, those who are trans, who are queer, who are people of color, who are Muslim, who are trying to prosecute their abusers” who have “have felt the crushing failure of the system over and over again. ” That’s a lot of minorities she cares about. But unlike Dunham, who had her feelings hurt by the election of Trump, people actually died today in Egypt. Christian minorities brutalized at the hands of Islam, it seems, have yet to make Dunham’s list. 7. J. K Rowling  Harry Potter author J. K Rowling has emerged as one of the most   celebrities on social media following the election. In addition to repeatedly attacking president Trump, Rowling has repeatedly made it clear that she opposes the mistreatment of minorities, even calling attention to allegedly racist social media attacks on obscure academics. She also regularly comments on European politics, urging the British government in 2015 to take in more refugees from the Middle East. If you can’t imagine yourself in one of those boats, you have something missing. They are dying for a life worth living. #refugeeswelcome,  —   J. K. Rowling (@jk_rowling) September 3, 2015,  You would think that an   advocate like Rowling would jump to call attention to the plight of religious minorities in the Middle East. Such an approach might soften the attitudes of conservatives who oppose taking in refugees from those regions. Yet it’s almost 5pm in the U. K, and Rowling has yet to comment on the violent deaths of more than 20 Coptic Christians. An Unfashionable Minority? Credit where credit is due  —   one prominent progressive, Linda Sarsour, has said the terrorists responsible for today’s attack can “rot in an eternal hell. ” May the terrorists rot in an eternal hell. Sending love  solidarity to our Coptic sisters and brothers. #Egypt https:  .   —   Linda Sarsour (@lsarsour) May 26, 2017,  But she seems to be a lone voice amongst prominent   who rarely miss an opportunity to comment on any perceived injustice against minorities, anywhere in the world. Perhaps persecuted Christians are simply not a fashionable minority. You can follow Allum Bokhari on Twitter and add him on Facebook. Email tips and suggestions to abokhari@breitbart. com.'"}, "time": 1742562246.8924086}