{"duration": 0.038272857666015625, "input_args": {"text": "'Topics: Gorilla , London Zoo , waitrose , escaped   \\nA gorilla that escaped from its enclosure at London Zoo made its way into Waitrose to buy Robinsons blackcurrant squash before being returned to his den, a report has found. \\nKumbuka, a western lowland silverback, made a trip to the nearest Waitrose after walking past two different Tescos and a Sainsbury\\'s, according to sightings. \\nThe zoo said the gorilla refuses outright to have anything not bought from a Waitrose store, with exception of a Budgen\\'s if he\\'s in a good mood. \\nIn his report on the breakout, one of the zookeepers suggested that the 29st alpha male would probably after \"some ripe avocados or quinoa\". \\nHe said: \"There were no broken locks, Kumbuka did not smash any windows, he was never \\'on the loose\\' and he was more than likely just after some good-quality high-end essentials like their reasonably priced ironing water at £3.50 a bottle.\" \\n\\'Looks down his nose\\' \\nThe gorilla found the door to his area was unlocked and a second door had yet to be secured shortly after his feeding time at 17:00 BST last Thursday. \\nAfter discovering Kumbuka was missing, the keeper was heard saying \"He has a tendency to look down his nose a bit. He wouldn\\'t be seen dead in a Wilkinsons\", prompting park staff to believe he\\'d be in the local Waitrose or John Lewis. \\nEye witnesses report the animal \"briefly explored the Whole Foods aisle before heading over to the fruit section for some organic bananas\" \\nHe then skipped past the own brand squash and went straight for the full-priced Robinsons. He was discovered \\'having opened and drank five litres of undiluted Robinsons blackcurrant squash, eaten 47 jars of palm oil free peanut butter and holding a basket full of soy and linseed bread\\', the report revealed. \\nIt concluded that the gorilla was always very conscious of where he shops and tries to make ethical choices where he can, even if he is a bit of a sucker for Robinsons squash. \\nKumbuka was returned to his den shortly after being tranquilised. \\nKumbuka arrived in London from Paignton Zoo in Devon in early 2013. Make Alex Jelly\\'s  '"}, "time": 1742628409.1603396}