{"duration": 0.06676316261291504, "input_args": {"text": "'.@seanspicer on Trump’s use of Twitter: “The fact of the matter is that when he tweets he gets results. ” #ThisWeek pic. twitter.  Sunday on ABC’s “This Week,” while defending   Donald Trump’s use of Twitter, the incoming White House press secretary Sean Spicer said,”I think it freaks the mainstream media out that he has this following of over   million people that follow him on social media, that he can have a direct conversation. He doesn’t have to have it funneled through the media. ”  Partial transcript as follows: KARL: So you’re the incoming press secretary and communications director. I’ve got to ask you about what we saw in “The New York Times” last week, a headline about Trump talking about expanding U. S. nuclear ability. But what struck me was the subhead, “Statement on Twitter. ” In the beginning of the second paragraph, “Mr. Trump’s statement in a midafternoon Twitter post. ” Here, big   headlines, generated by a midafternoon Twitter post. Is that what we’re going to see? I mean you’re the press secretary  —   SPICER: Sure. Why not? But  …     KARL: So major policy done via Twitter? SPICER: You know, with all due respect, I think it freaks the mainstream media out that he has this following of over   million people that follow him on social media, that he can have a direct conversation. He doesn’t have to have it funneled through the media. This is the  —   this is going to be  —   business as usual is over, as I’ve said before. There’s a new sheriff in town and he’s going to do things, first and foremost, for the American people  —   KARL: So we’re still going to see a lot of Twitter as president? SPICER: You’re going to see  —   absolutely you’re going to see Twitter. Why wouldn’t  —   KARL: He said he was  —   well he had said on “60 Minutes” that he was going to cut back. SPICER: No. You know what, the fact of the matter is that, when he tweets, he gets results. So whether it’s Twitter, holding a news conference, picking up the phone, having a meeting, he is going to make sure that he continues to fight for the American people every single day. KARL: Bottom line, are you going to have regular White House press briefings, Sean Spicer? SPICER: Absolutely, in some way. You know some of them will be on camera some of them will be off. But absolutely. We understand the importance  —   KARL: So no more daily televised press briefings? SPICER: No, no. No decisions have been made. But we’re looking at every single facet of government and figuring it out. Can we do it better? We’ll sit down with the White House Correspondents Dinner, Correspondents Association. I’ve already had reporters reach out and say, hey, we’ve got some ideas. This isn’t  —   this is about we understand that we have a message to get out and successes to  —   that we want the American people to understand. So we’ll use every tool possible. And, absolutely, we’ll sit down and make sure that, on a daily basis, the press is informed. KARL: And regular presidential press conferences? SPICER: Absolutely. KARL: All right. Sean Spicer, incoming press secretary for the Trump administration, thank you for joining us. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742563646.7394977}