{"duration": 0.18211817741394043, "input_args": {"text": "'Home › POLITICS › CLINTON EMAIL INVESTIGATION HAS SHIFTED THE POLLS SIGNIFICANTLY IN TRUMP’S FAVOR CLINTON EMAIL INVESTIGATION HAS SHIFTED THE POLLS SIGNIFICANTLY IN TRUMP’S FAVOR 4 SHARES \\n[11/1/16] MICHAEL SNYDER -Donald Trump has all the momentum now. Will it be enough to propel him to victory on election day? Trump’s poll numbers were improving even before we learned that the FBI had renewed its investigation into Hillary Clinton’s emails, and the new survey results that came out over the weekend and on Monday make it clear that Clinton’s “certain victory” is not so certain after all. Unless something changes, Americans are going to go to the polls on November 8th with an FBI criminal investigation hanging over the Clinton campaign like an ominous cloud, and that is very good news for Trump. \\nThe Clinton campaign was hoping that this renewed investigation would not “move the needle”, but unfortunately for them that appears not to be the case. Hillary’s unfavorable rating just hit an all-time high , a whopping 45 percent of all Americans believe that this scandal is “worse than Watergate”, and a Rasmussen survey has found that 40 percent of all undecided voters that are leaning toward voting for Hillary Clinton are still open to changing their minds before election day. \\nAnd even before this story broke on Friday, Clinton was having a difficult time getting her voters to the polls. According to the New York Times , early voting among young adults and African-American voters is significantly down compared to 2012, and those are demographic groups that Clinton desperately needs to turn out in large numbers. \\nBut of course the key to winning the election is getting to 270 electoral votes, and poll numbers appear to be shifting in the key swing states that Trump and Clinton both desperately need. For a moment, I would like to examine what the numbers currently look like in some of the most important states… \\nFlorida \\nWithout Florida, Donald Trump has absolutely no chance of winning. This is something that even the Trump campaign has admitted. That is why it was so alarming that most of the polls in October had Hillary Clinton leading in the state. \\nFortunately for Trump, a new survey that was conducted on Sunday shows him leading in Florida by four points . \\nGeorgia \\nGeorgia wasn’t supposed to be a problem. Georgia has traditionally been a deep red state, but polling throughout this election season had shown a very tight race. This had Republicans deeply concerned and the Clinton camp very happy. \\nBut now the momentum has seemingly shifted and the latest poll has Trump up by seven points . \\nNorth Carolina \\nMitt Romney won North Carolina in 2012, and Donald Trump very much needs to win it if he hopes to be triumphant on November 8th. Hillary Clinton was shown to be leading in the eight most recent polls before the email story broke, but in the first major survey conducted afterwards she is now down by two points . \\nOhio \\nNo Republican has ever won the presidency without Ohio, and Trump knows how important it is to his chances. The three most recent polls conducted before the FBI renewed the investigation into Hillary Clinton’s emails all showed a tie, but now the very first survey conducted afterwards shows Trump up by five points . \\nColorado \\nHillary Clinton has consistently been in the lead in Colorado throughout this campaign, and most experts didn’t give Trump much of a chance in the state, but the latest survey shows that Clinton’s lead has been whittled down to just one point . \\nArizona \\nA survey that was conducted in mid-October showed Clinton having a five point lead in John McCain’s home state, but now the latest major poll has Trump up by two points . \\nNevada \\nOne of the most important swing states out west is Nevada, and most surveys showed Hillary Clinton with a strong lead throughout the month of October. Unfortunately for her, a poll that was conducted on Sunday shows Donald Trump with a four point lead . \\nClearly Trump has the momentum at this point, and it will be very interesting to see how the numbers change over the next few days. \\nAnd as we learn more about what is in these newly discovered emails, will her fellow Democrats stick with her? Already, some are publicly wavering. The following example comes from WND … \\nLongtime Clinton confidante and former Democratic pollster Doug Schoen told Fox News the newly renewed FBI investigation into Hillary Clinton’s private email server is forcing him to “reassess” his support for the Democratic nominee for president. \\nSchoen, a Fox News contributor, made the comments to host Harris Faulkner during a live television appearance Sunday night on “Fox Report Weekend.” \\nPublic opinion is shifting quickly, but the bad news for Trump is that more than 23 million Americans have already voted. So millions upon millions of Americans cast their votes before they even learned of this new FBI investigation. If the race is very close, that could end up making the difference. \\nAnd of course the race could dramatically change once again if the FBI comes to some sort of resolution about these new emails prior to November 8th. On Monday, CNN reported that a resolution before election day did not appear to be likely… \\nFBI officials are unlikely to finish their review of new emails potentially related to its investigation into Hillary Clinton’s private server before the November 8 election. \\nThe initial work of cataloging top Clinton aide Huma Abedin’s emails found on her estranged husband Anthony Weiner’s laptop could be done in the next few days, US law enforcement officials told CNN. \\nBut the investigators are expected to spend more time doing other work, including likely working with other federal agencies to determine what — if any — classified materials are in the emails. This makes it unlikely there will be a resolution prior to the election. \\nHowever, late on Monday evening the Drudge Report reported that the L.A. Times has learned that investigators may have a “preliminary assessment” completed “in coming days”… \\nLA TIMES TUESDAY: FBI Investigators had planned to conduct new email review over several weeks. It now hopes to complete ‘preliminary assessment’ in coming days, but agency officials have not decided how, or whether, they will disclose results publicly… Developing… \\nWhether good or bad, I do believe that the American people deserve to hear something conclusive about these emails before November 8th. \\nIf nothing is found to implicate Clinton, the American people should be told that. \\nAnd if evidence of very serious crimes is discovered, there is no way in the world that should be held back until after the election. \\nEven if it throws the election into complete and utter chaos , the American people deserve to know the truth. \\nBut will we get it? \\nStay tuned, because I think that this is going to be a crazy week. Post navigation'"}, "time": 1742564264.420736}