{"duration": 0.048787832260131836, "input_args": {"text": "'Get short URL 0 0 0 0 White House spokesperson Josh Earnest said that the outgoing president and the incoming president of the United States will work effectively together to ensure a seamless transition. © AP Photo/ Julio Cortez 2016 US Presidential Election Costs May Exceed Record $6.6Bln WASHINGTON (Sputnik) — Despite rhetoric used in the current US presidential election, Americans should be confident in the process and that there will be a peaceful transition of power, White House spokesperson Josh Earnest said in a press briefing on Wednesday. \"The American people should draw some confidence from the idea that we can engage in a vigorous debate in this country, and then when the votes are tallied… the outgoing president and the incoming president will work effectively together to ensure a seamless transition,\" Earnest stated. \\nThe 2016 campaign between US presidential candidates Hillary Clinton and Donald Trump has been marked by hostile rhetoric and personal insults. \\nAdditionally, Trump said in the third and final presidential debate on October 19 that he would first look at the election result before deciding whether to accept it. © REUTERS/ Mike Segar Could Trump Be Right Just This Once? US Voters Concerned Over Election Fraud The comment prompted concerns among commentators that Trump would undermine the peaceful transfer of power that is a hallmark of US elections.\\nThe White House later said Obama would personally escort Trump to the US Capitol for his inauguration if the Republican is elected president. \\nTrump, but also numerous other critics, have claimed that the election is rigged and pointed to failures of the US election system to prevent voter fraud. Some of the criticisms include the lack of mechanism to verify that individuals are legally entitled to vote as well as to keep people from voting more than once. \\nMoreover, critics have raised the issue of voting machines being highly vulnerable to manipulation and hacking. ...'"}, "time": 1742562006.7015476}