{"duration": 0.15731453895568848, "input_args": {"text": "'  How “The Camp Of The Saints” Predicted The Migrant Destruction Of Europe How “The Camp Of The Saints” Predicted The Migrant Destruction Of Europe \\nDaryush \"Roosh\" Valizadeh created ROK in October 2012. You can visit his blog at RooshV.com or follow him on Twitter and Facebook RSS November 16, 2016 Books \\nWritten in 1973, The Camp Of The Saints is a novel by Jean Raspail that predicted the European migrant crisis forty years before it began, not only the actual invasion by brown migrants but also the leftist arguments that enabled it, which ushered Europe to its doom. \\nThe story follows a one-million strong flotilla of Indians who are slowly making their way to Europe. The leaders and people of Europe have decided not to stop their arrival. Light on action, the book focuses on the mood of the pending arrival, particularly how Europeans were eager to cuck themselves into oblivion. \\nAfter all your help—all the seeds, and drugs, and technology—[migrants] found it so much simpler just to say, ‘Here’s my son, here’s my daughter. Take them. Take me. Take us all to your country.’ And the idea caught on. You thought it was fine. You encouraged it, organized it. But now it’s too big, now it’s out of your hands. It’s a flood. A deluge. And it’s out of control. […] \\nYou’ve gone and worked up a race problem out of whole cloth, right in the heart of the white world, just to destroy it. That’s what you’re after. You want to destroy our world, our whole way of life. \\nRaspail understood how the media whips the public into feeling immense guilt as a mechanism to introduce non-white migrants. Well before the globalist view on migration and equality was elucidated, Raspail was steps ahead in predicting what the result of it would be, as if he was reading into a crystal ball. He even knew that migrants would bring diseases like tuberculosis . \\nAnd all at once whole sections of New York are deserted, a score of American cities watch the flight to the suburbs—and half the historic Paris pavement too—American tots in their integrated schools fall five years behind, tubercular Gauls flee in droves from our open-air clinics. … Tally-ho! Tally-ho! Just listen to that battering ram smash at the southern gate! \\nThe centuries-long segregation of the first and third-world brought great complacency upon Europe. No one could really get a grasp of what was in store once the third-world reached critical mass and started invading the West. \\n“I can tell,” Vilsberg continued, “that you really don’t believe how serious the situation is. After all, we lived side by side with the Third World, convinced that our hermetic coexistence, our global segregation, would last forever. What a deadly illusion! Now we see that the Third World is a great unbridled mass, obeying only those impulsive urges that well up when millions of hapless wills come together in the grip of despair. \\nIn a bittersweet scene, one of the prominent media leftists goes out with his wife to celebrate the arrival of the flotilla with joyous Africans. Towards the end of the party, his wife gets brutally raped by them and he eventually dies in sorrow. The horde’s arrival suddenly awakened all the immigrants already in the country into asserting themselves. They began stealing directly from the native citizens by attacking their “white privilege.” \\nNow, it’s a known fact that racism comes in two forms: that practiced by whites—heinous and inexcusable, whatever its motives—and that practiced by blacks——quite justified, whatever its excesses, since it’s merely the expression of a righteous revenge, and it’s up to the whites to be patient and understanding. \\nWhat drives the maniacal leftist? Raspail believes it’s a suicide mechanism, likely activated by a human organism void of spirit and with no reason to endure a cosmopolitan existence. Attempting to destroy its host culture is an indirect way of killing itself. \\nWhenever the pop tunes would lose their blaring charm, there was nothing left but to let oneself drown in the sticky-sweet syrup of human misery and despair, set to music of sorts, that one refuge of yearning and unfulfilled souls that had learned nothing else. It never occurred to any of them to measure that notion of misery against the past, or against their own well-being. For them it was a drug, and they needed to shoot up a good strong dose to keep themselves going, like addicts and their heroin. The fact that it was often hard to come by close to home made very little difference. Nothing stops an addict when he has to have his fix, and poisons like that are easy to import. There’s never a lack of pushers. Besides, modern man has always had, tucked away in the back of his mind, that singular longing for total destruction, sole cure for the boredom and anguish that consume him. \\nThe book even predicted a cucked Catholic Church. Raspail knew that every institution had to be on board with Europe’s destruction for the third-world invasion to proceed seamlessly. \\nI came south like a lot of other priests, father, to hail what I thought would be mankind’s redemption. To welcome the million Christs on board those ships, who would rise up, reborn, and signal the dawn of a just, new day. \\nThe European women who welcomed the refugees became whores for them. If you think this is too extreme, consider that European women are getting raped by migrants today but not reporting the crime , yet if a white man so much as brushes past them, he’s accused of assault . \\nShe died in Nice, in a whorehouse for Hindus, disgusted with everything in general and herself in particular. At the time, each refugee quarter had its stock of white women, all free for the taking. And perfectly legal. […] \\nYes, the Third World had started to overflow its banks, and the West was its sewer. \\nRaspail even predicted the fact that the media would elevant the interracial couplings of white women and the invaders. We saw something similar recently when the German government sponsored sex workshops for migrants on how to fornicate with German girls. \\nRalph Ginzburg, the famous American publisher, had printed a series of photos in his magazine Eros, which had caused not a little ink to be spilled. They showed an interracial couple—white woman, black man—in various stages of nude embrace. With a caption that read as follows: “Tomorrow these couples will be recognized as the pioneers of an enlightened age, in which prejudice will be dead and the only race will be the human race.” \\nThe fleet made landfall in France. The French, impotent to do the right thing to save their country, tripped head first into spreading the welcome mat (they actually competed with each other to see who would be the most welcoming). You can imagine the result when one million wretches made landfall in a country they cared nothing about. The new social justice government that rose forth catered to the invaders more than the French, similar to what we already see in Western European nations. \\nIn war, the real enemy is always behind the lines. Never in front of you, never among you. Always at your back. That’s something every soldier knows. In every army, since the world began. And plenty of times they’ve been tempted to turn their backs on the enemy—the so-called enemy, that is—and give it to the real one, once and for all. […] \\nWhen freedom expands to mean freedom of instinct and social destruction, then freedom is dead. \\nThe book itself wasn’t my style of storytelling. Raspail made numerous detours and long-winded soliloquies that took away from the action in favor of creating accurate character portrayals. It’s more of a mood novel than one that moved forward at an exciting pace. The only flaw is that it didn’t predict the rise of an alternative media that would sound the alarm bell. Even though an active invasion is taking place today, the anti-migrant side is far stronger than what’s portrayed in the book. \\nThe Camp Of The Saints was a prophetic story that showed how the migrants themselves weren’t the only cause of Europe’s destruction—leftists played the largest role in ripping apart the country before their arrival, a fact that many of us already know too well. Nov 16, 2016 Roosh Valizadeh'"}, "time": 1742563858.5630167}