{"duration": 0.07776713371276855, "input_args": {"text": "'A Texas Republican congressman told Breitbart News during a   interview in his Capitol Hill office that his two bills now under consideration by the Senate are critical to draining the Washington swamp and taming    federal regulators. [“What has changed is that now the circumstances have changed and the impossible has now become possible,” said Rep John Ratcliffe, who serves on both his chamber’s Judiciary and Homeland Security committees.  The Texas congressman refiled two bills  —   the All Economic Regulations are Transparent or ALERT Act, and the Separation of Powers Restoration Act or SOPRA  —   from last session, the 114th Congress. The bills passed the House on its first day in this new session and are now awaiting consideration by the Senate as part of a larger bill, sponsored by Judiciary Committee Chairman Rep. Robert Goodlatte (R. .)  —   H. R. 5, Regulatory Accountability Act of 2017, which passed the House Jan. 11,    with five Democrats joining the majority. “The historic election of Donald Trump this November sent a clear message to Washington that the American people don’t want eight more years of the same and Congress owes it to them to deliver on this mandate,” Ratcliffe said. “That’s why  —   right off the bat  —   I reintroduced two key pieces of legislation that will help heal our nation from the damage done by the immense regulatory overreach imposed under President Obama’s watch. ” The ALERT Act blocks bureaucrats from implementing federal regulations without first providing the public with detailed information for at least six months before they go into effect. Under current law, federal agencies are required to release an update twice a year on the regulations being developed by federal agencies —  but, in the Obama administration, many of the updates were late, if ever issued at all. SOPRA takes on one of the most important Supreme Court decisions to buttress the regulatory state, the Chevron decision, the 1984 ruling that created “Chevron Deference,” a   standard by which federal courts are compelled to defer to how a federal agency chooses to interpret a federal regulation. What began in 1984 as a win for President Ronald Reagan, who successfully defended his administration’s interpretation of the Clean Air Act  —   which allowed Chevron to expand a refinery without having to apply for new permits, as if it was a new plant  —   grew into a chèque en blanc for federal regulators throughout the government. The congressman said SOPRA seeks to restore three   branches of government by abolishing the doctrine that has often enabled administrative agencies to interpret laws to mean whatever they want. “Regardless of what my tenure is in Congress, I don’t know how long I’ll be here, but I am confident that the Separation of Powers Restoration Act will be the most important bill that I ever file. ” Ratcliffe said he discussed SOPRA and Chevron Deference with Trump during the campaign, when the two men had a private conversation at an Oct 11 North Dallas fundraiser. “I said: ‘Mr. Trump, when you get elected, I’ve got one bill in particular that I’m anxious to get to your desk, I think you’re really going to like it,” he said. “Then, we talked about it for five minutes. ” In their short conversation before Trump spoke to his supporters at the Lincoln Center Hilton hotel, the congressman said he spelled out how SOPRA would rebalance the relationship between regulators, the courts, and Congress. “He certainly understood the concept and the impact  —   and was not just receptive to it, but said, ‘I’m excited by the opportunity for something like that become law.’ He actually sort of extended the conversation  —   he was very engaged about the the specifics, once mentioned to him  —   he was like, ‘Tell me more,’ but I didn’t take that as a promise or anything” On the campaign trail, the president often spoke about the way American individuals and businesses are being strangled by an expanding federal government, Ratcliffe said. A few days after the election, Speaker Paul Ryan (R. .) reached out to Ratcliffe about SOPRA and getting it to a vote early in the new session.  SOPRA was already a central plank of the speaker’s “Better Way” agenda, and GOP congressmen and candidates campaigned on the issue in their own states. Ratcliffe said a great example of how Trump in the White House changes the dynamics on Capitol Hill is that the same week in the last session that the House passed SOPRA, President Barack Obama issued a veto statement that was enough to wave off the Senate from taking up a bill. The congressman said that with Obama in the White House, so many bills brought up and passed in the House, like the ALERT Act and SOPRA, became what are known on Capitol Hill as “messaging bills. ” These bills are useful for forcing people to go on the record for or against an issue, but everyone knows they will never actually become law. Before the bills sent the message to the voters, “This is what Republicans stand for and what we would do if we had a Republican president  —   well, now, that’s the opportunity at hand,” he said. “Hillary Clinton promised very much the same as President Obama delivered  —    essentially, a third term, so bills like these would very likely has been    in the 115th Congress if she won. ” “Trump winning?” he said. “This is what I mean by the ‘impossible now becomes possible. ’” Now House conservatives have an ally in the White House, he said. “I am so excited about what can be done,” he added. “The fact that there is a willing partner at 1600 Pennsylvania Ave. will allow essentially the same bills to have a different trajectory. ”'"}, "time": 1742563965.6063673}