{"duration": 0.07113504409790039, "input_args": {"text": "'Twitter India suspends account that hadn’t posted even one tweet on demonetisation Posted on Tweet \\nTwitter India has suspended an account for violating its terms of use. The decision was taken by the social networking company after it couldn’t find a single tweet on demonetization from the handle. \\nEver since the government has imposed a ban on currency notes of higher denomination, every single individual has tweeted about how it’s going to impact our economy. Some tweeted in favor of the decision while the rest criticized it. But strangely, the user of the suspicious account did not tweet anything on the burning issue. A further probe revealed that the same user avoided other issues in the past as well, like intolerance, odd-even formula, or even porn ban when the whole nation came together as one to protest against the ban. Twitter had no option but to label this account as a bot and delete it. \\nSpeaking to The Unreal Times , Rajesh Bhalla, the owner of the account, said, “I did not realize a little negligence on my part would cost me my account.” \\n“But why did you do this? You had a Twitter account for heaven’s sake! As a responsible citizen you should’ve voiced your opinion. Why do we have Twitter accounts for?” we sought a clarification from the offender. \\n“I don’t know. I don’t have much knowledge of Indian economy.” \\n“You don’t have to be an economist to understand if the bank queues are long. Many explained the long-term impacts of demonetization on our GDP with graphs and pie-charts, including those who write movie reviews. You could’ve at least tweeted about your own experience, or just retweeted a random tweet of Arvind Kejriwal, because that’s all he has been tweeting about for the past few days.” \\n“Yes but I don’t follow politicians.” \\n“What! Whom do you follow then? Barkha Dutt, Rajdeep Sardesai, Sagarika Ghose?” \\n“No, Salman Khan, Virat Kohli,…” \\n“Oh, so you retweet ‘Hi’ while completely ignoring the intellectuals on Twitter who enlighten us on larger issue.” \\n“Like?” \\n“Like…umm, why Hindu festivals are better than Muslim festivals or vice versa.” \\n“Oh ok.” \\n“So what would you do without a Twitter account now? Your life is over.” \\n“Don’t know. Maybe I will go home and watch Bigg Boss.” \\n“Shame! You are a disgrace to the nation. Go and watch your stupid reality show.” \\n“Ok, can I go now? The show will start in half an hour.” \\n“Goodness gracious, really? Let me get home right away!” \\nMeanwhile, the incident has shaken Twitter India and it has now decided to periodically review accounts using human judgment and technology. Sources revealed that it will suspend more accounts on similar grounds in future.'"}, "time": 1742561981.3427002}