{"duration": 0.10472750663757324, "input_args": {"text": "'Stupid Stuff, Late-2016 Edition by Sprott Money - Oct 26, 2016 11:03 AM \\nDebts implode, stocks plunge, economies contract, financial assets fall out of favor, and real things start attracting capital. And the people who caused the mess go quiet for a while. by williambanzai7 - Oct 26, 2016 10:39 AM \\nWar is Peace... Bullion Banks \"pass the parcel\" on El Salvador’s Gold Reserves by BullionStar - Oct 26, 2016 12:30 AM \\nGold lending by central banks to bullion banks is one of the most opaque areas of the gold market. Bank of England Asks UK Banks To Detail Their Exposure To Deutsche And Italian Banks Oct 26, 2016 2:13 PM 0 SHARES \\nIn what may or may not be a coincidence, just hours after Bloomberg reported that DB launched a probe into whether it \"misstated\" derivatives, moments ago the FT reported that the Bank of England is seeking details from large British banks on their current exposure to Deutsche Bank and some of the biggest Italian banks, including Monte dei Paschi , \"amid mounting market jitters over the health of Europe’s financial sector.\" \\nThe FT notes that the request was made in recent weeks by the BoE’s Prudential Regulation Authority as investors sold off Deutsche and Monte dei Paschi, both of which have been the subject of scrutiny over their capital levels. Supervisors worldwide have attempted to curtail the links between large institutions since the 2008 banking crisis, when the collapse of Lehman Brothers and other big groups threatened to drag down the entire global financial system. \\nWhile the PRA regularly speaks to banks about their exposures, particularly to any lender that might be facing difficulty, the BoE’s recent intervention is a sign of continued nervousness among regulators that the interconnectedness of Europe’s largest banks could harm otherwise healthy groups if one of the weakest links were to fall into crisis. \\nSom more details: \\nNormally, exposures to other financial institutions are not disclosed to regulators unless they are particularly large or as part of annual stress tests. That forced the BoE to ask for the latest snapshot of the big UK banks’ exposures to their German and Italian rivals as those groups came under market attack. Banks can be exposed to one another directly through lending or derivatives but indirect exposures — such as lending to a counterparty of a bank in trouble — also need to be considered. \\n\\nGlobal rules cap the amount that one bank can hold in another to 25 per cent of the first bank’s capital, while anything above 10 per cent must be disclosed to regulators. Smaller holdings are therefore harder for supervisors to spot. \\n\\nPaul Sharma, a former PRA official now a consultant at Alvarez & Marsal, said large UK banks were now able to monitor their direct exposure to troubled banks on a “near real-time” basis but that market turmoil could complicate the picture. \\nThe FT also writes that British regulators are particularly anxious about the impact of litigation costs on Deutsche’s already weak profitability and that large piles of non-performing loans could have a similarly corrosive impact on Italian banks . \\nAs we pointed out earlier, Germany’s biggest bank still faces serious doubts on whether it will need to raise billions of euros of extra capital and slash costs drastically to strengthen its balance sheet and boost profits. Among the entities rumored to provide backstop capital are various middle-eastern funds as well as rumored Chinese investors. \\nNormally, similar reports of heightened regulatory scrutiny would lead to a brike selling in any named bank; however perhaps because Deutsche Bank has already been through hell and back over the past few months, this latest news will hardly come as a shock to investors. \\nMeanwhile, Deutsche Bank is set to announce earnings tomorrow, in which it is expected to announce a lower net loss of around €610 million, versus a massive €6 billion loss one year ago, much of which stemmed from write-downs on investment-banking and other assets. At this time last year, Deutsche Bank was kicking off its new, multi-year overhaul under Chief Executive John Cryan. This quarter\\'s loss is expected to be largely due to another large major litigation provision ahead of a potential settlement with the DoJ. Analysts are split on precisely how much the bank will set aside, but their forecasts range from €250m to €1.5bn according to a consensus report compiled by the bank. Analysts also expect third-quarter revenues to be €7.1 billion, according to a consensus of 17 analysts\\' estimates compiled by the bank. That compares with €7.3 billion a year ago. \\nProlonged uncertainty around Deutsche Bank\\'s capital position-exacerbated by the litigation questions--have fueled persistent questions about whether the lender might be forced to sell shares, shed businesses it has planned to keep, or accelerate cost-cutting plans. \\nKeys to Deutsche Bank\\'s plans for building its capital cushion include divesting its German retail-banking division called Postbank. That plan has proved more difficult than expected, and investors want to know the latest-especially if executives have changed their minds. Investors will also want to know when the bank is going to see the cash it is expecting from selling its roughly 20% stake in Chinese bank Hua Xia. The roughly $4 billion deal was announced in December 2015, but the proceeds have taken longer to arrive than executives expected. \\nMeanwhile, in an attempt to cut costs, DB has undergone on a major layoff spree and, as reported yesterday, is considering paying banker bonuses in compensation other than cash.'"}, "time": 1742564174.0429025}