{"duration": 0.10113787651062012, "input_args": {"text": "'BRASÍLIA  —   The wall, nearly a mile of corrugated metal, plunges down the center of the majestic lawn that faces Brazil’s National Congress, the modernist icon designed by Oscar Niemeyer. It was hastily erected in recent days, and is meant to separate the hundreds of thousands of protesters expected to descend on Brasília, the Brazilian capital, this weekend as members of Congress vote on whether to begin impeachment proceedings against President Dilma Rousseff. The left side of the wall, facing Congress, is reserved for supporters of the   Ms. Rousseff, the right for people demanding her ouster. “It’s not pretty, but the wall is necessary to keep the two sides from tearing each other apart,” a    police officer in    riot gear said as she stood in the searing sun on Friday afternoon. “When these protesters come together, they behave like soccer hooligans. ” Brazilian politics is a blood sport in the best of times, but the battle over Ms. Rousseff’s impeachment is inflaming passions as never before, cleaving families, turning friends into enemies and transforming children into unwitting surrogates for the warring sides. Social media has been flooded with venom, and those who claim to be neutral often find themselves accused of treachery. On the streets of Brazilian cities, political rallies organized by one side or the other have been devolving into shouting matches or worse, including a brawl last month in São Paulo that left a former city councilor with a bloody lip. “I don’t think this will turn into a civil war because you’d have to be stupid to fight for these politicians, but people are very stressed right now,” said Rafael Alcadipani da Silveira, 39, a professor of organizational studies at Fundação Getúlio Vargas, one of the country’s top universities. “I’ve never seen things this bad. ” Political passions have turned ordinary sartorial decisions into perceived acts of provocation. Lauana de Lima Oliveira, 22, a saleswoman from São Paulo, recalled a recent day when she decided to go to work in a red tank top. Red is the color associated with Ms. Rousseff’s Workers’ Party. As she rode in a crowded subway car, several passengers began to elbow her while hissing “petralha,” a pejorative for party stalwarts. Ms. de Lima Oliveira, who said she was agnostic on the impeachment drive, was stunned. “People have become like horses that wear blinders so they can’t see anything on either side of them,” she said. “Red happens to be my favorite color, and I’m not going to stop wearing it. ” In the southern city of Porto Alegre, Ariane Leitão, a surrogate councilwoman with the Workers’ Party, filed a formal complaint against her longtime pediatrician who, citing Ms. Leitão’s party affiliation, abruptly cut off ties. “Given all that has happened,” the doctor wrote to her, according to the newspaper Folha de S. Paulo. “I am not in the position to treat your son. ” Most alarming, experts say, is the extent to which the political maelstrom has affected those too young to vote. Last month, students at a private school in São Paulo reportedly terrorized a    boy after he showed up to class wearing a red shirt emblazoned with the Swiss flag  —   a gesture of neutrality, according to his father, who discussed the episode on Facebook in a posting shared more than 4, 500 times. School officials say many children have been parroting the caustic expressions they hear at home, and teachers at one school in São Paulo were alarmed when a child drew a picture of Ms. Rousseff hanging by a noose. Ilana Katz, a psychoanalyst who works with children, said she was worried that many young people were learning intolerance from their parents, and that it is acceptable to express disagreements through aggression. “It’s this idea that there is only one way to live, and that those who live differently need to be eliminated,” she said. “We should be teaching the opposite of that. ” For   the fallout has been even more pronounced. Among urban professionals, it’s common to hear stories about relationships that have been shattered by the mounting political warfare. Fátima Nobre, 57, an advertising executive, said a neighbor threw her out of his apartment during lunch a few weeks ago when she expressed support for Ms. Rousseff’s impeachment. “It was as if he was channeling Dilma’s spirit, like he had turned into the devil,” she said, referring to the president by her first name. “I don’t want to be friends with a person like that. ” The most searing rancor often finds expression on Facebook, where Brazilians’ postings about pets and food have been almost entirely supplanted by political shouting matches. Andressa Umeki, 34, a journalist, said a verbal imbroglio on Facebook ended her relationship with a cousin who used to shower her with words of affection. After Ms. Umeki publicly cast her lot with the opposition seeking impeachment, the cousin unfriended her. “We used to speak by phone but not anymore,” she added. Alarmed by the surge in social strife, some Brazilians have taken a hard line on political chatter. Tarciano André Barbosa, 40, a tech analyst in São Paulo, said he had to warn his    about cracking political jokes during his daughter’s recent birthday party. “You see people on TV in the Middle East throwing bombs at one another, and here we are fighting, too, though in a different way,” he said. “People have become so extremist. It’s absurd, and in the end this will pass, but relationships can’t be lost over ignorance. ” Though it sometimes feels as if all of Brazilian society is consumed by the machinations taking place in Brasília, those who study the growing polarization say much of the fury is confined to older,   professionals. Pablo Ortellado, a professor at the University of São Paulo who studies protest movements in Brazil, said a recent survey he conducted showed that   Brazilians and people under 35 had largely stayed away from the political rallies that were roiling many cities. “Even I was surprised by the results because it sometimes seems that these protests are affecting all of society,” he said. His hypothesis? Because educated, older Brazilians came of age when the Workers’ Party was battling the dictatorship that ruled Brazil until the   they are more invested in the outcome of the current political struggle. “Either they are still enthusiastic for the party or they feel betrayed by the party or they never liked it,” Mr. Ortellado said, adding that he felt optimistic that younger Brazilians would one day be less dogmatic about party politics. “It points to a future, perhaps 10 years from now, when we can work out our political differences in another way. ” Even at the wall that cleaves the national mall, such levelheaded pragmatism was not hard to find. On Friday afternoon, two colleagues from the Ministry of Health spent their lunch break taking photos of each other amid a phalanx of riot police. The men, Leonardo Ferreira de Almeida, 28, and Wanderson Gontijo, 38, are on opposite sides in the impeachment debate  —   and acknowledged spending way too much time at work talking politics  —   but they said their discussions rarely turned venomous. “The way I see it, democracy is an opportunity to have different opinions but to not be blind to the weaknesses of your argument,” said Mr. Almeida, a social policy analyst at the ministry. Mr. Gontijo, a technology specialist, nodded in agreement and then looked at the wall, which was already festooned with posters comparing it to the Berlin Wall. “This is a shame because it doesn’t represent democracy,” he said. With that, the men threw their arms around each other, smiled broadly and posed for one more photograph.'"}, "time": 1742563010.559228}