{"duration": 0.04979443550109863, "input_args": {"text": "'Comedian Dave Chappelle’s highly anticipated   comedy comeback has sparked accusations of homophobia. [The comedian’s new Netflix specials, The Age of Spin: Live at the Hollywood Palladium and Deep in the Heart of Texas: Live at Austin City Limits, include jokes about homosexuality that have some social media users outraged.  One punchline that apparently rubbed fans the wrong way, according to at least one report, involved prison inmates performing oral sex: “L. G. B. T. Q?! I was like what the f*ck is the Q? Does that even make sense, Q? Turns out Q is like the vowels, that sh*t is sometimes ‘Y’. It’s for gay dudes that don’t really know they’re gay. you know what I mean. like prison f*gs who are like: “What I’m not gay n***a I’m just sucking these d*cks to pass the time. ” The former Comedy Central star also cracked jokes about Caitlyn Jenner and transgender people. “Whenever I see one of them Ts on the street I’m like ‘I don’t mind them but man I miss Bruce,’” he said to laughter from the audience. “I knew before you guys knew,” he says of Jenner’s sexuality. “I heard things on the street in Hollywood, you know you used to be out, see people: ‘Hey what’s up Kanye, why the long face?’ ‘N*gaa you’ll see, I’ve got two mother in laws now. ’” Outrage on social media over Chappelle’s jokes came swiftly: Dave Chappelle is a funny dude, but that homophobic and transphobic nonsense just derailed the whole thing for me. Major bummer.  —   KeenAnvil (@keenanvil) March 22, 2017,  Lots of weird, disappointing   in the Dave Chappelle Netflix tbqh,  —   Soma🌹 (@darkroomdoor) March 22, 2017,  But Chappelle’s material was homophobic and transphobic and involved rape culture. I’ve grown too much not to speak up about it now.  —   April (@ReignOfApril) March 22, 2017,  You can find Dave Chappelle funny and still say his homophobic behavior isn’t okay (as someone who has paid to see him, I would know)  —   ¯_( ツ) ¯ (@morganslegit) March 22, 2017,  Chappelle, for his part, had warned audiences during his special, saying “Ladies and gentleman, man the f*ck up or you’re not going to make it through this show. ” And some Twitter users downplayed the idea that the comedian’s set was offensive. Good lord people saying Dave Chappelle was trans or homophobic are fucking reaching. Does everyone just desperately need someone to hate on?  —   Angry CanadianGinger (@Weatherbee79) March 22, 2017,  Dave Chappelle’s comedy is refreshing.. I miss people saying whatever they want.  —   Sean The Triggerer (@SeanTheTerrible) March 22, 2017,  The Chappelle complaints kinda make me glad the greats like Pryor and Carlin never did a standup in the social media era.  —   Suge Night Shyamalan (@B_Effin_G) March 22, 2017,  Chappelle’s new comedy specials debuted on Netflix March 21, and a third special is slated for release on the streaming platform later this year.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561824.1925669}