{"duration": 0.13672184944152832, "input_args": {"text": "'Not only did the ancient Hopi believe their Gods inhabited the inner parts of the Earth, they also depicted mysterious Ant-like beings and flying shields thousands of years ago. \\n\\nInterestingly, their legends also speak of a great flood which is a clear parallel to ancient Sumerian legends of the Great Flood .\\n\\n‘Hopituh Shi-nu-mu’ is the name that one of the Native American tribes is called and means “peaceful people.” \\n\\nThe history of the ancient Hopi goes back thousands of years and makes them one of the oldest cultures in the world.\\n\\n\\nUnlike other mythologies of different cultures which speak of gods that descended from the heavens, in the ancient legends of the Hopi , a different story is told, speaking of mighty gods who reside in the center of the Earth.\\n\\nBut who were they? In a similar way, nearly all pre-Columbian cultures just like the Hopi believe that one day, not too far away, the gods who have shaped human culture will come back to Earth.\\n\\nThey have always lived according to the teachings that were given to them by Masauwu, the Master of the Fourth World, where ethical concepts are deeply rooted in their culture.\\n\\nHowever, contrary to many other mythologies that are widespread around thew globe, the Hopi believe that their gods do not live in the infinite spaces of the cosmos, but live in the heart of the Earth, conveying the idea of a hollow earth existing right below our feet.\\n\\nThe ancient Hopi speak of their deities as ‘ant men.’ In fact, some of the petroglyphs found near Mishongnovi, Arizona, created by the ancient Hopi depict the enigmatic beings with antennas’ offering an idea of how these strange ant-men looked like.\\n\\n\\nAccording to the mythology of the Hopi, at the beginning of time, Taoiwa, the Creator, created Sotuknang, his nephew, giving him the task of creating nine universes or worlds: one for Taiowa, one for him and the other seven for the overabundance of life. \\n\\nIn a cyclical conception of time, in a similar way to Aztec mythology, these worlds would continue cyclically.\\n\\nThe mythology tells that story that the first three worlds, Tokpela, Tokpa, and Kuskurza have already been inhabited and subsequently destroyed due to corruption and wickedness of men. \\n\\nThe Hopi speak that the end of each cycle is marked by the return of the gods, and announced by the appearance of the Blue Kachina Star the sign of the ‘Day of Purification,” in which the old world is destroyed, and a new one begins.\\n\\nEach time one of the worlds is destroyed, the Hopi, the faithful are saved and taken by the gods to the underground cities to escape the destruction of the planet.\\n\\nIn each cyclic destruction, and always according to the mythology of the Hopi, the ‘men-ant’ are crucial for human survival.\\n\\nThe so-called ‘First World’ (Tokpela) was apparently destroyed by the fire of global proportions, perhaps a kind of massive volcanism, or the impact of an asteroid or even a large coronal mass ejection from the Sun of catastrophic proportions.\\n\\nThe ‘Second World’ (Tokpa), however, was destroyed by the cold. Most likely due to a pole shift that caused a massive ice age that destroyed life on the planet.\\n\\nInterestingly, in the course of these two global cataclysms, the members of the Hopi tribe were guided during the day by a cloud of strange shape and a moving star overnight, leading to the presence of the so-called ‘Ant-Man’ which the Hopi call Anu Sinom.\\n\\nThis creature escorted the Hopi to underground caves where they found shelter and sustenance.\\n\\nInterestingly, in the ancient Sumerian language, Anum or Anu was the god of the. He is the creator of creation.\\n\\nIn the Hopi legend, the mysterious creature that resembled a humanoid-ant is described as a generous and hardworking creature, willing to provide food to the Hopi, and to teach them methods of food preservation so they could survive.\\n\\n\\nAs you can see, like many cultures around the globe, the ancient Hopi believed in the existence of subterranean chambers, cities which are eerily similar to other theories of the Hollow Earth. \\n\\nThe Ancient Hopi also mention the mysterious ant-men gods who helped the ancient Hopi progress through time. However, the ancient Hopi also speak of the patuwvotas or ancient ‘ flying shields .’\\n\\nAccording to Frank Waters , author of Mystic Mexico: The advent of the Sixth World of Consciousness (1975) it is in the ‘third world’ where the ancient Hopi introduce the concept of the Patuwvotas, or “flying shields’.\\n\\nIn the third cycle, it is said that humanity built a very advanced civilization, and developed the concept of “flying shields,” a sort of vehicle that can quickly travel to different places in the world and devastate entire cities on Earth. \\n\\nThe Third World was destroyed by Sotuknang, the nephew of the Creator, with a great flood.\\n\\nAlso, in this case, there is a clear parallel with the Sumerian tradition in which we talk about the great flood that destroyed all previous civilization on the planet. \\n\\nThis story is told in the Epic of Gilgamesh , a text which was then taken to biblical tradition in the history of the Flood and Noah’s Ark .\\n\\nAccording to the traditions of the Hopi, the survivors of the flood are scattered in different parts of the world, under the guidance of Masauwu, the Spirit of Death and the Master of the Fourth World. \\n\\nA fascinating petroglyph of the Hopi is that where Masauwu is represented piloting a wingless boat that has the shape of a dome. The similarity between the “flying shields” and what we today consider as airplanes or flying saucers, is mind boggling.\\n\\nIt seems evident that the flying shields or ‘ships without wings’ are something ancient cultures around the globe witnessed in the distant past. \\n\\nThe ancient Hopi used the term to refer to something that was capable of flying through the skies and transporting people.\\n\\nHumans Are Free SOURCE '"}, "time": 1742563609.1865046}