{"duration": 1.1637804508209229, "input_args": {"text": "\"Syrian War Report – October 31, 2016: Al-Nusra-led Forces Failed to Break Aleppo Siege ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board China unveils advanced J-20 stealth fighter in fly over at air show By GPD on November 1, 2016 China has showcased its new J-20 stealth fighter in southern Guangdong Province’s city of Zhuhai in a spectacular fly over at Air Show China, the country’s biggest meeting of aircraft makers and buyers. \\nTwo J-20s, China’s fifth-generation jets, swept over hundreds of spectators at the show’s opening ceremony in a 60-second flyby on Tuesday. The J-20 is a long-range radar-evading fighter jet equipped with air-to-air missiles. China has reportedly already produced six prototypes of the new stealth fighter, which is expected to add greatly to China’s offensive and defensive capabilities. The J-20, manufactured by Chengdu Aircraft Industries Corporation, is an original Chinese project. China carried out the first test flight of the J-20 back in 2011, but it made its public debut at today’s airshow. It is expected to be deployed with the Chinese Air Force within the next two to three years. \\nBloggers have been comparing the J-20 with the US military’s Lockheed Martin F-22 Raptor ever since it was been first tested. The fifth-generation fighter resembles the F-22 Raptor in terms of appearance, but is equipped with a different engine. \\nAccording to TASS news agency, it is fitted with Russian AL-31FM2 turbofan engines, but China reportedly plans to equip it with its own engines in the near future. Most of the tactical and technical characteristics of new stealth fighter have been kept secret, however. \\nMeanwhile, China is also working on another stealth jet program, the J-31, which is reported to be a Chinese response to the American F-35 Lightning II. China is the only country apart from the United States that has two concurrent stealth aircraft development programs going at the moment. Both the J-20 and J-31 programs are believed to be aimed at supporting China in taking more assertive stances in territorial disputes with its neighbors over the East and South China Seas. \\nBesides China, only the US and Russian Air Forces have fifth generation stealth fighters at their disposal at present. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by GPD on November 1, 2016, With 239 Reads Filed under Military . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742562537.7927196}