{"duration": 0.2689385414123535, "input_args": {"text": "\"Morning Sickness May Protect Mother and Child VN:F [1.9.22_1171] Close Transcript Transcript: Morning Sickness May Protect Mother and Child \\nBelow is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. \\n“Since the beginning of time, pregnant women have been [known] to suffer…nausea and vomiting [during pregnancy].”“The term ‘morning sickness’ is [actually] misleading,” since women can feel sick all day long. And sometimes, it can get so serious women have to be hospitalized. \\nResearchers at Harvard’s Brigham and Women’s Hospital found that saturated fat seemed to be a primary dietary risk factor for severe sickness. Five times the odds for each 15 grams’ intake of saturated fat, like a quarter-pound cheeseburger’s worth. The reason saturated fat intake may be such a strong risk factor could be through its effect on estrogen, as “[s]aturated fat has been shown to increase circulating levels of estrogen.” \\nWhy would we evolve to have such a negative reaction to saturated fat? Why would we evolve to get sick at all? “Pregnancy sickness is a universal phenomenon, [with nausea and vomiting] affecting 70 to 85% of all pregnant women.” If you include food aversions in the definition, then the incidence is more like 100%. “Because pregnancy sickness is such a common phenomenon, one must question why this is so. Is there a purpose for such a potentially devastating condition?” Well, in the past, pregnancy sickness was dismissed as all just in women’s heads, but “recent…studies have reconsidered pregnancy sickness as an embryo-protective mechanism, an evolutionary adaptation to protect the [baby].” \\nProtect the baby from what? Maybe from meat. “Meat is the principal source of pathogens for humans. Meat is also the most common type of food avoided by pregnant women.” So, the development of an aversion to meat during pregnancy could be protective, as “meat may have toxins that are mutagenic, carcinogenic, and teratogenic”—meaning birth defect-causing. Tainted meat may also be contaminated by pathogens, and “[p]regnancy is a time of relative immunosuppression.” Normally, we can fend off most meat pathogens; however, by design, pregnant women are immunosuppressed to not reject the developing embryo, since half the baby—from the father’s side—is foreign. \\nSo, maybe morning sickness evolved as a way to get us to stay away from meat during this vulnerable time. This would be consistent with a “profound overrepresentation” of taboos against meat eating during pregnancy in sample societies around the world. \\nIf this theory is true, then we should be able to make five predictions. If nausea and vomiting in pregnancy is there to be protective, then women who have it should have better pregnancy outcomes. And, indeed, women who experience nausea and vomiting are significantly less likely to miscarry, or suffer a stillbirth. \\nPrediction #2 would be that the triggering foods contain things that can be particularly harmful to the baby. And, indeed, “[o]f all food types, animal protein (including meat, poultry, eggs, and seafood…) is the most dangerous. Meat is the source of a wide range of pathogens that pose a grave threat to pregnant women and [their developing babies].” \\nNausea and vomiting in pregnancy should also coincide with when the embryo is most vulnerable. That’s between like, you know, weeks 5 and 15, when all the critical organ structures are being formed—which is right when nausea and vomiting is peaking, which is right when pregnant women find meats, fish, poultry, and eggs most aversive. \\nAnd, finally, if this theory is true, one would expect a lower frequency of morning sickness among plant-based populations. And, yes, the few societies where you don’t see such morning sickness problems are the ones that tend to have only plants as dietary staples, rather than meat. Please consider volunteering to help out on the site. Close Sources Video Sources Doctor's Note \\nIf you do suffer from morning sickness, what can you do? See Natural Treatments for Morning Sickness . \\nWhat other effects can diet have on a healthy pregnancy? See, for example : Maternal Diet May Affect Stress Responses in Children \\nIf you haven’t yet, you can subscribe to my videos for free by clicking here . To post comments or questions into our discussion board, first log into Disqus with your NutritionFacts.org account or with one of the accepted social media logins. Click on Login to choose a login method. Click here for help. Julie \\nSo nice to have a video without pop-ins!! :) In early pregnancy my food aversion wasn’t to meat (which I didn’t eat anyway). However I did have a major aversion to peanut butter–couldn’t even take a whiff of the stuff! Maybe protection from aflatoxin? Secondary aversion was to oatmeal which had been my go-to breakfast for years. Didn’t touch either throughout pregnancy. WFPBRunner \\nSomething that is also curious is I had morning sickness the minute I got up but was fine for the rest of the day. If meat was the culprit wouldn’t I have been sick when the food was still in my stomach? What good would vomiting up nothing do? Julie \\nYeah, doesn’t make much sense, does it? I’ve never really thought there’s much rhyme or reason to the idiosyncrasies of pregnancy like morning sickness, food aversions and cravings.. Many of them don’t make much sense, although it would be interesting if they did. WFPBRunner \\nHormones Nick Presidente \\nI wonder if our evolution is the culprit on things like this. Where we might have evolved the morning sickness as a reponse to toxins, when toxins were almost entirely from our diet. Today we wear make up, and touch chemicals among other things, who knows, maybe make up makes us throw up? It’d be interesting to see a more detailed breakdown of that. Foroogh – NF Moderator \\nYes, I think this is very interesting topic for further research. The bodies response to toxin to protect the fetus that his or her immune systems is not developed yet. Yes, our bodies are very complex system and we learn a lot from it. plant_this_thought \\nOur bodies are equipped to tell us so many things, when we stop to listen. Tom Goff \\nSymptoms often aren’t just messages. They are the body’s first line defences against infection and injury. Coughing expels noxious organisms, fevers kill pathogens etc etc. Suppressing symptoms may actually be counterproductive in some circumstances. plant_this_thought \\nDisease, then, is not the body misbehaving, but working as designed. Darryl \\nThis paper offers a similar hypothesis that the reason saturated fat intake induces inflammation (in the nonpregnant as well) is that it’s an adaptive response to gut pathogens that meat promotes. \\nEmbyronic implantation “ resembles an open wound that requires a strong inflammatory response ” where the uterine lining is broken and endometrial tissue invaded, and this enhanced immune response is partly responsible for morning sickness. Terry \\nWe had 4 children and my wife got morning sickness with each one. I am not a doc and of course can’t give medical advise. But we used B-6 and the morning sickness was gone. With all 4 children. Others tried my suggestion and it worked for them too. B-6 is supposed to work for sea sickness too. Darryl \\nThey used 25 mg every 8 h for 3 d. nc54 \\nEat a banana every 8 hours. Good source of B6. Joyce \\nAt the time I became pregnant with my son, my diet consisted mainly of vegetables with very occasional meals of chicken or fish. I did not experience morning sickness. However, as the pregnancy progressed, i began to crave red meat. Since I had not had any for more than 15 years, it was difficult to contemplate following through on this need. Eventually, the craving became so powerful, I purchased and ate an entire steak. I was surprised that the need persisted for the remainder of the pregnancy. Once my son was born, I reverted to a predominantly vegetarian diet. But clearly my usual diet was lacking in something required for the pregnangy lemonhead \\nSame thing happened to me re: red meat. I did get morning sickness in my first trimester, though. Julie \\nSame thing happened to a friend of mine. She normally hated red meat, but while pregnant she craved it like crazy! Bobbi \\nI just love the pop-in images and the picture videos! what a nice way to change things up- thank you Nutritionfacts. \\nThis video is so interesting to me since I vomited for almost 7 months of my pregnancy and thus never had another child after my wonderfu Sebastian. I know this rationale is fact for me. It was always fried smells of any time and I literally lived on peanut butter and toast while fearing my son would then be allergic to peanuts after my high consumption, but he is 24 now and no signs of it. Our bodies are so wise! Bobbi \\nSorry, meant to write, “smells of frying or cooking meat” that made me have to literally walk quickly past restaurants and decline dinner invitations. I think the reason it turned on early in the morning and stayed all day and night for me was because that is when it needed to alert me; when I was awake. Foroogh – NF Moderator \\nhttp://www.babycenter.com/morning-sickness?page=2 Maria \\nuhg… baby center is full of pop info that aims to please everyone and anyone- not a great scientific resource….. Maria \\nOh my goodness- I love Dr. Gregor and my plant based diet but I get really upset at stuff like this… 6 weeks to the day (after eating pounds of asparagus and beans) I got debilitating nausea with my second pregnancy (that PS was quelled for awhile when I ate a high calorie/ high fat meal like…. meat. Which I wouldn’t touch until I was pregnant.) For all of you watching please don’t go around promising women they will not have morning sickness if they are plant based because it’s simply not true. I think it has more to do with changes in hormones (this is all from experience totally non scientific…). I am super sensitive to changes in hormones to the point where I get extremely nauseous at milk let down when I’m nursing (even after intercourse- which is a similar hormone “rush” if I’m not mistaken). I have searched all over for information about this but I feel like all of it is anecdotal. My biggest aversions during pregnancy were to rice, oatmeal, and whole beans (smashed was fine haha)- and it sounds stupid but I hated drinking water. I simply couldn’t eat enough calories to support myself because of the nausea. \\nI didn’t try ginger or B6 but I just want to fix the cause of the nausea not put a bandaid on it…. \\nAs a side note I totally avoided heartburn because of the PB Diet. It was amazing!!! Had it horrible with my first but not with my second! Oil, meat, and anything processed (even a little) gave me horrible heartburn- greens and fruit rock! nire81 \\nI’ve had three pregnancies with severe morning sickness. The first pregnancy I was a vegetarian (for over a decade) and I threw up so much I lost weight for 7 months. The second pregnancy I was still a vegetarian and was also very sick, but threw up a little less. My third pregnancy I was vegan (for two years) and I couldn’t stand up without needing to puke, and I had issues with dehydration. I was having blood work done yearly because of my Hashimoto’s, and my nutrient levels were fine. All three times the sickness lasted the entire pregnancy and went away right after delivery. Maybe meat is one cause of morning sickness, but based on my experience I think there must be other causes as well. NutritionistMia \\nI am 17 weeks pregnant with twins. I have suffered from hyperemesis gravidarum (HG) throughout my pregnancy and have been hospitalized due to dehydration before. I also am a primarily plant-based eater. While I think this theory could hold some merit since so many pregnant women experience aversions to meat and poultry, it really doesn’t begin to explain the range of nausea triggers for those of us with HG. For example, a simple car ride or a whiff of certain vegetables (especially ones that I used to love!) can induce excessive vomiting, and neither of these examples appear harmful for the fetuses. My point is I think this theory is a bit oversimplified and dismissive of a condition that is much more complex and mysterious than this video would suggest. Maria \\nYES! I think pregnant women are just so widely misunderstood. It’s not JUST what you eat (maybe a factor)- maybe it’s even stress! I wonder if those other countries that are more plant based also see pregnancy as a normal part of life (not a disease like in the US) and have families who support the pregnant women (not have demanding work days and isolation from families as a normal part of the culture- not to mention a a negative view of pregnancy and children) NutritionistMia \\nAgreed. Really limiting stress has been key for me, in addition to medication and monitoring by my medical team. Also in developing countries (even plant based societies in Sub-Saharan Africa and South East Asia), women can and do die of HG due to dehydration and inability to access health services. Removing meat from one’s diet is not a cure for severe morning sickness, the same way that meat is not the cause of morning sickness. It is much more complicated than that! Foroogh – NF Moderator \\nHi, I think this is great video and we can learn a lot from it and it is a subject for further research as I can understand from reading the comments different pregnancy has different issues associated with morning sickness. Vege-tater \\nInteresting irony…though I never liked meat and liver gagged me, when I was pregnant I craved it nearly raw! Can make me gag now just thinking about it! I had wicked morning sickness early on and barely could hold anything down, but by the craving stage it was history. The following pregnancy was uneventful. Odd. DashnMe \\nOk, this one is way off for me. I was ill enough to be hospitalized with my first pregnancy. I was kept in for 2weeks on I’ve fluids no food the entire time and when I was released, I couldn’t eat enough hamburgers to satisfy me…and I had been a vegetarian for the previous 5 or more years!! The smell of coffee or even the smell of boiling water made me ill, the taste of water, eating lettuce made me violently ill…I hated how my taste buds changed but there it is. With my second child, I was no lo get a vegetarian but felt just as sick but managed to stay out of the hospital. And for me, it was a 24/7 illness not just morning. \\nLol, humans didn’t evolve. Keri Hanson \\nTwo pregnancies, two healthy sons, no morning sickness. I was vegan prior to my first, ate some chicken and fish at my Midwife’s advice during my first pregnancy, and are no meat my second. Jen \\nHello Dr. Greger – I don’t mean to be nit-picky, but its quite unclear to me (and I would guess others as well by the nature of the comments we are seeing) whether you are speaking about this subject as a hypothesis or a theory. A couple of times you stated “If this theory is true . . . “. \\nAs a scientist, you know that a “theory” is generally regarded as accepted fact due to a plethora of information sufficient to fully support it. A “hypothesis” is still questioned as fact and is still in the “accepting information as to its validity” stage. So I’m a little unclear as to how you are representing this set of information: as hypothesis or as theory? I think it has added to some confusion in the discussions below. \\nMy sense of it is that this is a hypothesis at this point but you are using the word “theory” loosely as many of us do. I wouldn’t make a point of it except that this is a fact-based site and we are seeing lots of diverse perspectives and some confusion. So I’m wondering if you could clarify for us. Love your work however! broccoli \\nThis is bogus info from Dr Greger under the disguise to be against meat eaters. Morning sickness has to do with hormone imbalance in pregnant women but has nothing to do with vomiting to expel meat “poisons” from the body as a “protective mechanism”. And the saturated fat theory is even more laughable. \\nEven vegan pregnant women have morning sickness.\""}, "time": 1742562394.9829102}