{"duration": 0.13907527923583984, "input_args": {"text": "'WASHINGTON  —   Secretary of State John Kerry accused Prime Minister Benjamin Netanyahu of Israel on Wednesday of thwarting peace in the Middle East, speaking with a clarity and harshness almost never heard from American diplomats when discussing one of their closest and strongest allies. With only 23 days left in his   turn as secretary of state, during which he made the search for peace in the Middle East one of his driving missions, Mr. Kerry said the Israeli government was undermining any hope of a   solution to its   conflict with the Palestinians. The American vote last week in the United Nations allowing the condemnation of Israel for settlements in the West Bank and East Jerusalem, he added, was driven by a desire to save Israel from “the most extreme elements” in its own government. “The status quo is leading toward one state and perpetual occupation,” Mr. Kerry said, his voice animated. His speech was a powerful admonition after years of tension and frustration, with the Obama administration giving public voice to its   concern that Israel was headed off a cliff toward international isolation and was condemning itself to a future of   perpetual warfare with the Palestinians. Reaction was immediate and harsh, not only from Mr. Netanyahu, but also from Senators John McCain, Republican of Arizona, and Chuck Schumer, Democrat of New York.   Donald J. Trump did not even wait for Mr. Kerry to speak before condemning the secretary of state. The United States and Israel are in the middle of a breach rarely seen since President Harry S. Truman recognized the fragile Israeli state in May 1948. In a direct response to Mr. Netanyahu’s barb over the weekend that “friends don’t take friends to the Security Council”  —   a reference to the Obama administration’s decision to abstain from the resolution condemning the building of new settlements in disputed territory  —   Mr. Kerry said the United States acted out of a deeper understanding of the meaning of its alliance. “Some seem to believe that the U. S. friendship means the U. S. must accept any policy, regardless of our own interests, our own positions, our own words, our own principles  —   even after urging again and again that the policy must change,” he said. “Friends need to tell each other the hard truths, and friendships require mutual respect. ” Toward the end of his   speech in the State Department’s auditorium, Mr. Kerry acknowledged that Mr. Trump may well abandon the major principles that the United States has used for decades of Middle East negotiations, including the   solution that both Republicans and Democrats support. Mr. Trump is nominating a new American ambassador, David M. Friedman, who has broken with even the pretense of supporting a   negotiated agreement and has helped fund some of the settlements Mr. Kerry denounced. On vacation in Palm Beach, Fla. Mr. Trump posted two Twitter messages rejecting the speech before it was delivered. “We cannot continue to let Israel be treated with such total disdain and disrespect,” he wrote on Wednesday morning. After assailing the nuclear deal in Iran and last week’s vote at the Security Council, he said, “Stay strong Israel, January 20th is fast approaching!” He was soon praised  —   also on Twitter  —   by Mr. Netanyahu, who later released a video statement that was unsparingly direct and dismissive of Mr. Kerry. “The entire Middle East is going up in flames, entire countries are toppling, terrorism is raging and for an entire hour the secretary of state attacks the only democracy in the Middle East,” Mr. Netanyahu said. “Maybe Kerry did not notice that Israel is the only place in the Middle East where Christmas can be celebrated in peace and security. Sadly, none of this interests the secretary of state. ” Mr. Kerry’s speech was criticized at home as well. Mr. McCain called it a “pointless tirade,” while Mr. Schumer, the incoming Senate Democratic leader, said he feared that Mr. Kerry had “emboldened extremists on both sides. ” Mr. Kerry did make note of the Palestinian violence, the “extremist agenda” of Hamas, and the Palestinian unwillingness to recognize Israel. All, he said, were at the heart of the conflict. But Mr. Netanyahu’s continued support of settlements, “strategically placed in locations that make two states impossible,” he said, is driving a solution further and further away. Mr. Kerry argued that Israel, with a growing Arab population, could not survive as both a Jewish state and a democratic state unless it embraced the   approach that a succession of American presidents have endorsed. Mahmoud Abbas, the Palestinian president, responded to Mr. Kerry’s speech by calling on Israel to freeze housing construction in order to restart negotiations. “The minute the Israeli government agrees to cease all settlement activities, including in and around occupied East Jerusalem, and agree to implement the signed agreements on the basis of mutual reciprocity, the Palestinian leadership stands ready to resume permanent status negotiations,” he said. Mr. Netanyahu has said he is willing to meet Mr. Abbas anytime for talks as long as there are no preconditions. It was notable that it was Mr. Kerry who delivered the speech rather than President Obama, who has long kept a distance from Middle East peace negotiations, a pursuit he has always doubted would succeed. After talks at Camp David collapsed in 2000, it was President Bill Clinton himself who gave a speech laying out the parameters of an ultimate deal, about 10 days before leaving office in 2001. At the time, Mr. Clinton also censured Israel for its settlements, but in far more measured terms. Mr. Kerry called them a violation of international law, a position he said the State Department had taken since 1978. “The Israeli prime minister publicly supports a   solution, but his current coalition is the most   in Israeli history, with an agenda driven by its most extreme elements,” he said. “The result is that policies of this government  —   which the prime minister himself just described as ‘more committed to settlements than any in Israel’s history’  —   are leading in the opposite direction, towards one state. ” Seldom in modern American diplomacy has an American administration so directly confronted  —   and disavowed  —   a close ally’s actions as Mr. Kerry did on Wednesday, dropping most of the restraint he had shown in public over the past four years. One of the last times was during the Eisenhower administration, when the United States broke with Britain, France and Israel over the 1956 invasion of the Egyptian Sinai. Eisenhower had warned against the invasion and threatened to harm Britain’s financial system in retaliation. When Mr. Kerry got to the principles for a future settlement, they were unsurprising. Many date to the 1990s or earlier, and many to past United Nations resolutions. The principles he described started with a “secure and recognized border between Israel and a viable and contiguous Palestine,” based on Israel’s withdrawal from territory occupied since the 1967 war and land swaps to “reflect practical realities on the ground. ” A second principle was the creation of a state for the Palestinian people, and a third was a “fair and realistic solution to the Palestinian refugee issue,” including compensation. There was no mention of a “right of return” for refugees and their descendants forced to leave Israel and the Palestinian territories, back to 1948. The fourth principle called for Jerusalem to be the recognized capital of both states, which Mr. Kerry said was “the most sensitive issue for both sides. ” The fifth was an agreement to satisfy Israel’s security needs while ending its military occupation of Palestinian territories. Mr. Kerry, who has cast himself as one of Israel’s greatest friends, said in recent months it became clear he had to “save the   solution while there was still time. ” “We did not take this decision lightly,” he said of the vote in the United Nations Security Council, where the American abstention allowed a    condemnation of Israel go forward. “Israelis are fully justified in decrying attempts to delegitimize their state and question the right of a Jewish state to exist. But this vote was not about that. It was about actions that Israelis and Palestinians are taking that are increasingly rendering a   solution impossible. ” It was also about Mr. Kerry’s own personal disappointment. As soon as he took over from Hillary Clinton as secretary of state in 2013, Mr. Kerry plunged into the tar pit of Middle East peace negotiations with an enthusiasm neither Mrs. Clinton nor Mr. Obama shared. The goal was a   negotiation leading to a “final status” of the   conflict by the summer of 2014. It never got that far. Despite scores of meetings between Mr. Kerry and his two main interlocutors, Mr. Abbas, the Palestinian president, and Mr. Netanyahu, Mr. Kerry and his lead mediators, Martin S. Indyk and Frank Lowenstein, could not make progress. They blamed both sides for taking actions that undermined the process, but the continued expansion of the settlements was one of their leading complaints  —   an effort, in the American and European view, to establish “facts on the ground” so that territory could not be traded away. Mr. Netanyahu has accused the United States of “orchestrating” the vote, and his aides have said that Mr. Kerry and Mr. Obama effectively stabbed Israel in the back. Israeli officials have said they have evidence that the United States organized the resolution. Mr. Kerry pushed back at that narrative on Wednesday. Mr. Netanyahu, for his part, is biding his time and waiting for Mr. Kerry and Mr. Obama to move on. Israeli leaders postponed plans on Wednesday to move ahead with new housing in East Jerusalem, just hours before the speech.'"}, "time": 1742561856.7409465}