{"duration": 0.16625571250915527, "input_args": {"text": "'DUBLIN  —   The Tobun family never missed a rental payment on their modest brick rowhouse in eight years. But in February, the couple, who have two young children, received a letter warning that they would have to leave their home when the lease expired. Forty of their neighbors got the same notice. When they went to investigate, the tenants, in the   suburb of Tyrrelstown, discovered a trail that led all the way to Wall Street. After Europe was ravaged by a financial and economic crisis, the giant investment bank Goldman Sachs snapped up huge swaths of distressed debt in Ireland, including the loans of Tyrrelstown’s developer in 2014. The developer now wants out of the rental game and is selling the properties. As the owner of the loans, Goldman will reap a large portion of the proceeds. Goldman has nothing to do with the actions here. But because American banks have played such a large role in Europe’s housing recovery  —   and have made huge profits in the process  —   they have become the main target of a growing backlash among homeowners and renters. “Somehow, these funds have gotten involved in our community,” Funke Tobun said. “They’re profiting, but it’s the people who are being made to suffer. ” Wall Street has become the biggest new landlord in Europe, as American financial firms have swept into cities, suburbs and towns to take to advantage of the fallout from the worst economic downturn since World War II. In the last four years, Goldman Sachs, Cerberus Capital Management, Lone Star Funds, Blackstone Group and others from America have bought more than 223 billion euros’ worth of troubled real estate loans around Europe, nearly 80 percent of the total sold. The firms have made the usual calculation: buy distressed investments on the cheap during tough times, betting that the outlook will eventually turn and riches will follow. And the firms are paying little or no tax, by employing complex strategies that often involve subsidiaries with no operations or staff. The huge profits and dubious tax strategies have made Wall Street a major object of frustration and anger, as people grapple with evictions and higher mortgage payments. In some cases, the Wall Street firms are passive players, the money men behind the landlords, developers or banks that are exerting force. In other cases, they are direct participants taking action. Despite the controversy, the firms  —   and their purchases  —   have played a vital role in the cleanup of Europe’s mess. In places like Ireland and Spain, governments and banks for years fostered reckless,   property booms. When the bubbles burst, the countries were saddled with bad loans and their economies faltered. Wall Street stepped in, buying mortgages on commercial properties, rental developments and even individual homes. The   cash helped mend national finances, halt plunging property values and clean up banks’ books. “Investment by foreign capital has helped restart the system and accelerate the adjustment and recovery,” a spokesman for Goldman, Sebastian Howell, said. But the recovery has been uneven, leaving homeowners and renters with few options after they run into trouble. Homeowners who have fallen behind are being pressured to accept harsher terms that could tilt them toward foreclosure. Residents are being plied with fees that make it harder to stay in their properties. And even tenants who have not missed rental payments are being forced out at a time when rising property values make it difficult to find affordable housing. Whether or not Wall Street is directly involved, activists are invoking the firms to fire up the masses. “It’s important to remember that these funds are not mainstream banks or charities,” said David Hall, director of the Irish Mortgage Holders Organization, a nonprofit that helps troubled homeowners. “They sell to make profit and they exit. ” Protesters have occupied empty apartments in Barcelona whose mortgages had been bought by Blackstone, and rallied around tenants in Madrid who were served eviction recently by a   subsidiary. In Ireland, homeowners seeking protection have demonstrated outside Parliament. The deals are now getting a second look. The Spanish authorities are putting in place protections for tenants and homeowners. The Irish finance minister introduced legislation in October to tighten oversight of Wall Street’s tax arrangements. In Tyrrelstown, tenants have asked the government to intervene, so they can remain in their homes. After receiving their lease termination notices, several families moved into a hostel. “They couldn’t stand the pressure,” Mrs. Tobun said. “They were scared of ending up homeless. ” For decades, Tyrrelstown was a blank slate on the northwestern edge of Dublin, acres of rolling fields with just a few homes dotting the landscape. When Ireland joined the euro currency union in 1999, it all changed. Foreign capital flooded the country, and the economy soared. With seemingly endless growth in this   Celtic Tiger, banks made freewheeling loans to property developers like Rick and Michael Larkin, the brothers behind Twinlite, the developer that built Mrs. Tobun’s home. The brothers undertook one of Ireland’s most ambitious developments. More than 2, 000    homes were erected over vacant land that had at one point been targeted for a landfill. With three floors, modest kitchens and tidy backyards, the properties attracted teachers, police officers and other   tenants to an increasingly multicultural enclave. By 2006, the Larkins had added a sprawling retail center to Tyrrelstown along with a $40 million luxury   hotel, with 155 rooms, a fusion restaurant and an   boardroom. At a   ceremony, Bertie Ahern, then Ireland’s prime minister, promoted the construction as “a vote of confidence by its developers in the future of our economy. ” Similar developments sprouted up across the country. By 2006, bank lending for development had grown in Ireland to more than €95 billion, from €5. 5 billion in 1999. Construction comprised a quarter of the country’s economic activity. Then the global financial crisis struck in 2008, and the Irish economy began to crumble. Despite warning signs, the Larkins kept building, unveiling plans for a €100 million,   indoor ski slope and   center. As the crisis deepened, city planners rejected the project. Many developers and homeowners could not pay their loans, leaving banks saddled with huge portfolios of troubled debt. Banks began frantically looking for ways to reduce their loads, even trying to get rid of the loans of borrowers like Twinlite that had not fallen behind. The government helped accelerate the process, setting up the National Asset Management Agency to package and sell off bad loans, a role that was expanded after Ireland’s bailout in 2010. Wall Street firms saw opportunity, with loans selling at up to 70 percent off their face value. The firms bought nearly €100 billion worth of Irish distressed debt. Twinlite’s loans in Tyrrelstown were among those picked up in the frenzy by Beltany Property Finance, a Goldman affiliate. Twinlite said it opposed the sale and sued the issuing bank, unsuccessfully, to have it halted. After that, Tyrrelstown residents faced two options: buy their properties or lose their homes.. The County Council, to which Tyrrelstown residents had appealed for help, told Mrs. Tobun that a   home loan might be available to purchase her property.. But Mrs. Tobun, who nets €1, 000 a month caring for older people, could not afford the €16, 000 down payment. Her husband, who drives a taxi, could expect to earn €40 on a   shift, compared with almost €150 before the crisis. Her worst fear, Mrs. Tobun said, was that her family might wind up among the growing ranks of the homeless. Ireland is now enjoying a robust recovery. But growth has been fueled partly by financial maneuvering, and the real underlying gains are far from even. More than 5, 000 people have been left homeless by the crisis, with the government subsidizing many in shelters. Mrs. Tobun does not have many options. She does not want to move farther out, since it would mean changing schools for her son who has special needs. A nearby rental is too expensive. Rents in Ireland have risen around 20 percent since the crisis as home construction dried up after the bust. Still, the effort showed that her home and the others in Tyrrelstown were worth much more as empty sales properties than as   rentals. In a statement, the Larkin family denied that Goldman’s subsidiary exerted pressure to end the leases or sell. The statement said a   company wanted to exit the residential rental business, given regulatory changes and improving market conditions. For Tyrrelstown residents, the battles have been an   ordeal. After receiving a notice in May, Gillian Murphy and her partner, Damien Moore, refused to move from the home they had rented for six years. One of their three children has autism, and switching schools would put him at the bottom of the list for programs elsewhere. Soon after the family received the notice terminating their lease, two men working for the   entity arrived at their home and began taking pictures. “Everyone is petrified of these people because we don’t know who they are or what the purpose is,” Ms. Murphy said. Before last year, few people in Ireland had heard of Cerberus Capital. Like other Wall Street players, Cerberus came into the country quietly, creating a local subsidiary under a different name and setting up a complex and extensive web of interconnected businesses. There are the 13 subsidiaries in Dublin, all with Promontoria in their names. They have no employees and no offices. They are all registered to the same address on Grant’s Row, a letterbox near Parliament. Those subsidiaries, in turn, are subsidiaries of holding companies in the Netherlands, more than 110 of which had the Promontoria name. The structure has helped Cerberus profit in Ireland. Through the subsidiaries, Cerberus bought around €17 billion worth of loans on properties in Ireland and Britain in two years, for just under €6 billion euros. In Ireland alone, Cerberus has been earning hundreds of millions of euros in interest and other income. The setup, promoted by the Irish government along with other tax strategies, allows for a bit of tax magic that can make those profits seem to disappear. To buy the debt, Cerberus’s Dutch Promontoria companies lent Cerberus’s Irish Promontoria firms money at a high interest rate. The Irish businesses ended up paying roughly the same amount in interest that was earned on the real estate investments. Since the interest was deductible, Cerberus cut its tax bill drastically. One Irish subsidiary, Promontoria Eagle, which bought distressed loans in Northern Ireland and Britain, earned interest income in 2014 of 111 million British pounds on the deal, or around $140 million. After deducting interest charges and management and audit fees, taxable profit was only £7, 788. The resulting tax charge in Ireland: just £1, 947. Corporate filings for five other Irish subsidiaries of Cerberus, provided by DueDil, a corporate intelligence firm, show the same pattern: taxable profit and tax charges reduced to nearly identical numbers. Portfolios with up to £1 billion worth of loans wound up with tax charges of less than £2, 000. Other Wall Street firms employed a similar method. Beltany, the Goldman subsidiary, earned interest income of €44 million on debt portfolios in Ireland at the end of 2014. After lowering taxable profit to €1, 000, it netted a tax charge of €250, filings show. Lone Star collected interest income of more than $970 million at the end of 2014. Its taxable profit was just over $11 million, resulting in a tax charge of less than $1 million. “Wall Street firms have made a lot of profit from other people’s misfortunes, and on top of that they’ve systematically structured things so they pay almost no tax,” said James Stewart, a finance professor at Trinity College, Dublin. “So what’s their contribution to society?” Cerberus and Lone Star declined to comment. Goldman said that Beltany followed Irish law and that the interest it collected was subject to United States tax. On a warm summer day, 20 people crowded into a basement in central Dublin. The dimly lit room had recently been converted into makeshift headquarters for the Hub, a   operation that enlisted volunteer accountants and lawyers to help people who were facing eviction. David Walsh, a former firefighter living in Ballybunion, on the west coast of Ireland, drove six hours to attend the meeting. Two years ago, Lone Star’s Irish affiliate had scooped up the mortgage on his family’s      the Ballybunion BB, for a fraction of the original cost. He was angered that he had not been allowed to buy back his loan at the cheap price the fund received. Soon after, he said, the affiliate mounted an effort to increase his mortgage payments. In the crisis, his bookings had slumped badly, and his original bank had agreed to lower his monthly payments to €800 from €2, 000. “They phoned me every day of the week and at night saying we have to increase the payments,” Mr. Walsh said of the Lone Star affiliate. When the Hub’s lawyers questioned the legality of Lone Star’s ownership of his mortgage, Mr. Walsh diverted his loan payments into an escrow fund as a form of protest until the issue could be resolved. “The amount of harm being done to vulnerable people is immense,” he said. Mr. Walsh was threatened with foreclosure, which he continues to fight. A broader rebellion has barreled ahead in Spain, where Blackstone, Goldman and other American firms bought residential properties, including subsidized rentals. While   rentals represent a small piece of their portfolios, the companies ignited a firestorm when they began evicting squatters, in an effort to improve property values. The activist group P. A. H. organized protests around Spain and outside Blackstone’s New York headquarters. Blackstone and Goldman said they had evicted just a small number of squatters and aimed to keep renters in the properties  . Goldman said its policy was to help certain distressed tenants avoid eviction. The perceived invasion has prompted a political reassessment. Some Spanish regional authorities have passed laws intended to clamp down on Wall Street’s involvement. Catalonia now requires firms to offer cheap alternative housing to tenants. The local authorities can also buy back homes or expropriate them if they are left empty for three years. So popular was the   movement that Ada Colau, its main leader, was elected mayor of Barcelona last year. “The opacity and distance of a fund that is based much farther away makes it a lot harder to hold it responsible,” she said. In Ireland, the Tyrrelstown episode has become a rallying cry. Housing advocates and lawmakers across the political spectrum are urging stricter oversight. Along with new legislation intended to close tax loopholes and restrict mass evictions, lawmakers are considering requiring banks and financial firms to follow a code of conduct and provide alternatives for troubled homeowners. But for Mrs. Tobun and other Tyrrelstown residents, such changes may offer little relief. Recently, she and her neighbors received word that their rents would rise sharply in the new year, after their current contracts expire. She said she and most of the 40 tenants affected would be unable to pay. The new rents will be closer to current market prices, but many residents suspect that the increase is a tactic being used to flush them out so the properties can be sold. In response, the Tyrrelstown community is planning another series of demonstrations. “This is a fight between David and Goliath,” Mrs. Tobun said. “They want us out by force. All we can do is protest. ” “We believe in miracles,” she added, “but I don’t know how we’re going to win. ”'"}, "time": 1742628442.667709}