{"duration": 0.2576591968536377, "input_args": {"text": "'Sarah Jessica Parker was waiting for a menu at a restaurant in    a Westchester County suburb of New York, when a   man in a polo shirt and shorts showed up at her table. “I’m out of your face right after this little note I made for you  —   check it out,” he said. He handed her a small folded piece of paper and waited as Ms. Parker read it. “Aw,” she said, and smiled. “Thank you! Thank you, Michael!” On “Sex and the City,” Ms. Parker famously played Carrie Bradshaw, an    serially dating and hotly pursuing ideal love. Perhaps because of that, Michael took the opportunity to launch into tales of his own love life,    : the girlfriend who recently dumped him, the new girl who might really be something. “You’re cute as a button,” his note read. In spite of Ms. Parker’s age (51) her 19 years of marriage to Matthew Broderick, and her three children, her public image remains closely bound up with that of Carrie, a symbol of youthful possibility, forever available, forever adorable. On Oct. 9, 12 years after the series went off the air, Ms. Parker is returning to HBO with a show whose very title  —   “Divorce”  —   suggests the bitter culmination of all that sex in the city. She plays Frances, a kind of   someone long married, living (brace yourself) in the suburbs, and working as a corporate recruiter, her arty dreams subsumed by financial necessity. Her husband  —   though not for much longer  —   is Robert (Thomas Haden Church) a real estate entrepreneur down on his luck. Frances is far from a   romantic: She has cheated on her husband she is a narcissistic oversharer, a   accuser, a   manipulator. She is also, as played by Ms. Parker, deeply real and somehow appealing. “I’m still getting to know her,” Ms. Parker said. She was quick to clarify that she is no more Frances than she ever was Carrie (she and Mr. Broderick married about a week before she shot the pilot). But “Divorce,” at turns moody and comic, does cover material that is meaningful to Ms. Parker, who is an executive producer of the series. For some years, she has wanted to do a show about   relationships, a natural outgrowth, she said, of countless conversations she has had with friends who, like her, are in early middle age, a time when it’s common for people to grapple with the choices they have made, in relationships as much as anything else. The show reflects, she said, a “certain introspection and reckoning” that is inevitable after some 15 or 20 years of marriage. “It’s a really specific point in a person’s life, right now, for my generation,” said Ms. Parker. “It’s when you start to think about relationships, the time spent, what came of it  —   and what do you do with where you find yourself now?” AFTER “SEX AND THE CITY,” Ms. Parker did not look very hard for her next big role when people asked about another television series, “I used to say never,” she told Alec Baldwin on his podcast, “Here’s the Thing. ” The schedule is demanding for someone raising three children (her twins, Marion and Tabitha, are now 7, and her son, James Wilkie, is 13) and she never found a show that intrigued her enough to make the family sacrifice worthwhile. “When you’re at a point in your life where you can make choices, you can make a choice to say no,” she said. ”It’s kind of nice. ” She made two “Sex and the City” movies, to decidedly mixed reviews, and was nominated for a Golden Globe for her role in “The Family Stone. ” Following that, one of her movies had critical success but small audiences (“Smart People,” 2008) while others had less favorable reviews and even smaller audiences (see “Spinning Into Butter,” 2007). Her reputation as a beloved star never flagged, but neither did she ever land on a role so strong that it put Carrie to bed for good. “It is hard to find material you really love, particularly when you’ve been so successful,” Mr. Broderick said. “It feels like a lot of pressure. ” Ms. Parker spent much of her energy in recent years leveraging her brand in the service of high culture (she is vice chair of the New York City Ballet) and her own businesses  —   a fragrance line and the SJP shoe collection, which she introduced in 2014 and is carried by   department stores. All along, she developed television and film ideas as a producer, including, for some time, a show called “Into the Fire,” which HBO passed on. It featured a   host who quits her job, blows up her career and has an affair with the father of one of her children’s classmates. In some of its details, “Into the Fire” sounds like “Girlfriends’ Guide to Divorce,” which has been renewed for a third season on Bravo, one of a number of television shows in recent years that have featured women in their late 40s or early 50s reinventing their love lives: On “Nashville,” Rayna, played by Connie Britton, ends her marriage and enjoys a succession of suitors on “The Affair,” Helen (Maura Tierney) is betrayed by her cheating husband but goes on to have flings of her own. “I want to save my life while I still care about it,” Frances tells Robert, trying to explain why she wants a divorce it’s as if some sense of imminently fading possibility propels Frances into new romance. HBO suggested that Ms. Parker meet with Sharon Horgan, the producer and   of Amazon’s “Catastrophe,” who ultimately wrote the pilot of “Divorce. ” The resulting project appealed to Ms. Parker both for its darkness and for its    milieu. “So often when you see divorce in cinema or on television, it’s like  —   ‘War of the Roses’! Rich people fighting!” she said. “I wanted to tell a different story, one that I haven’t really seen on television. ” The bar was “quite high” for Ms. Parker’s return, said Richard Plepler, HBO’s chief executive, who felt this show reached that standard. “It’s not a Hollywoodization of divorce,” he said, “but a very authentic one, something she could sink her teeth into creatively and artistically. ” Both Mr. Plepler and Ms. Parker mentioned the influence of “An Unmarried Woman,” the 1978 Jill Clayburgh film that offered an unflinching look at how a flawed but charming wife handles being unexpectedly single after her husband walks out. Ms. Parker was comfortable with embracing her own character’s flaws, said Paul Simms, the showrunner of “Divorce. ” “I was a little surprised and pleased that she was willing to not worry about being necessarily likable,” he said. “Even though she ultimately is quite likable. ” Though Ms. Parker spoke of the characters in “Divorce” as middle class, it might be more accurate to say they are upper middle class in appearance, middle class in disposable income they look like a couple with fancy educations, now tenuously maintaining a gimcrack normalcy   with the help of revolving credit lines and some    turns of luck. If Mr. Big, Carrie’s beloved, represented one ’90s male icon, the finance type, Robert, with his debt and pickup truck, represents a very current countertype, a disempowered white guy baffled to find things are no longer going his way. It only slowly dawned on Ms. Parker, she said, that HBO was expecting her to play the lead in whatever show she developed about marriage midlife. She might not have felt ready to take it on, she said, were it not for the experience she had in 2013 with “The Commons of Pensacola,” a play by Amanda Peet that Ms. Parker starred in, alongside Blythe Danner. “Theater demands a very specific kind of wonderful exhaustion,” said Ms. Parker, “which really reminded me of all I still wanted to do  —   and how much I missed the feeling of not getting it, of being lost, and working in such a concentrated way. I really fell in love with acting again. ” IN CONVERSATION, Ms. Parker has a big, rewarding laugh, and a habit of turning the question on the interviewer. “I’m a very curious person,” she said. “When I was younger, my stepfather was always telling me to stop staring at people. ” She is also a stylish writer, a talent that shows up in her emails, which are carefully crafted and sprinkled with fanciful touches. “Let me know our meeting place,” she wrote, after it was settled that we would head to    where “Divorce” is set, on a train leaving from Grand Central Terminal. “It’s romantic to meet at the clock. ” One morning, she arrived at the clock, perfectly prompt, dressed in   chunky sandals and an     sundress (“Vintage,” she said, “I probably paid $29 for it. ”) As she walked through the terminal, she moved quickly, accustomed to people stopping in their tracks, stupefied, as they recognized her. When someone tried to approach her to talk, she had a warm but effective response at the ready: “I’m so sorry, I wish I could, thank you so much, I have to catch my train!” She offered a big smile, a girlish wave, direct eye contact, somehow meeting the energy of the fan with enthusiasm of her own. From a distance, to a tourist, she might have seemed a holographic conjuring, an icon of    New York there to enhance the iconic New York setting. For Ms. Parker, Grand Central Terminal evokes her ’  childhood, days when her own family of eight children  —   then not financially stable enough to call itself middle class  —   briefly lived in Dobbs Ferry, which neighbors   . “My older brother and I would come in, alone, for auditions,” she said. That was when she was 12 at 13, she played Annie on Broadway. Soon after that, she became the beloved soul sister of   high school girls everywhere, playing the brainy,     Patty on CBS’s   “Square Pegs. ” “For me, doing it was a priceless experience,” Ms. Parker, all of 18, said in an interview shortly after the series ended. “But television isn’t what I want. Theater and film are. ” She could not have known then how much cultural currency television would come to have  —   or how big a role she herself would play in establishing its ascendancy. With that influence came celebrity and the kind of public scrutiny that stings, especially for a parent paparazzi and tabloid reporters are often camped outside her family’s Lower Manhattan home. There have also long been tabloid rumors about the demise of her marriage, which might make the choice of a show called “Divorce” seem revealing, as if it were some subconscious confirmation of her preoccupations. That the public might think that, Ms. Parker said, suggests a misunderstanding of what really motivates her as an actor. “When people ask about the ways in which I relate to Frances, I usually say, ‘I look like her, but that’s it,’” she said. “It’s a funny thing to ask, because all you want to do as an actor is be someone else. ” Why, she added, “would you ever want to play someone like you?” Ms. Parker sounded genuinely bewildered by the persistence of tabloid interest in her marriage. “I guess it’s because we just   …     keep staying married,” she said. “Maybe that annoys them?” Mr. Broderick, she said, is “still the person I want to experience things with, I want to do new things with. ” It may be a sign of the health of their current relationship that neither party feels the need to portray it as any more perfect than most that have weathered three children, two big careers and nearly two decades. Ms. Parker described marriage as a series of choices  —   choosing to stay, choosing to find patience in it. “It’s saying, I’m going to try not to roll my eyes,” she said. “It’s thinking about the delight in something that’s delightful to him, but that may or may not be to you. ” Asked what Ms. Parker might enjoy about playing Frances, Mr. Broderick thought for a moment. “She gets to be pissed off at her husband, which I think would be fun for her,” he deadpanned. But his protectiveness of Ms. Parker, as she prepared for her show’s debut, was evident. “I’m always nervous,” he said. “It’s like watching your child walk onto the playground. You want them to be treated well. And when they’re not, it’s horrible to watch. ” Ms. Parker seems to relish the gap between the show’s plot and her own reality, the way she can experience the aftershocks of a dissolution from a safe creative distance. “Frances was never single with children, never single with a mortgage  —   so I think all that’s going to be really interesting,” she said, already musing about a second season. “How much does she want to date? How much does she really want to take her clothes off with someone?” Ms. Parker slapped her hand against her chest. “Can you imagine? I’d be like  —   no, we are just going to be companions. I’d be horrified!” IT WOULD HAVE BEEN an easier path, in some ways, for Ms. Parker to skip all the exposure and time constraints that come with a new show, to ride out the duration of her career nurturing her brand (and businesses) in the safe, bright afterglow of Carrie. “What do you do after you’ve created one of the cultural landmarks of your time  —   how do you follow it up?” said the actor John Benjamin Hickey, a close friend. “If she had stopped, I would have been like, yeah, I get it. But I think she has a hunger as an artist to challenge herself, and to explore a kind of complicated darkness. Her interest in the subject matter isn’t tabloidy  —   it’s existential. ” Over lunch, Ms. Parker confessed that she was somewhat terrified about the show’s premiere, partly for fear that her fans might be expecting something the show was not  —   that they would judge it not by its own merits, but by how closely it inspired the same giddy pleasures that her previous work has. “This is not Carrie in the suburbs, Carrie the commuter,” she said. “And I kind of want to get ahead of that, so that there is not this giant heave of disappointment when people find the show is not   …     that same buoyant kind of thing. ” Ms. Parker knows that she played Carrie for so long that many fans came to assume that the character simply was her  —   that there was no effort involved in inhabiting her so fully. “But it was definitely acting,” she said. “I never lived any of those experiences in my own life. I’m not Carrie. Sometimes I feel that if I’d done my job well with ‘Divorce,’ it will be a reminder that, yes, she’s an actor. But maybe people will start to think I’m like Frances. And then I’ll have to explain how different Sarah and Frances are. ” She brightened at the thought.'"}, "time": 1742561799.831709}