{"duration": 0.0546572208404541, "input_args": {"text": "'Last week our 2016 electoral projection map had Trump at 235 electoral votes and Clinton at 230. Today’s update includes several state category changes that benefit Trump should they play out as projected on election day next Tuesday. \\nThe following changes are reflected in the new projections. Utah moves from toss up to Trump New Hampshire moves from Clinton to toss up Virginia moves from Clinton to toss up Michigan moves from Clinton to toss up Ohio moves from toss up to Trump \\nUTAH \\nWhile long shot candidate Evan McMullin has proven to be a thorn in Trump’s side in Utah, all polls now indicate Trump will end up triumphant on election day. The media is hyping Utah in an attempt to cast a negative light on Trump’s overall standing with more conservative GOP voters, but there is no solid evidence McMullin will actually pull off a win. \\nWe strongly believe Trump will ultimately win Utah and have moved this state into the Trump corner accordingly. \\nNEW HAMPSHIRE \\nNew polling out of New Hampshire has Trump and Clinton tied, with the latest poll showing Trump at +3. There is no early voting in New Hampshire so we don’t have a sense of where things stand in terms of turnout. \\nWith no early turnout data and tightening polls we’ve decided to move New Hampshire back into toss up territory. \\nVIRGINIA \\nPerhaps the most surprising move is Virginia. Of all the states we’re watching in the toss up column, Virginia is probably the toughest pick up for Trump. The big government vote in northern Virginia is a mountain not easily climbed for a Republican candidate. \\nClinton has a lot of advantages in Virginia. There are wide spread reports of voter fraud in favor of Clinton, the northern Virginia blue vote will be a huge benefit and her running mate Tim Kaine has deep organization across the state. \\nThat said, Clinton should be dominating in the polls and instead they’re tightening across Virginia in ways they shouldn’t all things considered. On October 19th Clinton lead in the average by nearly 10%. That lead has been cut to just 4.7%, nearly within the margin of error. \\nMICHIGAN \\nOur sources in Michigan are telling us Trump is gaining massive steam in the state. It’s all about turnout and according to FiveThirtyEight if the popular vote is within 2 points Donald Trump has a 40% chance of picking off Michigan. \\nOn October 18th the Fox 2 Detroit poll had Clinton up by 13%. Two days ago that same poll had Clinton up by 3%, a lead that sits within the margin of error. \\nOHIO \\nIn pretty much all polls for Ohio over the past several weeks Donald Trump has consistently held a 5% advantage. This plus the fact that there has not been a major poll released after the bombshell FBI news has us confident Ohio is now in Trump’s favor. \\nIf our projection holds, Trump only needs 11 electoral votes for victory at the 270 mark. And as you can see below, there are a plethora of ways he can accomplish that. All of them, however, are very challenging. \\nThat challenge exists for Clinton as well. \\nNote : Our projection is based on corrected sample weight for a broad variety of polling combined with early voting statistics. CURRENT PROJECTED ELECTORAL VOTE STANDINGS HILLARY CLINTON DONALD TRUMP 259 ELECTORAL VOTES \\nNote: Orange denotes states that cannot yet be projected. Hover over each state to reveal electoral vote counts. AL'"}, "time": 1742562212.30228}