{"duration": 1.5089256763458252, "input_args": {"text": "'Click for full size picture.(118K) My Theory \\nMy theory of the downing of the aircraft is derived from the two reported wreckage sites, the lie about the weather given out by the government, and the loss of three radio links at the same time while the plane was still 7 miles from the crash site. SIGNS THE PLANE WAS SABOTAGED. \\nFirst off, the claims made in both TIME and NEWSWEEK that Ron Brown\\'s plane crashed in the \"worst storm in a decade\" are directly contradicted by the weather report issued by the Dubrovnik Airport Tower adjacent to the crash site. The storm simply did not exist. \\nWhile the plane carrying Ron Brown and his party was still 7 miles from the crash site, 1/2 mile in the air and on the normal approach path, three radio based links with three separate propagation paths all failed at the same time. \\nAccording to the Aviation Week & Space Technology article, the Dubrovnik tower lost voice radio contact at the same time the aircraft vanished from the screens of the approach radar at Split and an AWACS. \\nLet\\'s look at the Split radar first. \\nThe Split radar watches the approach to Dubrovnik airport, which is where the Ron Brown aircraft was when it dropped off of the radar screen. Contrary to some silly claims made in this newsgroup before, the plane was NOT flying in the mountains. It was out over the water, with open space all around. The radar at Split routinely tracks aircraft through that airspace without problem. If it were normal for the Split radar to lose traffic at that point on the approach path, nobody would have mentioned it because it would be normal and expected behavior. Nothing unusual about it. That comment was made about the target dropping off of the Split radar establishes that it was an unusual event. \\nThe Split radar, like all ATC radar, tracks primarily by aircraft transponder. So, when the Split radar lost track of the Ron Brown aircraft, what was lost was the transponder return, as the aircraft was still on the approach path, although just starting to veer slightly left. \\nNow let\\'s look at the AWACS. \\nThe AWACS system is designed to track NON-transpondered targets. Radar \"hits\" are placed in a computer system that keeps a list and tries to match the returns from the present radar sweep to the returns from the previous sweeps in order to generate meaningful target tracking data for the operators and weapons management systems. Part of that process involves target to target comparisons to make certain that what the computer thinks is target XYZ this sweep is the same target it thought was XYZ last sweep. The total workload on the computer is a power function of the total number of non-transpondered targets being carried in the target list. \\nIf a target has a transponder, the AWACS will track the target using the transponder return, because not only is less computer power needed for a transpondered target, but the workload for non-transpondered targets is reduced. \\nHow do we know that the AWACS was tracking the Ron Brown plane via transponder? Because the AWACS lost it\\'s track at the same time that the Split radar lost it\\'s transponder return. Had the AWACS been tracking the Ron Brown plane via skin-paint, there is no reason for it to lose track of the aircraft at the same time that Split did. \\nHad the AWACS not reported losing contact, we could surmise that either the AWACS was tracking on skin paint or the Split radar suffered a momentary failure, but this was not the case. \\nIt is also true that the AWACS could have immediately reacquired the Ron Brown aircraft on skin paint (and it\\'s not known for a fact that the computers did not add it as a non-transpondered target), but the AWACS was there to watch Bosnia, not the Dubrovnik airport. \\nThe two radar tracks, propagating along two different paths, come together at only one common point where a single failure could make the aircraft vanish from both Split and the AWACS, and that is the radar transponder in the Ron Brown aircraft. A failure of the transponder is the only explanation for the Ron Brown plane vanishing from two different radar screens at the same time, while still 7 miles from the crash site and 1/2 mile above the Adriatic sea. \\nAt the same time that the aircraft vanished from the radars at Split and the AWACS, the Dubrovnik tower reported it lost voice radio contact with the aircraft. \\nThis is a third distinct propagation path from the AWACS and Split. In fact, it\\'s direct line of sight from the Dubrovnik tower to the location on the approach path where radio contact was lost. There are no intervening geological features to block the radio signal. The Dubrovnik tower continued to communicate with other aircraft in the area, so the radios in the tower were not at fault. \\nThe data reported in the Aviation Week & Space Technology article shows evidence that TWO SPERATE SYSTEMS on board the Ron Brown aircraft failed at the same time. The cockpit radios, and the radar transponder. \\nThe radios and radar transponders come together at only one common point where a single failure could make the aircraft vanish from both Split and the AWACS AND lose voice radio contact with the Dubrovnik tower, and that is is the electrical system failed in mid air, while still 7 miles from the crash site and 1/2 mile above the Adriatic sea, on the approach path. How Do We Know The Problem Extended Beyond The Electrical System? \\nSimple. Prior to the loss of radio, the flight crew had acknowledged receiving a weather report. They knew there was clear air beneath them. There is only one reason for the flight crew, suddenly without any instruments at all, not to descend out of a cloud layer into the clear air they knew was below them, and that\\'s if the event that severed the electrical cables also severed the flight control cables, which occupy the same midline conduit in the 737. Possible Trigger? \\nGiven the unscheduled nature of the trip, a timer would be useless to pinpoint the exact geographic location of the detonation. However, knowing the approach pattern into the airport, a location over the Adriatic can be selected by the altitude of the aircraft along the glide slope. \\nThe simplest explanation which fits the twin wreckage sites and the early news reports of a water crash is that of an altitude triggered bomb, placed on the aircraft prior to departure. As the aircraft climbs above a certain altitude, the device is armed. As the aircraft descends through the trigger altitude, say, 2000 feet, the device detonates. Why Did The Plane Make It To Shore? \\nAs the reports have pointed out, the weather was not ideal. The pilot, even with the best navigation aids in the world, would be fully justified in delaying his descent in order to stay in clear air as long as possible, then ducking quickly down through the clouds to find the airfield. \\nThis means that the altitude triggered bomb would have detonated far closer to land than expected, with the result that portions of the wreckage came on shore. \\nThe 7 mile spread between wreckage sites indicates an airborne event which blew part of the aircraft off. The same 7 mile distance, coupled with the shallow impact angle suggests that the aircraft was still flyable and that the pilot may have been trying to make it to the airfield when the crash into the hill occurred. Was Thermite Used? \\nIt\\'s impossible to state, based on the information available to the public. But thermite is a definite possibility. It can be made using available materials and will not show up on the various detectors which would sense chemical explosives such as C-4. Thermite, when ignited, burns at half the temperature of the surface of the sun and would burn through the aluminum of an aircraft with ease. Packed in a suitcase near the top of the baggage compartment of the converted 737, it would be in an ideal location to sever the control linkages and to short out the plane\\'s electrical system, as well as burning a hole through the skin, dumping debris into the ocean. How Bad Was The Weather? \\nThere were several reports in the media that Dubrovnik was in the grip of the \"Worst Storm of the Decade\". This is not true. As can be seen by the weather information contained in the Aviation Week Article, and the first news articles from Reuter\\'s, the weather was not exceptionally bad. Indeed, the wind conditions were excellent, providing a 12 knot head wind with no cross component at the runway, perfect landing conditions. Below the overcast at 2000 feet, visibility was 8km or 5 miles. Assorted News Articles WASHINGTON, April 3 (UPI) -- A U.S. Air Force plane carrying Commerce Secretary Ron Brown in the Adriatic Sea near the port city of Dubrovnik on Tuesday, officials said. The White House said wreckage was spotted in the Adriatic Sea near Dubrovnik. The debris apparently came from the plane, which was carrying Brown and an undetermined number of leading U.S. business executives, who were on a trade mission to Bosnia-Herzegovina. ``The wreckage in the Adriatic is his,\\'\\' a Pentagon official told United Press International, speaking on condition of anonymity. NATO officials at Aviano Air Base in Italy said the plane crashed while on approach to the Dubrovnik airport. They said a rescue mission from a French aircraft carrier was the first on the scene, and the search for survivors was later joined by U. S. helicopters and C-130 aircraft. Croatian officials told CNN that the plane crashed into a mountain near Dubrovnik, but the report could not be immediately confirmed. NATO said the plane disappeared from radar at 2:55 p.m. local time, three minutes after it had been cleared for landing by Dubrovnik traffic controllers. The craft was identified as a T-43, the military equivalent of a Boeing 737. White House Press Secretary Mike McCurry said the plane was three hours overdue on landing in Dubrovnik from Tuzla in northern Bosnia- Herzegovina, and that there was no indication of foul play related to the plane\\'s crash. ``Mechanical was the likely reason for the crash. Nobody could plant a bomb on the plane in Tuzla (which is operated by the U.S. military). If it\\'s over the sea nobody\\'s gonna shoot it down,\\'\\' the Pentagon official said. The chances of anyone surviving the crash are ``somewhere between slim and none,\\'\\' he said. The T-43, was used by U.S. Secretary of Defense William Perry and Secretary of State Warren Christopher during their recent trips to the Balkans. Officials said weather conditions were extremely poor near Dubrovnik at the time of the crash. Brown, 54, was traveling with 27 passengers and about 12 crew members, including U.S. business leaders who were seeking to help develop Bosnia after the country\\'s four-year war. The White House said it was looking into who was actually aboard the plane. The delegation was to proceed to Zagreb, the Croatian capital, to meet Croatian political leaders and local U.S. businessmen. Brown was to return to Washington on Friday. U.S. President Bill Clinton canceled a planned appearance at the Justice Department following reports that the plane was missing. Brown had been due to spend three days in Bosnia-Herzegovina and Croatia, joining business leaders in meetings with local government and business leaders in a bid to stimulate U.S. investment in the war- ravaged region. Brown also had been meeting during his tour with U.S. soldiers assigned to the region\\'s multinational peacekeeping mission. Brown told reporters Tuesday in Paris that rebuilding the region would cost an estimated $5.1 billion. World Bank President James Wolfensohn also was touring the region this week, and a conference of donor nations was scheduled for next week in Belgium. WASHINGTON, April 3 (UPI) -- A U.S. Air Force plane carrying Commerce Secretary Ron Brown crashed in the Adriatic Sea near the port city of Dubrovnik on Wednesday, officials said. The White House said wreckage was spotted in the Adriatic Sea near Dubrovnik. The debris apparently came from the plane, which was carrying Brown and an undetermined number of leading U.S. business executives, who were on a trade mission to Bosnia-Herzegovina. ``The wreckage in the Adriatic is his,\\'\\' a Pentagon official told United Press International, speaking on condition of anonymity. NATO officials at Aviano Air Base in Italy said the plane crashed while on approach to the Dubrovnik airport. They said a rescue mission from a French aircraft carrier was the first on the scene, and the search for survivors was later joined by U. S. helicopters and C-130 aircraft. NATO said the plane disappeared from radar at 2:55 p.m. local time, three minutes after it had been cleared for landing by Dubrovnik traffic controllers. The craft was identified as a T-43, the military equivalent of a Boeing 737. White House Press Secretary Mike McCurry said the plane was three hours overdue on landing in Dubrovnik from Tuzla in northern Bosnia- Herzegovina, and that there was no indication of foul play related to the plane\\'s crash. ``Mechanical was the likely reason for the crash. Nobody could plant a bomb on the plane in Tuzla (which is operated by the U.S. military). If it\\'s over the sea nobody\\'s gonna shoot it down,\\'\\' the Pentagon official said. The chances of anyone surviving the crash are ``somewhere between slim and none,\\'\\' he said. The T-43, was used by U.S. Secretary of Defense William Perry and Secretary of State Warren Christopher during their recent trips to the Balkans. Officials said weather conditions were extremely poor near Dubrovnik at the time of the crash. Brown, 54, was traveling with 27 passengers and about 12 crew members, including U.S. business leaders who were seeking to help develop Bosnia after the country\\'s four-year war. The White House said it was looking into who was actually aboard the plane. The delegation was to proceed to Zagreb, the Croatian capital, to meet Croatian political leaders and local U.S. businessmen. Brown was to return to Washington on Friday. U.S. President Bill Clinton canceled a planned appearance at the Justice Department following reports that the plane was missing. Brown had been due to spend three days in Bosnia-Herzegovina and Croatia, joining business leaders in meetings with local government and business leaders in a bid to stimulate U.S. investment in the war- ravaged region. Brown also had been meeting during his tour with U.S. soldiers assigned to the region\\'s multinational peacekeeping mission. Brown told reporters Tuesday in Paris that rebuilding the region would cost an estimated $5.1 billion. World Bank President James Wolfensohn also was touring the region this week, and a conference of donor nations was scheduled for next week in Belgium. WASHINGTON, April 3 (UPI) -- A U.S. Air Force plane carrying Commerce Secretary Ron Brown and a high-level trade mission crashed Wednesday near the port city of Dubrovnik, officials said. The White House said wreckage was spotted in the Adriatic Sea near Dubrovnik. The debris apparently came from the plane, which was carrying Brown and an undetermined number of leading U.S. business executives, who were on a trade mission to Bosnia-Herzegovina. McCurry said later that two possible crash sites were being investigated, one and land and one in the sea. The first site was based on civilian reports of wreckage at sea. Croatian sources informed U.S. officials of a site on land approximately 10 miles (15 km) southeast of Dubrovnik. The Croatian state news agency reported the bodies of three men and one woman had been recovered at the location near Velido, a town in the mountains south of Dubrovnik. NATO officials at Aviano Air Base in Italy said the plane crashed while on approach to the Dubrovnik airport. They said helicopters from a nearby French frigate and U.S. ships were the first on the scene, and the search for survivors was later joined by U.S. helicopters and a C-130 aircraft. NATO said the plane disappeared from radar at 2:55 p.m. local time, three minutes after it had been cleared for landing by Dubrovnik traffic controllers. The craft was identified as a T-43, the military equivalent of a Boeing 737. White House press secretary Mike McCurry said officials were alerted when the plane was three hours overdue for a scheduled landing in Dubrovnik from Tuzla in northern Bosnia-Herzegovina, and that there was no indication of foul play related to the plane\\'s crash. ``Mechanical was the likely reason for the crash. Nobody could plant a bomb on the plane in Tuzla (which is operated by the U.S. military). If it\\'s over the sea, nobody\\'s gonna shoot it down,\\'\\' a Pentagon official said. The chances of anyone surviving the crash are ``somewhere between slim and none,\\'\\' he said. The same T-43 plane was used by U.S. Secretary of Defense William Perry and Secretary of State Warren Christopher during their recent trips to the Balkans. Officials said weather conditions were extremely poor near Dubrovnik at the time of the crash. Brown, 54, was traveling with about 27 passengers and crew members, including U.S. business leaders who were seeking to help develop Bosnia after the country\\'s four-year war. The White House said it was looking into who was actually aboard the plane. Commerce spokeswoman Maria Cardona said they were still unsure which of the 12 business executives and approximately 10 Commerce employees accompanying Brown were actually aboard the plane. U.S. officials confirmed that Harza Engineering Co. Chairman John Scoville of Chicago, Ill., and ABB Inc. President Robert Donovan of Norwalk, Conn., were aboard the plane with Brown. Other business leaders including transportation and telecommunications business leaders were traveling with Brown, but several had left to travel on their own since Tuzla. The delegation was to proceed to Zagreb, the Croatian capital, to meet Croatian political leaders and local U.S. businessmen. Brown was to return to Washington on Friday. U.S. President Bill Clinton canceled all his business for the day and visited the Brown family home in Washington, where he was receiving information on the crash. Brown had been due to spend three days in Bosnia-Herzegovina and Croatia, joining business leaders in meetings with local government and business leaders in a bid to stimulate U.S. investment in the war- ravaged region. Brown also had been meeting during his tour with U.S. soldiers assigned to the region\\'s multinational peacekeeping mission. Brown told reporters Tuesday in Paris that rebuilding the region would cost an estimated $5.1 billion. World Bank President James Wolfensohn also was touring the region this week, and a conference of donor nations was scheduled for next week in Belgium. WASHINGTON, April 3 (UPI) -- President Clinton, awaiting final word Wednesday on the fate of his friend and political ally, Commerce Secretary Ron Brown, made emotional visits to Brown\\'s home and the federal department where he spoke to distraught federal workers. After hearing mid morning that the military plane carrying Brown had crashed near the Adriatic Coast in Croatia, Clinton wasted little time in sharing his grief and trying to console the Brown family, friends and workers. The Browns have a son, Michael, and a daughter, Tracey. A family spokesman said the Browns were still ``holding out hope.\\'\\' The president and first lady Hillary Rodham Clinton, dressed in dark suits and wearing solemn faces, spent nearly an hour at Brown\\'s Washington home where he lived with his wife Alma. Couriers also arrived with flowers from well-wishers, and the Secret Service checked each bunch before allowing them into the townhouse. The Clintons emerged from the home, located in the affluent secluded, Chatworth neighborhood of Washington, with their heads down and the first lady appearing to choke back tears. Brown was head of the Democratic National Committee when Clinton was the party\\'s presidential nominee in 1992, and he was greatly credited with playing a key role in putting a Democrat in the White House. After the visit with the family, the Clintons immediately headed across town to Commerce Department headquarters, where the president addressed employees who packed the auditorium. Clinton told the gathering that he, his wife and other administration officials came ``to be with the employees of the Commerce Department at this very difficult hour.\\'\\' ``The plane carrying Secretary Brown and his delegation, including a number of your colleagues, business leaders, and leaders of the United States military, went down today near Dubrovnik, Croatia,\\'\\' Clinton told the workers. ``We do not know for sure what happened there.\\'\\' Clinton said he asked Brown\\'s wife what he should tell the department workers. ``She said, \\'Tell them Ron was proud of them, that he liked them, that he believed in them, and that he fought for the Commerce Department. And tell them that you\\'re going to do that now,\\'\\'\\' Clinton said, winning sustained applause from the crowd. Many of the hundreds of department employees were visibly shaken at the news, with many crying and others holding and consoling one another. Also present at the Commerce Department when Clinton spoke were several Cabinet secretaries, including Attorney General Janet Reno, Agriculture Secretary Dan Glickman, Housing and Urban Development Secretary Henry Cisneros, Health and Human Services Secretary Donna Shalala, Education Secretary Richard Riley and Interior Secretary Bruce Babbitt. Vice President Al Gore and the first lady also joined Clinton at the Commerce Department. Earlier, Sen. Ted Kennedy, D-Mass., visited the Brown family to express his condolences. Brown was Kennedy\\'s chief of staff before going to the Urban League and Democratic National Committee. Clinton named him Commerce secretary in 1993. Another visitor was Vernon Jordan, former head of the Urban League and now a high-powered Washington lawyer and unofficial adviser to Clinton . A U.S. Air Force T-43, which is the military equivalent of a Bowing 737, carrying Brown and his entourage from Tuzla to Dubrovnik, crashed into a mountain near the Adriatic Sea coast. But officials were writing off the possibility of foul play. ``There hasn\\'t been any report over here indicating anything hostile, but again we can\\'t confirm that,\\'\\' White House spokesman Mike McCurry said. Republicans in Congress have been working to dismantle the Commerce Department, although a GOP aide said Wednesday the effort may be scrapped following the crash of Brown\\'s plane. WASHINGTON (Reuter) - President Clinton\\'s wife, Hillary, and daughter, Chelsea, flew on the same plane last week that crashed in Croatia with Commerce Secretary Ron Brown aboard, U.S. Air Force sources said Wednesday. A military version of the widely used Boeing 737 passenger jet flew Mrs Clinton and her 16-year-old daughter from the Turkish capital of Ankara to the ancient biblical city of Ephesus and on to Istanbul last Wednesday. The T43A plane, with a tail number of 1149, was based at the U.S. air base at Ramstein, Germany, the sources said. Mrs Clinton used it rather than the Boeing 707 assigned to her for a week-long goodwill tour of southern Europe because of the short runway at Ephesus. The same plane was used to ferry Defense Secretary William Perry in and out of Bosnia last week. Mrs Clinton also visited the Yugoslav region during her trip but used a giant C-17 military cargo jet for that leg of her journey. UPDATE'"}, "time": 1742563611.8458161}