{"duration": 0.04318499565124512, "input_args": {"text": "'The April 2 episode of HBO’s Girls finds Hannah Horvath  —   played by actress Lena Dunham  —   hearing from her gay friend Elijah that the baby she is carrying is a “parasite” growing inside of her. [The episode, titled “What Will We Do This Time About Adam?” shows Hannah, well along in her pregnancy, reevaluating her decision to be a single mother.  “Oh, God. Hannah, this is gonna be a real mindf**k for me if you wanna get an abortion right now,” Elijah tells her. “I mean   …     I’ll do it. I think there’s about two doctors in America that do it at this stage in your pregnancy, but I’ll find them. ” Writing at Newsbusters, Dawn Slusher observes some of the “fake” information about   abortion that Girls serves up in this episode  —   first and foremost being Elijah’s reference to the difficulty in finding an abortionist to perform one: “There are not just ‘two doctors in America’ who will ‘do it at this stage.’ There are actually 162 abortion clinics that perform abortions after 20 weeks. Secondly, most don’t realize just how easy getting a   abortion is legally, given the loose definition of “health” that was buried in Roe v. Wade’s companion case, Doe v. Bolton: ‘  …     all factors  —   physical, emotional, psychological, familial, and the woman’s age  —   relevant to the wellbeing of the patient. All these factors may relate to health.’ All Hannah needs to say is that she has a headache, is too young, too tired, or is having anxiety about having a baby and she can legally get an abortion at any point in her pregnancy. ” At the federal level, abortion is still legal in the United States up until the time of birth, although more states are  enacting laws that restrict the procedure. The abortion industry has fought against any attempts by states to restrict abortion or to mandate health and safety standards in abortion clinics. Its allies in the liberal media portray abortion as a safe procedure that is welcomed by women. In its recent report titled “Unsafe: The Public Health Crisis in America’s Abortion Clinics Endangers Women,” Americans United for Life (AUL) demonstrates in its analysis the many state officials who look the other way when it comes to inspections of abortion clinics. The organization asserts: “Importantly, even limiting the scope of our investigation to the last eight years, efforts to discern the true state of abortion practices was stymied by a dearth of protective laws in a number of states, a lack of reporting in others, and limited public availability of information on abortion providers in still more states. ” “We can easily deduce, therefore, that the epidemic of substandard abortion practice is worse than even these pages show,” AUL states.'"}, "time": 1742564580.6714861}