{"duration": 0.1031961441040039, "input_args": {"text": "'Germans want to breathe Russian natural gas without Ukraine 26.10.2016 The current goal of the German establishment is to please the Americans and keep business with the Russians afloat at the same time. The Germans now try to present the Nord Stream-2 gas pipeline as a purely commercial project. The pipeline will be built, despite the anti-Russian hysteria in Poland, Latvia and Ukraine. The economic war with Russia In July 2016, spokesman for the President of Poland Andrzej Duda told the Financial Times (FT), that Duda and Obama were opposed to the construction of the Nord Stream-2. For the US, it goes about the formation of unwanted relations between Russia and the EU, particularly between Russia and Germany. The Americans also hope to push Europe to the construction of LNG terminals (liquefied natural gas) of the American production, of course. Print version Font Size The Americans want to convince Brussels that you the EU must not let Russia build the pipeline system bypassing Ukraine. Such a move would deprive the pro-American Kiev of two billion dollars in annual revenues. On the other hand, several countries of Eastern and Central Europe will remain dependent on Russian supplies for another 30-50 years, even against the backdrop of the \"economic warfare.\" Therefore, US officials suggest the EU should start forming an alternative gas transport structure. German companies, for instance, could buy natural gas from Norway, and Italian companies could acquire LNG from Spain. Yet, the Norwegian natural gas will be expensive and even more expensive, whereas Spain will never be able to meet common European demands. Poland says a big, big no to the project on all possible fronts, acting in information, legal and financial fields. Another agent of Washington\\'s influence, Latvian President Raimonds Vejonis said after meeting with his Estonian counterpart in Riga that North Stream-2 did not correspond to common European objectives and energy principles of the European Union. This project is more a geopolitical, rather than an economic one, said Vejonis. Ukraine is very much opposed to the project too, of course. In January, Naftogaz of Ukraine filed a complaint at the European Energy Community, which was then sent to the European Commission. According to Ukraine, the EU may violate its own legislation if the Nord Stream-2 materialises. It goes about the Third Energy Package, which says that the gas producer can not be the owner of the pipeline. All goes well in Germany Germany is quite perplexed as well. Manfred Weber, the leader of the conservative European People\\'s Party in the European Parliament, told Der Spiegel that the possibility to introduce new sanctions against Russia and its leadership must remain on the table. In addition, the Nord Stream-2 will not be built if President Putin does not stop dropping bombs on civilians. German Minister for Foreign Affairs Frank-Walter Steinmeier does not hear such calls. On Sunday, he told ARD that new sanctions against Russia would be counterproductive. \"What works in Ukraine, does not have to be a right solution in Syria. We need Russia to achieve peace in Syria,\" the minister said. Steinmeier understands that new sanctions would certainly halt the North Stream-2. The Germans say now on a federal level that this pipeline is purely a commercial project without any geopolitical innuendos, so it is not subject to the sanctions pressure. The pipeline will reduce the price for German consumers by 20 percent, so Germany\\'s concerns are easy to understand. \"Due to the extension of the Nord Stream system, we will provide reliable gas supplies for Germany and the EU for a long period of time. This project will strengthen more than 40 years of our successful cooperation with Gazprom,\" the official website of the Nord Stream-2 says, quoting Klaus Schaefer, BASF CEO. The Germans pretended not to have noticed Poland\\'s failure to register a joint venture of international consortia. A failure to register the project within the scope of the EU means that each applicant will have to independently look for opportunities to contribute to the project. Noteworthy, Gazprom owns a stake of 51 percent stake in the project, while E.ON, Shell, OMV and BASF/Wintershall - ten percent each, and Engie - nine. Director of Nord Stream-2 Public Relations Ulrich Lissek remains positive and sees no technical difficulties. The work on the project goes according to plan, and the system is expected to be launched in late 2019. It is in 2019 when Russia is expected to withdraw from the Ukrainian gas transit system. The capacity of two sections of the Nord Stream will make up about 120 billion cubic meters of gas per year, plus the Turkish Stream - 31.5 billion. This will be enough to replace the capacity of the Ukrainian pipeline, which now supplies about 60 billion cubic meters per year. By 2019, Ukraine will remain only an option for import routes, and Europe understands it. Lyuba Lulko Read article on the Russian version of Pravda.Ru Europe sells Ukraine for gas'"}, "time": 1742564449.5328577}