{"duration": 0.0926518440246582, "input_args": {"text": "'  organization Live Action continues its series of undercover videos investigating Planned Parenthood’s claim that it offers “  care” to pregnant women. [In the video below, Live Action investigators called Planned Parenthood affiliates throughout the country, asking if they could have an ultrasound to check on the health status of their unborn baby:   “Oh, we won’t be able to tell you if it’s healthy or the gender,” says a Planned Parenthood staff member in Farmington, New Mexico. “If you’re, you know  —   we specialize in abortions. You know, that’s what our ultrasounds are for, to see how far along the, um, patient is. ” At Planned Parenthood in St. Paul, Minnesota, a worker states, “We do [ultrasounds] when, um, when performing abor  —   um, abortion procedures. ” In Corning, New York, a Planned Parenthood staff member explains, “No, we only do  —   we only do ultrasounds if you are terminating. ” “We have to do an ultrasound with an abortion, but we don’t offer them for  —   we can’t do anything to make sure that the pregnancy’s fine,” says a Planned Parenthood employee in St. Louis, Missouri. At a press conference on Capitol Hill Thursday, Live Action President Lila Rose was joined by U. S. Reps. Diane Black ( ) Vicky Hartzler ( ) Ann Wagner ( ) Trent Franks ( ) Chris Smith ( ) Steve King ( ) and other members of Congress to promote the defunding of Planned Parenthood and the redirection of its taxpayer funds to other federally qualified healthcare centers that provide comprehensive services for women without abortions. “The reality is Planned Parenthood’s focus for pregnant women is abortion,” Rose said at the press conference. “It’s not   care. It’s not serving young mothers, promoting them, supporting them it’s abortion. ” “Women in our country deserve far better than abortion,” she continued. “Far better than to be seen as, ‘You need abortion in order to achieve your dream, in order to live your life, in order to have your career and your family the way you want,’ and we reject that. ” “I can think of no organization in the recent history of the world that has deceived the world more than Planned Parenthood,” said Rep. Franks, noting that the abortion chain’s president, Cecile Richards, has claimed defunding Planned Parenthood would be harmful to women. “Live Action’s investigative video series has completely exploded this ridiculous lie,” he added. “The truth is Planned Parenthood is the largest perpetrator of abortion in America, mercilessly killing some 300, 000 human babies a year. ” “Planned Parenthood is not interested in providing health care to women,” said Rep. Hartzler. “Its exclusive mission and its area of expertise is abortion. If Planned Parenthood’s mission is to serve the health needs of women, they are failing miserably. ” Rep. King said Americans must look hard at the morality of abortion and the fact that “we are borrowing money from China to fund Planned Parenthood. ” “If we fail to [defund Planned Parenthood] during this 115th Congress, shame on us,” he said. The first video of Live Action’s new campaign exposed Planned Parenthood’s marketing of   care in support of its bid for taxpayer dollars. The   group’s investigators were turned away at 92 different facilities, where Planned Parenthood staff said they do not provide   care, but do specialize in abortions.'"}, "time": 1742564338.1687534}