{"duration": 0.02638077735900879, "input_args": {"text": "'After more than 100 years, an international team of physicists has confirmed that Einstein’s gravitational waves do in fact exist and that he was right all along. This is one of the biggest astrophysical discoveries of the in history. \\nVia UsualRoutine \\n\\nAbout one month ago American theoretical physicist, Lawrence Krauss tweeted that the discovery was being peer-reviewed and that we would soon confirm tha light-speed ripples in the Universe actually exist. The gravitational wave signal were first detected by physicists at LIGO on September 14 last year, experts expect that the discovery will win the Nobel Prize.\\nThe discovery confirms Albert Einstein’s 1915 general theory of relativity and opens an unprecedented new window onto the cosmos. This is the first time, scientists have observed ripples in the spacetime theory called gravitational waves, arriving at the earth from a cataclysmic event in the distant universe. And the event that triggered it was likely to have been caused by the final fraction of a second of the merger of two black holes to produce a single, more massive spinning black hole. Physicists say that the two black holes merging had been predicted but never observed.\\nCredentials provided by Australian Science Media Centre: The LIGO Observatories are funded by the National Science Foundation (NSF), and were conceived, built, and are operated by Caltech and MIT.\\nThe discovery, accepted for publication in the journal Physical Review Letters, was made by the LIGO Scientific Collaboration (which includes the Australian Consortium for Interferometric Gravitational Astronomy (ACIGA) and the GEO600 Collaboration) and the Virgo Collaboration using data from the two LIGO detectors.\\nAustralian scientists from The Australian National University (ANU), the University of Adelaide, The University of Melbourne, the University of Western Australia (UWA), Monash University and Charles Sturt University, contributed to the discovery and helped build some of the super-sensitive instruments used to detect the gravitational waves. source \\n'"}, "time": 1742562304.2861998}