{"duration": 0.20214152336120605, "input_args": {"text": "'Cache Valley Prepper November 18, 2016 Cosmic Weather Executive Order: What Does It Mean? \\nDoes the government know something that we don’t about what is going to happen to our power grid? \\nThe latest executive order on cosmic weather certainly has some folks in the survival community scratching their heads. Do you know why? Because it doesn’t help you much, but leaves you survive on your own. \\nPresident Obama says he recognizes that naturally occurring EMP’s “ could disable large portions of the electrical power grid, resulting in cascading failures that would affect key services such as water supply, healthcare, and transportation. ” \\nFirst off, understand that the type of EMP caused by cosmic weather would only affect equipment connected to the power grid, land lines or other very long conductors, so it would not affect your car … until you need to buy gasoline or you phone … until you need to connect to the internet or a cell tower. \\nWhat we are most concerned about with this type of EMP is damage to the infrastructure that we all depend on, specifically the large transformers in the power grid which are custom built (mostly overseas) and have lead times measured in years. \\nWhy only address naturally-occurring EMP and not nuclear high-altitude EMP? \\nI think the answer to that is simply that existing executive orders, COG (Continuity of Government) and NIPP (National Infrastructure Protection Plan) already cover protection of key infrastructure in the event of acts of war or terror attacks, so that train has already left the station – no power or budget to grab or rights to infringe upon there. \\nWhy is important, other than that your internet will be down and credit and bank cards won’t work, is that a severe space weather event could knock out the US power grid and reshape the balance of power in the world. \\nRussia claims its grid is hardened against EMP and China runs major EMP-response exercises. Every former superpower is making preparations in case of EMP attack and virtually all substantial enemies of the US either are in the process of developing or already have EMP weapons. \\nThe US has EMP weapons programs and we have upgraded a few key segments of our communications infrastructure, so it is clear that our leadership is aware of the threat EMP poses, but we haven’t funded any significant national preparation. \\nScientists have been beating politicians over the heads with EMP scenarios for decades now, but they don’t seem to care much about it. \\nWhy hasn’t the US already made preparations in case of EMP? \\nAccording to Dr. Peter Pry, a member of the congressional EMP Commission and executive director of the Task Force on National and Homeland Security, the power industry is afraid of over-regulation. \\nThat is why it is using its considerable power to lobby against any EMP preparation and crank out junk science a la “lead is good for you because it occurs naturally,”“smoking is not harmful to your health,” and “we would starve without GMO foods and high fructose corn syrup” only this time it’s “EMP only affects the power grid in movies.” \\nDon’t let the fact that the rest of the world is united on the matter that the EMP is a threat fool you. Here in the USA, we reserve the right to be ignorant and listen to K Street lobbyists and the best scientists they can buy instead of our best scientific minds. \\nWarning have yielded both grassroots and congressional efforts, such as the Shield Act, which have been blocked at every turn by the power lobby for well over a decade now. This opened the door for Barrack Obama, who claims not to need congress because he has a phone and a pen, to step in an issue the executive order. \\nIn October of last year, the White House published the 2015 National Space Weather Plan, which sets two goals: to improve our detection capabilities (warn us a few hours before the EMP), and to strengthen our capability to respond to the needs of the people after an EMP has damaged the grid. \\nWhy not a comprehensive EMP plan to harden the grid against both types of EMP? \\nBecause existing executive orders already cover EMP of the nuclear high-altitude variety under war and terrorism, so there wasn’t any additional power or funding to grab. \\nAt a glance, the plan seems like perhaps a step in the right direction, but dig deeper and its more social programs and less privacy, thinly disguised as a preparedness plan. About the only thing that could make this plan worse is if it was truly this president’s best effort to protect the nation from EMP. \\nWhy am I not excited about the government finally creating a plan to deal with EMP, even if it is only naturally-occurring EMP? The Obama regime used this as pretext to violate privacy rights by making GPS constellation data publicly available. Obama’s plans for EMP preparedness don’t mean boo unless they are funded and they will not be funded without congress. Simply passing an executive order does not change that. Most of page 2 of the White House plan is basically a disclaimer that the plan is not a budget document and that funds to carry out the plan would granted through the budget process. An effective POTUS does not simply throw out an idea and then blame congress for not approving funds that don’t exist to implement a plan when there was already another, better plan on the table. Instead of the one-time investment of $2 billion to fix the problem and harden the US electrical again against BOTH kinds of EMP that the Shield Act asks for, it would invest in capability to warn us a few hours ahead of an EMP and then attempt to put Humpty Dumpty back together again after our large transformers have melted . This is a reactive, “social aspirin and Band-aid” patch job that invests in social programs instead of a proactive permanent fix for the chronic problem. No funding for joint DOD – FEMA Training Exercises. Instead he directs the heads of agencies to work together “consistent with their ongoing activities” referring to the 2015 National Space Weather Action Plan. \\nSomebody needs to tell the White House that it won’t matter if people have health insurance if they are going to be without electricity for up to 4 years. Maybe that is a length of time they can get their heads around. \\nThe US has been operating in an utter leadership vacuum for nearly two terms now, arguably much, much longer. We could permanently fix the EMP threat to our grid for about what we spend on climate change research in a year. \\nThe US could have long ago joined the growing list of nations making earnest preparations against EMP, but is not course our benevolent leader has chosen. \\nThe FEMA – DOD turf war is going to cost untold millions of lives in a severely damaging EMP \\nHurricane Katrina was a minor event when compared to losing the US electrical grid for years, but it serves as an example of the consequences of the FEMA – DOD turf war. The states tried to handle the disaster themselves to capture Federal funding and everyone had to sit on their hands until they asked for help. \\nBut by then, they had trouble even contacting the Federal Government to ask for help, so precious time was lost, which translated to lives lost. Then the Federal government sends in FEMA, who sealed off the disaster area and takes its shot at the prize budget money. \\nThe military still couldn’t do anything until they were asked. FEMA ended up running around like a chicken with its head cut off because it was also outclassed by the scope of the event, losing more time and lives until FEMA finally asks for DOD. \\nWhy did the DOD need to be involved in Katrina and will they inevitably need to be involved in a large-scale EMP? \\nBecause FEMA has thousands of employees where DOD has millions. FEMA can call subcontractors and pay them to deliver trailers or loads of supplies. DOD can coordinate colossal airlifts and entire fleets of ships. We cannot handle an emergency of this magnitude without the DOD, so FEMA needs to get let that sink in now, BEFORE an EMP. \\nThe FEMA budget is not going to matter. FEMA is going to go down in history as crewing the Titanic in this scenario and the post-EMP agency that replaces FEMA will not resemble the pre-EMP FEMA, that is, if the USA even still exists as such after China lays down the terms for the replacement of our large transformers. \\nWhat would a competent leader would have done Fund NASA and the National Foundation of Sciences Studies that would debunk the junk science funded by the power industry lobby. Educate the public about the threat. Pass the Shield Act and harden the grid against space weather and nuclear EMP alike instead of an unfunded plan followed by an executive order. Get the DOD and FEMA working and training together before the catastrophe and give them funding to do it instead of just telling the directors to work together “consistent with their ongoing activities.” \\nSo what does Obama’s executive order on cosmic weather mean for you? \\nIt means that, as usual, you are largely on your own. The only preparations that you can count on are ones you have made yourself and with those you trust in your local community. This may actually be better for you than being lied to that your government has everything under control. \\nYou are better off preparing independently as opposed to believing that Uncle Sam, or someone else, is going to bail you out. \\nBe prepared! Get your power generator. Click the banner below to grab this offer and pay in installments for the right power generator for your EMP survival! \\nThis article has been written by Cache Valley Prepper for Survivopedia. \\nReferences:'"}, "time": 1742564467.0749233}