{"duration": 0.18324780464172363, "input_args": {"text": "'TORONTO  —   At the heart of “The Magnificent Seven,” John Sturges’s classic 1960 western, is a group of flawed men (including Yul Brynner, Steve McQueen, Charles Bronson and James Coburn) who have never worked as a team, but who come together to defeat a nefarious bandit (Eli Wallach). That dynamic, adapted from Akira Kurosawa’s “Seven Samurai,” endures in the director Antoine Fuqua’s update of “The Magnificent Seven,” in which Denzel Washington, Ethan Hawke, Chris Pratt and others are the mismatched gunslingers Peter Sarsgaard is the ruthless industrialist they are set against. If its story remains fundamentally the same, Mr. Fuqua’s film, which Columbia Pictures and MGM will release on Sept. 23, features a more diverse cast, like an Asian   assassin (played by   Lee) a Native American warrior (Martin Sensmeier) and a Mexican outlaw (Manuel  ) in addition to Mr. Washington as the warrant officer leading the squad. Of course, Mr. Fuqua, Mr. Hawke and Mr. Washington are not strangers to one another: They worked together on “Training Day,” the brutal 2001 crime drama for which Mr. Washington won an Academy Award. (Mr. Fuqua has also directed Mr. Hawke in “Brooklyn’s Finest” and Mr. Washington in “The Equalizer. ”) Before the premiere of “The Magnificent Seven” at the Toronto International Film Festival this month, these three collaborators came together to talk about the creation of their western remake to reflect on the making of “Training Day” and to discuss problems of diversity that persist in Hollywood. These are edited excerpts from that conversation. Were westerns part of your cultural upbringings? DENZEL WASHINGTON I grew up with “Bonanza. ” I didn’t see anybody that looked like me. I was vibing on Hop Sing for some reason. Why don’t we see Hop Sing more? ETHAN HAWKE When I was growing up, my father would sleep all day Sunday. And on Channel 11, they would play “The Big Valley,” “Gunsmoke,” “Bonanza. ” Then a Howard Hawks movie and then the Clint Eastwood TV shows. ANTOINE FUQUA My grandmother was a huge western fan. She’d have me watch with her. “Shane,” “Bonanza,” “Duel in the Sun,” I saw them all with her. I used to watch them until the TV turned to snow. Did you take on this project because you were specifically interested in remaking “The Magnificent Seven”? FUQUA MGM called me. I figured I’d never get a chance to do a western. Then they said it was “The Magnificent Seven,” and you hesitate a little bit. “Seven Samurai” was amazing, and Kurosawa was the master. That decision wasn’t easy. Remakes have been done forever. People talk about “Scarface” and don’t even know it was a remake. HAWKE I have attachments to [the first “Magnificent Seven”]. You fall in love with all those guys. But there’s something about a story of male friendships we could build on. But you were never chained down by the title. You made the movie you wanted to. FUQUA If I was chained down to anything, it was  —   —   WASHINGTON The music? [Starts to sing.] Dun,   . FUQUA I wanted to make sure we stayed true to what Kurosawa was saying. “Seven Samurai” was all about men giving the ultimate sacrifice for others. To do something where you’d give your life for the right reason. As long as we stayed on that path, that’s the right path. Did the actors go through any special training for “The Magnificent Seven”? WASHINGTON You get a horse, you get a gun. Figure it out. No point in getting a plane. And get them boots on, quick as you can. Them boots is serious. I found a couple of pairs that were biting  —   I’m like, O. K. these aren’t going to work. FUQUA They’re on their feet all day, in the dirt and the sand. When it rains, it sinks in. It’s painful. There’s some details they don’t put in the outdoor adventure manual. Was it important to you that your film have a black lead? FUQUA I didn’t think about it as a black lead. WASHINGTON What does that mean, a black lead? I’ve never been one. People make movies and write about what they know, and what they’ve experienced. I’m sure Scorsese could’ve done “Schindler’s List,” and Spielberg maybe could’ve done “Goodfellas. ” But there’s a culture. These are  . HAWKE He cast Denzel because he likes Denzel’s acting. To white America, I think that will have some power. The western is an iconography that the Dick Cheneys of the world feel is theirs. And the world is changing, and it’s wonderful to see. But that doesn’t affect us playing it or doing it. If we think like that, we’re a bunch of chumps. This is a year when audiences have become particularly aware of issues of diversity in Hollywood. Do you feel like you’re seeing progress being made on this front? WASHINGTON It’s not like everybody sits down and has committee meetings every six months to see how we’re doing as a group. There’s no Black Hollywood. People are making movies, and there are more opportunities now than ever before because there are more outlets than ever before. FUQUA We can always improve everything. Hollywood has to improve it. It will. WASHINGTON Listen, it’s called show business. This ain’t philanthropy. If I give you $25 million, and you go make a movie, I don’t want to hear about what the experience was for you. I want my money back, with profit. Or you’re not getting $25 million from me next time. Now is that because I’m black and you’re white? No, it’s because this is business. I gave you $25 million. “Yeah, D, we blew everything. But the culture is  —   ” Yeah, O. K. Bye, partner. You remember you said that when you come asking me for some money. HAWKE Everybody’s going to be   when it makes a ton of money. Denzel, you have a film adaptation of August Wilson’s “Fences,” which you’re starring in and directing, coming later this year. Was there anything from “The Magnificent Seven” you could bring to that experience? WASHINGTON I stole from a real filmmaker [indicates Mr. Fuqua]. He had five cameras  —   I had two. FUQUA It’s frustrating, right? He’s editing now. He’s deep in it again. WASHINGTON I should go back and apologize to every director I’ve ever worked with. Because I had no idea how hard it is. Now I’ve got 200 people waiting on me: “What do you want, D?” Huh? You’d better act like you can direct. Antoine, had you been looking for an opportunity to get these actors back together since “Training Day”? FUQUA It’s always on my mind. On “Training Day,” I used to sit on an apple box and just watch these guys. It was like being at a play. WASHINGTON When you were casting Ethan, you had to believe that this was a guy who could walk down that empty street by himself and those people back there respect him. I won’t talk about some other folk who didn’t have the weight. [Laughter.] HAWKE It was fascinating to see you [Mr. Washington] work at that high a level, in a studio movie. You can see people working like that, in church basements, with confidence and creativity. But when big money comes around and pressure comes around, people shrink. It was an exciting moment to see that that didn’t have to be. Can you assume that the camaraderie from that previous film will carry over? WASHINGTON It’s so different. I mean, we’re on horses. The older I get, the more I appreciate each opportunity. You start to go, You’ve probably made more movies, D, than you’re going to make the rest of your days. If you don’t want to go, don’t go. When you do go, and it’s a great ride, then you want to give your all. Some days, not getting along is what helps. Some days it’s 107 degrees. You just don’t feel like it. “I know I’m supposed to shoot him, but I’m going to shoot him. ” [Laughter.] Are the three of you looking to make another movie together? HAWKE Somebody asked John Lennon why he wasn’t going to sing with Paul McCartney anymore, and, supposedly, he said, “Sing what?” Clearly we like working together. So what? Is it for the right reason? WASHINGTON Otherwise it’s called lunch. [Laughter.'"}, "time": 1742561846.2340474}