{"duration": 0.18366718292236328, "input_args": {"text": "'Having conquered their respective fields, the actress Sarah Jessica Parker and the journalist   Coates are heading into the literary unknown. SARAH JESSICA PARKER has a voice made for libraries, which is convenient because we are in one  —   specifically, the Amagansett Free Library on Long Island, a location Parker chose because she has always loved libraries and because it’s close to the beach house she owns with fellow actor Matthew Broderick, to whom she has been married since 1997. It’s late summer. She is wearing a seasonable, unfashionable tan under a white cotton dress with high espadrilles and she has brought her glasses, her Blackberry, her sweater in case of air conditioning and a   manuscript. You’d be excused for guessing the manuscript is her own. Parker, 51, has been acting for over four decades, which is plenty of justification for a memoir. It’s been almost 20 years since the premiere of “Sex and the City,” the show that fixed her star in Manhattan’s sky and made her character, Carrie Bradshaw, the avatar of   womanhood. Neither character nor actress has since known a day’s rest from inspiring other people’s personal style, and if Parker were to print an inventory of her storage closet and bind it in her favorite color, peacock blue, it would be a best seller. Yet Parker would rather see her initials on the spine than her name on the cover, and next year she will. Hogarth, the publishing house founded in 1917 by Virginia and Leonard Woolf, is mounting SJP for Hogarth, where, as editorial director, Parker will help to find, edit and publish three or four new novels a year. The head of Hogarth, Molly Stern, met Parker at a luncheon three years ago and offered her the role over dinner this past spring. Parker said yes in a second. “I have always loved to read for the same reason I love to act,” she says, “which is that other people’s stories are more interesting to me than my own. ” Parker’s father was a poet and journalist, and she has “the greatest respect and love” for what writers, editors and even literary agents do. What she is doing herself, for Hogarth, is an ode more to her mother, Barbara Forste, a retired nursery schoolteacher and lifelong, compulsive reader. If Parker can be found reading in the makeup chair on an HBO set, it is because Forste used to drive the kids to school with a novel in her lap, and if Parker is excited to work with librarians  —   Hogarth is partnering with the American Library Association to get more books, and not just Hogarth books, into more hands  —   it is because Forste made sure a young Sarah Jessica was never without a library book in her school bag. “What are you reading?” she asks me, picking up one of the two paperbacks I’ve brought with me, scanning the back cover and opening it at random to bury her nose in the crepey musk. “People have tried to bottle the smell of old books,” she says, “but it’s the most elusive thing, like trying to recreate a great story. You can’t, which is what makes it special. ” A literary manuscript, she says, should come with a blank white cover  —   no title, no name  —   like a vial of perfume for a blind test, without a whiff of identity. The manuscript she’s reading is of a novel by Edan Lepucki, “Woman No. 17,” to be published by Hogarth in May, and it is one of dozens she will read  —   for research, a sense of the landscape  —   before fall, when SJP for Hogarth makes its first round of selections. Criteria, says Parker, include “great stories” and “global voices,” which is another way of saying she can’t say too much. But we can take our clues from the qualities she has noted in recent literature. The Irish novelist Eimear McBride wields a language in her 2013 debut, “A Girl Is a   Thing,” that is as “brutal and mythic, almost familiar” as it is formally inventive, whereas Colson Whitehead takes a history of mass brutality and makes it “happen right in front of you” in his latest, “The Underground Railroad. ” Donna Tartt’s 2013 novel, “The Goldfinch,” is magnificent in its sweep but also in its dusty particulars, like “the smell of dad’s wet wool in the back of a closet,” while Lionel Shriver’s “The   World” makes a trip to the grocery store unforgettable. (Details, for Parker, are “the marrow that you suck out of the bone” of a story.) From the Modernist period, her favorite novelist isn’t Virginia Woolf, who wanted to have no country, but rather Evelyn Waugh, whose characters are most in need of home. Home is what draws Parker, too, to the origins of Hogarth. “Because Virginia and Leonard Woolf were printing books out of their home, and because they were publishing work by their friends, they were telling exactly the stories they wanted to tell,” she says. “I love most the idea of community here, and that the history of the imprint is personal. There was nothing mercenary about it. The Woolfs were storytellers. ”  —   Sarah Nicole Prickett YOU COULD CALL IT A career crisis, though that would be putting it mildly. After a period of exile, T’Challa, the king of Wakanda, has returned to the seat of power to find his nation roiled by natural disaster, political strife and war. The king’s most trusted adviser, his sister Shuri, had ruled in his absence, but died in battle. He is facing a rebellion against the crown led by a charismatic female warrior. And that heady brew of toil and trouble  —   those are just   problems. T’Challa has a superhero   Black Panther, that comes with its own welter of burdens and existential anxieties. These are the circumstances in which we meet the eponymous hero in the latest   story arc of “Black Panther,” the venerable Marvel Comics series, set in a mythical African country. The new stories are written by the journalist   Coates, a national correspondent for The Atlantic, who has emerged in recent years as one of America’s most powerful voices. Coates’s writing on race and politics combines reportage, deep dives into history and the sort of exhortative   that merits the heady adjective “prophetic. ” “The Case for Reparations,” his acclaimed 2014 Atlantic cover feature, reframed the debate about the American social compact around the bitter histories of white supremacy, redlining and the plunder of black wealth and black bodies. These themes came together, in a kind of stormy blues fugue, in the   essay “Between the World and Me,” a best seller that won the National Book Award last year, was a finalist for the Pulitzer and landed the author a “genius grant” from the MacArthur Foundation. Coates has attained an exalted perch, the rare public intellectual whose reach extends from the ivory tower to the street, hailed by Toni Morrison as the heir to James Baldwin, shouted out by Chance the Rapper on a mixtape. These days, Coates finds himself turning down more offers than most journalists get in a lifetime. But when Marvel came calling, he didn’t hesitate. “It was the craziest offer I ever got,” says Coates, who ended up collaborating with the artist Brian Stelfreeze. “I didn’t have to mull it over. ” Writing comic books would seem to represent a radical change of course for Coates. But it is also a return to roots. Growing up in West Baltimore, he was an obsessive reader of “ ” and “The Uncanny  . ” “They felt like an allegory for what my life was,” Coates says. “Black Panther” has the rock ’em, sock ’em action and pulp plotlines that comics fans expect. But Coates’s preoccupations peek through. His “Black Panther” is a meditation on the burdens and costs of political power, on gender relations, on the dynamics of popular uprisings. The language also has a telltale Coatesian ring, mixing a journalist’s economy with ringing lyricism. “Before I became a journalist, I really wanted to be a poet,” he says. “’u2009‘Black Panther’ reminded me of the old days of trying to write poetry. You need to get things across but you don’t have much space. ” Coates has signed on to write another dozen “Black Panther” books. And he has become something of   impresario, helping to recruit two leading black writers, the essayist Roxane Gay and the poet Yona Harvey, to collaborate on a “Black Panther” companion series, “World of Wakanda. ” For Coates, the sideline in comics is more than just another way to exercise his muse. It is a relief: “It was very hard to write ‘Between the World and Me.’ I don’t mean the craft, although of course the craft is hard. I mean that it takes a toll on you emotionally. You need to go in another direction every once in a while. ” He chuckles. “‘Black Panther’ is where I go to play. ”  —   Jody Rosen'"}, "time": 1742563185.8445168}