{"duration": 0.12023615837097168, "input_args": {"text": "'For years, the   New York hedge fund Platinum Partners stood out for   investment returns that rivaled some of the biggest names in the industry. It turned out that those returns were too good to be true, according to federal prosecutors. Federal agents on Monday arrested Mark Nordlicht, a founder and the chief investment officer of Platinum, and six others on charges related to a $1 billion fraud that led the firm to be operated “like a Ponzi scheme,” prosecutors said. It is one of the largest such fraud cases since Bernard L. Madoff’s investment firm unraveled in 2008. David Levy, the firm’s   investment officer, was also among those arrested in the morning by agents in Texas, Manhattan and New Rochelle, a suburb of New York City. The men were charged with securities fraud and investment adviser fraud, according to an unsealed indictment filed in Federal District Court in Brooklyn. The Securities and Exchange Commission filed a parallel civil case. Platinum tapped prominent families and foundations within the Orthodox Jewish community in New York to fuel   bets on payday lenders, oil companies and even the terminally ill. But prosecutors said these investments and the firm’s performance were misrepresented by its executives. Ultimately, Platinum took in new money in order to pay longtime investors who wanted their money back, something the firm’s executives called among themselves “Hail Mary time. ” “As investors sought redemptions, the defendants engaged in numerous improper measures in an attempt to meet redemption requests, including taking out   rate loans, commingling monies among funds and raising money from new investors through fraudulent misrepresentations,” said Andrew J. Ceresney, the director of the S. E. C. ’s enforcement division. Located a few blocks from Central Park, Platinum, founded in 2003, made a splash early on with some of its investments. In one bet, the firm sought to profit from the death of terminally ill patients by investing in variable insurance payouts. As part of the scheme, a rabbi in Los Angeles sought out hospice patients to get their personal details that could be used to buy insurance payouts in their names. A company that Platinum set up to make the investments was fined by the S. E. C. in January 2015. “We definitely were exploiting a loophole, but it was fully vetted by legal counsel,” Mr. Nordlicht said in an interview with Bloomberg later that year. In other bets, Platinum misled both investors and auditors  —   sometimes brazenly. In December 2012, for example, executives misrepresented to auditors the value of Black Elk Energy, an oil and gas company controlled by Platinum, valuing it at $283 million, prosecutors said. In fact, there had been an explosion on a Black Elk platform in the Gulf of Mexico the month before that had caused the deaths of three workers, injuries to other employees and an oil spill. Black Elk no longer exists. Jeffrey Shulse, who worked at Black Elk and is named in the government’s indictment, denied the charges. “Mr. Shulse’s indictment is a clear case of overreaching,” said F. Andino Reynal, Mr. Shulse’s lawyer, adding that his client was “confident that once a jury has had a chance to hear all the facts, it will exonerate him of any wrongdoing. ” Lawyers for the defendants Mr. Nordlicht, Daniel Small, Uri Landesman, Joseph Mann and Joseph San Filippo did not respond to a request for comment. Michael Sommer, a lawyer for Mr. Levy, said he looked forward to “clearing David Levy’s good name. ” As recently as March, Platinum had $1. 7 billion of investor money, as of a March regulatory filing. For years it reported a strong performance  —   with annual average returns of 17 percent. As recent as last year, Platinum said it made gains of 8 percent, a strong performance in a year when the average hedge fund lost 0. 85 percent, according to the Hedge Fund Research Composite Index, a gauge of industry performance. Platinum began to have trouble extracting investor money when some of its obscure investments started to sour, according to prosecutors. From 2013 to 2016, the firm could not stanch the losses in certain funds and the investor requests to withdraw money, so it began to move money between funds in what Mr. Nordlicht called a “big stew,” the indictment said. Things seemed to reach a crisis point in June 2014, prosecutors said. “It can’t go on like this or practically we will need to wind down. ...this is code red,” Mr. Nordlicht wrote to Mr. Landesman, a managing director at Platinum, at the time. Yet investors remained in the dark about the firm’s precarious liquidity position. A month later, when an investor emailed to ask about the reliability of Platinum’s reported performance figures, Mr. Landesman replied, “The numbers are all kosher, they have had verbal input every month. ” Investors grew restless. By March 2015, the total amount they requested to withdraw from the firm exceeded $83 million. Eventually, executives decided to pay some ahead of others, prosecutors said. “Platinum Partners purported to be a   in the hedge fund industry,” said Robert L. Capers, the United States attorney for the Eastern District of New York. “In reality, their returns were the result of the overvaluation of their largest assets. ” This inflation led to Mr. Nordlicht and others “operating Platinum like a Ponzi scheme, where they used loans and new investor funds to pay off existing investors,” Mr. Capers added. The arrests on Monday were part of an investigation among several government agencies, including the Federal Bureau of Investigation and the United States Postal Inspection Service. In June, Murray Huberfeld, a former Platinum executive, was arrested. He has pleaded not guilty to conspiracy and wire fraud. Soon after Mr. Huberfeld’s arrest, agents from the F. B. I. and the Postal Inspection Service raided Platinum’s New York offices. Faced with mounting pressure from federal investigators, as well as an investigation by the S. E. C. Platinum liquidated its main hedge fund. For some at Platinum, there was already a sense late last year that government investigators were closing in on the firm. In an email exchange, Mr. Nordlicht, Mr. Landesman and an unnamed principal partner in Platinum discussed fleeing to Israel, according to prosecutors. “Don’t forget the books,” the unnamed partner wrote. “Assume we are not coming back to ny. ”'"}, "time": 1742563577.0212874}