{"duration": 0.10321521759033203, "input_args": {"text": "'LOS ANGELES  —   The   Lionsgate musical “La La Land,” about dreams and dreamers in this city of stars, twirled its way toward being an awards season juggernaut on Monday, taking seven Golden Globe nominations, including ones for best director, screenplay and lead actor and actress. But it was not a runaway. The lyrical “Moonlight,” about a young black man growing up in a poor Miami neighborhood, drew six nominations, including best drama, director and screenplay. “Manchester by the Sea,” focused on a New England plumber coping with horrific loss, was also nominated for best drama, receiving five nods total. [See the complete list of Golden Globe nominees] Joining those two films in the best drama category were “Lion,” an adoption   set in India and the Weinstein Company’s lead Oscar hope Mel Gibson’s “Hacksaw Ridge,” based on the true story of the World War II hero Desmond T. Doss and the CBS Films   “Hell or High Water. ” Nominated alongside the Ryan Gosling and Emma   “La La Land” for best comedy or musical: the raunchy superhero blockbuster “Deadpool” the   musical “Sing Street” the Meryl Streep vehicle “Florence Foster Jenkins” and “20th Century Women,” a comedic period drama starring Annette Bening and set for release on Christmas Day. “As we speak, the entire ‘Deadpool’ team is engaged in a grotesque, early morning ” Ryan Reynolds, the star of that film, wrote on Twitter. The Globes are bestowed by the Hollywood Foreign Press Association, a group of mostly freelance journalists, only 85 of whom are active members. Long competitive with the more highbrow Oscars, the Globes often strive to make   choices. Nominating Mr. Gibson for best director fit that bill. Mr. Gibson became a Hollywood pariah in 2006 when he was charged with drunken driving and went on an     tirade. In 2011, he pleaded no contest to a misdemeanor charge of battering a former girlfriend. By putting his comeback film forward in three prominent categories  —   Andrew Garfield was also nominated for best actor in a drama  —   the Globes may force Oscar voters to similarly contend with Mr. Gibson. “I’m very appreciative,” Mr. Gibson said in a statement. “This film was a labor of love for everyone involved and is also about a man who truly exemplified love and goodness. ” The press association filled out the directing category with Damien Chazelle (“La La Land”) Barry Jenkins (“Moonlight”) Kenneth Lonergan (“Manchester by the Sea”) and Tom Ford (“Nocturnal Animals”). The inclusion of Mr. Ford may prove controversial because of Tom   swag sent to voters by Focus Features, the studio behind his film. Because the combined value of the gift  —   bottles of cologne and perfume  —   exceeded the press organization’s $95 limit, the organization asked members to return part of it. To include him, Globe voters overlooked contenders like Martin Scorsese, whose “Silence” arrives in limited release on Dec. 23. Mr. Scorsese may have diminished his prospects by delivering the film late. “Silence,” an epic drama about two priests who face violence in   Japan, was shut out on Monday. It was a bad morning for other Hollywood elder statesmen, with Clint Eastwood’s “Sully” uninvited to the banquet and Warren Beatty’s “Rules Don’t Apply” barely alive, receiving a lone nod for Lily Collins’s performance. Also ignored was Nate Parker’s “The Birth of a Nation,” a slave rebellion film once seen as a leading awards contender that collapsed at the box office after scrutiny of Mr. Parker’s past he was accused of rape in 1999 and later acquitted. The diversity on display during Hollywood’s   season  —   or the lack thereof  —   has been an incendiary topic in recent years. When Oscar voters put forward an   group of acting nominees at the most recent Academy Awards, there was a global outcry. The Globes are not necessarily predictive of the Oscars, but Monday’s nominations give reason to believe that a wide variety of faces will be honored. In the acting categories, Globe voters noted performers like Viola Davis and Denzel Washington, both nominated for “Fences,” an adaptation of August Wilson’s play about race and family relations. Naomie Harris and Mahershala Ali received attention for their roles in “Moonlight” Dev Patel was nominated for “Lion” and Ruth Negga made the best actress cut for “Loving,” a gentle portrait of a   couple whose marriage ended   laws. “Hidden Figures,” about unsung black heroines in the space race of the 1960s, received attention for Octavia Spencer’s acting and a score by Pharrell Williams, Hans Zimmer and Benjamin Wallfisch. But the Globes are not especially prognostic of what will happen on Oscar night. Last year, “The Revenant” and “The Martian” were the Globes’ best picture winners both lost to “Spotlight” at the Oscars. The Globes ceremony has been increasingly important on the television front, largely for its acknowledgment of fledgling series like “Brooklyn  . ” This time around, “This Is Us,” a new NBC drama, may have filled that quota. “This Is Us” received nominations for best drama and for two actresses (Chrissy Metz and Mandy Moore). In the best drama category, rookie shows made a   of the nominations, with “The Crown,” “Stranger Things” and “Westworld” filling out the category, along with the HBO stalwart “Game of Thrones. ” Several returning shows were snubbed. “Mr. Robot,” last year’s drama winner, received only acting nominations Fox’s “Empire” got nothing. Showtime, which has had three wins in the best drama category in the past five years, fell to just one nomination: Liev Schreiber for best actor in a drama in “Ray Donovan. ” Streaming services have made inroads at the Globes, but on Monday the traditional players were back on top. HBO led the pack with 14 nominations (up from seven last year) and FX was in second place with nine. FX was propelled by “The People vs. O. J. Simpson,” which led all shows with five nominations, including best limited series. In the best comedy category, the returning winner, Amazon’s “Mozart in the Jungle,” is up against Amazon’s “Transparent,” HBO’s “Veep” and two shows that feature primarily black casts: ABC’s “ ” and FX’s rookie hit “Atlanta. ” The press association has labored in recent years to shed its reputation for bizarre nominations that were interpreted more as efforts to populate the banquet with stars than honor the year’s best in film and television. Monday’s list contained no outright embarrassments, but there were still some   including a nod for Jonah Hill as best comedic actor in the critical dud “War Dogs. ” As previously announced, Ms. Streep, a   Globes nominee and   winner, will receive the Cecil B. DeMille lifetime achievement award. Foreign film nominees were “Divines” (France) “Elle” (France) “Neruda” (Chile) “The Salesman” (Iran and France) and “Toni Erdmann” (Germany). Among film companies, Lionsgate was the runaway winner, with its various labels and partnerships resulting in 17 nominations. A24 was second, with nine, while Paramount and Universal each had eight. Jimmy Fallon is to host the 74th Golden Globes in all of his goofy glory, taking the reins from the acerbic British comedian Ricky Gervais. Mr. Fallon is under pressure to lift ratings. The most recent Globes telecast attracted about 18. 5 million viewers, compared with 19. 3 million the previous year, according to Nielsen. The Globes are to be broadcast live by NBC on Jan. 8.'"}, "time": 1742562636.7321634}