{"duration": 0.14630436897277832, "input_args": {"text": "'The War Against Payday Lending Apple uses similar tactics with iPhone Jonathan Lee | Mises.org - October 26, 2016 Comments Image Credits: flickr, khrawlings . \\nIn June of 2016, the Consumer Financial Protection Bureau (CFPB) put forward a proposal to regulate the short-term loan industry. \\nThe Small Dollar Lending Rule seeks to “alleviate and solve” for the “apparent weaknesses” of the current rates and short-term lenders by requiring “lenders to assess and verify a borrower’s income, housing costs, and credit and legal obligations.” \\nThe intention of the proposal is to protect low-income families from being caught in an endless cycle where many are “forced to take out another loan to make ends meet.” At first glance, it seems that the rule would solve problems in an industry known for its “dirtiness.” Except policymakers are thinking with their hearts while sitting in their air-conditioned offices, away from the facts and any form of interaction with the real world of short-term loans. Just the fact that they see the short-term loan industry as “dirty” supplies sufficient reason to believe that either these policymakers are ignorantly prejudiced or plainly manipulative. \\nInstead of pointing fingers and name calling at the short-term lending industry, they should be applying simple economics to their proposals to see if they hold water. \\nIn “Understanding the CFPB Proposal for Payday and Other Small Loans,” a paper released by the CFPB and PEW Charitable Trusts, the Bureau aimed to make several arguments in favor of new legislation. \\nThe first of its arguments is that, “with payday and vehicle title loan markets, lenders’ and borrowers’ interests are not aligned because profitability for lenders depends on loans being unaffordable for customers.” But doesn’t this argument stand for any industry that sells a product? \\nFor example, are the interests of iPhone sellers and buyers “aligned” in the manner acceptable to the CFPB? Each additional iPhone 6 is said to cost $200.10 to produce and is sold for $699 dollars. That is 3 times its cost to make. To borrow a phrase from the left, that’s “price-gouging” to the tune of 300 percent. Yet there is no noise from policymakers claiming to call Apple a company that cheats its customers. \\nSo why should short-term lenders be held accountable in any way that is different than Apple? Shouldn’t short-term lenders be able to charge interest rates that make-up for the huge risk they incur in lending money out to low-income borrowers? \\nStudies show these lenders charge on average 15 percent, or $15 for every $100 loaned — a profit margin that is significantly less than the price percentage difference of products in other markets. \\nThe second of the CFPB’s arguments is that to solve for “balloon payments,” or the cycle of continued borrowing to pay off loans, the CFPB would “require that most products become installment loans with smaller, manageable payments.” \\nThe problem with this statement is that the Bureau completely ignores the reason why short-term loans are so available to borrowers — it’s because short-term loan companies can offset risk by requiring borrowers to weigh their own risk against their need to borrow. \\nSimply put, the short payment periods are put in place to deter those who definitely should not borrow. Additionally, making the periods longer and the payments smaller defeats the business model, making short-term lenders irrelevant because their models are defined by their expediency. \\nThe third of the CFPB’s arguments is that their proposal would solve the “problems” related to “price gouge lending” by requiring “lenders to evaluate borrowers’ financial condition,” by forcing borrowers to submit written statements on income, housing expenses, all outstanding debt, and child support. Meanwhile, the lender is required to obtain a national credit report, and then deliver that data to all proposed credit tracking agencies. \\nRemember: all of these government-imposed requirements cost the short-term lenders money. The cost of finding out this data would eliminate any ability that firms have to loan small amounts of cash at current interest rates. The result would either lead short-term loan companies to shut down or further hurt borrowers by requiring that they borrow larger sums of money to qualify for loans. \\nLastly, the CFPB heralds that their redesign is prompted by a study by The Pew Charitable Trusts’ survey research that the “vast majority of borrowers want … most products [to] become installment loans with smaller, manageable payments.” \\nAt first glance, it seems that borrowers in need are hurting and want to find a way out of a difficult situation. Although there are those who are caught in the inability to pay back loans because they got caught in bad finance (due to the risk of short-term loans), many of those “surveyed” actually sent in raving reviews in support of short-term loans. \\nIn fact, more than 98 percent of the 12,308 submissions to the Bureau’s “ Tell Your Story ” program — where people sent in their experiences regarding short-term loans — were positive and excessively thankful for these loans. \\nThese responses ranged from, “there are no other avenues out there that can lend money like [this],” to a simple “thank you.” This study was personally conducted by the CFPB. Unsatisfied with the results, they hid it from the public’s view until a Freedom of Information Act request forced them to release it. \\nThis holding back of information demonstrates that the Bureau is not truly searching to help the people it says it wants to help. Rather, they have a keen eye for policy symbolism, and the flash of “fighting for the underdog” when in fact they are irreversibly harming them while sticking a knife in their back. \\nPolicymakers continue the belief that short-term loans are as bad as they seem comes either because they did not attend their economics classes in college, or they simply want to be perceived as “someone who cares.” But we cannot let policymakers make decisions because their hearts lead them to make uneducated proposals. We cannot let legislators sway our hearts because we hear about the extreme situations where people are hurt. Instead, we need to look at the cold-hard facts: the numbers that the CFPB uses to defend their arguments are manipulative and outright false. \\nThe Small Dollar Lending Rule must not be allowed to pass and the proposal must be removed and taken back — it will only hurt the people it claims it will help. Let Americans make decisions for themselves — they’re smarter and more risk-averse than Washington insiders give them credit for. \\nJonathan Lee is a filmmaker and freelance economics journalist. He is an alumnus of Chapman University. NEWSLETTER SIGN UP  '"}, "time": 1742561808.5746646}