{"duration": 0.13668489456176758, "input_args": {"text": "'Hillary Clinton plans to deliver a scorching assessment of Donald J. Trump’s foreign policy prescriptions on Thursday, casting her likely Republican rival as a threat to decades of bipartisan tenets of American diplomacy and declaring him unfit for the presidency. Mrs. Clinton’s campaign aides said the speech, which she will deliver in San Diego, would be the start of a persistent assault to portray a potential Trump presidency as a dangerous proposition that would weaken American alliances and embolden enemies. The argument will include specific criticism of comments Mr. Trump has made about rethinking the United States’s support of NATO his proposal to allow Japan, South Korea and Saudi Arabia to acquire nuclear weapons his vow to temporarily bar Muslims from entering the United States and his pledge to advance the use of torture and kill the families of suspected terrorists. But Mrs. Clinton will also invoke her experiences as secretary of state, including in 2011 when she supported President Obama’s decision to send Navy SEALs on a raid in Pakistan that killed Osama bin Laden, to make the case that Mr. Trump does not have the temperament to make such decisions. “Donald Trump is unlike any presidential candidate we’ve seen, maybe ever, certainly in decades, in that he does not cross the threshold of fitness for the job,” said Jake Sullivan, Mrs. Clinton’s top policy adviser, who helped draft the speech. Mrs. Clinton will deliver the address on her final campaign swing before California holds its Democratic primary on Tuesday, when she is widely expected to reach the threshold of delegates needed to secure her party’s nomination. But in choosing to raise concerns about Mr. Trump’s foreign policy stances, she will be speaking to swing voters in general election battleground states who have doubts about a Trump presidency. While Mrs. Clinton must be cautious not to alienate liberal Democrats who oppose some of her hawkish foreign policy stances, her campaign says national security could be the catalyst that drives independents and wavering Republicans to support her this fall. Roughly 21 percent of independent voters and 32 percent of Republican voters said the most important issue this election was terrorism and national security, compared with 16 percent of Democrats, according to a Suffolk   Today poll conducted last month. At the same time, 61 percent of registered voters said a Trump presidency would make America’s image in the world worse, according to the latest New York   News poll. “There are many Republicans concerned about this,” R. Nicholas Burns, an American ambassador to NATO during the George W. Bush administration who also served on Bill Clinton’s National Security Council, said of Mr. Trump. “They find his policy positions beyond the pale, and they’re also turned off by his vulgarity. ” To that end, the Clinton campaign and its outside advisers have embarked on an effort to reach out to prominent moderate Republicans who could endorse Mrs. Clinton, largely making the case for foreign policy  . Those calls have included to an aide of the 2012 Republican nominee, Mitt Romney, and to Nicholas F. Brady, who served as secretary of the Treasury under Mr. Reagan and the elder Mr. Bush, with plans to reach out to James A. Baker III, a White House chief of staff to President Ronald Reagan and secretary of state under President George Bush. In her debates with Senator Bernie Sanders of Vermont, Mrs. Clinton has defended her foreign policy decisions, including urging the Obama administration to join a   coalition to oust Col. Muammar   in Libya and her 2002 vote to authorize the use of force in Iraq, which she later said was a mistake. In an interview Wednesday night, Mr. Trump criticized Mrs. Clinton’s early support for the Iraq war, which he said he opposed, and questioned her judgment in Libya. “Bernie Sanders said it and I’m going to use it all over the place because it’s true,” Mr. Trump said. “She is a woman who is   to be president because she has bad judgment. ” As each candidate argues the other is unfit to occupy the Oval Office, Mrs. Clinton’s advisers are preparing to make a case against Mr. Trump that will be jarringly different from the sparring of past presidential campaigns over foreign policy. “It’s not like the campaign against McCain or Romney, which was two competing visions,” said Derek Chollet, a former White House and Pentagon official under President Obama. Instead, he said, Mrs. Clinton will remind voters that President Vladimir V. Putin of Russia and the North Korean government of Kim   have expressed support for Mr. Trump, who has suggested a willingness to talk directly with Mr. Kim, a pariah worldwide. Mrs. Clinton will also accuse Mr. Trump of bluster and oratory that is in direct opposition to the bipartisan pillars of American diplomacy that every president has adhered to since World War II. Julianne Smith, a former deputy national security adviser to Vice President Joseph R. Biden Jr. pointed to Mr. Trump’s suggestion that the United States rethink its involvement in NATO, the   coalition of European nations. Mrs. Clinton, she added, needed to explain to voters that “every single president over the last couple decades has understood the value of alliances” and that “playing by the rules makes sense for all of us. ” Mr. Trump said Mrs. Clinton was “fraudulent” in her misrepresentation of his foreign policy positions, explaining that he supported global alliances, but believed that the United States should shoulder less of the financial burden. “Our country can’t afford to protect the world anymore, and at least not get reimbursed for it,” he said. Mrs. Clinton has delivered a series of foreign policy speeches over the course of the nominating fight that included calling for accelerating the   operation to defeat the Islamic State, ending the economic embargo against Cuba, and pledging unwavering support of Israel. And she had already begun to lay the groundwork against what she called Mr. Trump’s “reckless actions” on foreign policy. The San Diego speech, to be delivered in a city known for its military presence at a time when Mr. Trump is facing scrutiny over his donations to veterans’ groups, will present a more sweeping  —   and fearsome  —   portrayal of Mr. Trump, one that the Clinton campaign will deliver like a drumbeat to voters in the coming months. “There’s not a lot of room left in terms of new proposals,” Mr. Sullivan said. “This is a speech about a vision and principle and purpose, not individual policy proposals. ” The prospect of a foreign policy debate not centered on policy differences has confounded Mrs. Clinton’s advisers, who in a more traditional election would be facing questions about Mrs. Clinton’s call for a   zone with coalition forces to protect Syrians or how she would handle the flood of migrants to Europe. But Mr. Trump, in addressing foreign policy, has largely relied on gut instinct and appealing to voters’ emotional concerns that America has lost its standing in the world. “You do get the sense that he’s in a dialogue with a part of the electorate  —   and I consider it a minority  —   that couldn’t be less interested in facts or realities,” said Daniel Benjamin, coordinator for counterterrorism at the State Department under Mrs. Clinton. “That’s a really challenging task that most of us were unprepared for in many ways. ”'"}, "time": 1742564159.8054156}