{"duration": 0.09298348426818848, "input_args": {"text": "'Posted on October 27, 2016 by Tim Brown \\nWell, leave it to the Democrats in Nevada to do something like this. Not only are they engaged in illegal acts concerning voter registration , but now they have ruined the good name of Cliven Bundy by sending out 700,000 mailers to households throughout Nevada and contaminating the jury pool, which has led the defense to call on the court to “change the venue” so that Bundy might receive a fair trial. \\nThe flyer reads, “This man’s armed standoff led to the deaths of two Las Vegas Police Officers and he’s supported by Congressman Hardy.” It also contains Cliven Bundy’s name and mug shot in front of a row of prison cells. This was also paid for by the Nevada State Democratic Party. \\nAttorney for journalist Pete Santilli , Chris Rasmussen, joined with Nevada’s public defenders in a motion to compel the court for a “change of venue.” Rasmussen received one of the flyers and entered it into evidence with the court claiming that Bundy would not receive a fair trial due to the obvious propaganda sent out by the State of Nevada. \\nThis story about tying the Bundy’s or anyone at Bundy Ranch to Jared and Amanda Miller, the Las Vegas shooters , is bogus. By his own account, Miller was sent home from Bundy Ranch . Here’s Miller’s comment to a YouTube video claiming that very thing. \\nIn fact, the media jumped all over the false narrative that Miller and his wife were tied to the Bundy’s, labeling them right wing extremist terrorists , and attempting to use the propaganda for advancing attacks on the Second Amendment . The media never mentioned the fact that the Millers were involved in the Occupy Movement and it never informed the public that they were Vegas police informants . \\nWhat’s worse is that this attempt to smear patriots for standing against the illegal and unconstitutional acts of the DC government and their willing accomplices in the Bureau of Land Management , FBI, and corrupt politicians, both in DC and local, is the fact that this was already dealt with once as Constitutional Sheriff Richard Mack was wrongly connected to the Millers. \\nDeb Jordan adds , “Las Vegas Metro Police and the Clark County Sheriff’s Department cannot produce any report of violence or destruction of property during the Bundy Civil Rights Protest, except in those instances where the Bureau of Land Management were the perpetrators.” \\n“Sheriff Douglas Gillespie, the then Sheriff of Clarke County said at the time, there was no direct link to the couple’s killing spree and Cliven Bundy – noting that the two had arrived in Las Vegas in January of 2014 and that they had their own agenda for starting a revolution,” she added. “Gillespie made clear he had seen NO evidence that the Miller’s had come to Nevada seeking out Cliven Bundy.” \\nNevada Assemblywoman Michele Fiore also took time to call out this injustice . \\n“This mailer is completely unacceptable she said, and somebody needs to be held accountable for putting this false narrative in Nevada mailboxes,” she said. “Clearly the Bundy’s Civil Rights were being violated by a United States Government – Terrorist Organization – known as the BLM, and we all saw it happening with our own eyes. I was not the only elected official at that protest and what I want to know is, where the hell are they now?” \\nFiore also said : \\nThe level of propaganda being allowed by the Democratic Party must come to an end. We have men whose lives are on the line here in Nevada, and poisoning the jury pool with a downright lie must be dealt with. Not only do we have a case here that is already out of balance because it is being overseen by Judge Gloria Navarro, a left winger who was recommended by Harry Reid and appointed by Barack Obama, and Steven Myhre a Liberal Prosecutor who could obviously care less about fairness and truth, now we add to that more unfairness by allowing a left-wing propaganda machine to send out the message, that Cliven Bundy is directly responsible for the death of two of our Metro Police officers. \\nThis case should be awarded a change in venue in the fairness of law, and my peers should stop being cowards and get back to representing the truth about this case. \\nCliven Bundy held a peaceful protest on his own property and even though the Federal Government was not invited, they came anyway. \\nThey literally beat up on his family, set trained snipers on hillsides overlooking his ranch, came at them with stun guns and dogs, tried to restrict them to a first amendment area, killed and buried their cattle on public lands – in mass graves, threatened everyone who came to a lawful protest with lethal force, had armed helicopters and drones flying all over the place, and now they honestly want the American people to believe the Bundy’s were the bad guys — come on … \\nThe Government has stacked the odds against these men, and I am telling you right now; \\nI will not stand by and watch them be railroaded by a bunch of left-wing extremist and sent to prison for crimes they did not commit. \\nThis case should not only be moved out of the State of Nevada, it should be dismissed altogether. \\nI have no regrets for doing the right thing here when it comes to the Bundy’s — As hard as it is, I would rather lose every single race for office, before I would lose one nights sleep knowing I had betrayed them .” \\nFiore is correct. The men in Nevada were more peaceful than the agents who surrounded them. So, what are you going to do America? Will you sit quietly by at your keyboard and rage at the machine, or will you take action? \\nYou can contact the responsible party here: Address : 6233 Dean Martin Dr, Las Vegas, NV 89118'"}, "time": 1742563717.9517133}