{"duration": 0.03755688667297363, "input_args": {"text": "'A library in Sweden’s capital is refusing to stock Kurdish economist Tino Sanandaji’s “sincere and   analysis” of the country’s immigration policy because the book ‘supports racism’. [An examination into the results of mass migration to Sweden over recent decades, ‘Mass Challenge’ was topping Sweden’s book charts within days of its release earlier this month.  Sanandaji’s analysis of the nation’s   importation of people from the third world, the resulting social problems and the effects on Sweden’s economy, is based on facts sourced from Statistics Sweden, the National Crime Prevention Council, the National Board of Health and other mainstream and respected agencies. But local media reports that Swedes who are wanting to borrow a copy of the   book from their local library are running into difficulties, with librarians rejecting Mass Challenge for political reasons. Nina Sundberg at Stockholm’s Ekero library, which is refusing to stock Sanandaji’s new book, argues that libraries should only purchase books which are politically correct. “Library collections should be characterized by diversity and pluralism. The goal is to not buy books that support racism, persecution, gender stereotypes or anything else that’s contrary to human rights” wrote the librarian, explaining the facility’s motivation in rejecting Mass Challenge. Ekero library regular Maria Halkiewicz, who had wanted to borrow the book, condemned the decision. “It’s strikingly obvious that this is censorship” she told Nyheteridag. On Saturday, Malmö University lecturer Martin Kroon noted the apparent absence of Mass Challenge from Sweden’s libraries in an article which asks whether politically motivated ‘censorship’ of certain titles is a problem across the country. Sanandaji has sounded the alarm on the “quite disastrous” effects of mass migration in Sweden for a number of years. Warning that Swedes will become a minority in their own country without a serious cut to the number of migrants it accepts, he said in 2015: “This is an irreversible social experiment that no wealthy state has ever attempted. There are almost no ideas or visions over how this can be solved. “You can’t combine open borders with a welfare state. If you offer generous benefits, and anyone can come and use these benefits, a very large number of people will try to do that. It’s just mathematically impossible for a small country like Sweden to fund that. ”'"}, "time": 1742562879.3445299}