{"duration": 0.060666799545288086, "input_args": {"text": "'  is now using their growing power to threaten and extort immigrants and their businesses in America. [The hyperviolent   gang is known for beheadings, machete attacks, scalping, and gang rapes. Now they are extorting businesses by threatening immigrants’ families in their native countries if they do not give money.  “The homicides related to   it’s just because we can, and we will and because of the fear that instills,” Montgomery County Maryland Chief Thomas Manger was also reported by The Washington Times to say. The information came during a hearing of the Senate Homeland Security and Governmental Affairs Committee on Wednesday. The committee probed “The Rise of   and Other Transnational Criminal Organizations. ” The gang’s extortion system in their native El Salvador is   a police detective in Chelsea, Massachusetts, Scott Michael Conley, told the committee. Moreover, while their foundation is entrenched on the west coast, they are progressing on the east coast. “Once they establish that leadership base you’ll start to see a more sophisticated gang,” Detective Conley said. The chairman of the Senate Homeland Security Committee, Senator Ron Johnson ( ) said to those at the hearing: “During the Committee’s examination of America’s unsecure borders we have learned how transnational criminal organizations and drug cartels exploit American policies and our lack of border security to advance their criminal agenda. Today we continue that important work by discussing how the street gang Mara Salvatrucha, commonly known as   and other Central American gangs affect communities throughout the United States. ” According to Suffolk County New York Police Commissioner Timothy D. Sini, “They are recruiting young people in our communities. They are recruiting recent immigrants because oftentimes, they pray on people’s fears. ” The police commissioner told the committee examining the   gang, “Recent immigrants may not feel comfortable in coming to law enforcement. ” Police Comm. Timothy Sini on MS13 recruiting immigrants —  &gt pic. twitter.   —   Senator Ron Johnson (@SenRonJohnson) May 24, 2017,  Sini added, “They are recruiting also very young. ” He said there was one instance in Suffolk County where   gang members recruited a   . Police Chief Manger told the committee, “The gangs surf the internet, building dossiers on potential recruits,” the Times also reported. Chairman Johnson said that out of this flood of almost 200, 000 unaccompanied children (UACs) taken into custody during 2012 to 2016  —   68 percent were males between the ages of 15  —   17. Breitbart Texas obtained leaked images of UACs in June 2014 which showed not only the conditions of U. S. Border Patrol’s processing centers but also the deluge border patrol agents were facing. President Obama called the wave of unaccompanied children an “urgent humanitarian situation” and his administration officials pictured these children as fleeing violence and poor economies reported The Washington Post at the time. Breitbart Texas covered the press conference on April 11 of this year in Houston when Texas Governor Greg Abbott announced the expansion of the Texas   Task Force (TAG) and the creation of a technical operations center. Houston is one of the five cities that the FBI has identified to have a large   presence. In March, two   gang members appeared in a Harris County courtroom laughing and waving at news cameras after being charged with the kidnapping and rape of one    girl, and the kidnapping, rape, and murder of another young girl in Jersey Village, a city within the Houston metropolitan area. The murdered girl was allegedly killed as part of a satanic ritual. In late April, U. S. Attorney General Jeff Sessions said while visiting Long Island, “The   motto is kill, rape, and control. ” “I have a message to the gangs that are targeting our young people: We are targeting you. We are coming after you. ” Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742563643.9961035}