{"duration": 0.09524059295654297, "input_args": {"text": "'In conversations over the last several months with chief executives and other business leaders, the discussion invariably turns to the presidential election. And with few exceptions, at some point, most of the executives say something critical, even derogatory, about Donald Trump  —   but it is quickly followed by, “I could never say that on the record. ” Almost as quickly, I ask why. The answer is almost universal: fear. Which brings us to Reid Hoffman, the   of LinkedIn and celebrated venture capital investor who had one of the first stakes in both Facebook and Airbnb. Unlike many of his peers, Mr. Hoffman has taken to publicly denouncing Mr. Trump. Last week, he pledged to donate $5 million to a veterans’ group if Mr. Trump released his tax returns before the last presidential debate in October. And now he has gone so far as to release a card game, “Trumped Up Cards: The World’s Biggest Deck” that pokes fun at Mr. Trump. The website that sells the game describes it as “a multiplayer card game where players need really big hands to win. ” The game, which is modeled after “Apples to Apples” or “Cards Against Humanity,” includes a free pass called, “Play the women card” and uses the tagline: “This is a game, democracy isn’t. ” The box, in tiny print, says, “Made in China, just like   ties, dress shirts, suits, cuff links, eyeglasses, pens, lamps, mirrors, salad bowls, body soap and teddy bears. ” But Mr. Hoffman said he almost didn’t make his political views  —   and the card game  —   so public because he worried, as did his family and friends (who originally counseled him against it) that he might become a target for Mr. Trump and his Twitter account  —   or worse. “People are fearful that, especially in a circumstance where he might be in a position of extreme power as a potential presidential candidate, that that would be used in a retaliatory way, that would be used in vengeful way,” Mr. Hoffman told me in an interview. “Everyone gets worried about being attacked, and part of the logic and mechanics of bullies is that they cause people to be fearful that they’ll be singled out and attacked. ” Mr. Hoffman continued: “It’s the same thing like on school grounds, when people won’t go help the kid who is being bullied because they’re worried that the bully will focus on them. ” Mr. Hoffman articulated a view that is often whispered within the business community  —   among those who are voting against Mr. Trump  —   but rarely spoken aloud. I have talked to some of the top executives of the Fortune 500 companies in recent months, and I’d be   to name one who didn’t at least roll his or her eyes when Mr. Trump’s name was mentioned. Technology companies are afraid that Mr. Trump might criticize their approach to privacy, as he did with Apple. Wall Street banks worry he might seek to break them up. Health care companies are nervous that he might attack them over pricing. Multinationals are worried about trade. All of these are valid issues on the campaign trail  —   but with Mr. Trump, unlike other politicians, the criticism seems more personal and vitriolic. “I’ve had a whole bunch of those kinds of concerns from people around me,” Mr. Hoffman said. “People who have legitimate concerns about, ‘Would LinkedIn become a target for Trump’s ire and attacks? Would he make Second Amendment jokes about your friends and family? ’” That is not to say that all chief executives have remained silent this election season. A new survey I wrote about several weeks ago in this column showed just how influential those political positions can be, even if they are simply a signal to others. Chief executives like Howard Schultz of Starbucks, who has endorsed Hillary Clinton, have said positive things about the candidate they support  —   without going negative on the other candidate. However, only a handful of executives  —   mostly retired ones or entrepreneurs who work for themselves (think Mark Cuban, who has come out against Mr. Trump, or Kenneth Langone, who has castigated Mrs. Clinton) or those who seem to have been granted a special status (think Warren Buffett, a Trump foe) have been openly critical of either side. Mr. Hoffman said he had a theory for the silence. “There’s two sets of things that cause people to be quiet,” he said. “One is there’s a culture in America that business leadership is to be apolitical. It’s like Michael Jordan’s comment, ‘Republicans buy Nikes too. ’” (Mr. Jordan was quoted as saying that in “Second Coming,” the 1995 Sam Smith book about the athlete, about why he sought to avoid taking political positions publicly. Mr. Smith cited one of Mr. Jordan’s friends as the source.) Another reason for reticence in the business community, Mr. Hoffman said: “It’s fear for themselves, or fear they’re attentive to bringing their communities into it. ” While these undercurrents are always there during big elections, they seem more pronounced than usual during this ferociously contentious cycle. “I feel sympathetic to the folks, compassionate to the folks who fall silent in that fear,” said Mr. Hoffman, who then proceeded to issue a call to arms. “I think the only thing I would say is that precisely when you feel that fear, it’s precisely the time where if you aspire to be a courageous leader, that fear is a signal to you that you should step forward. ” After all, if those who can afford to make their voices heard do not do so, who will? “If you are in a position of power and in a position of being able to make a difference and you are feeling fearful, think what everyone else is feeling,” Mr. Hoffman said. All these sentiments dovetail with the reactions Mr. Hoffman said he had received about his card game. “I’ve had a number of Republicans actually think it was terrifically funny,” he said, explaining that he had asked some of them to provide promotional quotes about the game. “I’m hopeful maybe in the next week or two I might be able to persuade a couple of them, but thus far all of my requests to my friends for public quotes have been demurred  —   maybe out of fear of retaliation. ”'"}, "time": 1742562679.3958602}