{"duration": 0.04820561408996582, "input_args": {"text": "'November 2015 Ads THE BIG CHILL: Kill Fat Cells Instantly Just by Freezing Them! You’ll Never Believe How it Works   \\nFor most people, fat bulges are something they don’t want. It makes our thighs jiggle, our clothes fit tight and look bad, and typically lingers despite our torturous attempts to eliminate it. Too much of it increases our risk for certain illnesses like heart disease and type 2 diabetes, so for decades researchers have looked for ways to reduce it. Humans have two types of fat: white fat & brown fat, and understanding the differences between the two, can help people lose weight. “White fat” is the thin layer of blubber we see on the human belly. backs of arms and on the thighs. This particular fat acts as a thermal insulator, that keeps body temperatures stable. LEARN MORE: “Brown fat,” on the other hand, is less abundant in the body and creates heat, rather than trapping it like white fat does. Brown fat actually warms a cold body by burning energy or calories. White fat however, can take on brown fat characteristics, with the resulting product called “beige fat.” This process is called “browning.” Because beige and brown fat are able to burn calories, they are a positive force for weight loss, while an excess of white fat is associated with weight gain and obesity. According to Dr. Philip A. Kern, a researcher of the University of Kentucky School of Medicine, browning fat tissue would be an excellent defense against obesity, as it would make the body burn extra calories rather than converting them into fatty tissue. Where Do We Have Brown Fat? Brown fat can be difficult to study because it is hard to find in adults, and typically found in unpredictable locations in the body, and not always in the same place on every person. There’s a region in the neck and the shoulders, where you typically find it, but again not on everybody. In a recent study, brown fat was found in the chests and down the spines of a group of healthy young men, along with places in the abdomen…..'"}, "time": 1742561870.4106739}