{"duration": 0.03580045700073242, "input_args": {"text": "'Actress Scarlett Johansson revealed she would be open to running for public office in the future in an interview Wednesday. [In a conversation with Good Morning America‘s Michael Strahan, the    Avengers star said she has been “interested” in local politics for some time, but family commitments and her film career have kept her plenty busy.  “I’ve always, like I said, been interested in local politics,” the actress said. “Right now, I think with my young daughter and also the way my career is going right now   …     it’s just not the right time. But eventually, maybe when my daughter is older and I can totally focus myself on something like that, I think it could be interesting. ” The Ghost in the Shell star said she makes no apologies for supporting liberal policies that might offend her potential audience: “I’m not afraid to say what I feel is right, just because I think that I’m going to face criticism, or some people might not like me. ” In recent months, Johansson has become a vocal critic of President Donald Trump. In September, the actress appeared alongside her Avengers cast mates in a voter registration PSA meant to rev up support among younger voters and millennials to turn out on Election Day for former Democratic presidential candidate Hillary Clinton. The   actress also participated in the   Trump Women’s March in Washington D. C. where she delivered a speech railing against the president. Scarlett Johansson to Trump: ”I want to be able to support you, but first, I ask that you support me” and all women https:  .   —   NBC News (@NBCNews) January 21, 2017,  In her interview Wednesday, Johansson said she would continue to support   organizations like Planned Parenthood even if it causes some people to stay away from her films. “If fighting, you know, for women’s rights, for women’s reproductive rights, and you know, in support of Planned Parenthood, if that’s going to, you know, mean that some people don’t want to buy a ticket to see Ghost in the Shell, then   …     I’m OK with that,” she said.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742561831.3834023}