{"duration": 0.01702141761779785, "input_args": {"text": "'If you want to get some women mad, there are more ways than by electing Donald Trump. Try doing what The New York Times did: writing a story about a bunch of fathers in Montclair, N. J. who had to endure the hardship of watching their children for a day while their wives attended protest marches in Washington and New York. “In their wake,” the story said, “they left behind a progressive bedroom community with suddenly skewed demographics. Routines were radically altered, and many fathers tried to meet weekend demands alone for a change. ” Poor daddies. Poor kids. The headline on the home page didn’t help matters: “When ‘Mommy Has to March,’ Routines Shift. ” Ouch. The headline on the story was this: “How Vital Are Women? This Town Found Out as They Left to March. ” As you might imagine, the story rubbed more than a few readers the wrong way. Hannah Laurison of Philadelphia had this to say: And here’s Jessica Wilbanks from Houston: “There is so much wrong with this piece that it’s hard to know where to start. How is it a hardship that wealthy men in a privileged community are taking care of their own offspring for less than 24 hours?” Not to be left out, people chimed in on Twitter, including this dad: The Huffington Post beat me to my job with a good piece on the matter that it posted this afternoon. Check it out here. There is pretty much nothing about this piece that I think was wisely considered, for all the reasons readers already articulated. The staff produced some strong, readable coverage of the march in New York, but this wasn’t among it. Here’s the silver lining, and the part I found exhilarating. The Metro editor, Wendell Jamieson, whose section produced the piece, unequivocally acknowledged that it was a mistake. “It was a bad idea from the ” Jamieson said. “It was conceived with the best intentions, but it fell flat. And I regret it. ” Classy. Needless to say, I agree.'"}, "time": 1742628545.3943038}