{"duration": 0.03634285926818848, "input_args": {"text": "'It seems DICE is done with their inaugural entry in the Star Wars Battlefront series, and is now putting all of its focus on the 2017 sequel. [“DICE isn’t done with Star Wars,” the developer posted on EA’s official Battlefront blog, but the team behind 2015’s reboot of the cult classic multiplayer games has “shifted its focus” toward “the next great Star Wars game. ” This is, of course, the inevitable Battlefront 2.  DICE isn’t hogging all the credit  —   or blame, depending on your opinion of 2015’s Battlefront. They’ve called their next release a “collaborative effort” between themselves and the teams at developers Criterion and Motive. According to Motive’s Jade Raymond: A new installment of Star Wars Battlefront is currently in development at DICE, in collaboration with Motive Studios in Montreal. Our team at Motive team is growing quickly, and making great progress in building out a significant new addition to the game. While we’re not ready to get into specifics right now, we have started development of this game by listening to all of the feedback we received, while also innovating in new areas I think you’re all going to be excited about. While DICE’s announcement means that we won’t see any further content added to the offline Skirmish mode introduced to Battlefront last year, 2017’s   will feature a full single player campaign that spans “multiple Star Wars eras,” according to EA CEO Andrew Wilson himself during an earnings call on January 31: Our next Star Wars Battlefront will be even bigger, taking players into more locations and allowing them to play with more heroes and characters across multiple Star Wars eras. There will be new ways to play, including an all new   campaign and much, much more that we are excited to share with our players in the months ahead. Star Wars Battlefront was a hopeful first attempt, a   to the sights and sounds of the iconic series. Unfortunately, even CFO Blake Jorgensen was forced to admit that it didn’t have enough depth to hold on to many of its most hardcore players. It was a game as praised as it was maligned, prioritizing atmosphere and accessibility over longevity. Despite its many criticisms, fans devoured it. It sold upwards of 14 million copies. The next game is doubling down on scope and depth alike, and EA is devoting those three studios to make sure it succeeds. Wilson said that they “have every reason to believe” that they’ll be able to deliver “exactly what fans are asking for. ” Star Wars Battlefront 2 will release some time in late 2017, probably in the vicinity of Star Wars Episode VIII: The Last Jedi’s theatrical premier in December. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562047.3516877}