{"duration": 0.06453633308410645, "input_args": {"text": "'College Students Threatened by Cops for Handing Out U.S. Constitutions Nov 5, 2016 2 0 \\nThe first amendment of the US Constitution was just treated like gum on the bottom of a police officer’s shoe at Grand Valley State University in Michigan. Bullying free speech — one of the first rights we as Americans are entitled to under constitutional law — was standard operating procedure for officers who threatened students giving out copies of the document to fellow classmates. \\nGrand Valley State University didn’t stand behind students’ rights when they were threatened for handing out the constitution and pamphlets promoting their newly created group, citing an obscure commandment from the ‘office of student life.’ Instead the school backed up threats of arrest issued by police officers. \\nCampus Reform stated that one officer told students , “In order to do that, you gotta be approved by the office of student life,” asserting that the school policy applies to any distribution of materials, even if one is not selling something or asking for monetary contributions. \\nNathan Berning, a Michigan field representative from the Leadership Institute who was advising the students over the phone during the altercation, told Campus Reform that he found it “unacceptable” that a person “can’t hand out Constitutions to college students” in a country that enshrines free speech in its founding document. \\nInstead of facing time in jail, the students politely discontinued their act of passing out materials, even though this is protected by law. Berning attests this is the third incidence lately of students being threatened for expressing their freedom of speech, even in protected ‘Free Speech Zones.’ \\nThese zones are controversial to begin with. West Virginia University recently censored their students to two small areas of campus in which they are allowed to express their thoughts. Ninety-nine percent of campus was off limits to anyone who wanted to have their way with the First Amendment. \\nAs one Huffington Post article offers , a “Free Speech Zone’ is a backwards way of saying, “Just shut up” to University students. At a recent Yale University discussion on the topic, 66 percent of attendees felt their first amendment rights were being trampled on with these euphemist ‘zones.’ \\nA NY Times blogger on the topic called them micro-aggressions to young people and University students at large. \\nThe University of Chicago is taking a differen t tack. John Ellison, dean of students, wrote to a recent class of freshman, \\n“Our commitment to academic freedom means that we do not support so-called trigger warnings, we do not cancel invited speakers because their topics might prove controversial, and we do not condone the creation of intellectual ‘safe spaces’ where individuals can retreat from ideas and perspectives at odds with their own .” \\nThe Foundation for Individual Rights in Education or FIRE recently launched a national campaign asking colleges and universities to adopt the free speech policy statement produced by the Committee on Freedom of Expression at the University of Chicago. The statement guarantees “all members of the University community the broadest possible latitude to speak, write, listen, challenge, and learn,” and makes clear that “it is not the proper role of the University to attempt to shield individuals from ideas and opinions they find unwelcome, disagreeable, or even deeply offensive.” \\nThe GVSU reaction to free speech on campus is particularly alarming considering that students pay more than ever to attend institutions of ‘higher learning’ which have become nothing more than an extension of the corporation. Student loan debt now exceeds $1 trillion in the U.S., and while universities are more than eager to take students cash, they aren’t so keen on protecting their rights to free expression. Getting that highly coveted certificate of graduation has become more expensive than ever, but it isn’t just money at stake. Vote Up Christina Sarich Christina Sarich is a musician, yogi, humanitarian and freelance writer who channels many hours of studying Lao Tzu, Paramahansa Yogananda, Rob Brezny, Miles Davis, and Tom Robbins into interesting tidbits to help you Wake up Your Sleepy Little Head, and *See the Big Picture*. Her blog is Yoga for the New World . Her latest book is Pharma Sutra: Healing The Body And Mind Through The Art Of Yoga .'"}, "time": 1742628404.612083}