{"duration": 1.3221867084503174, "input_args": {"text": "'Fighting Racism Where White Workers Are Hurting, Too Fighting Racism Where White Workers Are Hurting, Too By 0 118 \\nSince 2011, Maine’s bombastic Republican governor Paul LePage has given America a taste of what it might be like to live under a Donald Trump presidency. \\nLike Trump, LePage has made outrageous comments against immigrants and communities of color. They include telling the NAACP to “kiss my butt,” publicly complaining about “guys with the name D-Money, Smoothie, Shifty” selling drugs and impregnating “young, white” girls , and blaming “illegals” for spreading diseases like HIV — all while cutting funding to cities that offered health care and other assistance to undocumented immigrants. \\nAfter five years of LePage practicing an extreme form of wedge politics, people like Ben Chin are working to heal the resulting divisions in Maine. \\nChin, the 31-year-old grandson of an undocumented Chinese immigrant, has been working with the Maine People’s Alliance to rally support from white working class neighborhoods for a series of progressive ballot measures this November. (Photo: David McSpadden / Flickr) \\nCountering the racist and nativist appeals of candidates like LePage and Trump, their goal is to get people to reject the politics of scapegoating immigrants and people of color and to instead focus on the real causes of — and solutions to — their economic distress. \\n“We’re starting out a conversation in which we’re making it clear we’re on their side,” Chin said in a recent phone interview. “That’s the foundation that gets laid for whatever comes next.” \\nThese conversations are based on the research and experience of a broad range of grassroots organizations that have been struggling to get working-class white voters across the nation to see beyond the color line. \\nChin got a personal taste of division politics when he was racially caricatured during his 2015 run for mayor of Lewiston, Maine. During his campaign, a local businessman paid for billboards that said, “Don’t vote for Ho Chi Chin. Vote for more jobs not more welfare.” \\nSince then, Chin’s turned his political focus to ballot initiatives that include increasing the state’s minimum wage and levying a 3 percent tax on household incomes over $200,000 a year. \\nChin and his fellow Maine People’s Alliance members don’t have a “silver bullet” set of talking points that disarms the people they encounter with racist or anti-immigrant attitudes. Instead, they focus on questions that get people to think about their economic anxieties in a deeper way. \\nOne question they ask is, “Why do you think some people are poor and other people are rich?” \\nThat opens up a discussion about the ways a small group of the wealthy and powerful are stacking the economic deck against ordinary people of all colors, with their black and brown neighbors feeling it the most because of America’s history of systemic racism. \\nChin said he was particularly struck by a recent conversation with a voter in Auburn, Maine. The voter was undecided about whether to support a referendum that would increase the state’s wage to $12 an hour by 2020. \\n“One of his ideas was that ‘certain people’ were going to get a wage increase,” Chin said. “We tried to unpack that.” \\nThey talked about his life experiences and whether he really believed that increasing the minimum wage was about helping some “certain” group of undeserving freeloaders. \\nChin said that though this voter wasn’t a “raging justice activist” by the end of their conversation, he was more thoughtfully considering the minimum wage. \\nConversations like these are happening in many states around the country this election season, as progressives grapple with the mainstreaming of racist and nativist appeals by Trump and other far-right politicians. \\nThese types of empathetic conversations are the nemesis of the conservative-corporate elite who have engineered extreme wealth inequality and, for too many, the disappearance of the American dream. \\nThe last thing politicians who benefit from wedge politics want to see is working people across the nation transcending racial and cultural lines, and realizing those same politicians are the common source of their pain.'"}, "time": 1742564235.3547182}