{"duration": 0.0646216869354248, "input_args": {"text": "\"Trump vs. Clinton: A risk vs. a disaster Larry Elder: Hillary has never been asked by anyone in media about Juanita Broaddrick Published: 26 mins ago × Receive Larry Elder's alerts in your email \\nBONUS: By signing up for Larry Elder’s alerts, you will also be signed up for news and special offers from WND via email. error Print \\nTwo weeks left to go in the election and the electorate feels like a battered NFL fan. The game gets increasingly old and tiring to watch, and playing it can inflict permanent brain damage. \\nDemocrats can be counted upon to call the Republican opponent racist, whether the opponent is the priestly Mitt Romney or the Supreme Court justice who wrote the Dred Scott decision. Donald Trump, you see, is “racist” because, among other reasons, at a campaign stop he pointed to a black man and called him “my African-American.” Hillary Clinton, on the other hand, is not anti-Semitic, even though three witnesses, one of whom took and passed a polygraph, claim that she referred to her husband’s former congressional campaign manager as a “f–-ing Jew bastard.” \\nWith a Republican candidate, the media can be counted upon to seize upon any deficiencies – big or small, real or imagined – while giving the Democrat a pass. So Trump’s “failure to ever apologize” outweighs an examination of Clinton’s flat-out lie during the third debate when she insisted that the Supreme Court Heller case was about “toddlers,” as opposed to the fundamental issue of whether the Second Amendment confers an individual right to keep and bear arms. \\nIn Heller, nowhere in the majority decision or in any of the dissenting decisions does the word “toddler” appear. Clinton, a year ago, flat-out said, “The Supreme Court is wrong on the Second Amendment.” To normal people, this meant she opposed what the decision ruled on, which, again, was whether we, as individuals, have a right to keep and bear arms. \\nMeanwhile, we learn more and more about what the media labels an “email scandal,” when the accurate description is “national security scandal.” The Espionage Act criminalizes gross negligence in the handling of important national security matters. The law does not require, as FBI Director James Comey falsely stated, an “intent.” Nor is it relevant, as Clinton insists, whether or not her private server, the one she maintained in her basement, was “hacked.” \\nFive people who worked with or for Clinton, including her chief of staff, all received immunity deals, something normally given to get someone to flip on a target. Some of the five were involved in deleting emails after the emails were subpoenaed. But the “target,” that is to say Hillary Clinton, was deemed by Comey to have lacked sufficient criminal intent to be prosecuted. So why the immunity deals? Who knows – and as far as most of the media are concerned, who cares? \\nClinton insists that “President Obama doesn’t get enough credit” for the swell job he did with the economy. This would be the economy in which, for the first time in history, a president has presided over a recovery without a single year of at least 3 percent growth in gross domestic product. This would be the same economy with an alleged low unemployment number that Gallup CEO Jim Clifton calls “the big lie,” given the large number of people who simply abandoned the job hunt or are under-employed. \\nMeanwhile, it’s yet another day in which another woman who alleges she was kissed, groped, touched, or made fun of by Trump has appeared with her attorney, feminist Gloria Allred. Allred, a Clinton supporter, sees no contradiction between representing alleged victims of Trump’s sexual misconduct and her support for Clinton, who is alleged to have hired private detectives and lawyers to dig up dirt on her husband’s accusers. One such accuser, Juanita Broaddrick, claims not only that she was raped by Bill Clinton but also that two weeks after the alleged rape, Hillary Clinton verbally threatened her. \\nHillary Clinton, mind you, has never been asked by anyone in the media about Broaddrick’s allegation. Never. And only one national reporter, Sam Donaldson, has ever asked Bill Clinton about Juanita Broaddrick’s allegation. Ever. Clinton’s answer? He referred Donaldson to his lawyer, David Kendall. Donaldson quickly tried again, asking the then-president to “simply deny it.” Same answer: “My attorney … speaks for me.” And that was that. \\nSo Hillary Clinton is a candidate who wants to continue the same policy that’s given us the worst recovery since 1949; who has clearly violated the Espionage Act and placed the nation’s security at risk; who told the Benghazi victim’s families that the death of four Americans was inspired by a video, while telling her daughter and foreign officials something entirely different; whose charitable foundation engaged in pay-to-play in Haiti, so that donors got contracts for disaster relief and non-donors went to the back of the line; who wants to gut the Second Amendment; who wants to continue the same foreign policies that that have encouraged aggressiveness on the part of ISIS, Russia and the Chinese; and whose media compadres, including scribes with the New York Times, Washington Post and CNBC, have been outed by WikiLeaks as colluding with her campaign. And she is now odds-on favorite to become the next president of the United States. Receive Larry Elder's commentaries in your email BONUS: By signing up for Larry Elder's alerts, you will also be signed up for news and special offers from WND via email. Name *\""}, "time": 1742562298.444354}