{"duration": 0.03755307197570801, "input_args": {"text": "'In a “white paper” published by the Washington Post, ATF Associate Deputy Director Ronald Turk shows that a continued ban on the importation of numerous “assault weapons” is nonsensical. [The reasons behind his assessment include the growing use of   and similar rifles for hunting and shooting sports.  Turk wrote, “Since the sunset of the Assault Weapons ban in 2004, the use of     and similar rifles now commonly referred to as ‘modern sporting rifles’  has increased exponentially in sport shooting. These firearm types are now standard for hunting activities. ” Because of his paradigm shift regarding the view and usage of “assault weapons,” Turk suggests the ATF review and update its “almost    study” on such firearms. He then made clear that another reason for lifting importation limitations is the fact that American manufacturers currently make and sell rifles that are identical or similar to many of the firearms that are banned from import. Because of this, “restriction on imports serves questionable public safety interests. ” Turk also noted that a characteristic of importation bans in this area has been modifications to   rifles modifications that allow them to survive the import restrictions and enter the U. S. under different classifications. The various classifications mean more unnecessary work for importers and more paperwork for the ATF. He also addressed suppressors, highlighting their broad use in hunting and shooting sports and suggesting it is “archaic” to continue to regulate them via the National Firearms Act. Turk touched on M1 Garands,   1911s, and other U. S.   firearms that are in holding overseas, awaiting clearance to be shipped back to the U. S. and sold to citizens. He wrote: There is no clear public safety reason why     CR defense articles should be denied   to the American public, while many  . S.  origin CR items are approved. Additionally, these items do not represent any discernable public safety concern, as demand lies with collectors of vintage military firearms. Importation and sale through licensed dealers would effectively regulate the lawful transfer of these firearms through a licensee and a background check. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742564400.9371853}