{"duration": 0.08202528953552246, "input_args": {"text": "'Email \\nIn the US, the political system has now disgorged two candidates the citizenry cannot be less enthusiastic about. Driven by ambition more than a love of the people or a sincere desire to serve, one can be forgiven for wondering if they are just as trapped by their motivations as the public in its two-party myopia. No authentic leader among the two … \\nThese thoughts lead to the rage of my youth, existentialism, and to Jean-Paul Sartre, who died 36 years ago last April. More than 50,000 mourners lined the streets and packed Montparnasse cemetery at his funeral, many quite young — improbable they would exhibit a similar interest in the successor philosophies, notably the current preoccupation with deconstruction, a focus on whether the written or spoken word is successful (or not) in clarity of meaning. \\nDifficult as existentialism may be to pin down, there are a few necessary elements: the individual, free will as crucial to human existence, the subsequent responsibility for action that accompanies it, leading to an unavoidable anxiety as a consequence. The authentic life then is one chosen freely rather than imposed by society. No wonder it appealed to the young. \\nWhat triggered this meandering into Sartre and his philosophy was Hillary Clinton’s two-minute summing up at the end of the last debate. She attested to her lifelong concern (her latest claim) for improving the lives of children — a phrase bringing to mind a balancing scale. One one side the improved lives of children in Arkansas and the benefits of subsidies to children in general, and on the other the deaths of hundreds of thousands in Iraq, Syria, Libya and elsewhere — the most vulnerable that is the old, the sick and the children bearing the brunt. Politicians are a breed apart, unconcerned with ‘responsibility’ and undisturbed by Sartre’s ‘anxiety’. \\nNot so long ago there was another US Secretary of State, Madeleine Albright, who, when asked about the 576,000 children who had died (according to a UN report) as a result of the Iraq embargo, simply dismissed the question as a price to be paid to be rid of Saddam Hussein. The embargo failed in that regard, and when Saddam was removed by the successor US government’s military intervention, it resulted in chaos and the birth of ISIS. \\nThe Republican candidate, Donald Trump, is unique, in that responsibility washes over him and into the shower drain like a layer of dirt; he is devoid of it even in personal interaction. The only rational explanation of his behavior is the term ‘prolonged adolescence’ used by professionals. \\nHis basic issue over several decades has been bad deals — bad deals in defending allies who he feels do not pay enough for their defense and bad trade deals. Trying to peel off some voters, Hillary Clinton in the last debate pointed out that he took out an ad in The New York Times opposing the right’s iconic Ronald Reagan over it. Like any business owner or high level executive, he intends to issue orders expecting them to be carried out. Good luck! It might explain the absence of concrete policy. \\nThe American public has been short changed into picking either the lesser of two evils, casting a protest vote with the minor left or right party, or just sitting this election out. \\nSartre offered personal bliss in the few post-war years of hope and promise before America’s fear of ideologies and overweening sense of power plunged us into successive wars punctuated with interludes of peace. The wars continue, bleeding the country of an estimated $5 trillion in the present cycle … the death and destruction the worst since the Second World War.'"}, "time": 1742561921.4420784}