{"duration": 0.1368403434753418, "input_args": {"text": "'This summer, I went on a   tour with my movie “Don’t Think Twice,” a comedy about an improv group that has to decide whether to stay in show business when one member is plucked for a “Saturday Night Live” type of show. At every Q. and A. session for the movie, people would ask the same question: “If I want to be a comedian [or actor or writer or improviser or film director] how do I get started?” The truth is they should probably pick someone more successful to ask  —   I make small films, small   shows Off Broadway and small comedy specials for Netflix  —   but I’m the person who showed up to talk to them. And now I’m the person offering you unsolicited advice  —   so if you don’t need it or want it, this is not for you. Anyway, I’ve boiled my answer down to six ideas. 1. DON’T WAIT Write. Make a short film. Go to an open mike. Take an improv class. There’s no substitute for actually doing something. Don’t talk about it anymore. Maybe don’t even finish reading this essay. 2. FAIL Don’t worry about failing. There’s a great video where Ira Glass explains that when you start in a new field, your work won’t be as good as your taste. It will take years for your taste and the quality of your work to intersect. (If ever!) Failure is essential. There’s no substitute for it. It’s not just encouraged but required. The bedrock of all good pieces of writing is 10 bad drafts. Maybe 20. I wrote 12 drafts of “Don’t Think Twice,” 14 drafts of my first movie, “Sleepwalk With Me,” and worked on my first   show for six years. My first   set on “Late Show With David Letterman” in 2002 was mined from three hours of   material that I had tried and failed with for six years. 3. LEARN FROM THE FAILURE This is where it becomes important to find a community of people you respect. People who have good taste. People who might not be good at something themselves but know what good is. They might be in a theater company, at an improv school, or live in your dorm. They aren’t the easiest thing to find. When I was in college, every Wednesday I drove my girlfriend Maggie’s Ford Taurus to an open mike at a Best Western 40 minutes away, to enter a lottery of 30 comedians trying to win one of the nine spots to perform in front of the other angry 21 comedians. It sucked. People didn’t like my comedy there. I didn’t love theirs. It wasn’t a fit. But then I got a job working as a door person at the DC Improv comedy club in Washington, and that was a fit. Around the same time, I was cast in my college improv group. So all at once, I met people whom I could bounce jokes and ideas off of. They’d give me candid feedback, and I tried to listen. I wasn’t great at it at first. It’s hard to hear criticism. But I’ve learned that harsh feedback, constructive feedback, even weird, random feedback, is all helpful, if you know the essence of what you’re trying to convey. I once heard an interview where Ron Howard said that he tests the rough cuts of his movies with a ton of audiences. He doesn’t do it to be told what the movie’s vision should be, but to understand whether his vision is coming across. If not, he makes changes. Your vision is not being conveyed a majority of the time. With “Don’t Think Twice,” I workshopped the script like the way I workshop my standup: I invited friends over to read it out loud in my living room and then fed them pizza. The pizza was excellent. The script often wasn’t. So I’d get my friends all drunk on pizza and then ask them hard questions like: “What do you like least about the script? Be honest. I can take it. ” That’s where I learned the most. 4. MAYBE QUIT You might not be meant to be a writer or performer or improviser. You might be meant to teach kids math or raise money for a food bank or start a company that makes Rubik’s Cubes for babies. Don’t rule out quitting. There is going to be an insane amount of work ahead, and your time might be spent better elsewhere. There was a great column in The New York Times recently where Angela Duckworth writes, “Rather than ask, ‘What do I want to be when I grow up?’ ask, ‘In what way do I wish the world were different? What problem can I help solve?’ This puts the focus where it should be  —   on how you can serve other people. ” 5. BE BOLD ENOUGH TO MAKE STUFF THAT’S SMALL BUT GREAT Eight years ago, I made a network sitcom pilot based on my life. It was a dream come true. A sitcom about my life? What could be better than that for a standup comedian? Well, it didn’t get picked up. I was devastated. But here’s the kicker: Failing to get that sitcom was the single greatest stroke of luck that’s happened in my entire career. The show wasn’t truly my comedic voice. It was watered down by network and studio notes to the point of being like dozens of other bland sitcoms. After that, I no longer wanted to create projects for the Hollywood gatekeepers. The networks. The studios. Since then, I’ve created a handful of pieces for “This American Life,”   three Off Broadway   shows, toured hundreds of cities around the world, and written, directed and starred in two feature films. All outside the system. Based on that work, I’ve been offered small movie roles by people who work inside the system. Which is to say: Leaving the system behind and creating something of your own may actually be thing that gets you into the system, hopefully on your own terms. The point is, forget the gatekeepers. As far as I’m concerned, what you create in a       improv theater in Phoenix can be far more meaningful than a mediocre sitcom being   by seven million people. America doesn’t need more stuff. We need more great stuff. You could make that. 6. CLEVERNESS IS OVERRATED, AND HEART IS UNDERRATED Plus, there are fewer people competing for heart, so you have a better chance of getting noticed. Sometimes people say, “One thing you have to offer in your work is yourself. ” I disagree. I think it’s the only thing.'"}, "time": 1742561632.7551072}