{"duration": 0.04248690605163574, "input_args": {"text": "'A champion female runner who faces being stripped of her titles after revelations that she was born a man has been convicted of attempting to murder a sports official who outed her past life, authorities say, The Daily Mail reported. [Champion   Lauren Jeska was arrested for the stabbing attack on British Athletics official Ralph Knibbs in March of last year. Police say Jeska also attacked two of Knibbs’   during the incident.  Officials called the March 22 attack at the Birmingham open plan UK Athletics office “frenzied” and “wholly unprovoked,” yet was also a “cool and calculated attack. ” The attacks came after Jeska faced having her series of wins vacated because she refused to supply blood tests to prove she had a woman’s level of testosterone in her system at the time of her victories. “We understand Jeska had been asked to provide further evidence of hormone levels after historical complaints to UK Athletics that she had an unfair advantage competing in women’s events because she had been born a man,” Detective Sergeant Sally Olsen said after the latest hearing. “The governing body’s policy required the athlete to take a blood test but she took exception to this and feared being unable to compete,” Olsen added. Police discovered from a psychiatrist who interviewed the suspect that she “fantasized about going to the Alexander Stadium and killing all of the staff. ” During the attack, Jeska stabbed Knibbs in the neck nicking his carotid artery, but even as blood spurted out across the room with each heartbeat, the victim warded off further blows until two colleagues came to subdue Jeska. The other two men were also injured in the attack. Despite the loss of blood, Knibbs survived the attack. The victim said he suffered a   during the attack and now also suffers permanent vision loss. He testified that the attack was a “traumatic,   experience. ” Lauren Jeska was handed an   jail term for her crime. She will not be eligible for parole until she has served   of her sentence. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564135.4342175}