{"duration": 0.04769420623779297, "input_args": {"text": "'Mainstream media in shock after a solid Trump victory; Clinton concedes; will Obama go quietly into the night? Liberals infuriated; people chanting \"lock her up, lock her up [...]\" By Shepard Ambellas - November 9, 2016 ( INTELLIHUB ) — Early Wednesday morning Donald J. Trump accepted the Presidency of the United States like a true gentlemen, even thanking Hillary Clinton for her long-winded service to the country. \\n“Now it’s time for America to bind the wounds of division. […] It is time for us to come together as one united people.,” Trump said. \\nTrump also reached out to those who chose not to support him in the past for their “guidance and help” to make America great again. \\n“It’s a movement comprised of Americans from all races, religions, backgrounds and beliefs who want and expect our government to serve the people, and serve the people it will.” \\n[…] \\n“Working together, we will begin the urgent task of rebuilding our nation and renewing the American dream. I’ve spent my entire life and business looking at the untapped potential in projects and in people all over the world. That is now what I want to do for our country,” Trump said. \\n“We must reclaim our country’s destiny and dream big and bold and daring. We have to do that. We’re going to dream of things for our country and beautiful things and successful things once again.” \\nAt a victory party Trump supporters could be heard chanting “lock her up, lock her up […],” Tom Llamas told ABC News, pointing out that Hillary Clinton’s problems may not be over just yet. Not to mention how such rhetoric infuriated liberals nationwide. Chants of “LOCK HER UP!” at Trump party raise the necessary Q: Will Trump appoint a special prosecutor to take on Clinton, as promised? \\n— McKay Coppins (@mckaycoppins) November 9, 2016 \\nAs the night went on most mainstream figureheads and pundits went into panic mode as the results started to flip, showing overwhelming favor of Trump. They just couldn’t figure out how or why Mr. Trump won. It’s as if they actually believed their masters fake polls that they were airing the entire race. \\nLet me also mention that in many documented cases, people who voted ‘all Republican’ across the board had issues at the polls with the machines actually switching their votes from Donald Trump to Hillary Clinton. Interestingly enough, despite the fact that a number of Soros deployed voting machines were likely rigged, Trump still won with some lead. \\n— TheAngryOne (@The_AngryGuy) November 8, 2016 \\nIt makes you wonder what the actual numbers were. In fact they probably were consistent with many Intellihub polls which have shown Trump vs. Clinton at an 60/40 to and 80/20 split, like the following poll taken on Election Day which shows Trump at 62% over Hillary’s 33. \\nWe are in the midnight hour #ElectionDay , who will win \\n— Shepard Ambellas (@ShepardAmbellas) November 8, 2016 \\nIt was also noted by an analyst friend of mine that the Hillary campaign likely was devastated by what they thought was going to be a guaranteed victory and that we will likely see some corrupt politicians flee Washington D.C., like ‘rats in the streets.’ \\nThen we have to contend with the fact that Trump does not take office until Jan. 20, 2017, which may give the rats in D.C. enough time to conduct a counter strike on the Trump campaign. Will Obama go quietly into the night? \\nThe short and simple answer is: no, he will not. At minimum we can expect more executive orders and the pardoning of connected individuals on his way out. Not to mention that Obama likely has a trick up his sleeve. \\nThere is always a ‘Plan B,’ which is essentially orchestrated chaos which would allow Obama to then suspend Trump’s inauguration. In fact, all that Obama needs to make it happen, legally, through executive order, would be for a crisis of some type to occur in between now and the inauguration — it’s that simple. \\nEven an ‘act of God,’ such as a ‘ devastating space weather event ‘ could trigger such action and may. \\nWe can also expect pockets of unrest, especially in major cities. \\nThe bottom line is: the elites do not want to loose their power and are not going to wait another four years to regain it. \\n#RemainVigilant \\n#MAGA Shepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter . ©2016. Intellihub.com. All Rights Reserved.'"}, "time": 1742628490.8940265}