{"duration": 0.1191866397857666, "input_args": {"text": "'Suppressed! Why is the Vatican covering up the history of the pre-flood world?   \\nThere has been a massive cover-up by the Roman Catholic church to keep the general public from understanding that there was a pre-flood civilization. The history of the pre-flood world has been covered up and glossed over by the Vatican, due to Biblical ideologies and as a way to keep the world from interacting with alien species. Is the Vatican controlling history? Uncovering the suppression of pre-flood world history by the Vatican \\nHistory has been overwritten by powerful forces, and artifacts and scholarly articles that would testify for this pre-flood world have been confiscated. Churches were built over pagan sites to both conquer the civilizations and to cover up pre-flood remains. A narrative has been propagated that we were once a Neanderthal species, which then evolved into our current human state. However, with first-hand testimony, it has been uncovered that this is false. But why would the core of the Roman Catholic church orchestrate this cover up? \\nThis is because this pre-flood civilization was in fact seeded by an alien species. This species built an amazing set of monoliths and towering artifacts, simply unparalleled in today’s world. These aliens seeded the early human populations to bring them to where we are today—although the flood wiped away much of this evidence. If the general public knew about this prior civilization, there would be no control over the population. Furthermore, the pagan sites that many churches were built over served as portals for these aliens to travel back and forth between Earth and their areas of the universe . \\nSome evidence of this lies both in the remains of giants and those with other genetic deformities. These abnormalities were due to the intermingling of non-human species with humans. \\nFigure 1: Artificial deformation of the cranium https://upload.wikimedia.org/wikipedia/commons/5/57/D%C3%A9formation_P%C3%A9ruvienne_MHNT_Noir.jpg \\nThe flood attempted to wipe the slate clean of all of these abnormalities but did not fully do the job. Therefore, the Vatican had to come in with the ideologies of the Bible and attempt to cover up the rest of the evidence. It is truly fascinating to see some of this massive cover up exposed as curious researchers dig up more and more evidence of this great civilization. \\nThis article (Suppressed! Why is the Vatican covering up the history of the pre-flood world?)  '"}, "time": 1742563909.2280192}