{"duration": 0.061593055725097656, "input_args": {"text": "'Tourists from China are avoiding France amid surging violence and crime, a Chinese tourism expert has said, reporting that customers are turning to Russia as a safer destination. [President of the Chinese Association of Travel Agencies in France,   Zhou, said “increasingly violent” thefts and assaults are turning France into “one of the worst destinations for foreign tourists”.  Mr. Zhou, a representative for major Chinese travel agency Utour in France, reported a steep decline in visitor numbers from Asia, and said many tourists are now looking to Russia as a less dangerous holiday destination. “In 2016, there were 1. 6 million Chinese tourists compared to 2. 2 million in 2015. The  number of Japanese tourists dropped 39 per cent, and Koreans 27 per cent. Our tourists have turned to Russia, which is less attractive but at least it is a safe country. For Putin, it is an economic windfall” he told Le Parisien. Rising violence and aggression account for the drop, according to Mr. Zhou, who said: “For a number of Chinese tourists, the dream of visiting France and Paris has turned into a nightmare. “[Chinese tourists] are robbed in the palace of Versailles, at the foot of the Eiffel Tower, in front of their hotel, as they leave the coaches   …     In high season, not a day goes by without tourists being assaulted. ” Violent incidents in France have “sparked panic” on social media in Chinese, Mr. Zhou said, recalling one in which an    man was seriously injured as he tried to resist thieves, and he reported how female tourists have been pushed to the ground while criminals steal bags containing all their papers. Having lived in France for 25 years, Mr. Zhou said he has borne witness to the country’s deteriorating security situation over the decades, which has resulted in Paris ranking “number one in Europe in terms of the upsurge in delinquency”. While so far there are no organised campaigns calling on Chinese tourists to avoid visiting France, the experienced travel agent said that a boycott “has already begun” with “several Asian operators preferring to divert Asian tourists to Italy, Spain, and Russia”. Paris’s regional tourism office last year reported a slump in visitor numbers to the city, and attributed some of the decline to terror fears, as more than 200 people have been killed in Islamic terror in France since 2015.'"}, "time": 1742562620.8356805}