{"duration": 0.05079960823059082, "input_args": {"text": "'Hillary Clinton was spotted dining with her Saturday Night Live impersonator, comedian Kate McKinnon, Wednesday at an Italian restaurant in Manhattan’s Theatre District. [The former Democratic candidate reportedly stopped into Orso restaurant before heading off to see the Broadway musical  Sunset Boulevard.  Hillary Clinton and the woman who plays her on SNL, Kate McKinnon, had dinner yesterday in the theater district https:  .  pic. twitter.   —   Jennifer Epstein (@jeneps) February 17, 2017,  “Lots of laughter emanated from their table,” one fellow diner told Page Six. The dinner photo prompted speculation on social media that Clinton could return to Saturday Night Live for a cameo this weekend. McKinnon took on the role of Clinton throughout the 2016 presidential campaign. Clinton and McKinnon sparked a friendship after the pair appeared alongside each other in an October 2015 Saturday Night Live “cold open” sketch.  The   bit saw McKinnon playing a   more relaxed candidate Clinton. The pair traded barbs    and ripped on   candidate Donald Trump. The actress won an Emmy for her SNL portrayal, after which Clinton admitted that she’s a “big fan” of McKinnon’s. The warm feelings are apparently mutual, as McKinnon told the Hollywood Reporter in the early days of the 2016 campaign that she was “rooting for” Clinton to win. Congratulations on your Emmy, Kate! Big fan of yours, too. pic. twitter.   —   Hillary Clinton (@HillaryClinton) September 19, 2016,  Clinton has spent her   days hiking, watching plays, and taking shots at Trump on social media. Last week, Clinton starred in a video for the women’s rights group MAKERS in which she praised the “amazing energy” of last month’s   women’s march and proclaimed that the “future is female. ”   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742563876.830522}