{"duration": 0.0738821029663086, "input_args": {"text": "'posted by Eddie Four Russian strategic bombers triggered U.S. air defense systems while conducting practice bombing runs near Alaska this week, with two of the Tu-95 Bear H aircraft coming within 50 miles of the California coast, the North American Aerospace Defense Command (Norad) confirmed Wednesday. “The last time we saw anything similar was two years ago on the Fourth of July,” Navy Capt. Jeff Davis, a Norad spokesman, told the Free Beacon . Davis said the latest Bear H incursions began Monday around 4:30 p.m. Pacific time when radar detected the four turbo-prop powered bombers approaching the U.S. air defense zone near the far western Aleutian Islands. Two U.S. Air Force F-22 jets were scrambled and intercepted the bombers over the Aleutians. After tracking the bombers as they flew eastward, two of the four Bears turned around and headed west toward the Russian Far East. The bombers are believed to be based at the Russian strategic base near Anadyr, Russia. The remaining two nuclear-capable bombers then flew southeast and around 9:30 P.M. entered the U.S. northern air defense zone off the coast of Northern California. Two U.S. F-15 jets were deployed and intercepted the bombers as they eventually flew within 50 miles of the coast before turning around and heading west. A defense official said the four bombers also were supported by two IL-78 aerial refueling tankers that were used for mid-air refueling during the operation this week. The Tu-95 is a long-range strike aircraft capable of carrying nuclear cruise missiles. Other versions are equipped with intelligence-gathering sensors and electronic warfare gear. It has a range of around 9,400 miles without refueling. Davis said the aircraft “acted professionally” and the bombers appeared to be conducting a training mission. “They typically do long range aviation training in the summer and it is not unusual for them to be more active during this time,” he said. “We assess this was part of training. And they did not enter territorial airspace.” The bomber incursion is the latest Russian nuclear saber-rattling amid stepped up tensions over Moscow’s military annexation of Ukraine’s Crimea. Rep. Mike Conaway (R., Texas), a member of the House Armed Services Committee, called the Russian flights “intentional provocations.” “Putin is doing this specifically to try to taunt the U.S. and exercise, at least in the reported world, some sort of saber-rattling, muscle-flexing kind of nonsense,” Conaway said in an interview. “Truth of the matter is we would have squashed either one of those [bombers] like baby seals.” “It’s a provocation and it’s unnecessary. But it fits in with [Putin’s] macho kind of saber-rattling,” he said, adding that he expects Russia will carry out more of these kinds of incidents in the future. Retired Air Force Lt. Gen. Thomas McInerney, a former Alaska commander for the North American Aerospace Defense Command, said he does not remember a case of Russian strategic bombers coming that close to the U.S. coast. “Again we see the Obama administration through their covert—but overt to Mr. Putin—unilateral disarmament, inviting adventurism by the Russians,” McInerney said in an email. “At the height of the Cold War I do not remember them getting this close. Mr. Putin had to approve this mission and he is just showing his personal contempt for President Obama right after meeting him in Normandy less than a week ago,” McInerney said. McInerney said no American president has been treated with such disrespect in U.S. history. “A sad day indeed and at the same time Mosul and Tikrit [Iraq] fall to radical Islamists after the Obama administration’s failed Iraq policy,” he added. “He snatched defeat from the jaws of victory yet again.” The Alaska-California bombers flight also came a month after a Russian Su-27 interceptor jet flew dangerously close to a U.S. RC-135 reconnaissance aircraft flying over the Sea of Okhotsk, north of Japan. In that incident on April 23, the Su-27 jet flew close to the RC-135, turned to reveal its air-to-air missiles to the crew, and then flew dangerously close to within 100 feet of the cockpit in a maneuver military officials called reckless. Davis said in the past 10 years, 50 Bear H bombers were intercepted near U.S. air defense zone, although he acknowledged that Monday’s flight near California was unusual. In April, a telephone conversation between two Russian ambassadors was posted on YouTube and appeared to show the diplomats joking about the Ukraine crisis and discussing the possible incursions in the United States and Eastern Europe. The leaked conversation between Igor Nilokaevich Chubarov and Sergey Viktorovich Bakharev, Russian ambassadors to the African nations Eritrea and Zimbabwe and Malawi, respectively, includes references to post-Crimea Russian imperialism to include Eastern Europe and “Californialand” and “Miamiland.” Russian Bear H flights elsewhere have increased in recent years. In February 2013, two of the bombers were intercepted as they circled the U.S. Pacific island of Guam, in a rare long-range incursion. Two Bear Hs also were intercepted near Alaska on April 28, 2013. A Russian Bear H incursion in Asia took place in in July 2013 when two Tu-95s were intercepted by Japanese and South Korean jets near the Korean peninsula and Japan’s northern Hokkaido Island. The July 4, 2012, bomber flights near the West Coast were the first time since the Cold War that Russian jets has traveled so close to the U.S. coastline. That action followed an earlier intrusion by Tu-95s near Alaska that were part of large-scale strategic nuclear exercises by the Russians aimed at practicing strikes on enemy air defenses. Russia has stepped up provocative nuclear war games in recent years as part of propaganda efforts to display Moscow’s dislike of U.S. missile defenses in Europe.'"}, "time": 1742563046.2450607}