{"duration": 0.03144955635070801, "input_args": {"text": "\"We Are Change \\nSeven of the militia members involved in the occupation of the Malheur National Wildlife Refuge have been acquitted on federal weapons and conspiracy charges, including Ammon and Ryan Bundy.\\n\\nThursday’s verdict came after a month long trial over the occupation and standoff which lasted for nearly six weeks — and left one member of the militia dead. The defense had argued that it was not a conspiracy, but rather a peaceful protest.\\n“Ammon Bundy, the group’s de-facto leader, was charged, along with six followers, with theft of government property, possession of a firearm on a federal facility and impeding federal officers through threats, force, or intimidation,” Sputnik News reports.\\nThe jury found the defendants not guilty on all charges except one, which they were deadlocked on.\\nHere are the verdicts. #oregonstandoff pic.twitter.com/fXW9GoxKUr \\n— Ryan Haas (@ryanjhaas) October 27, 2016 \\n\\nAs the judge stated the terms of Ammon Bundy’s release — his lawyer, Marcus Mumford, engaged in such an impassioned argument that he was tackled to the ground by US marshals. He is now in federal custody and his status remains unclear at this time.\\nALSO – Ammon Bundy's attorney fought with judge, agents moved in & tackled attorney, media rushed out of court, I've never seen that before!\\n— Mike Benner (@MikeBennerKGW) October 27, 2016 \\n\\nHarney County Judge Steve Grasty had estimated that the standoff was costing the county “$60,000 to $70,000 a day” for security costs and closed schools. Additionally, federal taxpayers are on the hook for cost accrued by the Bureau of Land Management’s district office in Burns, which employs nearly 120 people, most of whom were placed on paid administrative leave. The weekly cost of their salaries was $117,000 per week, or $3,400 per day.\\nOne of the members, LaVoy Finicum, 54, was killed by police after allegedly pulling a gun on officers who had pulled over the vehicle he was in.\\n“I have been raised in the country all my life,” Finicum told the press before his death. “I love dearly to feel the wind on my face. To see the sunrise, to see the moon. I have no intention of spending any of my days in a concrete box.”\\nTwenty-six other militants were arrested in relation to the takeover. The rest of the defendants are scheduled to stand trial in February 2017.\\nThe armed group had claimed to be protesting what they believed to be unconstitutional policies regarding federal land management, and a dispute between the Hammonds, a local ranching family.\\nThe Bundy’s had previously made global headlines after engaging in an armed standoff with federal agents over land in Nevada.\\nThe post Militia That Took Over Wildlife Refuge Acquitted on Conspiracy, Weapons Charges appeared first on We Are Change .\\n\""}, "time": 1742628418.1377723}