{"duration": 0.06363081932067871, "input_args": {"text": "'For months, the mainstream media played a game of “Jenga journalism,” building a tower of accusations against Donald Trump, using flimsy, speculative claims of Russian collusion. [None of the different pieces of the conspiracy theory could hold up on their own, but journalists  —   and the Hillary Clinton campaign  —   treated the pile of Russia innuendo like a real monument. But then Trump made the move that forced them to tug at the foundations of their own illusion, and it crashed.  @joelpollak comes up with amazing new meme in @chucktodd interview #JengaJournalism https:  .   —   TundraTabloids (@TundraTabloids) March 17, 2017,   In the past several days, former Director of National Intelligence James Clapper and former Acting Director of the Central Intelligence Agency Mike Morell have both stated publicly that there is no evidence that the Trump campaign cooperated with Russia. But they held their tongues for months as the false accusations mounted against Trump. It was only after the president tweeted that former President Barack Obama had wiretapped him that they found the courage to tell the truth. Trump based his claim on the mainstream media’s own reporting  —   a point made by conservative talk radio host Mark Levin and then later at Breitbart News. The New York Times, the BBC, and others had reported that the Obama administration had carried out surveillance on people close to Trump. Furthermore, the Times reported that the previous administration relaxed the rules of the National Security Agency to disseminate the results of that surveillance, some of which was evidently leaked. The media latched onto Trump’s claim that Obama had tapped his “phones,” as if that proved Trump was lying. But no one could dispute any of the core elements of Trump’s claims  —   until this past Thursday, when the Senate Intelligence Committee issued a short bipartisan statement: “Based on the information available to us, we see no indications that Trump Tower was the subject of surveillance by any element of the United States government either before or after Election Day 2016. ” The committee’s statement was interpreted by the media as a definitive conclusion  —   though the investigation is ongoing. But if true, the only part of the story that has been debunked concerns surveillance of Trump Tower itself, a claim first made by the Heat Street website. It does not mean the warrant that Heat Street reported  —   and which the BBC reported as well  —   was never sought. That warrant, reportedly rejected by a FISA court, amended, and then approved, concerned a computer server. The New York Times also reported in October that the FBI had been investigating that server for “a possible secret channel of email communication from the Trump Organization to a Russian bank. ” (The FBI found no evidence of any “conclusive or direct link,” which did not stop Democrats and the media from claiming there was one.) All the Senate committee did this week was confirm what Clapper had already said  —   that there had been no warrant for surveillance of Trump Tower itself. So no “phones,” but the basic case still stands: there was surveillance of the Trump campaign, the results were shared widely within the government, and the intelligence made its way  —   often illegally  —   to the mainstream media. The people leaking the intelligence are happy to defend what they are doing, through surrogates like former CIA agent and presidential candidate Evan McMullin, who told CNN the leakers were stopping “a security threat coming from the White House. ” Yet the mainstream media are behaving as if Trump’s tweets about having his “wires tapped” are a very serious lie that undermines his entire administration. Having congratulated each other for exposing Trump on an entirely trivial matter, journalists are now using Trump’s tweets to badger other Republicans, like UN Ambassador Nikki Haley. (How many Obama Cabinet members had to face such questions about their “credibility” after he was caught spying on foreign leaders?) Moreover, in skewering Trump for claims about “wiretapping” and “phones,” the media are holding Trump to a standard of literalism they would never apply to themselves. For example, mainstream media headlines screamed for months about a “love affair” between Trump and Russian President Vladimir Putin: “The curious   love affair” (CBS) “Trump and Putin: A Love Story” (New Yorker). But it turns out there is no evidence Trump had sexual intercourse with Putin. Liars! Nervous Republicans like Rick Santorum fret that Trump is “hurting himself” with his tweets. On the contrary: not only has he exposed the media’s double standards, but he is also forcing them to impeach their own evidence. After all, if there was no surveillance of the Trump campaign, then there was no Russian collusion, and the media are simply “fake news” partisans. By tweeting about Obama, Trump moved the last weak Jenga block. Now the tower is wobbling. Your move, journalists. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742564110.3254752}