{"duration": 0.08728718757629395, "input_args": {"text": "'FAQ - Germans have rejected the government policy of welcoming hordes of violent Muslims, particularly following the New Years sex attacks in Cologne and elsewhere . < The Anti-Woman Candidate Running for President?—That Would Be the Democrat Hillary Clinton > November 7, 2016, 9:41 am   \\nHillary Clinton has always defined herself as fundamentally a feminist who cares about women’s rights and safety. But her behavior has revealed quite the opposite, in particular her pledge to increase immigration of unscreenable Syrians and other Muslims into this country by more than 500 percent . \\nAdding to a growing population of culturally misogynous Muslims is dangerous for American women’s safety and well-being. Look at the problems Europe has had with Islamic rapefugees since the borders were opened by Chancellor Angela Merkel. \\nWhat possible reason is there for Muslim immigration at all? As a group, they are remarkably resistant to assimilation. The architect of modern Singapore , the late Lee Kuan Yew, remarked , “I think we were progressing very nicely until the surge of Islam came … I would say today, we can integrate all religions and races except Islam.” \\nIn another questionable choice, Hillary’s closest aide for 20 years has been Huma Abedin, a daughter of Muslim Brotherhood activists who herself worked at a pro-sharia (aka misogynous) magazine. Huma will likely be a major player in a Clinton2 White House — if she is not in jail . Is she a long-time sleeper agent of sharia , disguised by stylish clothes and a wacky marriage to a pervert congressman ? The mainstream media is strangely uncurious about diverse Democrats. \\nMore recently we have learned that the Clinton Foundation has sucked up many millions of dollars from the worst sharia holes on earth, where women are treated not like second-class citizens, but like property. \\nAuthor of Clinton Cash Peter Schweizer appeared on Fox News Saturday, and the list above of skanky contributors to the crime family foundation comes from that interview. \\nBelow is a spare audio file of the interview: \\nhttp://www.limitstogrowth.org/ltg-uploads/2016/11/PETER-SCHWEIZER-FULL-INTERVIEW-ON-FOX-FRIENDS-_-VIDEO-_-FOX-NEWS-11_5_2016-✔.mp3 \\nTUCKER CARLSON: Peter Schweizer — he’s the author of Clinton Cash and inspired the investigation the FBI is now doing in the first place. He’s been interviewed multiple times by the Bureau. It’s great to see you this morning, so tell us how can she have received a million dollars from a foreign country — it just seems so out of bounds. What are the details? \\nPETER SCHWEIZER: Yeah, it’s completely out of bounds. When Hillary Clinton became Secretary of State, as a condition of taking that job, Tucker, they agreed to do a number of things: have complete transparency, disclosing donors, donations from foreign governments had to have pre-approval. In this case that didn’t happen, they didn’t disclose it and now this is multiple violations in this regard. So you have Qatar, at a time when the Arab Spring is taking place, they’re very anxious about what US position is going to be, giving a million dollars to the Clinton Foundation and the Clinton Foundation not disclosing that, as they had agreed to do. \\nCARLSON: They’re not required or they were not required by law to do that? I mean this was just a sort of gentlemen’s agreement she made? \\nSCHWEIZER: Well it was a written agreement with Barack Obama, to his credit, Barack Obama said in order for you to be Secretary of State, you need to do this. Hillary Clinton also said to the Senate Foreign Relations Committee during her confirmation hearings there would be complete transparency, so they failed to live up with it, and the problem is, Tucker, of course they’re making promises now that there’s not going to be any more foreign money, Bill’s not going to give speeches. We got to take that with a grain of salt, or a grain of sand actually, in a way because they have not lived up to their previous commitments, and there’s no expectation that they would now. \\nCARLSON: Just to put this in context, I want to put a graphic on the screen of some of the money that the Clinton Foundation has taken from foreign governments, so one to five [million dollars] from Qatar, Saudi 10 to 25 million, Kuwait up to 10, UAE up to five, Brunei up to five, Oman up to five, Algeria up to half a million. I mean, among many other things you notice, these are all countries in which women don’t have a Western understanding of civil rights. If she’s president, how is she going to deal with these countries, knowing that she owes something to them? \\nSCHWEIZER: That’s right, Tucker; add on top of that the speaking fees, the millions of dollars and money from these same governments that ended up in the Clintons pockets. Look I mean this is a huge problem and as much as the Clintons want to say that this money was given with no strings attached, I think we all know that governments like Saudi Arabia don’t give money away for nothing; they expect something in return. \\nDoes anyone think the Clintons won’t even more wealthy if they are allowed to sell the White House and America off for their own profit once again?'"}, "time": 1742562521.8630004}