{"duration": 0.07892036437988281, "input_args": {"text": "'Senator Tim Kaine of Virginia on Sunday compared Donald J. Trump’s encouragement of Russia to hack Hillary Clinton’s emails to the Watergate scandal, which led to President Richard M. Nixon’s resignation. Mr. Kaine, Mrs. Clinton’s running mate, made the remarks on ABC’s “This Week” while he was being questioned about Mrs. Clinton’s use of a private email server while she was secretary of state, an issue that has dogged her throughout her campaign. Mr. Kaine used the moment to attack Mr. Trump’s refusal to release his income tax returns and to attack his comments this summer that Russia should make public anything they might have stolen from Mrs. Clinton’s emails, remarks he made in the wake of the disclosure that hackers had accessed emails from the Democratic National Committee. “He has openly encouraged Russia to engage in cyberhacking to try to find more emails or materials, and we know that this cyberattack on the D. N. C. was likely done by Russia,” Mr. Kaine said of Mr. Trump on Sunday. “A president was impeached and had to resign over an attack on the D. N. C. during a presidential election in 1972,” Mr. Kaine added, referring to the Watergate scandal. “This is serious business. So contrast the Hillary situation, where the F. B. I. said there’s no need for legal proceedings, with an attack that is being encouraged by Donald Trump on the D. N. C. by Russia, similar to what led to resignation of a president 30 years ago. ” During a news conference in July, Mr. Trump said he hoped Russian intelligence services had successfully hacked Mrs. Clinton’s email. “Russia, if you’re listening, I hope you’re able to find the 30, 000 emails that are missing,” Mr. Trump said at the time. “I think you will probably be rewarded mightily by our press. ” Mr. Kaine wasn’t the only candidate to invoke Mr. Nixon’s name in an attack. In a taped interview with NBC’s “Meet the Press” that aired Sunday, Gov. Mike Pence of Indiana, Mr. Trump’s running mate, called Mrs. Clinton “the most dishonest candidate for president of the United States since Richard Nixon. ” Yet Mr. Pence also opened the door for more criticism of Mr. Trump by vowing to release his own income tax returns within the next week. Mr. Trump has refused to release his own returns, but Mr. Pence said his running mate would eventually disclose them as well, although he did not say when that might happen. Last week The Washington Post revealed that Mr. Trump had to pay a $2, 500 penalty to the I. R. S. because his charitable foundation had made an improper political donation. On CNN’s “State of the Union,” Rudolph W. Giuliani, the former New York City mayor who has become one of Mr. Trump’s closest advisers, suggested that Mr. Trump had backed away in his speech on Wednesday from his proposal to carry out mass deportations of people who are in the country illegally. Mr. Giuliani said Mr. Trump’s speech “leaves a very big opening for what will happen with the people who remain here in the United States after the criminals are removed and after the border is secure. ” “Donald Trump, as he expressed in one of his interviews recently, would find it very, very difficult to throw out a family that’s been here for, you know, 15 years and they have three children, two of whom are citizens,” Mr. Giuliani said. “That is not the kind of America he wants. ”'"}, "time": 1742564424.170904}