{"duration": 0.07252311706542969, "input_args": {"text": "'Failed presidential candidate Hillary Clinton allegedly spent “tens of millions of dollars” on digital youth outreach during her campaign, reportedly spending an extra $30 million on internet adverts just over a month before election day. [“Mrs. Clinton employed more than 100 people in her digital team and spent tens of millions of dollars targeting millennials with a series of   messages on Facebook,” reported the Telegraph on Monday. “But experts said she might have been better off buying newspaper or local TV adverts in the handful of key states she unexpectedly lost. ”  “Mrs. Clinton’s digital team, sitting in their Brooklyn headquarters under a ‘Swipe Right for Hillary’ banner, were told to think ‘out of the box’ and appeal to young voters on social media, using outlets including Snapchat and Pinterest,” it continued. “A total of 30 young staff members were assigned to film her on the campaign trail and post the slickly edited videos on Facebook. ” Other projects that Clinton’s campaign spent money on in an attempt to secure millennials included a   comic book series based on what they predicted a Donald Trump presidency would look like, while Facebook adverts took the top priority. “Her big problem was not reaching working class voters in about three key states,” said Justin Holmes, assistant professor of political science at the University of Iowa. “With social media you can target specific groups, but they were focused on young women and Latinos. ” “If anything, if the Clinton campaign had bought a few more ads in Pennsylvania and Wisconsin newspapers she might have won,” added Holmes, who also claimed that the   rate of social media adverts were “terrible” and were only a way of “preaching to the choir. ” “It’s a lot of people who have already made up their minds. There is some value in mobilising people who already support you, but those other people are harder to reach,” he concluded. “What’s a candidate supposed to do in the future? I don’t know. ” In their report, The Telegraph also claimed that digital advertising “made up 14. 4 per cent of the total spent in 2016 compared to only 1. 7 per cent in 2012,” adding around 40% of the budget, or $428 million, would have been spent on Facebook adverts. “That’s not to say Facebook doesn’t work,” said political consultant Neil Oxman. “I think it’s better to have them than not have them  …     But one of the reasons she didn’t win was because she spent almost no money on traditional advertising in Wisconsin and Michigan. ” “Hillary Clinton should get all her money back. It didn’t work,” proclaimed Vanderbilt University Political Science Professor John Geer. “Anyone who relies on     as a group, unfortunately, what we would call those candidates are losers. Because they never turn out. ” “We are in a situation where we should really   all the money they are pouring into these adverts because it seems crazy,” he concluded. During Hillary Clinton’s 2016 presidential campaign, a PAC in her favor also paid over $1 million for internet trolls to scour the web and “correct” negative things said about Clinton online. In September, the same PAC also offered a paid bounty to anyone who had dirt on Trump. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562286.911318}