{"duration": 0.07284736633300781, "input_args": {"text": "'  Carol Adl in Middle East , News , US // 0 Comments \\nThe US- led coalition is preparing an offensive to oust ISIS from its de-facto capital Raqqa in Syria according to the US Defense Secretary. \\nAsh Carter said the operation will likely start before the battle for Mosul is won and Russia has not been invited to join the effort. \\nIn an interview with NBC, Carter said the assault will start in the next few weeks. \\n“We have already begun laying the groundwork to commence the isolation in Raqqa,” the Pentagon chief said at a press conference in Paris. \\nRT reports: \\nAccording to Carter, the two officials agreed that the 13-state military coalition that gathered in the French capital would proceed with a sense of “urgency and focus” and confirmed previous statements that there will be a likely “overlap” with the assault on Mosul, which began earlier this month. \\nEarlier on Tuesday, French President Francois Hollande warned that many of the ISIS fighters in Mosul could simply sneak out among refugees and relocate to Raqqa, unless the coalition cuts them off. \\nThere were up to 6,000 Islamic State (IS, formerly ISIS/ISIL) fighters in the Iraqi city before fighting began, while Raqqa, which Carter described as “the nexus of much of [IS] operational planning,” will be defended by an estimated 3-4,000 recruits. \\nCarter stated that the bulk of the assault contingent would be assembled from “capable and motivated local forces that we identify and then enable.” \\n“The lasting defeat of [Islamic State] can’t be achieved by outsiders; it can only be achieved by Syrians enabled by us,” said Carter. \\nWith the battle over Mosul – a city of 1.5 million people before it was conquered by Islamic State in 2014 – expected to last weeks or months, the Pentagon is not committing itself to a tight deadline. \\n“I think everything is trending positively, and that we should be able to commence that effort sometime in the near future. And again, I can’t even ballpark ‘near future’ right now but it’s imminent,” said a senior Pentagon official, speaking to Reuters and other media anonymously in Paris. \\nRussia has not been invited to join the effort. The US-led coalition has condemned Moscow’s involvement in Syria, which was officially invited by the government of President Bashar Assad. \\n“Russia is not a participant in our Raqqa plan,” said Carter, who insisted that despite the breakdown of a proposed US and Russia-mediated ceasefire and accusations over Aleppo the two sides have a shared interest in defeating IS. \\n“We do deconflict our coalition operations with Russia through a very professional military-to-military channel. That channel is active every day, and everyone behaves themselves very professionally on both sides in that channel,” Carter added. \\nThe Kurds, another major faction that has played a key role in combatting Islamist threats in Syria, are expected to stay away from Raqqa, in part because it lies outside the area they view as their unrecognized homeland. \\n“Truthfully, the Kurds that I’ve dealt with don’t intend – they’re not comfortable going into Raqqa. They know they can play a role in shaping and isolating Raqqa but it’s not their intent to be involved in the actual seizure of the city,” said the Pentagon source cited by Reuters. \\nThe Syrian administration has so far not reacted to the plan, though has previously condemned the international force – which has supported the uprising against President Assad since 2011 – for violating the country’s sovereignty. \\nThe US-led coalition has executed air strikes on Raqqa since 2014, despite having no UN mandate to operate inside Syria. It has not been in position to carry out a full-scale ground assault. \\nDespite saying he was “encouraged” by the progress of the campaign against ISIS, both Carter and Hollande warned separately that the group may further evolve its tactics and redirect its efforts towards guerilla insurgency or suicide attacks in Europe.'"}, "time": 1742563185.9201424}