{"duration": 0.12474465370178223, "input_args": {"text": "'Why isn’t that PIG son of a diseased whore not in jail? Don Duncan \\nShouldn’t you post the follow up with this? SFCRetired \\nIf they are so in fear for their lives that they must shoot every family pet that approaches them, they need to find themselves another job. Suzanne Morrison Dixon \\nAin’t that the truth! I understand that some dogs are protective and can be aggressive, especially when something chaotic is happening in front of them. So, had the officer shot the little girl and killed her, would people be outraged? Or, would the officer be defended? I have no doubt there would be any accountability and people would say “He was just doing his job. His life was in danger. He feared for his life.” Give me a break! I agree with you though! Cops should never shoot their guns for any other reason than to injure, or kill and ONLY if their lives are really in danger. We have way too many trigger happy cops that shoot first and ask questions later. Sad thing is, this is what they are being taught to do. I know a few people who dropped out of BLET because of what they were being taught to do. They were also taught how to shoot and kill and how to make it justified. One of the BLET teachers was actually fired because of things he was saying and teaching his students to do. A student actually voice recorded him during class and when the accusation came out, before anyone knew about the voice recording, the officer teacher, the sherrifs dept. and the community, said that it was preposterous these accusations were being made against one of the most dedicated, and long time serving, officer. Then, when the recordings were released, people were just soooo shocked and couldn’t believe it! I mean, officers are honest and would never do things like lie and commit illegal activities, or cover up things, or plant evidence, or commit murder, or sexually assault women. No, because all cops are good and everything they do is justified. People need to wake up and smell the coffee. There are plenty of amazing officers who take their position seriously and live by their oath. But there are also lots of cops who are horrible people. Who are criminals with a badge and a license to kill, who have no damn place being a cop. Cops are human beings just like everyone else….they definitely can already be corrupt, or become corrupt. There are way too many cops out there who feel they are above the law. Sgt. Grimsley USMC \\nThe officer has not been disciplined??? What? How? Freak accident or not, a little girl got shot. The cop needs to explain himself. Publicly. 2broke4 her \\nI cant remember the law as the actual way it goes but in general cops arent liable for there inept actions.. that is why they use the fearing for my life saying! While I was in Denver in 1992 to 1994.. a Black male with a criminal record running away from cops on a foot pursuit, got cornered by one cop in an multiple level Apartment complex. no outlet.. the man stopped put his hands in the air.. he was wearing only, tennis shoes and a pair of shorts.. as witnesses stated and they all said the same thing.. the cop drew down on him..the man turned around slowly with his hands in the air, no weapons on him.. he started begging for the cop not to shoot him.. the cop shot and killed him, while the tenants of the complex watched from their windows.. the cop claimed he feared for his life.. the chief of Police stated it was a good kill and IA cleared him of the shooting.. due to public outcry, 6 months later, the DA submitted to the Grand Jury a murder charge and the Grand Jury came back with a Charge for the DA, murder in the first degree! I left Colorado by then so I dont know the end result! Suzanne Morrison Dixon \\nAnd that happens way too much unfortunately. More of these incidents are being brought to attention thanks to smartphones…It sickens me though that even with proof of what cops have done, they still are hardly ever held accountable. Too many cops play arrestor, judge, jury, and executioner. It is sickening. Social Trending'"}, "time": 1742562560.7904599}