{"duration": 0.06739211082458496, "input_args": {"text": "'The White House will release its “  budget” on Tuesday, which includes $1. 7 trillion in cuts for entitlement spending and a 30 percent reduction in the Environmental Protection Agency’s (EPA) budget. [The Trump budget proposal will balance over the next ten years by cutting both mandatory and discretionary funding for agencies such as the EPA and State Department. The budget proposal assumes that the economy will grow at three percent compared to the 1. 6 percent growth that America experienced in 2016. White House staffers explained that the proposal is a “ ” budget, meaning that the budget assumes that Trump signed the health care overhaul known as the American Health Care Act (AHCA) and tax reform into law.  The budget proposal will make substantial cuts into four entitlement programs, SNAP (food stamps) CHIP (Children’s Health Insurance Program) and SSDI (Disability Insurance). The Trump budget assumes that the AHCA becomes law, which would roll back Medicaid expansion. White House staffers told Axios that the budget would cut entitlement costs through an “emphasis on work requirements for   people. ” The Washington Post’s Damian Paletta stated, “The White House also will call for giving states more flexibility to impose work requirements for people in different kinds of   programs, people familiar with the budget plan said, potentially leading to a flood of changes in states led by conservative governors. ” Josh Archambault, a senior fellow at the Foundation for Government Accountability, explained that giving states the flexibility to impose work requirements could to lead to significant changes to programs such as Medicaid or public housing assistance. “One of the encouraging things about putting this in the budget is that states will see if it works,” Archambault said. “States will try it. ” Michael Tanner, a welfare expert at the Cato Institute, admitted that despite the United States spending roughly $700 billion a year on entitlement programs, the country does not experience significant reductions in poverty. Tanner said, “We’re not seeing the type of gains we should be seeing for all that spending, and that would suggest its time to reform the system. ” Although the budget will include cuts to food stamps and disability insurance, President Donald Trump told his budget director Mick Mulvaney that he does not want any cuts to Medicare or Social Security. President Donald Trump’s budget would also cut the EPA’s budget by a third and slash the agency’s operational budget by 35 percent. The budget would reduce environmental grant programs by 35 to 40 percent. The proposed budget for the EPA would limit the EPA’s budget to $5. 7 billion from roughly $8 billion. Trump’s budget cuts for the EPA coincide with the EPA’s $12 million buyout and early retirement plan to reduce the agency’s workforce under the Trump administration. Trump made campaign promises to eliminate the EPA, and has already taken great strides to limit the agency’s workforce. EPA Administrator Scott Pruitt dismissed half of the scientists on its Board of Scientific Counselors earlier this month. White House staffers told Axios that the Trump budget proposal will be a victory for conservatives, much to the chagrin of moderates and Democrats. “Conservatives will love it moderates will probably hate it. ”'"}, "time": 1742563193.0623195}