{"duration": 0.05814552307128906, "input_args": {"text": "'Madonna took to Instagram late Thursday to promote an upcoming   Trump protest march  —   by sharing a photo of a woman with shoe company Nike’s “Just Do It” logo apparently shaved into her public hair. [[Warning: Image contains partial nudity.]    “Yasssssssss! Just Do it! @nakid_magazine,” Madonna wrote, adding, “1 Million Women’s March!! Be There!! Washington D. C. Jan. 21. ”  Yasssssssss! Just Do it! @nakid_magazine 🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️🏃\\u200d♀️ 1 Million Women’s March!! Be There!! Washington  D. C. Jan. 21. 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 photo by Marius Sperlich, A photo posted by Madonna (@madonna) on Jan 12, 2017 at 2:02pm PST,  As Breitbart News previously reported, thousands of women are expected to travel to the nation’s capital for the Women’s March on Washington to protest   Donald Trump’s inauguration. The organization said it wants the event to “send a bold message to our new administration on their first day in office, and to the world that women’s rights are human rights. ” Earlier this week, singers Katy Perry and Cher and actresses Scarlett Johansson, Zendaya, Debra Messing, and Julianne Moore were announced as being expected to participate in the January 21 event. Ugly Betty actress America Ferrera, chair of the organization’s “artist table,” said the march is about standing up to the incoming administration. “Since the election, so many fear that their voices will go unheard,” Ferrera said in a statement. “As artists, women, and most importantly dedicated Americans, it is critical that we stand together in solidarity for the protection, dignity, and rights of our communities. Immigrant rights, worker rights, reproductive rights, LGBTQIA rights, racial justice and environmental rights are not special interests, they affect us all and should be every American’s concern. ” The Material Girl is just the latest star to come out in support of the event. The    Rebel Heart singer spent months slamming Trump’s campaign, while drumming up support for Hillary Clinton. In October, Madonna famously offered oral sex to anyone who voted for the former Democratic nominee. Last month, Madonna admitted that Trump’s election left her “devastated. ” “It felt like a  combination of the heartbreak and betrayal you feel when someone you love more than anything leaves you, and also a death,” the singer told Billboard. “I feel that way every morning I wake up and say, ‘Oh, wait, Donald Trump is still the president,’ and it wasn’t a bad dream that I had. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563972.869111}