{"duration": 0.07071256637573242, "input_args": {"text": "'A newly developed MRI scan allows parents to see detailed images of the beating heart of even a   unborn baby, as well as clear pictures of the baby stretching its legs and even swallowing in the womb. [The new scan, developed by a   team of medical researchers, could replace the somewhat grainy ultrasound images parents are more accustomed to viewing during pregnancy.  UK video parenting site ChannelMum is sharing the video, created by the iFind project, which shows an MRI scan of a baby at 20 weeks. Cathy Ranson, who edits the site, says, “Scans are amazing as they help mums, dads and even other family members bond with their baby. ”    “There is nothing quite as emotional as seeing your unborn child moving inside you, and these MRI scans are taking images to the next level,” she adds. “They are truly breathtaking. ” According to the Daily Mail, the new scan is also revving up the abortion debate in the UK once again since, with the new technology, parents and doctors can see clearly how fully formed an unborn baby is at 20 weeks. Currently, the legal abortion limit in the UK is 24 weeks. “Health Secretary Jeremy Hunt has previously supported slashing the limit to 12 weeks and there have also been calls to reduce it to 20 weeks,” says the report. With a   administration now in the White House in the United States, national leaders who oppose abortion are hoping to pass the   Unborn Child Protection Act, which would ban most abortions past the   mark, into law. Dr. David Lloyd, a clinical research fellow at King’s College London who has participated in the project, says, “Taking pictures of a 20 week fetus while they’re still in the womb really isn’t that easy. ” He explains: For one thing, they’re very small. The fetal heart, for example, with all of its tiny chambers and valves, is only about 15mm long: less than the size of penny. Ultrasound technology  —   used in all routine antenatal scans in the UK  —   is actually fairly good at visualising these tiny structures. It uses very high frequency sound waves which are reflected back (‘echo’) from the structures inside the body to produce an image. The MRI scan, unlike an ultrasound, shows what is happening under the baby’s skin, so that images can be obtained even of babies who move around frequently. “In fetal ultrasound, the images produced can be excellent, but unfortunately, that’s not true for every patient,” Lloyd continues. “Ultrasound has to be able to ‘see’ through the body to the parts of the baby we want to image, and that isn’t always easy. It will depend on the age of the baby, how they are lying in the womb, the size of the mother, and many other factors. ” “MRI, which uses a strong magnetic field and radio waves to produce images, isn’t so limited,” he explains. “It can see the structures inside the body regardless of whether there’s bone, muscle or fat in the way and in some cases it can give us even more detailed images than ultrasound. ” “Importantly, it is also one of the few imaging techniques that is safe to use in pregnancy,” Lloyd adds.'"}, "time": 1742561627.3866212}