{"duration": 0.17590713500976562, "input_args": {"text": "'After Lisa S. Coico took the helm in 2010 as the president of the City College of New York, the flagship of the City University of New York system, she proved to be a divisive figure on the school’s Harlem campus. But when Ms. Coico resigned abruptly on Friday, it was not the deep budget cuts, or her contentious relationship with much of the faculty, or the high administrative turnover, including five provosts in the last six years, that apparently forced her out. It was her own expenses  —   and it was not a new problem. Since at least June, federal prosecutors have been investigating Ms. Coico’s use of college funds to pay personal expenses, and other matters, an inquiry that has been gaining momentum. Then, on Thursday, The New York Times presented evidence to the college suggesting that a memo from 2011 concerning reimbursements had been fabricated, possibly to mislead prosecutors. The Times also questioned whether Ms. Coico had repaid a $20, 000 security deposit for a rental home, or kept the money for herself. The news of Ms. Coico’s departure, coming late Friday on the eve of a long holiday weekend, represented a swift and unexpected downfall for a president whose appointment had been met with great fanfare. Effective immediately, it leaves a college once known as “the poor man’s Harvard” in disarray at a time when public higher education is increasingly starved of public funds. It also raises questions about who knew how much and how early. And over the weekend, speculation intensified among staff and faculty members as to whether people close to the president would also be implicated, and whether the federal investigation would spread to other parts of CUNY, the largest public urban university in the country. A graduate of Brooklyn College, Ms. Coico was the first CUNY alumna to head City College. As a former provost at Temple University with a science background, Ms. Coico, 60, was chosen to lead an ambitious expansion of City College’s science programs, and to focus on  . But from the outset, Ms. Coico had a difficult relationship with some faculty members. She was also criticized for her handling of the budget: Last year, when CUNY asked its colleges to cut their budgets by at least 3 percent, City College, citing increased personnel costs and declining enrollment, cut its budget by 10 percent, or $14. 6 million. Behind the scenes, there were also questions about her personal spending going back to the middle of 2011, roughly a year after her appointment. Ms. Coico, who had an annual salary of $400, 000 at that point, was using the college’s main   vehicle, the 21st Century Foundation, to pay tens of thousands of dollars for housekeeping, furniture, seasonal fruits and organic   nuts, among other items. Anxious about the amount she was spending, especially given the fact that many of City College’s students come from   families and struggle to pay even its modest tuition, some began “questioning its appropriateness, since the president had a substantial housing allowance meant for such things,” said one longtime official who spoke on the condition of anonymity to avoid being entangled in the investigation. Ms. Coico had a housing allowance of $5, 000 per month when she was hired, which was increased to $7, 500 per month in July 2010. By August 2011, according to an email between two school officials, the college had begun to itemize more than $155, 000 of her spending in three categories  —   “college,” “personal” and “iffy. ” Another email later discussed the need to “recoup the funds. ” She was later ordered by Frederick P. Schaffer, CUNY’s general counsel, to repay the college $51, 000, or roughly   of the expenses in question, because she had not received prior approval for moving and other expenses. She fulfilled that obligation by January 2016. Ms. Coico was also informed that any furniture bought with foundation funds  —   including $50, 000 worth for a rental home in Larchmont, N. Y.  —   belonged to City College. Moreover, she was asked to return a $20, 000 security deposit at the end of her lease in Larchmont. Ms. Coico and her husband bought another home in Westchester County in April 2013, property records show. When asked if she repaid the $20, 000 deposit, the college declined to comment. In recent years, Ms. Coico’s troubles seemed to fade. The school opened a new science center and, this fall, a medical school. Michelle Obama delivered this year’s commencement address. But this summer, The Times took a closer look at her expenses, and reported that CUNY’s Research Foundation, which manages research funds for the entire system, had ultimately covered Ms. Coico’s personal expenses from her early years as president. Using Research Foundation funds that way raised concerns because they could include money from federal grants, which are typically earmarked for   expenses, such as staff and equipment, and have strict guidelines about how they are used. Having a university pay its leaders’ personal expenses has generated controversy elsewhere. Stanford was embroiled in a scandal in the 1990s in which government grants improperly paid for flowers and the depreciation on a yacht, and ultimately prompted the resignation of its president. In recent months, two chancellors in the University of California system  —   at Berkeley and at Davis  —   resigned in part because of an outcry over their handling of expenses. Two weeks after the Times report was published, a subpoena was issued by the office of Robert L. Capers, the United States attorney for the Eastern District of New York. A spokeswoman for Mr. Capers declined to comment, citing office policy. But now, the authenticity of a key document that the college turned over to prosecutors has been challenged by more than a dozen people who have been involved with the college’s finances or have been briefed on the investigation. They spoke anonymously to avoid retaliation or getting entangled in the investigation. The memo in question is just one paragraph long and is bureaucratic in nature. Addressed to an employee at the provost’s office named Luisa Hassan, and dated Sept. 15, 2011, it begins, “As we have discussed,” and is attributed to Ron Woodford, a manager at the college’s 21st Century Foundation. It goes on to say that some of Ms. Coico’s expenses “were inadvertently paid” by that foundation, when they should have been paid by CUNY’s Research Foundation. The memo then asks Ms. Hassan to process an invoice for $155, 176 to “rectify the funding source,” for what it calls “  expenses associated with the appointment of the new president. ” But the memo surfaced on July 13, almost five years after it was supposedly written, when Felix Lam, the chief financial officer of City College,   it to Ms. Hassan, according to people who heard about the incident afterward. Roughly 30 minutes later, Ms. Hassan got an email from a lawyer representing the 21st Century Foundation, telling her that she “must preserve, and may not alter,” any documents related to Ms. Coico, among others, because of the federal investigation. The timing of Mr. Lam’s delivery troubled some college officials, who noted that he had managed to get the memo into the package of documents being prepared for investigators just in time. If the memo is authentic, it would indicate that approval for using the Research Foundation funds had come from two relatively   employees. That would insulate Ms. Coico and other   officials from being directly involved in, or even aware of, any payment decisions. Were the memo proved to be backdated or manufactured, the responsible parties could be open to charges such as obstruction of justice, legal experts said. In an email to college officials including Mr. Lam sent the day after Mr. Lam gave her the memo, Ms. Hassan questioned its authenticity. “I never received the attached memo that you gave me yesterday from Ron Woodford and I never spoke directly to him regarding this matter. ” She wrote that any request for payment would have had to come from her supervisor, Jim Styer. The Times obtained a copy of the email. Ms. Hassan declined to comment. But she has told people involved in the investigation that she does not recall meeting, much less corresponding, with Mr. Woodford until at least 2013, and has no records of any email exchanges with him until about the same time. Mr. Woodford directed all questions about the memo’s authenticity to “the management and the lawyers. ” As to whether he and Ms. Hassan could have independently authorized a transfer of that size from one foundation to another, Mr. Woodford said: “You know we’re   people. We don’t make decisions like that. ” In addition to the federal investigation, James B. Milliken, CUNY’s chancellor, hired Andrew J. Levander, a former federal prosecutor, to conduct an internal review. That review is now nearing completion. By Friday afternoon, a day after The Times contacted university officials, Mr. Milliken had decided that Ms. Coico could no longer remain in office. So he told her by phone that she had to resign, or else face termination, according to two people briefed on the process. College officials declined to comment, out of respect for the continuing internal and federal investigations. On Sunday, William C. Thompson Jr. a former New York City comptroller who is the new chairman of CUNY’s board of trustees, urged the state inspector general to open a third investigation, into “all of the college foundations, alumni associations or other affiliated entities including the CUNY Research Foundation. ” He said that Ms. Coico had “improperly used funds from the college’s 21st Century Foundation to pay for certain personal expenses,” and that “despite her representations to the contrary,” she had not repaid all the money. Ms. Coico declined to comment in an email on Sunday. As for the purported Sept. 25, 2011, memo given to Ms. Hassan, at least four college officials who spoke on the condition of anonymity for fear of retaliation said that they were willing to tell prosecutors that they believed the memo was fake. Neither Ms. Hassan nor Mr. Woodford, one official said, “were or are in a position even now to initiate or take action on such a request independently. ” The officials also note that the titles used for Ms. Hassan and Mr. Woodford did not match the ones they used at the time. In another incongruity, the invoice number on the September 2011 memo does not follow the chronological order of invoices from the 21st Century Foundation before and after that date. In an interview, Mr. Styer, who was Ms. Hassan’s supervisor in 2011, said that he did not recall having ever seen the memo either. He said it struck him as odd and “not the way business was done. ” “If Luisa is saying she never saw that memo,” said Mr. Styer, who left City College in 2013 and is now an elected official in Salford, Pa. “I think she’s correct. ”'"}, "time": 1742628379.4134772}