{"duration": 0.09420323371887207, "input_args": {"text": "'Democratic Senators think homeland security chief John Kelly is not doing enough to implement their Democratic priorities, according to a litany of partisan complaints showcased by Politico. [The Democratic priorities for Kelly include him ending the enforcement of immigration laws which keep Americans’ wages from disappearing in a flood of cheap labor and cheap drugs, him publicly backstabbing other leaders in President Donald Trump’s cabinet, and him sabotaging Trump’s   promise to build a border wall.   “I would like to think he would be a moderating force   …     He has an understanding of why people want to come to this country, so I would think, hopefully, that would be part of his thinking,” a disappointed Nevada Democratic Sen. Catherine Cortez Masto grumbled to Politico. “Look, we’ve had some arguments, the secretary and I,” Democratic Sen. Bob Casey told Politico. “I want to try to do whatever I can to work with him, but I think we probably have some basic differences. ” Instead of complying with the Democrats’ priorities, Kelly is building Trump’s border wall, and is complying with Trump’s “Hire American” priorities by declining to increase the annual inflow of roughly one million contract workers into the United States. “I know we already have large numbers [of contract workers] that come in and have been coming in over the years, but   …     in the current administration, this is all about American jobs versus people that come in and do the work,” Kelly told Democratic Sen. Heidi Heitkamp at a June 6 hearing.  Kelly and Trump have made a few compromises with Democrats  —   but they have been gotten nothing in exchange except more Democratic hostility and growing worries among their   supporters.  For example, Trump has reversed a campaign promise to shutter the ‘Deferred Action for Childhood Arrivals”   that now allows roughly 765, 000 illegals to work in the United States. “We are not, not, not targeting DACA registrants right now,” Kelly said June 7 at a hearing called by the House Committee on Homeland Security.  But neither Trump nor Kelly have got anything from the Democrats in exchange for this gift  —   no cash for the border wall, no promise to curb sanctuary cities, no commitment to reduce companies’ use of foreign contract workers, and no curbs on company hiring of illegals. Kelly does show his impatience with grandstanding by the legislators who try to make him do the unpopular things that they dare not do  —   such as importing more contract workers or turning a blind eye to more illegal immigration. One June 7, for example, at a hearing of the House Committee on Homeland Security, he told one legislator who complained about DACA program that: My [response] back to them is ‘If you feel so strongly about it, you clearly do, why don’t you do something about it? Why don’t you work with your colleagues, both sides of the aisle, because there is a lot of support for this and change the law and I’ll follow the law.’ According to Politico’s account of the Democratic complaints: Today, it’s tough to find anyone on the left willing to defend Kelly. He has alienated potential allies on Capitol Hill, including Democrats who voted to confirm him, and is endangering his reputation as a nonpartisan figure in a presidential administration that has relatively few. “I think Secretary Kelly has drank the ” said Sen. Robert Menendez of New Jersey, who was among the Democrats who voted to confirm Kelly in January. “He’s not the person who I thought I was voting for. ”   …     The secretary has said that if Democrats don’t like his enforcement of immigration laws, they should “change those laws” or “shut up. ” That bluntness has further infuriated Democrats, who note they have been trying for years to reform immigration laws but have been stymied by Republicans. Kelly owes his job to the fact that Trump ran against the Democrats’ very unpopular   “reform” of immigration laws that would have transferred even more money away from Americans’ pay packets over to Wall Street, according to Congress’ own budget office. He now looks secure in his job, but Senator Menendez is facing a criminal case that may end his tenure in the Senate this winter, long before Kelly packs his retirement bags.  So Kelly does his job amid growing Democratic complaints. “I have my marching orders from the president,” he told the House Committee on Homeland Security on June 7. '"}, "time": 1742562587.6828148}