{"duration": 0.09378910064697266, "input_args": {"text": "'STOCKHOLM  —   “I’m Not There” was the title of a 2007 movie about the exquisite elusiveness of the singer Bob Dylan. It is also the unofficial theme of the week in Stockholm, where Mr. Dylan, who won the 2016 Nobel Prize in Literature, is not here to accept it. He has not been here for anything else, either. He did not attend the traditional news conference. He did not deliver the traditional lecture. He did not make the traditional visit to a local school, or take part in the traditional fancy dinner with the Swedish Academy, which awards the literature Nobel every year. (All those events were canceled.) And as he said before, he will not be at the ceremony on Saturday, when the literature prize is to be awarded along with the medicine, economics and science prizes, or at the banquet afterward. Though Mr. Dylan has sent a message of thanks to be read aloud, he has not dispatched someone to accept the award on his behalf, as other   have done. “From a P. R. viewpoint, it’s been a disaster,” said Jens Liljestrand, the book editor at the Swedish newspaper Expressen. “It’s been a very unfortunate autumn for the Swedish Academy. ” Mr. Dylan’s absence seems of a piece with his legendarily perverse unpredictability. But it has also saddled the highly secretive academy, which is nearly as inscrutable as Mr. Dylan, with the difficult task of explaining to the world why it does not feel insulted. As the debate rages in Sweden  —   is Mr. Dylan’s behavior simple rudeness? a fear of being thrust into the Nobel spotlight? some sort of elaborate piece of performance art?  —   the academy has taken the position, at least publicly, that none of it matters. “I completely respect his decision, and I assume that he has very good reasons for not coming,” Sara Danius, the academy’s permanent secretary, said in an interview. “He may be completely booked, or he may have personal reasons. ” But in a Nobelcentric place where the literature prize is such big news that people gather around their television sets every October to hear the announcement, Mr. Dylan’s absence has been seen as faintly embarrassing at best. “Having a Nobel Prize without a Nobel Prize winner is not much fun,” said the writer and former publisher Per Gedin. Some Swedes have spoken wistfully about what he is missing. “It’s a really warm and welcoming program arranged to make the winner happy,” said the publisher Dorotea Bromberg, who recalled shepherding J. M. Coetzee, the South African writer, around Stockholm when he won the literature prize in 2003. Initially, Mr. Coetzee was reluctant, she said, but “day by day he warmed up” and actually ended up enjoying himself. Mr. Dylan is not the only winner in recent years who has failed to appear. Others include Alice Munro, Doris Lessing, Harold Pinter and Elfriede Jelinek, but their reasons had to do with illness, old age and, in the case of Ms. Jelinek, various prohibitive phobias (crowds, flying). In each case, the winner either delivered a lecture that was filmed and transmitted to Stockholm or had the lecture read aloud. Mr. Dylan’s absence, however, does seem consistent with his general approach. “He’s behaved so strangely for so many years that if he would show up now and be cheerful and pleased, you’d be surprised,” said Daniel Sandstrom, the literary director at the publisher Albert Bonniers. Also, he said, Mr. Dylan’s politeness (or not) should have no bearing on whether he deserves to win the prize. “It would be very bad to award it just to nice people,” he said. Worse, in the view of some, is that Mr. Dylan’s win may disqualify other Americans, like Don DeLillo and Philip Roth, from winning, at least in the near future. Mr. Dylan is the first American laureate to win since Toni Morrison did so in 1993. “It’s very unkind, to put it mildly, to give it to an American but to give it to the wrong American,” said Mr. Gedin, who believes the prize should have gone to a more traditional writer. The academy is accustomed to unconventional behavior from Nobel laureates, who do not always exhibit unalloyed joy when they get the notifying telephone call. Some are scared some seem almost irritated some instruct their spouses to say they cannot come to the phone some affect an air of insouciant indifference. With the Belarussian journalist Svetlana Alexievich, who won last year, there was a language issue. “I tried French I tried German,” Ms. Danius said. “She didn’t understand what I was saying, although she did understand ‘Nobel’ and ‘prize. ’” But Mr. Dylan’s behavior has been at the extreme end of the spectrum, starting from a failure, for nearly two weeks, to respond to Ms. Danius’s phone and email messages. “Strange things have happened before, but nothing on this level,” said Per Wastberg, the chairman of the Nobel Committee at the academy. Ms. Danius’s assertion that Mr. Dylan’s behavior is not a concern  —   “The important thing is that the Nobel Prize in Literature belongs to Bob Dylan,” she said  —   is testament to the academy’s view of itself as impervious to outside criticism and pressure. Highly secretive about its inner workings, it exists as something of a paradox: both steeped in the world literary community and strangely apart from and above it. Founded to promote Swedish language and literature by King Gustaf III in 1786, the academy took on the Nobel literature responsibilities in 1901, the first year the prize was awarded (the winner was the French author Sully Prudhomme). Its 18 members, who serve until they die (they can stop attending meetings, but they cannot resign) are an idiosyncratic collection of writers, academics and specialists in  —   and advocates for  —   particular areas of literature. Each year, the academy invites academic institutions, scholars, literary organizations, former laureates and others to put forth nominees. You are not meant to nominate yourself, though it happens all the time. “We get at least one letter a week from someone who says, ‘I’m fantastic  —   you should read my book,’” Ms. Danius said. (These applicants are automatically disqualified.) Winners must have previously made the   shortlist at least once, and it seems that Mr. Dylan’s name had been kicking around for a while. The prize is meant to reward a life’s body of work, notwithstanding that even great writers produce material that not everyone loves. “Doris Lessing was on the shortlist for quite a while before my time, and then she wrote a series of   novels that sank her in the view of the academy,” Mr. Wastberg said. However, her name was resurrected  —   in part because of her   autobiography  —   and she won the prize in 2007. And what of Mr. Dylan’s Nobel lecture, which under the terms of the prize is required to be given within six months of the ceremony? Rumor has it that he’ll be in Stockholm next spring, “though the details are still unclear,” Ms. Danius said, and he has said nothing about giving a speech. “I’m not sure a regular concert will do it,” she added. “But the Swedish Academy always tries to accommodate the laureate’s wishes, so if that’s what he’d like to propose, I’m certain there is a way. ”'"}, "time": 1742563040.8226902}