{"duration": 0.1198890209197998, "input_args": {"text": "'FLINT, Mich.  —   State prosecutors filed criminal charges against six more government workers here on Friday in connection with Flint’s water contamination crisis, accusing them of concealing urgent information about the lead that was leaching into the city’s drinking water and doing nothing to stop it. The charges bring to nine the number of public employees criminally charged in the public health crisis, all midlevel bureaucrats or lower. Flint residents have been outraged that   officials have so far escaped any consequences. But the Michigan attorney general, Bill Schuette, hinted at a news conference on Friday that charges against   officials might follow, saying that investigators were “moving up the chain” and “going where the truth takes us, period. ” The widening inquiry comes as Flint’s residents continue to cope with the effects of the contamination. Concerns about the water emerged more than two years ago, but residents’ complaints were brushed off until last fall, when Gov. Rick Snyder acknowledged the scope of the problem. Tests continue to show that unfiltered tap water is still not safe to drink, and public health workers are trying to monitor thousands of Flint children who may have been exposed to high levels of lead, which can profoundly affect growth, behavior and intelligence over time. Mr. Schuette said the employees charged Friday  —   three from Michigan’s Department of Health and Human Services and three from its Department of Environmental Quality  —   all “attempted to bury or cover up, to downplay or hide information” about the lead contamination that began in April 2014, when Flint began using the Flint River as its water supply to save money. “Their story was, there is nothing wrong with Flint water and it was perfectly safe to use,” said Mr. Schuette, a Republican who is seen as a possible candidate for governor in 2018. “In essence, these individuals concealed the truth. They were criminally wrong to do so. ” The accused include Liane Shekter Smith, who led the state environmental agency’s Drinking Water and Municipal Assistance unit until she was fired in February. Prosecutors said she withheld information about the severe health risks of using the water after the lead contamination was underway and failed to protect the citizens of Flint. She was charged with one count of misconduct in office, a felony punishable by up to five years in prison, and one count of willful neglect of duty, a misdemeanor. The other Department of Environmental Quality employees charged were Adam Rosenthal, a water regulator who prosecutors said doctored reports about lead levels in Flint’s water, and Patrick Cook, another regulator they said misled officials with the federal Environmental Protection Agency about the city’s water quality. Both men were charged with misconduct in office and conspiracy. Mr. Cook was also charged with willful neglect of duty, and Mr. Rosenthal with tampering with evidence. Also charged were Nancy Peeler, the Early Childhood Health Section manager in the state’s Department of Health and Human Services Robert Scott, a data analyst for the department and Corinne Miller, a state epidemiologist. Prosecutors said the three employees learned last July of a spike in the number of Flint children with elevated blood lead levels but concealed the results. After seeing an internal report showing the increase, Mr. Schuette said, Ms. Peeler and Mr. Scott “produced a bogus report” that showed no worrisome rise in lead levels. Ms. Miller, who was the state’s top epidemiologist but has since left the job, instructed others not to take action on the initial report, Mr. Schuette said. The three are charged with one count each of misconduct in office, conspiracy and willful neglect of duty. The four employees charged Friday who were still working for the state were suspended without pay. Todd Flood, the special counsel for the investigation, noted that on the same day that the health officials learned about the spike in blood lead levels, July 28 of last year, the environmental officials charged were doctoring water quality reports, and he hinted at a broader conspiracy. “You have two agencies manipulating reports on the same day,” Mr. Flood said, “and that lock step, going to stage left, that seems significant to me. ” Mr. Schuette, who said last month that investigators were having trouble getting documents they had requested from Governor Snyder’s private lawyers, said they had since had “great constructive dialogue” with Mr. Snyder’s team. The investigators refused to say whether they had interviewed Mr. Snyder, but one, Andrew Arena, said, “Nobody’s off limits, and the facts will take us to the truth. ” He likened the investigation to an organized crime case, which starts with   people with the expectation that they can lead them to those at the top. “You don’t start at the top with organized crime,” Mr. Arena said. “That’s what we’re doing here. ” Flint began using the Flint River as its water supply to save money, but state regulators failed to require the city to add chemicals to prevent pipe corrosion, causing lead to leach into the water system. Brian P. Morley, a lawyer for Ms. Shekter Smith, said he was “surprised at these charges” and expected his client to plead not guilty. A lawyer for Ms. Miller declined to comment other defendants did not immediately return calls. Two other state employees and a Flint municipal employee  —   Michael Prysby, a district engineer with the environmental quality department, Stephen Busch, a district supervisor in the same department, and Michael Glasgow, Flint’s utilities manager  —   were charged in April in connection with the lead contamination. Mr. Glasgow has since agreed to cooperate with investigators in exchange for reduced charges. A report last month from the Centers for Disease Control and Prevention found that children drinking Flint water had a nearly 50 percent higher chance of elevated blood lead levels during the   period that the city was using river water. A local pediatrician, Dr. Mona   completed her own study in September 2015 and was the first to publicly warn of the spike in lead levels. The investigators said they were also investigating a possible connection between the water contamination and an outbreak of Legionnaires’ disease that sickened at least 87 people in the Flint region, with nine known deaths, from June 2014 through October 2015. “You can rest assured that that is on our radar every day,” Mr. Flood said. “That is an investigation that is ongoing, and we have the best experts in the world working with us. ”'"}, "time": 1742562582.6452653}