{"duration": 0.01633167266845703, "input_args": {"text": "'Some 25 colleges and universities  —   many of them public  —   have answered a call by professors at UCLA to use their regular class time to “teach, organize, and resist” what they view as the discriminatory political agenda of   Donald Trump. [Slated for Wednesday, January 18, the   dubbed #J18, is taking place between the Martin Luther King, Jr. holiday and Trump’s inauguration. The event’s planners say:  Let it be known that on #J18 and beyond, universities, colleges, and high schools refused to bear silent witness to the politics of hate and fear that in these times, these places of teaching and learning not only served as a sanctuary for its students and workers but also stood up to proclaim the power of knowledge on the frontlines of social justice. On January 18, the professors are calling upon their colleagues to “Teach, Organize, Resist,” and “affirm the role of critical thinking and academic knowledge in challenging Trumpism. ” They continue: On that day, we intend to teach about the agendas and policies of the new administration, be it the proposed dismantling of economic and environmental regulations or the threatened rollback of the   rights that form the fragile scaffolding of American democracy. On that day, we intend to organize against the proposed expansion of state violence targeting people of color, undocumented people, queer communities, women, Muslims, and many others. On that day, we intend to resist the institutionalization of ideologies of separation and subordination, including white supremacy, misogyny, homophobia, Islamophobia, and virulent nationalism. In addition to UCLA, universities participating in the event to date include: American University, Washington, D. C. University of California, Berkeley University of Cincinnati University of Dayton University of Minnesota New York University Princeton University Texas State University University of Kentucky Vanderbilt University and University of Washington. An editable flyer for the event states: “January 18, 2017, is a day to Teach, Organize, Resist. Transform your classrooms and commons into spaces of education that protest policies of violence, disenfranchisement, segregation, and isolationism. ” According to the “Media Resources” page of the event’s website, social media hashtags to be used for the day include: #J18, #Sanctuary Campus, #NotMyPresident, #ChallengeIneq, #UCLARave.'"}, "time": 1742628403.1125836}