{"duration": 0.06749129295349121, "input_args": {"text": "'“Cops don’t even want to make a damn traffic stop. Afraid they’ll wind up on Anderson Cooper. ” “Maybe [the police] are not going to have to be so politically correct. Maybe they’re being overly politically correct. ” The first quotation is from Frank Rourke (Bill Paxton) the morally suspect but brutally effective Los Angeles police detective at the center of CBS’s “Training Day. ” The second is from the new president of the United States. If you have a hard time telling them apart, who can blame you? The candidate Donald J. Trump, running on “law and order” rhetoric borrowed from Richard M. Nixon, talked crime as if he were recapping a ’70s cop drama. He repeatedly  —   and falsely  —   claimed that United States murder rates were the highest in 45 years. Cities, to him, were lawless hellscapes: “You walk down the street, you get shot. ” That’s essentially the outlook of two new police shows  —   “Training Day” and Fox’s “A. P. B. ”  —   each of which depicts American cities as   zones that need a tough,   boor to break rules, crack skulls and restore order. In the 2001 film “Training Day,” Denzel Washington played a corrupt narcotics detective with a knack for busting drug gangs and a weakness for skimming the take. CBS’s “Training Day,” beginning on Thursday and set in the present, has a tenuous connection to the original. Antoine Fuqua, the film’s director, is among the producers (who also include Jerry Bruckheimer, of “C. S. I. ”). But it perverts the dynamic of the film by making its central cop into a charming, roguish maverick. Here, Frank is partnered with Kyle Craig (Justin Cornwell) an idealistic “trainee” who is actually working undercover to investigate whether Frank has been crossing ethical lines. He has, and he’s damn proud of it. On their first outing, Frank lays out his philosophy: “Police work’s like sex, Kyle. It’s a lot more effective if it isn’t pretty. ” (I would not recommend this as a pickup line.) They cruise the squalid streets as Frank cites some statistics of Trumpian dubiousness: Crime is “up 300 percent,” which does not seem to square with recent Los Angeles police data. “It’s like ‘The Purge’ every night,” he says. Ugly times call for ugly tactics, he feels. If a few lies get told, a few suspects get tortured, a few confiscated dollars go missing  —   hey, freedom ain’t free. “Training Day” starts off building tension between idealism and security, but it ends up in the tank for Frank. Mr. Cornwell plays Kyle as an upstanding stiff, and the authorities investigating Frank are vindictive bureaucrats. Mr. Paxton gets to deliver the best lines and blow the most stuff up. Wry and swaggering, he’s the only one having any fun here, which pushes the audience to Frank’s side. In this formulaic “cop who won’t play by the book” setup, the book doesn’t stand a chance. Kyle decides to work with Frank rather than turn him in, and “Training Day” loses its nerve in the process, turning Frank into a raffish renegade who just says what everybody’s thinking. (His name is “Frank,” after all.) This “Training Day” is a   version of the movie, which paired Mr. Washington with Ethan Hawke as the   rookie. The racial dynamic is glaring as nostalgic white guy Frank fights to Make L. A. Great Again against largely minority criminals. An episode that pits him against Japanese mobsters is almost parodic. “How is a yakuza like a cue ball?” he says, while beating information out of one. “The harder you hit ’em, the better their English gets!” He ends up using an aluminum baseball bat to duel with a    mob boss, a Yankee Doodle metaphor that’s as subtle as an aluminum baseball bat. If “Training Day” comes from the “Dirty Harry” school of pop authoritarianism, Fox’s “A. P. B. ,” beginning on Monday, is a Silicon Valley “Batman. ” Its origin story: on a business trip to Chicago, the billionaire engineer Gideon Reeves (Justin Kirk) watches his best friend die in an armed robbery. Outraged by the sluggish 911 response, he bullies the city government into giving him control of an overwhelmed police precinct. He promptly equips officers with drones,   tasers and a smartphone app for instantaneous police response. RoboCop, meet UberCop. Chicago has become a flash point, to the right for its murder rate (Mr. Trump recently threatened to “send in the Feds! ”) and to the left for police brutality. But in “A. P. B. ,” all the city needs is  —   sound familiar?  —   a cocky, rude,    billionaire to disrupt the establishment. “A. P. B. ,” inspired by a New York Times Magazine article about a   police force in New Orleans, stumbled into its relevance. At heart, it doesn’t aim to be more than a disposable,    action show. Mr. Kirk is disarmingly snide as the arrogant Gideon. There’s a little melodrama and a lot of   and the crime stories are as mechanical as Gideon’s gadgets. The closest the show gets to big ideas about policing come when the     detective Theresa Murphy (Natalie Martinez) reminds her new boss that computers can’t replace the human element. Like “Training Day,” “A. P. B. ” was in the works well before Election Day (though not before Black Lives Matter and the reaction to it). The shows’ content is mainly driven by the eternal needs of broadcast drama: heroes (or, increasingly, antiheroes) villains and   stakes. You can’t make much of a crime procedural out of people not committing crimes. Occasionally, a serial like HBO’s “The Wire” or FX’s “The Shield” will question the tactics and premises of an objective like the war on drugs. In March, Fox will air “Shots Fired,” a provocative series about the complicated aftermath of a racially charged shooting in North Carolina. Most network police series don’t have that kind of ambition. But intentionally or not, “Training Day” and “A. P. B. ” have a message, anyway: that it’s a sick, sad world, and if you want to live, you’d best give a free hand to the kind of abrasive jerks you see on TV. They alone can fix it.'"}, "time": 1742628573.7562127}