{"duration": 0.042403459548950195, "input_args": {"text": "\"October 30, 2016 at 3:02 pm \\nBesides, using a «cloud» account, is extremely stupid. Paedo hunter October 30, 2016 at 1:09 pm \\nand about time too……my biggest ‘fear’ is the brainwashed masses putting resistence to the change…..like the Brexit ‘remainers’ who just can’t accept they lost yet still fighting at every legal street corner to have it reversed….that kinda mindset for different issues worldwide are the biggest stumbling block to change and they also feed the ruling classes objectives and give them reason to plant some more MSM treats for us to despair at…..like Russophobia……”LONG LIVE PUTIN” Mike October 30, 2016 at 12:05 pm \\nThanks Gilad, at least everyone here at vt isn’t brainwashed by Hillary. Vt is doing a disservice to itself by closing the comment sections on articles by Ian and Gordo. What cant control the narrative so you close the comments? Sad days for the Vt faithful! CoJonesGrandes October 30, 2016 at 12:57 pm \\nAre you aware of Karla Turner’s work? The negative aliens who have controlled this planet for ages have many tools in their box. For example,where an incorruptible person has acquired a large following but works against their agenda, one way of dealing with such a person is to replace his soul. This way, it would appear as if that person has switched allegiances. Unless you are psychic enough to see the soul, you would have NO idea that there has been any such switcheroo. http://www.reptilianagenda.com/exp/e112300a.shtml Quote: HOW THE ALIENS MIGHT CONTROL THE LEADERS: \\n“…. if they wanted to use one of their own souls … perhaps to inhabit the body of a politicians and work full-time through it, that could be done. …. they could simply take the soul out and stick another soul in. They have the ability to retrieve what we call the soul, to store it in a container, and to put it back into another body. They can put it in any body they wish.” Ariana October 30, 2016 at 11:37 am \\nSorry Correction _ Ironically, the masters of color revolutions around the world, are now experiencing the same colorfull revolution from inside, without any snipers behind the courtain and walls ! \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742564306.1185405}