{"duration": 0.03311753273010254, "input_args": {"text": "'(AFP)  Iranian President Hassan Rouhani said on Saturday that “terrorists” were applauding his US counterpart Donald Trump for launching a missile strike on an airbase of his Syrian government ally. [But he backed calls for an independent inquiry into a suspected chemical weapons attack on a   town in northwestern Syria on Tuesday that Trump blamed on the Damascus regime.  “This man who is now in office in America claimed that he wanted to fight terrorism but today all terrorists in Syria are celebrating the US attack,” Rouhani said in a speech aired by state television. “Why have you attacked the Syrian army which is at war with terrorists? Under what law or authority did you launch your missiles at this independent country?” Iran and Russia are the closest allies of Syrian President Bashar Assad. They have provided him with military support not only against jihadists like the Islamic State group and former   affiliate Fateh   Front that are targeted by a   coalition but also against other rebels they deem “terrorists” too. Both governments have defended their Damascus ally against Western allegations that it carried out a chemical weapons attack on the   town of Khan Sheikhoun on Tuesday, killing dozens of civilians. Rouhani called for “an independent commission” by “impartial countries” into the claims. “According to the United Nations, the Syrian government does not possess chemical weapons,” he said. Rouhani was referring to the   destruction of the Damascus regime’s chemical arsenal under a 2013 agreement between Washington and Moscow. On Friday, hours after the US missile strike, Iranian Foreign Minister Mohammad Javad Zarif said the Western allegations were “bogus. ” He likened them to the claims that Saddam Hussein’s regime had weapons of mass destruction which premised the   invasion of Iraq in 2003 but which later turned out to be baseless.'"}, "time": 1742628447.8253863}