{"duration": 0.0397343635559082, "input_args": {"text": "'Email \\nGet ready for the most cringeworthy story you’re going to read all day. \\nPanasonic might be one of the largest electronics manufacturers in the world, but after today, they may find themselves struggling to stay afloat. The company’s president has been forced to resign in disgrace after 60,000 Panasonic TVs abruptly ascended to heaven without warning. \\nWe’ll give you a minute to finish shaking your head. \\nThe scandal broke early last night when 60,000 of the company’s popular DX802-model flat-screen TVs from all over the world silently lifted off of the ground and, despite their owners yelling at them to stop and trying to drag them back down to Earth, floated away from the mortal realm and into the kingdom of heaven to reside with the immortal seraphim for all eternity. \\nYikes. Needless to say, Panasonic customers are not happy! Only a few minutes after the televisions began their skyward journey to the kingdom of God, Panasonic found themselves completely inundated with tweets like this: \\nWow. Panasonic definitely wishes it could rewind the clock on this one! Chances are, when you’re trying to stay competitive as one of the world’s foremost electronics companies, the last thing you want is for tens of thousands of your televisions to drift skyward into paradise. \\nWe’ve got to give credit where credit is due: At least Panasonic had the decency to admit that they let their customers down. The company has issued a public apology, and in a drastic move, the president of the company, Kazuhiro Tsuga, chose to resign in the wake of this scandal. Speaking at a press conference this morning, Tsuga issued the following statement: \\n“After much consideration, I have chosen to step down as the president of Panasonic Corp. If I could, I would travel to Heaven and retrieve each and every one of these televisions. I would kill any angel who tried to stop me from carrying these TVs out of paradise and returning them to our loyal Panasonic customers on Earth. Even if I saw God sitting on one of our missing DX802 flat-screens, I would shove the Lord off of the TV so that I could retrieve it for our customers. Unfortunately, I do not have the power to travel to Heaven, and so I am left with no choice but to resign my position.” \\nTsuga’s resignation is a nice gesture, but it doesn’t bring back a swarm of televisions from heaven. Panasonic’s reputation has been severely tarnished by the rapturing of their televisions. Whoever steps up to become Panasonic’s new president is going to have to do everything they can to prevent any of their products from ascending to heaven ever again.'"}, "time": 1742561631.516073}