{"duration": 0.1051931381225586, "input_args": {"text": "'The Fox News host Bill O’Reilly finds many ways to congratulate the readers of his new book, “Old School,” for their wisdom. Written with Bruce Feirstein, “Old School” is meant to set forth the code of decency, honor and determination that made O’Reilly what he is today. The lack of these virtues, the book argues, has created whiners, tweeters, helicopter parents, employees who don’t use briefcases and worse. All these miscreants are labeled “snowflakes,” though that’s getting rusty. A new epithet would have been nice. The trouble is that old   distinctions are not that clear. Sometimes old school is just old. And if you’re old school  —   “you still bend over to pick up a penny,” “you put everything away in the kitchen before you go to bed at night”  —   doesn’t being old school also require you to write your own book about your principles? O’Reilly has written half a book. He relies heavily on the “Over to you, Feirstein”   segue for the rest. More trouble: Did these two ever decide what snowflake was supposed to mean? It’s an   knock that they use for spinelessness, stupidity, political correctness and  ’Reillyian political leanings. They’ve left it so vague that one of O’Reilly’s definitions might get him into trouble with one of his most outspoken friends. “We all know Snowflakes,” he writes, “the people who blame everyone else for their failures, who look to others to solve their problems, who are sooooo sensitive to every slight. ” That puts a snowflake in chief in the Oval Office. This is an especially inopportune moment for O’Reilly to be lecturing anybody about morals. “Old School” hits the top of the New York Times nonfiction   list just as his popular TV show, “The O’Reilly Factor,” is hemorrhaging sponsors because women at Fox, angered by what they deemed O’Reilly’s predatory behavior, took his advice. (“Never let anyone treat you badly. That’s Old School. ”) O’Reilly’s recent series of steroidal history books written with Martin Dugard, starting with “Killing Lincoln” in 2011, is popular for much better reasons. Those books are compressed, not padded in the way “Old School” is. They boil big stories down to the good parts, treating accuracy as no obstacle. And they don’t play off the toxic atmosphere that has prevailed since the start of the 2016 election cycle. It’s astounding that “Old School,” a book built on divisive   can complain about   TV comics’ alienating half of the viewing population by being politically slanted. O’Reilly tells a few stories from his childhood that are meant to explain where his own   values come from. He grew up in Levittown, on Long Island, in a household where the kids were taught to be decent and to work hard if they wanted money. These stories can be strange, like the one when a young Bill used his father’s new mower on a neighbor’s lawn. Bill got angry when the neighbor complained that Bill hadn’t cut the grass under the shrubbery. It couldn’t have been done without damaging the lawn mower, so the neighbor handed Bill a pair of shears. Bill cut the grass angrily, took his pay and went home. He told his father the story. His father called the guy an imbecile. The lesson of Work Hard No Matter What somehow morphed into a connection between earning money and calling people imbeciles  —   or pinheads, the O’Reilly term of art. O’Reilly and Feirstein are old friends who met at Boston University in 1974. Their   story is one of the best anecdotes here. Feirstein was writing a column for the college paper, using it to lampoon the school’s rich kids and their   antics. (He would later move on to Spy and Vanity Fair.) One day, he found a big guy looming over him “with something between a scowl and a smile on his face,” shaking his head. “You’re not looking out for the folks,” O’Reilly scolded, telling Feirstein to give more serious focus to   graduate and commuting students than to the   “  types” O’Reilly already scorned. O’Reilly makes a visible effort to be fair when it comes time to create an honor roll of   individuals. Most controversially for his readership, he comes very, very close to putting Barack Obama on the  . He writes admiringly of Obama’s character, values and behavior as a parent. His grievance is that Obama failed to stage a rock concert that O’Reilly had put together to benefit My Brother’s Keeper, an initiative to help mentor   kids. O’Reilly thinks the former president torpedoed it for political reasons. “By the way, when was the last time you heard anything about My Brother’s Keeper?” he asks. He could easily have looked that up. A month after the election, Obama spoke about continuing to support it. The biggest and easiest target for “Old School” is school itself. Colleges and universities have provided abundant fodder for a book like this to roll out stories that will shock some portions of the general population. Those who haven’t kept up on the state of pronouns and gender politics have surprises in store. Anyone who remembers when the main issue surrounding college cafeteria food was edibility may be surprised at how much controversy cultural appropriation (e. g. the making of inauthentic ethnic foods) can generate. In a satirical letter from “Snowflake U (formerly known as Thomas Jefferson University),” somebody (probably Feirstein) crams    real examples of the extreme cosseting and cultural warfare that goes on in academia, where high tuition empowers students in ways the real world may not after graduation. Heavily footnoted (the examples check out) the letter presents a hellish vision of this warfare gone amok. And it’s worth anyone’s taking seriously, because O’Reilly’s core readership will take it as gospel. One more note about the degree of effort that went into “Old School”: O’Reilly has let himself become the one billionth person to write the line, “As Dylan sang, the times they were  . ’”'"}, "time": 1742563009.2684815}