{"duration": 0.16785025596618652, "input_args": {"text": "'When my son, Macallah, was born five years ago, my college students asked how it felt to be a new father. “Terrifying,” I blurted. “All I can think about is bullying. ” Silence and perplexed looks filled the room. “Your child was just born,” a female student said. “I know,” I responded. “But this boy’s going to be raised to feel and express his vulnerability. That’s a curse in this culture. ” What worried me just as much was the   realization: Whatever my wife and I tried to do to shape our son’s masculine identity would compete against such cultural norms as a postured indifference to school, which can lead to lower grades, graduation rates and academic motivation a sports and gaming culture that exalt alpha domination (and aggressive male reflexes) and a   John Wayne ethos that breeds alienation and, too often, depression. All of the dread and loathing I’d always felt about the limiting script of traditional masculine norms came flooding back. I was faced with one of my biggest fears about parenthood: having a son. The common wisdom, as research verifies, is that most men want sons. That’s starting to shift. Some men, like me, fear becoming fathers to sons. At the website for the NPR radio show “On Being,” the writer Courtney E. Martin observes of many younger   and       “I’ve noticed a fascinating trend: They seem to disproportionately desire having a girl instead of a boy. ” An informal Facebook survey she took yielded these results: “I wanted a girl mainly because I felt it was harder to be a boy in today’s society. If I have a boy I will embrace the challenge of raising a boy  …    who can learn the power of vulnerability even as male culture tries to make him see it as weakness. But, frankly, I hope that when I have a second child, it’ll be another girl. ’” This was emblematic of a lot of the responses, which revealed that men felt more confident, or “better equipped,”   “a strong, confident daughter. ” Ms. Martin says that her own husband was relieved to have daughters instead of sons. He says: “‘I haven’t felt like I fit into a lot of the social norms around masculinity  …    . I’m much more interested in the challenge of helping a girl or young woman transcend sexist conditions. It feels more possible and more important, in some ways. ” These sentiments ripple well beyond this small pool of men. Consider, for instance, such blog pieces as “Men Need Daughters More Than They Need Sons” or “Every Guy Thinks He Wants Boys, But Every Guy Should Want Daughters. ” Or: In a 2010 study, economists from the California Institute of Technology, the London School of Economics and New York University discovered, among other things, that adoptive American parents preferred girls to boys by nearly a third. The data was based on more than 800 adoptions that occurred between June 2004 and August 2009. The researchers suggested that this preference for girls might occur because adoptive parents “fear dysfunctional social behavior in adopted children and perceive girls as ‘less risky’ than boys in that respect. ” Adoptive parents are even willing to pay an average of $16, 000 more in finalization costs for a girl than a boy.   couples and single women showed an even greater proclivity for adopting girls.  These preferences weren’t limited to adopting parents. An article in Slate cites a study from the journal Reproductive Biomedicine Online which found that white couples preferentially select females through the increasingly common procedure preimplantation genetic diagnosis 70 percent of the time. (Patients using in vitro fertilization often use this procedure to vet their embryos for genetic abnormalities.) The article also says many fertility doctors observe that 80 percent of patients who are choosing their baby’s gender prefer girls. What few of us seem to realize: The     behavior, which increasingly invites cringing, doesn’t originate with them. In “A New Psychology of Women: Gender, Culture, and Ethnicity,” Hilary M. Lips writes: “  …    parents tend to touch infant boys less often and more roughly than infant daughters and that daughters are handled more gently and protectively. .. ” Research also shows that parents treat sons differently after they’ve suffered injuries than they do daughters, and another study, “Gender and Age Differences in   Emotion Talk,” reveals that mothers use more emotional language with   daughters than they do with comparably aged sons. This imbalanced,     is part of our legacy because children ape the attitudes of the parent whose gender matches their own. In a Time magazine article about this study, Harriet Tenenbaum, a   observes, “Most parents say they want boys to be more expressive but don’t know [they] are speaking differently to them  …    . These are learned stereotypes and we are reinforcing them as a society. ” The good news for boys is that men with a high emotional intelligence quotient don’t hand down these values. The bad news: Pressure from an unexpected corner makes such men   their desire to embrace boys, not to mention their own emotional sensitivity. A blogger on Vice, Chelsea G. Summers, thrills at how “misandry”  —   hatred of men  —   has become “chic. ” She gushes that, in addition to a political agenda, this blanket antipathy promises some “great pop culture. ” This has manifested itself, among other ways, through blogs and online essays and tweets that pillory and mock the growing trend of men crying  —   which, I know from my own and other men’s experience, can be the single act that most liberates and heals a painful past that devalues masculine sensitivity. Paradoxically, for some men, the   feminism they embrace   them into muting the very sensitivity and empathy that opened their eyes to women’s plight. Is it any wonder that some of us want little, if anything, to do with raising boys? The subtext bombarding us from many sides ultimately encourages us to abandon them, even as they founder beneath the chop of a changing world for which they lack the buoyancy. Yet men like me abdicate our responsibility by letting other men  —   the ones who don’t always encourage the broader, deeper humanity within males  —   raise boys. And we deprive ourselves of the opportunity to heal old wounds. Of course we should empower our daughters, because gross inequality still exists. And, despite the callous, increasingly callow, pushback, we should empower boys  —   with the same emotional literacy skill set and expansive worldview we teach our daughters. It’s what they, and we, ultimately need. Recently, I sent Macallah, now 5, to his room after he ignored my repeated requests to stop yelling and throwing his toys. More than even his dismissal, what bothered me was what many people refer to as “boy energy. ” It’s a reactive, sometimes destructive, force that unnerved me even as a child. Then I heard the voice of my wife, Liz, in my head: “He only wants your attention. Boys don’t always know how to ask for what they want. ” I found Macallah in his room, repeating the same behavior. I took a deep breath. “Were you upset because I wasn’t paying attention to you?” I asked. Head and eyes downcast, he nodded. I bent down and hugged him, then looked at him. “It’s important that you learn to tell Mama and me what you need  —   sometimes that means telling us what you’re feeling inside, understand?” He nodded. “You do it,” I said. “Tell me what you really wanted. ” He shrugged, still looking down. “You to pay attention to me,” he said. He threw his arms around my waist, leaning his head into me. I didn’t need words to know what filled my young son: He felt wanted.'"}, "time": 1742564126.5673592}