{"duration": 0.03181004524230957, "input_args": {"text": "'Pledging to “make the Netherlands ours again,” the Dutch nationalist politician Geert Wilders, at a campaign event on Saturday, described Moroccan immigrants as “scum” who endanger the country’s citizens. “Not all are scum, but there is a lot of Moroccan scum in Holland who makes the streets unsafe,” Mr. Wilders told reporters in English at an event kicking off a parliamentary election campaign in the   town of Spijkenisse, outside Rotterdam. “If you want to regain your country, if you want to make the Netherlands for the people of the Netherlands, your own home, again, then you can only vote for one party,” Mr. Wilders, the leader of the Party for Freedom, said. Mr. Wilders, whose party leads in national polls, posted a video clip of his comments on Twitter. Mr. Wilders, who was convicted in December of inciting discrimination after leading an   chant at a political rally in 2014, has vowed to end Muslim immigration and shutter the country’s mosques if elected prime minister in a general election on March 15. His party has 12 of the 150 seats in the lower house of Parliament. But while ahead in the polls, Mr. Wilders’s lead is narrowing after recent gains by Prime Minister Mark Rutte, a   conservative. Even if his party places first in the election, questions remain about whether Mr. Wilders would be able to successfully form a governing coalition. Mr. Wilders is one of several European nationalist politicians who is appealing to disillusioned voters, embittered by immigration and economic inequality. If elected, Mr. Wilders has promised to remove the Netherlands from the European Union. The triumph of President Trump  —   whose   policies and   comments has been heralded by Mr. Wilders  —   and the successful campaign to extract Britain from the European Union have galvanized   parties and emboldened politicians across Europe.'"}, "time": 1742562995.391459}