{"duration": 0.0758512020111084, "input_args": {"text": "'Home / Foreign Affairs / The Fix is In — Russia Kicked Off UN Human Rights Council, While Terrorist Saudi Arabia Re-Elected The Fix is In — Russia Kicked Off UN Human Rights Council, While Terrorist Saudi Arabia Re-Elected Jay Syrmopoulos October 29, 2016 1 Comment \\nNew York, NY – Russia lost an election to the UN Human Rights Council (UNHRC) for the first time since the council’s inception in 2006 – narrowly being beaten out by Croatia – as arguably the biggest supporter of terrorism in the world, Saudi Arabia, was re-elected to the council in spite of strong condemnation from global human rights organizations. \\nThe 47 council seats are elected for a three-year term and regionally distributed, with staggered elections for one third of the seats every year. Russia had just completed a three-year term running against both Hungary and Croatia for the two available seats from Eastern Europe. \\nAfter the U.S. lobbied heavily against the Russians, Hungary finished substantially ahead in the voting, with Croatia receiving 114 votes and Russia garnering only 112 votes of the 193 member countries. \\n“It was a very close vote and very good countries competing, Croatia, Hungary. They are fortunate because of their size, they are not exposed to the winds of international diplomacy. Russia is very exposed. We’ve been in the UNHRC for several years, and I am sure next time we will stand and get back in,” Russia’s UN envoy Vitaly Churkin said. \\nRussia will be eligible to run for a seat on the UNHRC again next year. \\nStaunch U.S. ally, and renowned global terror exporter, Saudi Arabia, easily made it onto the council with 152 votes on the Asian ballot, and will represent the region alongside Iraq, Japan and China for the next three years. \\nAccording to a report from RT : \\nSouth Africa, Rwanda, Egypt and Tunisia were chosen from the African group, Cuba and Brazil from Latin America and the Caribbean, and the US and the UK will represent the Western bloc, which comprises Western Europe and North America. \\nOver the next term, which will last between 2017 and 2019, the 14 chosen members will be tasked with formulating the UN’s official position on conflicts occurring around the world, as well as the domestic policies of member states. \\nIt should be noted that the U.S. is intentionally attempting to utilize the UN as a tool to forward their “aggressive Russia” narrative, thus removing Russia from the council is paramount to the American goal of labeling Russia as a human rights violator. \\nA number of the worlds most prestigious non-governmental human rights organizations, have come forward to claim that the UNHRC has been hijacked by oppressive regimes (like the Saudis) looking to deflect criticism and drive their own agendas. \\nHuman Rights Watch and Amnesty International produced a joint statement earlier this year condemning Saudi Arabia’s “appalling record of violations” in Yemen, where it has been accused of war crimes over the bombing of Houthi rebels — resulting in the deaths of up to 4,000 civilians. Both organizations have called for Saudi Arabia, a council member since 2006, to be suspended from the UNHRC without success. \\nExposing the rampant corruption within the UN system, just last month Saudi Arabia used its power in the council to block an outside inquiry into the Kingdom’s 157 domestic executions last year – often by beheading – while simultaneously heading a successful resolution that allowed their allies from the exiled Yemeni government to investigate numerous human rights abuses committed by Saudi Arabia in Yemen. \\nRussia dismissed a petition signed by 80 NGOs, as “cynical” and “dishonorable,” and said the accusations were motivated more by politics than by concern for human rights. The groups, which included Human Rights Watch and Refugees International, asked the voting countries to “question seriously whether Russia’s role in Syria which includes supporting and undertaking military actions which have routinely targeted civilians and civilian objects renders it fit to serve on the UN’s premier inter-governmental human rights institution.” \\nMake no mistake that the exclusion of the Russians from the council is a strategic move, orchestrated by the United States, as means of both marginalizing Russian influence, and stacking the deck against them in an effort to control the global narrative regarding Russia’s role as an international peacemaker. The goal is to propagandize people into buying into the “aggressive Russia” narrative continually parroted by US war hawks. \\nWhen Saudi Arabia, a nation that beheaded twice the number of people as ISIS last year , and one of the biggest exporters of global terrorism, is on the Human Rights Council – while the Russia is summarily dismissed because they challenge the U.S. narrative in Syria – it becomes increasingly apparent that the UN is nothing more than a tool to forward U.S. empire globally. Share Google + morris \\nThis is some sort of sick joke, why doesn’t the west start acting like they have some semblance of responsibility to if not those that gave them Power well then future generations. The West has already made it abundantly clear that because usa loses its Reserve Currency status they will happily take the entire Planet out with them. \\nThis is usa pulling the strings as usual with it’s witless cohorts obeying as told. Social Trending'"}, "time": 1742564302.181201}