{"duration": 1.6310584545135498, "input_args": {"text": "'The Chinese government has continued to protest the Trump administration’s repeated assurances it would oppose China’s ongoing colonization of international waters in the South China Sea, most recently challenging White House Press Secretary Sean Spicer for calling the waters in question “international territory. ”[“I don’t think he [Spicer] is in a position to say that that’s international territory,” Foreign Ministry spokesman Lu Kang told NBC News in an interview. “There might be difference, or controversial claims over the sovereignty of those islands, but that’s not for the United States. That might be between China and some other countries in this region. ”  Lu’s remarks on bilateral relations with the United States were significantly sharper in tone than those of his boss, Foreign Minister Wang Yi, who said in recent remarks that Beijing’s Communist Party would like to “increase mutual trust, focus cooperation, manage and control disputes and promote the healthy development of   relations, to bring even greater benefits to both peoples. ” Spicer had said during his regular press briefing on Monday that the United States would play a role in protecting the territorial integrity of the South China Sea. “If those islands are, in fact, in international waters and not part of China proper, yeah, we’ll make sure we defend international interests from being taken over by one country. ” Spicer’s comments appeared to irritate Chinese officials still objecting to remarks by incoming Secretary of State Rex Tillerson about the region. In a Senate hearing otherwise largely devoid of definitive answers on major international disputes, Tillerson vowed to play a role in protecting the interests of nations whose land and sea China claimed as its own in the region. “We’re going to have to send China a clear signal that, first, the   stops and, second, your access to those islands also is not going to be allowed,” he told a Senate committee, comparing China’s usurpation of South China Sea territory to Russia’s invasion and colonization of Crimea. China claims the territory within a border Beijing refers to as the “  line. ” Within that line is territory belonging to the Philippines, Vietnam, Taiwan, Brunei, and Malaysia, as well as some waters close to Natuna Island, Indonesia. China has constructed numerous artificial islands in the Spratly and Paracel Islands and the Scarborough Shoal, challenging the sovereignty of the Philippines and Vietnam. China has filled some of those islands with military assets, which the United States has repeatedly protested as threat to the international community. China’s official party line on the region appears to be that only the United States continues to protest their presence in waters not belonging to sovereign China. “Countries have already come back to the original agreement that maybe for the time being we could set aside those sovereign disputes, and focus on some joint developments, and working together to maintain the peace and stability in this region,” Lu told NBC. Lu appeared to mostly be referring to the Philippines, which won a case at the Permanent Court of Arbitration at the Hague over China’s illegal construction, but has since backed down of its objection to China’s territorial pursuits under President Rodrigo Duterte. His predecessor, Benigno Aquino, was the one to bring the case to the Hague. While the Trump administration appears to be making the liberation of the colonized South China Sea a priority, President Barack Obama had also engaged China on the matter. Former Secretary of Defense Ashton Carter attended military exercises in the region and often repeated the U. S. policy of having the American military “fly, sail, and operate wherever international law allows. ” The Defense Department also staged numerous “freedom of navigation” exercises in the region, much to China’s chagrin. Critics argue, however, that the Obama administration’s guest passages through the South China Sea did not actively challenge China’s adverse possession claims on the artificial islands and, as such, were more of a “PR stunt” than effective deterrence.'"}, "time": 1742563411.3055563}