{"duration": 0.04021430015563965, "input_args": {"text": "'Pew Research Center’s national survey on the overall trust of the American people in the federal government is “near historic lows,” with just 20 percent saying they trust it to do what’s right “always or most of the time. ”[Those that trust the government “some of the time” is much higher  —   68 percent  —   and 11 percent said they “never trust the government. ”  Pew points out in the article accompanying the survey results that a shift in power at the White House and Republican control in both chambers of Congress has shifted perspectives of the government: The changes in the dynamics of power in Washington have registered with members of both political parties. Somewhat more Republicans express trust in government today than did so prior to the election, while views among Democrats have moved in the opposite direction. For the first time since George W. Bush’s presidency, Republicans (28%) are more likely than Democrats (15%) to say they can trust the government in Washington to do the right thing just about always or most of the time. The number of Americans who describe their feeling toward the federal government as “frustrated” were in the majority at 55 percent. This compares with 22 percent who chose “angry” and only 19 percent who said they are “basically content. ” Confidence in the country’s future also reflects partisan attitudes, Pew reported.  Overall, 41 percent of Americans say they have “quite a lot” of confidence in the future of the U. S. while 30% have some confidence. The number who say they have “little or no confidence” is 28 percent, up from 15 percent in the fall of 2015. Since then, the share of Republicans expressing quite a lot of confidence in the nation’s future has increased 19 percentage points  —   from 40% to 59%  —    while falling 22 points among Democrats  —   50% to 28%. Pew Research Center conducted the survey between April   with 1, 501 adults participating.'"}, "time": 1742561650.3769782}