{"duration": 0.17789769172668457, "input_args": {"text": "'“Jaws,” they say, invented the blockbuster. But damn if Muhammad Ali didn’t get there first. From 1971 to 1974, he starred in two of the greatest events in the history of American sports, fights with Joe Frazier at Madison Square Garden and George Foreman in Kinshasa that had names that belonged on a movie studio’s release schedule: “The Fight of the Century” and “The Rumble in the Jungle. ” In October 1975 came a rematch with Frazier. They called that one “The Thrilla in Manila. ” But with all due respect to Francis Ford Coppola, everyone who saw Ali and Frazier nearly kill each other that oppressively sticky Manila morning knew it was the original “Apocalypse Now. ” In 1965, the photographer Neil Leifer captured Ali after he had knocked out Sonny Liston two minutes into their match  —   Ali stands over a   Liston, roaring in conquest, making you think the man is playing a totally different sport. To stick with the “Jaws” comparison, he was the shark, the ocean and the boat captain, and if he was fighting, you were going to need a bigger bout  —   the biggest. It wasn’t just the matches that were blockbusters. It was Ali himself. He was the most important   figure to survive the deadly tumult of the 1960s and flourish in the 1970s. Ali licked Liston, Frazier, Foreman and dozens of other men. But he was at the center of American culture in part because he had turned boxing into a condition of the American self: Punch or be punched. With him, boxing wasn’t just a sport but a referendum on the state of the country. He had become larger than life, but without forgetting how much black lives matter. The legacy of his bodacious charisma was built to last well beyond his death on Friday. Ali was telegenic, funny, clever, blunt, fearless and, above all, politically principled. His beliefs transfixed and polarized the country: What would he say next where would he take us? The short answer to that second question is “on a public journey. ” Ali was a politically black Zelig, but instead of merely lurking within the times, he shaped them. He was complicated and contradictory as both a man and an   embracing and shedding radical black Islam, wielding racist imagery to rile opponents, refusing to play the black clown for the press. The journey led the baddest boxer in the world to shake hands with Gerald R. Ford, one of the blander presidents. He acted on Broadway and wrote braggadocio raps that we called poetry because, at the time, we didn’t know what rap was. By the time he lit the Olympic torch for the Atlanta Games in 1996, he was an elder statesman, visibly shuddering with signs of Parkinson’s disease, a powerful, poignant distance from his 1960s self but still  . The day after he upset Liston in 1964, he hooked up with the Nation of Islam and announced that he would no longer be going by his birth name, Cassius Clay. Sure, it was the name of a white abolitionist  —   from Ali’s own Kentucky, no less  —   but it felt like a slave name, too. The news media took its sweet time coming around to “Muhammad Ali. ” Many reporters kept calling him Cassius, in a childish,   style. So he had to fight for that, too. By 1977, when LeVar Burton’s Kunta Kinte chose in “Roots” to be whipped for refusing to repeat his new name, you can imagine a portion of the 30 million people who watched exhaling something like, “Oh. I get it!” Nonetheless, Ali’s embrace of the     Nation of Islam alarmed the country. Almost overnight, a cocky young fighter became a scary black man. In 1967, he claimed   status and refused the Army induction to fight in Vietnam, saying to the press: “I ain’t got no trouble with them Vietcong. It ain’t right. They never called me ‘nigger.’ ” His defiance brought out competing paradoxes: Until America reconciled its war with itself, how could it ask a citizen to fight somewhere else? He was fined $10, 000, sentenced to five years in prison, stripped of his boxing title and forced to wait three and a half years for the Supreme Court to overturn his conviction. He lost prime fighting years and gained honor. The roaring monster in Leifer’s photo now appeared on the cover of Esquire, in his boxing trunks, his bare chest shot with arrows just like poor, martyred St. Sebastian. Another astonishing transformation: The scary black man had become a national folk hero. Ali’s objection to the war came the same year that Sidney Poitier, long a symbol of the possibilities of racial integration and of turning the other cheek, hauled off and slapped an old white racist in “In the Heat of the Night. ” (He’d finally run out of cheeks.) By the 1970s, Poitier had found a second, less gusty wind, directing and starring in slick comedies that pushed the kind of cultural politics of appearing respectable (if not accommodating) that Ali sometimes espoused. Take this moment from 1974 on “The Mike Douglas Show. ” Douglas asks his guest   Sly Stone, to introduce Ali. And Sly  —   cool, stoned,   enthusiastic  —   brings Ali out like this: “I love Muhammad Ali. ” Out strolls Ali. He looks crisp in a great dark suit, white shirt and tie. They shake hands, and Sly, in a       goes in for a hug. Ali has barely taken his seat when Douglas’s joshing sarcasm sets the tone: “You’re happy again today. I can tell. ” The audience laughs, and then Douglas completes his thought: “You never walk out with a nice smile. You always look troubled,” as if Ali  —   the world’s greatest athlete, least likely sufferer of fools, and most famous living civil right activist  —   was supposed to be Soupy Sales. If Douglas was going there, Ali was going to follow. “I am troubled. We have so many problems in the world,” he says, reclining a bit in his chair, generating suspense with his terrific, meaty Louisville accent, as to whether he would respond with comedy or gloomy candor. With Sly staring at him, he succinctly dispels the suspense: “These shows are so phony. Everybody’s laughing. Everything is a laugh here in America. Ain’t nobody serious. People hungry, war, all kind of trouble. ” Ali questions the complicity of black entertainers in this circus, while Sly mockingly repeats what Ali says and tells him to lighten up: “We ain’t planning on going to church now. ” The more Sly leans toward him, the more Ali seems to lean away  —   it’s the physics of temperament but also of racial disposition. On this day, Ali has everyday black folks on his mind. Sly doesn’t not share the same concerns, but he makes a passable case for the values of peace and love. This isn’t a disagreement over philosophy but of presentation: Ali didn’t want to be seen smiling if he didn’t feel like it. Much of America had probably seen Ali chop it up with Howard Cosell on “Wide World of Sports. ” But tension between two black men on the subject of their own race wasn’t a regular spice in the   diet. Even in 2016, it’s arresting, especially with two men this outwardly different. Officially, black is a who. But with Ali, it was always a how. How do you use your blackness both for and against? How is it helping? How might it hurt? How is our own blackness being turned against us? When he left boxing after his last fight in 1981, he took the majesty of the sport with him. He took the symbolism and grim spectatorial history, too. Boxing is a   contest. But if Ali was in the ring, so was the rest of the country. After him, blackness as a point of public pride had also drifted away from American popular culture  —   or rather it had been absorbed by the gradual mainstreaming of   and the proliferation of a black middle class. It found shelter in such apolitical spaces as the Huxtables’ Brooklyn home and Will Smith’s adopted Bel Air mansion. But in the last few years, something has changed. There’s been increased political awareness of the inequality of black life and outrage over unjust black death. Technology has given megaphones to previously voiceless people. At the same time, major black artists and stars have reconnected blackness, history and politics  —   from Kanye West and Beyoncé and Kendrick Lamar to LeBron James, who in 2012 put the Miami Heat in hoodies for an iconic photo after Trayvon Martin’s death. Even our black president has come further unfettered, not simply addressing race but almost luxuriating in his blackness. He told Howard University’s most recent graduating class to embrace its black identity  —   more or less, as he publicly has. Some of what’s happened in this period has been rightly received as radical. These are hardly boring times we’re living in. But when the country is seen through the prism of Muhammad Ali, words like “radical,” “truth,” “fame,” and “risk” suddenly feel as if they should come with an asterisk.'"}, "time": 1742562083.3442628}