{"duration": 0.09610223770141602, "input_args": {"text": "'In the world of pop music, women are enjoying a moment of dominance. Beyoncé, with her towering album and short film “Lemonade,” rewrote the playbook (again) in April. Adele’s album “25” has soared since its release about a year ago, selling more than 10 million copies in the United States alone. The two artists will square off in the top categories at the Grammy Awards in February. But in a lacerating speech on Friday, Madonna  —   the   female touring artist of all time, who in March wrapped up a tour that took in $170 million  —   resisted the notion that all was well and fair for women entertainers, particularly as they get older. Accepting a Woman of the Year award at the Billboard Women in Music 2016 event, the    musician brought a hush over the crowd as she spoke in deeply personal terms. In the speech, Madonna said she had faced sexism, misogyny and “constant bullying and relentless abuse” over the more than 30 years of her career. She spoke about being raped on a rooftop with a “knife digging into my throat” when she first moved to New York many years ago, an experience she first discussed publicly in 2013. She also took pride in her ability to persevere in an industry that she said did not look kindly on older women singers. “People say that I’m so controversial,” she said to the crowd. “But I think the most controversial thing that I’ve done is to stick around. ” In the world of music, she said, “to age is a sin. ” “You will be criticized, you will be vilified, and you will definitely not be played on the radio,” she added. (Beyoncé is 35 years old Adele is 28.) In substance, the speech was not, of course, entirely new for Madonna. She has challenged sexual norms through her music, image and writing since the start of her career, pushing for, as Camille Paglia  —   a cultural critic who has both supported and rebuked Madonna over the years  —   wrote in 1990, “young women to be fully female and sexual while still exercising total control over their lives. ” Candor has always been one of Madonna’s hallmarks. In recent years, she has become something of a warrior against age discrimination, publicly rebelling, with few subtleties, against the notion that age should slow her down. But the speech on Friday was a strikingly blunt statement for the entertainer, who, if only briefly, had no intention of entertaining. And it came as debates over gender equality and latent sexism contributed to a national dialogue that grew more emotional amid America’s presidential election  —   a contest between a man and woman that served, in part, as a referendum on those issues. Madonna herself appeared at a surprise concert in Washington Square Park in New York in support of Hillary Clinton’s presidential campaign the night before the election. In her speech at the Billboard event, Madonna seemed to make a tacit reference to the election’s outcome. “Women have been so oppressed for so long, they believe what men have to say about them,” she said, according to Billboard. “They believe they have to back a man to get the job done. ” In an interview before the event, she was more direct: “Hillary Clinton lost the election, and it’s really important to make a stand and speak my mind about the importance of women and women empowering themselves,” she said. On Friday, in her speech, Madonna spoke about the rules of “the game”  —   the established ideas that she said women are pushed to abide by. “You are allowed to be pretty and cute and sexy, but don’t act too smart. Don’t have an opinion,” she said. “You are allowed to be objectified by men and dress like a slut, but don’t own your sluttiness and do not  —   do not, I repeat  —   share your own sexual fantasies with the world. ” Another unspoken rule for women, she said, even more important than satisfying the expectations of the men in their lives, was to “be what women feel comfortable with you being around other men. ” Toward the end of her speech, she mentioned other groundbreaking musicians, including Prince and David Bowie, both of whom died this year. “But I’m still standing,” she said. “I’m one of the lucky ones. ”'"}, "time": 1742561844.1747367}