{"duration": 0.04744887351989746, "input_args": {"text": "' Does The U.S. Government Really Know Who Hacked Democrats\\x92 Emails? By Kassia Halcli\\n \" PBS\" - The hacking and public release of Democratic campaign and committee emails made the news and a presidential debate, with more leaks expected to come.\\nThis week, WikiLeaks published more emails from Hillary Clinton\\x92s campaign chairman, John Podesta. Nearly 20 batches of campaign emails were released over the last month, in addition to Democratic National Committee emails released earlier this year.\\nIn the final presidential debate on Oct. 19, Clinton said documents released by WikiLeaks were part of Russian espionage on the U.S. She called on Republican candidate Donald Trump to acknowledge the Russia connection and condemn such actions.\\n\\x93She has no idea whether it\\x92s Russia, China, or anybody else. She has no idea,\\x94 said Trump.\\n\\x93I am not quoting myself. I am quoting 17, 17 intelligence agencies. Do you doubt 17 military and civilian agencies?\\x94 Clinton asked.\\n\\x93Our country has no idea,\\x94 Trump responded.\\nClinton was citing the Oct. 7 statement from the U.S. intelligence community saying it was \\x93confident that the Russian government directed the recent compromises of emails from U.S. persons and institutions.\\x94\\nAnalysts say, however, that the ability to determine who cyber attackers are, where they\\x92re located and sometimes who ordered their operations is rarely definitive and comes in degrees of confidence.\\nBeyond the government\\x92s headline assertion that Russia is to blame, \\x93it\\x92s important to parse the public statement pretty closely,\\x94 said Susan Hennessey, a national security fellow at the Brookings Institution. \\x93They\\x92re being really careful in their word choice.\\x94\\nThe Department of Homeland Security and Office of the Director of National Intelligence on Election Security said in a statement earlier this month that \\x93only Russia\\x92s senior-most officials could have authorized these activities.\\x94\\nBut that statement does not mean that the U.S. has \\x93direct evidence of senior official-level involvement,\\x94 Hennessey said.\\nWithout more definitive statements, it\\x92s difficult for some technical experts to take the government\\x92s word on faith, she and others have said.\\n\\x93There\\x92s no evidence that this was done by the state itself, only evidence it was done by non-state actors that might be Russian-speaking,\\x94 said Jeffrey Carr, CEO of the cyber security consultancy firm Taia Global, referring to the evidence available to the public.\\nThat evidence, which was released by private threat assessment companies rather than official channels, indicates hackers used Cyrillic keyboards and operated during Moscow working hours.\\nBut indicators of identity like timestamps, language preferences and IP addresses \\x93can be manipulated or faked rather easily,\\x94 said Juan Andres Guerrero-Saade, a senior security researcher at Kaspersky Lab.\\nTrump has a point when he says we can\\x92t know for sure, said Cris Thomas, an information security professional known online as Space Rogue.\\n\\x93I don\\x92t know what [evidence] they have that couldn\\x92t have been faked,\\x94 Thomas said.\\nSophisticated attackers have learned how to tamper with the technical indicators to mask their identity, or at least send analysts in the wrong direction.\\nDmitri Alperovitch, co-founder of CrowdStrike, hired by the Democratic National Committee to assess its breach, wrote a blog post attributing the hack to two separate Russian-intelligence affiliated groups, Fancy Bear and Cozy Bear.\\nAlperovitch classed both as sophisticated actors, writing on CrowdStrike\\x92s blog that their \\x93tradecraft is superb, operational security second to none.\\x94\\nFancy Bear is \\x93very, very good at deception campaigns,\\x94 said Brian Bartholomew, who co-authored a report about the deception tactics that complicate attribution.\\nBut, he added, the group has recently seemed \\x93a little more lax\\x94 about getting caught.\\nCarr asked, if these hacks are a ploy by Russian President Vladimir Putin to install what Clinton has called \\x93a puppet\\x94 at the helm of a Western democracy, why leave such obvious technical indicators in their wake?\\n\\x93That\\x92s not even sloppy,\\x94 Carr said. \\x93That\\x92s just ignorant.\\x94\\n\\x93Perhaps [Russia] wanted it traced back to them to show that they\\x92re flexing their geopolitical muscle,\\x94 Schwartz said.\\nDeception, however, \\x93is exceptionally difficult to pull off at the level that is going to withstand the amount of scrutiny the government will put on it,\\x94 said Jason Healey, senior fellow at the Atlantic Council\\x92s Cyber Statecraft Initiative.\\nAnother complicating factor is that the first intrusions into the DNC go back more than a year, well before Trump, purported to be Putin\\x92s favorite candidate, was perceived as having a reasonable chance of winning the Republican Party\\x92s nomination.\\nTo think these hacks were in service of a farsighted, cunning plan designed by the Kremlin is \\x93imputing a level of insight and ability to understand and predict the U.S. electoral system that certainly no one in the United States has demonstrated,\\x94 Hennessey said.\\nA more likely explanation, she said, is that the hackers were conducting low-threshold espionage but ending up finding information that could be opportunistically released.\\nThe U.S. government has swaths of intelligence and the ability to operate beyond laws that constrain private sector threat assessment companies, said Guerrero-Saade.\\n\\x93As the public, we should really understand that there\\x92s a lot more at play behind the scenes,\\x94 Bartholomew said.\\nJudging by the practice established by its three previous attribution claims, the government is unlikely to release substantiating evidence, in order to guard U.S. sources and methods.\\nThe world of cyber crime \\x93feels like the Wild West, but it\\x92s not to say that nothing can be known,\\x94 Guerrero-Saade said.'"}, "time": 1742628570.4461749}