{"duration": 0.08855819702148438, "input_args": {"text": "'Marine Le Pen, the presidential candidate for France’s populist National Front (FN) has pledged to put France first, hitting out at “financial globalisation” “mass immigration” and “Islamic fundamentalism” in a landmark speech. [The    said that “financial globalisation and Islamist globalisation are helping each other out” and “those two ideologies aim to bring France to its knees”.  According to Le Pen, globalisation can be summed up as “manufacturing with slaves to sell to the unemployed”. She pledged that an   republic would be “will be all about the local, not the global”. Speaking to a cheering crowd of some 3, 000 supporters, Le Pen said her government would be “French first”  —   with French citizens going to the front of the queue for both employment and social housing. In contrast to the representatives of “the   Right and the   Left” she said she was “only the candidate of the people”. Le Pen appeared to be invoking the spirit of Donald Trump’s successful presidential campaign in the U. S. which explicitly rejected “the false song of globalism” and pledged an “America First” foreign and economic policy. “People are waking up,” confirmed FN deputy leader Florian Philippot immediately before Le Pen’s speech. “They see Brexit, they see Trump and they’re saying to themselves: ‘It’s worth going to vote. ’” This idea of an impending   in world politics was Le Pen’s key theme: “The people are waking  —   the tide of history has turned” she said. “What is at stake in this election is the continuity of France as a free nation, our existence as a people   …     The French have been dispossessed of their patriotism. They are suffering in silence from not being allowed to love their country   …     The divide is no longer between the Left and the Right, but between the patriots and the globalists. ” Le Pen also reiterated her calls for the   euro to be scrapped and France’s membership of the European Union (EU) to be put to a referendum unless the   Schengen Agreement is abandoned and the bloc reconfigured as a much looser association of sovereign  .'"}, "time": 1742564125.998954}