{"duration": 0.1512148380279541, "input_args": {"text": "'  Donald J. Trump’s transition team is nearing picks for heavyweight   posts such as the secretaries of state and of the Treasury, attorney general, and ambassador to the United Nations. They were accused by detractors of being bosom buddies, in cahoots over underhanded efforts to rig the American election  —   accusations candidate Trump denied. Now,   Trump and President Vladimir V. Putin of Russia have spoken. The Kremlin released a readout Monday of the first call between Mr. Putin and the   since he won the election, saying the men expressed mutual optimism about improving the dire state of relations between the two countries. According to the Kremlin, Mr. Putin said he hoped to work with Mr. Trump in an atmosphere of mutual respect without interfering in each other’s internal affairs. They also talked about fighting international terrorism and settling the crisis in Syria. The Trump transition team reported that “  Trump noted to President Putin that he is very much looking forward to having a strong and enduring relationship with Russia and the people of Russia. ” While Mr. Trump said he hoped to have a constructive relationship with Russia, he insisted during one of his debates with Hillary Clinton that he was “no puppet” of Mr. Putin. Justice Ruth Bader Ginsburg, who once called Mr. Trump a “faker” who “has no consistency about him,” said on Monday what she likely wanted to avoid: Mr. Trump will make the Supreme Court whole again. “Most immediately our vacancy will be filled,” she told a meeting of the Jewish Federations of North America at a Washington hotel. “President Trump will fill it. ” She urged the Senate to act promptly on the  ’s nomination to fill the vacancy created by the death of Justice Antonin Scalia. “Eight is not a good number,” she said. At full strength, the court has nine members. At a news  conference on Monday before an overseas trip, the president struck a diplomatic tone. • On Stephen K. Bannon’s appointment as chief White House strategist, which civil rights groups, Democrats and some Republicans have criticized, President Obama demurred, saying, “It would not be appropriate for me to comment on every appointment that the   starts making. ” • Faced with repeated questions about Mr. Trump’s temperament, Mr. Obama expressed hope that the presidency would be a reality check. “His gifts that obviously allowed him to execute one of the biggest upsets in political history, hopefully he will put to good use,” Mr. Obama said. • On his Democratic Party, Mr. Obama said that a period of reflection was healthy, that new voices were necessary and that the stunning defeat should be a warning. “It takes a while for people to reconcile themselves with that new reality,” he said. “Hopefully it’s a reminder that elections matter. ” • On immigration, Mr. Obama urged Mr. Trump to “think long and hard” about endangering the status of young immigrants who were brought to the country illegally as children. He described them as “American kids. ” The F. B. I. reported Monday that attacks against American Muslims rose last year, driving an increase of about 7 percent in hate crimes against all victims. The data, the most comprehensive look at threat crimes nationwide, expanded on previous findings by researchers and outside monitors, who have noted an alarming rise in some types of hate crimes tied to the intense vitriol of the presidential campaign and the aftermath of terror attacks at home and abroad since 2015. A wave of racially charged assaults, graffiti attacks and other episodes has swept the country since Election Day, prompting Mr. Trump to call for a halt to it during a “60 Minutes” interview broadcast on Sunday night. In its report Monday, the F. B. I. cataloged a total of 5, 818 hate crimes in 2015  —   a rise of nearly 340 over the year before  —   including assaults, bombings, threats and property destruction against minorities, women, gays and others. Attacks against Muslim Americans saw the biggest surge: 257 reports of assaults, attacks on mosques and other types hate crimes against Muslims last year, a jump of about 67 percent over the year before. It was the highest total since 2001, when the aftermath of the Sept. 11 attacks saw more than 480 attacks. Attacks against transgender people also sharply increased, the data showed. Law enforcement officials acknowledge that the statistics give an incomplete picture because many local agencies still have a spotty record of reporting hate crimes, 26 years after Congress directed the Justice Department to begin collecting the data. “We need to do a better job of tracking and reporting hate crime to fully understand what is happening in our communities and how to stop it,” James B. Comey Jr. the F. B. I. director, said Monday. Mr. Trump has spoken with President Xi Jinping of China, the presidential transition team announced on Monday, and the world likely thought, “Interesting. ” According to the announcement, in a call that took place on Monday Beijing time, Mr. Xi congratulated Mr. Trump for “winning a historic election,” and the   thanked the Chinese leader for his well wishes. “During the call, the leaders established a clear sense of mutual respect for one another, and   Trump stated that he believes the two leaders will have one of the strongest relationships for both countries moving forward,” the statement said. No mention of whether Mr. Trump’s repeated campaign threats against Chinese trade practices came up, nor his statement that climate change was a hoax perpetuated by the Chinese, nor his   promises on economic relations moving forward. Senator Bernie Sanders of Vermont, who mobilized a movement but not enough votes to win the Democratic presidential nomination, is stepping forward as an alternative to the party’s leadership and a stalwart against racial politics. Taking to his campaign Twitter handle on Monday, he decried the Democrats’ loss of white,   voters to   Trump. He added, “The Democratic Party has to stand with working people, feel their pain and take on the billionaire class, Wall Street and drug companies. But he also said that the new role of Mr. Bannon in the Trump White House as senior counselor and chief strategist should make the country “very nervous. ” The country has battled “discrimination and racism and sexism and homophobia” for hundreds of years, he said in an interview on ABC’s “The View” program on Monday, and the country could not afford to move backward. “We’re going to tell Mr. Bannon and any other advisers that we’re not going to be turning on each other,” Mr. Sanders said. “We’re going to be standing together. ” In concert, liberal activists staged a   in the office of Senator Chuck Schumer of New York, the incoming Democratic minority leader, to demand a leadership position in the next Senate for Mr. Sanders. Civil rights groups, Democrats and some Republicans on Monday denounced   Trump’s decision to appoint Mr. Bannon to a top White House position, warning that he represents nationalist and racist views that should be rejected by the incoming president. Read the full story. Alex Jones, an online broadcast host who has accused the government of   conspiracies, says that   Trump personally called him to thank him for his support during the campaign. Mr. Jones made the revelation on a brief clip on his website. “He said, ‘Listen Alex, I just talked to the kings and the queens of the world,’” Mr. Jones recalled, saying that Mr. Trump added, “I want to thank you, your audience. ” He said the incoming president promised to come on his program again in the next few weeks. He celebrated that Mr. Trump had triumphed over “hoaxes” such as Obamacare. Mr. Jones was an early booster of Mr. Trump, who appeared on his program during the end of the primaries. Mr. Jones has charged, among other things, that the Sandy Hook school shooting in Connecticut in December 2012 was a hoax.'"}, "time": 1742564402.7421165}