{"duration": 0.07078361511230469, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1.  President Trump’s aggressive moves on security and immigration drew strong responses both domestically and internationally. Tensions with Mexico are particularly high. Its president, Enrique Peña Nieto, above, canceled a meeting with Mr. Trump, and the two feuded  —   largely over Twitter  —   as reports emerged that Mr. Trump could consider a 20 percent tax on imports to pay for a border wall. Mexico said its 50 consulates in the United States would work to protect the rights of Mexican immigrants, while America’s   sanctuary cities, including New York, Boston and Los Angeles, vowed to resist   immigration enforcement. _____ 2. Mr. Trump told Republican leaders at a policy retreat in Philadelphia that this Congress would be the busiest “in decades, maybe ever. ” His adviser Steve Bannon deepened tensions with the news media, saying it had been humiliated by election missteps and should “keep its mouth shut. ” He added: “I want you to quote this. The media here is the opposition party. ” This may not come as a surprise: Sales of dystopian novels, most notably George Orwell’s “1984,” are spiking. Our literary critic offers a reappraisal. The Times is tracking Mr. Trump’s full agenda, and covering many more aspects of his administration. You can also sign up for our daily politics newsletter here. _____ 3. Vice President Mike Pence will speak at the   March for Life on the National Mall on Friday. Organizers have ramped up attendance efforts, not wanting to be embarrassed by a poorer turnout than the women’s marches last weekend. And health clinics across the developing world are bracing for cuts because of Mr. Trump’s revival of a policy prohibiting foreign aid to groups that discuss abortion, a rule that often curtails broader health services. Above, a woman who suffered complications from a botched abortion in the Democratic Republic of Congo. _____ 4. The Doomsday Clock has moved nearer to midnight than it’s been in more than 60 years. Devised by the nonprofit Bulletin of the Atomic Scientists, it’s meant to convey “how close we are to destroying our civilization with dangerous technologies of our own making. ” It debuted in 1947. Two of the group’s scientists cited alarm over Mr. Trump’s positions on nuclear weapons and climate change. _____ 5. In China, hundreds of millions of people are traveling from industrial regions to their hometowns to celebrate the start of Lunar New Year on Saturday. Some cities have restricted the use of fireworks over pollution concerns. _____ 6. For the first time, biologists have succeeded in growing human stem cells in pig embryos. The advance brings scientists closer to developing human organs in animals for later transplant. Since the organ would be made of a patient’s own cells, there would be little risk of immune rejection. _____ 7. Tributes to Mary Tyler Moore, the iconic actress who died on Wednesday at 80, continue to pour in. The TV journalist Jane Pauley, above, said the character of the single,   news producer Mary Richards was a role model and more. She even mimicked her fashion and home décor choices. The show “made a woman in the newsroom seem normal,” wrote Ms. Pauley, the anchor of “Sunday Morning” on CBS. _____ 8. Serena and a resurgent Venus Williams will face each other in the final of the Australian Open on Saturday. It’s the first time they’re playing against each other in a Grand Slam final since Wimbledon in 2009, above. If Serena wins, she would set an   record with a 23rd Grand Slam singles title. And a surprisingly strong Roger Federer defeated Stan Wawrinka to advance to the men’s final. He’ll seek his first major title since Wimbledon in 2012 on Sunday. _____ 9.   years after the movie “Trainspotting” gave the world a glimpse into the   underbelly of Edinburgh, the characters are back. “T2 Trainspotting”  —   with the same director and several of the same stars, including Ewan McGregor, above center  —   checks in with the unmoored but compelling characters as they face middle age. It’s being released this week in Britain and reaches the U. S. in March. We rounded up the early reviews. _____ 10. Finally, whatever your politics, your fears, or your troubles, a gift: the Great National Cute Animal   of 2017. Over the past two days, American zoos and aquariums have dominated the conversation on Twitter with photo after photo of adorable animals. And the world cracked a smile. Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561753.3416567}