{"duration": 0.04764604568481445, "input_args": {"text": "\"Feds get a warrant to start search for classified info in 650,000 emails - thousands of them from her private server - on sexting Weiner's laptop. Clinton faces ongoing FBI probe even if she's elected President By Wills Robinson Daily Mail November 1, 2016 The FBI now has a warrant to read the emails from Huma Abedin, Hillary Clinton ‘s most trusted aide, which were among hundreds of thousands discovered on Anthony Weiner’s laptop. Law enforcement officials confirmed that investigators gained permission to start trawling through the 650,000 emails discovered on the laptop on Sunday evening, NBC reported. Thousands of them could be from Clinton’s private server. Feds seized the laptop belonging to Weiner, Abedin’s disgraced husband, in September after DailyMail.com exposed his sexting of a 15-year-old girl. In early October, agents told FBI heads they’d found emails on the laptop from Abedin that may have been deleted from Clinton’s private server but their warrant did not allow them to read emails that were not linked to the Weiner investigation. The newly reopened investigation will take time due to the sheer volume of emails to be read, the Wall Street Journal reported. It will likely take agents until well past the election to assess how many, if any, contain classified information – leaving Clinton with the prospect of facing an ongoing investigation even if she is elected president. The Democratic candidate already shows signs of slipping in the polls after an ABC News/Washington Post tracker poll revealed Trump was just one point behind – an 11 point change since last week. And since FBI director James Comey’s shock announcement on Friday that the Clinton private server probe was to be reopened, questions have continued to mount over Abedin’s future on the Clinton campaign. She has stayed behind in New York while her boss hits the campaign trail. Abedin has pleaded ignorance about how the emails ended up on husband Weiner’s laptop. She swore under oath while testifying in a lawsuit brought against the State Department by Judicial Watch that she had handed over all of her devices that could hold emails relevant to the investigation into Hillary Clinton’s private email server. If she’s found to have lied she could face up to five years in jail. On Sunday, Clinton – no longer accompanied by Abedin – said at a Florida rally that she would not be ‘knocked off course’ by Friday’s shocking development. ‘I’m not stopping now, we’re just getting warmed up,’ she declared to a packed crowd with many gay and lesbian supporters in the city of Wilton Manors. ‘We’re not going to be distracted, no matter what our opponents throw at us.’ Donald Trump delivered a swift kick to disgraced former Democratic congressman Weiner on Sunday, thanking him for preserving the emails that could bring Clinton down.\""}, "time": 1742562735.0535095}