{"duration": 0.026704072952270508, "input_args": {"text": "'White House foreign policy adviser Dr. Sebastian Gorka won loud applause from the audience at the annual Jerusalem Post conference in New York on Sunday with a strident defense of his record and the Trump administration’s policies. [Gorka, who followed Israeli opposition leader Isaac Herzog and World Jewish Congress president Ronald S. Lauder, was interviewed onstage by the Post‘s    Yaakov Katz.  Katz did not waste time before jumping into the most controversial issues, questioning Gorka about rumors  —   spread largely by   blogs and websites  —   of his membership in an   Hungarian order. Gorka denied those reports, noting his father’s efforts to protect Jews from the Nazis, and his own lifelong struggle against totalitarian ideologies. He noted that he was “proud” to wear a medal his father had won from the   Vitezi Rend order for his anticommunist activism, adding that the new order had nothing to do with its   predecessor, which was disbanded after the Second World War. At the @Jerusalem_Post #Jpost17 conference @SebGorka “I have spent my life fighting against totalitarian ideologies”https:  .   —   Seth Frantzman (@sfrantzman) May 7, 2017,  Gorka pointed out that Israel’s Holocaust memorial, Yad Vashem, had honored one of the members of the Vitezi Rend as one of the “Righteous Among the Nations” for saving Jews during the Holocaust. And he noted that he had long been an advocate for Jews and for Israel, noting that even those publications that had set out to destroy him found no evidence of any antisemitic statements. In addition Gorka dismissed reports that he was leaving the administration as “very fake news,” and downplayed media speculation about infighting in the White House, describing all of the different advisers to the president as “patriots. ” Tragic that a decent man has to respond to such libel. Crowd here at #jpost17 seemed to appreciate that  gave @SebGorka a standing ovation. https:  .   —   Jeff Ballabon (@ballabon) May 7, 2017, From there, the discussion moved into foreign policy, with Gorka emphasizing the Trump administration’s commitment to Israel’s security, as well as to the peace process. He also defended the administration’s tough line on radical Islam, criticizing President Barack Obama’s administration for avoiding the religious inspiration of terrorists and for “leading from behind”  —   which, he noted, was “following,” in plain English. Asked whether he, and the administration as a whole, were Islamophobic, Gorka pointed out that many of the U. S. military personnel he had instructed in   were Muslims, and noted that America’s Arab allies saw the struggle as one within Islam, not against Islam as a whole. He stressed the importance of helping Muslims win the war against radical Islamic terror, but without invading and occupying foreign countries. #Gorka: Trump understands the Islamic terror threat and he will obliterate it. #Jpost17,  —   David Brinn (@davidbjpost) May 7, 2017,   He noted that many of the administration’s toughest critics were people aligned with the   “boycott, divestment, and sanctions” (BDS) movement, as well as supporters of the Iran deal. Gorka’s critics seemed mostly reduced to fuming at the Jerusalem Post on Twitter. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628309.695749}