{"duration": 0.057280540466308594, "input_args": {"text": "'A new study found that 52% of roadside accidents involved drivers distracted by their phones. [Apparently, being in sole control of one of the   aluminum shells hurtling at high speed on America’s roads isn’t enough to hold drivers’ attention. Traffic deaths have jumped by 14% since 2014, according to Cambridge Mobile Telematics, which conducted the study. The research firm found that 52% of accidents involved drivers who were distracted by their phones.    phone use while driving laws have done little to curb the habits of its citizens. Only fourteen states have banned handheld use of phones while driving, and only twenty prohibit phone use by school bus drivers a single state bans bus drivers from texting. But Cambridge Mobile Telematics’ Chief Technology Officer, Hari Balakrishnan, has hope: Distracted driving due to smartphone use is intuitively blamed for the increase in road crashes and claims. What’s less intuitive is that smartphones hold the solution to the problem they created. Drivers now have access to tools that analyze their driving and achieve real behavioral change through immediate and ongoing feedback. Balakrishnan called distracted driving “one of the most urgent public safety problems facing our communities today” and stressed the importance of taking a “critical look at how we can most effectively reduce the danger that drivers face. ” CMT is working to do their part. Their DriveWell app both monitors drivers and encourages safer driving habits. The site claims that “users see an average reduction of 35% in phone distraction, 20% in hard braking, and 20% in   speeding all within less than 30 days of using the program. ” Their goals are best summed up by Balakrishnan himself: “By harnessing the very technology that threatens driver safety, and using it to help drivers understand and improve their behavior, we’re making the world safer by the day. ” Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742561628.3285673}