{"duration": 0.21449494361877441, "input_args": {"text": "'■   Donald J. Trump soaked in the cheers at the opening concert as the inaugural festivities began. ■ But in downtown Washington, D. C.   revelers had to share the streets with adamant   protesters. ■ Never fear, though. Mr. Trump says his high I. Q. cabinet will unify the nation. The opening concert of the long inaugural    was the stuff of legend  —   acts came, followed by protests, followed by withdrawals. Names were floated, like Elton John and Charlotte Church, only to have the artists publicly rebuke the invitation. But when it all finally came together, a beaming Mr. Trump stood at the foot of the Lincoln Memorial on Thursday night, basking in the applause from thousands of concertgoers and vowing to “unify our country. ” “But we’re going to make America great for all of our people,” the   told the crowd. “That includes the inner cities, that includes everybody. ” Just hours before he was to be sworn in, Mr. Trump still recalled grievances from the campaign. “The polls started going up, up, up, but they didn’t want to give us credit,” he said. But he also turned his attention to the future, promising to work hard and saying he was looking forward to Friday. A tableau of Trumps  —   including the incoming first lady, Melania Trump, Mr. Trump’s grown children and their spouses, and his grandchildren  —   then stood triumphantly at the top of the steps, framed by marble and under the gaze of the nation’s 16th president. Fireworks concluded the “Make America Great Again” concert, which featured Toby Keith and 3 Doors Down. The next president of the United States has a way with words, so let’s just let him talk. At Washington’s Union Station on Thursday night, he greeted honored guests. To Jared Kushner, his    and adviser, he said, “If you can’t produce peace in the Middle East, nobody can. ” To his White House chief of staff, Reince Priebus, he commented, “Nobody knew how to pronounce his name. It’s a crazy name. ” The   added, “Reince was taking tremendous abuse because he went through hell. ” Then it was on to his   campaign, in 2020: “The next time, four years from now, the next time we’re going to win the   way, we’re going to win because we did so well, because it was so overwhelming, the thing that we did, because it was so beautiful. ” On that last point, it was not clear how he was implying he won in 2016: Russian interference? Losing the popular tally by nearly three million votes? As for Inauguration Day, Mr. Trump saw a silver lining in the forecast rain. “If it really pours tomorrow, that’s O. K.,” he said, “because people will realize it’s my real hair. ” The inaugural kickoff celebration on the National Mall had been a subdued affair without protests, but at least one of the inaugural balls organized by Mr. Trump’s supporters has drawn protesters. The DeploraBall, a cocktail party organized by supporters of Mr. Trump and held at the National Press Club, drew several hundred protesters crowded into a city block, chanting and waving signs denouncing the incoming Trump administration. Sarko Sarkodie, a    Washington resident, was part of the crowd. “I’m just part of the resistance efforts that have been happening this week,” Ms. Sarkodie said. “And they’ll be happening over the next four years. ” Trump supporters seemed to be staying away from the event, but several people watched the scene from inside a nearby bar, where a man wearing a Trump flag and Trump sweatpants could be seen embracing friends. ”That’s a brave dude, right there,” a bystander said of the man. Several people wandered through the area in gowns, seemingly dismayed when they turned the corner to encounter the protests. But perennial presidential candidate and kid favorite Vermin Supreme made it to the show. At the Smithsonian’s National Museum of African American History and Culture, a throng of people in   ball gowns, dashikis, tuxedos and silk headscarves flocked to the   Peace Ball: Voices of Hope and Resistance. “I guess I was just looking for something to put my energy into and to give Obama a really good ” said Pavy Bacon, a    Maryland resident, about why she bought a ticket to the ball. “If you really appreciate what Obama has done, you can’t help but be fearful of the next administration. ” The event, which was in the works before Election Day, was not envisioned as an   affair. Anas “Andy” Shallal, an   artist and activist who owns the popular D. C.  bookstore cafe chain Busboys and Poets, dreamed up the party as the ultimate celebration of the progress made under President Obama. But as inauguration day drew closer, Peace Ball became a place for liberals to converge and comfort themselves. John Osborne, a    lawyer from Washington, D. C. perused the   exhibits with his wife and said he came because  —   on the eve of the inauguration  —   he wanted to surround himself with people from all races, religions and backgrounds. “I wanted to be in a place that reflects the America that I see and live everyday,” he said. “I’m hopeful that our country will remain that way. ” Expected guests included the actor Danny Glover, the   artist Solange Knowles,   Grammy winning jazz musician Esperanza Spalding, the   author Alice Walker and CNN pundit Van Jones. Before the official festivities began, Mr. Trump appeared at a luncheon with supporters at the Trump International Hotel, where he praised the collective I. Q. of his cabinet members. “We have by far the highest I. Q. of any cabinet ever assembled,” Mr. Trump said in the remarks, which reporters heard only the first several minutes of before being escorted out. Of course, he put himself into the high I. Q. category when he boasted, “This is a gorgeous room. A total genius must have built this place. ” (As an aside, it is impossible to do the math, but President Obama’s starters did include a Nobel laureate in physics at the Energy Department, a former president of Harvard heading the National Economic Council and the president of the New York Federal Reserve Bank as Treasury secretary.) Mr. Trump also singled out specific supporters, including Woody Johnson, the owner of the New York Jets football team, and his pick for Treasury secretary, Steven Mnuchin. Mr. Mnuchin, Mr. Trump noted, wasn’t at the lunch because he was being “grilled” at his Senate confirmation hearing several blocks away. Mr. Trump also faulted senators for not being “nice” to Representative Tom Price of Georgia, his pick to be the health and human services secretary. And speaking of Mr. Johnson, the Jets owner is expected to get one of the plum jobs in diplomacy, the United States ambassador to Britain, or as the Brits call it, ambassador of the United States to the Court of St. James’s. Mr. Johnson is only the fourth ambassador to be announced by Mr. Trump, after Nikki Haley as ambassador to the United Nations David Friedman, his longtime attorney, as ambassador to Israel and Iowa Gov. Terry Branstad as ambassador to China. Given that both Mr. Trump and his British counterpart, Prime Minister Theresa May, are relatively new in their roles, Mr. Johnson’s ability to get Mr. Trump on the phone quickly could be helpful. At   this year, the Jets weren’t the best. The   and vice   laid a wreath at the Tomb of the Unknowns at Arlington National Cemetery. Then it was on to the Lincoln Memorial for the concert that opens the Inaugural festivities. Eric Huppert, the leader of Defenders of Liberty Motorcycle Club and local organizer of Bikers for Trump, stood beside a row of hulking   Harley Davidsons and said he was not looking for violence. Sure, Chris Cox, the founder of Bikers for Trump, had pledged that his members would act as a “wall of meat” to block   protesters, but Mr. Huppert downplayed all that. “I don’t anticipate any skirmishes  —   at least I hope not,” he said. But if the safety of Mr. Trump’s supporters  —   or even the   himself  —   is jeopardized, he added, “I think these folks will be willing to jump in if necessary. ” A security force beholden to no one with no rules of engagement and no real marching orders is, well, not a great idea. But Bikers for Trump stand by their man. David Nichols traveled from Texarkana, Tex. with seven others to attend the Bikers for Trump rally on Inauguration Day. The group drove for 22 hours straight, towing eight bikes on a   trailer. “He’ll be a fine president  —   he just has to calm down his words,” Mr. Nichols said. “Just don’t bash people’s name too much. ” A day before Mr. Trump is to be sworn in as the 45th president of the United States, he took to Twitter to assert that he is not responsible for the nation’s divisions. His champion? The Rev. Franklin Graham. To some, Mr. Graham’s good wishes may not hold much weight. Last month on Facebook, he decried House Speaker Paul D. Ryan’s failure to join him and the   in ending all Muslim immigration “until we can properly vet them or until the war with Islam is over. ” He castigated Representative William Lacy Clay, Democrat of Missouri, for defending a high school student’s artwork depicting a confrontation between citizens and police, depicted as pigs. And last year, Mr. Graham said of gays, “you cannot stay gay and continue to call yourself a Christian. ”'"}, "time": 1742563333.7076693}