{"duration": 0.06691217422485352, "input_args": {"text": "'India Bans Cash, Now Gold?   16, 2016 \\nIndia gold import ban rumored … The Indian Bullion and Jewellers Association has warned members of a potential gold import ban … The association told Indian media the move could come by March 31 as part of the government’s ‘black money’ crackdown. –Mining Journal \\nPrime minister Narendra Modi recently decided to confiscate the cash of hundreds of millions of Indians, and now he may forbid Indians from importing gold. \\nThis would have an immediate effect on gold supplies as India, despite the affinity of citizens for gold and silver, has very little in the way of domestic mining. \\nIn part, this is because the government itself is consistently at war with Indian citizens over money and its control. This struggle has most recently manifested itself in India’s decision to remove, wholesale, large denomination bills from public circulation. \\nMore: \\nThe country [banned] 500 and 1000 rupee notes (worth about US$7 and $14 respectively) and the mooted import restriction [banning gold imports] could be a reaction to dealers swapping the notes for gold. \\nIBJA national secretary Surendra Mehta told the Times of India its members should be ready. “We hear from certain circles of this possibility, though nothing official is out yet,” he said. \\nThe larger issue here has to do with banning cash on a global level. It is typical of reporting in this modern era that few if any of the mainstream articles covering India’s most recent move seemingly mention this. \\nGovernments around the world are beginning to ban cash. Sweden is far advanced but Uruguay and now India are not far behind. Uruguay is soon to demand that employers cease to pay employees via cash and instead deposit paychecks directly in bank accounts. \\nMost recently in Australia, Citibank announced it would no longer deal in cash because most depositors did not wish to be “bothered.” \\nWe are told these are disparate and individual decisions of various entities and nation states. But they are nothing of the sort. Once again, surreptitiously, the banking elites that want to run the world are surely organizing a pan-global stratagem to advance their control. \\nIf everyone’s cash is controlled, further technocratic globalization of society on a worldwide scale becomes increasingly feasible. \\nThe ongoing implementation of a global cash ban has taken on increased urgency because of growing negative interest rates worldwide. People don’t want to pay banks to hold their cash and are thus withdrawing it. The solution? Ban cash outright. \\nIt wasn’t clear whether this sociopathic endeavor was going to apply to gold, but India’s apparent determination to attack the yellow metal as well as cash seems to give us a clear answer. \\nAs the attacks on wealth increase, any monetary element not immediately available digitally will come under scrutiny and eventually be targeted with demands for confiscation. \\nConclusion: These emergent attacks certainly illustrate a growing elite desperation to take control, worldwide, sooner rather than later.'"}, "time": 1742562104.6213224}