{"duration": 0.11356711387634277, "input_args": {"text": "'By Sean Colarossi on Mon, Oct 31st, 2016 at 7:56 pm CNN has obtained audio of North Carolina GOP Senator Richard Burr joking about gun owners putting a \"bullseye\" on Hillary Clinton. Share on Twitter Print This Post \\nCNN has obtained brand new audio of North Carolina Republican Senator Richard Burr joking about gun owners putting a “bullseye” on Hillary Clinton. \\nThe despicable comments come as Burr faces a close Senate race against Democratic opponent Deborah Ross. Both candidates are within a point of each other, according to RealClearPolitics. \\nMore of the CNN report : \\nThe North Carolina Republican, locked in a tight race for reelection, quipped that as he walked into a gun shop “nothing made me feel better” than seeing a magazine about rifles “with a picture of Hillary Clinton on the front of it.” \\n“I was a little bit shocked at that — it didn’t have a bullseye on it,” he said Saturday to GOP volunteers, prompting laughter from the crowd in Mooresville, North Carolina. “But on the bottom right (of the magazine), it had everybody for federal office in this particular state that they should vote for. So let me assure you, there’s an army of support out there right now for our candidates.” \\nThis type of rhetoric is hardly uncommon when it comes to Republican leaders in 2016. As the campaign has gone on, the hateful and violent rhetoric, particularly from the man at the top of the Republican ticket, has become increasingly worse. \\nAt one point this year, Donald Trump suggested that “Second Amendment people” should take up arms against Clinton if she nominates a Supreme Court justices they don’t like. He also said that he’d like to “see what happens” if the Democratic nominee’s bodyguards were disarmed. \\nAs CNN notes, Trump has never issued a genuine apology for his dangerous language – or anything he’s ever said or done – but Burr quickly came out with a statement once the audio was revealed, although it does not excuse what he said. \\n“The comment I made was inappropriate, and I apologize for it,” the Republican senator said, according to CNN. \\nThis type of imagery has no place in our politics, regardless of whether it’s being said in public or private, especially given the heightened level of anger and hatred toward Hillary Clinton from Trump supporters. \\nWhether it’s Trump or Burr, voters should remember their irresponsible language when they go to vote in just one week.'"}, "time": 1742563774.2002616}