{"duration": 0.09734392166137695, "input_args": {"text": "'Cisco Oracle \\nAnd this is what Moody’s has to say about Apple’s wondrous cash hoard, much of it overseas: \\nBased on Apple’s reported results for its fiscal year that ended in September, Moody’s projects the company’s cash will exceed $250 billion by the end of calendar 2016, representing over 14% of total non-financial corporate cash. \\nAnd then it dives straight into tax lobbying, in behalf of its clients, directed straight at Congress: \\n“Without tax reform that reduces the negative financial consequences of repatriating money to the US, we expect offshore cash levels to continue increasing,” said Richard Lane, a Senior Vice President at Moody’s. \\nThe financial media jumped on the bandwagon and quoted this falsehood for mass consumption in order to pressure Congress to give our multinational corporate heroes another opportunity to dodge taxes, on top of the countless opportunities already written into the tax code for them that small businesses don’t have access to. \\nBut here’s the thing. In May 2013, Apple got into a pickle because it had decided to fund its stock-buy-back and dividend program by taking on a record $17 billion in debt rather than “repatriating” part of its “offshore” cash and paying income taxes on it. \\nThe Senate subcommittee investigation and hearings, chaired by Senator John McCain , showed that Apple had sheltered at least $74 billion from US income taxes between 2009 and 2012 by using a “complex web” of offshore mailbox companies. The investigation found untaxed “offshore” profits of $102 billion held by Irish subsidiaries – which Apple refused to “repatriate” in order to keep that income from being taxed in the US. \\nBut according to the Senate report, Apple doesn’t have to repatriate that moolah because it’s already in the US. The Irish mailbox subsidiaries, on whose books this money is for tax purposes, transferred it to Apple’s bank accounts in New York. The money is managed by an Apple subsidiary in Reno, Nevada, and is invested in all kinds of assets in the US. Apple’s accountants in Austin, Texas, keep the books, \\nMoney doesn’t stop at borders. Tax accounting does. \\nThese revelations explained another corporate mystery that had long baffled economists. In 2004, after heavy lobbying by our Corporate Titans, Congress declared a “repatriation holiday” to encourage the “return” of $300 billion in overseas cash to be invested in the US. This would cause a burst of investment and hiring in the US, it was said. This was similar to what Moody’s is now clamoring for on behalf of its clients, except this time, they want permanent tax reform rather than a one-time “repatriation holiday.” \\nSo in 2004, our heroes made some adjustments on their books to “repatriate” these profits that were then taxed at the special and minuscule rate of 5.25%, less than the payroll taxes withheld from their US working stiffs. \\nAnd then nothing happened. There were no investments and no hiring and no benefits for the economy because the money had already been deployed in the US, as we now know. In May 2013, as a result of the Senate hearings, the New York Times summarized the 2004 phenomenon this way: \\nOn the contrary, some of the companies that brought back the most money laid off thousands of workers, and a study by the National Bureau of Economic Research later concluded that 92 cents on every dollar was used for dividends, stock buybacks or executive bonuses. \\nThis sort of “repatriation holiday” or tax reform would simply be a handout benefitting our Corporate Titans, but not the millions of smaller companies that don’t have the resources to lobby Congress, make special deals with foreign governments, and create that “complex web” of offshore mailbox companies. They’re too busy struggling on a daily basis in their dog-eat-dog world. \\nSubcommittee Chairman John McCain thundered in his opening statement of the hearings that it was “unacceptable that corporations like Apple are able to exploit tax loopholes to avoid paying billions in taxes.” Since then, nothing happened in Congress. The loophole wasn’t closed. And the falsehoods that had been stabbed many times during the hearings have once again risen to shine in even greater glory, with Moody’s adding some additional sparkle. \\nHot air keeps hissing out of IPOs. Read… What the Heck’s Wrong with This Market? Biggest IPO of the Year Sags to New Low 0 0 0 0 0 0'"}, "time": 1742563224.7406836}