{"duration": 0.10647845268249512, "input_args": {"text": "'Friday, 4 November 2016 There Are Bones Beneath That Meat \\nA Gulfport Mississippi attorney who said he choked on the bones in Popeyes\\' fried chicken last year believes a warning label placed on the bones beneath the meat could have prevented all his anxiety, pain and suffering. Now he\\'s suing to get warning labels affixed to all Popeye\\'s chicken bones and monetary compensation for himself. \\nAttorney Pawl Newton, said he got the idea for the lawsuit when he drove through the drive-thru in Gulfport in November 2015. \\nAccording to the lawsuit filed this week, Newton bought one chicken breast. He was given salt and pepper. Newton then drove to his nearby lair and started eating. \\n\"Because Newton\\'s order did not include warning labels on the bones beneath the layers of meat, plaintiff Newton held a chicken breast in his hands and tore off pieces of meat thereof with his canines, eating them until reaching the bones which he then also ate since there were no labels on the bones warning him not to eat them as well,\" the lawsuit states. \\nThat\\'s when Newton then started to choke on a piece of the chicken bone. The lawsuit said he had to undergo emergency surgery at Memorial Hospital to remove it and some gall from his throat. \\nNewton is suing Popeyes and the parking lot paving company which facilitated his vehicle entry to the drive-through to pay for all his medical expenses, compensate him for his pain and suffering, and award punitive damages. He also wants all future Popeyes\\' chicken bones to be labeled \\'Not For Human Consumption\\' so customers will be able to safely eat their chicken again.\" \\n\"If you choke on your chicken and you have to get the chicken removed from your throat, it\\'s not because Popeyes didn\\'t apply a warning label to the bones,\" former employee Cory Tokes said. \"Maybe you should have sense enough to stop eating when you get to the bones. Nobody eats chicken bones. What a dumbshyster.\" \\nJacque Tokes is equally perplexed about the suit. \\n\"Commonsense tells us about how much to bite and not to put bones in our mouths to keep us from choking on our chicken or we would all be dead already,\" added Stokes. \\nA Popeye\\'s press release says that its legal team has initiated legal actions against the Missippi Bar Association for giving Newton a law/liquor license and against Newton\\'s mother\\'s birth control provider. Make Winston Smith\\'s  '"}, "time": 1742562897.4318407}