{"duration": 0.08874273300170898, "input_args": {"text": "'WASHINGTON  —   President Obama had “an intense conversation” with President Vladimir V. Putin of Russia on Monday in which he expressed concern on the eve of his visit to the Middle East and Europe about the fragile Syrian peace talks and increased violence in Ukraine, White House officials said. In a strongly worded statement, the White House said that Mr. Obama had urged Mr. Putin to use his influence with President Bashar   of Syria to press him to stop attacks against opposition forces and abide by his commitment to a partial  . The   cessation of hostilities, brokered by Russia and the United States in February, has shown signs of crumbling in recent days, with increasing ground clashes and airstrikes. Syrian government forces have been mounting an offensive near the northern city of Aleppo, while rebel groups have reportedly made advances against government positions in the areas of Latakia in the north and Hama in the center of the country. A statement released by the office of Mr. Putin said he had stressed the need for moderate opposition leaders in Syria to distance themselves from the Islamic State and other extremist groups. On Monday, efforts to negotiate a political settlement to the   conflict grew more difficult when opposition representatives pulled out of formal talks in Geneva. The United Nations special envoy for Syria, Staffan de Mistura, said that the opposition High Negotiating Committee had told him that it was suspending its participation because of the surge in fighting and a decline in deliveries of humanitarian aid. “Since these talks began in Geneva, the Assad regime has worsened the situation on the ground,” Salem   a spokesman for the opposition coalition, said in a statement. “The progress in Geneva is directly connected to the realities faced by our people in Syria. If the ground situation is not improved, it will affect the advancement of the political process. ” Josh Earnest, the White House press secretary, said that while the call between Mr. Obama and Mr. Putin was “intense,” there was not an impasse between them over Syria. “It’s an opportunity for the president to, once again, make the case to President Putin that he should use his influence with the Assad regime to live up to the commitments that they’ve made in the context of the cessation of hostilities,” Mr. Earnest told reporters. For Mr. Obama, the phone call with Mr. Putin offered a chance before his arrival in Saudi Arabia on Wednesday to demonstrate his resolve in moving toward a political solution in Syria. Mr. Obama is expected to urge Saudi Arabia and other Persian Gulf nations to renew their focus on helping to end the Syria conflict and fight the Islamic State. Last week, Rob Malley, the president’s top Middle East adviser, said in a briefing for reporters that the   “has held so far,” adding that “we’re far from having achieved the goals that we set, but the trend line is positive. ” Mr. Obama’s call with Mr. Putin appears to have been less optimistic. In describing the exchange, Mr. Earnest cast blame on Mr. Assad, saying that “unfortunately, we’ve seen that the cessation of hostilities continues to be fragile and increasingly threatened due to continued violations by the regime. ” The statement from the Kremlin said that the two leaders had “reiterated their commitment to strengthening the ” and that “additional measures will be put in place for rapid response to violations of the  . ” The latest round of indirect talks in Geneva, the third so far, began last week and had been focused on a political transition. Extremist groups like the Islamic State and the   Nusra Front are not included. Mr. de Mistura, the United Nations special envoy, told journalists that the peace process would continue and that opposition negotiators would stay in Geneva for “technical discussions. ” He said that on Friday he would take stock of the prospects for continuing the talks, adding that “ups and downs” in the peace process were to be expected. Mr. de Mistura said there was hope that aid convoys would be able to head for besieged areas. In the political talks, though, “the gap is clearly wide,” he said. Opposition negotiators flatly rejected an idea floated by Mr. de Mistura on Friday that would allow Mr. Assad to remain as president, with three vice presidents nominated by the opposition. The coalition representatives have insisted that any transitional government exclude Mr. Assad. During the phone call on Monday, Mr. Obama and Mr. Putin also discussed the situation in Ukraine, where fighting has continued between government troops and   separatists. A   in Ukraine has reduced the violence, but a political resolution, known as the Minsk agreement, has yet to be fully put in place. Mr. Obama is also traveling this week to Britain and Germany, where the situation in Ukraine is expected to top a list of European challenges he will discuss. The president urged Mr. Putin to end what the White House called a “significant uptick in fighting” in eastern Ukraine, along the border with Russia. The Kremlin said that Mr. Putin had told Mr. Obama that he hoped the Ukrainian government would “finally start taking concrete steps towards implementing the Minsk agreements of Feb. 12, 2015. ”'"}, "time": 1742563586.4119382}