{"duration": 0.15709328651428223, "input_args": {"text": "'Clinton Cash author and Breitbart News Senior    Peter Schweizer joined SiriusXM host Alex Marlow on Tuesday’s Breitbart News Daily for what Marlow described as a “victory lap” over the demise of the Clinton Global Initiative, whose questionable activities featured so prominently in Schweizer’s book. [Marlow saluted the work done by Schweizer and his Government Accountability Institute as “some of the most essential reporting of the 2016 election,” and said they collected a “major scalp” this week with the end of the CGI.  “Thank you, Alex. Certainly Breitbart was right there. I cannot imagine how many stories —  it’s got to be north of a hundred stories on Clinton corruption —  played an essential role,” Schweizer said. He said the shutdown of the Clinton Global Initiative was a “remarkable event,” because “the Clintons have essentially made it so obvious that there’s a connection between this   charitable activity, CGI, and their political fortunes. ” Schweizer went on: They didn’t even wait until the election was a distant memory to say, you know what, we’re going to wrap this up. They ended it immediately. I think it’s just further confirmation to what we always believed, which is that their charitable activities really were directly linked to their political power, and now that that political power is gone, really honestly for the first time in 25 years  —   think about that  —   25 years the Clintons have been on the national political stage. They’re gone, and they’re essentially saying, ‘Look, there’s no need or purpose behind doing this charitable work, so we’re just going to shut it down.’ It’s a pretty remarkable step on their part. Schweizer chuckled at Marlow’s suggestion that the Clintons should have kept their organization running for a little while, with a few   boasts about how it was “stronger than ever,” just to maintain appearances. He said: No, they just rolled it up, and you’re exactly right, they didn’t pretend. In a matter of weeks from the election results —  it’s pretty stunning. I think we’ve also now got the Clinton Foundation itself, which is involved with CGI obviously, but they’re essentially separate entities. Their donations are way off. They’ve got a lot of foreign donations, the government of Australia for example, and Germany, who are essentially saying, ‘We’re not going to donate any more.’ Donations are down by some accounts by 70%. So it may be that the Clinton Foundation goes the way of CGI. “Or it could be, which I think is probably more likely —  I just can’t imagine them completely folding up their tent —  I think it will be sort of a shadow of its former self, maybe   the size of what it once was,” he ventured. “Because let’s face it, what we talked about has been confirmed by the Podesta emails, it’s been confirmed by these events: if they can’t sell access to political power, they just don’t have a product, in the form of their form of philanthropy, that people want to donate to. ”  “That presents an essential problem. That means they have to seek some office somewhere so they can still sell access. Does Chelsea now have to bring the next generation forth, so they can continue with this political apparatus? There’s a lot of talk of that, that Chelsea’s going to run for Congress, potentially in two years,” Schweizer noted. He expressed some appreciation for the difficult road Chelsea Clinton has walked, pointing out that the leaked emails from Clinton campaign chief John Podesta portrayed her as one of the few   people in the Clinton Foundation who realized something fishy was going on, and called for extensive audits. “Bill and Hillary were fine with what was going on, the aides around them were fine. It was really Chelsea who was pushing this reform agenda. So I give her credit for that,” Schweizer said, before going on to agree with Marlow that she lacks the “presence” for a successful political career, even from a   Manhattan precinct controlled by the Democrat machine. “You’ve still got to show you’ve got the chops to actually get things done for your district in Congress  …     that you have a certain innate strength and an ability to perform. I don’t think the celebrity is going to be enough,” he judged. “She’s going to have to prove that. ” He said Chelsea Clinton’s only guaranteed campaign asset would be “a lot of money, because the Clinton financial network is there. ” “Hillary Clinton did not win in November, but remember, Alex, they raised a lot of money for that race,” Schweizer pointed out. “Their ability to raise a lot of money for Chelsea I don’t think should be underestimated. ” He said that beyond vague hopes of launching Chelsea’s political career, it remained a “great mystery” where the Clintons would go from here. Schweizer pointed out: Really since 1992, they have been part of the national conversation. Bill ran for President, he said you’re getting two for one, so he made it clear immediately that Hillary was going to be a political player as well. They leave the White House just as Hillary enters the U. S. Senate. She then runs for president in 2008 and loses. She then becomes Secretary of State. And other than this window between January of 2013, up until she announced her campaign in 2015, they have been in political office with political power. I think it’s very hard to give that up, once you’ve had it. Schweizer said he doubted Hillary Clinton would try another presidential run in 2020, and that even “people in the echo chamber around them” would point out her advancing age and weakness on the campaign trail in 2016. He also suggested there was resentment of Clinton within the Democratic Party itself.  “We know they had the election wired against Bernie Sanders. We know they’ve got a lot of allies. But there is a lot of bubbling resentment among the Democratic grassroots that the Clintons need to go. They had their turn, they had their chance. A lot of Democrats are convinced that if they just had a different candidate, they could have beat Donald Trump. I don’t think that’s true, but I think there’s a lot of that thought out there,” he said. Schweizer predicted: So they may be thinking about some run for higher office again, but I just don’t think the Democratic Party is the same party of the 1990s. I think we’re going to see them —  probably kicking and screaming —  fade into history. I just don’t see this as a dynasty like the Bush dynasty, for example, where you’ve got a sort of    generation that can potentially run for national office. The Clintons just simply don’t have that, and I think we’re going to see them fade into history, essentially. As for his own future plans, Schweizer said he was “cautiously optimistic” about government ethics under the new administration, although he noted he pushed hard for   Trump to fully divest his assets, a path he chose not to pursue. “In that sense I’m disappointed, but really, honestly Alex, when you look what he has done, he has gone far beyond what I believe the legal requirements were for him to do. So I give him a lot of credit for that,” he said. Schweizer asked of Trump’s children and associates: I think really now it’s going to come down to that whole issue of performance. How do they handle these issues?’ If the kids are offered a sweetheart deal, if they have a chance to do something and think that it can go undetected, are they going to be tempted, or are they going to take that deal? That’s really what it comes down to. You can set up all kinds of structures, you can say all kinds of things, but as we’ve seen in the past with other presidents, people when they want to make a buck at the public’s expense, they’re going to find a quick way around it. “So I count myself right now cautiously optimistic. I love the Trump message of ‘drain the swamp.’ I think there’s some very serious things that he is looking at, that could get bipartisan support, to work to drain the swamp. If for no other reason, think about this: Donald Trump is the first candidate, I would have to say going back more than 30 years if not longer, who is not really beholden to the money class in Washington D. C. The lobbyists, the PACs —  they didn’t give him money, so he doesn’t feel like he owes them anything,” Schweizer said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742561826.890939}