{"duration": 0.06319475173950195, "input_args": {"text": "'Comments \\nFOX News star Megyn Kelly has finally revealed the disturbing details of the abuse and harrassment she endured at the right-wing propaganda factory. Serial sexual predator and fascist ideologue Roger Ailes lost his job as the CEO of FOX News a few months ago after anchor Gretchen Carlson publicly accused her old boss of sexually harassing her and using his position to try to extort sexual favors from her. \\nAs the male stars of the network rushed to defend Ailes and over a dozen women came forward to share their own stories, Kelly stayed silent – for a time. Now, she’s adding material to her upcoming memoir detailing how Ailes harassed her and threatened her job : \\n“Roger began pushing the limits. There was a pattern to his behavior. I would be called into Roger’s office, he would shut the door, and over the next hour or two, he would engage in a kind of cat-and-mouse game with me—veering between obviously inappropriate sexually charged comments (e.g. about the ‘very sexy bras’ I must have and how he’d like to see me in them) and legitimate professional advice.” \\nKelly also claims Ailes offered to promote her through the ranks “in exchange for sexual favors.” At one point, she writes, he “crossed a new line—trying to grab me repeatedly and kiss me on the lips.” Upon her rebuffing his advances, she recalls, “he asked me an ominous question: ‘When is your contract up?’ And then, for the third time, he tried to kiss me.” \\nAfter Ailes was fired (with a $40 million severance package!), he almost immediately joined the presidential campaign of fellow serial sexual predator Donald Trump. \\nThe fall of Ailes and the backlash surrounding Donald Trump’s “hot mic” audio comments in which he admits to sexual assault have brought the issue of sexual harassment and the ways in which powerful white men abuse women in the workplace into the forefront of the public eye. \\nMen like Ailes and Trump have gotten away with their crimes for far too long; women have been forced to suffer in silence, forced to choose between their dignity and agency over their own bodies or their careers and financial well-being – a choice nobody should have to make. The more women that come forward to tell their stories, the more will follow – and hopefully we can someday geld the toxic patriarchy which silences women and allows predators to roam free.'"}, "time": 1742562923.0223207}