{"duration": 0.044864654541015625, "input_args": {"text": "'Email \\nGet ready for the most heartwarming story you’ll read all day. \\nIf you met Paul Langdon or Ayesha Qamar on the street, you might think they have nothing in common. Paul is a retired firefighter, Ayesha is a law student. Paul has lived in the same suburb of Columbus for his entire life, Ayesha immigrated to Ohio from Pakistan when she was a teen. Paul is a devout Christian, Ayesha is Muslim. But if you dig a little deeper, you’ll find that they share a common bond: Both Paul and Ayesha have ‘Trump’ painted on their garages! \\nBeautiful! Take a look at the side-by-side pictures above to see just how similar these two really are. \\nWhen Donald Trump announced his campaign last summer, Paul knew he wanted to show his support by painting a large sign of the candidate’s name on his garage door. But Paul probably never would have guessed that one year later, just a few towns over from him, Ayesha’s own garage would be painted with literally the exact same word! Paul and Ayesha may be from totally different walks of life, but when it comes to the name currently painted on their garages, these two have more in common than they ever could have imagined. \\nAt the end of the day, it doesn’t matter whether their skin is white or brown. It doesn’t matter whether they worship God or Allah. And it doesn’t matter whether the word ‘Trump’ has been carefully lettered or hastily scrawled across the garage in brusque spray paint. All that matters is the commonality they share in having the word ‘Trump’ painted on their homes for the entire neighborhood to see. \\nAmazing! It just goes to show, you should never judge a book by its cover. \\nAt a time when our country feels so divided, stories like this one give us hope for humanity. On the surface, Paul and Ayesha couldn’t be more different, but the messages painted or spray-painted across their garages are one in the same. What an amazing reminder that we’re not so different after all!'"}, "time": 1742562168.82672}