{"duration": 0.11779665946960449, "input_args": {"text": "'Mon, 24 Oct 2016 14:18 UTC © Matthew Jacobs Begonia species adapted to deep-shade conditions display blue leaf iridescence, a striking form of structural color originating from specialized chloroplasts in the epidermis. There\\'s a very good reason for this plant\\'s iridescent color. In the fading twilight on the rainforest floor, a plant\\'s leaves glimmer iridescent blue. And now scientists know why. These exotic blue leaves pull more energy out of dim light than ordinary leaves because of an odd trick of quantum mechanics. A team of plant scientists led by Heather Whitney of the University of Bristol in the U.K. has just discovered the remarkable origin and purpose of the shiny cobalt leaves on the Malaysian tropical plant Begonia pavonina . The plant owes its glimmer to its peculiar machinery for photosynthesis, the process plants use to turn light into chemical energy. Strangely enough, these blue leaves can squeeze more energy out of the red-green light that reaches the eternally dim rainforest floor. Whitney and her colleagues describe the blue leaves today in the journal Nature Plants . \"It\\'s actually quite brilliant. Plants have to cope with every obstacle that\\'s thrown at them without running away. Here we see evidence of a plant that\\'s actually evolved to physically manipulate the little light it receives,\" says Whitney, \"it\\'s quite amazing, and was an absolutely surprising discovery.\" Slowing Down Light © Matthew Jacobs Begonia species adapted to deep-shade conditions display blue leaf iridescence, a striking form of structural color originating from specialized chloroplasts in the epidermis. These \\'iridoplasts\\' contain highly-ordered grana whose arrangement enhances absorption Whitney and her colleagues made their fascinating discovery by working with a lab-grown crossbreed of two species of the the Begonia plant. The scientists couldn\\'t simply use the native species found in the darkness of the Malaysian jungle, she says. It\\'s absurdly delicate, grows slowly, and withers under anything less than perfect growing conditions. Instead, the scientists developed a much heartier breed that still sported the exotic blue leaves. The plant researchers then used an imaging tool called an electron microscope. Peering into the leaves\\' cellular structures, the scientists found that the plants had some peculiar chloroplasts. Chloroplasts are basically a plant\\'s power generators—they\\'re cellular capsules that hold all the machinery responsible conducting photosynthesis. In particular, Whitney and her colleagues noticed something funky with the spire-like structures called thylakoids found inside the chloroplast capsules. Thylakoids look like tiny towers, and the light that enters them is what\\'s turned into chemical energy. Look inside the chloroplasts of most plants and you\\'d find these tower-like fairly randomly placed, like a slap-dash collection of buildings. But the thylakoids inside the Begonia\\'s chloroplasts had a incredibly regular structure. Less like the irregular Manhattan skyline, and more like a planned city. According to Whitney, the rigid, precise structure of these thylakoids creates a couple of fascinating effects. First, their ordered placement means that the entire chloroplast capsules tend to reflect away blue wavelengths of light, which is why the leaves appear iridescent blue to our eyes. Losing this blue light isn\\'t a problem for the Begonia plant\\'s energy efficiency, since most blue light is absorbed by the rainforest growing above it anyway. Instead, the thylakoids are far better at absorbing red-green light, the flavor that tends to be most abundant in the perpetual dim of the rainforest floor. But here\\'s the strangest quality of these cellular structures: Light itself actually slows down as it barrels through the Begonia plants\\' chloroplasts. That\\'s due to the precise arrangement of the tower-like thylakoids, which together act like a dense crystal. While light always travels the same speed in a vacuum, it will slow down when passing through different types of matter. This effect is known in quantum physics as slow light . Combined with the increased uptake of red-green light, this effect increases the efficiency of the Begonia plant\\'s photosynthesis up to 10 percent. Interestingly enough, Whitney says, the Begonia plants they studied had a mix of normal plant chloroplasts and the odd, highly ordered blue variety. \"We think these serve a function almost like a backup generator,\" she says, \"meaning the plant will use its [regular] chloroplasts if there\\'s enough light, but can switch when the light levels get extremely low. \"It\\'s just wonderful and logical to think that a plant has evolved an ability to physically manipulate the lighting around it in a variety of different ways. I think it really raises the prospect that this type of phenomenon might even be more widespread than we realize in the plant kingdom. Perhaps we just don\\'t notice other plants that are doing this because they don\\'t have a strange color.\"'"}, "time": 1742561902.7206118}