{"duration": 0.0654296875, "input_args": {"text": "'Vinnie Paz of the hip hop group, Jedi Mind Tricks, wrote this song inspired by the work of people’s historian, Howard Zinn. It picks up where his song, “You Can’t Be Neutral on a Moving Train,” left off, and similarly, it is a kind of hip hop cliff notes of Zinn’s book, “A People’s History Of the United States.” \\n“Writings On Disobedience and Democracy” was put out as part of the “30 Days, 50 Songs” project, which posted songs over a period of 30 days in order to motivate voters to defeat Donald Trump. The project was not just anti-Trump. Artists For a Trump-Free America were very pro-Hillary Clinton. However, what stands out and makes Paz’s song enduring is that it does not make any reference to Trump or the 2016 election. \\nAs Paz said when the song was shared, “It felt like the right time to rekindle some of these forgotten stories in American history.” He added these are “stories that aren’t necessarily taught in our classrooms.”\\nThe song opens with the following Zinn quote:\\nWe have to stop thinking that we must have military solutions to the problems we face in the world. The solutions that we need are the solutions dealing with sickness and disease and hunger. That’s fundamental. If you want to end terrorism, you have to stop being terrorists, which is what war is. \\nPaz begins with the imperialist intentions behind the United States’s involvement in World War II. Acknowledging the unspeakable evil of Adolf Hitler’s regime, he then summarizes, “We opposed the Haitian revolution. We turned Guam, Puerto Rico, and Hawaii into institutions, pretended to help Cuba win freedom from Spain. This country’s built on the blood of other people’s pain.” \\nBlacks looked at anti-Semitism in Germany. What they saw mirrored their experience in the U.S. And America appeased Hitler in the 1930s until President Franklin Delano Roosevelt was ready to advance imperialist interests. But, as Paz puts it, “Roosevelt ain’t care about oppression of the Jews.” \\nAs Paz tells it, in 1945, “Troops were jammed onto the Queen Mary. The blacks were stowed down in the depths of the same ferry. See there’s a parallel you have to understand, that they wanted them to fight but wouldn’t treat them like a man.” \\nPaz notes the workers’ resistance that occurred post-WWWII then the black revolt in the 1950s. \\n“Angelo Herndon felt everything was equal,” Paz raps. “He was arrested, they convicted for insurrection\\nHow the fuck it’s insurrection? I call it dissension. Gave him five years when all he wanted was protection.”\\n“There was other black men that made the same connection. Benjamin Davis defended Herndon as a savior\\nThen Paul Robeson; he only magnified the danger. Harry Truman had to deal with the militant mood. But how the fuck that gonna work when he a racist too?”\\nThe song covers the Freedom Rides, the Black Panthers, the Vietnam War and Watergate. Following these events, “There was a deep economic insecurity in this world of ours. Environmental deterioration took its toll. A cultural violence upon the families took its toll. Problems couldn’t be solved without bold changes. But no major party candidates proposed changes.”\\nRonald Reagan was elected president. He cut welfare for the poor and unemployment grew. That is where Paz ends, but he plans to continue the conversation in a future song. \\nIn the outro, Paz asks people to reflect on what they were taught in school and whether they were taught lies about American history. “Dig into the real history of this country, and the fact that it was built on blood,” he urges Americans. \\nNot only does it stand as a tribute to Zinn, but it also serves as a means to use the form of hip hop to reach people who may not be aware of the history brought to the fore by Zinn. It celebrates dissent and resistance at a time when it is critical for people to take the fear and panic from a Trump election and channel it into targeted action. \\nListen to Paz’s “Writings on Disobedience and Democracy”: \\n\\nThe post Protest Song Of The Week: ‘Writings On Disobedience And Democracy’ appeared first on Shadowproof .\\n'"}, "time": 1742562730.8121939}