{"duration": 0.05584073066711426, "input_args": {"text": "'The Saudi press is still furious over the U.S. Senate’s unanimous vote approving a bill that allows the families of 9/11 victims to sue Saudi Arabia. This time, the London-based Al-Hayat daily has claimed that the U.S. planned the attacks on the World Trade Center in order to create a global war on terror. \\nVia AlternativeNews \\n\\nThe article, written by Saudi legal expert Katib al-Shammari and translatedby MEMRI, claims that American threats to expose documents that prove Saudi involvement in the attacks are part of a long-standing U.S. policy that he calls “victory by means of archives.”\\nScroll Down For Video Below! Al-Shammari claims that the U.S. chooses to keep some cards close to its chest in order to use them at a later date.\\nOne example is choosing not to invade Iraq in the 1990s and keeping its leader, Saddam Hussein, alive to use as “a bargaining chip” against other Gulf States. Only once Shi’ism threatened to sweep the region did America act to get rid of Hussein “since they no longer saw him as an ace up their sleeve.”\\nHe claims that the 9/11 attacks were another such card, enabling the U.S. to blame whoever suited its needs at a particular time; first it blamed Al-Qaeda and the Taliban, then Saddam Hussein’s regime in Iraq, and now Saudi Arabia.\\nSeptember 11 is one of winning cards in the American archives, because all the wise people in the world who are experts on American policy and who analyze the images and the videos [of 9/11] agree unanimously that what happened in the [Twin] Towers was a purely American action, planned and carried out within the U.S. Proof of this is the sequence of continuous explosions that dramatically ripped through both buildings. … Expert structural engineers demolished them with explosives, while the planes crashing [into them] only gave the green light for the detonation – they were not the reason for the collapse. But the U.S. still spreads blame in all directions.\\nThe intention of the attacks, writes al-Shammari in his conspiracy article, was to create “an obscure enemy – terrorism – which became what American presidents blamed for all their mistakes” and that would provide justification for any “dirty operation” in other countries.\\nThe terror label was applied to Muslims even though it was Muslims who helped America defeat the Soviets and bring an end to the Cold War, he writes. The problem, asserts al-Shammari, is that the U.S. must always find a new impetus to have an adversary, for “the nature of the U.S. is that it cannot exist without an enemy.”\\nAl-Shammari’s article comes amid a torrent of vociferous articles in the Saudi press that range from accusing the U.S. of being “schizophrenic” and in cahoots with Iran to publishing warnings that if passed, the “Satanic” bill would “open the gates of hell.”\\n'"}, "time": 1742563333.477186}