{"duration": 0.031644344329833984, "input_args": {"text": "'Trump Proudly Declares: Most Of The People I’ve Insulted Deserved It By Andrew Bradford on October 27, 2016 Subscribe \\nArrogance is defined as “an insulting way of thinking or behaving that comes from believing that you are better, smarter, or more important than other people.” In other words, Donald Trump perfectly exemplifies arrogance, and he just proved that fact yet again. \\nAppearing on Good Morning America Thursday morning, the GOP nominee readily defended the insulting posts he’s made on Twitter: “It’s ok, most of them deserved it.” \\nTrump then declared : “I believe in fighting back when people are against me, when they tell lies, you know, I have the power of this instrument and frankly sometimes I’ll use that. And I agree sometimes it will revert back or sometimes maybe it doesn’t come out — you have to be careful with it.” \\nWhen exactly has Trump been careful with what he posts on social media? Try never. \\nMelania Trump, who was also interviewed, said that if she becomes First Lady, one of her primary areas of focus would be social media: “What’s going on is very hurtful to children, to some adults as well.” \\nDoes that mean she’ll take away Donald’s cell phone and duct tape his hands to his sides so he can’t tweet out hateful and hurtful shit the way he normally does? Yeah, good luck with that, Melania! \\nEarlier this week, the New York Times ran a two-page spread listing all of the insults and unkind postings Trump has made on Twitter since he announced he would be running for President in 2015. If you want to see a completely unhinged, uninformed, and unfiltered mind at work, just take a look at the Times article and recall what Hillary Clinton said regarding the Donald: “A man you can bait with a tweet is not a man we can trust with nuclear weapons.” \\nDonald Trump cannot be trusted with a smart phone, let alone the reins of power for the most important nation in the world. \\nFeatured Image Via YouTube Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742563221.3348234}