{"duration": 0.06197381019592285, "input_args": {"text": "'“Duration is very important,” says Damien Léger, a doctor who runs the   center at the   hospital in Paris. Aim to sleep for 20 minutes. Anything longer, and you risk drifting into what scientists call   sleep, a state of languid   activity considered important for consolidating memories. Set an alarm clock. A   encounter is likely to leave you with what Léger calls “sleep drunkenness” instead of a feeling of rejuvenation. Think of napping as a basic right, not a petty luxury. For a French think tank, Léger wrote a recent report arguing that all workers should be permitted naptime, an especially important respite for those working night shifts or anyone who routinely sleeps six or fewer hours daily. Such chronic sleep deprivation is associated with hypertension, diabetes, depression, obesity, cancer and even an increased risk of death. Research shows that short periods of sleep increase cognitive performance, reaction time and mood. In one study, subjects who took an afternoon nap were nearly twice as likely to solve a   problem as those who didn’t. Establish a few basic preconditions. Find a safe space, like an unoccupied office or a dedicated rest area, where you’re unlikely to be bothered. Block out light with an eye mask. Absolute quiet is not a requirement for sleep, but if you are in a particularly noisy place, like a factory, use earplugs. You don’t need to lie down. Napping can be achieved sitting upright, cheek on the desk. “Bring along a small pillow for your head,” Léger says. The ideal snooze time will depend on your sleep schedule, but most daytime workers experience peak drowsiness in the afternoon. Léger hopes that someday, a quick slumber will re place the   coffee. “Napping is much more powerful than caffeine,” he says, “and there are no negative side effects. ” Patients often tell Léger how they sneak into the bathroom or into their parked cars to nod off during the workday. Their fatigue embarrasses them. Do your part to destigmatize naps by talking openly about how pooped you feel. Tell your   you intend to sleep for 20 minutes. “There is nothing shameful about a nap,” Léger says.'"}, "time": 1742561915.4588737}