{"duration": 0.08444499969482422, "input_args": {"text": "'Editor’s Note : Disgusting. This country just gets more and more corrupt by the day… it’s insane. Pretty soon it will collapse of its own weight under so much disgusting corruption.\\n\\nThe Pennsylvania legislature has passed a law prohibiting the release of officers’ names for up to 30 days after a police-related death has occurred. It was backed by Philadelphia police unions and will become law if signed by Democratic Governor Tom Wolf.\\nThe measure passed Thursday after the Republican-controlled legislature voted along party lines. If the bill becomes law, it will prevent public officials from releasing the names of officers involved in shootings which cause death or “ serious bodily injury ” for up to 30 days after the incident, or until the conclusion of an official investigation.\\nThe bill, HB 1538, was sponsored by state Rep. Martina White (R-Philadelphia) and is a direct contradiction of the Philadelphia Police Department’s policy of releasing names within 72 hours of a shooting.\\nThe 72-hour rule was created by the Department of Justice and put into place by former police commissioner Charles H. Ramsey in 2014, after it was recommended. Speaking in support of the rule at the time, Ramsey said : “ I don’t think you can reasonably expect to shoot people and remain anonymous. ”\\nHowever, the influential Philadelphia Police Union has defended HB 1538.\\n“ We’re just asking to put a lid on the boiling pot until things calm down, especially if it’s an investigation that could lead to protests in the community, ” John McNesby, president of the 14,500-strong union, told the Pittsburgh Post-Gazette.\\nWhite claims the bill is needed, due to the dangers faced by police officers\\n“ I was watching the television and just saw how officers are being gunned down and other officers in different states had been subjected to harassment and the very things that they are trying to protect citizens like ourselves from experiencing, and to me the 72-hour rule is really just an arbitrary number, ” White told the Post-Gazette.\\nHowever, neither McNesby nor White could identify any instances of officers or their families being harmed due to being publicly identified.\\nMcNesby told the Post-Gazette that he was unaware of any direct threats that had taken place, but said “ that’s what we’re looking to stop before it becomes a reality. ”\\nThe American Civil Liberties Union of Pennsylvania has criticized the bill, calling it “ a policy that will heighten tensions between the police and the communities they serve” and accusing it of being “completely tone deaf to the needs of communities that are impacted by police brutality. ”\\nRep. Margo Davidson (D-Delaware County) has also spoken out against the bill, saying it undermines “ the bridges that have been built between law enforcement and communities of color. ” She added that “ this legislation will do nothing but breed suspicion. ”\\nDavidson, along with many other Philadelphia Democrats, opposed the bill in the 151-32 vote.\\nGovernor Wolf has yet to comment on whether or not he will sign the bill, which passed the Senate and House with a veto-proof majority. If Wolf still decides to veto, an override of that veto would only be able to take place after the next election.\\n\\nRead Also: War on Cops Debunked: More Cops Died by Accident Than Violence in 2015 \\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by RT.com of RT.com . '"}, "time": 1742564415.214934}