{"duration": 0.024325132369995117, "input_args": {"text": "'They call it ‘The Hum,’ a phrase coined by the geo-scientist David Deming of the University of Oklahoma to describe the ‘mysterious and untraceable sound that is heard in certain locations around the world by two to ten percent of the population.’ \\nVia UsualRoutine \\n\\nThe noises might vary from roaring sounds in the middle of the night, to prolonged periods of noise which sound like intense industrial activity taking place in the sky. Most unusually of all, ordinary people in cities such as York in England have claimed to hear trumpet horns coming from the sky playing chilling bars of music.\\nScroll Down For Videos Below! Now Slovakia has become the latest location to these bizarre and completely inexplicable noises, which have been recorded on video.\\nAs of yet, no one has been able to offer a completely coherent explanation for these mysterious sounds. Some have suggested that the chilling noises might be caused by changes in the Earth’s core which could eventually lead to a complete polar shift. However, aside from speculation, there is little evidence to suggest that this particular theory is true. According to Deming, they may well be caused by enormous amounts of collated feedback from telephone transmissions and aircraft which are operated by the United States Navy to communicate with submarines. However, this explanation is deemed to fall short as these noises became particularly apparent in 2011 and 2012 and if Deming is correct, there should have been previous indications of this feedback reaction before this period.\\n\\nSome people have suggested that the noise could be being caused by projects such as the HAARP weapons program, which is believed to be dedicated to working on high-tech weather modification technology.\\nIf this explanation is correct, it could not explain not only the unusual noises but also why they are so often accompanied by a bizarre phenomenon in the sky, such as those which have been detected in Slovakia in recent months.\\nAnd here is another recent video. Chilling to the bone: \\n'"}, "time": 1742628508.6678524}