{"duration": 0.09299993515014648, "input_args": {"text": "'Following the publication of emails from the Democratic National Committee by WikiLeaks, chairwoman Debbie Wasserman Schultz was pushed to resign around the same time as the political party’s national convention. She privately attacked the Bernie Sanders campaign and was fiercely loyal to Hillary Clinton. However, a document recently published by WikiLeaks clearly indicates the Clinton campaign had little confidence in Wasserman Schultz’s leadership.\\nThe document titled, “DNC Leadership,” is a memo attached to an email released as part of the “Podesta Emails.” It was circulated in December 2015, before the primary officially kicked off with the Iowa Caucuses, and it contains the campaign’s plan to appoint a chief of staff at the DNC, who could work with them during the primary instead of the DNC chairwoman.\\n“Though we have reached a working arrangement with them, our dealings with party leadership have been marked by challenges, often requiring multiple meetings and phone calls to resolve relatively simple matters,” the memo declares. “We are frequently caught in the middle of poor communication and a difficult relationship between the chairwoman and the executive director.”\\n“Moreover, leadership at the committee has been slow to respond to structural challenges within their own operation that could have real impact on our campaign, such as research.”\\n“Jen O’Malley Dillon has entered into a contract with the DNC as a consultant for the general election, which addresses some of these challenges and provides a connection for us within the party,” according to the memo. “However, this arrangement does not change the need for systemic shifts at the DNC leadership level—to ensure that we have strategic and operational partners within the committee that can help drive a program and deliver on our general election imperatives.”\\nThe memo further reveals there were an array of “special projects” the campaign agreed to work on with the DNC before Clinton secured the nomination. They included “GOP opposition research, communications, and discrete data and analytics projects.” And from March through July, the campaign planned to bring on a chief of staff to “drive the day-to-day work” with the party until the convention.\\nNBC News reported in February that the campaign hired Dillon, a former Obama deputy campaign manager. The report suggested it was to “retool messaging and strategy,” and it was perceived as a response to Sanders’s big victory in New Hampshire. None of the reports mentioned Dillon’s role at the DNC or that hiring Dillon was planned back in December.\\nThe memo shows the campaign favored keeping Amy Dacey on as CEO .\\nThere were three plans of action for the DNC after the convention, none of which were executed because Wasserman Schultz resigned.\\nOne of them involved neutering Wasserman Schultz so her role was “largely ceremonial.” She would help with fundraising and serve as a surrogate. They planned to tell her the campaign would rely on Dillon to run the DNC.\\nAnother scenario involved replacing Wasserman Schultz with former Michigan governor Jennifer Granholm, an ardent supporter of Clinton.\\nThroughout the primary, Wasserman Schultz constantly insisted she was neutral in her role as DNC chair.\\n“If I wanted to favor a candidate, I would not be DNC chair and I would support that candidate,” Wasserman Schultz said back in January. “It’s a pretty convoluted way to help a candidate when I have to actually function neutrally as the DNC chair.”\\nHowever, Democratic Representative Tulsi Gabbard of Hawaii resigned from her post as vice-chair of the DNC to endorse Sanders partly because she witnessed corruption in the DNC. The party inappropriately limited the number of debates. Wasserman Schultz even disinvited her from a debate in Las Vegas.\\nSanders repeatedly criticized Wasserman Schultz and the DNC. The campaign’s lawyer, Brad Deutsch, condemned a fundraising arrangement between the Clinton campaign and the DNC.\\n“The Hillary Victory Fund has reported receiving several individual contributions in amounts as high as $354,400 or more, which is over 130 times the $2,700 limit that applies for contributions to Secretary Clinton’s campaign,” Deutsch wrote in a letter to Wasserman Schultz. “Bernie 2016 is particularly concerned that these extremely large-dollar individual contributions have been used by the Hillary Victory Fund to pay for more than $7.8 million in direct mail efforts and over $8.6 million in online advertising, both of which appear to benefit only HFA by generating low-dollar contributions that flow only to HFA, rather than to the DNC or any of the participating state party committees.”\\nDNC emails published by WikiLeaks revealed the party committee sought to cover up the fact that states were only permitted to keep a small portion of the funds raised. This allowed the campaign to skirt campaign finance laws and essentially operate a money laundering scheme to keep her campaign coffers burgeoning as Sanders consistently raised more funds than her with small dollar donations.\\nAs POLITICO reported, Marc Elias, an attorney who advises the DNC and the Clinton campaign, wrote in an email to DNC officials, “The DNC should push back DIRECTLY at Sanders and say that what he is saying is false and harmful to the Democratic party.”\\nDacey responded “I do think there is too much of this narrative out there — I also worry since they are emailing to their list (which has overlap with ours!)”\\nAt virtually no juncture did the Clinton campaign have to address their plans to coordinate with the DNC, which explicitly undermined the impartiality of the committee.\\nSo long as the efforts to work with leadership of the DNC to defeat Sanders and the GOP nominee remained secret, it made no sense to say anything. It was much easier to let Wasserman Schultz field all the blowback from their unethical cooperation and replace her when she was no longer needed.\\nThe post Podesta Emails: Memo Reveals Clinton Campaign’s Plan To Coordinate With DNC appeared first on Shadowproof .\\n'"}, "time": 1742564561.6152322}