{"duration": 0.017879247665405273, "input_args": {"text": "'Students at the University of Notre Dame have reacted strongly to the announcement that Vice President Mike Pence will serve as this year’s commencement speaker. [University President John Jenkins announced the decision to host Pence as the speaker at this year’s graduation event in a press release. Jenkins stated that it “is fitting that in the 175th year of our founding on Indiana soil that Notre Dame recognize a native son who served our state and now the nation with quiet earnestness, moral conviction and a dedication to the common good characteristic of true statesmen. ”  Although there have been no calls to disinvite Vice President Pence, students at the University of Notre Dame have been expressing their concern over the decision to offer him the role of commencement speaker. The university’s College Democrats organization expressed their concern over Pence’s stances on immigration, abortion, and healthcare, suggesting that his values contradict those of what the group would consider an appropriate commencement speaker. “Vice President Pence has demonstrated this ‘quiet earnestness’ and ‘moral conviction’ on numerous other occasions: when he refused to allow Syrian refugees, fleeing from violence and terrorism, to find refuge in our state when he limited a woman’s right to control her own body by slashing access to women’s healthcare or when he limited needle exchange programs that could have prevented the worst HIV outbreak Indiana has ever seen,” the College Democrats of Notre Dame wrote in a statement that appeared on their Facebook page. “The new Administration has shown a basic disregard for the fundamental rights of so many communities. We are saddened that Fr. Jenkins would invite Vice President Pence to serve as an ambassador of that Administration, as he receives an honorary degree on a stage shared by members of the very communities he marginalizes,” the statement adds. Senior Film, Television, and Theatre major Elizabeth Hynes expressed her criticism of the decision in a satirical video that she uploaded to YouTube. “Just as many people were opposed to the invitation of President Obama in 2008, I’m opposed to the university inviting Pence today,” Hynes claims. “The invitation of a man who, during his tenure as governor, made decisions that harmed the quality of life for many marginalized groups (e. g. refugees, drug users from lower socioeconomic levels, members of the LGBT community, and women) runs counter to the Catholic values of inclusion that both Pence and our university claim to perpetuate. Additionally, Pence’s complicity in an administration that is hostile towards  —   among many other groups  —   DACA students and their   families makes him a threat to many of our peers’ ways of life. ” Hynes adds that she plans to protest Pence’s commencement address, but claims that she holds no hostilities towards the university. “But I do plan to protest, which won’t invalidate any of the gratitude I feel towards Notre Dame and everyone that commencement weekend celebrates. My parents and this university have taught me to stand up for what I believe is right, so remaining silent would be a betrayal to those lessons. ” Tom Ciccotta is a libertarian who writes about education and social justice for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com,  '"}, "time": 1742628465.8026752}