{"duration": 0.20199036598205566, "input_args": {"text": "'Rep. Mo Brooks ( ) told SiriusXM host Alex Marlow of Breitbart News Daily on Friday morning that he expects a vote on the House Obamacare replacement bill, the American Health Care Act (AHCA) the same day. Brooks is opposed to the bill. [“I do not control the voting process. That’s done by [Speaker of the House Paul Ryan] and he can always change his mind,” Rep. Brooks noted. “But as of last night, we’re voting today. ”  He said he was uncertain if estimates that the bill does not have enough votes to pass are still valid. “There were a lot of emotional pleas last night that might cause people to take off their thinking hats and react with their hearts, rather than their heads, and support what we all know is bad legislation,” he said. “First, I believe it is a horrible replacement bill,” Brooks declared, when Marlow asked why so many Republicans support a bill that seems to fall far short of GOP promises to repeal Obamacare.  “Second, in my judgment, the reason is there are a lot of Republican politicians who, back home, wanted to pretend that they were in favor of Obamacare repeal in order to win their primaries, when, in fact, they weren’t,” he contended. “And now we’re to the stage where votes count. If we can get bills to the president’s desk, there’s a good chance that they will be signed. We are suddenly finding that a lot of Republican congressmen, maybe they weren’t really for repeal of Obamacare in the first place. ” “That’s why we have a bill that is referred to as ‘ ’ or ‘Obamacare 2. 0’   —   because it does not repeal Obamacare,” he explained. “In fact, it keeps the substantive parts of Obamacare that have caused premiums to skyrocket, which is why the Congressional Budget Office and the Joint Committee on Taxation are warning us in Congress that health insurance premiums over the next two years will go up 15 to 20 percent, rather than drop like you would have happen if there was an Obamacare repeal. ” Brooks said he had two major reasons for believing the House bill is a bad piece of legislation. “One is we were sent to Washington, D. C. to help struggling American families with healthcare costs, not pass legislation that’s going to continue to increase the cost of health care, which is what this bill does,” he said. “What we should be doing is implementing cost containment measures,” Brooks argued. “We should be repealing the parts of Obamacare that have forced these skyrocketing premiums on struggling American families, rather than keep them in this new bill. ”  “In addition to that, we should interject new provisions that will force competition into the marketplace,” he continued. “By way of example, we should be forcing interstate health insurance competition that, in turn, will force lower insurance prices, as health insurance companies from around the country compete for a customer base. We should be repealing antitrust exemptions that suppress competition, that create oligopolies and monopolies that, in turn, drive up healthcare costs. ”  “Those are the kinds of things we should be doing on the cost containment side so that premiums will not go up that estimated 15 to 20 percent, as is represented to us by both the Congressional Budget Office and the Joint Committee on Taxation. As an aside, I’ve heard no argument to the contrary  —   much less no persuasive argument to the contrary,” he said. “The second reason may even be bigger than the first, and that is that Obamacare 2. 0 is the largest Republican welfare program in the history of the Republican Party. That has a lot of implications, cascading effects,” Brooks warned.  “By way of example, it undermines the work ethic. It encourages more and more Americans to live off the hard work of others. Obamacare 2. 0, because of this welfare provision over time, is going to dramatically increase the need to raise taxes or borrow more money to pay for, if past experiences are any indication, what will be escalating welfare costs. As you know, struggling American families cannot afford more taxes, and America cannot afford more debt. It’s already at $20 trillion. We’re already being warned that we’re heading into insolvency and bankruptcy. We need to heed those warnings, rather than destroy what it took more than two centuries of American ancestors to build. ”  “In addition to that, there’s a huge political ramification, and you see it a little bit in the debate that we’ve had so far. By way of example, if this bill passes with this huge welfare program, all of a sudden, you are converting tens of millions of voters who now are   into welfare dependents  —   thus making elections about who can deliver the most welfare for me to help me with my health insurance premium,” he said.  “That’s going to have a huge electoral impact. That’s going to turn America over to the Bernie Sanders socialist wing of American society. Quite frankly, it may be the death knell for the free enterprise system that has helped make America the greatest economic power in the world,” he warned. Brooks offered an example of how the political dynamics of the House Republican bill were making the   problem worse, even before the bill is voted upon. “Obamacare 2. 0, this Republican welfare program, was introduced about two weeks ago,” he said. “The Congressional Budget Office, on March the 13, did an analysis of that bill as it was two weeks ago. Two weeks later, the Congressional Budget Office on March 23 did another analysis of what purports to be the amended version of Obamacare. Over that   period, the financial projections worsened by $187 billion, as congressional politicians scrambled to promise more and more welfare to placate merely feared demands of these projected welfare recipients. So just the mere fear of future demands for welfare caused this House of Representatives to worsen our financial condition by $187 billion in just two weeks, in this legislation. ”  “We’re not doing what we were sent here to do: cut premium costs, make health care more affordable on the one hand, and on the other hand, to create a huge new welfare program that, in effect, duplicates the structure of Obamacare,” he lamented. “That’s not what the Alabama voters sent me to Washington, D. C. to do, and I’m very much puzzled by those other congressman who think that’s a good thing. ” Brooks predicted that “if people think with their heads,” the bill will “go down into a crashing defeat. ” “If they think with their hearts, then it has a reasonable chance of passing,” he added. “There is tremendous pressure, particularly amongst Republican friends in the House and Senate and the White House, to pass this legislation because of our friendship, as opposed to whether it’s good or bad for America. ” Marlow noted that the bill is “overwhelmingly unpopular” with voters, scoring as low as 17 percent support in polls, but seems to enjoy vastly disproportionate support from the House Republican caucus. “It has very little to do with what America wants outside the Beltway and a lot to do with what    America  —   and, in particular, special interest groups and lobbyists  —   want,” Brooks replied. “From my perspective, it’s the worst I’ve ever faced, and I’ve been in public life for three decades,” he said, when Marlow professed to have heard few cogent defenses of the bill. Brooks had little use for the argument that this legislation was just step one in a   or “ ” plan to repeal Obamacare. The White House description of this strategy describes step two as relief from burdensome regulations, and step three as “additional legislation,” such as permitting health care to be sold across state lines and reforming malpractice insurance. “I agree with the argument of those in the Senate who have called part three the ‘sucker bucket,’” he said. “And part two is subject to litigation that will tie it in knots for who knows how many years. If it’s good, why not put it in this legislation? If we’re really going to do it, why not put it in this legislation and force it through the House, and force it through the Senate, if it’s good and if it’s going to happen. ” “Two and three  —   two might happen to some degree, although who knows how many years it will take for it to get through all the litigation aspects? Number three, never happen,” he predicted. Marlow cited the argument that defeat for the House Obamacare bill will hinder Republicans in their mission to “stop the Democratic Party” and its agenda. “Stopping the Democrats is meaningless if we’re not, at the same time, doing the right thing for our country,” Brooks declared.  “I don’t believe this impacts President Trump’s reputation so much as it impacts those who have given the president bad advice and put him in this position,” he added.  “The simplest and smartest thing to do would have been to pull up the Obamacare repeal bill that passed the Republican House and passed the Republican Senate two years ago that was vetoed by President Obama,” he said. “Pass that through the House. Pass that through the Senate. Have whatever effective date you want in the future to implement the   market principles that we want to force competition into the marketplace. ”  “We had legislation that we voted on in the past that got unanimous support of Republicans in the House, unanimous support of Republicans in the Senate. It even complied with those arcane, crazy Senate rules that frustrate America in so many different ways, and it made it to the president’s desk,” Brooks pointed out. “It baffles me that that was not done, although it doesn’t really baffle me once you start thinking about all these Republican politicians who wanted to go back home saying, giving the impression, that they’re for repeal of Obamacare when they really aren’t. ” Marlow noted that President Trump has essentially said the current House GOP bill is the only repeal and replace option that will be on the table for the near future and voting it down will leave Obamacare in place for a long time to come. He asked Brooks if this was a “threat” to recalcitrant lawmakers or, at least, a dramatic “ratcheting up of the rhetoric. ” “I would call it a bargaining tool or a tactic,” Brooks replied. “I am mildly surprised, but not too much. It seems consistent with the bargaining tactics that the president talks about in The Art of the Deal. I would hope that whoever is advising the president would not advise him to surrender on an issue of this magnitude. America deserves better. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563829.381685}