{"duration": 0.048032283782958984, "input_args": {"text": "'Comments \\nThe House GOP are preparing for a Clinton presidency by doing absolutely nothing to change their plans, announcing the threat of continued investigations into soon-to-be President-elect Hillary Clinton, which they warn will go on for years. Rep. Jason Chaffetz (R-UT) is spearheading the charges against her, in spite of un-endorsing Trump just two weeks ago. \\n“Even before we get to Day One, we’ve got two years’ worth of material already lined up. She has four years of history at the State Department, and it ain’t good,” he threatened. \\nAlthough Clinton is predicted to win by a landslide majority, Republicans could retain control of the House due to conservative voting at the local level decades of extensive jerrymandering by Republican statehouses. This might make Clinton be the first president since George H.W. Bush to deal with a House Oversight Committee controlled by their opposing party in her first term. \\nOf course, other Republicans agree with the efforts to take down Clinton, gleefully planning to exacerbate political divisions and distaste in this country and recreating the climate that led to Trump getting as far as he has. \\nThe office of House Speaker Paul D. Ryan (R-Wis.) issued a statement saying, “The rigorous oversight conducted by House Republicans has already brought to light troubling developments in the [Hillary] Clinton email scandal. The speaker supports [Oversight’s] investigative efforts following where the evidence leads, especially where it shows the need for changes in the law.” \\nThe thought of Republicans wasting additional time and money on trying to take down Clinton is a spit in the face to her campaign. David Brock, leader of the American Bridge PAC, accusing Chaffetz of squandering taxpayer dollars on his nonsense investigation. “It’s clear Congressman Chaffetz is ready to spend resources on additional worthless political investigations that will, again, come up with nothing,” he commented. \\nRep. Elijah E. Cummings (D-Md.), a ranking member of the Oversight Committee and the Select Committee on Benghazi, echoed these sentiments, explaining, “Republicans are pretending like they haven’t been investigating Secretary Clinton for years ever since she announced that she was running for president, including everything from Benghazi to emails to the Clinton Foundation. It’s no exaggeration to say that on the first day Secretary Clinton walks into the White House, Republicans will have already investigated her more than any other president in history.” \\nChaffetz’s anticipated investigation may be reliant on stolen documents, sourced via WikiLeaks, though he claims he doesn’t “want to be dealing with that.” When asked if this will resemble Watergate, Chaffetz tries to warn that it could go that far depending on cooperation. \\nThe one thing Chaffetz hasn’t accounted for? A Trump presidency. “Heaven help us!” he says, laughing. “Please, no! I’m not even going to think about that one. I can’t even utter the sentence out loud.” \\nIn spite of Republicans voting Clinton on Election Day, they are still acting like whiny children, stopping at nothing to push their counter-intuitive political agenda on America. It is a prime example of Republican hypocrisy, and selfish refusal to let the country run optimally in favor of the agendas of their corporate masters and the monied elites.'"}, "time": 1742628571.1514227}