{"duration": 1.7857496738433838, "input_args": {"text": "'Der Einfluss der USA und der NATO auf das Verhältnis der EU mit China von Manlio Dinucci Als Teilnehmer an einem internationalen Forum fasst der italienische Geograph Manlio Dinucci seine Analyse über die Waffen zusammen, die die Vereinigten Staaten aufgebaut haben, um die ganze Welt zu beherrschen. Dieser Artikel ist wichtig, weil es genau diese eindeutige gewollte Vorherrschaft, diese unipolare Organisation der Welt ist, die Syrien, Russland und China heute mit Waffen in der Hand in Frage stellt.\\nVoltaire Netzwerk | Rom (Italien) | 29. Oktober English Ich gehe direkt zum Kern der Sache. Ich denke, dass man nicht von den Beziehungen zwischen der EU und China sprechen kann, ohne den direkten und über die NATO ausgeübten Einfluss der Vereinigten Staaten auf die Europäische Union miteinzubeziehen.\\nHeute gehören 22 der 28 Länder der EU (21 von 27 nach dem Ausstieg des Vereinigten Königreichs aus der EU), mit mehr als 90 % der Bevölkerung der Union, der NATO an, die durch die EU als \"Fundament der kollektiven Verteidigung\" anerkannt wird. Und die NATO steht unter US-Kommando: Der alliierte Oberbefehlshaber in Europa wird immer durch den Präsidenten der Vereinigten Staaten von Amerika ernannt und alle anderen wichtigen Befehle sind auch in den Händen der USA. Die Außen- und Militärpolitik der Europäischen Union ist also grundsätzlich der US-Strategie untergeordnet, auf die die europäischen Großmächte konvergieren.\\nDiese in offiziellen Dokumenten klargelegte Strategie, wird im historischen Moment geschrieben, als sich die Weltlage nach dem Zerfall der UdSSR ändert. Im Jahr 1991 erklärt das Weiße Haus in National Security Strategy of the United States : \"Die Vereinigten Staaten bleiben der einzige wirkliche globale Staat mit einer Kraft, einem Umfang und einem Einfluss in allen Dimensionen – auf politischer, wirtschaftlicher und militärischer Ebene -.\" Es gibt keinen Ersatz für die amerikanische Führung.\" Im Jahr 1992 unterstreicht das Pentagon in der Defense Planning Guidance : \"Unser erstes Ziel soll verhindern, dass irgendeine Macht eine Region dominiert, deren Ressourcen ausreichen könnten, um eine Weltmacht zu werden.\" Diese Regionen sind Westeuropa, Ostasien, das Gebiet der ehemaligen Sowjetunion und das südwestliche Asien.\" Im Jahr 2001, in dem Q uadrennial Defense Review -Bericht, der eine Woche vor dem USA/NATO Krieg in Afghanistan - von erster geostrategischer Bedeutung in Bezug auf Russland und China - veröffentlicht wurde, kündigt das Pentagon an: \"Es besteht die Möglichkeit, dass in der Region eine militärische Konkurrenz mit gewaltigen Ressourcen entsteht. Unsere Streitkräfte müssen die Fähigkeit behalten, jedem möglichen Gegner, auch Staaten und nichtstaatlichen Einheiten, den Willen der Vereinigten Staaten aufzuzwingen, das Regime eines gegnerischen Staates zu ändern oder fremdes Territorium zu besetzen, bis die amerikanischen strategischen Ziele erfüllt sind.\"\\nAuf Grundlage dieser Strategie hat die NATO unter US-Kommando ihre Offensive an der Ostfront gestartet: nachdem sie durch den Krieg die Föderation Jugoslawien zerstört hatte, bemächtigte sie sich von 1999 bis heute aller Staaten des Warschauer Paktes, dreier des ehemaligen Jugoslawiens, dreier der Ex-UdSSR, und wird in Kürze andere umfassen (von Georgien bis zur Ukraine, wobei letztere de facto bereits in der NATO ist), indem sie Stützpunkte und Streitkräfte, selbst atomare, immer näher zu Russland in Stellung bringt. Zur gleichen Zeit, an der Süd Front, eng verbunden mit der östlichen Front, hat die NATO unter US-Befehl den libyschen Staat durch Krieg zerstört und versucht, das gleiche mit Syrien zu tun.\\nDie USA und die NATO haben die ukrainische Krise entfesselt und, unter der Beschuldigung von Russland \"die europäische Sicherheit zu destabilisieren\", haben sie Europa in einen neuen Kalten Krieg verwickelt, einen vor allem von Washington gewünschten (auf Kosten der europäischen Volkswirtschaften, denen die Sanktionen und Gegen-Sanktionen geschädigt haben), um die wirtschaftlichen und politischen Beziehungen zwischen der EU und Russland zu zerschlagen, die für die amerikanischen Interessen schädlich sind. Es ist die gleiche Strategie, die bei der wachsenden Verlegung von US-militärischen Kräften in die Asien-Pazifik Region, in einer anti-chinesischen Funktion, auftritt. Die US-Navy hat angekündigt, dass sie in 2020 ihren Schwerpunkt in diesen Bereich mit 60 % ihrer See- und Luftstreitkräfte verlegen werde.\\nDie US-Strategie konzentriert sich auf das Südchinesische Meer, für das Admiral Harris, Chef des US Pacific Command, die Bedeutung hervorhebt: „es ist da, wo der Seehandel mit einem jährlichen Wert über 5000 Milliarden US-Dollar fährt, mit 25 % des Welt-Exports von Öl und 50 % von Erdgas.“ Die USA wollen diesen Seeweg kontrollieren, im Namen jener Freiheit, die Admiral Harris für die \"grundlegende Schifffahrts-Freiheit für unser Lebens-System hier in den Vereinigten Staaten\" hält, indem sie China beschuldigen, \"aggressive Aktionen im Südchinesischen Meer zu betreiben, ähnlich denen von Russland auf der Krim.\" Deshalb \"patrouilliert\" die US-Navy im Südchinesischen Meer. Im Kielwasser der Vereinigten Staaten kommen die europäischen Großmächte: im Juli letzten Jahres hat Frankreich die Europäische Union gebeten, \"die chinesische Südsee Marine-Patrouille zu koordinieren, um eine regelmäßige und sichtbare Präsenz in diesen von China illegal beanspruchten Gewässern\" zu sichern. Und während die Vereinigten Staaten in Südkorea \"Raketenabwehr-Systeme“ aber auch nukleare Raketen installieren, ähnlich wie die in Rumänien und Polen gegen Russland installierten, zusätzlich zu denen, die auf Kriegsschiffen im Mittelmeer kreuzen, empfängt der Generalsekretär der NATO Jens Stoltenberg am 6. Oktober in Brüssel den südkoreanischen Minister für auswärtige Angelegenheiten Yun Byung-se, zur \"Stärkung der Partnerschaft der NATO mit Seoul“.\\nDiese Tatsachen und andere zeigen, dass die gleiche Strategie in Europa und in Asien an der Arbeit ist. Dies ist der extreme Versuch der Vereinigten Staaten und anderer westlicher Mächte, um die wirtschaftliche, politische und militärische Vormachtstellung in einer Welt im starken Wandel beizubehalten, in der neue staatliche und gesellschaftliche Einheiten aufkommen. Die Shanghaier Organisation für Zusammenarbeit (SCO), aus dem chinesisch-russischen strategischen Abkommen entstanden, verfügt über Ressourcen und Arbeitsfähigkeit die ermöglichen, den größten integrierten Wirtschaftsraum der Welt zu schaffen. Die SCO und die BRICS-Staaten sind mit ihren Finanzinstitutionen in der Lage, die Weltbank und den Internationalen Währungsfonds weitgehend zu verdrängen, die den USA und den großen westlichen Mächte seit mehr als 70 Jahren ermöglichten, durch wuchernde Kredite an verschuldete Länder und andere Finanzinstrumente, die Weltwirtschaft zu beherrschen. Die neuen Organisationen können zur gleichen Zeit die Entdollarisierung des Handels erreichen, indem sie den Vereinigten Staaten die Möglichkeit entziehen, ihre Schulden weiterhin durch Drucken von Dollar-Papiergeld, das als internationale Währung fungiert, auf andere Länder abzuwälzen.\\nUm ihre immer mehr wankende Vormachtstellung zu erhalten, verwenden die Vereinigten Staaten nicht nur Waffengewalt, sondern oft wirksamere als die wirklichen Waffen.\\n Die erste Waffe: die so genannten \"Free Trade Agreements\", wie die \"transatlantische Handels- und Partnerschaft\" (TTIP) mit der EU und die \"Trans-Pazifische Partnerschaft\" (TPP), deren Zweck nicht nur wirtschaftlich, sondern geopolitisch und geostrategisch ist. Deshalb bezeichnet Hillary Clinton die USA — EU Partnerschaft als \"das große strategische Ziel unserer transatlantischen Allianz\", mit dem Ziel einer \"NATO-Wirtschaft\", die die politische und militärische Allianz integriert. Das Projekt ist klar: einen politischen, wirtschaftlichen und militärischen USA — EU Block bilden, immer unter amerikanischem Kommando, der sich dem aufkommenden eurasischen Raum, basierend auf der Zusammenarbeit zwischen China und Russland widersetzt; der sich den BRIC-Staaten widersetzt, dem Iran und anderen Ländern, die sich der Vorherrschaft des Westens entziehen. Da die Verhandlungen über die TTIP wegen der unterschiedlichen Interessen und einer weit verbreiteten Opposition in Europa schwer weiterkommen, wird das Hindernis mit dem \"umfassenden Wirtschafts- und Handelsabkommen \" (CETA) zwischen Kanada und der EU umgangen: eine getarnte TTIP, da Kanada mit den Vereinigten Staaten Teil der NAFTA ist. Das CETA wird wahrscheinlich, während des Besuchs vom kanadischen Premierminister Trudeau in Brüssel von der EU am 27. Oktober unterzeichnet werden.\\n Die zweite Waffe: das Eindringen in das angezielte Land, um es von innen auseinander zu nehmen. Unter Berufung auf die schwachen Punkte, das jedes Land besitzt: Korruption, Geldgier, politischer Karrierismus, durch lokale Gruppen geschürter Sezessionismus, religiöser Fanatismus, die Anfälligkeit der großen Massen zu politischer Demagogie. Sich auch manchmal auf eine Unzufriedenheit der Massen stützen, die durch die Führung ihrer Regierung gerechtfertigt ist. Instrumente der Penetration: die so genannten \"nicht-Regierungsorganisationen\" (NGO) die eigentlich die Hand des Department of State und der CIA sind. Diejenigen, die enorme finanzielle Mittel besitzen, organisierten die \"farbigen Revolutionen\" in Osteuropa, und versuchten auch die so genannte \"Regenschirm-Revolution\" in Hong Kong: sie versuchten auch ähnliche Bewegungen in anderen Bereichen von China zu schüren, die von nationalen Minderheiten bewohnt sind. Die gleichen Organisationen, die in Lateinamerika operieren, mit dem Ziel, die demokratischen Institutionen von Brasilien auszuheben, um die BRICS-Staaten von innen zu unterwandern. Instrumente der gleichen Strategie: Terroristen, wie die bewaffneten und in Libyen und Syrien infiltrierten Gruppen, um Chaos zu säen, indem sie zum Abriss des gesamten Staates, der gleichzeitig von außen angegriffen wird, beitragen.\\n Die dritte Waffe: die \"Psyops\" (psychologische Operationen), initiiert durch globale Medien-Ketten, die vom Pentagon definiert werden: \"geplante Operationen, um durch spezifische Informationen die Emotionen und Motivationen zu beeinflussen, und damit das Verhalten der Öffentlichkeit, der Organisationen und ausländischen Regierungen, um eine verstärkte Haltung zugunsten der vorangestellten Ziele zu induzieren \". Mit diesen Operationen, die die Öffentlichkeit auf die Eskalation des Krieges vorbereiten, lässt man Russland als das für die Spannungen in Europa verantwortliche Land erscheinen und China als verantwortlich für die Spannungen in Asien, mit dem gleichzeitigen Vorwurf ihrer \"Verletzung der Menschenrechte“.\\nManlio Dinucci und seine Frau Carla, vor dem Geburtshaus von Mao Tsé Toung, 1965. Eine letzte Überlegung: da ich mit meiner Frau in den 60er Jahren in Peking gearbeitet habe, und wir beide an der Veröffentlichung des ersten chinesischen Magazins in italienischer Sprache mitgewirkt haben, habe ich eine prägende, grundlegende Erfahrung miterlebt zu einem Zeitpunkt, als China - kaum fünfzehn Jahre vom Kolonialsystem und halb-feudalen Staat befreit, - komplett isoliert war und von dem Westen oder den Vereinten Nationen als souveräner Staat nicht anerkannt war. Von dieser Periode bleiben mir immer noch, wie aufgedruckt, die Widerstandskraft und das Bewusstsein der Menschen, damals 600 Millionen, die unter der Führung der kommunistischen Partei zum Aufbau einer völlig neuen wirtschaftlichen und kulturellen Gesellschaft beitrugen. Ich denke, dass diese Fähigkeit auch für das derzeitige China heute notwendig ist, das sein enorme Potenzial entwickelt, um den neuen Plänen der imperialen Herrschaft zu widerstehen: der Kampf für eine Welt ohne Kriege, in der der Frieden mit sozialer Gerechtigkeit verbunden triumphiert.\\nManlio Dinucci Übersetzung\\nHorst Frohlich'"}, "time": 1742564490.903627}