{"duration": 0.05581378936767578, "input_args": {"text": "\"By Sean Colarossi on Mon, Oct 31st, 2016 at 8:47 pm While the media continues to focus on the Clinton email non-story, news about Donald Trump's ties to Russia continues to gain steam. Share on Twitter Print This Post \\nWhile the media continues to focus on what is increasingly becoming a non-story – FBI Director James Comey’s vague letter regarding more emails related to Hillary Clinton – news about Donald Trump’s ties to Russia continues to gain steam. \\nNot only did NBC just report that the FBI is now in the preliminary stages of investigating Trump’s ex-campaign manager’s connection to Russia, but Slate also reported on Monday that a Trump server may have repeatedly been communicating with a Russian bank. \\nSlate claims that while a group of computer scientists was looking into the Russian cyber attack of the DNC, they stumbled onto something unexpectedly. \\nThe report: \\nIn late July, one of these scientists—who asked to be referred to as Tea Leaves, a pseudonym that would protect his relationship with the networks and banks that employ him to sift their data—found what looked like malware emanating from Russia. The destination domain had Trump in its name, which of course attracted Tea Leaves’ attention. But his discovery of the data was pure happenstance—a surprising needle in a large haystack of DNS lookups on his screen. “I have an outlier here that connects to Russia in a strange way,” he wrote in his notes. He couldn’t quite figure it out at first. But what he saw was a bank in Moscow that kept irregularly pinging a server registered to the Trump Organization on Fifth Avenue. \\nMore data was needed, so he began carefully keeping logs of the Trump server’s DNS activity. As he collected the logs, he would circulate them in periodic batches to colleagues in the cybersecurity world. Six of them began scrutinizing them for clues. \\nThe researchers quickly dismissed their initial fear that the logs represented a malware attack. The communication wasn’t the work of bots. The irregular pattern of server lookups actually resembled the pattern of human conversation—conversations that began during office hours in New York and continued during office hours in Moscow. It dawned on the researchers that this wasn’t an attack, but a sustained relationship between a server registered to the Trump Organization and two servers registered to an entity called Alfa Bank. \\nThis news doesn’t come out of nowhere. Trump has repeatedly praised Vladimir Putin as a strong leader, all while taking pro-Russia positions throughout the campaign that come straight off a Kremlin wishlist. \\nThe Clinton campaign was quick to jump on the report in a statement by Clinton Senior Policy Adviser Jake Sullivan: \\nThis secret hotline may be the key to unlocking the mystery of Trump’s ties to Russia. It certainly seems the Trump Organization felt it had something to hide, given that it apparently took steps to conceal the link when it was discovered by journalists. \\nThis line of communication may help explain Trump’s bizarre adoration of Vladimir Putin and endorsement of so many pro-Kremlin positions throughout this campaign. It raises even more troubling questions in light of Russia’s masterminding of hacking efforts that are clearly intended to hurt Hillary Clinton’s campaign. We can only assume that federal authorities will now explore this direct connection between Trump and Russia as part of their existing probe into Russia’s meddling in our elections. \\nTrump’s pro-Russia rhetoric and policy positions are not a coincidence. The more information that comes out, the clearer it is that the Republican nominee has connections to Russia that he is hiding from voters. \\nWith just a week until Election Day, this is the explosive story the media should be focusing on. It’s critical that the American people know what kind of financial ties a potential president has with an American adversary, especially when that adversary is Russia.\""}, "time": 1742562014.2317338}