{"duration": 0.07951521873474121, "input_args": {"text": "'Just three months after the Metropolitan Museum of Art announced a hiring freeze and voluntary buyouts, the museum is turning to layoffs as part of an effort to cut its deficit by $30 million, through cost reductions and revenue growth. On Friday, the Met said that more than 50 employees had taken the buyouts but that it would seek further cuts in its core departments, for a total of at least 100 positions. Curatorial and conservation jobs are likely to be cut by an additional 5 percent, and administrative staff  —   including marketing, human resources, and digital personnel  —   may see staff cuts of 15 to 20 percent. “There is no letting up on the quality and the commitment we have to excellence  —   nothing we’re doing will be discernible or visible to the public,” said Daniel H. Weiss, the Met’s president and chief operating officer. “We’re planning to streamline our budgets but not to diminish our mission. ” These significant cuts in staff come as some are questioning the museum’s direction under Thomas P. Campbell. It has faced not only layoffs, but also a ballooning deficit of $10 million this year, and a pause in work on a $600 million new wing dedicated to Modern and contemporary art. The museum also underwent a $3 million rebranding, which was widely derided. In addition, the Met’s   lease of the former Madison Avenue home of the Whitney Museum of American Art, now known as the Met Breuer, has proved to be expensive, soaking up about $17 million in yearly operating expenses in addition to an estimated $15 million building renovation. Given the Met’s annual attendance of more than six million, annual operating budget of $300 million and endowment of nearly $3 billion, any cracks in its foundation are surprising. But, Mr. Campbell insisted, “We’re not in a crisis. ” “The Met is a very strong institution firing on all cylinders,” he said, adding that the museum had to establish “a fiscally sustainable budget over the long term. ” In response to the buyout offer in April, 56 staff members signed up, out of 159 eligible employees  —   those 55 years or older who had served for at least 15 years. Among those taking it is Carrie Rebora Barratt, the Met’s deputy director for collections and administration. The Met would not release or confirm other names. In June, three   employees, including the Met’s first chief digital officer, Sree Sreenivasan, stepped down from their posts. The Museum of Modern Art and the Brooklyn Museum also recently announced buyouts. The Met’s roughly $10 million deficit this year, officials have said, would almost certainly rise to as much as $40 million if the museum failed to, as Mr. Weiss put it, “dial back. ” Mr. Weiss  —   formerly the president of Haverford College who came to the Met last year  —   appears to be overseeing the  . “I was brought in to be the chief operating officer of the museum,” Mr. Weiss said. “I’m making the corrections I need to make to fulfill that responsibility. ” Mr. Campbell, its director and chief executive since 2009, said that he and Mr. Weiss “will be working together” in making layoff decisions and that departures were to be expected at an institution with 55 departments and 2, 300 employees. “The   assumption when people write about attrition is often fear of some kind of a brain drain  —   I want to push back against that really robustly,” Mr. Campbell said. “Inevitably, people come, people go. ” The number of annual exhibitions over the next few years will also be curtailed to reduce costs, perhaps to 40 from 55, Mr. Campbell said. For example, the museum has postponed by a year a major show on Versailles. “We’ll be stretching out and slimming down the numbers of exhibitions,” Mr. Campbell said, “but not compromising the quality and the content. ” He said that would make the museum “more manageable” for general visitors. “We have seen considerable growth in installations and exhibitions,” he added. “We’re very conscious that it’s too much. ” Some have questioned Mr. Campbell’s decision to devote significant resources to the Met Breuer. While shows there have received positive reviews, attendance often seems sparse. But the museum said that Met Breuer attendance  —   185, 000 visitors in the first four months (March 1 through June 30)  —   exceeds initial projections of 155, 000. “We obviously hope we can grow those in the future,” Mr. Campbell said of the numbers of visitors, “but we’re very satisfied with the attendance to date. ” The Met also consistently makes the point that it has raised operating funds separately for the Met Breuer, though donations are arguably coming from donors who would give to the Met regardless. The Met is working to lift its revenues, particularly in its retail operations, which declined by between $3 million and $4 million over the last year. Mr. Weiss said the retail numbers had already improved. “We are putting greater emphasis on our publications and some of our more distinctive merchandise,” Mr. Weiss said. The museum’s executives said that restructuring is a continuing process, all to create a leaner Met. Asked how the Met  —   with its board of several financiers  —   failed to anticipate the $8. 5 million annual debt service on $250 million in bonds issued for capital infrastructure work (one of the reasons given for its deficit) Mr. Weiss said that arrangement had been made before he started. And Mr. Campbell said that the Met is “still learning. ” “What we have to emphasize is, we’re a big institution,” he said. “Turning around in the ocean takes time. ”'"}, "time": 1742562270.4660187}