{"duration": 0.08291935920715332, "input_args": {"text": "\"Share on Facebook Donald Trump's plans for his first 100 days in office are raising eyebrows around the world, but of all the items on his agenda it is the reopening of the 9/11 investigation that will provide the greatest earthquake for the establishment. Trump believes that 9/11 has not been properly investigated and he plans to get to the bottom of it. “First of all, the original 9/11 investigation is a total mess and has to be reopened,” Trump said. The election of Donald Trump has rocked the establishment and things are only going to get rockier for them during his first term. There is a reason George W. Bush didn't vote for Trump in the election, leaving the presidential line blank and voting Republican down-ballot. Trump has pledged to investigate 9/11 in a way it has not been investigated before. For the first time 9/11 will be investigated by someone who isn't part of the establishment, with skin in the game and plenty to lose. “First of all, the original 9/11 investigation is a total mess and has to be reopened” Trump announced to supporters. “How do two planes take out three buildings in the same day? I never got my head around the fact that nothing is mentioned about the destruction of Building 7 in the 585 page document,” he explained, talking about World Trade Center 7 which also collapsed – inexplicably – during the September 11 attacks. Donald Trump has also taken cracks at former president George W. Bush. There will be no covering up for former presidents on Trump's watch. “The World Trade Center came down during the reign of George Bush,” he said in a February debate. “He kept us safe? That is not safe. That is not safe.” “Why did the administration at the time not take legal means against Saudi Arabia? Weren't 19 of the high-jackers from Saudi Arabia? Americans deserve answers and I will definitely request a new investigation so that this horrible tragedy never happens again.” Donald Trump and the 9/11 Truth movement While Trump might be railing against the establishment in reopening the 9/11 investigation, he has received support on this issue from a number of public personalities who have demanded the case be revisited – and not behind closed doors. Former Senator Bob Graham has been demanding a new, transparent investigation “For years I have been campaigning for the release of the 2002 Joint Congressional Intelligence Committee 9/11 Inquiry's report, to no avail” explains the former Governor of Florida. “These missing pages point to the direct involvement of the government of Saudi Arabia. Why are these being kept secret? Who has to gain from these games of secrecy?” he asks. “I have read these documents myself and if the American public knew what was in these documents, there would be a revolution tomorrow in the streets of America” he acknowledged during a radio interview. “Americans deserve to know the truth” he concluded, visibly angered by the whole affair. Since 2002, the release of a number of 9/11 Commission Report documents is hindered because they are congressional records, hence they are exempt from the Freedom of Information Act (FOIA). The long withheld 28 pages were partially released to the public this year – heavily redacted – and the Saudi government claimed the release proved they were not responsible for supporting or financing the attacks. But it's not as simple as that. There are direct ties to the Saudi hierarchy in the 28 pages. There are a lot of questions that need answering, and they were never going to be addressed under a Clinton presidency with all her ties to Saudi Arabia. But with President Trump's executive powers, everything has changed. The establishment are on edge. More than half the country doesn't believe the official version of what happened that day. There is now a renewed belief that this biggest of lies and cover ups is about to be dismantled. The establishment did all it could to destroy Trump the outsider's election chances at election. Now they are on edge. Related:\""}, "time": 1742563202.3390343}