{"duration": 0.12757039070129395, "input_args": {"text": "'Andy Hicks, owner of HIX Inc. a small health care technology consulting business in Denver, travels frequently. And as a gay man, he said, he’s enjoyed acceptance in many destinations  —   even in Cuba, where he traveled this year with his partner. “We didn’t know what to expect,” Mr. Hicks said. “We had zero problems. ” The travel industry offers gay travelers everything from special cruises and tours to   hotels. But there are still many places in the world, including many countries in the Middle East, Africa, Asia, the Caribbean and the Pacific, as well as Russia, where laws or social customs create an unwelcoming and unsafe environment for travelers who are lesbian, gay, bisexual or transgender. More than 75 countries consider consensual   sexual relations a crime, and in about 10 countries a person could be put to death for being gay, according to the United States State Department. “Today, it is important for a L. G. B. T. person to understand the laws and how they are enforced and the culture of the countries and even cities where they visit,” said Bruce McIndoe, chief executive of iJet International, a travel risk management company. In an environment of religious extremism, he said, “individuals are more likely to lash out or take unilateral action against assumed members of the L. G. B. T. community. ” IJet, he said, has seen increased requests from clients to help prepare and protect their gay and transgender travelers after the mass shooting at an Orlando, Fla. nightclub last June and other episodes. Mr. Hicks, who has been to many   countries, recently returned from North Korea. “It was absolutely a nonissue,” he said. “You have to adapt, go with the flow and fit in as best you can. ” Yves Gentil, founder of DQMPR, a travel public relations and marketing agency, has been to nearly 50 countries for work and pleasure. “When you travel with your   you blend in a little bit more. But I’ve never had a problem, even in places like Saudi Arabia and Dubai. ” But then he visited Jamaica last year with his partner. “It was awkward to the point that I couldn’t wait to get out,” he said. “Not unsafe, but I just did not feel welcome. ” Jamaican law prohibits consensual   sexual conduct between men, according to the State Department. Sean Williams, a senior intelligence analyst for iJet, said the duration of a stay was an important safety factor. Business travelers typically spend a few days attending meetings and return to their hotels at night. “The risk is largely minimal. It’s no different from any other business traveler,” he said. But decisions made afterward when they go sightseeing and are not completely aware of the environment can, he said, “put their lives at risk. ” Gender expression is also a risk factor. “In some countries, they expect men to have a certain appearance if you are not dressed for your gender, they can arrest you,” Mr. Williams said. In other countries, homosexuality may be legal but not culturally accepted, “so if you end up in the wrong neighborhood, it can get you in trouble. ” As Americans, he said, “we have a strong tradition to be yourself, but in some countries the safest approach is to be the person they want you to be. ” Matthew Breen, editorial director of Logo and former editor in chief of The Advocate, two media organizations aimed at an L. G. B. T. audience, said gender identification and its potential dangers had informed his personal and professional travel policies. He does not write or assign stories, he said, about “destinations where L. G. B. T. s are persecuted or where our relationships are illegal. ” IJet recommends that transgender travelers take a few extra steps to smooth interactions with airport security: Ensure that the sex designation matches on all official documents and the traveler’s physical appearance carry letters from doctors in English and in the local language when traveling internationally and anticipate that body scanners may lead to security flagging. Still, many countries and cities have rolled out the welcome mat, even ones with strong religious and machismo cultures, like Spain, with its “live and let live” attitude, and Colombia, where the number of laws to support lesbian, gay, bisexual and transgender people and the speed in which they were recently passed were “quite impressive,” Mr. Williams said. Many mainstream travel companies, including Delta Air Lines and Marriott, have provided employees with   benefits and ensured that their   employees are adept at handling reservations for customers with   spouses and their families, experts say. And tourism boards around the globe routinely reach out to travelers. “It’s a message we are seeing loud and clear,” said John Tanzella, president and chief executive of the International Gay  Lesbian Travel Association, which offers trip planning tools. Apoorva N. Gandhi, vice president for multicultural affairs for Marriott International, said, “If you take great care of your associates, they will take great care of your customers. ” Marriott, like many major brands, trains   staff members about respectfully serving gay travelers. “We show a video scenario of a   couple at a hotel approaching the front desk for ” Mr. Gandhi said. “If the couple requested one bed, staff is directed to not make assumptions and do what is on the reservation without comment. ” Marriott, with IBM, sponsored the LGBT Guide to Business Travel, recently published by Man About World, a digital gay travel magazine. “We’ve learned from experience that L. G. B. T. businesspeople and entrepreneurs face added pressures not only in the workplace but especially when they travel for business,” the home page of the online publication says. The number of harmful episodes, arrests, prosecutions or deaths involving gay, bisexual or transgender travelers globally is not tracked, said Renato Sabbadini, executive director of the International Lesbian, Gay, Bisexual, Trans and Intersex Association, a nonprofit human rights group in Geneva. “The overall trend is positive,” he said, but while many countries move forward, others backtrack. India decriminalized   sexual activities between men in 2009, but reversed the decision in 2013. “There is gradual change in societies all over the world,” Mr. Sabbadini added. “Maybe not as fast as it should, but it’s changing. ” Kevin Brosnahan, a press officer for the Bureau of Consular Affairs for the State Department, said many of its safety recommendations apply to all travelers: research a destination to be aware of local laws and customs register travel plans with the Smart Traveler Enrollment Program, a free State Department service, so the local United States Embassy can contact you in an emergency and make sure to have appropriate documents and medical and evacuation coverage. The department’s website has a special section for L. G. B. T. travelers with   and general tips, like to be discreet in rural areas of some countries, where there is a greater likelihood of problems, and to watch out for entrapment campaigns: “Police in some countries monitor websites, mobile apps, or meeting places, so be cautious connecting with the local community,” the website says. “Travelers who are well prepared often do the best,” Mr. Brosnahan said. Henry H. Harteveldt, a travel industry analyst and founder of Atmosphere Research Group, said that as a gay man he has never had a problem traveling for work to countries where homosexuality is illegal. “I knew where to ‘color within the lines’” to avoid potential problems, he said. But he added that he worried whether the changing political landscape in the United States might make travel more difficult. “For L. G. B. T. travelers, visiting some states will be like being in another country,” Mr. Harteveldt said. “And guess what? That’s going to have an impact on inbound tourism. ” Policies that curtail travel are “a ” Mr. Harteveldt said. “Destinations lose revenue and travelers lose valuable experiences. ” Some travelers remain undeterred. Do your homework, use social media, reach out to a destination’s local lesbian, gay, bisexual and transgender community and be prepared to respect different cultures, Mr. Gentil said. “But don’t be afraid to explore the world, because you just learn so much. ”'"}, "time": 1742564353.5798984}