{"duration": 0.15428662300109863, "input_args": {"text": "'MATURÍN, Venezuela  —   His name was Kevin Lara Lugo, and he died on his 16th birthday. He spent the day before foraging for food in an empty lot, because there was nothing to eat at home. Then in a hospital because what he found made him gravely ill. Hours later, he was dead on a gurney, which doctors rolled by his mother as she watched helplessly. She said the hospital had lacked the simplest supplies needed to save him on that day last July. “I have a tradition that in the morning of their birthdays, I wake up my children and sing to them,” his mother, Yamilet Lugo, said. “How could I do that when my son was dead?” Venezuela has suffered from so many ailments this year. Inflation has driven office workers to abandon the cities and head to illegal pit mines in the jungle, willing to subject themselves to armed gangs and multiple bouts of malaria for the chance to earn a living. Doctors have prepared to operate on bloody tables because they did not have enough water to clean them. Psychiatric patients have had to be tied to chairs in mental hospitals because there was no medication left to treat their delusions. Hunger has driven some people to  riot  —   and others into rickety fishing boats, fleeing Venezuela on reckless journeys by sea. But it was the story of a boy with no food, who had gone searching for wild roots to eat but ended up poisoning himself instead, that seemed to embody everything that had gone wrong in Venezuela. The country’s economic crisis had spent months encircling his family, only to snatch away its   son. His neighborhood, on the edge of what was once a prosperous oil boomtown, had long been running out of basics like corn flour and bread. The cutlery factory where Ms. Lugo had worked shut down in May because it could no longer obtain the materials to make plastic, joining many across the country that have gone idle. That left the family unable to buy what food was left. At the hospital, Ms. Lugo said, there was no respite. Like so many clinics throughout the country, the one in Maturín ran out of basic supplies like intravenous solutions, leaving the family to search the city and haggle with   sellers in the hours before Kevin died. “This boy dies this way for no reason at all,” said Lilibeth Díaz, his aunt, looking at Kevin’s grave, his name etched in wet concrete by a friend’s fingertip. Kevin is the baby in the overalls in the picture on his mother’s wall, the one who earned the perfect attendance awards. They still hang on the walls, too. The markers in the kitchen wall ticked off his growth. By 12, he was about 4 feet 11 inches by 14, he was four inches taller. His name is scribbled in child’s writing on a light switch in the bedroom he and his mother shared. “Active Kevin” says another doodle on a cabinet there. On her cellphone, Ms. Lugo stared at a picture of her embracing her son last year, on the front porch he had painted yellow. She has changed a lot since then. Her collarbone now protrudes from her neck. “I weigh 40 kilos now,” she said, 88 pounds. Kevin was losing weight, too. By spring, everyone in the family was. Then José Rafael Castro, Ms. Lugo’s boyfriend and the only other breadwinner in the household, came home with bad news: The construction supply factory where he worked making cinder blocks had let him go because the owners could no longer find cement. First, the family ate mangoes. By summer, it had turned to yuca, which grew in a plot owned by a relative a short bus ride away. “This was our food morning, noon and night,” Ms. Lugo said. By July, there was no money even for the bus fare to the field, the family said. It started looking elsewhere. Kevin’s birthday was coming up. The family knew this would be his first without a cake, but it had devised a solution: A neighbor down the street was celebrating a birthday and had offered to set aside a slice of cake for Kevin. Still, the family needed something to eat that night. It had gone three days without food, and everyone was growing weak. There were few options. This was not the capital, Caracas, where food was often scarce in the barrios, but at least there was always another shop or   seller to try. Nor was it the border, where foreign products could be bought. Instead, the family lived deep in Venezuela’s interior, where even cooking oil was scarce and products like bread and corn flour vanished almost as quickly as they arrived in stores. At times chicken was available, but the price was too high. Kevin and Mr. Castro had heard about an abandoned field a   walk from their home where other neighbors had been foraging for bitter yuca. As they emerged from the field, four men with pistols surrounded them and demanded their cellphones, Mr. Castro said. It was a narrow brush with disaster, and the two men breathed a sigh of relief that they still had the yuca. They did not know the worst was to come. The family knew the risks of bitter yuca and had tried to dry it to extract the toxins, a practice used to make a dried bread served locally. “We had nothing else to eat,” Mr. Castro said. But by 11:30 p. m. on July 25, the night before Kevin’s birthday, the family was getting sick. Mr. Castro said he was vomiting. Kevin was on the floor. Because they had no car, an hour passed before they found a neighbor’s car to take Kevin to the hospital. As he finally left, Kevin remembered the piece of cake. “I will be back tomorrow for it,” Ms. Lugo recalled him saying. Yuca intoxication is treated with gastric suction, also called stomach pumping, and intravenous solutions, among other measures. But Kevin’s family said he had waited untreated for hours in the crowded halls of the Manuel Núñez Tovar hospital, without being examined by a doctor. Dr. Luis Briceño, the hospital’s director, said it was a common situation at his hospital, which is stretched thin. Sometimes his emergency room, with a capacity for 200 people, is packed with 450 patients seeking help. “There is always someone who doesn’t receive treatment,” Dr. Briceño said. He said medical shortages were so common that patients often had to find and buy their own supplies, like intravenous solutions, though he thought the hospital probably had some the night Kevin arrived. But Ms. Lugo said a nurse had told the family to go out and buy the intravenous solution itself. Relatives found it from a   seller. The cost  —   about $4  —   was more than they could afford. Finally, another family with extra bottles of the solution gave two to Kevin, but there was little change in his condition. Around 4 a. m. on July 26, the morning of his birthday, Kevin could barely speak. “His stomach felt like stone,” his mother said. Ms. Lugo was alone with her son. She recalled a black liquid oozing from his mouth. Then, at 4:45 a. m. Kevin was dead. The next morning, Jesús Maestre, a    friend of Kevin’s, saw his friends gathered outside the hall in Kevin’s school. They were speaking in hushed tones. “They asked, ‘Did you hear what happened to Kevin? ’” he said. “Then it hit me  —   he was gone. ” Kevin’s coffin was trailed by a long parade of friends the day of his funeral, a path his mother retraces every Sunday when she visits the grave. On a recent day, she pointed out the Catholic church where he was baptized and the street he played on as a child. A cousin of his walked by. “Look at him,” she said. “They look exactly the same. ” And she said it again: “Since my mother raised me, and now with my children, we always had a tradition of singing ‘Happy Birthday’ in the morning. ” The day of the funeral, she sang the song before the coffin was lowered. “We did everything together,” Ms. Lugo said later, pointing to the headstone where her son’s name had been etched in wet concrete. Gesturing toward the empty plot beside it, she said, “They will bury me there one day. ” But back home, there were more mouths to feed. Ms. Lugo had given birth to another child two months before. Her    daughter, Kimberlit, had recently given birth, too. The two spent an afternoon nursing the babies together on the porch. That was the only food in the household. There was nothing in the kitchen.'"}, "time": 1742562809.1828864}