{"duration": 0.2129824161529541, "input_args": {"text": "'Polityka zagraniczna USA Thierry Meyssan Działania różnych urzędów Stanów Zjednoczonych na arenie międzynarodowej są często nieskoordynowane. Na przykład w Syrii, gdzie formacje stworzone przez Pentagon walczą przeciwko formacjom stworzonym przez CIA. Natomiast w dwóch sprawach: podziału Europy na Unię Europejską i Rosję, oraz podziału Dalekiego Wschodu na ASEAN i Chiny – działają one całkowicie zgodnie. Jakie są cele polityki zagranicznej USA i czy można przewidzieć ową politykę?\\nSieć Voltaire | Damaszek (Syria) | 29 października 2016 Deutsch ελληνικά English Español فارسى français italiano Português Türkçe русский Nederlands عربي Prognozując politykę zagraniczną USA na przestrzeni niemal stulecia, politolodzy dzielili polityków na izolacjonistów i interwencjonistów. Tych pierwszych zaliczali do „Ojców-pielgrzymów”, którzy uciekli ze starej Europy i chcieli zbudować nowy świat, oparty na wartościach religijnych, a zatem pozbawiony europejskiego cynizmu. Drugich zaś, do „Ojców-założycieli”, którzy nie tylko chcieli uzyskać niepodległość, ale i kontynuować na swój sposób projekt Imperium Brytyjskiego.\\nDzisiaj taki podział nie ma już sensu, albowiem nawet tak wielkie kraje jak Stany Zjednoczone nie mogą być samowystarczalne. Dlatego w USA jest już regułą potępianie politycznych przeciwników izolacjonizmu, i jednocześnie nie ma tam ani jednego polityka, z wyjątkiem Rona Paula, który by tej [izolacjonistycznej] linii chciał bronić.\\nSpory toczą się pomiędzy zwolennikami wiecznej wojny i wyznawcami wykorzystywania bardziej miękkiej siły. A jeśli wierzyć pracom Marcina Gilensa i Beniamina I. Paige’a, to dzisiejsza polityka Stanów Zjednoczonych jest prowadzona przez grupy interesów, niezależnie od woli obywateli [ 1 ]. Zgodnie z logiką, w sporach tych można dostrzec wpływy – z jednej strony – kompleksu wojskowo-przemysłowego, który dominuje w gospodarce Stanów Zjednoczonych, a z drugiej strony – firm korzystających z rozliczeń bezgotówkowych przy opłatach za swoją produkcję (oprogramowanie, hi-tech, rozrywka), która tak właściwie jest raczej produkcją wirtualną, niż realną, czyli firmy te pobierają haracz tam, gdzie nie ma wojen.\\nJednakże, taki punkt widzenia pozostawia z boku problem dostępu do użytecznych kopalin i źródeł energii, który był problemem dominującym w XIX i XX wieku, a dzisiaj, chociaż stracił swoją ostrość, to nie zniknął całkowicie.\\nPo ogłoszeniu „Doktryny Cartera” [ 2 ], która zalicza dostęp do węglowodorów na „Wielkim Bliskim Wschodzie” do kwestii „bezpieczeństwa narodowego”, Waszyngton stworzył CentCom [United States Central Command – Centralne Dowództwo Stanów Zjednoczonych], skierował do Zatoki Perskiej ponad 500.000 ludzi i ogłosił sprawowanie kontroli nad całym regionem. Wszyscy pamiętają jak Dick Cheney, upewniwszy się co do nieuchronności „peak oil” [szczytu wydobycia ropy naftowej], zaczął przygotowywać „arabską wiosnę” i wojny przeciwko tym państwom, które nie zechciały poddać się kontroli. Jednakże, polityka ta straciła sens, gdy tylko zaczęto ją prowadzić, albowiem Stany Zjednoczone, oprócz własnego wydobycia gazu łupkowego i ropy naftowej, przejęły dodatkowo kontrolę nad węglowodorami Zatoki Meksykańskiej. Dlatego w najbliższych latach Stany Zjednoczone nie tylko zostawią w spokoju „Wielki Bliski Wschód”, ale będą też zmuszone rozpocząć wielką wojnę z Wenezuelą, która jest jedynym krajem średniej wielkości, zdolnym konkurować, a nawet zagrażać [amerykańskiej] eksploatacji złóż w Zatoce Meksykańskiej.\\nW serii wywiadów dla „ The Atlantic ” prezydent Obama próbował uzasadnić swoją doktrynę [ 3 ]. Długo powtarzał jedno i to samo tym, którzy go oskarżali o niezgodność i słabość, zwłaszcza po sprawie „czerwonej linii” w Syrii. Rzeczywiście, powiedział on, że użycie broni chemicznej będzie czerwoną linią, której nie wolno przekroczyć, ale gdy jego administracja przekonywała go o tym, że Syryjska Republika Arabska zastosowała broń chemiczną wobec własnego narodu – Obama odmówił przystąpienia do nowej wojny. Nie wchodząc w dyskusję na temat zasadności tego oskarżenia, prezydent podkreślił, że Stany Zjednoczone nie powinny ryzykować życia swoich żołnierzy w tym konflikcie, i że zdecydował zachować ich siły do walki z prawdziwymi zagrożeniami dla narodowych interesów kraju. W tej powściągliwości tkwi cała istota „doktryny Obamy”.\\nCzymże są zatem owe „prawdziwe zagrożenia”? Prezydent nic o tym nie powiedział. Najlepiej będzie przyjrzeć się pracom Rady Wywiadu Narodowego USA ( US National Intelligence Council , NIC), pamiętając o sile wymienionych wyżej grup interesów. Okazuje się, że Stany Zjednoczone porzuciły stworzoną po 11 września „doktrynę Jerzego Busha młodszego” o globalnej dominacji, powracając do doktryny jego ojca – o przewadze handlowej. Po zakończeniu zimnej wojny (z woli jej uczestników), cały świat zajął się rywalizacją gospodarczą w ramach liberalnego systemu kapitalistycznego.\\nA dla większej pewności co do tego, że epoka konfrontacji ideologicznej jest już zakończona, prezydent Obama zbliżył się z Kubą i Iranem. Trzeba było zmniejszyć opozycyjność tych dwóch rewolucyjnych państw, które kwestionują nie tylko prymat Stanów Zjednoczonych, ale i zasady gry na arenie międzynarodowej. Nieuczciwość, jaką Stany Zjednoczone pokazały przy realizacji umowy 5+1, świadczy o tym, że nie chodziło im o irański program nuklearny, lecz jedynie o próbę przytrzymania na smyczy rewolucji chomeinistycznej.\\nTo właśnie w tym kontekście następuje powrót do „doktryny Wolfowitza”, zgodnie z którą dobre są wszelkie środki, które służą okiełznaniu konkurentów, w tym także Unii Europejskiej [ 4 ]. Strategia ta, jak się wydaje, była korygowana w miarę rosnących obaw Waszyngtonu, obserwującego uważnie przebudzenie się Chin. Dlatego mówi się o strategicznym „zwrocie na Daleki Wschód\", który ma polegać na przerzuceniu tam wojsk z Bliskiego Wschodu, żeby kontrolować region dalekowschodni i powstrzymywać Chiny. I chociaż Pentagon nie wspomina już o szalonym neokonserwatywnym planie pokonania Chin, to jednak zamierza on ograniczyć rolę ekonomiczną tego państwa i nie dopuścić do rozszerzania się jego politycznych wpływów na świecie.\\nJednakże to, co teraz widzimy jest zupełnym zaprzeczeniem strategii „zwrotu na Daleki Wschód”. Stany Zjednoczone z pewnością zwiększyły (nieznacznie) swoją obecność w regionie Azji i Pacyfiku, ale przede wszystkim zadbały o swoją silną obecność militarną w Europie Środkowej. A w czasie, gdy wojna wciąż szaleje w Palestynie, Jemenie, Syrii i Iraku, gdy zagraża nową pożogą Libii – zostaje rozpalony nowy konflikt na Ukrainie. Taki rozwój wydarzeń możemy zinterpretować na dwa sposoby.\\nZ jednej strony, możemy uznać, że zbliżanie się NATO do rosyjskich granic – i wojskowa reakcja Moskwy – niczym światu nie grozi. Rzeczywiście, angażowanie się w taki konflikt jest ryzykowne, a do tego zupełnie niepotrzebne. W takim wariancie, wojna na Ukrainie (wraz ze wszystkimi tymi sankcjami i kontr-sankcjami) nie będzie skierowana przeciwko Rosji, lecz będzie sztucznie sfabrykowaną – specjalnie dla Europy – projekcją rzekomego zagrożenia rosyjskiego, co pozwoli Stanom Zjednoczonym „bronić” swoich naiwnych sojuszników.\\nLecz, patrząc z drugiej strony, dobrobyt gospodarczy Stanów Zjednoczonych opiera się na ich kontroli nad światowym handlem, a w konsekwencji – na utrzymaniu morskich dróg handlowych [ 5 ]. Zaś Rosja i Chiny, chcąc się rozwijać, pragną uwolnić się od amerykańskiej kurateli, a w konsekwencji muszą otworzyć kontynentalne szlaki handlowe. Taka jest istota projektu [przewodniczącego Chińskiej Republiki Ludowej] Xi Jinpinga, zakładającego budowę dwóch jedwabnych szlaków, z których jeden ma docierać, jak w czasach antycznych, przez Azję Środkową, Pakistan, Iran, Irak i Syrię do Morza Śródziemnego, a drugi ma prowadzić przez Rosję do Niemiec. Obie te drogi są dziś zablokowane: przez IPIS (ISIS) w Lewancie i przez Ukrainę w Europie.\\nKwestia kontroli nad morskimi szlakami handlowymi stanowiła centralny punkt strategii amerykańskiej na początku XXI wieku, przy wsparciu piratów z Rogu Afryki [Półwyspu Somalijskiego] [ 6 ], a strategia ta skończyła się fiaskiem, gdy Moskwa i Pekin skierowały swoje okręty wojenne do tego regionu. Jednakże, mimo, iż Chiny mają do dyspozycji [od 2015 r.] dwukrotnie powiększone przez Egipt koryto Kanału Sueskiego, to przejście przez cieśninę Bab-el-Mandeb, pozostające oficjalnie pod kontrolą Republiki Dżibuti, kontrolowane jest w rzeczywistości przez Al-Kaidę za pośrednictwem Islamskiego Emiratu Mukalla [miasto Al-Mukalla na wybrzeżu Jemenu zostało zdobyte w kwietniu 2016 r. przez wojska Arabii Saudyjskiej – przyp. tłum.].\\nOprócz kontroli morskich szlaków handlowych, należy też uwzględnić kontrolę nad operacjami finansowymi. W tym właśnie celu Ministerstwo Sprawiedliwości Stanów Zjednoczonych ogłosiło zasady, które Amerykanie starają się stopniowo narzucić bankom na całym świecie. Lecz tutaj także Rosja stworzyła swój własny system płatności Swift, natomiast Chiny zrezygnowały z wymienialności swojej waluty na dolary, by nie dać się skrępować amerykańskimi przepisami.\\nJeżeli ta analiza jest prawidłowa, to wojny w Syrii i na Ukrainie trwać będą dopóty, dopóki Rosja i Chiny nie utorują sobie chociaż jednego bezpiecznego kontynentalnego szlaku handlowego do Europy Zachodniej. Właśnie w tym kontekście należy postrzegać wysiłki Stanów Zjednoczonych, podejmowane dla przeciągnięcia do ich obozu Białorusi, przeciwko której Amerykanie tak długo występowali. – Jest to jedyny sposób na poszerzenie ukraińskiej zapory i zbudowanie szczelnej przegrody pomiędzy Europą Zachodnią i Wschodnią.\\nZ tej perspektywy widzimy, że negocjacje handlowe, jakie Stany Zjednoczone prowadzą z Unią Europejską (TTIP) i państwami ASEAN (TPP) nie mają na celu umocnienia ich wymiany handlowej. Wręcz przeciwnie: ich celem jest wyeliminowanie z rynku Rosji i Chin. To niepojęte, że Europejczycy i Azjaci skupili się na wyborze standardów produkcyjnych, a nie na żądaniu udziału Rosji i Chin w tychże negocjacjach.\\nI wreszcie, końcowy wniosek jaki należy wyciągnąć z wywiadów Obamy dla „ The Atlantic ” sprowadza się do tego, że Stany Zjednoczone zamierzają odnowić swoje sojusze i dostosować je do nowej doktryny strategicznej. Dlatego np. popieranie reżimu Saudów, którzy gwarantowali dostawy ropy naftowej z Bliskiego Wschodu, nie jest już dla Amerykanów żadnym interesem i staje się nawet ciężarem. Podobnie jak „specjalne stosunki” z Wielką Brytanią, które niegdyś miały wielkie znaczenie dla warunków kontroli nad oceanami (Karta Atlantycka) i przy próbie ukształtowania świata jednobiegunowego (wojna w Iraku) – lecz dzisiaj nie są już żadnym konkretnym interesem i muszą być ponownie przemyślane. Nie wspominając już o kosztownym popieraniu Izraela, które nie służy już realizacji celów na Bliskim Wschodzie, i które może nie być kontynuowane, jeżeli Tel Awiw nie okaże się przydatny w innych częściach świata.\\nPowyższe uwagi nie uwzględniają obecnej kampanii prezydenckiej w USA, w której ścierają się: kompleks wojskowo-przemysłowy i ideologia WASP-owska, reprezentowane przez Hilarię Clinton, oraz, z drugiej strony, przemysł bankowych systemów płatności bezgotówkowej (toll industry) i zwolennicy umowy społecznej pt. „American dream”, reprezentowani przez Donalda Trumpa [ 7 ]. Agresywny charakter tej kampanii świadczy o konieczności przywrócenia równowagi między tymi siłami po okresie niepodzielnej dominacji militarystów (od 1995 r.).\\nGdy obóz reprezentowany dzisiaj przez Trumpa wreszcie wygra, to powinniśmy zobaczyć zakończenie wojen [ 8 ], ale i erupcję despotycznego przymusu wnoszenia opłat z powodu istniejących patentów i praw autorskich. W przypadku zaś, gdy zwycięstwo tej grupy zostanie odsunięte w czasie, Stany Zjednoczone będą miały do czynienia z powstaniem rozwścieczonej ludności i zamieszkami. A wówczas przewidywanie polityki zagranicznej USA stanie się szczególnie trudne.\\nThierry Meyssan Tłumaczenie\\nGrzegorz Grabowski\\nPolski blog'"}, "time": 1742561906.7104728}