{"duration": 0.11727786064147949, "input_args": {"text": "'posted by Eddie The universe can be a funny place sometimes. I’ve been doing a lot of research about a form of mental abuse that a lot of us are not only susceptible to, but actually deal with every single day. It is one of those things that we don’t even realize is happening to us, we just see the results: self-doubt, diminished self-esteem, and reduced self-worth. The world has a way of beating even the best of us down from time to time but this specific form of manipulation is one that can be identified and removed from our day-to-day existence. PLANTED SEEDS OF DOUBT Back in 1938, there was a play called “Gas Light” that was later adapted into a movie in 1944. In the story, a husband works diligently to convince his wife and their acquaintances that she is insane by making very small and subtle changes to their environment. When the wife would point out the changes, the husband convinced her that she was wrong about the changes and that she was crazy. Slowly but surely, the wife starts to give in to the self-doubt created by those subtle changes, namely a gas lamp that the husband keeps dimming, hence the term “gaslighting”. OUR PERCEPTION IS OUR REALITY In the play, the key was the husband’s ability to alter the wife’s perception of reality. She saw the lamp as being dimmer and the husband assures her that it is not. He made he doubt her perception, and therefore her reality. It is a form of mental abuse that people too often don’t even realize what is happening to them. For the perpetrator, the ability to control the victim’s own perceptions of themselves and the things around them allows them to control the victim themselves. In reality, it happens every single day. It’s all around us. How many advertisements do you see that claim that using their product will somehow enhance your life? That’s a mild form of gaslighting. You are made to think that some aspect of you or your life is incomplete. You are made to DOUBT yourself. Further, you are made to think that whatever product is being peddled is the solution to what is supposedly lacking in your life. GASLIGHTING IN OUR LIVES The specific situation that inspired this article involved one of the most beautiful and amazing women I have ever known dealing with a break up from a man that never deserved to be with her in the first place. I explained to her that there are people in our lives who will try to break us down to be on their level . So, what is the answer to gaslighting? MAINTAINING YOUR OWN REALITY THROUGH YOUR OWN PERCEPTIONS. I’ll tell you now, the same thing I told her: You see, my friend, there are people in this world who will look at a unicorn and think to themselves, “woah, that is a unicorn, which is something I will never be.” They will try to convince you, the unicorn, that you are just an average horse like them with a weird growth on your head that you should probably get checked out by some kind of medical professional that deals with head growths. They will try to steal your magic and make you as dull and ordinary as the plain, old horses that they are. Because they need you to be a plain, old horse like they are, just to bring you down to their level… As we’ve established: you are not just a plain,old horse. You are not a fast race horse. You aren’t even one of those fancy British horses that those chicks in those hot pant/knee-high boot getups use to jump over stuff… YOU ARE A UNICORN. DESPITE WHAT ANYONE ELSE SAYS. YOU ARE ONE IN 7.4 BILLION, AND THAT IS A BEAUTIFUL THING. source:'"}, "time": 1742562548.0468502}