{"duration": 0.07117390632629395, "input_args": {"text": "'The California taxman wants add to taxes on space travel on top of taxing land, buildings, businesses, income, transportation and the air we breathe. [Not satisfied with being the   state in the nation, the clever folks at the Franchise Tax Board disclosed their intention to begin taxing the “Apportionment and Allocation of Income of Space Transportation Companies” under a new addition to the state tax collection enforce “Code of Regulations. ”  With space is internationally defined as all the infinity that is 62 miles or more above the earth, the 21st century commercial opportunities for the development of space seem to be creating a new lust among California lawmakers to find a whole new source of revenue. The Franchise Tax Board is proposing to tax the movement or attempted movement of people or property  —   including, without limitation, launch vehicles, satellites, payloads, cargo, refuse, or any other property  —   to space. In November, California voters passed Proposition 55 to extend the “temporary” 13. 3 percent top state tax rate on   earners until 2030, helping the state retain the highest marginal tax rate in the nation. But the state also has the highest collections in the nation for property tax, sales tax, business tax, cap and trade tax and tax on aiplanes during the minutes that they travel in the state’s airspace. California’s local governments have also been clever in tacking on novel new revenue schemes from such items as soda and plastic (or paper) bags. In 1966, the Beatles’ George Harrison wrote lyrics for the song “Taxman,” which appeared as the first track on the Revolver album. It became the theme song for a U. K. rebellion against the British Labour Party, which had set an astronomical top income tax rate and surcharge of 98 percent while Harold Wilson was Prime Minister in 1974. Those high tax rates led to most of the members of the Beatles, the Rolling Stones, and other top stars of the 1960s British music scene going into a form of tax exile out of the country. Harrison’s most iconic lyrics iconic include: If you drive a car, I’ll tax the street, If you try to sit, I’ll tax your seat. If you get too cold I’ll tax the heat, If you take a walk, I’ll tax your feet. Don’t ask me what I want it forIf you don’t want to pay some more‘Cause I’m the taxman, yeah, I’m the taxman, The current space tax is supposedly designed to only hit companies operating in California that generate at least 50 percent of revenue from space transportation. But the tax, if enacted, will undoubtedly be expanded later, and it would also apply to any    company that launches a missile from the Vandenberg Air Force Base Space Launch Complex. Vandenberg launches have big advantages for commercial space missions because they fly southward, allowing payloads to be placed in polar and   orbit. That allows full global coverage that is difficult to achieve through launches at Cape Canaveral’s Kennedy Space Center, where missiles must fly eastward to avoid risks to major population centers.'"}, "time": 1742564563.6052887}