{"duration": 0.15174341201782227, "input_args": {"text": "'Home | World | Experts: ISIS is Root of True Islam and Cannot be Defeated by Guns Alone Experts: ISIS is Root of True Islam and Cannot be Defeated by Guns Alone By Donnie Patton 23/11/2016 10:35:41 \\nLONDON – England – The Global War Analysis think tank summarises the futility of trying to fight an ideology or belief system like ISIS with weapons and military force. \\n\\n\\nThe Sunni Muslims were the first, then came the Shiites who bastardised the Islamic religion to their own dastardly vision. \\nISIS is the root of the current war raging in the Middle East between Sunnis and Shiites, and as much as the Shia faction is supported by Russia and Iran, the Sunni original interpretation of Islam is the dominant one. \\nYou can destroy buildings, bomb people, but you can’t destroy an ideology, an idea or a belief with military weaponry. You would simply be shooting into thin air. \\nThis is the fundamental mistake of any military campaign to ‘destroy’ ISIS, and any military action would ultimately fail, as the numbers of followers are too great. You can wipe out a thousand people, when two thousand will take their place, and so on. \\nRegarding the actions of ISIS, these are seen by the West as atrocities, however, they have very cleverly masked their own atrocities committed in the name of Christianity in the past, which would far surpass any ISIS demonstration of violence. \\nLet us also consider the fact that any ISIS member views what is permissible in the West as ultimately satanic, they live pious puritanical religious lives, but the satanic Westerner does not, instead he indulges in adultery, homosexuality, alcohol, drugs, pornography, gambling, debt and many other vices. To most Muslims these are seen as Haram, forbidden, and every facet of Western culture holds a permissive attitude to these vices. Therefore, to look through the eyes of these Muslims, what they are fighting against is a great impurity, a great sin against humanity. In their eyes, beheading or burning alive someone who indulges in these activities is almost a cleansing of the earth. Remember that Islam as a religion is almost 400 years behind Christianity in development as a semi-organised religion and the Christians have already passed through the beheading phase. \\nThis is why they commit these acts of extreme violence, because they are indoctrinated from birth to be pure, and to fight against impurity, which is what the West is defined as in Islam, an impure satanic entity. \\nOne could also argue that a clinical strike from 30,000 feet by a drone removes the nastiness of close up killing, and you would be right in your assumption, however at ground level where the bombed Muslims reside, they see first hand the damage these clinical strikes create. To them, it is all too real, the mangled bodies, charred beyond belief, and remains of those bombed. Yet, the Western operators of these drones simply see a puff of smoke, an explosion, then move clinically onto the next target. Is there an intrinsic difference to a clinical strike or a beheading by a sword? Both acts deal death, only the Islamic act is sensationalised on film, and the clinical strike is hidden behind a cloud of smoke and debris. They are both the same acts intrinsically because they take away life, albeit with different techniques. \\nHere comes the crux of the problem, and that is how does one defeat ISIS? The only way it can be defeated is for every Sunni Muslim in the world to be slaughtered, and for Saudi Arabia to be completely destroyed. It is a well known fact , that Saudi Arabia and other Gulf states fund ISIS, and to defeat them would be a massive task for the West, seeing as they have armed these countries with trillions of dollars of high end weapons. \\nFurthermore, we have the silence of Israel. This silence at the atrocities committed against other Muslim factions by ISIS is quite understandable, because Israel does not necessarily see anything wrong with these actions. As far as Israel is concerned there’s some Islamic cleansing going on, and as long as ISIS is not knocking on their door, they should be positively encouraged and supported to carry on killing other Muslims. \\nDonald Trump the upcoming president of the United States says he will defeat ISIS by joining with Russia in the quest, but they will be proved wrong, as mentioned earlier, you cannot defeat an ideology or belief with guns and missiles. You might as well throw trillions of dollars down a well, because the only way to completely eradicate an ideology and belief system is for complete global cleansing of 90% of the Muslim population. That amounts to approximately 1.5 billion people worldwide. Not only that, once 1.5 billion Sunnis are supposedly eradicated, all copies of the Quran would have to be destroyed as well and completely erased from human consumption, almost amounting to an impossible task in itself. \\nWithin the realms of the battlefield, ISIS is almost amorphous, they blend into the background, and can move easily. There are elements all over the globe now thanks to Obama’s eight year rule of nonchalance, and thanks to the EU’s Schengen zone, a corridor for free movement of arms and drugs, many have infiltrated Europe. \\nSuffice to say, it is the West’s own policies that have created the vacuum for ISIS to flourish in the Middle East and as much as there are budgetary and time constraints on the West, the Muslims have all the time in the world. They in fact wish upon the West to be entrenched in this war for as long as they bleed it dry economically. \\nWelcome to the next thousand years, this fight will never end, and maybe that is a good thing for some Western commanders, who depend on the arms trade, and who encourage warfare for defence spending increases. \\nYou cannot bomb an ideology or belief system. If you think so, you have already lost. Share on :'"}, "time": 1742563839.4268124}