{"duration": 0.057325124740600586, "input_args": {"text": "'\\nThere is every reason to think that there is some fudging going on at polls across the country tonight.\\nThere may be too much to keep up with, but there is every reason to question how this irregularities could affect the outcome.\\nFox News reports computer and electronic machine malfunctions in several key battleground states, including North Carolina, Nevada, Pennsylvania, Utah and beyond:\\nSporadic complaints of equipment failures and long lines greeted voters across the country Tuesday as they headed to their polling centers to cast their vote – though the largely routine glitches didn’t stop some from claiming the system was “rigged.” \\nRepublican candidate Donald Trump, who has repeatedly claimed the election process is fixed, filed a lawsuit in Nevada alleging that last week, a Clark County polling station was illegally left open late , potentially boosting Democratic voter turnout. He also tweeted Tuesday evening about voting issues in Utah.\\n[…]\\nElection officials in Utah said voting machine problems in the southern part of the state forced poll workers early in the day to use paper ballots . A computer problem in Durham County, North Carolina — a Democratic stronghold in a state that has been a key battleground in the presidential race — triggered long lines when election officials had to rely on a paper check-in process.\\nCBS News is reporting on a number of issues as well, including broken voting machines – and last minute replacements – in Michigan, also a battleground state that could sway the election:\\nCity Clerk Janice Winfrey says some voting machines in Detroit stopped working Tuesday morning and had to be replaced.\\nThe delay caused long lines and waits of an hour or more to vote.\\nWinfrey says her office received about 50 calls for broken voting machines, but some were repeat calls for the same machines she describes as a decade old.\\nIn Texas, poll watchers are reportedly being segregated and prevented from their duties of accountability. perhaps the above photo says it all:\\nAccording to Laura Pressley , who is closely tied to voting accountability efforts in the state:\\nTexas–Official poll watchers from the Republican and Libertarian Parties have been obstructed from monitoring the Central Counting Station main tabulation computers and the audit log printers in Travis, Dallas, and Bexar counties. See the Hill County sign that says it all. Watchers are battling with Secretary of State’s office on the interpretation of Texas Election Code statute 33.056…poll watchers are “entitled to observe any election activity.”\\nAccording to the Texas Election Code :\\nSec. 33.056. OBSERVING ACTIVITY GENERALLY. (a) Except as provided by Section 33.057, a watcher is entitled to observe any activity conducted at the location at which the watcher is serving. A watcher is entitled to sit or stand conveniently near the election officers conducting the observed activity. \\nThere’s a lot of weird stuff going on, and a lot to be gained and lost tonight.\\nIn the end, it will be the electoral college votes, not the popular vote, or the polls that determine who takes office, and unfortunately, the tables are tilted towards Hillary. And the right amount of editing could tip the scales.\\nHere’s the latest projection map from 270towin.com:\\n\\nRead more: \\nNo One Can Stop Her… And She Knows It: “This Election Won’t Be Fair” \\nDivided America Poised For Riots: “95% Chance of Widespread Post-Election Violence” \\nThis Is a Usurper, Not a Candidate: California Primary Was Stolen, And Hillary’s “Nomination a Coup” \\nProtesters Rage Against the DNC: “Hillary Didn’t Get the Nomination. The Nomination Was Stolen” '"}, "time": 1742562069.7864978}