{"duration": 0.06762981414794922, "input_args": {"text": "'Tuesday 22 November 2016 by Thomas Gane Regretful Brexiter realises he actually just really missed old Top Gear \\nA previously passionate and angry Brexiter has realised he never really wanted to leave the European Union, and actually just had a lot of pent-up feelings about Top Gear . \\nSimon Williams, 32, stayed in on Friday evening to watch the first episode of Jeremy Clarkson, James May and Richard Hammond’s new series, The Grand Tour , on Amazon. \\nFollowing the programme he was surprised to find himself horrified at the Brexit stories that he had up until this moment aggressively supported. \\n“After I watched The Grand Tour I felt amazing,” he explained to reporters. \\n“It was like reaching an itch I’d been desperately trying to scratch for a year and a half.” \\n“Then I checked the news and it was awful. Leaving the EU is going to have some really horrible consequences for our country, and I think I supported it because I had a lot of unresolved feelings about Top Gear . \\n“Looking back, I think I actually just wanted to hear Clarkson talk about political correctness, steak and Argies, and the Brexit rhetoric was a surrogate for that. \\n“It’s a little embarrassing actually” he added. “My mates in the Whatsapp group are feeling the same. Is there anyway we can take it back?” \\nProfessor Scott Chegg from the University of Bristol said this conforms to the ‘safety-valve’ theory of politics. \\n“In the same way a lefty might read The Guardian or watch a documentary about cetaceans with anxiety issues to feel better about themselves without changing anything, it seems Top Gear was a way for people to let their right-wing grievances out in manageable chunks,” he told us. \\n“Without Top Gear , the pressure built to a dangerous level before exploding as Brexit. \\n“It’s like a man who feels very angsty for an unknown reason, starts drinking, gets into a fight, sets his house on fire and steals a car before driving it off a cliff,” Professor Chegg explained. \\n“If he’d just had a wank and gone to sleep everything would have been fine.” \\nReports from social media suggest a similar wave of stomach crushing realisation is happening in America as The Grand Tour gains traction there. \\nAt the time of writing, Mr Williams was ordering Article 50 For Dummies on Amazon Prime. \\n“I spent £70 on it,” he said. “Best use it for something else.” '"}, "time": 1742564266.1599028}