{"duration": 0.26103949546813965, "input_args": {"text": "'Why Obama Will Win Jared Taylor, American Renaissance, August 2008 \\nIt is time to get used to the idea that the next president of the United States will be black. Why will a nation we are so often assured is “racist” elect a black president? And will it make a difference? \\nEver since Hillary Clinton dropped out of the race, the polls have reported consistently that Barack Obama will beat John McCain. The media love to tell us that whites say they support the black candidate and then vote for the white, but there is no reason for whites to lie in this campaign. Mr. Obama will not get a majority of the white vote but he will get enough to beat Mr. McCain. Why will so many whites vote for Mr. Obama? \\nFirst, some support his policies. They want to end the war in Iraq, and they want the standard liberal program of socialized medicine, higher taxes, more handouts, and more government. There has always been a substantial minority of whites who vote this way, and they have a clear favorite in Mr. Obama. \\nSecond, as many people have pointed out, an enormous number of whites think it is deeply virtuous to vote for a black—not for an out-and-out race man such as Jesse Jackson or Al Sharpton, but for an unthreatening, well-scrubbed black who speaks standard English and promises to “bring us together.” Even if they live sharply segregated lives, whites thrill to the language of “coming together,” and they adore blacks who don’t act or sound black. \\nFor many whites, voting for Mr. Obama will be an act of high patriotism. Electing him will prove America is not “racist,” and many whites believe that rising above “racism” is America’s sacred calling. One must never underestimate the importance to whites of feeling virtuous. Most would rather lose a leg than be thought a “bigot,” and a vote for Obama is a painless way to burnish anti-racist credentials. \\nThird, young whites will line up for Mr. Obama. They have been swallowing anti-white, multi-culti propaganda all their lives and have not knocked around enough to discover it is false. Some who know their parents will vote for Mr. McCain will make a special point of voting for Mr. Obama. Every new generation thinks it is cooler, hipper, and wiser than any generation that ever lived, and what could be cooler, hipper, or wiser than putting a black man in the White House? For many young whites, a vote for Mr. Obama will be a denial of every uncool, unhip, and especially every even faintly race-realist thing their parents ever said or did. \\nFourth, although the country seems to have a collective memory of no more than two weeks, Americans think everything is “historic.” Whenever someone breaks an obscure record in professional baseball we are told history was made. If you ask someone why he waited in line all night to buy the first Apple iPhone he will tell you it’s a “historic” product. Americans love anything that is “historic,” and for people who think a few more stolen bases are “history” right up there with the Battle of Lepanto, putting a black man in the White House will be the discovery of America, Pearl Harbor, and the Second Coming all rolled into one. Many whites will vote for Mr. Obama because they want to think they helped “make history.” \\nThe media, which has its own grim reasons for supporting Mr. Obama, is mesmerized by the same prospect. Editors salivate at the thought of writing headlines like “History is Made” the day after the election, and some will lose all self-control and add an exclamation mark. The emphasis, of course, will be on Mr. Obama as the first black president, implying more to come. The media, which always subtly boost the Democrat, will be even more blatantly partisan this time, downplaying every blunder Mr. Obama makes and highlighting Mr. McCain’s. \\nFifth, many whites will vote for Mr. Obama—or at least not vote for Mr. McCain—because the Republicans have nominated the most stunningly unattractive candidate in years. Old and pock-marked, Mr. McCain is thoroughly disliked in the Senate for arrogance that he cannot even hide from voters when he is not speaking from notes. He has dismayed Republicans by promoting amnesty for illegals, and dismayed everyone else by saying America should stay in Iraq for 100 years if it takes that long to “win.” Mr. Obama therefore has the enormous advantage of running against an opponent that not even Republicans like. \\nMr. Obama will also crush Mr. McCain in face-to-face debates. Mr. McCain cannot put an unscripted sentence together any better than George W. Bush can, and will come across as a thick-witted geezer. Mr. Obama, who is as glib as any politician, gives credence to H.L. Mencken’s definition of democracy as “rule by orators.” \\nBut what about America’s storied “racism”? Isn’t America brimming with people who can’t bear the thought of a black president? Americans have been numbed for decades by attractive television-blacks who read the news, forecast the weather, and tell us which brand of toothpaste to buy. Americans get a steady diet of heroic movie-blacks who outsmart and beat up white brutes, solve baffling technical problems, dispense sage advice, and save the world. Even the current Miss USA is black. There are millions of whites who do not want to live with blacks or have much to do with them, but would a black president be much different from nearly eight years of black secretaries of state? The march of blackness may be vaguely worrying to whites but they think there is nothing they can do about it and that they shouldn’t even if they could. \\nThe final reason why whites will vote for Mr. Obama is that the Republicans do not have the backbone to attack him in the only way that would work. If they were serious, they would fill the airways with Jeremiah Wright prancing and raving, along with the message: “This is the man who married Mr. and Mrs. Obama, baptized their children, and whom Mr. Obama calls a ‘family member’.” They would buy radio ads quoting Michelle Obama’s thesis in which she says she will always be black first and American second. Mr. McCain has nothing like the stomach for a campaign like this. \\nMany blacks probably think he has the stomach for considerably worse: 57 percent think Mr. Obama is in greater physical danger than any white politician, and many say they would have warned him not to run, for fear he would be killed. An assassination would certainly be a shattering event. There is no telling how many cities would go up in flames, and Third-World countries, which have followed the Obama nomination with unprecedented interest, would help make it the most widely reported killing in history. (I have just returned from a Muslim country in which everyone has heard of Mr. Obama and likes him, but most have never heard of John McCain.) Whatever gruesome fantasies blacks may be spinning, however, assassination has gone out of style in America, and white resistance—such as it is—is dependably nonviolent. Mr. Obama will be perfectly safe. \\nIn any case, Mr. Obama will win far more white votes than he will lose because he is black. Whites who don’t want a black president would not vote for a Democrat anyway. As for black voters, even nominal Republicans are said to be running for the doors, but strictly racial voting has always been fine for blacks. Not so for whites, of course. Just try telling your co-workers that you disagree with Mr. McCain but are voting for him because he is white. \\nRacially conscious whites will be in a quandary in November. Even if Mr. McCain’s policies are worse than Mr. Obama’s should they vote for the white man—one with an adopted Bangladeshi daughter and who long ago betrayed white interests? Even after years of being softened up with black heroes and figureheads, a black in the White House is a powerful symbol of white dispossession. A mulatto president is an almost explicit endorsement of miscegenation. This is bitter medicine. \\nSome whites have argued that a black president would undercut the charges of “racism” whites are forever facing, but they are dreaming. The entire government could look like a meeting of the Mystic Knights of the Sea, but as long as blacks are worse off than whites we will be blamed for it. Sensible whites cannot cheerfully vote for either man; I suspect most will stay home or vote for a minor candidate. \\nAside from the symbolic impact, which cannot be calculated, will President Obama be much different from a President Hillary Clinton? She would lard her cabinet with blacks and Hispanics, nominate ultra-liberal judges, push for amnesty, grovel before non-whites everywhere, and load up the “civil rights” division of the Justice Department with anti-white sharks. She would certainly make a bigger fool of herself over Hispanics and Asians (see “ Turning Up the Pressure ,” AR, May 2008). Our choice, therefore, could not be more disagreeable. On balance, we get to decide which is the more degrading spectacle: deluded white people giving their country away or clear-eyed blacks helping themselves to it. \\nPresident Obama will, however, face special pressures. He can’t let the pushier brothers walk all over him, but he will have to throw them enough bones to keep them off his back. It will be a tricky balance. Mr. Obama’s first annual address to the NAACP will be a love feast, but every year after that it will be harder to explain why black unemployment, poverty, and incarceration rates haven’t changed at all. \\nEven Mr. Obama’s star-struck white supporters will eventually wonder what happened to all that “change” he promised. There is not going to be change. The system is far too stuck in its self-serving ways for that. With the help of an enlarged Democratic majority in Congress, Mr. Obama may set up some wheezing, byzantine form of socialized medicine, but no one will be happy with it. If Mr. Obama inherits a sick economy, a weak dollar, expensive oil, and shrinking revenues, Americans will not at all like the change they get. \\nOn the bright side, with Mr. Obama we have a good chance of piquant First-Lady behavior. What will the White House be like with Michelle in charge? Will she want a new exterior paint job? How and whom will she entertain? Will the Big Man’s guest bedrooms—in the African tradition—be turned over to third cousins from Kenya and the South Side of Chicago? There is no telling with what improprieties large and small Mrs. Obama will entertain us as she makes up her mind whether she is an American. \\nIt will be an edifying presidency; and whites may be a little less deluded in 2012.'"}, "time": 1742562189.6406033}