{"duration": 0.03754854202270508, "input_args": {"text": "'Email \\nWell, if this doesn’t inspire you to do your civic duty, nothing will! \\nWhen California resident Candice Payne woke up this morning, she wasn’t totally sure she was up to going through the hassle of voting. She figured the lines would be long, the wait would be awful, and the stress probably wouldn’t be worth it. But just when this 26-year-old woman was feeling too lazy to vote, something absolutely amazing happened—her ovaries burst out of her body and dragged her to the polling place. \\nAmazing! Now THAT is how you rally on Election Day! \\nLike so many Americans, Candice spent her morning lying in her bed, kicking herself for not having voted early, but as soon as it seemed like she’d go back to sleep, her fallopian tubes shot out of her abdomen, curled themselves around the side of her bed, and threw her to the floor. After dragging her body to her living room, her helpful ovaries crawled up to the doorknob and jostled the front door open. What started out as a lazy morning ended with her ovaries anchoring themselves to the floor and pulling the rest of her body to a polling place at nearby Jefferson Public School, where she dutifully filled out her ballot for President of the United States! \\nIf that’s not getting out the vote, we don’t know what is! It’s definitely easy to come up with a million excuses to avoid the polls, but once Candice’s ovaries had shot out of her body, they weren’t going to retract back inside until she had done her civic duty! \\nWhile it might have been a bit of an inconvenience to spend the morning voting, no matter how much she tried to resist, Candice’s ovaries kept pulling and clawing at the floor, dragging her flailing body farther and farther until she arrived at a voting booth to cast her vote. Sure, she would rather have been sleeping, or at work, but three miles and several forceful tugs later, she was inside a voting booth and back on her feet, casting her ballot, and exercising her fundamental American right. \\nAwesome. If you’re thinking of just staying inside, going to work, and skipping the polls altogether, it’s not too late to change your mind. Candice felt just like you once, but after being violently dragged by her ovaries to a polling station, she’s never felt better!'"}, "time": 1742563826.4185357}