{"duration": 0.02709197998046875, "input_args": {"text": "'November 17, 2016 \\nGlobal financial markets were in turmoil today after a Leeds bus driver announced that ‘I’m not the f*@king Bank of England, mate’, after a passenger tried to pay for a £2.80 fare with a ten pound note. The surprise revelation triggered an immediate worldwide crash, as speculators and investors reacted to the shock news that the bus driving community was not responsible for maintaining the monetary and financial stability of the nation, as had been previously thought. \\n‘This news has sent a tremor through the banking system, as bus drivers have been the custodians of British currency since 1634,’ noted financial historian Michael Porteous. ‘It should have actually been 1631, but Frank was three minutes late leaving the Kirkstall Road depot this afternoon due to roadworks on the A65’. \\n‘Drivers are given updates every minute from the major global stock exchanges, relayed to them on tiny screens attached to their rear view mirror’, continued Porteous. ‘This allows them to make split-second adjustments, releasing particular coins into general circulation from those little trigger dispensers if more liquidity is required, or retaining them to meet government monetary targets. More bloody retention than releasing, you say? I couldn’t comment.’ \\nUp until recently drivers were trained up to ask belligerently ‘Have you NOT got anything less?’ when any note was offered as payment, before throwing a fistful of low-denomination copper at passengers. They were also mandated to regularly drive past bus-stops full of pensioners on rainy Fridays between 9-11am, if inflation targets had been overshot. ‘Their role in ensuring the financial system runs smoothly shouldn’t be under-estimated,’ concluded Porteous. ‘That’s why your bus driver never even acknowledges you when you get on and looks fixedly into the middle-distance – they’re making complex split-second asset purchase calculations. Alternatively, it may be because they despise you, with that pathetic excuse of a hail that you do, arm half bent and shaking, every sodding day, before getting on and trying to pay with a bloody twenty for your pathetic one-mile journey. For Christ’s sake, can’t you look for some pound coins before you leave, you selfish, middle class tw@t.’ Share this story... \\nPosted: Nov 17th, 2016 by chrisf Click for more article by chrisf ..'"}, "time": 1742628500.4007785}