{"duration": 0.15473723411560059, "input_args": {"text": "'Chris Bosh, one of the top players in the N. B. A. has never caused trouble for his team, on or off the court. He has won two N. B. A. titles and been selected for the   Game 11 times. The Miami Heat, however, do not want him to step on the court for them this season, or perhaps ever again. In one of the strangest and most ethically challenging standoffs in sports history, Bosh and the Heat are locked in a dispute over whether he should be deemed medically fit to play after dealing with serious health problems. With training camp scheduled to start this week, Bosh says he is ready to go. The Heat say he is not. Bosh’s last two seasons have been cut short by blood clots. He has indicated that he has worked with a private physician to devise therapies that would allow him to play. The Heat are less certain. Bosh is owed about $76 million over the next three seasons whether he plays or not. So if the team is, in fact, looking out for Bosh’s welfare, it suggests an exception to what is perhaps a more common practice of pro sports franchises: pushing players to compete regardless of medical concerns. The Heat announced their conclusion, citing a medical exam, after Bosh’s recent emergence from a   cocoon of silence to wage a public battle with the team’s medical staff. Bosh has done several interviews with Uninterrupted  —   his former teammate LeBron James’s digital platform for athletes  —   in which he has sought to make his case. “Yeah, I’ll be there,” he said about training camp on a recent Uninterrupted podcast. “Will I be cleared? I don’t know. That’s out of my hands. I will play basketball in the N. B. A. I’m confident. ” People with blood clots typically take   medication, which is probably one of the most daunting hurdles for Bosh. Athletes who are on blood thinners are advised to avoid contact sports because of an increased chance of internal bleeding and other complications. Even an elbow to the ribs could cause significant damage, said Dr. David Forsh, the chief of orthopedic trauma at the Icahn School of Medicine at Mount Sinai in Manhattan. “There are a lot of risks,” he said. Bosh experienced his first known clotting problem in February 2015. He had cramps, spasms and shortness of breath, although he tried to hide his symptoms, he said. Bosh recalled one particular instance when he was in pain until 3 or 4 in the morning and the Heat were scheduled to face the Dallas Mavericks the next day. Bosh played because the Heat were already  . “Not the best thing to do,” Bosh said on the podcast. He added: “One thing about athletes  —   and I don’t know what it is about us  —   we ignore pain, or we try our best to ignore pain. And I think that’s one of the worst things you can possibly do. ” Bosh was eventually hospitalized, and tests revealed that a blood clot in his calf had traveled to his lungs, causing a pulmonary embolism  —   a problem that can be fatal. Bosh had surgery and spent nine days in a hospital. He lost 20 to 25 pounds, he said, and missed the final 30 games of the   season. Bosh has never publicly articulated his specific course of treatment, but he presumably took   drugs. He appeared in a television commercial for one such medication, Xarelto. Bosh was cleared by the Heat to return for the   season opener. He played well through the first half of the season, averaging 19. 1 points and 7. 4 rebounds per game before the   break. But a few days before the   Game, he awoke with a sore calf. He was soon found to have had a recurrence of blood clots. He met with team doctors, who told him that his season was over and that his career was probably finished, too, he said. “I felt right away that I was written off,” Bosh said in one of his interviews with Uninterrupted. He added, “If a doctor tells me, ‘Hey, that’s it, and this is how it is,’ and I don’t buy that, then I think I have the right to disagree with you. ” Bosh also alluded to the tension between himself and the Heat’s medical staff. “If you’re an athlete in this game, you have to protect your own interests, and you have to protect your body and your family,” Bosh said. “If one doctor is a doctor for 15 guys, who’s paying this guy?” He added, “If you’re paying a doctor through your pocket, your insurance  —   whatever that case may be  —   that changes their interest. ” It has mostly remained a   public tussle. The Heat, aside from sporadic statements, have not spoken in detail about Bosh’s medical situation, nor have team officials said what liability, if any, the franchise might have if something were to happen to Bosh on the court. The Heat’s president, Pat Riley, told reporters on Monday that Bosh’s career with the team “is probably over. ” “There is not a next step for us,” Riley said. “It’s pretty definitive for us in our position. ” The Heat declined interview requests for this article. The players’ union did not immediately return a call seeking comment. Samantha Brennan, a philosophy professor at Western University in London, Ontario, teaches a class on sports ethics that touches on the role of team doctors and the conflicts of interest that can arise  —   namely, clearing athletes to return to competition before they are ready. “That’s what makes the case involving Chris Bosh so unusual,” Brennan said, referring to the urge among teams to send players back onto the field. So what happens if an athlete, fully aware of the medical risks, insists on continuing to play? Does the team have a moral responsibility to look out for the athlete’s  ? In most cases, Brennan said, risk taking is left to the discretion of adults. The challenge with many athletes, she said, is that they have invested so much of themselves in their careers from an early age that it can cloud their judgment. “When they need to make a difficult decision, it puts them in a bind,” Brennan said. “It makes it very hard for them to say, ‘I’m ready to stop playing. ’” Ultimately, Brennan said, an athlete is an employee, and team officials have the power to do what they want. “So they’re making two kinds of decisions,” Brennan said, referring to the Heat. “One is an ethical decision about not wanting someone they know and care about  —   imagine if he died playing. They’re also making a   decision because they’re worried about injuries and liability. ” Dr. Jack Ansell, a professor of medicine at Hofstra Northwell School of Medicine on Long Island, said he knew of several athletes who had managed   problems by taking blood thinners between games and then allowing the medication to be flushed from their systems before they returned to competition. Ansell, a member and former chairman of the medical and scientific advisory board of the National Blood Clot Alliance, has not examined Bosh and has no specific knowledge of his case. But Ansell said he suspected that Bosh would need     therapy to prevent recurring clots and that the grueling schedule of the N. B. A. would make intermittent treatment difficult. “You’re playing games every two or three nights,” he said, “so there’s no real time off. ” Rebekah Bradford Plath, a speedskater who competed at the 2010 Winter Olympics, developed a pulmonary embolism in 2012. While still on   therapy, she resumed training. The risks were fairly minimal.   speedskating is a noncontact sport, although falls do happen Bradford Plath wore a helmet. “I do know that I probably made some of my teammates nervous when they were skating around me,” she said in a telephone interview. “Some of them understood the significance of what I was doing. But I trusted my ability, I trusted the ability of my teammates, and I felt comfortable and confident. ” Last year, after having knee surgery, Bradford Plath had a recurrence of blood clotting even though she was taking blood thinners at the time. After her physician increased the dosage, she said, the clot cleared. Bradford Plath, who still takes blood thinners when she travels on airplanes, continues to train with an eye on the 2018 Winter Olympics.'"}, "time": 1742563677.6386445}