{"duration": 0.11732792854309082, "input_args": {"text": "'BERLIN  —   Germany’s highest court rejected on Tuesday an attempt to ban the National Democratic Party, the country’s oldest   political organization, finding that it did not pose a danger to democracy even though its principles violate the Constitution. The ruling by the Federal Constitutional Court came after years of deliberation and at a time of   in the country, where another   party, Alternative for Germany, is poised to win representation in Parliament in national elections this year. Although the National Democratic Party “pursues aims contrary to the Constitution,” there was a lack of “concrete supporting evidence” that the   party would be able to successfully achieve its goals and to pose a genuine threat, said Andreas Vosskuhle, the president of the court. “That a party has aims that run contrary to the Constitution is not sufficient grounds for banning a party,” he said. Germany’s 16 states submitted a petition in 2013 to ban the party, citing its racist,   agenda, but the law that allows a party to be banned is not based on “sympathies or worldview,” but on evidence of a specific threat to the Constitution, he said. Germany has strict laws on banning political parties, and only two have been outlawed since the defeat of the Nazis at the end of World War II  —   the   Socialist Reich Party, in 1952, and the German Communist Party, in 1956. A 2003 attempt to ban the National Democratic Party also failed, after the court found that paid informants in the party were partly responsible for evidence the government used. Over the past decade, the party has continued to lose popularity, with many of its members switching to Alternative for Germany. That party was founded in 2013 on an   agenda, but it has attracted followers after emerging as a prominent voice against Chancellor Angela Merkel’s decision to allow nearly one million refugees into the country since summer 2015. Although the influx has slowed, the issue remains a political point of contention. In September, voters ejected the National Democratic Party from the legislature in   the last state in which it had seats. Other than Udo Voigt, a member of the European Parliament, the party is now represented only at the local level. The eight judges of the court cited the party’s lack of playing a significant role in the political landscape as a reason for their decision not to ban it. “In more than five decades that it has existed, the National Democratic Party has not been able to achieve lasting representation in a state legislature,” Mr. Vosskuhle said, reading from the   ruling. “There are no indications that this will change in the future. ” At the height of its popularity, the party narrowly missed winning seats in the West German Parliament and was represented in seven of the country’s 11 state legislatures. Since German reunification in 1990, the party has been strongest in states of the former East Germany. The ruling means the   party remains eligible under German law for financial support from the government, drawn from taxpayers, one of the arguments for the attempt to ban it. Mr. Vosskuhle acknowledged this point, suggesting the idea of changing the Constitution to restrict funding from parties that are recognized as violating Germany’s democratic principles. On Tuesday, however, the party celebrated the ruling, with its leader, Frank Franz, posting on the party’s Facebook page, “  winner against an attempt to be outlawed. ” Thomas de Maizière, Germany’s interior minister, said that despite the ruling, he supported keeping the party under observation by the domestic intelligence services, a move that he credited for keeping the party from posing a substantial threat. But the ruling also earned criticism, especially from Jewish groups such as the World Jewish Congress, which expressed “disappointment” and “dismay” at the court’s ruling. “This sends the wrong signal, all the more so as the court made it very clear that the NPD indeed strives to overthrow the democratic order and shares many of the aims of Hitler’s Nazi Party,” said Ronald S. Lauder, the group’s president.'"}, "time": 1742562776.0077837}