{"duration": 0.050124406814575195, "input_args": {"text": "'US Drone Pilots May Be ‘Illegally’ Acquiring Targets From UK Bases   Source: Motherboard \\n\\nCreech Air Force Base , Nevada, is widely known to be the heart of the United States’ overseas drone operations, from where more than 100 drone flights per day —mostly in the Middle East—are controlled. Notions of this base’s overworked drone pilots, sitting in stuffy trailers monitoring and killing targets 8,000 miles away, have been popularized by movies such as Good Kill and Eye in the Sky. \\nBut a British human rights campaign group says it has uncovered documents that show the US is also conducting its military drone operations from within Royal Air Force (RAF) bases in the UK, an act that would be deemed in breach of international laws , argues the group. The British government denies this however, stating , “the US does not operate RPAS [remotely piloted aircraft systems] from the UK.” \\nPublicly available job listings and résumés, shown to Motherboard by human rights campaign group Reprieve, show that US military personnel based in the UK have been working on drone missions at RAF Molesworth in Cambridgeshire near London. Another job ad is looking for a “targeting analyst” to work at Molesworth “for conducting thorough analysis on traditional and non-traditional targets for the purposes of creating electronic target folders for nation state and non-state actor systems.” A further job ad from private military contractor Leidos is looking for a video intelligence analyst to be based at Molesworth. \\nWhile the Molesworth base belongs to the RAF, parts of it are currently leased to the US for its European Command’s intelligence analysis operations, known as the Joint Analysis Center. US operations at Molesworth are in fact currently preparing to merge with operations at Croughton RAF base, where a $160 million US operations center will be established . \"The British Government has questions to answer\" \\n“Simply to say that drones are not flown from the UK is missing the point, if it is personnel on British soil that are at the top of the so-called ‘kill chain’ and British agencies who are feeding targets into those lists,” said Jennifer Gibson, staff attorney at Reprieve. “The US drone programme, conducted in the shadows, has killed hundreds of civilians without any accountability. The British Government has questions to answer over its own involvement in this secret war and how much responsibility it bears for those deaths.”'"}, "time": 1742563594.0910783}