{"duration": 0.0911405086517334, "input_args": {"text": "'The political and business elite, who attend the annual World Economic Forum (WEF) meeting in Davos, are beginning to admit their push for globalisation and open borders contributed to the worldwide populist backlash and the rejection of the mass integration project. [Harvard professor and former chief economist of the International Monetary Fund Kenneth Rogoff told Bloomberg that following WEF 2016 he “started to grow concerned”   Donald J. Trump would become the next president of the U. S. because his fellow frequent attendees of the gathering in the Swiss town of Davos were certain that Mr. Trump would not win.  “A joke I’ve told 1, 000 people in the months since leaving Davos is that the conventional wisdom of Davos is always wrong,” said the former IMF chief who is scheduled to attend Davos again this year along with some 3, 000 other members of the political, business, media, and academic elite. “No matter how improbable, the event most likely to happen is the opposite of whatever the Davos consensus is,” he added. Davos also failed to predict the rise of populism in Europe, Italy’s rejection of constitutional change that led to the resignation of Prime Minister Mattheo Renzi, or the UK voting to leave the European Union (EU) which Forbes described as the “populist revolt against Davos Man”. “Davos Man” was coined by political scientist Samuel P. Huntington who described “these transnationals” as “[having] little need for national loyalty, view national boundaries as obstacles that thankfully are vanishing, and see national governments as residues from the past whose only useful function is to facilitate the elite’s global operations”. One of the eight Oxford University academics set to attend the meeting, Ngaire Woods, dean of the Blavatnik School of Government, said, “There has to be some humility. For 30 years the elite have said, ‘We’re managing globalization, and we’re making it work for everyone’. ” “They cannot just keep repeating that,” added the frequent Davos visitor. However, WEF founder Klaus Shwab has alleged that globalisation was an “easy scapegoat” for world angst, and argued that populism wasn’t the answer, saying, “We cannot just have populist solutions”. With populism high on the agenda at Davos, one of the sessions will include a panel of psychologists offering thoughts on “cultivating appropriate emotions in a time of nationalist populism”. Managing Director of the IMF Christine Lagarde, who was found guilty in December of criminal negligence in an arbitration case over the misappropriation of funds, expressed that she wanted to rehabilitate the appearance of globalism. She said she wanted a “move toward globalization that has a different face, and which is not excluding people along the way”. Lagarde will be headlining a session at Davos entitled: “Squeezed and Angry: How to Fix the Middle Class Crisis” along with hedge fund billionaire Ray Dalio.  Days before the EU referendum vote, the French lawyer belittled Brexit voters by implying they were   called for a “united Europe” and launched a report claiming a ‘Leave’ vote would lead to half a million job losses. Also anticipated to attend the exclusive conclave is billionaire open borders activist and founder of the Open Society Foundations George Soros, who admitted involvement in Europe’s Migrant Crisis and called national borders “an obstacle” and has financial ties to the W. K. Kellogg Foundation. Other notable attendees include a dozen members of the European Commission including Trade Commissioner Cecilia Malmström, who responded,“I do not take my mandate from the European people” when asked a question by a poverty campaigner regarding the unpopular Transatlantic Trade and Investment Partnership (TTIP) deal between America and the EU, which was opposed by millions of Europeans.'"}, "time": 1742561952.6691327}