{"duration": 0.039263248443603516, "input_args": {"text": "'Applications for the Yiannopoulos Privilege Grant, a college tuition grant created by Breitbart News Senior Editor MILO exclusively for white men, are now being accepted.[  “The Yiannopoulos Privilege Grant, launched by Milo Yiannopoulos and funded by Milo and private donors to provide college funding assistance to white males, is pleased to announce that applications for its pilot program are now being accepted to receive grants of $2, 500,” announced the grant in a post on Tuesday. “The application period will close on February 14th, 2017, and recipients will be announced on March 31st, 2017. Grant payments will be made directly to the recipient’s college or university immediately pending IRS approval. ” As well as announcing the acceptance of applications, MILO has also hired a new Selection Committee Chairman, Janet Bloomfield, to overview the applications which are to students who are “attending or accepted to a two year community college or a four year college or university. ” “My initiative to help white men further their education is now accepting applications. We’ve given it the brilliant name of the Yiannopoulos Privilege Grant,” declared MILO on stage during his show at Cal Poly State University on Tuesday. “No this isn’t a joke. ” “It started as a joke, but if you’re a women, or you’re black  …     If you’re disabled, or you’re Muslim, or a refugee  …     If you identify as an attack helicopter, you can get free money,” he continued. “But the facts say that actually it is young white boys who are educationally underprivileged. As educationally underprivileged as many other groups. So it did start as a joke, but nobody can resist the truth wrapped in a good joke, and there’s nothing better than doing good while annoying the left. It is my favorite thing. ” “So I, and a number of private donors, have created this thing  …     My goal is to help more men, no matter their major or political opinions, reach their educational goals. You can even major in gender studies, I don’t care,” MILO joked. “Now although it took longer than I anticipated to set up the privilege grant, I’m happy we’re now well on our way to help young men achieve their dreams. I hope everyone in the room applies, I hope everyone watching at home applies. ” “Men, as you may know, make up just 43% of America’s 20. 5 million college students,” explained MILO in conclusion. “Yet another way in which the feminist consensus about the oppressive patriarchy simply doesn’t bear any relation to the facts. And that number’s getting smaller. So it’s all very well for social justice warriors and progressives to cry and scream and talk about ‘changing things and making a difference and standing up,’ but then there are those of us who are actually doing something for, which now in higher education, is a minority group. ” You can apply for the Yiannopoulos Privilege Grant here. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561779.090928}