{"duration": 0.14496779441833496, "input_args": {"text": "'Election lawyer and Justice Department whistleblower J. Christian Adams, author of Injustice: Exposing the Racial Agenda of the Obama Justice Department, was a guest on Wednesday’s Breitbart News Daily with SiriusXM host Alex Marlow. [Marlow asked Adams to clarify the new immigration guidelines coming from President Trump’s administration.  LISTEN: “The president and DHS have really issued some bold new rules that I think are designed to protect the country,” Adams said. “They’re doing things the Obama administration refused to do but should have. ” For example, he said the Trump administration would be “removing people quickly, without any nonsense rigamarole. ” “These are people who haven’t been here very long. The Obama administration used to confine it to just two weeks. So if you could manage to get past two weeks under Obama, you can stay,” he explained. “But under Trump, they’re going to make it two years. So if you’ve been here within two years, in the country illegally, you’re gone quickly. Expedited removal. Outta here. ” “Obama used to confine it to 100 miles within the border  —   only if you were caught within a hundred miles would you be removed immediately, on an expedited basis,” he continued. “All you had to do is get past the   line, and you were safe under Obama. What Trump did was extend it to the entire country. If you’re caught illegally, and you’ve been here less than two years, you’re going to be immediately removed. ” Adams said there was no chance the Left would refrain from “melting down” over these changes. “As you know, Alex, the Left is all about changing the demographics of the country so they can win elections,” he charged. “And that’s what this has all been about from the beginning. The open borders crowd is finding a way to undermine mainstream America, middle American values, political views, to inject the country with a foreign influence  —   that’s right, I said that  —   foreign influence  —   so the demographic of the electorate changes. ”  “It helps them win the White House. It helps them win the Senate in places like Florida, California, Arizona, Virginia, another great example, Pennsylvania, Illinois  —   places with high immigration and illegal immigration. So I think the Left will go crazy. It’s what they do. They can’t help themselves. So expect more of it,” he said. Marlow characterized the longstanding “bizarre and terrible” approach to immigration enforcement as an implicit promise that “all you have to do is not commit another crime, and then you can stay. ” “I think that the decision to focus on criminal behavior  —   and we can talk about what that means because that’s important  —   but the decision to focus on criminal behavior is a first step. It’s a starting point that most Americans would agree with. It makes the Left look utterly crazy. It gaslights them,” Adams said. “But you know, it’s not just convicted criminals,” he pointed out. “It’s people who get picked up for like driving without a license, which is a huge problem when it comes to illegal aliens. And so it’s not just those who were convicted it’s those who were charged, those who were picked up on a minor infraction. ” Marlow asked when construction of the border wall President Trump promised might begin and whether it’s truly politically feasible. Adams insisted the wall was quite feasible, pointing to the Great Wall of China as an example of   wall construction technology from ages past. However, he warned that “the entire bureaucracy inside the Beltway is going to   this. ” “Every chance they get to sabotage and interfere, they’re going to do it. Folks who think that just because Trump is the president that that stuff is over with are wrong. Contracts being let, lawsuits being filed over some lizard in Arizona that might be affected by the wall  …    you’re going to see the entire apparatus of the   institution activate to stop this because they know, again Alex, getting people here illegally helps them win elections ten, fifteen years down the road. I’m afraid that this is going to be a wicked experience for the country when you have bureaucrats opposing this. ” Adams agreed with Marlow that construction of the wall was politically dicey, warning that “every day counts. ” “We are one day worse than we were yesterday of Trump being president. Speed is of the essence. When Obama came in, he realized that every day counted, and so they radicalized the government as fast as possible. That has to be undone just as quickly,” he urged. Marlow cited a new poll that shows 80 percent of Americans oppose the concept of “sanctuary cities” where federal officials are not notified after illegal aliens come into contact with local law enforcement. “How come this is the only law in America you can break where you have a sanctuary city for it?” he asked. “This is a culture that’s permitting lawlessness to be out in the open in these urban areas like San Francisco, Los Angeles, Houston,” Adams replied. “These sanctuary cities are openly saying, ‘We don’t care about the law, and we’re going to provide a haven for lawlessness because we believe in changing the culture, changing the demographics of elections. ” “How can it happen? How does it exist? Look, those cities are run by lunatics,” he said. “San Francisco is run by lunatics. What is the political backstop? Trump may have figured it out. If you say, “Hey, okay, dear lunatics, if you still want your federal money, then you’re going to stop this’  —   but you can see Alex, in some cases, the lunacy is more important to them than the dollars. We’ll see what happens there. ” Adams portrayed the assault on immigration law as an attack on “the fundamental notion that the West, that America, has the power to set off a piece of the earth and say, ‘We are different from the rest of you. We believe in individual liberty, the role of limited government, of the separation of powers, of the rule of law, and we are allowed to do borders to protect those ideas. ’” “That’s what’s under attack, Alex. Around the world is this notion that the West should be able to survive as the West. That’s why people like Trudeau, who’s also a nut, are part of this globalist open borders ideology that really is a   effort to undermine Western values,” he added, referring to Canadian Prime Minister Justin Trudeau. A caller asked how it would be possible to determine that any given illegal alien had been present in the United States for two years or less to remove them with expedited deportation, given that illegal aliens have little documentation of their movements. “That’s a great question,” said Adams. “That’s where the lawyers working at DHS and immigration judges  —   you know, we have rules of evidence, Alex. I can figure out, pretty much, if you give me subpoena power, how long somebody’s been in the country. I could talk to people. I could look at bank records. I could look at job histories. I could look at a variety of evidence that will inform the question of how long they’ve been here. Sometimes you get an admission, right? That’s the best kind of evidence, an admission against interest. So it’s not impossible to figure out who’s been here less than two years. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above.'"}, "time": 1742564059.3627331}