{"duration": 0.0678246021270752, "input_args": {"text": "'American Thinker October 27, 2016 \\nYou’re probably appalled at the American media’s shameless whoring for Hillary Clinton, asking yourself why they would so thoroughly debase their much-touted journalistic ethics. President Obama has answered that question. \\nAs reported by Agence France Presse, during a recent speech in Pittsburgh he postulated: \\n“We are going to have to rebuild within this wild-wild-west-of-information flow some sort of curating function that people agree to. \\n“There has to be, I think, some sort of way in which we can sort through information that passes some basic truthiness tests and those that we have to discard, because they just don’t have any basis in anything that’s actually happening in the world.” \\nSet aside the outrageous, un-American gall in proposing that any central authority should “curate” information put out to the public, and walk with me for a minute down a meandering path of speculation. \\nIt is, or course, the World Wide Web in which Obama’s informational “wild-wild west” exists. This is the realm of Breitbart, Cybercast News Service, the Drudge Report , World Net Daily , American Thinker , and other non-establishment outlets that persist in making the president uncomfortable. \\nAnd what has happened recently to affect the World Wide Web? The U.S. government has handed over control to ICANN (Internet Corporation for Assigned Names and Numbers), the nonprofit agency that assigns website domain names. \\nIs it in the president’s mind that ICANN might someday assume the “curating function” he sees as necessary to insure “truthiness” in web-based news reporting? \\nWell, according to ICANN Board Chair Stephen D. Crocker, diverse membership in the organization makes such a thing unthinkable. Quoted by the tech site C/NET, Crocker said: \\n“This community validated the multistakeholder model of internet governance. It has shown that a governance model defined by the inclusion of all voices, including business, academics, technical experts, civil society, governments and many others is the best way to assure that the internet of tomorrow remains as free, open and accessible as the internet of today.” \\nHis confidence is echoed by the Internet Governance Coalition, a group of technology firms that includes Facebook, Google, Microsoft, and Verizon, among others. They issued a statement that lauds ICANN’s “strong accountability measures” and upholds “the bottom-up approach that embodies the very nature of the open internet we experience today.…” \\nPardon the skepticism to which I’ve become increasingly prone, but this sounds very much like the “collaborative” concept of governance that prevails in the academic world. \\nIf you’ve ever applied for a position at a college or university, you know that what a search committee wants most urgently to know about you is whether you have a “collaborative style” of working. \\nWhat exactly is a “collaborative style,” as understood in today’s academic world? It means that you won’t do anything to contradict the orthodoxy in thought and procedure reigning on campus — in other words, that you are “politically correct” in your outlook.'"}, "time": 1742563159.589359}