{"duration": 0.06947445869445801, "input_args": {"text": "'Email You’re hacking up a lung and highly contagious, which gives you serious power over any retirement community. They’ll agree to almost anything you demand. \\n1. Unlimited free toast from the breakfast buffet: They’ve got plenty of toast in the dining hall, so the retirement community will surrender as much toast as you want if you agree not to come near their barely functional immune systems until your flu clears. White, wheat, pumpernickel—it’s all yours for the taking. However, toast is just the beginning of what you can wring out of these defenseless seniors. \\n2. Permission to tear all the nice pictures out of their magazines: You’re a walking plague ship of a human, and that puts the feeble and poorly constituted at your every whim. Feel free to peruse through the magazines in the senior lounge and keep any pictures you like. You can rip up Golf Digest to shreds for the glossy ads about wrist watches. They can’t stop you. \\n3. Lipitor: You’re not sure what this drug does, maybe some kind of blood thing, but if you want to try Lipitor, this is your chance. Threaten to walk through their halls coughing on every doorknob you see unless you get a sack of Lipitor, pronto. You’ve got them over a barrel. \\n4. Access to a senile patient who’s been told you’re FDR: This is your opportunity to have an 89-year-old man fawn over you and gratefully thank you for leading America through WWII. The retirement home might hesitate to lend a resident to you, but they’ll cave once you remind them that you’ve got plenty of virus-laden phlegm to spread around. At the end of the day, sacrificing one elder for the good of the others is a gamble a retirement community will take every time. \\n5. Renaming the retirement community after you : Tell them there better be a bronze plaque with your name bolted next to the front door, or you’re going to lurch through their rec center hugging every retiree you encounter like the goddamn horseman of pestilence. Show them you mean business by taking their Purell dispenser from the front lobby and throwing it into the street. \\n6. Have them cure your flu: All good things must come to an end, including your flu-empowered reign of terror. When you’re ready to recover from your debilitating illness, ask them to send over a nurse with some antiviral drugs and chicken soup. Just make sure the retirement community agrees to all these concessions in writing, because once you’re healthy, you’ve got nothing over them anymore.'"}, "time": 1742561731.363641}