{"duration": 0.07933568954467773, "input_args": {"text": "'So, the president of the Lakers  —   the one who once posed in Playboy and dated the head coach  —   created a stir last week by firing her brother, who had helped prepare for his job as the head of basketball operations by training horses. To replace him, she hired the franchise icon with the incandescent smile whose first day on the job last Tuesday represented the start of his experience as a basketball executive. His first move was to hire a general manager whose primary qualification seems to be that he was the agent of another Lakers icon, the one with the killer scowl. These novices will be counting on the expertise of the son of the Lakers’ éminence grise, who stormed off years ago when he clashed with the head coach, the one who dated the owner’s daughter. Got all that? All of this is just another drama in the House of Lakers, the   soap opera where familial ties are so inextricably binding they seem to have jumped off the pages of a Tolstoy novel. The Lakers, of course, have been the N. B. A. ’s   for spectacle ever since Jerry Buss bought them, along with the Los Angeles Kings, the once fabulous Forum and a   ranch, from Jack Kent Cooke for $67. 5 million in 1979. “In certain towns, certain teams are the backbone of that town,” said Jeff Shell, the chairman of Universal Filmed Entertainment Group. “In Boston, it’s the Red Sox. From my perspective, the Dodgers and Lakers have always been that. The personality of the Lakers, whether it’s Showtime with Magic or Shaq and Kobe, there’s always been the flash and glitz that personifies the town. ” He continued, “They’ve always been a   organization that takes care of its fans, so you know that even when they’re not winning, they had a plan. ” In recent years, though, that was in question. While celebrities still dot the courtside seats, the Laker Girls still dance and the franchise value has climbed to $2. 7 billion, according to Forbes, the halcyon days of championship runs are a distant memory. The Lakers are again anchored near the bottom of the Western Conference standings, headed for another of their worst seasons since they moved to Los Angeles  —   all since the death of Jerry Buss four years ago. To that end, his daughter Jeanie, who was bequeathed stewardship of the team, decided last Tuesday to ax her brother Jim, the chief basketball   who, three years ago, had given himself a   timeline to restore the championship pedigree his father established by winning 10 N. B. A. championships. And having sent her brother packing, along with Mitch Kupchak, the team’s longtime general manager, Jeanie Buss did what the Lakers have almost always done since her father bought the team. She turned inward. She hired Magic Johnson, the team’s beloved star of the Showtime era, to oversee the team. Working underneath him as the general manager will be Rob Pelinka, who had been the agent for the recently retired Kobe Bryant. They will be joined by an assistant general manager, Ryan West, whose father, Jerry West, starred for the Lakers on the court and as a   architect until he decided he had had enough of Phil Jackson, the team’s coach, after the 2000 season. If there were a Mount Rushmore of Lakers basketball, the visages of West, Johnson and Bryant would be chiseled onto it. “I think everybody’s happy she finally took action,” said Kathy Schloessman, president of the Los Angeles Sports and Entertainment Commission, who has known Jeanie Buss since they took a physics class for nonscience majors at the University of Southern California. “She gave Jim the period of time he asked for, and she realized the brand is important, and she wants to preserve her dad’s legacy. It was taking a beating, and she could only take it for so long. ” While there is skepticism within basketball circles about whether Johnson is best equipped to steer the Lakers in the right direction, it would be hard to find someone in Los Angeles with more good will to expend while trying. “Everybody has a different opinion about Magic’s experience, but he’s definitely committed,” Schloessman said. “He went after this job hard this isn’t a flyby thing. This is important to him. He’s going to be an attractive asset when he’s trying to bring free agents. ” The Lakers have always swung big, back to the days before the Buss family when they worked out trades for Wilt Chamberlain and Kareem   and then with West luring Shaquille O’Neal and having the foresight to see that a    Bryant would be a superstar. Kupchak, West’s protégé, led a more recent renaissance when he plucked Pau Gasol from Memphis, a deal that led to two more titles. But in recent years, the Lakers had begun to regularly whiff. The former commissioner David Stern nixed a trade that would have brought the Lakers the perennial   point guard Chris Paul, and deals for stars like Dwight Howard and Steve Nash bombed. In the last few years, the Lakers failed to land any premier free agents, with LeBron James, Kevin Durant, Carmelo Anthony and LaMarcus Aldridge barely granting them an audience. When the Lakers, flush with   space after Bryant’s retirement and with several promising players to build around, could lure only very modest free agents to come aboard  —   think of Luol Deng and Timofey Mozgov  —   it was clear that time was running out on Jim Buss and Kupchak. The last straw seemed to be when they could not swing a deal last week for the tempestuous   center DeMarcus Cousins, whom Sacramento shipped instead to New Orleans for bupkis. “Magic is such a dynamic leader on and off the court, that’s going to translate to the basketball department,” said Mychal Thompson, a former teammate and the Lakers’ longtime radio color commentator. “When Magic calls, every agent and free agent is going to return his calls. He can get an audience with the Pope. ” If it was easy to see coming, the breadth of Jeanie Buss’s decision was striking. A defining characteristic of the Lakers, along with the championships and the embrace of Hollywood, has been that as the sports industry has become increasingly corporate, the Lakers essentially remained a family operation. All six children of Jerry Buss  —   each of whom owns an 11 percent stake in the team  —   have worked for the Lakers, and four still do: Janie, who heads community relations Joey, who runs the development league team, the   Jesse, who works in the scouting department and Jeanie, whose office sits above the team’s practice court. Nor do you have to be a blood relative to be considered progeny. Lakers Coach Luke Walton is a former fan favorite as a player, as are two of his assistants, Brian Shaw and Mark Madsen. Jordan Wilkes, the son of the former Laker Jamaal Wilkes, is a scout. Linda Rambis, the wife of the former player and coach Kurt Rambis, is an executive. And Jerry Buss said he considered Johnson a son. True, there were often times when the family seemed like a dysfunctional one  —   when Jeanie Buss, who is respected for her business acumen, carried on a longtime relationship with Jackson and when a public feud erupted between the two stars Bryant and O’Neal  —   but until recently, the entanglements never seemed an impediment to winning. And in Hollywood, well, the distractions only seemed to add to the charm. “Big stars mean big drama,” Universal’s Shell said. “Our biggest movie franchise is ‘Fast and the Furious,’ and the stars, Vin Diesel and Dwayne Johnson, they have drama from time to time. As long as you’re winning and giving the fans a good experience, that adds to the fun sometimes. ” However, in recent years, the fun  —   as well as the winning  —   has dissipated, and the family business has become more business than family. With the N. B. A. lockout looming after the 2011 season, the Lakers laid off about 20 staff members, from trainers to equipment managers and scouts, including the longtime assistant general manager Ronnie Lester. A year later, Jim Buss passed over Jackson, who had departed after the 2011 season but was interested in returning, and instead chose Mike D’Antoni as the new coach. Then last week, John Black, the team’s publicist for more than 30 years, was pushed out with Jim Buss and Kupchak, who had been with the Lakers since his playing days. Jeanie Buss, in an interview on the Lakers’ television network, said the decision to shake up the team was so hard to make “that I probably waited too long. ’’ “For that, I apologize to Laker fans,” she said. Where the new direction leads is another matter, as the Lakers, with all eyes on them once again, embrace their past, hoping not to become prisoners to it.'"}, "time": 1742628542.016121}