{"duration": 0.08360505104064941, "input_args": {"text": "'Archives Michael On Television Everybody Is Telling Me That Trump Is Going To Win – So Why Do I Have Such An Ominous Feeling? By Michael Snyder, on November 6th, 2016 \\nI hope that I am wrong. On Tuesday night we will find out who our next president will be, and I have a very ominous feeling about what is going to happen. But all around me there are people telling me that Trump is going to win. They tell me to disregard the polls because they cannot be trusted, and that very well may be true . They tell me that new voters and independent voters will overwhelmingly vote for Trump, and they tell me that it is obvious that Trump has more enthusiasm for his campaign because of the size of his rallies. I have even heard some people say that God told them that Donald Trump is going to win the election. Well, we will find out on Tuesday night who was right and who was wrong. Personally, I don’t know what is going to happen, but I am quite skeptical of Trump’s chances and I can’t shake this ominous feeling about what Tuesday night will bring. \\nEven if Trump could legitimately get the votes that he needs, would the elite just stand by and allow him to win the election? There was evidence of widespread fraud in the last election , and there have already been reports of vote switching in this election . Bev Harris of blackboxvoting.org has been documenting how our elections have been stolen for many years, and at this point I have very little faith in the integrity of our system. \\nBut I still voted. \\nEarly voting is available where I live, and on Friday I voted for Donald Trump. \\nI just wish that I could believe that my vote is going to matter. On Sunday we got another glaring example of how rigged the system is. In a letter to Congress, FBI Director James Comey announced that his agency is ending the investigation into Hillary Clinton’s emails . By some miracle, the FBI was able to examine approximately 650,000 emails in just eight days. But there are only 691,200 seconds in eight days. So the FBI somehow reviewed these emails at the rate of about one every second, and now they have conveniently come to the conclusion that Hillary Clinton is totally innocent just two days before the election. \\nWhen this story broke, it really did hit me on an emotional level, and I already detailed my thoughts in an article for The Most Important News entitled “ I Just Lost All Faith In Our Deeply Corrupt Legal System And In The Rule Of Law In The United States “. I don’t know how any American is going to be able to have faith in our system of justice after this. We truly do live in a lawless nation, and if the American people elect Hillary Clinton they are willingly choosing lawlessness. \\nBut let’s pretend for a moment that our elections are completely and totally fair and that Donald Trump has an honest chance. Even though the polls have tightened up over the past week, it is still very difficult to see a path to victory for Trump. \\nVirtually everyone agrees that the electoral map gives the Democrats a built-in advantage. In order to win the election, Donald Trump is going to have to win all of the “battleground states” plus steal a mid-size state from Hillary’s column. \\nFor Hillary, there are many paths to victory for her. \\nIf Hillary Clinton wins Florida, she wins the election. \\nIf Hillary Clinton wins Ohio, she wins the election. \\nIf Hillary Clinton wins North Carolina or Arizona, she almost certainly wins the election. \\nIn order for Donald Trump to win, he has got to win Florida, Georgia, North Carolina, Ohio, Iowa, Arizona, Nevada and either Pennsylvania or Michigan. \\nOf course that is possible, but it is not probable even if the fight was fair. \\nAnd apparently I am not the only one that has an ominous feeling about what is coming. NBC News is reporting on a tremendous surge in emergency food sales as preppers get ready for the outcome of this election… \\nIn case of an election night Doomsday, preppers are running up sales of emergency survival food. \\nWhile sales for “long term food” typically see an increase around natural disasters and elections, “this is more intense than what we saw in 2012,” said Keith Bansemer, VP of marketing for My Patriot Supply, a manufacturer and seller of survival food. During the previous election his company saw sales double. This time it’s triple. \\n“We have everyone we can on the phones,” he said. “We are overwhelmed.” \\nAnd a Yahoo article is warning that militia groups “are preparing for the possibility of a stolen election”… \\nAs the most divisive presidential election in recent memory nears its conclusion, some armed militia groups are preparing for the possibility of a stolen election on Nov. 8 and civil unrest in the days following a victory by Democrat Hillary Clinton. \\nThey say they won’t fire the first shot, but they’re not planning to leave their guns at home, either. \\nTens of millions of Americans are very deeply emotionally invested in this campaign, and undoubtedly some of my readers will get upset with me for writing this article. \\nBut I am not writing this article to get people down. In fact, I am strongly urging everyone to vote. \\nIf you don’t vote now, you may never get a chance to vote in a pivotal election such as this one ever again. \\nAnd everyone needs to be watching for signs of election fraud when they go to vote. People are freaked out about the potential for a stolen election because of what has happened in the past, and we want to do our very best to make sure that it doesn’t happen this time. \\nIf Donald Trump wins on Tuesday, I will be very, very happy to have been proven wrong. \\nAnd if Hillary Clinton wins, I will take absolutely no joy in being right. \\nI truly do believe that this election represents America’s “last chance”. The most evil politician in the entire country is on the verge of becoming our next president, and the American people have a decision to make. \\nIf the American people willingly choose Hillary Clinton, I believe that will be the final nail in our coffin. \\nSo please vote on Tuesday, because the fate of our nation hangs in the balance. November 6th, 2016 | Tags: 2016 Election , Anxiety , Clinton , Depression , Donald Trump , Election , Election 2016 , Feeling , Feeling Pain , Hillary Clinton , Pain , Painful , Painful Feeling , Trump | Category: Commentary If Donald Trump Wins, He Will Be 70 Years, 7 Months And 7 Days Old On His First Full Day In Office » ALWAYSTOMORROW \\nCOUNTDOWN. Today, November 6, 2016. In 2 days I predict Mrs. Clinton will be elected our next president. Bob332 \\nGod gave this country TWO chances over the past 8 trs to get this country back on course & people BLEW it. Now it will be 3 strikes and your out IF this evil, corrupt POS is elected. As Lenin once said ” America is like a healthy body and it’s resistance is three fold , it’s PATRIOTISM, it’ s MORALITY and it’s Spiritual life.If we can undermine these three areas America WILL COLLAPSE from within” Ask yourself one question. Have these area’s finally been undermined? The answer is YES and we WILL suffer the ramifications! ALWAYSTOMORROW \\nMike, what happened to your “A Hillary Clinton Indictment Is Coming” article? \\nThose rotten Russian hackers I’ll bet.'"}, "time": 1742628366.4089398}