{"duration": 0.11027336120605469, "input_args": {"text": "'Sharon Jones, a powerhouse soul singer with a gritty voice, fast feet and indomitable energy, died Friday of pancreatic cancer. She was 60. Her death was confirmed by Judy Miller Silverman, her publicist. She said Ms. Jones died at Bassett Medical Center in Cooperstown, N. Y. and was surrounded by members of her band, the   and other loved ones when she died. Ms. Jones sang and shouted the kind of   soul and funk she had grown up on. Her voice had bite, bluesiness, rhythmic savvy and a lifetime of conviction. She was backed by the   the revivalist New York City RB band that supplied her songs as she sparked their career. She was discovered in 1996 by Gabriel Roth, a founder of the   Daptone Records and the  ’ bassist and main songwriter (under the name Bosco Mann). Ms. Jones had tried decades earlier to get a start in the music business, but was told by record labels that she didn’t have the looks to be a performer. Later, she would recall in the 2016 documentary “Miss Sharon Jones! ,” the refrain became, “too short, too fat, too black and too old. ” But with the    —   who sometimes introduced her as “110 pounds of soul excitement”  —   she became an unstoppable frontwoman. As she sang about love troubles, hard times and a woman’s strength, she would race across the stage in high heels  —   and sooner or later kick them off  —   while shouting and shimmying in fringed, sequined dresses. Ms. Jones and the   worked their way up from clubs to theaters and festivals, and drew growing recognition from fellow musicians. At a 2011 concert in Paris, Prince showed up to play some guitar. In 2014, after chemotherapy sent her cancer into remission, Ms. Jones returned to performing with a show of undiminished energy as long as she could. Sharon Lafaye Jones was born on May 4, 1956, in Augusta, Ga. and spent her first years living across the state line in North Augusta, S. C. (Augusta, Ga. also nurtured one of her lifelong influences, James Brown.) She was the youngest of six children, and she is survived by four of them: Dora Jones, Isiah Jones, Henry Jones and Willian Stringer. In 1960, she moved with her family to Brooklyn, growing up in   later, she would write a song for a Christmas album called “Ain’t No Chimneys in the Projects. ” She sang gospel music in church and soaked up James Brown, Tina Turner, Aretha Franklin, Stax and Motown from the radio. From the 1970s on, she sang with funk bands and wedding bands, sang backup at recording sessions and led church choirs. To support herself, Ms. Jones worked as a prison guard at Rikers Island in the late 1980s and then as an armed security guard for Wells Fargo. At one recording session directly after work, she was still wearing her Wells Fargo uniform, complete with gun. It led to the title of one of her early singles, “Damn It’s Hot. ” Mr. Roth heard her at a 1996 session backing the soul singer Lee Fields, and quickly began recording her through various labels he was associated with: Pure Records, Desco and then Daptone. The 2002 album “Dap Dippin’ with Sharon Jones and the  ” was Ms. Jones’s debut album and Daptone’s first album release. Recording on vintage equipment with vintage instruments, Ms. Jones and the   were leaders of a New York   soul revival. The band’s sound got vastly more exposure when the producer Mark Ronson hired the   as the studio band for Amy Winehouse’s 2006 album “Back to Black. ” But Ms. Jones was gaining notice, too. She played a juke joint singer in “The Great Debaters,” a 2007 film by Denzel Washington. When she and the   released their 2007 album, “100 Days, 100 Nights,” they performed at the Apollo Theater. Album by album and tour by tour, Ms. Jones’s audience and reputation grew. She toured with Lou Reed and sang with Phish and Michael Bublé. But in 2013, as she prepared to release the album “Give the People What They Want,” she was diagnosed with stage 2 pancreatic cancer. She and the   performed on a float in the 2013 Macy’s Thanksgiving Day parade anyway. The album was postponed for a year while Ms. Jones underwent surgery and chemotherapy  —   a period documented by the director Barbara Kopple in “Miss Sharon Jones!” When Ms. Jones first returned to performing in 2014, she was bald. Her dancing would have sent any wig flying. “Give The People What They Want” was nominated for a Grammy Award for Best RB Album. By 2015, Ms. Jones and the band were fully back at work. They released a Christmas album, “It’s a Holiday Soul Party. ” They toured with Hall  Oates and on their own. And they made a new single that’s heard in “Miss Sharon Jones!” called “I’m Still Here,” a bluesy musical autobiography . “I didn’t know if I would live to see another day,” Ms. Jones sang with a triumphal wail. “But I’m still here. ”'"}, "time": 1742563879.7723165}