{"duration": 0.08013010025024414, "input_args": {"text": "'  \\nOK you Russians! No more gentle American diplomacy! No more Mr. Nice Guy! So thundered US Secretary of State John Kerry last week. \\nRight on cue, the usually overwrought US ambassador to the UN, Samantha Power, blasted the Russians as ‘barbaric’ for their bombing campaign in Syria. She made no mention of the US using B-52 and B-1 heavy bombers as well as killer drones in Afghanistan. The lapdog US and British media were quick to run anguished pictures of Syrian babies but we saw narry a picture of an injured Afghan child. \\nNoble Peace Prize winner, Barack Obama, ducked and left Washington’s growing anti-Russian jihad to his aides while he flew off to Israel for the state funeral of the Shimon Peres, by now sainted by media as Israel’s ‘man of peace.’ In fact, Peres was the father of Israel’s nuclear weapons programs. \\nUnder Peres’ auspices, Israel secretly offered nuclear warheads and then Jericho missiles to the embattled South African apartheid government. This was ironic because Israel has been insisting that Iran – which does not have nuclear weapons – will proliferate them around the globe. \\nBack in Washington, just about everyone is now ignoring lame duck Obama and doing their own thing. Recently, the Pentagon, which has no use for Obama, likely sabotaged joint US-Russians plan to end the bloody Syrian civil war by bombing a Syrian Army camp and killing close to 100 Syrian troops. ‘Ooops, sorry, a mistake’ explained the Pentagon. \\nMore Russian warplanes are on the way to Syria. Ominously, Moscow just warned the US not to attack Russian military forces. Hillary Clinton’s supporters keep urging a so-called US-imposed ‘no fly zone’ in Syria, which is code for the US Air Force blowing Syria’s and Russia’s warplanes out of the skies and going after command control of Syria’s anti-aircraft systems. Which could be code for World War III. \\nPart of the reason for this intensified bellicosity is that Syrian government forces, backed by Russian air power, are making important if bloody progress in their siege of rebel-held sections of Aleppo. \\nAt the same time, Turkey is decreasing its five-year old support for Syria’s rebels, including the al-Qaida allied Nusra Front (new relabled Jabhat Fateh al-Sham). The Saudis and Gulf emirates, who are financing much of the civil war, are hard up for cash. All sides in this bitter five-year old conflict are exhausted and war-weary. Once lovely Syria lies in ruins. For the extreme Sunni insurgents their best hope is direct US military intervention. They are waiting for the hawkish Hillary Clinton. \\nRussia’s foreign minister, Sergei Lavrov, claimed this week that Washington is protecting the Nusra Front as its ‘Plan B’ for Syria. He also asserted that the US will install Nusra in Damascus in the event that President Assad’s government falls. But the majority of Syrians and all its minorities would be bitterly opposed to being ruled by fanatical Wahabi Islamists. \\nThis writer believes the US has long aided ISIS and still sees it as a potent weapon against the Assad government. Why else would it take the US and its Arab and Kurdish foot soldiers so long to move against ISIS strongholds at Raqqa and Mosul– which are, as this writer knows, only a taxi-ride away? ISIS is a rag-tag bunch of 20-something amateur Rambos, not the Wehrmacht. \\nOne likely answer is that imperial Washington is totally confused over whom to support and how to do it. The bewildering fracas between Sunnis, Shia, Kurds, Arabs, Yazidis, assorted Christians, ISIS wildmen, egged on the US, Israel, Turkey, Russia, France, Britain, Lebanon, Jordan, the oil Arabs is just too much for Washington’s ill-educated, or often downright dim policy makers. \\nThis writer has long believed that certain elements in Washington helped create ISIS as a potentially useful tool against non-obedient Mideast regimes, notably Syria and Libya. Israel, which whispers a lot into Washington’s ears, did the same thing by encouraging the growth of Hezbollah and Hamas as enemies of the Palestine Liberation Organization. Today, they are Israel’s toughest enemies, not the utterly corrupt regimes that run the Arab world. \\nThe bright idea to overthrow Syria’s recognized government goes back to that Father of Disasters, George W. Bush. He planned to attack Syria with Israel. Bush was restrained when no suitable Syrian opposition group could be found to install in power. The Sunni opposition was mainly Muslim Brotherhood, a name that spooked Washington. So Washington waited until 2011 to ‘regime change’ disobedient Syria.  '"}, "time": 1742561752.5146236}