{"duration": 0.13193631172180176, "input_args": {"text": "'pay-for-play that the Clinton campaign has taken. Here’s a great video by my friends from Truthstream Media with even more revelations. Wikileaks says they have 50,000 of Podesta’s private emails.If they keep releasing them in batches, there’s a distinct possibility that we will get some on election day itself. I wonder if Wikileaks is keeping the best for last? The desperate attempt to silence Julian Assange The efforts to shut up Assange have led all sorts of ugly places. If you can’t drone him ( like Hillary Clinton suggested ), then frame him and accuse him of pedophilia. Wikileaks has provided a timeline and supporting links for the sustained efforts to discredit Assange. May , when self-claimed dating agency “ToddAndClare” (T&C) approach saying they were contacted by the Russian government. Sep 3 , T&C email Assange’s Swedish lawyer Per Samuelson offering one million dollars for Assange to appear in a video advertisement for the “dating agency” ToddAndClare.com (See attachment). This is the first contact. Sep 15 , email sent from a member of Mr. Assange’s defence team to [email protected] requesting further details (See attachment). Sep 19 , [email protected] email with elaborate bonafides, proposed agreement and the claim that the source of the US$1 million is the Russian government. The email states that T&C was approached by Russian representatives in May 2016 and that “The source of the $1,000,000 is the Russian government” . The email then goes on to “verify” bonafides by giving a detailed description of the interior of the house and desk of Mr Assange’s lawyer, Helena Kennedy, who is a member of the UK Parliament, including a reference to a photo of Tony Blair (Kennedy states that the Blair reference is accurate, although out-of-date). Sep 20 , a representative of Mr Assange’s defence team writes to [email protected] stating that the proposal appears to be an “elaborate scam designed to entrap Mr Assange’s reputation into unwanted and unwarranted publicity”. writes stating that “The offer expires at midnight, October 31 st 2016.” Late Sep , WikiLeaks announces a press conference for Oct 4 for its ten year anniversary. Late Sep , Press widely misreport that WikiLeaks is going to launch its “October Suprise” against Hillary Clinton on 4 October, misinterpreting its press conference call Oct 4 , T&C files its “Assange pedophile” libel through the UN’s Global Compact system, alleging that there is an active criminal investigation in the Bahamas against Julian Assange for the abuse of an eight year old girl and claiming to have chat logs and photos. The allegation appears on the UN website with a UN Gobal Compact letterhead and is contextualised with a complex backstory. The request targets the UN WGAD (part of the UN Human Rights system) which found that Mr Assange is being illegally detained by the United Kingdom and Sweden. Oct 4 , T&C files claim through the UK courts, apparently using it as a method to place the pedophile accusation into the public record (See attachment). Oct 4 , WikiLeaks holds a press conference, where it becomes clear that its publishing of Clinton-related documents will occur later. Oct 5 , T&C’s UK court claim arrives at Ecuadorian embassy in London Oct 7 , WikiLeaks commenses its release of the Podesta Emails Oct 11 , T&C pushes out its Assange pedophile claim through the PRWeb newswire service. Oct 12 , UN Global Compact delists T&C , citing “integrity” issues. Oct 12 , T&C issues a press release opposing the UN delisting with an elaborate story, claiming that Julian Assange is threatening US citizens (T&C). Oct 17 , Investigative report into Toddandclare.com prepared for Mr Assange’s lawyers is concluded, finding “T&C Network Solutions exhibits the characteristics of a highly suspicious and likely fabricated business entity” (See attachment “FINAL REPORT T&C 17 Oct 2016”). Oct 18 , The pedophile part of the plot is launched through US Democrat-aligned website DailyKos and pushed by pro-Clinton twitter accounts. Now, I’m no stranger to the tinfoil, but this seems to me the most blatant attempt to discredit someone that I’ve ever seen. The timing is quite the coincidence, don’t you think? For more Assange, here are some of the conspiracy theories that have been going ’round the internet lately. Assange has made some incredibly powerful enemies. His longevity is far from certain. And then there was that day that the US internet got hacked. First, there was this tweet by Wikileaks, which was pinned on Twitter all day. Zero Hedge reported : The “police” presence apparently began to amass earlier this week just as Wikileaks confirmed that the Ecuadorian had agreed to cut Julian Assange’s internet access after a little political pressure from John Kerry…and as an allegedly bogus plot, with links to the Clinton campaign, was revealed that attempted to link Julian Assange to a pedophilia ring. Shortly after the Tweet appeared, the internet went down over much of the United States. Dozens of websites such as Twitter, Reddit, Amazon, Netflix, the New York Times and Spotify, as well as general internet service in certain areas of the country, were all down for part of the day (the entire list is at this link) . A DDoS (Distributed Denial of Service) attack was blamed for the outage. Ironically, NorseCorp , the company that has the real-time cyber attack map, was also down for most of the day. This happened not once, but twice. The FBI and the DHS are investigating the cyber attack so I’m sure we’ll get the *truth* soon. Rumors abound, including blaming Russia (of course, and after VP Biden’s idiotic threat to cyber attack them , could you really blame them?), that it was our own government hoping to cover up some even they’d like to distract us from, or, interestingly, that it was a hacker group who did this in defense of Julian Assange. (Wikileaks seems to think that too – see the screenshot below of their Tweet.) But…another group altogether has taken credit for the massive hack. SHTFplan reports that this is the beginning of WW3 – which could be fought online : A hacking collective calling itself “New World Hackers” are taking credit – and they are based out of Russia and China, so there is little doubt that it will fuel the narrative for more war, tighter security and an age of online instability as the new world (where the dollar is no longer king) is sorted out. New World Hackers responded to a request for an interview with Anon Intel Group . Their message to the world? “Stay educated.” Anything to add to Survival Saturday? What do you think of Assange and Wikileaks? Love him or hate him? Why? Share your opinion and any supporting links in the comments below! Please join the discussion! Submit your review'"}, "time": 1742563227.5272982}