{"duration": 0.041733741760253906, "input_args": {"text": "'European Parliament suspends negotiations with Turkey on EU membership November 24, 2016 - Fort Russ News - RIA Novosti - translated by J. Arnoldski - At a plenary session in Strasbourg, the European Parliament approved a resolution calling on the EU to suspend negotiations on Turkey’s membership over the actions of the Turkish authorities. The head of European diplomacy, Federica Mogherini, said during a debate in the European Parliament session that relations between Ankara and the EU are at a crossroads and that “the transition from rhetoric to action on the issue of the death penalty will be a signal that Turkey does not want to be a member of the European family, nor the Council of Europe, nor the European Union.” Turkish President Recep Tayyip Erdogan stated on Wednesday that the adoption of the resolution means nothing to Turkey. Commenting on the results of the vote in the European Parliament, the Turkish Minister for EU Affairs, Omer Celik, said that “while Turkey, due to threats from Syria and Iraq, is undergoing a difficult period in the fight against terrorism, unfortunately, short-sided and one-sided discussions are happening in Europe.” Brussels has repeatedly asserted that Ankara’s behavior calls into question its desire to join the bloc. In early November, in its yearly report on Turkey’s progress on the road to joining the EU, the European Commission highlighted Ankara’s failures in policy in the fields of civil society, human rights, and freedom of speech. The report also noted that Turkey’s authorities are not doing enough to bring legislation in line with European norms. The agreement on association between the European community and Turkey was signed in 1963. Ankara applied for membership in 1987. However, negotiations on joining the EU, which began only in 2005, have repeatedly been complicated by disagreements that have now led to their suspension. Now only 16 out of 35 chapters of the negotiation file on Turkey joining the EU are open. In March 2016, the leaders of EU member countries agreed to intensify negotiations in exchange for Ankara’s agreement to contribute to reducing the influx of migrants to Europe via Turkish territory. Follow us on Facebook!'"}, "time": 1742563394.4442186}