{"duration": 0.13399744033813477, "input_args": {"text": "'An eyebrow-raising new study from a nonpartisan research institute. October 28, 2016 Matthew Vadum \\nThe Obama administration is using billions of dollars in banking fines to fund radical left-wing activist groups that work to elect Democrats, according to an eye-opening new study from a nonpartisan research institute. \\nDuring Eric Holder’s term as attorney general from February 2009 through April 2015, a little under $37.3 billion was paid by U.S. banks under the threat of federal lawsuits. All but $720 million of that sum came from three big settlements: Bank of America, Citigroup, and JP Morgan Chase. \\nMany of the cases rest on bogus “disparate impact theory” which left-wing government lawyers use to make sure that “banks become liable for charges of racism based upon the perceived injustice of lending disparity in certain lower income areas, regardless of the reasons for the disparity.” \\nInstead of being used to help the supposed victims of these banks, the money flows to leftist allies of President Obama. \\nAdding insult to injury, the process by which the money snakes its way to left-wing organizations is both corrupt and unconstitutional, according to the report from the Government Accountability Institute that is called “Follow the Money: How the Department of Justice Funds Progressive Activists.” (Bestselling Clinton Cash author and anti-corruption crusader Peter Schweizer is GAI’s president. The full 115-page report is available in PDF form here .) \\nThe report states: \\nThe [Department of Justice] has curated an opaque system wherein appointed attorneys can legally extract money from the private sector and redistribute the funds to third-party organizations outside of the appropriations process—an unprecedented and extraordinary disregard for Congressional authority. \\nIt adds, “[t]hese funds directed by the DOJ effectively replaced funding to activist nonprofits previously denied by Congress.” \\nMuch of the cash moves through NeighborWorks. The nonprofit gave more than $53 million to the rabble-rousing group Neighborhood Assistance Corp. of America (NACA) whose leader, Bruce Marks, calls himself a “bank terrorist.” It also gave over $4 million to Asian Americans for Equality (AAFE), “an organization with communist roots and continued close ties to a very vocal North Korean sympathizer.” \\nThe ill-gotten funds extorted from the banks also trickle down to left-wing groups such as National Council of La Raza, NHS of Chicago, National Urban League, and Operation HOPE. \\nMany of the nonprofits that receive such funding spend the money to elect Democrats. \\nCatalist, a George Soros-funded for-profit data analytics company specializing in left-progressive causes, along with a group called Nonprofit VOTE “mobilize these federally funded nonprofits … to get the vote out for those who ‘tend to be reliably progressive,’” the report states. \\nCatalist was founded by former Bill Clinton aide Harold Ickes in 2006 following Democrats’ electoral wipeout in 2004. Left-wing activists believed Republicans owed George W. Bush’s re-election victory to heavy spending on voter contact technology, including databases. \\nAccording to a Capital Research Center report : \\nCatalist boasts it was vital to President Obama’s 2008 victory. By its own admission, “over 90 organizations, campaigns and committees” used the company’s services. “Based on data that was loaded into the Catalist databases and then standardized,” a Catalist analysis of the 2008 cycle says, “progressive organizations, the Obama campaign, and federal party committees attempted to contact more than 106 million people. This means that the progressive community attempted to contact over 46% of the U.S. adult population. Contacts were delivered in-person, over the phone, by mail and over the internet.” \\nOf course, leeching off others is generally how the activist Left funds itself. Apart from oceans of cash supplied by left-wing fat-cat mega-donors like George Soros and Michael Bloomberg and a galaxy of radical foundations, the Left derives its sustenance by ripping off taxpayers at the federal, state, and local levels. \\nThe report states the evidence shows the Left is using the Department of Justice and “the power of the federal government to extract money from financial institutions for redistribution to progressive activists whose real intent is far more partisan than the housing and housing education for which they ostensibly exist.” \\nIn other words, the Left plays by a different set of rules than the rest of America. There is no level so-called playing field in American electoral politics. In a sense the system is rigged. There is the parasitic Left feeding at the taxpayer trough versus everybody else. \\nConservatives knew about this travesty already but few studies have been put together that follow the money trail. For a half century, the Left has been using taxpayer dollars to fund efforts to advance radical, subversive causes in the United States. \\nChanges in federal social policy in the mid-1960s helped lay the groundwork for this insidious leftist astro-turfing. Under the profoundly antisocial War on Poverty, the federal government has been handing out taxpayer money since 1965 to liberal and radical so-called community organizations to help them agitate against the status quo. One could say America declared war on itself and conscripted Saul Alinsky-inspired pressure groups to do the fighting. In recent decades those on the Left – including groups like ACORN and money-grubbing con artists like Jesse Jackson Sr. – have also become quite adept at working outside the public sector to shake down banks and other businesses to fill their war chests. \\nConservative groups receive no such largesse from Uncle Sam (and in fairness, many such organizations would likely reject government funding on principle if offered it). \\nThis sue-and-settle corruption will undoubtedly continue if Hillary Clinton becomes president. Secretary of Labor Tom Perez , no stranger to the shakedown business himself, is said to be a top contender for the attorney general post in any new Clinton administration. Perez, who previously ran the DoJ\\'s Civil Rights Division, is also a past president of Casa de Maryland, a notorious advocacy group for illegal aliens funded by George Soros and the late Venezuelan strongman Hugo Chavez. \\nThe money-raising scam described in the GAI report isn’t the only way left-wing groups fill up their bank accounts. \\nActivist groups were encouraged to agitate by the Carter-era Community Reinvestment Act, which enshrined in law a kind of lending protection racket. Banking regulators who had come under the influence of groups like ACORN had the power to make trouble for banks that failed to lend enough money to borrowers in so-called underserved communities. Banks that paid enough -- whatever that means -- got left alone, but banks that didn\\'t, got their legs broken. \\nFew serious economists doubt that the mortgage market debacle and the economic collapse of 2008 were caused by the deliberate weakening of underwriting standards carried out in the name of ending discrimination. \\nLeftists played both sides. They called banks racist and demanded more subprime lending for minorities and then when the loans went bad called the banks racist for supposedly targeting minority borrowers. It was (and is) pure gangsterism. Through the magic of dysphemism, the once sought after subprime lending was transformed into \"predatory lending.\" \\nThe shaking down of lenders intensified when then-Treasury Secretary Robert Rubin presided over the Clinton administration\\'s effort to put the CRA on steroids. Banks began to make risky subprime loans and Fannie Mae and Freddie Mac aggregated them for sale in the secondary market as mortgage-backed securities. These practices made it easier for banks to give in to the demands of ACORN and other groups to originate more and more doomed mortgages because they knew they could offload their high-risk debt on quasi-governmental suckers Fannie and Freddie, which were under intense political pressure to service the subprime market. \\nPresident Clinton “turned the Community Reinvestment Act, a once-obscure and lightly enforced banking regulation law, into one of the most powerful mandates shaping American cities—and as Senate Banking Committee chairman Phil Gramm memorably put it, a vast extortion scheme against the nation’s banks,” Howard Husock of the Manhattan Institute wrote in City Journal . \\nWhen Husock wrote in 2000, U.S. banks had “committed nearly $1 trillion for inner-city and low-income mortgages and real estate development projects, most of it funneled through a nationwide network of left-wing community groups, intent, in some cases, on teaching their low-income clients that the financial system is their enemy and, implicitly, that government, rather than their own striving, is the key to their well-being.” \\nEnterprising left-wing levelers never tire of dreaming up these redistribution schemes. \\nAnd they never will.'"}, "time": 1742628563.4058259}