{"duration": 0.11218452453613281, "input_args": {"text": "'  Media Bias Has Become Mental Illness Media Bias Has Become Mental Illness  31 am by Cliff Kincaid Leave a Comment 0 \\nAccuracy in Media \\nAware that their credibility is shot with the American people, the publisher and executive editor of The New York Times sent a “To our readers” note on Friday, saying, “we aim to rededicate ourselves to the fundamental mission of Times journalism.” \\nThis was another way of saying, “Sorry, we blew it,” without being honest with readers. \\nThose familiar with the paper’s “journalism” understand this to be media bias. But Arthur O. Sulzberger Jr. and Dean Baquet were suggesting something else—that something had gone wrong and they don’t quite know what happened, but don’t worry because the Times will get back to its mission of reporting truthfully. \\nBeating around the bush, they said Trump’s victory was “the biggest political story of the year,” which had “reached a dramatic and unexpected climax late Tuesday night…” \\nThe word “unexpected” means that the paper’s predictions were wrong. \\nThen they said that the paper’s newsroom had covered the campaign “with agility and creativity,” which are terms for incompetence and bias. Some people cling to the old-fashioned idea that a paper should report events objectively. \\nPretending to reflect on the poor coverage, they finally got to the problem without saying so directly. They asked, “Did Donald Trump’s sheer unconventionality lead us and other news outlets to underestimate his support among American voters?” and “What forces and strains in America drove this divisive election and outcome?” \\nIn other words, Trump’s “sheer unconventionality” caused the paper to misreport what was happening. He had appealed to mysterious “forces and strains,” terms that apparently refer to the voters. \\nSulzberger and Baquet insisted that the Times will “report America and the world honestly, without fear or favor, striving always to understand and reflect all political perspectives and life experiences in the stories that we bring to you.” \\nIn other words, they blew it during the 2016 campaign and will try to do better next time. But nothing is really changing at the paper. Nobody is being fired. And nobody is being hired who has an understanding of the conservative electorate. \\nThe paper, they said, will “hold power to account, impartially and unflinchingly.” \\nBut who will hold The New York Times accountable? \\nIn a real howler, they then claimed, “We believe we reported on both candidates fairly during the presidential campaign. You can rely on The New York Times to bring the same fairness, the same level of scrutiny, the same independence to our coverage of the new president and his team.” \\nThis is another indication that the paper is hopelessly liberal, and that nothing will really change. \\nThe business as usual attitude was reflected in the front-page headline in the Times after Trump won: “Democrats, Students and Foreign Allies Face the Reality of a Trump Presidency.” \\nAs Accuracy in Media Chairman Don Irvine noted , the headline was even funny to various MSNBC personalities, because it focused on the disappointment of liberals at Trump’s victory, rather than the victory itself. \\nMark Halperin commented, “If a Democratic candidate who was thought to have a 10 percent chance of winning by The New York Times that ended up winning, and winning red states as Trump won blue states, I don’t think that would have been the headline. And I’ll just say again, the responsibility of journalists is to not report on their biases. It’s to go out and understand the country through the prism of the election and say, ‘Why are people feeling the way they’re feeling?’” \\nOf course, the Times was not alone. \\nConsider the story in Politico headlined , “Insiders: Clinton would crush Trump in November.” It began, “In the swing states that matter most in the presidential race, Donald Trump doesn’t have a prayer against Hillary Clinton in the general election.” \\nIn a story headlined, “The Democrat Media Complex Will Never Understand What Happened Tuesday Night,” Stephen Kruiser at PJ Media commented that the talking heads want desperately to avoid the topic of the “overwhelming lack of political and intellectual diversity in their ranks,” but that the problem of their liberalism is compounded by their laziness. \\nThis is a fact, as reflected in my analysis of Post “journalist” Dana Milbank, who got caught asking Democratic Party officials for help on an anti-Trump column. \\nFor his part, Milbank crafted another anti-Trump column after the Trump victory, in the form of a letter to his daughter. “This is a sad day for our country,” he told her . “I want you to know that I did everything I could to prevent this from happening. My efforts and those of many others came up short.” \\nThose “many others” were in the media and the Democratic Party, for whom Milbank worked. Perhaps Post owner Jeff Bezos ought to ask the Democrats to pay Milbank’s salary. \\nMilbank told his daughter, “You are going to be okay.” \\nThat’s more than what we can say about Milbank. He is not okay. He is more than just a lazy liberal who gets the Democratic Party to help write his columns. He is completely out of touch with the America he claims to be writing about. \\nLike those at the Times, Milbank and others at the Post will never change. They are elitists whose hatred for their fellow Americans borders on mental illness. \\nLike other liberals, they claim to be on a crusade for “the children,” in his case his daughter. It’s frankly despicable that he would use his kid as a political prop. She needs our prayers. Cliff Kincaid \\nCliff Kincaid is the Director of the AIM Center for Investigative Journalism and can be contacted at cliff.kincaid@aim.org. View the complete archives from Cliff Kincaid . 0'"}, "time": 1742561868.0317366}