{"duration": 0.08378911018371582, "input_args": {"text": "'Companies have expressed numerous concerns over the proposed border walls. With the lack of funding in the 2017 budget, those concerns are growing. [Construction of President Trump’s proposed border wall along the U. S.  Border is slated to kick off in June when 20 selected bidders will be asked to build prototypes based on the proposals they submitted, Breitbart Texas previously reported.  However, The Arizona Republic reports that some bidders are starting to have serious doubts with some already giving up on the project due to how poorly the government is managing details. Michael Hari, the founder of Crisis Resolution Security Services in Illinois, submitted a proposal but is now one of its skeptics. “From the beginning it’s not a serious process, it’s not going to get the wall built,” Hari said. “Right from the   there were conflicts, there was not enough time given to it, to develop a reasonable process that would result in a wall getting built. ” Hari, a former sheriff’s deputy, described to the Chicago Tribune in April his vision and reasons for wanting to work on the border wall, which is about more than money. “We would look at the wall as not just a physical barrier to immigration but also as a symbol of the American determination to defend our culture, our language, our heritage, from any outsiders,” Hari said. M3 Federal, a consulting firm for contractors that has over 40 years of experience working on government contracts, warned that Washington not have a specific concept in mind for what exactly they seeking, as evidenced by multiple changes made to the requests for proposals. “The fact that things are being delayed and the fact that there are seven amendments out there just verifies the fact that the government does not have a confirmed concept about what they want to put in place,” said Patrick Malyszek, owner of M3 Federal. “The way the government is handling this is actually going to create a very high risk in terms of the overall project. ” Among those bidders who have already given up on the border wall project is Christopher Dillon, owner of a construction management company based in Alaska. “From the outset of the project, I have been tracking it and it’s a political stunt,” Dillon said. “It’s burning a lot of money. It’s really jerking the contracting community around. ” Building a wall on the U. S.  Border was a hallmark for Donald Trump’s campaign. During the campaign launch at Trump Tower, he said, “I would build a great wall on our southern border and I will have Mexico pay for that wall. Mark my words. ” Despite this promise, President Trump said that he was “very happy” with the $1. 2 trillion spending bill that he signed on May 5 which included $0 for a border wall. President Trump has reassured supporters that the wall is going to get built despite the setbacks in the 2017 budget in which he blamed Democrats for being “obstructionists. ” “Look, the Democrats are obstructionists that’s all they can do is obstruct. They have no leadership. And we have to agree, and I think both  —   both sides agree, we have to keep government going, we don’t want to shut government,” he said. Ryan Saavedra is a contributor for Breitbart Texas and can be found on Twitter at @RealSaavedra.'"}, "time": 1742561657.9902647}