{"duration": 0.08718609809875488, "input_args": {"text": "'  Recipient Email => \\nDear Mexican: Why is it that even though we Latinos have similar backgrounds (Indian-Spanish) across America , there is a lack of unity among us here in the USA ? We could be a powerhouse during election times, and definitely obtain a more friendlier immigration deal. \\nEl Peruano \\nDear Cholo: I usually only answer preguntas about Mexicans, but I’ll make an exception here because of Election Day. And it hierve down to this: Who wants to be united? Latinos certainly don’t. Nowhere except Cuba is a country of the same political thought—and look how good it’s working out for them. Although the Mexican’s politics are Marxist of the Grouch variety, I’m also of the escuela that we need Latino conservatives, anarchists, vendidos , progressives, libertarians, Zapatistas, sinarquistas (ok, maybe not them)—all political thoughts. Such diversity keeps us in balance, teaches us about democracy, and will make us stronger as gabachos continue to align themselves into puritanical camps of caca . Let us squabble away—oh, and #fucktrump. In America , the candidates for president spend millions of dollars in other peoples’ money for a job that could never pay that money back. Is it the same for Mexican candidates, or does it even matter, since those fucking Mexicans can never get the elections right anyway? \\nConservative, but #fucktrump \\nDear Gabacho: For most of the 20th century, Mexican presidents came from the PRI, and their method of picking a new leader was simple: el dedazo . The finger—not flipping the pájaro , but a symbolic pointing of the finger toward someone. Yeah, that’s totally corrupt—but at least we don’t spend billions of dollars like fucking gabachos who can never get their elections right anyway, you know? Oh, and #fucktrump. \\n\\nGET OUT EL VOTO !: Gentle cabrones , the Mexican doesn’t endorse candidates not named Alfred E. Neumann (source of the greatest quote EVER: “English is a language in which double negatives are a no-no!”), but I can tell you who NOT to vote for: Donald Trump, and anyone supporting the pendejo . He represents the greatest threat to raza since NAFTA, an agreement he claims to hate but only says that to gain gabachos votes to toss Mexicans across the Rio Grande with a deportation cannon. Hillary Clinton is nowhere near the perfect candidate, and the Mexican won’t be voting for her because she’s the beneficiary of the Democratic Party own dedazo system—but even a candidate as terrible as her is un chingo better than Trump. If you vote for her, no hate on my part—just tell her to hold her tacos right. \\nMore importantly, vote in your local elections, and RESEARCH. Don’t just vote for the people with the paisa name—sometimes, our own people are worse to Mexicans than any Trumpbot. And if you can’t vote because you’re undocumented? Volunteer for those politicos who are striving for amnesty and who oppose walls. May you celebrate Election Day with one giant fiesta instead of tragos amargos . Oh, and #fucktrump. \\nAsk the Mexican at themexican@askamexican.net, be his fan on Facebook, follow him on Twitter @gustavoarellano or follow him on Instagram @gustavo_arellano!'"}, "time": 1742564327.0566912}