{"duration": 0.0763404369354248, "input_args": {"text": "'Share This \\nThe upcoming election has our nation on pins and needles, but none more so than the idiots on the left. Proving just that was a few morons who decided to run over a Donald Trump lawn sign that they saw on the side of the road – and that’s when they got slapped with the perfect dose of justice. \\nThe incident was posted to the Twitter account of a black Trump supporter named Tallah who lives in Detroit, Michigan. Now, if ever there was a place that should be sick of Democrats, it should be Detroit, but apparently, there are still people living in the city who enjoy living life as a slave to the government. Tallah (right) (Photo Source: Twitter ) \\nProving just that, it seems that a few of Tallah’s Trump lawn signs triggered a liberal who just had to do something about it. Captured by pictures after the fact, the idiot decided the best way to voice his negative opinion on Trump was to destroy the woman’s property. \\nAs can be seen, the idiot decided to swerve off the road and run over 4 signs that were sitting in Tallah’s front lawn. Unfortunately for him, he was about to get a nasty dose of instance justice – and it’s just delectable. Triggered lefty ran over Tallah’s Trump signs but got a nasty surprise (Photo Source: Twitter ) \\nAs it turns out, this clearly wasn’t the first run in that Tallah had with triggered liberals. She put out a little surprise for anyone who would try what this triggered lefty did. Also captured in the photos was the woman’s homemade booby trap – a board with nails sticking up just below the signs. Booby trap (Photo Source: Twitter ) \\nAt the end of the day, the trap did exactly what it was supposed to – popped the tires of an entitled piece of garbage that thought they could do whatever they wanted. Too bad for them, Tallah even managed to get a picture of the idiot responsible as he tried to put the spare tire on his car. Triggered liberals licking their wounds (Photo Source: Twitter ) \\nHowever, it seems that the popped tire wasn’t even the best part of the picture. After zooming in on the morons’ faces, their expression shows that they received every bit of justice that they deserved. Even better yet, the signs weren’t even really destroyed. It looks like all Tallah would need to do is bend them back up to standing position. Close up on the entitled punks’ faces (Photo Source: Twitter ) \\nIt just goes to show, the entitled mentality is getting out of hand in this country. However, if liberals want to play dirty at every corner, we can whip out a few tricks of our own. With that being said, let’s just hope this triggered fool learned a lesson. After all, I’m sure his decision to destroy a $20 sign wasn’t worth the price to get a new tire.'"}, "time": 1742562096.914332}