{"duration": 0.06372427940368652, "input_args": {"text": "'Minnesota state Senator Jeff Hayden ( ) is pushing legislation to designate $200, 000 in taxpayer funds as annual gifts to gun control groups. [In a press conference to announce the legislation, Hayden thanked Michael   Moms Demand Action for their “organizing power. ”  The text of the bill says: This act may be cited as the “Taylor Hayden Gun Violence Prevention Act. ” To reduce the number of injuries and deaths of innocent individuals in the community and to increase community safety, the commissioner of human services shall develop a competitive bidding process to award grants to nonprofit organizations with expertise in gun violence prevention. A nonprofit organization awarded a grant must use the money for gun violence prevention or public awareness and education campaigns on gun violence prevention. Hayden explained that his push to use Minnesotans’ tax dollars for gun control is the result of the death of his sister, Taylor Hayden, who was killed in a suspected drug deal gone bad in Atlanta, Georgia. Hayden explained that Taylor was out with friends in July 2016 “for some dancing and fun. ” He said, “As they were leaving the place where they had eaten and were having fun, gunfire erupted between two parties that were apparently having a problem. ” During the exchange of gunfire, someone grabbed Hayden’s sister and used her “as a human shield. ” She was shot twice and killed. Hayden said his sister “represented everything that we want our children to represent” and he wants to fund gun control in Minnesota to help with “gun violence prevention and outreach. ” He said gun violence is “a public health crisis” and he believes it is fitting to designate tax payer dollars “to get people to understand what happens when you use a gun. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.  '"}, "time": 1742564473.7557015}