{"duration": 0.1385953426361084, "input_args": {"text": "'John D. Loudermilk, a country singer and prolific songwriter whose dozens of hits in the 1960s and ’70s included “Tobacco Road” by the Nashville Teens, “Then You Can Tell Me Goodbye” by the Casinos and “Indian Reservation” by Paul Revere and the Raiders, died on Wednesday at his home in Christiana, Tenn. He was 82. His death was announced on Facebook by the songwriter Bobby Braddock, a friend. The cause was a heart attack, said his son Mike. As Johnny Dee, Mr. Loudermilk made several records in a soft rockabilly style in the 1950s, but he found his niche after George Hamilton IV recorded his teen lament “A Rose and a Baby Ruth” in 1956 and Eddie Cochran scored his first solid hit with a cover of Mr. Loudermilk’s “Sittin’ in the Balcony” a year later. After moving to Nashville from his native North Carolina, he came under the wing of the producer and guitar virtuoso Chet Atkins. He soon joined the powerful publishing company   and began turning out songs in every style: the perky pop of “Norman” (1961) for Sue Thompson the mournful ballad “Ebony Eyes” for the Everly Brothers” (1961) and the loping western style of “Abilene” (1963) written with Bob Gibson and others, which became Mr. Hamilton’s biggest hit. Mr. Loudermilk drew on his   childhood in Durham, N. C. for “Tobacco Road,” which he recorded in 1960. It became a Top 20 hit for the British invasion group the Nashville Teens in 1964 and was later recorded by dozens of other artists, including the Jefferson Airplane, Eric Burdon and War, the Blues Magoos and David Lee Roth. “Indian Reservation,” first recorded by Marvin Rainwater in 1959 as “The Pale Faced Indian,” told the story, in impassioned terms, of the forced removal of Cherokee Indians from the southeastern United States to Oklahoma in the 1830s. As “Indian Reservation (The Lament of the Cherokee Reservation Indian),” it became a Top 20 hit for the British singer Don Fardon in 1968 and a No. 1 hit for Paul Revere and the Raiders in 1971. Mr. Loudermilk, who enjoyed telling a good story, convinced the D. J. Casey Kasem that he had been inspired to write the song when he was stranded by the roadside during a blizzard and a mysterious Cherokee chief, Bloody Bear Tooth, led him to safety and asked him to tell the rest of the world, in song, of the sufferings of his people. Mr. Kasem repeated the tale on his radio program “American Top 40,” giving it currency. In a wink to record buyers, Mr. Loudermilk added “P. S. My regards to Bloody Bear Tooth” on the sleeve of his 1971 album “Volume 1: Elloree. ” John D. Loudermilk, whose middle initial did not stand for anything, was born in Durham on March 31, 1934. His father, also named John D. was an illiterate carpenter. His mother, Pauline, was a homemaker and Salvation Army missionary. He was a cousin of Ira and Charlie Loudermilk, known professionally as the country music duo the Louvin Brothers. When John was 7, his father made him a ukulele from a cigar box and his mother taught him to play it. He soon learned, in addition to guitar, an assortment of instruments, which he played in a Salvation Army band. By his early teens, he had appeared on local radio and television stations. While attending the University of North Carolina, in Chapel Hill, Mr. Loudermilk discovered the work of Kahlil Gibran and began writing poems, one of which, “A Rose and a Baby Ruth,” he set to music. The Durham television station where he worked as a set painter and member of the house band let him play it on air. Mr. Hamilton, visiting the station, heard it and recorded it for Colonial, a label based in Chapel Hill. Mr. Loudermilk joined the label, for which he recorded “Sittin’ in the Balcony” in 1957 and, as the lead singer of Ebe Sneezer and His Epidemics, the comedy song “Asiatic Flu. ”  After Mr. Cochran’s success with “Sittin’ in the Balcony,” Mr. Loudermilk dropped out of college and moved to Nashville, where he recorded just one Top 40 song, “Language of Love” (1961). But he made an immediate impact there as a songwriter. With Kitty Wells and Roy Bodkin, he wrote the 1959 country hit “Amigo’s Guitar,” performed by Ms. Wells. That year, Stonewall Jackson scored the biggest hit of his career with “Waterloo,” by Mr. Loudermilk and Marijohn Wilkin. His many hits included “Sad Movies (Make Me Cry),” written for Sue Thompson and recorded by her in 1961. It was inspired, he said, by a woman who cried at the end of the movie “Spartacus. ” He supplied Ms. Thompson with yet another hit in “Paper Tiger” (1964). Mr. Loudermilk’s “Talk Back Trembling Lips” became a country hit for Ernest Ashworth in 1963 and a pop hit the same year for Johnny Tillotson. A striking example of the adaptability of his songs was “Then You Can Tell Me Goodbye,” recorded by the Cincinnati   group the Casinos and translated into an urbane Nashville idiom by Eddy Arnold a year later. Mr. Loudermilk was inducted into the Nashville Songwriters Hall of Fame in 1976. In the 1980s, he turned his attention to the study of ethnomusicology and indulging his passion for sailing and chasing hurricanes. His first marriage ended in divorce. In addition to his son Mike, he is survived by two other children from his first marriage, Rick and John, and by his wife, the former Susan Chollette. “I’m looking for the most different thing I can find,” Mr. Loudermilk told The Tennessean of Nashville in 1961 in a discussion of his songwriting style. “Everybody’s writing ‘I love you truly.’ You’ve got to find something new. I talk to drunks at the bus station, browse through kiddie books at the public library, get phrases from college kids and our babysitter. You’ve got to be looking all the time. ”'"}, "time": 1742562135.5974329}