{"duration": 0.15535688400268555, "input_args": {"text": "'The Onion’s Special Coverage Of Election Day 2016 Pinned Articles 5:51 PM Report: Turnout Fairly Unattractive Throughout Suburban Philadelphia \\nOur correspondents are reporting a steady turnout of homely and hideous residents throughout the suburban Philadelphia area that shows no signs of slowing down. In Montgomery County, polling places are said to be bustling with scores of schlubby, overweight voters, while Bucks and Delaware counties were reportedly busy all morning with an influx of unsightly, poorly groomed constituents, with many of the local oinkers having to wait upwards of an hour in line to cast their ballot. Overall, turnout in the area appears to be way uglier than analysts initially predicted. \\nCompiled from reports out of The Onion’s Philadelphia bureau as part of our Precinct Watch initiative, dedicated to covering all voting rights obstacles encountered by the feckless and feeble-minded American electorate. The Onion 9:51 PM The Onion Calls Upon The Cowardly State Of Iowa To Stop Its Dithering And Declare Itself For One Candidate Or The Other \\nWith 42 percent of precincts reporting and the margin between the candidates holding at less than a percentage point, The Onion calls upon the spineless state of Iowa to quit its tarrying, pull itself together, and make a goddamn choice already. According to The Onion ’s electoral models, the Midwestern state needs to get its shit in order and figure out which way it’s going to go, because this isn’t even that complicated, for Christ’s sake. The Onion projects that the timid little Hawkeye State has 20 minutes or so to decide which candidate will get its six puny electoral votes, or we’ll just go ahead and call it for Jill Stein, and you’ll just have to deal with it. The Onion 9:46 PM Nation’s Optimists Need To Shut The Fuck Up Right Now \\nWASHINGTON—Saying their rosy attitude about the state of the election was not helping anything given what is currently transpiring, sources confirmed Tuesday night that the nation’s optimists need to seriously shut the fuck up as soon as humanly fucking possible. “Sure, things may look bad right now, but even if the worst happens, it’s only four years we’re talking about here,” said Santa Fe, NM resident Pete Mirenge, one of hundreds of thousands of positive thinkers across the nation who would do everyone a huge goddamn favor by closing their fucking traps right this fucking second and keeping them sealed for the foreseeable future. “This is exactly why we have a system of checks and balances—to ensure that whatever happens in the election, the executive branch never gets too much power. Think about it: Has any president been able to carry out their platform to the letter? No. Nothing’s ever as bad as it seems, believe me.” According to sources, a calm and composed Mirenge—who reportedly has about five seconds before his mouth is shut for him—then added that the country’s been through much worse and everything turned out okay. 9:27 PM Tim Kaine Shows Hillary His Belly Button To Cheer Her Up After Losing Ohio \\nAfter it was officially projected that Donald Trump would take the critical swing state of Ohio and its 18 electoral votes, vice presidential nominee Tim Kaine quickly ran over to a visibly disappointed Hillary Clinton and attempted to lift her spirits by pulling his shirt up above his midriff and showing her his belly button. The Virginia senator spent several minutes holding up the bottom of his shirt with his chin while repeatedly pointing at his navel and informing Clinton that he has “a innie [sic],” prompting Clinton to curtly nod and say “Yes, that’s right,” before craning her neck to look past him at the electoral map to track her progress in Florida and Nevada. \\nOnion chief political correspondent Martin Hazelton is reporting live from Clinton HQ in New York City throughout the evening. The Onion Jill Stein Addresses Voters On Twitter The Onion 8:38 PM A Recap Of The Onion’s Exit Polls \\nThe Onion has been camped out at polling locations nationwide to collect the most accurate exit poll data and offer the only journalistic refuge in a world teeming with chaos and lies. Here are the highlights: The Onion 8:13 PM How Ordinary Americans Feel About What Remains Of This Country \\nEvery four years, against anyone’s better judgment, the American people are entrusted to elect the next president. The Onion let them tell their stories. 7:58 PM Clinton Leaves Office On Motorcycle To Hunt Down Precinct Leaders Who Haven’t Reported Yet \\nWith the majority of polls now closed across the country and no victor yet declared, Hillary Clinton reportedly left her campaign watch party moments ago, jumped on a red Suzuki Hayabusa motorcycle, and sped off to track down any precinct leader who has yet to report their county’s election returns. Secretary Clinton could be seen weaving between cars in Manhattan, driving on the sidewalk to get past several areas of heavy traffic, and then accelerating to speeds in excess of 110 miles per hour once she reached the interstate. Reporters were unable to keep up with the Democratic nominee, but numerous witnesses confirmed that Clinton had a baseball bat stowed next to her and appeared incredibly irate before she pulled down the tinted visor on her helmet, revved the motorcycle’s engine, and tore away. \\nOnion chief political correspondent Martin Hazelton is reporting live from Clinton HQ in New York City throughout the evening. The Onion 7:51 PM Wolf Blitzer Walks Into Middle Of Olive Garden Commercial To Announce Breaking Election Results \\nNEW YORK—Briskly striding into frame and interrupting a jubilant family meal, CNN anchor Wolf Blitzer reportedly entered the middle of an Olive Garden commercial airing during the network’s election coverage Tuesday night to announce a late-breaking election result. “Breaking news: CNN is calling Nevada for Hillary Clinton,” said Blitzer, stepping directly in front of a smiling mother passing a heaping plate of fettucine alfredo to her daughter and shushing the laughter of surrounding tables so that he could add that the victory dealt a severe blow to Donald Trump’s chances of reaching the Oval Office. “We are projecting that Secretary Clinton will take the crucial swing state’s six electoral votes, putting her on the inside track to securing the 270 electoral votes needed—hey, excuse me, will you please keep it down?—needed to win the presidency.” At press time, Blitzer was ducking in panic as the Olive Garden logo came swooping into frame. The Onion 7:36 PM Election Flashback: Nation Finally Shitty Enough To Make Social Progress (2008) \\nWASHINGTON—After emerging victorious from one of the most pivotal elections in history, president-elect Barack Obama will assume the role of commander in chief on Jan. 20, shattering a racial barrier the United States is, at long last, shitty enough to overcome. \\nAlthough polls going into the final weeks of October showed Sen. Obama in the lead, it remained unclear whether the failing economy, dilapidated housing market, crumbling national infrastructure, health care crisis, energy crisis, and five-year-long disastrous war in Iraq had made the nation crappy enough to rise above 300 years of racial prejudice and make lasting change. \\n“Today the American people have made their voices heard, and they have said, ‘Things are finally as terrible as we’re willing to tolerate,” said Obama, addressing a crowd of unemployed, uninsured, and debt-ridden supporters. “To elect a black man, in this country, and at this time—these last eight years must have really broken you.” \\nAdded Obama, “It’s a great day for our nation.” '"}, "time": 1742561724.6560104}