{"duration": 0.08314657211303711, "input_args": {"text": "'MIAMI  —   Who does Donald J. Trump call when he needs a wall built on the United   border? An old friend, it turns out: the   king of Miami, Jorge Pérez  —   often described as the Donald Trump of the tropics. Mr. Pérez is accustomed to such phone calls  —   and to people returning his. When Forbes magazine estimates your net worth at nearly $3 billion, V. I. P. treatment  —   even from the White House  —   tends to follow. That attention is also bipartisan. Mr. Pérez, 67, a major figure in the Miami art world and a developer who has helped remake the city’s skyline, publicly supported Hillary Clinton’s presidential campaign. But he said Mr. Trump lost little time in phoning him after his victory in November. In fact, the emails and calls between the two men  —   who have known each other as business partners for several decades  —   actually increased. “You have to give him credit for reaching out,” Mr. Pérez said of these conversations in an interview in the living room of his waterfront Miami mansion. Though Mr. Pérez passed on Mr. Trump’s January request for help constructing the wall  —   pointedly quipping, “Once it’s finished, which side of it will I be on?”  —   he said Mr. Trump still seemed eager to enlist him in joining the administration. Despite differences regarding both foreign affairs and federal housing policy (Mr. Pérez said, “I’m a strong believer in increased housing subsidies. ”) the president offered him the job of deputy secretary of Housing and Urban Development, Secretary Ben Carson’s No. 2, Mr. Pérez said. Again, he declined. In late January, he said, President Trump was back on the phone, discussing the job of assistant secretary of state for Western Hemisphere affairs, the position responsible for promoting United States interests throughout Latin America. Mr. Pérez, the son of Cuban exiles who was raised in Colombia, said no once again. Hope Hicks, a White House spokeswoman, asked about these offers and the current state of the relationship between President Trump and Mr. Pérez, declined to comment. Mr. Pérez, in describing his rejection of the job offers, explained, “I’m not a yes man. ” He added, “I told him he needs to hear the voices of people that are not dependent on him, that are going to give him the truth. ” To that point, he then told Bloomberg News in a Jan. 31 article he thought the idea of a Mexican border wall was “idiotic. ” That was more than two weeks ago. Despite sending   letters to Mr. Trump’s personal email account, and getting confirmation from Mr. Trump’s personal secretary that they had been read, Mr. Pérez hasn’t heard a word back. It’s a rupture that speaks to the uncomfortable social terrain Mr. Pérez now occupies. He is trying to balance a longstanding personal relationship with Mr. Trump as well as his own increasingly prominent role as an arts philanthropist  —   from producing documentary films and financing exchange programs for Cuban artists to donating over $55 million in cash and art to the financially beleaguered Miami Art Museum, which rechristened itself the Pérez Art Museum Miami in his honor. Yet these two milieus  —   the White House and the cultural arena  —   now eye each other with both open hostility and wariness toward anyone unwilling to pick a side. Mr. Pérez may see himself as a trusted back channel between apprehensive cultural figures and President Trump: “I would help him try to see the different opinions of the art world,” he said. Much of the art world, however, hardly seems in the mood for such a genteel   . “Jorge Pérez is wasting his time,” insisted Amanda Keeley, the owner of Miami’s Exile Books, when asked about Mr. Pérez’s efforts to reach out to the president. Ms. Keeley led fellow Miami artists to demonstrate at the Womens March on Washington last month. “Donald Trump isn’t interested in listening,” she said, “and you can’t have a conversation with someone who doesn’t want to listen to you. ” Indeed, as Inauguration Day loomed, many staff members at the museum carrying Mr. Pérez’s name said they believed the time had already passed for measured discussion. There was talk of heeding the call from the New   organizers of the J20 Art Strike, which sought to close museums nationwide as a symbolic action opposing not only Mr. Trump but also “Trumpists who use the social prestige of art to legitimize power. ” It was hard not to see the museum’s largest benefactor falling within those cross hairs. In response, its director, Franklin Sirmans, sent a memo to the staff, insisting “we will be open to all in our community as a place of dialogue and conversation” on Inauguration Day. A month later, Mr. Pérez is the one looking for help in sparking a dialogue. “He’s a good friend,” Mr. Pérez said of Mr. Trump. “Or at least he was, until I made a statement about the wall. ” The last time they spoke? “Him saying ‘please come to Palm Beach and    we’re spending weekends there. ’” And now? “It’s gone to radio silence, to zero,” he said. Mr. Pérez said he believed that as president, “instead of moderating, Donald was retrenching. The rhetoric of the campaign was brutal,” but he never assumed it was a preview of the candidate’s actual policies. Mr. Pérez was distressed by reports that Mr. Trump intended to eliminate the National Endowment for the Arts, on whose board Mr. Pérez had served under President Clinton. He was even more upset at chatter that Mr. Trump might take a tougher stand on the trade opening with Cuba, where Mr. Pérez accompanied President Obama last March as part of a historic state visit. Mr. Pérez said he couldn’t fathom this turnaround in Mr. Trump: “We used to talk about Cuba as a place to do business  —   a Trump hotel, a Trump golf course. ” So during that last phone call, he asked Mr. Trump   did he intend to tighten the trade embargo against Cuba? “He gave me no real answer  —   not yes, not no. Just ‘We’re going to see what happens, I haven’t decided on that yet. ’” Next came Mr. Trump’s executive order announcing a travel ban, prompting an exasperated Mr. Pérez to give his fateful Bloomberg interview. Meanwhile, Mr. Pérez is focusing on art. Later this month, he returns to Havana with Mr. Sirmans, visiting artists’ studios as a prelude to the June exhibition of “On the Horizon: Contemporary Cuban Art From the Jorge M. Pérez Collection,” drawn from more than 160 artworks that he recently donated. “Cubans came here and built up great businesses, bringing in Latin Americans who have a love for the city. ” He concluded, “contemporary Latin American art and culture is what should go with that movement. ” The composition of “On The Horizon” is evidence of further social changes. The work of younger Cuban artists who came of age in Miami, such as Antonia Wright, will be installed alongside that of artists who left the island at various points in their adult careers, such as Rubén Torres Llorca, as well as those still based there, like Kcho. In years past, that lack of distinction would have been politically fraught. Mr. Pérez bristled at the notion that   with Mr. Trump was futile. “Playing into the game is O. K. if you produce results,” he said of such outreach, citing his concerns over a report that the Trump administration was considering eliminating the arts endowment. “If I could sit down with him and get it to function at half its budget until the next Democratic president gets in, is that worse than having it totally cut?” Mr. Pérez stopped short and chuckled to himself. “First I need to be able to talk to him. ” He’s still waiting for the phone to ring.'"}, "time": 1742628412.3261533}