{"duration": 0.09421944618225098, "input_args": {"text": "'As the nation struggles to understand the motive behind the ambush-style executions of two Iowa police officers, a woman claiming to be the daughter of the alleged shooter has come forward on social media explaining that mental illness played a factor in the heartbreaking case.\\nWhile few details surrounding the shootings have been released, it is being reported that 46-year-old Scott Michael Greene has been arrested in connection with the horrific attacks which claimed the lives of Urbandale officer Justin Martin and Des Moines PD Sgt. Anthony “Tony” Beminio.\\nThe situation began to unfold Wednesday morning after law enforcement received a report of shots fired around 1am. Reportedly, after officers arrived on scene of the disturbance it was discovered that Urbandale officer Martin had been executed while sitting in his patrol car. Roughly 20 minutes after grizzly discovery of slain Officer Martin, authorities found a second victim. Approximately 2 miles away from the location of first reported shooting, authorities found Des Moines PD Sgt. Beminio deceased in his patrol car.\\nAuthorities later announced that they had arrested the suspected shooter identified as Greene without incident in the area of West Des Moines. Greene was said to have been on foot at the time of capture and surrendered to a Department of Natural Resources officer willingly.\\nDes Moines police Sgt. Paul Parizek told media that “In all appearances it looks just like… these officers were ambushed, ” adding that it did not look like there was any “ interaction ” between the deceased officers and the suspected shooter.\\nFollowing the release of the suspected shooter’s identity, Sammie Greene posted an image on social media with the message: “ #Scott’sLifeMatters ”\\nVia FB \\nIn the comment section of the post, Sammie wrote her “condolences ” to the families of the victims and stated that her father “was very very sick mentally.” \\nMore on the possible motivation behind the shootings via Heavy.com :\\nA man named Scott Greene, who matches the description of the suspect, recorded himself being kicked out of a football game in Urbandale, Iowa, on October 14, 2016.\\nThe Urbandale School District confirmed to the Des Moines Register that a man named Scott Greene was removed from the football stadium that day. The stadium is at the same intersection where the Urbandale police officer was killed Wednesday morning, the newspaper reports.\\nGreene also posted a 10-second video featuring only a still photo showing him in the stands of the high school holding American and Confederate flags. You can see that photo above.\\nIn the comments of one of the videos , Greene wrote, “I was offended by the blacks sitting through our anthem. Thousands more whites fought and died for their freedom. However this is not about the Armed forces, they are cop haters.”\\nHe titled the second video, which you can watch below, “Police Abuse, Civil Rights Violation at Urbandale High School.”\\n\\n“This is an assault on a person exercising his constitution rights on free speech!” he wrote in the description.\\nThe 10-minute video shows Greene after he was removed from the stadium, interacting with Des Moines and Urbandale police officers who are trying to get him to leave the area.\\nIt begins with officers telling Greene to leave for “committing a disturbance in the stands.” He asks them repeatedly, “Have I committed a crime?”\\nHe also accuses an officer of “assaulting” him by “grabbing” him and “shoving” him around.\\nWe will continue to update as new details surface. \\n'"}, "time": 1742563972.5833893}