{"duration": 0.12576007843017578, "input_args": {"text": "'From the start of season three of “The Strain” the group has been scattered; divided over their attempt to escape the fallen city of New York.\\nAfter inadvertently causing the death of Nora, Zach was captured by the enemy. Eph was alone and wandering while self-medicating with any available bottle. Meanwhile, Quinlan and Setrakian continued the good fight against the Strigoi, while they deciphered the Occido Lumen. Fet was making waves in the battle for the city , as he worked closely with anti-Strigoi forces as a mentor for police forces. On the other side of the fight, The Master continued lurking and plotting in his new host body. Eichorst and Palmer further delved into their bitter partnership as the two made subtle jabs at each other like high school frenemies.\\nOverall, the tone and feel of “The Strain” was much different from Season 2. Considering that the season was minimized to 10 episodes (instead of the usual 13) and has experienced dwindling ratings, writers flushed out many of the subplots that led the main focus of the show to nowhere. The first couple of episodes rehashed the state of the group and where each character’s new motivations lay. Once again, writers were falling into the same trap of forcing viewers to care about minor characters; Zach and Dutch.\\nIt seems that Dutch’s departure from her former lover was short-lived, as the heroine joined a new group of wanderers to explore the city. Considering that long-term relationships do not seem to be her forte, she parted ways with her hacker group, within a few episodes into the season. It is understandable that the writers wanted to set up her return as the forefront by moderately exploring her past and her hacker friends, but there was nothing compelling or intriguing to discover or watch. Dutch making her way back to Eph did spark the beginning of his motivation to continue the good fight and helped save him from his depression. It was no surprise that she would later take over the role of Nora, in the series, as both his lab partner and lover.\\nBy the third episode of “The Strain,” it appeared that the writers were back on track with creating an entertaining story. The ultimate showdown between Quinlan and The Master was one of the highlights of the series. The made for a great watch and interesting turn of events. Season 3 followed the same path by introducing more action into the show. The battle ended with the villain making a narrow escape, although, the tone of the “The Strain” shifted from the slow lane to a fast-paced, action-driven plot, as writers began taking viewers on a more thrilling ride.\\nThis concept became more apparent in Episode 3, “Madness,” as the timeline moved forward two weeks. The epidemic had spread across the globe and the pressure was on for the group to succeed in ending The Master’s reign. Councilwoman Feraldo was still leading the good fight but could not overturn The Master’s forces. Even with her ambitious attack on Grand Central’s nest, Feraldo was outmatched and outnumbered. Thousands of Strigoi overran the city and destroyed many of her safe posts. By the time she threw in the towel and abandon the city, it was too late. The Master’s forces had closed in. This was one of the most emotional battles for viewers to watch.\\nWith news that the fourth season was going to be the last for “The Strain,” it seemed that the writers were cleaning house and tying up many loose storylines. In Episode 8, “White Light,” viewers were privileged to witness a glimpse of The Master’s ultimate plan. The audience was also able to see the ancients do more than simply lay there and twitch, as they fought for their lives against The Master’s forces. The battle proved in vain, as they too met their end, with the detonation of a nuclear bomb inside their lair.\\nIt seemed that as the heroes were gaining support, The Master was already one step ahead of them. Palmer finally came to his senses and decided to turn his resources toward the help protagonists in”The Strain,” when The Master forcibly made Palmer his new host body.\\nDuring the final episode, “The Fall,” writers saved the best twist for last. Even after The Master’s rouse to regain control of the nuclear bomb, the team proved successful in finally trapping him in his silver tomb. Unfortunately, their plans failed when Zach detonated the nuclear weapon planted in the Statue of Liberty, blanketing the sky in darkness in the aftermath. The Master was able to escape his tomb during the aftershock. It seems that this is the recurring theme in every season finale of the series; once the team comes close to success, they inadvertently become thwarted by the villain to a new catastrophic beginning for the next season.\\nThis was a strong and jaw-dropping way to end the season, which proved to be one of “The Strain’s” most eventful episodes. Overall, the season was one of the strongest in the series. Viewers delved into the back-story of many of the major characters, like Palmer and Quinlan. Adding more dimension and depth to both, the writers plucked at the viewer’s heartstrings, with compelling narratives of each character’s history. One of the strongest storytelling qualities of “The Strain” is the flashback moments. It is almost as if the writers took George Santayana’s Quote: , “To know your future, you must know your past” literally, while writing Season 3. Many of the flashback scenes helped foreshadow the events that unfolded in each episode.\\nIt is unfortunate that the show is meeting its end, in the fourth installment. This is a bittersweet moment for viewers. The season had its ups and downs, highlights and rushed finishes but was still a great ride. The closing of the “The Strain,” has created a faster paced narrative and a more thrilling turn of events that may have come a little too late. The tone of the show has now shifted from the beginning of a vampire apocalypse, to a full-blown post-apocalyptic plot, as the Strigoi flooded the streets of New York City in the Season 3 finale.\\nOpinion by Tyler Cole\\nEdited by Jeanette Smith\\nSources:\\nFX Networks : The Strain\\nImdb : The Strain\\nDeadline Hollywood : The Strain\\nImages Courtesy of FX Networks Fox Entertainment Group – Used With Permission the strain'"}, "time": 1742563947.5443017}