{"duration": 0.09516549110412598, "input_args": {"text": "'ST. ANTHONY, Minn.  —   A lawyer for the suburban police officer who fatally shot a black man during a traffic stop said on Saturday that the race of the driver, Philando Castile, played no role in how his client responded, and that the officer “was reacting to the presence of a gun” when he opened fire. The comments from the lawyer, Thomas Kelly, provided the fullest accounting yet of Officer Jeronimo Yanez’s version of the shooting Wednesday night, even as many details remain unclear. Officer Yanez, of the St. Anthony police, is on leave while state authorities investigate the shooting, which has prompted protests and raised questions about what role race might have played in the stop. “The shooting had nothing to do with race and everything to do with the presence of that gun,” Mr. Kelly said in an interview, noting that Officer Yanez is Latino. Mr. Castile “was not following the directions of the police officer,” Mr. Kelly said, but he declined to provide further detail. Much of what is known about the shooting comes from a Facebook Live video of the aftermath streamed by Mr. Castile’s girlfriend, Diamond Reynolds. In that video, in which Mr. Castile is seen bleeding profusely in the driver’s seat, Ms. Reynolds tells the officer that her boyfriend had been reaching for his identification when he was shot. She also suggested that he had a permit to legally carry a gun. “Please, officer, don’t tell me that you just did this to him,” Ms. Reynolds said in the video, which quickly gained international attention. “You shot four bullets into him, sir. He was just getting his license and registration, sir. ” In the video, Ms. Reynolds said her boyfriend was stopped for a broken taillight. Mr. Kelly said there was “more than the reason for the equipment violation” to pull Mr. Castile over, but would not specify what those other reasons might have been. The Minnesota Bureau of Criminal Apprehension, which is investigating the case, has released few details. The bureau has confirmed that the episode started as a traffic stop by Officer Yanez and a colleague near the state fairgrounds in Falcon Heights, a suburb patrolled by the St. Anthony Police Department. Mr. Castile died at a hospital shortly after the shooting. The bureau said a weapon was recovered at the scene. Gov. Mark Dayton, who has met with protesters and black leaders, has expressed sympathy for the Castile family and concerns about the role of race in the shooting, infuriating some in law enforcement. “Would this have happened if those passengers  —   the driver and the passengers  —   were white?” Mr. Dayton asked on Thursday. “I don’t think it would’ve. ” Protesters have gathered outside the governor’s residence in St. Paul since shortly after the shooting, and many have framed it as yet another episode of a black man being unjustly gunned down by a police officer. On Friday night, a sizable, racially diverse crowd gathered outside the governor’s mansion, where they had decorated the street with chalk messages like “This needs to end!” and “Justice 4 MN. ” The Bureau of Criminal Apprehension has provided no timeline for when its investigation would be finished, though many expect it to take weeks or months. At that point, the case will go to the Ramsey County prosecutor, who can either decide on charges himself or present the evidence to a grand jury. Mr. Kelly said Officer Yanez had cooperated with investigators, providing informal information immediately after the shooting and giving a full statement within about 15 hours. “He’s very distressed about this incident, and he feels badly for the family of Philando Castile,” Mr. Kelly said. “It’s a tragic incident. ”'"}, "time": 1742562131.4968941}