{"duration": 0.06278347969055176, "input_args": {"text": "'Despite the establishment media’s hopes and repeated claims that it could never happen, Donald Trump is the president-elect of the United States of America. Now liberal pundits are scrambling to explain how the hell it happened. Isn’t this country changing demographically? Didn’t Donald Trump disqualify himself with his racist and sexist statements? What about the nuclear codes? \\nWell, Donald Trump had one thing in his favor: he ran against one of the most unpopular and despised presidential candidates in American history, Hillary Rodham Clinton. Combine the electorate’s Clinton antipathy with a risky but targeted strategy to flip the Rust Belt and it’s not so hard to understand why Donald Trump, a man with no experience in government, will be sitting in the oval office come late January.\\nThe usual suspects have had no luck in crafting a convincing narrative that doesn’t make them look like idiots. Joan Walsh of The Nation, a shameless hack for Hillary, wrote a sardonic piece wherein she played the victim and defended Clinton’s candidacy, saying, “she had more of a message than her lefty haters give her credit for.”\\nActually, no, not really. Clinton ran the definition of a negative campaign and what little of a progressive message she presented was copy and pasted from Senator Bernie Sanders’ campaign and extremely unconvincing given her neoliberal record. Clinton had trust issues from the beginning, which were only exacerbated by her extremely dishonest attacks on Sanders and equally dishonest revisionism of her own herstory. \\nJamelle Bouie, whose biggest claim to fame is saying Trump could not win, offers another equally moronic analysis of Trump voters, claiming anyone who voted for Trump is a racist and deserves no empathy. Yes, African-Americans, Asians, and non-white Hispanics voted for Trump, but according to Bouie they apparently hate themselves.\\nBouie is reliably wrong, so expect him to fail up in pundit world. But his blame the voter strategy parallels that of bourgeoisie feminists, who claim women who voted for Trump (or even just did not for Clinton) did so because they have “internalized misogyny.” Jess McIntosh, the former communications director for the Clinton campaign, made that explicit claim in an interview with DNC-friendly MSNBC. \\nSo, to recap, anyone who did not vote for Hillary Clinton this cycle hates minorities and women (including minorities and women).\\nWell, allow me to retort. Hillary Clinton lost the election because she was a terrible candidate. Nobody likes or trusts her (yes, elections actually are popularity contests) and her neoliberal domestic policies and neoconservative foreign policies turned people off because they are genuinely bad. Clinton represented the establishment in a change election, something she was happy to do. She even openly courted Republicans hoping her “temperament” talking point would make partisan Republicans vote for one of the most hated Democrats in history. It didn’t work.\\nClinton also refused to talk about class and only seriously brought up racism to label Trump supporters as racist “deplorables” and “irredeemable.” Which, beyond excessively judgmental, was just stupid politics as many of those people live in the god damn Rust Belt. Way to ensure they voted Hillary! If Clinton is so smart, why is she so stupid? Riddle me that.\\nNow, thank the lord, we as a country are going to move on from the Clinton crime family. The Democratic Party needs a major overhaul, which it will have plenty of time to focus on as it is now out of power in the House, Senate, and White House. Great job, Team Hillary.\\nBut first, how about the Hillary Clinton supporters stop blaming everyone else for their terrible candidate? Democrats had a populist who did well in the Rust Belt, Clinton supporters did everything they could to destroy him. This election is on them.\\nThe post Dear Hillary Supporters, Own Your Terrible Candidate appeared first on Shadowproof .\\n'"}, "time": 1742561800.1579611}