{"duration": 0.08691549301147461, "input_args": {"text": "'Archives Michael’s Latest Video Will The FBI Email Investigation Shed New Light On The Lolita Express And Other Clinton Sex Scandals? By Michael Snyder, on October 31st, 2016 \\nCould it be possible that the newly discovered Clinton emails that the FBI is currently examining contain evidence of crimes other than just the mishandling of classified documents? For years, there have been shocking allegations about the sexual behavior of both Bill and Hillary Clinton in the conservative media, but neither Bill nor Hillary has ever been convicted of a sexual crime. However, that may be about to change. There is nobody on the planet that has been closer to Hillary Clinton over the past decade than Huma Abedin, and now the FBI has their hands on approximately 650,000 emails that were stored on electronic devices owned by her and her estranged husband Anthony Weiner. Without a doubt, many of those emails will relate to the investigation into Hillary Clinton’s mishandling of classified documents, but many of those emails will also be personal in nature. So what will the FBI learn about the Clinton sex scandals from those emails, and will that information be shared with the American public? \\nIn particular, any information regarding Clinton ties to Jeffrey Epstein and “the Lolita Express” could be extremely explosive. \\nBill and Hillary Clinton were both very good friends of billionaire Jeffrey Epstein before he was convicted of soliciting sex from a young girl in 2008. In fact, flight records show that Bill Clinton was a frequent passenger on Epstein’s plane that eventually came to be known as “the Lolita Express”… \\nBill Clinton took repeated trips on the “ Lolita Express “—the private passenger jet owned by billionaire pedophile Jeffrey Epstein—with an actress in softcore porn movies whose name appears in Epstein’s address book under an entry for “massages,” according to flight logbooks obtained by Gawker and published today for the first time . The logs also show that Clinton shared more than a dozen flights with a woman who federal prosecutors believe procured underage girls to sexually service Epstein and his friends and acted as a “potential co-conspirator” in his crimes . \\nOverall, Bill took at least 26 trips on board “the Lolita Express”. Fox News says that the plane “earned its Nabakov-inspired nickname because it was reportedly outfitted with a bed where passengers had group sex with young girls.” \\nBut sex with underage girls didn’t just happen on the plane. One of the favorite destinations for “the Lolita Express” was Epstein’s 72-acre “Orgy Island”. Here is more from Fox News … \\n“Bill Clinton … associated with a man like Jeffrey Epstein, who everyone in New York, certainly within his inner circles, knew was a pedophile,” said Conchita Sarnoff, of the Washington, D.C. based non-profit Alliance to Rescue Victims of Trafficking, and author of a book on the Epstein case called “TrafficKing.” “Why would a former president associate with a man like that?” \\nEpstein, who counts among his pals royal figures, heads of state, celebrities and fellow billionaires, spent 13 months in prison and home detention for solicitation and procurement of minors for prostitution. He allegedly had a team of traffickers who procured girls as young as 12 to service his friends on “Orgy Island,” an estate on Epstein’s 72-acre island, called Little St. James, in the U.S. Virgin Islands . \\nAre you starting to understand how serious this could be? \\nIf Bill Clinton had sex with an underage girl just one time, that would be enough to potentially send him to prison for the rest of his life. \\nCourt records show that Jeffrey Epstein had 21 different phone numbers for Bill Clinton. To say that they were close would be a massive understatement. \\nAnd what was the nature of Hillary Clinton’s involvement with Jeffrey Epstein? \\nThere are so many unanswered questions, and I don’t know what these 650,000 emails are going to show. But there are persistent whispers that law enforcement officials that were looking through them for the Anthony Weiner case found something big. \\nAnd the truth is that the FBI would have never renewed this investigation so close to the election unless a gamechanger had been discovered. FBI Director James Comey had to know that he was going to take a tremendous amount of heat for this decision, and to move forward on something like this without good reason would be career suicide. \\nFor the moment, Hillary Clinton is putting on a brave face. On Monday, she challenged the FBI to hurry up and read her emails so that they could see that she had nothing to hide… \\nWith eight days remaining until Election Day, Hillary Clinton told a crowd of supporters here Monday that the FBI should hurry up and check out the additional emails that agents said they found while investigating the estranged husband of one of her aides. \\n“Go ahead. Look at them,” the Democratic nominee said about the emails that may have been originally housed on a private server she used as secretary of state — a revelation that has thrown the presidential election into turmoil. \\nMaybe Clinton is telling the truth, but with her you just never know. As I recently explained to a live studio audience down at Morningside , Hillary Clinton is a habitual liar and it is hard to trust her about anything at this point. \\nIf she is lying about these emails, hopefully we will find out very quickly. \\nHer opponent, Donald Trump, seems energized by this new scandal, and he is warning that America may be facing a “constitutional crisis” if Clinton wins the election… \\nRepublican presidential candidate Donald Trump, buoyed by tightening polls and a renewed controversy over Democrat Hillary Clinton, told an enthusiastic crowd in suburban Grand Rapids Monday that the U.S. could face a “constitutional crisis” if Clinton is elected president on Nov. 8. \\nTrump predicted a “protracted criminal investigation and probably a criminal trial,” and said “nothing will get done.” \\nFBI Director James Comey has “brought back his reputation” by reactivating an investigation into the handling of her State Department e-mails , Trump said to loud cheers. \\nBut the cold, hard reality of the matter is that we could potentially be facing something much more serious than just a “constitutional crisis”. \\nIf the FBI finds evidence of very serious crimes committed by Hillary Clinton, she could actually be forced to withdraw from the race on the eve of the election, and that would throw the entire process into a state of chaos . \\nEven so, it is exceedingly important that the American people get the truth about what is in these emails, and hopefully that will happen as rapidly as possible. \\nAbout the author: Michael Snyder is the founder and publisher of The Economic Collapse Blog and End Of The American Dream. Michael’s controversial new book about Bible prophecy entitled “The Rapture Verdict” is available in paperback and for the Kindle on Amazon.com.*'"}, "time": 1742562442.032809}