{"duration": 0.27564144134521484, "input_args": {"text": "\"=By= Edward Curtain Editor's Note This article is so much more than just another paean for Dylan. It is an exploration of life and the hope than drives it. Curtain says in the following piece: “The news of one creative spirit’s death gave birth to another creative spirit’s gift to life.” And a recognition of the creative contribution of one has inspired an examination of creativity itself. “The song ‘Political World’ could have been triggered by current events. There was a heated presidential race underway …. But I had no interest in politics as an art form….The political world in the song is more of an underworld….With the song I thought I might have broken through to something. It was like you wake up from a deep and drugged slumber and somebody strikes a little silver gong and you come to your senses.” Bob Dylan, Chronicles W e live in dark times when the prison gates of seeming hopelessness clang shut around us. Endless U.S. led and sponsored wars, a New Cold War, nuclear threats, economic exploitation, oligarchical rule, government spying, drone killings, loss of civil liberties, terrorism, ecological degradation, etc. – the list is long and depressing. Awareness of a deep state hidden behind the marionette theatre of conventional politics has grown, even as the puppet show of electoral distractions garners the headlines. Readers of the alternative media learn the truth of government conspiracies involving assassinations – JFK, MLK, RFK, et al. – and countless other evil deeds without cessation. Excellent writers uncover and analyze the machinations of those responsible. Anger and frustration mount as people listen to a litany of bad news and propaganda spewed out by the mainstream corporate media. It is easy to be overwhelmed and disheartened. Despite the mute despair and apathy that fill the air, hope is needed to carry on and resist these destructive forces. Sometimes in such a dark time the eye begins to see and the ear hears hope in unexpected places. Doing so necessitates a bit of a sideways move to discover pockets of resistance hiding in the shadows. There are torches of illumination in the underworld, but we need to come to our senses to get there. “Emotion is the chief source of all becoming-conscious. There can be no transforming of darkness into light and of apathy into movement without emotion.” Carl Jung If you’ve ever played music or basketball, fell dizzyingly in love, or lapsed into a spell writing words or being engrossed in a passionate pursuit, you’ll easily grasp what follows. But maybe these specific experiences aren’t necessary. You’ve lived, you’re alive, and you can hear the pitter-patter beat of your dribbling heart. That’s probably plenty. You know the game can be a roller-coaster ride with all its ups and downs, and when it ends you will have won or lost something, exactly what being of the essence. Rhythm, melody, and movement: from these life is born and sustained. They are also integral to sports and art – music, writing, painting, sculpture, dance, etc. – even when they are apparently absent. Tall Walking Figure by Alberto Giacometti. (Credit: Billy Liar .) If, for example, one looks at Alberto Giacometti’s sculpture, Tall Walking Figure, its immobility implies movement. Such paradoxical inclusiveness pertains to still-life painting as well. While seemingly immobile, and defined by some as dead life, such paintings are encompassed by the presence of the absence of movement and change, the essence of all living things. To grasp the paradoxical nature of art – and life – one must approach them as an artist and see the wholeness in broken pieces. “Everything is broken,” Bob Dylan sings, “take a deep breath, feel like you’re choking.” “Life is the best play of all.” Sophie Michel, a 7 year-old musician I think it is fair to say that living is the ultimate art and as the artists of our lives our medium is time and space. And that it is in sound that time and space are epitomized. Musical sounds carry us through time and space in a reverberating vital impulse. Music brings us to our senses. Being emotional, it sets us in motion. We are moved. Sports, as the etymology of the word suggests (desporter – to divert), is a diversion from something. Sports involve us in movement through time and space to an unnecessary goal where someone wins and someone losses. In sports we choose to overcome superfluous obstacles for fun and for deeper reasons we may not realize. Sports only matter because they don’t. “What we play is life.” Louis Armstrong A few years ago my friends and I were playing in basketball tournaments for men over fifty and we qualified for the Senior Olympics at the University of Pittsburgh. We acquired a sponsor, a local funeral home that made warm-up jerseys for us. Being used to dealing with bodies at rest, these comedians knew we were a bunch of aging hoopsters intent on keeping our bodies in motion for as long as we could. So they had shirts made with that up-beat and adolescent cliché printed on the front, “Basketball is Life.” Lest we forgot, and being in the trade of taking bodies at rest to the underworld, on the back they had printed “Leave the Rest to Us: Flynn and Dagnoli Funeral Home.” Most of us found the juxtaposition hilarious (including one funny Irishman who ended up dead at the funeral home), but one teammate found it disturbing, which gave the rest of us additional sardonic laughs. Sex and death and one’s ongoing vitality are the stuff of uneasy laughter in the locker rooms of aging men. It’s a place for essentials. “He was like a great singer with a style all his own, a pacing that was different, a flair for the unusual.” Chick Hearn, play-by-play announcer for The Los Angeles Lakers about Pete Maravich I was reminded of this as I was rereading bits of Bob Dylan’s fascinating and poetic memoir, Chronicles: Volume I, and came upon his recounting of hearing of the news of the death of “Pistol” Pete Maravich, the greatest scorer in college basketball history and a magician without par on the court. It was January 5, 1988. \\nMy aunt was in the kitchen and I sat down with her to talk and drink coffee. The radio was playing and morn- ing news was on. I was startled to hear that Pete Maravich, the basketball player, had collapsed on a basketball court in Pasadena, just fell over and never got up. I’d seen Maravich play in New Orleans once, when the Utah Jazz were the New Orleans Jazz. He was something to see – mop of brown hair, floppy socks – the holy terror of the basketball world – high flyin’ – magician of the court. The night I saw him he dribbled the ball with his head, scored a behind the back, no look basket – dribbled the length of the court, threw the ball up off the glass and caught his own pass. He was fantastic. Scored something like thirty-eight points. He could have played blind. Pistol Pete hadn’t played professionally for a while, and he was thought of as forgotten. I hadn’t forgotten about him, though. Some people seem to fade away but then when they are truly gone, it’s like they didn’t fade away at all. Dylan has the poet’s touch, of course, a hyperbolic sense of the fantastic that draws you into his magical web in the pursuit of deeper truth. In ways he’s like the Latin American magical realist writers who move from fact to dream to the fantastic in a puff of wind. He goes on to write that after hearing the news of Pistol Pete’s sad death playing pickup basketball, he started and completed the song “Dignity” the same day, and in the days that followed song after song flowed from his pen. The news of one creative spirit’s death gave birth to another creative spirit’s gift to life. (I am reminded of Shakespeare writing Hamlet after his father’s death.) “It’s like I saw the song up in front of me and overtook it, like I saw all the characters in this song and elected to cast my fortunes with them …. The wind could never blow it out of my head. This song was a good thing to have. On a song like this, there’s no end to things.” One can hear echoes of Hemingway, another artist obsessed with death, in those last few sentences. Unlike Hemingway, however, Dylan’s focus on death is in the service of life and hope. For him there is no end, while Hemingway is all ending – nada, nada, nada – nothing, nothing, nothing – “it was all a nothing and a man was nothing too,” he writes in his haunting story, “A Clean, Well-Lighted Place.” Dylan’s focus on the shadow of death is seen within the light of life – todo – all or everything. The darkness is there but is encompassed by the light. Nada within todo. As he told the AARP magazine last year in a fascinating interview, he’s been singing about death since he’s been twelve. And out of that singing – year after year for fifty plus years and counting – he has found and expressed the light of hope. Bob Dylan (Credit: Moderate Voice ) Dylan is our Emerson. His artistic philosophy has always been about movement in space and time through song. Always moving, always restless, always seeking a way back home through song, even when, or perhaps because, there are no directions. “An artist has got to be careful never to arrive at a place where he thinks he’s at somewhere,” he’s said. “You always have to realize that you are constantly in a state of becoming and as long as you can stay in that realm you’ll be alright.” Sounds like living, right. Sounds like Emerson, also. “Life only avails, not the having lived. Power ceases in the instant of repose; it resides in the moment of transition from a past to a new state, in the shooting of the gulf, in the darting to an aim. Thus one fact the world hates, that the soul becomes.” It was about ten years ago when we traveled to that Senior Basketball Olympics at the University of Pittsburgh. We drew many uneasy smiles as we paraded around with the backs of our shirts announcing the services of the men who take us to the underworld. We won a few games and lost others; were eliminated and left for home disappointed, some of us more than others, depending on each man’s competitive fire to defeat the foe. Like all athletes, losing felt like a small death. Even small deaths are hard to swallow, however, especially when knowing how way leads on to way and you doubt you will ever come back. As evening was darkening the Amish countryside, we departed east through country roads in silence, each lost in his interior monologue on the journey ahead. Playing low on the radio, from my back seat I could barely make out Dylan singing, “It’s not dark yet, but it’s getting there.” Two years ago there was a short Grantland documentary, “The Finish Line,” about Steve Nash, the latest Pistol Pete. An uncanny player, Nash was battling injuries and age, and the documentary shows him pondering whether or not to retire or continue his rehabilitation and attempt a comeback. In the opening scene Nash goes out with his dog into the shadowy pre-dawn where he muses on his dilemma. His words are hypnotic. “I feel,” he said, “that there’s something that I can’t quite put my finger on that – I don’t know – I feel that it’s blocking me or I can see it out of the corner of my mind’s eye, or it’s like this dark presence ….is it the truth that I’m done?” Hobbled by a nerve injury that severely limited his movement, he played a few more games and retired within a year. Like Pete Maravich, he had brought an infectious joy to his playing, but he left without fulfilling his dream of winning an NBA championship. Of his retirement he said, “It’s bittersweet. I already miss the game deeply, but I’m also really excited to learn to do something else.” Unlike many athletes, Nash was moving on; his “dark presence” wasn’t a final death but a step on the road to a hard rebirth. It was a Dylanesque restless farewell: “And though the line is cut/It ain’t quite the end/I‘ll just bid farewell till we meet again.” “A song is like a dream, and you try to make it come true. They’re like strange countries that you have to enter. You can write a song anywhere …. It helps to be moving. Sometimes people who have the greatest talent for writing songs never write any because they are not moving.” Bob Dylan, Chronicles Dylan has long been accused of abandoning his youthful idealism and protest music. I think this is a bum rap. He was never a protester, though his songs became anthems of the civil rights and anti-war movements. There is no doubt that those songs were inspirational and gave people hope to carry on the good fight. But in turning in a more oblique and circumspect musical direction, following his need to change as the spirit of inspiration moved him, Dylan’s songs have come to inspire in a new way. You know his sympathies lie with the oppressed and downtrodden, but he doesn’t shout it. A listener has to catch his drift. If you go to the music, and dip into his various stylistic changes over the decades, you will find a consistency of themes. He deals with essentials like all great poets. Nothing is excluded. His work is paradoxical. Yes, he’s been singing about death since twelve, but it has always been countered by life and rebirth. There is joy and sadness; faith and doubt; happiness and suffering; injustice and justice; romance and its discontents; despair and hope. His music possesses a bit of a Taoist quality mixed with a Biblical sensibility conveyed by a hopelessly romantic American. He has fused his themes into an incantatory delivery that casts a moving spell of hope upon the listener. He is nothing if not a spiritual spell-binder; similar in many ways to that other quintessential American – the Beat poet Allen Ginsberg, whose best work was a poetic quest for an inspired salvific poetry. If the listener is expecting an argument, a thesis, inductive reasoning, or a didactic approach from Dylan, he is out of luck, and rather than be inspired he will be disappointed. This is art, not theory, and art of a special kind since Dylan is an artist at war with his art. His songs demand that the listener’s mind and spirit be moving as the spirit of creative inspiration moved Dylan. A close listening will force one to jump from verse to verse – to shoot the gulf – since there are no bridges to cross, no connecting links. The sound carries you over and keeps you moving forward. If you’re not moving, you’ll miss the meaning. “A bird does not sing because it has an answer. It sings because it has a song.” Chinese Proverb So if the world is getting you down and all the news is bad to your ears, don’t lose hope. Step to the side, out of the glare of the sun, the blare of the headlines where lies and fears shout in our ears and echo down our days like a repetitive nightmare. Give Dylan a listen. As he has said of spiritual songs, “They brought me down to earth and they lifted me up all in the same moment.” His songs have the same paradoxical power because he excludes nothing. That is why they are truthful. It is fitting that his latest album, “Shadows in the Night,” comprised of ten beloved old ballads sung by Frank Sinatra, from “The Night We Called it a Day” to “Some Enchanted Evening,” has him changing again, going back to go forward. He is full of surprises, which any child will tell you bring joy because surprises and change are the core of living. To change this crazed world, we must change and find hope and joy along the way. Repetition will kill us. Dylan’s artistic metamorphoses and ingenious song writing offer offbeat sources of hope. Just listen. Having been compared to Frank Sinatra with these songs, he’s said, “You must be joking. To be mentioned in the same breath as him must be some sort of high compliment. As far as touching him goes, nobody touches him. Not me or anyone else …. But he never went away. All those things we thought were here to stay, they did go away. But he never did.” Sinatra, like Pistol Pete, didn’t fade away because he too inspired Dylan to inspire us to hope and carry on. If it feels dark and night-like to you, move sideways into the shadows. Look away and you’ll see the light. Or if you like basketball or dancing, like to move to the beat, listen to Dylan singing “Hurricane,” a long narrative song about the framing of the boxer Ruben “Hurricane” Carter. It will get your blood flowing, your passions riled, and your body moving. It’s perfect for practicing all the dribbling tricks Pistol Pete performed. I thought of using it at the Senior Olympics, but the beat seemed a little too rapid and excitable for the over fifty AARP crowd. The shirts were sending an undertaking message that I didn’t want made real. Hope is one thing, but traveling too fast is another. Anyway, one of my teammates was in swift pursuit of a woman there whom he described as a twin of his ideal woman – Pamela Anderson. He didn’t need any more excitement. \\n\\nEdward Curtin is a writer who teaches at Massachusetts College of Liberal Arts and has published widely. \\n  Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742562261.9415302}