{"duration": 0.08327579498291016, "input_args": {"text": "'  \\nA casting call obtained by Fox News on Wednesday was apparently sent out by an “up-and-coming conservative media network currently in development.” \\nAccording to the casting call, the upstart network is searching the U.S. for hosts, reporters, and right-wing well-spoken contributors. \\nThe notice stresses that on-air talent “must be knowledgeable about conservative viewpoints, current events, and the presidential election,” adding applicants must also “look upscale and intelligent,” and should be “outspoken and energetic.” \\nThe network is holding auditions at a secret New York City studio on November 7, just before election day. \\nAnd while the casting call does not disclose the identity of the mystery employer, it does suggest that the network’s first programming will be streamed online. Coincidentally, the Trump campaign has just set up it’s online Facebook live feed, where his aides have been broadcasting Trump events and counter news programming. \\nVanity Fair was the first to report in June that Trump was thinking about starting his own media network. \\nIn September, the Financial Times reported that Trump’s son-in-law Jared Kushner started making inquiries into launching a new media company after the election to capitalize on his father-in-law’s political movement. \\nHowever, Trump has openly dismissed the idea, and told the Washington Post last month: \\n“I want to win the presidency, and I want to make America great again. It’s very simple. I have no interest in a media company.” \\nWouldn’t it be funny if one of his kids just so happened to start a media company after the election? \\nOr perhaps Donald Trump just does it under his name, after all, it’s not as if he’s ever had a problem with lying, especially when it comes to business. \\nFeatured image via Chip Somodevilla/Getty Images Share this Article!'"}, "time": 1742562687.121757}