{"duration": 0.15198111534118652, "input_args": {"text": "'The political news cycle is fast, and keeping up can be overwhelming. Trying to find differing perspectives worth your time is even harder. That’s why we have scoured the internet for political writing from the right and left that you might not have seen. We would love to hear your thoughts on this collection. Send your feedback to ourpicks@nytimes. com _____ • From National Review: “To claim that something is technically legal is not to say that it is appropriate. ” For Andrew McCarthy, the question is not whether it was legal to monitor President Trump or his associates during the campaign, but whether it was a political abuse of power. Read More » _____ • From The Weekly Standard: “The distribution of benefits is deeply contrary to the principles of republican government. ” Jay Cost evaluates the Trump administration’s federal budget along moral and historical lines, arguing that the Founding Fathers would have balked at the ease with which modern administrations  —   both Democratic and Republican  —   borrow money. Mr. Cost argues that high levels of debt betray the ideals of the Constitution and our moral obligation to future generations. Read more » _____ • From The American Spectator: “[. ..] is developing a work force for corporations what schools should be about?” Emmett McGroarty and Jane Robbins, senior fellows at the American Principles Project, argue that the Common Core and other progressive education policies focus, incorrectly, on preparing students for industry. School should instead instill the tenets of “traditional, classical education” that prepare students to be knowledgeable citizens. Read more » _____ • From Red State: “[. ..] the   conditions requirement is not some perk that we can keep while ditching the rest of Obamacare. ” Using a blog post by Senator Ted Cruz as a   point, a writer for Red State outlines the contours of a proposed bill for Republicans who have vowed to repeal the Affordable Care Act. It begins, appropriately, with some bitter pills to swallow. Read more » _____ From The National Interest: “It defies logic that if we have made a bad investment we must continue to do so. ” Amitai Etzioni, a professor of international relations at George Washington University, recommends that President Trump abandon the   attempts of the two previous administrations and deny a request to send more troops into Afghanistan. Read more » _____ • From The Intercept: “Fight fewer wars and for narrower reasons, but be more barbaric and criminal in prosecuting the ones that are fought. ” One should not mistake Mr. Trump’s “ ” for “pacifism,” Glenn Greenwald warns. That distinction, according to Mr. Greenwald, helps to explain the precipitous increase in civilian casualties in the Middle East since Mr. Trump took office. Read more » _____ • From TruthDig: “His policies haven’t sprung from thin air. ” Bill Blum traces a line from President Trump’s executive orders concerning immigration back to specific legislation from an unlikely predecessor: President Bill Clinton. Read more » _____ • From Salon: “Government will never run the way Silicon Valley runs because, by definition, democracy is messy. ” Now that Mr. Trump’s    Jared Kushner, has been tapped to lead a “SWAT team of strategic consultants” to reform the federal government, Simon Maloy reminds us of why we might not want the government to be more like a business. Read more » _____ From In These Times: “The fundamental failures of Obamacare stem from the law’s reliance on the private market. ” Miles   and Mr. Trump agree on one thing: Obamacare is going to get worse for millions of Americans. But according to Mr.   the only way forward for Democrats after the failure of the   American Health Care Act is to embrace a   system. Read more » _____ • From Politico: “The demise of the Republican plan [. ..] could open the door for bipartisan efforts to rescue the individual market. Don’t laugh it’s possible. ”  Sometimes, you need a mediator to help you find common ground. That’s why, hoping to encourage bipartisan cooperation, Timothy Stoltzfus Jost, a former law professor and consumer representative to the National Association of Insurance Commissioners, identifies pieces of the American Health Care Act that could have earned support from moderate Democrats. Read more » _____ • From BuzzFeed: “Know your enemy and stop giving them ammunition. ” On this week’s “60 Minutes,” Scott Pelley interviewed the   blogger Mike Cernovich for a segment about fake news. But Charlie Warzel writes that Mr. Pelley was out maneuvered by the   figure when the discussion turned to “alternate universes. ” Mr. Warzel argues that reporters in traditional media must educate themselves about the new media ecosystem and not play into the hands of “The New Right media,” a collective armed with its own facts and reality. Read more » _____ • From Washingtonian: “Part of Ham’s appeal is her commitment to ideology over party. ”  Meet Mary Katherine Ham, a conservative pundit whose star has risen in recent months. The secret to her success? She’d rather persuade than entertain. Read more » _____ From The Atlantic: “I take no pride or pleasure in saying ‘I told you so. ’” In today’s political climate, it’s sometimes difficult to identify precisely where the “center” is. That’s why we offer this piece by the Republican commentator David Frum with a bit of qualification. Here the former speechwriter for George W. Bush (who is also a staunch    writing for the   Atlantic) speaks to members of his own party to explain how the refusal to accept universal health care as a right has led to a “Republican Waterloo. ” Read more » _____'"}, "time": 1742564307.7231035}