{"duration": 0.06363892555236816, "input_args": {"text": "'The end of daylight saving time next month will create a more dangerous evening commute as people find it harder to see on the streets, New York City officials say. The earlier sunset and darkness have been linked to an increase in the number of pedestrians killed or seriously injured by vehicles, according to an analysis by the city’s Department of Transportation of data from 2010 to 2014, the most recent years available. In the latest instance, a    woman was fatally struck by a Metropolitan Transportation Authority bus on Friday evening as she walked in Lower Manhattan. The bus driver was arrested and charged with failure to yield to a pedestrian, according to the police. As a result, the administration of Mayor Bill de Blasio will announce on Thursday a new $1. 5 million “dusk and darkness” safety campaign that will include radio and television advertisements, signs on buses, and billboards to warn drivers as well as pedestrians to be more careful, especially at that time of day. In addition, the police will target drivers during those hours who speed, fail to yield to pedestrians, text on cellphones or block bike lanes. The campaign is part of the city’s Vision Zero plan, a set of proposals that aims to eliminate fatalities and injuries caused by vehicles. This year, as of Monday, there have been 192 traffic fatalities, 114 of which involved pedestrians  —   the rest involved people in cars, bicyclists and people on motorcycles. In contrast, there were 177 traffic fatalities during the same period last year, of which 96 involved pedestrians. “To meet our ambitious Vision Zero goals, especially during the more dangerous reality of this season’s evenings and nights, we have focused our efforts even further,” Mr. de Blasio said in a statement. “Our key Vision Zero agencies have teamed up to not only study crash data, but to work closely together and make critical adjustments that we believe will literally save lives. ” It is the first time that the city has adjusted traffic policy based on time and seasonal changes, though in the past, it has stepped up traffic enforcement at the beginning of the school year or during the winter holidays. Nationally, a similar pattern has emerged, according to Michael Flannagan, an associate research professor at the University of Michigan, who has studied traffic safety nationally. “You do see a big jump in pedestrian fatalities and injuries in the evenings in the fall when the change back to standard time makes the evenings suddenly darker,” he said. Dr. Flannagan added, however, that the increase was not caused by a disruption of sleep from the time change, but instead “simply because it was dark” and it becomes harder for drivers to see pedestrians. Conversely, in the spring, when the transition to daylight saving time makes the evenings suddenly lighter, there is a corresponding decrease in pedestrian fatalities and injuries nationally, he said. The city’s traffic analysis showed that between 6 p. m. and 7 p. m. during the week  —   the prime commuting time  —   the weekday hourly average rate of severe injuries and fatalities involving pedestrians rose to 2. 44 in   or nearly triple the average rate of 0. 84 in August. “It’s certainly much more dangerous at dusk both for pedestrians and motorists,” said Dr. Daniel M. Laby, the director of the Sports and Performance Vision Center at the State University of New York College of Optometry. Dr. Laby added that even people with normal eyesight could not see as well at dusk because the human eye does not adapt well to decreasing light. Vision becomes less sharp, with less contrast and depth perception. In addition, he said, there is typically more glare from uneven lighting as the sun sets, and more visual distractions compared with nighttime, when headlights help to focus attention. “You put this all together,” Dr. Laby said. “It almost makes you not want to go home at night. It’s risky. ” Amy Cohen, 51, a social worker in Park Slope, Brooklyn, said that, sadly, she was only too aware of the dangers on city streets at dusk. Her son, Sammy Eckstein, 12, was fatally struck by a van not long after 5 p. m. in October 2013 while retrieving a ball that had rolled into the street. Ms. Cohen, who helped found the advocacy group Families for Safe Streets, said that while she supported the new campaign, the city also needed to take more steps to permanently redesign streets and slow traffic, such as widening sidewalks, increasing the crossing time at traffic lights, narrowing driving lanes and installing traffic cameras that record speeding vehicles. “Education is a good start but much more needs to be done,” she said. The city’s traffic analysis found that dusk and evening crashes were often the result of drivers trying to make turns. In particular, there was a surge in severe injuries and fatalities from November to March, according to the analysis. “Through education and enforcement with our sister agencies, every driver needs to learn about the limited visibility of this season and the dangers of fast turns, especially in the evening hours,” said Polly Trottenberg, the city’s transportation commissioner. Ms. Trottenberg said the problem was underscored last year by a rash of nine pedestrian fatalities  —   three of which occurred during daylight hours  —   in the eight days after daylight saving time ended on Nov. 1. In total, there were 138 pedestrian fatalities in 2015, the lowest number since 1910. As part of the new safety campaign, city officials will seek to publicize the dangers of dusk and darkness through radio ads that are timed to run during the evening commute, and cards that will be handed out urging drivers to slow down, especially when turning, and to “look closely” since “more pedestrians are hurt in crashes around sunset than any other time. ” Pedestrians are also reminded to watch for turning cars. In addition, the city is specifically contacting people at senior centers, and taxi and livery drivers.'"}, "time": 1742628593.6445234}