{"duration": 0.03176474571228027, "input_args": {"text": "'In an interview with CNN on Wednesday night, Thomas Barrack Jr. who heads the Presidential Inaugural Committee, was asked whether Kanye West, who vocally supported Donald J. Trump’s candidacy last year, and who visited him in Trump Tower in December following his victory, would be performing at any of the inaugural events. “We haven’t asked him,” Mr. Barrack replied. Rather than stop there, he continued: “It’s not the venue. The venue we have for entertainment is filled out. It’s perfect. It’s going to be typically and traditionally American. ” Following a political season in which quarrels over inclusion and exclusion in the United States  —   in senses literal, metaphorical and philosophical  —   were central and heated, the “Make America Great Again! Welcome Celebration” was an opportunity to make a loud case. The stage was a potent one: the National Mall in Washington, just beneath the Lincoln Memorial. The concert was broadcast live on CNN and online. What was presented as “typically and traditionally American,” however, veered between jingoism and vaudevillian fluff and largely ignored the contribution of   to popular music (which is to say, almost all of popular music). Instead it focused heavily on country and rock by white Southerners, including the country superstar Toby Keith, who has been the nation’s loudest musical cheerleader for a decade and a half the Mississippi   band 3 Doors Down, which was a favorite in the    2000s and the Frontmen of Country, an amalgam of   singers made famous in other bands. It was a spotty lineup, though not a wholly ineffective one. 3 Doors Down’s songs remain sturdy, and the frontman Brad Arnold’s voice was strong, though denuded of its sleazy edges. And Mr. Keith, the headliner, in a heavy overcoat and a scruffy beard, delivered potent patriotism via strong narratives. Mr. Keith isn’t as uncomplicated a choice as he might appear from a distance. In the past, he’s been a registered Democrat, and here, he thanked President Obama for his service before offering a salute to Mr. Trump. Mr. Keith’s career soared after   when his music took an aggressive turn. At this show, he played the pugnacious and proud “Courtesy of the Red, White and Blue (The Angry American),” and also “American Soldier,” a meditative embrace of patriotic dedication. He also played “Beer for My Horses,” with its    endorsement of   vigilante justice: “Take all the rope in Texas, find a tall oak   up all them bad boys, hang them high in the   all the people to see. ” Mr. Keith’s songs about America are very conscious of place, and at this show, that proved an effective strategy. The Frontmen of Country leaned heavily on songs that mentioned bucolic Southern settings: “God Blessed Texas,” “Amy’s Back in Austin,” “Walking in Memphis. ” And Lee Greenwood joined them for “God Bless the U. S. A. ,” a dour march of national pride. In total, the concert’s message was that America is a defined geographical and ideological space, with borders worth defending, even at the price of excluding those who could make the place immeasurably more fun. This concert ended up being as notable for who did not show up as for who did. The only featured nonwhite performers were Sam Moore (of the 1960s soul duo Sam  Dave) who sang a restrained “America the Beautiful” backed by an   choir, and DJ Ravidrums, who delivered his dim, caffeinated percussive interstitials from inside a spherical   drum kit. But both of those acts got just a couple of minutes. The United States Army Old Guard Fife and Drum Corps got much more time for their    songs. When Mr. Trump first appeared onstage at the show, accompanied by his wife, Melania, it was to the Rolling Stones’s “Heart of Stone,” a song about a man who can’t be swayed. At the end of the concert, Mr. Trump addressed the crowd briefly, thanked the performers, and suggested that hosting this event in front of the Lincoln Memorial might have been an unprecedented choice. That was not true. In 2009, Mr. Obama held a   concert here, “We Are One: The Obama Inaugural Celebration at the Lincoln Memorial. ” It included athletes, actors and musicians from across genres  —   Mary J. Blige singing Bill Withers’s “Lean on Me,” Pete Seeger and Bruce Springsteen singing “This Land Is Your Land,” a song of acceptance and respect for the nation. It was a show of cosmopolitanism and inclusion that portrayed America not as a fixed idea, but as an   sum.'"}, "time": 1742628560.025561}