{"duration": 1.6437246799468994, "input_args": {"text": "'Email \\n\\nBEVERLY HILLS, Calif. — More than 100 of Hillary Clinton’s biggest donors crowded into the home of Casey and Laura Wasserman here on Thursday night, each having written a check for at least $33,400 to snag a ticket. The Hollywood glitterati in attendance — Elton John performed on the piano; Barbra Streisand mingled in the crowd — were sending her off for the home stretch of the campaign with north of $5 million in fresh funding. \\nIt was a fitting capstone to a remarkable 18 months for Clinton on the lucrative California fundraising circuit, this final event anchored by a host committee of billionaires, Hollywood executives, media moguls and tech investors — Sean Parker, Jeffrey Katzenberg, Haim Saban, Chris Sacca — that each directed $416,000 to Clinton’s efforts. \\nClinton calls them her “Hillblazers,” campaign bundlers who have given or raised at least $100,000 for her campaign. And she has erected an unparalleled and unprecedented infrastructure of 1,133 such people — nearly double the number of any past presidential candidate, including President Obama four years ago. \\nWhile Clinton and her advisers like to tout her small online donors, it is these bundlers in more than 40 states and four foreign countries who form the true backbone of her financial operation. Combined, this elite $100,000-and-up club has amassed a minimum of $113 million for Clinton and the Democratic Party — and the actual figure is likely far, far higher than that. (The biggest bundlers typically collect millions for campaigns.) \\n“We had the best base of donors and bundlers and raisers ever in 2008. It was even better in 2012. And it’s much better in 2016 than 2012,” said Wade Randlett, a San Francisco-based Democrat who has raised money for Clinton, Obama and Democratic causes for decades. “The Obama people basically 100 percent in are favor of Hillary. There’s really no loss because of ideology or bad blood. And she has added an enormous number of people, especially women.” \\nAmong her bundlers are celebrities (Will Smith) and sports stars (Earvin “Magic” Johnson), Hollywood directors (Steven Spielberg and George Lucas) and corporate executives (Marissa Mayer and Sheryl Sandberg), Wall Street-types (Marc Lasry), media executives (Haim Saban and Anna Wintour) and members of Congress, including her running mate, Sen. Tim Kaine, who helped raise more than $100,000 for Clinton before he joined the ticket in July. \\nThe Clinton campaign said 45 percent of its bundlers are women. \\nThere are also federal lobbyists, from whom the Democratic Party under Obama refused to accept money, a prohibition that has since been rolled back. \\nThis club has expanded to the point where Clinton would now struggle to fit all of these bundlers into a single ballroom. As of the end of June, she counted 496 such individuals and couples. By the end of July, it was 871. On August 31, it was 1,133. \\nIt includes billionaires George Soros, Warren Buffett and Tom Steyer, super lobbyists like Steve Elmendorf and bold-faced names like Calvin Klein and J.J. Abrams. There is also a sprinkling of longtime Clinton family advisers, such as Vernon Jordan.'"}, "time": 1742563748.594014}