{"duration": 0.17603063583374023, "input_args": {"text": "'From the start, the central enigma was Donald J. Trump. How did this   celebrity tycoon with no political experience get so far? Who were the Americans supporting him and why? When I started my unusual assignment of covering the American presidential campaign from the perspective of a foreign correspondent  —   for this, an American news organization  —   one of the first things I did was to invite questions from international readers. The bulk of them revolved around Mr. Trump, whose unorthodox romp through the Republican primaries propelled him to the party’s nomination  —   and ultimately to the presidency. Going back through my monthslong journey across America, there were many clues to Mr. Trump’s rising tide, although not all were easy to read. I drank with Trump supporters in bars and casinos. I approached them at rodeos. I chatted with them at gun clubs and diners and roaring political rallies. The broad topography of Trump country is, in many respects, easy to trace. It is a place of anger and frustration, gripped by a feverish   sentiment. People wanted change  —   and a chance to raise a throbbing finger to the forces they blame for their lot in life. Yet other factors were at play, too, in this unruly insurgency, factors that sometimes made it hard to see clearly: racism, xenophobia, bigotry, talk radio, social media bubbles and a simmering culture war separating thriving coastal areas and the wounded interior of the country. It wasn’t always clear which elements were powering the “Trump Train,” as the movement called itself, and which were being buoyed along. One of my first stops was Williamson, a decimated coal town in West Virginia. It had a sports bar, which offered beer for $1 on Thursdays, and a biker bar where, it was said, patrons sometimes squealed tires inside until the room filled with smoke. Both were filled with Trump voters, little surprise since he had promised to reopen coal mines shuttered by the Obama administration’s environmental regulations and cheap natural gas. In Williamson, I also saw how Mr. Trump’s message about change was overshadowing other issues that many analysts thought would have disqualified him from winning over the social conservatives who have long been a core Republican constituency. In conversations after church on Sunday, many Christians glossed over the candidate’s three marriages and boasts of his battle with sexually transmitted disease. (“It’s scary, like Vietnam,” Mr. Trump told Howard Stern in 1997.) It was hard to square, but perhaps that was the lesson: that a mysterious alchemy was at work in this election, one in which outrageous   might offer a route to success. Around that time, Apple released its seventh iteration of the iPhone, that glossy black totem of progress. Inscribed on the back of every iPhone are the words “Designed in California. Assembled in China. ” As if California is a separate country. And that’s how many in Trump country saw it  —   that instead of being part of the iPhone economy, they were living in a land that sent jobs overseas. One thing that I, like many Europeans and other foreigners, had long seen as distinguishing the United States was its restless optimism and innate  . Mr. Trump, though, traded on pessimism. His slogan, “Make America Great Again,” embodied a nativist vision that aimed to restore pride in the country’s military and business, but also scapegoated immigrants, minorities and Muslims. At Mr. Trump’s rallies, most of the faces in the crowd were white. People flew Confederate flags. They spoke impatiently about “the blacks. ”   prejudice toward Muslims was openly expressed: Danny Popma, a factory owner in Michigan, told me that children in Dearborn, which has the country’s largest percentage of Muslims, had stayed home from school in droves on Sept. 11 because they had secretly received advanced warnings of the attacks. The atmosphere at Trump rallies was permissive. If someone said something offensive or loutish, there was little fear of being hushed or contradicted. Yet in another confounding twist, a significant minority of Trump supporters were minorities themselves. I met people who defied neat categorization: a black woman in her 20s who worked at a record label in Miami a Japanese Uber driver in Las Vegas a Guyanese doorman in Queens, N. Y. At a rally in the campaign’s final week in Michigan, a Rust Belt state that would prove central to Mr. Trump’s victory, I saw how the candidate connected with crowd. When he spoke, it was if he held an invisible tuning fork held to his ear, listening for the smallest murmur of applause, which he would seize upon and amplify. It reminded me of powerful preachers and populist politicians I’d seen during my years based in Pakistan. What was hard to know was how far the electric energy inside this hall was radiating. Maybe these were just the   loyalists.    polls suggested that Mr. Trump was behind in many places critical to Electoral College victory. Political professionals, including Republicans, dismissed the notion that Mr. Trump could win mainly by consolidating the support of white voters. “It’s like the hunt for the lost tribes of the Amazon,” was how Stuart Stevens, a consultant who had worked for the 2012 Republican nominee, Mitt Romney, put it early on. “If you paddle your canoe far enough up the river, and bang your drum hard enough, they will come to the riverbank. But they’re just not there. ” But when I mentioned the polls showing Mr. Trump lagging to his supporters, they snorted derisively. Everyone they knew was voting Trump  —   colleagues, relatives, children. Some were former Democrats. Others were people who hadn’t voted for decades. The polls, they said, were either asking the wrong questions or were being manipulated by the news media  —   the polls themselves were part of the system these people were trying to overthrow. At the time, I discounted the conspiratorial talk as a product of the Facebook echo chamber that became so powerful in this election. But in broad terms, the Trump supporters were right  —   in key states, their votes were undercounted by pollsters. The winning margin in many states, like Michigan, was tight, and the failure of Democrats to mobilize turnout was also a major factor. Daryl, the Uber driver who took me from a Trump rally to the airport, was a case in point: he was an   a registered Democrat, and he did not intend to vote. “None of them look any good to me,” he said. Mr. Trump, then, benefited also from the antipathy so many people felt toward his opponent, Hillary Clinton. This was another theme in the questions that poured in from international readers: Why did so many Americans seem to hate her so much? The answer had many dimensions: Fatigue from her decades in public life, unfinished business from her husband’s time in power in the 1990s, distaste for how she had handled his sexual escapades, outrage over her use of a private email server while secretary of state and her taking in huge sums for speeches to Wall Street bankers, unfiltered sexism. And Mrs. Clinton simply did not represent change at a moment when a large portion of the electorate hungered for it. In San Francisco, while I was visiting my brother, one of his friends offered an explanation. “It’s like getting socks for Christmas  —   again ” he said. “Socks, socks, bloody socks. Nobody wants a present like that. ” Mr. Trump, in the end, found the “lost tribe” of white voters. They heard his drumbeat, and voted as a bloc like never before. Mr. Trump’s stunning victory echoes jolting changes in Britain, France and other countries where a new brand of   politics is resurgent. The question of whether it stemmed from a specific constellation of forces, or represented a more fundamental shift, may now be answered under the Trump presidency.'"}, "time": 1742562185.0957804}