{"duration": 0.07369470596313477, "input_args": {"text": "'CLEVELAND  —   Donald J. Trump’s chief adviser used the first day of the Republican National Convention on Monday to excoriate Gov. John R. Kasich for not endorsing Mr. Trump, touching off a remarkably bitter exchange between the campaign of the presumptive Republican nominee and advisers to Ohio’s popular Republican governor. Addressing reporters at a breakfast on Monday, Paul Manafort, Mr. Trump’s de facto campaign manager, accused Mr. Kasich of acting “petulant” for refusing to support Mr. Trump following the governor’s defeat in the Republicans’ presidential nominating process. “He’s embarrassing his party in Ohio,” Mr. Manafort said of Mr. Kasich, calling the governor’s chief political strategist the culprit behind Mr. Kasich’s strategy of not endorsing Mr. Trump. “Negotiations broke down because John Weaver thinks that John Kasich will have a better chance to be president by not supporting Donald Trump. ” Such a calculation, Mr. Manafort said, is “a dumb, dumb, dumb thing. ” Asked about the criticism, Mr. Weaver escalated the dispute. He not only mocked Mr. Trump’s rambling and   awkward introduction of Mike Pence as his running mate on Saturday, but also pointedly brought up Mr. Manafort’s history of working with contentious foreign leaders. “Manafort’s problem, after all those years on the lam with thugs and autocrats, is that he can’t recognize principle and integrity,” Mr. Weaver wrote in an email. “I do congratulate him though on a great pivot at the start of the convention after such a successful   launch. He has brought great professionalism, direct from Kiev, to Trump world. ” The    was the latest extraordinary turn in a campaign that has veered sharply away from political precedent. Mr. Manafort’s blistering attack was the latest reminder that, when it comes to their critics, Mr. Trump and his high command care little for political niceties  —   in this case the traditional imperative to unify the party as the convention gets underway. And the reprisal from Mr. Weaver highlighted the lingering divisions in the party, even as Republicans gather at Quicken Loans Arena to coronate Mr. Trump: Mr. Kasich is part of a group of elected Republican officials who still will not support the party’s unconventional  . But Mr. Kasich, who will not appear onstage this week, is not just another Republican skeptic of Mr. Trump: he is also the   governor of the hotly contested swing state where the convention is taking place and where the election may be decided in November. Recognizing this, Mr. Manafort used his remarks at the Bloomberg   breakfast to assail Mr. Kasich, while also driving a wedge between the governor and Senator Rob Portman of Ohio. Mr. Portman is locked in a competitive   fight that could help decide which party controls the Senate next year. Mr. Portman endorsed Mr. Kasich in the presidential primary, and the governor has been aggressively campaigning for the senator in his   campaign this year. But the two have historically not been close and have been seen as representing two distinct Republican political families in Ohio. “He’s very upset with John Kasich,” Mr. Manafort said of Mr. Portman. “Because John Kasich is hurting him. ” Asked about this remark, Mr. Portman’s campaign manager emphatically denied the senator is angry with Mr. Kasich for not backing Mr. Trump. “That’s totally false,” said Corry Bliss, Mr. Portman’s top aide. “Rob Portman and John Kasich are working hand in hand to defeat Ted Strickland and any suggestion otherwise is inaccurate. ” Mr. Manafort went even further to link Mr. Trump to Mr. Portman, though. The Trump aide said, “We are working very closely with Rob Portman” and that “we’re running our campaigns together. ” Mr. Portman, wary of Mr. Trump’s negative image among Ohio’s critical suburban voters, has been careful to distinguish himself from the party’s presumptive nominee. He is also not speaking at the convention and instead is appearing at a series of events intended to soften his image. Mr. Manafort’s assault, which he repeated in interviews on network morning TV programs, infuriated Ohio’s Republican leadership. Matt Borges, the Ohio Republican chairman, called the criticism of Mr. Kasich “obviously calculated” and expressed irritation that Mr. Trump was reigniting his feud with the governor in one of the swing states where the presumptive Republican is most competitive in the polls. “It’s inaccurate, it’s not wise and, while they may think it’s good for their campaign, they’re wrong,” Mr. Borges said by phone, adding that he expected Mr. Trump’s campaign to “fix it. ” As for whether Mr. Kasich is positioning himself for another White House bid by not endorsing Mr. Trump, a spokesman for the governor, Chris Schrimpf, said, “Kasich can’t endorse someone who divides our country and that’s not a political decision for him. ” But Mr. Kasich over the weekend wrote an opinion piece attacking Hillary Clinton in The Union Leader, New Hampshire’s largest newspaper, and is using the convention week to meet with the delegation from the country’s first primary state, as well as a series of other party officials and donors who could aid him should he run again for president.'"}, "time": 1742564045.2139978}