{"duration": 0.03157472610473633, "input_args": {"text": "'Pinterest \\nGOP presidential nominee Donald Trump has been proven right once again. This time it has to do with a prediction he made about Democrat nominee Hillary Clinton’s email scandal. \\nOn Friday, the FBI announced in a letter to Congress that they were reopening the Clinton email investigation in light of emails unearthed in their investigation of disgraced former New York Democrat Congressman Anthony Weiner’s sexting an underage girl. \\nOn Aug. 29, not long after top Clinton aide Huma Abedin announced that she and Weiner were separating, Trump released a statement. “Huma is making a very wise decision,” Trump said. \\n“I only worry for the country in that Hillary Clinton was careless and negligent in allowing Weiner to have such close proximity to highly classified information,” he added. “Who knows what he learned and who he told?” Trump, in July: \"I don\\'t like Huma going home at night and telling Anthony Weiner all of these secrets.” https://t.co/qICt22PfzM \\n— Ryan Teague Beckwith (@ryanbeckwith) October 28, 2016 And once again Trump was right months ago about Hillary compromising national security by having ties to Anthony Weiner #CantStumpTheTrump pic.twitter.com/5GIBJJ4a2m \\n— Jared Wyand 🇺🇸 (@JaredWyand) October 28, 2016 Trump on Weiner (back in July before Huma Abedin and Weiner separated) pic.twitter.com/GItJHH9hVr \\n— Ashley Killough (@KilloughCNN) October 28, 2016 #tbt the first time Trump attacked Weiner at a campaign event was August 2015 https://t.co/YwGn1YnZUu \\n— Ben Jacobs (@Bencjacobs) October 28, 2016 \\nThe Washington Examiner reported : \\nAfter the bombshell report about the FBI’s reopened investigation first emerged Friday afternoon, the New York Times reported that the “new emails” that have led investigators to take a second look at the case were discovered on devices seized from Abedin and Weiner’s home during a separate investigation into Weiner’s alleged sexting with a minor. \\nComey, in a letter to eight Republican congressional committee chairs, did not clarify what emails led him to revisit the Clinton case. He said only that investigators had recently briefed him on “the existence of emails that appear to be pertinent to the investigation.” \\n“And I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information,” Comey wrote. \\nTrump told a crowd in New Hampshire on Friday he hopes the FBI will “right the ship” after the agency declined to indict Clinton in July, citing insufficient evidence of criminal intent. \\nTrump has been proven right to the point that the mainstream media even had to admit how right he was. That’s saying something. \\nIt will be very interesting to see what the FBI has found/will find in their investigation. The FBI certainly could be reopening the investigation to somehow help Clinton — perhaps there’s an angle that makes this the better option — or maybe there is something so potentially damning that even they couldn’t figure out a good way to bury it. That seems fairly unlikely, but it’s hard to say. \\nOnce again, Trump has been proven right and that’s largely because he gets it. Trump has called himself a “common sense conservative” and the many times he’s been proven right on the campaign trail, along with the many policy positions he’s taken that show that he is in touch with Americans and has common sense, prove this label correct.'"}, "time": 1742628557.2257562}