{"duration": 0.14983820915222168, "input_args": {"text": "'President Obama will use an Oval Office meeting with Senator Bernie Sanders of Vermont on Thursday morning to delicately nudge the losing Democratic presidential hopeful toward a full embrace of Hillary Clinton’s candidacy and a unified party effort to defeat Donald J. Trump in the fall, according to administration aides. The conversation, the fifth that Mr. Obama will have had with Mr. Sanders since the primaries began, is to be part of a choreographed series of moves Mr. Obama set in motion this week that are designed to quickly bridge the divide between the two Democratic presidential candidates laid bare in the last few months. The strategy will culminate with the president’s formal endorsement of Mrs. Clinton in the coming days, followed by an appearance with her on the campaign trail soon after. Mr. Obama’s message is intended to be unmistakable: The time has come for Mr. Sanders to harness his formidable constituency in support of his onetime rival even as he continues to press for the progressive policies that animated his base. But it is also clear to the White House that Mr. Obama must broker this particular intraparty peace treaty with patience and respect, or risk angering Mr. Sanders and his millions of supporters. To that end, the president will delay any endorsement of Mrs. Clinton until after the meeting with Mr. Sanders. And a joint appearance is unlikely until after the Democratic primary in the District of Columbia on Tuesday. Mr. Obama will not pressure Mr. Sanders to make a concession before that contest, the final one in the long primary season, advisers said. “We should be a little graceful and give him the opportunity to decide on his own,” when he wants to leave the race, Vice President Joseph R. Biden Jr. said of Mr. Sanders on Wednesday. White House aides said Mr. Obama was eager to help Mr. Sanders find a way to continue elevating the causes he championed for more than a year  —   including addressing income inequality and college tuition affordability, raising the minimum wage and changing campaign finance rules  —   but without the   comments that could threaten the Democratic cause. “You’ve built this enormous   movement what do you want to do with that?” said Jen Psaki, Mr. Obama’s communications director, describing what was likely to be the tenor of his conversation with Mr. Sanders. “There’s a recognition of the energy and enthusiasm that he built, and that that is going to be needed to win in November. ” Finding a way to help guide Mr. Sanders past his disappointment is the president’s chief goal during the next few days, Obama aides said. During a remarkable and at times bruising political campaign, Mr. Sanders has built an enormous list of Democratic voters that would be invaluable to Mrs. Clinton and to Democratic Senate and House candidates. Aides said Mr. Obama would remind Mr. Sanders that he could receive much of the credit for big Democratic wins if he helps redirect his newfound political energy toward helping Mrs. Clinton. Democratic strategists said the president would play a pivotal role in reaching out to Mr. Sanders’s coalition, although Mrs. Clinton will have to make a visible effort to appeal to her former adversary’s supporters  —   much as Mr. Obama did in 2008 after he won a prolonged and at times bitter primary with Mrs. Clinton. “He’ll be a great surrogate among those Democrats who were supportive of him but are less supportive of her, particularly younger Democrats, in making the case as to why consolidating behind her is important and what’s at stake in the election,” said David Axelrod, a former senior adviser in Mr. Obama’s presidential campaign and his White House. Mrs. Clinton “needs to approach those folks with open arms, but there is a   reality element of this that he may be better suited for,” Mr. Axelrod added. Some supporters of Mr. Sanders on Wednesday said that they hoped that Mr. Obama would not pressure their candidate to quickly leave the race. “Bernie Sanders and the   political revolutionaries behind him have more than earned the time and the space, just as Secretary Clinton and her supporters did eight years ago, to determine the best steps we can take together to help unite our party against Donald Trump in the days and weeks ahead,” said Jim Dean, the chairman of Democracy for America, which endorsed Mr. Sanders in December. Adam Green, a founder of the Progressive Change Campaign Committee, which stayed neutral in the race, said Democrats should not “guilt trip” Sanders voters by warning them of the risks of electing Mr. Trump, but instead incorporate their ideas, including expanding Social Security benefits and breaking up big banks, into the party platform. In a taped appearance on “The Tonight Show” that is to be broadcast Thursday night, Mr. Obama praised Mr. Sanders, saying he brought “enormous energy” and “new ideas” to the campaign. The president said Mr. Sanders pushed his rival, making her a better candidate. “She is whip smart, she is tough and she deeply cares about working people and putting kids through school,” Mr. Obama said, citing some of Mr. Sanders’s main concerns about Mrs. Clinton. “My hope is over the next couple weeks, we’re able to pull things together. ” The president said Mr. Sanders and his supporters deserved some time to become used to the fact that he did not win. He said that people who poured their hearts into campaigns often became “a little ouchy” and bruised, and needed time to recover. Asked whether he thinks the Republicans are happy with their choice of Mr. Trump, Mr. Obama joked, “We are!” He then added, “Actually, you know what, that was too easy,” and said he was worried about the Republican Party because democracy works when “you have two parties that are serious. ”'"}, "time": 1742562626.1921458}