{"duration": 0.09188055992126465, "input_args": {"text": "'Email \\nA bombshell of new audio is exposing Hillary Clinton for the immoral, politically motivated opportunist that she is. Now the question is, will this impact her race for the White House? \\nSome ten years ago (more recent than Donald Trump’s now infamous “locker room talk” recording) in September of 2006, Hillary Clinton was running for reelection to the Senate when she sat down to speak with the editorial board of the Jewish Press. The sit-down was recorded, but the full conversation had never been released, until now. One of the editors present during the interview spoke with the Observer this week and played them the 45-minute long tape of the conversation with Clinton. \\nBelow is what is likely the most important disclosure of the conversation, and it provides reason for American voters to worry. It also proves that Donald Trump is not some crazy conspiracy theorist for expressing concern about the Democrat Party trying to “rig” the 2016 election. \\nWhile talking to the Jewish Press, Clinton commented on the 2006 election for the second Palestinian Legislative Council (where terrorist organization Hamas won control of the Palestinian government) and expressed her belief that allowing the election was a huge mistake, but if they were going to allow it… then the US government should have rigged the election to suit their needs. \\n“I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake. And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win.” \\nYes, you just heard correctly. A sitting US Senator, and the future Secretary of State and then presidential candidate just argued that we should have rigged the election, thereby disallowing the right of the Palestinian people to choose their own leaders. \\nWhile Hamas is a terrorist organization and they are horrible, murderous thugs whose ideology we must stamp out… the comments should raise this question in our minds – if Hillary Clinton is willing to rig an election in Palestine, why wouldn’t she do the same here if she could? This realization that Clinton is not beyond “fixing” the results of an election, should make all of the other recent evidences of massive voter fraud all the more concerning. \\nWell known election fraud expert John Fund has written article , after article , after article and even books chronicling voter fraud in the U.S. \\nFund wrote extensively, for instance, of the 2008 election that put Al Franken in the U.S. Senate for the State of Minnesota. The 312-vote victory Franken eked out, Fund wrote , was not a happy result of just enough votes but a result born of massive vote fraud. \\nOther reporters have written of vote fraud, of course. Take the report in the Washington Free Beacon that revealed that 141 U.S. counties have more people registered to vote than they even have residents eligible to do so! \\nThese charges have been building for at least 20 years and over the last few months they have shifted into high gear. But we don’t have to stick to recent history to find people complaining about voter fraud. Only eight years ago when he was first running for the White House, even Barack Obama was heard complaining about rampant vote fraud in the U.S… \\nAnd then there is the new series of undercover videos by Jame O’Keefe’s Project Veritas which has revealed Democrat operatives admitting that they routinely engage in voter fraud in order to win elections by hook or crook. \\nPlease make sure to read the full Observer story about the 2006 interview with Hillary Clinton. There are a few other remarkable observations made about some of Clinton’s comments – like her willingness to speak with world leaders no matter the current political climate between our countries and Clinton’s seeming approval of “an eye for an eye” interactions between Israel and Hamas. \\nArticle reposted with permission from Constitution.com  '"}, "time": 1742561715.9162881}