{"duration": 0.049803733825683594, "input_args": {"text": "'Facebook has criticized new German hate speech law that would see social media companies pay up to €50 million in fines if they fail to remove “hate speech” on their platform. [Business Insider reports that Facebook is unhappy with Germany’s new hate speech law that would force social media companies to face heavy fines for failure to remove hate speech and fake news from their platforms. Facebook has argued that these strict new measures will result in legal and legitimate content being deleted from their platform in order to avoid the fines.  The German government proposed legislation in March that would have social media companies fined if they didn’t quickly remove posts regarded as slanderous or threatening. Germany’s cabinet approved these plans in April, but they have yet to be implemented. The new law has now been challenged by Facebook. Facebook published a statement over the weekend which outlined why the new law “is not suitable to combat hate speech and false news. ” “The draft law provides an incentive to delete content that is not clearly illegal when social networks face such a disproportionate threat of fines,” Facebook claimed. “It would have the effect of transferring responsibility for complex legal decisions from public authorities to private companies. And several legal experts have assessed the draft law as being against the German constitution and   with EU law. Facebook is committed to working in partnership with governments and civil society on solutions that will make this draft law unnecessary. ” German Justice Minister Heiko Maas disagreed, stating, “This (draft law) sets out binding standards for the way operators of social networks deal with complaints and obliges them to delete criminal content. ” He added, “there should be just as little tolerance for criminal rabble rousing on social networks as on the street. ” If Facebook refuses to comply with the law, the individual deemed responsible for the company in German could receive a personal €5 million fine, while Facebook as an organization could receive a fine of up to €50 million.'"}, "time": 1742563322.1669369}