{"duration": 0.0394594669342041, "input_args": {"text": "'President Donald Trump will sign an executive order Friday unraveling the 2010   financial reform. The move comes as part of a comprehensive plan to rescind regulations set in the wake of the financial crisis. [The White House will also enact another executive action that will dismantle the Department of Labor’s controversial Fiduciary Rule that critics argue would upend the   advisory business. The Fiduciary Rule requires retirement advisors to act in the best interests of their clients. The new executive order will ask the Labor Department to revise or revoke the Fiduciary Rule.  White House National Economic Council Director Gary Cohn says that limits consumer choice. Cohn said in an interview with The Wall Street Journal, “Americans are going to have better choices and Americans are going to have better products because we’re not going to burden the banks with literally hundreds of billions of dollars of regulatory costs every year. The banks are going to be able to price product more efficiently and more effectively to consumers. ” The Trump White House will plan to draft additional orders to revise the rules regarding the Federal Stability Oversight Council, the agency responsible for designating   entities such as insurance firms like MetLife as “systemically important financial institutions,” or SIFIs, adding regulation on the firms. White House Economic Council Director has said previously, “We don’t think nonbanks should be SIFIs. ” President met with business executives, including J. P. Morgan Chase  Co. CEO Jamie Dimon, and BlackRock Inc. CEO Laurence Fink, pledging to dismantle   as well as provide a health care and tax overhaul. Director Cohn contends that the   regulations are so onerous that it has stifled banks’ ability to lend, and consumer’s financial choice has been limited as well. “We have the best, most highly capitalized banks in the world, and we should use that to our competitive advantage,” he added. “But on the flip side, we also have the most highly regulated, overburdened banks in the world. ” Mr. Cohn also hopes to overhaul   mortgage finance giants   and   which has been placed into conservatorship, under control of the Treasury Department since the financial crisis. The White House will seek a more   direction for the Consumer Financial Protection Bureau, or CFPB, by replacing current Director Richard Cordray with a new director. The CFPB is largely responsible for regulating mortgage and credit card rules, and Cohn said that change will start at the top, “Personnel is policy. ” Donald Trump has been critical of 2010 financial law, calling   a “disaster. ” He promises, “We’re going to be doing a big number on  . ”'"}, "time": 1742563260.2996073}