{"duration": 0.05464744567871094, "input_args": {"text": "'(42 fans) - Advertisement - In my research of what is happening in our communities regarding resilience from the insanity of today\\'s corporate and government behaviors, I came across this Maryland Community Pilot study. This study is listed as being written this year, 2016. This makes the research fresh. To give credence to this movement, consider some of the investigators for the study. People like: * Karen Akerlof, Center for Climate Change Communication, George Mason University * Fredrika Moser, Maryland Sea Grant * Kristin Baja, Office of Sustainability I could continue on and on. My point is, the people involved are professionals and not whacked out \"greenies\". There are four Maryland neighborhoods involved in the study. Some of the neighborhood climate risks entail: Flooding and sewage overflows from storm water run-off, urban heat island effects, pollen allergens, increased air pollution, storms, riverine flooding (in Westport). - Advertisement - The vulnerabilities include: Low socioeconomic populations, racial disparities, vacant housing, poor health and air quality (Baltimore), industrial facilities (Westport) The site further states that Communities are beginning to plan efforts to consider adaptation strategies to build their resilience (NRC, 2010), yet many lack the political capital or access to information and resources that would allow them to prepare for chronic flooding, catastrophic storm events, and losses of economically important natural resources. Frequently, it is underserved and underrepresented communities that lack these resources and are most vulnerable to the effects of changing environmental conditions (Douglas et al., 2011; Melillo, Richmond, & Yohe,2014). Storm events are particularly devastating to socially vulnerable communities, even when controlling for infrastructure characteristics (Highfield, Peacock, & Zandt, 2014). - Advertisement - Meeting the needs of high-risk/low-resource communities is one of the most critical challenges in achieving resilience nationally (NRC, 2010), but little tailored information exists to guide program development specifically for these contexts (NOAA, 2015). Moreover, our understanding of the conditions under which audiences are most likely to engage in successful decision-making to reduce vulnerabilities is still evolving (Webler, Tuler, Dow, Whitehead, & Kettle, 2014). \"Build resistance to what?\" you may ask. Personally I use the term resilience. It\\'s more positive. Resilience as I define it is the adoption of behaviors and programs that lead to a supportive and clean environment, healthy families and a vibrant you.'"}, "time": 1742563395.1664822}