{"duration": 0.0664362907409668, "input_args": {"text": "'PHILADELPHIA  —   From the time Donald J. Trump became their candidate until he took the oath of office, congressional Republicans treated his policy pronouncements  —   largely out of step with Republican dogma  —   as essentially a distraction. He would talk. They would drive the policies. But now, the question of whether congressional Republicans would change President Trump or Mr. Trump would change them has an early answer. Mr. Trump cheerfully addressed the group here at their policy retreat on Thursday, and they responded with applause to many proposals they have long opposed. Republican lawmakers appear more than ready to open up the coffers for a $12 billion to $15 billion border wall, perhaps without the commensurate spending cuts that they demanded when it came to disaster aid, money to fight the Zika virus or funds for the tainted water system in Flint, Mich. They also seem to back a swelling of the federal payroll that Mr. Trump has called for in the form of a larger military and 5, 000 more border patrol agents. They have stayed oddly silent as Mr. Trump and Senate Democrats push a $1 trillion infrastructure plan, larger than one they rejected from President Barack Obama. Once fierce promoters of the separation of powers, Republicans are now embracing Mr. Trump’s early governing by executive order, something they loudly decried during Mr. Obama’s second term. Speaker Paul D. Ryan, whose own website this week still praised the   Partnership trade deal, now applauds Mr. Trump for putting the final shovel of dirt over the accord, with the president saying he is interested in bilateral agreements instead. Many Republicans, who have been longstanding opponents of Russia and written laws that prohibit torture, have chosen to overlook, or even concur with, Mr. Trump’s embrace of both. Even on the subject of Mr. Trump’s call for an investigation into voter fraud, a widely debunked claim, Republicans have often demurred. “The notion that election fraud is a fiction is not true,” said the Senate majority leader, Mitch McConnell of Kentucky. Mr. Trump said he could not wait for lawmakers to get to work on their newfound common ground. “This Congress is going to be the busiest Congress we’ve had in decades, maybe ever,” Mr. Trump said. In an apparent reference to forthcoming bills, he added, “We’re actually going to sign the stuff that you’re writing. You’re not wasting your time. ” Many Republicans in Congress say his presidency is off to a substantive start, delivering on campaign promises to quell illegal immigration, reduce regulations, start the rollback of the health care law and reverse the Obama administration’s decisions to halt the Keystone XL and Dakota Access pipeline projects. “I think he’s completely winning the expectation game,” said Representative Peter Roskam of Illinois. “I think he’s a genius at lowering expectations and overperforming,” he said, adding, “It’s really remarkable. ” In one significant way, congressional Republicans potentially seemed to pull Mr. Trump to their end of the policy pool. On Thursday, the administration initially  appeared to endorse  taxing imports as a way to pay for the Mexican border wall, reversing its earlier preference for imposing a heavy tax on companies that move jobs overseas. But the White House later said it was just one option under consideration. “We are in a very good place on tax reform,” Mr. Ryan said. “It can get complicated when you get into the details of tax reform, but once we go through how tax reform works and what it’s going to take to get the kind of competitive tax system, the kind of competitive tax rates, I think most people agree that this is the right approach. ” Congressional Republicans are also struggling to keep up with Mr. Trump’s   announcements, let alone push their agenda. “It’s   stuff,” said Senator John Hoeven, Republican of North Dakota. Investigating voter fraud, for instance, is not something he would like to see Congress take on. “Our priorities are the ones we laid out,” he said. They are also eager to get on with the rest of that agenda  —   specifically a repeal and, ostensibly, a replacement of the Affordable Care Act. “We are on the same page with the White House,” Mr. Ryan insisted Thursday. “The president agrees with this agenda. ” But it is the sudden embrace of federal spending that represents perhaps the most striking departure, with Republicans backing the concept of starting the financing for the border wall with a new appropriation. And the list is much longer. By contrast, last year, Senator John Cornyn of Texas, the No. 2 Senate Republican, called Democrats’ request for $600 million in aid to Flint added to an energy bill “a huge earmark,” adding, “I think it’s not something I could support,” in keeping with most of his colleagues. Republicans also pushed for and partly succeeded in offsetting a bill to fight Zika last year. The talk of a spending surge has left some Republicans worried about an exploding deficit. “There are going to have to be some cuts,” said Representative Jason Chaffetz of Utah. “I am not interested in raising our spending levels. ” Senator John Barrasso of Wyoming, the chairman of the Environment and Public Works Committee, seemed tense when asked about the open checkbook. “We’re a fiscally conservative group,” he said of the committee. “We’re going to want to see things paid for. ” Republicans are also at times confused about what Mr. Trump is actually seeking when he makes policy declarations on Twitter. “‘Appears’ I think is the big word,” said Representative Ryan Costello of Pennsylvania. “I don’t think anyone in the House of Representatives on the Republican side of the aisle wants to go through the legislative process,” only to have the Trump administration send a bill back, he said. Republicans had expected to reveal great progress on their plans to replace the health care act here, but instead seemed stuck in a perpetual debate over the timeline of coming up with a replacement. Senators in large part made a strong argument for making sure that a replacement plan had been fashioned before repealing the law, while many in the House continue to push for a repeal with replacement coming much later. Also notable is the Republicans’ acceptance of something they have despised: the use of the executive pen to make policy. Several House Republicans dismissed the notion that Mr. Trump would abuse his power to issue executive orders in the way they complained that Mr. Obama did during his second term. “What you do by the pen can be dismantled by the pen,” said Representative Tom Reed of New York. Mr. Trump is also trying to work his will on how the Senate operates. In an interview with Sean Hannity on Fox News, Mr. Trump said he thought Mr. McConnell should get rid of the Senate filibuster rule for Supreme Court nominees, calling those who would oppose his coming pick “obstructionists. ” About three blocks from where Mr. Trump spoke, hundreds of protesters packed a plaza just across from City Hall to rally against the president. While the demonstration was organized around preserving the health care law, protesters showed up for a variety of causes. “I don’t trust anything he says,” said Ken Snyder, 62.'"}, "time": 1742628514.2245643}