{"duration": 0.08491349220275879, "input_args": {"text": "'Architecture means many things to many people: It’s a form of creative expression, a tool for meticulous construction, a craft, a profession. In short, it’s much more than just perfectly placing bricks to form a building.\\nIn this Ted Talk , Michael Murphy discusses how his father’s brush with death ultimately opened the doors to his own life path of architecture, but not just as a profession, and not just as a creative expression.\\nWhen designing, Murphy and his team go beyond the blueprint, considering things like how like airflow and light can produce both a healthy community and gorgeous structures.\\nHe shows us his projects in countries like Rwanda and Haiti, and covers his plan for creating The Memorial to Peace and Justice, which mainly aims to heal hearts in the American South.\\n“ Why was it that the best architects, the greatest architecture — a ll beautiful and visionary and innovative — is also so rare, and seems to serve so very few? And more to the point: With all of this creative talent, what more could we do?” Murphy poses in his talk. \\nHe broke into the very soul of his work when he came to the realization that buildings are actually making people sicker.\\n“ In this hospital in South Africa, patients that came in with, say, a broken leg, to wait in this unventilated hallway, walked out with a multidrug-resistant strand of tuberculosis. Simple designs for infection control had not been thought about, and people had died because of it.” \\nWith the revelation that hospitals are making patients sicker, he thought of designing one that flips the hallways on the outside, allowing people to walk in the exterior. “ If mechanical systems rarely work, what if we could design a hospital that could breathe through natural ventilation, and meanwhile reduce its environmental footprint?” he said. \\nHe then discussed the incredible community aspect of following through with his healing niche in the architecture world.\\n“ We worked with Bruce Nizeye, a brilliant engineer, and he thought about construction differently than I had been taught in school. When we had to excavate this enormous hilltop and a bulldozer was expensive and hard to get to site, Bruce suggested doing it by hand, using a method in Rwanda called “Ubudehe,” which means “community works for the community.” Hundreds of people came with shovels and hoes, and we excavated that hill in half the time and half the cost of that bulldozer. Instead of importing furniture, Bruce started a guild, and he brought in master carpenters to train others in how to make furniture by hand. And on this job site, 15 years after the Rwandan genocide, Bruce insisted that we bring on labor from all backgrounds, and that half of them be women. “ \\nUltimately, the healing journey became twofold, as it was both the process of building to heal as well as allowing an entire community to heal.\\n“We call this the locally fabricated way of building, or ‘lo-fab,’ and it has four pillars: hire locally, source regionally, train where you can and most importantly, think about every design decision as an opportunity to invest in the dignity of the places where you serve. Think of it like the local food movement, but for architecture. And we’re convinced that this way of building can be replicated across the world, and change the way we talk about and evaluate architecture,” he explained. \\nIn his talk, Murphy reveals how he learned that architecture is more than what it seems. It “can be a transformative engine for change.”\\nWatch the full talk below. Perhaps it will show you how your work can be more than what it seems, too.\\n\\n'"}, "time": 1742564528.6015434}