{"duration": 0.10692691802978516, "input_args": {"text": "'Comments \\nSwedish EDM star Axwell has today announced plans top quit the music industry after discovering that he was not a real DJ while taking the poweful hallucinogenic DMT. \\nDMT, often described as a window into the soul, is the main ingredient in ayahuasca, a psychedelic brew used by the people of the Amazon to contact the spirit world for ceremonial or healing purposes. DMT use can often lead to people having deep and profound spiritual experiences and, as in Axwell’s case, can lead to users making extreme lifestyle changing decisions. \\n“I can finally see clearly, all of these years I thought I knew what I was doing but I was clueless, like a snowflake floating in a winter tundra,” explained Axwell calmly. \\n“I delved deep inside my mind and questioned my inner self about the fabric of time, the meaning of life and my purpose on earth,” explained the enlightened DJ, “I looked directly into the eyes of nature and all existence and I knew straight away that I wasn’t a real DJ and I never had been. I’m a fraud and my entire life has been a lie. I’m just glad I found out while I’m still young enough to make a change.” \\n“Im my heart I think I already knew. To be honest I think anyone who’s ever heard Swedish House Mafia or any of my solo work or any of Steve (Angello) or Seb’s (Ingrosso) solo work or any of the music myself and Seb made already knew. It’s pretty obvious really,” he admitted. “But now it’s official, I’ve told the guys and they actually agree that they’re not real DJs either but they’re happy enough to keep living the masquerade because, to be honest, the money is rather good.” \\n“I however am ready to move on, to spread my wing and fly if you will,” continued Axwell. “I’ve heard my new calling and I’m ready to act on it. I’m going to change my name to Acts Well which will be a reflection of all of my future behavior and I’m also going to be opening a chain of fair-trade vegan tofu bars, which will employ only reformed convicts and double up as a shelter for sick animals. It’s the least I can do after the plethora of shit music I’ve inflicted on the world.”'"}, "time": 1742563000.5385687}