{"duration": 0.07319116592407227, "input_args": {"text": "'Vanity Fair contributing editor Kurt Eichenwald posted a picture to Twitter of his computer desktop that users noticed included an open tab of cartoon porn. [Vanity Fair editor Kurt Eichenwald posted a photo to his Twitter page Wednesday night to display hate mail he recently received. Unknown to the editor, a tab open in his web browser in the background of the photo showed that he had been viewing hentai, or pornographic anime.  Yah, crappy photoshop Max. Unfortunately, no, this is what I got today. pic. twitter.   —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,  Eichenwald claimed that he had been viewing the explicit material because he and his children had been debating with Eichenwald’s wife over the existence of “tentacle porn”: Sigh. Ok, I’m a dumbass. Believe it or not, my kids  I were trying to convince my wife that ”tentacle porn” existed. I tried to find  …    (1)  —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,    …    some to show her it was real. But I couldn’t find any  —    ended up   this. My family reads my twitter feed, so they know this is true.  —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,  As users questioned and ridiculed Eichenwald, he doubled down: While hentai (until now, I thought it was called manga) was on screen as part of search to prove 2 my wife tentacle porn exists, what  …    . (1)  —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,    …    diff would it make? Seriously, while I don’t see the appeal of cartoon parn, porn is a   industry. Pple obviously look at it.  —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,  In further attempts to prove that he had not been searching for cartoon porn for his own enjoyment but rather for research, Eichenwald posted a screenshot of texts with his wife where he wrote, “Theresa  …    I’m sorry, this is a stupid question. Were our (adult) sons and I trying to prove to you that tentacle porn exists?” Eichenwald’s wife allegedly responded, “Yes. Still amazes me. ” No one hacked my account. We were searching to prove to my wife tentacle porn exists. See text convo. I only removed names and drug names. pic. twitter.   —   Kurt Eichenwald (@kurteichenwald) June 8, 2017,  Many users still questioned Eichenwald’s version of events: Kurt there’s nothing illegal about getting horned up. It’s okay,  —   Patrick Monahan (@pattymo) June 8, 2017,   pic. twitter.   —   Bill Buchanan (@BigActionBill) June 8, 2017,  can’t wait to give my kids the tentacle talk,  —   . (@tcraig9) June 8, 2017,  Even Eichenwald parody accounts have given up, convinced that he has become too hard to satirize: this parody account is pointless. i cant compete,  —   Kirk Eichenwald (@kirkeichenwald) June 8, 2017,  Even FAKKU, the largest hentai publisher in the United States, contacted Eichenwald over his latest tweets, offering answers to any questions he may have about tentacle porn: Dear @kurteichenwald if you have questions about tentacle hentai, ask us! We like Urotsukidoji by @Tentacle_Master https:  .   —   FAKKU (@FAKKU) June 8, 2017,  Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562158.0963488}