{"duration": 0.05187869071960449, "input_args": {"text": "'Radio Aryan October 28, 2016 \\nDr Matthew Raphael Johnson brings us a new Orthodox Nationalist devoted to Albaniaâ\\x80\\x99s alliance with the globalist word order and itâ\\x80\\x99s catastrophic consequences. \\nAlbania never made sense. Created by the Austrian Empire as a means of blocking Serbian access to the sea, Albania was and is nothing more than a plaything for the great powers. Her â\\x80\\x9cnational awakeningâ\\x80\\x9d was just a means to preserve Turkish suzerainty over the Balkans. The country in 1848 was a collection of Islamic tribal oligarchs who used their promise to fight for the maintenance of the Ottoman empire to catch the attention of the Austrians. Nothing has changed today. Albania, rather than the creation of Austria, is the creation of the US and rather than Islamic tribal oligarchs, it is now a collection of petty crime lords. It is a bizarre, artificial country created and maintained exclusively to frustrate the aims of Serbs, Montenegrins and Russians. This podcast deals with Albania’s pathetic existence since the fall of her Maoist Government in 1991. It serves as a perfect example to show that inventing make-believe countries while attacking natural ethnic aspirations will always lead to disaster. \\nThe picture above is of the current “President” Ibrahim Rugova of (the previously Serbian but now taken over by Albanians) Kosovo, who in 1998 won the Presidency of the new country in a one-party race and achieved 99.8% of the vote. The US organized the election and the BBC then called him the “Father of the Country” as he won the Sakharov Prize for Freedom of Thought right after his victory. They even have statues of Bill Clinton there as one of the heroes of their nation. \\nAlbania is proof that the US has been involved in the global narco-trade for decades and the evidence is overpowering. The support for the KLA and Albanian kingpins is nothing new or even interesting historically and today it is just a hub for drugs and human trafficking. All the Afghan heroin in Europe passes through there and Albania’s service to the New World Order is just to preserve her handful of drug lords and other criminals in power. By attacking Russia, even rhetorically, a ruling class can have all its sins covered over as Russia and Nationalism are the two enemies of the liberal world order. There is nothing the global ruling class will not do â\\x80\\x93 no deed too vile â\\x80\\x93 to destroy them and as the possibility of nuclear war with Russia looms over the horizon, this really is an understatement of the truth. \\nPresented by Matt Johnson'"}, "time": 1742562332.2148037}