{"duration": 0.015882253646850586, "input_args": {"text": "'  OBAMA’S WARS: First U.S. Serviceman Killed In Northern Syria By Improvised Explosive Device Today The death marks the first time a U.S. service member has been killed in Syria since a contingent of Special Operations forces were deployed there in October 2015 to go after the extremist group.   24, 2016 A U.S. service member was killed by an improvised explosive device in northern Syria on Thursday, the Pentagon announced in a statement. \\nThe service member was killed near Ayn Issa , a town roughly 35 miles northwest of the Islamic State’s self-proclaimed capital of Raqqa . The death marks the first time a U.S. service member has been killed in the country since a contingent of Special Operations forces were deployed there in October 2015 to go after the extremist group. Obama last week talking about his failure to lead in Syria: \\n“The entire counter-[Islamic State] coalition sends its condolences to this hero’s, family, friends and teammates,” said Lt. Gen Stephen Townsend , the commander of the U.S.-led coalition fighting the Islamic State in Iraq and Syria. “On this Thanksgiving please be thankful there are service members willing to take up the fight to protect our homeland from [the Islamic State’s] hateful and brutal ideology.” The Pentagon usually waits 24 hours before releasing the name of a casualty to ensure proper notification to the service member’s family. \\nThere are roughly 500 U.S. troops in Syria , mostly operating in support role to a coalition of Arab and Kurdish fighters fighting the Islamic State known as the Syrian Democratic Forces, or SDF. Earlier this month, Secretary of Defense Ashton B. Carter announced that the SDF had begun the initial operations to isolate and eventually retake Raqqa. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742628571.416469}