{"duration": 0.029457569122314453, "input_args": {"text": "'The Social Security Administration paid $1 billion in benefits to those who did not have a Social Security number (SSN) according to a recent audit. [The agency’s inspector general found errors in how the government documented representative payees or individuals who are designated to receive retirement or disability benefits on behalf of those who cannot manage the benefits themselves, the Washington Free Beacon reported.  The audit, released Friday, found thousands of instances where no SSN was found on file. The agency paid $1 billion to 22, 426 representative payees who “did not have an SSN” and had not kept any paper applications supporting an individual’s case to receive benefits on someone else’s behalf, according to the inspector general. “Furthermore, unless it takes corrective action, we estimate SSA will pay about $182. 5 million in benefits, annually, to representative payees who do not have an SSN or paper application supporting their selection,” the inspector general said. The agency also paid $853. 1 million in benefits since 2004 to individuals whom the agency terminated as representative payees. The inspector general said the errors occurred because the agency did not keep paper records of applications or purge terminated employees from the system. Of the audit’s sample of 100 beneficiaries, only six SSN’s were properly recorded. The inspector general also said that illegal aliens had been receiving benefits through the representative payee system. Illegal aliens without SSNs are allowed to receive government benefits if they are representing their minor children. In response to the audit, the SSA said that it switched to a new Electronic Representative Payee System last year, which “may have resulted in applications showing as terminated or not selected. ” The SSA defended its issuance of SSNs to   and   holders, saying, “Representative payees play a significant role in many beneficiaries’ lives. ” The agency added that the Social Security Act allows an illegal alien to serve as a payee. The “absence of an SSN is not a criterion preventing an individual from serving as payee,” the agency added.'"}, "time": 1742628451.7589004}