{"duration": 0.11917948722839355, "input_args": {"text": "'BNI Store Oct 29 2016 FRANCE: Police are under siege in Muslim migrant areas in and around Paris, also known as “NO-GO Zones” Despite President Francois Hollande’s continued insistence that there aren’t any Muslim NO-GO Zones in France, police say otherwise. NO-GO Zones are violent and lawless Muslim migrant dominated neighborhoods around Paris that are virtually off limits to non-Muslims and a threat to police and firefighters. Gatestone (h/t Brenda K) There is a mountain of evidence that confirms the existence of Muslim ‘NO GO ZONES’ (Zones Urbaines Sensibles) where non-Muslims are afraid to go because they regularly are attacked by gangs of Muslims who rule these lawless neighborhoods. Host-country authorities have effectively lost control over many no-go zones and are often unable or unwilling to provide even basic public aid, such as police, fire fighting and ambulance services, out of fear of being attacked by Muslim youth. Muslim enclaves in European cities are also breeding grounds for Islamic radicalism and pose a significant threat to Western security. Europe’s no-go zones are the by-product of decades of multicultural policies that have encouraged Muslim immigrants to create parallel societies and remain segregated from — rather than become integrated into — their European host nations. A 120-page research paper entitled “No-Go Zones in the French Republic: Myth or Reality?” documented dozens of French neighborhoods “where police and gendarmerie cannot enforce the Republican order or even enter without risking confrontation, projectiles, or even fatal shootings.” A landmark 2,200-page report, “Banlieue de la République” (Suburbs of the Republic) found that Seine-Saint-Denis and other Parisian suburbs are becoming “separate Islamic societies” cut off from the French state, and where Islamic Sharia law is rapidly displacing French civil law. The report said that Muslim immigrants are increasingly rejecting French values and instead are immersing themselves in literal violent Islam. The problem of no-go zones is well documented, but multiculturalists and their politically correct supporters vehemently deny that they exist. Some are now engaged in a concerted campaign to discredit and even silence those who draw attention to the issue. A 120-page research paper entitled “No-Go Zones in the French Republic: Myth or Reality?” documented dozens of French neighborhoods “where police and gendarmerie cannot enforce the Republican order or even enter without risking confrontation, projectiles, or even fatal shootings.” In October 2011, a 2,200-page report, “Banlieue de la République” (Suburbs of the Republic) found that Seine-Saint-Denis and other Parisian suburbs are becoming “separate Islamic societies” cut off from the French state and where Islamic Sharia law is rapidly displacing French civil law. The report also showed how the problem is being exacerbated by radical Muslim preachers who are promoting the social marginalization of Muslim immigrants in order to create a parallel Muslim society in France that is ruled by Sharia law. The television presenter asks: “What if we went to the suburbs?” Obertone replies: “I do not recommend this. Not even we French dare go there anymore. But nobody talks about this in public, of course. Nor do those who claim, ‘long live multiculturalism,’ and ‘Paris is wonderful!’ dare enter the suburbs.” Back in 2015, the Mayor of Paris threatened to sue FOX News for reporting on the problem of Muslim NO-GO Zones. As a result, several FOX commentators were forced to issue apologies on the air for claiming after the Charlie Hebdo attack that there are Muslim-ruled “no-go zones” in France. \\nc'"}, "time": 1742564527.8152645}