{"duration": 0.04781174659729004, "input_args": {"text": "'Miss Islandia abandona concurso internacional de belleza porque le pidieron comer menos (Fotos) Publicado: 26 oct 2016 23:23 GMT \\n\"Miss Grand International no merece mi rostro, mi cuerpo, mi personalidad o mi corazón\", condenó la joven después de recibir denigrantes \\'consejos\\' de los organizadores del evento. Instagram @arnayr Síguenos en Facebook \\nLa representante de Islandia ha decidido abandonar un prestigioso concurso internacional de belleza después de que sus organizadores le \\'aconsejaran\\' comer menos porque tiene exceso de grasa en su cuerpo, informa \\' The Washington Times \\'. \\nSegún la información disponible, Nawat Itsaragrisil, presidente de Miss Grand Internacional 2016, certamen que se celebra en Las Vegas (Nevada, EE.UU.), dio a conocer a Arna Yr Jonsdottir que tenía \"un poco de grasa\" y le recomendó tratar de perder algo de peso para competir mejor en la etapa final del evento. Instagram @arnayr \\nEstos \\'consejos\\' indignaron a Miss Islandia, quien decidió retirarse del concurso. \"Soy una mujer fuerte, pero a veces esto no es suficiente. Su equipo me dijo que tenía que perder peso para la fase final porque tengo mucha grasa y mis hombros son muy grandes. Me dijeron que comiera menos para que le gustara más a usted\", respondió la joven de 20 años en una carta divulgada a través de las redes sociales. Фото опубликовано Arna Ýr Jónsdóttir (@arnayr) Окт 14 2016 в 7:08 PDT \\n\"Me dicen que soy muy gorda para usted (…) Miss Grand International no merece mi rostro, mi cuerpo, mi personalidad o mi corazón\", agregó la modelo islandesa, aclarando que se siente orgullosa de su cuerpo y que ha sido gimnasta desde los 10 años. \"Mis hombros son un poco más anchos que los de otras chicas porque fui miembro de la Selección Islandesa de atletismo y estoy orgullosa de ello\", sentenció. Instagram @arnayr '"}, "time": 1742562045.9320517}