{"duration": 0.1388857364654541, "input_args": {"text": "'In an address after the Orlando massacre punctuated with dire warnings of impending violence, Donald J. Trump said he would “suspend immigration from areas of the world when there is a proven history of terrorism” against the United States or its allies. Mr. Trump promised fixes to the immigration system that would be “tough” and “smart” and “fast. ” It sounded much like his provocative proposal to keep Muslims from entering the country, but those listening closely noticed an important change. By proposing to bar people from certain regions rather than religions, Mr. Trump had avoided the sticky issue of testing someone’s faith. Mr. Trump’s plan, lawyers and legal scholars agree, is one that the president has the power to carry out. But they said that putting it in place would take an ambitious bureaucratic effort not likely to move nearly as quickly as the candidate envisions. And it would make sweeping use of executive authority to enact the sharpest restrictions on immigration since 1965, when the United States abandoned longstanding quotas designed to exclude people from much of Asia and from southern and Eastern Europe. “Executive authority over immigration is very broad,” said Bo Cooper, a lawyer who served as general counsel to the federal immigration agency from 1999 to 2003. But Mr. Trump’s proposal, he said, “goes far beyond what’s been done with that authority in the past. The leap in scale is orders of magnitude. ” The presumptive Republican nominee did not name which countries would be covered by his ban, but they could include vast sections of the Middle East, northern and   Africa and Asia. Islamic terrorists have operated in at least 17 nations in recent years, and citizens of those countries received more than 1. 4 million visas to come to the United States in 2014, including green cards for immigrants settling here permanently and temporary visas for workers, students and visitors. By Mr. Trump’s definition, a ban could include countries like Iraq, Saudi Arabia and Egypt, souring relations with governments that are working closely with the United States to combat the jihadist terrorists he aims to defeat. Immigration analysts said a   ban, even if temporary, could prompt a wave of retaliation against American citizens traveling and living abroad, which could separate families and disrupt American businesses, trade and intelligence gathering. Together with his plans for a wall along the border with Mexico and a “pause” in legal immigration by foreign workers, Mr. Trump’s antiterrorism suspension would alter the welcoming message the United States has long sought to project to the world, symbolized by the Statue of Liberty in New York Harbor. That, Mr. Trump and many of his supporters believe, may be a change long overdue. “We cannot continue to allow thousands upon thousands of people to pour into our country, many of whom have the same thought process as this savage killer,” he said in his speech Monday after the killing of 49 people at a gay nightclub in Orlando by a gunman who pledged allegiance to the Islamic State. Although the gunman, Omar Mateen, was a    American who was born and raised in the United States, Mr. Trump focused his ire on Mr. Mateen’s parents, who came here from Afghanistan more than three decades ago. As with some of Mr. Trump’s other proposals, it was unclear to what extent the ban was an   promise as opposed to a considered strategy. But in contrast with his usual   style of speaking, he read from a prepared text, quoting from the actual immigration statute he would be using. Still, he provided few details on how it would work. The ban would be lifted, Mr. Trump said, when “we understand how to end these threats. ” The Trump campaign declined to elaborate. Senator Jeff Sessions of Alabama, a Republican   on immigration who has advised Mr. Trump on the issue, said the proposal was a statement of purpose that would be filled in with details in coming months. “He has been very clear and very strong that we need to pause until we have time to figure out this violent jihadist thing and get it under control,” Mr. Sessions said.’ ”Mr. Trump’s ban would rely on a law that allows the president “by proclamation” to restrict the entry of any immigrants who “would be detrimental to the interests of the United States. ”” ’The ban would probably not drastically reduce the overall flow of immigrants to the United States. Of 1. 2 million immigrants who came here to live in 2013, for example,   were from just three countries, none of which are likely to be suspended: China, India and Mexico. But identifying areas to include in a ban and persuading Washington to accept that definition would be the first steps that would slow down Mr. Trump. “It takes time to turn the government around to do things, and nothing is going to happen quickly that easily,” said Theresa Cardinal Brown, the director of immigration policy at the Bipartisan Policy Center, a research organization in Washington, and a former senior policy official at the Department of Homeland Security. Although the president has the power to set the broad course of immigration policy, she noted, Congress would have to approve funds for the initiative and some pieces could require new rules and a long period of public comment. Once a ban is in place, its impact would be harsh for countries on the list. Their citizens require visas any time they enter the United States, even for short trips. So their businesspeople could not come for meetings, students could not attend American universities, and tourists could not come to see the sights. Foreign spouses of American citizens could not come to live with their families. “It could include everyone from the king of Saudi Arabia to a college student,” said Muzaffar Chishti, a director at the Migration Policy Institute, a nonpartisan research group. Whatever the range of a ban, the United States could expect swift reciprocal responses. “I can see severe adverse political fallout,” said Stephen   an immigration law professor at Cornell. “Countries could retaliate by limiting travel by U. S. citizens, and it would certainly harm our standing in terms of international initiatives negotiating trade deals and stopping wars. ” Daniel Tichenor, a political science professor at the University of Oregon who studies American immigration history, said a precedent close to Mr. Trump’s regional ban was the   ban on immigration from Asia during the first half of the 20th century. Racial and national security fears during World War I led Congress to establish an “Asiatic barred zone” starting in 1917, acting on the belief that Chinese, Japanese and other Asian immigrants could not assimilate into American society. In the 1920s, Congress also limited immigration from southern and Eastern European countries including Italy, Greece and Poland, on the theory that their citizens were inferior to Western Europeans and could import subversive socialist ideas. Because of the restrictions, during World War II many Jews and others fleeing Hitler were blocked from coming to the United States. Congress eliminated the national origin quotas when it overhauled immigration in 1965. “It is not uncommon in our past for national security anxieties to be exploited by those who favor strong immigration restrictions even before a real national crisis,” Prof. Tichenor said. But, he said, “Trump really stands out. ” For a time after the Sept. 11, 2001, terrorist attacks, people from predominantly Muslim countries arriving in the United States were fingerprinted and questioned for a special registration, and immigrants from those countries already living here had to register as well. About 13, 000 of those immigrants were deported, mostly for overstaying visas. But there was no effort to ban entire countries or regions. Mr. Trump said an antiterror suspension would be lifted “after a full, impartial and long overdue security assessment” to create tougher screening and determine that the threat from Muslim terrorists had diminished. Mr. Cooper, the former general counsel for the immigration agency, said such a suspension would probably not be temporary. “I promise you, any security expert is going to say the threat is not going to end in our lifetimes,” Mr. Cooper said. “That is an ending point you probably never reach. ”'"}, "time": 1742562323.4076755}