{"duration": 0.07887792587280273, "input_args": {"text": "'Within the preparedness community, there is a tendency for individuals to place an almost exclusive focus on acquiring the right supplies and tools for survival, and for good reason, but what is too often brushed aside in this pursuit are the tools that every person carries within his or her body, namely the muscular system. Whether due to personal neglect, lifestyle barriers or just plain lacking motivation, there is a tendency to put off strength and endurance training. Being physically fit is equally as important as having the proper resources when disaster strikes. Making sure that we are doing what we can to have able bodies with which to face and survive a major disaster should be a top priority, and this means starting today, doing basic strength training exercises to improve your overall health and mobility. Maybe you don’t consider yourself athletic, and maybe you haven’t worked out in years, but there is no good reason to let that hold you back from doing daily exercises now so that you can help yourself and your family when it counts. Here are three basic exercises that you can implement into your daily routine today (none of which require the use of weights):\\nPush-ups Push-ups seem fairly straightforward, but many people have been taught an incorrect way to do push-ups that can cause irreversible damage. Wide-arm push-ups, in which your hands are extended outside of shoulder-width, cause a bone in your shoulder called the acromion to rub against the supraspinatus tendon just beneath it, which can cause permanent damage. Avoid damaging your shoulder by placing your hands at or within the width of your shoulder. If it’s been awhile since you’ve done push-ups and you are finding it difficult to push your full body weight, then you can focus on pushing only your upper body weight by placing a pad under your knees and doing push-ups with only your knees on the ground instead of your feet. For someone who is just starting, you can do just 10 push-ups a day and gradually increase that number as you build endurance with this exercise. Push-ups are great for building strength in your chest, core and back.\\nBody Squats \\nArguably one of the most important exercises you can do for overall leg strength, body weight squats are a great exercise that requires no weights. It’s important to maintain a straight posture as you squat down, and this will require that you shift your waist backward considerably as your waistline reaches your knees. Make sure that your knees do not bend over the tip of your toes to avoid injury.\\nA person’s ability to do a squat can be affected by a number of factors, from overall leg strength to ankle-, knee- and hip-related stress. Those who have not squatted much in their life tend to have a shortened Achilles tendon which impedes full range of motion and only allows these particular individuals to do a partial squat. By doing consistent partial squats, they can eventually form an elongated Achilles tendon and do full squats. As you grow in strength and body weight squats become easier, you can begin to add weight to the exercise by holding a weight in the center of your chest and increasing that weight as you increase in strength and endurance.\\nReverse Plank Bridge \\nThe reverse plank bridge is basically the opposite of a push-up; you hold yourself up by placing your hands directly beneath your shoulders in a sitting position and push yourself upward; either extend your legs and keep them straight, balancing on your heels, or bend them and keep your feet flat. Just by holding this position you are working a number of muscles. This exercise is exceptional for building your core, lower back, and arms.\\nBy adding these three simple exercises to your daily routine, you can dramatically increase your full spectrum strength and mobility. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 18th, 2016 See How You Stack Up Against The WW2 Fitness Test 4 Daily Strengthening Exercises That Will Push You to the… Book Review: “You Are Your Own Gym” Ancient Secrets to Relieving Back Pain The Synergistic Effects of Meditation + Exercise on… '"}, "time": 1742563519.9995263}