{"duration": 0.05206894874572754, "input_args": {"text": "'Women in hijabs and men in jeans strolled along Fifth Avenue in Bay Ridge, Brooklyn, on Saturday night beneath the signs of stores and restaurants written in Arabic. It would have seemed a typical Saturday night in one of New York’s largest   neighborhoods. Except that inside those storefronts and cafes, there was worry, disbelief and emergency meetings, prompted by President Trump’s executive orders that temporarily banned   and green card holders from seven predominantly Muslim countries. Among those countries was Yemen. At the   Social Center, 20   business and community leaders from across the city met to share information in Arabic and English about friends and relatives detained at airports across the United States. Everyone knew someone, or was connected with someone on social media who was affected. They decried the president’s executive orders. “Trump grew up in Queens, Yemenis were his neighbors,” Kaled Alamarie, 44, said. “That’s his New York. ” Mr. Alamarie came to the United States when he was 10. He is a Giants season ticket holder and works for the city’s Department of Environmental Protection. His brother, Amrr, 24, was born in New York and is a director of the John Adams High School STEM Academy in Ozone Park, teaching math, science and technology. “What drew me out today is that I have an immigration case pending for my wife,” Amrr Alamarie said. His wife, from Yemen, has been unable to get a visa to the United States for two years and now does not know when that will happen. They have a    daughter. “It’s hard not seeing myself living that American life,” he said. Yemen is embroiled in a war between rebels aligned with Iran known as Houthi and Saudi   fighters that forced the closure of the United States embassy in Sana in 2015. For Yemenis seeking American visas, most have had to go to Malaysia or Djibouti to wait. Under President Barack Obama, some Yemenis had their United States passports confiscated in Sana. “Everybody’s afraid,” said Zaid Nagi, 38, who came straight from the protest at Kennedy International Airport to the emergency meeting. “What kind of guarantee do we have if they don’t honor a visa they issue themselves? Or a birth certificate? Where do they draw the line?” Anas Alhajj, 26, said he was involved in student uprisings in Sana. He received asylum, and now works for a Yemeni newspaper based in Bay Ridge. He said he is worried that his status could be revoked. “You have to understand where we came from, there’s a lot of hardship, dictatorships,” Kaled Alamarie said. “In their mind, they’re thinking that they’re going to disappear, just like they disappear in Egypt, in Yemen. They just don’t believe it. ” The meeting was organized by Debbie Almontaser, the president of the board of directors for the Muslim Community Network and a national board member of the     Committee. “If you know people who are at the airports, let them know to refuse to go back on the plane and not to sign any documents. Ask for a lawyer,” she said to the group of men around the table. “Fear,” she said earlier in the day, “is reverberating through our community. ” But there was also pride. Ibrahim Qatabi, a legal assistant at a nonprofit, said that his   came by boat to the United States from Yemen. He then worked in Buffalo for the railroad. Mr. Qatabi’s grandfather worked for the Ford Motor Company. “And now to be treated as a   citizen?” said Mr. Qatabi, 37, who works for the Center for Constitutional Rights. “We’re not refugees,” he said. “The people who were rejected today are relatives of U. S. citizens. ” Mr. Qatabi said he worried about the psychological effect this order, which has been described as a Muslim ban, could have. “What we worry about more than ever is that Trump’s executive orders will embolden and encourage people to be racist, to openly discriminate against minorities, against people who come from the Middle East and especially these seven countries. ” But one neighborhood activist in the   community in Bay Ridge was conspicuously absent. She said she thought the temporary ban was good policy. Kathy Khatari, an   who married into a   family and is a proud Muslim, said that she fully supported Mr. Trump  —   cheers him, in fact. Ms. Khatari said: “Who cares, as long as we know who we are letting in. Do you know an ordinary Yemeni from someone from ISIS? No  —   because we don’t. I’ll take inconvenience for safety. ” Yemen was the site of the first counterterrorism raid that Mr. Trump authorized, an attack of Qaeda headquarters that had killed an estimated 14 Qaeda fighters and one American commando, the Pentagon said on Sunday morning. For those in Bay Ridge, the fighting seemed so distant. The manager of the popular Yemen Café on Fifth Avenue, Nasser Alsubai, 28, disagreed about the imminent danger, or implication that people seeking to come to the United States from these seven countries were terrorists. He is a United States citizen, naturalized after he came to New York at age 6. “Any Yemeni family that you find here in America are all working hard to support family in Yemen,” Mr. Alsubai said. “How is going to make things better toward his agenda?” he added of Mr. Trump. “He’s going to make us go back in time. Like the camps with the Japanese. We’re fighting all over the world for every single country to have democracy, but we’re not doing it here. ”'"}, "time": 1742628536.6540499}