{"duration": 0.1268906593322754, "input_args": {"text": "'SEATTLE  —   Some parents find peace of mind in the   features in smartphones that let them keep tabs on their children. There are also the dog owners who can rest easy knowing that hired dog walkers are doing their job, and that the dogs are doing their business. And then, there is the comfort of tracking your pizza delivery. When Lora Mastrangeli orders one from Pizza Hut every other week, she does not just wait for it. She stalks it. The moment her order leaves the nearest Pizza Hut, about 30 minutes from her home in Plano, Tex. the restaurant sends Ms. Mastrangeli an alert on her smartphone with a link to a map showing an image of a pizza delivery car driving toward her house. Since she knows her driver’s location, she knows precisely when to scoop her two small dogs up and sequester them in a back room to keep them from yapping at the driver. “My husband and I absolutely love it,” said Ms. Mastrangeli, who works in sales for Nordstrom. “We’re walking out the door when he pulls up. ” People were amazed six years ago when the   service Uber let them track the location of their drivers on a   map as they waited for a ride, rather than accepting the vague assurances of taxi dispatchers. Other tech   followed with maps to pinpoint the location of all sorts of things, from shoes to food and the dog walkers. And new services from Comcast and Time Warner Cable allow customers to see the exact location of the cable repairman on the way to the house. The question, of course, is whether maps offer a bit more information but do little to improve underlying problems. Cable companies, for instance, suffer from some of the lowest customer satisfaction levels of any business. Knowing exactly where your cable guy is does little to address complaints about escalating prices. “I’m not sure that’s the root of the problem,” said Frances X. Frei, a professor of service management at Harvard Business School and author of “Uncommon Service,”  a book about customer service. So does tracking your pizza on a map just make you feel better? “It’s pure psychological effect,” said Nicholas Goubert, head of project management at Here, a digital maps company that provides location data to Amazon and other businesses. “Your pizza is not going to come any sooner. But it’s moving. ” Soon UPS, the world’s largest package delivery company, may also begin showing customers exactly where their stuff is. UPS is exploring giving location maps of its familiar brown trucks to customers and could begin a trial of the service within a few months, according to a person briefed on the plan who asked for anonymity because it is still private. Executives at big, established companies concede that their moves are inspired by   businesses like Uber, which have changed what customers expect from all kinds of services. “It brings that visibility and transparency that they’re starting to come to expect with the Ubers and Lyfts,” said Baron Concors, global chief digital officer for Pizza Hut, which began sharing the location of delivery drivers with customers in some markets about six months ago. “There’s a new bar for experience when it comes to delivery and transportation that everyone is going to have to meet. ” The technology behind most of this is not terribly complicated. The maps typically rely on the GPS location provided by, say, a pizza delivery driver’s smartphone and triangulate that with   and cellphone tower signals to pinpoint a location. Companies like Apple, too, have made helicopter parenting easier by letting mothers and fathers track the locations of children through their smartphones. In many cases, companies that provide customers with live tracking information have a practical motivation. The service is intended to eliminate situations when someone misses a knock on the door by stepping into the shower or backyard. A missed delivery or service call is a logistical headache companies want to avoid. “If they have to come back, they lose money,” said Bryan Trussel, chief executive of Glympse, a     in Seattle that is working with companies like Pizza Hut, Comcast and Time Warner. Some companies are going to bizarre lengths to provide greater transparency to customers through maps. Last year, Wag, a   in Los Angeles, introduced the mobile app that includes a live map that shows the pet owner the route of the Wag walker and pooch. Joshua Viner, chief executive of Wag, said the map allows pet owners to verify that their dog is getting the amount of exercise the owner is paying for. “There’s no way to cheat the system,” said Julien LoPresti, who works in sales and operations for a technology company in New York and has used Wag to find walkers for Reptar, his Labrador mix. “It gives you extra confidence. ” In the next month, Wag will go even further by allowing walkers to commemorate where pets relieve themselves by tapping the screens on their smartphones. Corresponding emojis will materialize on the apps of pet owners. “It’s all real time  —   it’s almost like you’re part of the experience,” Mr. Viner said. Comcast was after a different experience when it began letting customers track the locations of technicians last year, part of a much broader initiative to improve customer satisfaction. The company used to have   appointment windows when technicians could arrive at customers’ homes, which confined the customers there for a good chunk of the day. Now Comcast has cut the appointment windows to two hours. “The overall premise is we should always be respecting customers’ time,” said Charlie Herrin, executive vice president of customer experience at Comcast. About 30 minutes before the   window, Comcast sends the customer a notification through the Comcast mobile app giving a narrower,   window when the technician expects to arrive. About 15 minutes before the technician pulls up at the home, Comcast sends a link to a map that shows the vehicle en route. Dr. Frei, the Harvard Business School professor, said customers would be happier if Comcast were more precise with its appointment estimates from the start. “What I’d like them to do is say, ‘We will be there at 3 p. m.,’ and then what I’d like to have happen is they’re there at 3 p. m.,” she said. “I wouldn’t need any transparency. ”'"}, "time": 1742563581.887821}