{"duration": 0.06992149353027344, "input_args": {"text": "'His name is King Leopold II of Belgium and the living incarnation of evil killed over 10 million innocent people in what is now called the Democratic Republic of Congo. Of the Europeans who scrambled for control of Africa at the end of the 19th century, Belgium’s King Leopold II left arguably the largest and most horrid legacy of all. — BBC \\nVia AnonHQ \\n\\nReign Of Terror To fulfill his dream to establish Belgium as an imperial power, Leopold led the first European efforts to develop the Congo River basin, founded his own private colony – the Congo Free State – in 1885 with the pretext to improve the lives of the native inhabitants, only to annex it as the Belgian Congo in 1908.\\nUnder the reign of terror instituted by Leopold, as many as 10 million Africans lost their lives to one man’s greed, exploitation and brutality that Africa and the world must not forget. Presenting himself as a philanthropist eager to open the heart of Africa to Christian missionaries, Western capitalists, and Western civilization, Leopold embarked on an ultimately successful effort to make a vast fortune from his new possession by committing widespread atrocities against his colonial subjects.\\nHe “bought” the Congo and enslaved its people, turning the entire country into his own personal slave plantation. He disguised his business transactions as “philanthropic” and “scientific” efforts under the banner of the International African Society. He used their enslaved labor to extract Congolese resources and services. His reign was enforced through work camps, body mutilations, executions, torture, and his private army. — Films For Action\\nThe photo above shows a man named Nsala Wala with his daughter’s hand and foot. Alice Harris, working as a missionary in the Congo, took the photo in May 1904, after he had come into her mission at Baringa with a small package containing the severed body parts.\\nLeopold never set foot in “his” Congo — for all the 23 years — but his “rubber terror” and barbarity knew no bounds. Since the Congo economy was largely operated by forced labour, the effects were devastating. 10 million Congolese were either murdered or worked to death by Leopold’s private army. Women were starved and systematically raped, worker’s hands were cut off and hundreds and thousands of indigenous people endured kidnapping, looting and village burnings. Adam Hochschild, author of King Leopold’s Ghost, writes:\\n“Some were beaten or whipped to death for failing to meet the rigid production quotas for ivory and rubber harvests, imposed by Leopold’s agents. Some were worked to death, forced to labor in slave like conditions as porters, rubber gatherers or miners for little or no pay. Some died of the diseases introduced to (and spread throughout) the Congo by Europeans. And still others died from the increasingly frequent famines that swept the Congo basin as Leopold’s army rampaged through the countryside, appropriating food and crops for its own use while destroying villages and fields.\\n“Hostage-taking and the grisly severing of hands (from corpses or from living human beings) were part of the government’s deliberate policy — a means of terrorizing others into submission. As the “rubber terror” spread through the Congolese rain forest, entire villages were wiped out: Hundreds of dead bodies were dumped in rivers and lakes, while baskets of severed hands were routinely presented to white officers as evidence of how many people had been killed.”\\nThe Curious Case of World Ignorance Ever wondered why the world and the media don’t remember Leopold and why his name doesn’t produce fear, hatred, and sorrow? Leopold ensured that his crimes would never make it into the history books. Shortly after the turnover of the colony, Hochschild writes, the furnaces near Leopold’s palace burned for eight days, turning most of the Congo state records to ash and smoke.\\nIs there a hidden agenda to not talk about genocides in Africa perpetrated by European capitalist monarchs? There’s a Wikipedia page called “Genocides in History” but the Congolese Genocide isn’t included in the list despite the fact that attempting to eliminate a portion of the population is enough to qualify as genocide under the UN convention. Wonder why?\\nHe’s part of a long history of colonialism, imperialism, slavery and genocide in Africa that would clash with the social construction of the white supremacist narrative in our schools. It doesn’t fit neatly into a capitalist curriculum. Stories which support the white supremacist narrative about the sub-humanness of people in Africa are allowed to be entered into the records of history. The white guy who turned the Congo into his own personal part-plantation, part-concentration camp, part-Christian ministry and killed 10 to 15 million Congolese people in the process doesn’t make the cut. — Liam O’Ceallaigh\\n'"}, "time": 1742562904.0143328}