{"duration": 0.07865500450134277, "input_args": {"text": "'GOP establishment consultant Rick Wilson, one of the most vile “Never Trumpers” who once said the donor class should “put a bullet in” Donald Trump, thinks supporters of President Trump saw the assassination attempt on House Majority Whip Steve Scalise ( ) as a “blessing. ”  “A lot of clickservatives saw yesterday as a grim blessing,” Wilson tweeted the morning after a gunman who hated Trump and Republicans opened fire on Republicans who were practicing for the Congressional Baseball Game. After saying that Trump supporters were “dead right” about the “media double standard,” Wilson claimed “the thing they really loved  …     even at the cost of a lunatic Bernie Bro almost committing mass murder was  …     the chance to try to blame opposition to Trump on the shooting. ” He added this was a “sign of their moral decay. ”   A lot of clickservatives saw yesterday as a grim blessing, and the editorial coverage and reaction from the left as two things.  —   Rick Wilson (@TheRickWilson) June 15, 2017,    But the thing they really loved. Really, really, loved even at the cost of a lunatic Bernie Bro almost committing mass murder was  …      —   Rick Wilson (@TheRickWilson) June 15, 2017,        …    the chance to try to blame opposition to Trump on the shooting. My TL and email were full of it. It’s a sign of their moral decay  …      —   Rick Wilson (@TheRickWilson) June 15, 2017,  He has turned into an unhinged gasbag with a Twitter account.  —   I’m Triggered (@StopThisMadnes1) June 15, 2017,  Most Americans were praying for Scalise, staffers, and the heroic Capitol Police officers who were shot in the line of duty the morning after the assassination attempt. But this apparently was apparently the first thing on Wilson’s unhinged mind when he woke up. Wilson, though, seems to be doing a bit of projecting since he once politicized, out of all things, a rape threat against his daughter to try to score political points against Breitbart News. John Nolte wrote at the time that “in all the years I’ve been on social media, I have never seen anyone  —   not even the lowest Leftist  —   use a threat of rape against their own child as a political talking point or debating point against a political opponent. ” After he politicized the rape threat against his daughter, Wilson was immediately asked if he had gone to law enforcement and whether law enforcement officials asked him not to publicize the rape threat on social media. During the 2016 election cycle, Wilson, who constantly bemoans what he deems is crass behavior by anyone who is not a fellow “Never Trumper,” went on national television and said the donor class needed to “put a bullet in Donald Trump. ” “They’re still going to have to go out and put a bullet in Donald Trump,” Wilson told MSNBC’s   audience. “And that’s a fact. ” Wilson also likened Ann Coulter to a prostitute and asked Coulter if Trump paid her “more for anal. ”'"}, "time": 1742561740.3038113}