{"duration": 0.29680824279785156, "input_args": {"text": "'This post was originally published on this site \\nPerhaps you’ve read about how the Hillary Clinton campaign had a strategy to elevate Donald Trump to the status of what they called a Pied Piper candidate. Rather than the Pied Piper, however, it seems that Trump is closer to another fictional figure. Portrayed by the media for years as a wizard of business, like the media-amplified conman in the L. Frank Baum classic, Trump (as both Clinton and Margaret Atwood have recently pointed out) is more like the Wizard of Oz. \\nIf Trump is the Wizard, however, who is Hillary? The Wicked Witch? Rather than reproducing sexist cliches, perhaps it’s more fair to cast Clintonism, the Democratic Party, or neoliberalism in toto, as the Witch. And the witch is dead. Ding dong. And (though less visible than the daily anti-Trump demonstrations breaking out across the country) throughout the land the little people are celebrating. \\nThey’re celebrating because the ideology that ushered in and maintained wars in Afghanistan, Iraq, Libya, and elsewhere, outsourced jobs, spread unemployment and precarious work along with trade deals like NAFTA seems to have been finally put to rest. The crime bills, the surveillance state, the bailouts of banks, the mass incarceration, the austerity and privatization, the stagnation of wages, accompanied by increases in student loan and consumer debt – all capped off by the insult of Obamacare (aka Romneycare), which has done much to enrich the wealthy and further impoverish the little people – all this, it seems, has been halted. But, as in Oz, things are rarely as they appear. And while the Munchkins – and Mnuchins – and others are exulting in the political death of Clintonism, many more see little to celebrate, and much to dread. For though the Witch may be dead, and the staving off of war with Russia and the killing of the TPP are victories for the little people of the planet, the enemy of one’s enemy isn’t necessarily one’s friend. The promises of further deregulation, school privatization, environmental degradation, and tax cuts for the rich made by Trump are hardly victories for the little people, and neither are the racist and xenophobic policies of the Alt-Right (aka white nationalism) taking over the Executive Branch of the United States government. Marking a fundamental departure from post-War norms, the explicitly racist – and implicitly genocidal – goals of Trump and Co. augur persecution, repression, and catastrophe. \\nHyperbole you say? Exaggeration?Many will no doubt respond that people have been crying wolf for years about anti-semitism and racism. Anyone sufficiently critical of Israel’s policies toward Palestinians, for instance, is labeled and libeled as an anti-Semite. Even Jews who are critical of Israel, like Noam Chomsky, are branded this way. As such, it’s entirely understandable that people should be skeptical about reports concerning the anti-Semitism and racism of Donald Trump and his inner-circle. And yet, there’s a profound difference between honest skepticism and dishonest skepticism; and anyone who examines Trump’s history will see that he has practiced various forms of racist discrimination and scapegoating for decades. Among others, Trump’s chief strategist supports anti-Semites and racists. And the only problem that Jeff Sessions, Trump’s pick for Attorney General, has with the KKK is that some of them smoke pot. (Moreover, let’s not fail to recall the fact that the point of the story of the boy who cried wolf is that the wolf did eventually come.) \\nWhether wolf or wizard, Trump’s history of discrimination is not only old news, it sheds much light on his appointment of Stephen Bannon as his chief strategist. Bannon’s tenure at Breitbart (an Alt-Right, i.e. white nationalist organization) led to stories promoting the most stereotypically racist tropes against women, blacks, Jews, Muslims, Mexicans, and others. And now this proponent of Alt-Right/white supremacy is in charge of strategizing the implementation of policies that include the deportation of millions of immigrants, and banning Muslims – longstanding white nationalist goals of forcible deportation that don’t merely violate basic principles of religious tolerance and respect for human rights; they violate the 1st Amendment, the 4th Amendment, the 14th Amendment, and others. In other words, Trump’s policies baldly contradict the executive’s oath to uphold the constitution. With Trump, such contradictions abound. \\nTrump says, for instance, that he won’t undermine rights recently attained by gays and lesbians. That’s settled law, he says, referring to the Court’s recent recognition of marriage equality. It’s been decided by the Supreme Court, he announces. In the next breath, however, he promises to overturn Roe v Wade, which was also settled by the Supreme Court. It’s even more well-settled. These contradictions hardly cancel one another out. \\nHis invective against Muslims, immigrants, and others has already incited violence, emboldening many to attack blacks, Muslims, Latinos, Jews, and other scapegoats. Displacing the generalized anxieties and violence of the capitalist system, hundreds of such attacks have been reported since the election. \\nThis isn’t, of course, to suggest that Trump won the election solely because of racism, or that his supporters are mostly racists and sexists, as Clinton and her supporters contend. As many have pointed out, Trump won states – like Ohio, Pennsylvania, and Florida – that Obama won just a few years ago. His success is attributable to the fact that people were disgusted by the historically unlikable Hillary Clinton and her poverty-spreading neoliberal politics. \\nLike the Wizard of Oz, an illusion projected onto a screen, the con man (who just settled a fraud suit stemming from his phony university for $25 million) fooled a nation. No one’s really sure what he thinks. Trickery and spectacle, he mesmerized the media for months and months with his outrageousness – his ridiculous hair distracting people the way the lure-like growths on the heads of anglerfish fool their prey. Spouting outlandish statements, he cast his spell. And the plutocrat Hillary and her ideologically-blinded cohorts, believing (like George W. Bush apropos Iraq) that victory would be a cakewalk, stumbled into defeat. \\nIn spite of her arrogant stupidity, however (her cheating, her contempt for the constituency she needed to win, her choice of Tim Kaine for VP, etc.), we shouldn’t overlook the fact that Trump only won because of an undemocratic technicality. Though he prevailed in the electoral college, he lost the popular vote. As such, though Trump may enjoy a legal victory, his wasn’t a moral one. In many respects his victory is entirely immoral – stemming both from his pledges to promote torture, and other crimes, as well as from the US Constitution’s anti-democratic electoral college. Like the Constitution in general, the electoral college was designed to minimize popular rule by aggrandizing the power of a minority of plantation owners. (Concerned that the North was growing more populous than the South, and that popular elections would diminish their power, slaveowners ratified the Constitution only because it included the electoral system, which counted slaves as 3/5 of a person for the sake of apportioning representatives and electors, and thereby heightened their power and secured their privileges.) \\nHad this institution been extricated from the USA’s legal structure, well, it’s hard to imagine that things would be less undemocratic today. As it stands, though, the electoral college illustrates the degree to which the USA remains little more than an insufficiently-reformed slave state. And here we are, like Dorothy, wondering how to get home. \\nDorothy, of course, was not alone in Oz. She was aided by, among others, the Scarecrow. Too dumb to recognize that capitalism and democracy are antithetical, is the Scarecrow Paul Krugman? Or is it Nate Silver, and other pollsters, who unwittingly abetted the despised celebrity billionaire’s victory (and the equally despised former Secretary of State’s defeat)? \\nOne thing’s for sure, if Trump is the Wizard, and the Democratic Party is the Witch, then Bernie Sanders – who turned on his supporters and supported Clinton – is the Cowardly Lion. And yet, the Cowardly Lion would ultimately develop courage. So, maybe there’s still hope for Bernie. As opposed to many Democrats suggesting we give Trump a chance, Sanders has been speaking out against his repressive designs. \\nPraised by recently hostile Republicans (and by that other notorious wizard, the former Grand Wizard of the KKK, David Duke), Trump has also had a friendly meeting with Obama since winning. It seems the last thing Obama wants is to undermine the peaceful transition of power (even if it’s the power of a white supremacist state – which, after all, the USA has been for most of its history). \\nNotwithstanding the thoroughly racist history of the US, however, it is still more than a little alarming to see white supremacists preparing to set up shop in the White House. And it must prompt us to wonder: what will happen if the system fails to constrain Donald Trump? Thanks to Bush and Obama, Republicans and Democrats, he has an unprecedentedly powerful national security state at his command. And, on the other hand, what if the system succeeds, and prevents Trump from pursuing his infrastructure-building project, his trade re-negotiations, and his easing of relations with Russia, which frighten the military-industrial complex and other aspects of the system more than the more xenophobic aspects of his agenda? \\nIf Trump is constrained from pursuing his plans, then what? It isn’t difficult to imagine Trump continuing Obama’s policy of mass deportation. Unlike Obama, though, who’s successfully hidden his policy of deporting millions from the public, one can easily see Trump taking credit for this, satisfying some of his base this way. And let’s not forget, though Trump raises fears about creating registries for Muslims, to some degree registry databases for Muslims already exist. No fly lists are just one part of this. And police surveillance of Muslim communities, in mosques and schools, has been widely known and tolerated since 9/11. Trump could simply continue these as well. \\nAll of which is to say, as repression in Standing Rock and other places continues and a deteriorating environment, toothless climate accords, and unabated economic inequality demonstrate, for most people conditions are already intolerable. Even if Trump is prevented from following through on his promises of ethnically cleansing the US, Trump’s position concerning global warming has genocidal implications of its own. Promising to only intensify the poverty, insecurity, violence, and ecological degradation produced by a political-economic system that’s based on the exploitation of the planet and its people, Trump, and the system that produced him, must both be stopped. \\nOf course, an opposition that merely aims to stop Trump will at best succeed in slowing him down. To prevail, an opposition must forcefully push in the opposite direction – toward universal health care, toward an expansion of the public realm as opposed to privatization, toward an aggressive prioritization of rights to water, housing, education, healthy food, a clean environment, and other requirements for human and environmental health, over the demands of profit. And, like other rights are said to be, these rights must be inalienable – not for sale – beyond the market. This should be the goal, the creation of an actually democratic system – an economic as well as a political democracy. \\nBeyond rhetoric, for an opposition to prevail it must not simply proclaim that Trump is “not my president.” It must recognize that Trump (and the system itself) lacks legitimacy. This is not simply because Trump’s opponent obtained over a million more votes than he did, but because Trump promises to violate the very principles that (however much they’ve fallen short historically) justify the United States’ existence in the first place. \\nBeyond Trump, however, the biophagous political-economic system that enabled him to attain so much power must be rejected as well. As the ancient legal maxim has it, the health of the people should be the supreme law. And, because the current global system has spread, and is designed to continue to spread, conditions of disease throughout the world, the entire system is in breach. Related '"}, "time": 1742562327.855623}