{"duration": 0.027728557586669922, "input_args": {"text": "'Voter Fraud is Trump’s Greatest Challenge New Stanford electronic voting machine study cites probably fraud in favor of Clinton. The study covered the last Democratic primary election results. \\nA new Stanford study indicated which only use electronic voting machines give Hillary a 9% advance over Sanders in the Democratic Primary. \\nThe Stanford study demonstrated that pre-election polls accurately predicted election results when a paper ballot was used. However, whenn unaccountable electronic voting machines were used, with no confirming paper trial, Clinton exceeded expectations by 9%. When one runs the odds on this being due to random chance, the odds are nearly incalculable. What adds fuel to this fire is that the two major manufacturers of the voting machines, Dominion Voting and H.I.G. Capital, are large Clinton campaign supporters. I remember reading something about the fact that it is illegal to engage in such a flagrant conflict of interest. However, as FBI director, James Comey, has demonstrated, we are living in a country with no rules for the elite establishment. \\nThe criminality oozing out Clinton, never stops. Here is a 3 minute, concise, summation of Clinton got away with voter fraud against Bernie Sanders and how she will do it to Donald Trump. Conclusion \\nThere are six large groups that will support and vote Clinton, because they need their tax funded gravy train to continue. Some of these groups are powerful (e.g. the military industrial complex). Some of these powerful groups have provided the Clinton Foundation with $2 billion dollars of ill-gotten gains to win this election. The Clinton Foundation controls the electronic voting industry and we have seen that could mean as much as 10% of the vote could be stolen. \\nWhat is a Trump supporter to do? We need to all become missionaries of the truth. We need to take every opportunity to express to people why they need to vote for Trump. \\nTrump only has one network that supports him out of the six entities that controls 98% of the media and that is Fox. And why is that? Trump and Rupert Murdock reached a secret deal. More on this in a future story.'"}, "time": 1742563979.3001964}