{"duration": 0.047216176986694336, "input_args": {"text": "'A federal judge on Friday overturned the murder and sexual assault convictions of Brendan Dassey, one of the defendants whose case was the subject of the wildly popular Netflix documentary series, “Making a Murderer. ” Mr. Dassey, 26, must be released from prison within 90 days unless the authorities schedule a new trial, according to the order from a federal judge in the Eastern District of Wisconsin. In 2007, Mr. Dassey was convicted of participating in the murder and sexual assault of Teresa Halbach, a    photographer, and sentenced to life in prison. The   series by Laura Ricciardi and Moira Demos, released in December, suggested that police investigators unfairly questioned Mr. Dassey, then 16, without a lawyer or parent present. It suggested he was mentally unfit, was coerced into a confession that he later recanted, and that his   lawyer, Len Kachinsky, was content to cut a deal. In the   court order, the judge, William E. Duffin, said state courts erred in finding that investigators never made Mr. Dassey promises during his interrogation on March 1, 2006. “The investigators repeatedly claimed to already know what happened on October 31 and assured Dassey that he had nothing to worry about,” Judge Duffin wrote. “These repeated false promises, when considered in conjunction with all relevant factors, most especially Dassey’s age, intellectual deficits, and the absence of a supportive adult, rendered Dassey’s confession involuntary under the Fifth and Fourteenth Amendments. ” The documentary also questioned the conviction of Mr. Dassey’s uncle, Steven Avery, who was also convicted of murder and sentenced to life in prison. Mr. Avery was not affected by the court order on Friday. “Today there was a major development for the subjects in our story and this recent news shows the criminal justice system at work,” Ms. Ricciardi and Ms. Demos said in a statement. “As we have done for the past 10 years, we will continue to document the story as it unfolds, and follow it wherever it may lead. ”'"}, "time": 1742561906.8730369}