{"duration": 0.15465497970581055, "input_args": {"text": "'Donald J. Trump became the presumptive Republican presidential nominee on Tuesday with a landslide win in Indiana that drove his principal opponent, Senator Ted Cruz, from the race and cleared the way for the polarizing, populist outsider to take control of the party. After months of sneering dismissals and expensive but impotent attacks from Republicans fearful of his candidacy, Mr. Trump is now positioned to clinch the required number of delegates for the nomination by the last day of voting on June 7. Facing only a feeble challenge from Gov. John Kasich of Ohio, Mr. Trump is all but certain to roll into the Republican convention in July with the party establishment’s official but uneasy embrace. In the Democratic contest, Senator Bernie Sanders rebounded from a string of defeats to prevail in Indiana over Hillary Clinton, who largely abandoned the state after polls showed her faring poorly with the predominantly white electorate. But the outcome was not expected to significantly change Mrs. Clinton’s sizable lead in delegates needed to win the Democratic nomination. Mr. Trump’s victory was an extraordinary moment in American political history: He is now on course to be the first   of a party since Dwight D. Eisenhower, a   general and the commander of Allied Forces in Europe during World War II, who had not served in elected office. Mr. Trump, a real estate tycoon turned reality television celebrity, was not a registered Republican until April 2012. He has given hundreds of thousands of dollars to Democrats, including his likely general election opponent, Mrs. Clinton. And, at various points in his life, he has held positions antithetical to Republican orthodoxy on almost every major issue in the conservative canon, including abortion, taxes, trade, and gun control. But none of this stopped him. With his ability to speak to the anxieties of voters, and his shrewd use of celebrity and memorable   Mr. Trump systematically undercut veteran politicians in a field of candidates that many in the party had hailed as the strongest in at least three decades. He was underestimated by leading Republicans and Democrats time and again, and he succeeded while spending far less money than most of his rivals and employing only a skeletal campaign staff. After Mr. Cruz exited the race Tuesday night, Mr. Trump appeared subdued and projected a more sober than usual mien as he absorbed the ramifications of the Indiana victory. “It has been some unbelievable day and evening and year  —   never been through anything like this,” Mr. Trump said. Putting aside the venom he has spewed at Mr. Cruz this year, Mr. Trump said of the senator, “He is one hell of a competitor. ” He even veered toward empathy for Mr. Cruz, saying he knew how “tough it is” to be brought low by a brutal defeat. Of the 17 Republicans who ran for president this cycle, Mr. Cruz  —   a onetime ally of Mr. Trump’s  —   proved to be his strongest and most tenacious rival, winning 11 primaries and caucuses. But the   senator’s appeal among traditional conservatives was no match for Mr. Trump’s fiery and uncompromising vow to fight for the interests of average Americans who have lost faith in the country’s political leadership. Republican primary voters made clear that they found Mr. Trump’s brand of   nationalism more attractive. Mr. Cruz, speaking to supporters in Indianapolis, said he could not fight on without “a viable path to victory. ” “Tonight I’m sorry to say it appears that path has been foreclosed,” he said, as some admirers called out for him to reconsider. Without mentioning Mr. Trump by name, Mr. Cruz said: “We gave it everything we got. But the voters chose another path. ” As remarkable as Mr. Trump’s achievement is, his expected nomination also poses undeniable peril to the party he is poised to lead. Republican leaders, who have been reluctant to embrace his candidacy, are watching him with great trepidation, and on Tuesday night they seemed to be grappling with the implications of Mr. Trump’s emergence as the new face of their party. No candidate since the dawn of modern polling has entered the general election with the sort of toxic image Mr. Trump has in the eyes of large groups of voters. Facing a race against the country’s first female   nominee, Mr. Trump is burdened with disapproval ratings as high as 70 percent among women, who make up a majority of voters in presidential elections. He is also an unpredictable voice on policy. At Trump Tower on Tuesday night, amid his litany of   Mr. Trump demonstrated the degree to which his nomination represented an astonishing break from political precedent. In denouncing Mrs. Clinton’s past support for the North American Free Trade Agreement and saying it had caused “carnage” for American workers, he signaled he would run to her left on free trade and upend the   bipartisan consensus on the issue. Mr. Trump starts the general election campaign with a   roll of incendiary proposals and provocations that are the stuff of dreams for opposition researchers. He made his name in the last presidential campaign as the country’s most prominent birther, fueling debunked conspiracy theories that President Obama was not born in America he has used hostile and   language about Hispanics, suggesting that Mexican migrants are rapists and murderers and he has not backed off his proposal to bar all foreign Muslims from entering the United States, effectively creating a religious test for immigrants. No one is more eager to talk about those positions than Mrs. Clinton, who made clear on Tuesday that she wanted to sharpen her focus on Mr. Trump as soon as possible because the fight against him was likely to be bruising. “I’m really focused on moving into the general election,” Mrs. Clinton said during an interview on MSNBC. “And I think that’s where we have to be, because we’re going to have a tough campaign against a candidate who will literally say or do anything. ’’ Yet the Indiana results were an embarrassing reminder of her vulnerabilities: Only slightly more than half of Democrats voting Tuesday called Mrs. Clinton honest and trustworthy, according to early exit polls, a remarkably shaky assessment for the party’s likely nominee. After closing the gap with   white voters in parts of the Northeast last week, Mrs. Clinton lost them by 30 points in Indiana. She also again suffered with   independents casting ballots in the Democratic contest: 73 percent backed Mr. Sanders. Mr. Sanders, speaking to reporters after winning Indiana, had some tough words for Mrs. Clinton after a week when he toned down criticisms of her and shifted his focus to their policy differences. “I understand that Secretary Clinton thinks that this campaign is over,” Mr. Sanders said. “I’ve got some bad news for her. Tonight we won a great victory in Indiana. Next week we are going to be in West Virginia. We think we have a real shot to win in that great state. And then we’re going to Kentucky, and we’re going to Oregon. And we think we have a pretty good chance to win there as well. ” “We feel great about tonight not only in winning here in Indiana and accumulating some more delegates but also gaining the momentum we need to take us to the finish line,” he said, adding the he realized he faced an “uphill battle. ” While Mr. Sanders devoted three days to campaigning in Indiana and spent more than $1 million on television advertisements, Mrs. Clinton did not run any ads and spent only a day campaigning in the state, visiting the Indianapolis area. Clinton advisers said they saw no point in spending a couple of million dollars on television advertising and campaign travel when Mrs. Clinton was likely to lose the state anyway: Its Democratic primary electorate includes a healthy share of independents and newly registered voters, demographics that have repeatedly favored Mr. Sanders. And the two Democrats are expected to divide the state’s 83 delegates given the close outcome. Tad Devine, a senior adviser on the Sanders campaign, said that the Indiana results would not reshape the Democratic race markedly, given Mrs. Clinton’s sizable delegate lead. While the Democratic race has turned relatively civil, the Republican fight in Indiana grew bitter in the final hours. With Mr. Cruz on edge Tuesday morning about the future of his candidacy, Mr. Trump baited him by suggesting  —   with no evidence  —   that Mr. Cruz’s father had joined Lee Harvey Oswald in passing out   Castro pamphlets in New Orleans shortly before Oswald assassinated President John F. Kennedy. Mr. Cruz, unburdening himself after a campaign in which Mr. Trump also mocked his wife’s appearance, responded with a flourish, called Mr. Trump a “pathological liar” and delved into his rival’s personal life. “Listen, Donald Trump is a serial philanderer, and he boasts about it,” Mr. Cruz said, directly raising Mr. Trump’s marital history for the first time. “I want everyone to think about your teenage kids. The president of the United States talks about how great it is to commit adultery. How proud he is. Describes his battles with venereal disease as his own personal Vietnam. ” But the appeal did not work. Indiana Republicans proved willing to embrace Mr. Trump, the once unimaginable but now virtually certain nominee, regardless of the personal flaws and political shortcomings that would have once derailed   presidents.'"}, "time": 1742564597.976024}