{"duration": 0.03837943077087402, "input_args": {"text": "\"  WATCH! Six Communists Arrested After Attacking Trump Supporters, Media Yawns (Video) WATCH! Six Communists Arrested After Attacking Trump Supporters, Media Yawns (Video) November 16, 2016, 1:46 pm by Guest Author Leave a Comment 0 \\nBy: Renee Nal | New Zeal Top row: Jarred Roark, 34 (Left); Taylor Tomas Chase, 21 (Center); Joseph Wayne George, 36 (Right); Bottom row: Samuel Benjamin Lauber, 21 (Left); Jason Peterson, 24 (Center); Jade Tabitha Shackelford, 19 (Right). (Photo: DPS) \\nCommunists from the “ Red Guards Austin ” were arrested after violently attacking Trump supporters during an anti-Trump rally at the Capitol on Sunday night, as reported at a local CBS affiliate . \\nTrevor Loudon is well aware of the violent and “secretive” Red Guards Austin, who he describes as “extreme Maoist.” This communist group, Loudon explains, is “aligned with the Red Guards Los Angeles and the Kansas City Missouri-based Progressive Youth Organization , both of which were heavily involved in anti-Trump protests before the election.” \\nReferring to the arrests, the Red Guards Austin posted the following on Facebook using the code name “Puka” for one of those arrested: \\nA brief perusal of Red Guards Austin Facebook page reveals that this anti-capitalist group is not interested in peace. Advertising an anti-Trump rally last Thursday, they wrote : \\n“Calling all militants. F— the police. Show up if your pissed at this system and lets shut s— down.” \\nThe communist group shared an event for students from the “ Revolutionary Student Front ” (which describes itself as a “revolutionary anti-capitalist student movement” ) scheduled for this Friday night called “‘Not My President’ to ‘No More Presidents!'” which seeks to build “a movement that can create a revolution to end capitalism will burn the oppressive roots from which fascism grows:” \\n“With Donald Trump as president-elect, a lot of us are wondering how we got here and what we can do about it. The Democratic Party won’t save us; even ‘progressives’ like Bernie Sanders and Elizabeth Warren have said they’ll work together with President Trump. Peaceful protest won’t save us ; as Stokely Carmichael said, “Nonviolence only works if your opponent has a conscience. The United States has none.” \\nThe only thing that has stopped fascism historically is an organized anti-fascist fighting force; Hitler was only stopped by the Red Army. The rising wave of fascist movements emboldened by Trump’s presidency can only be countered by an even more bold mass movement of anti-capitalist resistance. Now more than ever, the steps necessary for building this type of mass revolutionary movement need to be made. And only a movement that can create a revolution to end capitalism will burn the oppressive roots from which fascism grows. \\nJoin the Revolutionary Student Front at Jester A203A (tentative) on 6:30 on Thursday, to talk about the concrete steps necessary in building power on campus as working-class students to create a better world and defend each other from the threat of fascism.” \\nThe Revolutionary Student Front supports the Red Guards Austin, according to this post: Red Guard Austin are friends with the Revolutionary Student Front – Austin \\nThe Red Guard Austin’s cover photo on Facebook: Red Guards Austin Facebook photo \\nThe Revolutionarfy Student Front gives tips to protesters who are “new to protests that are more on the disruptive and confrontational side,” such as writing the phone number of the National Lawyers Guild on the protester’s arm before the protest. Not surprisingly, the communist agitators do not discourage violence. \\nWatch a local CBS affiliate report (mildly) on the arrest: \\nThe same communist organization attacked Alex Jones during a pro-life rally in May, 2015. \\nWatch the video here: \\nIt is highly unusual for a local news report to identify “activists” as members of communist groups, although the majority (if not all) of the recent anti-Trump protests are indeed organized by communists. \\nREAD MORE:\""}, "time": 1742628466.7774754}