{"duration": 0.03176760673522949, "input_args": {"text": "'Written by Jonathan Turley   There is a major news development with the release of a letter from FBI Director James B. Comey that the Bureau has decided that new evidence requires further investigation into the Clinton emails. It was a surprising change just days before the election. After all, as recently as September 27, 2016, Comey rejected the idea that the bureau would reopen its investigation into Hillary Clinton’s use of a private email server while she was secretary of state . Comey wrote in a letter to top members of Congress that the bureau has “learned of the existence of emails that appear to be pertinent to the investigation.”I have been critical recently of the handling of the FBI investigation, particularly in the granting of immunity to key potential targets. I recently wrote a column on FBI investigation into the Clinton email scandal and revised my view as to the handling of the investigation in light of the five immunity deals handed out by the Justice Department. I had previously noted that FBI Director James Comey was within accepted lines of prosecutorial discretion in declining criminal charges, even though I believed that such charges could have been brought. However, the news of the immunity deals (and particularly the deal given top ranking Clinton aide Cheryl Mills) was baffling and those deals seriously undermined the ability to bring criminal charges in my view.Wikileaks disclosures have only embarrassed the Bureau further in showing Clinton aides debating how to explain the deletions and how to delay turning over material. Comey now has told legislators that “I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.”He did note that the FBI could not yet assess whether the new material is significant. Comey clearly felt obligated to let the Committees know about the development. In making such a decision, Comey is caught in the horns of a dilemma. The Justice Department strongly discourages investigatory announcements or actions shortly before an election to avoid any claims of trying to influence the outcome. On the other hand, if this is significant, the FBI does not want to be accused of hiding material developments from Congress or the public, particularly after criticism over its alleged different treatment given Clinton and her aides as opposed to other recent cases.In such a situation, caution favors disclosure. It is unlikely that we will see major developments in the remaining two weeks, but the announcement shows that this is not a closed matter. In many ways, the lingering character of this scandal was only worsened by the tactics of Clinton aides in changing explanations and refusals to cooperate absent immunity. That served to delay the investigation, which will now likely extend beyond the election.   JonathanTurley.org . Related'"}, "time": 1742628587.3276665}