{"duration": 0.026911258697509766, "input_args": {"text": "'(Starship Earth) I find this an interesting update from Simon Parkes. It’s hard to know if these “quakes” are intentional or naturally occurring any more. One report says six quakes. Is Rothschild hiding in Grindelwald? Figures. Prime location.\\nSimon says… (pardon the pun)\\nThis afternoon 5 small earthquakes hit Switzerland south of Bern.\\nOne quake was 4.2 on the Richter scale. This is extremely rare for Switzerland.\\nThis earthquake was also reasonably close to Cern.\\nBut also very close to where Jacob Rothchild is holed up.\\nhttp://www.simonparkes.org/swiss-earthquakes \\nhttp://earthquaketrack.com/ch-be-grindelwald/recent \\nhttps://watchers.news/2016/10/25/earthquake-switzerland-october-2016/ \\n\\nThe Earthquakes in Italy…\\n2 powerful earthquakes rattle central Italy 2 hours apart Buildings have collapsed and the power is out in Castelsantangelo sul Nera.\\nhttp://www.earthquakepredict.com/2016/10/2-powerful-earthquakes-rattle-central.html \\nThings are definitely shakin’ these days. \\nAnd something else of note today from my personal perspective… for the first time, I actually heard one of those “emergency broadcasting system alert” tests on the radio. It was 12:29 p.m. Pacific Daylight time. \\nI had just entered a store and a couple of minutes later heard that tell-tale electronic tone, and just to be sure I was hearing what I thought I heard, I went closer to the speaker in the ceiling. \\nIt was your typical test, saying if there had been an actual emergency, a instructions would have followed… and the regular radio programming resumed. I had to laugh because I think I was the only one in the store who heard it. Everyone else seemed oblivious. If the intention is to incite fear… it failed. We passed the zombie test. High five! ~ BP \\nSource: Starship Earth — The Big Picture \\nMore from BPEarthWatch… MUST WATCH! \\nMore from RT News… Chilling images capture destruction as two earthquakes hit Italy (PHOTOS, VIDEOS) With two earthquakes hitting central Italy on Wednesday, social media users were quick to capture the devastation on camera.\\nThe second Italy earthquake has been rated 6.0 by the USGS. Virtually the same spot as the foreshock, which remains a 5.5.\\n— Sean Breslin (@Sean_Breslin) October 26, 2016 \\n\\nThe tremors were strong enough to be felt in Rome, which is over 150 km away and residents reported their homes shaking.\\n“Our village does not exist anymore,” the mayor of Ussita reportedly said.\\n+++ \"Our village does not exist anymore after latest #earthquake \", Mayor of Ussita (Marche) to ANSA +++ #Terremoto #Italy \\n— Antonello Guerrera (@antoguerrera) October 26, 2016 \\n\\nSounds unbelievable, but luckily so far NO ONE KILLED after the latest strong #earthquake in Italy. A few slightly injured #Terremoto \\n— Antonello Guerrera (@antoguerrera) October 26, 2016 \\n\\nSome buildings reportedly collapsed in the area struck by the quakes. However, the damage is believed to be much less than in August, when a major earthquake hit Marche, Lazio and Umbria regions.\\nHundreds of people were killed in the August 24 quake and several towns were razed to the ground in the worst-affected areas.\\nSecond more violent #earthquake hits same region in #Italy . 5.9 magnitude in #Ussita . Mayor says city in panic @inewsmalta #Terremoto pic.twitter.com/dIlW1fc5j7 \\n— Jake Azzopardi (@JakeaAzzopardi) October 26, 2016 \\n\\nSeveral people were reportedly injured in Wednesday’s tremors, officials in the town of Visso said, and several older buildings – including a church – have collapsed. Some areas have lost power, and several roads remain closed.\\nAnother lamp. #Italy #earthquake pic.twitter.com/anZY7ibZ07 \\n— Russian Market (@russian_market) October 26, 2016 \\n\\nIn Castelsantangelo sul Nera, which has around 300 residents, the town’s mayor Mauro Falucci confirmed that there was no electricity.\\n#Earthquake #terremoto buildings collapsing near the epicentre #visso #ussita #Italy pic.twitter.com/DHqzonGl39 \\n— Robin Monotti (@robinmonotti) October 26, 2016 \\n\\nhttps://twitter.com/romatheclub/status/791352862056022017\\nAlthough the US Geological Survey initially stated that both earthquakes reached a magnitude of 5.6 followed by 6.4, the estimates were later lowered.\\nItalian Prime Minister Matteo Renzi has halted all engagements and is said to be following developments, according to Reuters.\\nFacebook has also reportedly switched its Safety Check on to allow users to inform others that they are not in danger.\\n#BREAKING : No injuries or fatalities reported in the #Italy Earthquake earthquakes; Damage reported pic.twitter.com/Qx1Dz1mQPd \\n— Amichai Stein (@AmichaiStein1) October 26, 2016 \\n\\nSource: RT News \\n'"}, "time": 1742628590.5248308}