{"duration": 0.4276256561279297, "input_args": {"text": "'One afternoon last summer at BEAM 6, an experimental program in downtown Manhattan for youths with a high aptitude for math, a swarm of   and    jockeyed for a better view of a poster labeled “Week One Challenge Problem. ” Is there a   number where the first digit is equal to how many 0’s are in the number, the second digit is equal to how many 1’s are in the number, the third digit is equal to how many 2’s are in the number, all the way up to the last digit, which is equal to how many 9’s are in the number? Within the scrum was a trio of   : “Can we work on this during Open Math Time?” one asked. The second, wearing    glasses and dogged by the fear that he did not belong  —   “I’m really not that good at math,” he had told me earlier  —   lingered at the snack cart. “Leave some for the rest of us, J. J. ,’’ demanded the third, gently elbowing him aside. To Mira Bernstein, a BEAM instructor and a leading figure in the extracurricular math ecosystem that incubates many of the nation’s scientists and engineers, the scene was unremarkable, except for one striking feature: None of the children were wealthy, and few were white or Asian. The 76 students, drawn from New York City public schools with   populations, were embarking on a curriculum that they would have to continue on their own during the school year to be eligible to apply for a second, even more intense math summer program, BEAM 7. That application is due at the end of this month, and with it comes a verdict of sorts on their membership in a   subculture where it can be astonishingly difficult to find others who look like them. “This is probably more   black and Hispanic kids than I’ve seen in my whole career,” said Dr. Bernstein, who received a Ph. D. in algebraic geometry from Harvard in the 1990s. “That’s why I’m here. ” The extreme racial homogeneity in the rarefied realm of young math wizards has drawn little attention in a nation where racial equality in the basic institutions of civic life  —   schools, housing, health care, policing  —   remains elusive. But it has become an increasing source of consternation for some mathematicians, educators and business leaders, who see it directly linked to the striking underrepresentation of blacks and Latinos in     jobs in finance, science and technology. As those occupations increasingly propel our society, they fear that enrichment programs for mathematically gifted children, while rooted in meritocratic ideals, have become a particularly potent means of reinforcing privilege. Even as movie audiences celebrate “Hidden Figures,” the story of black women who overcame legally sanctioned discrimination to perform critical calculations in the race to put a man on the moon, educators say that new, subtler obstacles to   math education have arisen. These have had an outsize influence on racial prejudice, they contend, because math prowess factors so heavily in the popular conception of intelligence  —   a concern that recently provoked the creation of “Mathematically Gifted and Black” and “Latin@s and Hispanics in Mathematical Sciences,” websites featuring math professionals from underrepresented backgrounds. “Fundamentally, this is a question about power in society,” said Daniel Zaharopol, BEAM’s director. “Not just financial power, but who is respected, whose views are listened to, who is assumed to be what kind of person. ” BEAM is short for Bridge to Enter Advanced Mathematics, and this, the program’s first year of BEAM 6, for students who had just completed the sixth grade, is what many within elite math circles see as the most promising effort yet to diversify their ranks. The four weeks, spent in a school near City Hall, would be intense: four hours of math a day taught by 10 experienced math teachers, several of them Ph. D.’s. There would be no prepping for standardized tests or effort to cover school material at a faster pace. Instead, as in the elite summer programs that Mr. Zaharopol had himself attended, BEAM focused on the kind of creative   that mathematicians say lie at the heart of the discipline. And because one summer would not be anywhere near enough to equip the BEAM   with the same kind of math preparation as their more affluent peers, the real goal of the founders  —   a mix of   millionaires and professional mathematicians  —   was to hook them enough to want to keep at it. A graduate of the Massachusetts Institute of Technology who suspended his graduate studies in algebraic topology to launch BEAM, Mr. Zaharopol had some idea of what his students were up against. By age 12, many attendees of the highly selective programs on which BEAM was modeled had already won regional math contests and completed online math courses in subjects like number theory. Some had been introduced to advanced math in school honors programs or by math teams. Many were the children of scientists and engineers, or of   parents who turned to math as another way to give their children a competitive edge in the battle for admission to elite colleges. “When I was 6, my dad taught me to use the abacus and do mental math,” one student at a selective program called MathPath wrote on the application form. By contrast, BEAM students come from environments where “math is not in the air,” Dr. Bernstein said. The parents of the boy at the snack cart, Jonathan Jackson, do not have degrees in math or science. His school, Kipp STAR, is a   charter school in Harlem, but does not have a math team. And like many of the other students at BEAM, Jonathan, who is   seemed to have already internalized the racial stereotypes about math that, studies have shown, shape   among young Americans of all backgrounds. “They did a study that shows white kids have more chances,” he said once, remembering a fragment of something he had been told. Then he shrugged, “I don’t know if it’s really true. ” Tracing Jonathan’s path through the program and into the school year provides a glimpse of both how easy it might be to nurture a love of math, and how daunting. It is also a testament to the persuasive power of friendship, unfolding over several months in the context of prime numbers and polyhedron sculptures. Jonathan, who chose J. J. as his summer nickname, had done everything in his power to avoid attending BEAM, which is financed by individual donors and foundations, and is free to participants. Then 11, he was chosen by his school to take the program’s admissions test, and hid the acceptance letter upon receiving it last spring at school. When his mother, Kiana Ashburn, 32, found the letter buried at the bottom of his backpack, she waved off his pleas to go to the karate camp she had signed him up for. “You need to get a good education so you can get a good job and have a good future,” she told him that afternoon in their sparely furnished rowhouse in the Fordham neighborhood of the Bronx. She was all the more certain on the Friday before the program started, when the world awakened to a Facebook Live video of an unarmed black cafeteria worker in Minnesota, Philando Castile, bleeding to death in his car after being shot by a police officer. She often made Jonathan repeat what he was to do if he were ever stopped: “Just do what he says, and like, don’t try to resist,” he recited. She thought of math as a field that “usually Asians dominate,’’ she said. It would not protect him from police violence, she knew, or the other things she feared. Her brother had spent time in prison. “But it could act as a buffer,” she remembers thinking. Ms. Ashburn, a postal clerk who graduated last year with a business degree from Monroe College in the Bronx, left before dawn for work on the first day of camp. Jonathan’s sister, Jasmine, a year older than him, was headed to summer school after dropping off their younger brothers at karate camp. Jonathan walked himself around the corner at 7 a. m. to meet his subway group in what would become a daily routine. Omar Pineda Jr. was the counselor assigned to escort them, but it was Emyr Willis, 11, who broke the ice. “Hello,” he greeted them with the formality they would come to see as his trademark. “I am the both the emissary and ambassador from my school. ” Thays Garcia, also 11, was the group’s third member. “I love math,” she said, her face lighting up when asked why she had agreed to spend her summer doing math problems. Her stepfather, Kevin Rincon, who dropped her off each morning, said he had taught himself algebra while serving a prison sentence for a drug felony. Now an account manager at   Mr. Rincon had several years earlier set Thays up with Khan Academy, a widely used service with free online math lessons. As she breezed ahead several grade levels, her friends gave her a nickname that she proudly took on: “Calculator. ” But Khan, Mr. Rincon also knew, was designed to foster basic math literacy, not “the theoretic understanding of exactly what is going on,” as he put it in his email to BEAM. “I want new possibilities and worlds opened for her to see. ” Jonathan did not know it, but he had placed comfortably in the top half of the students admitted to BEAM, who in turn had been drawn from the top quarter of the 400 nominated by schools or parents to take the admissions test. He had spotted patterns and tried solutions that others had not. He had also placed above grade level on New York’s statewide math test, a distinction shared by only 21 percent of the city’s sixth graders, and just 7 percent of sixth graders who are black. He and Thays and Emyr were exactly the kinds of promising students for which BEAM had been created. But it had not been easy to get it going. Some potential supporters objected to devoting resources to   minority students rather than the much larger group performing below grade level. Others voiced perceptions that reflect common stereotypes  —   including the idea that Asians are naturally better at math than anyone else. Sociologists say that misconception exists in part because a high proportion of Asian immigrants to the United States already possess a   degree. They are, in turn, better equipped to steer children toward advanced math programs, as are   scientists and engineers, who are disproportionately white. In interviews, directors of established elite math programs expressed dismay at the way their own enrollments reflect those patterns. Most are nonprofits with limited money, organized by trained mathematicians for the benefit of students whose passion for math often leaves them at the bottom of social hierarchies at school. Some offer scholarships, but most said it was often difficult to find qualified students from underrepresented groups. “We don’t see many applications from blacks and Latinos,” said Glenn Stevens, the director of Program in Mathematics for Young Scientists, a summer math camp for high school students based at Boston University. “I wish I could tell you it was improving,” said Elaine Hansen, the director of the Center for Talented Youth at Johns Hopkins University. “I don’t see that it is. ”   about 15 percent of the   population under 45, obtained about  2 percent of the Ph. D.’s in the fields of math, engineering and physical sciences awarded in 2015, compared to 18. 7 percent in social work and 7. 3 percent of doctoral degrees in all fields, according to the National Science Foundation. (A total of 20 black graduate students received Ph. D’s in math and statistics, out of 1, 802). Hispanics were only marginally better represented. That means whites and   are the   recipients of the tens of billions of dollars in public funding devoted to research in those fields. It also affects   employment: Both Google and Facebook reported last year that Hispanic and black employees together account for only 4 percent of their technical work force. There are other reasons for career disparities beyond who goes to math camp, of course, like the expense of postsecondary education and an effectively segregated public school system that provides   education to many minority students. But the math divide is growing as more white and Asian parents enroll their children, even when they don’t show a knack for numbers, in online math classes and the weekly math circles that have sprouted on university campuses. And the lack of   experiences for black and Latino students, mathematicians and educators say, makes it harder for even high achievers in good schools to compete for spots at the colleges that serve as a springboard for plum jobs in science and technology. “How do you even know a whole bunch of students are supersizing their education and you’re just doing your homework and getting A’s in your A. P. calculus classes?” said Quinton McArthur, M. I. T. ’s associate dean of admissions. “It’s exacerbated the gap and no one even realizes. ” BEAM was founded in 2011 with help from Sandor Lehoczky, a senior trader at Jane Street and a onetime math team champion, who is known for subjecting job applicants to math puzzles. The math whizzes he hires, he said, have been “swimming in a culture of math’’ from an early age. But BEAM’s selective camp for students from   backgrounds who had just completed seventh grade has had mixed results. “Although our students make tremendous progress,” Mr. Zaharopol wrote in a 2015 grant proposal, “it is clear that many of them, even our highest achievers, are still well below their potential. ” BEAM 6, designed for students who have just completed sixth grade, he said, reflected what they had learned: “We need to start earlier and we need to keep them for longer,’’ he said. At BEAM, Jonathan turned the lights off when he walked in and out of classrooms. He sped from one end of the room to another on his rolling chair, popping in on fellow students who were supposed to be working. He seemed more focused on complaining about the lunch food than zeroing in on logic. “Mathematicians love the struggle,” one of the teachers repeated as a kind of mantra when students complained. “When you feel uncomfortable, you’re learning. ” But whether students like Jonathan were having trouble with the math, were unprepared or were simply not trying was a subject of debate. In their weekly faculty meetings, the teachers often marveled at their students’ progress. “I can’t get them to stop doing math,” said Giselle George, who teaches at a public middle school on the Lower East Side. But teaching advanced concepts to students who had not all had the chance to learn certain basic math skills, like the laws of exponents, proved more difficult than some had anticipated. “I find they’re not very good at   when they’re lost or bored,” said another teacher, Marcelle Good. “I guess they’re used to being lost or bored. ” During the program’s second week, Jonathan was a focus for both their hopes and their frustrations. “How do you get kids who haven’t had the exposure the tools to even realize that math is something they like?” Dr. Bernstein lamented. “He’s engageable,” said Michael Pershan, who teaches   math at St. Ann’s, a private school in Brooklyn Heights. “I vote for upping the mathiness. ” “I’m open to suggestions for how to reach him,” said another. “He’s a pretty big distraction in my class. ” Beyond their views, though, there were signs that Jonathan was finding other ways to connect to math. A few days after the challenge problem was posted in the hallway, he was lingering by the snack cart again when Thays arrived. “Hey, Thays,” he said, brightening slightly at the sight of his commuting partner. He had infuriated her that morning by snapping a   picture of her nostrils with his phone, but had quickly redeemed himself by directing her to the sole empty seat on the crowded train. “You going to try it?” she asked, nodding toward the problem. They both knew she had already solved it. (See how she did it in this quiz it’s question No. 5.) He shrugged, looking sideways at her. “Maybe,” he said. By the second week of camp, Jonathan, Emyr and Thays knew the passcodes to one another’s phones so they could trade games. Thays and Jonathan had a running Subway Surfers phone game competition Emyr sought to inspire the others with his passion for Pokemon Go. But they didn’t share everything. Thays did not divulge, for instance, that her biological father, whom she rarely saw, had canceled plans for a trip she was looking forward to later in the summer. His friends did not know that Jonathan’s father was a subway train conductor whom he had last seen about a year ago, in a chance encounter at the 125th street subway station near his school. Emyr did not talk about the bullies who had tormented him in elementary school. But one day on the subway that week, they talked about Black Lives Matter, a subject that held an emotional resonance, at least for Thays and Jonathan. When it came up, it seemed at first that Emyr had not been able to hear the thread of Thays and Jonathan’s conversation over the subway din. Thays, whose parents and stepfather are Dominican, had been to a protest some months earlier with her stepfather. She had written a poem about it. Jonathan had a vivid memory of the video his mother had shown him earlier that month: “There was a kid in the back of the car,” he said, referring to the death of Philando Castile. Trying to translate, I asked Emyr if he had heard of Black Lives Matter. Emyr’s father is Jamaican, his mother Puerto Rican. “No,” Emyr said. “But it’s true. ” Jonathan, looking up from his phone, took the opportunity to fill him in. “How can you not know what Black Lives Matter is?” he demanded. “It’s about how black people are getting killed by cops and it needs to stop. ” Seeking to lighten the trip home that afternoon, Mr. Pineda asked what they recalled of their day. Thays volunteered the simple riddle Dr. Bernstein had asked in her “Codes Codes Codes” class: “I’m thinking of a number from zero to 15. You have to guess my number by asking me four yes or no questions. ” Then Thays added the problem’s final complication: “How many questions does it take if I’m allowed to lie once?” As they deduced the strategy, they were working up to a harder problem, related to Hamming codes, the   codes that underlie digital storage and communications. “There’s also something called binary,” Thays informed Jonathan and Emyr. The girls she had become friends with in that class had agreed that they were all going to BEAM 7, she volunteered. “What about you guys?” “Of course I’m going to BEAM 7,” Emyr said. “J. J. ?” she prodded. But he was peering into his phone. That Jonathan was one of just a few   boys at BEAM (some of the other black students were the children of African or Caribbean immigrants) could have been a fluke. Or it could have been a reflection of the unique forms of discrimination faced by young   males, even in elementary school. BEAM relies on the schools with whom it partners to select which students to take its admissions test, and teachers, studies have shown, pass over qualified black students for gifted programs at higher rates than for whites and Hispanics. Black boys, said Danny Martin, an education professor at the University of Illinois at Chicago, are most subject to the classroom dynamic he calls “Learning Mathematics While Black. ’’ Along with incarceration rates that are higher for young black men than for any other group, that dynamic may contribute to why black women receive a higher share of bachelor’s degrees in math, chemistry and physics, fields in which men of other ethnicities outnumber women. Whatever the reason, many of the   counselors working alongside the teachers at BEAM were paying special attention to Jonathan. One of them was Christian Henderson, an   accounting major at Siena College, in Loudonville, N. Y. “It’s important to educate a kid like J. J. right now,” he said, “so they know in their head they’re on the same level as any white or Asian or Hispanic kid, before they get a little older and they see other people may not think, you know, that’s true. ” Jonathan’s subway counselor, Mr. Pineda, 22, who is part Honduran and part Dominican, told Jonathan how a professor at Amherst College had mentioned that summer math camp had paved the way for many of his wealthy white classmates, whereas he felt lost during his sophomore year in discrete mathematics. A   student at a Harlem high school where the majority of his fellow students were deemed unprepared for college, Mr. Pineda had taken A. P. calculus and secured admission to Amherst with the help of an organization called QuestBridge aimed at matching underrepresented minority students with   colleges. By most measures, he knew, he was a success story. He had just graduated with a degree in math and Japanese studies. But it still bothered him that his classmates, the “summer math nerds,” as he and a friend had taken to calling them, had zoomed ahead. “You should look at this, J. J. ,” Mr. Pineda said on the Thursday afternoon of BEAM’s second week, leafing through his homework folder to a triangular numbers problem. “I think you’d like it. ” The following morning, Thays collapsed in pain at the Columbus Circle subway station as they were waiting for the A train. Emyr paced. Jonathan patted her arm. Mr. Pineda debated what to do. Her stomach hurt, she said. He tried to reach her parents, then called 911. Another counselor met the boys to take them to camp while Mr. Pineda accompanied Thays to the emergency room. When she didn’t come back the next day, or the next, Jonathan railed at Thays’s invisible presence as he, Mr. Pineda and Emyr made the morning commute. “Thays! I know you’re just at home watching TV!” He also found himself thinking about math on the subway, visualizing a problem with triangular numbers and sifting through their patterns. BEAM teachers had explained it as a combination of math and pocket change: A triangular number is the number of pennies required if you’re trying to make a triangle. For instance, if you want your triangle to have 2 pennies to a side, you’ll need 3 pennies total if you want it to have 3 pennies to a side, you need 6 pennies for a triangle of 4 pennies to a side, you need 10. So 3, 6, 10 (and so on) are called the triangular numbers, and Jonathan was in search of the 299th triangular number. With the help of Marquia Williams, a BEAM counselor who was majoring in math at the State University of New York at Oswego, he figured it out, rewarding her with a stifled grin. After nearly a week away, Thays returned  —   her collapse had been caused by an ulcer that required minor surgery  —   to find Jonathan actually sitting still. He even raised his hand once in a while to offer insights in the class they shared. At home on one of the final days, Jonathan’s sister, Jasmine, sat on the steps of their house. She had been attending summer school to catch up in several classes. “How’s that camp going?” she asked. “Are you still behind in your math?” He was silent for a moment. “You know, I’m not at that camp because I’m bad at math,” he said finally. “I’m there because I’m good at math. ” On the last day of program, the BEAM students gathered in a room to receive a graduation certificate. As their names were called, the counselors cheered. An especially loud one erupted for Jonathan. Mr. Zaharopol made a final plug for the online   class he hoped they would take, which started a few weeks after the beginning of school. Each student received a sheet of paper with information about how to log on. BEAM would cover the cost. They would also receive problem sets in the mail, he told them, and he hoped they would send them back. The application for BEAM 7 would come at the end of the year. Emyr was among many who sobbed as the assembly broke up. A few parents had taken up the invitation to attend, including Thays’s stepfather, but he was under strict instructions to drive home on his own. “She wants to go home with her regular group,” he said, shrugging. On the subway, Thays fished in her bag, pulling out a white envelope that she gave to Omar then another that she gave to Emyr, marked with a drawing of his favorite Pokemon character. “You made a slight mistake with the Pikachu,” he noted. “Their eyes are supposed to be black on white. ” “Where’s my present?” Jonathan demanded, as she chatted with Omar. “Come on, Thays. ” Thays let a few more stops go by before relenting. Jonathan tore open the envelope. “Oh special, special JJ,” she had written. “You are so annoying and rude. You always would get me mad and never stopped bothering me. But you always made the train ride fun. You were such a good BEAM friend and I hope to see you in BEAM 7. ” Jonathan paused for a moment before looking up. “Now if you gave me a Nerf gun, it would be better for everyone,” he said, and put his arm around her. The three exchanged phone numbers. A few weeks later, poring over the surveys the students filled out on the last day, Mr. Zaharopol and his staff could take some measure of satisfaction. “I want to get a Ph. D. in math,” one student had written. Neither of his parents had graduated from college. Jonathan, in his review, recommended to future students that they pack their own lunches. He also wrote: “I learned math they don’t teach me at school. ” The teachers, though, wondered how much they’d really been able to achieve. “They’re extremely passionate, and quick to pick up things,” Mr. Zaharopol said in late October, when the BEAM staff gathered for an assessment. “But how many will stick with it? And are we reaching them soon enough?” As police shootings of black men continued and Donald J. Trump moved into the White House, Jonathan’s mother had started to question her belief in the power of math to provide her son with a buffer. “It’s just shocking that his views are the views of a lot of Americans,” she said of the new president. She had allowed Jonathan to take karate after school, and by the start of winter he had obtained his advanced white belt. Jonathan had not heard from Thays, and he was flagging in the online   class for which he had dutifully signed up. Sometimes his internet service, always erratic, would disconnect during the lessons. “I might not be able to do it for a few weeks,” he told me. “I have homework. ” But Emyr noted that all three of their names were on the short list of students who had sent back at least two correct answers to one of the problem sets that BEAM sent home. And one evening, on the top bunk of the bed he shares with his brothers, Jonathan decided to try Thays again. “Hey,” he typed into his phone. “Who is this?” came the reply. “Jonathan from BEAM,” he replied. “J. J. ??!!” Her phone had been broken, she explained. She hadn’t received his texts. They traded messages, until Jonathan’s mother reminded him that his phone privileges had been suspended. “I am grounded for a week, so this is the last time we will be talking for now,” he typed quickly. When the BEAM 7 applications arrived earlier this month, Thays and Emyr set to work. No math problems this time, just questions, 11 of them. What did she want to achieve in the eighth grade? “I want to get into Bronx Science!” Thays wrote, a reference to one of the city’s most selective public high schools. “I mean who doesn’t?” Why did he want to go to BEAM 7? “To see my BEAM peers,” wrote Emyr, in addition to “challenging my brain. ” Jonathan let his application sit on the kitchen table for a week. He let a long snow day with no school pass without looking at it. If he didn’t want to go, his mother had told him, she wouldn’t force him. He could do karate instead. Last Sunday, he began filling in the blanks. What kind of math did he find interesting? However unwittingly, his answer reflected BEAM’s key lesson: “I find proportion problems interesting because I’ll always be confused,” he wrote, “but I figure out the answer anyways. ” On Monday, at work, his mother put it in the mail.'"}, "time": 1742563339.4586704}