{"duration": 0.2604258060455322, "input_args": {"text": "\"By Gordon Duff, Senior Editor on November 4, 2016 \\nMoscow’s decision to send a fleet of warships, led by the Admiral Kuznetsov aircraft carrier, to the eastern Mediterranean may have saved the Syrian military from getting bombed by the US, according to military expert Vladimir Evseev. Speaking at a press conference at the Rossiya Segodnya news agency press center in Moscow, Evseev, the deputy director of Russia’s CIS Institute, pointed out that Washington had only recently considered the possibility of attacking Syrian government forces, using the pretext of a UN report which alleged that Damascus had used chemical weapons. \\n“We recently lived through a very important milestone which many people did not even notice,” the analyst suggested. “Why was the question raised of the Syrian Army’s alleged use of chemical weapons? The stage was being set for [US] ship-based cruise missile strikes. According to some reports, such a decision was in play…[Western] public opinion was actively being prepared for it.” \\nAs Russian Ships Complete Passage to Med, Moscow is ‘Surprised’ by Western Buzz But the entry of a major Russian flotilla, led by the Admiral Kuznetsov aircraft carrier, into the Mediterranean may been the essential element needed to cool the Pentagon’s appetites, Evseev added. \\n“The presence of our ships [between Algeria and Italy] excludes the possible deployment of a similar NATO naval group in the area. Factually, our ships have closed Syria off. The Russian ships did not appear where they are by accident, and eliminated the possibility of launching cruise missiles from that direction.” \\nThe analyst also recalled that earlier, S-300 systems “were deployed in Tartus” with similar goals in mind, given that they are “capable of addressing not only air-based threats, but ballistic targets as well.” Last week, the contents of a leaked report submitted to the UN Security Council blamed the Syrian government for a chemical attack in Idlib in 2015. Damascus vehemently denied the charges, citing the terrorists’ own regular use of poison gas. \\nMoscow, meanwhile, stressed that more serious evidence would need to be presented before such serious accusations could be leveled. Why Does Media Cover Up War Crimes of ‘Rebels’ in Aleppo? The US and NATO allies, already engaged in a campaign to demonize Syria and Russia over the fight for Aleppo, used the report to pile on to other charges that Damascus and Moscow were responsible for ‘war crimes’ in their operation to liberate Syria from armed militants and jihadists. \\nCommenting on the military situation in Syria, Evseev suggested that together with the liberation of Aleppo, the Syrian military and their Russian allies must make it a priority to surround Nusra Front terrorists in Idlib. “The terrorists must be destroyed, but most likely a process of squeezing them out will take place,” he admitted. If forced to leave Idlib, “the only place for them to go will be Turkey. And here, I would recommend that our Western partners, who currently advise us how to fight in Aleppo, take a moment to think about what will happen to the Idlib militants who end up in Turkey,” the expert noted. \\n“From here, it’s likely that they can then be expected to pay a visit to Europe. This is what Western nations should be thinking about, instead of putting a spoke in the wheel and doing everything possible to interfere in the operation to liberate Aleppo and other Syrian territories.” As far as the situation in the city of Aleppo is concerned, Evseev stressed that “if we continue to wait and prolong humanitarian pauses, there will be no people left in Aleppo. Without air support, losses are too high. It’s necessary to free the city quickly, and to think less about the West thinks about it.” Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Gordon Duff, Senior Editor on November 4, 2016, With 51 Reads Filed under Investigations . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742563466.9099264}