{"duration": 0.07683634757995605, "input_args": {"text": "'By wmw_admin on October 27, 2016 Tara Copp, John Vandiver — Stars and Stripes Oct 26, 2016 \\nNATO on Wednesday solidified plans for deploying combat-ready units to the alliance’s eastern edge, with several member states pledging troop contributions to round out a force of 4,000 soldiers to be spread across three Baltic nations and Poland. \\nThe deployments, set to begin in early 2017, are central to NATO’s effort to reinforce territory in a tense region where as allies were meeting Wednesday, Russian war ships were steaming into the Baltic Sea. \\n“Close to our borders, Russia continues its assertive military posturing,” NATO Secretary General Jens Stoltenberg said at the start of talks among allies. “It is important and it is necessary that NATO responds when we see the substantial and significant military buildup of Russia over a long period of time.” \\nStoltenberg said NATO was monitoring the recent movement of Russian vessels into the Baltic Sea as it simultaneously eyes a Russian battle group patrolling toward the Mediterranean Sea. \\nThe meeting of NATO’s top defense officials is to put into action plans agreed to during the alliance’s July summit in Warsaw for the U.S., Canada, the United Kingdom and Germany to deploy a battalion each. Additional support will be needed from other countries. \\nThe U.S. will serve as the lead nation in Poland, where some troops from the Vilseck, Germany-based 2nd Cavalry Regiment will be positioned. \\n“The United States will lead a battalion in Poland and deploy an entire battle-ready task force of approximately 900 soldiers from the 2nd Cavalry Regiment,” Defense Secretary Ash Carter told reporters in Brussels. \\nThe task force will include a headquarters element, three Strkyer-equipped maneuver companies and a mobile gun system, an artillery battery as well as anti-tank explosive ordnance disposal and engineer capabilities. \\nRomania and the United Kingdom will provide companies to bolster the U.S.-led battalion in Poland, Carter said. \\nThe 2nd Cavalry Regiment will arrive in northeastern Poland by April. \\nThe battalion will be under the tactical control of a Polish brigade, which falls under the operational command of NATO’s top officer, Gen. Curtis M. Scaparrotti. \\n“This is significant, and we are encouraging others to make the same kind of command and control arrangements with NATO,” Carter said. \\nIn addition, the Pentagon plans to rotate a U.S.-based armored brigade to Europe, along with the unit’s tanks and other fighting vehicles, in early 2017. The troops, from the 3rd Armored Brigade Combat Team, 4th Infantry Division, will rotate throughout the Baltics and Poland. \\nGermany, Canada and the United Kingdom will serve as lead nations for multinational battalions heading for Lithuania, Latvia and Estonia. Some forces will begin moving into bases in the Baltics and Poland in January and are expected to become fully operational by June. U.K. Defense Minister Michael Fallon told The Wall Street Journal that British troops would be accompanied by tanks and drones. Countries agreeing Wednesday to augment the forces in the Baltics include Albania, Italy, Poland, Lithuania, Belgium, Croatia, France, Luxembourg, the Netherlands, Norway and Denmark. \\n“Our forces will be truly multinational, sending an unmistakable message that NATO stands as one,” Stoltenberg said. “An attack on one ally is an attack on all.” \\nNATO also is trying to configure a new force in the southeast, where Romania will host a multinational brigade with contributions from neighboring Bulgaria. The unit is intended to facilitate the flow of forces throughout the region, including U.S units that are conducting periodic training exercises on Romanian and Bulgarian firing ranges. \\nThat amounts to a “new land presence in NATO’s southeast,” said Doug Lute, U.S. ambassador to NATO, during a Tuesday news briefing. \\n“Not yet fully completed are plans to also bolster air and sea presence in the southeast. Of course the sea presence here, we’re talking about presence in the Black Sea,” Lute said. \\nHowever, the expansion south will involve troop commitments around the Black Sea region at land, air and sea from several nations, including the U.S., Canada, Germany, the Netherlands, Poland and Turkey, Stoltenberg said. \\nThe expansion of a continuous force presence into the Soviet Union’s old sphere of influence was prompted by Moscow’s 2014 intervention in Ukraine, which allies say altered the security landscape in Europe. NATO’s moves are designed to achieve two aims: reassure allies rattled by a more aggressive Russia and send a signal of military resolve to Moscow that alliance territory is off limits. \\nWhile NATO has emphasized its moves are defensive in nature, Russia sees NATO’s push east to the edge of Russia’s borders as a threat and a provocation. \\nMoscow has warned of countermeasures and earlier this month started moving nuclear-capable Iskander missiles into Kaliningrad, a Russian enclave on the Baltic Sea that is wedged between Lithuania and Poland. \\nWhile Russia has deployed Iskander missiles to Kaliningrad before for exercises, U.S. officials say they are watching to see if the latest move is permanent or if there is any attempt to position nuclear weapons on site. That, Lute said, “would be a change in the security posture in a way that would not promote stability, but would rather continue to raise questions about instability.” \\nStars and Stripes reporter John Vandiver reported from Stuttgart, Germany.'"}, "time": 1742563757.7037268}