{"duration": 0.03488421440124512, "input_args": {"text": "'An anonymous group of   Twitter trolls has convinced the New York State Department of Health to withdraw ads promoting colorectal cancer screening from Breitbart News. [The public service announcement, which ran in an advertising space on Breitbart. com read: “We got screened for colon cancer when we turned 50 and we’re so glad. Click here to find out why. ”  Twitter user “@nastiestwoman” took a screen grab of the ad, and tweeted at the official New York State Department of Health on Dec. 29, urging it to withdraw the ad. Hi @HealthNYGov, did you know you’re advertising on Breitbart? Please pull your ads so they don’t support hate like this. See @slpng_giants pic. twitter.   —   The Nastiest Woman (@nastiestwoman) December 29, 2016,  The department responded the next day, indicating that it had “removed” advertising from Breitbart, without explanation. @nastiestwoman @slpng_giants We were unaware of our ad appearing on Breitbart’s site and it has been removed,  —   NYSDOH (@HealthNYGov) December 30, 2016,  In response, @nastiestwmoan thanked the department and copied the anonymous Twitter troll account coordinating the effort to silence Breitbart: @HealthNYGov Thank you very much!   to @slpng_giants for the list,  —   The Nastiest Woman (@nastiestwoman) December 30, 2016, Colorectal cancer affects upwards of 50 out of every 100, 000 residents of New York State, with higher prevalence within the   and Hispanic communities. Breitbart News reached out to the New York State Department of Health for comment: On Dec. 30, your Twitter account indicated that you had withdrawn advertising for colon cancer screening that appeared on Breitbart. com via a third party. On what basis did you do so? Is it your scientific view that colon cancer does not affect conservatives? The department responded: “By protocol and practice, DOH reviews all advertising placements with the intention of reaching a wide audience. However, this ad’s proximity to an offensive and objectionable discussion necessitated immediate removal. ” Pressed for further detail on what was “offensive,” the department answered: “The comments in the screenshot shared by the Twitter user who brought this post to our attention. ” Breitbart News followed up: “Are you aware that comments appear on a wide variety of news websites?” The New York State Department of Health did not respond. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562335.8165314}