{"duration": 0.10261344909667969, "input_args": {"text": "'Good morning. We’re trying something new this week: California Today, a morning update for our California readers. Tell us what you’d like to see: CAtoday@nytimes. com We like to think of California as the center of the tech universe. But, apparently, all that   has not helped us figure out how to run more efficient elections. Three weeks after the state’s Democratic presidential primary, half a million votes remain uncounted. The final tallies, whenever they come in, are not expected to change the result. Hillary Clinton declared victory the night of the June 7 primary, when she was up by more than 10 points. In videos, in blog posts and on social media, some supporters of Bernie Sanders are pointing to the uncounted ballots as evidence that Mr. Sanders was robbed. Long waits for final totals are not rare in California. Most of the 2. 5 million votes that were not counted by June 7 were   ballots that were not returned until Election Day, or even a few days after. But the vote also exposed “mechanical problems” in the electoral system, said Paul Mitchell, vice president of Political Data, a consulting firm based in Norwalk, Calif. A flood of voters registered right before the election. Many did not receive   ballots until after Election Day, when they were useless. Independents voting by mail also had a hard time getting the right ballots. Both groups were more likely to support Mr. Sanders. Many cast provisional ballots, which take a long time to count because each has to be verified. Since June 7, Mr. Sanders has slightly cut into Ms. Clinton’s lead. She was ahead by roughly 440, 000 votes on election night. Now, it’s 414, 500, or about eight percentage points. Still, it’s a sizable margin. “The Bernie folks have legitimate gripes,” Mr. Mitchell said. “But they’re all going to be resolved when these provisional ballots are counted. ” • Hillary Clinton released her technology policy initiative, which targets young entrepreneurs. It reflects a view that tech should be an engine of equality. • Facebook announced that it will be shifting your news feed away from, well, news, and toward posts by friends. Our tech columnist writes that the company will always prioritize baby pictures over keeping users informed. • American drivers are regaining their appetite for gas guzzlers, unloading hybrid and electric vehicles in favor of bigger cars, pickups and S. U. V. s. • Airbnb is now in disputes with both San Francisco and New York that could end up pushing thousands of illegal listings off the site. The company is in talks for a new round of investment that could value it at about $30 billion. • “An irresistible and indispensable   guide to the new technology establishment. ” That’s our book reviewer’s take on “Chaos Monkeys: Obscene Fortune and Random Failure in Silicon Valley. ” • Visitors to the United States may be asked to voluntarily disclose their social media accounts, a step that is intended to help in screening for ties to terrorism. • “Zoolander 2. ” “Independence Day Resurgence. ” Why are so many sequels arriving many years after the original? We look at the trend. • Paul Draper, the winemaker at Ridge Vineyards, is retiring. Over 47 years at the vineyards in the Santa Cruz Mountains and Sonoma County, he has been lionized as a leading light in American wine. • An initiative to legalize recreational marijuana use has qualified for the November ballot. Just about everyone expects it to pass. [Los Angeles Times] • More than 70 Bay Area news organizations have teamed up to force local attention onto the region’s homelessness crisis. Coverage includes profiles of homeless people, a look at causes and suggested solutions. [SF Homeless Project] • In Washington, the National Rifle Association is an   force. Not so much in Sacramento. [Sacramento Bee] • Scientists have found a bonanza of water beneath the state’s Central Valley. But it still won’t end the drought. [Science] • Koreatown. Little Tokyo. The   corridor. Los Angeles has more ethnic corridors than you can easily count, but one writer has done his best to map them by hand. [Boom] Mission Dolores in San Francisco is turning 240 years old today. The mission is older than our republic itself: the first Mass was held on June 29, 1776, a few days before the Declaration of Independence was signed, and nearly 75 years before California statehood. The adobe church, which the congregation moved into in 1791, is the oldest building still standing in San Francisco. It survived the 1906 earthquake, and the fires that followed. Of the nine missions founded under the Rev. Junipero Serra in California, it is the only one whose original chapel is intact. So what is Mission Dolores  —   as it has long been known, though the official name is Misión San Francisco de Asis  —   doing to celebrate its anniversary? Not much. Though the mission’s website proudly proclaims its founding in June, anniversary ceremonies will not be held until October, the date when official “paperwork was sent from Mexico,” said Gustavo Torres, the mission’s director of development. In the meantime, if you’re in the area, you can still visit the old mission, its cemetery and its gardens, as roughly 300, 000 people do each year. California Today is a weekday roundup that stays live from 6 a. m. Pacific time until late morning. What would you like to see here to start your day? Tell us at CAtoday@nytimes. com, or reach us via Twitter using #CAToday. Follow the California Today columnist, Ian Lovett, on Twitter.'"}, "time": 1742563789.1905222}