{"duration": 0.13329458236694336, "input_args": {"text": "\"November 7, 2016 -  Aleksey Ilyashevich, PolitRussia - translated by J. Arnoldski -  \\n\\n\\nHow has life changed in Donbass compared to before the war? For a person who hasn’t had the opportunity to personally visit the Donetsk People’s Republic, answering this question is not easy. Experts argue themselves hoarse on TV screens and instill the most different impressions in us, ranging from Donbass being paradise on earth to a semi-starving ghetto. Where is the truth? As always, the truth is somewhere in the middle.  \\nOf course, life in the DPR is far from our usual ideas about wellbeing, but war doesn’t change people’s lives for the better. Let’s set aside our usually loaded judgements and look at the problem from the other side. Over the past few years of war, the people of Donbass have encountered processes and phenomena with which they never had to deal in peacetime. Some of them are negative and some are positive, but many are difficult to evaluate. They simply exist, and they often offer a better picture of life in the DPR than dry statistics. What exactly are we dealing with? \\nCurfew \\nIt is very difficult to adapt to curfew, especially for those who returned to the republics’ cities after a lengthy absence, for which they risk spending a night at the local police department. A second violation threatens 15 days of detention. The curfew lasts from 23:00 until 5:00, but by 22:00 all drinking and entertainment establishments are supposed to be closed so that people can make it home in time. A special permit is needed to be on the streets at night. This equally applies to soldiers. \\nPolice law allows law enforcement to act against violators of the curfew very decisively, including up to the use of firearms if necessary. \\nThe curfew has been enforced in the DPR since 2014. Since then, it has only been cancelled once - for last year’s New Year’s Eve. The purpose of such measures is not only protecting citizens, but also preventing the DPR territory’s penetration by the enemy’s sabotage-reconnaissance groups. Most people have already become accustomed to the curfew, but they still don’t stop complaining about it (especially young people).  Without a doubt, the curfew regime has been one of the most tangible changes in the lives of the republic’s population. \\nHumanitarian aid \\nCompared with 2014 and 2015, the role of humanitarian aid has significantly dropped, but it still comes in to help pensioners whose incomes don’t allow them to purchase all the necessary products. However, it is not only pensioners that receive humanitarian aid, as certain humanitarian aid is specifically provided to patients with diabetes, families with young children, and other vulnerable parts of the population. Deliveries are kept streaming in and, as a rule, problems usually don’t arise. \\n\\n\\nHumanitarian aid came to Donbass along with the war and became firmly established as part of life in every home. Today it is difficult to find a family in which no one stands in line to receive humanitarian aid. \\nLines \\nTwo years of life in semi-wartime conditions has brought many difficulties to the republic’s inhabitants. One of the most noticeable is the rise of queues. It sometimes seems like life here has turned into one big line - lines to the bank, lines for humanitarian aid, lines for salaries (stipends and pensions as well), lines at checkpoints, and lines at the customs checkpoint when going to Russia \\nThe main trend in lines in 2016 has been the queues for registering for and receiving passports of the Donetsk People’s Republic. \\nIf the passport office begins to accept citizens at 9:00, then people start forming a queue at 5:00. Even those lines which existed before the war have now become even longer with the exception, perhaps, of shop lines. The state apparatus itself is most often at fault, especially since it is more bureaucratized than before the war. But that’s another story. \\nThe revival of sports \\nThe professional football, basketball, and hockey teams of Donetsk left, so now youth sports are developing much more actively than before. Competitions for young people in different cities of the republic are held with stunning regularity. Caring Russians have contributed to developing sports and the DPR is actively represented and participates in championships in Russia. \\nA recent example: the students sports club called Red Profintern from the city of Enakievo took part in the Russian Taekwondo Cup at the All-Russian Qualifying Tournament for the 2016 world championships of martial arts. Before the war, children never participated in sports at such a level.  \\nChildren play football in a camp for refugees from Donbass in Russia's Rostov region \\nThe authorities of the Donetsk People’s Republic have not bet on sports by coincidence. Maintaining youth in an unrecognized state is possible by opening up a sporting future. There are simply no other effective ways. This explains the rapid development of youth sports. \\nThe republic’s media \\nJournalism in the DPR today is, unfortunately, at a low level. Many Donbass journalists left during the war. The shortage of personnel has been filled by young people who continue to grow into the place of their older colleagues. Nevertheless, the process of forming and developing a republican media is in full swing. \\nFour television channels operate on the territory of the DPR along with several radio stations, and almost every city has an urban mass newspaper. Local media are developing much more actively today than in the prewar period, as often only they can quickly provide reliable information on what is happening in the state.  \\nChanges to school curriculum  \\nCurriculum in schools and university has remained fundamentally the same as it was before the war, but certain changes have occurred. Above all, this affects history. If earlier pupils and students studied the history of Ukraine, then today it has been replaced by the history of the Fatherland. By Fatherland is meant Donbass, which is considered in the context of both Ukrainian and Russian history. \\nSomething similar is occurring with law students, who have had a hard time. For example, in constitutional law courses, they have to study three constitutions at once: the Ukrainian, Russian, and republican ones.  \\nUkrainian language and literature have not been removed. The number of hours of these subjects remains at the pre-war level. The poets and writers are the same. Even Taras Shevchenko and his displeasure with Tsarist policies has been left in the books. \\nBut what has really changed is the situation with admission into universities. If earlier graduates passed the External Independent Testing (similar to the Russian Unified State Exam), then today they have to pass school exams as a result of which they can enroll. The state examinations differ little in assessment though, as the questions are developed according to the same scheme. \\nEducation in the DPR has been declared to have transitioned to Russian standards. But by this is understood rather things of a technical nature, while the content of curricula in secondary and higher educational institutions has undergone only some minor changes. \\nThe quality of roads and streets \\nThe state of roads in the republic, like before, still leaves much to be desired, but the DPR authorities began to handle this as early as 2014. A team of workers laying asphalt is for today’s Donetsk a picture more than ordinary. Even driveways are being repaired. They might not be much better as a rule, but it’s difficult to judge things under shelling. \\nSpeaking of automobile roads in Donbass, they’ve been “unloaded” over the years of war, as there are fewer cars. Their number sharply declined during the spring and summer of 2014, when many owners left personal vehicles outside of the republic or feared to exploit their iron horses - using their positions, some “privatizers” acting in the name of the militia didn’t hesitate to “commandeer” cars. \\nIn 2015, the city gradually started to be flooded by cars again, but the pre-war traffic still doesn’t threaten the republic’s roads.  \\n\\n\\nMore than a little has been said about how Donetsk’s frontline streets are cleaner than streets in peace-enjoying Kiev. There are several reasons for this.  \\nFirst of all, there is the selfless work of public services, whose employees have been under fire and killed or received severe injuries. \\nSecondly, the attitude of the people of Donbass towards their city has changed over the war, so they litter significantly less. Thanks to this, Donetsk’s appearance, as well as that of other cities of the republic, has really changed for the better. \\nThe cleanliness of streets is one of the main positive changes of recent years.  \\nThe ruble zone and Russian goods \\nIn 2015, the DPR introduced the ruble into circulation alongside the Ukrainian hryvnia. On the republic’s territory was declared a so-called multi-currency zone, where purchases could be paid for in hryvnia, rubles, or even dollars. I myself was witness to when a woman bought bread with a $100 bill and the clerk gave her change in rubles. \\nHowever, the Russian currency quickly established a monopoly. Today, all financial transactions on the republic’s territory are done in rubles.  \\nA small mass of hryvnia remains thanks to the workers of Ukrainian enterprises on DPR territory, who are paid their wages in hryvnia. The republic’s transition to a ruble zone is one of the key changes for residents of the DPR. \\nGoods from Ukrainian manufacturers are almost gone from DPR shelves. Instead of them are products from Russia and Belarus. By and large, the Ukrainian blockade contributed to the resulting product vacuum being filled by competitors. As a result, Ukrainian business lost a multimillion dollar market which fell into the hands of the “Moskal” [derogatory Ukrainian slang for Russians - JA]. Another great Ukrainian “victory,” I suppose. \\n*** \\nAs can be seen, life in the Donetsk People’s Republic is complex and not familiar to those who have never lived in a war zone, but it is far from the nightmares described in the Ukrainian media. Local people have learned to live in new conditions in 2 years (even if they haven’t gotten used to it, as you just can’t) and have tried to build the best life possible in every sphere in the republic. \\n\\nPatience, love for one’s native land, and dedication allow people not merely to survive, but to live with dignity despite all the difficulties and problems in the DPR. And there are certainly enough of them, over which people have accumulated more than a few complaints and questions for the local government and the situation overall.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n\""}, "time": 1742628336.1527874}