{"duration": 0.18287038803100586, "input_args": {"text": "'Near the end of his interview with Bill Murray, Howard Stern turned an already somber discussion about missed career opportunities into an existential grilling. “Is there something that you question in your own life,” Mr. Stern asked, “like why haven’t I found that great love of my life?” Mr. Murray audibly exhaled and let a pensive moment of silence pass. “Well, I think about that, I do think about that, that um, you know. I’m not sure what my  —   what I’m getting done here,” he said, sounding like a man questioning his ultimate purpose. Dating seemed like a bad idea, he went on, given that he was such a mystery to himself, and a mystery that he was not very eager to solve. “What has stopped you from getting in touch with you?” asked Robin Quivers, Mr. Stern’s longtime  . “What stops us from looking at ourselves and seeing ourselves is that we’re kind of ugly, if we really, if we look really hard,” Mr. Murray replied. “We’re not who we think we are. We’re not, uh we’re not as wonderful as we think we are. ” As an irregular listener of “The Howard Stern Show,” I found this conversation, which took place in 2014, a bit startling. For years, Mr. Stern was known principally for pushing the limits of taste as the ringmaster of a raunchy circus of pranksters, oddballs and strippers. During his decades on terrestrial radio, his main passions seemed to be, in no particular order, boob jobs, prostitutes, lesbians and flatulence. Introspection and empathy were not fortes. What I didn’t appreciate, until hearing Mr. Murray lay bare his deepest anxieties, is that since settling in to his new home on satellite radio, which he did in 2006, Mr. Stern and his show have gradually taken on an improbable new dimension. Scattered among the gleefully vulgar mainstays are now long, starkly intimate live exchanges  —   character excavations that have made Mr. Stern one of the most deft and engrossing celebrity interviewers in the business and a   stop for stars selling a movie or setting the record straight. “He’s truth serum,” said the comedian Amy Schumer, who has been on the show four times in the last five years. “It’s like you’re under contract to be totally honest in there, and even though it’s being broadcast, it feels super intimate and protected, even though you definitely aren’t. ” By all accounts, the metamorphosis has been slow  —   the result of a combination of therapy, his second marriage, mainstream acceptance and a sixth sense Mr. Stern has about how to evolve with the times. “I couldn’t have done the show I’m doing now 20 years ago,” Mr. Stern said over the phone. “I’ve changed a lot. I’d be sort of pathetic if I’d reached this point in my life and I hadn’t. How else do you have longevity? There are so many guys who started out with me in radio, who have disappeared, because they can’t broaden their view of what entertainment should be, or get in touch with what they find to be exciting and fun and funny. ” Mr. Stern, 62, has not dropped the   material, and the freedom of satellite radio allows him and his crew to indulge an unconditional love for profanity. But he seems warmer now and his interest in people has never had greater depth or range. The interviews give the show a heft that it didn’t formerly have, turning his New York studio at SiriusXM into a destination of choice for those who a decade ago might have steered clear. “Today, if you go on a TV talk show and give a great six or seven minutes, people will link to it, if it’s incredible,” said Lewis Kay, who oversees media for Tracy Morgan, Amy Poehler and others. “But if you kill on Stern, it moves the needle. ” Sometimes the results are concrete. Ms. Schumer’s interview on “Howard Stern” prompted Judd Apatow to seek her out, resulting in a collaboration that produced “Trainwreck. ” But it’s far more common for celebrities to get the amorphous, though palpable, sense that by appearing on the show they have climbed a few rungs on the fame ladder. This has something to do with the fervor of Mr. Stern’s fans, and their ubiquity. “Aside from the fact that millions of people hear you, the cross section of who hears you is what blew me away,” said Ike Barinholtz, an actor and comedian who has appeared on the show three times since 2014. “When you have a head of a movie studio in Los Angeles and a New York City police officer both tell you that it was good when you made fun of Ronnie the Limo Driver,”  —   Mr. Stern’s chauffeur and an   regular  —   “you know you’re dealing with a special entity. ” Revelations on the show sometimes make news, as happened last year when the “Modern Family” star Sofia Vergara discussed the feud with her   over frozen embryos. (All four of the major morning TV shows turned that into a story.) But more often, Mr. Stern just elicits the most interesting version of his visitors, through curiosity, patience and the benefits of huge and   blocks of time. The interviews are too long for anyone to fall back on jukebox answers they’ve been playing for years. Conan O’Brien described himself on the show as “somewhat medicated” in a discussion about his   depression. Lady Gaga talked about the days she used to snort cocaine all by herself, while she wrote music. John Goodman admitted that he turned up drunk a few times on the set of “The Big Lebowski. ” In the era of the   celebrity, where public image is carefully tailored on social media and authentic candor is rare, the interviews are an almost radical rebuttal to the   games and singalongs popularized by Jimmy Fallon on “The Tonight Show” Mr. Stern believes his approach isn’t just better radio, but also better for whatever product his guest is promoting. “If someone comes in and the audience feels like ‘Oh my god, I love this person,’ they will want to see their movie,” he said. “It’s a strange thing to say to someone trained in P. R. but it’s the God’s honest truth. If someone has an hour to sit and talk about their life and at the end they say, ‘By the way, that’s what brought me to this movie, or to write this book,’ it’s such a powerful vehicle for promotion. ” It wasn’t easy convincing Mr. Stern to do an interview about his skills as an interviewer. Initially he said no, and a week later, when he changed his mind, he would talk only on the phone. The irony did not elude him. “But I feel like it’s a bit   for me to participate in this,” he said. “It’s one thing for you to say I’m doing a good job as an interviewer. It almost takes away from it for me to say, ‘Yeah, I am. ’” Mr. Stern started in radio in the   and by 1986 he had a nationally syndicated show, one that would eventually reach 20 million listeners. To his most ardent fans, he loomed so large that he seemed like a lifestyle choice as much as an entertainer. They followed him as he ventured into books,    events, television and film. The government was less enamored and fined him often enough to make him a First Amendment hero. Tired of free speech battles, he signed a five year, $500 million deal with Sirius and started swearing with élan in 2006. Some worried that Mr. Stern would disappear once he went off    radio, and for many he did. But Sirius  —   now SiriusXM, after merging with its biggest rival  —   currently has 30 million subscribers. Exactly how many are listening to Mr. Stern the company won’t say, but his chops as an interviewer are a significant part of his appeal. This is especially true in Los Angeles, where meetings have been known to be delayed because people are sitting in the parking lot, waiting for the last question. “One of the most common conversations I have about Howard is something like, ‘I was stuck in my car because Sia was on,’ or ‘He was finishing up an interview with Jeff Bridges,’” said Jeff Probst, the host of “Survivor” and   Stern superfan. “You start calculating how late you’ll be to the meeting based on where Howard is in his interview. ” It makes sense that the celebrity capital of the world would be so interested in celebrity chatter. “Among showbiz types, being a Stern fan is something like belonging to a secret society,” said Andy Richter, the longtime sidekick of Conan O’Brien. “So when I bump into someone like, say, Jonah Hill, one of us will invariably say ‘Did you hear Stern interview?’  —   and then you fill in the blank of the last big interview he did. ” Stars have been invited on the air by Mr. Stern for nearly as long as he’s been in radio, but most kept their distance. “The show had a reputation for being nutty and off the wall and people didn’t want to be associated with it,” said Jackie Martling, known as the Jokeman, who left the show in 2001, after nearly 20 years. “Once they got there, they found out that the bark was much worse than the bite. ” There were exceptions. Back in 1983, when Mr. Stern worked at WNBC, his interview with Gilda Radner ended with her in tears. At the time, Mr. Stern lacked the emotional I. Q. to pick up signals that his guest was unnerved, until it was too late. Most interviews ended amicably, but you often had the sense that Mr. Stern was more interested in entertaining himself and his crew than making guests look good. Then there were the   that he probably assumed would never appear on his show and whom he didn’t mind ridiculing, in absentia. “I didn’t think you guys liked me,” Madonna said on the air last year, explaining why she had avoided the show for so long. “You said bad things about me. ” Mr. Stern explained to her: “I used to say bad things about everyone. I was angry, quite frankly. I was an angry young man. ” Mr. Stern still claims on the show to be an anxious mess, but he sounds calmer and more content. He plainly roots for all his guests and his questions reflect sensitivities unimaginable even a few years ago. Recently, he asked Tina Fey if “Who are you wearing?” is a sexist question to ask women   at the Oscars. (Nah, she said.) Lena Dunham called him “an outspoken feminist” on “The Tonight Show. ” This is the same guy who, for years, traded misogynistic quips with anyone who was game, including, Donald J. Trump. In a 2005 phone interview, the two rated the looks of the cast of “Desperate Housewives. ” “Would you go out with Marcia Cross,” Mr. Trump asked, “or would you turn gay, Howard?” “She’s got a good body,” he answered. “Just put a bag over her head. ” Pinpointing when Mr. Stern started his deep interview phase isn’t easy. It certainly was after he joined Sirius and it has intensified in the last two and a half years, according to his longtime producer, Gary Dell’Abate. “We never sat down and said, ‘This is what we’re going to do,’” he said. “It was organic. The caliber of guests got a little better, Howard’s research got a little better, publicists out there started saying, ‘Wow, that was a great interview. ’” Friends and fans attribute Mr. Stern’s evolution in large part to his marriage, in 2008, to Beth Ostrosky Stern, a former model who not only has left him lovestruck, but turned him into an animal rescue advocate. Serving as a judge on NBC’s “America’s Got Talent,” which he did for four years, also proved that his days as an outsider scrabbling for mainstream credibility were behind him. “For a long time, he was an underdog, he was always fighting the establishment,” Mr. Probst said. “Being a judge on ‘America’s Got Talent’ said to him, ‘You are deserving, you are legitimate.’ I think it is one reason Howard said to himself, ‘O. K. people really do like me. People really respect me.’ And maybe that chip on his shoulder is gone. ” Therapy has also been key. For years, Mr. Stern was in     psychoanalysis, as he frequently reminds listeners. (He’s since cut back.) Not only has this given him a modicum of inner peace, it has provided him with a set of tools that he uses on guests the way a   safecracker opens a vault. To the extent that Mr. Stern has competitors it is the short list of shows that interview celebrities at length. That includes public radio’s “Fresh Air,” though its host, Terry Gross, has only a fraction of the appetite for the intensely personal questions that are Mr. Stern’s bailiwick. (When was the last time she asked a pop star about groupies?) His nearest rival is perhaps WTF, the podcast of comedian Marc Maron, who fearlessly plumbs the psyches of his guests and has a special fascination with the way parents warp their children. The difference between the two hosts is stylistic. When Mr. Stern sounds like a shrink, he has the physician’s discipline to keep the conversation about the patient. Mr. Maron is more like a fellow neurotic who wants to compare notes in the waiting room. Much of his show is the host elaborating on his own struggles, which by now are pretty familiar. If Mr. Stern has a weakness as an interviewer it’s his tendency to interrupt guests, who sometimes seem one second of quiet away from a breakthrough. This occasionally gives the show an almost prosecutorial pace, and suggests he doesn’t fully trust his audience’s attention span. And in rare instances when a guest isn’t willing to bare all  —   Stevie Wonder comes to mind  —   Mr. Stern can take a little too long to grasp that sex and personal income questions aren’t working. Most of the time, though, Mr. Stern probes exactly where you would if you had the nerve. He asked Bryan Cranston if he wished there had been “  sex scenes” in “Breaking Bad. ” (Answer: yes.) He gave Katherine Heigl time to describe getting snubbed at a restaurant by her “Knocked Up”   Seth Rogen because she had   the movie in a Vanity Fair interview. These   interviews are also strategic, as Mr. Stern has intuited that outrageousness won’t suffice on satellite radio, a realm without limits, and therefore a place where nothing is outrageous. Keep in mind that Mr. Stern could once cause a stir by referring to masturbation on the radio. No set schedule is kept for interviews, which Mr. Stern conducts Monday through Wednesday, the only days he now works, after a contract renegotiation in 2011. To prepare, he and a couple staffers will read and compile notes over the course of days. Mr. Stern might strategize for as long as a week, figuring out what he would want to hear if he were listening. Right before the interview begins, a point man will read aloud the team’s collective jottings. “And then it just sticks in my head and I memorize it,” Mr. Stern said. “I don’t love the process. I get very anxious and uncomfortable because I want it to be so good. I want the audience to enjoy it, I want the performer to feel comfortable. It’s a whole psycho deal. ” While chunks of the show are more grown up than ever, sex and strippers remain a preoccupation. The Wack Pack, an unpaid and rotating cast of eccentrics, still have plenty of time to heckle one another and the staff, though some have been rechristened with less offensive names. (Wendy the Retard is now Wendy the Slow Adult, for instance.) Prank phone calls remain a staple. Not long ago, a Hillary Clinton   called a skywriting company and asked if it would spell out a derogatory slogan about Bernie Sanders’s bathroom habits. Still, the show now includes enough lengthy interviews, delving into enough serious topics, to annoy some longtime fans. They fume on Reddit. They also call the show. Mr. Stern will occasionally put them on the air and let them vent. Enough with the talk about regrets and depression, they will say. We want naked women.'"}, "time": 1742628457.9248726}