{"duration": 0.0374147891998291, "input_args": {"text": "'On Wednesday’s broadcast of CNN’s “New Day,” Obamacare architect and Chair of the University of Pennsylvania’s Department of Medical Ethics, Dr. Ezekiel Emanuel stated that while “costs have gone up,” under Obamacare, “they’ve gone up much more slowly than they did under President Bush, and they’ve moderated. ” He also stated that “young, healthy people” were most of the “losers” under the law.  “I mean, on any one of the three major criteria, how you would evaluate the ACA: Did it improve coverage? Yes, 22 million people got insurance through the ACA. So, that’s a plus. Our uninsurance rate now hovers around 10% and if all the states had expanded Medicaid, it would be even lower. On costs, yes costs have gone up, but they’ve gone up much more slowly than they did under President Bush, and they’ve moderated. For example, under President Bush, insurance premiums for employers went up 80% while under President Obama, they went up 35% a substantial reduction in the growth of healthcare costs. So, cost control has actually been significantly improved. And then in terms of quality, we’ve seen hospital readmission rates within 30 days of discharge going down. We’ve seen improvements in infections in hospitals, in no thromboemboli, no falls. So, whether it’s access, cost, or coverage, the Affordable Care Act has been an improvement. That doesn’t mean it’s been a home run on every one of them, but a significant improvement. ” He added that “in any big piece of legislation, for 300 million Americans, there are going to be some winners and losers. And mostly those losers were young, healthy people who were getting a great deal by the insurance companies, because they were young and healthy. ” He added that “Young healthy families of people who were in their 30s with two young kids, who don’t use a lot of healthcare, got a great deal. But people who needed healthcare didn’t get a great deal. Remember, if we’re going to cover everyone, including people with illnesses, it’s  —   the cost is going to have to be spread out over people. Some people actually, unfortunately, did get price increases. The best solution to the price increases is to moderate healthcare cost growth, and the Affordable Care Act began us on a process to do that, and it is unfortunate that deductibles have gone up. I would note, the Republicans want to increase deductibles even more, and so, that’s not a solution to the problem. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742561822.9500844}