{"duration": 0.06353211402893066, "input_args": {"text": "'THE BEACH AT NIGHTBy Elena FerranteIllustrated by Mara CerriTranslated by Ann Goldstein42 pp. Europa Editions. $13. (Picture book ages 10 and up) Elena Ferrante’s wondrous, newly translated picture book, “The Beach at Night,” is going to shock many Americans, especially those who might want to read it to young children. In Europe, darker picture books are common. Presumably just as the children of Europe willingly eat escargots and tripe stew at dinnertime, they fall asleep to picture books with titles like “My First Nightmare” and “A Visit From Death. ” So Ferrante’s story of a lost doll’s utterly terrifying night at the beach, illustrated by Mara Cerri with a velvety spookiness, didn’t cause a stir when it was published in Italy in 2007. But it will very likely be a different story here. The audio publisher has classified the book, read by Natalie Portman, as for adults. First of all, there is an expletive in the book. That will not go over well with libraries and schools, not to mention with most American parents of younger children. It’s unfortunate because the word Ferrante uses in the Italian edition of the book, “La Spiaggia di Notte,” is “cacca”  —   an innocuous word used by every Italian child and parent, just the way Americans use “poo. ” I can’t figure out why Ann Goldstein, the American translator of Ferrante’s novels, would turn “cacca” into a much cruder   word for “excrement. ” In any case, the passage in which the word appears is disturbing. The lost doll, Celina, is tormented by a mean beach attendant. He taunts her with a cruel song, which Goldstein translates as: Open your mawI’ve [expletive] for your crawDrink up the peeDrink it for meShhh! Not a word. The original Italian is much simpler and more childlike. Clearly Goldstein was trying to make it rhyme in English, but the antiquated phrasing is not true to the   spirit of the original, which translates literally as: “Open your mouth   Eat the poo   Drink the pee,” and so on. Still, poor Celina! Her horror intensifies. It’s a   kind of horror, of course, but something about Ferrante’s abandoned doll, who cannot even move on her own, seems especially vulnerable and helpless before the malevolent universe. A sharp rake approaches ferociously, pushing her into a pile of trash. The beach attendant calls her ugly, and she yells back at him, which makes him emit a   hook from his mouth and stick it into hers to pull out her words. Finding none, he flings her back to the trash pile and sets it on fire. The doll watches as fellow toys start melting. “Mati, Mommy, where are you?” she calls to her owner. “I’m your doll, don’t abandon me. ” She recalls how Mati used to defend her, even when “boys wanted to hit us, kiss us, see our underpants,” and urinate on their feet. In the Italian edition Ferrante uses a babyish word for penises (“pisilletti,” or little peas) that, once again, is not particularly charged in Italian but that Goldstein renders into English with a coarse word American parents don’t use with children. The whiff of sexual predation will also be striking to American readers of picture books. It must be said that while plenty of children have these kinds of upsetting experiences, this is language and behavior that does not appear in American picture books. Just as Celina’s dress starts burning with a “nasty smell,” a wave washes her out to sea. She sinks and feels herself fill with water, falling into a kind of trance  —   a   perhaps? All seems lost for Celina, though she is now in a nice, dreamy state. “How much time has passed?” she asks. “I’m as mute as a fish, a crab, a starfish.   …     How peaceful. ” The final plot turn makes it clear Ferrante means to conjure not a cruel death but its opposite: birth. The hook comes back to yank the doll out of the water, back to the beach. “I’ve barely got time to clamp my mouth around the last remaining word: Mamma,” Celina says. In Mara Cerri’s beautiful, evocative illustration, dawn is just breaking in the dark sky, and the long hook is electric pink and curled like an umbilical cord. A Dark Animal picks up the doll and runs off. It’s the new pet cat that distracted her owner, Mati, when she left Celina at the beach. The girl has been crying all night, missing Celina, and they have a sweet reunion. The doll asks Mati if she knows that she was almost killed. Mati, “who always knows everything, like a perfect mamma,” responds: “I know. ” It is a weird and magnificent sequence that distills many ideas and motifs in Ferrante’s novels, her vision of motherhood as   comforting, terrifying and deathly, all at once. From the book’s first pages, in fact,   Ferrante readers will feel a jolt of recognition: In Ferrante novels like “My Brilliant Friend” and “The Lost Daughter,” lost dolls conjure the intimate, sometimes treacherous bonds between mothers and daughters and friends. At the beginning of “My Brilliant Friend,” a doll is dropped down into a scary cellar. And a doll lost at the beach sets in motion the narrator’s psychological unraveling in “The Lost Daughter,” when the narrator realizes that she herself has taken it. At her rented beach apartment she finds herself dressing and undressing the doll, then playing with it as a child does. She discovers a vile dark liquid inside it, and then a worm, which the doll’s small owner, she guesses, put there to simulate a pregnancy. “The Beach at Night” exists within this same rich symbol system. But is its escalating terror, with its sexual and scatological overtones, too extreme for children? I think that’s a question of cultural expectations about childhood, and about picture books. Europeans see picture books as an art form like any other and don’t worry much about whether a book is “for children” or “for adults” they figure that will sort itself out once the book gets into the world. I don’t know if American children will be shaken by the book itself  —   I agree with Europeans and others who think we are often ridiculous and misguided in our attempts to “protect” children from literary material that reflects the harshness of real life  —   but they will surely be surprised if their elders choose to read it to them. For Ferrante’s   readers, though, this book will be a small delight, another lovely and brutal glimpse of female subtext, of the complicated bonds between mothers and daughters in a cruel and indifferent world.'"}, "time": 1742628426.3920228}