{"duration": 0.03985309600830078, "input_args": {"text": "'by Alliance for Natural Health \\nThey’re concerned the truth will come out about this ubiquitous poison. Action Alert! \\nRecently we reported that the US Environmental Protection Agency (EPA) released a draft report on the carcinogenic potential of glyphosate, the active ingredient in Monsanto’s Roundup herbicide. This was in advance of a meeting in which a panel of scientists would discuss the available data on glyphosate and its potential to cause cancer—but that meeting never happened. It was postponed , ostensibly because the agency was seeking additional experts so there could be a more “robust review of the data.” \\nThe biotech industry is going all out to stop this review. CropLife America , the trade group for the nation’s largest biotech and pesticide manufacturers, strenuously objected to the government reviewing the cancer data, telling the EPA that there is no need to discuss the issue at all! Outrageously, CropLife also called for the removal of any scientist from the panel who has “publicly expressed an opinion regarding the carcinogenicity of glyphosate.” The trade group kindly offered the names of scientists who should be removed from the reviewing panel to restore “impartiality.” \\nThink about that demand for a moment. CropLife wants to exclude any scientist or researcher who has ever published anything on the topic. Any scientific expert would almost certainly have published something on glyphosate—or s/he really couldn’t be considered much of an expert on the subject. It appears that CropLife is attempting to pack the panel with woefully unqualified puppets who will toe the industry’s line. \\nAnd these are only the “official” comments by industry. We can imagine what kind of jockeying is going on behind the scenes. So far, they’ve been able to get the whole thing postponed. \\nIt appears that some in Congress also don’t want the government looking at the cancer-causing potential of glyphosate. Rep. Lamar Smith (R-TX), chair of the House Committee on Science, Space, and Technology, sent a letter to the head of the EPA, Gina McCarthy. He expressed his concern that certain EPA scientists who had been involved in the International Agency for Research on Cancer’s (IARC) report—the one that found glyphosate was probably carcinogenic—might compromise the agency’s ability to “fairly assess glyphosate based on sound science.” \\nLet’s put Rep. Smith’s “concern” in clearer language. EPA scientists conclude that glyphosate may cause cancer, but a congressman says this makes the scientists unable to assess the science fairly. What sense does that make? That’s like saying if you have scientific evidence that smoking causes cancer, you’re no longer able to evaluate the scientific evidence on smoking. \\nWe saw the same crony capitalist tactics with the creation of the FDA’s Pharmacy Compounding Advisory Committee (PCAC). The PCAC will have a heavy hand in determining the fate of the compounding industry, yet the committee is a stacked deck—it has only one member who is an actual compounding pharmacist, and that member cannot vote. \\nThis review must happen, and real experts must be allowed to submit unbiased data and conclusions about the carcinogenicity of glyphosate. As we reported recently , this poison’s potential to cause cancer is only one of many health dangers that scientists have linked to it—and that isn’t even counting the toxicity of the so-called “inert” ingredients that, combined with glyphosate, make up Roundup and other weed killers. \\nWe are all being exposed to glyphosate at much higher levels than predicted by the government. Since Roundup was introduced in 1996, global use of the herbicide has increased fifteen-fold . In addition to farmers having to use increasingly larger amounts of the poison because of weed resistance, they’re drenching crops in Roundup at harvest to make crops dry faster! On top of this, farmers are using an estimated 383 million more pounds of pesticides and herbicides overall because of GM Roundup-ready crops (crops genetically manipulated to withstand Roundup). \\nIn 2013, the EPA actually raised the permitted toxicity levels, declaring that even higher amounts of Roundup were “safe.” We can all guess why and how this happened. \\nThe bottom line: We must not let crony influences undermine the EPA’s review of this dangerous chemical! \\nAction Alert! Write to the EPA and to Congress, and tell them to reject CropLife’s influence and keep scientists who are experts on glyphosate on the panel. Please send your message immediately. \\nRead the full article at ANH-USA.org Products tested for glyphosate.'"}, "time": 1742628574.6885104}