{"duration": 1.6465933322906494, "input_args": {"text": "\"Israeli official secretly visits Dubai: Report ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. Syrian War Report – November 4, 2016: Govt Forces Repel Fierce Militant Advance in Aleppo By South Front on November 4, 2016 …from SouthFront \\nThe Syrian army and the National Defense Forces (NDF) advanced along the Aleppo-Hama highway and seized the two hills – Tell Bazam and Tell Masin – north of the recently liberated town of Souran. Strategically, this offensive may allow the army and the NDF to flank the militant-controlled areas with the center in Latamanah. This strategy could lead to a success if the government forces are able to advance further to the north and to take control of Morek. \\nThe government forces continued military operations in Western Ghouta, targeting Jabhat Fatah al-Sham (formerly Jabhat al-Nusra, the Syrian al-Qaeda branch) and its allies in the town of Khan al-Sheih. Earlier this week, the government forces made an attempt to make an agreement with the militants to allow them to withdraw from the city to the province of Idlib. However, this idea resulted in a falure and lead to further escalation in the area. Yesterday, the army and the NDF seized a key farms northeast of Khan al-Sheih and deployed in a striking distance from the militant stronghold. \\nThe army’s Tiger Forces, the Desert Hawks Brigade and Hezbollah successfully repelled a fiercest attack by the al-Nusra-led militant alliance, Jaish al-Fatah, in western Aleppo on November 3. Both sides suffered some casualties and Jaish al-Fatah used at least 2 car bombs in an attepmt to break the government forces’ defenses. Pro-militant sources report that the ‘opposition’ has destroyed some 4 units of military equipment belonging to the army. At least 1 infantry fighting vehicle and 1 battle tank belonging to Jaish al-Fatah were destroyed. On November 4, the humanitarian took place in the city. However, firefights are ongoing. \\nThe ISIS-linked media outlet Amaq released a footage of an explosion of Russian Mi-35 multi-role combat helicopter near the village of Huwaysis, northwest of Palmyra. the Mi-35 was delivering a humanitarian aid in the area when it was downed because of a technical failure. ISIS militants targeted the landing site with an anti-tank guided missile. The incident took place on November 3. The Mi-35’s crew (2 men) survived the incident and returned safely to the Russian Khmeimim Airbase in the province of Latakia. \\nRussia’s state-of-the-art frigate Admiral Grigorovich, armed with Caliber missiles, set off to the Mediterranean Sea from the port of Sevastopol on November 3. The frigate will join the Russian naval task force off the coast of Syria. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on November 4, 2016, With 2007 Reads Filed under WarZone . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742564543.9253273}