{"duration": 0.03533458709716797, "input_args": {"text": "'Donnerstag, 17. November 2016 Endlich: Esso-Tankstellen bieten jetzt auch veganes Benzin an Hamburg (dpo) - Veganer müssen beim Tanken künftig keine Kompromisse mehr eingehen: Die Tankstellenkette Esso hat heute das erste Benzin in Deutschland präsentiert, das komplett ohne tierische Fossilbestandteile auskommt. Ab sofort ist das Veganbenzin an sämtlichen Esso-Tankstellen für derzeit 12,93 Euro pro Liter erhältlich. \"Für dieses Benzin musste vor 200 Millionen Jahren garantiert kein Tier sterben\", erklärt Florian Barsch, der Vorstandsvorsitzende von Esso Deutschland, bei der Vorstellung des neuen Treibstoffs in Hamburg. Dafür sorgt eine neue revolutionäre Filtertechnik, mit der sich tierische Bestandtteile rückstandslos aus Erdöl entfernen lassen. \"Übrig bleibt dann ein rein veganes Rohöl auf der Basis von prähistorischen Pflanzen wie etwa Algen, Kreidezeit-Avocados oder Jura-Rucola\", so Barsch. \"100 Prozent dinosaurierfrei!\" Veganes Benzin sei nahezu genauso leistungsfähig wie herkömmlicher Treibstoff und garantiert für jeden Wagen verträglich. \"Vielleicht sind Geschmack und Geruch nicht hunderprozentig wie beim Original, aber wir kommen schon sehr nahe dran.\" Gleichzeitig kündigte Barsch an, im Falle eines erfolgreichen Marktstarts von Veganbenzin auch eine gesonderte Variante für Ovo-Lacto-Vegetarier anzubieten, in der beispielsweise Stegosaurus-Eier oder Raptormilch enthalten sind. Schließlich wollen manche Kunden nicht komplett auf tierische Bestandteile verzichten, wenn es ums Wohl ihres Autos geht. Auch aus dem bei der Herstellung des veganen Treibstoffs als Nebenprodukt anfallenden Tieröl soll in den nächsten Monaten ein besonders potenter Kraftstoff mit Barbecue-Aroma (ebenfalls 12,93€/l) entwickelt werden, mit dem Esso vor allem männliche SUV-Fahrer begeistern will. pfg , dan, ssi; Foto unten: Shutterstock Artikel teilen:'"}, "time": 1742563220.7108746}