{"duration": 0.08903002738952637, "input_args": {"text": "'November 8, 2016, 11:00 am A+ | a- Warning   \\nEpisode 60 of my podcast is now posted here (with copious links) and on YouTube . I joked a few weeks ago that Hillary Clinton will not be elected President because “God doesn’t hate America.” And then I woke up on Saturday and learned that John Podesta, Hillary’s grey eminence, has an especial interest in a Satanic artist called Marina Abramović. Later that day, I learned that a DC pizza restaurant called Comet Ping Pong (which is owned by David Brock’s ex-lover) is an especial favorite of the Hillary team and has, shall we say, a sinister take on what constitutes “kid friendly.” \\nAfter such knowledge, what forgiveness? We recorded this show before James Comey announced that the FBI investigation into Hillary’s emails is OFF ON OFF. Hillary’s supporters made a little holiday in their hearts, but I can’t but help think this is too late to save her. There has never been a major-party candidate for President who boasts such a unique combination of incompetence and corruption. The elite and the media are entirely on her side, but of course Wikileaks has revealed that so many members of the MSM can be regarded only as unofficial Hillary staffers, and in the event the people are no longer buying what they are selling. \\nI daresay Hillary has a program, but the MSM has not deigned to inform us what it is. They know that the destruction of the American nation is no longer as popular as it once was, and that Hillary faces a challenger, Donald Trump, who has promised the American people that “Invade the world; invite the world; immiserate the world” will no longer be American policy when he becomes President. \\nSo the MSM has instead instructed Americans that they daren’t vote for Trump because he’s a sexual vulgarian and a big meanie who has engaged in fat shaming. They forget (or at least pretend to) that it was Hillary’s husband, Bill Clinton, who administered the coup de grâce to American public modesty. \\nTrump has a program, one that is expressed powerfully and succinctly in his two-minute YouTube video, “Donald Trump’s Argument For America.” America First. America for Americans, not America for bankers, globalists and the theorists of “Cheap chalupas.” Fancy that. The MSM was roused to fury by Trump’s heartfelt patriotism and accused him of “anti-Semitism.” A serious error. These people have no idea of the force they have unleashed. In asserting that it is forbidden to criticize Jewish malefactors solely because they are Jewish, they have given credence to the most sweeping anti-Semitic conspiracy theories. You hear the words “failed”&“corrupt”& you think, “He means the Jews.” So revealing #Trumpslide https://t.co/TMVJCO4I3G \\n— Kevin Michael Grace (@KMGVictoria) November 5, 2016 \\nThe MSM forgets (or at least pretends to) that Trump is not John McCain or Mitt Romney. He has no interest in virtue-signalling, particularly to those who do not bother to hide their dishonesty and malice. Trump has demonstrated, repeatedly, that he cannot be cowed. \\nThis is indeed an existential election, and I remain confident that America will choose the candidate committed to the American nation. \\nEpilogue: At long last, the Grace & Steel podcast has solved its recording problem. We now employ Audacity (free!) as our primary recording program, with Total Recorder as a backup. Aspiring podcasters, of which there are many, will benefit from the detailed (and illustrated) instructions compiled by my broadcasting partner, Kevin Steel. And listeners to our podcast will discover that the result of our struggle is a profoundly improved broadcasting quality.'"}, "time": 1742562025.4733703}