{"duration": 0.057585716247558594, "input_args": {"text": "'Dienstag, 1. November 2016 Halloween-Horror: Schwer verletzter Junge (9) erhält überall nur Süßigkeiten statt Hilfe Saarbrücken (Archiv) - Pech für den kleinen Timmy (9)! Erst stürzte der Junge am Montagabend aus dem Fenster seines Kinderzimmers im ersten Stock und zog sich eine stark blutende Platzwunde zu. Doch dann kam es noch schlimmer: Als der Neunjährige blutüberströmt und desorientiert an verschiedenen Haustüren klingelte, um Hilfe zu erflehen, erhielt er stattdessen überall nur ein mildes Lächeln und jede Menge Süßigkeiten. Alles hatte wohl damit begonnen, dass der kleine Timmy abends in seinem Zimmer am Fenster saß und anderen Kindern bei ihrem bunten Halloween-Treiben zusah. \"Wir halten nichts von diesem amerikanischen Quatsch\", erklärten die Eltern des Jungen auf Anfrage. \"Deswegen hatte er Zimmerarrest, damit er nicht auf dumme Gedanken kommt.\" Doch der Neunjährige war wohl zu neugierig. Er lehnte sich zu weit aus dem Fenster und stürzte drei Meter in die Tiefe. Dabei verdrehte er sich die Schulter und zog sich eine stark blutende Platzwunde an der Stirn zu. Fast genausogut wie Erste Hilfe: Süßkram Da niemand den Sturz mitangesehen hatte, musste der kleine Timmy sich selbst wieder aufraffen. Völlig desorientiert begann er die Suche nach einem Erwachsenen, traf aber nur auf verkleidete Kinder, die johlend davonrannten, sobald sie ihn sahen. Der Neunjährige begann an Haustüren zu klingeln und verzweifelt stöhnend um Hilfe zu betteln – vergeblich: \"Ja, der Kleine hat gestern bei mir geklingelt\", bestätigt ein Anwohner. \"War ganz bleich geschminkt und blutüberströmt. Außerdem baumelte sein Arm so komisch herum. Tolles Kostüm, aber ein wenig übertrieben für meinen Geschmack. Ich habe ihm trotzdem ein paar Hanutas und so saure Zungen gegeben.\" Später rekonstruierte die Polizei, dass der kleine Timmy an etwa 50 verschiedenen Türen geklingelt haben muss und dabei über zehn Kilogramm Süßigkeiten geschenkt bekam. Außerdem erhielt er fünf ausführliche Vorträge darüber, dass eigentlich Reformationstag sei und wurde dreimal mit dem Gartenschlauch vertrieben. Ein älterer Herr hetzte sogar seinen Dackel auf den verletzten Jungen. Der kleine Timmy wurde heute in den frühen Morgenstunden bedeckt von einem Berg aus Bonbons, Lutschern und Schokolade in einem Vorgarten entdeckt und in ein Krankenhaus eingeliefert. Er befindet sich mittlerweile in stabilem Zustand. Allerdings konfiszierte die Polizei sämtliche Süßigkeiten, da diese laut einem Sprecher \"unter Vorspiegelung falscher Tatsachen ergaunert\" wurden. ssi; Foto oben: istockphoto, Foto rechts: © Jenifoto - Fotolia.com; Hinweis: Erstmals erschienen am 1.11.12 Artikel teilen:'"}, "time": 1742562863.4438047}