{"duration": 0.10876297950744629, "input_args": {"text": "'Though there is still a week until Christmas, “Saturday Night Live” has already seized the opportunity to leave a lump of coal in the stocking of   Donald J. Trump. In its final episode of 2016, “S. N. L. ,” the sketch series and enduring thorn in Mr. Trump’s side, began with a cold open on Saturday that went hard at some sensitive spots for the  : his relationship to President Vladimir V. Putin of Russia, his courtship of Melania Trump, and some of his recent gaffes and cabinet nominations. The show all but dared Mr. Trump to respond on his Twitter account, but he did not immediately do so. The opening sketch once again featured Alec Baldwin as Mr. Trump and Kate McKinnon as his senior adviser Kellyanne Conway. It began with him revealing that he had chosen Rick Perry, the former governor of Texas, to be secretary of energy after seeing him on “Dancing With the Stars. ” “This guy has so much energy,” Mr. Baldwin said as Mr. Trump. “It’s just unpresidented. ” (The malapropism was a reference to a tweet Mr. Trump had posted on Saturday morning, in which he wrote “unpresidented,” which he then deleted and replaced with the correct word, “unprecedented. ”) A   Mr. Putin (played by the “S. N. L. ” cast member Beck Bennett) soon came down the chimney with a Santa sack. He profusely flattered Mr. Trump as “the best candidate” and “the smartest candidate”  —   and “the Manchurian candidate,” implying Mr. Trump was an unwitting Russian puppet. “I don’t know what that means, but it sounds tremendous,” Mr. Trump said. Mr. Putin then gave Mr. Trump an “Elf on the Shelf” toy  —   and instructed him to keep it next to his internet router all year long. “Vladimir, I’m sorry, but I didn’t know you were coming, so I do not have a gift for you,” the Trump character said. “Please, Mr. Trump, you are the gift,” the Russian leader replied. Mrs. Trump (played by Cecily Strong) interrupted to express concern that Mr. Putin and her husband were becoming too cozy. “If a person you did not know came from a foreign country and just started flattering you, what would you do?” she asked. Mr. Baldwin’s Trump responded, “Marry them. ” (Mrs. Trump was born in Slovenia.) Appearing moments later was Rex W. Tillerson (John Goodman, the frequent “S. N. L. ” host and guest star) the chief executive of Exxon Mobil and Mr. Trump’s nominee for secretary of state. He quickly huddled with Mr. Putin to review some plans for oil drilling, excluding Mr. Trump from their discussions. “What are you guys talking about?” the   said. “Don’t worry about it,” Mr. Putin said dismissively. Still, Mr. Baldwin’s Trump tried to inject himself into the conversation. “And then we destroy Vanity Fair, right?” he asked. “Speaking of black and crude, I know Kanye,” a reference to his   meeting with Kanye West last week. Mr. Trump, who hosted “Saturday Night Live” in November 2015 while still vying for the Republican presidential nomination, has lashed out at the program in recent weeks amid its steady caricatures of him. In Twitter posts, he has called it a “boring and unfunny show” and said that Mr. Baldwin’s portrayal of him “stinks. ” During the show’s Dec. 3 broadcast, which began with a sketch that satirized his Twitter habit, Mr. Trump tweeted, “Just tried watching Saturday Night Live  —   unwatchable! Totally biased, not funny and the Baldwin impersonation just can’t get any worse. Sad” Later that week, in an interview with NBC’s “Today” show, Mr. Trump expanded on his criticism. “I hosted ‘S. N. L.’ when it was a good show, but it’s not a good show anymore,” he said. “Nothing to do with me, there’s nothing funny about it. The skits are terrible. ” He added that he liked Mr. Baldwin but “his imitation of me is really meanspirited and not very good. ” Earlier on Saturday, Mr. Baldwin let it be known that he would be returning to “S. N. L. ” to mock Mr. Trump, tweeting a photo of himself in his Trump hair and makeup, as well as a tweet that said, “I won’t  ” (like “unpresidented,” another   malapropism that Mr. Baldwin has previously used when playing the character.) Lorne Michaels, the creator and executive producer of “S. N. L. ,” has not directly addressed Mr. Trump’s criticisms. In a recent interview with The New York Times Magazine, Mr. Michaels said he believes the show speaks to a wide range of political affiliations. “We’ve actually tried to make ‘S. N. L.’ a safe space across the political spectrum,” Mr. Michaels said. As of early Sunday, Mr. Trump had not tweeted about the latest “S. N. L. ” episode.'"}, "time": 1742562994.6644979}