{"duration": 0.22165942192077637, "input_args": {"text": "'\\nThis article was written by Claire Bernish and originally published at The Free Thought Project . \\nEditor’s Comment: While the powers that be are determining the fate of alternative media voices that are now branded under the dubious label “fake news” and blacked out from online search results , it is worth keeping in mind all the disinformation and downright lies that have been perpetrated by the corporate news media – typically hand in hand with a political agenda. \\nWhether it is lies that took us to war, or the perception that a deadly attack was carried out by a certain group, the impressions they create play a significant role in determining world events. Often times, that role is one of deception, ensnaring people into supporting deadly and costly actions – in spite of the true facts. \\nThese misleaders are the fake news, and the fake news problem has helped to ruin this country. \\n5 Times Corporate Media Got Caught Publishing Fake News Causing the Death & Suffering of Millions by Claire Bernish\\nA now-notorious list of ostensibly “fake” news sites — created by a liberal professor, seemingly out of thin air — spread like wildfire online in the past two days and was eagerly reprinted by corporate media presstitutes hoping to vindicate their own failed reporting on the 2016 election.\\nBut branding perfectly legitimate outlets with the same scarlet letter as those devoid of integrity deemed the professor’s list a spurious attempt to defame alternative and independent media — anyone dissenting from the left’s mainstream narrative — as a whole.\\nThis is, in no uncertain terms, a hit list — or, at least, a laughable attempt — and it fits conveniently into the establishment’s burgeoning war on independent media disguised as a battle against fake news .\\nWhen corporate media outlets from the Independent and Business Insider , to the Los Angeles Times and NYMag scrambled over one another to reprint this irresponsibly contrived hit list, they proved yet again a lack of journalistic integrity — the same issue that originally caused regular subscribers to abandon them in the first place.\\nIndeed, in this otherwise unknown professor’s foray into the world of journalism, a glaring mistake was made — the only mainstream outlets making the list were those who had heralded Bernie Sanders as the best candidate for the White House.\\nSuch an obvious attempt to control thought could only be conjured in a totalitarian regime.\\nIn fact, failing to place the exact corporate media organizations on the list, who for nearly a year praised fealty only to Hillary Clinton — and for decades have foisted on the public countless mendacious whoppers — constitutes a comedic lack of honesty. So, to bring that irony front and center, it’s imperative to examine some mainstream lies — most of which had appalling consequences — including the deaths of hundreds of thousands of innocent people in the United States and around the world.\\n1. George W. Bush’s Weapons of Mass Destruction \\nPresident George W. Bush decided to unleash the full force of the U.S. military upon the world in a new policy of war writ large disguised as a war on terrorism following the attacks of September 11, 2001. First arbitrarily designating Afghanistan as its primary victim due to the supposed identities of the attackers, Bush then chose Iraq to feel the wrath, and set out to invade the country following dubious claims Saddam Hussein harbored destructive chemical and biological weapons and was actively seeking far stronger munitions.\\n“Intelligence gathered by this and other governments leaves no doubt that the Iraq regime continues to possess and conceal some of the most lethal weapons ever devised,” the president asserted in a public address on March 17, 2003. “This regime has already used weapons of mass destruction against Iraq’s neighbors and against Iraq’s people.” \\nBush’s assertions were questioned by not only human rights experts, but by U.N. weapons inspectors and countless others — so shortly after the U.S. invaded the sovereign nation, the New York Times took up the slack to fill in the appropriate casus belli .\\nJudith Miller notoriously reported on a source she described only as an Iraqi scientist who had seen several extensive caches of such weapons stored somewhere in the country. American weapons experts, she claimed, “said the scientist told them that President Saddam Hussein’s government had destroyed some stockpiles of deadly agents as early as the mid-1990’s, transferred others to Syria, and had recently focused its efforts instead on research and development projects that are virtually impervious to detection by international inspectors, and even American forces on the ground combing through Iraq’s giant weapons plants.” \\nIn hindsight, Miller’s problematic report turned out to be horrendously flawed , and the Times spent months attempting to backtrack , but the damage — fomenting widescale public support for a war no one wanted the military to undertake — had been done. Years later in 2014, the Times — after much internal strife — again took up Miller’s case, in a series reporting catastrophic injuries U.S. military personnel suffered in handling chemical weapons in Iraq. But that report, and the parroting of it by multiple other mainstream mainstays, failed to fully disclose Hussein had been oblivious to the stockpiles presence — something the CIA had clearly stated in a report .\\n2. Gulf of Tonkin Incident \\nOften, the American mainstream media becomes a de facto government employee, taking the claims of U.S. officials and reporting them as proven fact — and nothing exemplifies this penchant better than reporting on the Gulf of Tonkin incident — perhaps one of most flagrant lies ever dreamed up as a justification for war.\\nOn August 5, 1964, the New York Times reported “President Johnson has ordered retaliatory action against gunboats and ‘certain supporting facilities in North Vietnam’ after renewed attacks against American destroyers in the Gulf of Tonkin.” Additional outlets, such as the Washington Post , echoed this claim.\\nBut it wasn’t true. At all. In fact, the Gulf of Tonkin incident, as it became known, turned out to be a fictitious creation courtesy of the government to escalate war in Vietnam — leading to the deaths of tens of thousands of U.S. troops and millions of Vietnamese, fomenting the largest anti-war movement in American history, and tarnishing the reputation of a nation once considered at least somewhat noble in the eyes of the world.\\nIn 2010, more than 1,100 transcripts from the Vietnam era were released, proving Congress and officials raised serious doubts about the information fed to them by the Pentagon and White House. But while this internal grumbling took place, mainstream media dutifully reported official statements as if the veracity of the information couldn’t be disputed.\\nTom Wells, author of the exhaustive exposé “The War Within: America’s Battle Over Vietnam,” explained the media egregiously erred in “almost exclusive reliance on U.S. government officials as sources of information” and “reluctance to question official pronouncements on ‘national security issues.’” \\nIf due diligence had been performed, and reporters had raised appropriate doubts about the Gulf of Tonkin false flag, it’s arguable whether support for the contentious war would have lasted as long as it did.\\n3. Suppression of brutality perpetrated in Bahrain during the Arab Spring \\nCNN sent reporter Amber Lyon and a crew to U.S. ally Bahrain for a documentary about technology’s role in the 2011 people’s uprising known as the Arab Spring, ultimately titled “ iRevolution: Online Warriors of the Arab Spring ” — but what they encountered instead bore the hallmarks of a repressive and violent regime, and its attempt to filter and censor the truth. Lyon and the other CNN reporters went to great lengths to speak with sources participating in the massive uprising — one the Bahraini government wished to quash at all costs.\\n“By the time the CNN crew arrived,” the Guardian reported , “many of the sources who had agreed to speak to them were either in hiding or had disappeared. Regime opponents whom they interviewed suffered recriminations, as did ordinary citizens who worked with them as fixers. Leading human rights activist Nabeel Rajab was charged with crimes shortly after speaking to the CNN team. A doctor who gave the crew a tour of his village and arranged meetings with government opponents, Saeed Ayyad, had his house burned to the ground shortly after. Their local fixer was fired ten days after working with them.” \\nEven the CNN crew experienced the wrath of the regime, upon showing up to interview one source, the Guardian continued, “‘20 heavily-armed men’, whose faces were ‘covered with black ski masks’, ‘jumped from military vehicles’, and then ‘pointed machine guns at’ the journalists, forcing them to the ground. The regime’s security forces seized their cameras and deleted their photos and video footage, and then detained and interrogated them for the next six hours.” \\nAfter returning to the U.S., Lyon felt it her duty to expose the abuse being perpetrated by the government of an ally nation — but CNN International didn’t agree. CNN U.S. eventually aired the one-hour documentary. Once. CNN International never did — worse, the organization gave Lyon the cold shoulder, ignoring her repeated requests to return to Bahrain, which would have put CNN ahead of the game in reporting government brutality. Its failure to air the documentary and refusal to provide justification for doing so angered seasoned CNN and other mainstream established journalists across the board.\\nLyon met with CNN International president Tony Maddox twice — he first promised to investigate why the documentary wasn’t aired, and then turned against her, warning the journalist not to discuss the matter publicly. Bahraini officials contacted CNN International repeatedly complaining about Lyon’s continued reporting on what she’d witnessed. Intimidation continued until she was eventually laid off, putatively for an unrelated matter.\\nAttempting to save face, CNN International rebuffed the Guardian ’s account and interview with Lyon — but the effort was an impotent justification for the obvious failure of integrity.\\nBut threats for Lyon to remain silent followed her off the job, and when she persisted in exposing the Bahraini regime, as well as the suppression by CNN , the outlet sent a stern warning to halt. Lyon, however, said she had never signed a non-disclosure agreement and would not be pressured into their lies — ultimately walking away reputation in hand — something that could not be said for CNN .\\n4. That time Fox News hired a CIA operative who wasn’t a CIA operative \\nWayne Shelby Simmons made guest appearances on Fox News as a security expert with insider expertise from his work as a CIA operative — for over a decade. However, Simmons had never been employed by the agency — in fact, the imposter’s lies eventually caught up with him and he was arrested and sentenced to 33 months in prison .\\n“Instead of verifying whether Simmons had actually worked for the CIA, Fox News and the Agency allowed him to make fools out of Bill O’Reilly , Sean Hannity , Andrew Napolitano , Neil Cavuto , and everyone at Fox & Friends for over the last twelve years. After building a false reputation as a CIA agent on Fox News, Simmons obtained an interim security clearance when an unnamed government contractor hired him in 2008. Simmons also falsely claimed on national security forms that his prior arrests and criminal convictions were directly related to his supposed intelligence work for the CIA , and that he had previously held a top secret security clearance from 1973 to 2000,” The Free Thought Project ’s Andrew Emett explained .\\nIn other words, mainstream Fox News didn’t bother with journalism at all — proffering fake expertise as the real deal — because the outlet failed the most basic of tasks any hourly wage employer would perform.\\nSimmons’ commentaries weren’t harmless stabs in the dark, either — relentlessly parroting baseless Islamophobic rhetoric to drum up support for the government’s insidious war on terror likely poisoned the minds of thousands of viewers, furthering the already divisive atmosphere in the U.S.\\n5. Vapid anti-marijuana propaganda and the furtherance of the war on drugs \\nAccording to the Drug Policy Alliance, over $51 billion is spent fighting the war on drugs in the United States — each year. In 2015, a striking 38.6 percent of all arrests for drug possession were for cannabis — 643,121 people were arrested for marijuana-related offenses.\\nWhat those figures don’t show are the millions of lives ruined by criminal conviction for the government’s unjustifiable quest to eradicate, demonize, and vilify this beneficial plant. It would be an impossible task to tally the number of families whose homes have been destroyed by SWAT teams searching for marijuana — whether or not police bothered to verify an address . An untold number of others have been slain by police for the same reason.\\nBut worst of all, the mainstream media propagates nonsensical, false propaganda about cannabis to convince the gullible and ignorant among us to equate it with heroin, cocaine, and other ‘illicit’ substances. And while a majority of the populace has seen through such lies, some outlets have obstinately continued the drug war — seemingly of their own volition.\\nOne stunning example occurred in March last year, when Dr. David Samadi made a guest appearance on Fox News to fearmonger the horrors of marijuana and scare the bejeezus out of the viewing audience.\\n“It actually causes heart attacks. It increases your heart rate. And on and on,” Samadi claimed , fecklessly distorting statistics. “We’re seeing in Colorado that we had 13 kids that came to the emergency [room] and ended up in the ICU as a result of overdose from marijuana. Now we have crack babies coming in because pregnant women are smoking this whole marijuana business.” \\nFortunately, the Internet has provided the public with alternatives to these corporate media lies — and as of two years ago, despite these and other claims about pot being a dangerous substance, Pew Research Center found fully 69 percent of the population felt alcohol was more harmful than cannabis.\\n* * * \\nWhile this list presents only a few of the bigger lies of the corporate press, there are innumerable examples of its proud history of actual fake news. Keep these in mind when the mainstream presstitutes rush to reprint a hit list targeting journalists and outlets whose narratives counter the establishment. Indeed, it would be the corporate media — with its vast captive audience — who most deserves to be listed as propagators of lies.\\nThis article was written by Claire Bernish and originally published at The Free Thought Project . '"}, "time": 1742628602.9463923}