{"duration": 0.07655453681945801, "input_args": {"text": "'\\nMy 138th email to my contact list, titled: \\'Dramatic Global Sea Ice Collapse\\'. \\n1. Is my E Year of 2024 (suggested just 2 weeks ago) a tad optimistic?: \\na. Dramatic drop in Global Sea Ice Area: \\nhttps://sites.google.com/site/arctischepinguin/home/sea-ice-extent-area/grf/nsidc_global_area_byyear_b.png \\nThe data has been checked and seems to be fairly accurate/representative. The Global Sea Ice Extent graph is very similar. \\nb. The Arctic Ocean heatwave continues to worsen next week with huge areas having surface air temperatures at or above 0ºC. The apparent increase in Arctic sea ice area is offset by the melting of the underwater ice by warm sea water. Salt sea water freezes naturally at minus 1.8ºC. \\nc. There appears to be scheduled a massive effort next week to atmospherically spray the Siberian area to endothermically cool the air. Perhaps the methane emission from permafrost are causing concern – recent methane peaks reported @ 2633pbb at @ 20,000ft. \\nd. Torstein Viddal\\'s Nov 10 graph of Arctic Sea Ice Annual Average Extent states that, if sustained, the first ice free 365 days would commence in May 2023. \\ne. The first Arctic \"Blue Ocean Event\" (of more than just a few days) will highly likely happen in 2017…then what?… well, listen several times to Schneller Als Gedacht (Faster Than Expected): http://xwer.de/en/sag-008-blue-ocean-event \\nWhy is Arctic Ice and methane so important? Arctic sea water is heating @ 4 times faster than the rest of the world\\'s sea water and the northern hemisphere is currently heating faster than the southern hemisphere; 90% of the world\\'s population and food production is in the northern hemisphere. \\nf. Watch Paul Beckwith\\'s informative \"Arctic Sea Ice Regrowth is Eff\\'ed\" parts 1 and 2: https://paulbeckwith.net \\nWhen I first heard \\'In the Year 2525\\' by Zager and Evans in 1969, I used to say \"At least I won\\'t be around when all that happens\": https://www.youtube.com/watch?v=izQB2-Kmiic \\nI now think I will be, and that we have already reached their year 9595…schneller als gedacht! \\n2. A glimpse into some of the foreign militants in Syria: http://www.globalresearch.ca/erdogans-al-qaeda-mercenary-army-of-uyyghur-chinese-jihadists-dispatched-to-syria/5555297 \\nErdogan is playing a very dangerous game with Russia/Syria/Iran/China and US/NATO/Saudi, and is now threatening to allow 3 million refugees into Europe if he/Turkey does not receive further EU payments (which Turkey has not actually joined yet). \\n3. \"…The earth has received the embrace of the sun, and soon we shall see the results of that love. Every seed is awakened and so has all animal life. It is through this mysterious power that we too have our being, and we therefore yield to our neighbours, even our animal neighbours the same right as ourselves – to inhabit this land\" Sitting Bull. \\n\"Humans have the power to make earth a place of peace, humanity and fraternity. It simply depends on everyone\" Anon. \\n\"Waste no more time talking about great souls and how they should be. Become one yourself.\" Marcus Aurelius (121 – 180). I thought Dane Wigington of http://www.geoengineeringwatch.org and a few others would like that one..! \\n'"}, "time": 1742563207.6307468}