{"duration": 0.08806824684143066, "input_args": {"text": "'Black Christian leaders issue Clinton letter of demands November 03, 2016 U.S. Democratic presidential candidate Hillary Clinton listens as U.S. First Lady Michelle Obama (not pictured) speaks during a campaign rally in Winston-Salem, North Carolina, U.S. on October 27, 2016. REUTERS/Carlos Barria/File Photo \\nTwenty six black Christian leaders have issued Hillary Clinton a powerful letter regarding religious freedom, education, unemployment, abortion and violence decimating their communities. (VERO BEACH, FL) Black leaders slammed Hillary Clinton’s position toward the poor in a letter delivered to her campaign Monday, saying her economic ideas won’t help black communities in crisis and that her social views pose a threat to their religious liberty. \\n“Today in the United States more than ten million people of African descent face a crisis of catastrophic proportion,” it says. “As leaders of the Pentecostal-Charismatic wing of the black church, we are requesting a meeting with you to discuss some of the critical issues in the black community: education and employment, religious freedom, violence, and justice for the unborn.” \\n“How do you justify your unconscionable silence in the face of such destruction of innocent black life? Don’t black lives matter?” they ask Clinton about abortion. \\nThey continue : \\nSecretary Clinton, we are also very concerned about your position regarding unborn children and the black church’s commitment to defend them. In April 2015 in a speech before the National Organization of Women you stated “Far too many women are still denied critical access to reproductive health care and safe childbirth… Laws have to be backed up with resources and political will. And deep-seated cultural codes, religious beliefs and structural biases have to be changed…” \\nFor political leaders to call for changes in citizens’ beliefs is reminiscent of totalitarianism. In our view, such a proposal constitutes a denial of our religious freedom. \\nThe vast majority of black churches hold biblical teaching, which is eternal, as authoritative for doctrine and practice. Abortion is the deliberate destruction of a human life in its most vulnerable state. Biblical principle and natural law, both of which prohibit the taking of innocent human life, compel our concern about the increasing moral complicity with abortion. \\nFor the same reasons that we as black Christian leaders oppose racism, unjust wars, capital punishment and euthanasia, we oppose the violent denial of life to the unborn through abortion. It is our view that human life is a gift of God that we are called upon to protect, nurture and sustain, because we are created in God’s image. Therefore, our opposition to abortion is a logical outgrowth of our view that there must be justice for all. \\nParticularly relevant is the innocence of the unborn child. The Bible places an extremely high value on human life and particularly on the lives of the innocent who are under the special protection of God. Those who take the life of the innocent violate a key biblical principle as well as a fundamental principle of natural justice. \\nAbortion in the black community has had a catastrophic impact. Nationally there are 365 black babies aborted for every 1,000 that are born. Blacks account for roughly 38% of all abortions in the country though we represent only 13% of the population. In New York City, the situation is absolutely dire. \\nAccording to a report prepared by the city’s Department of Health and Mental Hygiene, in 2013 there were more abortions among black women in the city, 29,007, than there were black babies born, 24,108. Both nationally and in New York City, the abortion rates among black women are much higher than among any other demographic group. (This claim has been fact-checked by Politifact and deemed to be accurate.) In New York City more black babies are dying in their mother’s womb than are being born. \\nIn 2008, Secretary Clinton, you took the position that abortion should be rare, and you emphasized “by rare I mean rare.” But Black babies are dying at terrifying rates. \\nHow do you justify your unconscionable silence in the face of such destruction of innocent black life? Don’t black lives matter? What policies would you pursue as president to reverse the soaring abortion rates among black women? \\nOn Monday afternoon, Dr. Jacqueline C. Rivers presented the letter to Clinton’s Brooklyn campaign headquarters requesting a meeting. \\nSignatures to the letter: Presiding Bishop Charles E. Blake, Church of God in Christ, Los Angeles, CA Dr. Jacqueline C. Rivers, Seymour Institute for Black Church & Policy Studies , Boston, MA Bishop Lemuel F. Thuston Vice Chairman, General Assembly, Church of God in Christ Bishop Gideon A. Thompson, Church of God, Boston, MA Bishop Dr. Frank Madison Reid III, African Methodist Episcopal Church, Baltimore, MD Bishop James W. E. Dixon, Baptist Church, Houston, TX Apostle James I. Clark, Jr., Church of our Lord Jesus Christ, Director of Social Justice, Economic & Racial Equality Commission Bishop Tyrone L. Butler, Church of God in Christ, New York, NY Bishop Felton Smith Church of God in Christ Nashville, TN Chairman Linwood Dillard, Church of God in Christ, Memphis, TN Reverend Dr. Jamal H. Bryant, African Methodist Episcopal, Baltimore, MD Reverend Charles R. Harrison, United Methodist Church, Indianapolis, IN Professor Frederick L. Ware Howard, School of Divinity, Washington, DC Reverend Dr. Alonzo Johnson, Church of God in Christ, Columbia, SC Pastor Jamie Perdomo, Iglesia Cristiana Nueva Vida, East Boston, MA Reverend Ronald C. Potter, Jackson, MI Donna Desilus, Azusa Christian Community, Boston, MA Bishop Talbot W. Swan, Church of God in Christ, Springfield, MA Pastor Michael Golden, Church of God in Christ, Hampton, VA Reverend Vernard Coulter, Missionary Baptist Church, Boston, MA Pastor Egobudike Ezedi, Empowerment Christian Center, Boston, MA Malcolm R. Rivers, Seymour Institute, Washington, DC Reverend Dr. Rozario Slack, Church of God in Christ, Chattanooga, TN Reverend Arthur Porter, Church of God in Christ Denver, CO Dr. Jamal D. Hopkins, Pasadena, CA Reverend Mark V. Scott, Azusa Christian Community Boston, MA'"}, "time": 1742561839.4361162}