{"duration": 0.035085201263427734, "input_args": {"text": "'An   event at Georgetown University that took place on Saturday featured professors and activists discussing how the left can best “resist” Donald Trump during his presidency. [The event, which was entitled, “Resisting, Organizing, and Building in the Age of Trump,” featured professors and activists who are concerned about America’s future under   Donald Trump.  The description from the event’s Facebook page claims that the event was a discussion on how the left can ensure the freedom and dignity of all individuals during a Trump presidency. The stakes of this political moment couldn’t be higher. We need to collectively think through how we can best respond, resist, organize, and build a future that guarantees the freedom and dignity of all during the next four years of Trump’s presidency and beyond. On January 14th, Georgetown doctoral and law students will hold a   at Georgetown University bringing together DC   and academics from across disciplines to discuss the nature of the relationship of Trumpism to racism, bigotry, and oppression in all its multifaceted forms and the urgent question of how the left should move forward. “The Georgetown administration is not your friend,” argued campus employee Josh Armstead of UNITE Here Local 23, which represents hotel, gaming, food service, and airport industry workers. Armstead claimed that Georgetown’s administration benefits from “prison labor. ”  The discussion segments frequently mentioned topics of privilege, systematic oppression, and stereotyping. George Washington University Philosophy Professor Vanessa Wills defined oppression as an “exclusion from full personhood or society based on identity. ” Jessica Lee, a program director at the Center for Social Justice at Georgetown, suggested that   students need to check their privilege. She said that students need to understand their privilege so that they know when it is appropriate for them to speak up. Others complained about the electoral college system, suggesting that Donald Trump will be an illegitimate president. Georgetown History Professor Joseph McCartin claimed that America is “facing a crisis of democracy. ” Tom Ciccotta is a libertarian who writes about social justice and libertarian issues for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com,  '"}, "time": 1742562301.466511}