{"duration": 0.08287286758422852, "input_args": {"text": "'Home This Month Popular 6 Things Indian Guys Have To Understand When Learning Game 6 Things Indian Guys Have To Understand When Learning Game February 3, 2013 164 Comments Culture \\nAs a guy of Indian ethnicity there are some obstacles you have to overcome in order to have a balanced game. Circumstances can dictate what these are but following my last post a red pill infused Indian pal of mine and myself had a conversation about what these obstacles are: 1. Let go of limiting beliefs about being an Indian in the Western world \\nWhat do I mean by “limiting beliefs”? There is a particular mindset among Indian guys that they can only get with Indian girls. You must let go of these fears dictating that your ethnicity holds you back in what you can do. Being Indian does not mean you have to work in IT, accounting, business, construction or own a corner shop as in the same way it does not mean you have to date Indian girls. 2. Let go of your mummy’s sari \\nIt’s something I’ve noticed among the large Indian community here in London: there are a large number of mummy’s boys, men who are afraid to stand up to their mothers and what they want themselves. No one wants to disrespect their parents but also at the same time standing up for what you want should be your primary objective. Many a man will ‘settle’ with their girlfriends due to pressure from their mothers. As one acquaintance said, he preempted conflict by just doing what his mother wanted, even though he does not love the girl he married. 3. Let go and expand beyond your Indian comfort zone \\nYour extended family plays a large part of your life (not a bad thing), but a lot of guys also have their friends circle exclusively Indian. Expand your knowledge, gain new friends, travel, and learn new languages. It’s a difficult transition to move from becoming over reliant on this little setup to independence from all influence, but it can be done and it will benefit your internal well being. The thing to remember is you are the average of the five people you spend most of your time with. It is highly likely none of your existing five friends will agree with your path into game. They will tell what is ‘best for you’ but in essence this is them subconsciously pulling you back down to their value as you increase your own. 4. Stop putting white women on a pedestal \\nWhite women are easy, white women are fun, white women are flirts, white women are great at sex or white women are sluts. Whatever white women are, as an Indian guy you must stop putting them on a pedestal for being all these sexually related things that you think Indian girls are not. There is no magical things that white women do that others do not. Besides, there is not a certain place in the world where white women will see you and jump on your cock as there is not a certain Bollywood film that will make a white woman gush all wet and demand you ravage her Aryan style. White woman pedestalization can be categorized as an inferiority complex displayed by Indian men. Stop thinking you’re inferior to any woman regardless of her ethnic/racial origins. 5. Understand that Indian girls are not different and are not more chaste \\nBeing constantly around these Indian girls at family gatherings, community events and religious events makes you programmed into believing that you will marry one for certain because of their chaste and low promiscuity. A strong belief that Indian girls don’t ride the cock carousel is blind faith because they do. In fact, all women in the western world do regardless of culture and their strong family traditional values. They are women, they get pussy tingles to the same game as white, black, Asian, orange, maroon and kiwi women. They have the same subconscious processes as all women that help them place a value on a man and inevitable slamming and spunk gobbling if he passes with flying colors. In a Western society these girls have the same external pressures and influences that appeal to their inner slut as much as any other woman. Your objective as a man is not to fall into the line of romantic thinking that they are different. 6. Do not be afraid of The Man \\nThere’s a man, a dominant man, somewhere in your family. He dictates, he dominates, and he makes the decisions. You have a fear of causing him displeasure. You do as he says as he’s done the leading since your father emptied his ball sack into your mother. Stop. As much as a lot of Indian men have pressures from being mummy’s little lad, there’s plenty of them that disintegrate under the pressure of their fathers or uncles. Avoiding conflict is prevalent in your attitude, you do as you are told even though your mind is telling you this is not in your interest and possibly not in the wider interests of those close to you but you do it, as Uncle or Dad has told you to. \\nNo one is telling you to fight, but start slowly, speak out, say what you think is best for you, get out of your shell and decide how you will live your life, not how Dad thinks you should live your life. You might be scared of the conflict and dissuade yourself from it but trust me when you finally grow some balls and exude some confidence and ability in yourself, these men will respect you, see you as equal, and place trust in your decisions. \\nThis list could also apply to other cultures who follow similar dynamics to Indian culture, but don’t stop at the above and think that’s all you have to do—you still have to hit the ground running and approach just like any other guy learning game.'"}, "time": 1742562804.02383}