{"duration": 0.058666229248046875, "input_args": {"text": "'House Intelligence Committee Chair Rep. Devin Nunes announced Wednesday that members of President Donald Trump’s transition team, including the   were “incidentally” surveilled by the intelligence community, additional names of the transition team were “unmasked,” and that the information was not obtained in relation to Russia. [Nunes recalled his recent confirmation that information on members of the Trump transition team had been incidentally collected by the intelligence community on numerous occasions. “Details about U. S. persons associated with the incoming administration, details with little or no apparent foreign intelligence value, were widely disseminated in intelligence community reporting. ”  “Third, I have confirmed that additional names of Trump transition team members were unmasked,” said Nunes. When later asked by reporters if the President was also included in the incidental collection of information, Nunes replied, “Yes. ” In response to another reporter, Nunes said “it’s possible” that Trump’s personal communication was collected. Rep. Nunes later went on to say of “dozens” of reports he has seen thus far, “I have seen intelligence reports that clearly show that the   and his team were, I guess, at least monitored and disseminated out in intelligence in what appears to be  …    intelligence reporting channels. ” He added that he is, however, awaiting further information. The representative’s fourth point was emphatic, “  …    none of this surveillance was related to Russia or the investigation of Russian activities or of the Trump team. ” He made clear that the House Intelligence Committee will investigate surveillance of Trump associates and subsequent dissemination of information gathered. He stated that the goal is to determine: Who was aware of it, Why it was not disclosed to Congress, Who requested and authorized the additional unmasking, Whether anyone directed the intelligence community to focus on Trump associates, Whether any laws, regulations, or procedures were violated, Nunes said that he believes the collection was done legally, but questions remain as to unmasking and the dissemination list of information collected during the transition during the months of November, December, and January. Rep. Nunes characterized the information that was collected as “A lot of it appears like it was  …    it was essentially a lot of information on the   and his transition team and what they were doing. ” He said he has asked the Directors of FBI, NSA, and CIA to “expeditiously comply” with his March 15 letter and provide a full account of such surveillance activities. Nunes called the NSA very, very helpful. He expects additional information to come on Friday. Rep. Nunes said he has not seen any information that has anything to do with Russia or the Russian investigation. He said that while he expects more information and did not make an absolute determination on how the information was collected, “It was not criminal, it was normal, foreign surveillance is what it looked like to me, but let’s wait until we get all the information. ” “This appears to be all legally collected foreign intelligence under FISA, where there was incidental collection that then ended up in reporting channels and that was widely disseminated,” said Nunes. Rep. Nunes said he was surprised and alarmed by the discovery of this information, “because we went through this about a year and a half ago as it related to members of Congress  …    ” Nunes stated that he would travel to the White House in the afternoon to share the new information he has with President Trump. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742628338.3590841}