{"duration": 0.1554417610168457, "input_args": {"text": "\"Turkey, Syria & Russia proving cooperation possible - Yasar Yakis, ex-Turkish FM Published time: 26 Oct, 2016 17:36 Edited time: 26 Oct, 2016 17:37 Get short URL Former Turkish Foreign Minister Yasar Yakis at the 13th annual meeting of the Valdai International Discussion Club in Sochi © Nina Zotina / Sputnik Journalists, politicians and academicians have descended upon the Russian Black Sea resort of Sochi for the 13th annual Valdai International Discussion Club at a time of deepening political fractures between Russia and the West. \\nRT spoke on the sidelines of the event with Yasar Yakis, former Foreign Minister of Turkey, for his opinion on a wide range of issues, including Russian sanctions and the ongoing Syrian conflict, which has driven a wedge between Russia and the US-led coalition. \\nLater in this section, RT also talks with Wolfgang Schussel, former Federal Chancellor of the Republic of Austria (2000-2007). Russia not to blame for Ukraine crisis and sanctions won't work (Op-Edge by John #Mearsheimer ) https://t.co/BlykHOfU4o #UChicago #Valdai — RT (@RT_com) 26 октября 2016 г. \\nRT: The Turkish–Russian relationship has had a lot of ups and downs over the last year or so. How do you see a future of the relationship particularly now with the regards to solving the Syria conflict, and now that the relationship appears to be at a better level than it was last year? \\nYasar Yakis: I knew that the Syrian crisis may help the Turkish–Russian relations to improve, because there are areas of cooperation. So far, Turkey and Russia agreed to cooperate on several specific questions. Both during the visit of President Recep Erdogan to St. Petersburg, and also during the recent visit of President Putin to Istanbul. \\nAlso at a later stage they talked on telephone to each other – I think it was exchange of concessions, if we may say so. Turkey was asked by Russia whether Turkey could mediate in order to persuade some of the opposition factions in Turkey to withdraw from Eastern Aleppo. If Turkey could do it, it would be a good service to Russia. And in exchange for it, I guess at least, Russia agreed to show understanding to the measures that Turkey is taking in the north of Syria in order to prevent the Kurdish factions to link the two Kurdish cantons. This is a new area of cooperation. \\nThe third area of cooperation is more specific, in my opinion. Now with the Kurdish question in the North of Syria, becoming more important than whether Bashar Assad should remain [in power] or not, because Turkey’s position at the beginning was that first priority has to be given to Assad to step aside, whereas now the Kurdish question has become more important, and which also requires that territorial integrity of Syria has to be preserved. If the Kurds declare their independence or autonomy, then the Syrian territorial integrity will be jeopardized. \\nSo Turkey is moving from: ‘Bashar Assad is going first’ to 'preservation of the territorial integrity of Syria' is a big step. At this point, Turkey’s national interest and the Syrian national interest are overlapping, they are coinciding. And Russia is also in favor of the preservation of the territorial integrity of Syria. These three countries can cooperate. Turkey has now a national interest in cooperating with Assad (…) \\nRT: There has been some discussion in the West about new sanctions being put on Russia, in particularity because of Aleppo. They have been rejected for the time being. Do you view sanctions as an effective measure of achieving foreign policy goals, or should dialogue always come first? \\nYY: Armed conflict is the worst thing. When armed could be avoided, the confrontation could be avoided by sanctions, it may be preferable; but no sanctions at all is the best. For the Aleppo question, the truth is not yet cleared out – who was wrong and why the ceasefire has collapsed etc. We do not know. We’re still waiting for a neutral body to find out what exactly happened in Aleppo and how the ceasefire collapsed. Before ignoring all these details, I don’t think that we should talk about the sanctions. And if possible the international community should not resort to sanctions, because it makes the tension in the international relations more acute. Tool to 'preserve the peace': #Valdai Club hosts intl speakers as tensions peak between Russia & West https://t.co/1pLwoD8HQZ — RT (@RT_com) 25 октября 2016 г. \\nRT next spoke with Wolfgang Schussel, former Federal Chancellor of the Republic of Austria (2000-2007).RT: A new round of sanctions against Russia was rejected for the time being. However, the old ones remain in place. How do you see the future of those relations between Russia and the EU? Do you expect the sanctions to be lifted anytime soon? \\nWolfgang Schussel: I think the most important element was last week’s summit in Berlin with Chancellor Angela Merkel, President [Vladimir] Putin, President [Petro] Poroshenko, and President [Francois] Hollande to find solutions or a road map for Ukraine to extend the ceasefire in Syria, and to recreate a kind of a feeling that a military solution is not possible neither in Ukraine, nor in Syria, or Iraq. What is needed are trust-building measures; a road map to bring about those units who are fighting against each other; to extend the ceasefire; to create an element where the relevant global and regional partners are sitting at the same table and finding a solution. This is the most important thing. The sanctions are always symbols. The symbol will remain. I am sure there is no short-term solution for that, because the problems as such are not disappearing. What is needed today is a return to the good old, as we say it in German, ‘Realpolitik.’ The soft power, economic development, the economic assistance, and diplomacy. This is the most important thing. \\nRT: You mentioned the conflicts in Iraq and Syria. There are currently two operations going on: in Mosul – carried out by the Western-led coalition, and in Aleppo – by the Damascus government and Russia. While the first one is being praised in the western media, saying that any civilians killed in Mosul is just 'collateral damage,' whereas in Aleppo, Russia is being accused of actual war crimes repeatedly by Washington and some others. Why do you think there are such two different narratives here going with these two operations? \\nWS: The main difference in Mosul – everybody is fighting and united against ISIS. This is quite clear. This is the common enemy, because what ISIS did in the last three years was terrible. They expelled, tortured, and killed civilians, mostly all the Christians had to leave the country, a country where they lived for centuries. The oldest part of identity and the Christian communities were living in these parts. And all of these parts are destroyed by ISIS. I hope, and I am not an expert what is really going on in Mosul there will be as few as possible civil causalities. \\nIn Aleppo, there are also radical parts, that is for sure, but also some other factors (...) I don’t deny the attempt of Russians to support President [Bashar] Assad – you can agree with that, or you can disagree. I think a military solution will not be possible in Syria. This is the difference with ISIS. In my opinion it is not helpful always to ask for regime change, but what is needed is to find a political solution to avoid civilian casualties. This is de facto today a very negative scenario. \\nRT: In around two weeks we’ll found out the result of the US presidential election. Regardless of which candidate ends up in the White House, how do you see relations between the triangle of Russia, the US, and the EU evolving? And how do you feel cooperation over the key issues, such as the Minsk agreements and Syria will change after November 8? \\nWS: First of all, I have seen a lot of very emotional election campaigns in American recent history – this is not the only one and not an outstanding one – this is a fight. This is a very personal fight, a very emotional fight. Whoever wins, foreign policy is more or less stringent and a continuous effort [for] all the major players: in America, in Russia, in Europe, in China. Everybody knows the problems, everybody knows the restrictions, the limits of power; nobody can act alone. I think what happens is the return to normal policy, to Realpolitik where the global players: America, Russia, China and Europe are sitting together, inviting also the regional partners to find cooperative ways, to find cooperation instead of confrontation. That is the only way. I think after the November elections, the Americans will return to normal business. The statements, views and opinions expressed in this column are solely those of the author and do not necessarily represent those of RT.\""}, "time": 1742561879.224023}