{"duration": 0.13240599632263184, "input_args": {"text": "'For two years, a group of families in Newtown, Conn. quietly laid the groundwork for a legal case against the maker and sellers of the assault rifle that on Dec. 14, 2012, claimed 26 lives  —   and shattered their own  —   in less than five minutes. The shooting at Sandy Hook Elementary School was carried out with an   a   assault rifle that has surfaced in recent mass shootings, like Aurora, Colo. and San Bernardino, Calif. On the eve of a hearing to determine whether the lawsuit can proceed, a rifle similar to the   was used yet again  —   in an attack early Sunday at a gay nightclub in Orlando, Fla. ,the deadliest shooting in American history. The legal challenge faces long odds, and a key hearing next week will determine its future. But the lawsuit has already progressed further than many had expected  —   a Connecticut judge has set a trial date and has ordered the defendants to turn over documents  —   and no matter the outcome, it represents a muscular campaign against the powerful gun industry. The lawsuit seeks to overcome the broad immunity given to gun makers and sellers under a 2005 federal law, protecting them from liability when guns are used in a crime. But there is a small window for holding companies accountable, including instances of   negligent entrustment, in which a gun is carelessly given or sold to a person posing a high risk of misusing it. The 10 Newtown plaintiffs argue that the   is a weapon of war  —   its cousin, the   was the rifle of choice in Vietnam  —   and therefore should never have been marketed to civilians. They say, in effect, that the availability of a   weapon capable of inflicting such rapid carnage constitutes such negligence. “The novelty of the approach is that it doesn’t depend upon an argument that the manufacturer knows that a particular shooter is a   buyer,” said Heidi Li Feldman, a professor at Georgetown University Law School, who has followed the Newtown litigation. “The novelty is that it substitutes the general public for a particular individual. ” The timing of the attack in Orlando, where 49 people were fatally shot, may invigorate and inflame the legal challenge against the gun industry.   advocates and victims’ rights groups have embraced the case as a way to knock down stalwart gun protections, while gun makers and dealers are watching the case intently. Eighteen months after it was filed, the lawsuit  —   naming the manufacturer, Remington the wholesaler and a local retailer  —   is still in the early stages. But the case has not yet been tossed out of court. Even some plaintiffs were startled when Judge Barbara N. Bellis of State Superior Court, who has yet to rule on a final effort to quash the case, set a trial date  —   two years from now  —   and ordered the defendants to disclose marketing materials and other internal documents. Also central to the case is the way that gun makers and dealers promote assault rifles. Just before a hearing in April, Bill Sherlach, whose wife, Mary, a school psychologist, was killed in the Sandy Hook shooting, said he was eager to see company memos. “We look forward to the discovery process, where we can see what goes on behind the curtain,” Mr. Sherlach said outside the courthouse in Bridgeport. The defendants have been vigorously seeking to have the lawsuit thrown out, and they have one last chance at a hearing on Monday in which both sides will make their cases. The judge has until October to decide whether the case will go to trial. The gun companies had asked Judge Bellis to delay the discovery phase until she ruled on the defendants’ motion to strike the case. The judge denied the defendants’ request, saying that the plaintiffs had waited long enough and that the parties should start exchanging information immediately. The Sandy Hook families’ legal team has requested numerous documents relating to the marketing of the   as well as the companies’ desired customer base and use of video games for promotion, among other things. Mark Barden recalled watching his wife, Jacqueline, at the computer in the first weeks after their    son, Daniel, died in the 2012 shooting. “She was trying to research how the kid around the corner got his hands on a military rifle designed for combat,” Mr. Barden said, “and carried it into our son’s school to murder him. ” Using an   model known as the Bushmaster, Adam Lanza, a disturbed    who lived near the Bardens, shot his way into Sandy Hook Elementary School. In less than five minutes, he fired 154 rounds. His mother, Nancy Lanza, whom he also killed, had legally purchased the weapon. The Bardens were stunned, they said, to see how gun companies advertised the weapons online to the general public, using militaristic language and macho phrases like “Get your man card” and “The opposition will bow down. ” The plaintiffs’ lawyer, Joshua D. Koskoff, contends that the  ’s overwhelming firepower makes it a poor choice for home defense, hunting and recreation. “But there is one civilian activity in which the   reigns supreme: mass shootings,” the lawsuit said. Assailants “have unleashed the rifle’s lethal power into our streets, our malls, our places of worship and our schools. ” On Sunday, Mr. Koskoff said the carnage of the Orlando attack showed how “unreasonably lethal” the   is. “It’s no more a gun than a tank is a car,” he said in an interview. The   which dates to the 1950s, is one of the most popular weapons in history, with dozens of gun makers issuing their own models. Several million are in American hands, according to expert estimates, despite a     ban that expired in 2004. The National Rifle Association calls the   “America’s rifle. ” As the   ban was ending, Congress began debate on the gun immunity bill. A University of Michigan Law School professor, Sherman J. Clark, wrote a letter to lawmakers arguing against the proposed law. More than 70 law professors signed the letter, which said the bill represented a “substantial and radical departure” from American tort law. “The law provides to firearms makers and distributors a literally unprecedented form of tort immunity not enjoyed or even dreamed of by any other industry,” the letter said. In late 2005, the House of Representatives voted to approve the immunity law, officially called the Protection of Lawful Commerce in Arms Act, and six days later, President George W. Bush signed it into law. Remington, the company based in North Carolina that made the Bushmaster gun used by Mr. Lanza, sold one million firearms last year, according to company filings. But while sales of handguns rose, the Bushmaster    rifles languished. Typically, mass shootings and terrorist acts bolster sales of assault rifles. In its most recent financial filing, Remington wrote that “after the tragic events” in Paris and San Bernardino, the company noticed “a strong but disciplined demand” for a   version of its Bushmaster rifles. Dr. Garen Wintemute, a public health researcher at the University of California, Davis, said sales of all types of guns rose after mass shootings. As for why purchases of assault rifles increase, he said: “Our informed guesswork is that it’s strategic buying  —   buy it now because you won’t be able to later. One unanswered question is when there is such a spike, how much of that is new purchasers and how much is people buying additional firearms. ” In a motion filed on Friday to strike the Newtown lawsuit, Remington called the plaintiffs’ arguments a “strained effort to evade the immunity provided to firearm manufacturers” under the 2005 federal law. The brief argues that the “negligent entrustment” exception applies to gun sellers and dealers, not a gun maker like Remington. Of course, if Judge Bellis does allow the case to proceed, the eventual outcome is uncertain. “Trial court judges do not really go for   theories or highly novel adaptations of established theories,” said Professor Feldman of Georgetown. “It goes against their experience and the nature of their job. ”'"}, "time": 1742564563.1418478}