{"duration": 0.09493565559387207, "input_args": {"text": "'Good morning. Here’s what you need to know: • Britain’s House of Commons will debate “Brexit” today. An opposition motion called on Prime Minister Theresa May to reveal her strategy for leaving the European Union. In return, Ms. May asked that lawmakers approve the beginning of talks, in late March. Michel Barnier, one of the E. U.’s lead negotiators, took a hard line against Britain’s plans to retain some advantages after leaving. He also said a deal needed to be reached within 18 months of the start of talks. We look at how populists in Continental Europe, as in Britain and the U. S. are tapping into discontent in the countryside and exploiting resentment against urbanites viewed as elites. _____ • Angela Merkel  accepted her party’s nomination for another   term as Germany’s chancellor in next year’s election. Trying to ward off challenges from the populist right, she said   veils should be banned “wherever legally possible. ” While not mentioning Donald J. Trump by name, Ms. Merkel indicated that his rise to the White House could make it harder to define global policy and tackle international security challenges. _____ • Mr. Trump’s latest disruption involves one of the most hallowed symbols of the American presidency: Air Force One. Mr. Trump suggested that Boeing was inflating the costs of an upgrade. “Cancel order!” he wrote on Twitter. The lobbying firm of former Senator Bob Dole received $140, 000 from the government of Taiwan for its work in establishing contacts that led to the president of Taiwan’s phone call with Mr. Trump last week. Here’s the latest on the presidential transition. _____ • Libyan fighters declared victory over the Islamic State in Surt, ending the group’s ambitions for a caliphate on the southern shores of the Mediterranean. But the government in Tripoli remains weak, having failed to extend its authority even over the capital since it started work in March. Many militias fighting under its banner are more concerned about Gen. Khalifa Hifter, a strongman who dominates Benghazi and the east of the country, than about the Islamic State. _____ • Saudi Arabia has voiced support for U. S. efforts to nourish democracy in Afghanistan. But it has also lavishly funded Sunni extremism there, under various guises. Our special report examines how the kingdom manages to be on both sides of the conflict. _____ • Affluence doesn’t guarantee better results in education, particularly in science and math, a global survey suggests. America’s most advantaged teenagers scored below their   peers in science. The countries with the highest scores  —   Singapore, Japan, Estonia, Finland and Canada  —   tend to be those that have acted to make teaching more prestigious and selective and directed more resources to their neediest children. _____ • The Trump Organization scrapped its contentious application to build a sea wall in Ireland. • Google uses almost as much energy as San Francisco. Next year, the company said, all that energy will come from wind farms and solar panels. • The U. S. economy has more than doubled since 1980, but new research finds there was close to zero growth for   adults on the bottom half of the income ladder. • Here’s a snapshot of global markets. • President Hassan Rouhani of Iran, above, pledged that Iran would not allow Mr. Trump to “rip up” the nuclear deal and warned of consequences if President Obama signed a   extension of sanctions. [The New York Times] • Malta outlawed “conversion therapy” to change sexual orientation. [Times of Malta] • A court in Greece said three pilots who fled Turkey after the failed coup in July must go back. A day earlier, it said three Turkish soldiers could stay. [Reuters] • Voters in Ghana go to the polls today in presidential elections. The country’s economy has plunged, with this year’s growth on track to be the slowest in decades. [The New York Times] • Russia published a plan to defend itself against online attacks and operate the Russian internet autonomously, if needed in time of war. [The New York Times] • Moscow also announced plans to sell “Kremlin Quality” dairy products online. [BBC] • Whether a woman’s name changes after marriage can be a personal choice, but also a matter of culture, political environment and law. We’re asking women around the world to let us know if they kept or changed their names, and why. • A rape scene in Bernardo Bertolucci’s 1972 film “Last Tango in Paris” is at the center of an internet outcry. • Real Madrid will host Borussia Dortmund in the Champions League’s final round of group games. Arsenal secured first place in its group by defeating Basel. Napoli and Benfica advanced. • Beyoncé, with nine nods for her album “Lemonade,” leads the nominations for the 59th annual Grammy Awards. Other nominees include Adele, Drake, Rihanna and Justin Bieber. • Giacomo Puccini’s original version of “Madama Butterfly” will get a second chance at Teatro alla Scala in Milan, more than a century after its premiere was met with catcalls and jeers. The standoff over an oil pipeline near the Standing Rock Sioux Reservation in the American Midwest took a turn this week when the Army Corps of Engineers said it would reconsider the pipeline’s route. The Corps has helped shape American infrastructure since its establishment in 1802 as the “world’s largest public engineering, design and construction management agency. ” As a part of the Department of the Army, its early projects involved forts. But the Corps’ most notable legacy may be making Great Lakes harbors safer and reducing river obstacles, a boon to the growing nation’s economy. The Standing Rock protest stems from the pipeline’s planned routing under the Missouri River, raising Native American fears of an environmental catastrophe. When those happen, the Corps often responds, as it did in the Exxon Valdez oil spill in Alaska in 1989. The Corps has often been credited with a marvel that it didn’t actually build: the original Panama Canal, which transformed global trade. The canal’s construction was, however, overseen by a famous member of the Corps, Gen. George Washington Goethals. When he died in 1928, officials called the canal “a monument to one of the world’s greatest engineers. ” He was buried at the U. S. Military Academy in New York, overlooking the Hudson River. Sean Alfano contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742561777.8747637}