{"duration": 0.045419931411743164, "input_args": {"text": "'In another example of “fake news,” several   journalists have spread unconfirmed speculation from a government agency to attack Breitbart  —   and, unsurprisingly, they were 100% wrong. [A USDA spokesperson told Washington Post writer Erik Wemple (pictured) that a Breitbart News article may have been the basis for a   Fox News story about food stamp fraud.  “We reported that back in 2016, $70 million were wasted on food stamp fraud. That was actually incorrect,” Fox and Friends   Abby Huntsman said Friday, correcting a report she made on Tuesday. Huntsman’s retraction came at the behest of the USDA, according to Wemple. “We are not quite sure where this came from,” a USDA spokesperson reportedly told Wemple, adding “We saw that there was a story on Breitbart. We have not issued a report on this recently. There is no new rate that we’ve published. So we’re not quite sure why they’re so interested in stirring this up. ” The USDA spokesperson was correct Breitbart News did recently publish a piece about food stamps titled: “Under Obama, 10. 7 Million More Use Food Stamps —  A 32 Percent Jump. ” However, nowhere in that article does the word “fraud” appear  —   not once. Wemple did not bother to mention that fact. Within hours of Wemple’s report, several journalists with Verified Twitter accounts used the quote from USDA to call Breitbart the “source” of Fox’s false report. Fox News falsely reported on a   gov study, and you’ll be SHOCKED by who the source was pic. twitter.   —   Alex Griswold (@HashtagGriswold) December 30, 2016,  Wasn’t @FoxNews, it was @BreitbartNews that made it up. That outlet has had zero credibility sonce their namesake died. https:  .   —   Benjamin Allbright (@AllbrightNFL) December 30, 2016,  wait @FoxNews just invented a USDA report that doesn’t exist to claim food stamp fraud is at an   high? https:  .  pic. twitter.   —   Jesse Lehrich (@JesseLehrich) December 30, 2016,  So made up Breitbart nonsense gets sent to Fox News and it comes out of @HuntsmanAbby’s mouth? Not ok. pic. twitter.   —   Alex Leo (@AlexMLeo) December 30, 2016,  Once again, even by Fox News’ ”standards” this fake report they got from Breitbart is despicable. Sham journalism. https:  .   —   Erick Fernandez (@ErickFernandez) December 30, 2016,  Fox News and Breitbart cite USDA to claim   fraud is at an   high. USDA says that’s false#FakeNewshttps:  .   —   Ben Norton (@BenjaminNorton) December 30, 2016,  These outraged individuals did not produce a link to any recent Breitbart article claiming record food stamp fraud  —   before accusing the site of having “zero credibility” and trafficking in “sham journalism. ” whoa this is a very serious charge, can u specify the link where that happened so we can fix https:  .   —   Breitbart News (@BreitbartNews) December 30, 2016,  So far, only Mother Jones’ Kevin Drum appears to have investigated the claim, concluding that “the recent Breitbart piece didn’t even mention fraud. I checked. ”'"}, "time": 1742561774.1528568}