{"duration": 0.07920241355895996, "input_args": {"text": "'Goya Foods has called it a “business decision” not to sponsor New York’s National Puerto Rican Day Parade for the first time in its   history after organizers announced they would honor prolific terrorist Oscar López Rivera at the event. [The company, founded by   Rican immigrants in New York, will withdraw $200, 000 in patronage from the event, according to local legislators.  López Rivera, identified as the head of the radical Marxist Armed Forces of National Liberation (FALN) terrorist group, was freed Wednesday after receiving a pardon from President Barack Obama. His supporters argue that he is an icon of Puerto Rican nationalism, a deeply divisive issue among the U. S. citizens who inhabit the island and praise his refusal to accept a pardon from President Bill Clinton that required him to express remorse for his participation in terrorist acts. Goya’s withdrawal from the parade followed news that López Rivera would be honored the title of “Icon of Liberty” at the event, scheduled for June 11. The corporation’s public relations head, Rafael Toro, told Fox News, however, that the decision not to participate in the event was not directly tied to López Rivera. “It was a business decision not to participate in the parade,” Toro said, noting that a false company statement had made the rounds on social media. Despite the clarification, the move may result in added pressure on other corporate sponsors to also withdraw from the parade or risk being seen as supporters of terrorism. The Associated Press notes that among those corporations still participating are the    companies ATT, Coca Cola, and the New York Yankees. The New York newspaper El Diario La Prensa credits a group called the Youth of the New Progressive Party for beginning a social media campaign calling for the boycott of any corporation that participates in the celebration. López Rivera himself dismissed Goya’s withdrawal and threatened the business with a boycott. “I think Goya would have more to lose if Puerto Rico boycotted it, and all Puerto Ricans, here and in the diaspora, boycotted Goya. So I think Goya has more to lose than us,” he told reporters. López Rivera arrived in San Juan, Puerto Rico, on Wednesday, greeted by an estimated four dozen supporters “holding flowers and Puerto Flags, some chanting ‘Free at last! ’” according to the Associated Press. New York State Sen. Rev. Rubén Díaz wrote in a column on his Facebook page that he has heard rumors that the airline Jet Blue may also withdraw from the parade, though Jet Blue has not considered withdrawing its business from the neighboring Caribbean country of Cuba, which maintains ties to terrorist groups like the Revolutionary Armed Forces of Colombia (FARC) and Hezbollah. In his column, Díaz lamented Goya’s exit and called, “as a Puerto Rican,” for the company to reconsider. “Without Goya,” he wrote, “the parade has no seasoning. ” Parade organizers have not indicated that they have considered backing down from awarding the terrorists an honorific title at the ethnic pride event. In a statement published on their official website on May 12, organizers insisted that López Rivera was worthy of praise despite his remorseless history of violence: We aim to use Oscar López Rivera and his story  —   decades after  —   to bring a message for peace, unity, compassion and reflection. Amidst the controversies surrounding López Rivera, we have been compelled by his early work as a community activist of Chicago’s Puerto Rican community, and that his convictions led to more than 35 years without freedom, of which 12 were spent in solitary confinement several U. S. political leaders have conceded that Oscar’s   sentence was out of proportion. Also, given the opportunity to shorten his time behind bars, he did not accept President Clinton’s 1999 clemency, expressing that he could not leave behind Carlos Alberto Torres, who was detained along Oscar but was not included in Clinton’s clemency offer. A key organizer of the event, New York City Council Speaker Melissa   affirmed this in a statement from Puerto Rico, where she had traveled to welcome López Rivera to freedom. “His release is not only a win for our island, but for our country’s democracy and criminal justice system —  and that’s why I’m proud that tireless advocacy led to President Obama granting Oscar clemency,” she said. “We stand in solidarity with Oscar, and I thank the National Puerto Rican Day parade for recognizing and uplifting his legacy. ” López Rivera’s FALN group is reportedly responsible for at least 130 bombings, mostly in New York, Chicago, and Puerto Rico, believed to have caused at least five deaths and more than $3 million in property damage. López Rivera himself was sentenced to 55 years in prison in 1981, in a trial in which he told the judge, “I am an enemy of the United States government. ” President Clinton offered López Rivera a commutation of his sentence in 1999 that he rejected some argue he did so because a fellow FALN member was not offered the same deal, though López Rivera said in an interview the year before that he had “problems” with “atonement” and refused to condemn his terrorist acts before being freed. His sentence was extended to 70 years following a prison escape attempt. López Rivera is expected to be honored on Thursday at an event in Chicago, one of the cities his terrorist organization targeted. A local Chicago politician suggested in February that Chicago name a street after him. Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742562636.4846172}