{"duration": 0.09343934059143066, "input_args": {"text": "'The Bruno Mars   machine has been one of pop’s most reliable tools in the last few years, and it rarely falls short of complete, uncanny accuracy. His skill for manipulating the past has made him something of an outlier: a   soul singer, songwriter and producer interested not in strict nostalgia, but in illuminating old styles so they shimmer in a way that’s appealing to a listener not much interested in looking backward. This precision comes at a price, though. At times, Mr. Mars is a sideshow to his presentation. The sound is the star, and he is the vehicle, not the driver. “24K Magic,” his third album  —   and first in four years  —   is the story of that tension. Mr. Mars is by turns a showman and an analyst, a preservationist and a peacock. The new songs  —   his most diverse set to date, and mostly rigorously executed and fun  —   show Mr. Mars to be interested in different musical eras, different production approaches and different singing voices without veering into chaos. Mostly his songs are like cotton candy: sweet, sticky, structurally impressive but not especially deep. What’s most striking about this album is how it expands upon Mr. Mars’s longstanding interest in American soul music. Rather than linger in one time period, with one production approach, he’s all over the map, from the 1950s to the ’90s, and sniper sharp throughout. The title track, this album’s lead single, is set to around 1980, when funk and machines were doing some of their earliest dances, and when black pop was still teeming with disco exuberance. It has less to do with the presence of Mr. Mars  —   ecstatic, slick, ambient  —   than the sheen of the production. The synthesizers are sympathetic and covered in burrs, and the vocals are   in a manner indebted to Zapp, who pioneered the sort of liquid digital funk Mr. Mars is repurposing (talkbox vocals pepper the song) and also to the duo Chromeo, who have been faithful revivalists of the style for years now. As for Mr. Mars, he’s doing more emphatic talking than singing and is backed up by a barking chorus, adding   punch to his mellifluous boasts. Then there’s “Perm,” which jolts back to the ’60s, with its   and James   horn stabs and drums. Here, Mr. Mars trades his tender coo for a   vocal, as if sheer lust were rendering him hoarse. When he comes closer to the present day, or at least to the music he was raised on, Mr. Mars sounds most at home. Take the pairing of “Versace on the Floor” and “Finesse,” a   punch of    ’80s RB evolution. “Versace on the Floor” is dreamy New Edition homage, with cool synthesizers forming a cradle for Mr. Mars, who begins the song singing tenderly, à la Ralph Tresvant, “Underneath the  ’re dancing all alone. ” Later, though, is where he tweaks the original style, unleashing the more forceful side of his voice to curdle sweetness into hunger. A couple of songs after that comes “Finesse,” which takes the leap from 1984 to ’88, with crackling drum machine production that harkens back to “Don’t Be Cruel,” Bobby Brown’s   Edition solo breakthrough album. That Mr. Mars can leap so effectively among sounds says a great deal about his strengths and weaknesses. He’s not an especially imposing singer instead, he’s a chameleon, without a signature flourish or tone. But that’s fine, because it’s as a producer  —   he’s credited here as Shampoo Press  Curl  —   that he’s most excited to show off his range. His ear is often astonishing, his gift for mimicry almost without equal. Other producers are credited here on certain songs  —   the Stereotypes, Emile Haynie, Jeff Bhasker  —   but they’re all minor moons in Mr. Mars’s fully realized soul universe.'"}, "time": 1742562085.10938}