{"duration": 0.06467151641845703, "input_args": {"text": "'A YMCA in Indiana has removed CNN from the TVs in its wellness and exercise areas over complaints from members upset by the constant fake news the cable network airs. [The Valparaiso, Indiana, YMCA issued a statement to members that the cable news network was removed from facility TVs because too many members complained about the programing.  Debra Koeppen, the YMCA’s chief development officer, said that “Trying to please everyone” is the “No. 1 problem we have in the wellness area,” according to Chicago Tribune reporter Jerry Davich, who claims to be a member of the YMCA in question. Earlier this week, Robert Wanek, CEO of the Valparaiso YMCA, sent a message to members saying, “In order to eliminate perceived political bias associated with national news outlets, the Valparaiso Family YMCA will only be showing local news channels in the future. ” Davich asked the CEO to reveal more details about the removal of CNN from the TVs, but Wanek replied, “I cannot pinpoint the change origins, only to add that we get dozens of requests to change channels every day from numerous interest groups. ” “We just want the Y to be a haven for wellness where people come together and have a sense of belonging, gain new relationships and achieve their personal goals,” Wanek added. “We will display local news moving forward. ” Indeed, Wanek said that from this point forward only local news will be played on the TVs and all cable news networks will be banned. Reporter Davich’s article was far from a straight report on the matter, however. The reporter was an open detractor of the decision to remove CNN from the TVs, clearly stating he and some other members disagreed with the new policy. Davich insisted that CNN was a centrist network and noted that “none” of the members he talked to “agreed with the removal of CNN. ” The reporter gave readers his opinion in the very first sentence, saying, “Is the Valparaiso Family YMCA simply exercising its right to appease as many members as possible, or is the new Donald   America already flexing its muscles?” Davich’s final say on the matter was just as clear. As he wrapped up his story. the reporter complained that “the Y’s decision to remove all national news outlets from its televisions says more about its leaders than its members. You’d think this story would be just another example of fake news. Sadly, it’s not. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742561761.043601}