{"duration": 0.05501079559326172, "input_args": {"text": "'Monday on his nationally syndicated radio program, conservative talker Rush Limbaugh offered one theory as to why 2016 Democratic presidential nominee Hillary Clinton could not win over many of those who voted for President Barack Obama last November.  According to Limbaugh, one of those reasons dealt with a racial component, which he explained if Obama had been white, many would not have voted for Obama. Partial transcript as follows: What the Democrats don’t get into, what they don’t dare get into  —   and I guarantee you they know this, too I will wager. I’m having to guess here because there’s no data in this story to support this. But the data that is used, I think, is erroneous. You can’t ignore the fact that a lot of people, particularly in 2008, voted for Barack Obama because of the racial component and a desire to end the racial divide in America. There were people who believed that if the United States elected an   president, that it would forever end all of these allegations and discussions America is a racist nation. There were people  —   and that’s the only reason a lot of people voted for Obama. Now, you can throw in disgust with Bush, disgust with the Republicans after the media’s four years of destruction of both Bush and the Republicans. But you cannot deny the racial component here. I think it’s the big reason why so many Obama voters didn’t vote for Hillary. They wouldn’t have voted for Obama, either, if he were white. I really believe it. I don’t know what the number is. I’m not saying it’s a majority of people. I’m saying it’s enough people who voted for Obama who didn’t vote for Hillary. This is what this latest analysis is pointing to as the real reason she lost. No mention of the Russians in this analysis. It’s strictly an analysis of voting patterns as best these people can come up with them. But the one thing that they’re honest with themselves about is the racial component. Of course, they don’t dare go there because this is now   time for Obama. And you cannot build a serious, solid legacy if you include the fact that the only reason a lot of people voted for him was because they thought in doing so they could end this argument that America’s racist and they could end the racial strife. As I so adeptly pointed out, all it did was exacerbate it. It did not  …     And I predicted it the day after it happened, that it was not going to ameliorate the racial divide whatsoever. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742561797.125391}