{"duration": 0.06186413764953613, "input_args": {"text": "'1 / 2 \\nLe rêve s’avéra amer : il lui fallut vivre dans des préfabriqués de chantier, ce qui ne la dissuada pas. « Je trouvais ça marrant. Tu ne fais rien à part jouer au football. On m’avait même expliqué qu’on pouvait en vivre. Bien sûr que je reste [décida Nadedja], je suis prête à me laver à l’eau froide et tout » , confie-t-elle. « Si mon père ne m’aidait pas, je crèverais de faim » Июн 6 2016 в 7:49 PDT \\n\\nSe faire une place dans le football professionnel s’avéra difficile. Après ses études, le club de l’académie, Rossiyanka, proposa à Nadejda, qui jouait alors déjà dans l’équipe jeunes de Russie, 9 000 roubles (120 euros) par mois. Ce furent les représentants d’un autre club, Zorky, qui la sauvèrent de la misère en la payant trois fois plus cher. Mais cet argent ne suffisait de toute façon pas pour quoi que ce soit. « Je ne peux rien m’acheter avec l’argent que je gagne au football , a raconté Nadjeda dans une interview à Eurosport en 2014. Je peux m’acheter une carte de métro. Si mon père ne m’aidait pas, je crèverais de faim » . \\nDurant ces deux ans, Nadedja fait des débuts remarqués dans l’équipe nationale et est en tête des marqueurs du championnat russe 2016 dans l’équipe Chertanovo de Moscou. Cependant, la star du football féminin russe vit toujours modestement, comme tout le football féminin en Russie, qui paie 3 000 roubles (40 euros) de prime pour une victoire, et dont les joueuses en déplacement s’entassent dans les wagons de troisième classe. \\n« Les salaires des hommes, on n’en rêve même pas. Je ne veux même pas entendre parler de ces sommes. Qu’est-ce que… je pourrais faire de 50 000 dollars ? Rien de bon… J’irais faire la fête, je perdrais la raison. Il me semble que c’est ce qui arrive à tous ceux qui reçoivent des sommes pareilles » , affirme Nadejda.'"}, "time": 1742563192.9601855}