{"duration": 0.06774067878723145, "input_args": {"text": "'WASHINGTON  —   The House Republican plan to replace the Affordable Care Act would increase the number of people without health insurance by 24 million by 2026, while slicing $337 billion off federal budget deficits over that time, the nonpartisan Congressional Budget Office said Monday. Republicans had been bracing for what was almost certain to be a bleak accounting of the legislation’s projected effects. The American Health Care Act, as Republicans call their bill, was already facing widespread criticism from health care providers, some conservatives and a united Democratic Party. The   judgment by Capitol Hill’s official scorekeeper did not back up President Trump’s promise of providing health care for everyone and was likely to fuel the concerns of moderate Republicans. Next year, it said, the number of uninsured Americans would be 14 million higher than expected under current law. But it also provided talking points for House Republican leaders who need the support of rebellious conservatives to pass the measure: lower deficits, reduced federal spending and tax cuts. The Trump administration immediately denounced the budget office’s conclusions. Tom Price, the secretary of health and human services, suggested the report offered an incomplete picture because it did not take into account regulatory steps he intends to take, as well as other legislation that Republicans plan as part of their multistep strategy to repeal and replace the health law. “We disagree strenuously with the report that was put out,” he said at the White House. Democrats remained steadfast in their opposition. “The C. B. O. score shows just how empty the president’s promises, that everyone will be covered and costs will go down, have been,” said Senator Chuck Schumer of New York, the Democratic leader. “This should be a looming stop sign for the Republicans’ repeal effort. ” The coverage numbers released Monday will make it only more difficult for Republicans to explain why their legislation would improve the country’s health care system. And that could make the bill’s fate in the more narrowly divided Senate much more tenuous. In a sign of the concern over the coverage projections, Senator Susan Collins, Republican of Maine, said the budget office’s report was “cause for alarm” and “should prompt the House to slow down and reconsider certain provisions of the bill. ” Average premiums for people buying insurance on their own would be 15 to 20 percent higher in 2018 and 2019 than they would be under current law, the budget office said. But after that, premiums would be lower than projected under current law  —   around 10 percent lower by 2026, the budget office said. The number of uninsured would shoot up next year by 14 million, the budget office said. Most of the increase in 2018 would result from people choosing not to buy insurance after tax penalties for those without coverage are repealed, but in later years, the office said, the number of uninsured would rise further because of changes in Medicaid, the health program for   people. “Some states would discontinue their expansion of eligibility” for Medicaid, and federal spending per beneficiary would be capped, the report noted. For people receiving subsidies under the Affordable Care Act, the report said, tax credits proposed by House Republicans “would generally be less generous. ” But the market would not collapse. Other changes in the House bill would “lower average premiums enough to attract a sufficient number of relatively healthy people to stabilize the market,” the budget office said. The budget office estimated that 52 million people would be uninsured in 2026 under the House Republican bill, compared with 28 million projected under current law. The report foresees huge changes in Medicaid. By 2026, it said, federal Medicaid spending would be 25 percent lower under the House bill than is projected under current law, and the number of Medicaid beneficiaries would be 17 percent lower, with 14 million fewer people covered by Medicaid. Republican leaders tried to focus on the positive news in the budget office’s analysis. Speaker Paul D. Ryan said the report showed that the Republican plan would lower premiums. “I recognize and appreciate concerns about making sure people have access to coverage,” he said. “Under Obamacare, we have seen how   coverage does not equal access to care, and now the law is collapsing. ” Democrats had criticized Republicans for pushing the bill through two House committees last week before the Congressional Budget Office had weighed in, saying it was irresponsible to begin considering legislation without a firm grip on its potential costs and ramifications. On Monday, they said they were vindicated. “Today’s analysis from the C. B. O. confirms that the Republicans’ repeal bill isn’t a health care bill at all,” said Representative John Yarmuth of Kentucky, the ranking Democrat on the House Budget Committee. “It’s an ideological document with real and incredibly damaging consequences for American families. ” But the analysis does show that under the Republican plan there would be winners  —   and losers. Under current law, in 2026, a single    earning $26, 500 with an insurance policy that costs $5, 100 a year would get a tax credit of $3, 400 and would have to pay $1, 700 of the premium. Under the Republican bill, that person’s share of the cost would drop to $1, 450. By contrast, a    earning the same amount would fare much worse. That person’s $15, 300 health plan would be offset by a $13, 600 tax credit under current law, leaving the consumer responsible for $1, 700. Under the Republican plan, health insurers would be free to charge older people more, raising that person’s premium to $19, 500. But the tax credit would be only $4, 900, and that person’s share of the premium would then be $14, 600. House Republicans would allow insurers to sell health plans covering a smaller share of consumers’ medical costs, and   subsidies for   people would be repealed in 2020. As a result, the budget office said, deductibles and other    costs for many consumers would be substantially higher than under the Affordable Care Act. The budget office produces a variety of budget and economic analyses, including deficit projections, legislative options for lawmakers confronting the nation’s most vexing problems and cost estimates for legislation. Its director, Keith Hall, was appointed in 2015 by congressional Republicans, and it is generally respected for its objective analysis. But with an unfavorable analysis expected, Republicans from the White House to Capitol Hill began to undermine the credibility of the budget office’s numbers last week and kept it up through the weekend. “If the C. B. O. was right about Obamacare to begin with, there’d be eight million more people on Obamacare today than there actually are,” President Trump’s budget director, Mick Mulvaney, said Sunday on ABC’s “This Week. ” He added, “Sometimes we ask them to do stuff they’re not capable of doing. ” The number of people who have signed up for insurance through the health law’s exchanges is lower than expected, in part because employers did not drop coverage to the extent that had been anticipated. In addition, the Supreme Court ruled that states could not be compelled to expand Medicaid  —   and many   states did not. The House Republican legislation, which was released last week, would repeal major parts of President Barack Obama’s health care law. It would scrap the   tax credits that help people pay for coverage, end the penalty for people who do not have health insurance and phase out the expansion of Medicaid that has brought coverage to millions of people. Republicans would provide a new tax credit based on age that would help people buy insurance on the individual market. While people would not face a penalty for not buying insurance, Republicans would put in place a new provision to encourage continuous coverage: People would face a 30 percent surcharge in their premiums if they signed up for insurance after having gone without it for about two months or more. In an interview last week with the radio host Hugh Hewitt, Mr. Ryan played down the significance of the forthcoming coverage estimate. He said the goal of Republicans was not “to win some coverage beauty contest” or “to show a pretty piece of paper that says we’re mandating great things for Americans” with their health bill. “If the government says, ‘Thou shall buy our health insurance,’ the government estimates are going to say people will comply and it will happen,” Mr. Ryan said. “And when you replace that with, ‘We’re going to have a free market and you buy what you want to buy,’ they’re going to say not nearly as many people are going to do that. ” Before the budget office’s assessment was released, Mr. Trump lauded the Republican health plan Monday at the beginning of a discussion with people the White House described as “victims” of the Affordable Care Act. The president said the Republican plan would provide “more choices, far more choices, at lower cost. ” “Americans should pick the plan they want,” he said. “Now they’ll be able to pick the plan they want. They’ll be able to pick the doctor they want. ” Mr. Trump predicted that if the Republican plan is enacted, “you’ll see rates go down, down, down, and you’ll see plans go up, up, up. ” He said it would be “a thing of beauty. ”'"}, "time": 1742628494.5438347}