{"duration": 0.02277207374572754, "input_args": {"text": "'Lebanon Lebanese Foreign Minister Gebran Bassil gestures to his supporters during a rally to show support for FPM founder Michel Aoun, near the presidential palace in Baabda, near Beirut, Lebanon, October 16, 2016. (Photo by Reuters) \\nLebanon’s Minister of Foreign Affairs Gebran Bassil says the Lebanese resistance movement Hezbollah shares the victory of Michel Aoun in securing the country’s presidency. \\nAoun, a strong Hezbollah ally, was chosen by Lebanese lawmakers as the country’s president on Monday. \\nAddressing a large number of people who had converged at a square in Beirut to celebrate Aoun’s election, Bassil, who is also the head of the Free Patriotic Movement (FPM) and Aoun’s son-in-law, said his movement never doubted Hezbollah’s “loyalty” and “honesty.” Aoun is the founder of the FPM. \\nHe said Aoun’s victory was based on his own perseverance as well as the positions adopted by Sayyed Hassan Nasrallah, who is Hezbollah’s secretary general. \\nIn a phone call on the same day, Nasrallah congratulated Aoun on his election as the head of the Lebanese state. This image, taken in the southern suburbs of Beirut on October 31, 2016, shows people celebrating the election of Michel Aoun as the new president of Lebanon. \\nNasrallah endorsed Aoun last week, advising Lebanese political factions to set aside their differences in order to fill the presidential void in the Arab country. \\nLebanon had been without a president for over two years amid political bickering in the parliament. \\nAfter the election, Aoun vowed in a speech to the parliament that he would spare no effort in trying to bring about the liberation of Lebanese territories occupied by Israel. \\nHe said his top priority would be to strengthen the army in order for it to become capable of defending the country against all threats to its independence and sovereignty. \\nHezbollah has been defending Lebanon against Israeli aggression since the movement’s inception, including during a full-fledged Israeli war in 2006. \\n(This item is being updated.) Loading ... '"}, "time": 1742561775.5694797}