{"duration": 1.4521608352661133, "input_args": {"text": "'Republicans from the presidential ticket on down pounced Saturday on Hillary Clinton’s remarks that half of Donald J. Trump’s supporters fit into a “basket of deplorables,” saying it showed she was out of touch with an economically   electorate. Mrs. Clinton’s comments Friday night, which were a variation of a sentiment she has expressed in other settings recently, came at a   in Manhattan. “You know, to just be grossly generalistic, you could put half of Trump’s supporters into what I call the basket of deplorables. Right?” she said to applause and laughter. “The racist, sexist, homophobic, xenophobic, Islamaphobic  —   you name it. And unfortunately there are people like that. And he has lifted them up. ” By Saturday morning, #BasketofDeplorables was trending on Twitter as Mr. Trump’s campaign demanded an apology. His supporters hoped to use the remark as evidence that Mrs. Clinton cannot connect to the voters she hopes to represent as president. “Wow, Hillary Clinton was SO INSULTING to my supporters, millions of amazing, hard working people. I think it will cost her at the polls!” Mr. Trump wrote on Twitter. Speaking at the Values Voter Summit, a gathering of Christian conservatives in Washington on Saturday, Gov. Mike Pence of Indiana, Mr. Trump’s running mate, said: “Hillary, they are not a basket of anything. They are Americans and they deserve your respect. ” By Saturday afternoon, Mrs. Clinton had acknowledged her stumble. “Last night I was ‘grossly generalistic,’ and that’s never a good idea,” she said in a statement. “I regret saying ‘half’  —   that was wrong. ” She then used the opportunity to double down on her criticism of her opponent. “It’s deplorable that Trump has built his campaign largely on prejudice and paranoia,” she said, “and given a national platform to hateful views and voices, including by retweeting fringe bigots with a few dozen followers and spreading their message to 11 million people. ” Mrs. Clinton’s remarks flipped, for a day at least, the familiar script of the 2016 campaign, in which Mr. Trump slights a large group of people and she quickly rebukes him. They were also out of character given her usual studied care in choosing words. Her campaign slogan is “Stronger Together,” and she has built her message around inclusiveness, in contrast to denigrating comments Mr. Trump has made about Mexicans, Muslims, women and other groups. Much of her ad campaign is built around using Mr. Trump’s comments to portray him as an unsuitable leader. But for all the policies she says would lift   wages and alleviate income inequality, Mrs. Clinton has struggled with the perception by many voters that she is not on their side. Asked whether they thought Mrs. Clinton understands the needs and problems of people like themselves, 53 percent of registered voters said she did not, according to a CBS News poll from June. The Democratic National Convention in July and a bus tour in Pennsylvania and Ohio   on   issues seemed to help Mrs. Clinton. In an August ABC   Post poll, 55 percent of Americans said Mrs. Clinton understood the problems of people like them better than Mr. Trump, compared with 35 percent who named him. But Mrs. Clinton devoted much of August to   in the moneyed enclaves of the Hamptons and Martha’s Vineyard. At some of these events, which were closed to the press, she uses the “baskets” characterization of Trump voters. After barring the press from most   the Clinton campaign has tried to be more open in the   Day sprint. Aides allowed a small group of reporters in Mrs. Clinton’s regular press corps to cover the Friday event, which took place at Cipriani on Wall Street and for a contribution of $1, 200 to $10, 000 included performances by Barbra Streisand and Rufus Wainwright. A spokesman for the Trump campaign, Jason Miller, said what made Mrs. Clinton’s comments particularly   was that she made them “in front of wealthy donors” and that the setting and statement, “revealed just how little she thinks of the   men and women of America. ” Mrs. Clinton made a similar remark on Israeli television on Thursday, saying “We’ve always had a kind of paranoiac, prejudicial element within our politic. ” But she did not specify how many of Mr. Trump’s supporters fit into that category. It was the characterization of “half of Trump’s supporters” on Friday that struck some Republicans as similar to the damning “47 percent” remark made by their own nominee, Mitt Romney, in his 2012 campaign against President Obama. At a private   Mr. Romney, who Democrats had already sought to portray as a cold corporate titan, said 47 percent of voters were “dependent upon government, who believe that they are victims” and who “pay no income tax. ” “Romney’s 47% comment was bad. Hillary calling tens of millions of American men  women ‘deplorable’ is inexcusable and disqualifying,” Sarah Huckabee Sanders, an adviser to Mr. Trump and the daughter of Mike Huckabee, the former governor of Arkansas, wrote on Twitter. Mrs. Clinton’s remark, which she delivered lightheartedly, also harked back to Mr. Obama’s gaffe at a San Francisco   in 2008 that economically struggling Americans “get bitter, they cling to guns or religion or antipathy towards people who aren’t like them. ” That time, it was Mrs. Clinton who seized on her opponent’s comment to paint him as elitist as the two Democrats battled before the Pennsylvania primary, which she went on to win by nine percentage points. Her remarks on Friday were a more pointed version of her earlier criticisms of the movement her opponent has spurred. Last month in a speech in Reno, Nev. Mrs. Clinton devoted an address to criticizing Mr. Trump for “taking hate groups mainstream” and “helping a radical fringe take over the Republican Party. ” “She gave an entire speech about how the   is using his campaign to advance its hate movement,” Nick Merrill, a spokesman for the Clinton campaign, wrote on Twitter, using a loosely defined term that is often used to describe white nationalist and   sentiment. Other aides and supporters jumped to Mrs. Clinton’s defense, noting that after describing the “deplorables,” Mrs. Clinton went on to sympathetically weave another rhetorical basket of Trump voters: “People who feel that the government has let them down, the economy has let them down, nobody cares about them, nobody worries about what happens to their lives and their futures. And they’re just desperate for change. ” “Those are the people,” she said, “we have to understand and empathize with. ” In talking points given to surrogates on Saturday, and obtained by The New York Times, the campaign advised anyone speaking about the “deplorable” issue in the news media to reiterate that while Mrs. Clinton intended to say “some” instead of “half,” Mr. Trump, as she had pointed out in the past, “has clearly brought the  ’s hate into his campaign and into the mainstream. ” The talking points advised that anyone who is pressed on the “deplorable” remarks should assert that the news media was holding Mrs. Clinton to a different standard than Mr. Trump, with this suggested rejoinder: “Are they going to make more out of this story than they made out of the racist, misogynistic Trump comments that got us here in the first place?” Prof. Jennifer Mercieca, an expert in American political discourse at Texas AM University, said in an email that the “deplorable” comment “sounds bad on the face of it” and compared it to Mr. Romney’s 47 percent gaffe. “The comment demonstrates that she (like Romney) lacks empathy for that group,” Professor Mercieca said. “To be fair, she has characterized the group as homophobic, xenophobic, racist, and etc. and those qualities are not ones that we celebrate in America. ” It sounded, Professor Mercieca said, as if Mrs. Clinton had written off a large chunk of Trump voters as ones who would never vote for her, a view that might be accurate. “It likely won’t help her ‘likability’ with undecideds, but it may help her to mobilize Clinton supporters to more actively participate in her campaign,” she said. “I think that was the goal. ” An excerpt from Mrs. Clinton’s remarks Friday night:'"}, "time": 1742563572.6211245}