{"duration": 0.042479515075683594, "input_args": {"text": "'As part of the Democratic Party’s response to President Donald Trump’s address to a joint session of congress, former Kentucky Gov. Steve Beshear referred to himself as a “proud Republican. ”[Addressing the camera from a diner in Kentucky, former Gov. Beshear appeared to tangle his words, stating that “I’m a proud Democrat, but first and foremost, I’m a proud Republican, and Democrat, and mostly, American. ”  Beshear went on to attack Trump on a number of issues, claiming that Trump planned to “rip affordable health insurance from Americans who must need it,” as Trump and Republicans formulate plans to fully repeal Obamacare. The former governor also accused Trump of being “Wall Street’s champion,” after one of Trump’s executive orders “makes it harder for families to even afford a mortgage,” while “rolling back rules that provide oversight of the financial industry and protect us against another economic meltdown. ” He also criticized Donald Trump’s cabinet picks, describing them as a “cabinet of billionaires and Wall Street insiders who want to eviscerate the protections that most Americans count on and help level the playing field. ” The tone of the response appeared to be a pitch to the working class Americans who helped propel Trump to victory last November, with the video set in a modest diner surrounded by people Beshear claimed were his neighbors, as well as a mix of both Democrats and Republicans. Donald Trump’s speech covered a number of issues, such as healthcare, defense spending, cutting the size of government, and the need for unity in a divided America. A CNN poll later found that nearly four out of five Americans had a “positive reaction” to the speech. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562471.60934}