{"duration": 0.12038254737854004, "input_args": {"text": "'LOS ANGELES  —   Will Oscar take “Moonlight” to the bank? When the Academy of Motion Picture Arts and Sciences named “Moonlight” best picture on Sunday, the organization made cultural history, and not just for the bonkers way the victory was announced. For the first time, Hollywood backed a   film  —   one with an   cast  —   as its finest cinematic work. Now the pressure is on A24, the relatively new studio behind “Moonlight,” to use that achievement to fill theater seats. A24 said on Tuesday that it had booked “Moonlight” into at least 1, 500 theaters in the United States for the coming weekend. That would be the film’s widest release by far. While “Moonlight” has been chugging along in theaters for 20 weeks now  —   a feat unto itself that speaks to A24’s nurturing  —   it has so far played in a maximum of 1, 104 locations, a relatively small footprint. By comparison, “La La Land” played 3, 236 theaters at its widest point. The question is whether the best picture designation and the enormous media attention generated by the Oscars ceremony will convince mainstream ticket buyers who have not yet supported “Moonlight” to take a gander. Despite its long run, “Moonlight,” which also won Oscars for its screenplay and for Mahershala Ali’s acting, has taken in only $22. 1 million at domestic theaters, held back by its subject matter, lack of star power and novelistic structure. Ticket sales so far for “Moonlight” are the second lowest on record for a best picture winner, according to comScore, which compiles ticketing data. “The Hurt Locker,” which took in $17 million in 2009, or $19 million after adjusting for inflation, is the lowest. (“Moonlight” only cost $1. 5 million to make. “The Hurt Locker” cost $15 million.) A24 declined to comment for this article. The   Oscar Bump at the box office varies widely. Some films have already concluded their theatrical runs and receive nothing. In other instances, the effect can be substantial. According to comScore, the previous three   winners  —   “Spotlight,” “Birdman,” “12 Years a Slave”  —   each generated 10 percent or more of their total domestic grosses after their victories. For winners that are seen as especially arty, the boost can be even bigger. “The Artist,” a    largely silent film that was named best picture in 2012, collected 29 percent of its total gross after that year’s Oscar ceremony. A24, which was founded in 2012 and focuses on      movies, has gained a reputation as one of the savvier specialty film distributors in Hollywood. In the case of “Moonlight,” directed and   by Barry Jenkins, A24 first released the film in   in only four theaters in New York and Los Angeles to begin building word of mouth. The company then began testing demand in theaters in cities like Atlanta and Washington that drew a   of mainstream and specialty film ticket buyers, many of them  . In the film’s 13th weekend  —   using the Golden Globes as a peg  —   A24 pushed “Moonlight” from 135 theaters to 582. But demand was soft in spots: In most areas of the country, the multiplex crowd was not yet on board. Only after the Oscar nominations (“Moonlight” received eight) did the film manage to cross the   mark. (It was released on DVD on Tuesday.) “A24 has done a fantastic job of nurturing and protecting this film,” said Daniel Loria, editorial director of Box Office Media. “To pay sustained attention to   runs over the course of months, that takes real commitment. ”'"}, "time": 1742564039.5511947}