{"duration": 0.10291528701782227, "input_args": {"text": "'Good morning. We’re trying something new for our readers in Europe: a morning briefing to   your day. What do you like? What do you want to see here? Email us with your feedback at europebriefing@nytimes. com. Here’s what you need to know: • The U. S. presidential race has opened a schism in the Republican Party. Donald J. Trump berated leading party members who have withdrawn support after a recording of him demeaning women in lurid terms became public. We take you inside the final weeks of Hillary Clinton’s cautious  —   and surprisingly risky  —   campaign. “I’m the last thing standing between you and the apocalypse,” she said in an interview.  • President Vladimir V. Putin of Russia has indefinitely postponed a trip to France after the French government said talks would be devoted solely to the Syrian crisis. The move came after President François Hollande of France and the British foreign secretary, Boris Johnson, called for a war crimes inquiry. Mr. Johnson also called for protests outside the Russian Embassy in London. • A major terrorist attack in Germany was narrowly averted, the head of the country’s domestic intelligence agency said, after the arrest of a    Syrian refugee suspected of having ties to the Islamic State. The Islamic State’s propaganda operations have dropped off drastically as military pressure rises. “They’re dropping the utopian sales pitch they started with,” a new study says. “And that’s hurting their recruiting effort. ” • Samsung has killed its Galaxy Note 7 smartphone, an embarrassment for the tech giant. The company had tried for weeks to diagnose why some of the phones spontaneously exploded. If you have a Galaxy Note 7, turn it off. • Chancellor Angela Merkel of Germany ended her trip to Africa with talks in Ethiopia on Europe’s migrant crisis. She also expressed support for protesters demanding wider freedoms. At least 500 people have been killed in antigovernment demonstrations in the past year. Back in Berlin today, she is scheduled to meet with President Idriss Déby of Chad to discuss how to deal with Boko Haram and the waves of Africans trying to reach the Continent. • A Yemeni working for Unicef talks about raising his four children amid the country’s violence. “My little boy will be 3 in December,” he said, “but he is already three wars old. ” His    daughter wrote on Facebook, “We sleep afraid, we wake up afraid and leave our homes afraid. ” • Central banks, including the Bank of England, see Bitcoin’s technology as another way to complete and record transactions, or even to issue their own currencies. • The World Health Organization urged countries to impose a 20 percent tax on sugary drinks to battle the growing obesity epidemic. • Hungary’s largest opposition paper has halted publication after years of financial losses. Some say government interference played a role. • Keep your spending decisions separate from your saving decisions, advises our personal finance columnist. Don’t believe that “spending your own money saves you money in the long run. ” • Here’s a snapshot of global markets. The euro fluctuated against the dollar overnight, and the pound gained. • The New Yorker: “Turkey’s   Coup. ” A comprehensive look at whether Fethullah Gulen, the exiled cleric, tried to topple the Turkish government in July. • Der Spiegel: “Refugee Helps Germans Hunt ISIS. ” A Syrian journalist is helping the German authorities in their search for Islamic State supporters who came to Europe as refugees. • Bloomberg: “Meet the Parents, Australia’s   Housing Lender. ” More than half of   buyers in Australia get help from Mom and Dad. • A trend of people dressing up like clowns and scaring others has spread from the United States to Britain. • To hundreds of soccer players in England, Charles Porter is the person they call to make their life go a little smoother. “We live and die by our discretion,” he said in his   interview. • “L’Odyssée,” a film on the life of the French ocean explorer Jacques Cousteau, opens in French cinemas. • Vineyards in Piedmont, Italy, are encroaching on forests that are home to the white truffle. A new movement is trying to restore the region’s woods to save the mushrooms. In October 1915, as World War I raged across Europe, London received reports of scores of people having been executed in   Belgium, and of hundreds being arrested. Some of the civilians who were killed had sheltered wounded British and French soldiers, whom they had smuggled to safety. Edith Cavell, a British nurse, helped Allied soldiers escape and was killed by the German Army for treason on this day 101 years ago. She was viewed as a hero and a symbol of Britain’s war effort, and the news media called her “our Joan of Arc. ” “What poor psychologists the German officials are!” one Dutch newspaper wrote about her execution. Allied forces put out recruitment posters calling for volunteers to “avenge” her death. A statue of Ms. Cavell stands near Trafalgar Square in London with an inscription that begins, “Patriotism is not enough. ” Her dog, Jack, was embalmed and is on display at the Imperial War Museums. Stella Rimington, a former director general of the British intelligence service MI5, said in a BBC report that she narrated last year that there was  evidence that Ms. Cavell had spied for Britain. Secret messages were concealed in the clothes of soldiers the nurse helped return to Britain, Ms. Rimington said, adding, “Espionage was still in its infancy. ” Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742564354.314098}