{"duration": 0.04721689224243164, "input_args": {"text": "'Jared Grusd, the CEO of The Huffington Post, spoke at the Dublin Tech summit this week discussing the future of digital content and technology. [Appearing alongside former CNN anchor Gina London, Grusd discussed the development of HuffPo as a brand, how digital content creators develop, and the future of technology. Discussing the Huffington Post brand development, Grusd said, “I think one thing to think about is the human experience. All of us are people, but when you run a company or run product you start ascribing labels: audience, consumers, customers. And all of a sudden you start referring to actual living, breathing human beings in these generic terms, and the truth is all of us as people have multiple interests. ”  “I can be serious and I can have fun I can be funny, my wife says not enough, but my daughters think enough,” he elaborated. “I think it’s really important to have that balance, and one of the things that I think the best digital publishers have done over the past ten years has been to think about the way in which they publish content differently than historically. ” “What we’ve heard all day in many forms,” continued Grusd, “is the power of data, to understand your audiences, and I think the best publishers really look at the data of what their people, their audience, their consumers are actually doing on their properties and are learning from that, adapting from that. What you realize is that if you’re serious all the time, at some point it’s too much if you’re funny all the time then you’re not serious, and so getting that blend is really part of the magic and math that’s required to be successful. ” When asked about the Huffington Post’s success, Grusd said, “I think in every era in the history of media there have been giant waves that have formed, and I think that like all good surfers you have to sort of understand the break, get your board, paddle, and surf it just at the right time. And to Arianna Huffington’s credit, who is the founder and obviously the namesake of the Huffington Post, what she realized is there were few trends that were all converging at the same time. ” “The first is that there was a huge change in media landscape that was really produced by Google, because Google search essentially opened up the Internet, the world wide web, to all of us to then go discover stuff and in that process of discovery, very sophisticated content producers could actually create content that Google’s algorithms and spiders would crawl to serve us that content,” he noted. “And one of the things that I think we did really well was create content that was very Google friendly. ” Watch the full event with Grusd and London below: https:  . facebook.    '"}, "time": 1742563490.5262883}