{"duration": 0.42510533332824707, "input_args": {"text": "\"[Photo: Jorge Lascar’s photo of the Great Wall of China] =By= Vasily Kashin Editor's Note The relationship between China and the United States has a very long history. Regardless of whatever might that the U.S. has had at a given point, the sheer power to accomplish the amazing cannot be denied – starting with the most incredible “border fence” of all time, The Great Wall of China. China has been seen as a provider of labor for centuries, from imported labor to build yet another great project, this one in the US, the transcontinental railroad, to an in situ labor force for the world. China was feared because of the number of soldiers they could use to flood and control the US, to a subservient labor force, and now as a head to head competitor for dominance of the world. \\nU.S.- Chinese relations are “the most important bilateral relations in the 21st century,” as Chinese politicians and scholars like to emphasize. Gradually, they have become a central, if not the main, narrative in world politics. Various things, ranging from Russia’s foreign policy to the situation in regions that are distant from Asia, depend on the future vector of these relations. Now, however, relations between China and the United States are going through hard times, prompting the question: How far will their disagreements go? In answering this question, it is worth recalling why the U.S. and China began to cooperate years ago, what objectives they pursued, and what results they have achieved. Fighting Communism P rerequisites for cooperation between the Communist Party of China (CPC) and the United States emerged even before the CPC took power in China in 1949. There is information that Chinese Communist leader Mao Zedong sought to establish cooperation, even though limited, with the United States when he was still at his “revolutionary base” in Yan’an. During World War II, Chinese communists had regular contacts with U.S. political and military officials in China. In 1944, the U.S. established the Army Observation Group, commonly known as the Dixie Mission, in Yan’an. Such an approach to the United States was natural for the Chinese Communist Party, regardless of how radical its doctrines were at that time. Mao was, above all, a Chinese nationalist who saw communism as a way to restore the greatness of his country. His dependence on the Soviet Union irked him (and he shook off this dependence as soon as he could). This is why his desire to conduct a multivector policy was logical and inevitable.\\nMany experienced American Sinologists, both military and civilian, reasonably spoke of certain prospects for cooperation with Chinese communists already at that time. The regime established by the president of the Republic of China, Chiang Kai-shek, was weak, corrupt and inefficient. Its stability was in doubt, and it systematically misused American economic and military aid. At the same time, U.S. experts were well aware of Mao’s desire to get out of Moscow’s shadow. A group of renowned State Department officers, known as China Hands, praised merits of Chinese communists, their effective organization, discipline and non-corruptness, as well as their willingness to make bargains with the United States. \\nTheir point of view was supported by some prominent military leaders in the U.S., including General Joseph Stilwell. But they were opposed by a group of anti-communist dogmatists led by Patrick Hurley, U.S. ambassador to China in the last years of World War II, who completely fell under the influence of the Chinese president’s family. One would think that after the communist victory on the mainland in 1949 and the expulsion of Kuomintang supporters to Taiwan, a choice in favor of cooperation with Mao was obvious. But that did not happen. After the communist victory in China, the U.S. government made no sober analysis of the new situation. The United States was seized by panic, which fueled McCarthyism. This panic blended well with effective lobbying efforts by Chiang Kai-shek and his wife Soong Mei-ling, who assigned a key role to contacts with conservative religious groups in the U.S. (both were Methodists). \\nThe result was a sweeping personnel purge, paradoxical for a developed democratic country, which involved security agencies, and the establishment of an atmosphere of suspicion and self-censorship in the field of foreign policy. The China Hands and scholars, intelligence officers and journalists who were close to the group became targets of harassment. Sometimes, even their forecasts that had become true were used as grounds for accusation. For example, John Davies, a political attaché to Stilwell and one of the organizers of the Dixie Mission, predicted that communists would win in the Chinese Civil War. He was accused of sympathizing with them and fired from the State Department. After the dismissal, Davies went to Peru where he ran a furniture business. \\nEven interference by the judicial authorities was not enough to remedy the situation and protect victims of the ideological campaign. Another prominent diplomat and Sinologist, John Service, who met with Mao in Yan’an, was fired from the State Department but was later reinstated by the Supreme Court. Yet he was assigned to head the U.S. Consulate in Liverpool without holding a diplomatic rank. \\nDevelopments in Washington’s China policy in the 1950s, influenced by the so-called “China lobby” formed by Chiang Kai-shek, shaped Sino-American relations until the end of the 1960s. The U.S. policy in the Far East was dogmatized and privatized by a small group of professional ideologists and lobbyists. Chiang successfully sold Americans a myth about a “communist threat” until the 1970s, and many people in the United States were interested in buying it. Expressing alternative points of view was dangerous. Those times have a strong association with modern Russian-American relations. \\nThe U.S. and its allies paid a high price for this policy—they paid with their political interests, territories, economic losses and thousands of lives. China, which turned into an implacable enemy of the Western world, fought against UN forces in Korea and played an important role in France’s defeat in Indochina and, later, in the U.S. defeat in Vietnam. Even the obvious breakup in Sino-Soviet relations in 1960 did not lead to immediate changes in the U.S. position. Only the disappointing course of the Cold War and the bogging down in the Vietnam trap made the United States seek a dialogue with Beijing in the late 1960s. The long-overdue and forced moves by Richard Nixon and Henry Kissinger, which resolutely cancelled out the previous 20 years of America’s East Asia policy, brought about a major, albeit belated, victory for the U.S. in the Cold War. A Rapprochement Against Russia \\nChina’s becoming a U.S. partner in the anti-Soviet coalition was the worst foreign-policy disaster for Moscow over the entire period of its global rivalry with the United States. The Soviet Union and its Communist Party saw their influence on many left-wing and national liberation movements in the Third World waning, and faced a new active and influential opponent, which later won a seat on the UN Security Council. Moscow had to deploy a large military force of hundreds of thousands of people in the Siberian and Far Eastern taiga and provide them with housing and infrastructure, which overstrained the Soviet economy. China played a key role in arming Afghan mujahideen, who fought against Soviet troops, with simple and effective Soviet-designed small arms and light weapons. Soviet aviation in Afghanistan suffered the greatest losses not from the much-touted American Stinger man-portable air defense system but from DShKM heavy machine guns, manufactured in China under the Soviet license. \\nHowever, the years 1988 and 1989 brought about major changes that eliminated basic prerequisites for the U.S.-China partnership on the old, anti-Soviet basis. The Cold War was over; Soviet troops were withdrawn from Afghanistan, and Vietnam began to pull out its troops from Cambodia; and the Soviet Union and China finally normalized their relations during Mikhail Gorbachev’s visit to Beijing in 1989. At the same time, the suppression of the protests in Tiananmen Square by the Chinese leadership clearly demonstrated that the Chinese communists did not intend to follow in the footsteps of their Soviet and Eastern European colleagues and launch democratic reforms. \\nSino-U.S. relations entered a period of crisis. After the 1989 crackdown, the West imposed economic and technological sanctions on China, some of which (for example, the arms embargo) have not been lifted by the U.S. and its allies to this day. Some Congress members called for a full revision of relations with Beijing or, at least, for their linkage to human rights in China. In 1993, President Clinton signed an order to extend most-favored nation trade privileges to China but tied it to progress on human rights issues. However, the order was never fulfilled. \\nThe two countries preserved and developed their mutual relations on the basis of two major factors—economic and ideological. By 1990, their mutual trade had reached $20 billion and had been growing by tens of percentage points a year. Foreign direct investment in China stood at $6.6 billion a year. Obviously, international companies saw China as a promising huge market and an advantageous area for production location. \\nThe Chinese government gave serious consideration to the influence of U.S. businesses on politics and paid special attention to ties with business circles. If necessary, it made large-scale one-time purchases of U.S. products, such as civilian aircraft, executive cars, or industrial equipment. By the time the Soviet Union broke up, there were many active and interested supporters of cooperation with China in the United States, who expressed their opinions to Congress and the president. Anticipating Regeneration \\nFrom an ideological point of view, after the collapse of the Soviet bloc, authoritarian communist regimes ceased to be perceived as serious opponents. The transformation and, later, complete regeneration or fall of these regimes and their transition to liberal democracy was believed to be predetermined. Back in the 1980s, the Chinese reforms evoked widespread hope in the U.S. that the communist system in China would gradually disintegrate and that even at that moment it was on the verge of collapse and rebirth (President Ronald Reagan liked to refer to that country as “so-called Communist China”). \\nThe events of 1989 only slightly shook this confidence but they did not undermine it. Moreover, it was believed that the Chinese authorities were aware of the inevitability of changes in favor of a liberal model and that they only sought to make it controllable. For ideological reasons, Washington traditionally ignored clear and unambiguous wordings of Chinese Communist Party documents about the inadmissibility of “liberal rebirth,” the increased control over the media and public life, changes in the defense policy and other “inconvenient facts.” President Bill Clinton wrote in his book My Life in 1998 about his Chinese counterpart: “The more time I spent with Jiang, the more I liked him. […] Even though I didn’t always agree with him, I became convinced that he believed he was changing China as fast as he could, and in the right direction.” \\nThe spread of the Internet in the 1990s was accompanied by over-inflated, romantic expectations and this strengthened the illusion of an inevitable and imminent rebirth of the Chinese regime. It was believed that the Chinese Communist Party’s power was incompatible with the free movement of information in the global network. Mainstream views on an inevitable regeneration of the Chinese state were set out, for example, in Clinton’s speech in Congress in March 2000, in which he advocated granting China permanent normal trade relations status. \\n“In the new century, liberty will spread by cell phone and cable modem,” the U.S. president said. “In the past year, the number of Internet addresses in China has more than quadrupled from 2 million to 9 million. […] Now, there’s no question China has been trying to crack down on the Internet—good luck. That’s sort of like trying to nail Jello to the wall. […] In the knowledge economy, economic innovation and political empowerment, whether anyone likes it or not, will inevitably go hand in hand.” \\nToday, it is an established fact that the Chinese government has created an effective system of control over the Internet and, moreover, it successfully uses new information technologies in its own interests. Clinton in 2000 mentioned a cell phone as one of the instruments of liberalization. In 2015, the Xinhua News Agency published an interesting article saying that the Political Work Department of the Chinese People’s Liberation Army began to download special applications to Chinese soldiers’ smartphones with ideological materials—texts by Mao and classics of Marxism-Leninism and tests. \\nChina is one of the strongest powers in the world in computer espionage, computer security and the use of the Internet for resolving political tasks. New technologies have not undermined the system; rather, they have strengthened it and expanded capabilities for propaganda and control. \\nThe United States has never, not for a single moment, been ready to put up with the existence of China the way it is, with its one-party political system led by the CPC. From the late 1960s and until the first achievements of Deng Xiaoping’s reforms, Washington’s China policy was based on the need to restore balance with the Soviet Union at all costs after a series of major setbacks. Later, especially after the collapse of communism in Europe, this policy was based on a holistic dogmatic worldview, which prevailed in the U.S. and which suggested that the Chinese regime was to undergo (or already was undergoing) a transformation and establish a liberal capitalist order—simply as an inevitable consequence of its economic development and modernization. \\nUntil this transformation was over, it was planned to contain China in areas where its actions would interfere with U.S. interests. It was believed that this containment would not take too much effort, as China would become transformed long before it could pose a serious problem. \\nChina’s efforts to restore and build up its military power came under close scrutiny since the second half of the 1990s. In 2000, U.S. Congress asked the Pentagon to provide annual reports on China’s military power. Yet, until the late 2000s, the West was largely derisive about China’s military buildup efforts. It thought China was incapable of creating a high-tech industry and powerful armed forces within a reasonable time. Also, the West underestimated the future rate of China’s economic expansion to Africa, Latin America and the Middle East, the growth of China’s political influence, and the enlargement of the area of its interests. \\nThe Chinese leadership was well aware of this situation and supported Washington’s illusions in every way. Beijing had different political rhetoric for domestic and foreign consumption. The country strictly abided by Deng Xiaoping’s temporarily passive foreign policy (“conceal your true potential”) and kept a low profile in world affairs. Liberal economists and political analysts that advocated cautious reforms and cooperation with the West were favored by the government. Beijing redoubled efforts to build a network of ties with major American businesses and politicians. Sometimes these efforts were ridiculous. According to testimony given by Clinton’s election campaign fundraiser Johnny Chung and published in the late 1990s, General Ji Shengde, the head of China’s military intelligence, met with Chung in Macau in August 1996 and provided him with $300,000 for Clinton’s re-election campaign. \\nNaturally, China did undergo a major social and political transformation, but over time the vector of this transformation began to veer off from the American expectations. The Chinese transformation has nothing to do with what was happening in Eastern Europe in the late 1980s-1990s. Rather, it is similar to what happened in Western Europe in the 19th century, or in Russia and Japan in the late 19th/mid-20th century. The industrialization and economic breakthrough inevitably led to a generation gap, changes in the age-old way of life and family values, economic inequality, and radicalism. Gradually, internal conflicts came to a head, and society felt the need for a “strong hand.” These tendencies were coupled with euphoria over the country’s economic and industrial progress, the rise of nationalism, the feeling of exceptionalism, and interest in one’s roots. \\nOne can definitely speak of a symbiosis of the state bureaucracy and big business, which needs to move into international markets, severe social stratification and conflicts caused by it, and the domination of leftist and nationalist ideas in public discussions, although there is a small pro-Western liberal group of “public intellectuals,” who do not have broad support. Internal problems are coupled with a desire for national revenge for the shock and humiliation experienced by the Chinese nation in the period from the mid-19th century to the mid-20th century. China’s modern ideology and culture are largely built on the comprehension and experience of this trauma. Xi Jinping even delivered his policy speech about “the Chinese dream,” understood as the rejuvenation and rebirth of the Chinese nation, when he visited a National Museum of China exhibition devoted to China’s recovery from the “century of humiliation.” \\nThe militarization of politics and the growing popularity of radical ideas is another indication that the political development of China, where more than 80 percent of the population lived in villages in 1980, is now at a stage where major European countries and Japan were 100 to 150 years ago. Political reforms conducted in such conditions can and, most likely, should be accompanied by the introduction of individual democratic institutions, but in terms of content they will be a far cry from those of Western liberal democracies of today, just as elective institutions in present-day Iran are. \\nMankind’s historical experience shows that a country can exist in such a state and even quickly develop technologically for an indefinitely long time, for decades, at least. European empires and the Empire of Japan ceased to exist not as a result of a smooth and natural regeneration but after world wars which led to the disintegration of states or foreign occupation for losing nations, or to a catastrophic overstrain for the winners. In the nuclear age, the threat of such wars has decreased. In addition, the maintenance of the nuclear shield upon its completion does not cost much (spending on the Strategic Missile Forces in Russia is less than ten percent of the national defense budget). This factor allows the country to ensure its military invulnerability, while avoiding economic overstrain and pursuing a reasonable (that is, not Soviet) defense policy. \\nThe destabilization of the ruling regime is quite possible in such circumstances, but it is hard to see how it can lead to the establishment of liberal democracy. There is information indicating that there is a great potential of discontent in Chinese society, but the demand for equality and social justice, as well as nationalism, matters much more to the population than political liberties. In a hypothetical “post-revolutionary” China, the People’s Liberation Army command, functionaries of the present CPC, and the management of state-owned companies will be much stronger than progressive professors and high-profile journalists of the business media. \\nMeanwhile, China has already become an economic superpower and a great military power. The China factor has completely changed the system of relations between suppliers and buyers of natural resources, certainly not in favor of the latter. The emergence of the new market and source of investment and technologies as an alternative to the West has instilled more confidence in the ruling regimes of developing countries that export resources and cheap labor. Some countries already can be viewed as China’s “clients,” for example, Cambodia and Laos in Southeast Asia. Partnership with China has strengthened the position of Thailand’s military government leaders who carried out a coup in the country, condemned by the United States. \\nChina is now the world’s third military and military-industrial power after the U.S. and Russia. Moreover, in some key aspects of military power, China is already ahead of Russia and has incomparably greater reserves for building up its military potential. China’s foreign policy began to change in 2013, becoming increasingly active and offensive, especially on strategic issues that are important to China (the South China Sea). In 2015, the country built its first overseas military base. Deng’s passive foreign policy is slowly receding into the past. \\nMeanwhile, prospects for China’s “transformation” are becoming increasingly dim. The country’s economic development model began to change in the late 2000s, but those changes were slow and often belated. After Xi came to power, economic changes began to be accompanied by more obvious changes in the political model, which involved sweeping anti-corruption purges in the government and the army, unprecedented centralization of power, the establishment of strict control over the media and society, and policy tightening with regard to Western organizations operating in the country. Giving Up Illusions \\nIn March 2015, The Wall Street Journal published an article, “The Coming Chinese Crackup,” by U.S. Sinologist David Shambaugh, which can be viewed as a landmark in the American comprehension of the situation in China. The author debunks and rejects the theory of China’s “transformation.” He insists that the Xi-led regime is moving in the wrong direction, in contrast to the times of Jiang Zemin and Hu Jintao, when the desired transformation did take place. Shambaugh concludes that the collapse of the regime is the only possible outcome for it. “Its demise is likely to be protracted, messy and violent,” he writes, adding that the endgame of Chinese communist rule “has progressed further than many think.” To substantiate his conclusions, the author draws parallels with the Soviet Union, which seems strange considering that the Soviet Union and present-day China are absolute opposites in terms of culture, politics and economy. The only things they had in common were “the absence of democracy” and the word “communist” in the names of their ruling parties. \\nAnyway, the belief that China will inevitably, gradually and relatively painlessly transform into a loyal member of the U.S.-led world order has been relegated to the periphery of the discussion. The incumbent regime has been given an unambiguous assessment, and its collapse (preferably, an early one) has been predicted. However, no one knows when this will happen. \\nDoubts about the possibility of China’s rapid transformation began to take root back in the late 1990s-early 2000s, but the 9/11 events temporarily shifted the focus of U.S. policy towards the Middle East. China received a strategic respite, which lasted until the Obama administration proclaimed a “pivot to Asia.” Some Chinese analysts expected that the events in Ukraine would give China another respite, but the South China Sea situation has shown that they were wrong. The Ukrainian situation has stabilized and left the global agenda, whereas the situation in the Western Pacific is attracting more and more attention. \\nThe scope of China’s containment is broadening, while the scope of U.S.-China cooperation is gradually narrowing. Of course, it is easy not to see this if one cites high volumes of U.S.-Chinese trade or the great enthusiasm for American popular culture among the Chinese. Usually, these factors are mentioned to show that U.S.-China relations are very close and productive, while elements of rivalry in these relations are secondary. Both arguments, economic and cultural, have been disproved so many times by history that it is strange that they are still in use. \\nIn the 1920s and early 1930s, Japan’s main trading partners were the United States, the British Empire, China, and the Dutch East Indies (Indonesia)—precisely the countries that Japan later attacked. Japan owed its rise to its long (until the 1920s) economic and industrial partnership with Britain; even the Japanese battleships that destroyed the Russian fleet at the Battle of Tsushima were built in British shipyards. In contrast, Germany and Italy, Japan’s allies during World War II, did not play a significant role in Japan’s trade in prewar years. The British Empire and France were major trading partners of Germany before both world wars. Germany was the largest economic partner of Russia before the First World War; it accounted for half of Russia’s imports and was its major source of technologies and investment. \\nThe present U.S. soft power is a mere apology for the soft power of France in the 18th-early 19th century. There were times when the aristocracies of many European countries spoke French. For years, France was the only trendsetter in fashion and arts, and traces of those times can still be seen today in the Russian language. As we know, this universal love of France did not save it. Russian francophone aristocrats brought Bashkir cavalry regiments to Paris. The First World War was fought among European empires, whose ruling dynasties and leading families were connected by ties of blood. Great Japanese Admiral Isoroku Yamamoto, who masterminded the attack on Pearl Harbor, was quite an Americanophile, because he studied in the United States and worked there for many years. Many educated Japanese in those times were strongly influenced by English and American culture. \\nConfrontation between the two giants of the contemporary world will grow slowly, of course. Conflicts among European empires before World War I grew slowly, too. The United States and China will continue to develop their mutual trade and cooperation in various fields. Over a century ago, more than two decades passed from the formation of the Franco-Russian alliance of 1891 to an open clash among the great powers in WWI. During all those years, numerous statements kept emphasizing that a direct conflict among the great powers was impossible in “our civilized age of trade, investment and progress.” \\n\\nVassily Kashin is Ph.D. in Political Science, is a senior research fellow at the Center for Comprehensive European and International Studies at the National Research University—Higher School of Economics. He is also a leading research fellow at the Institute of the Russian Far East. \\nNote to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742561876.418731}