{"duration": 0.0069048404693603516, "input_args": {"text": "'Τα ιμέιλ της Χίλαρι Κλίντον και η Μουσουλμανική Αδελφότητα του Τιερί Μεϊσάν Η έρευνα από το FBI των ιδιωτικών μηνυμάτων ηλεκτρονικού ταχυδρομείου της Χίλαρι Κλίντον δεν αφορούν μια αμέλεια σχετικά με τους κανονισμούς ασφαλείας, αλλά γίνεται για συνομωσία με σκοπό να εξαφανιστεί κάθε ίχνος της αλληλογραφίας της, η οποία θα έπρεπε να είχε αποθηκευτεί σε διακομιστές του Ομοσπονδιακού Κράτους των ΗΠΑ. Μπορεί να περιλαμβάνει συναλλαγές για παράνομες χρηματοδοτήσεις ή διαφθορά, άλλες για τους δεσμούς των συζύγων Κλίντον με τους Αδελφούς Μουσουλμάνους και τους τζιχαντιστές.\\nΔίκτυο Βολταίρος | Δαμασκός (Συρία) | 1er novembre 2016 English Español français Türkçe русский Deutsch Η Χίλαρι Κλίντον και η επικεφαλής του προσωπικού γραφείου της, Χούμα Αμπεντίν. Η αναβίωση της έρευνας από το FBI των ιδιωτικών μηνυμάτων ηλεκτρονικού ταχυδρομείου της Χίλαρι Κλίντον δεν αφορά πλέον θέματα ασφάλειας, αλλά μικρο-κομπίνες που θα μπορούσαν να φτάσουν μέχρι εσχάτη προδοσία.\\nΑπό τεχνική άποψη, αντί να χρησιμοποιεί έναν ασφαλή διακομιστή της Ομοσπονδιακής Κυβέρνησης, η Υπουργός Εξωτερικών είχε εγκαταστήσει στο σπίτι της έναν ιδιωτικό διακομιστή, έτσι ώστε να μπορούσε να χρησιμοποιήσει το Διαδίκτυο χωρίς να αφήνει ίχνη σε συσκευή του ομοσπονδιακού κράτους. Ο ιδιωτικός τεχνικός της κας Κλίντον είχε καθαρίσει το σέρβερ της πριν από την άφιξη του FBI, οπότε δεν ήταν δυνατόν να γνωρίσει κανείς γιατί είχε εγκαταστήσει αυτή τη συσκευή.\\nΑρχικά, το FBI σημείωσε ότι ο ιδιωτικός διακομιστής δεν είχε το σύστημα ασφάλειας των διακομιστών του Στέιτ Ντιπάρτμεντ. Ως εκ τούτου, η Κλίντον δεν είχε διαπράξει παρά μόνο ένα σφάλμα ασφάλειας. Σε δεύτερο στάδιο, το FBI κατέσχεσε τον υπολογιστή του πρώην μέλους του Κογκρέσσου, Anthony Weiner. Ο τελευταίος είναι ο πρώην σύζυγός της Χούμα Αμπεντίν, επικεφαλής του προσωπικού γραφείου της Χίλαρυ. Βρέθηκαν μηνύματα ηλεκτρονικού ταχυδρομείου από την Υπουργό Εξωτερικών.\\nΟ Anthony Weiner είναι ένας εβραίος πολιτικός, πολύ κοντά στη Κλίντον, ο οποίος φιλοδοξούσε να γίνει δήμαρχος της Νέας Υόρκης. Αναγκάστηκε να παραιτηθεί μετά από ένα πολύ πουριτανικό σκάνδαλο: είχε στείλει ερωτικά SMS σε μια νεαρή γυναίκα που δεν ήταν η σύζυγος του. Η Χούμα Αμπεντίν τον χώρισε επίσημα κατά τη διάρκεια αυτής της αναταραχής, αλλά στην πραγματικότητα δεν τον άφησε.\\nΗ Χούμα Αμπεντίν είναι μια Αμερικανίδα που μεγάλωσε στη Σαουδική Αραβία. Ο πατέρας της διευθύνει ένα ακαδημαϊκό περιοδικό –του οποίου ήταν η ίδια για χρόνια γραμματέας της σύνταξης- το οποίο αναπαράγει τακτικά τις θέσεις της Μουσουλμανικής Αδελφότητας. Η μητέρα της προεδρεύει το σαουδαραβικό σύλλογο των γυναικών που είναι μέλη της Αδελφότητας και συνεργαζόταν με τη σύζυγο του προέδρου της Αιγύπτου Μοχάμεντ Μόρσι. Ο αδελφός της Χασάν εργάζεται για λογαριασμό του Σεΐχη Yusuf al-Qaradawi, ιεροκήρυκα των Αδελφών και πνευματικού σύμβουλου της Αλ-Τζαζίρα.\\nΜε την ευκαιρία μιας επίσημης επίσκεψης στη Σαουδική Αραβία, η Υπουργός Εξωτερικών επισκέπτεται το κολέγιο Dar al-Hekma συνοδευομένη από την Σαλέχα Αμπεντίν (μητέρα της επικεφαλής του προσωπικού της γραφείου), πρόεδρο του Συλλόγου των γυναικών Αδελφών μελών της Αδελφότητας . Η Χούμα Αμπεντίν είναι σήμερα μια κεντρική φιγούρα της εκστρατείας της Κλίντον, δίπλα στον διευθυντή της εκστρατείας, John Podesta, πρώην Γενικό Γραμματέα του Λευκού Οίκου υπό την προεδρία του Μπιλ Κλίντον. Ο Podesta είναι επίσης ο επίσημος λομπίστας του Βασιλείου της Σαουδικής Αραβίας στο Κογκρέσο με τη μικρή αμοιβή των 200 χιλιάδων δολαρίων μηνιαίως. Στις 12 Ιουνίου του 2016, η Πέτρα (Petra), το επίσημο πρακτορείο ειδήσεων της Ιορδανίας, δημοσίευσε μια συνέντευξη με τον Σαουδάραβα πρίγκιπα κληρονόμο του στέμματος, Μοχάμεντ μπιν Σαλμάν, ο οποίος διαφήμιζε τον εκσυγχρονισμό της οικογένειάς του που είχε χρηματοδοτήσει παράνομα στο ύψος του 20% την προεκλογική εκστρατεία της Χίλαρι Κλίντον, παρότι είναι γυναίκα. Μια ημέρα μετά από αυτή τη δημοσίευση, το πρακτορείο ακύρωσε το τηλεγράφημα και ισχυριζόταν ότι ο ιστοτόπος του είχε πέσει θύμα πειρατείας.\\nΣύμφωνα με το ιορδανικό πρακτορείο ειδήσεων Petra στις 12 Ιουνίου 2016, η σαουδαραβική βασιλική οικογένεια έχει χρηματοδοτήσει παράνομα το 20% της προεκλογικής εκστρατείας της Χίλαρι Κλίντον. Η κα Αμπεντίν δεν είναι το μόνο μέλος της κυβέρνησης Ομπάμα που συνδέεται με την Αδελφότητα. Ο ετεροθαλής αδελφός του προέδρου, Abon’go Μαλίκ Ομπάμα, είναι ταμίας της Ιεραποστολής των Αδελφών στο Σουδάν και του πρόεδρος του Ιδρύματος Μπαράκ H. Ομπάμα. Βρίσκεται άμεσα κάτω από την εντολή του προέδρου του Σουδάν Omar al-Bashir. Ένας Μουσουλμάνος Αδελφός είναι μέλος του Συμβουλίου Εθνικής Ασφαλείας -το ανώτατο εκτελεστικό όργανο των ΗΠΑ-. Από το 2009 έως το 2012, ήταν ο Mehdi Κ Alhassani. Δεν είναι γνωστό ποιος τον διαδέχθηκε, αλλά ο Λευκός Οίκος αρνιόταν ότι ένας Αδελφός είναι μέλος του Συμβουλίου έως ότου προέκυψε η απόδειξη. Επίσης, ένας Αδελφός είναι πρεσβευτής των Ηνωμένων Πολιτειών στην Ισλαμική Διάσκεψη, ο Rashad Hussain. Οι άλλοι ταυτοποιημένοι Αδελφοί καταλαμβάνουν λιγότερο σημαντικές θέσεις. Ωστόσο, πρέπει να αναφέρουμε τον Louay Μ Safi, νυν μέλος του Εθνικού Συνασπισμού της Συρίας και πρώην σύμβουλος του Πενταγώνου.\\nΟ πρόεδρος Ομπάμα και ο ετεροθαλής αδελφός του Abon’go Μαλίκ Ομπάμα στο Οβάλ Γραφείο. Ο Abon’go Malik είναι ταμίας της Ιεραποστολής της Μουσουλμανικής Αδελφότητας στο Σουδάν. Τον Απρίλιο του 2009, δύο μήνες πριν από την ομιλία του στο Κάιρο, ο πρόεδρος Ομπάμα δέχθηκε κρυφά μια αντιπροσωπεία της Αδελφότητας στο Οβάλ Γραφείο. Είχε ήδη καλέσει, κατά τη διάρκεια της ενθρόνισης του, την Ingrid Mattson, πρόεδρο του Συλλόγου των Μουσουλμάνων Αδελφών και γυναικών Αδελφών των Ηνωμένων Πολιτειών.\\nΑπό την πλευρά του, το Ίδρυμα Κλίντον χρησιμοποίησε ως υπεύθυνο του σχεδίου \"Κλίμα\" τον Gehad el-Haddad, ένας από τους παγκόσμιους ηγέτες της Αδελφότητας ο οποίος μέχρι τότε ήταν υπεύθυνος μιας τηλεοπτικής κορανικής εκπομπής. Ο πατέρας του ήταν ένας από τους συνιδρυτές της Αδελφότητας το 1951 όταν αναδημιουργήθηκε από τη CIA και το MI6. Ο Gehad αποχώρησε από το Ίδρυμα το 2012, όταν έγινε εκπρόσωπος στο Καΐρο του υποψηφίου Μοχάμεντ Μόρσι, και ύστερα επίσημος εκπρόσωπος της Μουσουλμανικής Αδελφότητας σε παγκόσμια κλίμακα.\\nΓνωρίζοντας ότι όλοι οι τζιχαντιστές ηγέτες του κόσμου είτε προέρχονται από την Αδελφότητα είτε από το σουφικό Τάγμα των Naqshbandi -τις δύο συνιστώσες του Μουσουλμανικού Παγκόσμιου Συνδέσμου, ήτοι της σαουδαραβικής αντι-αραβικής εθνικιστικής οργάνωσης- θα θέλαμε να μάθουμε περισσότερα για τις σχέσεις της κας Κλίντον με τη Σαουδική Αραβία και τους Αδελφούς.\\nΈτυχε ότι στην ομάδα του αντιπάλου της, Ντόναλντ Τραμπ, υπάρχει ο στρατηγός Michael T. Flynn, ο οποίος προσπάθησε να αντιταχθεί στην ίδρυση του Χαλιφάτου από τον Λευκό Οίκο και παραιτήθηκε από την ηγεσία της Defense Intelligence Agency (DIA, στρατιωτική υπηρεσία πληροφοριών) για να τονίσει την αποδοκιμασία του. Τρίβεται εκεί με τον Frank Gaffney, έναν ιστορικό «ψυχρό πολεμιστή», ο οποίος χαρακτηρίζεται ως «συνωμοσιολόγος» επειδή κατήγγειλε την παρουσία των Αδελφών στο Ομοσπονδιακό Κράτος.\\nΕίναι αυτονόητο ότι, κατά την άποψη του FBI, κάθε υποστήριξη σε τζιχαντιστικές οργανώσεις είναι έγκλημα, ανεξάρτητα από την πολιτική της CIA. Το 1991, οι αστυνομικοί -και ο γερουσιαστής Τζον Κέρι- είχαν προκαλέσει την πτώχευση της πακιστανικής τράπεζας BCCI (παρότι έδρευε στα νησιά Καϋμάν) την οποία χρησιμοποιούσε η CIA για ποίκιλες μυστικές επιχειρήσεις με τη Μουσουλμανική Αδελφότητα, καθώς και με τα Λατίνο-καρτέλ των ναρκωτικών.\\nΤιερί Μεϊσάν Μετάφραση\\nΚριστιάν Άκκυριά\\nΠηγή\\nΙνφογνώμων Πολιτικά (Ελλάδα)'"}, "time": 1742562782.8273973}