{"duration": 0.07054662704467773, "input_args": {"text": "'\\nBy James Holbrooks\\nAs the American corporate media continues to tow the official line that Russia is working to undermine U.S. elections, the head of the U.K.’s MI5 spoke with the Guardian on Tuesday. It was the first time an acting spy chief has given a newspaper interview in the agency’s 107-year history, and the subject matter important enough to prompt such an atypical occurrence was hardly a surprising one — Russia.\\nOr, more accurately, Russia as the big bad enemy.\\n“Russia increasingly seems to define itself by opposition to the west and seems to act accordingly,” MI5 chief Andrew Parker told the Guardian . “You can see that on the ground with Russia’s activities in Ukraine and Syria. But there is high-volume activity out of sight with the cyber-threat.” \\n“Russia has been a covert threat for decades,” he continued. Then, evoking the U.S. election hacking hype, he added, “What’s different these days is that there are more and more methods available.” \\nAnd according to Parker, Vladimir Putin’s Russia is utilizing these methods in “increasingly aggressive ways” to project its global influence:\\n“It is using its wide range of state organs and powers to push its foreign policy abroad in increasingly aggressive ways — involving propaganda, espionage, subversion and cyber-attacks. Russia is at work across Europe and in the U.K. today.” \\nThe Kremlin was quick to issue a response to the Parker interview, one the Guardian detailed in a follow-up piece .\\n“Those words do not correspond to reality,” spokesperson Dmitry Peskov said flatly. With regard to alleged U.S. election tampering, he added, “Until someone produces proof, we will consider those statements unfounded and groundless.” \\nRussia’s embassy in London, meanwhile, stated on Twitter it was “saddened to see a professional trapped to [sic] his own propaganda-created world.” Accompanying that tweet was the movie poster for the 1966 film The Russians are Coming, the Russians are Coming .\\nIn the buildup to the U.S. presidential election on November 8 — and as Russian submarines are spotted off the British coast — Western nations are again amping up the anti-Russian narrative .\\nOn October 7, for instance, the United States officially accused Russia of attempting to intervene in the U.S. political system. Then, just days ago, Western member countries of the G7 alliance agreed that continued sanctions against Russia for its role in Ukraine and Syria were “vital.” \\nFor his part, Russian President Vladimir Putin’s response to such recriminations has been largely one of amusement, as demonstrated by comments he made last week.\\nWhile speaking to foreign policy experts in Sochi, Putin dismissed the “hysteria about Russia’s influence on the U.S. presidential election,” adding the “mythical and fictitious” issue has been used to distract the American voter from real problems facing the United States government.\\n“Does anyone seriously think Russia can somehow influence the American people’s choice?” Putin asked. “Is America some kind of banana republic? America is a great power!” \\nA great power, the Russian president made certain to note, with a top notch propaganda arm:\\n“I would like to have such propaganda machine in Russia, but, regrettably, there is no such thing,” Putin said, touching on the bought and paid for nature of Western corporate media. “We don’t have such global media as CNN, BBC and others.” Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Anti-Media of theantimedia.org . \\nThe “Anti” in our name does not mean we are against the media, we are simply against the current mainstream paradigm. The current media, influenced by the industrial complex, is a top-down authoritarian system of distribution—the opposite of what Anti-Media aims to be. At Anti-Media, we want to offer a new paradigm—a bottom-up approach for real and diverse reporting. We seek to establish a space where the people are the journalists and a venue where independent journalism moves forward on a larger and more truthful scale. '"}, "time": 1742561835.873226}