{"duration": 0.23122072219848633, "input_args": {"text": "'MONTAGUE, Mass.  —   Think of all the dogs out there: labradors and poodles and labradoodles huskies and westies and dogues de Bordeaux pit bulls and spaniels and lovable mutts that go to doggy day care. Add them up, all the pet dogs on the planet, and you get about 250 million. But there are about a billion dogs on Earth, according to some estimates. The other 750 million don’t have flea collars. And they certainly don’t have humans who take them for walks and pick up their feces. They are called village dogs, street dogs and   dogs, among other things, and they haunt the garbage dumps and neighborhoods of most of the world. In their new book, “What Is a Dog? ,” Raymond and Lorna Coppinger argue that if you really want to understand the nature of dogs, you need to know these other animals. The vast majority are not strays or lost pets, the Coppingers say, but rather superbly adapted scavengers  —   the closest living things to the dogs that first emerged thousands of years ago. Other scientists disagree about the genetics of the dogs, but acknowledge that   of a billion dogs are well worth studying. The Coppingers have been major figures in canine science for decades. Raymond Coppinger was one of the founding professors at Hampshire College in Amherst, and he and Lorna, a biologist and science writer, have done groundbreaking work on sled dogs, herding dogs,   dogs, and the origin and evolution of dogs. “We’ve done everything together,” he said recently as they sat on the porch of the house they built, set on about 100 acres of land, and talked at length about dogs, village and otherwise, and the roots of their deep interest in the animals. Both had dogs as children. Lorna had several kinds. An uncle brought Ray his first dog, a pup from a female that hung around a loading ramp at a chemical plant in Cambridge, Mass. “He lived to be 17  —   he looked like any other village dog in the world,” he said. After they graduated from Boston University, where they were both undergraduates in the late 1950s, they continued to keep them. “I gave her a dog for a graduation present,” he said. It was reputedly a   mix. After they both graduated, they moved to the Amherst area, where Lorna taught Russian and received a master’s degree in wildlife biology and Ray pursued a Ph. D. in zoology, both at the University of Massachusetts. They did field studies together, but on different subjects, and then dove deeply into the canine world. A neighbor raced sled dogs, and one thing led to another until Dr. Coppinger started racing them himself and they had a hundred dogs housed in cement dens on a hill behind his house. In 1969, he joined Hampshire College as part of the founding faculty, and continued researching energy expenditure in the dogs. He also developed a winning strain by hybridizing Alaskan village dogs with Border collies. For the first time in their lives together, the Coppingers are now without any dogs at home, and they talk with some nostalgia, more about the bad dogs than the good. Like Jane. “Worst dog I ever had,” Dr. Coppinger said. “I could tell you a thousand bad stories about Jane. ” “But,” he said, “put her on a mountain pass behind 3, 000 sheep, and she’d worry them all the way up the mountain and pick up the strays and everything. ” They don’t miss having dogs by the score, but Ms. Coppinger said, “I miss the pet dogs. ” The last, who died in 2013, was Poppyseed Shackleton, a Jack Russell terrier who belonged to their grandchildren, but lived with them. One benefit, however, is that they are enjoying observing a flood of wildlife that avoided their land when so many dogs were around  —   vultures, foxes, deer and other animals. In the early 1970s, they began studying   dogs and traveled around the world finding dogs that sheep herders used. They brought some home and helped develop the Anatolian shepherd breed in the United States, and started a livestock   project at Hampshire to study how effective dogs were in protecting sheep and other livestock. In 2001, their book “Dogs: A Startling New Understanding of Canine Origin, Behavior  Evolution” challenged the way scientists thought about the beginnings of dogs. They argued against the widely held view that one day a   grabbed a wolf pup from a den and started a breeding program. Instead, they argued, dogs domesticated themselves. Some wild canines started hanging around humans for their leftovers and gradually evolved into scavengers dependent on humans. Not everyone in canine science shares that view today, but many researchers think it is the most plausible route to domestication. During their travels over the years  —   to look for sheepdogs, to introduce them to sheep farmers who hadn’t used dogs, to attend conferences  —   they noticed dogs in the street wherever they went, and after a while they began to think about the dogs’ lives. “They were so much more interesting than what we’d ever done before,” Dr. Coppinger said. “Here were animals that had their own unique kind of social behaviors. So we started to study them. ” That was in the early 1990s. He worked with Luigi Boitani of La Sapienza University of Rome, who was studying urban dogs that lived off garbage. “I taught classes in the Mexico City dump,” Dr. Coppinger said. And the Coppingers continued to observe village dogs around the world. They argue in their new book that these dogs “are not mongrels or strays,” as is often assumed. Some lost pets do wander into groups of village dogs. But by and large, these dogs are much the same around the world, whether in Africa, Mongolia, China or the Americas. Dr. Coppinger said he was once told by a Navajo sheep herder that a good herding dog was “not too big and not too small,” which perfectly describes village dogs, too. They are larger in colder climates, but in the tropics, he said, a     dog is the norm. They are completely polygamous. “There can be as many fathers to a litter of puppies as there are puppies to a litter,” Dr. Coppinger said. And after about 10 weeks, the puppies fend for themselves. Most of the pups don’t survive, as is the case with many wild animals. They have remarkably varied connections to human beings. Some live completely on their own at dumps. Some are neighborhood dogs, recognized and perhaps given handouts by people who live in a certain area. Others may feed and breed on their own, but spend nights at the homes of people. Sometimes they are adopted by people. But really, Dr. Coppinger says, it is the dogs who adopt humans. The number of dogs that can survive in a city or a neighborhood or at a dump is determined by the available garbage. The Coppingers calculated that in the tropics it takes about 100 people to produce enough garbage to support seven   dogs. There is precious little funding for studying these dogs, except in the context of preventing rabies, which is an enormous problem, with close to 60, 000  human deaths a year, mostly from dog bites. But some scientists have tracked their behavior. Sunil K. Pal in India has studied them and written a number of papers on their social lives and behavior. The Coppingers were joined for the recent conversation at their home by Kathryn Lord, a former student of Dr. Coppinger and now a researcher at Hampshire College, who studies the development and reproductive behavior of dogs, including village dogs. She shared her insights on what makes a dog a dog, and not a wolf, for example. Wolf puppies depend on their parents and other adults regurgitating partly digested food. “This is all but lost in dogs,” she said. It does happen, but reports suggest that in village dogs it may occur several times a week. Among wolves in the wild, she said, “it’s seven times a day,” and it is an uncontrollable reflex. In one experiment, she tried testing adult wolves by putting them into a pen with unrelated pups after a big steak meal. “They’d actually run around with their heads in the air to avoid the puppies,” she said. “Eventually they’d lose their lunch. ” At which point they would run off and let the youngsters have at it. The point the Coppingers and Dr. Lord make about these behaviors is not that dogs are somehow less caring or noble than wolves, but how perfectly adapted they are to the lives they lead. They don’t need to be big and strong to bring down prey. They don’t need the kind of parental care and hunting instruction that wolf pups get. As Dr. Lord said, dog pups don’t need to catch and kill anything. “They need to walk up to a rotten melon and eat it, which they can do at 10 weeks. ” Puppies, after they are weaned, cannot compete with adults, so unless disease or dogcatchers have put a dent in the adult population, most of them starve. They have a true superpower in reserve, however, that can help them escape their fate. They can convince a human to feed them. Dr. Coppinger recalled a woman in South Africa who had many dogs in and around her house. He asked her how it happened that she had so many dogs. “I don’t know,” he recalled the woman saying. “They just keep coming. ” But what are village dogs? Are they a breed, or a superbreed apart? Or are they just a mixture of many breeds with origins too messy to trace? Adam Boyko, a biologist at the Cornell University College of Veterinary Medicine, who was inspired to pursue canine science by the Coppingers’ 2001 book, has also compiled DNA from village dogs around the world. One of his research papers concluded that village dogs in Mongolia are at the center of dog diversity. That suggests that they are geographically nearest to the place where dogs first evolved. Other evidence has suggested that dogs originated in Europe or China, however, and Dr. Boyko is one of a number of participants in a major study being led by Greger Larson at Oxford to use ancient DNA and fossils to clear up some of the confusion about the origins of dogs. And other village dogs seem to have different genetic makeup. For example, Dr. Boyko and his colleagues analyzed DNA samples from village dogs on remote islands in Fiji and French Polynesia that he hoped would show a historical pattern of migration as people and their dogs moved from place to place. “Almost without exception the dogs were 99 percent European,” he said, meaning their ancestors were dogs on European ships that came to Pacific islands ages ago. Dogs in other places, like Borneo, he said, show almost no trace of European breeds. In a study published last fall, Wieslaw Bogdanowicz at the Polish Academy of Sciences in Warsaw led an international team of scientists in analyzing the DNA of   dogs in Eurasia. He concluded that these dogs were different from purebreds and mixed breeds. “I would like to call them a superbreed,” he said. He also found that modern European street dogs trace their ancestry to East Asian dogs that migrated with humans to Europe. Earlier studies place that migration sometime between 4, 000 and 11, 000 years ago. Beyond that, however, lies the ultimate origin of dogs, which is still clouded in mystery. The consensus among scientists is that dogs evolved from ancient wolves, perhaps ones not found in the fossil record, 15, 000 or more years ago. Dr. Coppinger has suggested that dogs evolved after the invention of agriculture, perhaps around 8, 000 years ago, and that today’s village dogs are the closest to these first dogs. But this idea has little support from other scientists. The Coppingers’ main goal is to draw attention to the world’s vast majority of dogs that are hidden in plain sight. They represent a treasure trove of scientific information. Although the Coppingers recognize the social cost of animals that are unvaccinated and running free, they argue that killing the dogs, as some countries do during rabies epidemics, does not help. It’s impossible to kill them all, and because they breed rapidly, the population quickly rebounds. Nor do the Coppingers have any sympathy for rescue groups that, as Dr. Coppinger puts it, “kidnap and mutilate” street dogs from the Caribbean and elsewhere to bring them to American shelters to live as pets, “where they are made totally dependent and entirely restricted. ” This is supposed to benefit the dogs, but Dr. Coppinger argues that they are taken from a rich social environment, with many dogs, to lives of relative isolation. What to do? The Coppingers suggest a simple answer. One way or another village dogs depend on garbage. If society wants fewer dogs in the street, there’s a surefire solution. Less garbage.'"}, "time": 1742564139.7076933}