{"duration": 0.15300369262695312, "input_args": {"text": "'Morley Safer, a CBS television correspondent who brought the horrors of the Vietnam War into the living rooms of America in the 1960s and was a mainstay of the network’s newsmagazine “60 Minutes” for almost five decades, died on Thursday at his home in Manhattan. He was 84. His wife, Jane Safer, said he died of pneumonia. Mr. Safer was one of television’s most celebrated journalists, a durable reporter familiar to millions on “60 Minutes,” the Sunday night staple whose signature is a relentlessly ticking stopwatch. By the time CBS announced his retirement on May 11, Mr. Safer had broadcast 919 “60 Minutes” reports, profiling international heroes and villains, exposing frauds and corruption, giving voice to   and chronicling the trends of an   America. Mr. Safer joined the program, created by Don Hewitt, in 1970, two years after its inception. His tenure eventually outlasted those of his colleagues Mike Wallace, Dan Rather, Harry Reasoner, Ed Bradley and Andy Rooney, as he became the senior star of a new repertory group of reporters on what has endured for decades as the most popular and profitable news program on television. But to an earlier generation of Americans, and to many colleagues and competitors, he was regarded as the best television journalist of the Vietnam era, an adventurer whose vivid reports exposed the nation to the hard realities of what the writer Michael J. Arlen, in the title of his 1969 book, called the “  War. ” With David Halberstam of The New York Times, Stanley Karnow of The Washington Post and a few other print reporters, Mr. Safer shunned the censored, euphemistic Saigon press briefings they called the “5 o’clock follies” and went out with the troops. Mr. Safer and his Vietnamese cameraman, Ha Thuc Can, gave Americans powerful   of firefights and    missions filmed hours before airtime. The news team’s helicopter was shot down once, but they were unhurt and undeterred. In August 1965, Mr. Safer covered an attack on the hamlet of Cam Ne about 10 miles west of the port city of Da Nang. Intelligence had identified Cam Ne as a Vietcong sanctuary, though it had been abandoned by the enemy before the Americans moved in. Mr. Safer’s account depicted Marines, facing no resistance, firing rockets and machine guns into the hamlet burning its thatched huts with flamethrowers, grenades and cigarette lighters as old men and women begged them to stop then destroying rice stores as the villagers were led away sobbing. “This is what the war in Vietnam is all about,” he reported. “The Vietcong were long gone. The action wounded three women, killed one baby, wounded one Marine and netted four old men as prisoners. Today’s operation is the frustration of Vietnam in miniature. To a Vietnamese peasant whose home means a lifetime of backbreaking labor, it will take more than presidential promises to convince him that we are on his side. ” Broadcast on the “CBS Evening News,” then anchored by Walter Cronkite, and widely disseminated, the report and its images stunned Americans and were among the most famous television portraits of the war. They provoked an angry outburst from President Lyndon B. Johnson, who excoriated Frank Stanton, the president of CBS, in a midnight phone call and ordered Mr. Safer investigated as a possible Communist. He was cleared. For three weeks in 1967, Mr. Safer toured China, then in the throes of Mao Zedong’s Cultural Revolution, posing as a Canadian tourist (he was born in Canada) because Western reporters were barred. Then, as CBS London bureau chief, he covered a war in the Middle East, the Soviet invasion of Czechoslovakia, strife in Northern Ireland and civil war in Nigeria, where he was expelled for reporting thefts from relief supplies intended for Biafran refugees. In 1970, he swapped the foreign correspondent’s fatigues for the dapper suits and silk handkerchiefs of “60 Minutes,” American TV’s first news and entertainment hybrid with a magazine format. He was soon contributing celebrity interviews and stylish essays to complement the investigative exposés of Mr. Wallace, the veteran CBS inquisitor, who died in April 2012. Over the next four decades Mr. Safer profiled writers, politicians, opera stars, homeless people and the unemployed, and produced features on shoddy building practices, strip mining, victims of bureaucracy, waterfront crime, Swiss bank accounts, heart attack treatments, problems of sleeplessness, cultural nabobs and other subjects, many suggested by staff members and viewers. In contrast to the often abrasive Mr. Wallace, Mr. Safer produced witty pieces on the lighter side of life: the game of croquet, Tupperware parties, children’s beauty pageants, experiments in communication with apes, and   Abu Dhabi, capital of the United Arab Emirates  —   “a place,” as he put it, “with free housing, free furniture, free color television, free electricity, free telephones, no property taxes, no sales taxes  —   no taxes, period. ” His serious journalism included a 1983 investigative report in which he cited new evidence that helped free Lenell Geter, a black engineer wrongly convicted of an armed robbery and sentenced to life in prison in Texas. Mr. Safer’s report was not the first on the case, but it drew national attention that led to its official reconsideration. In the studio or reporting on the road  —   he often traveled 200, 000 miles a year for “60 Minutes”  —   Mr. Safer was an affable interviewer, asking questions the man in the street might if he had the chance. He was well aware of television’s power to exploit emotions and was typically moderate, if persistent, in his commentaries. Still, Mr. Safer sometimes raised hackles, as when he questioned the basic premise of abstract art in a 1993 report, calling much of it “worthless junk” destined for “the trash heap of art history” and saying it was overvalued by the “hype” of critics, art dealers and auction houses. The art world recoiled, but Mr. Safer, who described himself as a “Sunday painter,” stood his ground. In 2012, he aired another blast at modern art, visiting a Miami Beach show that he called “an upscale flea market” and complaining that “the art trade” was a “booming cutthroat commodities market. ” In a commentary, the New York Times art critic Roberta Smith called Mr. Safer’s performance “a relatively toothless, if still quite clueless, exercise,” adding: “Basically, he and his camera crew spent a few hours last December swanning around Art Basel Miami Beach, the hip art fair, and venturing nowhere else, letting the spectacle of this event, passed through quickly and superficially, stand for the whole art world. ” Suave, casual, impeccably tailored, with a long, craggy face, receding gray hair and a wide, easy smile, Mr. Safer was something of a Renaissance man. He baked pies and cakes (but swore he did not eat them) played pétanque (a French version of bocce) pounded out scripts on a manual typewriter long after computers became ubiquitous, and painted watercolors of the interiors of countless hotel and motel rooms he had occupied. In 1980, he even had a show at a SoHo gallery. Why, he was asked in 1980, create still lifes in a transient world? “It’s 11:30 at night,” he replied. “I turn on Johnny Carson, I pick up my paints, and it wipes my mind out. ” Morley Safer was born in Toronto on Nov. 8, 1931, the son of Max and Anna Cohn Safer. His father owned an upholstery shop. Mr. Safer studied at the University of Western Ontario, now Western University. He was a reporter for two small newspapers in Ontario and worked for Reuters in London before joining the Canadian Broadcasting Corporation in 1955. As a CBC correspondent over the next three years, he covered conflicts in the Middle East and Cyprus and the Algerian revolution. In 1958, he produced and appeared on “CBC News Magazine. ” Sent to CBC’s London bureau in 1961, he covered major events in Europe, the Middle East and Africa in the early 1960s. He joined the CBS London bureau in 1964. In 1965, he went to Vietnam and soon began filing reports that changed the way many Americans perceived the war. In 1968, he married Jane Fearer, an anthropologist and author. He is also survived by their daughter, Sarah Safer a brother and sister and three grandchildren. He had homes in Manhattan and Chester, Conn. In 1989, Mr. Safer went back to Vietnam for a “60 Minutes” report and interviewed people whose lives had been touched by the war. He also wrote a   book, “Flashbacks: On Returning to Vietnam” (1990) with a chapter on Pham Xuan An, a Time magazine war correspondent who had secretly spied for Hanoi. Mr. Safer held no grudges. “He has done his best to follow his conscience,” he wrote. Mr. Safer won many awards, including Emmys, Peabodys and the George Polk Award for career achievement. In recent years, he worked part time for “60 Minutes. ” Still, his 2009 profile of the legendary Vogue editor Anna Wintour, who rarely gave interviews, was the talk of the fashion world. When he retired, CBS broadcast an hourlong special, “Morley Safer: A Reporter’s Life,” in which he revealed that he had not really liked being on television. “It makes me uneasy,” he said. “It is not natural to be talking to a piece of machinery. But the money is very good. ”'"}, "time": 1742563264.7286367}