{"duration": 0.0634305477142334, "input_args": {"text": "'AMATRICE, Italy  —   As relatives of the missing and the dead tearfully made their way to the makeshift morgue here in Amatrice,   rescuers worked Thursday in sweaty shifts, hoping to find people still alive under the remains of buildings destroyed by the earthquake in central Italy. Excavation machines moved rubble onto trucks to clear the streets of this quiet mountain town on Thursday, even as two strong aftershocks  —   among more than 400 since the 6.  earthquake struck at 3:36 a. m. on Wednesday  —   jolted Amatrice again. One volunteer who was flown in by helicopter as part of a United Nations    team, Alessandro Dalvit, and his dog Muttley found 16 bodies, including those of an    boy and his parents. “One, two, three, four, five, six, seven  —   dead, morti,” Mr. Dalvit said, showing photographs on his cellphone, ending with an image of a row of coffins. “At least you are able to give the bodies back to their families. ” As of Friday morning, the death toll stood at 267, including victims from towns like Amatrice and Accumoli, both in the Lazio region, and the village of Arquata del Tronto, in the neighboring Marche region. The figure could rise again, given that some people remain unaccounted for. “For this phase, it’s important that we continue to dig through the rubble and also offer assistance to the population, providing beds, and food, and letting them know that they’re not alone,” Nicola Zingaretti, the president of the Lazio Region, said as he walked briskly through the Amatrice neighborhood where various emergency coordination operations had been set up. “In tragedy there is complete solidarity. ” The number of missing in Amatrice remained unclear on Thursday, as local residents wondered aloud about tourists and seasonal workers, mostly from Romania, who arrive during the busy summer months. Romanian officials confirmed that five of their citizens had died in the quake, that four had been injured and that 11 others were missing. Two Spaniards also died, Italian officials said. Speaking from Rome, Immacolata Postiglione, who runs the emergency unit at the Civil Protection Department, said that 215 people had been rescued from the wreckage of the earthquake. At least 264 people had been hospitalized, the Health Ministry said. In Saletta, another town damaged by the quake, Adriana Ciocchetti, a homemaker and a grandmother from Pagliano, near Frosinone, said she had not known what to expect when she arrived as a volunteer for the Italian Red Cross. “In cases like this, you just go,” Ms. Ciocchetti said. But the work was heartbreaking, she said. One woman she comforted on Wednesday had lost her family. “I was looking at a crushed house and said out loud, ‘I hope no one lived there,’ and a woman turned and said, ‘That’s where my daughter and grandchildren lived,’” Ms. Ciocchetti said. “People are so disoriented that many don’t even really realize what’s happened. ” The Italian Red Cross was one of the first organizations to arrive in Amatrice. “Within two hours of the quake we were ready to move,” said Ignazio Schintu, the organization’s emergency manager. By Wednesday evening, the Red Cross  —   with about 400 workers and volunteers  —   had set up medical services, emergency kitchens, washroom facilities and tents. On Thursday, they were setting up a base camp on an athletic field in Amatrice for the workers assisting those left homeless and now living in tents. “Our psychologists are here to assist them,” Mr. Schintu said. “Many earthquake victims don’t want to sleep under any sort of covering, even a tent. ” “People have to get over this first moment,” though the two strong aftershocks felt on Thursday “certainly don’t make it easier,” he said. Just outside the town, a camp for 250 homeless survivors was being set up by Anpas, one of the dozens of volunteer associations that rushed to the quake area. Tents, for eight to 12 people each, were being prepared for their arrival. Though temporary in nature, for some, they could become home for months. Some Amatrice residents found themselves pressed into service as emergency workers, like the Rev. Savino D’Amelio, a parish priest, who helped guide to safety 27 people from his retirement home shortly after the quake hit. “There were three of us, moving wheelchairs,” Father D’Amelio said, still shaken. “We got them all out without a scratch. ” “Now we’re trying to help people, ease the desperation of those who lost children and teenagers,” he said. “I hope our strength holds out. ” Across Amatrice, volunteers collected clothing, blankets, toiletries and food donated by people and institutions throughout Italy. “We’ve seen incredible solidarity, closeness, love, help from all of Italy,” with even the country’s struggling municipalities offering funds, said Giancarlo Carloni, the town’s deputy mayor. “It makes me proud to be an Italian. ” Outside the temporary morgue in Amatrice, a small crowd of residents waited for names of the dead to be called. Some sobbed, while others clutched at one another for support. “The identification has to be done right away  —   it’s hot,” Mr. Carloni said. Fabrizio Curcio, the chief of Italy’s Civil Protection Department, praised the “great generosity” and “positive enthusiasm” on the part of the rescue workers and volunteers who had raced to the earthquake zone. But, he said, some volunteers will be asked to go home. “We are many, and only those who are necessary must remain,” he said. Those residents who could leave Amatrice, now a ghost town, did so, finding refuge with relatives or at second homes on the seaside, said Mr. Carloni, the deputy mayor, who spent the night with his wife in their car. His house was standing, he said, but she was afraid to stay in it. Bishop Domenico Pompili of the nearby town of Rieti and the Rev. Fabrizio Borrello, a priest from the town, came to Amatrice on Thursday to offer spiritual comfort to the survivors and bless the bodies in the morgue. “There were a lot of them,” Father Borrello said. “But there are still many people missing,” including many families, so “there is no one to come and identify them. ” Efforts to find survivors in the rubble continued throughout the day, “but the probabilities are about down to zero,” said one officer with Italy’s Finance Police who declined to give his name because he was not authorized to speak to the news media. Mauro Bellavita, a volunteer who came to Amatrice with four other volunteers from the town of Acquapendente, said he was not ready to give up. “Hope is the last thing to die,” he said.'"}, "time": 1742628535.8790116}