{"duration": 0.026443958282470703, "input_args": {"text": "'Hallan la mención en hebreo más antigua de Jerusalén en un papiro de casi 3.000 años Publicado: 27 oct 2016 03:33 GMT \\nFue encontrado en una pieza que había sido robada en 2012 de una cueva del desierto de Judea. Ammar Awad Reuters Síguenos en Facebook \\nProcedente del período del Primer Templo, hace unos 2.700 años, la Autoridad de Antigüedades de Israel (IAA, por su sigla en inglés) presentó el papiro en el que aparece la mención en hebreo de la ciudad de Jerusalén más antigua de la que se tenga noticia. El documento fue recuperado en el 2012, cuando un grupo de ladrones intentaba venderlo, detalló \\' The Times of Israel \\'. \\nEitan Klein, de la IAA, explicó que el papiro, que se cree que había sido sustraído de una cueva en el desierto de Judea, es una \"evidencia\" de la existencia de una \"administración organizada en el Reino de Judá\", que \"destaca la centralidad de Jerusalén como capital del reino en la segunda mitad del siglo VII a.C.\" \\nLos especialistas agregaron que el texto escrito en dos líneas en el papiro de 2,5 por 11 centímetros, refiere al pago de impuestos o al traslado de mercancías. \"De la criada del rey, de Naarat, jarras de vino, a Jerusalén\", dice la inscripción que menciona a la ciudad con su antiguo nombre en hebreo: Yerushalima. Ammar Awad Reuters \\nPor su parte, Amir Gador, también de la IAA, reiteró que el papiro era procedente de una cueva en Nahal Hever, en el desierto de Judea, cercano al mar Muerto, región que, por sus características, permite la preservación de este tipo de fragmentos durante miles de años. \\nEn tanto, 14 integrantes de la organización que había robado el papiro fueron detenidos y condenados a 18 años de cárcel. Reconocimiento de Jerusalén \\nEl ministro de Cultura y Deporte de Israel, Miri Regev, afirmó que el descubrimiento del papiro en el que se cita a Jerusalén \"supone una clara prueba\" de que la ciudad \"fue y seguirá siendo la capital eterna del pueblo judío\". \\nSu afirmación responde a la postura de la UNESCO , que había rechazado los vínculos entre la ciudad y el judaísmo, a la vez que describió al Monte del Templo de Jerusalén como un lugar sagrado exclusivamente para el islam. '"}, "time": 1742628585.6816175}