{"duration": 0.031533241271972656, "input_args": {"text": "'License DMCA \\nRussian S-500 Anti-ballistic missile system Question #1. Is \"Full Spectrum Dominance\", the Pentagon\\'s ambitious plan to have military control over the land, sea, air and outer space, a mirage? Question #2. Has the plan been effectively neutralized by Russia\\'s advanced technology in missile defense systems and superior early warning detection capability? Reading Pepe Escobar\\'s latest, \"Russia Calls the War Party\\'s Bluff\" [1] , he doesn\\'t refer directly to the Pentagon\\'s plan to exercise \"Full Spectrum Dominance\" yet he does mention the S-500 anti-missile system effectively seals Russia\\'s air space . Escobar quoting a US intel source, \"The United States has lost the arms race, indulging in trillions of dollars of worthless wars...no longer a global power as it cannot defend itself with its obsolete missiles, THAAD, Patriot, and Aegis Land Based Ballistic Defense System, against Russian ICBM\\'s, even as the Russian\\'s have sealed their air space. The Russian\\'s may be as much as four generations ahead of the US\". Hmm...\"Full Spectrum Dominance\"? Back to that in a bit. Escobar\\'s primary focus is on Syria and the Russian S-300, 400 missile systems brought to Syria now operational on land and sea which he says, \"Russia has basically made their own no-fly zone over Syria; and a US no-fly zone is now impossible to achieve\". That effectively neutralizes any future plans the Obama administration has in mind as well as a new Hillary Clinton regime in waiting contemplating such an idea; something she\\'s been pushing during the presidential campaign against Trump. This much seems clear. Russian President Vladimir Putin has chosen to make a stand militarily and diplomatically -the latter shouldn\\'t be forgotten-to support Syrian President Bashar Assad\\'s government against the assorted Pentagon, CIA, Saudi Arabia, Turkey, GCC backed proxy mercenary jihadist terrorists trained and supported by them then brought to Syria to bring about regime change. - Advertisement - With Russia entrenched in Syria regime change isn\\'t going to happen. The current siege against the terrorists by Assad\\'s Syrian Arab Army supported by Russian air power in eastern Aleppo continues. Meanwhile over the border in Mosul, Iraq a battle is raging to extricate IS terrorists that have controlled the city since 2014 when it routed the Iraqi army. Now an unlikely conglomeration of Shiite militia\\'s, Sunni tribesmen, Peshmerga Kurds, Turkish army, Iraqi army, US special forces supported by US planes are besieging the city. In all likelihood when IS loses control of Mosul its remaining forces will retreat into eastern Syria becoming a new force presumably used by the US as the newest proxy force to take on Assad. This hasn\\'t occurred yet so the focus by Assad\\'s SAA forces is retaking and freeing the Syrian people in besieged Eastern Aleppo. Back to the original premise of this piece, the Pentagon\\'s Full Spectrum Dominance, FSD. Nothing is really secret anymore. - Advertisement - Russia and China had to know the Pentagon\\'s FSD plan from its inception. They had to know it was mandatory to develop and upgrade their ballistic missile technology to effectively neutralize any US plan to initiate a nuclear first strike-something that\\'s still on the table while Russia and China have rejected the idea. Regrettably, we\\'re in a new cold war with Russia and China. And despite some fiery rhetoric from Hillary Clinton, \"Putin\\'s the new Hitler, wanting a no-fly zone over Syria\" and her generalized disposition to show how tough she is, there should be enough reality based resistance coming from the military, intel agencies that should short circuit any aggressive moves she has in mind that would bring any direct confrontation with Russia and China, whether in Syria, Ukraine, the South China Sea or anywhere else that could escalate into a nuclear confrontation. In conclusion the madness of initiating a nuclear first strike against Russia and China is being effectively neutralized by Russian ABM, ICBM superiority now evidenced in Syria making the Pentagon\\'s Full Spectrum Dominance a mirage, including for Hillary \"mad dog\" Clinton.'"}, "time": 1742628544.5656273}