{"duration": 0.06346344947814941, "input_args": {"text": "'  RAGING INFERNO: Tens Of Thousands Evacuated As Officials Suspect Arson In Wildfires Spreading Across Israel On Wednesday, Prime Minister Benjamin Netanyahu attributed the fires to \"natural and unnatural\" causes and some Israeli officials referred to an \"arson intifada\", a reference to previous Palestinian uprisings against Israel.   24, 2016 Tens of thousands of residents were ordered to leave Israel’s third largest city on Thursday as wildfires tore across central and northern Israel, and the country’s chief of police said politically motivated arson may be behind some of the blazes. Television pictures in Israel today showed a wall of flames raging through central neighborhoods of Haifa , a city of around 300,000 in the north of the country, engulfing a petrol station that firefighters were rapidly dousing with water. The fires have been burning in multiple locations for the past three days but intensified on Thursday, fueled by unseasonably dry weather and strong easterly winds. Education Minister Naftali Bennett, the leader of a far-right party, said whoever set the fires could not have been Jewish, hinting Arabs or Palestinians were behind them. Police gave no indication of who was to blame but did say they had reason to believe arson was responsible in some cases. Wildfires burning in Haifa, Israel: “There was arson and a lot of non-arson,” Police Chief Roni Alsheich told reporters. “It’s likely that where it was arson, it goes in the direction of nationalistic,” he said, suggesting a political motive, before adding: “I don’t want to disturb the investigation.” He said there had been some arrests but gave no details. On social media, some Arabs and Palestinians celebrated the fires and the hashtag #Israelisburning was trending. On Wednesday, Prime Minister Benjamin Netanyahu attributed the fires to “natural and unnatural” causes and some Israeli officials referred to an “arson intifada”, a reference to previous Palestinian uprisings against Israel. With fires burning in the forests west of Jerusalem, around Haifa, on central and northern hilltops and in parts of the Israeli-occupied West Bank, the government sought assistance from neighboring countries to tackle the conflagration. Israel Wildfires Burning Out Of Control: Greece, Cyprus, Croatia, Turkey and Russia offered help, with several aircraft already joining efforts to quell the blaze, dropping fire-retardant material to try to douse the heaviest fires and stem their spread. A thick haze of smoke hung over Haifa, which rises up from the Mediterranean Sea overlooking a large port. Schools and universities were evacuated, and two nearby prisons transferred inmates to other jails, a prisons service spokesman said. Patients were moved out of a geriatric hospital. A lack of rain combined with very dry air and strong easterly winds have spread the fires this week across the center and north of the country, as well as parts of the West Bank. Hundreds of homes have been damaged or destroyed but no deaths or serious injuries have been reported. Bennett, the leader of the Jewish Home party which supports settlements in the West Bank where Palestinians seek statehood, said on Twitter that arsonists were disloyal to Israel, hinting that those who set the fires could not be Jewish. “Only those to whom the country does not belong are capable of burning it,” he said in a tweet in Hebrew. Haifa’s mayor said he feared for the city and called on residents with water sprinklers to turn them on to help keep the flames at bay. Those leaving their homes were urged to go to sports stadiums and other safer locations. “Each neighborhood is situated among forests and while we are proud of this, at the moment it is a problem,” Yona Yahav told Israel’s Channel 2. “There are some four major fire locations at the moment.” משתתף עכשיו בהערכת מצב עם הכוחות בשטח בחפ״ק בחיפה pic.twitter.com/So4BdYBRB6 \\n— Benjamin Netanyahu (@netanyahu) November 24, 2016 Highway 443 , which links Jerusalem and Tel Aviv as it cuts through a southern flank of the West Bank, was temporarily closed to morning rush-hour traffic as flames reached the city of Modi’in, about half way between the two conurbations. Local weather forecasters have said the tinder-dry conditions – it has not rained in parts of Israel for months – and strong winds are set to continue for several days and they see little prospect of normal seasonal precipitation arriving. “Meteorology is not responsible but it is conducive to the spread of these fires,” said Noah Wolfson, the chief executive of weather forecasting company Meteo-Tech. “The atmosphere will remain very dry, at least until Monday or Tuesday.” source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742628443.4193869}