{"duration": 0.22101449966430664, "input_args": {"text": "\"License DMCA Racism is generally thought of as discriminating against any group of people because of certain distinctive physical features they have in common. The barren shallowness of this definition is itself actually characteristic of the 'consciousness' of people who engage in racist attitude and orientation. To find the real roots of racism we have to go down to the level of culture formation itself. It is here that what we call racism becomes inevitable. Racism does not exist merely as a flaw in cultural formation. It is an innate feature of culture formation because of what culture has always historically shown itself to be. All culture formation begins in the response of awareness to reality as experienced through the filter of this particular awareness. Everything we know about human pre-history and history tells us that fear plays a radical role in culture formation. The very fact that culture formation is a group response rather than being characterizes by any significant degree of individuality supports this thesis. The group forms as a means of protection against real possibilities of danger. Reality is perceived as dangerous, or at least as presenting possibilities of danger. And ultimately reality means the apparently inescapable mystery of mortality, which is anything but welcome and non-threatening. - Advertisement - The group forms as a means of protection and as the group develops, its group identity begins to form the rudiments of culture. This culture identity has fear as part of its elementary constitution. And the primary means of countering the threats this fear perceives is to find and develop features of reality that affirm the group identity. This involves both finding actual features in and projecting desired features onto reality. And the primary projection always involves seeing reality as having a face that affirms and reflects the face of the group itself. And this absolutely includes affirmation of the physical characteristics of the group. These physical characteristics become inseparable from the entire cultural panoply. This does not mean that culture is simply fantasy. But the fact that there are real elements in any culture only fortifies the fantasy elements and makes them indistinguishable from the real. The iconic imagery of all cultures shows the superhuman higher powers as having features that precisely reflect the features of the human group that develops this imagery. This is not merely coincidental or accidental. It shows that the human group has a fear-based emotional need to believe its particular features, which are subject to mortality, are, in spite of this fact, the features of truth . Truth becomes the protective shield of the distinctively featured group. And it must be kept in mind that this Truth is Absolute Truth (God) and therefore gives an Absolute value to the features of the group. So any human feature or behavior that varies from this group-truth is seen as at least potentially threatening and dangerous and can easily be seen as evil . But wherever it falls in the spectrum of evaluation, it is always alien and suspect because it challenges the group-truth-identity with existential fear at its foundation. The fact that aspects of culture such as art and religion can bring a joy to the people of a particular culture does not nullify anything I have said. And it also does not mean that these aspects are of no real value. But it does reveal the fact that even these aspects are of limited reality-value. And this limit is exposed by the existence of other humans who have developed a clearly different culture. The problem of racism is precisely the problem of how humans develop the Reality-Truth picture that sustains them as a group. Paranoid fear of a person or group with different physical and psychological-orientation features is not just arrogance. It involves an existential fear of identity dissolution and it reflects the failure to adequately deal with this fear in human history. Some degree of racism exists wherever culture exists. The idea that racism is a feature of exclusively any one group of people is ludicrous and very dangerous. It's all about human fear-constriction and the human desire for power over what is frightening in reality rather than expanding further into reality and keeping an open-ended identity. It is the result of partial human identity development pretending to be absolute and finished. To end racism means to end desperate attachment to dangerously undeveloped identity. It means consciousness expansion to a depth that reveals all culture as relative in truth-value and all humans as transitional forms in evolutionary movement. We are all racist because we are all afraid of reality and its evolutionary movement. The solution to this is not the development of black culture, or white culture, or yellow culture... The solution is the development of a fearless open-ended human culture and such a culture does not yet exist anywhere on the earth. Until it does humanity is in danger of self-destruction. In the present context of American society there is no ready solution to racial discrimination because there are no social structures that feed the consciousness expansion required. This oligarchic society is the death-cold pyramid of human fear of reality that feeds the forces of exploitation, abuse, and neglect. It induces pathological behavior from the top of the pyramid to the bottom. The solution to the rabid discrimination against Native Americans and African Americans at the bottom of the pyramid is not the popularizing of Native-American or African-American culture that just ends up as pulp for the amoral capitalist machine in the form of decadent and feckless entertainment. The solution is the creation of a human culture that is genuinely open to everyone because it encompasses all human experience and response. There is no other solution. However politically incorrect it might be, there is no other solution. - Advertisement -\""}, "time": 1742564313.1021197}