{"duration": 0.01577019691467285, "input_args": {"text": "'Activists within the student government at the University of   recently passed legislation which calls for “community control” of the campus police. [In an effort to counter supposed “implicit bias” within the university police system, activists within the student government at the University of   have demanded “community control” of campus police activity.  The student activists claim there are “many incidents where students of color and historically marginalized communities are treated differently by police officers. ” They cite the Black Lives Matter platform as the blueprint for their draft of the legislation: “The Black Lives Matter platform calls on [sic] community control of the police because current policing practices  …    demonstrate a lack of voices for communities of color. ” The resolution, entitled“UWPD Accountability and Community Control of the Police,” passed by a unanimous vote in the student council and will now be passed on to the faculty senate for confirmation. The resolution argues that “the treatment and characterization of people of color by UWPD raises questions about their implicit bias and discriminatory policing procedures. ”  In response to the allegations of discrimination, the resolution demands that UWM “implement a community accountability board to review the policies and procedures that discriminate against people of color. ” The University of Wisconsin Police Department claims that the resolution is “irrelevant” to the department’s goal of carrying out their job in a way that maintains order and safety for all students on campus. The UWPD recently added a “Use of Force Coordinator” who is responsible for documenting all incidents in which an officer uses force. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628560.7886198}