{"duration": 0.1309349536895752, "input_args": {"text": "'Home This Month Popular Feminism Has Lost The Minds Of Young Women Feminism Has Lost The Minds Of Young Women Maximus Decimus Meridius \\nMaximus is a Man, capital M, period. Love. Truth. Justice. Liberty. Respect. These are the lodestones pointing true to magnetic masculinity in a polarized feminist west. His goal for writing on ROK is to be the gadfly that provokes thought and counters groupthink. October 29, 2016 The Sexes \\nThe idea that feminism is dead is gaining ground all across the west. One would like to think it is because of the trail blazing of the man-o-sphere, and to a great degree it is. But truly, the root of feminism’s death was in Man, capital M, from the very beginning. One look at Conan is all a man needs to know this truth. \\nFeminism is dead. The movement is absolutely dead. \\nThe women’s movement tried to suppress dissident voices for way too long. There’s no room for dissent. It’s just like Mean Girls. \\nIf they had listened to me they could have gotten the ship steered in the right direction. My wing of feminism—the pro-sex wing—was silenced. I was practically lynched for endorsing The Rolling Stones. Susan Faludi is still saying I’m not a feminist. Who made her pope? \\nFeminist ideology is like a new religion for a lot of neurotic women. You can’t talk to them about anything. \\n~ Camille Paglia on Rob Ford, Rihanna and rape culture for MacLeans.ca \\nNeurotic women indeed. \\nPaul Joseph Watson of Infowars/Prison Planet fame was bang on in his assessment of feminism at the end of 2014. But he may have underestimated his conclusions in my opinion. Feminists did not just lose the debate, they lost the war. \\nThe feminist attempt to demonize normal male/female behaviour in public— men initiating contact with a female with a hello and attempt to strike up a conversation —backfired in less than a month. \\nWhen you have a woman volunteer to walk down the street as Princess Leia, the QUEEN of 70’s patriarchal sexist ‘misogyny’, to ridicule feminists, you have lost the war for hearts and minds. \\nAnd when I say hearts and minds… I mean the silent majority of young women who want NOTHING to do with feminism. \\nLeia makes it clear in this video that boys will be boys. So too will jawas, Darth Vader and even Yoda apparently, that sly dude. Who knew? \\nAnd that’s a good thing! Men and women are meant to interact and engage in romantic courtship. Feminists may hate this, but the vast majority of women still prefer, and expect, the man to take the initiative to get the girl. This is how men and women were created and evolved, you can’t fight Darwin and God and come out on top. \\nThis video shows that the majority of NORMAL women LOVE male attention. They WANT men to look at them. They WANT men to notice them. Why? \\nTHEY WANT A MAN!!! \\nI realized this is the case when I decided to google the fast rising phenomenon of women against feminism . \\nThis image from the Women Against Feminism Tumblr page really hits home the loss for feminism. This woman was raped. She is not running around spreading lies like the UVA RAPE HOAX story that Rolling Stone ran and had to retract . She justs wants to go back to living a normal life. She does not want to be angry at ALL men for the crime of ONE of them. She does not want to demonize all men in some sad attempt to get revenge. She does not want to be a victim. Feminists have lost the female youth of Millenials, the very generation that is supposed to obliterate the patriarchy completely in the 21st century. \\nI understand some men who are still angry over feminism may proclaim these women are doing nothing more than crying for sympathy and attention now that Millenial men have become vocal, blunt and merciless in their attacks against feminism and the current generation of ‘women’ it has reared . The problem with this type of knee-jerk reaction is just that—you’re being a jerk. Yes, far too many western women for comfort are no good for a relationship anymore. But, that does not also translate into there being no young women who are not just as frustrated and angry at feminism as you are and the feminists who claim to speak for them. \\nYoung women might not think about it as much since feminism has clearly made the road to independence (an illusion) easier for them to choose, but these women are taking note that men are completely ignoring them now that they have surpassed men in almost all aspects of western society. \\nCase in point. \\nI met a wonderful young Russian blonde a little while back. Twenty-three. Tight. Feminine. So freaking perfect. We hit it off immediately on first contact. Having myself only traveled outside the west twice, I still primarily meet foreign women in my own country and every time I do, I am blown away by their immediate friendliness and ease in my company compared to western girls. As I conversed with this well educated and refined young Russian lady, she told me she was attending university and so naturally, I asked her what she noticed most about the boys on campus compared to back home. \\nHer answer was revealing… Boys? They completely ignore the girls. Don’t even look at them. Just walk on by. \\nThis really surprised her. Being a feminine Russian girl who expects men to look at women, this behaviour by western men was completely alien to her. \\nMen, young boys, in their prime 20s, completely ignoring women on campus as they go about their day. \\nAccording to Wikipedia, women against feminism started on Tumblr in 2013 . I see #WomenAgainstFeminism as a sign that many young women are fed up with feminism and male bashing in western society. It is not a sign of women speaking with two faces and trying to work both sides of the gender war to their advantage. All you have to do is look into the eyes of this young woman to know just how desperate these girls are for a real relationship, one with love and respect . I don’t think men realize how significant a movement like women against feminism is. \\nAs men, we are naturally comfortable with open conflict and expressing not just dissenting, but offensive opinions. The very existence of women openly declaring they are rejecting feminism, and risking social ostracism in a wholly feminist dominated university climate, is why feminists are hyperventilating and going into ape-shit, mentally insane overdrive mode to try and salvage what support they have left . Here are just a few mainstream articles trying to push the meme feminism is not dead and just needs a ‘generational’ adjustment.'"}, "time": 1742564315.3476894}