{"duration": 0.054589033126831055, "input_args": {"text": "'A Bahamian man who hacked into the email accounts of celebrities and athletes and later wrote in a jailhouse email that after his release he would “shake up hollywood for real!” was sentenced to five years in prison on Tuesday. The sentence was roughly double the number of years suggested under federal sentencing guidelines. The man, Alonzo Knowles, 24, had used his illicit access to the celebrity accounts to obtain unreleased movie and television scripts and personal information, which he then tried to sell for thousands of dollars, prosecutors said. Mr. Knowles had also stolen unreleased music, financial documents, and nude and intimate images and videos, the government said. Kristy J. Greenberg, a prosecutor, said in Federal District Court in Manhattan that Mr. Knowles’s motivation had been greed. “He had a singular focus on becoming rich and famous,” she said, “by disseminating personal information of celebrities and exploiting them. ” Several victims had submitted statements to the judge. Naturi Naughton, an actress in the Starz drama “Power,” said in a video statement that Mr. Knowles had hacked her personal emails and stolen six scripts of the show, and then “tried to extort me, the producer, 50 Cent and my showrunner. ” “I have never felt more violated and out of control in my entire life,” Ms. Naughton said. Judge Paul A. Engelmayer of Federal District Court called Mr. Knowles’s crimes “deeply troubling,” and told him that he had chosen to use “your gifts, your   for dark and lawless ends. ” When Mr. Knowles pleaded guilty in federal court in May, he apologized, saying he knew what he had done was wrong. But he then wrote in emails sent from jail that he planned to write a book and reveal the secrets of the victims whose accounts he had broken into, the government said. “Im name dropping everyone involved and what I know,” Mr. Knowles wrote, “and im including pictures of paperwork that aint public. ” He wrote that he would charge $35 a copy, would hack into Twitter accounts to promote his book and that his goal was to make money. “Everyone loves gossip,” he wrote. “I cant wait to get out i already know how the cover is gonna look. ” The emails, which prosecutors cited in a sentencing memorandum to Judge Engelmayer, had been sent on a Bureau of Prisons email system that prisoners may use after they give consent to the monitoring of their messages. The judge said that Mr. Knowles’s jailhouse messages were “devoid of any remorse,” and showed that if he were released from prison any time soon, he “would be a clear and present danger to commit the very same crime again. ” “Unavoidably, Mr. Knowles,” Judge Engelmayer said, “the public has a significant interest in your being behind bars in federal prison where you have no access to the internet and no practical ability to do such harm. ” Mr. Knowles, who had pleaded guilty to charges of identity theft and criminal copyright infringement, read a brief statement, apologizing to the court and his victims. “What I did was wrong,” he said. “I could have ruined people’s lives. ” His lawyer, Clay Kaminsky, had asked for a sentence of 14 months. Mr. Knowles had faced a maximum sentence of 10 years the federal sentencing guidelines, which are not binding on a judge, had suggested 27 to 33 months, his plea agreement shows. Mr. Knowles was arrested last December after he flew to New York to meet with a man who was posing as a potential buyer of the scripts he had stolen. The man was actually an undercover agent. The case drew attention in part because it followed the widely publicized hacking of Sony Pictures Entertainment in 2014. The Knowles case also showed how a hacker could obtain confidential information from victims by targeting the accounts of their friends and associates, a process Mr. Knowles called “social engineering. ” “In the wee hours of the night, when his victims were likely asleep, Knowles trolled his victims’ private email accounts, obtaining their most personal communications,” the office of Preet Bharara, the United States attorney for the Southern District of New York, had said in its sentencing memorandum.'"}, "time": 1742628431.818782}