{"duration": 0.09710407257080078, "input_args": {"text": "'Email \\nThere is very little truth in politics today. We all, for different reasons, pull for a letter or party rather than for character and ability. We will spin for our candidate because of the party we root for so that others will blindly follow the party line. \\nIf my guys are running the country, we think, then things will be better. Even though these guys support and do things that are contrary to our definition of \"better.\" So, when a person comes out and speaks truth about “their” candidate, it can be refreshing. \\nThis is why I am so excited by what I read recently \\nThe Washington Times reports : \\nLesbian feminist author and professor Camille Paglia has delivered a scathing rebuke of Hillary Clinton , saying the sole reason for the Democratic presidential nominee’s success is because she is a woman. \\n“It’s an outrage how she’s played the gender card,” Ms. Paglia told The Spectator magazine in an interview published Friday. “She is a woman without accomplishment. ‘I sponsored or co-sponsored 400 bills.’ Oh really? These were bills to rename bridges and so forth. And the things she has accomplished have been like the destabilization of North Africa, causing refugees to flood into Italy … The woman is a disaster!” \\nPaglia is well-known for her attacks on modern feminism. And she has boldly stated the truth about this anti-feminist woman, Hillary Clinton . Hillary is a woman who is only well-known because of her womanizing sex-offending husband. \\nAs I have shown before, there actually may be a shift in power, as those the Democrats have used to gain said power are finally noticing that they are receiving almost nothing in return for their vote. \\nPaglia says as much. \\nThe Times continue: \\n“If Hillary wins, nothing will change,” she continued. “She knows the bureaucracy, all the offices of government and that’s what she likes to do, sit behind the scenes and manipulate the levers of power. But people want change and they’re sick of the establishment.” \\nShe even went as far as giving a point to Trump: \\nMs. Paglia said it’s very unlikely that a Donald Trump presidency would threaten Western civilization, as so many pundits and politicians have predicted. \\nThings they are changing. \\nArticle reposted with permission from Constitution.com Don\\'t forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .'"}, "time": 1742564523.6858203}