{"duration": 0.05937600135803223, "input_args": {"text": "'French university academics have made an extraordinary intervention in the French election, emailing students and urging them to back establishment candidate Emmanuel Macron. [The president of the University of Angers in Western France, Christian Roblédo, claimed in an email to students that, “as a university professor” it was his “duty to denounce the harmful ideology that [Marine Le Pen] conveys”.  He characterised this ideology as “withdrawal into oneself, intolerance, fear of the other [and] refusal of differences” in opposition to “humanism, openness, pluralism and freedom of expression”  —   the values which, in Roblédo’s estimation, “constitute the very essence of higher education and research in France”. “Already in 2002, we were placed before such a choice,” he said, recalling the second round showdown between Jacques Chirac and Marine Le Pen’s father,  . Mr. Le Pen was expelled from the Front National by his daughter as she reformed it into a moderate, populist movement. “[In 2002] a Republican front had come together to make the Front National score as low as possible,” wrote Roblédo. “[Again] we have to vote massively so that [Marine Le Pen] does not win the presidential election. ” Anticipating criticism of his intervention as an abuse of his public position, the professor concluded by saying that “[Sometimes] the values of a man’s life take precedence over all other considerations. In addressing you as president of the University, the duty of reserve is obliterated by the threats to the institutional foundations on which our University is based. ” WATCH | @MLP_officiel to @EmmanuelMacron: ”France will be led by a woman, either me or Angela Merkel!” 👏🇷😂 pic. twitter.   —   LEAVE. EU  (@LeaveEUOfficial) May 3, 2017,  Colleague Manuel Tunon de Lara, president of the University of Bordeaux, was equally unabashed, writing of his “responsibility to call on the academic community to vote next Sunday to block   …     the accession of Marine Le Pen to the presidency of the French Republic. ” He claimed that the “Marine Le Pen programme” was incompatible “with the academic values we have hitherto defended”. “How to defend openness in a country that would close its borders?” he asked. “My position is not an isolated position,” he declared. “It is associated with that advocated by the Conference of University Presidents, which called for ‘voting against the extremism of the candidature of Marine Le Pen’. ”'"}, "time": 1742564136.5119221}