{"duration": 0.10557842254638672, "input_args": {"text": "'LINCOLN IN THE BARDOBy George Saunders343 pages. Random House. $28. George Saunders’s   first novel, “Lincoln in the Bardo,” is like a weird folk art diorama of a cemetery come to life. Picture, as a backdrop, one of those primitively drawn   mourning paintings with rickety white gravestones and   monuments standing under the faded green canopy of a couple of delicately sketched trees. Add a tall, sad mourner, grieving over his recently deceased son. And then, to make things stranger, populate the rest of the scene with some Edward   ghosts, skittering across the landscape  —   at once menacing, comical and slightly   . “Lincoln in the Bardo” takes, as its   point, the death of Abraham Lincoln’s beloved    son, Willie, who succumbed to typhoid fever on Feb. 20, 1862, and the   president’s visits to the crypt where his son was interred at the Oak Hill Cemetery in nearby Georgetown. Saunders intercuts facts and   (culled from books and news accounts) in a   narrative with some ghost stories of his own imagining, allowing a chorus of disembodied spirits to describe Lincoln’s visits, while babbling on about their own regrets and misplaced dreams. “Bardo” is the Tibetan Buddhist name for a transition period between death and rebirth and seems to indicate, in this case, the bizarre purgatory inhabited by these ghosts. The supernatural chatter can grow tedious at times  —   the novel would have benefited immensely from some judicious pruning  —   but their voices gain emotional momentum as the book progresses. And they lend the story a choral dimension that turns Lincoln’s personal grief into a meditation on the losses suffered by the nation during the Civil War, and the more universal heartbreak that is part of the human condition. The ghosts are a motley lot, reminiscent of the dispossessed and disenfranchised characters in Saunders’s short stories. They include a soldier, a murderer, a disgraced clerk, a rape victim, a hunter who’s killed more than 30 bears and hundreds of deer, an aggrieved scholar, a mother of three girls, a young man who tried to kill himself after the man he loved spurned his affections, and an older man who was struck in the head by a falling ceiling beam and died before he could consummate his marriage to his pretty young wife. Together, these voices create a kind of portrait of an American community  —   not unlike the one in Edgar Lee Masters’s 1915 classic, “Spoon River Anthology,” which was set in a fictionalized version of a small Illinois town. The poems in “Spoon River” were narrated from beyond the grave by the dozens of souls “sleeping on the hill” in the local cemetery. One of those characters was Anne Rutledge, rumored to have been Lincoln’s first love, and whose untimely death  —   reportedly of typhoid at the age of 22  —   was said to be a source of his often melancholy outlook on the world. The similarities between “Spoon River” and Saunders’s new novel extend well beyond the Lincoln association and the graveyard confessions. Like Sherwood Anderson’s “Winesburg, Ohio” (1919)  —   itself a notable influence on Saunders’s early short stories  —   and Thornton Wilder’s “Our Town” (1938) “Lincoln in the Bardo” appropriates Masters’s multivoiced approach, using it to create a story that unfolds into a meditation on the dreams and disappointments of ordinary people, longing for connection but often left feeling isolated and alone. Saunders’s short stories  —   “CivilWarLand in Bad Decline,” “Pastoralia,” “In Persuasion Nation” and “Tenth of December”  —   tend to vacillate between two impulses: satire and black comedy, reminiscent of Nathanael West and Kurt Vonnegut and a more empathetic mode, closer to Anderson and William Trevor. Though there are moments of dark humor in some of the ghost stories here, “Bardo” definitely falls into the more introspective part of that spectrum. In these pages, Saunders’s extraordinary verbal energy is harnessed, for the most part, in the service of capturing the pathos of everyday life  —   as experienced by the spirits of the dead, remembering missed opportunities by Willie, as his life slips away and he enters the limbo of the bardo and by Lincoln, as he struggles to come to terms with his son’s death and the devastation of a war that is ripping the country apart. Saunders’s novel is at its most potent and compelling when it is focused on Lincoln: a grave, deeply compassionate figure, burdened by both personal grief and the weight of the war, and captured here in the full depth of his humanity. In fact, it is Saunders’s beautifully realized portrait of Lincoln  —   caught at this hinge moment in time, in his own personal bardo, as it were  —   that powers this book over its more static sections and attests to the author’s own fruitful transition from the short story to the   form of the novel. “His mind was freshly inclined toward sorrow,” Saunders writes of Lincoln, “toward the fact that the world was full of sorrow, that everyone labored under some burden of sorrow that all were suffering that whatever way one took in this world, one must try to remember that all were suffering (none content all wronged, neglected, overlooked, misunderstood) and therefore one must do what one could to lighten the load of those with whom one came into contact that his current state of sorrow was not uniquely his, not at all, but, rather, its like had been felt, would yet be felt, by scores of others, in all times, in every time, and must not be prolonged or exaggerated, because, in this state, he could be of no help to anyone and, given that his position in the world situated him to be either of great help or great harm, it would not do to stay low, if he could help it. ”'"}, "time": 1742563484.7263687}