{"duration": 0.04733633995056152, "input_args": {"text": "'Pop superstar Katy Perry has again been accused of cultural appropriation, with critics now saying the singer is stealing elements of black culture for use in her latest music. [In a searing article published on BET. com Wednesday, Keith Murphy says the    singer has “become the latest white pop act looking to reinvent themselves on the back of Black urban culture. ”  Murphy  —   pointing to what he called the “Firework” singer’s “cringeworthy” May 20 Saturday Night Live performances, one which featured Atlanta rap trio Migos —   says Perry is no longer the “bubbly, witty and at times   brunette who had began her professional career in 2001 as a virginal contemporary Christian music vocalist before hitting peak pop superstar levels. ” “In her place stood a static individual who was hardly recognizable,” Murphy wrote. Perry’s performance of her   single “Bon Appétit” on SNL last week was heavily panned by critics online and on social media (and in the comments section on YouTube). Perry’s            act was called “odd” by Spin and became the subject of several memes  —   many of them accusing the singer of exploiting black culture. Katy Perry looks like an out of touch teacher trying to relate to the black youth. This was hilariously terrible. pic. twitter.   —   IV:XX Hotep Doobs (@DOEDoobs) May 21, 2017,  When you need Black culture to sell songs but you’re whiter than Strom Thurmond drinking a glass of milk watching Andy Griffith @katyperry pic. twitter.   —   Chris Krapek (@Chris_Krapek) May 22, 2017,  When I saw Katy Perry’s performance with Migos on SNL pic. twitter.   —   Jemele Hill (@jemelehill) May 22, 2017,  @jemelehill Katy Perry is in phase one of the ”Miley Cyrus going black” Plan!😏  —   T7J4H4 (@TravarisHarpe) May 22, 2017,  Even rapper Snoop Dogg joined in and roasted Perry with a meme. A post shared by snoopdogg (@snoopdogg) on May 23, 2017 at 11:22am PDT,  Murphy writes: “By the end of the entire   ordeal, you were left to wonder: What the hell happened to Katy Perry? And why did the      pop protagonist, who first arrived on the pop music scene in 2008 feel the need to Blacken things up?” Perry’s past collaborations with black musicians, including “Snoop Dogg (“California Gurls”) Kanye West (“E. T. ”) and Juicy J (“Dark Horse”) Murphy writes, were “all done on equal, seamless footing like David Bowie’s mid ‘70s exploration of Philly soul. ” However, Murphy notes, Perry’s most recent reinvention and “the stumbling drum up to Perry’s upcoming fifth album Witness has so far been craven in its attempts to create a spark by injecting some Black girl magic. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628403.226571}