{"duration": 0.10001182556152344, "input_args": {"text": "'Comments \\nAs it happens Republican presidential nominee Donald Trump has written a book other than “The Art Of The Deal” and in true Trumponian fashion, it is a fiction novel titled “ Trump Tower “that should more likely be classified as smut. \\nTrump described the book as “ The sexist novel of the decade” and was originally billed as, “ The debut novel from ‘New York Times’-bestselling author, international business mogul, television superstar, and New York City icon, Donald J. Trump.” \\n“Trump Tower” was a magnificent flop and Trump, staying true to his penchant for not admitting obvious failure, removed his name from the book in its second iteration and gave all credit to ghostwriter Jeffrey Robinson. However, as Trump is now to learn, once something is on the Internet it is on their forever — even if you are a not-yet-convicted sexually predatory offender with money. Below is the original listing with the U.S. ISBN agency: Jeffrey Robinson’s #TrumpTower has it all. The ultra rich, powerful, and beautiful. It’s your summer must-read http://t.co/lQKvIzzV \\n— Donald J. Trump (@realDonaldTrump) August 13, 2012 \\nIn delving into the story, which appears to have been written for those with the reading comprehension of a first grader in mind, it routinely degrades women. The opening chapter speaks of a tenant who is bound and gagged to a bed naked only to be found by one of the tower’s staff: \\nThere she was, completely naked and gagged, her arms above her head, handcuffed to the top of the bedstead, with her legs tied to the bed and stretched wide apart. \\nThat sounds icily similar to the rape accusations being levied against Trump, no? The official court documents filed against Trump state : \\nDefendant Trump tied Plaintiff to a bed, exposed himself to Plaintiff, and then proceeded to forcibly rape Plaintiff. During the course of this savage sexual attack, Plaintiff loudly pleaded with Defendant Trump to stop but with no effect. Defendant Trump responded to Plaintiff’s pleas by violently striking Plaintiff in the face with his open hand and screaming that he would do whatever he wanted. \\nThe other gems of literary genius included: \\n“Take off your sweatshirt,” he said again. Her hands were trembling. “No.” “Yes,” he said. “Take off your sweatshirt. She reached for the bottom of her sweatshirt, but all she could do was hold onto it. “No.” “Yes.” “I can’t.” “Yes you can. Do as I tell you. Take off your sweatshirt.” She tried to swallow, but her mouth was totally dry. “I can’t…” “Do it. Take off your sweatshirt. Do as I tell you.” She closed her eyes, hesitated, then pulled off her sweatshirt. \\nAnd: \\n“I’d probably like his mama’s titties, too,” and, instead of using his key, he rang the bell. \\nOn top of the sordid sexual scenarios in Trump’s book, there are disrespectful racial references: \\nCome on, you’re a shoo-in.” He reminded her, “Two white guys and a great-looking minority girl with perfect boobs? No contest.” \\nApparently Trump was too cheap to hire an editor as the book is riddled with grammatical errors such as, “In fact, none of the apartments in the tower was numbered.” \\nIn his quest for attention Trump attempted on numerous occasions to have his clap trap babble transitioned to television. The book had been in the works since the late 90s and according to Bob Frederick, who represents MVP Entertainment, “We hired a writer out of Los Angeles and developed a pilot with Showtime. And Donald was happy with it.” \\nMore than a decade later in 2008 Trump pitched the story to Lifetime which presented its own disgusting irony. The likely soon-to-be-convicted sexual predator wanted his story on a network known for producing shows about sexual predators. \\nTrump’s co-author, Mr. Robinson, has refused to comment on the book. However, if one were so inclined they are able to read the first few chapters for free on Amazon’s kindle version , using the preview option. That is all one should read for two reasons. The first is purchasing the book would put money in Trump’s pocket, and the second is ingesting the entire story will likely lead to psychosis, the loss of brain cells, and IQ points.'"}, "time": 1742563758.3897486}