{"duration": 0.11654472351074219, "input_args": {"text": "'The president and Hillary Clinton share a “stubborn desire” to avoid scrutiny. November 4, 2016 Lloyd Billingsley \\nThe President of the United States, the most powerful man in the world, is working three shifts for his designated successor, former First Lady and Secretary of State Hillary Clinton. As the FBI continues its investigations and Clinton emails continue to emerge, it is worth recalling the mysteries in the president’s narrative. \\nLast year, “Obama’s narrator,” as the New York Times called David Axelrod, released his massive Believer : My Forty Years in Politics . The author recalls a “perfectly timed” and unexpected call that would change his life. \\n“David, it’s Barack,” said the voice on the phone. “I’m thinking about what I want to do next, and was wondering if we could talk.” This call took place in 1992, which explains the perfect timing. \\nOn February 8, 1992, the president’s maternal grandfather Stanley Dunham passed away at 73. So “Gramps,” as the narrator called him, was no longer around to offer insights on family history, correct any accounts that might appear, or write one of his own. \\nIn the 1995 Dreams from My Father, Gramps “might” say that a Kenyan foreign student looks a lot like Nat King Cole. Actually, Gramps might not. The Kenyan student Barack H. Obama bears little resemblance to Cole, who passed away in 1965 but enjoyed a revival in the 1990s through daughter Natalie’s “Unforgettable” album. \\nThe narrator of Dreams from My Father invokes “a stubborn desire to protect myself from scrutiny” and he “doesn’t fault people their suspicions” if they fail to take him at “face value.” His elusive father is a “prop in someone else’s narrative” and “an image I could alter on a whim or ignore when convenient.” The narrative itself is a “myth,” a “tale,” and a “useful fiction.” \\nDreams from My Father has no photo section, no index, and key characters get only a first name. These include “Frank,” who gets 2,500 words. Back in 1995, the president himself identified this person as Frank Marshall Davis, the Stalinist Paul Kengor regards as the president’s mentor, as he explained in The Communist: The Untold Story of Frank Marshall Davis . \\nIn Dreams from My Real Father , documentarian Joel Gilbert made a case that Davis is the president’s biological father. Malik Obama, son of the Kenyan Barack H. Obama, sees a strong physical resemblance . That also holds true on the policy side. Professor Kengor found “remarkable similarities” between the writings of Davis and the policies of president Barack Obama. \\nThe Kenyan Barack Obama, though a man of the left, was not a pro-Soviet Communist. Had he been pro-Soviet, he would have attended Patrice Lumumba University in Moscow. Indeed, Obama warned his fellow Kenyans about Soviet meddling in Africa. \\nThe Kenyan Obama would have found strange the president’s 2009 cancelation of missile defense for European allies. An outspoken man, he would not have supported the kind of high-tech harassment Sharyl Attkisson described in Stonewalled: My Fight for Truth Against the Forces of Obstruction, Intimidation and Harassment in Obama’s Washington . \\nThe Kenyan Barack H. Obama had issues with strongman types such as Jomo Kenyatta, who ruled Kenya from 1963 until his death in 1978. In keeping with his country, and most of Africa, the Kenyan Barack Obama is not on record as a supporter of homosexual causes. Frank Marshall Davis, on the other hand, was certainly on board. As Davis wrote in his 1992 memoir Livin’ the Blues : \\n“During the dramatic civil rights demonstrations of the 1960s, I often thought we ought to form a united front with joint sit-ins at cafes. In my mind I envisioned the result. An indignant white restaurant manager frantically phoning the police, ‘Get here in a hurry! We got niggers at our counters and our washrooms are loaded with fairies and lesbians!’ Or perhaps there might have been a joint March on Washington waving banners: Blacks and Homos, Arise!” \\nThat, and Davis’ pornographic novel, Sex Rebel: Black , might explain the president’s stubborn desire to protect himself from scrutiny. It could also have something do with what the narrator calls the “less flattering aspects of my father’s character.” \\nIn Dreams from My Father , the Kenyan is raised a Muslim but in The Audacity of Hope he is “a confirmed atheist, thinking religion to be so much superstition, like the mumbo-jumbo of witch doctors that he had witnessed in the Kenyan villages of his youth.” \\nIn Audacity , the narrator explains that he went to a “predominantly Muslim school” in Indonesia. He does not indicate whether atheists, Lutherans, Jews, or Buddhists also attended the school. Registration records were supposedly destroyed by flooding. \\nThe predominantly Muslim school also emerges in Believer , but Axelrod does not indicate if students of other faiths attended. Frank, Ann Dunham, Stanley Dunham, and even the Kenyan Barack Obama are missing from this account, but it proves enlightening in other ways. \\nIn a 2008, Brian Williams of MSNBC asked presidential candidates what steps they would take in the event of a simultaneous terror attack on major American cities. As Axelrod explains, “Obama neglected to include that he would pursue the perpetrators.” \\nHillary Clinton did likewise in 2012, passing off what she privately regarded as a terrorist attack on the U.S. compound in Benghazi as a spontaneous protest over a video. Like the president, Clinton has always shown a stubborn desire to protect herself from scrutiny. With BleachBit , hammers and lies, Hillary and her handlers did their best to make more than 30,000 emails disappear. \\nThe contents remain something of a mystery, just as mysteries linger about the president and his background. On the other hand, by now some things are perfectly clear. \\nThe POTUS and former FLOTUS both decline to identify Islamic terrorism. Both are shrink-wrapped in statist superstition. And both lie with the greatest of ease. On these counts, like the critters in Orwell’s Animal Farm, one can find it “impossible to say which was which.” \\nBack in July, the party faithful were chanting “Four more years!” during the president’s speech at the Democratic National Convention.'"}, "time": 1742562667.0411942}