{"duration": 0.02459096908569336, "input_args": {"text": "'Interviews James Clapper, Director of US National Intelligence Agency, speaks at the Council of Foreign Relations in New York City on October 25, 2016. (AFP photo) \\nJames Clapper, the US director of national intelligence, has warned that the establishment of a no-fly zone in Syria could prompt Russia to shoot down US planes. This comes as Hillary Clinton, the Democratic nominee for the 2016 US presidential election, has called for establishing a no-fly zone in the Arab country. Russia has recently deployed mobile S-400 and S-300 missile batteries to western Syria, which are ready to shoot down cruise missiles and aircraft. \\nGordon Duff, a senior editor with the Veterans Today, told Press TV that James Clapper who spoke out against former secretary of state’s emphasis on a no-fly zone over Syria is responsible, because the American officials obtain their intelligence on the Syrian conflict from the spy chief. \\n“The public position of the United States vis-à-vis Syria was established based on intelligence supplied exclusively by James Clapper,” Duff noted, adding, “He (Clapper) is the one that talks about the gas, he’s the one who talks about the barrel bombs, [and] everything that’s been disproven.” \\nHe said, “Every crazy scheme that the US comes up with to blame Syria for killing its own people or the Russians for slaughtering people in hospitals, it all comes from James Clapper, the director of the National Intelligence Agency, who fed that information to Secretary Clinton, who fed that information to President [Barack] Obama.” \\n“Clinton said that she favored a no-fly zone only if acceptable for both Russia and Damascus and after negotiations,” which is a very different story than the one said by the spy chief for political purposes, Duff said. \\nDuff added that the imposition of “no-fly zone obviously is going to help no one but al-Nusra [Front] and ISIS (Daesh)” terrorists. \\nDamascus and Moscow carry out airstrikes against terrorist groups who wreak havoc in the Arab country, but the US and its allies push for imposing a no-fly zone on Syria to pursue their agenda in the war-ridden state. \\nSince March 2011, Syria has been gripped with foreign-backed militancy, which has left hundreds of thousands of people dead or wounded and millions of others homeless. Loading ...'"}, "time": 1742561999.7374158}