{"duration": 0.040587663650512695, "input_args": {"text": "'David Frum: Hillary is a Patriot Who Will Protect the Constitution November 3, 2016 Daniel Greenfield \\nIf David Frum had suggested that Hillary Clinton used to play for the Patriots, I would have found his argument a little more credible than claiming that she is a patriot. \\nBut she is a patriot. She will uphold the sovereignty and independence of the United States. She will defend allies. She will execute the laws with reasonable impartiality. She may bend some rules for her own and her supporters’ advantage. She will not outright defy legality altogether. Above all, she can govern herself; the first indispensable qualification for governing others. \\nThis is under an Atlantic piece headlined, \"The Conservative Case for Hillary\" which also contends, \"Why support a candidate who rejects your preferences and offends your opinions? Don’t do it for her—do it for the republic, and the Constitution.\" \\nThe trouble with this line of argument is that Hillary\\'s own agenda includes a rejection of the First and Second Amendment. It\\'s a rather unusual way to support the Constitution by destroying it. \\nThen there\\'s the whole Hillary is a quarterback for the New England Patriots business. Who has ever accused Hillary Clinton of being a patriot? How was this patriotism manifested? In Benghazi? In Iran? In Russia? I\\'ll skip over the \"outright defy legality altogether\" argument. Though it\\'s certainly sad that this is now considered some sort of high water mark. \\nBut can Hillary govern herself? Is the compulsive liar who can\\'t help shouting, \"I was in New York on 9/11\" really capable of governing herself? \\n\"I am voting to defend Americans\\' profoundest shared commitment: a commitment to norms and rules that today protect my rights under a president I don’t favor, and that will tomorrow do the same service for you\". \\nUnless you make a movie about Mohammed.'"}, "time": 1742564568.6032388}