{"duration": 0.0671377182006836, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / Something Strange Happened After Bombing In Iraq – Fake, Staged, Hoax Essential Reading Holocaust, Hate Speech & Were the Germans so Stupid? – Updated By wmw_admin on March 23, 2011 \\nThe brilliant examination of the ‘Holocaust’ by Anthony Lawson has since been censored on the basis of a false Copyright infrigment. But as Lawson explains, this just another attempt to stiffle freedom of expression The Origins of Modern Banking By wmw_admin on January 2, 2004 \\nIt was Thomas Jefferson who said, “banking institutions are more dangerous to our liberties than standing armies”. And as Kieron McFadden reveals, he was not being alarmist Soros/CIA Plan to Destabilize Europe By Wayne Madsen on September 28, 2015 \\nThe same forces that orchestrated the various ‘colour revolutions’ and the ‘Arab Spring’ are behind Europe’s migrant crisis. Wayne Madsen explains America Before Columbus By Rixon Stewart on September 1, 2006 \\nCould it be that certain powers have a vested interest in keeping our real history under wraps? Because a great deal has been unearthed which is completely at odds with conventional notions regarding the origins of what we know today as America “WIPED OFF THE MAP”– The Rumor of the Century By wmw_admin on January 21, 2008 \\nHow President Ahmadinejad’s words were mistranslated and deliberately distorted. So that the term “wiped off the map” has now become synonymous with the Iranian leader’s attitude to Israel – even though he never uttered those words Does God Play Dice with the Universe? By Rixon Stewart on December 1, 2003 \\nResearch into particle physics is revealing a world full of almost magical qualities. Could it be that this mysterious, puzzling world is in fact the world of the spirit – the spiritual world that saints and mystics throughout history have sought to explo Who Are The Illuminati? By wmw_admin on April 24, 2004 \\nConspiracy theory is now an accepted turn of phrase but sometimes one hears the expression, sometimes whispered rather than spoken. “The Illuminati”. David Cole at Auschwitz By wmw_admin on October 7, 2006 \\nNow directly linked, a must see video. Watch as a young Jew demolishes the standard notion of the Holocaust, highlighting its contradictions and flaws with logic and clarity. An hour long video of absolutely essential viewing Coming Clean By wmw_admin on April 29, 2004 \\nChemtrails are not the product of some ‘Conspiracy Theory’. They are real. We get the low down from an aircraft mechanic who has done his own investigating Who’s That Man? By Rixon Stewart on January 21, 2008 \\nIt’s Saddam Hussein of course. Or so western media and Coalition authorities would have us believe. But was the man sentenced and supposedly executed in Baghdad really Saddam Hussein?\""}, "time": 1742562442.5023072}