{"duration": 0.07607054710388184, "input_args": {"text": "'PARIS  —   France’s financial prosecution office opened an embezzlement investigation Wednesday into François Fillon, a leading presidential candidate, following a newspaper report that his wife had been paid around $535, 000 in public money for a   job, a revelation that could upend the tightly contested election. Mr. Fillon, who won November’s   primary, has been considered a favorite in the race, but now must contend with questions about whether the payments to his wife were inappropriate. According to the satirical weekly The Canard Enchaîné, Mr. Fillon’s wife, Penelope, received about 500, 000 euros over eight years, first as his parliamentary assistant and then as assistant to his deputy Marc Joulaud, who took over when Mr. Fillon became a minister in the government in 2002. It is not illegal in France for members of Parliament to employ family, and around 10 to 15 percent do so, according to French media. But if Mrs. Fillon did nothing, holding a fake job, in effect, in return for the public funds, her husband could be in trouble. “This could be painful to Fillon, fairly damaging,” Gérard Grunberg, a political scientist at   the prestigious political science institute, said Wednesday in an interview. He added: “Everything depends on whether it was a bogus job. If it’s proved that it was  —   and a   one, too  —   then this is going to be important. She always said she didn’t participate in political life. So she sort of condemned herself in advance. ” Mr. Fillon, the   candidate, has been leading in polls, ahead of his two main challengers, Marine Le Pen of the   National Front, and the former economy minister in the Socialist government, Emmanuel Macron, who is running as an independent. The general election is in April, with a runoff expected in May. Either Ms. Le Pen  —   most likely  —   or Mr. Macron will wind up in the presidential runoff against Mr. Fillon, analysts have predicted. In a 2012 posting on Twitter, Mr. Fillon denounced those who “don’t work and receive public money,” in what has become a principal theme of his campaign. But in its investigation, The Canard Enchaîné quoted another of Mr. Joulaud’s assistants as saying: “I never worked with her,” adding, “I knew her only as the minister’s wife. ” Mrs. Fillon has always told interviewers that she stayed away from politics and devoted herself to the couple’s five children, and to domestic pursuits. Of Welsh origin, Mrs. Fillon has been known for her interest in horses and has been photographed with her family in and around the couple’s chateau in Western France. The affair could be all the more damaging because the image of Mr. Fillon has been based on probity and austerity, and he has called for sacrifices from the French, including cuts to civil servant jobs. Campaigning in Bordeaux on Wednesday, Mr. Fillon angrily denounced the new reports as “stink balls,” saying, “So, because she’s my wife, she doesn’t have the right to work. ” He called the Canard’s report “misogynist. ” On Twitter he wrote, “I’m astonished that these old, and legal, facts have become a story, three months from the first round of presidential voting. ” The Socialists criticized Mr. Fillon on Wednesday. “You can’t call yourself the candidate of honesty, of transparency, and then be unable to explain yourself on these matters,” said Manuel Valls, one of two in the Socialists’ primary runoff on Sunday. The Canard also reported that Mrs. Fillon had been paid 5, 000 euros a month over a year and a half by a wealthy friend of Mr. Fillon’s, Marc Ladreit de Lacharrière, who owns The Revue des Deux Mondes, an   political review. The newspaper suggested that Mrs. Fillon had in fact done little work in return for the pay.'"}, "time": 1742563246.5889878}