{"duration": 0.029533863067626953, "input_args": {"text": "'Elton John has cancelled all of his upcoming concerts in Las Vegas after contracting a rare and “potentially deadly” infection while touring in South America. [A representative for John said Monday that the    “Rocket Man”   would no longer be able to honor the April and May dates of his Las Vegas residency, “The Million Dollar Piano,” due to an extended stay in a hospital recovering from the rare illness.  “During a recent, successful tour of South America, Elton contracted a harmful and unusual bacterial infection,” the singer’s representative said in a statement obtained by People magazine. “During his return flight home from Santiago, Chile, he became violently ill. Upon returning to the U. K. Elton’s doctors admitted him to hospital, where he underwent immediate treatment to remove the infection. ” “After spending two nights in intensive care followed by an extended stay in hospital, Elton was released from hospital on Saturday, April 22 and is now comfortably resting at home per doctor’s advice,” the statement added. “Infections of this nature are rare and potentially deadly. Thankfully, Elton’s medical team identified this quickly and treated it successfully. ” The representative said John is expected to make a “full and complete recovery. ” The pianist’s scheduled performance on May 6 in Bakersfield, California has also been cancelled.  “I am so fortunate to have the most incredible and loyal fans and apologise for disappointing them,” John said in his own statement. “I am extremely grateful to the medical team for their excellence in looking after me so well. ” John is expected to return to the stage June 3 with a concert in Twickenham, England. It was not immediately clear whether the cancelled concerts would be rescheduled.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561947.624742}