{"duration": 0.1644594669342041, "input_args": {"text": "'  Buzz Aldrin Is A Warning Of How Success Can Lead To Depression Buzz Aldrin Is A Warning Of How Success Can Lead To Depression Aaron Clarey \\nCaptain Capitalism is the resident economist of the mano/androsphere. He is a misanthropic, hedonist, nihilistic, cynical type, but he keeps getting proved right every day. He is the author of \" Enjoy the Decline ,\" \" Worthless ,\" and \" Bachelor Pad Economics \". His newest book is \" The Black Man\\'s Guide Out Of Poverty \". He also runs the advisory \" Asshole Consulting .\" You can read his daily rantings at his blog Captain Capitalism . November 13, 2016 Masculinity \\nBuzz Aldrin and Neil Armstrong are household names because they were the first men to land on the moon. And while Neil is perhaps the more-remembered of the two because he was technically the “first” to land on the moon, Buzz is just as remembered because of his unique name (while I bet most of you don’t know who the third guy was). But technicalities of who landed where first and who had cool names aside, Buzz Aldrin will forever be one of the world’s greatest historical figures because of his unrivaled accomplishments and will die a better man than the vast majority of us. \\nBut did you know Buzz Aldrin was an alcoholic? And after retiring he fell into a severe depression? And after his divorce his days consisted of drinking alone in his apartment, fetching KFC and booze until he entered rehab? \\nIt’s a hard fact to believe. Where a man who seems to have everything (fame, a super-accomplished career, and least of all, the titanium-strong professionalism and self-discipline to become an astronaut), yet he ends up down, depressed, drunk, and perhaps even suicidal like any other ordinary piece of trailer trash. But while it doesn’t make sense at first, and you can’t see how this relates to you, realize there’s a VERY good and simple reason for this fall from great heights. The Buzz Aldrin Syndrome \\nUnderstand as we use the internet to accumulate the wisdom and knowledge to rocket past our contemporaries and excel in life, a problem is festering that you are unaware of. Additionally, much like Alzheimer’s, it is not prevalent today, but as humans advance more and live longer, it will become increasingly common. Therefore, we have the option to identify it today, prepare for it now, and thus avoid the pain and insanity that comes with having a problem we can’t identify \\nor \\nwe can have it devastate our lives later. \\nIt is the Buzz Aldrin Syndrome. \\nThe Buzz Aldrin Syndrome is where a man achieves such greatness, such accomplishments in life, that he is truly unrivaled and peerless. While exhilarating at first, perhaps even earning one fame, riches, and fortune, the success also unintentionally alienates the person from the rest of society. At the time Buzz Aldrin only had three or four other astronauts who he could REALLY talk to, confide in, and relate to. The remaining 3 billion people on the planet (at the time) were just star-struck, wide-eyed sheep. Alas, Buzz Aldrin could be surrounded by scores of fans at a party, but still be completely alone mentally. \\nThe syndrome is also exacerbated as one’s pinnacle achievements in life are likely correlated with retirement. You typically progress in your career, right up until the day you retire. However, here you leave the environment and network you’ve come accustomed, thrived in, and derived your entire agency from. Thus, in a very short period of time you go from the center of attention, the life of the party, the engine of the machine…to a retiree in California, drinking scotch, and eating KFC, longing for the days you could go back to the office again. Without the environment you derived all your worth and value from, you lose purpose in life, you lose mental stimulation, you lose your peers, and very likely sink into a crippling depression. The Perfect Storm \\nThere are seven factors that, when combined, create the perfect storm for the Buzz Aldrin Syndrome to form. And most ROK readers either have these traits are affected by them: 1. Technological Advancements \\nTechnology has always advanced, but in this particular case it affects us in two specific ways. Making living expenses cheaper and allowing for more and easier ways to make money. \\nAs opposed to the 1800’s, most of a man’s life was spent toiling in the field. He didn’t have time to contemplate loftier or heavier subjects much like the purpose of life, what is man’s reason for being, etc. You had to worry about the plague, tetanus, your wife dying in labor, and whether there’d be enough crops to survive the coming winter. But today, through economics, capitalism, agricultural technology, etc., a single man can basically eat for near-free at Wal-Mart or the local grocery store. \\nTechnology has also freed us from work. Not so much from the fact we have to work, but in terms of how much time we need to spend on it in order to survive. No more than a decade ago a young man had to work 40 hours a week, 10 for a commute, and likely for an inept baby boomer boss who was never going to let you get past the cubicle plantation. Now, with the internet not only can a man give the proverbial finger to rush hour and a commute, but his boss as well, making whatever minimalistic modicum of money he needs to survive through online entrepreneurship. In short, it has never been easier to satisfy Maslow’s first three and vital hierarchy of needs, freeing a man’s mind to pursue his own excellence, not to mention ponder his point and purpose in being here. 2. Minimalism \\nIt is no secret that red pill men practice, or at least pursue minimalism. We know that material things do not matter, as it is the love and friendship from our fellow man, friends, family and loved ones that matter most. You know that it would be “nice” to have that Shelby Super Snake Mustang, but you’d never trade it in for a lifetime of conversations and cigars with your best friend. Additionally, we value our freedom above all else and refuse to subjugate ourselves to becoming debt slaves by buying things we plain don’t need. \\nJettisoning these material desires liberates more of our finite lives from work and a commute, to once again pursue our passions, our fields, our adventures, and our lives. In simply refusing to buy a McMansion and take on a car loan, we guarantee we will live more interesting and rewarding lives than 90% of our peers. 3. Avoiding Divorce And Unwanted Children \\nFurther saving us more time is the disproportionate number of us refusing to have children or marry (in fear of divorce). And for those of us who do marry, we are fully aware of what to look for, more or less immunizing us from divorce. 4. Knowledge of Women \\nTo be blunt and honestly assess the good the “manosphere” and red pill community have done, we have saved the lives of MILLIONS of young men, and prevented older ones from wasting what remains of theirs. If I were to estimate it, every boy born today will save at least a decade of time that would have otherwise been wasted at nightclubs, chasing tail, dating the wrong girls, and perhaps even marrying the wrong ones. \\nBeing a product of the 70’s, I have often talked with my Gen X peers where we estimated what we could have done had we not wasted the 80’s and 90’s chasing women we were either never going to get, or would regret catching. We could have easily had doctorates, houses built by our own hands, much better careers, not to mention better mental health as we would have avoided all the batshit insane women we sifted through. Young men today, especially those who consume the Red Pill, will easily have a decade of time on us by simply learning from our mistakes . 5. Self-Improvement \\nUnless you are in the VirginTOW community, you know how important self-improvement is to a man’s life. You have this one finite life on this planet, and not only is it imperative you enjoy it, but you must ensure it is a masterpiece of art in whatever endeavors you choose to excel in. This may not land you on the moon, but you will achieve greatness and excellence in some capacity or another. Music, literature, innovation, philosophy, being a good dad, something. You will not idly stand by, sitting on your ass, majoring in sociology, or collecting a welfare check as you knock up baby mama after baby momma. You will be notable and leave a positive legacy on this world. 6. Entrepreneurship or STEM \\nMost of you know not to major in stupid, worthless shit . You also know that for the majority of us, entrepreneurship or self-employment is the only form of employment that we can tolerate. Because of this, two things will happen in your life. One, you will save an inordinate amount of time spent trying to make a go at a career that just isn’t in demand in the real world. You will work as an engineer, a programmer, a doctor, or some REAL profession/trade, which will not only pay you a handsome wage, but make your life incredibly easier. Two, at some point in time you will come up with an idea that will either cement your success in your career or outright launch a successful entrepreneurial endeavor. This will free you from your dependence on traditional employers, ensure your financial future is sound, but it will also likely lead towards you achieving your legacy in excellence. \\nIn the veritable sea of liberal arts majors, not one of their millions will ever make anything of themselves. They will simply waste away, doubling down on masters degrees and doctorates in their hopelessly worthless fields. Worse, they will be crippled until death with student loans and inadequate compensation as they beg and vote for other people’s money. They will die like most, unmentionable, irrelevant, and forgotten. \\nYou will not. 7. A High Intelligence \\nTo make all of this a reality you need the raw intellectual capacity to bring this to fruition. While no studies have been done, if you have the independent mindedness to be reading ROK, I’d estimate the average IQ of ROK readers to be 120. However, keep in mind while being highly intelligent is an asset, it is also a curse . Like ROK, you are on “the fringe.” And because of that you are not only going to receive an inordinate amount of flak from the rest of “normie” society, but relating to the rest of it, let alone finding a healthy and rewarding social life in it, is going to prove next to impossible. \\nWhen you combine these traits and conditions, you have what is arguably the perfect environment for a great life to form. You need very little to survive because you won’t waste your resources on frivolous material things in life. You also have very little liabilities or responsibilities, not only because you’re a minimalist, but are likely not going to marry or have children. The lion’s share of your time and energies can be dedicated towards achieving excellence and greatness in your life. \\nAnd if you’ve done it right, you’ll be two decades ahead of your Gen X peers since you avoided worthless degrees and leap-frogged your philosophical understanding of life. You will be accomplished, you will be successful, you will have paid a fraction of the mental toll to get there, and you will indeed be an amazing man, the world’s most interesting perhaps. You have reached the so called “finish line” much earlier and faster than Buzz Aldrin… \\nand that’s when your real problems start. You Weren’t Meant to Be Here \\nUnderstand that while the goal of man was to secure unlimited food, resources, and security so that he may pursue an unlimited and happy life, the human mind has no experience being here. The entire existence of humankind has been struggle, suffering, fighting, and striving for such a life, but also 99. % of the time failing . And over the course of human history the human brain has had 2 million years experience and conditioning in failure, NOT success. \\nThis leads to an ironic and perhaps the most tragic instances in human experiences. A man finally gets what he wants. Wealth, health, success, excellence, legacy, everything. But upon attaining it he can’t enjoy it because the human mind is not programmed to. He not only realizes this rare success doesn’t result in happiness or a perpetual life-long glee that will see him to his grave, but there’s nothing left to conquer. There’s nothing left to do. The game of life is over, and like Red Dead Redemption, it gets mighty boring just riding your horse around after you conquer the game. \\nWorse, because of the unique characteristics required to attain this excellence any man “lucky” enough to be this successful is in one way or another ostracized from the rest of his peers. Professionally, romantically, intellectually, some way or another, to be in that . 1% you have to be a statistical freak. Alas, you get to suffer the true symptoms of The Buzz Aldrin Syndrome. \\nPeerlessness – While your friends are pumping out children or your colleagues are trying to get out from underneath their McMansion mortgage and impending divorce, you may be avoiding these dreaded fates, but you are also alone. No longer are these the college days where your intellectual peers in equal life-circumstances can hang out, chat, philosophize, and in numbers that seem endless. Slowly, but surely, they will get picked off like German Messerschmitts in WWII by the forces of life and you will be left alone. \\nUnderstand this has nothing to do with your pursuit of greatness or achieving excellence in life, but is outside of your control as these people fall within the bell distribution curve of averageness. They choose these lives, meaning it’s not the statistical freak leaving them, but them leaving the statistical freak (no matter how loudly they claimed in college they were going to live life “differently”). And don’t think that you can simply recoup your former social life by joining them by being average, putting on a sports jersey, ordering some Buffalo Wild wings, cheering on the local sportsball team. Your mind won’t tolerate it. \\nYou are peerless. Get used to it. \\nBoredom – Without people you get bored. No matter how intelligent you are, you are still human. And humans are indeed social creatures as they derive their entire life value from others, not things. But the paradox those suffering from the Buzz Aldrin Syndrome face is that while you would like to be social with people, the vast majority of people are either too common, too stupid, or just too boring, especially when compared to being by yourself. \\nGo to that same Buffalo Wild wings to hear loud, drunk, divorced SWPL men in their 40’s cheer on the local swingystick team? \\nOr read Marcus Aurelius ? \\nGo to a movie where Jason Bourne discovers another mole in the CIA…again…who set up his father…again….where he drives around Europe shooting the place up….again? \\nOr binge on some history podcasts ? \\nI know! How about you go to a party where you’ll hear the same conversations from men about the sportsball game they just saw at Buffalo Wild wings, as they lament their inability to get out from underneath their mortgage, while the wives gossip about their painfully pointless government-make-work careers while talking about how great the cake is? \\nOr road trip out west and do some hiking in the desert? \\nThe larger point is not only are the VAST majority of people not intellectually stimulating enough, but good luck finding enough of them who have the freedom and finances to do anything besides hit up happy hour when wifey lets them out of the house. \\nAnd then there’s… \\nFrustration – Being unencumbered by the daily scourge of chores, children, finances, mortgages, and commutes, your mind will be unshackled to pursue whatever intellectual pursuits it wishes to pursue. You’ll solve world problems in an afternoon that politicians are taking eons to not solve. You’ll come up with some and many viable business ideas, discarding most of them because you have not the time to put them all into execution. You’ll see the obvious solutions to making your friends’ and love ones’ lives infinitely better, but they’ll have the horse-blinders on so tight, they’ll ignore your wisdom. Or you’ll make a great scientific discovery at work, while your boss dismisses it away and threatens to fire you for having an independent thought. It is simply the real world telling you, “You don’t control everything, and matter of fact, most of this world was not meant for you.” \\nObviously, you can see where depression, alcoholism, and ennui set in. You can see where the pursuit and successful attainment of excellence in life can lead to unintentional alienation and ostracization from the rest of society. And since society is where all humans – geniuses or not, successful or not – get their value, you can see the downside to zooming past the “finish line of life,” especially at increasingly earlier ages as technology and minimalism permit it. \\nThe solution is in part to find quality people who can be life-long friends, colleagues, peers, and comrades. Perhaps even get married if you find the right girl. And no matter what, keep yourself and your mind occupied. Hobbies, interests, pursuits, etc. Inactivity is death. But ultimately, what is going to best prepare you for what’s coming is to simply know it’s coming. \\nNirvana and heaven are not at the other side of that finish line. An active and rewarding social life, full of close friends and loved ones are the not the reward for success. And it certainly isn’t a life-long party until you die. It is a mentally-barren landscape much like the moon, a place Buzz has been to both literally and metaphorically.'"}, "time": 1742628519.2533371}