{"duration": 0.017847299575805664, "input_args": {"text": "'A rally being held by French presidential candidate Marine Le Pen faced a security risk on Monday evening after a protester attempted to storm the stage, eventually being dragged off by the Front National leader’s security detail. [Ms. Le Pen  —   who is expected to reach the second round of this month’s presidential election  —   was giving a speech to a massive crowd at a hall in the Parisian neighborhood of Aubervilliers when a female got onto the stage and attempted to throw flowers.  Marine Le Pen is cheered by crowds after a protester runs on stage and tries to approach her before being dragged off by security. pic. twitter.   —   The Local France (@TheLocalFrance) April 17, 2017,  According to reports on Twitter, the suspect was successfully detained, while Ms. Le Pen blamed the “extreme left” for the incident and reemphasized that she is a defender of women. Marine Le Pen blasts ’extreme left’ for trying to disrupt her speech after a woman ran on stage before being dragged off.  —   The Local France (@TheLocalFrance) April 17, 2017,  Feminist protestor breaks on to stage at #LePen rally. Fast bundled off. Crowd wild. Le Pen says she is the defender of women. #France2017,  —   natacha butler (@natachabut) April 17, 2017,  PARIS  —  A woman got up on stage at the #Zenith and rushed towards #MarineLePen Suspect detainedLePen safe pic. twitter.   —   chill (@chiIIum) April 17, 2017,  A BBC Europe producer also claimed that another protester was removed from the audience, having stripped naked in an act of defiance. That’s 2 protesters now dragged out of Le Pen rally. One off the stage  one naked from the audience. Le Pen carries on regardless.  —   Maria Byrne (@byrnemaria) April 17, 2017,  Protests against Ms. Le Pen took place in the neighborhood of Aubervilliers, a suburb severely affected by mass immigration, as   activists through firebombs at police, who responded with bottles of tear gas. Tear gas  smoke grenades as police face off with protesters ahead of Le Pen rallyhttps:  .  pic. twitter.   —   Defend Europa (@DefendEvropa) April 17, 2017,  Similar protests against Ms. Le Pen’s candidacy have taken place across France in recent months, as   and ‘ ’ groups organize to bring her down. Polls ahead of this month’s election suggest that Ms. Le Pen, who is running on a candidacy of opposing mass immigration and the European Union and, will win the first round of voting, yet faces an uphill battle to win against globalist candidate Emmanuel Macron in the second round. Some of her policies include a referendum on France’s membership of the European Union, taking tough stances on radical Islamism, as well as implementing a   “France First” form of economic nationalism. However, polls in recent days suggest the race is tightening, with   candidate François Fillon and the   left wing candidate   Melechon seeing increased support. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742628546.1973374}