{"duration": 0.09963440895080566, "input_args": {"text": "'Good morning. Here’s what you need to know: • The stage is set for fierce battles starting tomorrow as the U. S. Senate begins confirmation hearings on   Donald J. Trump’s cabinet picks, even though many have not completed customary background checks or ethics reviews. The first focus will be Senator Jeff Sessions, above, Mr. Trump’s choice for attorney general. Boris Johnson, the British foreign secretary, is in the U. S. for talks with advisers of Mr. Trump and congressional leaders. In 2015, Mr. Johnson said that Mr. Trump displayed “an ignorance that is truly alarming. ” _____ • “Laughter of the year!” Russian politicians and commentators are ridiculing a U. S. intelligence report that outlines an elaborate plot ordered by President Vladimir V. Putin to alter the outcome of the 2016 presidential race. Interviews with supporters of Mr. Trump in two U. S. states found similarly dismissive opinions. Journalists are trying to come to terms with Moscow’s ability to steer Western news coverage by doling out hacked documents. _____ • In Jerusalem, a Palestinian driver plowed a truck into a group of Israeli soldiers, killing four, injuring 17 others and ending several months of relative calm in the city. Israel was shaken politically by a report that Prime Minister Benjamin Netanyahu negotiated for more positive coverage with Yediot Aharonot, a newspaper that is often critical of the prime minister, in exchange for curtailing its main competitor. And Israel’s ambassador to Britain apologized over a recording of a senior diplomat plotting to “take down” senior British politicians. _____ • At the Golden Globes, the musical “La La Land” dominated by winning a record seven awards. In drama categories, “Moonlight” won best picture, “The Crown” won best television show and Isabelle Huppert was named best actress for her performance in “Elle. ” And Meryl Streep used her acceptance speech for a lifetime achievement award to forcefully criticize Mr. Trump. _____ • Two men who made history died: Mário Soares, who guided Portugal’s rocky transition to democracy in the 1970s, was 92. Ayatollah Ali Akbar Hashemi Rafsanjani, a founder of Iran’s Islamic Republic, was 82. _____ • Freezing temperatures spread across most of Europe over the weekend, killing dozens and disrupting traffic. Russia celebrated the coldest Orthodox Christmas in 120 years. It will remain bitterly cold across Europe’s southeast today, but temperatures are expected to rise in Western Europe. Fresh snow in the Alps is good news for ski resorts there. _____ • In London, a   strike of staff members that has shut most Underground stations in Central London is disrupting commutes today. And British Airways said a cabin crew strike on Tuesday and Wednesday would not disrupt flights. • Russia required Apple and Google to remove the LinkedIn app from their local stores. • A Volkswagen regulatory compliance executive was arrested in the U. S. on conspiracy charges, marking an escalation of the criminal investigation into the automaker’s diesel emissions cheating scandal. • The European Union’s statistics agency is expected to say that unemployment in the eurozone remained unchanged in November. • Here’s a snapshot of global markets. • Many Turks view President Recep Tayyip Erdogan’s authoritarianism as reassuring in the face of a ferocious onslaught of terrorist attacks. [The New York Times] • Germany threatened to end development aid to countries that refuse to take back rejected asylum seekers. [Agence  ] • An assembly of Irish citizens convened by Parliament is considering changes to one of the most divisive policies in the country: the   ban on abortions. [The New York Times] • Italy’s Five Star Movement is voting on whether it should leave the alliance of euroskeptic parties in the European Parliament it   with the U. K. Independence Party. [Politico] • America’s opioid epidemic killed more than 33, 000 people in 2015. We followed the interstate flow of cheap smuggled heroin and tracked “pill mill” clinics where pain medicine is handed out like candy. [The New York Times] (In this new section, we’ll help you start your day just right.) • A New Year’s challenge for the mind: Make this the year that you quiet all those negative thoughts swirling around your brain. Here’s how to do it. • If you’re hitting the gym this morning, don’t forget to warm up. It may just save your knees. • Recipe of the day: Don’t order out tonight  —   make your own   sesame noodles. • Eight seconds is an eternity when you’re on top of a bucking,   animal. Our Daily 360 video takes you out of the chutes with professional bull riders. • David Bowie resurfaced in a new video for one of his final songs just hours before what would have been his 70th birthday on Sunday. • NASA announced plans for a spacecraft named Psyche to visit an asteroid that appears to be made of metal. “Not only is it unique,” an expert said, “it’s improbable. ” If one of your resolutions this year is to eat healthier in the morning, consider porridge. The combination of grain and water is comfort served in its most humble form. The dish has also been feeding the world for thousands of years. Congee, a   porridge, has been eaten in China since about 2, 500 B. C. Koreans make variations of juk, with pine nut as the main ingredient. Upma is a thick porridge made from roasted semolina or rice flour common in south India. And in Ethiopia, genfo, unique for its use of red pepper, is a traditional Sunday breakfast. On many cold mornings, Americans start their days with oatmeal. The actor Wilford Brimley famously pitched the food’s health benefits in an ad, saying, “It’s the right thing to do. ” But Scots may be the most famous consumers of oats. They’ve been a staple of their diets since the Roman Empire. Scotland even hosts a global   competition  —   the Golden Spurtle is the top prize. Scotland’s former oldest living woman swore by the dish. Before her death in 2015 at 109, she revealed her secret to longevity. “A nice warm bowl of porridge every morning,” she said, and “staying away from men. ” Remy Tumin contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742562184.4676635}