{"duration": 0.0941016674041748, "input_args": {"text": "'Breitbart London Editor in Chief Raheem Kassam has delivered a stirring monologue on Breitbart News Daily, celebrating Article 50 Day, reflecting on the journey which led us here, and looks forward to the opportunities Brexit will bring. [“It’s a very, very important day an absolutely monumental day for Western civilisation for democracy for the will of the people,” he began. “It’s an incredibly important day for my country, and for the future of the Western world.  “Today is the day the British government will formally advise the European Union that we intend to leave the EU, after a tumultuous   relationship that culminated in that shock victory for the ordinary man and woman on June 23rd last year. ” Believe in Britain. Vote to Leave EU. https:  .   —   Nigel Farage (@Nigel_Farage) June 23, 2016,  “It is a day I will never forget from voting in the same polling station as the Prime Minister, to touring across the   of England and around London  —   my car speakers were blaring ‘The Final Countdown’ by the band Europe  —   to later that night, when the votes began to trickle in, into the early hours when we realised, ‘Oh my God. We might have actually done it’,” he recalled. “And honestly, I couldn’t believe it. I couldn’t believe my eyes, nor my ears, as I stood next to Nigel Farage and the news anchors gulped with trepidation: ‘Ladies and gentlemen, Britain has voted out of the European Union’  —   I get chills just thinking about it. ” We’ve only gone and bloody done it! !! pic. twitter.   —   Raheem Kassam (@RaheemKassam) June 24, 2016,  “We now set off on an exciting road, full of possibilities, as a once again sovereign nation in a world desperate for change. “Today marks a day not just for the United Kingdom, but for our great allies and trading partners around the world, who we so churlishly turned our backs on when the European Union came knocking, claiming to have a trade deal we couldn’t refuse. “But the situation today has changed,” Kassam declared. “Emerging markets, as found in the Commonwealth, are growing faster than our European partners. The Continent turned its back on controlled migration and effective borders European leaders decided to pursue political, financial, and military union as a new kind of empire, dominated by Germany, with a single currency, a flag and an anthem  —   so utterly foreign and devoid of all meaning to we British that we found ourselves with no other option but to say ‘Nope, not for us. Not anymore.’ “In short, our Prime Minister’s letter to the European Union today will say, ‘Thanks for the memories, even though they weren’t so great’. ” Kassam also looked forward to a renaissance for the historic   friendship, and a renewal of the bonds of loyalty which bind Great Britain to its kith and kin in the Commonwealth of Nations. “A new dawn has broken for our pioneering nation and our allies around the world: American, India, Australia, Canada  …     “We still want to be good neighbours with our European friends, but we don’t want to live in the same cramped apartment with them, treading on each other’s toes and arguing about what to watch on the television  —   no. “Instead, Britannia and Uncle Sam will be able to stand shoulder to shoulder once again, unimpeded, unencumbered, and free to project the pioneering values we always have throughout modern history: liberty, the will of people, the rule of law, and importantly, alongside all these things, pride. “Pride in who we are as a people, pride in who we are as a nation, pride in what both we can achieve independently and in free and open relationships that we are not forced to be a part of, but that we choose to be a part of. ” Addressing listeners in the U. S. directly, Kassam emphasised: “Our great nations both underwent major seismic changes last year, ladies and gentlemen, and today, on Article 50 day in Britain, I say this to you: Now marks our greatest opportunity to deliver a better world for our children, and our children’s children, than we will ever get again in our lifetimes. “Happy Article 50 Day, ladies and gentlemen!”  '"}, "time": 1742561937.186971}