{"duration": 0.16223955154418945, "input_args": {"text": "'Do You Believe In Miracles? By Michael Snyder, on November 9th, 2016 \\nWe have never seen anything like this in the history of American politics. Donald Trump’s shocking victory on election night is nothing short of a modern day miracle. Several weeks ago I told my readers that it would take the biggest political miracle ever in order for Trump to win, and I had been strongly urging them to vote , but even early on election night I was skeptical that Trump could actually pull it off. Initially the results coming out of Florida, North Carolina and Ohio looked rather ominous, and a lot of Trump supporters were freaking out. But those initial numbers strongly reflected early voting results, and those results typically favor Democrats. Once the Election Day numbers started rolling in, it was clear that there was a massive unanticipated wave of momentum for Trump. \\nOnce I saw that Virginia was going to be much more tightly contested than anticipated and that Trump had jumped out to a lead in Michigan, I realized that Trump had a really good shot at winning the whole thing. Over Skype I told a stunned audience that the numbers were looking really good for Trump, but it was still so early in the evening that I don’t know if a lot of people believed me. And I certainly didn’t blame them, because I could hardly believe it myself. \\nOnce Trump took the lead for good in Pennsylvania, I knew that it was all over. My wife and I looked at each other in disbelief, and we are still trying to come to grips with a future that we didn’t think was possible. \\nWatching Donald Trump speak to the American people after he had been declared the winner was a surreal experience. At this moment, it still doesn’t seem real to me that he could become the next president of the United States a little more than two months from now. But at this point it looks like that is precisely what is going to happen. \\nAfter it was all over, I kind of stumbled around my home lost in my thoughts. I was happy, confused, hopeful, stunned and pensive all at the same time. Like so many others, what I thought I knew about politics turned out to be wrong. But in other ways, the election of Donald Trump has confirmed so much of what I know to be right about America. \\nUltimately, it was the American people that decided this election, because the elite were doing their best to absolutely bury him. \\nNever before has the mainstream media been so openly biased against a major party presidential candidate. For months on end they dumped sewage on Trump, but it didn’t work. \\nNever before has a major party presidential candidate faced a civil war in his own party on the eve of the election. A whole host of big names in the Republican Party publicly announced that they would not vote for Trump, but it didn’t work. \\nNever before have we seen a bigger October surprise than the lewd tape from 11 year ago that came out and shocked the world. That would have instantly killed the campaign of any normal politician, but it didn’t kill Trump’s campaign. \\nFrom the very beginning it seemed like Trump was at war with almost everyone, and somehow he came out on top in the end. \\nHe beat the Bushes and the Clintons. \\nHe beat the Republicans and the Democrats. \\nHe beat Hollywood and the mainstream media. \\nHe beat the pollsters and the pundits. \\nHe beat the never-Trumpers and the billionaire donors. \\nHe beat Miley Cyrus, Katy Perry, Lady Gaga, Jay Z, Beyonce, George Clooney, Matt Damon and Lebron James. \\nHe beat the forces of globalism, elitism and political correctness. \\nHe beat CNN, Fox News, MSNBC and Barack Obama. \\nHe beat them all. \\nOf course Donald Trump is not perfect and he is not going to be a perfect president. \\nBut this is about as perfect a moment as you are going to get in American politics. \\nDonald Trump took on the entire American political universe and he won. \\nWe have never seen anything like it before, and I doubt we will ever see anything like it again. \\nAnd I want to apologize for being so skeptical to those that kept trying to tell me that Trump was going to win. As a former attorney, I was trained to be skeptical and to look at the cold, hard numbers. And the cold, hard numbers kept telling me that a Trump victory was nearly impossible. \\nI kept strongly urging people to vote, particularly because the prospect of a Hillary Clinton presidency was absolutely horrifying for me personally, but I was not optimistic. \\nIn hindsight, perhaps we all should have recognized that the signs were there. For example, it seems a very strange “coincidence” that Donald Trump will be 70 years, 7 months and 7 days old on his first full day as president of the United States. This is a man that appears to have had a date with destiny, and we shall see what happens in the months to come. \\nYes, there will be great challenges ahead, but those discussions are for another day. \\nToday I am just happy. \\nI am happy that the American people have elected a man that I will be proud to call president. \\nAnd I am happy that we are not going to have to endure four years under the most wicked, vile and corrupt politician that the United States has ever seen. \\nAgainst all odds, Donald Trump won. \\nAt this point I am not exactly sure what comes next for America, but things are definitely looking a lot brighter today than they did yesterday. BATTLE LOG \\nYou missed one! \\nHe beat the radical, far left trolls that frequent this website and harass conservatives and religious folk alike! \\nBwahahahaaaa!!!! \\nShe’s having a nervous breakdown. Mad Monkey \\nAs predicted the ‘Trump’ has blown long and loud, I am shocked at the stocks market upswing and drop in gold price….. Apparently the guys at wall street were booing Clinton during her concession speech,… It is all a bit wired, so much lies from mainstream media. Mondobeyondo \\nNearly every mainstream media poll had Clinton beating Trump. They were just salivating over a Clinton victory. The champagne was even on ice. \\nIn the immortal words of Yogi Berra, “It ain’t over till it’s over”. DB200 \\nMondo, same thing for the Brexit. Either people don’t tell what they think when they are polled or the polls are manipulated/fixed by the MSM. \\nComing year there will be elections in several countries in Europe and it is possible that extreme right (= Eurospeak for real Republicans) will win more votes than the polls suggest. If for instance Marine le Pen wins the French presidency, that may end the euro and even the EU. \\nFact is that ordinary people are fed up with the political elites. df NJ \\nNew Jersey rules this country! \\nNew Jersey is a lot like Galilee, everyone thinks it’s a shiite hole. Jim \\nMany alt media sites predicted a Trump win and you could not help but see it if you were paying attention . ie crowds and signs for Trump etc. df NJ \\nI think the miracle is God intervened and stopped the voter fraud. alan \\nI think there was fraud it just wasn’t enough. Brian \\nI thought Brexit was a Miracle but what transpired last night easily TRUMPS that! ;-D Amazing Grace \\nTrump VS. The American Aristocracy \\nDavid VS. Goliath. Satirist 1976 \\nAmerica definitely made the wrong move. It saddens me that Hillary was unjustly vilified. Hillary is devoted to her country. Also she is a champion of woman’s rights, the environment, and tolerance. \\nWhen it comes to understanding the importance of protecting the environment Trump is at the apex of ignorance. He wants to undo the Clean Air act and dismantle the Paris accord. Global warming is a serious issue that must be dealt with urgently. \\nThe unemployment rate is at 4.9% Since the height of the recession the unemployment rate has dropped by more than half. \\nAmerica has enjoyed over 6 straight years of private sector job growth. \\nYearly GDP has finished positive for 6 straight years. \\nPMI indexes have been consistently over 50. A reading over 50 indicates expansion. \\nObamacare is a gift from God. It will end up saving thousands of lives. \\nMillions of Americans have become more cognizant of the importance of respecting and not marginalizing minorities. \\nWeekly unemployment claims have been under 300K for over 80 straight weeks. The longest such streak in over 40 years. \\nAmericans everywhere should thank Obama for his faithful service to America. kfilly \\nYou can quote Reich propaganda all you want. Hitlery would have brought you World War 3 shooting down Russina jets with her “no fly zone” in a country we should not even be fighting over (Syria). chris \\n‘Hilary is devoted to her country’ !!!! And which country is that? i ask because it certainly ain’t the USA. AWM \\nMichael……maybe now you can start blogging about more inspirational stories and ideals, and try to bring hope to people rather than the gloom and doom that pours from your sad self. Maybe you need to be on an antidepressant, it’s worth looking into at least. You claim to be a man of God, but I understand a true believer in God has faith and hope in all things, not doubt and worry. Pray for healing and give your worries to your savior. kathym2 \\nI think people finally woke up. K \\nYes, far more than the numbers indicate.You see I believe the landslide was so great it overcame the fraud and the manipulation. I believe that God in his mercy, gave us one last chance. A chance to turn from the evil this Country has become.If we waste this chance. I would not expect, to be thrown another lifeline. kfilly \\nI still see something far more sinister behind this. I want to see if Trump sticks to the Constitution or becomes a tyrant by usurping it. As far as the sinister part, I potentially see conservative/freedom movements getting set up for the coming global economic collapse. The freedom Brexit movement and now the election of Donald Trump ensure two of the biggest players in the Western World can wreak a lot of havoc on the global economic system. I fear the elite will collapse the economy in 3, 2, 1. These people have back up plans for their plans. They will not give up simply because their favorite puppet lost. I see a potential future where freedom lovers get blamed for the destruction of the economy that was intentionally destroyed by globalists (communists) which is similar to what Nazi Germany did to the Jews. greanfinisher . \\nI wouldn’t describe the Trump upset as a miracle, but rather a travesty. Well, you people bought him so now you will have to pay. chris \\nJust as in the UK Brexit vote the result will bring out the sour grapes and the sore losers. old geezer \\nIf we was able to survive 8 years of a Muslim Terrorist in the White House, I think we can manage to survive 4 to 8 years with an American Patriot. DB200 \\nA millionaire and a TV personality will be the next US president. Sounds like “Berlusconi” to me. So at least it will be entertaining the coming years as Mr. Trump is a more colourful person than Mr. Obama. \\nNevertheless, a major achievement given the obstacles he had to overcome. BrentAH \\nMichael, here’s what you failed to take into account — people all over the world who were on their knees begging God to grant America a reprieve. AKMark \\nSpot on Michael and Maranda! My wife and I felt the same watching and listening to the last minute skeptics on Fox, Juan Williams and a few others. We believed from near the beginning of Donald Trumps campaign that He was God’s chosen. I don’t think anyone who believed in Donald Trump didn’t feel at times because of the overwhelming criticism by, as you listed, so many Americans in all venues of people, even Christians! We all prayed more for Donald Trump and his family more than any other candidate for president, and for good reasons, as you stated. Right On! Now, the work begins though. As in everything good, it never comes easy. Our Lord is now requiring of us to pray not only for Donald Trump and his safety, safety of his family, but for all America to put their trust in God once again, not for just a few weeks or a month as in the past. This will be a long time of diligent prayer, humility and trusting the Lord. The enemy is dug in already in America and will not give up easily. We need to focus on Jesus, pray for revival and especially for our own protection. The hardest thing I see right now is for us to ” Love our enemies and pray for them.” But that is what our Lord Jesus Christ is asking us to do. We must trust and obey Christ in this command. If we don’t do it now in the divided USA, we will not succeed. Our heavenly Father has given us all we need to succeed in loving our enemies who are against the Lord’s will. He has given us His Spirit, the Holy Spirit to overcome. We have the commissioned assignment, the Authority of Christ…now we just need to get with it immediately. The Victory is in Jesus. The Lord bless America and His people, in Jesus name. JC Teecher \\nI am with you on the thumbs up for Michael and Meranda. They are true soldiers on the battlefield for Christ. another true soldier on the political battlefield is our new (soon to be) Vice president of the US of A, Mike Pence. \\nHe is the chosen one sent to right the wrongs of the evil doers that have controlled the White House, and rented it out for personal gain since 1988. \\nWhen a man and his family walks up on the stage, and first thing said is to thank God and for His mercy and grace, then we have a true leader. Trump is not an evil man, but prefers to keep his spiritual self separate from his business self. The potus position for him is “all” business, and with a strong amount of compassion for all peoples, from all walks of life, and all skin colors. \\nHe is not a selfish man or a hater of women like the left wants to portray him. he will do all he can to right the ship that has been listing for almost 30 years. he just may be the deadly wound spoken of in Revelation. Since one of the Seven heads is the USA, as a superpower, it could be that it becomes the one head that becomes a wound or set back to the NWO system. Voila’ and Eureka. Why hasn’t any of the so-called evangelical leaders thought of this or received the unction from the Spirit, as to this possibility? \\nBecause they haven’t asked, is the only reasoning I can come up with. Anyways, the times are bringing about prophetic enlightenments and revelations, that has never been before, and we are entering the last of days..aks asin the last of years, decade and some. Amen! Satirist 1976 \\nEven though heroic Hillary lost, love will always Trump hate. alan \\n20 trillion in debt isn’t going away anytime soon. We’ll see if the Titanic makes it to port. JB \\nI’m not sure what comes next either, but we should praise the Lord for the opportunity. A lot can happen over the next couple of months and I’m sure the forces of darkness are anything but done. We should also continue to pray for God’s continued (undeserved) blessing. It’s the “not knowing what comes next” that keeps us on our knees before Him. Trumpet \\nI told you so from the begining, he is DA MAN. Paul Reynolds \\n“Meet the New Boss, same as the Old Boss”. How easily people are fooled. Cheeto Jesus will save us!! LOL Go back to church and pray some more. biglipnagger \\nPride is the word of the day today for me, too. Priszilla \\nNow imagine the losers are calling FRAUD. Temujin \\nGoldman Sachs stocks are up 5.89%. My biggest question is: Isn’t he just as much a part of the establishment and the whole thing just a show…? JC Teecher \\nI can’t imagine anything negative about a Trump win over the crap we have had for the past 30 years or so as potus-n-dungus-among-us. What I do know is this………Melania will be the most exotic and most royality-like First Lady, that we have had in decades. \\nJackie-O was a gracious and very lady like woman, and put up with Jack’s adulterous affairs and such, but none have been as stunning and intelligent as Melania Trump. \\nShe will bring an essence of the spirit of the woman into the White House, that it hasn’t seen since Eleanor Roosevelt. She was the most proactive woman advocate for Human Rights that ever held the title as First Lady. \\nLadybird Johnson was a very close second in my book, and I have the “claim to fame” of having been privileged to sit in the same seat she sat in, in her private/personal limo. it was just a lucky moment in time, after her death, and a silk rose lay in the seat as a reminder of her work as in her Beautification Campaign. \\nsad to say their husbands turned out to be stepping stones for the Banksters One World order agenda, or better said…pawns. David R.(Canada) \\nWhy am I not able to log-in using Disqus?'"}, "time": 1742628593.9352756}