{"duration": 0.09583711624145508, "input_args": {"text": "'Afghanistan, under the presidency of Barack Obama, lost control and influence of nearly half of its   territory as armed clashes between the nation’s security forces and the Taliban reached unprecedented levels, reports a congressionally appointed watchdog agency. [According to the latest quarterly report to Congress by the Special Inspector General for Afghanistan Reconstruction (SIGAR) which covers the final months of the Obama administration, about   of the country is considered “contested. ”  “Previously   [U. S. Forces in Afghanistan] has described contested districts as having ‘negligible meaningful impact from insurgents,’ contending that neither the insurgency nor the Afghan government maintains significant control over these areas,” notes SIGAR. The U. S. military revealed that more than half (57 percent) of southern Afghanistan’s   Helmand Province, which borders Pakistan, is under insurgent control or influence. Moreover, five out of the six districts (83 percent) in Uruzgan Province  —   which lies next to the Taliban and   strongholds of Helmand Province and Kandahar Province in southern Afghanistan  —   are under insurgent control or influence. Kandahar is considered the birthplace of the Taliban. The Afghan government only controlled or influenced about 57 percent of the country’s 407 districts as of   2016, marking a nearly 15 percent decrease from the same period the previous year. Citing the U. S. military, SIGAR explains: [O]f the 407 districts of Afghanistan’s 34 provinces, 233 districts were under government control (83 districts) or influence (150) 41 districts (in 15 provinces) were under insurgent control (9) or influence (32) and 133 districts were “contested. ” [  …    ]   attributes the loss of government control or influence over territory to the ANDSF’s [Afghan National Defense and Security Forces] strategic approach to security prioritization, identifying the most important areas that the ANDSF must hold to prevent defeat, and focusing less on areas with less strategic importance. The U. S. military notes that the number of districts under insurgent control or influence rose 2 percent from late August to   2016, to nearly 10 percent. Meanwhile, the number of districts that have been deemed “contested” increased nearly 4 percent to about 33 percent of all districts during the same period. SIGAR learned from United Nations (UN) that “Afghanistan’s security situation further deteriorated between January and October 2016, with intensifying armed clashes between the Afghan security forces and the Taliban. ” Armed confrontations between the U. S.  security forces  —   which include police and army units and insurgents, primarily the Taliban  —   “reached their highest level since UN reporting began in 2007, and marked a 22% increase over the same period in 2015,” adds the watchdog agency. “The Taliban continued to challenge government control in key districts and attempted to cut off strategically important highways and supply routes. ” The UN recorded 6, 261 security incidents in Afghanistan between August and November 2016, representing a nearly 10 percent increase from the same period in 2015. “As in past UN reporting, armed clashes account for the majority of the security incidents (65%) followed by those involving   explosive devices [IEDs] (18%). During the period, the majority of the recorded security incidents (66%) continued to occur in the southern, southeastern, and eastern regions” that border neighboring Pakistan. Most of the districts under insurgent control or influence lie in provinces in and around Afghanistan’s border with Pakistan, which the Pentagon has repeatedly accused of serving as a sanctuary for terrorists. “The region with the most districts under insurgent control or influence is centered on northeast Helmand Province and northwestern Kandahar Province, and includes the   border area, Uruzgan Province, and northwestern Zabul,” reports SIGAR. “This region alone accounts for 16 of the 41 districts (or 31. 7%) under insurgent control or influence. ” Despite the government’s loss of territory and insurgent’s gains, the U. S. forces in Afghanistan “noted that the insurgents failed in their eight attempts to capture a provincial capital this year,” points out the inspector general. Furthermore, the U. S. military found that “the amount of population that the insurgency influences or controls decreased from 2. 9 million to 2. 5 million (a decrease of 1. 2%) in the last three months,” adds SIGAR. In its last assessment of the Afghanistan war conducted by the Obama administration, which was released in December 2016, the Pentagon downplayed the insurgent gains. “Taliban territorial gains during this reporting period were fleeting, as the ANDSF consistently retook district centers and population areas within days of a loss,” the Pentagon reports. “Although security conditions vary across the provinces, the Taliban have exploited their localized and temporary successes by portraying these events as major strategic shifts through the use of social media and other public information campaigns. ” “The ANDSF largely repelled insurgent attacks in Helmand Province and several attempts to isolate Kunduz City in July, August, and October 2016,” it adds. “Although the ANDSF experienced minor setbacks during these and other insurgent offensives, they frequently regained lost terrain. ”'"}, "time": 1742564039.6488118}