{"duration": 0.047646284103393555, "input_args": {"text": "'WASHINGTON  —   A group of United States Olympians from the Rio Games is set to visit the White House on Thursday. It’s a safe bet that one particular lawmaker will be excluded from the guest list. That would be Representative Jim Himes, Democrat of Connecticut, a former Harvard rower who last week cast the only vote against a bill that would give most United States Olympic and Paralympic medalists a tax break on their victory bonuses. The vote on the bill  —   which was approved by the Senate earlier this year and is expected to be signed into law by President Obama  —   was 415 to 1. “A lonely, lonely moment,” Himes said Friday when I spoke with him by telephone. Contrary to what you might be thinking right now, Himes does not hate sports or love income taxes, and he doesn’t disdain the Olympics in general or   Olympians in particular. Far from it. In the 1980s, he was the captain of Harvard’s lightweight crew, and he said he even tried, unsuccessfully, to make the United States national team. This summer, he said, he was “caught up in the thrill of our Olympic victories” as much as anybody else. But Himes is also a former Rhodes scholar who once worked at Goldman Sachs, so he knows how to add, and for him, the question of an Olympic tax break was a simple question of priorities: Why should athletes receive perks at a time when that money, even if it’s only a drop in the federal budget, is needed elsewhere? His conclusion was that they should not. “We’ve got a Zika crisis, an opium epidemic and gun violence in the news every day,” Himes said. “I think those are the issues that Congress should be spending time on. ” Not that Congress spent much time considering this tax break issue, anyway. The reservations that sank earlier versions of the legislation  —   that a tax break for Olympians, while other Americans had to pay full freight, wasn’t, well, fair  —   were no match for the current bill. It sped through the Senate this year and then Usain Bolted through the House last week. Himes said many of his colleagues considered the bill a   because it was “a   thing,” a celebration of bipartisan patriotism wrapped in     Speedos and leotards and clad in similarly themed running spikes. And who doesn’t love Olympians, and America, and winning? The flip side is Himes’s side. Why should Olympians get tax breaks when other extraordinary Americans don’t? As Himes notes, Nobel Peace Prize winners and spelling bee winners and Special Operations soldiers still have to pay their taxes. He called the Olympic bill arbitrary, not to mention bad fiscal policy. And if the argument is that struggling Olympic athletes need a raise, it’s not as if the Games don’t produce enough money to throw the stars of the show a little extra cash. Unfortunately, too much of the money in the Olympic movement  —   squeezed out of sponsors, television networks and ticket buyers  —   never finds its way down the food chain. Somehow, some way, millions of dollars still slip into the pockets of top sports officials every four years. So Himes is probably right: If you’re looking for an extra million or so every four years  —   which is the projected cost of this narrowly targeted tax cut  —   maybe try shaking it out of the expense accounts first. Besides, even without government money, the United States dominated in Rio, winning 121 medals  —   51 more than China, which finished second in the overall standings. For those 121 medals, American Olympians will receive a total of $2, 085, 000 in prize money from the United States Olympic Committee  —   $25, 000 for every gold, $15, 000 for every silver and $10, 000 for every bronze. In the past, that money  —   as well as the value of the medals themselves  —   was considered taxable income. And under the current bill, athletes like Michael Phelps, Kevin Durant and Simone Biles, who earn more than $1 million a year, will still be taxed on their winnings. So why change the law to benefit a few dozen (extraordinary) citizens? Why not, said Derek   the chief executive of U. S. A. Cycling. “Remember, these athletes have no clear source of income,” he said Friday. “They don’t have a direct path to a paycheck, like a firefighter. It’s far more amorphic, and they have quite precarious financial situations. “With the Olympics, you take a risk. It might pay off, and it might not. ” He added, “We ask our athletes to behave in a certain way and represent the United States in a certain way, and the tax break is just a way of acknowledging something they did for our country. ”   said the bill’s passage was welcome news Friday at the U. S. O. C.’s congress in Colorado Springs. When Scott Blackmun, the U. S. O. C.’s chief executive, announced that it had cleared the House, the room filled with applause. More than 1, 600 miles away here in Washington, Himes didn’t hear it. And when he heard that the United States Olympic and Paralympic teams would be honored at the White House this week, he laughed, he said. “I might want to request a personal security detail,” he added.'"}, "time": 1742628488.9833956}