{"duration": 0.4707169532775879, "input_args": {"text": "'Tweet Home » Gold » Gold News » ‘When Money Dies: The Nightmare of the Weimar Collapse’ Precious metals expert Michael Ballanger discusses his favorite investing books and reviews the landscape for gold and the U.S. dollar between now and the end of the year as the almighty “gravestone doji” signals the end of the dollar rally is near… Submitted by Michael Ballanger, Streetwise : \\nSince entering the hallowed halls of Saint Louis University, that sits near the banks of the equally-venerable-and-old man river, the “Mighty Mississippi,” I have kept a number of books in my library that shall remain as “life textbooks,” tomes upon which to refer in times of confusion, despair, joy and victory. \\nBecause of my background in hockey as a (much) younger man, I have always enjoyed re-reading sports books and one of my favorites was Ken Dryden’s “The Game” because he described a team and league that had many members familiar to me in the 1970s. Thomas Hauser’s “Muhammad Ali: His Life and Times” was another superb book about the singular, most-globally-recognized athlete of all time and, again, an athlete from the era in which I was raised. \\nHowever, the REAL text books were books like “The Four Agreements” by Don Miguel Ruiz, “The Power of Now” by Eckhart Tolle, and “Conversations with God, Book 1” by Neale Donald Walsch, all of which dealt with the human spirit and personal struggle. \\nHowever, in the world of business and markets, the books which are always within arm reach are, in order of least-to-most importance, “The Battle for Investment Survival” by Gerald M. Loeb (1935), “Reminiscences of a Stock Operator” by Lefevre and Lowenstein (1923), “ Boomerang: Travels in the New Third World” by Michael Lewis (2011), “Atlas Shrugged” by Ayn Rand (1957) and finally “When Money Dies: The Nightmare of the Weimar Collapse” by Adam Fergusson (1975). \\nAs a snapshot of the societal impact of the Great Keynesian Experiment through which are currently traversing, “Atlas Shrugged” tells you EXACTLY where we are today complete with gutted-out American manufacturing and massive corruption, intervention, and interference brought about by the odious partnership between government and the elite 1%. The one book that describes the probable outcome of all of the money-printing ($57 trillion) of the post-2008-meltdown era is “When Money Dies: The Nightmare of the Weimar Collapse” and it is this book that is sitting under the desk phone in my office. \\nThe last paragraph sums it all up with the following ghastly summary: “In hyperinflation, a kilo of potatoes was worth, to some, more than the family silver; a side of pork more than a grand piano. A prostitute in the family was better than an infant corpse; theft was preferable to starvation; warmth was finer than honour; clothing more essential than democracy, food more needed than freedom.” THAT paragraph is like “The Ghost of Christmas Yet-To-Come” in Lewis Carroll’s “A Christmas Carol,” and it is truly frightening. \\nThe use of history books is, for me, a necessity and the following two quotes are the reasons why: \\n“History never repeats itself but it rhymes.” – Mark Twain . \\nand, \\n“Those who cannot remember the past doomed to repeat it.” – George Santayana \\nIn the bigger picture concerning the global capital markets, I see enormous changes coming and it is all laid out in front of us like those little solar lights that illuminate the path from my deck down to the water on a very dark night. In “Atlas Shrugged,” Ayn Rand describes what America would look like when the business “elite” finally own the government and legislature and the justice system. Nothing is more relevant than looking at the events that have transpired since the Financial Crisis of 2008 that didn’t “nearly” take down the financial system; it DID take it down but criminal collusion manufactured the bail-out mechanism that allowed it to continue to function in “Walking Dead” fashion. \\nAll you need to do is look at Deutsche Bank to witness all of the same insanity, greed and aberrant behaviors that were so very prominent among the bankster crowd of 2004–2008 being replayed here in 2016 by the German’s beloved DB . \\nIn “Boomerang”, Michael Lewis walks us through the mindsets of the European bankers and politicians and especially the citizenry, whose contempt for the former two is most acute in Ireland, where one might have thought a few of them might have been carted off to jail. \\nHowever, nothing can send chills up and down your spine more than the last of my list, “When Money Dies.” We have all heard stories about the Weimar hyperinflation and how the indiscriminate albeit well-intended printing of “Reich marks” sent post WWI Germany into chaos and bedlam and unimaginable human suffering. \\n“Atlas Shrugged” describes the environment created BY the crime; Michael Lewis walks us through the incredible sense of entitlement among the populist movement responding TO the crime; but Adam Fergusson paints a horrific portrait of the outcome OF the crime. It is a “must-read” for everyone that is playing around with stocks and bonds or trying to manage “Cash” these days. Can’t happen here in “the modern world”? Well, it is happening right now as we speak in Venezuela where prison inmates have been resorting to cannibalism due to dire food shortages and government corruption. \\nI write all of this nonsense because as a former resident of the U.S., I was there for the Watergate hearings; I watched Nixon resign; I watched Jimmy Carter have his legacy tarnished by an Arab oil embargo, 12% inflation, massive line-ups at the gas pumps and a hostage crisis. I watched Presidential campaigns in 1972 and 1976 first-hand and have always paid a great deal of attention since. The bare facts behind this year’s race are ugly; you have two candidates that are equally annoying, unequivocally flawed and universally repulsed by the vast majority of voters. \\nWhat hits me between the eyes is that for the first time in history, we are witnessing a race so thoroughly “un-presidential” that it resembles a WWF wrestling match complete with enough “smackdowns” and “whup-ass” remarks to put Vince McMahon to shame. \\nThe global champion of democracy and capitalism, apple pie and Apple Computer now has the entire world looking on in fear and disbelief that either one of these two candidates could have access to the launch codes that could vaporize the entire planet in a heartbeat all because of a bad meal or a particularly stressful day. The days of Ronald Reagan running the country as Chairman of the Board are now over. And that, my friends, is not only sad; it is outright disturbing. \\nSo the U.S. dollar continues to roll higher and the gold market struggles to right itself against FOREX headwinds. The U.S. dollar responds to the pre-election tape-painting and the broadly-based consensus that once the election is over that the Fed will hike rates and send the USD index to 105. \\nHowever, given that I don’t care a great deal for technical analysis, here is a Wiki snapshot of a classic “Gravestone Doji” that indicates that a trend may be coming to an end. \\nNow take a look at the chart of the U.S. dollar index ($USD) that has finally turned up with a big Gravestone Doji to cap the current rally off the May, June and August lows, setting things up for another metals advance into year-end. \\nNow, we saw a Gravestone Doji a few months back in the HUI (NYSE Arca Gold BUGS Index) around 175 but it decided to advance another 100 points before correcting, so don’t get too excited (or committed) with this one for the USD. I only mention it because the USD is not as illiquid as the global gold market because the Americans have printed TRILLIONS of USDs since 2008 so it is not nearly as easy to manipulate FOREX as it is gold. Ergo, technical analysis works for the USD and it is useless for gold—period. \\nI reported to you all that I had re-entered the GDXJ (VanEck Vectors Junior Gold Miners ETF) position on October 13 th and added more on Friday the 14 th when I suddenly realized that I was far too complacent with the decaying currency sitting in my trading account. I was growing miserable, snarly, inattentive, and argumentative without my beloved GDXJ position and it was truly difficult to function. \\nThose around me were so happy to see me take my enormous profit on GDXJ and were more than happy with the new drapes and the new leash and the Gourmet Alpo and the “designer doggie bags,” but I now know that they thought of me as “seriously depressed.” I am now no longer upset and I am no longer depressed as I now own every single wonderfully decadent share of the GDXJ that I owned back in late 2015 when the junior miners were being shorted and sold by every HFT algorithm and every desk trader and every CNBC-following doorknob on the planet. \\nNow, for the traders out there? I have a sell order in for 50% of the GDXJ position at $45.00. If filled, we will own the remaining 50% at new breakeven cost of $32.20 at which point I sit back and chill. No reason to particularly worry with such a wonderful adjusted cost. \\nNow, most of you are dying to know how a) Stakeholder Gold Corp.’s (SRC:TSX.V) Ballarat RAB drilling program is progressing and b) when the Canuc Resources Ltd. (CDA:TSX.V) /Santa Rosa RTO will be completed. Last update for the Yukon was yesterday and the first seven RAB holes are now en route to the assay lab in Whitehorse where the turnaround should be 10-14 days. SRC CEO Chris Berlet and V.P. Exploration John Nebocat are in Dawson City today travelling to the property for a day full of comprehensive interpretation and analysis. I would expect a drilling update upon their return. I could talk all day about the large intercepts of quartz sericite alteration and the density of the rock they are encountering but until the assays are back from Whitehorse, it is pretty much meaningless. \\nI have been asked about the seasonality effect and the lack of news flow during the long Yukon winter and whether or not it will affect the stock price performance. The fact that SRC will have a full treasury after all 2016 exploration bills are paid allows a generous amount of working capital to be allocated to marketing. Since getting the story “out” is crucial to the survival of all junior miners, SRC has already secured a booth at the January 2017 Vancouver Resource Investment Conference and will be doing the same for PDAC in Toronto in March. While that is all fine and dandy, it is obviously imperative that SRC has a decent tailwind from positive assay results coming off the 2016 program. \\nAs for the Canuc/Santa Rosa RTO, all I can say is that every RTO to which I have been privy over the years takes longer than first thought and this one is no different. Between the lawyers and the regulators, it seems that just when you think you are getting the green light, they come up with something ridiculous like translating a document that is 15 years old from Spanish to English “in order to protect the poor minority shareholders of Canuc Resources.” In reality, all that needs to happen is for Canuc shareholders to vote on the transaction. It is they that are getting absorbed by the private company (Santa Rosa Silver Mining Corp.) so why not just ask them if they are OK with the terms of the deal and drive on? Alas, despite the delay, I simply cannot stand the wait as the Santa Rosa project will be a beauty. (If anyone wants to have a look at the old PowerPoint presentation that was used back in 2015, email me at [email protected] .) \\nOnly two more weeks until the elections are over and then it should be a “Sell the news” scenario for the USD and that should provide the impetus for a sizzling year-end rally in the metals. Then, as 2016 ticks down, and with so many money managers having missed the gold rally, it wouldn’t surprise me if there is a mid-December scramble for the mining shares and/or physical gold and silver as year-end window dressing is applied to “modern portfolio management.” \\nRight. . . \\nOriginally trained during the inflationary 1970s, Michael Ballanger is a graduate of Saint Louis University where he earned a Bachelor of Science in finance and a Bachelor of Art in marketing before completing post-graduate work at the Wharton School of Finance. With more than 30 years of experience as a junior mining and exploration specialist, as well as a solid background in corporate finance, Ballanger’s adherence to the concept of “Hard Assets” allows him to focus the practice on selecting opportunities in the global resource sector with emphasis on the precious metals exploration and development sector. Ballanger takes great pleasure in visiting mineral properties around the globe in the never-ending hunt for early-stage opportunities. Want to read more Gold Report articles like this? Sign up for our free e-newsletter, and you’ll learn when new articles have been published. To see a list of recent articles and interviews with industry analysts and commentators, visit our Streetwise Interviews page. \\nDisclosure: 1) The following companies mentioned in the article are sponsors of Streetwise Reports: None. The companies mentioned in this article were not involved in any aspect of the article preparation or editing. Streetwise Reports does not accept stock in exchange for its services. The information provided above is for informational purposes only and is not a recommendation to buy or sell any security. 2) Michael Ballanger: I own, or members of my immediate household or family, directly or indirectly own shares of the following companies mentioned in this interview: Canuc Resources Ltd., Santa Rosa Silver Mining Corp. and Stakeholder Gold Corporation. My company Bonaventure Explorations Ltd. has a relationship with Stakeholder and Canuc via Santa Rosa. I determined which companies would be included in this article based on my research and understanding of the sector. 3) Statements and opinions expressed are the opinions of the author and not of Streetwise Reports or its officers. The author is wholly responsible for the validity of the statements. The author was not paid by Streetwise Reports for this article. Streetwise Reports was not paid by the author to publish or syndicate this article. 4) This article does not constitute investment advice. Each reader is encouraged to consult with his or her individual financial professional and any action a reader takes as a result of information presented here is his or her own responsibility. By opening this page, each reader accepts and agrees to Streetwise Reports’ terms of use and full legal disclaimer . This article is not a solicitation for investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company mentioned on Streetwise Reports. 5) From time to time, Streetwise Reports LLC and its directors, officers, employees or members of their families, as well as persons interviewed for articles and interviews on the site, may have a long or short position in securities mentioned. Directors, officers, employees or members of their families are prohibited from making purchases and/or sales of those securities in the open market or otherwise during the up-to-four-week interval from the time of the interview/article until after it publishes. \\nCharts provided by Michael Ballanger'"}, "time": 1742628592.6320767}