{"duration": 0.03396463394165039, "input_args": {"text": "'The University of Glasgow’s Queen Margaret Union have banned a livestream QA with former Breitbart Senior Editor Milo Yiannopoulos, claiming his opinions to be in breach of the union’s constitution. [Milo is currently nominated to become the university’s rector. According to the campaign team who nominated Milo, other candidates have been allowed to stage similar live events.  “Dear   I am writing on behalf of the Milo for Rector Campaign. We are enquiring to find out if we would be able to book a room in the QMU to host a livestream QA with Milo and the students of Glasgow University,” wrote Glasgow’s “Milo Squad” to the Queen Margaret Union. “We are aware that some other candidates such as Aamer Anwar have held similar meetings and would appreciate if our campaign could receive similar treatment. ” “We believe that it is important that students are able to question all candidates in order to make an informed decision,” they continued. “We would aim to have the room on Sunday if possible, but we are overall flexible with our dates. We look forward to hearing from you. ” The campaign team’s inquiry was quickly shot down by Queen Margaret Union’s Vice President Katrina Denholm, however, who claimed that Milo’s conservative beliefs were “deplorable” and broke the union’s constitution. “The Board of Management of the Queen Margaret Union has found some of the comments made by Mr Yiannopoulos regarding during his campaign to be completely deplorable, and to allow such opinions to be voiced within our Union would be in breach of our Constitution: section VII, Equality and Diversity,” Denholm replied. “Therefore we will not be allowing use of any space in our building for this purpose. ” Milo was one of twelve names put forward for the “prestigious position,” according to The Independent, and his candidacy has already prompted several protests from   students. “The current rector is exiled NSA whistleblower Edward Snowden,” The Independent reported. “Other candidates nominated this year include human rights lawyer Aamer Anwar, former Liberal Democrat MP Vince Cable, PissPigGranddad, an American internet celebrity fighting with the People’s Defence Unit in Syria, and Lady Hazel Cosgrove, the first woman to be appointed a Senator of the College of Justice. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563133.6212308}