{"duration": 0.0628654956817627, "input_args": {"text": "'Pakistani troops are seen in a village near the Line of Control (LoC) in Pakistan-administered Kashmir, October 1, 2016. (Photo by AFP) \\nPakistan’s army says Indian troops have killed two civilians in the disputed region of Kashmir. \\nA military statement said on Wednesday that “unprovoked” firing by the Indian forces took place along the “working boundary,” which separates Pakistan’s Punjab province from Indian-controlled Kashmir. \\nThe two were killed in the village of Chaprar, the statement said, adding that \"eight civilians were also injured by the Indian fire.\" \\nSeparately, a Pakistani civilian who was injured due to an earlier cross-border shelling succumbed to injuries on Wednesday. \\nThe Pakistani military said, \"Another civilian... who was injured by the Indian firing at Line of Control (LoC) Monday (October 24), succumbed to injuries today.\" \\nTensions have been running high along the Line of Control, which divides the two neighbors in Kashmir. Pakistani villagers show the wall of a house damaged by heavy mortar shells fired by Indian troops in the border village of Chaprar on October 24, 2016. (Photo by AFP) \\nThe Pakistani Foreign Ministry summoned a senior Indian diplomat to lodge a protest \"over the unprovoked firing by India on the LoC and the working boundary on October 25 and 26.\" \\nThe ministry called on India to \"instruct its troops to respect the ceasefire\" and \"refrain from intentionally targeting the villages and maintain peace.\" \\nRelations between the two countries have plummeted in recent months, with India blaming Pakistan for a raid on an army base in Indian-controlled Kashmir in September that killed 19 soldiers. New Delhi responded with what it called \"surgical strikes,\" infuriating Islamabad. \\nKashmir has been divided between India and Pakistan but claimed in full by both since the two countries gained independence from Britain in 1947. \\nIndia and Pakistan agreed to a ceasefire in Kashmir on November 26, 2003, and launched a peace process the following year. Since then, there have been sporadic clashes, with the two sides trading accusations of violating the ceasefire along their de facto border. Loading ...'"}, "time": 1742564189.367386}