{"duration": 0.14079713821411133, "input_args": {"text": "'HAVANA  —   It seemed like a new chapter in a long and troubled history. Thousands of Cubans bid farewell to Fidel Castro on Monday, filing into a plaza where he often railed against American imperialism. The same morning, the first regularly scheduled flight from the United States in more than 50 years landed in Havana, a potent example of the newly opened doors between the former rivals. But   Donald J. Trump warned on Monday that the push to build ties with Cuba after decades of animosity could quickly be wiped away. “If Cuba is unwilling to make a better deal for the Cuban people, the   people and the U. S. as a whole, I will terminate deal,” he said on Twitter. Mr. Trump’s message threatened to end one of President Obama’s signature foreign policy initiatives. Mr. Obama’s moves to relax restrictions on commerce, trade and financial transactions with Cuba were never part of a single “deal,” but rather a decision that engagement with the island nation would bring more change than decades of isolation. “Change is going to come to Cuba,” Mr. Obama said shortly after announcing the thaw in December 2014. “It has to. ” Since then, the number of American visitors to Cuba has risen quickly, with hotels in Havana sometimes being booked nearly a year in advance, often with large American tour groups. Billions of dollars in goods from American stores like Walmart and Best Buy, financed on American credit cards, make their way to Cuba every year, experts estimate. Restaurants, cellphones and the internet have changed the rhythms and expectations of Cuban life. But critics have long attacked Mr. Obama, saying he gave too much to the Cubans too soon, without first demanding that they open up their society and usher in an era of political freedom. Now, after two years of presidential directives by Mr. Obama to strengthen ties with Cuba, and millions of dollars in American investments, a question remains: Can the détente be rolled back? Even some Obama administration officials concede that the thaw is highly vulnerable to reversal because much of it has been accomplished through executive action. Mr. Trump could, for example, order the State Department to review its decision last year to remove Cuba from the list of state sponsors of terrorism, or suspend diplomatic relations that were resumed last summer with the opening of embassies in Havana and Washington. But Josh Earnest, the White House press secretary, argued on Monday that Mr. Trump would have a hard time reversing a policy that had already yielded business deals and benefited the people of both countries. There will soon be 110 daily flights from the United States to Cuba, he noted, not to mention the investments by cruise, tour and hotel operators to prepare for those visits. “Unrolling all of that is much more complicated than just the stroke of a pen,” Mr. Earnest said, adding, “It’s just not as simple as one tweet might make it seem. ” The Cuban government remained uncharacteristically silent on similar threats Mr. Trump made during the campaign, choosing instead to issue a congratulatory note after his election. But when Mr. Trump takes office, and his words become policy, “the Cuban government will have to respond, but hopefully with moderation,” said Ricardo Torres, a professor of economics at the University of Havana. Professor Torres said that there was much to be lost if the concessions were reversed, and that Havana would exercise restraint in its dealings with the Trump administration. But Mr. Trump’s antagonistic posture could embolden those in the Cuban government who have always been suspicious of the Americans and were against the warming relations brokered by President Raúl Castro, Fidel’s brother. “There’s no question this is a bad start to things,” Professor Torres said as thousands of students streamed by to bid goodbye to Fidel Castro, adding that Mr. Trump’s “belligerent attitude and animosity gives more reasons for suspicion and confirms the belief that this warming of relations wasn’t real. ” Mr. Trump has placed Mauricio   a lobbyist who has been a harsh critic of Mr. Obama’s opening to Cuba, on his transition team for the Treasury Department. Under Mr. Obama, the Treasury’s Office of Foreign Assets Control, which handles sanctions, has issued several rounds of regulations to remove impediments for American companies and individuals seeking to do business with Cuba and to travel there. In an opinion piece in The Miami Herald this month, Mr.   argued that Mr. Obama’s “new course for Cuba has made a bad situation worse. ” Human rights activists have long complained that the Cuban government simply shifted its strategy regarding political prisoners after Mr. Obama’s détente. No longer are Cuban dissidents jailed for prolonged sentences, activists say. Instead, they are now rounded up for a few hours or a few days, according to the Cuban Human Rights and National Reconciliation Commission, which logs every detention. There were 9, 125 detentions from January through October this year, the commission said  —   more than four times as many as in all of 2010. The highest number of arrests, 1, 416, occurred in March, when Mr. Obama made his historic visit to Cuba, becoming the first sitting American president to do so in 88 years. “To be clear, the   wants to see freedom in Cuba for Cubans,” said Jason Miller, a spokesman for Mr. Trump. Still, Elizardo Sánchez, who runs the commission, said Mr. Obama’s more open policy had helped more than it had hurt. “The personal contact that comes from all the travel has a huge impact in terms of fighting propaganda,” he said. “In a closed society, the door can only be opened a bit at a time. It’s going very slowly, but it’s happening. ” Others took Mr. Trump’s words as an assault that threatened to restart the kind of hostilities that the thaw was meant to end. “For a lot of people, it is an open threat to our sovereignty and history,” said Juan Alejandro Triana, also a professor at the University of Havana. “If the government of the   threatens these things, we will respond. ” And yet, with the loss of Mr. Castro, Cuba’s response would most likely be muted, and easier for the world to ignore. Without their leader, for many, Mr. Trump’s comments seemed reminiscent of the longstanding policy of confrontation between the two nations. “We don’t have anyone else like him right now,” Randy Calderon, a biology student at Havana University, said of Mr. Castro as he stood in a crowd of thousands paying tribute on university grounds. Inside the law school, where Mr. Castro studied, a small shrine had been set up showing him as a student leader, with posters filled with comments from students, many expressing a desire for Mr. Castro to live forever as the country’s “eternal comandante. ” Even Cubans who challenge the ideology of “Fidelismo” express support for some of the revolution’s achievements, especially universal health care, and they often call for exactly the kind of hybrid of socialism and capitalism that the recent détente with the United States has expanded. Carlos Alzugaray Treto, a former Cuban diplomat, said the urgency to lock those changes into place had only intensified with Mr. Trump’s victory. “That type of bullying won’t work with Cuba,” he said. “Mr. Trump should remember the main reason President Obama changed the policy and made the agreement with Raúl Castro: The previous policy had failed. ” Financially speaking, the biggest and most immediate impact of reversing détente would be in the travel and hospitality sector in Cuba. The surge in American visitors to Cuba since the easing of travel restrictions has been a boon to hotels, transportation and the restaurant scene in Havana. Reversing some of Mr. Obama’s decisions could be legally difficult. Companies like JetBlue, Starwood and Airbnb have invested millions of dollars in time and resources to enter the Cuban market, and did so with the American government’s blessing. “In theory, Donald Trump has the ability to reverse almost everything Obama has done,” said Matthew D. Aho, an adviser on Cuba at the New York office of the Akerman law firm. “In practice, that reversal would be far more complicated from a legal process than most observers realize. ” Niuris Ysabel Higueras Martínez runs Atelier, a popular restaurant in Havana where Michelle Obama dined with her daughters during the president’s trip this year. Ms. Martínez is one of the nearly 500, 000   businesspeople who have entered the work force since the government began loosening employment restrictions in 2008. In 2015, she saw her business increase by 50 percent, she said, the largest rise since she opened in 2010. For the most part, the increase was a result of American visitors, who now make up some 85 percent of her clientele. “It would be a major blow to us,” Ms. Martínez said of Mr. Trump’s threats to reverse the détente. “Still, while we really need the American market, it won’t be the end of the world. We aren’t going to die. ” The debate is unfolding amid a fight among influential   who are vying for the  ’s ear. On one side are   who advocate clamping down on the relationship and insisting on concessions in exchange for any United States engagement. On the other is a growing group that is pressing for further opening. “He’s surrounded by people who are only giving him one point of view  —   a very straight,   approach that says we need to go back to the old approach  —   and it would be wise for him to be hearing the other side and the benefits of continuing to engage Cuba,” said Carlos Gutierrez, a Republican former commerce secretary who heads the U. S. Chamber of Commerce’s business council on Cuba. “To just get rid of that strikes me as going well overboard. ” After Mr. Castro’s death, he added, Cubans “would feel like when they needed us most, we turned our backs on them. ”'"}, "time": 1742562358.7881753}