{"duration": 0.04004049301147461, "input_args": {"text": "'November 4, 2016 - Fort Russ News -  RusVesna - translated by J. Arnoldski -  \\n\\n\\nAs previously reported by Russian Spring, ISIS’ media wing, and the Al-Amak agency, on the evening of November 3rd, a Russian helicopter was shot down near Palmyra in the Khveisis village district in the Syrian province of Homs.  \\nLater, the Ministry of Defense of Russia denied reports that Russian servicemen were killed. The ministry did confirm that during the execution of a special operation on humanitarian cargo delivery on November 3rd, a Russian military helicopter made an emergency landing 40 kilometers northwest of Palmyra and its crew was successfully evacuated by Russian search and rescue forces.  \\nEarlier, ISIS terrorists reported that the Russian armed force’s helicopter was shot down by a guided missile.  \\nThe terrorists have just published footage of the rescue operation and the destruction of the Mi-35 helicopter in the desert near Palmyra. The video and photos clearly show Russian special forces on armored Tiger cars and KamA3 “Vystrel” evacuating the crew with an Mi-8 military transport helicopter. \\n\\n\\nDuring the rescue helicopter’s takeoff, the damaged Mi-35 exploded, after which special forces orderly left the scene on armored vehicles and in the Mi-8. The rescue helicopter shot flares to protect against MPADS. \\nOn social networks, it has been suggested that the helicopter could have been detonated by special forces because of the impossibility of taking it back to base. According to another theory, the Mi-35 exploded after being hit by an MPAD rocket fired by militants. \\nThe Center for Reconciliation of Warring Parties in Syria subsequently reported the details of the emergency situation: “During the inspection of the helicopter by the crew on the scene, the landing area was subjected to mortar fire by militants. The helicopter was damaged, preventing it from independently returning to its air base.”  \\nThe Russian defense ministry also specified that the Mi-35 crew did not suffer and was rapidly evacuated by the search and rescue helicopter to the Russian military base at Hmeimim in the province of Latakia. At the time, the fate of the damaged aircraft was not known. \\n\\nThe Mi-35 combat helicopter was alleged to have been carrying out the military task of covering a transport helicopter delivering humanitarian aid.  \\n\\n\\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563603.803151}