{"duration": 0.03195595741271973, "input_args": {"text": "'How Western Media Teleported a Child \\'Victim\\' from Homs to Aleppo (PHOTOS, VIDEO) \\nWestern media is capable of amazing feats which defy even the laws of physics Originally appeared at Russian Spring \\nThe West keeps fighting its informational war on Russia blaming Russian Air Force for bloody crimes in Syrian Arab Republic. To persuade the world community of the fact that Moscow is to blame for catastrophic humanitarian situsation in Syria and not «moderate opposition» fighters turning the country into chaos world media descend into manipulating facts and publishing fakes. \\nThe easily expected maximum effect has photos and videos showing children suffering from war and bombardments. Western readers keep on commenting such stories and blaiming “Assad’s regime and Putin”, but haven’t the slightest idea that those stories are skillfully made up. \\n«Russian Spring» has already covered a story of a girl who had been saved again and again, several times in just one month , and now we are offering a tear-squeezing vide about a girl who was teleported from Homs province to Aleppo by the Western media. \\nChild, where are you from? \\nOn October 10 a footage showing allegedly one of the “bombardment victims» of Syrian Talbiseh in Homs province was published on YouTube channel of local informational resource talbisah. \\nAnd then the taer-sqeeinf video started its walk of fame thriugh media and social media: it was published on AJ+ Facebook page in particular (a Qatar-based telecom giant Al Jazzera) where it was reached by over 10 mln people (as of October 24). \\nAl Jazeea accompanied the video with pitiful subttles and corresponding title: «Happy Moday from Syria: this little girl is calling her dad after her house was destroyed by an airstrike». \\nBBC dealt with that video shortly and \"relocated\" the girl called Aya (as she introduced herself on the video) from Talbiseh to Aleppo by including a footage called «Aleppo: Where is my dad?» aya_bbc.jpg \\nHave a more attentive look on how medical staff working: even if we omit the shooting location fraud look at how strange the doctors behave. Instead of giving the first aid necessary for a kid after (alleged) bomberdment, instaed of cleaning head and face wound to minimize comtamination risk the doctors (or the actros playing doctors) keep walking around the girl wearing a troubled look not to hinder filming the vdeo. \\nQuite thick and artificail-looking blood cathes our eye as well as dark-blue bruises under girl’s eyes lookking a lot like make-up. \\nThe whole video looks like a staged one, the authors and creators have just used a win-win tactics for their short film: a child wounded at war. \\nTwitter star \\nThe journalists kept on using the pretty-looking mode in their propaganda. Som time later the girl was given a poster which read “Don’t bomb me again. It hurts. Aya” and made another tear-sqeezing photo which was then published by some Omar Qayson calling himself war journalists and media activist on his Twitter page . aya_twit.jpg \\nIt’s laughable but “media activist’s” Twiiter «has only 11 posts open to public and the first of them is a photo of a bird killed by bombardments, the three last are reposts of the aforementioned Aya’s photograph. \\nHashtags he chosen for his photo (Children of Syria and Russian kills us ) confirm the obvious fact: social media accounts like that are created by Western journalists with just one aim — to spread false photo and videos blaimimg Russia for «bloody crimes against Syrian people».'"}, "time": 1742628489.7785869}