{"duration": 0.16794300079345703, "input_args": {"text": "\"By Jason Easley on Sun, Oct 30th, 2016 at 2:37 pm Fox News Sunday's Chris Wallace tried to blame Hillary Clinton for the email scandal that Republicans created and got destroyed by Clinton campaign manager Robbie Mook. Share on Twitter Print This Post \\nFox News Sunday’s Chris Wallace tried to blame Hillary Clinton for the email scandal that Republicans created and got destroyed by Clinton campaign manager Robbie Mook. \\nThis exchange between Fox News Sunday host Chris Wallace and Clinton campaign manager Robbie Mook highlighted why the email scandal isn’t working for the GOP. \\nVideo: \\nTranscript via Fox News Sunday: WALLACE: The last question I want to ask you is that you’re acting as if it was the director who brought this into the election when the fact is that it was Hillary Clinton who brought this into the election. \\nI want to go back to the e-mail exchange on March 2nd, 2015, when The New York Times broke the story about Hillary Clinton using private e-mails. We’re going to put it up on the screen. \\nClinton adviser Neera Tanden, “Why didn’t they get the stuff out like 18 months ago? So crazy.” \\nCampaign chairman John Podesta, “Unbelievable.” Tanden, “I guess I know the answer, they wanted to get away with it.” \\nRobby, it was Clinton who delayed and it was Clinton who brought this into the presidential campaign. \\nMOOK: And it is Secretary Clinton who has said this was a mistake. It is Secretary Clinton who cooperated fully with the investigation. And it was Secretary Clinton who accepted the outcome of that investigation. And what secretary Clinton is doing now is saying, if there’s new information, get it out on the table. Let’s get it out. These could be duplicates. \\nAgain, it’s been reported these e-mails may not have been sent or received by Secretary Clinton. We don’t know anything. And this close to an election, this unprecedented announcement of new information, when – when, again, it’s been reported by Yahoo! News that – that the FBI may have not even seen it. That – that – that Director Comey sent this unprecedented letter shortly before the election when he doesn’t even know what the information is. That’s disturbing. And we’re just asking him, get everything out there that he knows. \\nFox News has no evidence of wrongdoing on the part of Clinton, so they have been reduced to whining about why she didn’t release the emails sooner. What Wallace left out was that the release of Clinton’s emails represented an unprecedented level of disclosure. \\nHillary Clinton didn’t cause this email scandal. House Republicans misused their Benghazi Select Committee to go on a fishing expedition for Hillary Clinton’s emails. \\nRobbie Mook destroyed Fox News with facts, because unlike Donald Trump, Hillary Clinton hasn’t worked to keep information hidden from the public. Trump has not released his tax returns, medical records, or an accounting of his business dealings with Russia. Trump has been the least transparent nominee in more than 40 years. \\nRepublicans and conservative media are blaming Clinton for the scandal that they created as justification for continuing the investigations of her after the election. \\nClinton’s campaign manager was able to wipe the floor with the Republican talking points because at the end of the day the email scandal remains a conspiracy about nothing.\""}, "time": 1742562831.8966756}