{"duration": 0.06095480918884277, "input_args": {"text": "'Scott Adams has gone   climate denialist in his latest Dilbert strip, causing liberal heads to explode.[  Some of his old fans just aren’t happy at this betrayal of The Cause: it’s a shame to see this as I used to think he was very funny. The Way of the Weasel was an awesome book. it could be dementia  —   that is a thing that happens to people  On Scott Adams, his comic strip and thought processes have pretty clearly jumped the shark, No doubt it is an accident of the pen. But the “climate scientist” in the cartoon bears more than a passing resemblance to Michael Mann, globally renowned inventor of the “Hockey Stick” and winner  —   or so he used to claim till he got rumbled  —   of the Nobel Prize. As Homer would say, this cartoon is funny because it’s true. In fact it sums up pretty much everything the layman needs to know about the state of climate “science” and how it abuses the public trust. So, it starts with truths which are widely accepted  —   “the basic science of physics and chemistry”. Then  —   like a street magician or a confidence trickster  —   it slips quickly from the realm of evident truth into a world of illusion: “We put that data into dozens of different climate models and ignore the ones that look wrong to us. ” Anyone who questions this groupthink is labelled a “science denier. ” But as Adams has grasped it has nothing to do with science. Rather it’s about the politically driven misapplication of models which have no   basis. This cartoon is by no means Adams’s first brush with WrongThink. In September last year, he caused more liberal heads to explode by publicly switching his allegiance from Hillary Clinton to Donald Trump. One of his cannier insights was that Trump’s bluster is actually a sign of emotional intelligence and   skills rather than a sign  —   as the progressives continue to believe  —   that he is a dangerous lunatic. Trump “paces” the public  —   meaning he matches them in their emotional state, and then some. He does that with his extreme responses on immigration, fighting ISIS,    etc. Once Trump has established himself as the biggest   on the topic, he is free to “lead,” which we see him do by softening his deportation stand, limiting his    comment to Chicago, reversing his first answer on penalties for abortion, and so on. If you are not trained in persuasion, Trump look scary. If you understand pacing and leading, you might see him as the safest candidate who has ever gotten this close to the presidency. That’s how I see him. “Dilbert has gone fascist“ Salon’s Amanda Marcotte responded, with typical verve, wit and lightness of touch. Then in March this year, the   blackshirted cartoonist caused further outrage by composing one of the best essays ever written as to why the claims of climate alarmists should be taken with a huge pinch of salt. It was titled How To Convince Skeptics That Climate Change Is A Problem. Here are two of my favorite entries: Don’t tell me how well your models predict the past. Tell me how many climate models have ever been created, since we started doing this sort of thing, and tell me how many have now been discarded because they didn’t predict correctly. If the answer is “All of the old ones failed and we were totally surprised because they were good at hindcasting,” then why would I trust the new ones? and, If skeptics make you retreat to Pascal’s Wager as your main argument for aggressively responding the climate change, please understand that you lost the debate. The world is full of risks that might happen. We don’t treat all of them as real. And we can’t rank any of these risks to know how to allocate our capital to the best path. Should we put a trillion dollars into climate remediation or use that money for a missile defense system to better protect us from North Korea? Needless to say, this also caused liberal heads to explode. Here’s a sample from one particularly virulent climate activist. None of Adams’ concepts are supported in any manner. He produces no research tied to it. There is no rigorous method applied to rationalize it. It’s little more than cultish ramblings validated by a small loyal following acquired through his previous success as a cartoonist. As Adams must be painfully aware by now, when you’re taking flak it means you’re over the target. Carry on Scott!'"}, "time": 1742563499.9457245}