{"duration": 0.09539914131164551, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. New polls showed a   bounce for Hillary Clinton. With just 37 more days before Election Day, she campaigned in Coral Springs, Fla. above. Democrats have benefited from a Supreme Court ruling two years ago that loosened rules on campaign donations, but large numbers of immigrants who have applied for citizenship are caught in a backlog and will not be registered in time to vote. Mrs. Clinton’s team is also preparing for the likelihood that Mr. Trump will begin  his   focus on Bill Clinton’s infidelities. _____ 2. An apparently sleepless Donald Trump produced an overnight tweetstorm, including recommending a seemingly nonexistent sex tape of the beauty queen he criticized for gaining weight. That, along with a blithe comment he made in this week’s debate about a hypothetical   hacker, set off a wave of concern over  . Above, Mr. Trump in Grand Rapids, Mich. _____ 3. The Israeli prime minister, Benjamin Netanyahu, shook hands with the Palestinian leader Mahmoud Abbas, a fitting moment of détente at the funeral of Shimon Peres. The last of the generation of leaders who helped found Israel, Peres won the admiration of leaders around the world for his tireless promotion of a   solution. _____ 4. Fears of a new global financial shock are rising over a crisis at Deutsche Bank, Germany’s largest bank, whose vast operations reach into investment houses across the world. How Germany’s government responds will test new rules in the European Union concerning banks “too big to fail. ” _____ 5.  In spite of the devastation around them, Syrian children played after an airstrike broke a water pipe in the city of Aleppo. Of the hundreds of people killed over days of aerial bombardment, more than 100 were children, a World Health Organization official said. Hundreds more have been wounded, both children and adults, and many are expected to die for lack of treatment. Behind closed doors last week, Secretary of State John Kerry expressed frustration over U. S. policy to Syrian civilians meeting with him in New York. “I lost the argument” for force,” he told them. _____ 6. Defying the U. S. Supreme Court has consequences. For Alabama’s chief justice, Roy Moore, the penalty for urging state officials to refuse to grant marriage licenses to   couples was suspension for the remainder of his term. But those who recall his prior removal  —   over his insistence on keeping a giant monument of the Ten Commandments at the state judicial building  —   don’t expect him to disappear. “The last time he was kicked off as chief justice, he ran for governor,” a former court spokesman said. “I don’t think he’s done. ” _____ 7. One of our   articles today takes on a task faced by many American cities: healing the scars of the urban renewal era. A signal casualty was New York’s soaring,   style Penn Station, above, razed 50 years ago and replaced with what our architecture critic calls “a shameful rat’s maze. ” Now, a top architect, at the behest of editors of The Times’s   page, has come up with a new hub that repurposes Madison Square Garden, below, turning its stripped skeleton into a convivial glass pavilion to remake a grim concrete and asphalt expanse. _____ 8. For the weekend: Our movie critic commends “Deepwater Horizon,” calling it “a swift and suspenseful action movie, full of noise, peril, muck and fire. ” HBO debuts “Westworld” on Sunday, depicting what our reviewer describes as “a dark Disneyland where the wealthy can wallow in incredibly lifelike Old West fantasy. ” Here’s what else is in theaters, and here are more   recommendations. And for the literary, consider our book critics’ nine selections, including “Born to Run,” by   …     oh, you know.  _____ 9. And if you have any spare time, we can help you navigate the sudden flood of lavish credit card offers. For instance, a   card beats a rewards card if you ring up under $8, 600 in card purchases. But if you travel abroad, savings on foreign transaction fees can tip the balance. _____ 10. Finally, there was a moment both sad and triumphant in the European Space Operations Center in Darmstadt, Germany. Rosetta, the first spacecraft to orbit a comet, flatlined at 7:19 a. m. Eastern Standard Time with a soft   onto the comet’s surface. The project scientist said team members mourned the craft’s demise but that “they’re still happy that we got to this stage”  —   faced with reams of data to parse. Have a great weekend.  _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563378.2720947}