{"duration": 0.10271859169006348, "input_args": {"text": "'posted by Eddie To some extent, we all read faces all of the time. When we look at someone who is new to us, we unconsciously assess them and form opinions about them, but in addition to this instinctive form of face reading, there are far more detailed methods—for example, like Chinese face reading, which we’ll be exploring in this article—with rules and regulations that have been carefully worked out over a long period of time. The best exponents of this skill are undoubtedly the Chinese, because they specialize in this form of divination. In common with all other serious forms of divination, this is a deep and difficult subject to master, but I’ll just dip into the subject in order to introduce you to a fascinating skill. Way back in the past, school curriculums often included physiognomy, along with palmistry, until the time of Henry VIII, when puritanical religions came in and outlawed these ancient science and interests. Three Major Areas of the Face In the Chinese face reading tradition, they call the forehead area down to the eyebrows Heaven, and this is associated with the early years of one’s life. The middle section of the face, from the eyebrows down to the base of the nose is called Human, and this is associated with the middle years of life. The lower section, from the base of the nose down to the bottom of the face is termed Earth, and this is concerned with old age. Any part of the face that is scarred, malformed, dented or discolored suggests a problem with the aspect of the subject’s life associated with that segment of his face. Grey or black marks, whether they are a permanent feature or just a temporary situation, denote problems that are themselves either temporary or permanent depending upon the type of dark mark. Even if the discoloration is caused by a trick of the light, it will mean something to a Chinese face reading specialist. As in every other form of divination, intuition also plays a part. In the ancient science of chinese face reading, the face is divided into three main areas. Heaven Positive: If this area is clean, clear and well defined, the person will have a good start in life with good parents and a useful education. Negative: Scarring, dents or discoloration here indicate a troubled childhood and a poor education, according to Chinese face reading philosophy. The problems will be worse for a man if the disfigurement is on the left, while for a woman if the disfigurement is on the right. A wide forehead is generally considered beneficial, but in a woman, a very wide forehead suggests poor personal relationships. The lines on the forehead offer a good deal of information, some being lucky and others unfortunate. Human Positive: The middle section of the subject’s life will be happy and productive, with stability in relationships and success in the career . Negative: This brings unhappiness, a lack of success at work and poor relationships. A human section longer than either of the other two sections suggests a determined and self-disciplined personality, according to Chinese face reading masters. Earth Positive: This indicates a happy old age with good relationships with children and grandchildren, along with prosperity and comfort. Negative: This denotes an unhappy and poor old age. The Thirteen Divisions of the Face Chinese face readers further divide the face into 13 sub-sections. Here is a very simplified form of the 13 -section reading, starting from the top of the face and working downward. The 13 divisions of chinese face reading. 1. Tien Chung If this is clean and clear, the subject will have a happy childhood and youth, a good relationship with the parents; the subject’s parents will live to a ripe old age. If it’s marked or misshapen, there will be unhappiness during youth, and poverty or discord in the childhood home. Veins, dark marks and so forth here suggest accidents and sudden losses of money or prestige. A widow’s peak suggests that the father may die before the mother does. 2. Tien Ting This also refers to the parents and background, but it relates more to the mother than the father. Negatively, a marked area suggests that people won’t believe the individual when he is telling the truth. 3. Ssu K’ung A good complexion here suggests a fortunate and successful life , whereas discolorations tell of a bad patch in the subject’s career, according to Chinese face reading philosophy. 4. Chung Cheng If dented, the intellect will be low. If scarred, bumpy or sporting a mole, the subject will be impatient and largely unable to bring his plans to fruition, due either to bad public relations skills or to bad luck. He will also find it hard to make and keep friends. 5. Yin T’ang Chinese face reading masters suggest that if this area is healthy, the subject will receive an inheritance and he will succeed in business. Eyebrows that meet or almost meet denote failure, bad luck and a lack of respect from other people. Marks, scars and black moles can indicate anything from adoption to illness and failure, or even a term of imprisonment. Wrinkles or creases between the eyebrows are all right if the subject is over forty years of age, otherwise they denote difficulties, tension and even a jealous nature. 6. Shan Gen Grayness here denotes illness, whereas a green patch at the side indicates adultery. A mole suggests stomach problems, emigration or imprisonment! 7. Men Shang Moles here suggest stomach trouble, relationship problems or possibly an ill partner. Darkness here denotes a sick child. 8. Shou Shang A high bony nose suggests failure in business. Moles and discolorations signify a sick husband and difficulties with females. 9. Chun T’ou The tip of the nose should be full in shape and clear of marks, hairs and blackheads for good fortune. 10. Jen Chung This is the grooved area between the base of the nose and the mouth, which is called the filtrum, or the falin line. If the base of the groove is wider than the upper and the indentation neither too deep nor too fl at, the subject will have healthy children and will achieve a high level of wealth and status in life. If it’s wider at the top and shallow, the subject will have trouble in having children. His nature will be sour and he will have bad manners. Relationships will be difficult. If this area is bent, the subject will be childless, deceitful and unpopular. A straight line marked down the middle of the groove denotes children late in life according to the science of Chinese face reading. 11. Shui Hsing The mouth should be reasonably full, with a pinkish color and upturned corners to ensure prosperity, good health and a happy marriage. 12. Ch’eng Chiang If this area is dark in the morning, the subject should avoid traveling over water during the course of that day. A man who has a hairless gap beneath his lower lip or a person of either sex who has a discoloration or scar in this area must be careful of their diet, because the stomach may be weak. 13. Ti ko The chin should be rounded, slightly protuberant and strong in appearance. A sharp chin is unlucky and a chin that points to the side belongs to someone who holds grudges. Any scarring or discoloration denotes money losses and possibly the loss of an inheritance. This can also predict family sickness and accidents. This article on Chinese face reading is from the book: Body Reading, Plain & Simple by Sasha Fenton Source:'"}, "time": 1742561982.981354}