{"duration": 0.11774253845214844, "input_args": {"text": "'PHILADELPHIA  —   Sometimes an exhibition, planned years in advance, arrives at a moment that makes it seem remarkably prescient. That is true of a show opening on March 17 at the National Museum of American Jewish History in Philadelphia and later this year at the American Jewish Historical Society in New York. Organized by the two institutions, which are collaborating on an exhibition for the first time, “1917: How One Year Changed the World” focuses on three historic events and their major impact on Jews around the world: America’s entry into World War I, the Bolshevik Revolution in Russia and the Balfour Declaration. The war and the revolution resulted in strict limits on immigration to the United States, reflecting a fear among Americans that unrest in Europe would spread to their country. The restrictions were not overtly aimed at Jews, but because the quotas from countries with high Jewish populations were tightened, fewer Jews were able to settle in the United States. The Balfour Declaration, meanwhile, expressed Britain’s support for a Jewish home in Palestine. The exhibition will include 130 objects, including documents, photographs and war artifacts, that are likely to resonate with visitors as President Trump aggressively seeks to tighten borders and restrict immigration. Among the items is an undated cartoon from the era that portrays a man standing in front of a wall that bears the words “Immigration Restriction. ” He is wearing a coat emblazoned with the word “Congress,” while a banner behind him says “Alien Undesirables. ” It was in 1917 that Congress began taking steps to impose new immigration quotas, an effort that led to the restrictive 1924   Act. Josh Perelman, chief curator and director of exhibitions and collections at the Philadelphia museum, described the chilling effect that World War I had on immigration. “The war was most significant because it created an environment in which a powerful group  —   government, culture and academia  —   were wary of the tribulations of Europe and scared that the immigrants would bring these people to our shores,” Dr. Perelman said in an interview, surrounded by some of the objects in the show. “After the revolution, when the Bolsheviks came to power, and the xenophobia coalesced together and had the power to influence, that fear accelerated. ” The exhibition is also a strong reminder of the number of Jews who fought for the United States during World War I. An estimated 3. 4 million were living in the country during the war years, and 250, 000 joined the military, according to the American Jewish Committee’s Office of Jewish War Records. One, Sgt. William Shemin, was posthumously awarded the Medal of Honor by President Barack Obama in 2015  —   97 years after his heroism during the war. He had repeatedly left the safety of his platoon’s trench to recover wounded soldiers. Jewish organizations had long lobbied for the medal on his behalf, contending that his feats had been wrongly overlooked. Visitors will be able to see Sergeant Shemin’s medal, as well as his helmet and other war gear. As the United States was entering the war, there were concerns among Jews over the persecution of those still in Russia and Eastern Europe. One piece of evidence on display is a letter from the philanthropist Julius Rosenwald to Louis Marshall, chairman of the American Jewish Relief Committee, offering to give $1 million if the committee could raise $10 million to help Jews in “belligerent lands. ” A telegram from President Woodrow Wilson said the gift “serves democracy. ” “It is to America that these starving millions look for aid,” he wrote. ”Out of our prosperity” and “free institutions should spring a vast and ennobling generosity,” he added. Not all Jewish immigrants viewed the United States as a safe haven. A handful of documents highlight the   story of Boris Reinstein, who came from Russia and made a career as a druggist in Buffalo. His 1917 application for a passport is on display, as is his 1923 renunciation of his United States citizenship. Mr. Reinstein was a true believer in the Bolshevik Revolution and the Soviet ideology and left his wife, Anna, to return to Russia, where he worked in the Library of the Marx, Lenin and Engels Institute. For Dr. Perelman and Rachel Lithgow, executive director of the American Jewish Historical Society, one gratifying coup was the loan of two draft versions of the Balfour Declaration from the financier Martin Franklin, who acquired them from Sotheby’s in 2005 as part of the archive of Leon Simon. Mr. Simon, later Sir Simon, a   Jew who become director of Britain’s General Post Office, shared the views of Chaim Weizmann, who was part of the Zionist Commission that worked on the draft of the declaration. Mr. Simon’s handwriting is on the original draft, which has never before been exhibited in the United States. It was written on the stationery of the Imperial Hotel in Russell Square in London. “This was the text that was forwarded to Lord Balfour and was used as the basis of the Balfour Declaration,” Dr. Perelman said. Arthur James Balfour, for whom the declaration is named, was Britain’s foreign secretary. The final declaration, in the form of a letter dated Nov. 2, 1917, was sent to one of Britain’s most distinguished Jewish citizens, Baron Lionel Walter Rothschild. Ultimately, it said, in part: “His Majesty’s government view with favor the establishment in Palestine of a national home for the Jewish people, and will use their best endeavors to facilitate the achievement of this object. ” The document also added that “nothing shall be done which may prejudice the civil and religious rights of existing   communities in Palestine. ” Explaining his purchase of the document, Mr. Franklin said: “I bought it for two reasons: one, it is probably the most important document in the creation of the state of Israel. And second, my great   was the first high commissioner”: Lord Herbert Samuel, who arrived in Palestine in 1920. ”So I thought maybe we should keep it in the family. ”'"}, "time": 1742562110.2052906}