{"duration": 0.044051408767700195, "input_args": {"text": "' \\nIllegal immigrants are flooding across America’s southern border, driven in part by the looming presidential election .\\nA CBS News report from McAllen, Texas , noted that large numbers of illegal immigrants have crossed the border from Mexico and turned themselves in. They are released by the Border Patrol after being given ankle monitors while they file paperwork to be granted asylum so they can remain in the U.S.\\nBorder Patrol Agent Chris Cabrera said the rush is triggered by politics.\\n \\nRelated Stories Trump Mocks Biden’s Dare To Take Him ‘Behind the Gym’ Trump Dedicates D.C. Hotel: ‘The Future Lies With The Dreamers’ Trump Sets GOP Fundraising Milestone In Small-Donor Contributions “The smugglers are telling them if [Democratic nominee] Hillary [Clinton] gets elected, that there’ll be some sort of amnesty, that they need to get here by a certain date,” Cabrera said.\\n“They’re also being told that if [Republican nominee Donald] Trump gets elected, there’s going to be some magical wall that pops up overnight and once that wall gets up, nobody will ever get in again,” he said.\\nCabrera said that on some recent days, agents have netted up to 1,000 immigrants around McAllen.\\n \\n“We’re getting mass spikes of people crossing and turning themselves in,” he said.\\nFor the federal fiscal year that ended Sept. 30, arrests of illegal immigrants crossing to the U.S. along the southern border increased 23 percent , totaling 408,870 people.\\nEarlier this month, Trump formally accepted the endorsement of the National Border Patrol Council at Trump Tower in New York.\\nArt Del Cueto, an official with the union who attended the event, said the Obama administration is conscious of the looming election and pushing to have detainees released.\\n \\nTrending Stories Frustrated With Media Bias, Trump Campaign Takes Its Case Directly To Voters With Nightly Show On Facebook RNC Official Takes CNN Host To Task For Claiming There Is No Media Bias Independent Voters Push Trump To The Front In Florida And Ohio “I’ve spoken to several agents in my sector that are in charge of a lot of this processing of these individuals that we apprehended,” he said.\\nAlthough some have criminal records, Del Cueto said, “they’re setting them aside because at this point they’re saying immigration is so tied up with trying to get to the people that are on the waiting list, hurry up and get them their immigration status corrected, make them citizens.”\\n“Why?” asked Trump.\\n“So they can go ahead and vote before the election,” said Del Cueto.\\nTrump repeated the claim. “They’re letting people pour into the country so they can go and vote,” he said.\\nDel Cueto agreed.\\n“Want to hurry up and fast-track them so they can hurry up and be able to vote for these elections,” hebor said.\\nWhat do you think?'"}, "time": 1742562409.0862088}