{"duration": 0.15014076232910156, "input_args": {"text": "\"Oregon Live \\nJuror 4 vigorously defends the across-the-board acquittals of Ammon Bundy and his six co-defendants, calling the rulings a “statement” about the prosecution’s failure to prove the fundamental elements of a conspiracy charge. \\nThe full-time Marylhurst University business administration student was the juror who had sent a note to the judge on the fourth day of the initial jury’s deliberations in the case, questioning the impartiality of a fellow juror, No. 11, who the judge bounced from the jury a day later. \\n“It should be known that all 12 jurors felt that this verdict was a statement regarding the various failures of the prosecution to prove ‘conspiracy’ in the count itself – and not any form of affirmation of the defense’s various beliefs, actions or aspirations,” Juror 4 wrote Friday in a lengthy email to The Oregonian/OregonLive. \\nHe expressed relief that he can now speak out freely, but he wasn’t ready as of Friday morning to drop his anonymity. He said his studies have suffered since the trial started, and he’s not ready for the attention revealing his identity would bring but felt it was important to defend the verdict. The judge withheld jurors’ names during the jury selection process and trial, instead referring to each by number. \\nThe jury closely followed U.S. District Judge Anna J. Brown’s instructions on how to apply the law to the evidence and testimony heard during the five-week trial, he said. \\nThe jury returned unanimous verdicts of “not guilty” to conspiracy charges against all seven defendants. Each was accused of conspiring to prevent employees of the U.S. Fish and Wildlife Service and Bureau of Land Management from carrying out their official work through intimidation, threat or force during the 41-day occupation. \\nJuror 4 noted the panel couldn’t simply rely on the defendants’“defining actions” to convict. \\n“All 12 agreed that impeding existed, even if as an effect of the occupation,” he wrote. \\n“But we were not asked to judge on bullets and hurt feelings, rather to decide if any agreement was made with an illegal object in mind,” the Marylhurst student wrote. “It seemed this basic, high standard of proof was lost upon the prosecution throughout.” \\nProsecutors had argued that the case, at its core, was about the illegal taking of another’s property. The heavily armed guards that manned the front gate and watchtower during the 41-day takeover, in and of itself, was “intimidating,” and prevented officers from the U.S. Fish and Wildlife Service and U.S. Bureau of Land Management from carrying out their work, they said. \\nThey argued that the alleged conspiracy began Nov. 5, when Ammon Bundy and ally Ryan Payne met with Harney County Sheriff Dave Ward and promised there would be extreme civil unrest in the community if he didn’t step in and block Harney County ranchers Dwight Hammond Jr. and Steven Hammond. The Hammonds were slated to return to federal prison on Jan. 4 and serve out a mandatory minimum five-year sentence for arson on federal land. \\nDefense lawyers urged jurors in closing arguments not to mix-up the “effect” of the occupation – which undoubtedly kept federal employees from doing their jobs – from the “intent” of the occupiers. \\nFive of the seven defendants, including Ammon Bundy, testified. Many said that they were there to protest in support of the Hammonds and federal government overreach because they received absolutely no response from state or local government officials to their previous efforts to spur change. \\nThe defense lawyers’ arguments, coupled with the jury instructions on how to apply the law to the evidence, resonated with jurors, Juror 4 noted. \\n“Inference, while possibly compelling, proved to be insulting or inadequate to 12 diversely situated people as a means to convict,” the juror wrote. “The air of triumphalism that the prosecution brought was not lost on any of us, nor was it warranted given their burden of proof.” \\nJuror 4 plainly stated that fellow Juror 11, during the initial round of deliberations, “had zero business being on this jury in the first place.” \\nJuror 11 had worked for the U.S. Bureau of Land Management as a ranch tech and firefighter “more than 20 years ago,” he had said during jury selection. Asked by the judge during voir dire if that experience would impede his ability to be a fair and impartial judge of the facts, he said, “Not really.” \\nJuror 4 explained why he didn’t alert the court immediately after he had heard Juror 11, on day one of deliberations reportedly say, “I am very biased.” \\nIt wasn’t until the fourth day into deliberations that Juror 4 sent a note to the court, asking if a juror who had worked previously for the federal land management agency and outright told the panel he was “very biased” could be an impartial judge. The court, flummoxed by the development, a day later dismissed Juror 11 for “good cause,” after the prosecution and defense teams agreed to the dismissal. At the time, parties to the case weren’t sure which way Juror 11’s alleged bias fell. \\nJuror 4 said he “resisted the impulse” to send the question sooner in an effort to give his fellow juror a chance to explain himself. \\nIn his email to The Oregonian/OregonLive, Juror 4, for the first time, also contended that Juror 11 “violated” the judge’s explicit orders “by hearkening to ‘evidence’ that was never admitted in this case, refused to consider the defendant’s state of mind and used imaginative theories to explain key actions.'” \\nJuror 4 said, though, he wishes that he “had sent the letter on day one, since it would have alleviated much stress for all of us.” \\nThe Maryville business student said he is “baffled” by what he described as observers’“flippant sentiments” in the wake of the jury’s acquittals. \\n“Don’t they know that ‘not guilty’ does not mean innocent?” he wrote. “It was not lost on us that our verdict(s) might inspire future actions that are regrettable, but that sort of thinking was not permitted when considering the charges before us.” \\nThe jury, he said, met with Judge Brown after the verdicts were announced and after the U.S. Marshals’ physical confrontation and arrest of Bundy lawyer Marcus Mumford. \\nHe said many of the jurors questioned the judge about why the federal government chose the “conspiracy charge.” He said he learned that a potential alternate charge, such as criminal trespass, wouldn’t have brought as significant a penalty. \\nThe charge of conspiring to impede federal employees from carrying out their official work through intimidation, threat or force brings a maximum sentence of six years in prison. \\n“We all queried about alternative charges that could stick and were amazed that this ‘conspiracy’ charge seemed the best possible option,” Juror 4 said. \\n— Maxine Bernstein\""}, "time": 1742564300.1928735}