{"duration": 0.1502547264099121, "input_args": {"text": "'UFC GYM® Celebrates “Veterans Day” with Complimentary Military Access ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. Forget the FBI cache; the Podesta emails show how America is run By VNN on November 3, 2016 They are all engaged in promoting one another’s careers, constantly. For them the door revolves. The friends all succeed. They break every boundary. White House press secretary Jay Carney, left, and White House senior counselor John Podesta, right, laugh during the daily news briefing at the White House in Washington Monday, May 5, 2014. Podesta, who served as Chief of Staff under President Clinton, was answering a question about his returning to work for the White House. (AP Photo/Pablo Martinez Monsivais) \\nWikiLeaks’ dump of messages to and from Clinton’s campaign chief offer an unprecedented view into the workings of the elite, and how it looks after itself \\nThe Guardian T he emails currently roiling the US presidential campaign are part of some unknown digital collection amassed by the troublesome Anthony Weiner, but if your purpose is to understand the clique of people who dominate Washington today, the emails that really matter are the ones being slowly released by WikiLeaks from the hacked account of Hillary Clinton’s campaign chair John Podesta. The U.S. Justice Department official Peter Kadzik in charge of of the probe into Hillary Clinton’s and Huma Abedin’s emails sent Clinton campaign chairman John Podesta a ‘heads up’ about a congressional hearing into her secret server last year. Wikileaks reveals Podesta responded by looping senior campaign staff into the conversation and said the hearing would provide ‘additional chances for mischief.’ \\nThey are last week’s scandal in a year running over with scandals, but in truth their significance goes far beyond mere scandal: they are a window into the soul of the Democratic party and into the dreams and thoughts of the class to whom the party answers. \\nThe class to which I refer is not rising in angry protest; they are by and large pretty satisfied, pretty contented. Nobody takes road trips to exotic West Virginia to see what the members of this class looks like or how they live; on the contrary, they are the ones for whom such stories are written. This bunch doesn’t have to make do with a comb-over TV mountebank for a leader; for this class, the choices are always pretty good, and this year they happen to be excellent. Is Huma Abedin Hillary Clinton’s Secret Weapon Or Her Next Big Problem? \\nThey are the comfortable and well-educated mainstay of our modern Democratic party. They are also the grandees of our national media; the architects of our software; the designers of our streets; the high officials of our banking system; the authors of just about every plan to fix social security or fine-tune the Middle East with precision droning. They are, they think, not a class at all but rather the enlightened ones, the people who must be answered to but who need never explain themselves. \\nLet us turn the magnifying glass on them for a change, by sorting through the hacked personal emails of John Podesta, who has been a Washington power broker for decades. I admit that I feel uncomfortable digging through this hoard; stealing someone’s email is a crime, after all, and it is outrageous that people’s personal information has been exposed, since WikiLeaks doesn’t seem to have redacted the emails in any way. There is also the issue of authenticity to contend with: we don’t know absolutely and for sure that these emails were not tampered with by whoever stole them from John Podesta. The supposed authors of the messages are refusing to confirm or deny their authenticity, and though they seem to be real, there is a small possibility they aren’t. \\nWith all that taken into consideration, I think the WikiLeaks releases furnish us with an opportunity to observe the upper reaches of the American status hierarchy in all its righteousness and majesty. Bill Clinton now leads a sprawling philanthropic empire like no other. And yet it’s hard to shake the sense that it’s not all about saving the world. \\nThe dramatis personae of the liberal class are all present in this amazing body of work: financial innovators. High-achieving colleagues attempting to get jobs for their high-achieving children. Foundation executives doing fine and noble things. Prizes, of course, and high academic achievement. \\nCertain industries loom large and virtuous here. Hillary’s ingratiating speeches to Wall Street are well known of course, but what is remarkable is that, in the party of Jackson and Bryan and Roosevelt, smiling financiers now seem to stand on every corner, constantly proffering advice about this and that. Citigroup bank chose Obama’s 2008 cabinet – WikiLeaks \\nIn one now-famous email chain, for example, the reader can watch current US trade representative Michael Froman, writing from a Citibank email address in 2008, appear to name President Obama’s cabinet even before the great hope-and-change election was decided (incidentally, an important clue to understanding why that greatest of zombie banks was never put out of its misery). \\nThe far-sighted innovators of Silicon Valley are also here in force, interacting all the time with the leaders of the party of the people. We watch as Podesta appears to email Sheryl Sandberg. He makes plans to visit Mark Zuckerberg (who, according to one missive, wants to “learn more about next steps for his philanthropy and social action”). Podesta exchanges emails with an entrepreneur about an ugly race now unfolding for Silicon Valley’s seat in Congress; this man, in turn, appears to forward to Podesta the remarks of yet another Silicon Valley grandee, who complains that one of the Democratic combatants in that fight was criticizing billionaires who give to Democrats. Specifically, the miscreant Dem in question was said to be: \\n“… spinning (and attacking) donors who have supported Democrats. John Arnold and Marc Leder have both given to Cory Booker, Joe Kennedy, and others. He is also attacking every billionaire that donates to [Congressional candidate] Ro [Khanna], many whom support other Democrats as well.” \\n(Hilariously, in another email chain , the Clinton team appears to scheme to “hit” Bernie Sanders for attending “DSCC retreats on Martha’s Vineyard with lobbyists”.) \\nThen there is the apparent nepotism, the dozens if not hundreds of mundane emails in which petitioners for this or that plum Washington job or high-profile academic appointment politely appeal to Podesta – the ward-heeler of the meritocratic elite – for a solicitous word whispered in the ear of a powerful crony. \\nScandal at Clinton Inc. \\nThis genre of Podesta email, in which people try to arrange jobs for themselves or their kids, points us toward the most fundamental thing we know about the people at the top of this class: their loyalty to one another and the way it overrides everything else. Of course Hillary Clinton staffed her state department with investment bankers and then did speaking engagements for investment banks as soon as she was done at the state department. \\nOf course she appears to think that any kind of bank reform should “come from the industry itself”. And of course no elite bankers were ever prosecuted by the Obama administration. \\nRead these emails and you understand, with a start, that the people at the top tier of American life all know each other. They are all engaged in promoting one another’s careers, constantly. Architects of “Regime Change” Wars \\nEverything blurs into everything else in this world. The state department, the banks, Silicon Valley, the nonprofits, the “ Global CEO Advisory Firm ” that appears to have solicited donations for the Clinton Foundation. Executives here go from foundation to government to thinktank to startup. There are honors. Venture capital. Foundation grants. Endowed chairs. Advanced degrees. \\nFor them the door revolves. The friends all succeed. They break every boundary. \\nBut the One Big Boundary remains. Yes, it’s all supposed to be a meritocracy. But if you aren’t part of this happy, prosperous in-group – if you don’t have John Podesta’s email address – you’re out. \\nRead more:'"}, "time": 1742564158.6505902}