{"duration": 0.053958892822265625, "input_args": {"text": "'  \\nWith Hillary Clinton making history this election season by becoming the first women nominated by a major party, the sexism has been on full display. The misogynists on the Right have questioned her health, her stamina, and everything in between. That is, of course, code for “the little woman doesn’t belong in the Oval Office.” However, one Texas Republican has taken the misogyny to a whole other level. \\nMeet Sid Miller, the Agriculture Commissioner for the state of Texas. He is also a former lawmaker. Miller, like most Republicans, doesn’t make his hatred for Hillary Clinton any secret. Instead, he somehow thought that it was perfectly appropriate to take to Twitter and express his feelings in a most disgusting way while tweeting about the polls. Miller’s tweet reads: \\n“TRUMP 44 Cunt 43,” punctuated with a cheering “Go Trump Go!” \\nIn the predictable firestorm after, Miller tried to make the public believe that his account was hacked. Miller’s staff hastily relesed this defense of his post: \\n“The campaign was retweeting information today and inadvertently retweeted a tweet that they were not aware contained a derogatory term. The tweet was taken down as soon as possible. Commissioner Miller finds the term vulgar and offensive and apologizes to anyone who may have seen it.” \\nThere’s a problem with that, though: The tweet was not a retweet. It was simply a tweet. Therefore, either Sid Miller himself or someone on his staff wrote this: \\nNaturally, Miller is Donald Trump’s number one man in Texas, according to the Texas Tribune . No surprise there. Further, Miller is no stranger to making tasteless and offensive jokes with regards to Hillary. Here is one that is just a few hours old as of this writing: \\nThat tweet written in reference to the fact that the reason Hillary’s emails are in the news again is because of disgraced Congressman Anthony Weiner’s sexting scandals. \\nSo, in other words, this Sid Miller character is the perfect Donald Trump supporter – a misogynistic and deeply ignorant asshat who can’t stand the idea of losing to a woman. \\nFeatured image via screen capture from The Daily Beast Share this Article!'"}, "time": 1742563809.456933}