{"duration": 0.11772727966308594, "input_args": {"text": "'I’ve now worked in journalism/media for seven years. And I sit here this morning amazed at the historic transition media as an industry has taken during that time. To say it’s a seismic shift would be a gross understatement.\\nEverything has changed .\\nI remember when I first started reporting the news I would often say there is no such thing as non-partisan media. I fully stand by that statement.\\nAnyone who writes for a living knows that by implanting a single word in a targeted sentence, even if the story is 1,200 words long, can change the underlying message of a report with ease. That’s what media does. What we call “mainstream media” is notorious for this. You’ve probably seen it happen countless times, but in most cases you probably don’t notice it.\\nFor example, when a bad jobs report comes out the media will report something like “ New Jobs Unexpectedly Slightly Below Projections .” Using the word unexpectedly implies everyone should be optimistic because it’s expected that job creation will naturally be higher in our current economy.\\nThis is nonsense. It doesn’t take a world class economist to figure out Washington policy has broken our economic engine. And it doesn’t require a Harvard level analyst to tell us all the job situation is in shambles.\\nMedia uses this tactic to protect those in power. It’s all a game to hide the truth.\\nThere is no non-partisan news. Reporters/writers will either advocate for the truth and seek to uphold American principles of personal liberty, a free market and sound government that works for the people it claims to represent, or they’ll advocate against it. That’s a fact. Those are the options.\\nSo what has changed over the past seven years? In short, the audacity of the advocacy happening in media has reached unprecedented levels. Hosts from ALL (yes, even Fox News) TV news networks actively participated in trying to elevate Hillary Clinton over Donald Trump. Anyone who watched the debates through an objective lens knows this. Megyn Kelly ambushed Donald Trump and we all know it. The DNC was helping craft talking points with journalists, and TV networks were helping the DNC funnel debate intel to Clinton’s campaign.\\nAnd do we need to mention the polls? Seriously? We’re supposed to trust a media that was either a) dead wrong in their reporting of where the electorate stood, or b) they blatantly lied and fabricated numbers in an effort to suppress the vote against Clinton. Both options are equally damnable.\\nHow is it that so much of America pounds their chests proclaiming the media is corrupt, but in the next breath looks to that same media to confirm news? Last night, for example, our team called Pennsylvania a full two hours before Fox News or any other TV network. Yet when we did we were hit with comments calling us names, mocking us and saying we should have waited for “official” calls from “media.”\\nThis is insulting. We have a full time staff. We have offices. We have TV and audio studios. We are media .\\nOur team worked tirelessly, combing through county data in multiple states. We didn’t take that call for Pennsylvania lightly. But we made the call when we faithfully concluded Clinton had no reasonable path to overtaking Trump’s lead. This was fact for us. This was truth. We didn’t care if Fox News, CNN or any others called it. We saw what we saw and we made a call.\\nBreitbart is media. Drudge Report is media. I could list hundreds of sources that many don’t consider media that are actually far more accurate (and honest in what they believe in) than what would be considered official media, whatever that means.\\nAt some point America is going to have to proclaim enough is enough. The networks are dishonest and they work against your best interests. They work against the needs of you and your family. They work against the truth. They work for those in power, and they do everything they can to protect that power. Because at the end of the day, the networks care about their seats at the Gala’s and their access to powerful politicians.\\nThey sit in their high castles, eating expensive steak, drinking fine wine while having no financial concerns at all. Do you think their agenda includes telling you the truth when doing so would cut off their access to the power they hold close? Of course not. They aren’t going to bite the hand that feeds them.\\nWhen you watch their shows, share their stories and look to them to confirm news, you are funding their game against you.\\nThat has to stop.\\nIt’s time we as a people have a very serious conversation about a meaningful boycott. Yesterday we voted at the polls. Now we need to vote with our wallets.\\nIt’s time for the new media to become the media . Because let’s face it, old media betrayed us.\\nFool me once, shame on you. Fool me twice…\\nNo thanks.\\n-Eric Odom \\n'"}, "time": 1742563092.2451699}