{"duration": 0.11219120025634766, "input_args": {"text": "'WASHINGTON  —   President Obama pledged on Wednesday to lift all remaining sanctions against Myanmar, seeking to reward the country’s recent moves toward democracy after decades of brutal military rule. The White House issued the announcement during a visit by Daw Aung San Suu Kyi, Myanmar’s leader, whose victory in democratic elections last year was viewed by the Obama administration as a triumph in the president’s strategy of engaging with countries the United States had long shunned. “In part because of the progress that we’ve seen over the last several months,” Mr. Obama said in the Oval Office, as he sat beside Ms. Aung San Suu Kyi, “the United States is now prepared to lift sanctions that we have imposed on Burma for quite some time. “It is the right thing to do in order to ensure that the people of Burma see rewards from a new way of doing business and a new government,” the president said. “Congratulations on the progress that has been made,” he told Ms. Aung San Suu Kyi, who was under house arrest as a political prisoner when Mr. Obama was elected president. “It is not complete, and I think Daw Suu is the first one to indicate that a lot of work remains to be done, but it’s on the right track. ” But the move was quickly criticized by leaders of some human rights groups, who said they worried that eliminating sanctions was premature given the slow pace of change in Myanmar, also known as Burma, where the military still controls a large portion of parliamentary seats and important government ministries. “If the issue was growing Burma’s economy, there are plenty of other ways to do that without pulling off all of these important restrictions, which have given Suu Kyi   leverage over the military, with whom she still has battles ahead,” said John Sifton, the deputy Washington director of Human Rights Watch. “If the issue is leverage, the decision today makes almost no sense: Obama and Suu Kyi just took important tools out of their collective tool kit for dealing with the Burmese military, and threw them into the garbage. ” It remained unclear exactly when the remaining sanctions would be lifted they apply to trade in jade and precious stones, and to doing business with some of Myanmar’s military officials or their affiliates. Restrictions imposed by Congress, including sanctions related to North Korea and those governing arms sales and military cooperation, will remain unless lawmakers vote to lift them. Mr. Obama had moved in May to ease a broad array of sanctions that barred American citizens and companies from doing business with Myanmar, loosening restrictions on   banks and entities. But, at that time, he left in place an official government finding of a state of emergency for Myanmar, which calls the country an “extraordinary threat. ” Earlier on Wednesday, Mr. Obama sent Congress official notice that he was restoring trade benefits to Myanmar that were revoked in 1989 because of concerns over worker rights, allowing it to qualify for a program that allows poor countries to export thousands of products   to the United States. The decision to go a step further, and scrap the sanctions entirely, reflects Mr. Obama’s belief in using diplomacy paired with sanctions relief to prod former foreign adversaries toward greater openness. That principle was at the heart of Mr. Obama’s agreement last year with Iran to relax sanctions in exchange for restraints on the country’s nuclear program, and has been the driving force behind the opening of a dialogue with Cuba. Since taking power six months ago, Ms. Aung San Suu Kyi has moved to heal ethnic conflicts that have long plagued Myanmar. She invited a team led by Kofi Annan, the former United Nations secretary general, to begin investigating the plight of the Rohingya, a group of about a million Muslims living in dire conditions in western Myanmar. Yet Ms. Aung San Suu Kyi had declined to use the term “Rohingya” to describe the persecuted Muslim population that has lived in Myanmar for generations, angering rights activists who had hoped she would reverse discriminatory policies that have marginalized the Rohingya and prompted many to flee. And crucial political changes have yet to be made, like amending Myanmar’s Constitution to remove the military’s control over 25 percent of parliamentary seats, its ability to dissolve Parliament in times of national emergency and its control over the nation’s security, defense and border ministries. Ms. Aung San Suu Kyi said she was grateful to the United States for enacting sanctions that pressured Myanmar to restore human rights, but added that the time had come for the restrictions to be lifted. She also said she was eager to draw foreign visitors and investment to her country. Saying her first priority was “national reconciliation and peace,” Ms. Aung San Suu Kyi also conceded that she had to do more to shift the government toward civilian rule. “We have a Constitution that is not very democratic, because it gives the military a special place in politics,” she said. Obama administration officials have argued that freeing Myanmar from economic sanctions need not wait until the country liberalizes entirely, and that doing so will improve the chances that democracy will take hold there. It is also an important legacy issue for Mr. Obama, who said during a visit there in 2012 that it was time to open the United States’ relationship with Myanmar, despite the fact that it was not yet a “perfect democracy. ” On Wednesday, the White House insisted that Mr. Obama had not been swayed by a concern for his legacy to remove the sanctions before Myanmar had demonstrated more progress on its transition to democracy. “The president was quite interested in making as much progress as we can to support the Burmese people and the Burmese government in pursuing democratic reforms, but the decision to lift the national emergency was driven by the progress they made in Burma  —   not by the election calendar in the United States,” said Josh Earnest, the White House press secretary.'"}, "time": 1742562169.8207088}