{"duration": 0.10004258155822754, "input_args": {"text": "'Diego Arria  —   a former Venezuelan diplomat and U. N. Security Council president now dedicated to the struggle against socialist Chavismo in his native country  —   sees removing dictator Nicolás Maduro from power as only a first step in saving Venezuela from decades of corruption and decay. [Arria emphasized in an interview with Breitbart News, conducted in both Spanish and English, that removing Maduro would do little to establish a free democratic republic in Venezuela without a clean sweep of the thousands of government employees and soldiers affiliated with terrorism, drug crime, and still loyal to a socialist model of government.  “[We need] a model based on liberty, free economy  —   not a   or socialist model or anything remotely like that,” Arria noted. “If we do not change the political and economic model, we will always be an unstable country. ” Arria deemed this establishment of a   political and economic model a “refounding of the republic,” which would require a new constitution and an abandonment of both the leftist ideology of the ruling party and the   approach of the official opposition. The Venezuelan opposition today largely focuses on the removal of Maduro from power, demanding free and fair elections. What the leaders of the opposition wish to see replace Maduro is not clearly defined, largely because of their own backgrounds: many also identify as socialists. While they oppose the ruling United Socialist Party of Venezuela (PSUV) many of the parties that form the Democratic Unity Roundtable (MUD) the opposition coalition in the National Assembly, are member parties of the Socialist International, including Popular Will, the party led by political prisoner Leopoldo López. Henry Ramos Allup, a key member of the Venezuelan opposition, is a vice president of the Socialist International. Asked to explain this phenomenon to an American audience, who largely reject the label “socialist,” Arria laments that many Venezuelan parties feel the need to identify as socialist, even nominally. “For a long time, the official opposition was ‘Chavista light’  …     there has been a sort of hijacking of the political class, as if the Socialist International were the club of dignified, enlightened, or democratic governments in the world when this is not true,” he notes. “Among the official parties there are all kinds [of ideologies] but all are social democrats or moderate socialists, there is not a single [other kind]. ” “In Venezuela, people have a complex about calling themselves conservative,” he adds. “We have to enter a period of transition,” he explained, “that will not be conventional, it will not be a ‘Jeffersonian model’ [of reform] because Venezuela has things like this:” We have 50, 000 Cubans in Venezuela. This is more than the number of forces that Spain had occupying Venezuela during our war of independence. I am not saying that these 50, 000 Cubans are all soldiers, but thousands of them are trained for these ends. We have 100, 000 militiamen, paramilitaries  …     and the influence of the drug cartels in the armed forces, in police forces, in the judicial system. How do you remove that simply with an election replacing one government with another? Late dictator Hugo Chávez forged a lasting bond with the communist government of Cuba that persists to this day, in which Venezuela relies heavily on Cuba for doctors, ( ) medicine, soldiers, and intelligence officials. Venezuela supplies Cuba with oil, filling a void left by the collapse of the Soviet Union. Venezuelans have long complained that among the cruelest and most violent state officers acting against peaceful protesters have been Cubans, easily identified by their accents and superior ranking. The word “colony” for what the Castros have done to Venezuela surfaces often. A 2013 estimate by   General Antonio Rivero put the number of Cuban nationals that had passed through Venezuela since Chávez took power at upwards of 200, 000. Arria emphasizes that civilian Cubans seeking an escape from the island prison are not the problem. “To begin with, the ones who are doctors and sports players, I’m sure they would like to stay in Venezuela, so those are no problem because you give them nationality and they are fine,” he notes. “The problem is with the people who are today in the intelligence departments  …     Cubans have killed Venezuelans and tortured Venezuelans and they are doing that now. ” Rescuing Venezuela from failed state status, then, also requires the demise of the Castro regime, because any resources that fall in the hands of the Castros further their colonial ambitions in the South American country. “You cannot exclude in the U. S.  agenda my own country, because we play a fundamental role in the preservation of the Cuban economy and we pay the consequences of that relationship,” he notes. Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742564118.2999978}