{"duration": 0.08393692970275879, "input_args": {"text": "'On Wednesday’s broadcast of MSNBC’s “Morning Joe,” House Freedom Caucus member Representative Jim Jordan ( ) touted legislation he will be introducing later in the day to just do a clean repeal of Obamacare, and criticized the replacement plan as “Obamacare in a different form. Because we didn’t tell the voters we were going to repeal Obamacare, but keep some of the Obamacare taxes. We didn’t tell the voters we’re going to repeal Obamacare, but keep and extend Medicaid expansion. And we certainly didn’t tell the voters we’re going to repeal Obamacare, but start a new entitlement. ”  Jordan said, “[L]et’s do this right, and, more importantly, let’s do what we told the voters we’re going to do. That’s why today I’ll be introducing legislation which just says clean repeal. Let’s vote on the exact same thing, 15 months ago, every single Republican in the House, every single Republican in the Senate voted on. We put it on President Obama’s desk. Of course, he vetoed it. But let’s put that same legislation on President Trump’s desk, and then work on the replacement model that will actually bring down the cost of insurance. I don’t think the plan they introduced yesterday is going to bring down the cost for working class and middle class families. ” He stated of the current replacement, “Every conservative group out there is opposed to this legislation, because, as I said yesterday and others have said, I think it’s Obamacare in a different form. Because we didn’t tell the voters we were going to repeal Obamacare, but keep some of the Obamacare taxes. We didn’t tell the voters we’re going to repeal Obamacare, but keep and extend Medicaid expansion. And we certainly didn’t tell the voters we’re going to repeal Obamacare, but start a new entitlement. ” He further said that he doesn’t think the current replacement “could pass today.   …     So, this needs to be changed in a dramatic way for it to have a chance to pass, in my judgment. ” Jordan continued his criticism of the current replacement, arguing, “[T]his is what Americans hate. We campaign on one thing, and then we get here and say, oh, we can’t do what we campaigned on. We really can’t do a clean repeal, and then replace it with something that’s going to bring down the costs. We’ve got to mush it all together and do some different form of Obamacare. That’s what the American voters hate. Let’s do what we told them we were going to do. Let’s do what they sent us here to do and what they expect us to do. ” Jordan also stated, “Even if you don’t have the CBO score, look at the four corners of the document and read what it says. I think it’s not going to bring down the cost of premiums for working class and middle class families. That’s why I oppose it. I think it’s Obamacare, as I’ve said, Obamacare in a different form. That’s why I oppose it. But it would also be nice to have a score. I can’t believe the score won’t be high because, when you’re extending and expanding the Medicaid expansion, when you’re starting this new entitlement called advanceable refundable tax credits, when you’re doing all that, I’ve got to believe that’s a cost to the federal government. But apart from that, just look at what it does, it keeps the federal government in control of how this thing works, the exchange and that sort of thing. That’s the wrong approach because we’ve seen how bad Obamacare has been for the American people the last six years. ” Jordan added his replacement plan “would put in place policies that will bring back affordable insurance. That’s the big problem right now. If people can afford the premiums, they can’t afford the deductibles. Fewer choices, higher costs is what Obamacare has given us. We want those policies, like expanded health savings accounts, interstate shopping, easier formation of association health plans, tax deductibility on the individual market side so that you begin to equalize treatment for folks who get their insurance in the individual market with those who get   plan insurance. So, that’s what we want to do. Those kinds of things will bring down the cost. And most importantly, you get out all the regulations which drove up the cost of insurance. Never forget what Obamacare did. It set mandates, taxes, and regulations, drove up the cost of insurance, told every American, you have to buy it, and if you don’t, there’s a penalty. That’s what we have to get away from. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742562754.0058534}