{"duration": 0.15810298919677734, "input_args": {"text": "'Become a Fan - Advertisement - It was not too long ago that many people looked to the U.S. for leadership and not so long ago, our nation was still thought to be a democratic nation of laws, due process, and a prudent separation of powers. Now the U.S. is reviled; Bush is seen the world over as having betrayed his own people as he wages aggressive war against a nation that even he concedes had nothing whatsoever to do with 911, a nation about which he lied in order to justify his dirty, evil little war. The war on terrorism is phony.\\nAnd now, Bush proves everything that is said about him by refusing to close Guantanamo, by refusing to end practices of torture and rendition which he denies --even as he defends them. I recommend Robert Jackson \\'s Place in History by Henry King Jr. An excerpt: In his final report, after he resigned as U.S. Chief Counsel for War Crimes, Jackson stated that \"[i]t is not too much to hope that this example of a full and fair hearing, and tranquil and deliberative judgment, will do something toward strengthening the process of justice in many countries. \" I believe that after fifty years it can be maintained with considerable credibility that these visions have largely come to pass. Perhaps --at the time of the writing --\"these visions\" had come to pass. But thanks to the Bush administration\\'s deliberate effort to undermine the very foundations of International Law, that important progress has been undone.\\nOne rightly suspects Bush\\'s motives. Even before the U.S. invasion of Iraq, before the attack on Afghanistan, Tom DeLay sponsored legislation that exempted U.S. soldiers from war crimes prosecution at the International Tribunal at the Hague. Did anyone in Congress stop to ask why? Were we planning to commit crimes for which we sought exemption from prosecution? Wasn\\'t it clear to any thinking person what Bush was up to? Are we not the good guys? [Amendment to H.R. 1646, The Foreign Relations Authorization Act of 2001 ] \\nClearly --the Bush administration was, in fact, planning to commit war crimes but wanted to make them legal if done by the U.S. I cannot possibly hope to document in a short internet essay the various circumlocutions that have been indulged by the Bush administration and its chief apologist: Alberto Gonzales. All, however, are intended to make legal the very acts that are prohibited by Nuremberg --but only if those acts are done by Americans. Bush is at least consistent in this respect: neither would he press for trials for non-Americans. He would simply decree their imprisonment and torture. \\nNazis engaged in similar polemical campaigns. The results were tragic. So too with Bush who most certainly boasted of what can only be the summary executions of thousands who were most certainly murdered before they could assert their innocence: ...more than 3,000 suspected terrorists have been arrested in many countries. Many others have met a different fate. Let\\'s put it this way -- they are no longer a problem to the United States and our friends and allies. \\nThis statement must be soberly examined; note that Bush refers to 3,000 suspects . Yet --he smirks that \"...they have met a different fate.\" He boasts that \"...they are no longer a problem to the the United States...\". - Advertisement - They were only suspects . Since when does the United States summarily execute mere suspects? Do we not know who our enemies are? What were the conditions of their detention? Why are we rounding up mere \"suspects\" --and not actual combatants? How is the execution of suspects justified under any standard, any morality, any legal system? I am frankly surprised that Bush maintained the pretense when he has since arrogated unto himself the power to define terrorists. \"Terrorists\" are what Bush says they are. Bush is the judge and jury. Detainees are never charged and, by Bushs\\' own words, \"suspects\" are caused to be \"...no longer a problem\". Others are \"terrorists\" not because they are \"terrorists\" but because Bush --the decider --says they are. Some may be combatants. Some may be \"evil doers\". Others may be innocent. No matter. Bush --the all powerful decider --has thrown them all in the same wire cage. The same suicide factory.\\nContrast Bush\\'s remarks with those of American Supreme Court Justice Robert Jackson uttered when America still had credibility and moral authority: \\n\"That four great nations, flushed with victory and stung with injury stay the hand of vengeance and voluntarily submit their captive enemies to the judgment of the law is one of the most significant tributes that Power has ever paid to Reason. \" \\n-- Opening Statement before the International Military Tribunal, Robert Jackson, Chief American Prosecutor, Nuremberg War Crimes Trials - Advertisement - At the end of World War II, when even Winston Churchill espoused the summary executions of Nazi war criminals and Joseph Stalin favored mere show trials, it was the United States, under the leadership of Franklin Roosevelt, that insisted upon war crimes trials. Nazis would not be summarily shot merely because they were Nazis by definition or decree. Rather, they would be given a trial. Even Nazis would be allowed the right of counsel, the right to present a defense. \\nHow can Bush hope to defend democracy --as he has claimed --when he subverts every Democratic principle that has been fought and died for over the last four hundred years? How can Bush justify his war of aggression against Iraq when he subverts the very \"democracy\" that he claims to bring them? How can Bush accuse anyone outside the United States of \"...just hat[ing] freedom\" when Bush is himself democracy\\'s most insidious enemy? \\nIf Nazis had engaged in the same disingenuous activities with regard to the incarceration and ultimate extermination of the jews, what moral authority could the U.S. have extended if its own policies differed not a whit in principle?'"}, "time": 1742563870.659611}