{"duration": 0.03196978569030762, "input_args": {"text": "'President Donald Trump denounced reporting from the New York Times and the Washington Post that said his campaign was communicating with Russia.  “Information is being illegally given to the failing New York Times and Washington Post by the intelligence community,” he wrote on Twitter, suggesting that the NSA and the FBI might be responsible. “Just like Russia,” he added. The New York Times cited law enforcement and intelligence agency sources that intercepted communications from people close to Trump during the presidential campaign with Russian intelligence. “The real scandal here is that classified information is illegally given out by ‘intelligence’ like candy,” Trump wrote. “Very  !” That news is leading coverage of the president on cable and network news stations, prompting Trump’s reaction on Twitter. “The fake news media is going crazy with their conspiracy theories and blind hatred,” Trump wrote. “MSNBC and CNN are unwatchable. Fox and Friends is great!” Trump called the reports “ ” and said they were “merely an attempt to   the many mistakes made in Hillary Clinton’s losing campaign. ” He also praised Bloomberg columnist Eli Lake, for discussing his latest column on Fox News, pointing out that the damaging intelligence leaks were the kind of behavior seen in “banana republics. ” “We trust the NSA and the FBI to use these powers to catch criminals and terrorists but that should not interfere in our politics, and that stuff is interfering right now in our politics,” Lake said in an interview with Fox News host Sean Hannity.  —   @realDonaldTrump referring to this @EliLake segment on @seanhannity last night that was   on @foxandfriends this morning pic. twitter.   —   Charlie Spiering (@charliespiering) February 15, 2017,  Trump reminded the world that Russian President Vladimir Putin’s unchecked aggression began during the Obama administration. “Crimea was TAKEN by Russia during the Obama Administration,” he wrote. “Was Obama too soft on Russia?”'"}, "time": 1742562276.597952}