{"duration": 0.09510540962219238, "input_args": {"text": "'$19 Photo of the Week: President Who Let Citigroup Staff His Cabinet Calls for Solidarity From Voters Posted on Oct 29, 2016 President Obama waves to supporters in Orlando, Fla., Friday. (Phelan M. Ebenhack / AP) \\nEvery week, Truthdig’s editors seek to present an image that singularly renders the world’s trouble, triumph or toil. \\n“You have a chance to shape history,” President Obama told a crowd of 9,000 people at a campaign stop for Hillary Clinton in Orlando, Fla. on Friday. “Hillary needs your help. I need your help. America needs your help. Let’s get to work.” \\nTwo weeks earlier WikiLeaks revealed how the Clinton/Obama-led corporate wing of the Democratic Party works. An email sent in Oct. 2008 and hacked from the personal account of Clinton campaign chairman John Podesta showed Citigroup executive Michael Froman submitting names for dozens of positions in then-candidate Obama’s anticipated presidential cabinet. \\n“The cabinet list ended up being almost entirely on the money,” wrote David Dayen of the leaked message. “It correctly identified Eric Holder for the Justice Department, Janet Napolitano for Homeland Security, Robert Gates for Defense, Rahm Emanuel for chief of staff, Peter Orszag for the Office of Management and Budget, Arne Duncan for Education, Eric Shinseki for Veterans Affairs, Kathleen Sebelius for Health and Human Services, Melody Barnes for the Domestic Policy Council, and more.” \\nAdvertisement Square, Site wide \\n“For the Treasury, three possibilities were on the list: Robert Rubin, Larry Summers, and Timothy Geithner.” \\nGeithner ended up as Obama’s Treasury Secretary, while Summers was a key author of the response to the 2008 recession as Director of Obama’s National Economic Council. And from these men, Froman’s Citigroup received the largest bailout the federal government gave during the financial crisis. \\n“Many already suspected that Froman, a longtime Obama consigliere, did the key economic policy hiring while part of the transition team,” Dayen explained. “We didn’t know he had so much influence that he could lock in key staff that early, without fanfare, while everyone was busy trying to get Obama elected. The WikiLeaks emails show even earlier planning; by September the transition was getting pre-clearance to assist nominees with financial disclosure forms.” \\nDayen grants that Americans “want an incoming administration to be well-prepared and ready to go when power is transferred. For Obama, coming into office while the economy was melting down, this was particularly true. But the revelations also reinforce the need for critical scrutiny of Hillary Clinton [italics added], and for advocacy to ensure the next transition doesn’t go like the last, at least with respect to the same old Democrats scooping up all the positions of power well in advance.” \\nMany pundits who support Hillary Clinton suggest that voters should focus exclusively on defeating Donald Trump. “[T]here is a logic to that idea,” Dayen wrote. “Trump would legitimately be a terrifying leader of the free world. But there are consequences to the kind of home-team political atmosphere that rejects any critical thought about your own side. If the 2008 Podesta emails are any indication, the next four years of public policy are being hashed out right now, behind closed doors. And if liberals want to have an impact on that process, waiting until after the election will be too late.” \\n“Who gets these cabinet-level and West Wing advisory jobs matters as much as policy papers or legislative initiatives. It will inform executive branch priorities and responses to crises. It will dictate the level of enforcement of existing laws. It will establish the point of view of an administration and the advice Hillary Clinton will receive. Its importance cannot be stressed enough, and the process has already begun.” \\nCiting former Obama budget director Peter Orszag’s suggestion this week that progressive Democrats, led by Elizabeth Warren, should be given the power to appoint their people to certain positions in exchange for certain concessions to the Wall Street-aligned wing, Dayen suggests that progressives have a greater chance to shape policy in 2016 than they did at the start of the Obama administration. And they should fight for it: “The demand to only hold one thing in your head at a time—that Trump must be stopped—would squander this opportunity.” \\nTo repeat what Obama told voters Friday: “You have a chance to shape history.” TAGS:'"}, "time": 1742564044.3972418}