{"duration": 0.008534669876098633, "input_args": {"text": "'We Use Cookies: Our policy [X] Rumours Persist That Mourinho Almost Thought About Blaming Himself For Latest Man Utd Defeat November 4, 2016 - BREAKING NEWS , SPORT Share 0 Add Comment \\nSCARCELY believable rumours have been circulating in the aftermath of Manchester United’s 2-1 loss to Fenerbahce in the Europa League, as sources close to Jose Mourinho claim he almost blamed himself in some small way for the defeat. \\n“We’ve seen it a few times over the last decade, he almost gained some self awareness and was on the verge of realising he’s been paid £10 million a year not to be dog shite,” confirmed a source, who admitted Jose opened his mouth at one point with a look of ‘some of this may be my fault’ emblazoned on his face. \\nLeading football psychologists were ready to hail a breakthrough in their study of Mourihno but their hopes were dashed when he chose instead to give out about Arsene Wenger for 44 minutes, blaming him for being responsible for the defeat in some way. \\nAs evidenced by some post-match interviews and comments the Portuguese manager was able to gather himself and get back to transparent attempts to safeguard himself from any criticisms. \\n“We played the game, like happy puppies, but these players of mine, they are not puppies, they are meant to be lions. Jose Mourinho is disappointed in them, when you go to the zoo, you never, ever go to see the puppies,” Mourinho explained in the first of 47 vague, almost incomprehensible asides, “also I live in a hotel”. \\nMourinho would not be drawn on the speculation that he plans to add several more players to his list of scapegoats, with concern among his coaching staff that if he continues to just focus on Henri Mkhitaryan, people will soon realise the former Madrid boss is just weeks away from another cataclysmic implosion. \\n“We are not just surrounded by football Einsteins, we have a Fermi and an Oppenheimer, they intend to use an atomic football bomb against me, a champion,” added the manager purposefully trying to be more obscure and disconnected with each passing sentence.'"}, "time": 1742628504.6791952}