{"duration": 0.05994915962219238, "input_args": {"text": "'Society US Supreme Court Justice Clarence Thomas \\nA female lawyer has accused US Supreme Court Justice Clarence Thomas of sexually assaulting her in 1999, a report says. \\nMoira Smith, who works as a corporate lawyer with an Alaska energy company, said the judge made unwanted sexual advances on her during a dinner party when she was 23-year-old, the National Law Journal reported on Thursday. \\nShe said Thomas grabbed and squeezed her buttocks several times during the party in Falls Church, Virginia. \\n“Justice Thomas touched me inappropriately and without my consent,” Smith said. \\n“He groped me while I was setting the table, suggesting I should sit ‘right next to him,’” Smith said. \\n“He was 5 or 6 inches down and he got a good handful and he kept squeezing me and pulling me close to him,” she stated, according to the journal. \\nIn a statement to the National Law Journal, Thomas, 68, dismissed the allegation as “preposterous”, saying that the incident “never happened.\" \\nSmith, currently vice president and general counsel at Enstar Natural Gas Co in Alaska, said she decided to speak out after hearing Republican presidential nominee Donald Trump\\'s lewd comments about women. \\nA 2005 video was released earlier this month by The Washington Post, in which Trump can be heard making lewd comments about women and bragging about groping them. \\nA number of women have since come forward claiming that the business mogul has sexually assaulted them. \\nTrump has called the allegations “slander and libel” and part of a “concerted, coordinated and vicious attack” by Democratic candidate Hillary Clinton and the news media to undercut his campaign. Moira Smith said Justice Clarence Thomas groped her at her boss\\' dinner party when she was 23. \\n\"That willingness by men in power to take advantage of vulnerable women relies on an unspoken pact that the women will not speak up about it,\" Smith, now 41, told the journal. \\n\"Why? Because they are vulnerable. Because they are star-struck. Because they don\\'t want to be whiners. Because they worry about their career if they do speak out. But silence no longer feels defensible; it feels complicit,” she stated. \\n\"As the mother of a young daughter and son, I am coming forward to show that it is important to stand up for yourself and tell the truth,\" Smith said. \\nThomas was nominated to the top court in 1991 by Republican President George H.W. Bush. Loading ...'"}, "time": 1742561694.063803}