{"duration": 0.0476076602935791, "input_args": {"text": "'Video of the controversial aid group Syrian Civil Defense, also known as the “White Helmets,” has leaked showing the staging of a fake rescue. The video shows White Helmet workers and a trapped “victim” getting into position and preparing for a scene, laying completely still as the camera move around them.\\nThen the action kicks into gear with a flurry of activity and shouting off-camera with the “victim” suddenly screaming in agony as White Helmet workers/actors remove debris from his body and carry him away.\\nIt is unclear if this video was meant to be released, or at least all parts of it, but images of the “victim” after the rescue appear to show him in rather good spirits.\\nBefore & After #WhiteHelmets #MannequinChallenge pic.twitter.com/09K1xGYjnS \\n— Navstéva (@Navsteva) November 22, 2016 \\n\\nThis is not the first time the White Helmets have come under scrutiny for not acting like the apolitical rescue workers they claim to be. Other videos have shown the White Helmets carrying weapons and aiding in jihadist executions. \\nJournalist Max Blumenthal recently published a two-part series at Alternet exposing the White Helmets as being part of a campaign, funded in part by the US government, to push for regime change in Syria. \\nThe White Helmets have partnered with The Syria Campaign, which is dedicated to overthrowing the Assad government in Syria. The Syria Campaign relentlessly promotes the White Helmets in hopes of influencing Western public opinion against the Assad government and for regime change.\\nIf the video is faked, The Syria Campaign and the White Helmets seem perfectly fine with putting out fraudulent material to push for regime change in Syria. The question then becomes: how many of their other videos are also fake?\\nThe post Video Shows White Helmets Staging Fake Rescue In Syria appeared first on Shadowproof .\\n'"}, "time": 1742563695.0542881}