{"duration": 0.12015938758850098, "input_args": {"text": "'Politics The EU’s Nemtsov Forum Is a Phoney, Politicially Correct Waste of Time \\nIf the European Union desires to be a truly relevent center of international order, it should not waste the resources and time of diplomats and officials on dialogues with Russian émigrés who have nothing to do with the Russian government Originally appeared at East West Accord \\nThe European Union parliament often prides itself on being a model for international intergration on a global scale. Yet, the upcomong Boris Nemstov forum, billed as exemplifying EU-Russian dialogue, does not live up to the European parliament’s lofty reputation. Rather than EU-Russia dialogue, the forum is an example of Europeans talking to themselves and failing to engage in real politics. \\nThe forum, which will be held late November of this year, appears to be less of a dialogue between the EU and Russia and more of a dialogue between the EU, itself and a who’s who of Russians who have no political power in Moscow and no popular electoral mandate from the Russian people. A true EU-Russia dialogue would involve symetry. The Boris Nemstov forum is akin to an academic debate on quantum physics between the faculty of MIT and the 5th grade science class at Peabody school in Cambridge Massachusetts. If this is what passes for EU-Russia dialogue these days, then the European Union is in deep crisis. \\nOver the course of the inception of the European Union, when the governments representing the various nations and peoples of Europe engaged in often difficult negotiations to achieve real compromise over economic, historical and political differences in pursuit of peace and progress, the EU was a serious political forum for international dialogue. Those times, and the serious statesmen who populated them, are long past. Public relations has taken the place of diplomacy and the easiest road is often labeled with the most hyperbolic, arrogant slogans. Thus the upcoming forum is billed as: \\n“A platform for an improved EU-Russia dialogue to repair the important strategic relationship between Russia and the European Union by involving a pro-European generation of future Russian leaders whose commitment and vision will make this possible.” \\nThe European Union is a political-legal entity, as are the EU ambassadors lent their support to the forum. The platform is billed as EU-Russia dialogue. Yet where are the representatives of the Russian Federation, the political-legal entity which represents the Russian people and even has a seat in the UN security council? Will the Russian ambassador take part in the EU-Russia dialogue? Will Russian deputies to the Duma who actually represent the Russian people take part in the EU-Russia dialogue during the forum? \\nAt present, initiating a serious dialogue between the EU and Russia is abysmaly difficult because the European Union has committed itself to economic sanctions against Russia which include a ban on travel to the EU for large portions of the Russian government and business elite. Of course, the European Union parliament apparently thinks it can get around this problem by meeting with a “pro-European generation of future Russian leaders.” \\nOne wonders just how the EU knows these particular individuals (whose website boldly proclaims that the interests of the elected President of Russia are not those of the Russian people) themselves represent Russia’s true interest and will – in future – be swept to power? Precedent for such thinking on the part of Western Europeans exists: in 1918 one of the “pro-European generation of future Russian leaders,” Lenin, was swiftly sent to Moscow by the faltering German Empire to replace the Tsar, who’s interest- Lenin and his Western European allies felt- were not the interests of the Russian people. The result was a bloody Russian civil war which made the XXth century into the most deadly in all human history. \\nHistory, like real politics, are not currently popular amongst Brussels elites. Events like the Borys Nemstov forum are exercises in political naivety. They are not serious dialogue. Serious European-Russian dialogue can be found in Berlin, Paris and Minsk. It is there that the German Chancellor and the French President routinely hold talks with the President of Russia. These talks are not easy. These talks are not self-flattering festivals of wishful thinking. These talks are real politics: hard negotiations about life and death issues at the heart of the future of Europe. \\nIf the European Union desires to be a truly relevent center of international order, it should not waste the resources and time of diplomats and officials on dialogues with Russian émigrés who have nothing to do with the Russian government. The EU should organize real international conferences where ambasadors meet ambasadors and members of parliament meet members of the Duma. A civic forum bringing together common people of different political persuasions is likewise commendable. A forum of government officials meeting with the enemies of another country’s government officials is hardly a model of good diplomacy. \\nIn principle there is of course nothing inappropriate about hosting different groups of different political persuasions from Russia, but in this time of declining international order and the looming prospect of a new Cold War it is highly ill advized to pretend that a meeting between officials from a supposedly serious international body such as the EU and a group of ragtag émigré Russian revolutionaries is representative of “EU-Russian dialogue.” If anything, the upcoming Boris Nemstov forum in Brussels is symbolic of the political impotence of European institutions and the terrible crisis of EU-Russia relations.  '"}, "time": 1742561917.494936}