{"duration": 0.09694480895996094, "input_args": {"text": "' Good morning. (Want to get California Today by email? Here’s the  .) Let’s turn it over to Thomas Fuller, our San Francisco bureau chief, for today’s introduction. It will be many months before any grapes are ready to pick but winemakers in the Napa and Sonoma valleys are already fretting that they will not have enough workers for the harvest. “I’m   about it this year,” said Nico Cueva, winemaker at Kosta Browne, a   winemaker in Sonoma County. “Our industry is based on immigration. ” More than   of California farmworkers are undocumented immigrants and the Trump Administration’s threatened crackdown is scaring many of them away, winemakers say. The labor crunch is hurting all types of agricultural businesses in California but the upscale vineyards of Napa and Sonoma have particular needs. Unlike the industrial grows of the central coast, where grapes are often mechanically harvested, grapes in Napa and Sonoma are almost always handpicked. Winemakers say this helps avoid bruising the fruit, among other advantages. Another factor, says Mr. Cueva: California’s cannabis industry has been poaching some workers and   marijuana and grapes are harvested at around the same time. Austin Peterson, winemaker at Ovid, a boutique winery on the hills overlooking Napa Valley, says winemakers have already had trouble finding workers to prune the vines this year. “There’s already a shortage of labor  —   more than in recent memory,” he said. “Everyone in agriculture is hopeful that immigration reform comes soon. ” The shortage has overtaken water concerns as the No. 1 problem for vineyards, says David E. Block, the chairman of viticulture and enology at the University of California, Davis. At elite wineries the optimum harvest window can sometimes be as short as six or 12 hours  —   even less if unfavorable weather arrives around harvest time. So having crews available is crucial to the quality of the grapes. Could the labor shortage hurt the quality of this year’s top California wines? “I’m not sure it’s gotten bad enough to where people are thinking it will compromise the quality of the harvest,” Mr. Block said. “But everyone is racing to get a crew ready to pick. ” (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Devin Nunes, the House Intelligence Committee chairman, will step aside from an inquiry into ties between the Trump campaign and Russia. [The New York Times] • The California Legislature approved a plan to raise gas taxes and vehicle fees by $5. 2 billion a year to pay for road repairs. [Los Angeles Times] • An appeals court upheld California’s    program, a pillar of the state’s battle against climate change. [Reuters] • Don Rickles died at 90. The   comic’s insults flew at everyone, from Frank Sinatra to his own audiences. [The New York Times] • Officials announced a break in one of Monterey County’s most vexing unsolved cases, the 1998 killing of a teenage girl. [Monterey Herald] • The surge in Tesla’s stock far outpaces its actual sales. The carmaker’s bewitching story helps explain why. [The New York Times] • The government wants to know who is behind a Twitter account that criticized the Trump administration. So the company sued. [The New York Times] • Joanne Kyger, a poet who was one of the few women embraced by the Beat Generation writers’ fraternity, died in Bolinas. She was 82. [The New York Times] • A California bucket list: Old Sacramento, Crystal Cove cottages and the world’s safest beach in Carpinteria. [Los Angeles Times] • A wave of arcade taverns is reviving a   subculture in Los Angeles. [The Hollywood Reporter] • Video: The Salesforce Tower has eclipsed the Transamerica Pyramid as San Francisco’s tallest building. [The Mercury News] Before Indianapolis, the heart of American auto racing was in Los Angeles. It was this week in 1910 that the inaugural race was held at the Los Angeles Motordrome, the world’s first wooden plank track built for automobile racing. Until then, races commonly happened in the dirt and across big distances. At the Motordrome, erected near the beach in Playa del Rey, fans had a view of all the   action on a   circular track. Crowds of more than 10, 000 people came to see the early stars of the sport push the limits of the big machines at more than 90 miles an hour around the banked track, essentially a   version of a bicycle velodrome. The racers included characters like the   Barney Oldfield, the millionaire playboy Caleb Bragg, and a native son, “Terrible” Teddy Tetzlaff. “It was a crazy, great time,” said Harold Osmer, a racing historian. “They called it the days of chain drive, wooden spokes and   . ” The Motordrome burned down after three years, but by then a number of other board tracks had been constructed to cater to Angelenos’ growing racing obsession. Later, around the 1930s, said Mr. Osmer, the sport’s center of gravity began to shift to Indiana, home of the famed Indianapolis Motor Speedway. But auto racing in Southern California never died  —   it rather became just one of a menu of entertainment options as the region developed. There are still plenty of tracks  —   in Fontana, Bakersfield, and Ventura, among other places. The Long Beach Grand Prix takes place on a street circuit this weekend. Attendance at past contests has surpassed 180, 000, making it the single largest event of the year in Long Beach. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U. C. Berkeley.'"}, "time": 1742562865.26319}