{"duration": 0.13439726829528809, "input_args": {"text": "'4 Flawless Zen Lessons on Gratitude Nov 4, 2016 4 0 \\nIn Zen Buddhism, even an empty rice bowl is something to be grateful for. Spontaneous gratitude is easy to come by, after all. Who wouldn’t feel happy upon receiving a bonus at work, being rescued from a mountain cliff, or clean water to drink in a desert? The trick is cultivating gratitude for the things we take for granted, and even the people and circumstances that normally make us hopping mad. The Blind Turtle: Gratitude for a Human Birth \\nKindness is rare in the world, but one who expresses gratitude for kindness is even more exceptional. This is the sentiment expressed by the Buddha in the Anguttara Nikaya (AN 2:118). Gratitude is so important on the path to realization that the Buddha compares it to a blind turtle living on the bottom of the sea that surfaces only once every hundred years to take a breath. When he rises to the ocean’s thrashing waves, he places his thin neck through a yoke floating on a vast sea. This is the likelihood that we would enjoy a human life, affording us freedom and fortune, and the opportunity to unshackle ourselves from the illusion of duality. \\nThis story sets a precedence for all other forms of gratitude. Our human life is so precious that the Buddha would often take a monk into the forest, tell him to sit at the base of a tree, and begin “gladdening of the heart,” simply to reflect on how fortunate he was that an innumerable number of circumstances had to occur in order for him to be alive with the added boon of being able to seek the dharma. \\nThe Buddha would also teach that it was incorrect to bemoan any of life’s unsavory circumstances, since just being alive “is enough.” He said that, “when we realize how perfect everything is, we will tilt back our heads and laugh at the sky.” Gratitude for the 10,000 Sorrows \\nBeing grateful doesn’t mean we ignore the very painful realities of this world: war, hunger, poverty, inhumanity, among them. The understanding we gain from practicing gratitude frees us from being lost or identified with either the negative or the positive aspects of life, letting us simply meet life in each moment as it rises. We divorce ourselves from a belief in dualism – the delusional or erroneous view of reality, not to be confused with “duality,” an intrinsic aspect of reality . \\nJack Kornfield, a Buddhist teacher and author of A Path With Heart, s peaking on the subject of spirituality and gratitude once stated , \\n“If we see the world as sacred, which is an expression of the spiritual life, then gratitude follows immediately and naturally. We’ve been given the extraordinary privilege of incarnating as human beings — and of course the human incarnation entails the 10,000 joys and 10,000 sorrows, as it says in the Tao Te Ching — but with it we have the privilege of the lavender color at sunset, the taste of a tangerine in our mouth, and the almost unbearable beauty of life around us, along with its troubles. It keeps recreating itself. We can either be lost in a smaller state of consciousness — what in Buddhist psychology is called the “body of fear,” which brings suffering to us and to others — or we can bring the quality of love and appreciation, which I would call gratitude, to life. With it comes a kind of trust. The poet Pablo Neruda writes, “You can pick all the flowers, but you can’t stop the spring.” Life keeps recreating itself and presenting us with miracles every day.” Gratitude for Those Who Came Before Us \\nBernard of Chartres once said that we were all standing on the shoulders of giants. In the Zen tradition, this could not be more true. Taigen (Zen Master) Dan Leighton wrote in an article titled “ Meditation and American Shin Buddhism ,” \\n“It is certainly true that Japanese Soto Zen founder Eihei Dogen (1200-1253) encouraged his students to apply themselves diligently to zazen, the sitting meditation that he espoused as a primary practice throughout his career. . . Dogen was not seeking for an “easy practice” as a response to concerns about mappo, in the spirit of his fellow Kamakura period innovators. But none of this means that Dogen was advocating a self-power practice with which its practitioners could accomplish great realization through their own efforts. On the contrary, many aspects of Dogen’s meditation teaching assume the practitioner’s devoted acceptance of and support from “other” sources. \\nThis is not to claim that Dogen was relying solely on some other-power with the same humble and insistent devotion as his contemporary Shinran. . . “Other power” here does not refer to reliance on any single other source such as the vow of Amitabha, but Dogen did see the necessity for awakened realization of receiving support and strength from a variety of external “other” sources, and the importance of sincere devotional gratitude to these benefactors.” \\nWhat Leighton articulates is our dependence on others’ achievements to enjoy the lives we currently live. While this can certainly describe our spiritual practice – who among us hasn’t had an a-ha experience from speaking with a more enlightened master – but it can also be applied to a myriad other things in our lives. We drive on roads that someone else built. We eat food that someone else grew. We use technology that someone else dreamed up. Even the rivers, lakes and oceans that we have the privilege of gazing upon were built by eons of hard work by Mother Earth. Going back to the first point on gratitude, even our birth is possible because our parents and their parents’ parents decided to love one another, even if only long enough to make us come to be. Gratitude for Our Parents \\nSome of us would quite naturally feel gratitude for our parents. A few lucky people among us were given two loving, balanced, psychologically stable adults who were charged with raising us from the first moments we took breath on this planet. Others among us might feel it difficult to feel gratitude for our parents (insert any other family member or close friend here) due to the seeming unfortunate way we were treated as we grew up. The Buddha once said, \\n“I tell you, monks, there are two people who are not easy to repay. Which two? Your mother & father. Even if you were to carry your mother on one shoulder & your father on the other shoulder for 100 years, and were to look after them by anointing, massaging, bathing, & rubbing their limbs, and they were to defecate & urinate right there [on your shoulders], you would not in that way pay or repay your parents. If you were to establish your mother & father in absolute sovereignty over this great earth, abounding in the seven treasures, you would not in that way pay or repay your parents. Why is that? Mother & father do much for their children. They care for them, they nourish them, they introduce them to this world. \\n“But anyone who rouses his unbelieving mother & father, settles & establishes them in conviction; rouses his unvirtuous mother & father, settles & establishes them in virtue; rouses his stingy mother & father, settles & establishes them in generosity; rouses his foolish mother & father, settles & establishes them in discernment: To this extent one pays & repays one’s mother & father.” — Anguttara Nikaya (AN 2:32) \\nIf your parents weren’t so fabulous, or even abusive, you can be grateful that they taught you how not to overcome by adversity. Is there a greater gift?'"}, "time": 1742561970.125545}