{"duration": 0.04717707633972168, "input_args": {"text": "'\\nMoments ago, after teasing its twitter followers to “stay tuned for our FBI-DoJ #PodestaEmail special circa 4pm EST” Wikileaks released what appears to be part 28 of its Podesta dump, dubbed the “DoJ/FBI/Huma special” and includes some 1,308 emails, bringing the total to 45,526 in total emails released.\\nRELEASE: The Podesta Emails Part 28 – DoJ/FBI/Huma special #PodestaEmails https://t.co/tIw3T6L6se \\nMore: https://t.co/v8OnMJnWsS \\n— WikiLeaks (@wikileaks) November 3, 2016 \\n\\nWe assume the batch will be heavily focused on the DOJ, FBI and Huma, and will present readers with any relevant emails as we find them.\\n* * *\\nIn an email from June 10, 2011 from now-campaign communication manager Jenn Palmieri to John Podesta and Neera Tanden, Palmieri writes – regarding Huma Abedin following the first Anthony Weiner scandal – that it is…\\n“Time to get in the haz mat suits… Bust in that house and get Huma the hell out of there.” \\nTanden responds “Lord have mercy.”‘\\n\\nWe assume this was a reference to one of the early Anthony Weiner scandals, and a harbinger of things to come regarding Huma’s husband. In retrospect, they should have followed their rhetorical advice.\\n* * *\\nOn August 27, 2015, an email from Lanny Davis, special counsel to President Bill Clinton, and spokesperson for the President and the White House on matters concerning campaign-finance investigations and other legal issues, appears to suggest that both Fox news and Megyn Kelly were part of the campaign’s pre-coordination with journalists. Davis tells Jen Palmieri the following “personal” thoughts, which suggest getting a guarantee from Megyn Kelly that she won’t be “tough on Hillary ” in a proposed interview – which could be a “ratings and media bonanza” – meant to explain why Hillary “wiped” her server.\\nDear Jen,\\nI know what I’m about to propose is very risky and will be instinctively viewed negatively on the first reaction. But because of the high advantages that I see, perfectly aware of the risks, I think this proposal should be considered.\\nI propose that the Secretary be on the Megyn Kelly File show for at least 30 minutes. I believe I can reduce the risks, since I know Megyn and Roger Ailes very well, by ensuring that the Secretary will have an opportunity to answer tough questions on emails and other issues without interruption. \\nIn fact , I believe it is in the interest of Secretary Clinton as well as Fox for the questions to be tough , something we should not fear as long as she has an opportunity to answer. I know she will do well with adequate preparation, and especially after yesterday’s excellent statement taking full responsibility for mixing personal an official business on a single email device.\\nI still believe the issue of the wiping out of uthe private server still needs to be dealt with – e.g., simply stating that was done primarily to protect personal privacy on personal emails but she made the mistake of mixing personal with official on the server because she was using a single device, and she should have been more transparent shortly after she left office. \\nThis interview has the potential to be a ratings and media bonanza. I have confidence she would hit a political home run and have a massive audience to deliver her message without a filter. \\nOf course there is a risk that Megan will try to show how tough she can be, even tougher than on Trump. I am assuming the worst case on that risk. But if we have a guarantee, which I believe We will get, that she will have an uninterrupted chance to respond to every question, and we have time to prepare, I think this could be a major plus and even a game changer in the various negative narratives about the Secretary being largely inaccessible and sometimes testy with the media. \\nIt would be so much better to be able to talk to you on the phone about this and discuss the pros and cons. If you are willing and available, what would be the best time in the best telephone number?\\nWith warmest regards, and thanks as always for your consideration of my ideas,\\nLanny\\n\\nHe follows up four days later with the following:\\nWould love a chance to talk on phone – a few additional background points re conversation I had with Roger Ailes and Megyn some time ago on the subject of HRC pre – announcement. \\nIt is unclear what was the ultimate fate of the “personal” proposal. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Zero Hedge of www.zerohedge.com . '"}, "time": 1742628581.4943948}