{"duration": 0.1752917766571045, "input_args": {"text": "'A look at the university’s new mission. October 28, 2016 Jack Kerwick \\nJonathan Haidt, a professor of social psychology at New York University, argued in a recently published essay that while its traditional “telos” (end or goal) has been truth, within the last few decades the university has assumed another: Social Justice. \\nThe university, however, can only have one telos. \\nThe conflict between these two goals has raged for decades, Haidt claims. Last year, though, it became unmanageable when student groups at 86 universities and colleges around the country issued “ demands ” to administrators, demands for Social Justice that, by and large, were met. \\nThe following statement is posted at BlackLiberationCollective.org : \\n“We demand at the minimum, Black students and Black faculty to be reflected by the national percentage of Black folk in the state and the country. \\nWe demand free intuition for Black and indigenous students. \\nWe demand a divestment from prisons and an investment in communities.” \\nA statement of “principles” follows. The Black Liberation Collective (BLC) opposes “anti-Blackness;” “sexism;” “ableism;” “capitalism;” “White privilege;” “inequality;” and “heteronormativity.” It rejects as well non-violence considered as a principle in contradistinction to a tactic . \\n“Anti-Black racism is woven in the fabric of our global society,” says the BLC. “When social systems are racialized by white supremacy, whiteness becomes the default of humanity and Blackness is stripped of its humanity, becoming a commodity, becoming disposable.” \\nThe BLC is “anti-sexist” insofar as it affirms “the value of all Black women’s lives whether cisgender, transgender, or genderqueer.” In addition to rejecting “Eurocentric beauty standards that are made to lessen the beauty of Black women and Black women’s features,” being “anti-sexist” also means realizing that “police brutality, the prison industrial system, school to prison pipeline” and the like are aspects of “structural racism” that affect black women as much as they impact black men. \\nBlack liberation entails “queer liberation” and “trans liberation.” “We also seek to destroy the heteronormative norms that dehumanize Black queer people,” the BLC asserts. The “homophobia” within “the Black community” comes by way of “the same hands responsible for white supremacy.” \\nPresumably, “transphobia” within the black community is also a legacy of white supremacy. In cooperation with “cissexism” and “the gender binary,” “transphobia” has “been used as a means of invalidating and erasing our trans+ family members.” The BLC pledges to “eliminate” such systemic biases. \\nThese Social Justice Warriors (SJWs) are staunch opponents of “the capitalist notions of infinite profit, homogenized markets, and a privatized means of production.” Capitalism, they insist, “is the economic system” that’s been “used to justify” the “oppression,” “marginalization,” and “exploitation” of blacks. \\nNor is the solution to this “oppression” to be found in supporting black-owned businesses. The BLC explains that “we cannot adopt the patriarchal, exploitative tools of our oppressors as we seek liberation.” Rather, the solution is to “dismantle anti-Black capitalist corporations that benefit from our oppression.” \\nIt isn’t only the “capitalist corporations” that these students want destroyed. They demand as well “the eradication of all institutional practices and policies that discriminate against the black community” and “the removal of all federal, state, and local government officials who do not abide by our principles.” \\n“The State and all its institutions that deny Black humanity and Black agency must be dismantled and replaced with those that produce Black liberty.” \\nConcerning its attitude toward America, the BLC is clear: “This country was built to systematically oppress groups of people, and the Black Liberation Collective will not stand for it.” \\nHaidt misspeaks in characterizing 2015 as the year when the university experienced a crisis of identity, an unmanageable conflict of goals. To judge from the vast majority of liberal arts, humanities, and social sciences departments, Social Justice long ago eclipsed truth as the raison d’etre of the academy. Interestingly, it is these SJW demands from last year that bear this out. \\nPerhaps it is because I’ve spent the last couple of decades in the academy in the capacity of both student and faculty that I may be more privy to this than are some others, but it’s painfully obvious that these student activists did not come up with these demands on their own. If they didn’t have their professors actually write the demands for them, then the Black Liberation Collective unquestionably derived the concepts and language of their statement of demands from their mentors. \\nTo put it bluntly, one must attend college, major in the liberal arts and humanities, and study under far left professors in order to think in the terms that are characteristic of Social Justice Warriors. \\nLeftist ideologues are training their students to bend the university to their will. This is the first point. There is, though, another, a rich irony that is lost upon these self-styled radicals. \\nFor all of their bluster over “systemic racism” and “structural white supremacy,” i.e. phenomena that are omnipresent and, hence, largely unconscious, these black students, their white collaborators, and their professors fail to realize that their thinking (for lack of a better term) on these issues is about as Eurocentric as one can get. The “ critical race theory ” to which the BLC subscribe is a version of Marxism, the philosophical vision of a 19 th century German-Jewish man. The Marxist tradition within which they are enmeshed was fleshed out over a span of generations by mostly white heterosexual men. \\nBut there’s more to it than this. \\nThe idea that “racism,” “sexism,” “homophobia,” “transphobia,” “ableism,” and the like against which SJWs rail are evils to be defeated is itself peculiar to the moral traditions of European civilization. If these “isms” and “phobias” are immoral it can only be because those who are guilty of them fail to judge the individual as an individual. Color, gender, sexual orientation, ability, and so forth are neither constitutive of nor essential to the moral identity of the individual—but only if the framework of the doctrine of individualism is accepted. \\nYet this conception of the sacrosanct individual is as Eurocentric as the proverbial “apple pie” is American. \\nThe Social Justice Warriors’ intellectual landscape is as much a European “colony” as was any West African country in the 19 th or early 20 th centuries. Those in the Black Liberation Collective have most definitely internalized the modes of thought of their “oppressor.” \\nNow, they would have been well aware of all this had they received a genuine education in college rather than a training in Social Justice.'"}, "time": 1742562545.9732182}