{"duration": 0.16979765892028809, "input_args": {"text": "'By Daisy Luther\\nLet’s talk about Wikileaks.\\nFirst of all, the organization was founded by Julian Assange back in 2006. Their website explains what they are all about:\\n“WikiLeaks specializes in the analysis and publication of large datasets of censored or otherwise restricted official materials involving war, spying, and corruption. It has so far published more than 10 million documents and associated analyses.”\\nIn the 11 years that they’ve been publishing documents, they have not been disproven a single time. Their record for authentication is perfect. (Learn more here and here .)\\nSo this means that a person would be pretty silly to disregard anything in the reams of information about Hillary Clinton, the Democratic Party, the Clinton Foundation, and the political shenanigans that would put the Machiavellis to shame.\\nHere are 21 of the most important things that have come out about Hillary Clinton, that unfortunately, no one is reporting on in the mainstream. In the interest of brevity, each topic has a link to an article that goes deeper into the leak. (In no particular order.)\\nJohn Podesta, the chairman of the Clinton campaign had a nice cozy dinner with Peter Kadzik, one of the top officials in the Department of Justice…the day after the Benghazi hearing . Kadzik’s son also asked for a job on the Clinton campaign, and, the icing on the corruption cupcake? Kadzik led the effort to nominate Loretta Lynch, who famously met with Bill Clinton on her private plane right before Hillary’s interrogation about Emailgate. ( source ) We all knew that the Clinton Foundation was just a way for the Clinton family to launder money, and now there’s proof. Zero Hedge writes, “…today’s Wikileaks dump included that memo which reveals, for the first time, the precise financial flows between the Clinton Foundation, Band’s firm Teneo Consulting, and the Clinton family’s private business endeavors.” A pundit called this leak “The Rosetta Stone of the Clinton Foundation,” meaning that with this document, all of their shady financial dealings could be unraveled and translated. ( source ) Clinton is unable to speak for very long without a podium to lean on . Numerous leaked emails reference how certain interviews have to be kept short because she’d be without one. And this article references a very interesting reason why this may be the case – surprisingly it isn’t related to her health. ( source ) The leaks also show that Clinton intends to do her best to restrict the Second Amendment. Brian Fallon, the national press secretary for the Clinton campaign, wrote, “ Circling back around on guns as a follow up to the Friday morning discussion: the Today show has indicated they definitely plan to ask bout guns, and so to have the discussion be more of a news event than her previous times discussing guns, we are going to background reporters tonight on a few of the specific proposals she would support as President – universal background checks of course, but also closing the gun show loophole by executive order and imposing manufacturer liability .” According to an analysis on The Daily Sheeple, “Imposing manufacturer liability means that after Sandy Hook, Bushmaster and Remington Arms would have been prosecuted for having a hand in the murder of children and school staff members for firearms that were legally sold.” ( source ) The campaign was concerned that the sexual escapades of Bill Clinton could be likened to those of another disgraced celebrity, Bill Cosby . Political operative Ron Klain sent an urgent email saying that Hillary should anticipate the following questions, ” How is what Bill Clinton did different from what Bill Cosby did? Is his conduct relevant to your campaign? You said every woman should be believed. Why not the women who accused him? Will you apologize to the women who were wrongly smeared by your husband and his allies?” ( source ) Clinton’s campaign deliberately leaked an embarrassing photo of a swimsuit-clad Bernie Sanders to the press, ironically insinuating that it was proof he was bought off by Wall Street. Perez Hilton wrote, “ Bernie Sanders lounges at elite Martha’s Vineyard pool, summer 2015 after helping raise money from Wall Street lobbyists .” ( source ) Clinton admitted she is out of touch with the middle class in a speech to Goldman-Black Rock in 2014. “And I am not taking a position on any policy, but I do think there is a growing sense of anxiety and even anger in the country over the feeling that the game is rigged. And I never had that feeling when I was growing up. Never. I mean, were there really rich people, of course there were. My father loved to complain about big business and big government, but we had a solid middle class upbringing. We had good public schools. We had accessible health care. We had our little, you know, one-family house that, you know, he saved up his money, didn’t believe in mortgages. So I lived that. And now, obviously, I’m kind of far removed because the life I’ve lived and the economic, you know, fortunes that my husband and I now enjoy , but I haven’t forgotten it.” ( source ) She made this rather NWO remark at a 2013 paid speech to Brazilian bank Banco Itau: “ My dream is a hemispheric common market, with open trade and open borders , some time in the future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere.” ( source ) In a leak of yet another paid speech, this time to the Jewish United Fund of Metropolitan Chicago in 2013, Clinton said that Jordan and Turkey “ can’t possibly vet all those refugees so they don’t know if, you know, jihadists are coming in along with legitimate refugees.” Meanwhile, if Clinton has her way , we will be warmly welcoming 65,000 refugees a year, which makes Obama’s 10,000 a year look like small potatoes. ( source ) Clinton blackmailed the Chinese by telling them that the US would base missiles in the region if they didn’t exert some control over North Korean aggression. “ So China, come on. You either control them or we’re going to have to defend against them ,” she purportedly told the audience at a Goldman Sachs conference in June 2013. ( source ) In May 2015, Clinton was no longer Secretary of State but was ready to announce she was running for President when she was invited to attend a summit in Morrocco. The implication from the leaked emails was that a $12 million “donation” from the king of Morocco was dependent on Clinton attending the summit. Human Abedin, usually loyal to her boss, had concerns . “ If HRC was not part of it, meeting was a non-starter. She created this mess and she knows it. Her presence was a condition for the Moroccans to proceed so there is no going back on this,” Abedin wrote to Robbie Mook in a November 2014 email. Incidentally, Clinton didn’t attend. Bill and Chelsea went instead and the $12 million donation was not forthcoming. (source ) Podesta attacked Clinton’s primary election rival Bernie Sanders for criticizing the Paris climate change agreement. “ Can you believe that doofus Bernie attacked it? ” said Podesta. ( source ) Clinton told a Goldman Sachs conference she would like to intervene secretly in Syria . “ My view was you intervene as covertly as is possible for Americans to intervene,” she told employees of the bank in South Carolina, which had paid her about $225,000 to give a speech. “We used to be much better at this than we are now. Now, you know, everybody can’t help themselves. They have to go out and tell their friendly reporters and somebody else: Look what we’re doing and I want credit for it. ” (source ) There is indeed a definite link between the Clinton campaign and what MSM is allowed to say. The campaign has colluded directly with media spokespersons that read like a Who’s Who in American Media : Dan Merica from CNN, Haim Saban of Univision, John Harwood of CNBC and the NY Times, Rebecca Quick of CNBC, Maggie Haberman of NY Times and Politico, John Harris of Politico, Donna Brazile formerly of CNN, Roland Martin of TV-One, Marjorie Pritchard of The Boston Globe, and Louise Mensch of Heat Street. ( source ) As everyone knows, the DNC deliberately screwed Bernie Sanders out of the nomination ( Bonus: Wikileaks also released some of the DNC’s voicemails on the topic ). There are emails that prove who is actually pulling HRC’s puppet strings and that puppeteer is George Soros . The shadow government is not just a conspiracy theory – it really exists and Hillary’s job is to keep George Soros happy. ( source ) Excerpts from her speeches to Wall Street read like a guide to two-faced treachery. In them, she clearly points out that sometimes you “need” to lie. “If everybody’s watching, you know, all of the back room discussions and the deals, you know, then people get a little nervous, to say the least. So, you need both a public and a private position.” ( source ) Wikileaks emails show that back when she still worked for CNN and before she became an employee of the Clinton campaign, Donna Brazile gave Hillary the questions in advance for her “impromptu” CNN Town Hall questions. ( source ) The campaign got to “approve” articles in influential publications like NY Times, HuffPo, CNN, NBC, CBS, NYT, MSNBC, and Politico, showing a massive collusion with the mainstream media, who has hounded Trump relentlessly in an effort to distract from HRC’s abysmal candidacy. ( source ) Through the treasure trove of Wikileaks emails, we can gain an accurate picture of how Hillary really feels about us all (spoiler: basket of deplorables, basement dwellers and right wing conspirators) ( source ) President Obama knew the whole time that her emails were not coming from the secure State Department server. Cheryl Mills wrote to John Podesta, “W e need to clean this up – he has emails from her – they do not say state.gov .” You see, Obama’s emails all have to be from”whitelisted”addresses. So someone, somewhere, added her nonsecure email to his whitelist. ( source ) And finally, here’s the real reason that treacherous shrew is involved in politics. And let me tell you, it isn’t because she yearns to make things better for anyone but herself. (emphasis mine.)\\nAt the Goldman Sachs Builders and Innovators Summit, Clinton responded to a question from chief executive Lloyd Blankfein, who quipped that you “go to Washington” to “make a small fortune.” Clinton agreed with the comment and complained about ethics rules that require officials to divest from certain assets before entering government. “ There is such a bias against people who have led successful and/or complicated lives, ” Clinton said. ( source )\\nTogether, we cannot be ignored. I am on a mission between now and the Presidential Election on November 8th and I hope that you will join me. I am going to work day and night to provide the coverage that the mainstream media is not. It isn’t until we combine all of our voices that we can make people listen to the scandals, the rigging, and the corruption, not only in this election but in the system in general. Please join your voice with mine by liking, sharing, and spreading the word. Together, we cannot be ignored. Together, we are an army. Source: Daisy Luther \\n'"}, "time": 1742563284.2482605}