{"duration": 0.06381058692932129, "input_args": {"text": "'Clinton Advisor LOSES IT In Leaked Email Over Hillary’s Illegal Activity Posted on October 28, 2016 by Dawn Parabellum in Politics Share This \\nNothing is more satisfying than Democrats turning on each other, and that’s exactly what has happened in the Hillary Clinton camp. As if we haven’t heard enough of Hillary’s incompetence and corruption, a newly leaked email shows a top Clinton advisor absolutely losing it over Hillary’s illegal activity, and her shocking admissions don’t paint a pretty picture for the Democrat Party. \\nThieves and liars are commonplace, but when a person is running for President of the United States, perhaps they should conduct themselves in a manner that commands respect. Hillary Clinton has never been trustworthy in the eyes of rational Americans, and even her advisors picked up on the trouble she’s gotten herself in. The leaked emails are telling and have shown the Clinton campaign as struggling with damn near every aspect of her run for president because Americans are fed up with her lies and corruption. Hillary Clinton \\nIn newly-released emails from WikiLeaks, Neera Tanden, co-chair of Clinton’s transition team, cusses at John Podesta, Clinton’s campaign chairman. Tanden is upset about Hillary using the private email and server system, wondering who could have approved of such a thing, which literally left Hillary’s team hoping that the Democratic Party isn’t “suicidal.” Obviously, Tanden is angry because the scandal is damning to Hillary’s political career, and they are all linked to the corrupt Democrat. Email from Tanden to Podesta complaining about Hillary’s email debacle \\nTanden actually said that whoever gave the OK should be “drawn and quartered,” calling the whole situation “f***ing insane” in the July 2015 message. Podesta even agreed with her assessment and that the refusal to mention it earlier was “unbelievable.” Hillary Clinton advisor, Neera Tanden \\n“[I] guess I know the answer,” Tanden replied. “[T]hey wanted to get away with it.” \\nHillary Clinton has still declined to answer to any of the revelations leaked in the Podesta emails. It’s likely that there is absolutely no good way for her to handle any of this. She could claim her advisors are liars, but then we would question her judgment in selecting them. She could admit that everything is true, but that’s just coming out stating emphatically that she’s a corrupt criminal. Or, she could just ignore it and hope her lapdog media will make it go away, which seems to be exactly what she’s doing. \\nThe leaked Podesta emails are not done, and with the election coming upon us quickly, it’s hard to image what else will be released. Those of us who actually do care about the abuses of government, unlike the mainstream media, will keep a diligent eye and report what’s found because we all know that the media is trying to sweep this under the rug permanently. Too bad for them, it’s not going to work, and thanks to the internet and social media, not only can we inform ourselves, we can spread the information to others without relying on the equally corrupt press who are covering for that crooked Clinton.'"}, "time": 1742561646.5992942}