{"duration": 0.04453587532043457, "input_args": {"text": "'A Russian politician and prominent critic of Vladimir Putin, Denis Voronenkov, was killed in the streets of Kiev on Wednesday, having fled Russia last October in fear of his life. [Voronenkov  —   a former Russian MP who had previously testified against the   former Ukrainian President, Viktor Yanukovych, and criticized Vladimir Putin’s policies  —   was shot three times with a 9mm handgun in broad daylight in the Ukrainian capital of Kiev.  His bodyguard, a Ukranian security agent, was also shot and remains in the hospital but managed to return fire and fatally wound the gunman, who has not yet been identified. Voronenkov and his wife Maria Maksakova fled Russia in October last year, citing the ‘schizophrenic’ Russian government as their reason. The couple recently had a son, whose first birthday will be in April. Following the incident, Ukrainian President Petro Poroshenko described it as “an act of state terrorism” undertaken by the Kremlin. However, Kremlin spokesman Dmitry Peskov refuted the claims, stating that “all falsehoods that can already be heard about   Russian involvement are absurd. ” The murder was quickly denounced as an act of Russian violence, with Ukranian MP Volodymyr Ariev accusing Putin of “spreading fear all over the world”: New Litvinenko case. Former Russian MP Voronenkov shot to death in Kyiv right on the street. Putin spreading fear over the world.  —   Volodymyr Ariev (@VolodymyrAriev) March 23, 2017,  Meanwhile, Ilya Ponomarev, another former Russian MP exiled in Ukraine and fellow critic of Putin, confirmed he had been on his way to meet Voronenkov before hearing news of his murder. “There are no words,” he wrote: Денис Вороненков убит в   у Премьер Паласа. Он шёл на встречу со мной. Нет слов. Охранник успел ранить  …     https:  .   —   Ilya Ponomarev (@iponomarev) March 23, 2017,  It will likely heighten tensions existent between Russia and the Ukraine since Putin illegally annexed Crimea in 2014. In his final interview with Radio Free Europe last month, Voronenkov compared Russia to “Nazi Germany” while denouncing the annexation of Crimea as “illegal” and a “mistake. ” “In Russia, there is a system of total fear,” Voronenkov said in the interview. “Like in George Orwell’s book [1984] right now these are times of total lies, when speaking the truth is [labeled] extremism. ” Voronenkov’s murder is one of a number of unexplained deaths of Russian dissidents in recent years. In February, thousands marched in the city of Moscow to commemorate the death of Russian opposition leader Boris Nemtsov, who was murdered outside the Kremlin two years ago. Other influential Russian figures have also died in mysterious circumstances during recent years, including former Putin adviser Mikhail Lesin, businessman Alexander Perepilichny, and FSB agent Alexander Litvinenko. All figures appeared to pose a threat to Russian governmental interests. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com.'"}, "time": 1742564065.4036064}