{"duration": 1.7389583587646484, "input_args": {"text": "\"Former DOJ Spokesman SLAMS ‘Inappropriate’ FBI Statement On Hillary Emails (TWEETS, VIDEOS) By Darrell Lucus   FBI director James Comey giving a briefing on the Orlando massacre ( image courtesy FBI’s Flickr feed, part of public domain) \\nOn Friday afternoon, FBI director James Comey sent the political world into a tailspin when he announced his agency had discovered emails that could potentially be related to the investigation of Hillary Clinton’s private email server. However, the manner in which he did it has the Department of Justice’s former chief spokesman up in arms . \\nRead part of the letter here, via NBC News’ Bradd Jaffy. FBI Director Comey, in letter to members of Congress, says FBI is investigating additional emails in Clinton private server case pic.twitter.com/Ue0qlhqT5w \\n— Bradd Jaffy (@BraddJaffy) October 28, 2016 \\nWhen Matthew Miller, the head of the DOJ’s office of public affairs from 2008 to 2011, learned about this letter, he hit the ceiling. In an epic tweetstorm, Miller slammed Comey’s decision to make this disclosure in the manner that he did. This is such an inappropriate public disclosure by Comey. And sadly the latest in a long string of them. https://t.co/8MgrH9UKlR \\n— Matthew Miller (@matthewamiller) October 28, 2016 Comey refused to even tell Congress if FBI was investigating Trump camp for Russia hack, but regular updates on Clinton are apparently A-ok. \\n— Matthew Miller (@matthewamiller) October 28, 2016 \\nEarlier this summer, Miller had criticized the tone of Comey’s press conference announcing that there was no basis for criminal charges against Hillary. In an op-ed for The Washington Post, Miller said that Comey’s decision to “editorialize” Hillary’s behavior was “not grounded in any position in law.” In his Friday tweetstorm, Miller blasted the FBI for sending details of the investigation to Congress. He flagrantly violated DOJ rules with his press conference. Then went on to break new ground discussing details of the case to Congress…2/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Followed by quickly releasing FBI 302's, something they rarely do, and which I doubt they will do for future high-profile cases. 3/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 \\nTo Miller’s mind, this paled in comparison to the decision to publicly disclose this latest discovery, given that we are less than two weeks from Election Day. But today's disclosure might be worst abuse yet. DOJ goes out of its way to avoid publicly discussing investigations close to election. 5/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Not just public discussion either. Often won't send subpoenas or take other steps that might leak until after an election is over…6/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Why? Because voters have no way to interpret FBI/DOJ activity in a neutral way. Who is the target of an investigation? What conduct? 7/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 This might be totally benign & not even involve Clinton. But no way for press or voters to know that. Easy for opponent to make hay over. 8/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Which takes us back to the original rule: you don't comment on ongoing investigations. Then multiply that times ten close to an election. 9/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 \\n\\nMiller’s hunch was confirmed later in the day as more details dribbled out. It turns out that the FBI discovered these emails while investigating former Congressman Anthony Weiner for inappropriate texts with a minor. The emails were found on a device Weiner shared with his estranged wife, longtime Hillary aide Huma Abedin. \\nAccording to NBC News’ Pete Williams, however, there doesn’t appear to be anything that even comes close to a smoking gun–at least for now. Williams discussed his findings on MSNBC on Friday afternoon; watch here, via Jaffy’s Twitter. NBC’s Pete Williams: Sr. officials say—During separate investigation “a device” led to add'l emails–not from Clinton https://t.co/QmmNoxXhOx \\n— Bradd Jaffy (@BraddJaffy) October 28, 2016 \\nWilliams went further in another MSNBC interview later in the afternoon; watch here. \\nWilliams believes that there are two questions–whether the number of emails changed, and whether anyone withheld evidence. His FBI sources tell him that those emails were not withheld by Hillary or her campaign. Moreover, the emails are not from Hillary. That raises the obvious question–was there any defensible reason to make such a disclosure? \\nMiller thinks there wasn’t, and told CNN’s Jake Tapper so later that afternoon. Watch here. \\nMiller said that longstanding DOJ practice calls for the department and its various agencies to avoid doing anything that could potentially influence the results of an election within 60 days of Election Day. When Tapper asked Miller if the FBI could have been accused of bias toward Hillary had Comey remained silent, Miller said he didn’t think so in this case because “there’s no information to be released.” That letter never disclosed what triggered this new review, and thus forces Hillary to “defend against a negative.” \\nUnderstandably, Hillary’s campaign wants to know that justified this disclosure from the FBI. Campaign chairman John Podesta issued a burning statement demanding answers from the FBI. Statement from @johnpodesta in response to Comey letter to GOP chairmen pic.twitter.com/egyUMl68ZC \\n— Brian Fallon (@brianefallon) October 28, 2016 \\nHillary herself called for an explanation as well while on the stump in Iowa. \\nUnless Comey is willing to give an explanation, I can only agree with Miller–this disclosure was grossly inappropriate. About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742564275.3391407}