{"duration": 0.21974611282348633, "input_args": {"text": "'Leonard Cohen, the Canadian poet and novelist who abandoned a promising literary career to become one of the foremost songwriters of the contemporary era, died on Monday at his home in Los Angeles. He was 82. Mr. Cohen’s record label, Sony Music, confirmed the death on Thursday night but provided no details on the cause. Adam Cohen, his son and producer, said Mr. Cohen had died “with the knowledge that he had completed what he felt was one of his greatest records. ” His final studio album, “You Want It Darker,” was released in October. “He was writing up until his last moments with his unique brand of humor,” his son said. Over a musical career that spanned nearly five decades, Mr. Cohen wrote songs that addressed  —   in spare language that could be both oblique and telling  —   themes of love and faith, despair and exaltation, solitude and connection, war and politics. More than 2, 000 recordings of his songs have been made, initially by the   singers who were his first champions, like Judy Collins and Tim Hardin, and later by performers from across the spectrum of popular music, among them U2, Aretha Franklin, R. E. M. Jeff Buckley, Trisha Yearwood and Elton John. Mr. Cohen’s   song may well be “Hallelujah,” a majestic, meditative ballad infused with both religiosity and earthiness. It was written for a 1984 album that his record company rejected as insufficiently commercial it was popularized a decade later by Jeff Buckley. Since then, some 200 artists, from Bob Dylan to Justin Timberlake, have sung or recorded it. A book has been written about it, and it has been featured on the soundtracks of movies and television shows and sung at the Olympics and other public events. At the 2016 Emmy Awards, Tori Kelly sang “Hallelujah” for the annual “In Memoriam” segment recognizing recent deaths. Mr. Cohen was an unlikely and reluctant pop star, if in fact he ever was one. He was 33 when his first record was released in 1967. He sang in an increasingly gravelly baritone. He played simple chords on acoustic guitar or a cheap keyboard. And he maintained a private, sometime ascetic image at odds with the Dionysian excesses associated with rock. At some points, he was anything but prolific. He struggled for years to write some of his most celebrated songs, and he recorded just 14 studio albums. Only the first qualified as a gold record in the United States for sales of 500, 000 copies. But Mr. Cohen’s sophisticated, magnificently succinct lyrics, with their meditations on love sacred and profane, were widely admired by other artists and gave him a reputation as, to use the phrase his record company concocted for an advertising campaign in the early 1970s, “the master of erotic despair. ” Early in his career, enigmatic songs like “Suzanne” and “Bird on the Wire”  —   quickly covered by   performers  —   gave him visibility. “Suzanne” begins and ends as a portrait of a mysterious, fragile woman “wearing rags and feathers from Salvation Army counters,” but pauses in the middle verse to offer a melancholy view of the spiritual: Mr. Cohen was inducted into the Rock and Roll Hall of Fame in 2008. Wearing a bolo tie and his trademark fedora, Mr. Cohen, in his acceptance speech, dryly made light of the fact that none of his records had ever been honored at the Grammys. “As we make our way toward the finish line that some of us have already crossed, I never thought I’d get a Grammy Award,” he said. “In fact, I was always touched by the modesty of their interest. ” Leonard Norman Cohen was born in Montreal on Sept. 21, 1934, and grew up in the prosperous suburb of Westmount. His father, Nathan, whose family had emigrated to Canada from Poland, owned a successful clothing store he died when Leonard was 9, but his will included a provision for a small trust fund, which later allowed his son to pursue his literary and musical ambitions. His mother, the former Masha Klonitzky, a nurse, was the daughter of a Talmudic scholar and rabbi. “I had a very messianic childhood,” Mr. Cohen would later say. In 1951, he was admitted to McGill University, Canada’s premier institution of higher learning, where he studied English. His first book of poetry, “Let Us Compare Mythologies,” was published in May 1956, while he was still an undergraduate. It was followed by “The   of Earth” in 1961 and “Flowers for Hitler” in 1964. Other collections would appear sporadically throughout Mr. Cohen’s life, including the omnibus “Poems and Songs” in 2011. A period of drift followed Mr. Cohen’s graduation from college. He enrolled in law school at McGill, then dropped out and moved to New York City, where he studied literature at Columbia University for a year before returning to Montreal. Eventually, after a sojourn in London, he ended up living in a house on the Greek island of Hydra, where he wrote a pair of novels: “The Favorite Game,” published in 1963, and “Beautiful Losers,” published in 1966. “Beautiful Losers,” about a love triangle whose members are devotees of a   Mohawk Indian Roman Catholic saint, gained a cult following, which it retains, and eventually sold more than three million copies worldwide. But Mr. Cohen’s initial lack of commercial success was discouraging, and he turned to songwriting in hopes of expanding the audience for his poetry. “I found it was very difficult to pay my grocery bill,” Mr. Cohen said in 1971, looking back at his situation just a few years earlier. “I’ve got beautiful reviews for all my books, and I’m very well thought of in the tiny circles that know me, but I’m really starving. ” Within months, Mr. Cohen had placed two songs, “Suzanne” and “Dress Rehearsal Rag,” on Ms. Collins’s album “In My Life,” which also included the   title song and compositions by Bob Dylan, Randy Newman and Donovan. But he was extremely reluctant to take the next step and sing his songs himself. “Leonard was naturally reserved and afraid to sing in public,” Ms. Collins wrote in her autobiography, “Sweet Judy Blue Eyes: My Life in Music” (2011). She recalled his telling her: “I can’t sing. I wouldn’t know what to do out there. I am not a performer. ” He was “terrified,” she wrote, the first time she brought him onstage to sing with her, in 1967. Mr. Cohen released his first album later that year, after being signed to Columbia Records by John Hammond, the celebrated talent scout who also signed Mr. Dylan and Bruce Springsteen. The record began with “Suzanne,” which was already being performed by folk singers everywhere thanks to the popularity of Ms. Collins’s version. It also included three other songs of great impact that would become staples of Mr. Cohen’s live shows, and that numerous other artists would record over the years: “Sisters of Mercy,” “So Long Marianne” and “Hey, That’s No Way to Say Goodbye. ” His second album, “Songs From a Room,” released early in 1969, cemented his growing reputation as a songwriter. “The Story of Isaac,” a retelling of the biblical tale of Abraham and Isaac, became an anthem of opposition to the war in Vietnam, and “Bird on the Wire” went on to be recorded by Joe Cocker, Aaron Neville, Johnny Cash and Willie Nelson. In 1971, Mr. Cohen released “Songs of Love and Hate,” which contained the cryptic and frequently covered “Famous Blue Raincoat,” but after that his production began to tail off, and his live performances became less frequent. He released three more albums during the 1970s but, amid bouts of depression, only two in the 1980s and one in the 1990s. The quality of his songs remained high, however: In addition to “Hallelujah,” future standards like “Dance Me to the End of Love,” “First We Take Manhattan,” “Everybody Knows” and “Tower of Song” date from that era. Mr. Cohen, raised Jewish and observant throughout his life, became interested in Zen Buddhism in the late 1970s and often visited the Mount Baldy monastery, east of Los Angeles. Around 1994, he abandoned his music career altogether and moved to the monastery, where he was ordained a Buddhist monk and became the personal assistant of Joshu Sasaki, the Rinzai Zen master who led the center. During the remainder of the decade, there was much speculation that Mr. Cohen, rather than merely taking a sabbatical, had stopped writing songs and would never record again. But in 2001, he released “Ten New Songs,” whose title suggests he wrote it while in the monastery. It was followed in 2004 by “Dear Heather,” an unusually upbeat album. In 2005, Mr. Cohen sued his former manager, Kelley Lynch, accusing her of defrauding him of millions of dollars that he had set aside as a retirement fund, leaving him with only $150, 000 and a huge tax bill and forcing him to take out a new mortgage on his home to cover his legal costs. The next year, after Ms. Lynch countersued, a judge awarded Mr. Cohen $9. 5 million, but he was unable to collect any of the money. The legal battles may have soured Mr. Cohen’s mood, but they did not seem to damage his creativity. In 2006, he published a new collection of poems, “Book of Longing,” which the composer Philip Glass set to music and then took on tour, with Mr. Cohen’s recorded voice reciting the words and Mr. Glass’s ensemble performing the music. In 2008, Mr. Cohen hit the road for the first time in 15 years for a grueling world tour, which would continue, with a few short breaks, through 2010. He was driven, he acknowledged, at least in part by financial necessity. “It was a long, ongoing problem of a disastrous and relentless indifference to my financial situation,” he told The New York Times in 2009. “I didn’t even know where the bank was. ” Combined with a pair of CDs and accompanying DVDs recorded in concert, “Live in London” and “Songs From the Road,” the constant touring, before audiences often larger than those he had enjoyed in the past, clearly eased Mr. Cohen’s financial problems. Billboard magazine estimated that the 2009 leg of the tour alone earned him nearly $10 million. Over that   period, Mr. Cohen performed nearly 250 shows, many of them lasting more than three hours. He seemed remarkably fit and limber, skipping across the stage, doing   bends and occasionally dropping to his knees to sing. The shows were not without incident: During a show in Valencia, Spain, in 2009, he fainted, and early in 2010 one segment of the tour had to be postponed when he suffered a lower back injury. He recovered, however, and in 2012 he released “Old Ideas,” his first CD of new songs in more than seven years, and embarked on another marathon tour. That pattern of extensive touring and recording continued into the decade. In 2014, for instance, Mr. Cohen released a CD of mostly new material, “Popular Problems,” as well as a     set called “Live in Dublin. ” Mr. Cohen never married, though he had numerous liaisons and several   relationships, some of which he wrote about. In addition to his son, Adam, his survivors include a daughter, Lorca, who like Adam is from his relationship with Suzanne Elrod, a photographer and artist who shot the cover of his 1973 album, “Live Songs,” and is pictured on the cover of his critically derided album “Death of a Ladies’ Man” (1977) and three grandchildren. Mr. Cohen was buried in Montreal on Thursday after a traditional Jewish memorial service. To the end, Mr. Cohen took a sardonic view of both his craft and the human condition. In “Tower of Song,” a staple of live shows in his later years, he brought the two together, making fun of being “born with the gift of a golden voice” and striking the same biblical tone apparent on his first album. “The changeless is what he’s been about since the beginning,” the writer Pico Iyer argued in the liner notes for the anthology “The Essential Leonard Cohen. ” “Some of the other great pilgrims of song pass through philosophies and selves as if through the stations of the cross. With Cohen, one feels he knew who he was and where he was going from the beginning, and only digs deeper, deeper, deeper. ”'"}, "time": 1742561772.2829864}