{"duration": 0.09822368621826172, "input_args": {"text": "'PALATINE, Ill.  —   Tall and sylphlike, an athlete with delicate features and a blond topknot, she changes clothes behind a privacy curtain in the girls’ locker room at her high school. But just being allowed to set foot in that locker room was a huge victory for the girl. She is transgender. She graduates in May  —   but the war over how to accommodate transgender students is far from over in her Chicago suburb. A new legal challenge is making its way through the courts. And a coalition of insurgent school board candidates, an evangelical church and conservative parents are looking to reshape district policy. The goal: preventing transgender girls and boys from sharing the bathrooms and locker rooms of their choice with other girls and boys, on the grounds that they are “the opposite biological sex. ” Their presence, the opponents argue, violates community standards of decency. They cast the issue as one of basic modesty, but the transgender student says it goes far deeper than that. “Really, nobody’s getting naked,” said the girl, who is identified as Student A in court papers and asked not to be named to protect her privacy. “This fear that trans people exist and should not have the right to exist. That’s the driving force here. ” The school board election is set for Tuesday, only days after lawmakers in North Carolina, mired in a battle of its own, repealed a state law restricting bathroom use in public buildings. In February, after a dispute among his own cabinet officials, President Trump reversed federal protections allowing transgender students to use the bathrooms of their choice, leaving those decisions to state and local authorities. That in turn prompted the Supreme Court not to take what advocates had hoped would be a defining transgender bathroom case. Student A has been a pioneer in Township High School District 211, which covers five schools in relatively affluent communities northwest of Chicago that have a patchwork of ad hoc policies for transgender students. She filed a complaint with the civil rights office of the federal Department of Education in 2013 that resulted in a 2015 settlement allowing her to use the girls’ locker room at William Fremd High School, in Palatine (and at other schools during school activities). The school had already been quietly allowing her to use the girls’ bathroom. But that agreement, essentially a contract between the district and the federal government, applies only to one person: Student A. It will expire when she graduates, making the district’s future policy unclear. Waiting in the wings: two transgender boys known as Student B, now in junior high, and Student C, a freshman at another high school, and a transgender girl identified as N. S. who has filed a state discrimination complaint. The township district settlement was one of several federal agreements on transgender students’ rights made under the Obama administration across the country in places like Summerville, S. C. and Broadalbin, N. Y. The repercussions are still playing out here. There is a slate of three insurgent candidates who oppose the district’s transgender practices, Ralph Bonatz, Katherine David and Jean Forrest, in the school board elections. The candidates call themselves Parents With Purpose, and if they win, they will probably tip the balance of the   school board to their side. In a campaign flier, the candidates said they would not allow restroom access “to students of the opposite biological sex. ” At a recent candidates’ forum, Ms. David said that she would represent “our community’s beliefs and values. ” Mr. Bonatz, describing himself as a “regular guy,” said the district should not be “compromising the   and dignity of 99 percent of the students. ” James Pittman Jr. pastor of New Hope Community Church, an evangelical congregation of about 50 active members in Palatine, has become a regular, along with members of his church, at school board meetings and candidates’ forums where transgender policy is discussed. Pastor Pittman has become a particularly effective foil against the argument often made that the transgender rights movement is heir to the civil rights movement. “I am black my family members are black,” he said in an interview in his church. “None of my family members nor friends would equate this movement to the civil rights movement. Matter of fact, that’s an insult. ” “We didn’t choose to be black,” he said, “and no matter what choice we make in the future, guess what? We’re still going to be black. ” A letter from the church says: “God created two distinct and complementary sexes in the very biology of the human race. A biological male is never female or vice versa. ” Many of the community members who oppose the school district’s transgender practices make a point of referring to transgender students by their birth sex, not by the sex that they identify with or that, in some instances, is written on their official documents. To them, Student A is a “he,” not a “she. ” The battle is also taking place in the courtroom. More than 50 families have signed on to a lawsuit filed in Federal District Court by the Alliance Defending Freedom, a conservative Christian advocacy group based in Arizona, arguing that district policy toward Student A violates students’ right to privacy. They say that girls in the locker room are in a constant state of anxiety over the possibility that they will see Student A undressed, or that she will see them. The American Civil Liberties Union has taken up the other side. Dan Harrington, one of the plaintiffs, put his daughter, Sarah, in a Christian school in the fall rather than send her to a District 211 high school. “Regardless of what he thinks he is, he’s still a male,” Mr. Harrington said of Student A. Like many of the opponents, Mr. Harrington and his daughter have not met the transgender students they are talking about. Sarah suspects, but is not sure, that one of the younger transgender boys was in her Girl Scout troop. They say they are sympathetic to the students, whom the plaintiffs’ lawyer, Gary McCaleb, describes as “sincerely confused. ” But, Mr. Harrington said, “we have a lifestyle that we want to live, a modest lifestyle, a wholesome lifestyle. ” Referring to Student A, Sarah said, “He can do whatever he wants to do it’s his life. ” But her father said that people “do not want to pay taxes for this particular violation of people’s rights. ” Another plaintiff, Vicki Wilson, said she was acting purely on principle, not out of any personal hostility. “I have a daughter who  —   can’t get her into a dress for the life of me,” she said. Girls who complained, she said, were “belittled and bullied. ” And she said she worried that some girls who had been sexually abused would have their trauma rekindled by transgender students in the locker room. Student A said the fuss had been magnified by parents. Her classmates, she said, have long perceived her as feminine. She always liked jewelry and began wearing girls’ jeans in sixth grade. “They almost create this fictitious being,” she said. “When you humanize the issue, it becomes a nonissue. ” Most people, she said, “forget I’m even trans. ” At her school, her identity is an open secret. At the candidates’ forum, Bradley Posdal, 19, a college freshman, sat in a row near the front. He graduated from Fremd last year and attended the forum because he wanted to be an “informed voter,” he said. But it was often hard for him to tell which candidate stood where on the transgender issue because both sides seemed to be speaking in code. “They repeated the word ‘privacy’ a lot  —   and ‘dignity,’” Mr. Posdal said. Yes, he said, he knows Student A. He has since middle school, where she was bullied. And, he said with a smile, they attend the same church. “At least among my friend group,” he said, “it’s pretty well accepted that nobody really cares. ”'"}, "time": 1742563655.5765064}