{"duration": 0.039708852767944336, "input_args": {"text": "'| August 23, 2015 at 9:39 pm | Reply \\nTo Pancho, I’m researching this material at about the same time you are and also have questions about the products talked about here that surround us every day that we had no idea came about this evil way. The information is devastating to our hearts. \\nJust want you to know that man looks at the outer appearances but God looks at the heart. (1 Samuel 16:7) So He sees your grief producing a repentant heart that will lead you turn away from sin and instead go the opposite way in your life. The Bible says it this way, “godly grief produces a repentance that leads to salvation without regret, whereas worldly grief produces death.” In other words, worldly grief doesn’t change us, but godly grief does. Further, Scripture says, “If we confess our sins, God is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.” (1 John 1:9) I don’t know your situation, but I wonder if you have you personally accepted the Lord. We personally need to receive God’s gracious gift of salvation knowing that Christ died in our place for our sins. The Bible says “if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. For with the heart one believes and is justified, and with the mouth one confesses and is saved. For the Scripture says: ‘Everyone who believes in him will not be put to shame.’” And a few verses later it says, “For everyone who calls on the name of the Lord will be saved.” (Romans 10:9-11, 13) \\nThe Bible tells us that it is not by our works that we are saved but by grace through faith. It’s not what we do, but what God has done through his son. In Ephesians 2, Paul says, “4 But God, being rich in mercy, because of the great love with which he loved us, 5 even when we were dead in our trespasses, made us alive together with Christ — by grace you have been saved — 6 and raised us up with him and seated us with him in the heavenly places in Christ Jesus, 7 so that in the coming ages he might show the immeasurable riches of his grace in kindness toward us in Christ Jesus. 8 For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, 9 not of works, so that no one may boast.” And here’s one more passage from Titus 3: “4 But when the goodness and loving kindness of God our Savior appeared, 5 He saved us, not because of works done by us in righteousness, but according to his own mercy by the washing of regeneration and renewal of the Holy Spirit, 6 whom he poured out on us richly through Jesus Christ our Savior, 7 so that being justified by his grace we might become heirs according to the hope of eternal life.” \\nI hope you get to see this and that it helps. Please reply if you have any more questions.'"}, "time": 1742562983.3649938}