{"duration": 0.0674293041229248, "input_args": {"text": "'Salman Abedi, the suicide bomber responsible for the Manchester Arena bombing Monday night which left 22 people dead and dozens injured, was reportedly the son of Libyan immigrants and was apparently radicalised while living in one of the country’s most heavily Muslim areas  —   an area that had   problems before. [Greater Manchester Police Chief Constable Ian Hopkins identified Abedi Tuesday as the man who detonated a bomb at the end of an Ariana Grande concert as   left the arena.  Multiple outlets, including The New York Times and the Daily Telegraph, reported that Abedi was born in 1994 in Manchester and was of Libyan descent.  The Telegraph reported that Abedi was the son of Libyan refugees who fled the regime of dictator Muammar Gadaffi. Gadaffi was killed by rebels in 2011 and the Telegraph cited reports that Abedi’s family had returned to Libya  —   but Abedi remained. Police raided Abedi’s house in Fallowfield, South Manchester Tuesday. Fallowfield is the home of a large student population, being a short bus ride away from the main Manchester University campus, and just three miles from Manchester’s city center.  South Manchester as a whole has a large Muslim population, often gathered in very small areas and raising questions about the risks that a lack of assimilation can bring. According to 2011 census data, 20 percent of Fallowfield’s population was Muslim. But nearby areas are even more concentrated. Rusholme, a few minutes walk from Fallowfield, had a 37. 9 percent Muslim population in 2011, while nearby Longsight had a 53. 8 percent Muslim population.  That data does not account for any increases in the Muslim population in the last six years. Nearby Rusholme is known for its famous “curry mile,” a series of South Asian and Middle Eastern restaurants populating one of the city’s main roads  —   a road annually brought to a standstill by traffic during the Muslim celebration of Eid.  The Telegraph also noted that Abedi grew up in an area where two girls from a nearby school left their homes in 2015 to live in   Syria. The Guardian reported that what it called “Manchester’s Libyan community” had   problems before.  Abdalraouf Abdallah, 24, was jailed for nine and a half years last year after being convicted of funding terrorism and preparing acts of terrorism. Abdallah had helped a number of men travel to Syria so they could fight in the civil war. He was unable to travel himself because he is paralysed from the waist down after being shot during the Libyan revolution. One of the people he helped to send to Syria was Stephen Gray, who had converted to Islam after leaving the air force in 2004. He was jailed for nine years after pleading guilty to terrorist offences. A family friend told the Guardian that Abedi and Abdallah knew each other. A neighbour told The New York Times that the family frequently flew a Libyan flag outside the window, while a school friend told the Daily Mail that Abedi had recently grown a beard, and was “acting strange. ” Abedi was also reported to have been praying loudly in Arabic in the street. “They were a Libyan family. A couple of months ago he was chanting the first kalma [Islamic prayer] really loudly in the street. He was chanting in Arabic. He was saying ‘There is only one God and the prophet Mohammed is his messenger’ a neighbor told the Mail. ‘They dressed very traditionally, in Islamic clothes. The mother used to wear a headscarf,” another said. The Washington Post reported that Abedi’s brother had been taken into custody. Details of Abedi’s background come amid reports that he was already known to security services, but authorities concluded that he did not mark an immediate threat. It seems that local authorities are unlikely to move quickly on any problems with assimilation. Labour Party candidate Afzal Khan, who is campaigning to be the Member of Parliament for the area in which Abedi lived, told reporters hours before the bombing: I don’t think immigration is a problem  …     It has transformed Manchester into a world class city. ”  Afzal Khan says ”I don’t think immigration is a problem  …     It has transformed Manchester into a world class city” #gorton hustings,  —   Helen Pidd (@helenpidd) May 22, 2017,  Greater Manchester Police Chief Constable Hopkins, in his remarks after the bombing, seemed less concerned with the threat of a lack of assimilation in   communities and more concerned with a     Islamophobic backlash. “We understand that feelings are very raw right now and people are bound to be looking for answers. However, now, more than ever, it is vital that our diverse communities in Greater Manchester stand together and do not tolerate hate,” he told reporters. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628305.4804401}