{"duration": 0.07481718063354492, "input_args": {"text": "'The WRH server is back to normal (except for the hack attacks). THOUGHT FOR THE DAY! \"When buying shares, ask yourself, would you buy the whole company?\" -- Rene Rivkin YOUR RANDOM DHS MONITORED PHRASE OF THE DAY DERA \\nPaid advertising at What Really Happened may not represent the views and opinions of this website and its contributors. No endorsement of products and services advertised is either expressed or implied. \\nHOW TO HAVE HONEST ELECTIONS \"It is enough that the people know there was an election. The people who cast the votes decide nothing. The people who count the votes decide everything.\" -- Joseph Stalin \\nFollowing the Florida election debacle of 2000, Americans were promised a more honest, transparent, and verifiable system of elections. We didn;t get it, because the elkection stealers won that election and decided that keeping the current system was their best guaarantee of re-election. \\nThe election of 2016 changed that. The candidate being cheated by the system, Donald Trump, still prevailed thanks to a landslide that overcame the vote rigging. He will see having an honest election system as his best chance for a second term. Hence, there is a real opportunity to throw out the current system, whch is designed to encourage stealing elections, and replace it with a system that hinders cheating as much as possible. \\nTo begin, stolen elections are a reality in this nation. John F. Kennedy stole the 1960 election from Richard Nixon. Nixon stole his re-election in what becvame known as the Watergate scandal. George W. Bush likely stole the 2000 election from Al Gore, and everyone had a ring-side seat watching Hillary Clinton trying to steal the election from Donald Trump. \\nA good place to start to learn about election stealing is the HBO documentary, \"Hacking Democracy.\" It is available on NetFlix, Amazon Live, and Hulu. Here is a YouTube video of the final scenes showing how an electronic voting machine has the election results changed without even needing to touch the machine! \\nFor more information, please visit http://blackboxvoting.org/ , the website operated by Bev Harris, who is featured in the HBO documentary. \\nNow then, I wish to offer a suggestion for a very simple way to have an open and honest election system. It is not 100% foolproof, but is designed to make it very difficult for cheating to happen and difficult to conceal it. This stands in sharp contrast to the current system, which is designed to facilitate and conceal the manipulation of elections. \\nFirst, some basic rules. \\n1. No electronic machines! \\n2. No central tabulation centers! \\nEveryone who votes must have ID to prove they are a US citizen and eligable to vote. Absentee ballots are only given to those who can prove they are unable to vote in person. \\nAfter the voters vote, their finger is marked with ink that takes a week to fade away, to prevent them from voting more than once. \\nAll voting is done on paper ballots. When the polls close, the precincts hand-count the ballots in full view of witnesses, and verify the accuracy. All paper ballots are to be stored for an entire year after the election. \\nThe totals for that polling place are posted for all to see and copies provided to all witnesses. \\nIn the city newspaper the next day, all the totals for all the city precincts are printed, along with totals for the state. This allows everyone to first verify that their precinct totals were reported accurately, and to verify the math leading to the city totals for themselves. \\nNow, we move up a level! The state newspapers print all the city totals, and again the totals for the state. This allows everyone to first verify that their city totals were reported accurately, and to verify the math leading to the state totals for themselves. \\nFinal level: The national newspapers print all the state totals, and tally up the winners. This allows everyone to first verify that their state totals were reported accurately, and to verify the math leading to the national totals for themselves. \\nWhat this does is create a system where there are literally millions of Americans watching and verifying the vote counts from polling place to final totals. Yes, it is a bit slower than the instant-guessing on TV, but that will prevent the corporate media from using \"projections\" to try to discourage voters of unfavored candidates from heading to the polls. There is in fact no law that says the winners of the elections have to be announced immediately, and certainly most Americans are willing to trade speed for accuracy in such an important matter. In the early days of this nation, prior to the telegraph, it would take weeks for the populace to learn who won the elections! \\nAs I said, this is not a 100% perfect system. It is only as good as the people running it. But it does make stealing elections very difficult and that should always be the design objective of any election system! SHARE THIS ARTICLE WITH YOUR SOCIAL MEDIA'"}, "time": 1742563040.560127}