{"duration": 0.11734151840209961, "input_args": {"text": "'Ever wonder how Britain’s most iconic pop pianist gets through a long flight? Here are the six pictures of sharks Sir Elton John likes to stare at to pass the time on an airplane. 1. A Shark Swimming \\nSit next to Elton John on a flight and you’ll see a man living in the lap of luxury, as he immediately tapes this photo of a shark darting through the ocean over his window to stare at throughout the trip. The platinum-selling artist has been known to pull his window shade down to make the shark disappear, and then quickly retract it to mark the animal’s triumphant return. He will often repeat this act dozens of times per flight. 2. A Great White Shark Leaping Into The Air \\nWhen you’re an international pop sensation worth an estimated $450 million, people go the extra mile to make you happy. Flight crews are instructed to place this photo of a breaching great white in Elton John’s seat-back pocket before he even boards the plane. The five-time Grammy winner loves to pull the image out at his leisure to stare at while flying, sometimes holding it a mere 3-to-4 inches away from his face while he fixates upon the shark’s beady eyes. 3. A Shark On The Prowl \\nRumor has it Elton John first acquired this shark photo in 1997, just before flying to London to perform “Candle In The Wind” at Princess Diana’s funeral. It’s been a staple of his travel routine ever since. Those who have flown with the music legend say that Sir Elton turns on every single overhead light in his row to study this picture with a magnifying glass. 4. Two Hammerhead Sharks \\nHow does the man behind “Tiny Dancer” and “Rocket Man” handle turbulence as his plane traverses the Atlantic? Once that “Fasten Seat Belts” sign lights up, this picture of two hammerhead sharks comes out. Elton John holds the photo in a tight vice grip and stares straight at it until the turbulence passes, often without blinking for minutes at a time. 5. The Poster For Jaws \\nSir Elton John absolutely adores the poster for Steven Spielberg’s Jaws and hopes to one day see the film. In the meantime, the British icon makes do by slowly unfolding his 24-by-36-inch copy of the poster whenever he’s on a long flight, gently tracing the shark’s teeth with his finger as he stares lovingly into its gaping mouth. 6. Pilot’s Choice \\nAs much as Elton relishes in the calming regularity of his shark picture rotation, he also loves the excitement of gazing upon a totally unexpected shark when flying from London to a distant corner of Europe. That’s why all pilots who fly Sir Elton print out a shark picture of their choice from their home computers before going to the airport, and hand it to the visibly excited musician prior to takeoff. So yeah—it’s good to be Elton!'"}, "time": 1742561612.9776595}