{"duration": 0.09438538551330566, "input_args": {"text": "'Good morning. Here’s what you need to know: • The Trump administration took shape. The Transportation Department, the focus of   Donald J. Trump’s pledge to spend billions on infrastructure, will be led by Elaine Chao. Ms. Chao is a former labor secretary and is married to the Senate’s top Republican, Mitch McConnell. Tom Price, a   Republican congressman from Georgia who is a chief critic of President Obama’s health care initiative, will oversee its future. Steven Mnuchin, a former Goldman Sachs partner who has worked in hedge funds and Hollywood finance, is Mr. Trump’s expected choice for Treasury secretary. _____ • Mr. Trump, who has been communicating with the public through social media rather than news conferences, proposed two unconstitutional measures in a single tweet: forbidding the burning of the American flag, a right under free speech, and stripping the culprit of citizenship. _____ • Austria could elect Norbert Hofer, above, as the first   head of state in   War II Europe on Sunday, in what could be yet another victory for populists on the Continent. As support for   parties is rising across Europe, new research suggests that people have become more critical of democracy. “The warning signs are flashing red,” one scholar said. And another tectonic shift is coming to the European order: leaders are increasingly seeking to accommodate a resurgent Russia. _____  • The ferocious offensive in eastern Aleppo, in Syria, has forced some 16, 000 people to flee for their lives in the last few days, a United Nations official said. Leaflets warned inhabitants: “If you don’t leave these areas quickly you will be annihilated. ” John O. Brennan, the C. I. A. director, accused Russia of “disingenuous” negotiating tactics in Syria in an interview with the BBC. He also warned that scrapping the Iran nuclear agreement would be “the height of folly. ” _____ • A handful of people survived after a plane crashed outside Medellín, Colombia, killing many members of Chapecoense, a Brazilian soccer team, and journalists traveling with them. Plane crashes can be uniquely devastating when a sports team is on board. Here’s a look at other crashes, including one that involved the Manchester United team in 1958. _____ • Our correspondent returned to the Egyptian port city of Alexandria to find a place where despair had displaced the hope and anticipation of the 1960s. The country’s parliament endorsed a law regulating nongovernmental organizations that human rights groups say effectively bans their work. _____ • The price of oil fell ahead of today’s OPEC meeting, where the rivalry between Saudi Arabia and Iran may sink a possible agreement to curb production for the first time in eight years. • Volkswagen has failed to reach a settlement with some American customers over its emissions scandal. A hearing set for today has been postponed to  . • Drug regulators in the U. S. approved   clinical trials to study MDMA, the illegal party drug better known as Ecstasy, as treatment for   stress disorder. • The Bank of England said that the outlook on Britain’s financial stability “remains challenging. ” The Royal Bank of Scotland failed a stress test. •  Here’s a snapshot of global markets. • Germany arrested an employee of its domestic intelligence agency. The man is accused of posting Islamist messages online and sharing secrets. [Reuters] • The Five Star Movement, the Italian party campaigning against changes to the country’s Constitution in a referendum on Sunday, has been tied to online outlets that spread conspiracy theories. [BuzzFeed] • The Islamic State claimed the attack on Monday at Ohio State University, calling the   American student, seen here in a recent photo, who ran over people with a car and knifed others “a soldier. ” [The New York Times] • Britain’s new surveillance law took effect. It requires web and phone companies to store a year of personal browsing data to which the authorities will have unprecedented access. [The Guardian] • A former youth coach has been charged with eight counts of child sexual assault over a scandal that has shaken English soccer. [The New York Times] • A vast arched shelter slid into place over the Chernobyl nuclear disaster site in Ukraine, intended to protect against any additional spewing of toxic material for a century. [The New York Times] • The U. S. and China overtook Russia in space launches this year. [Moscow Times] • Leave or be driven out: Residents of coastal villages in Alaska are grappling with difficult decisions on how and when to relocate in the face of flooding and erosion linked to climate change. The state is warming twice as fast as the rest of the United States, pushing it to the forefront of adaptation. • Die Antwoord, the confrontational South African   musicians, have become something entirely unexpected: Hollywood. • Germany, the land of beer, riesling and schnapps, has gone gin mad. • The Times first prepared a report on the death of Fidel Castro in 1959. It has since cost us more hours than any other obituary we’ve ever run. • And at a moment when technology has made cultivating relationships easier, but also shallower, one writer considers the importance of true friendships. We told you last week about Lee   a deaf South Korean tennis player who is ranked 143rd in the world, a notable achievement in the sport’s professional era. But a keen reader informed us that more than 100 years ago, a British player who lost her hearing was also a champion. Charlotte Cooper Sterry was a rising star at a time when female players wore dresses and used wooden rackets. Her style of attacking the net and serving overhand were rare then. A year after winning her first Wimbledon title in 1895, she went completely deaf  —   why is not clear. But Ms. Sterry won the tournament (it was for amateurs only back then) four more times as well as an Olympic gold medal in 1900. Ms. Sterry played into her 40s and died in 1966 at age 96. Her achievements were soon eclipsed in history by players like Helen Wills Moody of the United States, who also won many Wimbledon titles, including four consecutively from 1927 to 1930. In that stretch, she lost just one set at the tournament: in 1927 to Ms. Sterry’s daughter. “Who is this Miss Sterry?” a Times article reported stunned spectators asking. An agitated man revealed the older Ms. Sterry’s feats. He added, “Look up your records, you ignorant scriveners. ” Sean Alfano contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742562550.8687708}