{"duration": 0.07624316215515137, "input_args": {"text": "'PENNSYLVANIA GUN STORE tells customers “Muslims and Hillary supporters are not welcome” An advertisement for ALTRA FIREARMS warns potential customers that Muslims and supporters of Hillary Clinton, who are “terrorists” in the store’s parlance, are not welcome. â\\x80\\x9cPlease NO Muslims or Hillary Supporters â\\x80\\x94 We do not feel safe selling to terrorists!â\\x80\\x9d Altra Firearms in Jackson Center, Pennsylvania advertised in local papers this week.Â TalkingPointsMemo Â The â\\x80\\x9cPolitically Incorrect Firearmsâ\\x80\\x9d store also invited readers to â\\x80\\x9cVisit our underground bunker and speak with our unique and deplorable sales associates.â\\x80\\x9d Altra Firearms’ owner Paul Chandler, 54, told TPM Friday that heâ\\x80\\x99s had a sign in front of his store advertising that supporters of President Obama arenâ\\x80\\x99t welcome to come inside, either. â\\x80\\x9cWe did have, in three-foot letters, â\\x80\\x98No radical Muslims,â\\x80\\x99 but I changed that to â\\x80\\x98No Muslims,â\\x80\\x99 period,â\\x80\\x9d Chandler said in a phone interview, noting rhetoric from Iranian television motivated the change. â\\x80\\x9cTheyâ\\x80\\x99re saying that America is the great Satan and itâ\\x80\\x99s got to be destroyed. Theyâ\\x80\\x99re basically teaching that if itâ\\x80\\x99s an infidel, either they convert or kill them. And thatâ\\x80\\x99s what theyâ\\x80\\x99re doing in our country now,â\\x80\\x9d he said, comparing the actions of modern Islamic nations to the expansion of Muslim influence into Europe before the Crusades.Â â\\x80\\x9cIf the gun store in Florida wouldnâ\\x80\\x99t have sold to that man, thereâ\\x80\\x99s be 40 or 50 more people alive,â\\x80\\x9d he continued, referring to Omar Mateen, who killed 49 people in Orlando when he opened fire in an LGBT nightclub.Â PA gun store ad: \"please no Muslims or Hillary supporters. We do not feel safe selling to terrorists\" pic.twitter.com/yPqAsd5MsO \\n— Dorey Scheimer (@DoreyScheimer) October 27, 2016 Chandler told TPM he’s never actually denied service to any Muslims or Clinton supporters, although he said he’d told one woman with an Obama bumper sticker on her car that the store was closed. He also said he’d denied service to one man who told him â\\x80\\x9cI hate niggers, I want a gun.â\\x80\\x9dÂ Chandler said he didnâ\\x80\\x99t extend the same blanket ban to potential Christian customers after a series of abortion clinic bombings years ago because â\\x80\\x9chundreds of Christian preachers got up and said â\\x80\\x98that is wrong.â\\x80\\x99” â\\x80\\x9cDo you hear any Muslim clerics condemning what is going on today?â\\x80\\x9d he asked. â\\x80\\x9cI havenâ\\x80\\x99t heard one.â\\x80\\x9d In 2015, designated terrorist group CAIR (Council on American-Islamic Relations) sued a different store in Florida ( FLORIDA GUN SUPPLY ) which declared itself a ‘Muslim Free Zone’ but the case was dismissed.'"}, "time": 1742562051.923705}