{"duration": 0.05916333198547363, "input_args": {"text": "'Getty - Michael Loccisano, Mike Nelson \\nDespite the fact that Hillary Clinton is the one running for president, as the election looms ever closer, new details continue to emerge about former President Bill Clinton — particularly regarding his alleged affairs and sexual assaults. \\nGennifer Flowers has long claimed that she engaged in a consensual affair with the former president while he was still governor of Arkansas. The affair lasted some 12 years, according to Flowers, who refers to her former boss as “the love of her life.” \\nWhen she first went public with allegations of the affair, she provided the press with a series of tape-recorded phone calls as evidence. But there was something else in that alleged audio, something that was all but overlooked until Flowers gave a new interview this past week to Breitbart\\'s Aaron Klein. \\nIn the midst of several conversations regarding a lawsuit alleging that Clinton had engaged in numerous affairs, Flowers also recorded a brief exchange referencing her job. \\nThe job wasn\\'t anything special on the surface — a clerical position working for the state of Arkansas, making around $17,000 per year. Flowers secured the job just over a year prior to Clinton\\'s run for the presidency. \\nBut prior to getting the job, Flowers sent a letter in which she told Clinton about her financial troubles. The National Memo reported on the contents of that letter: \\n\"Gennifer wrote Clinton again on February 25. \\'Since we were unable to connect by phone,\\' the letter began, \\'I thought I should drop you a note.\\' Flowers complained that Gaddy hadn’t been very successful in helping her and that her financial situation was dire. She enclosed a copy of her lawyer’s letter threatening to sue the radio station, and closed by asking Clinton to \\'Please, be in touch.\\' \\nThree months later, Gaddy sent Flowers to the Arkansas Merit System to be tested for an administrative assistant position that paid $17,524.\" \\nAs Clinton prepared his campaign for the presidency, he and Flowers spoke again on the phone — after a woman in her office had complained that she was more qualified for the job — and Flowers again allegedly recorded their conversations : \\nGF – But anyway, then Wednesday, there was a grievance filed in my office when I got the job by a girl who felt like she should have gotten it, a black girl named (deleted). And they called me as a witness. So I go in and uh, nothing big came of it. It’s just that they were questioning me about how I found out about the job. And I said, “Well, that personnel said it that it was a possibility there would be a position,” and then uh, “they told me that it would be advertised in the newspaper. And it was and I pursued it from there.\" \\nBC – Good for you. \\nGF – Well the only thing that concerns me, where I’m, where I’m concerned at this point is the state job. \\nBC – Yeah. I never thought about that, but as long as you say you’ve just been looking for one, you’d uh, check on it. If they ever asked if you’d talked to me about it, you can say no. \\nGF – Well and I would. But I’m… here is the thing I’ve got to consider, too, is I’ve gotta go in there to work every day. You know what I mean? \\nBC – Yep. \\nGF – And if, and if these people start talking or someone in the press… \\nBC – Well, have they been nice to you there? \\nGF – Yeah they have been. But I don’t, you know, I mean, I just want you to know what’s going on. And I’ll be glad to hang in there. \\nBC – Has the, has the… \\nGF – But if it gets real… \\nClinton did eventually admit to having sexual relations with Flowers, though he insisted there had only been a single encounter. \\nFlowers, who has never been a fan of Hillary Clinton\\'s, has come out in recent months in support of Donald Trump. She was one of the women Trump invited to sit in the front row during the debates in an effort to make the Clintons uncomfortable. \\nYou can listen to Klein\\'s interview with Flowers below: '"}, "time": 1742562654.8446}