{"duration": 0.04363393783569336, "input_args": {"text": "'. ABC News Caught Staging Fake Crime Scene ABC News has been caught staging a fake “crime scene” for reporter Linsey Davis to report from in a ... Print Email http://humansarefree.com/2016/11/abc-news-caught-staging-fake-crime-scene.html ABC News has been caught staging a fake “crime scene” for reporter Linsey Davis to report from in a segment broadcast on Good Morning America. Viewers were presented with the sight of Davis standing in front of yellow police tape with the words “SHERIFF’S LINE DO NOT CROSS” and ABC News, reporting from the site for hours, claimed Davis was in the middle of an active crime scene.But she wasn’t. The ABC News report had more in common with a Hollywood production than a breaking news report.Linsey Davis was actually standing in a field in Woodruffe, South Carolina – not at the crime scene she was claiming to be reporting from.Sources with knowledge of the matter say the sheriff’s tape was placed there by the ABC News crew for the purpose of its inclusion in the live shot.A photo leaked by an anonymous source shows the sheriff’s tape running no more than 30 yards – and tied at both ends to ABC News camera stands. Busted – and ABC know it. “This action is completely unacceptable and fails to meet the standards of ABC News,” said Julie Townsend, the vice president of communications at ABC News. “As soon as it was brought to our attention, we decided to take the producer out of the field, and we’re investigating further.” Fake Sheriff’s Tape, Fake News But ABC News’ recent behavior gets even worse. While they are spending money and resources on faking crime scenes to set their viewers’ pulses racing, they have also been exposed misleading their audience about real news.After ignoring the bombshell news that the FBI has been conducting an active investigation into the Clinton Foundation for more than a year, Good Morning America on Friday finally realized they couldn’t continue ignoring the story without losing credibility.So they covered the story. But only for 40 seconds and only to dismiss it as “inaccurate and “unsubstantiated.” CBS This Morning’s Major Garrett followed up by chiding “unconfirmed speculation.”On Good Morning America, correspondent Tom Llamas continued the misleading angle. “With just four days to go, Trump in full attack mode against Hillary Clinton, sending his crowds into a frenzy with these unsubstantiated reports ABC News sources say are inaccurate.” How can anybody trust these exposed liars anymore? Deceit and manipulation are fundamental to mainstream media operations these days. Evidence that the Main Stream Media is fabricating news for propaganda reasons:'"}, "time": 1742564419.932495}