{"duration": 0.12442183494567871, "input_args": {"text": "'WASHINGTON  —   President Trump provoked a rare public dispute with America’s closest ally on Friday after his White House aired an explosive and unsubstantiated claim that Britain’s spy agency had secretly eavesdropped on him at the behest of President Barack Obama during last year’s campaign. Livid British officials adamantly denied the allegation and secured promises from senior White House officials never to repeat it. But a defiant Mr. Trump refused to back down, making clear that the White House had nothing to retract or apologize for because his spokesman had simply repeated an assertion made by a Fox News commentator. Fox itself later disavowed the report. The rupture with London was Mr. Trump’s latest quarrel with an ally or foreign power since taking office. Mexico’s president angrily canceled a White House visit in January over Mr. Trump’s proposed border wall. A telephone call with Australia’s prime minister ended abruptly amid a dispute over refugees. Sweden bristled over Mr. Trump’s criticism of its refugee policy. And China refused for weeks to engage with Mr. Trump because of his postelection call with Taiwan’s president. Mr. Trump’s strained relations with Europe, which has viewed his ascension to power with trepidation, were fully on display on Friday, not just in the British spy flap but also in the venue in which it was addressed. The president was hosting for the first time Chancellor Angela Merkel of Germany, who is seen by many Europeans as the most important champion of the liberal international order. Though polite, the two leaders seemed stiff and distant during their public appearances. European news outlets and social media made much of the fact that she suggested a handshake for photographers in the Oval Office and he did not respond, although it appeared that he did not hear her. Either way, the two were clearly on separate pages on issues like immigration and trade. The angry response from Britain stemmed from Mr. Trump’s persistence in accusing Mr. Obama of tapping his phones last year despite the lack of evidence and    denials. At a briefing on Thursday, Sean Spicer, the White House press secretary, read from a sheaf of news clippings that he suggested bolstered the president’s claim. Among them was an assertion by Andrew Napolitano, a Fox News commentator, that Mr. Obama had used Britain’s Government Communications Headquarters, the agency known as the GCHQ, to spy on Mr. Trump. In response to Mr. Spicer, the agency quickly denied it as “nonsense” and “utterly ridiculous,” while British officials contacted American counterparts to complain. “We said nothing,” Mr. Trump told a German reporter who asked about the matter at a news conference with Ms. Merkel. “All we did was quote a certain very talented legal mind who was the one responsible for saying that on television. I didn’t make an opinion on it. ” He added: “You shouldn’t be talking to me. You should be talking to Fox. ” The president tried making a joke about it, turning to Ms. Merkel, who was angered during Mr. Obama’s administration by reports that the National Security Agency had tapped her cellphone and those of other leaders. “At least we have something in common, perhaps,” Mr. Trump said. She made a face that suggested she had no interest in getting involved. After the news conference, Mr. Spicer echoed Mr. Trump’s unapologetic tone. “I don’t think we regret anything,” he told reporters. “As the president said, I was just reading off media reports. ” Shortly afterward, Fox backed off Mr. Napolitano’s claim. “Fox News cannot confirm Judge Napolitano’s commentary,” the anchor Shepard Smith said on air. “Fox News knows of no evidence of any kind that the now president of the United States was surveilled at any time, any way. Full stop. ” Mr. Trump’s unremorseful tenor further stunned British officials, who thought they had managed to contain the matter. Kim Darroch, the British ambassador to the United States, had raised the matter on Thursday night with Mr. Spicer at a St. Patrick’s Day reception in Washington. Mark Lyall Grant, the national security adviser to Prime Minister Theresa May of Britain, had contacted his American counterpart, Lt. Gen. H. R. McMaster. On Friday morning, a spokesman for Mrs. May said the White House had backed off the allegation. “We’ve made clear to the administration that these claims are ridiculous and should be ignored,” the spokesman said, on the condition of anonymity in keeping with British protocol. “We’ve received assurances these allegations won’t be repeated. ” But White House officials, who also requested anonymity, said Mr. Spicer had offered no regret to the ambassador. “He didn’t apologize, no way, no how,” a senior West Wing official said. The officials said they did not know whether General McMaster had apologized. The furor underscored the continuing troubles for the White House since Mr. Trump first accused Mr. Obama of tapping his phones, an allegation refuted by intelligence agencies as well as Republican and Democratic officials. Even as Mr. Trump refused to back down, fellow Republicans appeared increasingly irritated by what they see as a distraction from their policy goals. Representative Tom Cole of Oklahoma said on Friday that Mr. Trump had not proved his case and should apologize to Mr. Obama. “Frankly, unless you can produce some pretty compelling truth, I think President Obama is owed an apology,” Mr. Cole told reporters. “If he didn’t do it, we shouldn’t be reckless in accusations that he did. ” The conspiracy theorizing also tested what is often called the special relationship between the United States and Britain. American intelligence agencies enjoy a closer collaboration with their British counterparts than any other in the world. GCHQ was the first agency to warn the United States government that Russia was hacking Democratic Party emails during the presidential campaign. Foreign policy analysts expressed astonishment that Mr. Trump would so cavalierly endanger that partnership. “It illustrates the extent to which the White House really doesn’t care what damage they do to crucial relationships in order to avoid admitting their dishonesty,” said Kori Schake, a former national security aide to President George W. Bush now at Stanford University’s Hoover Institution. “America’s allies are having to protect themselves against being tarred with the White House’s mendacity. ” Eric S. Edelman, an under secretary of defense under Mr. Bush, has written about the stresses between the United States and Britain in recent years. “I hope that this latest episode doesn’t drive a stake through the heart of the strongest remaining element of   partnership,” he said. Julianne Smith, who was a deputy national security adviser to Vice President Joseph R. Biden Jr. said Mr. Trump did not appear to realize how much American intelligence agencies depend on Britain in dealing with threats around the world. “He will probably live to see the day when he will regret firing off such an egregious insult to Britain and then failing to apologize for it,” she said. The issue clearly touched a nerve at GCHQ, which usually refuses to comment on intelligence matters. Its vehement response surprised British officials and analysts. Dominic Grieve, the intelligence committee chairman in Parliament, pointed to elaborate safeguards that prevent spying on the United States and require “a valid national security purpose” for any monitoring. “It is inconceivable that those legal requirements could be met in the circumstances described,” he said. Tim Farron, the leader of the Liberal Democrats, the junior partner in the last British coalition government, described Mr. Spicer’s repetition of the claims as “shameful” and said Mr. Trump was “compromising the vital U. K. . S. security relationship to try to cover his own embarrassment. ” Downing Street evidently wanted to avoid adding to any embarrassment in Washington while making it clear that Britain had no part in any such wiretapping. But in rebuffing that effort, Mr. Trump showed that Mrs. May, who was the first foreign leader to visit the White House after his inauguration, may not have forged the bond she had hoped, analysts said. “It’s very easy to have a good meeting with Trump,” said Jeremy Shapiro, a former State Department official who is the research director at the European Council on Foreign Relations in London. “He’s very pleasant in person. He’ll promise you the world. And 48 hours later, he’ll betray you without a thought. He won’t even know he’ll be betraying you. ”'"}, "time": 1742561959.308811}