{"duration": 0.10297083854675293, "input_args": {"text": "'\\nBy Jake Anderson\\nAnomalous signals from deep space often evoke a quick pulse of gossip and speculation about aliens that dies off soon thereafter, when scientists are able to explain it. Usually, the explanation involves a natural cosmic process — an asteroid, space detritus, or frequencies from an exploded star.\\nSometimes, however, the signals are too mysterious to explain. There’s a reason why you may have seen a sustained social media buzz regarding aliens this past week. A few days ago, two scientists from Laval University in Quebec released a paper arguing they may have just received our first communication from extraterrestrials.\\nFirst, a bit of context. This has been an exciting decade for those of us who stargaze in awe, wondering how many sentient beings live in this incomprehensibly enormous universe of ours. First, the search for exoplanets accelerated dramatically, aided by the Kepler telescope, which has identified over 1,000 planets outside of our solar system.\\nWhile scientists have long known that our Milky Way galaxy alone probably contains several hundred billion planets , the ability to study them had eluded us until fairly recently (this ability will be exponentially augmented when the James Webb telescope allows us to analyze exoplanets’ atmospheres and search for traces of industrial gasses). Additionally, the discovery of Earth-like exoplanets — some of which are conceivably close enough to visit in a few decades — has tantalizing ramifications for our near future human race.\\nEarlier this year, scientists announced the incredible observation of a series of inexplicable brightness frequencies from the star KIC 8462852, which led many to speculate the signals could have been originating from a Dyson sphere , a theoretical megastructure by which an advanced alien race (a Kardschez type 2 civilization ) could harness the power of its sun. The newest discovery from this star has made it even more unlikely that the signals are from natural causes.\\nThe newest strange signals hail from a gaggle of some 234 stars identified by the Sloan Digital Sky Survey, which analyzed the spectra of 2.5 million stars. E.F. Borra and E. Trottier, the two astronomers who discovered the anomalies, discussed them in their paper , which was originally titled “Signals probably from Extraterrestrial Intelligence.”\\n“We find that the detected signals have exactly the shape of an [extraterrestrial intelligence] signal predicted in the previous publication and are therefore in agreement with this hypothesis,” they wrote.\\n“The fact that they are only found in a very small fraction of stars within a narrow spectral range centered near the spectral type of the sun is also in agreement with the ETI hypothesis.” \\nOf course, it is far from certain that these are actual alien messages. In an interview with none other than Snopes.com , Borra claimed he never actually used the word ‘probably’ and that further confirmation was needed.\\nThe director of the SETI (Search for Extraterrestrial Intelligence) Institute , Andrew Siemion, issued an admonishing response:\\n“You can’t make such definitive statements about detections unless you’ve exhausted every possible means of follow-up.” \\nSo why is everyone so excited? The discovery appears to match a prediction Borra made in 2012 when he claimed aliens could very well use intermittent bursts of laser as a means of communication.\\nFor his part, Siemion plans to use his Breakthrough Listen Initiative to more closely assess several stars from the 234 sample. Meanwhile, Borra andTrottier, Borra’s graduate student, will continue observing the mysterious signals.\\nIt’s an exciting decade for space research. With plans for a mission to Mars in the hopper, as well as an exploratory probe that will be sent to the moon Europa, we may be witnessing the rebirth of the Space Race. What better incentive could there be to venture further into space than the call of an alien species?\\nLet’s hope that by the time we meet them, our own species will have transcended its addiction to war and unsustainable resource allocation. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Anti-Media of theantimedia.org . \\nThe “Anti” in our name does not mean we are against the media, we are simply against the current mainstream paradigm. The current media, influenced by the industrial complex, is a top-down authoritarian system of distribution—the opposite of what Anti-Media aims to be. At Anti-Media, we want to offer a new paradigm—a bottom-up approach for real and diverse reporting. We seek to establish a space where the people are the journalists and a venue where independent journalism moves forward on a larger and more truthful scale. '"}, "time": 1742564511.388463}