{"duration": 0.09367108345031738, "input_args": {"text": "'By In5D on November 14, 2016 in Spiritual Awakening \\nby Missy Marston, \\nThe first time I channeled my sister was also the first day I watched “ The Secret “. \\nI had spent most of that day and the night looking at the stars and asking the universe to help me open my third eye and talk to my sister. And it heard me! It was around two in the morning and I went inside to read an article my mother had left up for me. I kept getting the same phrase over and over in my head – Everything you need is inside of you, you just have to ask for it. \\nI took the hint, grabbed a pen and paper, and wrote it down. When I was done writing, my hand wasn’t. It kept writing. I was exhilarated, terrified, and full of love and peace all at the same time. \\nThere was no question at first; there was this knowingness of what was happening and whom I was channeling without asking. It was my sister! Thank you, universe! \\nShe passed along some messages of love and thanks to the family, told me to get my shit together, and began the process of educating me and keeping my mind open. \\n“Everything is possible with just your mind!” \\nTina wrote that she could always hear those who speak to her, and that she’s been constantly trying to speak to us . She was very adamant about self-discovery through meditation in order to first visualize her, and second to transcend ! All we have to do is ask the universe, believe it will be, and keep our minds open through journeying into the self . ‘ That’s how strong your brain is!! You can do it if you can will it. You have the universe at your fingertips! ’ \\n“We have so much to do, Missy!” \\nChristina wants to change the world, because Christina can change the world. Besides opening up our minds and asking the universe for help, we need to eliminate needs and focus on the inner-self . She said the inner-self is all there is. We can change the world by gaining power over our knowledge and intuition; Learning what truly matters in both the world and your self and feeding our sixth sense until it reaches its full potentia l. ‘Intuition is your best friend. Talk to it. Listen to it. It’s how you knew to grab a notepad. It’s how you know it’s me.’ \\n“You get it?” \\nI asked Tina if I would always have this connection to her, and she wrote that we are one. So I’m thinking that we’re somehow the same soul, and she corrected me. She said we are ‘soul bound’ to each other. \\nShe says I’ve done this a million times before! We’ve known each other outside of Christina – I was always the mouthpiece and she is the mouth. \\nAs Christina said: ‘Just let yourself be filled with love; it is the fuel for your mind.’ \\nWhat peace it brings to know your loved ones are near and listening! And what joy it brings to know it’s possible to hear them! \\nAbout the author : My name is Missy Marston, webmaster and editor of MetaMissy.com . I am 23 years of age living in sunny Florida. I have two dogs, two cats, and too many fish – I adore animals. I love reading, especially Kurt Vonnegut, and have a steady interest in philosophers. On October 10th, I lost my best friend and little sister, Christina. Out of that tragic experience came a reminder of my deep-rooted love for all things metaphysical and a sign for my future path. Within weeks, I began channeling Christina! I want everyone to know the enlightening truth that there is much more out there than we realize. There is so much more waiting inside of ourselves than we give credit for, and all of it is easily accessible. Come with me on a journey from deep inside your conscious to the outer rims of the multiverse! Follow me on Facebook ! RELATED ARTICLES FROM IN5D: '"}, "time": 1742564592.1677487}