{"duration": 0.4317903518676758, "input_args": {"text": "'The way the lawyer William Timmons described the case, it was practically a newsreel melodrama, with a helpless widow being menaced by a heartless tycoon. The story began with the widow, whose name is Yolanda Signorelli von Braunhut. She is a onetime heir to the considerable fortune still generated by her husband Harold’s iconic invention, Amazing Live  . As her lawyer told it, she was now isolated,   often without electricity or running water on a palatial estate on the Potomac River in southern Maryland. Having retreated to a single room in the old mansion, she was prepping for her second freezing winter, barricaded by thick quilts, her bed next to a fireplace stocked with split wood. From this bunker, Signorelli von Braunhut has been waging legal combat against Sam Harwell, chief executive of a   toy company whose name seems straight out of a Chuck Jones cartoon: Big Time Toys. In his tiny office in Sayville, on Long Island, Timmons spoke in clipped,   tones, handing me a   summary of the case, eager to   the plotline. “The heart and soul of this case is trademark infringement,” he said. Signorelli von Braunhut “believes in the concept of justice,” he continued, “and when you have that on your side, then you can get through the day. ” A few years after her husband’s death in 2003, Signorelli von Braunhut licensed out part of the labor of his multimillion dollar   enterprise, mostly packaging and distribution, to Big Time. If you’ve ever been 8 years old, then you know that   arrive in a small plastic aquarium with several small packets that include the tiny   critters, which reanimate once you add water  —   by way of a secret formula that Signorelli von Braunhut keeps locked in a vault in Manhattan. The original deal held that Big Time would supply everything except the specially engineered critters  —   and the accompanying packets, which von Braunhut would manufacture and sell separately to Big Time, which would then bundle the full kits and handle the sales. Also in the contract was a second deal  —   to buy the company, including the secret formula. It allowed Big Time to pay a   $5 million fee and then $5 million more in installments. Three winters ago, Big Time called up the widow and announced that it considered its previous payments for the packets to be a kind of layaway deal for the company and that, as far as Big Time was concerned, it now owned the   franchise. Signorelli von Braunhut first sued in 2013, and last year Timmons filed a further complaint accusing Big Time of breach of contract and trademark infringement. Big Time’s national law firm, Epstein Becker  Green, sent me a statement denying any wrongdoing and claiming instead that the widow improperly terminated the contract. In a particularly contemporary twist to the melodrama, Big Time’s court filings revealed that it was now buying knockoff   from China. “This is a David and Goliath story,” Timmons said, only “without a slingshot. ” Timmons shrugged as if to invite me to look around. His office is, to be generous, snug. There was barely enough room for me. It was surprising that the door doesn’t bang his desk as in that Alan Cumming gag from this season’s “The Good Wife. ” Timmons is a tall, thin man with some Nicolas   to him. At times he seemed uninterested, not so much in   but maybe in the law in general, or just in the wanton quotidian reality into which we are all born. Our conversation easily swerved off topic and into, say, a debate about Bill Maher’s atheism, or about how “we are all individuals at the tail end of a universe expressing itself,” or Timmons’s rock band, which plays in the local bars under changing names like Rainbow Bridge and Dreamworld. He likes “renaissance” rock. “It’s a convergence  —   Lennonesque with Hendrix overtones and some Dylan, maybe ‘dinosauric’ at this point,” he told me. “It’s altruistic, seeking the higher ground instead of just lamenting upon the human condition. ” Timmons represents Yolanda Signorelli von Braunhut because years ago he used to go to this legendary Halloween party hosted by a    opera singer known as Maestro Signorelli, a Bohemian possessed of “this   field of energy. ” The grand patriarch of a bustling family, Signorelli taught bel canto to locals determined to improve their coloratura. His annual Halloween masked ball attracted hundreds of “musicians, dancers and artists,” all of whom came in their most flamboyant costumes. Some attended, if only to meet one of his five beautiful daughters. The   Yolanda, was particularly stunning and began a film career in the  . She played Lorilie in the 1967 bondage classic “Venus in Furs”  —   based on the Leopold von   novel of that name, as well as various minxes in “All Women Are Bad,” “Too Much Too Often!” “Death of a Nymphette” and “Assignment: Female. ” I watched three of them, for research, and was struck mostly by how these films appeared long before the phrase “money shot” entered the lexicon and the director’s mandatory scene list. When I finally screwed up the courage to ask Signorelli von Braunhut about her previous career, she casually said: “In those days, they might have been racy, but today? I don’t think so. ” Which is true. If anything, her brief movie career looks presciently campy  —   less like porn than like a Mike Myers parody titled, “Cool It Baby” (which is also the title of a 1967 Signorelli von Braunhut film). On paper, including the legal summary Timmons gave me, the issues of Yolanda von Braunhut v. Big Time Toys might be technical  —   breach of contract, sure  —   until you find yourself reading affidavits that suggest this could be one of those unusual contests, not of law but of meaning  —   maybe not the tail end of a universe expressing itself, but definitely one that leads into that lively place between ordinary truth and hopeful dreams and all the way to the essential contradiction at the core of the American character. As it happened, Signorelli von Braunhut was visiting Long Island that very afternoon to see her sister. We met at Timmons’s office and then walked down to the Aegean Cafe (“Steaks Seafood Pasta”) on Main Street for a luncheon. Von Braunhut is a very good looking woman whose age I was just too chicken to ask. But if she was 18, as she told me, when she started her film career in 1966, then she’s about 70 now. She is trim and   looking in skintight jeans and an equally engaged   top, reminiscent of the ageless Sophia Loren or Raquel Welch. She has an artful muss of dark hair framing a smile that’s slow to form but amplified by flirtatious eyes that sparkled at the end of each sentence. Over a salad, she said she was eager for me to understand the inventive genius of her husband, Harold. Beginning in the 1950s and ’60s, he took out patents on 196 different inventions, gadgets and toys. That whole last page of zany novelties found in comic books for years was the domain of Harold von Braunhut. He also raced motorcycles under the name the Green Hornet. He was a sometime television producer and the agent for one of those guys who   into a wading pool with 12 inches of water. He was a magician who worked under the name the Great Telepo. She said he also invented the     —   a device into which you punched your destination in New York City, and the machine told you the fastest subway route  —   half a century before Google Maps.   were von Braunhut’s most lucrative toy (and still are: In 2006, according to the filings in this lawsuit, sales were $3. 4 million). Part of what made   successful was a scientific breakthrough Harold von Braunhut claimed he achieved in the early years. In 1960, after observing the success of Uncle Milton’s Ant Farm, von Braunhut first started shipping Instant Life  —   simple brine shrimp that could travel in their natural state of suspended animation. This was the era when a good idea with smart marketing was the dream: D. F. Duncan’s   George Parker’s Monopoly game, Ruth Handler’s Barbie. Around the same time, the   toy company of the day,   started selling a similar product called Instant Fish, which was an immediate dud. “They didn’t work because the formula wasn’t thought through properly,” Signorelli von Braunhut said.  ’s product was actually African killifish, which were supposed to come back to life when rehydrated. But they didn’t. “So it really hurt sales for Harold, too. ”  ’s 1960 failure led von Braunhut to reintroduce his creation with new science and a new concept. He worked with a marine biologist named Anthony D’Agostino, and using a process he flamboyantly called superhomeogenation, they created a hybrid brine shrimp that could more easily survive the United States Postal Service and be more likely to flourish after reanimation. They worked with the   species artemia salina, and because they made their breakthrough at Montauk’s NYOSL, the New York Ocean Science Laboratory they called their new hybrid artemia “nyos. ” (I contacted D’Agostino at his home, but his wife said he was seriously ill and couldn’t come to the phone.) According to Richard Pell, who maintains an aquarium of   at the Center for PostNatural History in Pittsburgh (alongside displays about    goats and other attractions) “They were selectively bred in the early ’70s so that they would have this extra long dormant cycle in their egg state, and they were able to increase that yield so that you get that satisfying swarm. ” Pell admits he’s worried these days. “The new ones come from China,” he said, “and they are technically not   because they don’t come from that original culture developed by Harold and Dr. D’Agostino. ” Over coffee, Signorelli von Braunhut talked about this formula for altering the shrimp as one of her husband’s greatest scientific breakthroughs, his greatest invention. Timmons himself jumped in to add that Harold’s genius was with “the science to get them to live for a prolonged period of time. ” She agreed and said, “Yes, he went through tremendous efforts to make sure that they  —   should I elaborate on that?” and then Timmons said, abruptly, no. Whenever the science came up, in fact, Timmons shooed me away. Signorelli von Braunhut met her husband in the late 1960s, when she happened to be in the audience for a taping of a television program he was producing for the magician Joseph Dunninger. “Harold was such an exciting person,” Signorelli von Braunhut said, explaining why she set her movie career aside. “Show business was kind of a tough thing, and I am not into all that myself. I liked being around Harold and the  . ” So she went to work for him, and later they married. While Dunninger has been largely forgotten, the couple’s fortuitous meeting on his set came at a crucial juncture in the development of American magic and marketing. Dunninger served as a bridge that led away from live performance  —   dating to   vaudevillian stagecraft  —   and toward the small stage of television, where magic was more patter than prestidigitation, more pizazz than performance. Harold von Braunhut was the perfect person to attend to this shift, as he was, in a sense, a kind of marketing Jedi master. Remember Amazing   Monsters (a bald troll printed on a card that grew green mineral locks when watered)? That was von Braunhut’s, and although his novelty toys were, once they arrived, a bit disappointing, the marketing of them was a wonder of what we’d all come to know as informercialism. His Crazy Crabs were nothing more than hermit crabs in a little cardboard box, but the ad copy described another world: “As gentle as a pussycat, it lives on LAND instead of water, DOES NOT BITE unless mishandled. ” And: “It loves to be touched and petted, and enjoys running from hand to hand, swinging from your fingers or just cuddling on your shoulder like an adorable tame parrot. ” With   von Braunhut took his marketing to new levels. He spun off numerous whimsical books with all kinds of imaginary advice for caring for the tiny critters. You could coddle them with   “Banana Treat” or “Cupids Arrow” Mating Powder. (Inside joke for the arthropodologists:   don’t always need mates.) There were timely variations of the toy. There was a Space   kit, and a   Speedway that deployed giant eyedroppers to create racecourses. The same equipment was repurposed into kits for       Fox Hunt and   Mystery  . In 1992, CBS broadcast a   TV show starring, naturally, Howie Mandel. To this day, there is a website for   zealots, who exchange   lore and kitschy enthusiasms. What made Braunhut’s work so edgy, so American, was just how wickedly far he’d journey  —   far past the product itself  —   into the fictional. I remember   Spex (also von Braunhut’s) with that promise of seeing girls naked beneath their clothes, as my first shattering disillusionment with the world of adults and all their horrible lies. Signorelli von Braunhut told me that Harold’s purest novelty was his Invisible Goldfish. “It was a glass bowl with some sea plants,” she said, “and a sign that said, ‘Invisible Goldfish: Do Not Feed. ’’u2009” The kit came with a printed guarantee that you’d never see them. Not everyone appreciated the joke. In the 1970s, at the height of a nationwide focus on consumer protection, New York’s attorney general, Louis Lefkowitz, went after von Braunhut. “The suit against Harold by Louie Lefkowitz,” Signorelli von Braunhut said, “argued that   were fraudulent, because it’s a fantasy. ” A federal judge who reviewed Lefkowitz’s case was amused by the attorney general’s intense concern. According to the judge, Lefkowitz argued that the novelty’s marketing included von Braunhut’s claim that “  are covered by ‘Limited Group   Life Insurance Policy. ’’u2009” Lefkowitz demanded that von Braunhut cease “the usage of the name ‘ ’ in the sale of brine shrimp” because they “were not miniature monkeys, and are not a miracle or anything new scientifically. ” Finally, Lefkowitz beseeched the courts to “enjoin the issuance of insurance policies covering ‘ . ’’u2009” In the legal record, it’s not clear that Lefkowitz got any further than this legalistic tantrum, but Signorelli von Braunhut remembers a judge’s coming down on the side of whimsy. “  were vindicated,” she said. The judge compared the issue to “sponge cake  —   it’s not a sponge and butterflies are not made of butter. ” But apparently, this fundamental question about   was not settled. In the scores of files that have already been entered into court for the current litigation, one is an affidavit by Sam Harwell, the chief executive of Big Time Toys. He is a very powerful man in Nashville, not only because he owns a   toy company but also because his wife, Beth Harwell, is the speaker of the Tennessee House of Representatives. Harwell declined to return my phone calls, but Big Time has continued to sell   to Walmart and Toys “R” Us, even after Yolanda claimed a breach of contract and quit sending out the specially formulated shrimp. In this affidavit, Harwell explains precisely why he outsourced his   to China. He declares that there are seven recognized species of artemia brine shrimp and that artemia nyos “claimed by plaintiffs is not one of them,” because it is a hybrid. Regular old,   brine shrimp  —   at least in terms of their size and life expectancy  —   “are indistinguishable from the pouches supplied by plaintiffs. ” In essence, Harwell is making a kind of existential case about the fundamentals of American marketing, and a familiar one. He’s practically picking up where Lefkowitz left off by arguing that there is no there there,   . It’s all part of the confidence game. Part of the sham. It’s humbug. And if the issues in Harwell’s affidavit go forward, then that is what may be on trial. Humbug. When P. T. Barnum, the great   impresario of public entertainment (and   of the Barnum  Bailey Circus) popularized that word  —   “humbug”  —   he was talking exactly about things like  . Most assume, as Harwell might, that the word is synonymous with total nonsense and absolute fraud. But that overgeneralization misses Barnum’s sly nuance. “Humbug” is not a lie, the great promoter used to say: “No humbug is great without truth at bottom. ” It’s unfair to say that Barnum peddled pure fantasy. Great humbug simply took off from a small truth and used that to show people what they wanted to see. In his own way, P. T. Barnum was the greatest cognitive scientist of the 19th century. He understood that when you pit humbug against harsh cold reality, reality doesn’t stand a chance. Knowing this explains so much  —   World Wrestling, Taco Bell, Donald Trump. Humbug is as American as   apple pie. Which is why   are involved in a lawsuit now and why Barnum got tangled up in one in his time, litigating the nature of humbug. The case involved one of the biggest tourist attractions after the Civil War: the 1869 discovery of the Cardiff Giant in a little town of that name near Syracuse. Just as nowadays, there was an argument between rationalists and people of faith about the science of the Bible, in this case, whether the giants described in the Scriptures were real. (People forget that the reason God flooded the entire earth during the time of Noah is that angels and humans kept having lots of illicit sex and inadvertently created a race of deranged giants.) At the time, “fossil” had become one of the buzzwords in the popular battle between Darwinian scientists and angry pastors. So a cigar maker named George Hull thought it would be entertaining to fabricate a fossil of one of Noah’s giants. He had a   man secretly sculpted, treated it to look old and then buried it in rural New York State, where he contrived to have it found. Instantly, massive crowds of astounded Christians started pouring into town, eager to see biblical proof in the petrified man with the    feet and the   nose and all the other proportionate appendages. Hull made lots of money charging 50 cents a viewing. But as his wealth grew, he became nervous that the hoax would blow up. So he sold the Cardiff Giant to a consortium of businessmen, headed by a man named David Hannum. P. T. Barnum instantly offered the consortium $50, 000 to buy the Cardiff Giant, no doubt convinced that humbug of this magnitude really deserved his marketing skills. Hannum declined, but he clearly did not appreciate just whom he was up against. Barnum had his own copy carved and rushed his giant to New York City. At one point the fake giant and the knockoff fake giant were being exhibited two blocks from each other. Barnum’s marketing drew much larger crowds. And even as Hull, the original forger, publicly confessed that the original Giant was a fake, Hannum took Barnum to court. The judge, of course, ruled in favor of Barnum  —   you can’t be sued for calling a fake a fake. Humbug won, and the Giants toured for years afterward. Before the judge’s 1870 ruling, Hannum still believed in his giant’s authenticity and fumed about the popularity of Barnum’s, saying, “There’s a sucker born every minute. ” Many mistakenly ascribe the remark to P. T. Barnum himself. And it’s understandable. The quote has a way of making complete sense, no matter which side you’re on. A few weeks after lunch with Signorelli von Braunhut, I visited the grand estate built by   south of the nation’s capital just off a road called Hard Bargain. Large metal gates decorated with prancing     open to a number of No Trespassing signs. About a mile down the road, it turned into farmland, with a barn and a scalloped wood bridge decorated with large festive red bows crossing a pond gleaming with bright chartreuse scum. From the trees, like a visual illusion, a large brick house emerges. Nearby, a small array of propane generators thrums. Inside, Yolanda Signorelli von Braunhut greeted me warmly. She invited me into her kitchen, where a propane heater was at work, a Coleman cooler held her comestibles and a camping stove heated us up some tea. A large yellow bird in the kitchen hopped around, upset. “That’s Josephine, a cockatoo who flew into my window in New York in 1981,” she said as she fixed vegan snacks and recommended some antioxidizing super plant protein called Wild Force Green Formula. “It helps you ” she said. Through a hallway crowded with scores of smiling angel dolls and various cherubim, we parted a few warming curtains to the living room and entered a cabinet of wonders. Whimsies abounded  —   on the table beside me, a Snow White lamp, a Bambi figurine,   bobble heads. On the wall there was a painting of her mother, whose   beauty seems familiar. “I met the artist for Superman,” Signorelli von Braunhut said. “He had a few Lois Lane models, and she was one of them. ” Signorelli von Braunhut was dressed in tight jeans with a décolletage Guess top. Josephine perched on her shoulder for the duration of my visit, occasionally striking Angry Bird poses and voicing some shrewd concern at my queries. Signorelli von Braunhut elaborated about what happened after the   Instant Fish disaster. That was when her husband changed the name from Instant Life and started marketing them as Amazing Live  . Joe Orlando, who would later achieve fame at DC Comics and Mad Magazine, illustrated the cover art. The image itself is famous. You know it: a   family with three antennas wagging on their heads and long paddle tails lounging outside their underwater castle. Von Braunhut took his new marketing to the back page of comics  —   the one place where he could bypass parental skepticism and speak directly to children’s imaginations. His campaign was a textbook case of what we now call “cognitive priming. ” That is, the deep cerebral desire we all have to see what we expect to see. So when you buy a   kit, you get the tiny plastic aquarium and fitted into the sides are little magnifying lenses that enhance the tiny brine shrimp just enough, setting off a little motion picture in your head of   primates swinging to and fro by their curved tails, gamboling in a watery jungle. The real innovation may never have been the secret formula of his brine shrimp but the cognitive ignition of those four perfect words of distilled humbuggery: Amazing Live  . That alone might well have been enough to loft Harold von Braunhut into the pantheon of toy inventors, alongside Uncle Milton Levine, D. F. Duncan and George Parker. Except for one almost unimaginable and horrible thing. Harold von Braunhut was a  . Moreover, a Jewish  . He was born Harold Nathan Braunhut, to Jewish parents. He inserted the “von” to sound more Germanic. Von Braunhut even indulged his dark side with one particular invention  —   the Kiyoga, a retractable baton for   also known as the Steel Cobra. When Richard Butler, the head of Aryan Nations, was indicted in the late ’80s, he encouraged his supporters to buy Kiyogas because the “manufacturer had made a pledge of $25 to my defense fund for each one sold to Aryan Nations supporters. ” After an   League report emerged, von Braunhut refused to answer any more questions and was known to simply slam down the phone when any reporter called him. His background is the source of great remorse on marketing chat boards, where writers are distraught that someone as visionary as the   Spex and   guy could be such a racist head case. “I came close to writing a biography,” wrote a contributor known as Kierkegaard, but found it would be too “difficult to write a sympathetic account due to his political views. ” Apparently there are some realities that marketing can’t obscure. Signorelli von Braunhut grew quiet, even sad, when I brought up this subject. There are calculated silences at the heart of any marriage, and this was definitely one. “Harold and I never really talked about things like that,” she told me. “We just really loved each other, and I didn’t question him or interrogate him. ” She said, “I am very inclusive with everybody” and “that’s why I live on a farm with all kinds of animals and try to impact the earth in the least possible way and try to live a peaceful, happy, loving life. ” She handed me an     kit on the way out the door. On the drive home, I stopped by Walmart and found the Big Time version. The container makes no mystery of the fact that this is a product of China. So I conducted an experiment  —   setting up both kits at precisely the same time and with the same water. Von Braunhut’s kit had extra packets to keep the water stable. Big Time’s kit seemed very stripped down. On the day that the shrimp reanimated, there was really no comparison. Von Braunhut’s produced hundreds of   which  —   I have to say  —   are still irritatingly tiny after all these years. Big Time’s tank was very quiet by comparison, requiring a lot of squinting and really good light for the embedded magnifiers to offer a fleeting glance of one or two drifting by. It also felt odd that, for a company that broke with von Braunhut years ago, Big Time enclosed literature that still offered such Haroldian extras as “Sea Medic”   Medicine, “Cupids Arrow” Mating Powder and the   “ . ” Despite Big Time’s court claims of buying plain old brine shrimp from China, the enclosure boasts that “after years of crossbreeding, we developed a hybrid,” and “These amazing new hybrids grow larger and live longer than any ‘natural’ variety of brine shrimp. ” (Big Time had no comment when asked about its use of natural or hybrid artemia, and dismissed my test as “not reliable. ”) The last item on Big Time’s pamphlet was especially surprising. In small print, it urged its new   owners to earn a DLD degree (Doctor of Denizens of the Deep) by writing directly to the Crustacean College of   Knowledge. It then lists the Maryland address of the   estate where Yolanda Signorelli von Braunhut lives in her   room and answers   mail by firelight.'"}, "time": 1742563860.1353176}