{"duration": 0.031983375549316406, "input_args": {"text": "'“El mejor lugar para observar estrellas fugaces de OT” SELECCIÓN DE RESEÑAS Y RECOMENDACIONES DE USUARIOS «El mejor lugar para observar estrellas fugaces» \\n★★★★ \\nA sólo 10 minutos de Barcelona, en Sant Just Desvern, el mirador de Sant Nicanor es un espectáculo para los amantes de las estrellas fugaces. Situado junto al antiguo plató donde se grababa Operación Triunfo, es relativamente fácil observar a algún exconcursante arrastrado por la nostalgia y el éxito efímero. Nosotros tuvimos suerte y vimos un Ramón de OT3, una Idaira de OT4 y un Chipper de OT6. \\nMELISSA SERRAT «Una sombra de lo que fue» \\n★ \\nHubo una época dorada en el Gorgorito’s en la que los intérpretes sentían la música. Lamentablemente, eso pertenece al pasado. Gregorio se ha acomodado en los boleros más populares. Desde que se juntó con una chica más joven no transmite la pasión de antaño. Tampoco Charo, que interpretaba como nadie a Paloma San Basilio, parece sentir la letra de Juntos. Quizá el único que se mantiene fiel al espíritu gorgoritero sea Sebas. Su Tractor amarillo continúa siendo el símbolo de la Barcelona divorciada. \\nJORGE CARDONA \\nEstación de Bicing de Aribau/Diputació «Historia y tradición en el centro de la ciudad» \\n\\nEsta estación de bicicletas municipales fue una de las primeras en instalarse en la Ciudad Condal. Las mismas bicicletas estropeadas, los mismos problemas para sacarlas… Acercarte allí te teletransporta automáticamente a los locos 2007. Parece que en cualquier momento vaya a aparecer algún joven de la época, con sus vaqueros y sus zapatillas, con su iPhone, escuchando lo último de Miley Cyrus… Aaah, ‘those were the days, my friend…’ \\nRAMIRO CARMONA'"}, "time": 1742564098.213594}