{"duration": 0.058521270751953125, "input_args": {"text": "'Congressman Tells Cub Scouts He’ll Vote Trump ‘No Matter What Crazy Things He Says’ (VIDEO) By Richard Marcil on October 27, 2016 \\nNew video from a Cub Scout meeting in Kansas shows Representative Kevin Yoder (R-Kan.) pledging to support his party’s presidential candidate, Donald Trump – no matter what. “I’m going to be supporting the Republican nominee, no matter what crazy things he says.” \\nYoder’s admission is shameful enough on its own. But the worst part is his audience – a group of Cub Scouts, aged 7-10. \\nThe video, taken October 11, was recorded shortly after the release of the now-infamous “ Pussy Tape ” in which Trump brags about sexually assaulting women. Yoder even made a joke about Trump’s scandalous comments: “A-ha! Which parent put him up to that? Is there a hot mic in here? Well, I’m a Republican, so I’m going to be supporting the Republican nominee, no matter what crazy things he says.” A Lesson On ‘Spin’– For the Kids! \\nYoder dishonestly suggested that the child was not curious enough to ask the question on his own. But in fact, kids are quite aware of the impending election. An informal survey of teachers found high levels of youth anxiety – especially among racial and ethnic minorities – due to Donald Trump’s inflammatory rhetoric. \\nHis reply also dishonestly implies that he’s somehow obligated to vote along party lines. But the many Republican defections from the Donald Trump camp prove that is untrue. Yoder could have used the opportunity to teach the Scouts that they should always do the right thing, even if it means refusing to do what is easy and expected of you. Instead, he towed the party line. \\nPerhaps Yoder needs a reminder from the Cub Scouts about where his loyalty should lie. According to the Scout Oath , decent citizens should pledge: “On my honor I will do my best, to do my duty to God and my country…” Damage Control \\nYoder is running for a fourth term in a suburban Kansas City district. His team is already running damage control on the tape. Yoder spokesperson, C.J. Grover, played the remarks off as evidence of Yoder’s “quick wit.” “Anyone who knows Kevin knows that he utilizes his quick wit to connect with voters. All this video shows is Kevin continues to be out in the community taking all questions from anyone who wants to ask them, whereas his opponent has been hiding in his basement hoping his financial backers in D.C. can steal him a victory.” \\nFeatured image: screengrab via YouTube video . About Richard Marcil \\nRichard Marcil is a freelance writer. Connect'"}, "time": 1742563461.7947557}