{"duration": 0.046399593353271484, "input_args": {"text": "'Cars and other vehicles “have turned into deadly weapons” and should be banished from cities to stop attacks like the one in Stockholm from happening in future, according to Aftonbladet editorialist Eva Franchell. [Crackdowns on immigration or extremist ideology are not the way forward when it comes to terror prevention, according to the veteran journalist, writing after Friday’s terror attack in Stockholm left four people dead.  Instead, it is cars  —   which she calls “effective murder machines”  —   that Franchell says “must simply be removed from city centres and places where people gather, if people are to be protected in future”. Vehicles are “easy to steal, and so nothing has been able to stop their advance” writes Ms. Franchell. “It just isn’t reasonable that a big truck can be driven right into one of Stockholm’s busiest streets on a Friday afternoon right before Easter. ” Noting how it is a popular destination for tourists, Franchell says the city centre must be a “safe environment” for visitors to enjoy. She described it as “remarkable” that it is possible to drive around the Swedish capital’s medieval old town. Outlining her vision for a   Stockholm, she argues: “Most problems with regards to mobility and public transport can be solved, and deliveries to shops and restaurants could take place at times when people aren’t out on the streets. ” “Vehicles have been allowed to dominate our cities for decades and it’s the people who need space. It’s vital now that cars be regulated,” the piece concludes. The idea of reducing the number of cars in Swedish cities was backed last month by Sweden’s environment minister, who argued that driving is a gender equality issue as well as a matter of shrinking the nation’s carbon emissions. “Cars are driven largely by men so by giving a lot of space to cars we’re giving a lot of space to men  —   at the expense of women,” Karolina Skog explained.'"}, "time": 1742563340.1104548}