{"duration": 0.07851815223693848, "input_args": {"text": "'Leave a reply David Manning – Our evolution is speeding up on this planet. We are disconnecting from the old 3D realities and opening to 5th dimensional frequencies. As awareness increases we begin to recognise the vast inter-dimensional matrix of control operating on and around the planet. Large numbers of people are now consciously choosing to to exit this matrix completely. To step out and truly claim individual authority. This does require that we process all of our hold outs and unconscious buy ins. The other day, I became aware of a big hold out of mine. I woke up feeling a deep tension in my solar plexus. Later, cycling in London, I saw on the side of a bus a huge advert for a newly released movie. “The Gods of Egypt”. The image struck me with force into that point of tension, and immediately I understood that I was still engaged in an allegiance to the Egyptian Gods I had once served and worshipped. I sat to meditate and looked deeper into the tension. There, arranged in layers were the pantheons of gods I had worshipped through different eras of history. The Roman, Greek, Celtic, Hindu, Viking, the South American, Native American, African…… it was endless. The gods of all the cultures I had incarnated in were still claiming a piece of my energy. I was still locked in, feeding them. I had never disconnected. Why would I? These beings were the ultimate authority for me in those times. No greater reality existed. I felt the deep belief in these beings, the prayers, the rituals and ceremonies, the honouring, the sacrifices and promises made. I was aware of the anger where I felt betrayed by gods I had sacrificed to, where I had not got what I wanted. It was anchoring me into an immature level of consciousness, a system of reward and punishment, vengeance, obedience and superstition. \\nAll of these beings are archetypal patterns in the collective field. Very real at an energetic level. As I felt into the structures, I knew I was still engaged with many of these beings, either in obedience, or resistance or deep superstitious fear. \\nMany of these beings were actual visitors from other dimensions or star systems. They weren’t gods at all, just a little more advanced than humans. They came seeking energy, slaves, to be worshipped. Easy for beings from a more technologically advanced culture to convince populations that they were gods needing be obeyed. Not all of them would be negative in intent. Many would have had our evolution as their primary concern. They are all a part of the matrix of control. A sticky part, because they are an aspect of our spiritual subculture. Woven in with much fondness and fear, guilt and shame, over many incarnations. There are many layers of this operating in our system. These have been laid down over vast stretches of time, and are deeply ingrained. There are many false gods that we have pledged allegiance to over time. Anything we have decided has power over us becomes a false god. Something we surrender energy to on a regular basis. It could be a substance, a person, an organisation, a belief. As we release our alignment with what no longer, or never did serve, we align more completely with Source. It’s what we are, what remains when everything else falls away. From this place, we recognise there are no beings higher than or more divine than us. We release ourselves from the shackles of superstition and obedience, of needing to appease a god, or sacrifice to a god. No more seeking approval from on high. We come into sovereignty. Letting go of the conditioning of our collective past means that there is more life force available to us now. We’re aren’t scattering it over a vast history, funding obsolete systems. That life force then fuels our bodies, our lives, our evolution. All of these become healthier. There is more vitality available. We receive a huge boost because we’re not allowing ourselves to be plundered, farmed, energetically raped and manipulated. This dimension shifting time is calling for us to become very aware of what we do with our energy. There are opportunities now to release our historic programming. Not just the ancient wounds, but also the things we loved, things that served us well. If they are limiting awareness of ourselves as source energy, letting them go will serve us well. I offered a teleconference on this subject. If what you’re reading has resonated with you, then why don’t you check it out. In it we walk through many of the layers of programming, and release the ancient loyalties from our field. This results in a deep empowerment. We no longer need to be funding outworn archetypes from our own energy. It enables a much deeper acceptance of our own divinity and an ability to access higher states of attention quite naturally. Many are heralding this time as a major point of change for the planet. Now, I’m adding my voice to the chorus. Last week, preparing to give a talk, I was meditating, and asking, ” What is it we want to communicate?” “Tell them it’s going to be ok.” I’ve never heard that before. “What do you mean?” “It’s all going to be ok. The fields of duality are collapsing on the planet. You are not bound by history, it’s over, done. Your karma is finished. Nothing left to process. Now it’s time to walk off this playing field. A new game is about to begin.” \\nWe have been in preparation for this for years. Clearing, processing, meditating, workshop-ing. It feels a little surreal to finally be at this point. But I really think this is it. I wouldn’t say it if I hadn’t experienced it personally. It landed in my body, a huge ball of energy, an awareness of the rightness of what I was hearing. This is the first time I have received guidance of this nature. \\nIn my energy work sessions since, I have seen people making huge shifts, smoothly releasing deeply buried, ancient bindings and karmic pieces. People who have done little work emerging from underneath vast layers of personal and collective programming, confused by the lightness of the experience. \\nA couple of nights ago I had a dream, another layer of information. I was watching as a mechanic stripped down the vehicle I own, and transformed it into the latest model. It received a huge upgrade. All this took place in the house where I grew up. A place I think of as ‘the house of my mother’. \\nI lay in bed pondering the dream and understood that we are now about to receive upgrades at a physical level. Energies that enhance our experience of our body, and our physical world. \\nThese are coming from The Mother, the Divine Feminine. \\nSure enough, in my energy work sessions, people start receiving the most beautiful influx of energy, rising from the heart of the earth. As those complete, then finer frequencies begin to fall into their field from deep in the heavens. It is the most beautiful thing to witness. \\nI know now, when I see these things happening in the bodies and energy fields of my clients, that I am being give a glimpse into the potentials for the collective. \\nSo it may be trite to say the energies, the pace of change is intense, but it’s also accurate. \\nI offered this as a free call to explore the extraordinary potentials of this time. The dust from the Equinox will have settled a bit, and we may be able to see a little way ahead. \\nIf anything I’m writing about resonates for you, then please join me. There is some benefit to being present live, but if you can’t, then the call link is also the replay. You can listen at your leisure. Download this free call here . SF Source How To Exit The Matrix  '"}, "time": 1742628551.0994349}