{"duration": 0.18360328674316406, "input_args": {"text": "'Debbie Reynolds, the wholesome ingénue in 1950s films like “Singin’ in the Rain” and “Tammy and the Bachelor,” died on Wednesday, a day after the death of her daughter, the actress Carrie Fisher. She was 84. Her death, following a stroke, was confirmed by her son, Todd Fisher, according to her agent, Tom Markley of the Metropolitan Talent Agency. Ms. Reynolds was taken to a Los Angeles hospital on Wednesday afternoon. According to the celebrity news site TMZ, she had been discussing funeral plans for Ms. Fisher, who died on Tuesday after having a heart attack during a flight to Los Angeles last Friday. [ Read Carrie Fisher’s obituary | Watch Debbie Reynolds perform ] On Tuesday, Ms. Reynolds had expressed gratitude to her daughter’s fans on Facebook. “Thank you to everyone who has embraced the gifts and talents of my beloved and amazing daughter,” she wrote. “I am grateful for your thoughts and prayers that are now guiding her to her next stop. ” Ms. Reynolds’s career peak may have been her   Academy Award nomination for playing the title role in “The Unsinkable Molly Brown” (1964) a    western musical based on a true story. Her   film is probably “Singin’ in the Rain” (1952) the classic MGM musical about 1920s moviemaking, in which she held her own with Gene Kelly and Donald O’Connor, although she was only 19 when the movie was shot and had never danced professionally before. Her fans may cherish her sentimental   portrayals, like the title role in “Tammy and the Bachelor” (1957) in which she played a Louisiana moonshiner’s   granddaughter who spouted folksy wisdom. Her greatest fame, however, may have come not from any movie role but from the Hollywood scandal involving her husband and a glamorous young widow. In 1955, Ms. Reynolds married Eddie Fisher, the boyish music idol whose hits included “Oh! My  ” and “I’m Walking Behind You,” and the young couple were embraced by fan magazines as America’s sweethearts. Their best friends were the producer Mike Todd and his new wife, the   film star Elizabeth Taylor. When Mr. Todd died in a   crash in 1958, Ms. Reynolds and Mr. Fisher rushed to comfort Ms. Taylor. Mr. Fisher’s comforting, however, turned into a very public extramarital affair. He and Ms. Reynolds were divorced early the next year, and he and Ms. Taylor were married weeks later. That marriage lasted five years. Ms. Taylor left Mr. Fisher for Richard Burton, whom she had met in Rome on the set of “Cleopatra” (1963). Almost 40 years later, in an interview with The Chicago   Ms. Reynolds said of Ms. Taylor, “Probably she did me a great favor. ” In her 1988 autobiography, “Debbie: My Life,” she described a marriage that was unhappy from the beginning. “He didn’t think I was funny,” Ms. Reynolds wrote of Mr. Fisher. “I wasn’t good in bed. I didn’t make good gefilte fish or good chopped liver. So what did he have? A cute little girl next door with a little   nose. That was, in fact, all he actually ever said he wanted from me. The children, he said, better have your nose. ” Mary Frances Reynolds was born on April 1, 1932, in El Paso. Her father, Ray, worked for the railroad and struggled financially during the Depression. Her mother, Maxene, took in laundry to help make ends meet. As members of the Church of the Nazarene, they considered movies sinful. With the promise of a better job, Ray moved to California when Mary Frances was 7, and the family soon followed. Her career dream was to go to college and become a gym teacher, she often said, but when she was named Miss Burbank 1948, everything changed. Two of the judges were   scouts, and she was soon under contract to Warner Bros. which changed her name. In 1950, she had her first screen credit in “The Daughter of Rosie O’Grady,” a musical comedy starring June Haver and Gordon MacRae. (Two years earlier she had a small uncredited part in “June Bride. ”) The same year, she played Helen Kane, the 1920s singer known as the     girl, in “Three Little Words” and also appeared in “Two Weeks With Love,” in which she sang “Aba Daba Honeymoon” with Carleton Carpenter. The song became a huge novelty hit. Her roles seemed to mirror 1950s attitudes toward love, marriage and family. In 1955, she played a     girl opposite Frank Sinatra in “The Tender Trap. ” In 1956, she starred with her new husband, Mr. Fisher, in “Bundle of Joy,” a musical remake of the 1939 comedy “Bachelor Mother. ” After the    scandal, Ms. Reynolds rode on a crest of good will and was a popular   in a long string of films, mostly lighthearted romantic comedies, including “The Gazebo” (1959) “Say One for Me” (1959) and “The Pleasure of His Company” (1961). She also played the title role in “The Singing Nun” (1966) appeared in “Divorce American Style” (1967) and was part of the   ensemble cast of “How the West Was Won” (1963) a rare drama among her more than three dozen movie credits. “Drama’s unhappy, and playing someone unhappy would make me unhappy,” she told The Boston Globe in 1990. “Ain’t for me, honey. ” She took a stab at series television with a sitcom, “The Debbie Reynolds Show” (1969) in which she played a wacky Lucy   wife who wanted to be a journalist like her husband. It lasted only one season. But she soon achieved a kind of immortality as the voice of Charlotte the selfless spider in the animated film version of E. B. White’s children’s classic “Charlotte’s Web” (1973). She had married Harry Karl, a wealthy shoe retailer, in 1960, but by the time they divorced in 1973, he had gambled away or otherwise misspent his fortune and hers. Ms. Reynolds set out to   herself financially. She headed to New York that year to make her Broadway debut in a revival of the 1920s musical “Irene,” for which she received a Tony Award nomination for best actress in a musical. In 1976, she had a     Broadway show, “Debbie. ” She made her last Broadway appearance in 1983, taking over the role originated by Lauren Bacall in the musical version of “Woman of the Year. ” She later toured the country with stage shows including a new version of “The Unsinkable Molly Brown. ” She had taken her musical and comedy talents to Las Vegas as early as 1960 and became a fixture there in the ’70s and ’80s. She and her third husband, Richard Hamlett, a Virginia real estate developer, established their own hotel, casino and   museum there. But there were financial problems, and the property had to be sold in the ’90s. A decade or so later, it looked as if Ms. Reynolds would finally find a permanent home for her Hollywood memorabilia museum, this time in Pigeon Forge, Tenn. the home of Dolly Parton’s theme park, Dollywood. But that, too, fell through, and in 2011, a large portion of her collection was auctioned at the Paley Center in Beverly Hills. Two sales, the first in June and the second in December, took in a little more than $25 million, including $4. 6 million for the dress Marilyn Monroe wore in the famous   scene in “The Seven Year Itch. ” For a while, Ms. Reynolds seemed to be better known as the mother of Ms. Fisher  —   who shot to stardom as Princess Leia in the “Star Wars” movies and wrote semiautobiographical novels  —   than as an actress or singer. Ms. Fisher’s 1987 book, “Postcards From the Edge,” made into a film starring Meryl Streep and Shirley MacLaine, reflected the sometimes difficult relationship between her and her famous mother. Ms. Reynolds’s career took something of a back seat to her personal life when she married Mr. Hamlett in 1984, but they divorced 12 years later. In 1996, Ms. Reynolds made an     comeback when Albert Brooks cast her as his   yet admirably   widowed mother in “Mother. ” Her uncharacteristically   comic performance earned her a Golden Globe nomination, though not the Oscar nomination that many had predicted. The next year, she played Kevin Kline’s mother in the   film comedy “In  Out. ” And beginning in 1999, she won new fans with a recurring role on the NBC sitcom “Will  Grace” as Bobbi Adler, the Debra Messing character’s gregarious, uninhibited mother, who had a tendency to burst into song (show tunes, of course). Ms. Reynolds continued acting and doing voice work in both films and television into her late 70s. In 2013, she appeared as Liberace’s   mother in the HBO movie “Behind the Candelabra,” with Michael Douglas as Liberace. She appears in the documentary “Bright Lights: Starring Carrie Fisher and Debbie Reynolds,” which was shown at the New York Film Festival in October, and of which her son, Mr. Fisher, is a producer. She is survived by Mr. Fisher and a granddaughter, Billie Lourd.'"}, "time": 1742564415.4782014}