{"duration": 0.09723782539367676, "input_args": {"text": "'The President of the Nigerian Catholic bishops’ conference has appealed to the government to be “more proactive” in defending Christians from the atrocities being wrought by the Muslim population in   Nigeria. [During December, more than 800 people —  mostly Christians —  died in   violence in the south of Kaduna state, which forms part of Nigeria’s   middle belt, where the chiefly Muslim north of the country meets the mainly Christian south.  According to Vatican Radio, the Muslim Fulani Cattle herdsmen in the area have recently committed “atrocities” resulting in the deaths of “thousands of Christians and the destruction of property worth millions of Naira. ” The Nigerian government claims that the death toll is actually lower than the one given by the Catholic church. In a statement, Archbishop Ignatius Kaigama, President of the Bishops’ Conference, said the bishops were “particularly saddened by the constant and wanton destruction of lives and properties,” noting that   violence had spread around the country and “no one knows which community will be the next victim. ” The crisis and violence in Southern Kaduna has destabilized the region and “brought untold hardship and tensions” on the local Christian population, Kaigama said. Muslim Fulani herdsmen have perpetrated much of the violence against the predominantly Christian local farmers, and some Christians have reportedly also carried out retaliatory killings as well. Government officials have tried to downplay the religious dimension to the conflict, suggesting instead that it is largely about “ethnic” rather than religious tensions. “We live in a country that is     and complex in nature,” Kaigama said. “That is why we must constantly appeal to the sensibilities of our political leaders not to be seen to promote the interest of any particular group but to be neutral and seek the common things that will promote unity, fairness and equity in the country. ” Another local bishop, Joseph Bagobiri of Kafanchan, blamed the government for the systematic elimination of Christians in Southern Kaduna, noting that it will be difficult for Christianity to survive in northern Nigeria. “The crisis here has persisted because of the way and manner the federal and state governments, as well as the security agents are handling it,” Bagobiri said. “The root cause of this crisis is the institutionalisation of what could be regarded as structural injustice. ” In my view, he said, this is “a deliberate policy of injustice designed to shut our people out from the scheme of things and deny us our rights. ” “We as a Church must evolve new ways on how we can face violence without losing faith,” Bagobiri said. “It is our prayer that God will give us his strength and the needed direction on how to make Christianity survive despite the constant attacks and persecutions we received. ” He added that people have turned to prayer in the absence of government help. “It is only God that can save us from our present situation,” the bishop said. “Our hope in Him is never in vain since he knows our problem and He will deliver us one day just as he delivered the people of Israel from the hands of the Egyptians,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742563142.754132}