{"duration": 0.29975104331970215, "input_args": {"text": "'When Julia Jones arrived at her office in Santa Monica at 8 a. m.  —   by Hollywood screenwriter standards, the crack of dawn  —   she found Stephen K. Bannon already at his desk, which was cluttered with takeout coffees. They were   on a Ronald Reagan documentary, but Mr. Bannon had pretty much taken it over. He had been at work for hours, he told her, writing feverishly about his political hero. Today, with Donald J. Trump, whose election Mr. Bannon helped engineer, on the threshold of power, the 2004 film “In the Face of Evil” has a prophetic ring. Its trailer has an    apocalyptic feel: lurid footage of bombs dropping on cities alternating with grainy clips of Reagan speeches, as a choir provides a soaring soundtrack. The message: Only one man was up to the challenge posed by looming domestic and global threats. “A man with a vision,” the trailer says. “An outsider, a radical with extreme views. ” The Reagan presidency has been a recurring touchstone for Mr. Bannon since 1980, when as a    Navy officer he talked his way into Mr. Reagan’s election night celebration. It was at an early screening of “In the Face of Evil” that he met fellow Reagan admirer Andrew Breitbart, the budding conservative media provocateur. Breitbart. com’s scorn for Muslims, immigrants and black activists drew a fervent following on the   an extremist fringe of message boards and online magazines popular with white supremacists, and after Mr. Bannon took control of the website in 2012, he built a raucous coalition of the discontented. More quietly, Mr. Bannon systematically courted a series of politicians, especially those who share his dark, populist worldview: at home, a corrupt ruling class preying on working Americans globally, “the   West” in a “war against Islamic fascism. ” They were views that placed him closer to the European right than to the Republican mainstream. He made flattering films about Michele Bachmann, the former congresswoman from Minnesota, and Sarah Palin, the former Alaska governor and   candidate repeatedly pressed the television host Lou Dobbs to run for office and flirted with a range of Republican presidential hopefuls, including Rick Santorum, Ben Carson and Senator Ted Cruz of Texas. Finally, in Mr. Trump, Mr. Bannon found his man. Mr. Bannon told a colleague in multiple conversations during the presidential campaign that he knew Mr. Trump was an “imperfect vessel” for the revolution he had in mind. But the upstart candidate and the media entrepreneur bonded anyway. In August 2015, Mr. Bannon told Ms. Jones in an email that he had turned Breitbart, where employees called certain political stories “Bannon Specials,” into “Trump Central” and joked that he was the candidate’s hidden “campaign manager. ” He hosted Mr. Trump for friendly radio interviews and offered tactful coaching. This August, with the Trump campaign foundering, Mr. Bannon took over as chief executive. Like Reagan, Mr. Trump addressed the people he called “the forgotten men and women of our country”  —   the white working and middle class. He vowed to take on Islamic radicalism, as Reagan had faced off against communism. Echoing the   theme of “In the Face of Evil,” Mr. Trump declared of the nation’s predicament, “Only I can fix it. ” Ms. Jones, for one, had no trouble seeing the parallels. “Trump,” she said, “is Steve’s Reagan. ” Mr. Trump, of course, is not Mr. Bannon’s creation, and the   would not take kindly to any such implication. (Asked on Tuesday by New York Times journalists about Mr. Bannon, Mr. Trump praised him but said, pointedly, “I’m the one who makes the decisions. ”) But Mr. Bannon understood better than any other 2016 campaign strategist how many voters were seeking dramatic change, said Patrick Caddell, a veteran pollster, who all but predicted a Trump victory on election eve as most pundits were calling the race for Hillary Clinton. “He’s been the forerunner intellectually of this moment,” Mr. Caddell said. “His ideology is that of the outsider and the insurgent. ” To understand what to expect from the Trump administration means in part to fathom the driven, contradictory character of Mr. Bannon, whom the   has named senior counselor and chief White House strategist. Rarely has there been so incendiary a figure at the side of a   thrilling Mr. Trump’s more extreme supporters while unnerving ethnic and religious minorities and many other Americans. How did this son of Richmond, Va. who attended Harvard Business School, spent years at Goldman Sachs and became wealthy working at the intersection of entertainment and finance come to view the political and financial elites as his archenemy? Why does a man who calls himself a “  capitalist” rail against “globalists” of “the party of Davos” and attack the Republican establishment with special glee? As a filmmaker, Mr. Bannon, 63, has cited both the Nazi propagandist Leni Riefenstahl and the   documentarian Michael Moore as models. In top physical shape as a young Navy officer, and for years wearing the banker’s uniform of expensive suits, Mr. Bannon has in recent years sported flannel shirts and cargo pants. With a paunch and a sometimes scraggly beard, Mr. Bannon has a rugged look that Stephen Colbert described as “Robert Redford dredged from a river. ” He is an avid reader of history, fond of citing Plutarch and Plato, and his career reflects a restless, eclectic mind. He has conceived a rap musical based on Shakespeare’s “Coriolanus” (never completed) overseen the troubled Biosphere 2 project, an experiment in the Arizona desert meant to mimic the earth’s ecosystem acquired partial rights to “Seinfeld” before it became a megahit moved to Shanghai to run a company marshaling Chinese computer gamers to earn points for Western players and produced films on Washington corruption, Occupy Wall Street and Phil Robertson of “Duck Dynasty. ” Vociferous critics of his appointment, a diverse group that includes the conservative   host Glenn Beck and Senator Bernie Sanders of Vermont, who challenged Mrs. Clinton for the Democratic presidential nomination, have variously called Mr. Bannon a racist, a sexist, an   and an Islamophobe. Interviews with two dozen people who know him well, however, portray a man not easily labeled, capable of surprising both friends and enemies, with unshakable   and striking intensity. (Mr. Bannon turned down a request for an interview, saying he was too busy with the presidential transition.) Fans and foes agree that he is a “screamer,” a volcanic personality who sometimes resorts to offensive or hyperbolic language. One of his three former wives claimed in court papers that he had said he did not want their twin daughters to go to school with Jews who raise their children to be “whiny brats,” a claim Mr. Bannon denies. In a 2011 radio interview, he dismissed liberal women as “a bunch of dykes that came from the Seven Sisters schools. ” In a radio interview last year with Mr. Trump, Mr. Bannon complained, inaccurately, that “  or   of the C. E. O.s in Silicon Valley are from South Asia or from Asia. ” He has sometimes portrayed a grave threat to civilization not just from violent jihadists but from “Islam. ” He once suggested to a colleague that perhaps only property owners should be allowed to vote. In an email to a Breitbart colleague in 2014, he dismissed Republican congressional leaders with an epithet and added, “Let the grass roots turn on the hate. ” “No one has called him nice,” said Patrick McSweeney, a former chairman of the Virginia Republican Party and a Bannon admirer who has known his family for years. “He is the least politically correct person I know. His overriding concern is getting the mission accomplished. ” Mr. Bannon encouraged clickbait incitement on Breitbart. com, and links to Breitbart articles are often spread on Twitter and Facebook alongside Nazi rhetoric and racial slurs. Saying he is an economic nationalist and not a white nationalist, Mr. Bannon has dismissed such devotees as the kind of marginal characters who turn up in every political movement, but he has only mildly denounced the bigots among his admirers. Some longtime associates said they had never heard him express bigoted views. “In the 14 years I’ve known him, I’ve never heard him utter a racist or   comment,” said Peter Schweizer, a conservative author and the president of the Government Accountability Institute, where Mr. Bannon was a founder and the executive chairman. Mr. Bannon’s backers note that several of Breitbart’s top editors and managers are Jewish  —   as was Mr. Breitbart himself  —   and the site is staunchly  . They also point out that Mr. Bannon’s longtime assistant, Wendy Colbert, is   so are Sonnie Johnson, a conservative writer he promoted on Breitbart, and a former Goldman colleague who has been a close friend for three decades and considers Mr. Bannon family, but who asked not to be named to avoid a flood of media attention. Mary Beth Meredith, Mr. Bannon’s sister, said accusations of personal bigotry against him were “absolutely absurd. ” “We have interfaith marriages in our own family,” she said. “We have interracial marriages  —   our family is a microcosm of the U. S. ” Where some perceive racism and nativism, others see a different  : opportunism. Whatever may be in his heart, they say, Mr. Bannon was happy to draw a white nationalist following to Breitbart, while denying that was his intent. Ben Shapiro, a former Breitbart editor who has been sharply critical of Mr. Bannon, called him “a manipulator” who had “mainstreamed”   extremists for cynical political purposes. Ms. Jones, Mr. Bannon’s former film collaborator, who describes herself as very liberal, said, “Steve’s not a racist. ” But, she added, “he’s using the    —   using them for power. ” Robin Mickle, a fellow Navy officer of Mr. Bannon’s aboard the destroyer Paul F. Foster, remembers that he and some of his idealistic mates were struck by something Mr. Bannon told them in 1978. “He said he joined the Navy so it would look good on his résumé because he wanted to go into politics someday,” said Mr. Mickle, a retired defense contractor. Another officer, Sonny Masso, who would stay in the Navy and eventually make admiral, recalls a devoted reader of The Wall Street Journal who picked stocks to buy through a San Diego broker and had an astonishing ability to retain information. He was fit, too. “He’d run five miles at lunch and he had a   waist,” Mr. Masso said. “Very preppy when we were out of uniform  —   polo shirts with alligators on them, and penny loafers with no socks. ” Mr. Bannon was the middle child of five in an Irish Catholic family from a leafy North Richmond neighborhood. His father, Martin, 95, to whom he remains very close, was a telephone lineman who had worked his way into middle management at the phone company. Steve and his two brothers went to Benedictine High School, an   Catholic military school in Richmond where the boys wore uniforms, kept their hair short and were called cadets. “It was a very conservative world,” said John Pudner, a Benedictine graduate who knows Mr. Bannon and runs Take Back Our Republic, an advocacy group based in Alabama. Steve was bit of a brawler as a boy, said his older brother Mike Bannon. “He was a fighter. He was a guy that believed what he believed. ” On occasion, Steve summoned Mike to the neighborhood pool for reinforcement. “He’d get in little scrapes and come back and get me, and I’d say, ‘I wished it wasn’t eight guys we were fighting. If it was two or three, I wouldn’t mind. ’” Mike Bannon, eager to rebut charges of racism against his brother, said the boys took two buses to get to Benedictine, and their parents instructed them to give up their seats if a woman boarded: “It didn’t make any difference if they were black or white or Indian or Jewish or anything else,” he said. Their mother, Doris, who died many years ago, loved to tell them about sneaking Jewish friends into her neighborhood pool in Baltimore  —   past a sign that said “No Jews Allowed. ” She later worked on campaigns for Douglas Wilder, a Democrat who became the first   governor of Virginia. For Mike Bannon, his brother Steve is “a son of the South” who has never shifted his principles or his character. “He knew who he was in fourth grade and he’s never changed much over the years,” he said. “He’s very comfortable in his own skin. ” At Virginia Tech, Steve Bannon got his first taste of politics, winning the Student Government Association presidency in a 1975 race that grew quite heated after he challenged the status quo. An opponent, Gary Clisham, told the student newspaper that Mr. Bannon had “immense charisma” but predicted that he would get nothing done. After graduation, Mr. Bannon joined the Navy, attended Officer Candidate School and served two deployments aboard the Foster, a destroyer that took him all over Asia and into the Persian Gulf. His basketball style  —   running the length of the court without passing  —   earned him a sarcastic nickname,    said Mr. Masso, his shipmate. Still, he said, Mr. Bannon was popular with the sailors he led in the engineering department, nearly 50 men, the majority of them   Hispanic or Asian. Though his family had Democratic roots, Mr. Bannon, like most of his fellow officers, was scornful of President Jimmy Carter and entranced by Ronald Reagan. At Mr. Masso’s condo, while they watched the two candidates’ debate on television in 1980, Mr. Bannon could hardly contain his excitement. “He was pacing my living room, and whenever there was a   he’d say, ‘Yeah!’ like we were watching a boxing match,” Mr. Masso said. When Mr. Bannon heard later that the Reagan election night party was planned for a Los Angeles hotel, the Century Plaza, he worked the phones to try for tickets. When he got the brushoff, Mr. Masso said, Mr. Bannon said, “Hey, listen pal, we just got back from the Persian Gulf. ” Soon, he had Reagan aide Lyn Nofziger on the phone saying, “The governor would be honored to have you there. ” It was 4 a. m. when their group left the victory celebration to return to the ship, Mr. Masso said. Both men went on to take Pentagon jobs, and Mr. Bannon earned a master’s degree in international relations at Georgetown at the same time. Mr. Masso thought his friend might try to get into politics, but he was accepted at Harvard Business School, and he left the Navy in 1983 to begin a new life. Friends at Harvard and later at Goldman Sachs were aware of Mr. Bannon’s conservative views, but politics was rarely discussed. “He was in mergers and acquisitions, I was in corporate finance, and we were both working 100 hours a week,” said Scot Vorse, who met Mr. Bannon on their first day at Harvard and joined Goldman at the same time. After less than four years, Mr. Bannon left Goldman to start his own firm, Bannon  Co. which Mr. Vorse soon joined. As head of a scrappy   going up against financial behemoths to get Hollywood deals, Mr. Bannon showed the fierce competitiveness that would later drive his politics. “We were the underdog,” Mr. Vorse said. “We were competing for the business of the biggest entertainment companies in the world, and we did well. ” Mr. Vorse said Bannon  Co. represented the Saudi businessman Prince Alwaleed bin Talal the Italian media tycoon and later the prime minister Silvio Berlusconi Samsung Westinghouse and other big players. Mr. Vorse was the detail man, he said. Mr. Bannon “was the visionary, seeing things before anyone else. He was the rainmaker. He was a leader. ” Even as they became successful, Mr. Bannon was not a lavish spender. “He was driving an    Celica convertible,” he said. In fact, Mr. Bannon appears to have gone through some lean moments in the 1990s  —   court records show five federal and four state tax liens for amounts from $10, 993 to $136, 610. Ms. Jones, his film collaborator, said that when Mr. Bannon and his second wife, Mary Louise Piccard, separated, he lived for a time in a spare room at the home of his first wife, Cathleen Houff Jordan. Ms. Piccard had accused Mr. Bannon of grabbing her wrist and neck during an argument, an allegation he denied. But in 1993, as part of the sale of Castle Rock Entertainment to Turner Broadcasting System, he acquired a share of the royalties from “Seinfeld,” a move that would prove extremely lucrative as the show became a cultural force. In 1998, Bannon  Co. was acquired by Société Générale, and Mr. Bannon ran a series of companies working at the intersection of entertainment and finance. “Very intense, very passionate,” said Trevor Drinkwater, who worked with him in film distribution from 2004 to 2010. “I was impressed that while he was very right wing, he had a lot of liberal friends. ” He saw Mr. Bannon’s dress evolve toward the casual, “the flannel shirt over the polo shirt. ” Through films, Mr. Bannon was turning his attention back to politics. Tim Watkins, his   on the Reagan documentary, said Mr. Bannon worked from 7 a. m. to 2 a. m. “I’ve never known him to, say, go to a ballgame,” he said. But Mr. Watkins found his collaborator’s combativeness wearying. “Steve thinks everything has to be a fight,” he said. Once, an argument broke out when he told Mr. Bannon that the rough cut of the film, at two hours and 10 minutes, should be trimmed further. Angry, Mr. Bannon “actually flipped over the table,” Mr. Watkins said. At first, he recalled, before the Sept. 11, 2001, terrorist attacks, they intended to make a standard biopic. But the attacks “changed the film radically,” Mr. Watkins said. Mr. Reagan’s Cold War battles merged with the coda, which showed the hijacked airliners hitting the World Trade Center and people jumping to their deaths. “Steve crafted a lot of the big ideas,” Mr. Watkins said, notably that “life is a battle of good and evil, and history repeats itself. ” Lou Cannon, a Reagan biographer, rejects comparisons of Mr. Reagan and Mr. Trump. He notes that Mr. Reagan had been governor of California before becoming president, never demonized opponents and signed a law giving amnesty to three million undocumented immigrants. Nonetheless, Mr. Watkins sees striking similarities and is sure Mr. Bannon does, too. In the Reagan memorabilia he accumulated while working on the film, Mr. Watkins said, he recently found some lapel stickers. “Let’s Make America Great Again,” they read. When his eldest child, Maureen, got into West Point, Mr. Bannon was thrilled and joked about switching his allegiance to Army from Navy. He never missed her volleyball games, and he was at Fort Campbell, Ky. in 2011 when she returned from a deployment to Iraq. “That was one of the greatest feelings I’ve had, seeing my dad when I walked off the plane,” she said. But through his daughter’s service, he saw an inequity that fueled his anger at the privileged Americans among whom he had long worked. At West Point, “he saw a complete, utter lack of people from the upper economic levels of American society,” said Mr. Schweizer, the conservative writer. “He thought it was appalling, especially because the elite set so many policies that sent these kids into war. ” Mr. Bannon was put off by the George W. Bush administration’s creation in 2003 of the Medicare prescription drug benefit, which he saw as a blatant giveaway to the pharmaceutical companies. The financial collapse of 2008 and the bailouts that followed infuriated him, including the devastating effect of the stock market collapse on the retirement accounts of men like his father, a phone company retiree. Mr. Bannon often spoke to friends about his father’s “honest work,” contrasting it with the   he had seen on Wall Street. “We consider ourselves middle class, and we think the middle class has been shafted,” Mike Bannon said. “Black, Hispanic, white, everybody. The political class has given them happy talk but delivered nothing. I think that’s what Steve’s talking about. ” By the time of a Tea Party gathering in 2010 in New York, Steve Bannon had fully embraced a   diagnosis of the country’s woes: “In the last 20 years, our financial elites and the political class have taken care of themselves and led our country to the brink of ruin,” he said. By contrast, he said, the Tea Party was backed by “the people who fight our wars, pay our taxes, run our civic organizations, who build our cities and who hold our neighborhoods together. ” Mr. Bannon honed his message as he reached out to politicians, beginning with his films about Mrs. Bachmann and Ms. Palin. He criticized the conservative elite, including some of his former business colleagues. “The reason I made these films is my buddies on Wall Street said, ‘These women are a bunch of bimbos,’” he told a 2011 gathering. “I said, ‘I know Governor Palin and Congresswoman Bachmann  —   they’re every bit as tough and smart as you guys are. ’” At times, Mr. Bannon’s rants against the ruling class  —   in which he is at least as unsparing of Republicans as of Democrats  —   strikingly echo populists on the left. In a revealing 2014 talk via Skype to a Vatican conference, some of his words might have come from Senator Elizabeth Warren of Massachusetts or Mr. Sanders of Vermont. “Not one criminal charge has ever been brought to any bank executive associated with the 2008 crisis,” Mr. Bannon fumed. “And in fact, it gets worse. No bonuses and none of their equity was taken. ” But if his scathing economic analysis sometimes seemed to dabble in Marxism, on other subjects, including race and religion, he made no concessions to political sensitivities. After Mr. Bannon met Mr. Breitbart at the 2004 screening of “In the Face of Evil,” the two men hit it off, bonding over their similar views and a common irreverent streak. Ms. Jones, the film colleague, said that in their years working together, Mr. Bannon occasionally talked about the genetic superiority of some people and once mused about the desirability of limiting the vote to property owners. “I said, ‘That would exclude a lot of ’” Ms. Jones recalled. “He said, ‘Maybe that’s not such a bad thing.’ I said, ‘But what about Wendy? ’” referring to Mr. Bannon’s executive assistant. “He said, ‘She’s different. She’s family. ’” Mr. Bannon’s   friend from his Goldman years said that he had been at pains to defend him in recent years to mutual acquaintances put off first by Breitbart’s reputation and now by Mr. Bannon’s association with Mr. Trump. Most Christmas seasons over the past two decades, he said, Mr. Bannon was “my only token white guy,” or one of two or three, invited to an annual dinner at a New York City club for nearly a score of   friends who work or worked in finance. “Now I’m getting a lot of, ‘What happened to Steve? ’” from concerned black acquaintances, the friend said. He said he hoped Mr. Bannon  —   and more important, Mr. Trump  —   would more forthrightly denounce the bigots who have cheered them on. Still, he said, he completely rejects the accusations against Mr. Bannon. “Hell, no, he’s not a white nationalist,” the friend said. Mr. Bannon took over as executive chairman of Breitbart News in 2012 after Mr. Breitbart died, playing a   role in assigning, approving and sometimes dictating changes to articles, according to several former Breitbart employees. Staff members grew polarized for or against him. Most of them spoke on the condition of anonymity because they had signed a nondisclosure agreement. They describe a decentralized operation overseen by Mr. Bannon in two conference calls a day. Employees rarely had any idea where their peripatetic boss was because he seemed to be constantly moving between homes, offices or borrowed premises in Florida, Washington, New York and occasionally Los Angeles or London. Mr. Bannon’s critics assert that he sometimes put his political preferences ahead of fairness or even of the facts, directing that stories be rewritten to his specifications and shrugging off protests that his changes might make them inaccurate. While Breitbart did not traffic in outright racial slurs, it specialized in inflammatory coverage of police shootings, immigration and Islam in ways intended to prick liberal pieties. Alex Marlow, the editor in chief of Breitbart, denied that Mr. Bannon ever deliberately permitted an inaccurate story to run on the site. “Breitbart represents certain values, like conservatism, populism and nationalism, and Steve Bannon wanted our content to reflect that,” Mr. Marlow said. He said the site has 45 million readers and should not be judged by “a couple thousand people on Twitter” who express offensive views. In 2011, as Mr. Trump pondered a 2012 presidential run, David Bossie, a conservative activist who headed Citizens United, took Mr. Bannon to Trump Tower in New York to meet him. “They definitely hit it off,” said Mr. Bossie, who has collaborated with Mr. Bannon on a series of films. Mr. Trump and Mr. Bannon had in common a willingness to defy some   conservative notions  —   for instance, by pushing for a large, costly infrastructure plan to create jobs. Mr. Bannon was deeply impressed in 2014 when an insurgent Virginia Republican, David Brat, managed an unexpected primary race upset of Representative Eric Cantor, the House majority leader. “He began casting around for other unconventional candidates to support  —   people that were not a part of the establishment and would run populist campaigns,” Mr. Schweizer said. As Mr. Bannon became a steadily more obvious supporter of Mr. Trump, some Breitbart editors and reporters thought he was turning a news site into a propaganda platform  —   though other staff members approved. Mr. Shapiro was the most outspoken critic, saying that Mr. Bannon had “betrayed” Mr. Breitbart’s mission of “fighting the bullies. ” “In my opinion, Steve Bannon is a bully, and has sold out Andrew’s mission in order to back another bully, Donald Trump,” Mr. Shapiro wrote in a statement when he quit Breitbart in March in support of Michelle Fields, a Breitbart reporter who had been roughly grabbed by Corey Lewandowski, then Mr. Trump’s campaign manager. “He has shaped the company into Trump’s personal Pravda. ” If the criticism bothered Mr. Bannon, he did not show it. He was already deeply involved in advising Mr. Trump, and he believed, unlike most pollsters and pundits, that the chaotic,   campaign had a chance. One warm evening in August, after Mr. Trump called on Mr. Bannon to take charge of the campaign, Mr. Caddell, the pollster, met with him at a New York hotel, sitting outside on a veranda. Mr. Bannon said he knew the campaign needed discipline, with Mr. Trump more consistently presenting himself as a populist outsider, Mr. Caddell recalled. “He said, ‘Believe me, I’m going to bring this home. I know what needs to be done, and I’m going to do it,’” Mr. Caddell said. Whatever Reagan scholars like Mr. Cannon might say, Mr. Bossie, who also joined the Trump campaign, said that he and Mr. Bannon discussed Reagan parallels as they saw huge crowds waiting for hours to hear Mr. Trump. Mr. Reagan had run when many voters felt the country was threatened at home and abroad, Mr. Bossie said. “You can see the same things today with Donald Trump  —   that America has lost its way and it’s lost its strength, and Americans are looking for leadership,” he said. Kellyanne Conway, who took the job of campaign manager when Mr. Bannon became chief executive, would later call him “the general” who made many critical decisions. He pushed for Mr. Trump to visit Flint, Mich. where the water supply was contaminated with lead, and to appear at a black church. Mr. Bannon also hugely accelerated the tempo of what he thought had been a    campaign. After a devastating recording surfaced of Mr. Trump bragging about sexually assaulting women, it was Mr. Bannon’s idea to “race to the bottom” by inviting women who had accused former President Bill Clinton of sexual abuse to attend a presidential debate, according to another campaign official. Mr. Bannon believed airing the competing accusations would allow the campaign to return more quickly to the core issues of American nationalism and a suffering middle class, the official said, speaking on the condition of anonymity about internal discussions. In the final weeks of the campaign, Mr. Bannon was sure the polls pointing to a Clinton victory were wrong, other campaign officials said. His family, including all four siblings and his    father, made the trip to New York City for election night. For Mr. Bannon, the long night at the New York Hilton was his second presidential campaign victory gathering, coming 36 years after the first. At 4:30 a. m. Mr. Vorse, his former colleague, reached him to offer congratulations. He was reminded of their Hollywood days, when “we would have victories and Steve would celebrate for two seconds, and then it was on to the next thing. ” “He said, ‘I got to go because we have a meeting in three hours. I got to hop. ’”'"}, "time": 1742628450.2284927}