{"duration": 0.10561466217041016, "input_args": {"text": "'World Events and the Bible \\nThe United States of America. Once blessed, once great. Have you ever asked yourself why this nation was once blessed? Why and how did this nation become the greatest nation on the face of the earth? It was because we put our Father first, He was not only a part of our lives, He was a part of the nation itself. For decades we have allowed officials and presidents into power that do not know our Father. We have embraced church leaders who do not know God, instead, they lean on their own understanding ( Jeremiah 17:5 , Proverbs 3:5 ) . “ We The People ”, as a whole, as a nation have lost our way. We have lost sight of the fact that it was God, our Father in Heaven who blessed this nation and made it great, not us or those we allowed to enter into office. \\nThis year like so many times before we are faced with a presidential race “ that is the most important in history ”. There are only two candidates, both of which were forced on us by the children of Satan and their mainstream media. Donald Trump the Republican candidate and Hillary Clinton the Democratic candidate. Nearly 90% of you did not want either of them to be your president to begin with. Yet here we are, days away from the election and all the people can say is vote for Trump or Clinton. \\nWhat about making a stand against the establishment who is forcing these two candidates down your throat? Most of us do not want either of them in office, so instead of accepting the principles and morals of the two candidates, let us discuss with our fellow men why these two have been allowed to run in the first place. Why are they our selections if we did not want or choose them? That is the topic we should be discussing. \\nWhy do we not reject both candidates and the entire system that is falsely claiming we have an actual choice? The system that is forcing us to accept these two unwanted people as the next president of the most powerful nation on earth. \\nNationally that discussion is not likely to occur as we are predisposition to discuss only what the mainstream media drums into our minds as truth. Their truth is Donald Trump and Hillary Clinton. Can we not think for ourselves or is this too controversial to discuss with family and friends? Our lack of reason, our lack of ability to think for ourselves is yet another reason why we find ourselves in this boat, because we have allowed our voices to be silenced. Because we have allowed our ideals and principles to be stepped on and our morals to be manipulated into worthlessness. \\nDo you realize Jesus Christ did not come to send peace on the earth or to fix all your problems? Out of His own mouth, “ Suppose ye that I am come to give peace on earth? I tell you, Nay; but rather division ”, ( Luke 12:51 ) . Christ did not come here to talk sweet to everyone and tell them what they wanted to hear. He came to divide the righteous from the evil. He came to tell us the truth and we should do the same even if it rattles some nerves. By voting for evil, even if it is the lesser of two evils, you are still voting for evil. Voting for any evil is not following Christ. By voting for any evil you are allowing yourself to be divided and you are not choosing to stand with God. \\nLet us talk about that division for a moment and turn your Bible with me to, \\nHebrews 4:12 12 “For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.” \\nTo divide soul and spirit, this is a spiritual war of good and evil. Between God and Satan. Who will you stand with? It is not easy to swing this Sword of truth. Making a stand against the majority has never been an easy task, but with our Father we can succeed. We can stand! \\nRevelation 18:4 4 “And I heard another voice from heaven, saying, Come out of her, my people , that ye be not partakers of her sins, and that ye receive not of her plagues .” \\nThis voice from Heaven is telling us to remove ourselves from the children of Satan’s government and not participate in it. This voice from Heaven is telling you to make a stand for God or reap the rewards for standing and supporting evil. \\nThere is a great storm coming on the earth my friends and all we can see are the dark clouds on the horizon approaching at this point in time. If you cannot see through the lies and deception of the storm that is far away. How will you ever be able to stand for God and weather the storm that is coming? How will you be able to weather the storm when it is overhead? Satan’s storm of lies and deception. \\nLet us talk about more truth. \\nNeither political candidate; Hillary Clinton or Donald Trump have this nations or your best interests at heart. There is no question about it, Hillary Clinton is in bed with the globalists. From where I sit she would be the perfect candidate to finish the destruction of this nation. Donald Trump on the other hand touts his slogan, “ Make America Great Again ,” yet America will never be great without our Father. No man on the face of this earth can make America great without our Father being involved. I have seen nothing from Trump to indicate he stands for God, quite the opposite. I have heard him tell me how I should allow a transgender man in the bathroom with my daughter. I have heard him tell me how sinless he is and how he wants to remove some of our firearm rights and of course he wants to sick NATO on sovereign nations . \\nYou might say, “ it is our duty to vote for the candidate who is most in line with God ”. I would say, “ you are still voting for evil ”. \\nWhy should we do that? Because it is Godly? Because that has worked so well in the past? Because it has worked so well Americans continue to lose their freedoms, so well our men and women continue to fight endless wars to serve the globalists and so well we have record abortion and STD levels in this nation? Voting for evil has never worked, all it has done is led this country to depravity and ruin. We see this with our own eyes year after year, but we vote for the lesser of two evils as if we will really expect to see a different result. \\nWe are told “ We The People ” have a choice and that we can control our future. If that were true we would see two worthy candidates on the television. We would have voting machines that did not flip the entered vote. We would not have dead men and women voting. We would not have illegal aliens bused into the polls to vote. If that statement were true my friends we would not have the Electoral College vote that overrules your vote and makes your vote 100% void and puts into office who they want, not who you choose. Think about that for a moment. Do you understand? Your vote means nothing. Your vote does not count. They are merely making it appear as if your vote counts, but it is a horrible lie. The two party system is a lie, a ploy to deceive you into believing “ We The People ” are in control. You have no choice for president and you have no voice because you have allowed yourself to be silenced by not questioning why these two are our “ choices ” to begin with. How did that happen when 90% of us did not want either one of them in office? The rights “ We The People ” supposedly enjoy have been subverted, stolen and you are being led and deceived by evil people who have in effect enslaved the nation and the nation is still completely blind to it. \\nThe fact is the candidate the children of Satan want in office will make it into office. If by some chance a candidate made it into office they did not want, that person would be removed through death or other means and I think both Kennedys are a perfect example of that. Make no mistake about it, the United States is the tool of the children of Satan. We have been enslaved and deceived into forcing the free nations of the world into a one world government. The children of Satan are extremely close to obtaining their one world government and they are not going to miss any opportunities to advance their agenda. Keeping you in a state of false hope, of false choice for your next “ leader ” is key to their success. \\nLet us talk about even more truth. \\nThis nation will not turn around because a man or woman of God is not going to inherit the White House, plain and simple. No matter who occupies the White House in January, these things are certain. We are witnessing the final events of this age of flesh and they are coming to pass rapidly. We will have a one world government that will receive a Deadly Wound to its structure, one the children of Satan cannot heal. However, Satan, their father will heal this Deadly Wound when he is cast from Heaven to earth. The world will be in such disarray the people will cling to Satan who they perceive to be Christ , they will accept him as Christ and the kingdom he establishes on earth . At the midst of the week, the Saints will stand for our Father along with the Two Witnesses and our Lord and Savior Jesus Christ will return and reign as King over the entire earth. \\nIn closing, please turn your Bible with me to, \\nDaniel 2:21 21 “And he changeth the times and the seasons: he removeth kings, and setteth up kings : he giveth wisdom unto the wise, and knowledge to them that know understanding:” \\nWho sets up kings and removes them? You and I at a rigged ballot box? No. Your Father in Heaven does. He not only sets up kings and presidents, but he removes them from power as well. We should all take comfort in knowing in spite of all the plans implemented by the children of Satan, our Father will select the candidate that will fulfill His Word. Our Father is almighty and powerful and we can take comfort in Him and His Word.'"}, "time": 1742628435.1079159}