{"duration": 0.11217427253723145, "input_args": {"text": "\"Rosneft restaurera une ancienne résidence des Romanov près de Saint-Pétersbourg 28 octobre 2016 TASS Le 25 octobre, le ministre russe de la Culture Vladimir Medinski a annoncé que le palais de Ropcha, dans la banlieue de Saint-Pétersbourg, serait loué à la compagnie pétrolière d’État Rosneft pour une durée de 99 ans. Le groupe va faire restaurer le monument en ruines et permettre aux touristes de visiter la résidence. Alors, que sait-on sur le palais et combien d'argent faudra-t-il pour le restaurer ? Facebook \\nRopcha. Crédit : Lori/Legion-Media Pourquoi le palais est-il célèbre ? \\nLe palais de Ropcha est une ancienne résidence des Romanov datant du XVIIIe siècle. Il fut construit sur ordre de Pierre le Grand et devait évoquer la station thermale de Karslbad (République Tchèque). Ensuite, durant le règne de l’impératrice Elisabeth, un nouveau palais de deux étages fut construit par l’architecte italien Bartolomeo Rastrelli, et un grand parc fut installé. \\nAprès la révolution de palais qui vit la destitution de Pierre III, celui-ci y fut exilé et y mourut dans des circonstances douteuses. Après la Révolution d’Octobre, le palais fut nationalisé et abrita une pisciculture, un sovkhoze et d’autres installations agricoles. \\nLe palais avant 1917. Crédit : domaine public \\nEn 1944, le palais fut brûlé par les troupes allemandes en retraite. Après la guerre, la propriété fut restaurée, il y fut d’abord stationné une unité aérienne, puis le bataillon de défense chimique du district militaire de Leningrad. \\nDans les années 1960, le palais fut placé sur protection de l’État, et il fut classifiéà la fin des années 1970. Lire aussi : Gatchina, ce pavillon de chasse qui est devenu un palais Combien d’argent faudra-t-il pour restaurer les ruines ? \\nBien que le palais soit inscrit au patrimoine mondial de l’ Unesco depuis 1990 et soit protégé par l’État, la plupart de ses bâtiments sont en ruines. Le palais fut sérieusement endommagé par une série d’incendies à la fin des années 1980 et au début des années 1990. En 2016, cinq colonnes du portique de la façade se sont effondrées. Après cette dernière catastrophe, le ministère russe de la Culture eut alloué 15 millions de roubles (220 000 euros) à des travaux urgents pour sauver le monument. \\nLe palais est en ruines aujourd'hui. Crédit : Kommersant. \\nAu palais de Peterhof, on fait la constatation que de nombreux bâtiments de Ropcha sont fortement endommagés, et certains, comme les ponts et les équipements hydrauliques, sont totalement détruits. Le coût total de la restauration pourrait dépasser les 5 milliards de roubles (72 millions d’euros). Lire aussi : La Nouvelle-Hollande, un îlot de détente en plein cœur de Saint-Pétersbourg Pourquoi l’État cherche-t-il des investisseurs pour restaurer ces monuments ? \\nLa grande difficulté et le coût de la restauration du patrimoine ne permettent pas toujours de mener ces travaux grâce à l’argent public. Il est donc souvent fait appel à l’argent de compagnies privées et de mécènes. Par exemple, la restauration du palais de Gatchina près de Saint-Pétersbourg fut largement financée par la banque VTB et l’usine de spiritueux de Gatchina, mais le monument resta propriété de l'État. \\nCrédit : Kommersant. \\nL’État peut décider de vendre aux enchères ou de louer des éléments du patrimoine culturel avec obligation de les restaurer. Depuis le 1er janvier 2008, il est possible de privatiser des monuments d’importance non seulement locale et régionale, mais aussi fédérale. \\nIl existe plus de cent exemples de telles privatisations assorties d’obligation de restauration. C’est ainsi qu’a récemment été ouvert à Saint-Pétersbourg le complexe Nouvelle Hollande, reconstruit grâce aux investissements de la société Novaya Gollandia development de Roman Abramovitch. \\nVersion abrégée d’un article de TASS Lire aussi :\""}, "time": 1742564607.284321}