{"duration": 0.2236011028289795, "input_args": {"text": "'It’s almost a coronation: Every year, the Sundance Film Festival anoints a darling or two  —   indie   who are poised to break out, usually with their first feature. (Geremy Jasper was one at the festival that just ended in Park City, Utah.) These lucky few tend to go on to   or critical success, maybe even the Oscars. Think Damien Chazelle, whose “Whiplash” was the toast of the 2014 season his “La La Land” is now the    . But what about the festival filmmakers whose works are lauded and distributed, but whose career paths are less charmed? After they’ve packed up their snow gear, there are tantalizing moments and deep frustrations. Many go on what’s known as the “water bottle tour,” meetings with development executives and agents in Los Angeles (where you’re more likely to leave with a bottle of Evian than a production deal). Most don’t have new scripts ready, a huge impediment, said the producer Anne Carey. Then they struggle against the industry’s narrow expectations. “Any person coming out of Sundance is in a box, particularly if you only have one film under your name,” said the filmmaker Justin Simien. “And if you happen to be in the black box or the gay box or the woman box, I think you’re in a smaller box. ” Meanwhile, the clock is ticking: “You have a whole year, and then there’s a whole new batch of kids at Sundance, and then it’s their year,” said the director Kat Candler. “Your spotlight has shifted. ” For three filmmakers  —   Mr. Simien, 33, from Los Angeles Ms. Candler, 42, who lives in Austin, Tex. and Sara Colangelo, 37, based in New York  —   who made their feature debuts in 2014, alongside Mr. Chazelle, what happened next felt like one step forward, two back. Their paths hold lessons for other artists and offer a glimpse into how Hollywood careers are really made. 2014 Two years before, Justin Simien quit his day job to make his debut feature, “Dear White People. ” He had worked in movie marketing, so he had some insider savvy. What he didn’t know was how his film, a satire of race relations set on a college campus, would be received by the mostly white audiences at Sundance. “I was kind of terrified, to be honest,” he said. “Dear White People” struck a chord, earning a festival award for breakthrough talent. A distribution deal soon followed. “I went into it just hoping that when I came out, I could at least pay my rent,” Mr. Simien said. “That didn’t happen. ” But in Los Angeles afterward, he was in demand, attending dozens of development meetings for months. He understood the process: “Part of being a development person is checking off the list” that you’ve met with Sundance alumni, he said. Nonetheless, it seemed like he had arrived. Even if the offers were not as big as those some of his white counterparts were getting  —   “Nobody was talking about ‘Jurassic World,’” he said, the film Colin Trevorrow landed after his Sundance debut  —   he didn’t feel pigeonholed. Several projects floated up, like a dark comedy with Anthony Mackie attached. Yet Mr. Simien was still strapped for cash. Driving to those Beverly Hills meetings, “I was afraid to pull up to the valet, because my hubcaps were falling off,” he said. In the spring, he sold a book version of “Dear White People” that kept him afloat financially. The film opened in the fall, to critical acclaim. 2015 As Mr. Simien toured with his film, he found a second career as a speaker, especially at colleges. “Any school that was dealing with a race issue would book the film and then book me,” he said. He made the movie to spark discussion, so these encounters were gratifying and meaningful. He jotted down stories he heard from the students, too. When a studio approached him about making a TV version of “Dear White People,” his notes  —   fresh ideas  —   were immediately useful. 2016 In May, Netflix announced the series. In June, Mr. Simien sat in a production space and marveled at his fortune. “I’m in an office! There’s a lamp from HomeGoods! It’s ” he said. He presided over a diverse writers’ room of seven people, discussing civil rights, “blacktivism” and cultural identity. With the veteran showrunner Yvette Lee Bowser, he learned to make a TV series. 2017 “That was probably the hardest thing I ever did,” Mr. Simien said in January after finishing the show’s first season. Production had wrapped on Election Day the series’ themes were landing in a much more charged cultural landscape than where they were conceived. “This show is 100 percent part of the resistance,” he said. Mr. Simien is pleased with it but itching to get to other projects. “Creatively, I just need to prove to myself and to others in the industry, I’m not a   pony,” he said. Hiring for his series, he had noted that white male colleagues had been given more career chances. “The opportunities that I have tend to be ” he said, adding, “You just gotta keep grinding  —   which has worked out so far. ”  2014 The   Sara Colangelo arrived at Sundance that January with an ambitious debut, “Little Accidents. ” Set and shot in a West Virginia   town, with a sprawling story line, it was created after Ms. Colangelo won a coveted spot in the Sundance screenwriting and directing labs three years earlier, and secured a budget of $1. 2 million, all major for a   indie filmmaker. The cast  —   including Elizabeth Banks, Josh Lucas and Chloë Sevigny  —   was enviable, too. But even as she set out to unveil it, Ms. Colangelo said, she knew that her film was not exactly what she wanted it to be. “There were moments in the editing room where I was like, I’m enormously proud, but these things might not be working,” she said. Was the film too sad? How would the marketplace react? “I was aware of what the challenges were. ” The film came with    expectations. Critics at the festival praised the acting, though, and the  . Ms. Colangelo made the Los Angeles rounds that fall, and was sent a few scripts, but no jobs materialized. She made ends meet doing corporate videos. Financially, she said, “there were nine months or so where it was like, it’s going to be tough. ” 2015 “Little Accidents” made it to theaters a full year after Sundance. Reviews were largely welcoming, but it barely eked out $10, 000  —   total  —   at the box office. Still, Ms. Colangelo earned a nomination for best first screenplay at that year’s Indie Spirit Awards, and that led to a few    jobs, polishing other people’s work. In the meantime, she watched friends and Sundance alumni  —   mostly men  —   advance. Doubts crept in: Could she have done more on “Little Accidents”? Her male counterparts were often allowed reshoots. Somehow, for them, “the money was found. ” She asked herself, “What kind of leader do you have to be to get those things? Is it charisma? Is it truly gender?” She was buoyed when Israeli producers asked her to adapt an acclaimed,   foreign drama. (They declined to reveal it.) Ms. Colangelo worked on the script for months and finally signed a deal at the end of the year. 2016 As the Israeli film’s location and financiers bounced from Canada to New York, and casting decisions loomed, Ms. Colangelo hung on to direct. She vowed to be more flexible on production details and bolder in her focus on story. 2017 Her   was erased, replaced with excitement, and pride: She plans to begin shooting the new film this summer, shortly after the birth of her first child. “There’s this feeling that the industry sometimes gives you, that you have this window of opportunity after Sundance and if you don’t perform perfectly in that moment or have a perfect script, then the window shuts,” she said. “And I think that’s a dangerous way to think about it. ” Momentum, she discovered, can rebound. “And it’s O. K. to retrieve it and find it later. ” 2014 A   filmmaker with several shorts to her credit, Kat Candler landed at Sundance with the family drama “Hellion. ” “I was definitely hoping to get representation,” she said, a distribution deal and attention for other projects. She knew that breakout success was rare and that her route would be tough, especially without superlative reviews. A month later, she did her water bottle week in Los Angeles. “It felt like ‘The Amazing Race,’” she said, eight meetings a day. Little came of them. “Hellion,” starring Aaron Paul of “Breaking Bad,” opened in theaters five months later, and Ms. Candler hit the road to promote it. Live Q. and A. s, Skype sessions  —   “Anytime anybody asked, it was a yes,” she said. “It was exhausting, after a while. I wish someone had warned me. ” Her promotion helped, but not much “Hellion” just did not have the marketing dollars. In retrospect, she said, her efforts distracted her from “putting all the pieces for another project together. ” 2015 A year after Sundance, Ms. Candler was growing anxious. “I felt like, oh, what am I doing?” she said. But she was halfway into a   mentorship program, sponsored by the Sundance women’s filmmaking initiative. “The life coach was pretty transformative,” she said. She shelved her jealousy about others’ deals. “I can go write for four hours and feel a sense of accomplishment,” she said. A push to break into TV directing was fruitless, though. No one wanted to an untested TV director, even if she had already conquered the big screen. (Male directors, research shows, face a lower bar for hiring.) “Sometimes you just wonder, how much harder do I have to work to prove myself?” Ms. Candler said. Her life coach offered a mantra: You belong in the room. So at every meeting, she said, “I tell myself, ‘You’ve earned your space. ’” In the summer, she shot a campaign for Canon. Besides money from teaching a college class, it was her first real paycheck in years. Still, she worried about car insurance payments and other bills. 2016 Back in Los Angeles, Ms. Candler had meetings about a   feature she was writing. It could go indie or mainstream, depending on the stars and how much control Ms. Candler ceded. “Do I really want to go out for a project that doesn’t have great humanity? No,” she said. A turning point came in the spring, when she shot two episodes of “Queen Sugar,” the series created by Ava DuVernay that employs only female directors. No pitch meetings were necessary they knew each other through the festival circuit. The paucity of female directors has been a hot topic in Hollywood, but Ms. Candler was over it. “Just hire,” she said. “It really isn’t that hard. ” 2017 “Queen Sugar” was renewed, and Ms. DuVernay asked Ms. Candler to return, now as the producing director. Ms. Candler went on to shoot episodes of other series. She has work lined up through 2018. She felt confident before “Queen Sugar,” she said. “I just don’t think that people had confidence in us. Ava legitimized all of us. ” After 17 years in the field, she said, she was at last making a living as a filmmaker.'"}, "time": 1742561922.2657526}