{"duration": 0.12106704711914062, "input_args": {"text": "'Political Coup Underway in Venezuela   Tweet \\nBreaking news from Venezuela – the American puppet Henrique ‘Capricious’ Capriles along with his friends in the Venezuelan congress are attempting to engineer a political coup against President Nicolas Maduro. After years of attempting to oust the late Bolivarian President Hugo Chavez, the foreign owned opposition continue to harass his successor. The model which the Venezuelan insurgents seek to ape is that of Brazil which recently used congressional powers to remove the democratically elected President Dilma Rousseff. \\nThe move will likely fail, but it does demonstrate two important things. First of all, it shows how the right-wing forces in Latin America, so determined to push for US domination of their own countries, will stop at nothing to get their way, up to and including a total disregard for democracy. \\nSecondly, it demonstrates that under Barack Obama’s incompetent leadership, America can no longer control the destiny of the Latin American countries that Washington used to reign over like obedient right wing clients. Latin America is clearly going its own way from Ecuador to Venezuela to Uruguay. The way Latin America is choose is that of the left. \\nEven Brazil’s putative western puppet, the unelected Michel Temer hasn’t broken off his relations with the BRICS to which Brazil gives its first letter, in spite of many hopes in the west that he would do. From Manilla to Caracas, America is losing her erstwhile colonial playground. What’s more is that whilst the current Venezuelan congress has been publically accused of buying votes, the election of President Maduro has been approved as democratically fair by all but the most far-right, agenda observers. \\nVenezuela has in many ways replaced Cuba as the perennial leftist thorn in America’s near-abroad. There may well be: \\nWe will not allow a coup:Venezuela’s Maduro \\nVenezuela: Mass protest calls for Maduro’s resignation \\nStreet challenges power in Venezuela crisis'"}, "time": 1742563670.2332819}