{"duration": 0.18629002571105957, "input_args": {"text": "'Britain Should Embrace Unilateral Free Trade Right Now Unilateralism is not simply a utopian libertarian ideal Louis Rouanet | Mises.org   Image Credits: Iker Merodio / Flickr . \\nIf we read the newspapers or listen to the experts, Britain faces two ways to negotiate its way out of the European Union without succumbing to the protectionists’ sirens. \\nThe first is a deal à la Norway not only with full access to the common market, but also with full implementation of EU law and a contribution to the EU budget as is the case for every member State. The second option would be a trade treaty such as the one negotiated between the EU and Canada. However, a viable third opportunity exists: unilateral free-trade. \\nContrary to what is often assumed, unilateralism is not simply a utopian libertarian ideal which cannot be reached in today’s world. Unilateral free trade is genuine free-trade. It is also the most pragmatic and efficient strategy to foster commerce and peace. Theresa May seems ready to conduct an interventionist industrial and economic policy which oddly resembles French planning as it existed in the 50s and 60s. But, the free-market policy paradigm is more likely to transform post-Brexit Britain into a flourishing economy. \\nUnilateral Free Trade: The British Tradition \\nThe tradition of unilateral free trade is tightly linked to the UK. With the victory of the liberals in the 1840s, Britain became strongly committed to unilateral free trade and from 1845 to at least 1914, free trade was politically unassailable. Trade treaties, however, were seen as inherently suspicious. Sir Robert Peel, when announcing the repeal of the Corn Laws in the House of Commons in 1846, brilliantly warned: \\nI trust the government … will not resume the policy which they and we have found most inconvenient, namely the haggling with foreign countries about reciprocal concessions, instead of taking that independent course which we believe to be conducive to our own interests. … [L]et us trust that our example, with the proof of practical benefits we derive from it, will at no remote period insure the adoption of the principles on which we have acted. … Let, therefore, our commerce be as free as our institutions. Let us proclaim commerce free, and nation after nation will follow our example. This repeal of the Corn Laws was the result of an intense political effort, especially by Cobden and the Anti-Corn Law League, who made the case for unilateral free trade. Cobden in his later years explained: \\nWe came to the conclusion that the less we attempted to persuade foreigners to adopt our trade principles, the better, for we discovered so much suspicion of the motives of England, that it was lending an argument to the protectionists abroad to incite the popular feeling against the free-traders. … To take away this pretense, we avowed our total indifference whether other nations became free-traders or not; but we should abolish Protection for our own selves, and leave other countries to take whatever course they liked best. Some will argue that the UK soon departed from unilateral free trade with the Cobden-Chevalier treaty of 1860 which Cobden himself supported and negotiated. It is less known however that this treaty was primarily a way to avoid conflict. After Orsini’s attempt to murder Napoléon III in 1858, the emperor was convinced, by this same Orsini, to support the cause of Italian independence. This Italian question brought England to the edge of war with France. Being strongly anti-militarists, both Cobden and Chevalier looked at a trade treaty not primarily as a way to adopt free trade, but as a way to establish friendship between France and England. Gladstone, himself an ardent unilateralist, in retrospect held that “there were only two alternatives, one of them the French treaty & the other war with France.” And Cobden felt that the treaty was “God’s own method to produce an entente cordiale.” \\nCommercially, the treaty was an incredible success mainly because it was not supervised by bureaucrats — as is the case today with trade treaties — but by two prominent free traders. As Cobden was aware of all the dangers for real free trade contained in the negotiations of trade treaties, he proceeded very carefully. Cobden wrote in a letter to the great British free trader John Bright, “I will undertake that there is not a syllable on our side of the Treaty that is inconsistent with the soundest principles of Free Trade.” Nonetheless, Bright remained a skeptic and remarked: \\nGovernments seem as a rule to be standing conspiracies to rob and bamboozle people, and why should that of Louis Napoleon be an exception? The more I see of the rulers of the world, the less of wisdom or greatness do I find necessary for the government of mankind. To convince Cobden of the benefits brought about by a treaty, Michel Chevalier showed that the unilateral reductions of tariffs that Bright asked for could constitute the British side of the bargain and could be extended to all other nations, thus avoiding a clear violation of British unilateralism. \\nFree Trade With or Without You \\nThe unilateral free trade program is very simple: the British Parliament declares the abolition of all tariffs. To avoid a race in non-tariff barriers, the Parliament can pass a law declaring that every product which conforms to the EU norms and regulations can be sold freely in the UK. This should not be a problem since the UK still is a member of the EU. By Parliament’s act, most of the “non-tariff barrier” problem withers away without any need for regulatory harmonization. If the EU legislator considers it necessary to regulate the curvature of vegetables, so be it! But, although EU producers will be free to sell their product in the UK, the British legislator may deem it unnecessary to regulate its producers in the same absurd way. \\nThe advantages of this approach are many. First, the UK can have free trade now instead of waiting through years of negotiations. No need to wait for bureaucrats to agree on which laws we burden consumers and producers with. \\nThe Comprehensive Economic and Trade Agreement (CETA), for example, between the EU and Canada contrasts the expediency of unilateralism with endless negotiations. Negotiations about CETA were started in October 2008 and finished in August 2014. But for the treaty to be effective, each EU member State still has to ratify it. Worse, in some European federal member States, the treaty must be agreed upon by the local federated States. This is why Wallonia recently vetoed CETA, thus threatening the work of a six-year-long negotiation. In the case of the UK — and whether or not trade treaties are actually advancing free trade — the British economy cannot afford to wait that long for free trade. \\nThe second major advantage of unilateralism is the message you send to Brussels. You are signifying to the EU apparatus that “with or without you, we will have free trade!” At this point, the EU will have no leverage left with the UK. The negotiation of a trade treaty, on the other hand is a hopelessly utopian solution, not only because of the obvious coordination problem between the 28 EU member States, but also because the EU has a vested interest in making sure Brexit fails. Eurocrats, starting from the contestable assumption that the UK has much more to lose than the EU, will try to concoct a deal as bad as possible for their fellow Anglo-Saxon neighbors. \\nFree Trade First, Negotiations Later \\nStill, it is possible that after having declared free trade unilaterally, the EU will decide to restrict the access of British corporations to the single market. This is a particularly valid concern in the financial sector were banks and other financial institutions need licenses to operate in the EU member States. The concern with unilateral free trade is that by respecting it, it will remove any leverage the British government has to negotiate a favorable access to other actual and potential commercial partners. Without a treaty, commercial partners, it is thought, will soon erect protectionist barriers. \\nUnilateral free trade, however, does not mean the UK producers will be bullied without their government being able to respond. First, by declaring unilateral free trade, the maintained strength of commercial links made will make it much easier to negotiate with the EU. To antagonize a good client would be foolish. Let’s not forget that this past decade, British exports to the EU grew much slower than exports to the rest of the world. At the same time, the UK is a major consumer of EU products and its balance of commerce with the EU was negative by about £62 billion in 2014. \\nBut how can a country committed to unilateralism make sure other countries will not close their markets? Let us first remark that maintaining trade barriers to negotiate later with other nations is a self-defeating strategy. Sir Robert Peel, whom we mentioned earlier, said in 1842 that in the case of wine and brandy he did not reduce the duty, because he hoped that they might employ these duties “as instruments of negotiation, with a view of effecting a reduction in the duties imposed by other countries on the produce of our own country.” Such a strategy was self-defeating. Tariffs in view of a negotiation, by reducing the capacity of foreigners to produce for the British market, were destroying the very interests that wanted free trade. Peel finally admitted, in 1843, during a debate in the House of Commons, “I am bound to say that it is our interest to buy cheap, whether other countries will buy cheap or no.” \\nThere certainly is a more efficient policy than maintaining trade barriers or threatening to raise some in order to force trade “partners” to keep their markets open. Indeed, the British government can make it clear that if the EU unfairly penalizes British interests in some sectors, e.g., finance, then the British government will work to maintain the competitiveness of the industry in question by aggressively lowering their taxes. Imagine that the EU wants to damage Britain’s car manufacturers. Then the British government should not be afraid to create a loophole and to lower manufacturers’ corporate taxes — even to zero. In an economy which was never as globalized and competitive as today, the UK would have good chances of prevailing over the EU interests. \\nPerhaps the EU will consider making trading conditions with the UK harder, but they would have way too much to lose if doing so means creating a fiscally ultra-attractive market just next door. In the short run, unilateralism in trade can achieve what multilateralism cannot, a quick and radical liberalization of exchanges. In the long run, unilateralism can achieve what multilateralism cannot, genuine free trade.  '"}, "time": 1742561977.5352814}