{"duration": 0.12016558647155762, "input_args": {"text": "'The political news cycle is fast, and keeping up can be overwhelming. That’s why we’re collecting great political feature writing from The New York Times and around the web that offers context, analysis and insight. From The New York Times: “By any empirical measure, it is a level of activity that has never been seen. ” In a flurry of deregulation, the Trump administration has already suspended or reversed more than 90 rules. And industry is clamoring for more. _____ From The New Yorker: “It takes a lot to shock a lawyer, but I’ve had very few clients do so little due diligence. ”  The New Yorker’s Adam Davidson spent months investigating what he calls President Trump’s “worst deal,” the construction of Trump Tower in Azerbaijan’s capital city, Baku. Working with a family of oligarchs infamous for corruption and ties to Iran’s Revolutionary Guard, the Trump Organization may have committed a violation of the Foreign Corrupt Practices Act, according to the article. _____ From Politico Magazine: “The best way to understand how Trump might struggle to renegotiate [Nafta] is to understand how Obama already did. ” If you want to brush up on Nafta and the   Partnership trade deals, and learn about the pitfalls and complexities that lie ahead for the Trump administration, this feature is worth reading. _____ From American Affairs: “A revolt in the name of national sovereignty, not populism. ” In a new conservative quarterly, American Affairs, a Georgetown professor, Joshua Mitchell, charts the historical and cultural conditions that led to Mr. Trump’s victory, and suggests a path forward for the Republican Party. The piece helps explain how   intellectuals on the right understand this political moment. (Here’s a profile of the founders of American Affairs.) _____ From National Review: “It is in the nature of trains that they tell you where to go it is in the nature of automobiles [  …    ] that you tell them where to go. ” Talking about health care (and its reform) often necessitates elaborate metaphors. In National Review, one author compares the Affordable Care Act to a network of trains, centrally planned and accessible, but likely to break down and cause a headache. Our health care system, he argues, should be more like the car market: propelled by individual consumers that drive competition and innovation. _____ From The New York Times: “It’s a goat on a bridge eating a flaming rug pulled from a collapsing sand castle!” Here’s some figurative language Republicans have used in the past to describe the Affordable Care Act. _____ From New York Magazine: “My code is Amazonism. I want weapons. ” Camille Paglia watches the Real Housewives franchise but doesn’t like the Kardashians. She loved the women’s march on Washington, but hated the hats. She also was not surprised by the Trump victory, and has some characteristically bold opinions about our new president. Here’s what one New York Magazine interviewer learned when she checked in with one of the most famous public intellectuals of the 1990s. _____ From Elle: “Before women can strike effectively, we need to redefine what female labor consists of. ” Yesterday, of course, was not the first time women in this country have gone on strike. One writer argues that previous demonstrations, like the Women’s Strike for Equality in 1970, were successful because they shed light on specific kinds of labor defined as “women’s work. ” However, as feminism progresses, and women do more kinds of work, what does a general strike in the name of gender truly mean? _____ From The New York Times: “Is it a good or a bad thing if Mr. Trump becomes the first political unicorn?” Defying political norms, the president has embraced the philosophy of disruption and management styles that have powered successful  . _____ From The Baffler: “He was an authoritarian, and proud of it. ” If you loved “Hamilton” the musical, you still might not have loved Hamilton, the politician. That’s at least according to one Baffler writer who sees this newly lionized founding father enjoying a reputation he doesn’t deserve. _____ From Aeon: “The new authoritarian does not pretend to make you better, only to make you feel better about not wanting to change. ” A quick survey of how 20th century authoritarians compare to today’s strongmen lands on this distinction: Authoritarians of the last century were like strict dads, exercising tough love with exacting expectations of their citizens. _____ From ProPublica: “A former reality show contestant whose study of societal collapse inspired him to invent a       . ” While Mr. Trump’s cabinet appointees have received lots of scrutiny, the public has not heard much about the hundreds of temporary political appointments the president has made across the government. Now, ProPublica has published a list of 400 such “beachhead” officials, consisting of a mix of lobbyists, members of the conservative media and loyal Trump supporters (including one just out of high school). _____ From The New York Times Magazine: “Impending catastrophe grants the president broad powers, and those powers are used broadly. ” Stephen K. Bannon and Jeff Sessions, the president’s chief strategist and the attorney general, have long shared a vision for remaking America. Now the nation’s top   agency can serve as a tool for enacting it. _____ From The Stranger: “His oeuvre is less Leni Riefenstahl and more Oliver Stone (without the technical deftness poetic aspiration) or Michael Moore (minus the wit). ” Mr. Bannon has produced 16 documentaries between 2004 and 2016. One journalist watched all of them so you don’t have to. _____'"}, "time": 1742563050.6770856}