{"duration": 0.038132667541503906, "input_args": {"text": "'Footage from inside the MILO protests at UC Davis shows   protestors screaming and spitting at video producer Matt Perdie, with one describing him as a “Breitbart fascist. ”[After one protester demanded that he stop being filmed, other protestors attempted to help his case by screaming and spitting in the face of the cameraman.  Perdie was then pushed around by protestors, as another man screamed “f*** off” in his face with a loudspeaker, before spitting at him.  In a statement to Breitbart News, Matt Perdie said: “One of the protesters didn’t like the fact that I was filming him while working for Breitbart, so he summoned a few of his smelly cronies on me, instructing them to get me away from him. A bunch of them started yelling obscenities in my face, another was shoving me by ramming me with his back towards me. It’s pathetic. These losers try to do everything in their power to intimidate and silence those with opposing opinions. Then the same protester who told people to push me away then proceeded to tell the other protesters to grab my camera. ” He said: ‘Get that camera! Someone grab that expensive camera!’ When I confronted him about inciting people to damage or steal my equipment, protesters then pushed and shoved me. I also had a guy spit in my face because he didn’t like me filming in a public space. ” Other reports from the evening have shown ski   protestors jumping tearing down barricades and engaging in fights, whilst shouting chants comparing MILO to fascists and Ku Klux Klan. At least one man was arrested. One reporter for ABC10, Frances Wang, faced protestors pouring hot coffee over her photographers camera whilst she was conducting an interview. The event was set to be the first event on the third and final leg of the MILO’s “Dangerous Faggot Tour. ” You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562331.7605672}