{"duration": 0.041143178939819336, "input_args": {"text": "'COLUMBUS, Ohio  —   For years, the score was so ingrained it became a mantra. A rallying cry. A marketing device, even. Four straight times, the United States men’s soccer team faced Mexico in a home World Cup qualifying game here, and four straight times the Americans won by the same score  —     or, as it became known to everyone on both sides, Dos a Cero. The fans chanted it. The players talked about it. The television commercials plastered it all over their advertisements. But no more. Dos a Cero was officially put to rest only 20 minutes into Friday’s game when Mexico’s Miguel Layún scored with a deflected shot from outside the penalty area, and the visitors put a complete damper on the lively atmosphere at Mapfre Stadium with a late winner from the seemingly ageless Rafael Márquez to seal a    —   call it Dos a Uno?  —   defeat for the Americans. It was the first home World Cup qualifier setback for the United States since a loss to Honduras in 2001  —   a stretch of 32 games  —   and Mexico’s first win in a qualifier in the United States since 1972. The United States still has nine games left in this   final round of qualifying  —   the top three teams advance to Russia in 2018  —   but things are now difficult right from the start. The Americans travel to San Jose, Costa Rica, for what should be a tricky match against the host country on Tuesday. Before then, they will have a chance to review what was, as Coach Jurgen Klinsmann put it, a “very disappointing” loss to their biggest rivals. After a stunted start to the game, the United States played significantly better in the second half and had openings to win, only to switch off completely on a corner kick that allowed Márquez to flick in a header in the 89th minute. “It’s soft,” forward Jozy Altidore said. “It’s really soft, and we have to be better than that. ” Klinsmann singled out defender John Brooks as having failed to pick up Márquez, who is 37 and has been a Mexican mainstay for so long that he played in the first Dos a Cero game back in 2001. Brooks appeared to think that Altidore was going to run with Márquez, but either way it was a critical mistake at a most inopportune time. “We’ll let ourselves hurt tonight,” goalkeeper Tim Howard said. “Then we’ve got to move on. There’s a lot of games left. ” Howard is unlikely to take part in at least the next match. The longtime American goalkeeper injured his groin while taking a goal kick in the first half. He was replaced by Brad Guzan, who is expected to start against Costa Rica, about five minutes before halftime. Klinsmann started Friday’s game in a    alignment that was designed to give the wunderkind Christian Pulisic freedom “to roam,” the coach said. Pulisic was active enough, but other midfielders like Michael Bradley and Jermaine Jones did not challenge the Mexican players in the way Klinsmann had hoped. So, after Mexico hit the post, the crossbar and  —   on Layún’s shot  —   the back of the net, the Americans went into a more classic   . That “calmed things down,” Klinsmann said, and the United States pushed the ball well after halftime and tied the score at   in the 49th minute when Brooks passed to Altidore, who bulled toward the goal and laid the ball in front of Bobby Wood for a sharp finish. That sent the crowd of 24, 650 into delirium, but their glee was dulled as the United States failed to crack the Mexican defense again while Márquez took his chance with aplomb. Dos a Cero was over. The American dominance of Mexico in Columbus was over. The magic, after 15 years, was over. “We had enough chances to put it away,” Klinsmann said. “But we didn’t. ”'"}, "time": 1742628484.1771948}