{"duration": 0.17389893531799316, "input_args": {"text": "\"Home / BREAKING NEWS / DAPL Protesters Proven Right as Largest Gas Pipeline in U.S. Experiences Massive and Deadly Explosion DAPL Protesters Proven Right as Largest Gas Pipeline in U.S. Experiences Massive and Deadly Explosion Claire Bernish November 1, 2016 Leave a comment \\nA massive explosion of a gas pipeline in Shelby County, Alabama — near the site where the same pipeline leaked some 336,000 gallons of gasoline just last month — evidences the exact reason activists and Native American water protectors oppose the construction of the Dakota Access Pipeline over 1,400 miles to the northwest. \\nOne person was killed and at least five people were injured in the blast — tentatively described as an accident — as Colonial Pipeline shut down operations black smoke billowed, sending millions into a panic over the abrupt and unexpected coming gas shortage. \\n“Our deepest condolences go out tonight to the family and friends of the person who was lost today, and our thoughts and prayers are with those who were injured,” Colonial said in a statement, reported NBC News . \\nCited by the Chicago Tribune , Alabama Governor Robert Bentley said the explosion occurred roughly a mile west of last month’s rupture, adding of the likely crippling shortage of fuel, “We’ll just hope and pray for the best.” \\n“It appears to have been an accident, and they’re allowing fuel to burn,” Bentley told WBRC . “It’s about one mile west of where the repair took place on the Colonial Pipeline just recently.” #LiveOn3340 : @BrianPia3340 reports on Colonial Pipeline company history after today's explosion in Shelby County https://t.co/6JjMNC6sce pic.twitter.com/Y8nT2Wo81s \\n— ABC 33/40 News (@abc3340) October 31, 2016 \\nRefined gas poured from the pipeline as workers rushed to construct a 75-foot-long ‘earthen dam’ to contain the flaming spill, where fuel will then be allowed to burn itself out. Dry tinder from an ongoing drought in the area quickly ignited two wildfires after the explosion — which then charred 31 acres — and area residents were forced to evacuate without any indication when they would be permitted to return. \\n“There’s a large plume of smoke; there’s a large fire,” noted Shelby County Sheriff’s Captain Jeff Hartley, as quoted by the Chicago Tribune . “We’re not sure exactly how it started or what caused it,” he said, adding of the massive deployment of fire and emergency personnel, “We’ve got first responders entering the area, and a lot of them.” \\nApart from the worker killed, subsequent reports downplayed the extent of injuries suffered by those at the blast site, AL.com reported seven of the “eight or nine” subcontractors working in the area had suffered severe burns from the explosion. According to Shelby County Sheriff John Samaniego, two of those workers — all of whom had begun digging in an effort to flush one of the lines as repairs continued on the original leak — may still be missing , though that information was both unconfirmed and unclear because extreme heat from flames emanating at the site of the explosion prevented further assessment. \\nColonial noted in a brief statement cited by a local ABC affiliate that both pipelines — one transporting gasoline, the other distillates, had been shut down, and, further, \\n“Colonial’s top priorities are the health and safety of the work crew on site and protection of the public.” \\nAccording to a later report from Reuters , the fire had been ‘contained’ by around 9 pm local time — yet no further word about the possibly-missing subcontractors has been provided. Incredible video of the Colonial Pipeline leak from Ryan Burtis. Our thoughts & prayers to all pic.twitter.com/NUOdoaW7O5 \\n— WBRC FOX6 News (@WBRCnews) October 31, 2016 \\nFears of yet another gas shortage akin to that from the September leak — as well as consequent soaring prices — spawned lengthy lines at gas stations as soon as news of the explosion hit headlines. Reuters explains: \\n“Colonial, the biggest refined products system in the United States, is responsible for supplying about one-third of the 3.2 million barrels per day of gasoline consumed on the East Coast, according to U.S. Energy Department data.” \\nFurther, “It was not clear whether the explosion happened on the gasoline or the distillates pipeline, the governor said in the briefing.” \\nAlthough the aforementioned details handily summarize the facts of the explosion — occurring during active repairs of the previous, sizeable leak — the facts do little to quantify potential environmental and health impacts of an explosion and leak of this magnitude. \\nThis explosion of a major pipeline supplying fuel to large portions of the Southeast and East coast serves an ominous portent for ongoing opposition to construction of the hotly contentious Dakota Access Pipeline slated to cross four states, traversing just north of the Standing Rock Sioux reservation in North Dakota. \\nStanding Rock Sioux water protectors and Native Americans and Indigenous peoples from over 200 nations and their supporters fear that pipeline’s route — undercutting the Missouri River in several places — threatens to poison the tribal water supply and that of no less than 18 million others living downstream. Indeed, the Colonial Pipeline’s tragic mishap — the second in essentially the same section of pipe in about one month — darkly parallels the hundreds of similar accidents such pipelines are prone to. \\nResidents of Bismarck, aware of Big Oil’s horrendous safety record, managed to thwart Energy Transfer Partners’ original plans for the pipeline to be routed near the city — so ETP, with assistance from the State, diverted Dakota Access to cross just north of the Standing Rock Sioux reservation on privately-owned land. \\nRightly viewed by pipeline opponents as blatant exploitation of Native Americans — as well as a violation of an 1851 treaty with the U.S. government — Standing Rock Sioux water protectors and supporters have camped along the Missouri for months in an effort to halt construction as a lawsuit languishes in federal court. \\nBig Oil, Big Banks , and government backers obviously view future profiteering from the pipeline important enough to send in absurdly militarized police from at least five states to combat pipeline opponents — who have remained on the whole peaceful, prayerful, and unarmed. \\nETP insists the opposition is misguided and Dakota Access offers a safe alternative to the ‘riskier’ oil transportation methods of railroad and tanker truck — but even the company’s own records listing thousands of spills in just the last six years flatly dispute such claims. Worse, although pipeline leaks and spills might technically be less frequent than those caused by railroad accidents, the International Energy Agency notes pipeline mishaps leaked three times more crude over an eight-year period. \\nIn fact, Big Oil’s general safety record is nearly impossible to fully track, in part because such spills, leaks, explosions, and other accidents are startlingly common and no less perilous to workers, residents, the environment — and, yes, the rapidly dwindling water supply. \\nA report by the Center for Effective Government attempting to map and quantify crude and other industry spills found not only are “ruptures and leaks a daily occurrence,” but “Eighty people have died and 389 have been injured in such incidents in the last five years. \\n“Since 2010, over 3,300 incidents of crude oil and liquefied natural gas leaks or ruptures have occurred on U.S. pipelines. These incidents have killed 80 people, injured 389 more, and cost $2.8 billion in damages. They also released toxic, polluting chemicals in local soil, waterways, and air.” \\nAccording to the Pipeline and Hazardous Materials Safety Administration, as noted in the report , those spills and ruptures sent 7 million gallons of crude into the environment. Further illustrating the imperative to oppose construction of Dakota Access, one of the worst spills occurred in North Dakota — not by human error or poor maintenance — but when lightning struck a crude oil pipeline, spilling 840,000 gallons of crude into a wheat field in 2013. \\nWhile the oil and gas industry and its wealthy proponents in government would attempt to pull the wool over the public’s eyes about pipeline safety, using crafty language and skewed statistics, the truth is, no safe manner for transporting oil and gas actually exists. \\nOpposition to the Dakota Access Pipeline simply isn’t confined to a Native American issue, as exploitive as that facet is — but when pipelines traverse pristine lands, farm acreage, and the rivers and waterways we depend on to sustain us, we’re all at risk. \\nWhat scant corporate media coverage of the Standing Rock Sioux Tribe’s stand against Big Oil does exist has painted the fight as limited in scope; but thousands encamped along the pipeline’s planned route — who face an unusually bitter winter , no less — are in fact taking a stand for every person and every creature who would be devastated in the event of a future oil spill. Share\""}, "time": 1742562018.5818355}