{"duration": 0.09594988822937012, "input_args": {"text": "'Analysts had grave predictions for the future of Twitter following the release of the company’s 4th quarter earnings Thursday. [Speaking to Bloomberg, Brian Wieser, an analyst at Pivotal Research Group, discussed Twitter CEO Jack Dorsey and the division of his time between Twitter and his other company Square. “The fact that they’ve tolerated having a shared CEO is remarkable given the situation they’re in,” he said, “Unfortunately, it’s a situation of investor indifference  —   everyone is used to Twitter’s troubles by now. ”  The company’s earnings for the fourth quarter were $717 million, falling short of Wall Street predictions of $740 million. Twitter’s sales growth of 1% slowed dramatically from the 48% gain for the same quarter last year. Bloomberg Intelligence analyst Jitendra Waral believes this will be a big issue for Twitter in the coming year: “Sales growth recovery for Twitter will be very challenging in 2017. Google and Facebook results show robust ad environment in the fourth quarter. ” Waral stated that Twitter’s sales growth “is showing their strategies are not working. ” Twitter has been relying on live video partnerships with larger brands such as Dick Clark Productions in recent months in an attempt to attract more users to their platform, a move that hasn’t seemed to yield much success. The company also introduced new video ad monetization features, allowing  to be played before videos. However, advertising revenue decreased from the year previously, with the company reporting revenue of $638 million. James Cakmak, an analyst at Monness Crespi Hardt  Co. believes that although Twitter has carved out a niche in the political world, “It’s still in an identity crisis. People that use Twitter get it, the world conceptually gets it, but your average potential user doesn’t. ” Twitter CEO Jack Dorsey, however, currently has no plans to step down as CEO of Square, saying, “This focus, and this team, allows me and gives me a lot of confidence I can continue to focus on the meaningful things at both companies and we have the right prioritization in front of us. ” “Late last year, we really flattened the org  …     so I could be closer to the product,” he said. “Now we’ve spent a year going through and making sure we reset the foundation on what we’re executing and what our priorities are, we have a lot more confidence that we can move a lot faster on bigger things. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan or email him at lnolan@breitbart. com.'"}, "time": 1742628533.4088697}