{"duration": 0.07303452491760254, "input_args": {"text": "'OXON HILL, MD  —   White House Chief Strategist Stephen K. Bannon and White House Chief of Staff Reince Priebus received a standing ovation and a heroes’ welcome at the Conservative Political Action Conference (CPAC) on Thursday afternoon. [Bannon joked that he had graduated from the ranks of the “uninvited”  —   the title of an alternative conference that he led as the executive chairman of Breitbart News, which featured speakers who had been left off the CPAC agenda.  Asked by American Conservative Union chair Matt Schlapp to name the biggest misconception about the Trump White House, and their work together, Priebus replied: “Everything. ” Bannon agreed, repeating one of his most controversial lines of President Donald Trump’s administration thus far, greeting “the opposition”  —   the media  —   in the back of the room. He referred to them as such throughout his remarks, recalling how the “opposition party” had constantly disparaged the Trump campaign, to no avail. “If you want to see the Trump agenda, it’s pretty simple,” he said. “It’s all in the speeches. ” He added: “Our job, every day, is to execute on that. ” But the “opposition party” missed the story, he said. “Just like they were dead wrong on the cast of the campaign, just like they were dead wrong on the cast of the transition, they are absolutely wrong about what’s going on today. ” Bannon outlined the administration’s approach to implementing its agenda, including what he termed the historically significant withdrawal from the   Partnership (TPP) which he said would be replaced by bilateral trade arrangements. He said that Trump’s Cabinet appointees would lead the “deconstruction” of the “adminstrative state. ” Priebus, picking up on that theme, proudly described Trump’s executive order requiring that for every new regulation promulgated by federal agencies, two old regulations had to be repealed. When Schlapp asked what the media kept missing about Trump, Priebus pointed out that the media were constantly underestimating Trump’s chances  —   first of winning the Republican nomination, then of winning the presidency, then of governing successfully. He expressed hope that the media would improve. Bannon, noting that he and Priebus could disagree and still work together, offered a different outlook on media bias: “It’s not only not going to get better, it’s going to get worse every day,” he said, adding that the “corporatist, globalist media” were opposed to change. Conservatives, Bannon told the audience to applause, would have to remain active and involved. “If you think you’re going to get your country back without a fight, you are sadly mistaken. ” He asked the audience to have the administration’s back  —   but asked them: “Hold us accountable. ” Asked to say what they liked best about each other, Priebus praised Bannon, “a very dear friend,” for being loyal and “extremely consistent. ” Bannon praised Priebus for being “indefatigable” and “steady” under intense pressure. “I can run a little hot sometimes,” he joked. “Reince has been unwavering. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742561869.3666043}