{"duration": 0.08765602111816406, "input_args": {"text": "'  Carol Adl in Middle East , News , US // 0 Comments \\nAccording to President Assad’s media adviser, the way the US-led coalition is conducting its operation in Mosul suggests that Washington may be planning to “navigate” ISIS terrorists into Syria in accordance with its longstanding strategy for the region. \\nIslamic State terrorists fleeing from Mosul into Syria would become a “huge danger to our sovereignty, to our country,” Dr. Bouthaina Shaaban told RT adding that “Russia and Syria are looking at this issue extremely seriously. We’re not going to sit and watch… The way they encircle Mosul shows they would like these terrorists to move into to Syria…” \\nRT reports: \\n“They’re navigating terrorism from one place to another, limiting terrorism in one place, directing it to another place. That’s the absolute truth of what is happening in our region,” she explained. \\nWestern states only “speak about fighting terrorism” and in meantime supply so-called “moderates” who eagerly share Western aid with not so “moderate” militants, according to the aide. \\n“Unfortunately, Western partners speak about fighting terrorism, but they honestly do not. Quite the contrary, what they do on the ground is to supply weapons and armaments to terrorists whom they call ‘moderate’, while we know that on the ground there’s no ‘moderate terrorism.’ They all exchange weapons and armaments on the ground. And they all constitute danger not only to Syria, but to the region and to mankind as well,” Shaaban said. \\n“We see Western countries announcing that they will be supporting what they call ‘Syrian moderates’. There are no ‘Syrian moderates’, they are carrying on butchering people. Those are not ‘moderates’ for sure.” \\nA never-ending storm in Western media, which are trying to diminish all the counter-terrorism efforts of Damascus and its allies, is a deliberate campaign that started at the very beginning of the Syrian crisis, Shaaban said. It was always “absolutely incredible, full of lies and falsifications” and totally “irrelevant to reality.” \\n“One of the great challenges we’re facing in the 21st century is the Western corporate media, that is no longer a media that depends on investigation, or cares about its credibility, or cares about the truth. Give me the names of Western journalists who are on the ground on Syria and who are actually looking at what is happening and reporting to Western people…” \\nThe attempts to pin the alleged airstrike on an Idlib school on Damascus or Moscow is one of the most recent examples of that campaign. According to the Russian Defense Ministry, which debunked the Idlib “hoax,” the latest smear campaign is waged with a purpose to diverse the attention of international community away from the “war crimes committed by the US-led coalition” during the Mosul offensive. \\nThe US-led coalition and the US itself proved to be very untrustworthy partners in battling terrorism, unable to live up to their pledges, she said. \\n“Russia signed an agreement with the United States and the United States was not able to implement its own agreement… The Pentagon prevented the White House from implementing an agreement.” \\nFollowing Friday’s meeting between Russian, Iranian and Syrian diplomats, Shaaban said Damascus is interested in attracting additional “credible” partners to the alliance, in order to battle the “most challenging” issue of our age. \\n“We’re in an alliance against terrorism, we’re in a war against terrorism, we have so many joint interests among our countries. … [The meeting was] focused on what is the best way to try and gather more regional and international forces to truly and honestly engage in a battle against terrorism, as we all understand that terrorism is the most challenging issue for the humanity in the 21st century,” Assad’s adviser said. \\nDamascus believes more countries will join in the counter-terrorism alliance of Russia, Iran and Syria, Shaaban said. \\n“I’m sure this nucleus of alliance is going to attract more countries. Now, if you think of India, or Brazil, or South Africa, or Algeria, or Tunisia, naturally you believe that there’s no problem that these countries probably in the future joining… I’m sure there are many countries who would like to be more active, China for example, who should be more active in fighting terrorism.”'"}, "time": 1742562482.1963923}