{"duration": 0.05057096481323242, "input_args": {"text": "'\\nThis article was written by Kurt Nimmo and originally published at his Another Day in the Empire site. \\nEditor’s Comment: At this point, Americans should be getting awfully tired of the false promises and empty dreams that are continually sold, and which so regularly ring hollow. Despite a campaign based around opposing the establishment, normalizing relations with Russia and pulling back from the failing empire, Donald Trump’s rumored pick for Secretary of State – John Bolton, who served as U.S. Ambassador to the U.N. under George W. Bush – is advocating for a neocon platform of expanding war, and taking on the major powers. \\nIf put into action, this disastrous policy would lead to only one thing: world war. Trump must be persuaded to cut ties with this crowd and fulfill the promise of draining the swamp, but it remains to be seen if this will possible. \\nJohn Bolton: Trump Needs to Confront Russia, China, Iran, North Korea, and Embrace Forever War \\nby Kurt Nimmo\\nBecause Donald Trump has zero foreign policy chops, he will delegate that job to his new secretary of state. With every passing day, it appears the person to fill that job will be John Bolton , a diehard neocon.\\nAmerica electing #Trump was a clear repudiation of #Obama ‘s failed foreign policy. Voters want to restore American leadership in the world.\\n— John Bolton (@AmbJohnBolton) November 10, 2016 \\n\\nOn Saturday Bolton spelled out what he considers to be the foreign policy priorities of the new administration.\\nBolton writes the top concern for America on the foreign policy front are “the closely related threats of radical Islamic terrorism and the Middle East’s spreading chaos.”\\nThis is followed by “nuclear proliferation” by Iran, a country that does not have a nuclear weapons program.\\nTrump may say he wants to make peace with Russia, but this is not on Bolton’s agenda. “Vladimir Putin’s Russia is on the prowl in Eastern Europe and the Middle East in ways unprecedented since the Cold War,” he writes.\\nTrump’s VP, Mike Pence, has similar thoughts on Russia.\\nBolton forgets Russia was not “on the prowl” prior to the US placing missile batteries on the border in Poland, or before the State Department engineered the takedown of the government in Ukraine.\\nHe also wants Trump to confront China in the South and East China Seas. “Continued failure to deal firmly with Chinese adventurism and intransigence will result in more Asian states falling under Beijing’s sway, as the Philippines appears to be doing, simply accepting their fate as Middle Kingdom vassals.”\\nOn Sunday, Bolton took to the pages of the New York Post . “Iran is now on a path to deliverable nuclear weapons, legitimized by Obama’s wretched deal, which is providing untold economic benefits to Tehran through unfrozen assets and renewed trade and investment, especially from Europe. Iran’s support for terrorism continues unabated, and its provocative international behavior has only worsened since the nuclear deal. Russia’s influence in the region is higher than at any time since the 1970s,” he writes.\\nMy latest column in the @nypost , “Trump needs to reverse the Iran deal and assert our interests” https://t.co/lWQC6tqAgu \\n— John Bolton (@AmbJohnBolton) November 15, 2016 \\n\\nBolton pushed creative destruction and order out of chaos, the favored approach of neocons. “Either a new state must be created out of the wreckage of Syria and Iraq, or some other durable approach must be found,” he writes.\\n“I still think the decision to overthrow Saddam was correct,” Bolton said last year during a failed effort to run for the nomination. “I think decisions made after that decision were wrong, although I think the worst decision made after that was the 2011 decision to withdraw U.S. and coalition forces.”\\nHe also wants to force Russia out of Syria. “Moreover, the new Russian airbase in Latakia, Syria, has dramatically changed the strategic environment in the eastern Mediterranean and beyond.\\n“Unfortunately, the base cannot be made to disappear simply by reversing Obama’s erroneous policies.”\\nAccording to Bolton, “Israel and America’s Arab friends are desperately waiting for a strong American president who understands who his friends are.”\\nIsrael and its well-organized and financed lobbying effort in the United States has long determined US foreign policy in the Middle East.\\nAs for our “Arab friends,” this is a reference to Saudi Arabia, Qatar, and the Gulf Emirates, the very folks who are responsible for fanatical Wahhabi Islam embraced by al-Qaeda, al-Nusra, and the Islamic State.\\nNone of these psychopathic groups would even exist if the CIA had not built up the Mujahideen in Afghanistan during its covert war against the Soviets. The Saudis, the CIA, and the Pentagon are directly responsible for the cancer now growing in the Middle East, not Iran.\\nOn Tuesday, Kentucky Senator Rand Paul pointed out the hypocrisy of a Trump administration selecting Bolton as secretary of state.\\nWar is sometimes necessary but as a country we should resist any would-be leader who wants to bomb now & think later https://t.co/fNiS1ATXQ4 \\n— Dr. Rand Paul (@RandPaul) November 15, 2016 \\n\\n“Bolton is a longtime member of the failed Washington elite that Trump vowed to oppose, hell-bent on repeating virtually every foreign policy mistake the U.S. has made in the last 15 years—particularly those Trump promised to avoid as president,” Paul writes.\\nFormer New York Mayor Rudy Giuliani is also being considered as Trump’s secretary of state. He also embraces the neocon ethos.\\nThis article was written by Kurt Nimmo and originally published at his Another Day in the Empire site. \\n'"}, "time": 1742628457.6746893}