{"duration": 0.11528968811035156, "input_args": {"text": "'Bill Maher calling himself a “house n****” on Friday’s episode of Real Time has sparked serious outrage across social media and caused many people, including some prominent black social justice activists, to call for the HBO host to be fired. [During a conversation with Sen. Ben Sasse ( ) Maher told the lawmaker: “I’ve gotta get to Nebraska more. ”  “You’re welcome. We’d love to have you work in the fields with us,” Sen. Sasse jokingly replied. Maher said in response:: “Work in the fields? Senator, I’m a house n****. ” Met with a mix of groans and laughs from the audience, Maher said, “It’s a joke. ” The internet, however, didn’t find Maher’s comments funny or his explanation acceptable. Black Lives Matter activist Deray McKesson wrote on Twitter, “But really, @BillMaher has got to go. There are no explanations that make this acceptable. ” But really, @BillMaher has got to go. There are no explanations that make this acceptable. pic. twitter.   —   deray mckesson (@deray) June 3, 2017,  “And why did the audience think it was okay to laugh? And Ben Sasse doesn’t even flinch. What is happening in the world?” McKesson added. And why did the audience think it was okay to laugh? And Ben Sasse doesn’t even flinch. What is happening in the world?  —   deray mckesson (@deray) June 3, 2017,  Netflix’s Orange is the New Black star Danielle Brooks shared McKesson’s furor at what Maher said, writing on Twitter: “Unacceptable. And the audience applauds! ?! So hurtful. ” Unacceptable. And the audience applauds! ?! So hurtful. https:  .   —   Danielle Brooks (@thedanieb) June 3, 2017,  Soon, social media was filled with journalists, comedians, and viewers who expressed shock and outrage at Maher. Just a quick reminder that Bill Maher is trash,  —   BCC (@ByCommonConsent) June 3, 2017,  Bill Maher gotta go.  —   Nina Parker (@MzGossipGirl) June 3, 2017,  For me, the jig has been up on Bill Maher for a long time. So, nah.  —   Jemele Hill (@jemelehill) June 3, 2017,  Me after watching that clip of Bill Maher pic. twitter.   —   Jamelle Bouie (@jbouie) June 3, 2017,  And Ben Sasse  the audience chuckle along with Bill Maher’s racism  …     https:  .   —   TC (@tchopstl_) June 3, 2017,  I used to love bill maher smh.  —   Ambquisha (@QueChainz) June 3, 2017,  Did bill maher really just say he was a house n****? ???? ??WHAT IS WRONG WITH HIM,  —   kat calabrese (@KatCalabrese) June 3, 2017,  Today is the day Bill Maher became president.  —   Michael Ian Black (@michaelianblack) June 3, 2017,  Some social media users said Maher’s joke was akin to the   stunt Kathy Griffin pulled earlier this week when she posed for a shock photo holding up a bloodied, decapitated head of President Donald Trump. Kathy Griffin: I really fucked up in an attempt to gain attention. Bill Maher: Hold my joint  …    . #RealTime #HouseWhat?  —   Wallace Ritchie (@WallaceRitchie) June 3, 2017,  ”No one can ruin their career faster than Kathy Griffin” Bill Maher  —   Hold my beer,  —   Jack Posobiec 🇺🇸 (@JackPosobiec) June 3, 2017,  Kathy Griffin at home right now, thankfully watching Bill Maher like pic. twitter.   —   Behdad Sami (@iambdsami) June 3, 2017,  Tiger Woods: Nobody could screw up their career the way I did last weekend.  Kathy Griffin: Hold my beer. Bill Maher: Mind if I join you?  —   Tennessee (@TEN_GOP) June 3, 2017,  This isn’t the first time Maher has dropped the   during a TV broadcast. The    comedian said during a September 2010 interview with Larry King that Republicans referred to President Barack Obama as “Kenyan,” which is “code for n*****. ” “That’s the new Kenyan, Larry. And Kenyan, of course, was code for [the  ]. But that’s where they are. They can’t say it out loud. But that’s where this whole campaign is going to be,” Maher said according to a CNN transcript. During a February episode of Real Time, Maher said, “I don’t know it for a fact that Jeff Sessions is a big fan of the movie Loving because he loves being able to talk about Ruth Negga,” referring to the   star who’s name sounds similar to the  .  Maher, who is in his 15th season as host of Real Time, has not publicly responded to the controversy. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564501.94896}