{"duration": 0.11842513084411621, "input_args": {"text": "'Written by John Wight   To understand the situation in Aleppo is to understand the key to the conflict in Syria at this juncture: Will Washington and its allies or the Syrian Army and Russia liberate Raqqa, the capital of the so-called Islamic State. It does not take a military genius to discern Washington’s strategy in prolonging the military operation being conducted by the Syrian Army, supported by Russia, to liberate eastern Aleppo – which remains occupied by Nusra Front and the “moderates” fighting alongside the Salafi-jihadist group. Keeping the Syrian and Russian military forces bogged down in eastern Aleppo is key to allowing the US-led coalition to complete the operation, currently underway, to take the Iraqi city of Mosul from ISIS, before continuing an east-west advance across the Syrian border to take Raqqa. Raqqa will then be established as the de facto capital of so-called moderate Syrian forces, which will re-group there, presumably under cover of a US-imposed no-fly zone, to become a counterweight to the authority of the Assad government in Damascus. Such a development would also establish a permanent US military presence in a country that has long been key to Washington’s objective of dominating the region. That aspect of this strategy is, of course, illegal under the terms of the UN Charter, and is of minor consequence to an imperial power that has long viewed international law as an optional extra when it comes to pursuing its strategic and geopolitical objectives across the globe. When it comes to the Middle East we are talking a region rich in natural resources, specifically oil. And though not vital in terms of US energy needs, the sea of oil upon which the region sits is undeniably key to the stability of global energy prices. And that is vital to the US economy. As Gal Luft, Senior Adviser to the United States Energy Security Council, observed in a 2014 report, “While the US is not dependent on the Middle East for the physical supply of oil, it is dependent on the region for price stability. The US economy is highly susceptible to spikes in oil prices.” Luft goes on, “Over the past 40 years every major hike in oil prices was followed by a recession, and most of those spikes occurred as a result of turmoil in the Middle East: the Arab Oil Embargo, the Iran-Iraq War, the Iraqi invasion of Kuwait, etc.” As far back as January, US Defense Secretary Ashton Carter was discussing the importance of Raqqa to US military strategy in Syria. In a speech to the 101st Airborne Division at its Fort Campbell HQ in Kentucky on 13 January, he said,“…our campaign plan’s map has got big arrows pointing at both Mosul and Raqqa. We will begin by collapsing ISIL’s control over both of these cities and then engage in elimination operations through other territories ISIL [ISIS] holds in Iraq and Syria.” It is an objective the US Defense Secretary trumpeted again in a recent interview with NBC. \"It\\'s been long a part of our plan that the Mosul operation would kick off when it did,” Carter revealed. “This was a plan that goes back many months now and that Raqqa would follow soon behind.\" The howling at the moon we’ve been treated to in recent weeks from Washington and its European proxies, accusing Syria and Russia of targeting civilians in eastern Aleppo, is nothing more than deflection. It is designed to blunt what is an extremely difficult military operation to liberate a civilian population being held hostage by the sectarian butchers of Nusra and other terrorist groups, using women and children as human shields. We know this to be true because despite Russian and Syrian forces regularly establishing humanitarian corridors to allow civilians to leave eastern Aleppo they are prevented from doing so on pain of execution. The hypocrisy is laid bare when we consider the lack of concern in Washington for civilians living in government-controlled western Aleppo, who have been subjected to a reign of terror in the form of daily and nightly rocket attacks, including poison gas shells, from Nusra and their “moderate” allies in the east of the city. Washington’s overarching strategy in the conflict also allows us to understand its refusal to separate those “moderate rebel” groups it claims to have some influence over from their Nusra counterparts, as per the terms of the ceasefire agreed between Washington and Moscow at the beginning of September. The ceasefire was broken just six days after it began by a US-led airstrike killed dozens of Syrian troops during a battle against ISIS in the eastern city of Deir Ezzor, which Washington claimed was a mistake. Such a claim should be taken with the usual pinch of salt, especially when we consider that Deir Ezzor lies adjacent to Raqqa in eastern Syria and therefore will be vital to any future joint Syrian and Russian operation to liberate the city. Reaching Raqqa before the Syrian Army and its allies is now essential for the US, constituting as it does a last throw of the dice when it comes to its objective of bringing down the Assad government in Damascus, which has long been a thorn in the side of US hegemony in the region along with the regional agendas of its closest Middle East allies, Israel and Saudi Arabia. With Syria fatally weakened, US strategists believe, Hezbollah and Iran, the main prize, are also weakened - not to mention Russian power diminished when it comes to the wider struggle for a multipolar alternative to the unipolar status quo. In a repeat of the race for Berlin at the end of the Second World War, with the outcome shaping the future of Europe and wider world in the context of the ensuing Cold War, the future of Syria, the Middle East, and a world crying out for a multipolar alternative to US global hegemony now boils down to Raqqa. Reprinted with permission from RT . Related'"}, "time": 1742561866.3154447}