{"duration": 0.009857177734375, "input_args": {"text": "\"Share on Facebook Polar bears are already endangered species according to the Red Data Book of the Russian Federation. There are many reasons why such creature will be one day extinct, one is animal abuse. A heartbreaking video showing a polar bear writhing in pain, after she was allegedly fed with a firecracker, went viral online and sparked outrage among internet users. The female polar bear who was fighting for her life, can be seen suffering, as blood comes out from her snout. She was twisting in deep pain, while a group of men were recording the scene and discussing what is happening to the bear. According to a report, a Russian military base cook fed the polar bear with a kind of firecracker used by the military. Witnesses said, the bear and her cub were frequently seen around the base looking for food and being fed by the cook. If proven, the alleged cook may spent up to 7 years in prison. Somehow, upon getting in touch with LifeNews, the cook said that the bear who regularly visit the base in Wrangel Island in far east Russia, to get food, had “itself grabbed a rocket flare and began chewing on it.” The cook also stated that the bear did not die and workers were already looking for her, but failed to find her. In contrary, a report said that the bear was shot to death, ending her suffering, but this was not verified. However, it is still unclear what exactly the polar bear ate. According to other versions of the story, it was a rocket flare instead of a firecracker. It is also said that the bear accidentally ate the fire cracker, thinking of it as food while other report suggested that she was tricked into eating an explosive charge concealed in the food fed to her. Nobody knows what exactly happened to the poor bear but experts believed that her chance of survival is slim. Meanwhile, Russia's Military of Natural Resources is hoping for an investigation regarding the disturbing matter. Here's The Heartbreaking Footage: We were given the privilege to think wisely and that's what makes us human, but doing such kind of animal abuse only proves that we are nothing but lower than animals. Whoever did this must be punished!\""}, "time": 1742628486.0006104}