{"duration": 0.12788105010986328, "input_args": {"text": "'Chris Black November 9, 2016 3 Remedies From Medieval Europe To Heal The Common Cold \\nI think it was Hippocrates who said something along these lines: “let thy food be thy medicine and thy medicine be thy food”. \\nToday’s article is about trying to find a cure for the common cold or, more precisely, reviving ancient remedies from medieval Europe. \\nAnd speaking of cures for cold, there’s another saying in my neck of the woods: if you take cold medicine, you’ll get better in seven days, otherwise you’ll be sick for a week. \\nDo you see where this is going? \\nLet me tell you another interesting little story: despite the fact that there are only a small number of basic ingredients to be found in OTC (over the counter) cold-medicine—around ten, give or take (ephedrine, ibuprofen, paracetamol, aspirin, pseudo-ephedrine etc.)—the number of cold-related drugs in your pharmacy is in the hundreds. \\nEach major pharmaceutical company that has a hand in the cold industry typically has at least 10 different types. Many have 20 or 30 or even more. \\nThat’s pretty confusing, especially when you’re knocked out by a bad case of flu or cold , you can’t think straight, and you just want something to get you out of your misery. You’ll gladly spend a bunch of money to feel better. \\nLittle do you know you’re wasting it on pure crap. Do you think I am exaggerating? \\nBasically, in the cold medicine racket, the name of the game is making money via marketing and brainwashing. Have you noticed the huge number of drug-ads on TV? 70% of the money a television is making outside an election is from Big Pharma, so let that sink in really well. \\nI am writing this article because last week I suffered from a bad case of cold, which rendered me pretty much useless until I started making and drinking an old cold/cough remedy that I learned from my grandmother. \\nOnion tea \\nIt worked from day one, put me back on my feet, allowed me to think straight, to breathe and to write; you know what I mean. \\nAnd then I realized that for us preppers, knowing ancient remedies for a disease that is wreaking havoc this time of the year would make for an interesting article. So, if you’re into staying healthy without taking drugs, keep reading. \\nLet me tell you how it all began: awake at 4 AM. Can’t think, can’t write, can’t breathe, stuffy nose , sore throat. Does it sound familiar? \\nWell, I managed to crawl to my car and hit a local pharmacy. I bought some stuff pompously titled “cold medicine”, got home, medicated myself, hit the bed, and woke up 3 hours later still feeling horrible. \\nThen, it hit me: my grandmother used to make onion tea when I was little and I had a bad case of cold. I remember it smelled awful and tasted like rotten pig guts, but if I was a good boy and drank a lot of it, it worked. \\nWith these things in mind, I went to the kitchen, gathered 3 onions, washed’em up pretty good, and put them in the kettle to boil. \\nThe idea is to take 2-3 small onions and boil them slowly in a full kettle until the water is reduced by half via evaporation, then drink the tea as hot as you can stand it . \\nTrust me folks, it really works: sore throat-gone, stuffy nose-gone, I was alive again. It does taste hideous, unless you’re a die-hard onion lover, but it’s a small cost to pay. \\nBasically, with this magic potion you’ll be able to function, to be active: to be alive, so to speak, from day 1. \\nYou must drink two 3/4 cups of tea per day, essentially one in the morning and one before bed, that’s important. \\nIf you manage to squeeze 3 more in during the day, it will work like a Swiss watch. \\nIf all you have in the house are big-fat onions, you’ll just have to cut them in half before boiling it, but remember: don’t remove the peel. That’s essential; just wash the onion thoroughly. \\nHow does onion tea work? I really don’t know. There aren’t any “official” studies that I know of, probably because you can’t patent onions and sell them for 5 bucks a pop. It just does, provided you drink it hot as hell and you follow the recipe above. \\nVitamin C \\nBesides onion tea, supplementing with vitamin C and D3 is also very important when it comes to mitigating colds and flu (these vitamins play an essential role in immunity overall), but it’s important to take big doses. The RDA is a joke. \\nFor example, I am talking about 2-3 grams of vitamin C per day, together with eating lots of fruit: oranges, grapefruits, lemons, kiwis, apples and, again very important, raw onions and garlic (natural antibiotics). \\nThe RDA is the minimal amount of Vitamin C (or whatever) to be taken daily in order to avoid getting scurvy (speaking of vitamin C). To be healthy, it takes for much more than that; remember that. \\nTomato Tea \\nAnother way of naturally treating a stuffy nose/nasal congestion is tomato tea. \\nThe recipe is: 1 cup of tomato juice , (but I’d use 2-3 tomatoes cut in half instead of tomato juice) a teaspoon of fresh garlic (basically a clove) half a teaspoon of chili sauce (I’d use a small red hot chilli pepper instead) one teaspoon of lemon juice (again, I’d use a whole fruit instead). \\nAdd a pinch of salt into the mix and heat them together in the kettle until they start boiling, then drink the tea as hot as you can take it. \\nDuring the day, you can drink a mix of green tea and ginger tea with honey, as these ingredients boost the immune system and they break up phlegm naturally (the drugs are called expectorants). \\nStreptococcal pharyngitis or strep throat is a common occurrence when it comes to seasonal colds and flu, and besides my aforementioned magic onion tea recipe, you should try 2 additional tricks if you want to get better ASAP: first, gargle with apple cider vinegar after you dilute it in a glass of warm water (1-3 teaspoons of vinegar in 8 oz of water). \\nSecond, gargle with salt-water and if you’re hardcore, you can try rubbing your infected tonsils with salt (using your finger that is). It’s not a pleasant experience, but it works amazingly well. You can boost the recipe’s effectiveness by adding powdered cayenne pepper into the mix. \\nAdd one teaspoon of cayenne pepper plus one teaspoon of salt in an 8 oz. glass, and mix well together, obviously. Gargle vigorously with this formula until you get better. It will definitely break up the bacteria coating in your throat so expect to spit profusely for a couple of minutes afterwards. \\nIt’s very important to use high-quality, organic salt; not refined/processed stuff. I would recommend Himalayan salt (the pink variety), or salt-mine salt (the one that looks dirty). Processed, refined, snow white salt doesn’t work too great as it’s stripped of its essential trace elements. \\nI hope the article helped and I can’t wait to see your comments in the dedicated sections below, AFTER trying my onion tea, obviously. \\nStay healthy folks and click the banner below to discover more ancient secrets that helped our ancestors survive harsh times. \\n  Chris Black for Survivopedia. 25 total views, 25 views today'"}, "time": 1742562744.17465}