{"duration": 0.11428499221801758, "input_args": {"text": "'Email \\nHorace Mann, the first secretary of the Massachusetts Board of Education, speaking a few years before the Civil War, declared that public schools constituted “the greatest discovery ever made by man.\" He added, \"Let the common [public) school be expanded to its capabilities, let it be worked with the efficiency of which it is susceptible, and nine-tenths of the crimes in the penal code would become obsolete; the long catalogue of human ills would be abridged; men would walk more safely by day; every pillow would be more inviolable by night.” \\nSuch utopian sentiments provoke laughter today, especially when one considers that a large part of the exodus from the public schools into private schools and homeschooling is because of the unsafe environment in many of America’s public schools. \\nAbout 1.8 million children in the country are now homeschooled, with the numbers growing each year. This is double the number of homeschoolers as recently as 1999. Today, the number of children schooled at home represents 3.4 percent of U.S. students between the ages of five and 17. \\nTwenty-five percent of parents surveyed have said that the environment of the public schools — including such issues as safety, drugs, and peer pressure — is the most important reason for either pulling their kids out, or not ever placing them there to begin with. About the same number (22 percent) cite either religious or moral instruction as a reason to homeschool. Others mention “dissatisfaction with the academic instruction in other schools,” while smaller numbers explain that their child has a special need, such as a physical or mental health problem. \\nA more recent cause for the rise in homeschooling is the introduction of Common Core and other related aspects of nationally-driven standard curriculum in the public schools. In Sioux Falls, South Dakota, the number of homeschooled students has more than doubled, with the implementation of Common Core given as the principal reason for this explosive growth. Similar situations can be cited in many other states. In North Carolina, for example, there was a 14-percent increase in home schooling, with Common Core being listed as the number one reason. Home schooling has grown so quickly in that state that more children are now being homeschooled than are in private schools. \\nCommon Core is just the latest, and perhaps the most ambitious, reincarnation of continuing efforts to impose a nationalized curriculum. Past education ideas, such as Mastery Learning, Outcome-Based Education, No Child Left Behind, and the like share a common ideology: Every school in America should teach the same curriculum, and that curriculum should be imposed upon every student. \\nThis is accomplished via incessant testing. While advocates of “national standards” and “national testing” will usually deny that they are attempting to impose a national curriculum, the truth is that if you have national standards that are evaluated through national tests, you have a national curriculum. \\nMany of the Founding Fathers were homeschooled, such as George Washington. The modern homeschool movement began in the 1960s, but grew slowly until the last couple of decades. One obstacle was that homeschooling was illegal in most of the states; however, these laws were changed over time, and by 1993 homeschooling was recognized in all 50 states. \\nSeveral arguments have been advanced against homeschooling, of course. Some question whether students can learn to “socialize” when educated at home. Others contend that most parents are simply not equipped to supervise their child’s learning, especially as they grow older and need specialized instruction in more advanced subjects. \\nMany of these well-meaning (in most cases) concerns about homeschooling are based upon misunderstandings about what is involved in homeschooling, and how it has evolved over the years. For example, many homeschooling parents have formed co-ops so their children can participate in group learning, sports, band, and other such activities, and have even started homeschool athletic teams. \\nWhere do the homeschoolers live? A little more than one-third live in the suburbs. About one-third live in rural areas, and a little less than a third are in cities. \\nThe public-school movement originated with reformers such as Horace Mann in the 19 th century, most of whom were Unitarians. Unitarians are an off-shoot of Christianity who reject a cardinal belief of the Christian faith: that human beings have a sinful nature. Unitarians believe in what is called the “perfectibility of man.” As can be seen in the Mann quotation that began this article, they viewed the public schools as the place this could best be accomplished. \\nTheir push for public schools was largely ignored, however, until the 1840s and 1850s, when the nation saw a rising tide of immigration from Ireland and Germany. Almost all of these immigrants were Roman Catholics, and this enabled Unitarians to enlist Protestant ministers in the movement for public schools. The early public schools opened with prayers, used the Bible as a textbook, and were more or less adjuncts of Protestant Christianity in the country. Because of this, the Catholics largely withdrew from the public schools and formed their own parochial schools. \\nOf course, Catholics have nothing to fear today about having their children converted to Protestant Christianity (or any other kind) by sending their children to the public schools. The Christian faith is often questioned in history textbooks, the doctrine of special creation is mocked with the teaching of biological evolution in science classes, and secular humanism is the prevailing religious view in public-school classrooms. While there are many fine conservative and Christian school teachers in these public schools, the system works against them. \\nBecause the public schools are regarded by so many Christians as indifferent at best and hostile at worst to the Christian faith, we have seen tremendous growth in the number of private schools. There are many good private schools across the country; however, far too often the very same educational philosophy, complete with Common Core and the like, has also invaded these schools, even supposedly Christian schools. \\nAn example of yet another model of education available for parents to consider is the Freedom Project Academy (FPA), a classical school that offers online classes in real time, with live teachers and student interaction, not recorded lessons. From its inception in 2011, FPA has grown tremendously, with 35 percent growth in one year, and now has over 600 students enrolled across the country, from kindergarten through high school. Its media, original programming, and scholastic materials have been accessed by millions of students and viewers. \\nGraduates have enrolled in higher education, have accepted internships, and have entered the workforce. They are prepared to compete academically at an extremely high level, bolstered by an education centered on civics, economics, writing, and math, and fortified by the Judeo-Christian values that are at the heart of the curriculum. \\nDr. Duke Pesta, the academic director for FPA, told The New American , “Many kids who take our placement exams end up joining FPA after spending a few years in private schools, where parents become frustrated with the cost of tuition and imposition of Common Core in the classroom.” \\nPesta added that FPA is partnering with private schools, homeschools, co-ops, and churches, “beaming our teachers and curriculum into their local communities,” giving families a quality, yet affordable, education in safe spaces. He noted that “FPA’s reputation as a national leader in online K-12 education has provided a platform for us to offer national leadership in the fight against Common Core standards and the federalization of education. [FPA kids are] economically literate, schooled in the Constitution and founding documents. We are creating morally responsible, civic-minded thinkers, and we’re doing it without the help of the federal government.” \\nPesta encouraged interested persons to visit facebook.com/FreedomProjectEducation/. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563305.0577798}