{"duration": 0.06562042236328125, "input_args": {"text": "'Good morning. Welcome to California Today, a morning update on the stories that matter to Californians (and anyone else interested in the state). Tell us about the issues that matter to you  —   and what you’d like to see: CAtoday@nytimes. com. Want to receive California Today by email? Sign up. As we take a closer look at the 17 voter initiatives on the ballot this November, one of the less prominent measures with a lot of money at stake is Proposition 51. Though it will likely get overshadowed by flashier topics like marijuana and the death penalty, a yes vote would allow the state to issue $9 billion in bonds for school construction projects. Backers have raised more than $9 million to fight for its passage, according to The Sacramento Bee’s Data Tracker. Most of the proceeds from Proposition 51 would go toward upgrading the state’s   buildings, with another $2 billion set aside for community colleges. Those bankrolling the effort are mostly   construction groups that have a profit motive to see it pass. Supporters say the measure comes at a time of dire need. It’s been 10 years since the last statewide school bond measure and many of California’s roughly 10, 000 public schools are outdated and crumbling. A couple weeks ago, for example, a school in Daly City canceled classes after its aging sewer system backed up into the bathrooms. Dozens of school districts, state lawmakers and business groups have endorsed Proposition 51. Last week, the editorial board of The San Francisco Chronicle did too, calling it “a statewide commitment to the success of local schools. ” While many opponents acknowledge a need to upgrade infrastructure, they say Proposition 51 is the wrong way to go about it. In February, Gov. Jerry Brown called it a “developers’ $9 billion bond” that would deepen school inequity. The funding process favors schools that apply for projects early, meaning affluent districts with more seasoned administrators could muscle out poorer ones. “It’s a blunderbuss effort that promotes sprawl and squanders money that would be far better spent in   communities,” Mr. Brown said. Critics argue that local districts are more than capable of issuing bonds of their own for schools and housing developers should shoulder more of the costs. The editorial boards of The Mercury News in San Jose and The San Diego   have opposed the initiative. The bond would cost Californians roughly $8. 6 billion in interest by the time it is paid off in 35 years. They would pay that bill through taxes, reductions in services or both. Californians tend to approve bonds for school upgrades, and a poll conducted in April suggested that they were likely to favor a statewide measure in November. If opponents hope to turn that tide, they have work to do. Want to go deeper? Dive into analyses by the Legislative Analyst’s Office and the League of Women Voters of California. What are the issues with the schools in your area? Tell us at: CAtoday@nytimes. com. Your response may be featured in an future newsletter. • Kamala who? Many voters remain undecided or unaware of the candidates in the United States Senate race. [KQED] • How a congressional race in Santa Barbara became one of the most expensive in the country. [Los Angeles Times] • Economists may not like it, but rent control is spreading to the Bay Area’s suburbs. [San Francisco Chronicle] • Elon Musk said Tesla is readying improvements to its Autopilot technology that might have prevented a fatal accident in May. [The New York Times] • Apple is helping revive Nintendo’s great franchise with Super Mario Run, coming exclusively to iOS. [The New York Times] • Kim Chambers set off on a record bid to swim 93 miles to Tiburon from Sacramento. In the end, she couldn’t do it. [The New York Times] • Recovery on Cobb Mountain: Nearly a year after the Valley Fire, a family struggles to reclaim their lives. [Sacramento Bee] • Alexis Arquette, a transgender actress born into a famous Hollywood family, has died at 47. [Los Angeles Times] • A deadly fungus has moved inexorably across the Sierra Nevada, leaving thousands of frogs dead. [KPCC Radio] • Separating financial reality from the romantic vision of being a vineyard owner is not easy. [The New York Times] • A San Francisco Opera staging of “Dream of the Red Chamber” hopes to succeed where similar efforts have struggled. [The New York Times] • On Monday, Defense Secretary Ashton B. Carter will visit one of the department’s outposts in Silicon Valley. On Tuesday, he’ll meet with artificial intelligence researchers. • Beyoncé is to perform twice in California, at Dodger Stadium on Wednesday, and Levi’s Stadium on Saturday. Our critic called an earlier stop on the tour “a display of a female power. ” • The Monterey Jazz Festival starts Friday. Among the stars: Wayne Shorter, Pat Metheny and Branford Marsalis. • The 68th Primetime Emmy Awards will be held Sunday. HBO’s “Game of Thrones” led the nominations with 23, followed by “The People v. O. J. Simpson” and “Fargo. ” Research centers at U. C. Davis are interrogating some of the planet’s most pressing problems. There are the Comprehensive Cancer Center, the Center for Poverty Research   …     the Coffee Center. U. C. Davis recently announced what it said would be the world’s first university research hub focused on   studies of coffee. Plans for the center grew out of the popularity of the undergraduate course called Design of Coffee. Introduced in 2013, it now has the highest enrollment  —   more than 1, 500 students a year  —   of any elective course at Davis, surpassing favorites like Introduction to Human Sexuality. The Coffee Center is being financed with a $250, 000 gift from Peet’s Coffee, the   chain. William Ristenpart, the director of the center, said researchers would explore “everything you do after you pick the cherry, through the washing, drying, roasting, brewing and tasting. ” U. C. Davis also offers courses in winemaking and beer brewing. Asked what beverage the university might turn its attention to next, Professor Ristenpart said a colleague was soliciting funding for a distillation center. “So, I suppose craft cocktails could be next,” he said. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742628340.2996638}