{"duration": 0.06110978126525879, "input_args": {"text": "'Mittwoch, 23. November 2016 Mann bucht Maas und Nahles für 10.000 Euro, damit sie beim Dachdecken helfen Bremen (dpo) - \"Das ist wahrscheinlich das teuerste Dach hier in der Wohngegend, aber das ist es mir wert\", erklärt Günther Neukamm. Der 43-Jährige hat sich bei der SPD-Agentur Network Media für insgesamt 10.000 Euro sowohl Bundesjustizminister Heiko Maas als auch Arbeitsministerin Andrea Nahles als Gehilfen zum Dachdecken angemietet. Als er zum ersten Mal hörte, dass man SPD-Minister gegen Geld buchen kann , sei ihm sofort sein Dach eingefallen, so Neukamm. \"Der Hausbau hat mich rund 200.000 Euro gekostet. Da kommt\\'s auf die 10.000 nicht mehr an. Eigentlich kosten die einzeln 6000, aber ich habe Mengenrabatt bekommen, weil ich zwei genommen habe.\" Über die dachdeckerischen Fähigkeiten der beiden Politiker macht sich Neukamm keine Illusionen: \"Mir ist schon klar, dass die in der Richtung nix drauf haben\", erklärt der Bremer Restaurantbesitzer. \"Aber ich dachte mir, die sollen wenigstens einmal im Leben auch was Anständiges machen. Mensch, Andrea! Das seh ich doch von hier unten, dass da ein abgeschliffener Ziegel hinmuss! Du bist doch Arbeitsministerin! Dann arbeite auch mal ordentlich!\" Nach neun Stunden harter Knochenarbeit verabschiedet Neukamm die beiden völlig erschöpften Minister. Er findet, dass sich die Aktion gelohnt hat: \"Ich hab mich fast totgelacht, als der Maas einmal fast vom Dach gefallen ist und mich gewundert, wie viele Ziegel die Nahles wuchten kann.\" Soeben wurde bekannt, dass die SPD das mittlerweile in Verruf geratene Programm mit sofortiger Wirkung einstellt . Neukamm bedauert das: \"Eigentlich wollte ich mir mal diesen Oppermann nach Hause holen. Diesmal sogar wirklich für ein Gespräch. Ich schlaf doch abends immer so schlecht ein.\" ssi, dan; Foto [M]: Shutterstock Artikel teilen:'"}, "time": 1742562394.3149683}