{"duration": 0.12153100967407227, "input_args": {"text": "'Indian Country – by Theresa Braine \\nMore details are emerging about yesterday’s police action on Highway 1806 about three miles from the Cannonball River. Commencing shortly before noon, a large contingent of heavily armed officers worked to clear a route for Dakota Access oil pipeline (DAPL) trenches in a relentless push that resulted in numerous instances of violent confrontations, culminating in the seizure of the newly established Treaty Camp and removal of a number of tents, tipis and sweat lodges. \\nThe Morton County Sheriff’s Department said that 141 people had been arrested and that at least one bullet had been fired from the frontlines. \\n“Officers met violence and resistance including a protester who fired a gun at officers in the police line, protesters who threw molotov cocktails at them and set vehicles and debris on fire,” the sheriff’s office said in a post on Facebook . \\nAn AP news story cites state spokesperson Cecily Wong describing a woman who drew a .38 caliber pistol and firing three times at officers, an account disputed by activists and not recorded on any of the on-the-scene video or live feeds currently circulating. \\nHowever, tribal law enforcement apprehended a heavily-armed man crouched in a creek with apparent connections to a private security firm hired by DAPL’s builders. The Standing Rock Sioux Tribe posted a description of the incident on its Facebook page . A man was apprehended carrying an assault rifle, with papers indicating he was employed by a private security firm, according to the Standing Rock Sioux Tribe. \\n“As reported via video evidence from the front lines on 10-27-16. A man bearing an assault rifle broke thru a barricade and was speeding toward the Oceti Sakowin camp, he was run off the road 1/4 mile north from the Camp. The man exited the vehicle where he appeared to be disguised as a water protector. He than fired several shots from his assault rifle. Tribal Law Enforcement responded, the man was then apprehended. Insurance Documents from the vehicle reveal that it is owned by Dakota Access Pipeline. We commend the BIA Law Enforcement to their commitment of public safety and for their quick response and apprehension of the suspect, who was clearly meaning to do harm.” \\nA statement by the Camp of the Sacred Stones, one of three prayer camps set up near the Standing Rock Sioux Reservation, catalogued exactly how the unarmed protectors were met by lots of firepower: “Over 300 police officers in riot gear, 8 ATVs, 5 armored vehicles, 2 helicopters, and numerous military-grade humvees showed up north of the newly formed frontline camp just east of Highway 1806. The 1851 Treaty Camp was set up this past Sunday directly in the path of the pipeline, on land recently purchased by DAPL. Today this camp, a reclamation of unceded Lakota territory affirmed as part of the Standing Rock Reservation in the Ft. Laramie Treaty of 1851, was violently cleared. Both blockades established this past weekend to enable that occupation were also cleared.” \\nAt least one sniper atop a Humvee scanned the crowd of protectors. People and horses were shot at with beanbag guns, noise concussion devices were used, and fire-extinguisher-sized canisters of tear gas and mace were deployed. Police used pepper spray and mace liberally. (Photo: Savannah Joe/Facebook) \\nStanding Rock Sioux Chairman David Archambault II blasted the use of force, the continued construction and the numerous violations of civil and human rights. \\n“We have repeatedly seen a disproportionate response from law enforcement to water protectors’ nonviolent exercise of their constitutional rights,” he said in a statement. “Today we have witnessed people praying in peace, yet attacked with pepper spray, rubber bullets, sound and concussion cannons. We urge state and federal government agencies to give this tense situation their immediate and close attention.” \\nHe noted that DAPL parent company Energy Transfer Partners had completely ignored the request by the administration of President Barack Obama to voluntarily halt construction while the legal issues raised by the tribe were resolved. \\n“By deploying law enforcement to support DAPL construction, the State of North Dakota is collaborating with Energy Transfer Partners and escalating tensions,” Archambault said. “We need our state and federal governments to bring justice and peace to our lands, not the force of armored vehicles.” \\nArchambault urged everyone who supports Standing Rock’s efforts to divert or halt the pipeline to remain peaceful and prayerful and not resort to violence or lash out in anger. \\n“Any act of violence hurts our cause and is not welcome here,” he said. “We invite all supporters to join us in prayer that, ultimately, the right decision—the moral decision—is made to protect our people, our sacred places, our land and our resources. We won’t step down from this fight. As peoples of this earth, we all need water. This is about our water, our rights, and our dignity as human beings.” \\nFirsthand accounts bore stark witness to the events as they happened, via Facebook live feeds, social media posts and other dispatches from the front lines. \\nDallas Goldtooth, organizer of the Keep It in the Ground movement with the Indigenous Environmental Network, posted updates throughout the day. \\n“President Obama had asked that work stop within 20 miles of river yet National Guard were used to clear the way for yesterday’s police sweep & DAPL construction,” he wrote. “DAPL security forces were part of the invasion. They had armed men with AR-15 and had malicious intent to sneak into the camp.” \\nHe said that men and women had been pulled out of a sweat lodge ceremony at gunpoint. \\n“The similarities to Wounded Knee cannot be ignored. There was potential last night to turn a peaceful protest into a major tragedy,” he wrote. \\nGoldtooth also contrasted such treatment of unarmed water protectors with the acquittal, on the same day, of the armed militia who took over Malheur Wildlife Refuge. \\n“The racial undertones of yesterday’s actions cannot be ignored,” Goldtooth wrote. “Armed white men stand off against police in Oregon: Acquitted. Unarmed water protectors in North Dakota: Concussion grenades, rubber bullets and batons.” \\nHe said that North Dakota police’s characterization of them as “armed vigilantes” was patently false. Jesus Wagner was shot in the face with a rubber bullet. (Photo: Facebook) \\n“The only weapons on site yesterday were in the hands of militarized police,” he wrote. “Assault rifles, snipers, concussion grenades, batons, etc.” \\nThe harm was not limited to humans. Riders on horseback were also assaulted, and one horse was killed. \\n“Horseback riders were attacked by police on ATVS resulting in one horse being hurt so severely that it had to be put down,” Goldtooth said. “There were national guard humvees on site with snipers stationed on top.” \\nNot even medical personnel were immune. \\n“They sprayed me with my hands up and my back to them, with all my medic markings clearly showing. They sprayed me head to toe,” said one man in a Facebook post by the Standing Rock Medic & Healer Council. “They pointed shotguns at me. They pointed shotguns at my back while I was treating patients.” \\nJon Eagle Sr., Tribal Historic Preservation Officer of the Standing Rock Sioux Tribe, spoke of the heartbreak. \\n“My heart hurts,” he said on Facebook. “Because of the actions of a few, many people were hurt today. People were shot with rubber bullets and beanbags. They used pepper spray, percussion grenades and sound cannons. Numerous arrests. I can’t believe what I witnessed today and it’s still going on. Prayers for the protectors tonight.” \\nThere were uplifting moments as well. As the conflict escalated, a woman yelled at everyone to “look at the buffalo!” \\n“We all turned to the east to see a herd of buffalo come charging,” Eagle said. “Behind them were young warriors on horse back. Police in ATV’s charged after them. There were shots fired. The young men rode through the line of ATV’s and made their get away. A war cry went up from the crowd. I’m proud to say we are still the greatest light cavalry in the world!” \\nMany activists and protectors used social media to describe feelings of nausea, light-headedness and sickness after returning to the camps near Standing Rock, and also this morning as a new, uncertain day dawned on the plains. \\nRead more at http://indiancountrytodaymedianetwork.com/2016/10/28/conflicting-accounts-emerge-after-treaty-camp-police-action-166259'"}, "time": 1742564481.0520644}