{"duration": 0.021574735641479492, "input_args": {"text": "'0 comments Is she a loyal wife and patriot or traitorous spy? Hackers exposed her secrets then her husband’s sex scandal opened the floodgates… Huma Abedin, Hillary Clinton’s top assistant for years, has perhaps become the most significantÂ figure in the final weeks of the 2016 Election. Born in the United States, Abedin’s family moved to Saudi Arabia when she was two. At age 18, she returned to the United States, and, in 1996, at age 20, started interning for Hillary Clinton. From 2002-2008, she also worked for her mother’s radical Muslim magazine, the Journal for Muslim Minority Affairs. Reportedly, the Journal advocates Sharia law and denounces the right of women. Through WikiLeaks, we recently learned just how close Huma was to Hillary. Clinton aid Huma Abedin had access to Clinton email address used for classified emails https://t.co/G3DusQy1ZQ pic.twitter.com/QmoEn8DDg5 \\nâ\\x80\\x94 WikiLeaks (@wikileaks) August 9, 2016 \\nShe obviously had access to Hillary’s emails. It makes sense, now, to conclude that Huma knew much more about the email scandal that has plagued the Clinton Campaign for some time. Justin Cooper was the Clinton aide who set up the email server. Huma: “My clinton [black]berry not working” Cooper: “We were attacked again” pic.twitter.com/KjQcbocQzz \\nâ\\x80\\x94 Lachlan Markay (@lachlan) October 28, 2016 \\nClearly, Huma knew that they had been hacked in the past, yet she never once reported the possible vulnerabilities to National Security? \\nToday, we learned that the New York Police Department, while investigating the sexting scandal of Huma’s estranged husband, former Congressman Anthony Weiner, uncovered a digital folder entitled, â\\x80\\x9cLife Insurance.â\\x80\\x9d Multiple news sources have reported that the folder contains 650,000 official emails from Huma and Hillary’s time at the State Department. \\nDid Huma create the â\\x80\\x9cLife Insuranceâ\\x80\\x9d folder to use as leverage, just in case her boss, Hillary Clinton, ever turned on her? Or, did Anthony Weiner create the folder, for his own bargaining options? So did Huma steal 10,000 emails and saved it on her comp just in case Clinton targeted her? \\nHence: “life insurance” \\nâ\\x80\\x94 Charlie Kirk (@charliekirk11) October 30, 2016 FBI Source: Weiner singing like a bird for a deal; he knows what happens to pedophiles in prison \\nâ\\x80\\x94 Jack Posobiec đ\\x9f\\x87şđ\\x9f\\x87¸ (@JackPosobiec) October 30, 2016 \\nSome news outlets have wondered if Huma Abedin is actually a spy. \\nGiven Huma Abedin and Anthony Weiner’s backgrounds, all of these questions are legitimate. \\nConsider this revealing video, created by the hacking group, Anonymous: Anonymous said it best: â\\x80\\x9cWho is Huma?â\\x80\\x9d'"}, "time": 1742628519.9849489}