{"duration": 0.023831605911254883, "input_args": {"text": "'Rusia e India avanzan en el contrato de sistemas antiaéreos S-400 Triumf   22:10 GMT \\nMoscú y Nueva Deli también colaboran en proyectos de construcción de helicópteros y tienen en marcha un programa de fabricación de buques de guerra. Sistema de misiles antiaéreos S-400 de alcance medio-grande Triumf Kirill Kallinikov Sputnik   \\nLas autoridades militares de la India y Rusia han avanzado en varios proyectos conjuntos, incluyendo en las negociaciones sobre los sistemas de defensa aérea S-400 Triumf, señaló este miércoles el ministro de Defensa ruso, Serguéi Shoigú, en la 16.ª reunión de la comisión intergubernamental ruso-india para la cooperación técnico-militar. \\n\"Observo con satisfacción los progresos en nuestros grandes proyectos como la construcción conjunta de helicópteros Ka-226, sistemas de misiles BrahMos [misiles de crucero] y sistemas de defensa aérea S-400 Triumph\", dijo Shoigú citado por RIA Novosti . \\nSegún el ministro, está en marcha un gran programa especial de construcción de buques de guerra, incluyendo submarinos. \\nShoigú ha indicado que las partes ya han empezado a negociar algunos puntos del futuro contrato, en particular los relativos a cuestiones de entrega y servicio de posventa y garantía. \\nHasta el momento, Rusia es el único operador de este sofisticado sistema de defensa aérea, pero en 2015 se firmó un acuerdo con China para vender los S-400 al gigante asiático, que se convierte en el primer país extranjero en comprar estos complejos. \\nEl S-400 Triumf es el más avanzado sistema antiaéreo de las Fuerzas Armadas rusas. Las capacidades de este sistema permiten detectar y atacar cualquier objetivo aéreo –ya se trate de un avión o de un misil balístico– en un radio de 400 kilómetros.  '"}, "time": 1742628420.240488}