{"duration": 0.031538963317871094, "input_args": {"text": "'US Airstrikes on Iraqi Army Slowing Advance on Mosul ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Time for FBI director Comey to go By GPD on October 29, 2016 Just an idiot or \"on the pad? Either way, Comey should go...and if some are right, it will be prison. Dupe, idiot or another Hoover wannabe? Paul Callan says that the FBI director, by foolishly making a public announcement that the agency is reviewing newly discovered emails related to Hillary Clinton’s personal server, has inserted himself yet again into the campaign He says his clumsy handling of the probe is reason for Comey to resign In truth, investigations open and close routinely and secretly when new evidence comes to light. Each new scrap in a pile of useful or useless evidence is not announced in real time, like a scandal in a scripted reality TV Show. Perhaps it’s time for the embattled FBI director who seems to have forgotten how to conduct a proper investigation to resign. Paul Callan is a CNN legal analyst, a former NYC homicide prosecutor and currently is “of counsel” to the New York law firm of Edelman and Edelman, PC, focusing on wrongful conviction and civil rights cases. Follow him @paulcallan (CNN) Donald Trump’s oft-repeated claim that the FBI’s investigation of “Crooked Hillary” and the presidential election itself were and are “rigged,” seems to have thrown FBI Director James Comey into a state of panic. In foolishly making a public announcement that the bureau is reviewing newly discovered emails related to Hillary Clinton’s personal server, he has inserted himself yet again into the presidential campaign. The FBI virtually never announces the commencement or termination of ongoing criminal investigations or the discovery of new evidence. Such inquiries are often conducted in relative secrecy, enabling a more efficient investigation. The old, sensible FBI rule book apparently has been thrown on the trash heap this year. Read more at CNN Related Posts:'"}, "time": 1742562293.6186957}