{"duration": 0.08499455451965332, "input_args": {"text": "'posted by Eddie Cyndy Coppola was arrested for standing on her own property as she tried to block Dakota Access Pipeline construction equipment from crossing her land. Once again, the repression of those against the Dakota Access Pipeline (DAPL) is heating up, with 127 activists arrested in North Dakota over the weekend. However, North Dakota isn’t the only place where protests over the Dakota Access pipeline are coming to a head. In Iowa, farmers have had their land seized by the company behind the pipeline, Energy Transfer Partners, through the use of eminent domain. Eminent domain has been legal in the US since 1888, thanks to the passage of the Condemnation Act . The law authorizes the federal government to take private property for public use. However, in 1906, the law was amended to allow for the seizure of private property even if it only benefited private parties (e.g., corporations), not the public. The argument for this was that corporate seizure of private land “helps” the public through economic development. Yet, what the law essentially means is that even your own land doesn’t belong to you if the government or government-supported corporations want it. A sad, yet accurate example of eminent domain gone wrong took place last week in Calhoun County, Iowa. Cyndy Coppola was arrested over the weekend on her own property for trying to block access to DAPL trucks from hauling pipeline construction materials through her land. DAPL first received access to Coppola’s farm through the use of eminent domain, which granted Energy Transfer Partners easements to her property. Coppola remarked that watching the morally wrong seizure of the farm she worked so hard for was difficult to handle. “It was very frustrating, and when I first saw that topsoil piled up when they started digging, my first reaction was to cry, because we’ve tried everything.” Coppola, as well as nine other local farmers, are suing Energy Transfer Partners for the seizure of their property. They are arguing that the move stands in complete violation of Iowa state law. The pipeline has generated controversy for most of this year, inspiring the largest gathering of Native American tribes in recent history to fight the project. They, as well as environmental activists, argue that the pipeline will poison the water and destroy the sacred sites of the Standing Rock Sioux tribe. The evidence stands on their side, as the company that will be tasked with managing the pipeline after its construction has been responsible for more leaks than any of their competitors, with over 200 recorded leaks since 2010. The most recent of these happened over the weekend when a Sunoco pipeline leaked 55,000 gallons of gasoline into one of the nation’s most endangered rivers. Even the UN has officially condemned the project, asking the US federal government to end the project immediately. However, the federal government is openly supporting the crackdown on protestors, as well as journalists who are covering the story. Democracy Now’s Amy Goodman was charged with “participating in a riot” just for reporting on the issue. Though those charges were eventually dropped, the North Dakota State Attorney who initially charged her has vowed to look for new reasons to criminalize Goodman’s reporting. Goodman said that these actions send a chilling message to journalists, “don’t come to North Dakota.” The Dakota Access pipeline has proved, without a doubt, that private interests are the real beneficiaries of federal policy, allowing them to take what’s lawfully yours and even arrest you just for standing on your own property. What are your thoughts? Please comment and share this news! source:'"}, "time": 1742561666.697619}