{"duration": 0.05456137657165527, "input_args": {"text": "'In a series of tweets, Iranian foreign minister Mohammad Javad Zarif slammed U. S. President Donald Trump while praising Pope Francis for his alleged “denunciation of #MuslimBan” and of the Rohingya genocide going on in Myanmar. [Zarif appears to have attempted to drive a wedge between Trump and the Pope, tweeting that the world “needs leaders who urge dialogue  compassion, not walls  exclusion. ”  Welcome @Pontifex denunciation of #MuslimBan  #RohingyaGenocide. World needs leaders who urge dialogue  compassion, not walls  exclusion.  —   Javad Zarif (@JZarif) February 10, 2017,  The Iranian minister was referring to a recent general audience in which Pope Francis made some extemporaneous remarks urging prayer for the persecuted Rohingya people, who are Muslims. The Pope actually never mentioned President Trump’s temporary travel ban on 7 nations that are hotbeds of Islamic terrorism, including Iran. In his remarks Wednesday, Francis asked his hearers to pray in a special way for “our Rohingya brothers and sisters. ” “Driven out of Myanmar, they go from one place to another because they are unwanted,” he said. “They are good people, peaceful people. They are not Christians, but they are good, they are our brothers and sisters. And they have been suffering for years,” Francis said. “They have been tortured, killed, simply because they follow their traditions and their Muslim faith. Let us pray for them. I invite you to pray for them to our Father in Heaven, all together, for our Rohingya brothers and sisters. ” Earlier in his address, the Pope repeated a favorite   of his regarding the need to “create bridges rather than walls,” though the Vatican has insisted that this figurative expression refers to an attitude of openness to dialogue with others, and does not refer to specific walls or persons. Charles Maung Bo, the first Catholic cardinal from Myanmar (the former Burma) has called the persecution of the Rohingyas “an appalling scar on the conscience of my country. ” According to Cardinal Bo, the Rohingyas are “among the most marginalized, dehumanized and persecuted people in the world. They are treated worse than animals. Stripped of their citizenship, rejected by neighboring countries, they are rendered stateless. ” Among his recent tweets, Zarif also confirmed his support for U. S. protesters against President Trump, saying that many Iranians had also demonstrated in defiance of “threats  insults” from the U. S. government. On Revolution Day, Iranians turn out in huge numbers to defy threats  insults by US govt praise American people for rejecting #MuslimBan. pic. twitter.   —   Javad Zarif (@JZarif) February 10, 2017,  Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742564313.8420494}