{"duration": 0.1831068992614746, "input_args": {"text": "'MONTROSE, Colo.  —   There is a new menace on America’s roads: diesel truck drivers who soup up their engines and remove their emissions controls to “roll coal,” or belch black smoke, at pedestrians, cyclists and unsuspecting Prius drivers. Sgt. Chris Worthington of the Montrose Police Department here is out to stop them. “You can hear those trucks across town, driving like idiots,” he said on a recent Friday evening patrol. He is among the first law enforcement officers in the country to be trained at “smoke school” to pick up the skills to police the coal rollers. He lost sight of one truck cruising in the opposite direction, trailing plumes of smoke. But another, a Ram 3500 fitted with two steel smokestacks, was parked in a Walmart parking lot. The owner, Pryce Hoey, insisted his truck was emissions compliant, but nevertheless agreed to demonstrate its   prowess. “I just wanted something different,” Mr. Hoey said, revving the engine and releasing two black pillars of smoke into the evening air before Sgt. Worthington shut him down. “People who see it giggle. They think it’s funny. ” Depending on whom you ask, rolling coal is a juvenile prank, a health hazard, a stand against rampant environmentalism, a brazen show of American freedom. Coal rollers’ frequent targets: walkers, joggers, cyclists, hybrid and Asian cars and even police officers. A popular bumper sticker reads “Prius Repellent. ” Many document their feats online. Coal rollers also have their own reality TV show. And while official tallies of coal rolling do not exist, there are signs that smoke, whether from intentional belching or not, is a growing public nuisance. In Colorado, complaints over diesel smoke have risen 5 percent over the last two years. In California, complaints about smoking vehicles to the California Air Resources Board have jumped from under 700 a month, on average, two years ago to more than 1, 000 now. State legislatures, as well as local law enforcement agencies, are starting to take action. Last year, New Jersey became the first state to explicitly ban rolling coal, going beyond the federal laws that already prohibit drivers from tinkering with emissions controls. A similar bill is on the table in Illinois, while Colorado and Maryland have defeated proposed bans. New Jersey’s bill, which can impose a fine of up to $5, 000 on drivers caught rolling coal, was proposed by Tim Eustace, a state assemblyman who was engulfed by black smoke from a pickup truck on the New Jersey Turnpike. “Momentarily, you can’t see anything. It’s terrifying,” said Mr. Eustace, who drives an electric vehicle. “It’s exuberant adolescent testosterone. ” But to diesel owners like Corey Blue of Roanoke, Ill. the very efforts to ban coal rolling represent the worst of government overreach and environmental activism. “Your bill will not stop us!” Mr. Blue wrote to Will Guzzardi, a state representative who has proposed a $5, 000 fine on anyone who removes or alters emissions equipment. “Why don’t you go live in Sweden and get the heck out of our country,” Mr. Blue wrote. ” I will continue to roll coal anytime I feel like and fog your stupid  . ” Even in this election year of bombastic rhetoric on political correctness and climate change, rolling coal stands out as an ideological statement. At its core, it also struggles with a basic, somewhat existential question: Should we seek to minimize the human footprint on the earth, or should we flaunt it? Since 2007, activists have drawn attention to the environment with a call to switch off appliances worldwide during an annual Earth Hour. But since 2009, the libertarian Competitive Enterprise Institute has countered with Human Achievement Hour, a call to spend that same hour keeping things on in defense of humankind’s “basic human right to use energy. ” Still, Michelle Minton, a fellow at the institute, draws a line. Coal rollers who use their trucks for harassment, as opposed to celebration, “aren’t being rebellious,” she said, they are just being jerks. Rolling coal has origins in truck pulls, in which pickups compete to pull a heavy sled the farthest. Drivers modify their trucks to pump excessive fuel into the engines, increasing horsepower and torque. Stripped of emissions controls, the trucks also bellow thick, black smoke. At a recent truck pull at the McHenry County Fair in Woodstock, Ill. the fumes were part of the draw. “When the smoke goes black, don’t look back,” read one man’s  . “We pull for bragging rights,” said Scott Vivian, president of the Illini State Pullers league, the event’s organizer. “And smoke’s a big part of it. ” Shane Johnson has named his truck, a Ford   body with a   Duramax engine, Public Enemy. He pulled the sled almost all the way down the dirt track, spewing a column of smoke into the summer sky. “It’s an adrenaline rush,” he said. Still, fans of truck pulling insist  —   and environmental officials largely agree  —   that it is harmless entertainment. When the E. P. A. completed new truck emissions standards this month, it emphasized that it did not intend to go after trucks used in motor sports. There is, in fact, disdain among   enthusiasts toward coal rollers, whom they view as wannabes sullying their sport. “I hate those guys. I used to do it, smoke out friends, but I grew out of it,” Mr. Johnson said. “Gives diesel a bad name. ” Raymond Elick runs the smoke school at the Colorado Health and Environment Department, training police to spot coal rollers. It is more art than science. In Colorado, a bill that would have made rolling coal a misdemeanor died in a G. O. P.  State Senate in April. Still, an obscure Colorado state law, a holdover from the days when diesel was far dirtier, allows officers to cite coal rollers that blow smoke for at least five seconds at more than 40 percent opacity, or thickness. Using a “smoke machine” that burns toluene, Mr. Elick has trained 55 police officers to discern smoke opacity: Zero percent opacity is clear air 100 percent opacity lets no light through. “If it’s smokin’ it’s broken,” Mr. Elick said. “If you see a smoky truck running down the street, that’s probably   percent, and that’s pretty darn smoky,” he said. “If all of the light disappears over that path, if it’s a really bad coal roller, it could be approaching 100 percent. ” A group of Canadian cyclists touring the Vermont countryside in June was on the receiving end of a coal roller’s attention. A white pickup truck accelerated, then belched on the bikers, said John Gelder, a management consultant based in Ottawa. Several minutes later, the truck returned to smoke them out a second time. “What the hell. Can you believe it? ’” Mr. Gelder remembers shouting to his friend Steve Fischer, a Canadian journalist who was touring with him. “It’s like weapons. They think: ‘We’re entitled to our guns, and we’re entitled to our roads,’” Mr. Gelder said. “It’s almost an assault. ” The group alerted the police in Morristown, Vt. who Mr. Gelder said took no action. Andrew Glover of the Morristown Police Department said that officers would probably not pursue the case. “We don’t have a law against whatever they did,” he said. Mr. Fischer later wrote up the group’s ordeal for the Canadian news network CBC. “I gave the driver my middle finger and yelled words I am not allowed to use on the CBC website,” Mr. Fischer reported. “Tuning” passenger vehicles to override emissions controls is relatively easy, with appropriate gear. Online retailers like Amazon and eBay sell aftermarket products that render emissions equipment inoperable. The Volkswagen diesel scandal has helped thrust emissions cheating into the spotlight. The German automaker acknowledged last year that it used a defeat device to evade emissions limits. Up to 11. 5 million of its vehicles worldwide contain the tainted software. The Environmental Protection Agency has also gone after the aftermarket hobbyist market. In 2013, it fined a components manufacturer in Ogden, Utah, $500, 000 for selling devices that let diesel truck owners override emissions controls. Still, it remains easy to modify a truck to bypass pollution controls, said John Voelcker, editor of GreenCarReports. com. “If you have a hacksaw and a cutting torch, and you read the forums, you’re probably halfway there,” he said. Truck owners intent on rolling coal need only to turn to the Discovery Channel reality show “Diesel Brothers” for guidance. The show, which has more than 2. 2 million viewers an episode, follows Heavy D, Diesel Dave and a team of mechanics in Utah who “build the baddest diesel trucks ever seen on the planet. ” Some of the modified trucks are offered for sale with no emissions controls on DieselSellerz. com, a site affiliated with the show. The Diesel Brothers have alarmed health professionals. Even   exposure to diesel smoke can increase the probability of heart attacks, strokes, lung disease and cancer, said Brian Moench, president of the Utah Physicians for a Healthy Environment. “You have created a growing business transforming lawful,   vehicles into illegal,  ” trucks, the physicians wrote in a letter to the Diesel Brothers. “To what purpose?” Heavy D, or David Sparks, said through a representative that there was “a misunderstanding on the modification process of trucks on the show. ” The Discovery Channel declined to comment. Anyone who tampers with   equipment violates the Clean Air Act, which prohibits the selling or installing of any component intended to bypass emissions equipment and carries penalties of up to $2, 500. Enforcing that ban on the street is difficult, however. Moves in a handful of states to follow New Jersey’s explicit   prohibition have been opposed by those who argue that a ban would be regulatory overkill. Mr. Guzzardi, the Illinois representative and an avid cyclist, has been pushing a bill that would impose an additional fine of up to $5, 000 for anyone caught coal rolling. “Why should I get a giant blast of smoke in my face from someone who doesn’t approve of my transportation method?” he said. But a bid in Colorado that would have made rolling coal a misdemeanor was defeated in April. “Are we overreaching here?” Mark Scheffel, a Republican state senator, argued in committee. “It’s just kids with too much time and money on their hands. ” Still, some truck lovers say times are changing. Danny Voss drives the Clean Sweep, the only   truck at the McHenry truck pull. His vehicle, a Chevy pickup fitted with a 2012 Duramax engine, is sponsored by Calibrated Power, which makes aftermarket parts that conform with emissions rules. “When a truck like this pulls and you don’t see the smoke, we’re proud of it,” Mr. Voss said. But when Clean Sweep dragged the heavy sled down the track, the crowd was confused. “Where’s the smoke?” one spectator shouted. “The air sucks anyway,” said Ben Poncher, who was drinking a beer next to the track. “Smoke’s pretty. I like seeing it. ”'"}, "time": 1742564409.0719297}