{"duration": 0.05714917182922363, "input_args": {"text": "'As host of “The Daily Show,” Trevor Noah comes across as a wry, startled and sometimes outraged outsider, commenting on the absurdities of American life. During the presidential campaign, the South   comic remarked that Donald J. Trump reminded him of an African dictator, mused over the mystifying complexities of the Electoral College system and pointed out the weirdness of states voting on recreational marijuana. In the countdown to and aftermath of the election, Mr. Noah has grown more comfortable at moving back and forth between jokes and earnest insights, between humor and serious asides  —   the way he’s done in his   act, and now, in his compelling new memoir, “Born a Crime: Stories From a South African Childhood. ” By turns alarming, sad and funny, his book provides a harrowing look, through the prism of Mr. Noah’s family, at life in South Africa under apartheid and the country’s lurching entry into a postapartheid era in the 1990s. Some stories will be familiar to fans who have followed the author’s   act. But his accounts here are less the polished anecdotes of a comedian underscoring the absurdities of life under apartheid, than raw, deeply personal reminiscences about being “   ” in a country where his birth “violated any number of laws, statutes and regulations. ” The son of a Xhosa mother and a   father, Mr. Noah recalls that “the only time I could be with my father was indoors”: “If we left the house, he’d have to walk across the street from us. ” It was dangerous, as a   child, to be seen with his mother as well: “She would hold my hand or carry me, but if the police showed up she would have to drop me and pretend I wasn’t hers. ” He spent much of his time at home: “I didn’t have any friends. I didn’t know any kids besides my cousins. I wasn’t a lonely kid  —   I was good at being alone. I’d read books, play with the toy that I had, make up imaginary worlds. I lived inside my head. To this day you can leave me alone for hours and I’m perfectly happy entertaining myself. I have to remember to be with people. ” Language, he discovered early on, was a way to camouflage his difference. His mother knew Xhosa, Zulu, German, Afrikaans, Sotho and used her knowledge “to cross boundaries, handle situations, navigate the world. ” She made sure that English was the first language her son spoke because “if you’re black in South Africa, speaking English is the one thing that can give you a leg up. ” “English is the language of money,” Mr. Noah goes on. “English comprehension is equated with intelligence. If you’re looking for a job, English is the difference between getting the job or staying unemployed. ” A gifted mimic, Trevor learned to become “a chameleon,” using language to gain acceptance in school and on the streets. “If you spoke to me in Zulu, I replied to you in Zulu,” he writes. “If you spoke to me in Tswana, I replied to you in Tswana. Maybe I didn’t look like you, but if I spoke like you, I was you. ” Mr. Noah offers a series of   snapshots of life in the township of Soweto, where his maternal grandmother lived, and where, he recalls, “99. 9 percent” of the residents were black, and his light skin made him a neighborhood curiosity. He remembers: “The township was in a constant state of insurrection someone was always marching or protesting somewhere and had to be suppressed. Playing in my grandmother’s house, I’d hear gunshots, screams, tear gas being fired into crowds. ” To save money, Mr. Noah recalls, his mother perfected the art of coasting their old, rusty Volkswagen downhill “between work and school, between school and home,” and enlisting her son’s help in pushing the car when the gas ran out. One month, he says, money was so short that they were forced to subsist on bowls of wild spinach, cooked with mopane worms, “the cheapest thing that only the poorest of poor people eat. ” By high school, Mr. Noah writes, he had become an enterprising businessman, copying and selling pirated CDs he and his business partners would soon segue into the D. J. business, throwing raucous dance parties in Alexandra, “a tiny, dense pocket of a shantytown,” known as Gomorrah because it had “the wildest parties and the worst crimes. ” After Mr. Noah’s father moved to Cape Town, his mother married an auto mechanic, whose English name, Abel, recalled the good brother in the Bible, but whose Tsonga name, Ngisaveni, says Mr. Noah, meant “Be afraid. ” Those names would turn out to be a harbinger of his stepfather’s dual personality  —   charming and eager to be liked on the surface, but, as Mr. Noah recalls, highly controlling, and capable of violence. In the end, “Born a Crime” is not just an unnerving account of growing up in South Africa under apartheid, but a love letter to the author’s remarkable mother, who grew up in a hut with 14 cousins, and determined that her son would not grow up paying what she called “the black tax”  —   black families having to “spend all of their time trying to fix the problems of the past,” using their skills and education to bring their relatives “back up to zero,” because “the generations who came before you have been pillaged. ” It’s the story of a fiercely religious woman, who attributes her miraculous survival from a gunshot wound to the head (inflicted by Abel) to her faith a woman who took her son to three churches on Sunday (as well as a prayer meeting on Tuesday, Bible study on Wednesday and youth church on Thursday) even when there were dangerous riots in the streets and few dared to venture out of their homes. The names chosen for Xhosa children traditionally have meanings, Mr. Noah observes: His mother’s name, Patricia Nombuyiselo Noah, means “She Who Gives Back” his cousin’s name, Mlungisi, means “The Fixer. ” His mother, Mr. Noah writes, deliberately gave him a name, Trevor, with “no meaning whatsoever in South Africa, no precedent in my family. ” “It’s not even a biblical name,” he writes. “It’s just a name. My mother wanted her child beholden to no fate. She wanted me to be free to go anywhere, do anything, be anyone. ”'"}, "time": 1742628526.4959052}