{"duration": 0.16369915008544922, "input_args": {"text": "'Alice Hemmer’s favorite part of Jack Kerouac’s novel “On the Road” doesn’t involve the     road trips, encounters with prostitutes in Mexico or wild parties in Manhattan. Alice, who is 5 and lives in a Chicago suburb, likes the part when Sal Paradise eats ice cream and apple pie whenever he feels hungry. She hasn’t actually read Kerouac’s        classic. (Alice is a precocious reader, but not that precocious.) Instead, her father read her a heavily abridged and sanitized illustrated version of “On the Road” designed for   to    children. “She didn’t love it,” said her father, Kurt Hemmer, an English professor at Harper College and scholar of the Beat Generation, who noted that even some college students failed to appreciate the novel’s subtle spiritual message. “To really grasp it, you need to be a bit more mature. ” “On the Road,” with its recurring references to sex, drugs and domestic violence, might not seem like an ideal bedtime story for a child. But that’s precisely the point of KinderGuides, a new series of books that aims to make challenging adult literary classics accessible to very young readers. Along with “On the Road,” KinderGuides recently published picture book versions of Ernest Hemingway’s “The Old Man and the Sea” and Truman Capote’s melancholy novella “Breakfast at Tiffany’s. ” (It skipped over the awkward question of whether Holly Golightly is a prostitute.) In one of its most ambitious and bizarre efforts, it released a cheerful take on Arthur C. Clarke’s opaque,   science fiction novel, “2001: A Space Odyssey,” an allegory about the evolution of human consciousness that many adult readers find impenetrable. With their bright illustrations and breezy language  —   “Sal is ready for an adventure!” pretty much typifies the tone of “On the Road”  —   the books almost seem like parodies, or the perfect gag gift for the hipster parent who has everything. But the creators of the series, the graphic designer Melissa Medina and her partner, the writer Fredrik Colting, insist they aren’t joking. They’re already working on the next four titles in the series  —   versions of Paulo Coelho’s   novel “The Alchemist,” Jane Austen’s “Pride and Prejudice,” J. D. Salinger’s “The Catcher in the Rye” and Harper Lee’s “To Kill a Mockingbird” (minus the rape charges, Ku Klux Klan rallies and racial slurs). “The goal of all of this is to get them really psyched about these books now, so that they’ll want to read the originals later,” Ms. Medina said. Though the premise of their project may strike some as absurd  —   does a first grader really need to be introduced to Kerouac or Capote?  —   kiddie lit has become a surprisingly lucrative and crowded niche. Anxious parents who played Mozart for their babies in utero and showed them Baby Einstein educational videos have snapped up children’s books that promise to turn their offspring into tiny literature lovers. BabyLit, an imprint that publishes board books for babies based on “Anna Karenina,” “Wuthering Heights,” “Don Quixote” and other classics, has sold more than 1. 5 million copies of its 24 titles. Next fall, the company will introduce a series of picture books based on classic novels geared toward older children, which will include more of the plot, starting with “ ” and “Pride and Prejudice. ” “It’s a more educational approach than just Spot the dog,” said Suzanne Gibbs Taylor, the creator of the BabyLit series. Another popular series, Cozy Classics, which was created by the twin brothers Jack and Holman Wang, reduces great works of literature to   stories, illustrated with photos of handmade felt figurines. (Their rendition of Tolstoy’s “War and Peace” can be rattled off in a single breath: “       !    . ”) Their titles, which include “Jane Eyre,” “Emma” and “Adventures of Huckleberry Finn,” are designed for babies and toddlers, but include some arch visual jokes directed at the parents, like a felt figurine of Miss Havisham flailing about in flames in “Great Expectations. ” Even with the adorable fuzzy figures, the books can be overwhelming. “My daughter started crying hysterically 3 pages into it,” one reader wrote of her    in an Amazon review of “ . ” Another reviewer questioned whether a toddler is ready for “Jane Eyre,” and called the Cozy Classics version “weird, dark and not the most appropriate for kids who are reading board books. ” Holman Wang said he and his brother wanted to preserve the sometimes grim and complex tone of the originals, rather than conforming to the “fluffy bunny aesthetic” of most contemporary picture books. “It’s not about saying, ‘My    has read ‘Pride and Prejudice,’” he said. “We try not to cheaply capitalize on these   stories by sanitizing them and losing the themes. ” Some educators are skeptical of efforts to   complex literary works to small children, especially when there’s such a rich body of classic children’s literature. “It’s ludicrous to take great works that are clearly for adults and reduce them for children,” said Monica Edinger, a   teacher at the Dalton School in Manhattan, who dismissed KinderGuides as a disingenuous attempt to exploit parents’ insecurities. Still, some parents counter that children can absorb the bigger themes, like the idea of resilience in “The Old Man and the Sea” or adventurousness in “On the Road. ” Brent Almond, a graphic designer and parenting blogger who lives in Maryland, said his    son, Jon, had responded enthusiastically to some of the books. “A lot of these books are melancholy or outright depressing, but it’s been cool to see how he reacts to them,” Mr. Almond said. Jon likes the book based on “2001” the best, because “it’s in space and it’s kind of creepy,” Mr. Almond said. (Jon didn’t seem especially bothered by one of the more chilling scenes, when the ship’s computer, Hal, turns on the astronauts and sends one of them out of the spaceship to his death, Mr. Almond said. ) Ms. Medina and Mr. Colting got the idea for KinderGuides about a year ago, when they were visiting her family in Kansas. Mr. Colting was reading “The Old Man and the Sea,” and Ms. Medina’s    niece asked him what it was about. He realized the story was easy to summarize, and saw a market opportunity. Mr. Colting, a native of Sweden, already had a background in publishing, albeit a somewhat checkered one. In 2009, he was sued by the Salinger estate for publishing an unauthorized sequel to “The Catcher in the Rye. ” He settled the lawsuit and withdrew copies from North America. Despite that earlier legal entanglement, Mr. Colting had no qualms about repurposing famous novels as picture books, including “The Catcher in the Rye. ” He argues that because they function as study guides as well as entertainment, the KinderGuides books don’t infringe on copyrighted works. Some copyright experts dispute that logic. “If you are literally taking a book and trying to translate it for children, taking what makes it literature and copying that, that sounds like infringement,” said Rebecca Tushnet, a professor at the Georgetown University Law Center. This year, Mr. Colting and Ms. Medina started an independent publishing company out of their home in Los Angeles, and began making a list of beloved classics to recast. After choosing their first few titles, they read the original works and highlighted the central themes and characters, and consulted study guides like CliffsNotes and SparkNotes. Mr. Colting wrote the text, and Ms. Medina created storyboards pairing the texts with sketches or descriptions of images. They hired a different illustrator for each book, and printed 20, 000 copies in total for the first four titles. They aim to publish 50 books, though not every classic novel seems feasible. James Joyce’s “Ulysses,” for instance, was considered but ultimately rejected. “We couldn’t in good faith do it,” Mr. Colting said, “because we haven’t read it. ”'"}, "time": 1742561755.7787676}