{"duration": 0.09324932098388672, "input_args": {"text": "'Comments FBI Director James Comey just followed up his first memo to Congress with a “cover your ass” memo to his staff in The Washington Post. The impact within the FBI has been swift after the first memo. Newsweek is reporting that the Republican FBI Director’s inappropriate letter to Congress put him in a very danger of a “mutiny at the FBI,” whose proper role is protecting America from domestic terror threats and investigating serious crimes – not influencing elections. In the FBI Director’s second letter, he admitted that his agency doesn’t “ordinarily tell Congress about ongoing investigations,” and that he doesn’t know anything about, “the significance of this newly discovered collection of emails.” He also claimed that, “I don’t want to create a misleading impression,” and Comey then made a final admission that, “in the middle of an election season, there is a signficant risk of being misunderstood.” Well, it’s too late now. FBI Dir. Comey sent a second letter today – to FBI employees. He seems to have some doubts about what he did (via WashPost) pic.twitter.com/IagFJRZYyU \\n— West Wing Reports (@WestWingReport) October 29, 2016 Newsweek’s report about this latest non-scandal points out firmly that the FBI Director’s letter literally points out emails that have nothing to do with the Democratic nominee. \\nThe disclosure by the Federal Bureau of Investigation late on Friday, October 28 that it had discovered potential new evidence in its inquiry into Hillary Clinton’s handling of her personal email when she was Secretary of State has virtually nothing to do with any actions taken by the Democratic nominee, according to government records and an official with knowledge of the investigation, who spoke to Newsweek on condition of anonymity. The revelation that the FBI has discovered additional emails convulsed the political world, and led to widespread (and erroneous) claims and speculation. \\nMoreover, despite the widespread claims in the media that this development had prompted the FBI to “reopen” of the case, it did not; What we know: FBI found some emails on a new device. They dont know whats in them or if they\\'re copies or if they\\'re classified. That\\'s it. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 Sources inside the FBI told Newsweek they were furious with Director Comey’s rare public revelations from the Clinton investigation from the start. Comey’s decision to leak news about a politically driven investigation is threatening his professional standing and ability to function inside the Bureau. Newsweek’s top investigative reporter Kurt Eichenwald told the story in a tweetstorm: Word from inside @FBI . FURIOUS at Comey, think he\\'s mishandled public revelations from get go. \"Outrageous incompetence\" one agent told me. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 If Comey doesn\\'t get ahead of this, going to have a mutiny at @FBI . \"This is why u say \\'We dont talk about investigations\\'\" one told me…. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 …his original decision to lay out info on clinton case, then opine on what it meant outside of criminal findings, infuriated these folks.. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 …to begin with, because it was inappropriate precedent set. Then it set him up for what he did today, and because he knew how angry… \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 …people inside were with him, he was trying to play to two audiences — updating his testimony while not revealing too much. But that…. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 ….just made everything worse. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 \\nThe FBI has a difficult job to perform in the best of times, and when it comes to political investigations agents must walk a tightrope between performing their duties properly, and unduly influencing public opinion with the results of their investigations. For an entire year, they managed to quietly, but diligently investigate the sensitive matters surrounding Hillary Clinton’s emails which they ultimately concluded, “were not a cliff-hanger” because there was literally no there, there. \\nThese events show precisely why the FBI does not ordinarily publicly release the results or targets of their investigations until charges are filed. \\nThese memos have set off a chain off events sure to end with the termination of his tenure as head of the agency. A serious criminal complaint has already been levied against him by the Democratic Coalition Against Trump for engaging in partisan activity. Related Items:'"}, "time": 1742563760.3285682}