{"duration": 0.037795066833496094, "input_args": {"text": "'By wmw_admin on November 4, 2016 Zoie O’Brien — express.co.uk Nov 4, 2016 \\nThe democratic presidential candidate who will go toe-to-toe with billionaire Donald Trump for the White House next week has been at the centre of email controversy for many months. \\nJust weeks ahead of the US elections on November 9, the FBI revealed it would re-investigate the content of the correspondence. \\nNow Mr Assange, who is holed up in the Ecuadorian Embassy in London to avoid extradition to the US, said the most damning email yet is about to come out. \\nIn an interview with veteran journalist John Pilger, for Russia Today, Assange said the Saudi Government funds both ISIS and Clinton’s foundation. \\nHe said: “There’s an early 2014 email, from very early on, so not so long after she left secretary of state to her campaign manager John Podesta. \\n“It states that ISIS is funded by Saudi Arabia and Qatar – the governments of Saudi Arabia and Qatar. \\n“I think this is the most significant email in the whole collection.” \\nMr Pilger, author of Distant Voices and Tell Me No Lies and owner of Dartmouth Films, asked whether this meant the same people who funded ISIS were funding Hillary Clinton. \\nAssange simply replied “yes”. \\nHe told Dartmouth Films: “All serious analysts know, and even the US government has agreed, that some Saudi figures have been supporting ISIS and funding ISIS, but the dodge has always been that it is some ‘rogue’ princes using their oil money to do whatever they like, but actually the government disapproves. \\n“But that email says that it is the government of Saudi Arabia, and the government of Qatar that have been funding ISIS.” \\nJulian Assange accuses Hillary Clinton of misleading Americans about the true scope of Islamic State’s support from Washington’s Middle East allies \\nIn one year WikiLeaks has released three sets of emails from the Clinton camp – drawing criticism of Assange. \\nWhen asks by Mr Pilger if he was “trying to get Trump in the White House” Assange denied it. \\nHowever, he said Clinton would win the vote. \\nHe said: “Trump would not be permitted to win. Because he has had every establishment off his side. Trump does not have one establishment \\n“Banks, intelligence, arms companies.. foreign money etc.. is all united behind Hillary Clinton, and the media as well. \\n“Media owners and even journalists themselves.” \\nRussia Today released a teaser from the interview which sees Mr Pilger asking if while Mrs Clinton was secretary of state, the State Department was approving massive arms sales, while the Clinton Foundation was also receiving money from them \\nAssange replied: “Under Hillary Clinton – and the Clinton emails reveal a significant discussion of it – the biggest-ever arms deal in the world was made with Saudi Arabia: more than $80 billion. \\n“During her tenure, the total arms exports from the US doubled in dollar value.”'"}, "time": 1742628429.026304}