{"duration": 0.1316075325012207, "input_args": {"text": "'Trump Reopening 9/11, Reversing Rome, in Bid to Be Greatest American Steward? By Daily Bell Staff - November 11, 2016 \\nTrump: I’m Reopening 9/11 Investigation … “First of all, the original 9/11 investigation is a total mess and has to be reopened,” Trump said … Donald Trump believes that 9/11 has not been properly investigated and has promised to find out what really happened when he takes office in January. Donald Trump’s plans for his first 100 days in office are raising eyebrows around the world, but of all the items on his agenda it is the reopening of the 9/11 investigation that will provide the greatest earthquake for the establishment. -YourNewsWire \\nIs new president-to-be Donald Trump really going to make major moves to roll back globalism? \\nWe’ve indicated that one way or another the “establishment” wished for Donald Trump to be elected. In our view, they certainly have the power – and we think Brexit offers a similar story. \\nThe idea is that the various military and economic disasters pent-up around the world will be released and blamed on people’s impulse to flee global technocracy. \\nIn this way the elite takeover of the world continues under the cover of politics. \\nThis process of inflicting disaster has already begun with the so-called riots taking place in the US. There are certainly reports these “riots” and general civil unrest are not in all cases genuine. \\nOne can spot, perhaps, Soros funding and even “crisis actors.” But the idea is to make it clear that “populists” are bitterly resented by many if not most Americans. \\nOf course, Trump has little to do with populism. There is a specific globalist agenda that has been implemented around the world and certainly in America. \\nThis agenda involves trade deals that drain away American prosperity; too-low interest rates that create inflation, stock markets crashes and ongoing depression; and a variety of rules, regulations and cover ups designed to concentrate power into fewer and fewer hands. \\nThis agenda is what Trump is apparently taking aim at. If he follows through on some of his recent statements and positions we can’t imagine the secret rulers of America and the West will be too happy with his ascension. \\n9/11 is at the bottom of much of modern globalist cover-up. It Trump reveals the truth about 9/11, the globalist movement based on in London with tentacles throughout the West will likely collapse or at least become far less powerful. \\nMore: \\nTrump believes that 9/11 has not been properly investigated and he plans to get to the bottom of it. “First of all, the original 9/11 investigation is a total mess and has to be reopened,” Trump said. … \\nThe election of Donald Trump has rocked the establishment and things are only going to get rockier for them during his first term. There is a reason George W. Bush didn’t vote for Trump in the election, leaving the presidential line blank and voting Republican down-ballot. \\nTrump has pledged to investigate 9/11 in a way it has not been investigated before. For the first time 9/11 will be investigated by someone who isn’t part of the establishment, with skin in the game and plenty to lose. \\nOf course, despite such reports, there remains considerable skepticism on the ‘Net that Trump will follow through on a re-investigation of 9/11. For one thing, his campaign is close to Rudy Giuliani who helped apparently orchestrate the original cover-up. \\nIn researching Trump’s most recent comments on 9/11, we also find ‘Net claims that Trump’s intentions regarding 9/11 have been revealed on “satire” sites and and have not been reported “in the mainstream.” But in fact there is a growing list of reports affirming his intentions regarding 9/11, including an article posted at dailystar.co.uk. \\nTake Trump at his word and the 9/11 re-investigation is only one of numerous ant-globalist moves that Trump intends to make. It is emerging he has a long list of globalist rollbacks in mind. \\nOn his transition website GreatAgain.gov, Trump presents some of them. He wants to significantly cut taxes, cut regulation, push back against the fake climate change movement, get rid of Obamacare, build “the Wall,” between the US and Mexico and reduce or remove unconstitutional executive orders. \\nGenerally he claims to want to make government less intrusive and destructive. This is certainly not the direction the US government has been traveling for decades and even centuries. \\nTrump also wants to build up the America military – last seen mislaying $8 trillion. But while he wants to give the US military more funding (which it doesn’t need) he also wants to reduce or eliminate the endless serial wars that the Pentagon has been engaging in for the past half-century. \\nAs a libertarian publication, we can think of a lot more that Trump could try to do. He could try to get rid of the Federal Reserve entirely, close up America’s military bases around the world, reduce or remove the federal “justice system” and its prison system that incarcerates 25 percent of the world’s prison population at any one time. \\nWhile he’s at it, he could get rid of laws making drugs illegal and other laws regulating behaviors that benefit no one but America’s burgeoning, authoritarian police strucure. \\nBasically, the closer that Trump can bring the country back to its original Constitution, the better. Freedom produces prosperity and the Constitution (which wasn’t actually needed either) at least codified limits on the federal government. \\nWe’ve argued regularly for years that individual freedom cannot be gained or regained via the political process. Politics inevitably reduce freedom, no matter the intentions of politicians. \\nAdditionally, empires like America are probably impossible to roll back and this has likely never happened in the history of humankind. If Trump really means to do what he says he will, and sticks to his word, he will be that rarest of all creatures: a politician who keeps his word. \\nHe will also reintroduce real freedom into America and begin the significant crushing of the globalist conspiracy. Again we find all this hard to believe given that globalist control (from what we can tell) of much of Western society and trillions of dollars via the central bank system. Intelligence agencies and secret societies also seem to be under globalist control. \\nConclusion: Given the enemies he faces and the challenges he needs to surmount, Trump will need to have more courage and determination than we can begin to contemplate. But if he really intends to follow through and manages to make significant difference, he will go down as America’s greatest president.'"}, "time": 1742563839.7667937}