{"duration": 0.13180875778198242, "input_args": {"text": "'By Jonas E. Alexis on November 3, 2016 Putin: “Is this the result of erosion of the traditional national values? I don’t even know how to explain it. Maybe they have a guilty conscience because of the refugee crises. \" “Why can’t those people get a simple concept through their heads?” …by Jonas E. Alexis \\n\\nNo, the Khazarian Mafia and their lackeys will never report that Vladimir Putin, the man who has been called all sorts of disgusting names, is actually fighting in order to save the moral fabric of Europe. In 2014, he argued that “ a faith in God and a belief in Satan ” are incompatible. \\nPutin moved on to argue that any policy that puts “multi-child family and a same-sex partnership” on the same level is on “the path to degradation.” \\nMore recently, there have been numerous rape allegations in Europe. In fact, many so-called refugees have been literally caught with their pants down. The British newspaper the Independent has recently reported: \\n“ A man who raped a 10-year-old boy at a swimming pool in Austria has had his conviction overturned after judges found he may have believed the child consented. \\n“Police said the 20-year-old Iraqi refugee, who has not been named, assaulted his victim in a toilet cubicle at the Theresienbad swimming pool in Vienna on 2 December last year. \\n“The child reported the rape to a lifeguard and his attacker was arrested at the scene, reportedly telling officers in initial interviews that he was experiencing a ‘sexual emergency’ after not having sex in four months.” \\nObviously there is a problem here. Putin responded by saying: “ So, what’ going on now? A refugee raped a child in one of the European countries. The court let him free on two grounds: he doesn’t speak the language of the residence country, and he didn’t understand that [the] boy was against the rape. It’s just hard to imagine what Europeans are going… “Is this the result of erosion of the traditional national values? I don’t even know how to explain it. Maybe they have a guilty conscience because of the refugee crises. A society that cannot defend its children today, has no tomorrow. It has no future.” \\nIndeed. We should add that the Neoconservative Mafia and their marionettes are largely responsible for the rape crisis in Europe. Never forget what flaming Neocon Daniel Pipes said. \\nAfter postulating that “Western governments should respond by helping the rebels to prevent Assad from crushing them,” Pipes added back in 2013: “the West should prevent either side in the civil war from emerging victorious by helping whichever side is losing, so as to prolong their conflict.’” [1] \\nDid you catch the diabolical proposition here? Pipes himself admitted that this ideology is really weird: “This policy recommendation of ‘helping whichever side is losing’ sounds odd, I admit, but it is strategic.” [2] \\nWell, it is only “strategic” for Pipes and his minions, who have been waging a frontal war against the moral and political order from time immemorial. Their subversive movements across Europe have been responsible for Bolshevik Revolution, for Abu Ghraib, and indeed for the debacle in Syria. So, whenever people like Pipes beat the perpetual war drum, rest assured that rape will largely be the end result. \\nFurthermore, if the so-called refugees are raping boys by the numbers, then European officials should fire a moral and political shot at people like Daniel Pipes and other people who don’t give a flip about saving both the Middle East and indeed Europe from slow destruction. If the late rabbi Ovadia Yosef was right, that Goyim are donkeys and that they “were born to serve” Jews, [3] then it doesn’t really matter who gets raped in the process at all. \\nYosef himself said that the Goyim “need to die, but [God] will give them longevity. Why? Imagine that one’s donkey would die, they’d lose their money. This is his servant… That’s why he gets a long life, to work well for this Jew.” [4] \\nWell, the young Goyim are dying in Europe, and no serious politician gives a flip about them because those politicians, as we shall see in the next installment, are in cahoots with the Khazarian Mafia in Israel and other places. Putin again is trying to help Europe by indirectly appealing to an implicit moral law, which he says is imbedded in traditional values. \\n[1] Daniel Pipes, “Support the Syrian Rebels?,” National Review , May 12, 2013. \\n[2] Ibid. \\n[3] “Tradition Today: Jews and gentiles,” Jerusalem Post , November 12, 2010. \\n[4] Lazar Berman, “5 of Ovadia Yosef’s most controversial quotations,” Times of Israel , October 9, 2013. Related Posts:'"}, "time": 1742561905.250201}