{"duration": 0.0314478874206543, "input_args": {"text": "'Jay Sekulow, one of the attorneys representing President Donald Trump, told several Sunday morning news shows that Trump “is not under investigation. ”[Sekulow, who is also Chief Counsel of the American Center for Law  Justice (ACLJ) appeared on both NBC News’ Meet the Press and CNN’s State of the Union to counter mainstream media reports that the president is officially under investigation by Special Counsel Robert Mueller for obstruction of justice.  Former FBI director James Comey told the president three times that he was not under investigation for collusion with Russia, but would not reveal that information to the public. That fact that only emerged publicly once the president fired him and suggested publicly that he might have “tapes” of their conversations. On Friday, the president tweeted: “I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt. ” I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt,  —   Donald J. Trump (@realDonaldTrump) June 16, 2017, The media widely interpreted that statement as an admission that Trump was under investigation for obstruction of justice for firing Comey. But Sekulow told the Sunday shows that Trump was referring only to claims made by the Washington Post that he was under investigation, and that he had no reason to believe he was actually being investigated. “As James Comey said in his testimony, and as we know as of today  —   the president has not been, and is not, under investigation [for obstruction],” Comey told NBC’s Chuck Todd. “you’re reading more to the tweet than what’s there,” Sekulow said, noting that the Post had relied on “five anonymous, unnamed sources from unnamed agencies. ” Sekulow repeated that message on CNN, telling host Jake Tapper: “Let me be clear: The president is not under investigation   …     The president is not the subject or target of an investigation. ” He also called the Post story a “fake report. ” Update: On Fox News Sunday, host Chris Wallace asked Sekulow whether Trump had been “notified” by Mueller that he was under investigation. Sekulow said that he had not. However, confusion erupted when Sekulow suggested that Trump’s tweet referred to the Department of Justice, adding, “He’s being investigated. ” Wallace chalenged Sekulow on that point, whereupon Sekulow clarified again: “We have not received nor are we aware of any investigation of the President of the United States. ” “Sir, you just said two times that he’s being investigated,” Wallace replied. Sekulow answered that he had simply been describing the “legal theory” under which the president would be investigated, if he were, which Sekulow denied he was. He added that he could not read Mueller’s mind. Wallace then suggested that Sekulow did not actually know if Trump was being investigated. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628517.932}