{"duration": 0.09681844711303711, "input_args": {"text": "'LOS ANGELES  —   One of Marvel Entertainment’s most sprawling superhero mythologies, the Inhumans, is headed to the small screen in a major way. But the Inhuman likes of Black Bolt, Crystal and Lockjaw, the teleporting dog, will first appear on big screens. As in the biggest. Imax Corporation, Marvel and the ABC broadcast network announced a partnership on Monday to introduce  —   and finance  —   a lavish new television series that will focus on the Inhuman royal family. Under the agreement, a version that combines the initial two episodes of “Marvel’s The Inhumans,” shot entirely with Imax cameras, will play exclusively for two weeks next September on Imax screens worldwide. Shortly thereafter, the episodes  —   edited to include additional scenes  —   will run on ABC, with new installments unspooling in typical   fashion. (The look of the series on TV will be enhanced due to Imax technology.) The series, billed as a family   with signature Marvel humor, will be set in the present day, with some action seeming to take place on the moon. The deal is significant for several reasons. As their live audiences have dwindled and competition has increased, broadcast networks have struggled to create sizzle around new shows. ABC, which urgently needs new hits, is betting that Imax, with its strength among younger consumers known as fanboys, will help make “The Inhumans” a   event. “In the incredibly crowded marketplace of television, we are very excited about this because it’s a unique and innovative and bold way to debut our best new content,” Ben Sherwood, president of   Television Group, said by phone. The deal also indicates that Disney remains focused on telling Marvel stories on ABC after an unexceptional start to that effort. “Marvel’’s Agents of S. H. I. E. L. D. ” has brought more male viewers to ABC, but it has been only a modest ratings performer. Another effort, “Agent Carter,” was a misfire. ABC wants what Marvel Television and ABC Studios have supplied to Netflix  —     widely watched series like “Luke Cage” and “Daredevil. ” A   arrangement with Imax will allow ABC and Marvel to spend more to make “The Inhumans,” which will include   visual effects. (One criticism of “Agents of S. H. I. E. L. D. ” has been that certain action sequences are less than dazzling.) Imax has never before served as a financing participant in a TV series, according to Richard L. Gelfond, the company’s chief executive. “We think this is a business for us,” Mr. Gelfond said of the financing arrangement. “Because Imax has an equity participation both in the pilot and in the series, this deal will be financially advantageous to Imax on an ongoing basis. ” Imax has dabbled in the past at showing TV content on its supersize screens. Last year, for instance, it played a couple of Season 4 episodes of “Game of Thrones. ” But a series has never before made its debut through Imax, which has more than 1, 000 locations worldwide. “We see it as a way to extend the Imax brand and diversify our revenue,” Mr. Gelfond said. In particular, he hopes television content could help draw crowds to Imax locations at times of the year  —   like fall  —   when there is a dearth of   movies. Imax worked for years to find a winning strategy for quieter times at the box office most recently it tried showing films aimed at older audiences, which delivered weak results. “We’re confident our exhibition partners will be excited about this,” Mr. Gelfond said. “The response from conceptual conversations has been extremely positive. ” Marvel, which has been on a   tear, initially expected to turn the Inhumans into a string of movies, even announcing its plans publicly in 2014. But the studio ultimately decided the property would be a better fit for TV, in part because there were already a lot of different Marvel movie franchises continuing. Mr. Sherwood, noting pains have been taken to make sure ABC affiliates are on board with the Imax debut, said the “sneak peek” of “The Inhumans” would include “big, theatrical moments specially conceived for the Imax screen. ” The series debut will also come at a time when no Marvel movies are playing in theaters. “We’ve worked very carefully with our friends at Marvel Studios  —   and this is a critical point  —   to make sure that   and   we are only enhancing the Marvel universe,” he said.'"}, "time": 1742564481.19119}