{"duration": 0.03905081748962402, "input_args": {"text": "'CRTV and radio host Mark Levin said Wednesday that when those on the left “dumb down or mainstream violence,” some who are “on the edge  …    become violent and they act out. ”  NOT FUNNY:  Kathy Griffin ’Beheads’ Trump  …     https:  .   —   DRUDGE REPORT (@DRUDGE_REPORT) May 30, 2017,  In an episode of LevinTV, the conservative author addressed the shooting in Alexandria Wednesday by a radical leftist who targeted Republican members of Congress and which left Rep. Steve Scalise ( ) in critical condition. Levin said about the rise in violence on the left: The language is violent, the conduct is violent, and that it is getting increasingly more dangerous. Now, of course, the point is that you have kooks out there. You have people who are on the edge. When you dumb down or mainstream violence, these people become violent and they act out. Breitbart News compiled a list of 15 episodes of leftwing celebrities envisioning violence against President Donald Trump, including comedian Kathy Griffin’s shock “beheading” photo of the president, Madonna’s statement that she has “thought a lot about blowing up the White House,” Joss Whedon’s tweet that he wants a “Rhino to F*ck Paul Ryan to Death,” and Shakespeare in the Park’s stabbing “Trump” to death during a performance of Julius Caesar. Violence solves nothing. I want a rhino to fuck @SpeakerRyan to death with its horn because it’s FUNNY, not because he’s a #GOPmurderbro,  —   Joss Whedon (@joss) January 14, 2017,  “I make no excuses for a murderer or a   murderer like this guy [James] Hodgkinson, but on the other hand I make no excuse either for the rhetoric of the Left, for the media coverage on the Left, for the nature in which our president has been attacked  —   where assassination becomes mainstream,” Levin said. The host showed video of violent leftwing protests, including one in November in which Los Angeles protesters burned Trump in effigy as they shouted, “Not my president. ” “I don’t remember any of that happening with Obama, or Bill Clinton,” he added, asserting the left’s use of violent rhetoric and its insinuations and threats of violence are “beyond the pale. ” Levin likened the kind of violence coming from the left now to that during the 1960s, and referred to it as “ . ” “When Barack Obama’s buddies Bill Ayers and Bernadine Dohrn  —   people like that  —   these underground movements that poisoned our universities and so forth took place,” he said. “And you’ll notice they’re violent, they’re   they’re  . They’re  . ”'"}, "time": 1742563094.8673062}