{"duration": 0.4539370536804199, "input_args": {"text": "'My Epiphany at Edgar Cayce’s Association for Research and Enlightenment By William Henry\\nGod, S/He moves in mysterious ways.\\nOn October 7-9, 2016, I had the pleasure of speaking — and having my mind blown (!)– at the “Ancient Mysteries” conference at Edgar Cayce’s Association for Research and Enlightenment in Virginia Beach, VA.\\nMy presentation, “The Essenes and Ascension”, featured my last several years research on these (mostly) Jewish mystics who, extraordinarily, claimed to be living with angels (celestial beings/’extraterrestrials’) who taught them how to transform their human flesh — in a FLASH!!! — into the celestial flesh of the angels. Radiant, luminous, shining, this ‘flashy flesh’ of the angels is composed of a rarefied ‘perfect’ spiritual substance that is as ‘real’ or ‘solid’ in the higher realms as our physical body is on the earth. Attainment of this ‘light body’ is the next step in human spiritual evolution.\\nAccording to the Dead Sea Scrolls, the Essenes alienated themselves from the rest of society to ‘perfect’ themselves in order to prepare and make way for the visitation of a high celestial being and to lead a revolution in human evolution by transforming themselves into angels and the earth into a planet of righteousness.\\nThe scrolls reveal the Essenes were also obsessed with transforming themselves to be like their visiting angels and their state of being (in light bodies) in order to ascend to and enter a celestial city called Sion or the New Jerusalem . In Hebrews (12:22), we learn this place is inhabited by “ angels gathered in joyful assembly and just humans made perfect .\\nThe Essenes sought to take their place at this family gathering of angels and perfect ones.\\nTHE ESSENES AND THE RAINBOW BODY It so happens that Hurricane Matthew was spinning toward Virginia Beach while I was there. I had no idea that coming on those clouds was a lightning strike of revelation and it was headed my way!\\nI was excited to hear Cayce expert, John Van Auken’s, talk about Edgar Cayce and the Essenes. Incredibly, the great seer had provided numerous readings about the Essene teachings at least fifteen years before the Dead Sea Scrolls were discovered in 1947. In startling ways, Cayce’s dream-state readings about the Essenes matched what the scrolls said in detail after detail. In particular, I was intrigued by Cayce’s references to the Essenes and perfection which appeared on several of Van Auken’s slides.\\nWhile at the A.R.E. I was given a tour of the vault containing Edgar Cayce’s original readings and other artifacts, including the gorgeous painting “Flight Into Egypt” (featured above). I even got to sit at his desk!\\nA great souvenir from the A.R.E.!\\nDuring my talk, I presented the research that led to my unique hypothesis that the Essenes living in Jerusalem and Alexandria Egypt c. 150 B.C. to 66 AD were practicing Buddhist Rainbow Light Body techniques referred to as the Great Perfection . The Tibetans teach that the Great Perfection was originally of extraterrestrial / cosmic origins and represents the highest form of enlightenment or spiritual realization on earth.\\nThe ultimate goal of the Rainbow Body practitioner is to accelerate the frequency of the body until it dissolves into five colored rainbow light, leaving behind only hair, toe and fingernails that have no nerves to be transmuted. The result is a new birth or rebirth into a luminous, humanoid body shot with gold and which emits rainbow colors.\\nIn a process that is as natural as a caterpillar morphing into a butterfly, practitioners ‘ascend’ in new perfect bodies of light matching those of the celestial beings. This ‘light body’ is known in virtually every spiritual tradition. It goes by many names, of which the Garment of Light, Robe of Glory, Beaming Garment, Star Body, Diamond Body, Body of Bliss, are just a few.\\nWhat ‘called’ me to the Essenes was my discovery that they called their ‘research group’ the House of Perfection and referred to themselves as those who walk in the Perfect Way .\\nResearchers have observed the link between Jesus’s ‘perfect’ rainbow Resurrection body and the Rainbow Light Body of the Great Perfection. Side by side mages of the rainbow clad resurrected Christ with the Tibetan images of the Rainbow Body (as below) have been a staple of my books, presentations and TV shows since 2006. My three latest books have explored the sayings of Jesus that correspond to this body.\\n\\nAs I listened to Van Auken’s talk, I had no idea that a (major!) new piece to the correspondence between these images and the Tibetan and Christian teachings was about to slip into place.\\nFor years, I additionally have been linking the images of the Rainbow Light Body with those of the Seraphim angels. The highest order of angels, the Seraphim dwell at God’s Throne (in the celestial city, Sion), but routinely interact with humanity, including the Essenes, as discussed in the Dead Sea Scrolls and other documents.\\nThe Seraphim are the angels the Essenes sought to become. The ‘new bodies’ they sought are the same as the bodies of these beings. \\nIn Jewish mysticism, the complete physical characteristics of the Seraphim (also known as the Watchers or Angels of the Lord) includes:\\na humanoid body, a ‘serpentine face’, a many colored garment, rising up into the air like whirlwinds, luminous or radiant bodies, feathered cloaks, many eyes, and the ability to fluidly morph or change form and to shape-shift.\\nThis is why, in Christian art, the Seraphim are portrayed as humanoid beings with swirling, vortex shaped bodies covered with feathers. Are the feathers meant to symbolize flight, but also an energy field or waves of light emitted from these beings? I believe so. To me, the visual similarity between the Rainbow Light Body and the energetic bodies of the Seraphim is not a coincidence.\\nI have proposed the Rainbow Body state and the Seraphim are same class of enlightened celestial beings. The Tibetans haven’t claimed this. Nor has the Judeo-Christian tradition. As far as I know, this is unique to me. I point this out not out of ego, but rather to alert the reader to the source of this link and in hopes that those ‘in the know’ will contact me with any additional references to support my hypothesis.\\n\\nAs they were developed in corresponding Christian theology, Seraphim are beings of pure light and pure love and have direct communication with God. As noted, they dwell at the Throne of God. However, they don’t stay there. They can manifest in our world.\\nIn fact, the resurrected Jesus appeared to St. Francis of Assisi as a Seraph, demonstrating that the state of being of the Seraph is the same as the resurrected state of being. In the art of resurrection, which is derived from eye-witness accounts (John the Revelator, for example) Jesus is either seen with a rainbow around his body or with the body of a Seraphim. In my view, these bodies are the interchangeable or energetic phases of the same light body. One, the Rainbow Body version, is a sped up version of the other (the Seraphim). This because these heavenly beings ‘slow down’ their frequency in order to be perceived by our earthly senses.\\nJesus manifests as a Seraph to St. Francis of Assisi. For more on this remarkable contact please see my article Gentle Heart.\\nAs I discussed in my book, The Secret of Sion , Thomas Aquinas said the Seraphim have the quality of clarity, or brightness; which signifies that these angels have in themselves an inextinguishable light, and that they also perfectly enlighten others…” With the revival of neo-Platonism in the academy formed around Lorenzo de’ Medici in Renaissance Florence, the Seraphim took on a mystic role in Pico della Mirandola’s Oration on the Dignity of Man (1487), the epitome of Renaissance thinking.\\nPico took the fiery Seraphim—”they burn with the fire of charity”—as the highest models of human aspiration: “impatient of any second place, let us emulate dignity and glory. And, if we will it, we shall be inferior to them in nothing,” the young Pico announced.\\n“In the light of intelligence, meditating upon the Creator in His work, and the work in its Creator, we shall be resplendent with the light of the Cherubim. If we burn with love for the Creator only, his consuming fire will quickly transform us into the flaming likeness of the Seraphim. “Models of human aspiration: “impatient of any second place, let us emulate dignity and glory. And, if we will it, we shall be inferior to them in nothing”, the young Pico announced.\\nAccording to Renaissance thought, the Seraphim are a different type of human being, a fully transfigured one. Their ‘perfected’ bodies are immortal bodies of light and are therefore able to hold the highest frequencies of love and light. We can become Seraphim by meditating exclusively on the love of the Creator, say Renaissance thinkers. In other words, if we perfect ourselves.\\nThe Essenes believed exactly the same thing. I have proposed the angels the Essenes were living with were Seraphim and the celestial body they were teaching them about was the (or their) Rainbow Light Body.\\nNo other Essene or Tibetan scholars have made this amazing connection. This is because the scholars who have discussed the scrolls are usually specialists and have not gone out of the box to link the Essene’s concept of Perfection with that of the Tibetans, as I have done. Likewise, the Tibtan Great Perfection scholars I have read to not stray into Essene light body practices either. However, once the two spheres are entwined, as I have don, they become one.\\nThis premise is out of the box, but it did not come to me out of the blue. It arose out of the historical fact that Buddhist missionaries brought their teachings to the Essenes in Alexandria in c. 150 B.C, when the Essenes, as we know them in the Dead Sea Scrolls, were formed. The historical background will be featured in my forthcoming book about the Essenes, the light body and ascension.\\nMy reading of Dead Sea Scrolls shows that they contain the proof of this interaction and the Essene practice of human transformation or transmutation into perfect light bodies. Their goal of attaining perfection is the core power pack and red hot coal of the Seraphim found in the scrolls.\\nTaking this one bold step further, in my presentation, I showed how the Essenes were practicing this “Rainbow Body Resurrection”. This revolutionizes our understanding of the Dead Sea Scroll and the Essenes. I will have copies of this presentation available on the latest edition of my flash drive .\\nONLY THE BORN AGAIN CAN ENTER THE KINGDOM OF GOD The thing is, I never really thought about the connection between the Essene light body or perfection teachings, which are both explicit and veiled in Christianity, and the defining Christian concept of being ‘born again’\\nThe reason is because I am neither a Protestant or an Evangelical Christian, the two Christian movements who have done more than the other several hundred Christian sects to illuminate the mysteries of being “Born Again”. In Christian understanding, one is “born again” after one, proclaiming belief in only One God, two, being baptized in the Name Jesus Christ and then, three, following Jesus into the Kingdom of God.\\nThunder rolled for me during Van Auken’s presentation on Cayce and the Essenes when he mentioned Jesus’s teaching on the necessity of being “born again” to enter the Kingdom of God.\\nThen, lightning struck.\\nIt happened when I put the images I had shown of the resurrected Christ in the rainbow (body) together in my mind with the belief that he is the first “born again” Essene and Christian.\\nI suddenly realized the Kingdom of God and the celestial city are the same state (of being).\\nWhen the smoke cleared, I realized that to be “born again” means to attain the perfect light body or the Rainbow Resurrection Body.\\nIn my talk, I said that, according to the Essenes, the only way to enter the celestial city is to be dressed appropriately. That is, we must attain /wear the flashy perfect body of the angels and “just humans made perfect” who dwell there.\\nThis means attaining the perfect body has the same meaning as being “born again” into a body of spirit (light, love).\\nI was blown away by the winds that followed this revelation and the simplicity and elegance of this match.\\nRemember this Memorex ad from the 1970s? That was me putting the Rainbow Resurrection Body together with the Born Again body!\\nHere is the section from the Book of John (3) containing Jesus’s teaching:\\n3 Now there was a Pharisee, a man named Nicodemus who was a member of the Jewish ruling council. 2 He came to Jesus at night and said, “Rabbi, we know that you are a teacher who has come from God. For no one could perform the signs you are doing if God were not with him.”\\n3 Jesus replied, “ Very truly I tell you, no one can see the kingdom of God unless they are born again .”\\n4 “How can someone be born when they are old?” Nicodemus asked. “Surely they cannot enter a second time into their mother’s womb to be born!”\\n5 Jesus answered, “Very truly I tell you, no one can enter the kingdom of God unless they are born of water and the Spirit. 6 Flesh gives birth to flesh, but the Spirit[ gives birth to spirit . 7 You should not be surprised at my saying, ‘You must be born again.’ 8 The wind blows wherever it pleases. You hear its sound, but you cannot tell where it comes from or where it is going. So it is with everyone born of the Spirit.”\\n9 “ How can this be ?” Nicodemus asked.\\n10 “ You are Israel’s teacher ,” said Jesus, “ and do you not understand these things ?11 Very truly I tell you, we speak of what we know, and we testify to what we have seen, but still you people do not accept our testimony. 12 I have spoken to you of earthly things and you do not believe; how then will you believe if I speak of heavenly things?\\nJesus taught the uninitiated Nicodemus, “Ye must be born again” (John 3:7) and made it clear that only by being born again can you see the Kingdom of God, let alone enter it.\\nIf the new Born Again body is the same as the body of the angels, it means Jesus taught that, in order to enter the Kingdom of God (the celestial Sion), we must be “born again”… into our Rainbow Resurrection Body. We receive this body by following him.\\nTHE PERFECT BODY AND THE EYE OF THE NEEDLE TO THE KINGDOM OF HEAVEN As I take a look around Christendom, I don’t see too many Christians following, teaching, or demonstrating Jesus’s light body or perfection teachings.\\nYou can’t blame or judge them for that. Just google the words “star body” or “perfect body” and see what comes up in our contemporary imagination!\\n\\nAs Jesus lamented, even Nicodemus, a religious leader of his day, had no concept of what it meant to be born again or to attain the perfect body!\\nWe find that the very same thing is true today. Many men and women who fill positions of spiritual leadership in our world have no real understanding of the light body or born again experience.\\nConsequently, the term “born again” is one of the most (mis) used phrases among present-day Christians.\\nLike the new age conception of “ascension”, if asked what the term born again means, most Christians likely could not give a clear explanation.\\nWe can see what Jesus was up against when, in his rebirth / resurrection, Jesus enacted or demonstrated the Essene perfection teaching of the transmutation of the earthly body into a heavenly body composed of celestial flesh. Christians would call this the plan of salvation and argue that Jesus authored this plan during his crucifixion, entombment/resurrection and ascension. The problem is the “how to” build the light body from this plan has been veiled in Christianity. Fortunately, the Essene teachings in the Dead Sea Scrolls unveil these teachings for us.\\nJesus spoke of perfection numerous times. In particular, in a conversation with a rich man about eternal life.\\nThe man had asked Jesus, “What is required for eternal life?”\\nJesus replied, “keep the commandments.”\\nWhich are: “Love the Lord your God with all your heart, and with all your soul, and with all your mind. This is the first and greatest commandment. And the second is like unto it: ‘Love your neighbor as yourself.’ All the law and the prophets hang on these two commandments.” (Matthew 22:35-40)\\nThe rich man told Jesus that he had always kept the commandments and wanted to know what else was required (like how much $?).\\nJesus says, “… I tell you the truth, it is hard for a rich man to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of heaven .”\\nThe camel is a symbol of the human body and the material cargo the soul accumulates during is sojourn on earth. Jesus is telling the rich man that his earthly, material being and all that it collects on earth will have to be left behind or transmuted into a celestial substance. In other words, the flesh and blood body will not make it through the portal to the otherworldly realms spoken of by Jesus, but a soul clad in a light body or Garment of Glory can and will. Jesus is simply saying that our ‘stuff’ is not going with us when we enter the eye of the needle to the Kingdom of God.\\nJesus then told him, and here is the Essene Rainbow Light Body teaching, and the ‘punch line’ of this blog, “ If thou wilt be perfect (holy, whole, complete), go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me” (Mat. 19:21).\\nIn other words, Jesus is telling the rich man that if attains the perfect light body, and is “born again”, he has found earth’s greatest treasure. He then can follow him through the eye of the needle (or stargate) into the Kingdom of God where perfected humans dwell in bodies of light.\\nJesus in the ‘eye of needle’, a gateway filled with stars. He wears the bright white garment of light that symbolizes the Perfect Body.\\nJESUS LIFTS THE SERPENT AND TELLS US HOW TO ATTAIN THE GARMENT OF LIGHT\\nJesus told us how we will transform and attain eternal life in his further remarks in John 3:\\n13 No one has ever gone into heaven except the one who came from heaven—the Son of Man. 14 Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up,15 that everyone who believes may have eternal life in him .”\\n\\nJesus is referring to an episode in the Book of Numbers (21:8) in which the Israelites “Make thee a fiery serpent (literally, a seraph), and set it upon a pole: and it shall come to pass, that every one that is bitten, when he looketh upon it, shall live”.\\nMoses and the Nehushtan, Salisbury Cathedral.\\nThe serpent lifted on a pole is called the Nehushtan , meaning the Brazen Serpent or Fiery Serpent. This last definition is mind blowing, as the Jewish Encyclopedia states Seraph means “fiery flying serpent”. The Nehushtan is the device (‘sign’, ‘symbol’, ‘seal’, ‘tool’, ‘appliance’), symbol or logo of the Seraphim! Jesus is referring us directly to it as the means to attain eternal life! A moment before he told us that LOVE was the key to eternal life. Oh wait. I get it! The serpent on the pole symbolizes the cosmic love within us that arises when we follow the commandments to “love with all our heart and love our neighbor as our self”!\\nTHE HOLY FORCE For me, this is a ‘proof’ or confirmation that Jesus was demonstrating the light body secrets of the angels, specifically the Seraphim. Again, transformation into a Seraph / Rainbow Light Body is the same as being Born Again.\\nIn some Christian movements (especially Fundamentalism and Evangelicalism), to be born again is to undergo a “spiritual rebirth”, or a regeneration of the human spirit from the Holy Spirit. As Jesus tells us John 3:3, no one can enter the Kingdom of Heaven unless they are in their born again body.\\nThe earthly body is born of flesh. The Born Again Resurrection Rainbow Body is born of a spirit, a higher vibration. That holy spirit is love. True love.\\nInterestingly, the Greek for again also means from above, suggesting that the power or spirit of regeneration comes from above…in in the stars, in the higher worlds. This means our Rainbow Body comes from and exists in a higher realm or in the stars, as the Tibetans teach.\\nIn Christian terms, being born again is the result of a secret act of regeneration (love) by God. A mysterious power or force, the Holy Spirit, transforms our flesh and blood existence in to spirit-filled body and state of being.\\nThe serpent on a pole is a symbol for the regeneration into a spirit body of the Seraphim. Again, they are considered the beings of highest love.\\nThe power of regeneration is found in the prophecy of Ezekiel:\\nA new heart I will give you, and a new spirit I will put within you ; and I will take out of your flesh the heart of stone and give you a heart of flesh. And I will put my spirit within you, and cause you to walk in my statutes and be careful to observe my ordinances . (Ezek. 36:26–27)\\nEzekiel is telling us that regeneration affects us as whole persons. EVERY part of our being — body, mind and spirit — is affected: “If any one is in Christ, he is a new creation; the old has passed away, behold, the new has come ” (2 Cor. 5:17).\\nThe new Rainbow Body of Light, that is.\\nBeing “born again” is nothing less than receiving the actual body of Christ after his Resurrection and Ascension — the body of a Seraph or a Rainbow Light Body. In order to ‘attain’ it, Christianity teaches that his Holy Spirit actually enters us and brings our spirit (and its light body) to life. Our spirit is joined with Him” ( 1 Corinthians 6:17 ). We then become one with the perfect One. “It is no longer I who live, but Christ lives in me”(Galations 2:20).\\nThe mystery of being born again into the Light Body is now revealed, “that is, the mystery which has been hidden from the past ages and generations which is Christ in you, the hope of glory” ( Colossians 1:26,27 ).\\nThe Holy Spirit that transforms us and “makes us new” is ever-present, but invisible in the life and teaching of Jesus. I hope this blog has shown that the “born again” body this spirit produces is the same as the Rainbow Body of Light and the body of the Seraphim. Jesus’s teaching about his light body is also ever present, and with this understanding, hopeful more visible.\\nJesus compares the mysterious force that regenerates us with the wind: Jesus says, “The wind blows where it wills, and you hear the sound of it, but you do not know whence it comes or whither it goes; so it is with every one who is born of the Spirit” (John 3:8).\\nThe Bible says that things which are visible are temporary but things which are invisible are eternal (see 2 Corinthians 4:18 ).\\nIn other words, those with born again bodies are living in the eternal everywhere, everywhen and at one with God. This is how the Tibetans define the Oneness of the Rainbow Body state of being.\\nThe Essenes were great scholars, researchers and practitioners of the most advanced spiritual teaching on earth. They said it came from the angels. It matches the Tibetan light body teaching they said came from the stars, meaning it is a universal teaching. It is my hope that my linking the Essene Perfect Way, the Tibetan Great Perfection and the Christian Born Again traditions is received today in the spirit of love and unity with which the Essenes received it two thousand years ago. Then, as now, the promise is the same. When we live from our light bodies we become a new being, a born again being in the here and (or the here and new). We live a life like those of the Seraphim, the Essenes and Christ. Filled with the supernatural power of the Holy Spirit we are able to do the same things they could do.\\nI am thankful, once again, for the winds of Hurricane Matthew and the thunder of John Van Auken and Edgar Cayce that blew this understanding my way.\\nWilliam Henry is a Nashville-based author, investigative mythologist, and TV presenter. He is an internationally recognized authority on human spiritual potential, transformation and ascension. \\nSource: William Henry \\n'"}, "time": 1742564306.0731516}