{"duration": 0.08931875228881836, "input_args": {"text": "'It sounds like something out of a Philip K. Dick novel, replicants and all. The United Nations is planning to have all humans imprinted with biometric identification cards . \\nVia AlternativeNews \\n\\nIf you’re not sure what this means for you, it would basically be sci-fi meets 1984. The world government would know where you go, what you do, who you’re with, and who you are at all times, anywhere, every day and every night. It means more restrictions and less freedom. The United Nations wants everyone to have a biometric identification tag by 2030, which is part of their Global Goals agenda .\\nThe United Nations is already working hard toward the implementation of this goal – particularly among refugee populations. The UN has partnered with Accenture to implement a biometric identification system that reports information “back to a central database in Geneva”.\\n…\\nAnd these new biometric identification cards will not just be for refugees. According to a different FindBiometrics report, authorities hope this technology will enable them to achieve the UN’s goal of having this kind of identification in the hands of every man, woman and child on the planet by the year 203o.\\n…\\nThe following comes from the official website of the World Bank…\\nProviding legal identity for all (including birth registration) by 2030 is a target shared by the international community as part of the Sustainable Development Goals (target 16.9). The World Bank Group (WBG) has launched the Identification for Development (ID4D) cross-practice initiative, with the participation of seven GP/CCSAs sharing the same vision and strategic objectives, to help our client countries achieve this goal and with the vision of making everyone count: ensure a unique legal identity and enable digital ID-based services to all.\\nSource: The Economic Collapse \\nIf you were wondering how the world powers would truly tighten their grasp on the liberties of its citizens, this is how it will happen.\\nEverything you do and say will be monitored and recorded to be used to shepherd you towards obedience. The United Nations has always been a force for world dominance, and this program will be enforced the world over. This is already being done through social media, but because services like Facebook are not obligatory for all citizens, the next logical step is to force citizens to participate in this very program.\\nAre they running behind schedule ? This was supposed to happen by 2017 in the United States: \\nSource : (Truth & Action) \\n'"}, "time": 1742561646.3159075}