{"duration": 0.028821229934692383, "input_args": {"text": "'License DMCA In a TV interview today I was asked, considering the new FBI revelations about Hillary\\'s emails, who would win the election. I replied that the FBI would be the winner, that the USA\\'s intelligence agencies would be deciding who would win-- an outrageous, traitorous situation. On Monday, I had dinner with three heroic NSA whistleblowers-- Bill Binney, Thomas Drake and Kirk WIebe-- after they\\'d shared the stage in a panel discussion presented at West Chester University. Whistleblowers Thomas Drake, William Binney, Kirk Wiebe and moderator/organizer West Chester professor Jana Nestlerode(image by Rob Kall) License DMCA - Advertisement - I came away with the clear conclusion that the US Intelligence community is a major threat to democracy. The whistleblowers stated that NSA tracks the signal intelligence-- phone calls, emails, credit card transactions, medical bills, automated toll payments-- for every American and for billions of people -- seven billion nodes. The intelligence agencies track every member of congress and all their family and friends. They track all the people in the White House, all the people in the Supreme court, all executives of corporations. All it takes is one brother-in-law selling drugs or hiding a criminal record to get a job and that puts a person of power in congress, the White House, wherever, at risk of coercion. That\\'s why privacy is so important to all of us, even if we have something to hide. We can be blackmailed because we love someone who has something to hide. Remember, Ed Snowden was able to access the information. Actually, there may be thousands of private contractors-- employees of big corporations-- who have access to all or part of the massive data trove. There\\'s even a name for one of the things they do. Remember, \"Sig-Int\" is the term used to refer to signal intelligence-- anything that can be picked up electronically. These contractors and intelligence agency officers engage in what is called \"love-Int,\" basically spying on wives and girlfriends to find out if they are cheating. The abuse of the system is dangerously, rampantly out of control. The recent disclosures of nebulous information about Hillary Clinton\\'s emails are an outrageous, screamingly transparent effort to influence the election. There is no way to justify the timing. This is just the latest stretching beyond the boundaries by an intelligence agency leader. It has to stop. FBI head Comey should be charged with whatever laws apply which relate to using government power to unlawfully influence elections. It is clear that the FBI as well as the NSA, which surely has had all of the missing emails all along, have used their control over and selective analysis of them to influence the election. This should not have happened. It can never happen again. The presidency of the United States must not be determined by the head or heads of a spy agency. And it looks like that\\'s what we\\'re seeing. Whether you support Hillary Clinton, Donald Trump, Gary Johnson or Jill Stein, this process should be horrifying to you. - Advertisement -'"}, "time": 1742628571.1812418}