{"duration": 0.0990302562713623, "input_args": {"text": "'  Barack Obama Tells Alexis Tsipras That Rising Tide Of Nationalism Will Be A Threat To Globalism Speaking at a joint news conference with Greek Prime Minister Alexis Tsipras by his side, Obama refrained from criticizing President-elect Donald Trump directly as he discussed the impact of his electoral victory last week.   Obama warned Tuesday that Americans and people around the world “are going to have to guard against a rise in a crude sort of nationalism, or ethnic identity, or tribalism” taking root amid the populist movements that are gaining currency around the world. \\nEDITOR’S NOTE: Why did the British people vote for Brexit ? Why did Donald Trump win in a landslide ? Because free peoples from any nation, once woken, will rightly reject globalism as a threat to individual freedom. NWO elites like Obama hate displays of nationalism like Trump’s America First campaign because he doesn’t believe America should come first. The coming Trump presidency is America’s first ray of sunlight in over 8 years. \\nSpeaking at a joint news conference with Greek Prime Minister Alexis Tsipras by his side, Obama refrained from criticizing President-elect Donald Trump directly as he discussed the impact of his electoral victory last week. But the president made it clear that he sees a dark side to the kind of populist movements Trump’s campaign embodied — ideals that other conservative leaders are advocating in Europe and elsewhere. WHO IS ALEXIS TSIPRAS? – click here to visit the NTEB Archive \\n“We are going to have to guard against a rise in a crude sort of nationalism, or ethnic identity or tribalism that is built around an us and a them, and I will never apologize for saying that the future of humanity and the future of the world is going to be defined by what we have in common, as opposed to those things that separate us and ultimately lead us into conflict,” Obama said. \\n“Take Europe,” he continued. “We know what happens when Europeans start dividing themselves up and emphasizing their differences and seeing a competition between various countries in a zero-sum way. The 20th century was a bloodbath.” Obama Full Press Conference with Alexis Tsipras in Greece: \\nIf you don’t wish to suffer through all the blather, fast-forward to 32:20 mark to hear his specific anti-America First mumbo-jumbo. \\nObama, who made it clear during the course of the hour-long news conference that he did not view the recent U.S. election results as a referendum on his own tenure or world vision, suggested that targeting specific racial, religious ethnic groups could backfire. \\n“In the United States we know what happens when we start dividing ourselves along the lines of race or religion or ethnicity. It is dangerous. It is dangerous, not just for the minority groups that are subjected to that kind of discrimination, or in some cases in the past, violence, but because we then don’t realize our potential as a country when we are preventing blacks or Latinos or Asians or gays or women from fully participating in the project of building American life,” he said. \\n“So my vision is right on that issue, and it may not always win the day in the short term in any particularly political circumstance, but I am confident it will win the day in the long term,” Obama added. “Because societies which are able to unify ourselves around values and ideals and character, and how we treat each other, and cooperation and innovation, ultimately are going to be more successful than societies that don’t.” \\nObama acknowledged that there was a common theme in the recent U.S. presidential election, Britain’s vote in June to leave the European Union, and other populist movements elsewhere. \\n“Globalization, combined with technology, combined with social media and constant information, have disrupted people’s lives, sometimes in very concrete ways,” he said. “But also psychologically, people are less certain of their national identities or their place in the world. It starts looking different and disorienting.”  '"}, "time": 1742562066.283455}