{"duration": 0.07048511505126953, "input_args": {"text": "'WASHINGTON, D. C.  —     Donald Trump’s first act as president will reportedly be to “clamp down” on the country’s immigration system and refugee resettlement program, while enforcing a “ ” method, focusing on skilled workers. [In a new piece by the LA Times, the   newspaper says Trump will immediately focus on the broken immigration system, both legal and illegal, just as his campaign for president promised:  Gone will be the temporary protections of the final Obama years for people in the country illegally. In their place, expect to see images on the evening news of workplace raids as Trump sends a message that he is wasting no time on his promised crackdown. The LA Times cites Trump spokesman Sean Spicer’s statement on immigration as an indication that the incoming administration will not take a backseat to the Department of Homeland Security (DHS) on the issue. “We need to get control of our borders and we need to get control of our immigration system, and we can do it in a very smart and methodical way that ensures that the priority is first and foremost people who seek to cause us harm or who are a danger in a community,” Spicer told the LA Times. The LA Times also noted Trump’s widespread powers as president over the country’s immigration system, writing that “Trump can act on immigration without Congress”: Taken together, the actions would result in a significant shift in how immigration law is enforced, which could itself create a ripple effect that alters the immigration pool and how the 11 million or so in the U. S. illegally live their lives. Unlike some of his other   plans, such as replacing Obamacare, Trump can act on immigration without Congress under the president’s wide legal authority to control borders. “We’re going to move very quickly on the border,” Vice   Mike Pence told NBC News on Wednesday, saying Trump could even use his executive power to start on his chief immigration pledge  —   building a wall along the border with Mexico. That   on immigration could come via a   immigration system, which would mean less   immigrants and more   workers to take jobs that cannot be filled from the country’s native population, POLITICO reported. “We’re going to have great people and people of great talent coming into our country,” Trump said in an interview with Fox  Friends. “And if you can think of this, some of the Silicon Valley companies want to build up in Canada, because in Canada, they’re able to get the people that they need and they can’t get them in this country because we don’t allow them in this country. ” “So we’re going to take care of a lot of situations,” Trump continued, referring the country’s immigration system. “And we’re going to have a lot of heart, believe me. It’s going to be a heart almost as big as yours. ” The   immigration plan could be trotted out by the incoming Trump administration “over the next two to three months,” as he noted in the interview. Immigration groups like NumbersUSA heralded the potential   system, saying that it would favor giving legal immigrant residence to individuals who fill jobs, rather than the current system which favors family members of immigrants already living in the U. S. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562271.0283608}