{"duration": 0.05444526672363281, "input_args": {"text": "'\\nThe latest batch of hacked emails from Clinton’s campaign chair, John Podesta, have been released.\\nOver 1,100 emails are contained in the latest leak, amounting to 43,000 of the 50,000 promised to be released by Wikileaks before November 8.\\nThere are a number of communications found in the email pertaining to the Clinton campaign’s close relationship with mainstream media and her private email server.\\nOne email from September 9, 2008 shows Chris Lu, the Deputy Secretary of the Department of Labor, discussing a virtual data room where “policy promises” and other private communications will be uploaded:\\nGeneral room – there is a general room that we’ll upload all of the policy promises, as well as legal documents like expense reimbursements and contribution forms. All of the principals on this list will have access to this room… Regarding policy promises, from now on, we’ll email out the first drafts when they’re done, but we won’t email out revisions. The latest version will always be stored in the “general” data room.\\n \\n\\nAnother email thread from May 11, 2015, discussing Lanny Davis, former attorney for Bill Clinton, we see Clinton’s senior advisor, Philippe Reines, pose the following question:\\n“[Hillary Rodham Clinton] is anxious to move forward — with the commitment that I will keep him focused and in line. Do you guys need to run any more traps on your end or can I reach out to enlist him?”\\nHuman Abedin writes back saying, “She just called me about this. She wants Lanny.”\\nJohn Podesta cryptically responds, “In the land of he blind, the one-eyed man is king.” Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Ryan Banister of The Daily Sheeple . '"}, "time": 1742562338.495374}