{"duration": 1.0194370746612549, "input_args": {"text": "'Are The Polls Rigged Against Trump? All Of These Wildly Divergent Surveys Cannot Possibly Be Correct Michael On Television What Is The Best Place To Live In The United States To Prepare For The Coming Economic Collapse?   May 2nd, 2011 \\nWhat is the best place to live in the United States? I get asked that question all the time. My answer can be summed up in two words: it depends. The truth is that the answer is going to be different for each person. All of us have different goals and different needs. If you have a very strong network of family and friends where you live right now, you might want to think twice before moving hundreds or thousands of miles away. If you have a great job where you live right now, you might want to hold on to it. You should not just assume that you are going to be able to pick up and move to another part of the country and be able to get a similar job right away. The United States is in the midst of a very serious economic decline right now, and wherever you live you are going to have to provide for your family. Just because you move somewhere new does not mean that you are going to leave your problems behind. In fact, you might find that they moved right along with you. With all that being said, the reality is that there are some places in the U.S. that are going to be much more desirable than others when the economy totally falls apart. For example, during a total economic collapse it will not be good to be living in a large city or in a densely populated area. Just think about what happened in the aftermath of Hurricane Katrina. If the entire nation is going through something like that, you don’t want to have hundreds of thousands of close neighbors at that point. So when thinking about where you want to be when everything falls apart, population density should be a major factor. But there are other factors as well and no area of the United States is perfect. \\nIf you live in or near a major city right now, that is okay. Most Americans do. Even if you have limited financial resources at the moment, you can start developing a plan that will get you where you eventually want to go. If you want to move to another part of the country you can start applying for jobs out there. You can also be working hard to develop a business that would enable you to move. Perhaps you have friends or family in more isolated areas that would allow you to stay with them during an economic collapse. \\nThose that possess more financial resources could start thinking about getting a second home in a location that is more rural. \\nThe key is to come up with a plan and to be working towards accomplishing that plan. \\nIf you don’t have a plan yet, hopefully the following information will give you something to think about. Not all areas of the United States are equal, and all of them do have problems. \\nThe following are some thoughts about the best place to live in the United States…. \\nThe Northeast \\nA major problem with the Northeast is that it is just so darn crowded. Yes, there are some rural areas, but the overall population density of the region is so high that it would be really hard to go unnoticed for long in the event of a major economic collapse. \\nAnother thing that is not great about the Northeast is that so much of the population lives near the coast. As we saw in Japan recently, living near a coastline is not necessarily a good thing. While it is likely safer to live along the east coast then the west coast, the truth is that there is an inherent level of insecurity when it comes to living in coastal areas. You never know when the next hurricane, oil spill or tsunami is going to strike. \\nAlso, the Northeast is really quite cold. So staying warm and growing your own food would be more difficult than in some other areas of the country. \\nThe Mid-Atlantic \\nThe Mid-Atlantic is one of the most beautiful areas of the nation. Unfortunately, it suffers from many of the same problems that the Northeast does. \\nThe Mid-Atlantic has a very high population density. For example, the area around Washington D.C. is pretty much all suburbs for 50 miles in all directions. \\nThe weather is nicer than in the Northeast and there are some less dense areas once you get south of Washington D.C. \\nIf you think that the Mid-Atlantic might be for you, you might want to check out North Carolina or South Carolina. The people tend to get friendlier the further south you go and there are definitely some areas that could potentially work. \\nFlorida \\nFlorida is generally not going to be a place that you want to be during an economic collapse. The housing market has absolutely collapsed down there and the crime rate is already very high. It is also very densely populated. \\nThe weather is very nice down in Florida, but one big thing that you need to consider when it comes to Florida is the fact that it is very flat and most of Florida is just barely above sea level. In fact, quite a bit of Florida is actually below sea level. \\nIn addition, hurricanes are always a major threat in Florida. It is a beautiful state, but there is a lot of risk to living down there. \\nThe Southeast \\nThe Southeast has really taken a pounding over the last few years. First it was Hurricane Katrina, and then it was the BP oil spill and then it was the tornadoes of 2011 . \\nThere is a lot of poverty in that area of the country. There is also a lot of crime. \\nThere are a lot of great people who live down in the Southeast, but if you do not know your way around it can be a very difficult place to move to. \\nThe Mid-South \\nOne of my favorite places east of the Mississippi River are the mountains along the Tennessee/North Carolina border. If you must be in the eastern half of the United States, that is not a bad choice. \\nWhere you do not want to be is anywhere near the New Madrid fault zone . The New Madrid fault zone covers portions of Illinois, Indiana, Missouri, Arkansas, Kentucky, Tennessee and Mississippi. The biggest earthquakes in the history of the United States were caused by the New Madrid fault. Many are convinced that we are going to see an absolutely catastrophic earthquake along the New Madrid fault at some point. \\nSo if you want to live in the Mid-South, it is highly recommended that you stay far away from the New Madrid fault zone. \\nThe Upper Midwest \\nThe Upper Midwest was once one of the great manufacturing regions of the world, but now much of it is known as the “rust belt”. \\nFormerly great manufacturing cities such as Detroit are now absolute hellholes . Tens of thousands of our factories and millions of our jobs have been shipped overseas. \\nThere are some really great people (including some good friends of this column) that live up there, but the truth is that the region is really cold and unemployment is rampant. \\nThe Upper Midwest is an area that people want to get out of. It is probably not a great place to move to. \\nHowever, if you do need a job, one place to look is a little bit west of there. Thanks to an abundance of natural resources, unemployment in North Dakota and South Dakota is very low. If you really need a job you might want to look into those two states. \\nThe Southwest \\nIn the Southwest there are a whole lot of freedom-loving Americans, the weather is very warm and there is a lot of space to get lost. \\nHowever, the Southwest is also very dry and in many areas there is not a lot of water. Drought and wildfires are quite common. \\nIn addition, illegal immigration is rampant and is a constant security threat. \\nIf you are familiar with that area of the country it is not a bad choice, but if you do not know what you are doing it could end up being disastrous for you. \\nThe Great Plains \\nAs long as you are far enough away from the New Madrid fault, the Great Plains is not a bad choice. \\nIt is very, very flat out there, and it can be quite windy, but the good news is that you should be able to grow your own food. \\nIn addition, the population density is generally very low in most areas. \\nOne big negative, as we have seen recently, is tornadoes. The United States experiences more tornadoes that anywhere else in the world, and “tornado alley” generally gets the worst of it. \\nThe West Coast \\nDuring an economic collapse, the West Coast is not a place that you will really want to be. Just take a look at the state of California already. It is an economic nightmare . \\nMillions of people have left California over the past couple of decades. The millions of people that have left have been replaced mostly with illegal aliens. \\nOregon is better, although they have very high taxes and they are experiencing huge economic problems right now as well. \\nThe best area along the West Coast is the Seattle area, but you won’t want to be anywhere near a major population center when things totally fall apart. \\nAlso, the West Coast lies along the “ Ring of Fire “. Considering what just happened in Japan and what has been happening in other areas along the Ring of Fire lately, the West Coast is not an area that a lot of people are recommending. \\nThe Northwest \\nLarge numbers of freedom-loving Americans have been moving to the states of Montana, Idaho and Wyoming. You can also throw eastern Washington and eastern Oregon into this category as well. \\nIt gets cold up in the Northwest, but not as cold as the Upper Midwest. There are lots of rivers, streams and lakes and in certain areas there is plenty of rain. \\nThe population density is very low in most areas and there is an abundance of wildlife. Housing prices are reasonable and in many areas you can grow your own food. \\nThe Northwest is one of the favorite areas of the United States for preppers. It is far from perfect, but it does have a lot of advantages. \\nAlaska And Hawaii \\nNeither Alaska or Hawaii is recommended. Alaska lies along the “Ring of Fire” and it is very, very cold. Also, almost everything has to be either shipped or flown into Alaska. In the event of a real economic collapse, supplies to Alaska could be cut off and shortages could develop very quickly. \\nHawaii has a huge population and it does not have a lot of room. Like Alaska, most supplies have to be either shipped in or flown in. And one really bad tsunami could pretty much wipe Hawaii out. \\nBut once again, there is no “right answer”. There are areas of just about every U.S. state that could potentially work well during a major economic collapse. \\nWhen assessing where “the best place to live in the United States” is, it is important to examine your own personal factors. What will work for me and for my family will not necessarily work for you and your family. \\nSo what do all of you think about this list? Which area of the country do you think is best for those Americans who are seeking to prepare themselves for the coming economic collapse? Scott \\nI have actually been thinking about this lately. And population and weather are the two biggest factors. emma \\nThis whole Osama dead Stuff really gets to me. \\nThe guy from FFT summed it up perfectly. \\nhttp://www.forecastfortomorrow.com/news/2011/05/osama-bin-laden-dead/ \\nNever before has this country embraced Empire so willingly. Never before have we given up, wholesale, our precious liberties won with the blood of our countrymen. For what?? Some lame ass guy in a cave somewhere that represents some of the best thinking of the 13th Century? This is beyond ridiculous, it is totally absurd. Nickelthrower \\nGreetings, \\nI can’t help but laugh when I read blogs such as this. I hate to break it to everyone but no place is going to be very safe. Hear me out then see if you don’t agree. \\nIf the economic tsunami that is headed our way includes the loss of international oil then it wont matter if you are in New York City or the Deep South. \\nWe now know (because we have their documents) what the Soviet Union planned to do to destroy the U.S.A. Whereas we intended to nuke everything and anything in an attempt to kill as many Russians as possible, the Russians believed that they could kill even more Americans by just using a few dozen or so nukes on a few of our ports and all of our major oil refineries. \\nWhere we planned to annihilate everyone in every major city in the Soviet Union, they figured that they could kill even more Americans by just shutting off the oil. They knew that the loss of oil would cause pandemonium in the U.S.A and that the starving people would spill out of the cities and eat up everything until there was nothing left and no means to grow or obtain any more. \\nLet me reiterate it again for you just to make sure you got it: The loss of oil brought about by the collapse of the dollar will be more devastating than a nuclear holocaust. \\nWhatever little “Alamo” you set up for yourself in Hillbilly Land wont be so much as a speed bump when thousands of hungry people descend upon it. \\nDo a little research and read about what a famine of biblical proportions looks because that is what will go down when the pumps go dry. shawn \\nThat was pretty interesting and it make since. It actually just reinforces the conclusion I have drawn. N. Dakota is the place I think I am gonna move my family to as soon as I can.Its gonna take people a while to run outta the major cities into n. Dakota as there are no major cities close in any direction.This would give N. Dakota plenty of time to prepare. N. Dakota has it’s own state bank.It also has nuclear war heads stationed there and if the people and local authorities could seize control of them it would go a long way in defending itself from a tyrannical federal government. It has an abundance of oil and agriculture. Also, it is the state that could most easily succeed from the union (even more likely than Texas) as technically it never really was properly admitted into the union. It is cold and flat but that has kept the wrong kind of people away. N. Dakota also has 0 debt and did not take federal bail out money so they have the right mentality and they already want to succeed. Missy \\nThat was an excellent article Michael!! You are such an excellent writer. I am really looking forward to the comments that will be left on this article. The middle of the US is certainly one of the safer places to live. VegasBob \\nThe Central and Eastern areas of Washington State are actually a fairly nice place to be. The people are generally friendly, and they are far less judgmental than Southerners (I am a native Southerner, so I know just how judgmental Southerners can be). The trouble is that there is not a lot of cultural stuff going on – symphonies, museums, theatres, etc. Maria \\nWe have lived in many different states over the last 25 years from Alaska and Hawaii in the west to Virginia in the east and Texas in the south. We are convinced you are right…there is no perfect place. People need to decide which drawbacks they are most capable of dealing with (snow, rain, heat, earthquakes, etc) and plan accordingly. \\nIf it gets much worse economically, one thing will be certain…if you can’t protect what you have, then you won’t have it for very long. \\nI pray it doesn’t get that bad. Pat \\nI live in Alaska and just got back from vacationing down south. Alaska may be cold and hostile, but one thing it has going for it is stability – something I’ve noticed the lower 48 has been lacking lately. If you know how to live in cold-weather environments, Alaska ain’t a bad choice. Gutter Economist \\nPeople need to start thinking about what comes after the economic collapse. I would look for states that are rich in natural resources and away from coastal areas. \\nIf we have a civil war, I would like to see the following states pull out the union and become the Mountain States of America. With respect to natural resources, these states might include Colorado, North Dakota, South Dakota, Idaho, Montana, Nevada, Utah, and Wyoming. If residents of these states were smart, they would pull out of the union ASAP. Hognutz \\nI’m staying right here on my farm in good old S.C. \\nOne thing not mentioned is family support and real friends. If you have them you might be better off with them….. karl \\nYellowstone Patty \\nMy husband and I saw this coming over 12 years ago as we were living in Florida. With crime, drugs and homeless people all around us. We looked at Tennessee but it just wasn’t right for us. We ended up in the Upper Peninsula of Michigan. I notice more than not that when people think of Michigan they ALWAYS think Detroit. Evidenced once again in your article. The UP is the land of God so to speak with great natural resources, good and plentiful water and lots and lots of land. The people up here are resourceful and know how to live off the land. Yes it’s cold and I like it that way because it discourages the type of people that all southern and warm states have too many of………. shawn \\namen J \\nIf you are willing to work abroad there are many countries where you can teach English. Just get the CELTA. It’s a four week English teaching certificate. Here are a few sites that list ESL teaching jobs abroad: \\nhttp://www.teachaway.com \\nI am a U.S. citizen and I am currently teaching physics in Saudi Arabia with a lot of expats from all over the west. Many teachers here have purchased property abroad since the cost of living is cheaper like Malaysia, Thailand, and the Philippines. \\nPlease go to http://www.trulia.com because you will find many inexpensive property listings all over the U.S. there. There are some great property listings in the Portland, Oregon area. \\nI hope this helps. Owen \\nLike the old gospel song proclaims “There’s no hiding place down here.” Your preparatins will be in vain if you disregard this truth. The time is short aa it appears to this reader that we have now entered the beginning of sorrows. Just Me \\nother than the northwest, I’ll still stick with Pa or Central NY, it gets a little cold and there is some snow, but we don’t have to worry about forest fires, earth quakes,floods, tornadoes,hurricanes,Tsunamies,mud slides,poison snakes,scorpions,alligators,fresh water,very few draughts,burning heat waves,high moisture. and there won’t be very many roving bandits from Sept til June. Wood Burner \\nMost people who live on the Great Plains have only seen a tornado on the weather channel. The damage done by twisters is very localized and narrow. Most assuredly not a factor in determining whether to locate there or not. \\nAlso, using possibles like the New Madrid fault as a factor in where to locate is like using the possibility of zombie rabbits popping up. There is just no certainty of any event like a huge earthquake occurring in the center of the U.S. Mathematically it can not even be an issue. \\nWhat can be stated with certainty is the fact that when the SHTF you will not want to be in or near a large city of any kind. There the possibility of encountering zombie criminals of the human type is not only high but virtually assured. One can make preparations but how does one keep the provisions from being taken by starving idiots? You can try to defend your position but the numbers are against you. \\nUltimately there is only one way anybody gets out of this life with a chance of redemption. Use it. Rev 6:5 \\nI think the best place to go in the event of a economic collapse or something much worse would be out in Utah. Most of Utah is isolated except around Salt Lake City. The weather isnt that bad in winter but summers can get hot in the southern half of the state. I would definetly recommend living near a water source such as a lake or river. There are places around Fruita, UT that grow crops out in the middle of the desert because of the Freemont River. Living in the mountains would be fine in the summer but they can recieve a lot of snow and cold from October to May. Utah just seems to me to be the most practical location. Matt \\nIt must be warm year round. Southwest wins here. Summer heat is very uncomfortable but extreme cold is much worse if you cannot afford the high cost of heating or cooling your home. J \\nAnother good thing about living and teaching abroad is that you don’t have to pay taxes. Just file the 2555-EZ form. jet \\nI would pass on Oregon and Washington. The taxes are incredibly high, there is always the threat of tsunami or earthquake and it rains or is cloudy for about nine months a year, people are in a constant state of depression because of the weather. Oh, and it is liberal in the extreme. People here don’t like “freedom loving Americans”, aka conservatives. Freedom Lover \\nMontana, Idaho and Wyoming depends if you are in one of the wolf high population areas you could not pick a worst area. Wildlife is being slaughtered off in record numbers. Ranchers forced out of business that milk cow and chickens for survival would be close to impossible to raise. Now the wolves are spreading disease to the animals and people. Before you even think of moving to one of these 3 States you should watch Yellowstone is Dead. \\nWhere ever you pick make sure you have your own well water is going to be very important and you truly can’t store enough water. Massivecarbunkle \\nEveryone must find a place, surely most will want to be near blood relatives, those who grew up in the 80’s when the media taught them to be independent and far from home, they will find it very hard, very, very, hard indeed. Most strangers in places they are not familiar with during the economic collapse will be dissed and treated very harsh and left for dead by city dwellers. For this was the GREAT SIN of the citizens of Sodom and Gomorrah, the wicked and cruel treatment of strangers. jose puta \\nthe best place for you to live is on the Amazon with the tribes, quit spreading your disease. JH \\nThere are some great areas in California along the Sierra Mountain range and in Northern California. They are warm most the year, have very fertile soil for gardening, low population density, natural beauty and water sources (off the mountains). Yes, taxes and property rates are high and employment is tough, but if you can work from home or are retired, not a bad option. \\nSouthern Colorado in the Rockies is another good option with limited government, cheap land, low population density, water sources, few gun laws, etc. It gets cold, but not as cold as other places. Judith \\nYou are forgetting the Yellowstone volcano. That should pretty much take care of the Northwest. Adrian \\nI noticed lately that more Americans are moving to Australia. We have plenty of rooms and we love Americans. So come on over. Gary2 \\nWe have a large body of fresh water on our door step. Lake MI looks as big as any ocean from the shore line. Please keep telling people to not move here (WI) as I hate crowds and a lot of people clogging up everything. The cold keeps the nasty bugs at bay. If you need a well you can pretty much sink a hole anywhere and get wonderful water. With water shortages we are positioned quite well. Steve \\nEconomic collapse? Do you really know how the collapse will happen? How about a Mexico border state like TX, NM or AZ. Start a garden. In a rural area a little south of a big city. Learn spanish and have a little vacation home in Mexico to escape to with a Peso bank account. Keep your van packed ready to run. Would love to have a little Wine and Coffee plantation near the Mexican town of Chicxulub in the Yucatán peninsula run by a bunch of nice señoritas. InArizona \\nI think you are wrong about Alaska, there are many places in Alaska that are WARMER than the Northwest in the Winter. Anywhere along the water is more temperate than the Northern part of the Cont US. Also, Alaska has abundant LARGE game, fish, and other resources that no other state does. Forget about shipments up there, what would you need? Lumber is available, oil, and nat gas are everywhere… Not to mention… the VERY long growing days in the summer produce some of the largest fruits and vegatables…. just take a look at the Palmer Fair each fall… Also, tidal waves, volcanos are an issue as well as earthquakes, but just living away from low lying coastal areas would mitigate that threat. One thing about Alaska… you NEVER have to worry about a drought! So summertime will produce plenty of vegatables… wheat and grains don’t work so well, but I have been successful growing corn, risky and a lot of work, but it can be done. \\nI think that as a human being you would find most of the resources you need up there, without the competition for resources, which needs to be taken into consideration. \\nSo, my short answer, it depends on how BAD it gets, Alaska would be perfect WTSHTF! InArizona \\njust so you know, I currently live in Arizona, and am originally from Alaska… born and raised, been in AZ for 10 years now. \\nI can see advantages to both places to live, but I really worry about water here, and the availability of game animals. I am also out of my element, so when I go into survival mode, I am thinking about Alaska. \\nHere in the desert all we have is bunnies and cacti… I don’t know how to build a home from cacti, and eating those darn bunnies would eventually get very old! (I currently have moose meat and smoked salmon in my freezer…you can take the girl out of the trailer park, but you can’t take the trailer park out of the girl!) tobage \\nRural Southwestern Michigan \\nThe Great Lakes area is the Saudi Arabia of freshwater in general, but SW Mich has some of the most fertile land on Earth…AND a 180 day growing season…that will only be getting longer thanks to abrupt climate shift. \\nExtremely few places on planet Earth have this. \\nAnd THIS…… is all that will matter. \\nI bet thats why you are sterring people away. wink wink… foldenfan \\nWe are in west central Minnesota, and feel pretty good about our area. Yes, it has cold winters (though the summers are the best I have ever seen), but as has been said about the cold winters, “It helps keep the riff-raff out.” We have lived in Colorado, Oregon, Washington, and have a lot of experience with Wyoming and Montana. We feel this is the safest place for us. \\nGardening for food here is great, good soil, adequate rain, growing season is such that if we can’t grow it, we don’t need it. Lots of cattle (dairy & beef) in our area, low population, and the people are of the best overall quality we have seen anywhere. Main farm crops here are corn, wheat, oats, hay, barley,soybeans, potatoes, flax, sugar beets, etc. \\nAverage folks here are conservative (most of the Libs are in the cities), and well armed. As for wildlife, we have lots of deer, turkey, pheasant are making a comeback, and thousands of lakes for fishing. Also have some wolves, coyotes, and a few bear around. \\nWe feel that when Teotwaki hits we will have as good a chance here as anywhere. \\nLand is relatively inexpensive compared to most regions that have “usable” land. We have 80 acres, 50 in Oak trees (LOT’s of excellent firewood), and 30 open for gardens and fields. I will admit that land is more expensive now than when we bought back in 1997. Overall, we’ve been here 20+ years so we have considerable experience in this area. Gist of my comment is, don’t sell parts of MN and the eastern Dakotas short. Marlene Spence \\nSan Juan Capistrano California is beautiful. We grow vegetables, etc. and have survival food purchased from Jim Bakker Ministries. We do have a nuclear plant near by, however. I think Nuclear Plants need to be considered. JD \\nThank you Michael. I still know Montana is far perfect but when the weather is nice like it is today this truly is the last best place. Except for Yellowstone. But you cant think that its going to blow up everyday it would make you insane. Michael \\nWhen Yellowstone goes, it will generally be better to be north and west of it rather than east and south of it. JD \\nOh some good news I might be able to get my old job back after getting laid off two years ago. I would be happier than i have been in a long time. I pray and i believe it will happen. Everyone reading this blog there is hope out there. Im glad its here for all of us to share our thoughts. Home is what you make of it. Like Michael was saying about using your family and connections where you live is important. It may be your only hope. I grateful even tho im techincally homeless and my friend lets me use his computer the weather is getting nicer Bin Laden is dead today is awesome. I love MT & i totally agree with gutter econonmist that Rocky Mt States of America will happen. Eastern OR & Spokane could join just as long as not too many hippies invade here. Ooops I guess theres Missoula too late.. morpheus \\nI know it seems like our only choice is to retreat and run for the hills. Big mistake! Because soon everyone will follow. No, we have to stand and fight or we will lose everything if we run like cowards. \\nWake up America. It’s time… \\n“THE REVOLUTION HAS STARTED” Read “Common Sense 3.1” at ( http://www.revolution2.osixs.org ) \\nFIGHT THE CAUSE – NOT THE SYMPTOM“Spread the News” jpalm \\nNice site, but it lost me where it says: “I’m tired of hearing it said that democracy doesn’t work. Of course it doesn’t work. We are supposed to work it.”– Alexander Woollcott \\nOur country is not a Democracy. The thought that it is a Democracy has led us to the situation we’re in today. Our country is a Republic. Period. Not a Democracy, not a Democratic Republic. A Republic, a form of government where 99% can’t vote away the rights of 1%. Kevin \\nRegardless if there is a collapse or not it would be wise to live where there would be jobs in gainful private sector employment. Those states with significant shale natural gas deposits and farming would be the best bet. Even if your not directly working in either field there are support jobs that come along for the ride. Small town western Pennsylvania may be a choice. Pennsylvania is Philadelphia and Pittsburg with West Virginia in the middle. Once out of the damn few cities the place is Maybury RFD. Thinkaboutit \\nGlad you recommended against Hawaii, because there are plenty of people there…but Tsunami only affects the coast…there are great higher elevation places to live in Hawaii where the food falls out of trees along with fresh rainwater nearly every night ryan \\ni live in rural western wa and its not as liberal as one would think.most all libs live in seattle and the other bigger citys on the coast but every where out side of that is good old americans!everybody i no are gun owners on a large scale to say in the long run that we will be overrun by starving people after the callapse is nonsense we will fort up and protect ourselves and are familys and friends!besides most will be killed by mobbs or will starve before they can even try to get out of the city. people underestimate us country folk! smarter than you \\nEureka, California is the best place you can possibly live. Don’t argue with me. Just get your ass to Eureka. Thomas \\nHawaii seems a good choice. Plenty of military around to help keep order and a preferred place for Asian visitors. Even as everything has to be flown or shipped in, the state is small and can be managed easier than larger states. Old Red (neck) \\nPick Colorado or Utah, or maybe western Nebraska. Don’t come to Idaho, nothing but gun tote’n, beer swillin’, bible thumpin’ rednecks with old cars and furniture in the yard. Stay away! You’ll be bored too. Don’t come here! 38Blackfin \\nFull disclosure: I am writing from the Southeast- \\nThe comments written here about the Southeast could only have been from someone with zero first-hand knowledge of the area. I don’t even know where to start… Twiinkles \\nAfter reading this seems like there some good alternatives outside the USA . Obamistake \\nDoesn’t matter where I live…I’ve exercised my Second Amendment rights several times over. With my food supply I’ll be just fine. mtguy \\nSounds like great ideas, but also like we need some geography lessons. I’m in E. Washington/N. Idaho area. It is the west side of the state that has most of the population (think Seattle) and the rain. East of the Cascades is much better for the things we’re talking about -plenty of water, decent growing season, lots of wildlife (animals not bars)and fishing. Yes there’s snow, but that clears out the “snow birds” who won’t make it anyway in a big catastrophe. It also makes for a lot of fun during the winter months with skiing, snowshoeing, etc. Good luck everybody. DJ \\nI live in Alaska. Moved heree from Kentucky because of all the people. I have acclimated to the environment now. Coal is on top of the ground in places and trees are abundant, I have a wood/coal burning stove in my log home. Its warm, I am oof the grind and I live at least 100 miles from the nearest population base of any size. \\nHeirloom seeds, my own well, two years of dehydrated food and I am a fire arms instructor with lots of instructional equipment…. Just like home. And if I am a Hillbilly then so be it. I will make it. Rod \\nNot mentioned but should be considered is proximity to nuclear power plants. I wouldn’t want to be within 50 miles downwind from one. Another good point about a northern climate is food storage is easier and pests can be less bothersome than a southern climate. Ben Dover \\nI read the article with an open mind and came away with the thought that the author is of the opinion that all 300 million of us are doomed and should just eat a bullet…it’s why i do not often read this stuff…common sense, it ain’t common… mondobeyondo \\nBut be warned, stock up on potatoes. Potatoes don’t grow well out here in the desert. Don J \\nRight. No perfect place, but I feel that where we live (East Texas) is perfect for us, primarily because my brothers and I inherited over 1,000 acres. We have lakes with fish, tillable garden/crop areas including areas close to our water wells, there are wild hogs that populate the area that are delicious and deer. We can butcher our own meat and cook it over hardwood fires, in an oven or deep fried. We can raise just about any vegetable and most fruit. We know how to prepare and can veggies and fruit. Not too sure how to can meat, but I feel that we could always have fresh meat either with fish, wild hog, or venison in season. There’s no closed season on hogs. We have generators to keep our freezers going and house powered. We have diesel and gasoline stored in overhead tanks. We have guns and bullets and the ability to reload hunting and handgun rounds. Have we thought of everything? Probably not, but if we have to, we think we could survive some very hard times, if it comes to pass. I wish everyone the best. DJ Tom Hallett \\nWhile the mid-atlantic does indeed have its share of exposed coastline, you failed to mention the very rural Susquehanna basin. \\nFrom southeastern Pennsylvania to northeastern Maryland, the Susquehanna basin is quite rural, lush, and teeming with food on hoof and fin. \\nThanks for keeping our little secret! Big Dave \\nI live in Central Texas which is greener than most people think. Water has always been a concern, but now that I am collecting thousands of gallons off my roof I don’t worry about it. Nothing tastes better. The freedoms we have in Texas are great and I know because I grew up in California. The economy is better here and though we do have money shortfalls we are not bankrupt. Yes it’s hot, but I’d rather have heat than extreme cold. God bless Texas! kebozarth \\nThank you for your heads-up. DownWithLibs \\n@ Vegas Bob: \\nTY! Yes, we haven’t quite caught the horrible, sad mental illness known as “Liberalism”. Our strong-rooted Conservatism genes seem to be fending it off quite well. Although I do fear the day that our defenses get weakened. DownWithLibs \\n@ Gary2: \\nI see when it comes to “spreading the wealth” in the property department, you suddenly don’t feel like sharing. (I believe the word we are after here is Hypocrite!) Richard \\nYou really need to leave the United States altogether and choose a country that is not about to be subjected to the horrors of a gut-wrenching depression. Asia is the obvious choice. They will suffer from the coming bust as well but thereafter they will pick themselves up, dust themselves off, bounce back and go from strength to strength. The Asians do not carry the crushing debts that will hobble the United States and Europe for generations to come. If you’re looking for a country where they speak English, Malaysia’s your answer. Ted \\nNW NJ is overlooked. Much has been done to preserve the truly pristene waters and farmlands of this area. Please do not judge what you have not tasted.It is still known as the Garden State.Quality of life will continue to be good because the people have a spirit of survival and work ethhic.A challenge here is an everyday occurance. If you can make it here you can make it anywhere. Home is where you make it. What are you running from? Okie Dan \\nIt is extremely difficult to predict what the fallout would be with an economic collapse. Will martial law take place? Will redistribution of wealth occur? Will military forces simply be used to round up unemployed masses especially in the city? Will the economic collapse have only marginally increased changes than the present situation? There can be no certainty in planning for the scenario. Obviously networks matter. I imagine Oklahoma to be for most people better than Illinois in such a scenario. But I have a sister and brother-in-law,and nephews in Illinois with a spacious house and they farm. I could move there, while in Oklahoma without a job, my network would likely not be nearly so solid nor certain. Lots to think about. metalurgy \\nWelp, glad you are discouraging the Midwest. That is where I live. In MN. Happy to see the riff raff leave and move south to warmer climates. \\nI know how to and have backpacked and camped in 80 below windchill in the middle of winter mutiple times in my life and was extremely warm and comfortable. \\nEasy if you know how to live in this type of environment. \\nThere is a ton of food to eat, even in the winter time. I don’t need a job and I don’t need uncle Sam to survive. \\nNot for everybody here in freezing MN but then I like it that way. Doc Loch \\nMontana is great. Been here all my 45 yrs. (Except short jaunts of a few years to Germany and Oregon). You are all welcome here, and the beauty is unsurpassed, but don’t forget that if you can’t handle 45 degrees BELOW zero for 2 to 4 weeks at a time and lots of snow, then you can’t wear the badge! Bob \\nMichael, \\nThe safest place to be if Yellowstone goes, I’m sorry to say, is Yellowstone. I would not want to be alive if and when it does go as the Earth will be nearly uninhabitable. \\nBob Jack \\nLindsey Williams did a good recent film of the elite’s timeline for the destruction of the dollar, etc. \\nThe main thing is be around family to pool resources, protect one another and be away from big cities. \\nAlso, stock up now….and make sure your spiritual house is in order. Mcbain \\nThe Northeast: NY City, Boston, etc…..sure crowded, but has anyone driven straight across Vermont, NH, Maine lately? Crowded it is not! JD \\nGood point about the hogs in the south. They are large in number and probably tasty. I mean where else can you find free bacon? Sabonim \\nI live in a very rural area of Central Florida about 2 hours north from Tampa and Orlando. I have 1/2 acre over a great aquifer of fresh water with a 6 foot stockade fence, chickens, fruit trees and a garden. I am very well armed, have a Black Belt, am stocked with food, ammo and real money (not paper)and NO debt. I have a good fishing boat and a motorcycle (55 mpg) and am 45 minutes from the nearest coast and 300 yards to woods (a forest) and a huge fresh water spring fed river. I like Florida and where I am at for what is coming. BTW … I am 53 years old and lived hear all my life and have only had one hurricane hit this area, and other than a big mess and no elec. for a few days … no damage done. Good luck to you all. Paschall \\nNickelthrower’s argument is far more cogent than anything else I read here. Bunkers, stockpiles, gardens, and guns will not ease the terror and pandemonium. “Hide in a hole if you wish, but you won’t live one instant longer. Fear profits man nothing.” HT Liu \\nDon’t escape. Try not to allow the economic disaster to happen. Vote with your head but not your feet. Stop voting for immoral politicians who continue irresponsible wild spending, uncontrolled growth of debt, and irrational increases of taxes. The best solution is to never, never, never re-elected anyone. Check what politicians do but don’t listen to what they have to say. If you can’t do that, you deserve a disaster. Mark C \\nOriginally from Texas but I’m already on our family farm here in the Philippines. Better get busy folks, there’s not much time left. Texas Tea \\nBefore BO was elected I mentioned to a friend that I was considering moving back to Texas. She said I should do it soon, so I wouldn’t have to go through Customs! Well, I moved and I’m happy to say we’re still a part of the good old USA. We’re just different enough, however, that if the SHTF we would lock those borders down, become the world’s fifth biggest economy, and feast on our oil, coal, forests, lakes, rivers, farms, wildlife, and football. Dang! Is Texas great or what? Rooster \\nAre you kidding me….You can fivd problems in all areas of the U.S. Finding a place to go…Now….it’s way too late to think of relocating…hunker down and prepare wherever you are; the finacial outlay for any move would better be used to have supplies. yes it is best to be out of a major populated area. Don’t worry about the new madrid, worry about supplies like tolet paper….. Ben rhea \\nThere is no place that you can consider best when economic collapse is already here. Doomsday scenarios rarely ever come true. I think this will iron out, but houses are not going to get really cheap any time soon if at all, and currency war still boiling, plus the riots in Middle East which has an indirect effect to all and natural calamities all over the world. I understand that our country is completely out of control. One would have to wonder if the truth even exists for people, much less corporations. The U.S.’s unemployment stats are more manipulated, kneaded & massaged than the thighs on a world-class ballerina. \\nHate applying to jobs? Let us do it for you. Human job search assistant – http://www.jobwaltz.com \\nNorth Central and North West U.S. are good bets. They have tough cold seasons, but that will drive away those with not so good work ethics. \\nPart of Americas problem is too many living off of those who are working. \\nSouth California will be a lost cause as Mexico tries to take over. Texas on the other hand is not going to be very forgiving to those who have raped our system for years. I have worked with plenty of decent hard working Hispanics. But a good chunk of them don’t care for America or the Gringos. \\nNorth East will be bad when all the spent rod ponds at the nuke plants start going dry and you have radiation clouds down wind from them. \\nThe coasts offer fish and water. It will be hard to over fish the oceans. You can also desalinate enough water to survive, especially if you have a hot day. Hurricanes can be prepared for, tsunamis, not so. So the East coast might be the better choice, unless you have a little elevation. There is historical evidence of major Tsunamis in Oregon AND SoCal in the last few hundred years.. \\nLast bit of advice. If you have an acre or more, you absolutely should have a way to store 3 K gallons of water. No excuse if you have the rain. I hate seeing all that fresh water go down the ditch to the creek. \\nSierra Dave coal \\nWhat about being mobile with a camper of some sort. You would have to have access to a good supply of fuel? At any rate, too many variables to consider a place of safety. What looks good today could very well be the worst place to go after some event takes place. Being mobile, a better chance of being able to move swiftly as the situation dictates?? Hal \\nGloom & Doom. Looks like we are in for some really bad times. Or not! USA has been through tough times before and bounced back every time. I don’t expect this to be any different, but it may take a little longer. It would probably help if all you pessimists and doomsayers(cons or lib) would quit whining and speculating and get of your dead asses to do something positive for a change. OK, off the soapbox…where to live….anywhere your heart desires No rules, but..buy property, preferably rural(at least one acre), if you can. If you can’t afford or borrow, work, work , work till you have the means. Improve your credit and use it only for buying property(not for toys). Learn cycles…do not buy during highs in the area. Do this and you will all at least survive any downturn and be better off than I am(retired, living in FL in an average house, on a small lot, close to the beach, but running out of money). Complaining? Nah. I have lived in many areas of the USA and UK and loved every minute. Endured tornadoes, hurricanes, floods, and burglaries, all part of life. GET OVER IT!! Live your life!! Use good old American know how and innovation. Chris \\nIf you agree with the premise that America is going to suddenly turn into Afghanistan over night then perhaps the rural/survivalist move is the way to go. If you believe that the descent will occur over 10-20 years you want to be urban. You want to be able to walk/bike to wherever you need. You need access to public transportation. You need access to jobs. Yes, there will still be jobs in the US and jobs equals money. We won’t be bartering chickens for healthcare any time soon. You need public services such as fire and police as it is unlikely the suburbs will be supported by services or infrastructure improvements. Any further than the near suburbs will be completely out of the question for any support system whatsoever. Those areas will be sacrificed to the budgetary gods. Let’s be honest, very very very few people are going to be capable of being self sufficient. \\nObviously, most of the commenters think they they are the second coming of Grizzly Adams. Good for them. And good luck. You will need it. For the other 298 million of us, being close to the core and the support of friends and neighbors very close by is the best place to be for at least the next decade +. Larry Calhoun \\nAt this time being very disabled I’m living with family just East of Houston, TX. I WANT to move out of this present Hurricane endangered area & somewhere between Austin & Dallas. (Preferably in a high elevation area where a nice underground home can be built, and be protected from floods or tornados.) One great thing about living in ‘the Republic of Texas’s is that this State has reserved the right to secede from the USA ***if*** necessary. Also; establishing a residence that’s not on the grid has its own unique appeal…..doesn’t it? Fed Up \\n(Opps, I put this in the wrong article, belongs here) \\nWe are planning on moving to Colorado. As “JD” said in another discussion, “the Rockies are the last best place.” \\nColorado already has lots of preppers, organized in various areas and they meetup as a group a few times a year. CO has low taxes, hardly any gun laws, and a history of independent thinking and self-reliance. If you live at lower elevations the weather is perfect four seasons, with LOTS of sunshine, no natural disasters (except forest fires), and NO BUGS. Water can be an issue, but there are lots of creeks, rivers, and good wells if you look for them. \\nThere’s plenty of wildlife, fishing, and firewood. Except for the ski and resort areas, housing and land prices are very affordable in the remoter areas. Slade \\nIn the UNlikely event of a complete breakdown of the economy and law and order, our best bet is the two Fs: Family and Firearms. Gary2 \\nHT Liu-good point we need to not let the economic collapse happen in the first place. \\nPeople need to stop voting for any republican period. They need to look at what any dem does and not what they say. I am so sick of dems talking a good progressive game and then being way too conservative like Obama. \\nYes, Obama is better than any republican but I am really getting sick of choosing the lesser of 2 evils. \\nI want Bernie Sanders for President. redgypsy \\nLook West of Port Angeles WA Can feed a large family on 5 acres with food to spare. Quite and remote and plenty of resourses. Dee \\nYou never mentioned Colorado? We have fresh mountain streams,plenty of game and not too many overcrowded areas. Plus, a large number of people who know how to survive off of the land and who are already starting to band together and plan… \\nOur Gourmet Survival Food Business Opportunity \\nThe best place to live is in Santa Cruz California. We’re above any Tsunami levels. Earthquakes are fun here and have never killed anyone. The University of California provides much cultural things to do. The weather is PERFECT year-round and the population low. The Beaches are beautiful, AND you can get everything you need, including our Survival Food. No big cities even close. Xploregon \\nIn 2-3 months I’ll have two (2) two (2) acre remote wooded lots available for sale in south/central Oregon (Coos County)for sale (price not yet determined) on a very large fresh water lake about three (3) miles inland from the beach. Currently lake/water access only but may have seasonal road which can be developed to year round if desired. 30+ miles of nothing but deep Pacific NW forest (mostly state forest land)to the East and simular S, N & West. Sportsmans paradise in the “bananna belt” of Oregon. Septic and water well approvable. Badguy \\nYes, the Midwest is a rust belt… but that may be an advantage! We’re ALREADY poor.. so any hard economic times will only be “more of the same”. Also, there’s plenty of fresh water, woods and ground that can be cultivated easily. Also, it’s hard to hold riots when the temperature is 20 degress F or below (5 months a year). Also, if an when, the government decides that bringing back manufacturing is a must if a military confrontation with China becomes eminent or to avoid a complete social and political collapse, we still have trained workers the can restart the process. Liz Michael \\nIn the event of a collapse, you probably want to pick a place or a region which could survive on its own as an independent republic. To me, this means Texas, and any state relatively close to Texas. I am in Arizona, close enough to Texas. In a collapse, illegal immigration may no longer be a problem: no jobs means no immigrants. Phenius Barnham \\nKetchum, Idaho. The rest of Idaho is not all that you’d want. The Ski Folk come and spread smiles. Scott and Smith are headquartered here. The Sawtooth Mountains are some of the prettiest in the world and the populace are friendly and educated. Mountains are always the last to attract military. Yellowstone is not going to go off so relax. The homes are all well built and there ain’t no junk. Crime is non-existant because most people have their own money and the poor always have jobs. MICHAELD \\nNorthern and North Central Idaho has the advantages of rural life but access to several larger communities in Oregon and Washington, just across the Idaho border in the Panhandle. The Lewiston/Clarkston area at the confluence of the Snake and Clearwater Rivers has a great climate (much warmer than the surrounding higher elevations) and access to any outdoor recreation you can think of. Coeur d’Alene and Post Falls are very close to Spokane. All have great medical facilities. \\nJobs are tough to come by, but self employment is a great option for anyone handy with tools. Lots of retired folk live here and they generally have resources to hire things done for them. Acreages are still cheap, too. BMOC \\nI live on South Beach. I can eat pole dancers and foreign tourists. And their children. My tinfoil hat will keep me from sunburn. I live near a pharmacy to supply me my Prozac. In case of riots I can club people on their heads with a Cuban sandwich to defend myself. If things get too bad here I can grab onto an old tire and float myself over to the Bahamas. Life will be OK. \\nIf you can’t leave your city, then the Urban Survival Guide shows you how to survive during a crisis, and protect yourself and your family. \\nDavid'"}, "time": 1742561791.167658}