{"duration": 0.04945564270019531, "input_args": {"text": "'Google has launched a new AI program called Perspective to detect “abusive” comments online in an effort to crack down on hate speech. [Publications such as The New York Times, The Guardian, and The Economist are testing the new software as a way of policing comments sections, according to the Financial Times.  “News organizations want to encourage engagement and discussion around their content, but find that sorting through millions of comments to find those that are trolling or abusive takes a lot of money, labour and time,” said Jared Cohen, president of Jigsaw, the Google social incubator that built the tool. “As a result, many sites have shut down comments altogether. But they tell us that isn’t the solution they want. ” Perspective is available to all publications that are currently part of Google’s Digital News Initiative, which includes The Guardian, the BBC and The Financial Times. In theory, the software could also be utilized by social media companies such as Facebook and Twitter. Twitter has recently attempted to impose stricter rules on users in an attempt to reduce supposed harassment on the platform. CJ Adams, a product manager at Jigsaw, discussed the adaptability of their program, saying, “We are open to working with anyone from small developers to the biggest platforms on the internet. We all have a shared interest and benefit from healthy online discussions. ” Perspective is used to filter and compile comments on websites for human review. In order to learn what exactly counts as a “toxic” comment, the program studied hundreds of thousands of user comments that had been deemed unacceptable by reviewers on websites like The New York Times and Wikipedia. “All of us are familiar with increased toxicity around comments in online conversations,” said Cohen. “People are leaving conversations because of this, and we want to empower publications to get those people back. ” Apparently Perspective cut the review time of comments on The New York Times in half, allowing reviewers to check twice as many comments thanks to Perspective’s comment filtering abilities. Speed is paramount to Paragon, Jigsaw’s Chief Research Scientist Lucas Dixon said: “Their goal is to be able to [improve] review speed by 10x, so the project is ongoing. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742561718.2676568}