{"duration": 0.03581547737121582, "input_args": {"text": "'ALERT – New Bill Clinton Mistress Confirmed, Hillary Camp Panics… Oct 28, 2016 Previous post The identity of one of Bill Clinton’s long-time mistresses was just revealed. The former president’s Secret Service detail nicknamed the mistress “Energizer” because of the way Bill always “perked up” and seemed revitalized after her visits. Julie McMahon has been outed by the press as Bill Clinton’s “Energizer,” a tongue-in-cheek reference to the Energizer Bunny. This mother of three and socialite has publicly denied being one of Clinton’s lovers, but a plethora of purported evidence is now unfolding online in an effort to refute McMahon’s claims of innocence, as per Bizpac Review . McMahon reportedly lives just a few minutes away from Bill and Hillary Clinton’s home in New York, which is called Whitehaven. If the Clintons were Republicans, the liberal mainstream media would be calling them racists over the chosen name of their luxurious estate. Always, Julia McMahon would arrive at Whitehaven via SUV. She would only stay a few hours sometimes, but other times she would spend an entire week at the Clinton residence. Julia McMahon reportedly met both Bill and Hillary in 1998 when he was president. Although the Clinton campaign has tried to label McMahon a friend to both of the Clintons, she only visited or spent the night at the house when Hillary wasn’t home, the Daily Mail reports. Sometimes, McMahon allegedly arrived just mere minutes after the departure of the former first lady. The Secret Service agents on the Clinton Whitehaven detail were reportedly not ever privy to the woman’s name, but they were allegedly under strict orders not to approach or stop her when she arrived. Every member of a president’s family is protected by a Secret Service detail. The Secret Service reportedly uses the same letter to assign a codename to protectees. Bill Clinton’s Secret Service name is reportedly “Eagle” and Hillary’s is “Evergreen.” The Secret Service may have run out of “E” codenames over the years thanks to all of Bill’s lady friends. Author Ron Kessler revealed the name of the Energizer mistress in his new book, The First Family Detail: Secret'"}, "time": 1742564219.59389}