{"duration": 0.09265875816345215, "input_args": {"text": "'Democrats in Congress are fuming at independent Vermont Senator Bernie Sanders for injecting himself into the race for the next Democrat Party Chairman, with many wondering why he deserves a say at all since he won’t join the Democrat Party. [The   Democrat candidate for president has been solidly behind Minnesota Congressman and Muslim Keith Ellison, but recently a swell of support for former Obama Labor Secretary Tom Perez has been seen among many Democrats turned off by Ellison’s laudatory comments about Nation of Islam leader Louis Farrakhan. One of Perez’ newest and biggest supporters is no less than from former Vice President Joe Biden.  This week Biden came out with a formal endorsement of Perez, giving the former Obama appointee his biggest boost yet in the hunt for the Chairmanship of the Democrat National Committee. But in a February 1 Facebook post, Sanders slammed Biden and his endorsement saying it is only another example of the “failed   approach” to lead the party. “Joe Biden is a friend of mine and I have a lot of respect for Tom Perez. In terms of the next chair of the DNC, however, the question is simple,” Sanders wrote in his post. “Do we stay with a failed   approach or do we go forward with a fundamental restructuring of the Democratic Party? I say we go forward and create a grassroots party which speaks for working people and is prepared to stand up to the top 1 percent. That’s why we have to support Keith Ellison. ” Sanders’ divisive approach runs contrary to his own candidate’s claims to want to bring the Democrat Party together. But many Democrats are even wondering why Sanders thinks he has a say in the matter since he has steadfastly refused to even join the Democrat Party in the first place. Texas Democratic chairman Gilberto Hinojosa, for instance, said Sanders’ meddling was “very concerning,” The Hill reported. “It is very concerning that Bernie Sanders is so intent on taking over a party that he’s not even a member of  —   that he’d insult the beloved vice president  —   and really the president  —   about a failed status quo approach,” Hinojosa said. The Texan went on to wonder why Sanders should even be concerning himself with the race for party chair. “This is coming from a man who is not even a member of our party,” Hinojosa said. “We lost an election and all of a sudden we’re all a part of a failed status quo? When he puts Joe Biden and Tom Perez in this category and paints with a broad brush he insults all of us. This is an election between loyal, qualified Democrats who love our party and the country. There’s no need for him to lower himself to that level. ” Democrat strategist Jamal Simmons agreed, according to the paper. “He doesn’t get to set the standard for a party he’s not a member of,” Simmons said. DNC vice chairman R. T. Rybak also questioned Sanders’ rhetoric, saying that the next party chairman needs to be “looking forward, not back. ” Other Democrats lashed out at Sanders for his “egoism” and for attempting to open up old primary wounds. One Clinton ally reportedly griped, “He’s opening these old wounds and it looks to me also like his ego is at play. Perez and Ellison are cut from the same progressive cloth. Either one would be a strong leader. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563826.8503425}