{"duration": 0.0341646671295166, "input_args": {"text": "'China’s highest ranking prelate, Cardinal Joseph Zen, is urging Pope Francis not to cut a deal with the Chinese government that would undermine the sacrifice and fidelity of members of the underground Catholic Church in the country. [“We are very much worried because it seems that the Vatican is going to make a very bad agreement with China,” Cardinal Zen told LifeSiteNews in an interview published Tuesday.  Zen said that Pope Francis “is really naïve” and “doesn’t know the Chinese communists. ” Moreover, “the people around him are not good at all. They have very wrong ideas. And I’m afraid that they may sell out our underground Church,” Zen added. In past months, the Vatican has been engaged in talks with leaders of China’s Communist Party in an effort to establish diplomatic ties with the country. Critics suggest that if the deal happens, the Vatican would likely have to give up its existing ties with the government in Taiwan, which currently only has official ties with a few small, mostly poor countries. The deal being discussed would reportedly hand over a certain amount of   power to the Chinese government regarding the naming of new bishops. The government would propose candidates and the Pope would choose from among the clergy vetted by the communists. Priests and bishops in the underground church have faced imprisonment for their fidelity to the Holy See, rather than submitting to the “patriotic” church under the control of the Communist government. Zen, the Bishop Emeritus of Hong Kong, said that China’s communist rulers want “total surrender” from the Church. In an apparent move to placate Chinese leadership, Pope Francis recently defended the practice of religious liberty in the officially atheist country, insisting that in China churches are full and religion is freely practiced. In a lengthy interview with the Spanish daily El País, the Pope said he would love to visit China “as soon as they invite me,” something he says he has made clear to Chinese authorities. Francis said that the Vatican is engaged in ongoing dialogue with China and that a commission has been set up that meets every three months, with Beijing and the Vatican alternating as hosts of the encounter. “China always has this aura of mystery about it that is fascinating,” Francis said, noting that not long ago the Vatican Museums held an exhibition in Beijing and that China would be reciprocating with an exhibit to be housed at the Vatican. “In China the churches are full,” Francis insisted. “You can practice your faith in China. ” Cardinal Zen has said that diplomatic relations with China are not worth selling out the underground Church which has suffered for decades because of its fidelity to Rome. In Zen’s mind, the proposed deal would betray what the Church holds most dear. “You cannot go into negotiations with the mentality ‘we want to sign an agreement at any cost’ then you are surrendering yourself, you are betraying yourself, you are betraying Jesus Christ,” Zen said. The Cardinal also said that a Vatican deal with the Chinese government would undermine the Church’s credibility and set a bad precedent for dealing with other countries as well. According to Zen, some officials of the Holy See consider the underground faithful to be “troublemakers. ” Although he has met with the Pope to explain the situation faced by Catholics in China, Zen isn’t confident that Francis will come to their aid. I’ve written many letters to the Pope, Zen said, but then “he doesn’t answer my letters. ” “The thing we can do is to pray,” said Zen. “We believe in the power of prayer. ” Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742628481.0362437}