{"duration": 0.23768234252929688, "input_args": {"text": "'by Yves Smith \\nBy John Light, a reporter and digital producer for the Moyers team. His work has appeared at The Atlantic, Grist, Mother Jones, Salon, Slate, Vox and Al Jazeera, and has been broadcast on Public Radio International. Follow him on Twitter at @LightTweeting.   Moyers & Company \\nThe Colorado oil and gas industry is poised to strike a devastating blow against anti-fracking activists Tuesday. Enactment of Amendment 71 , a statewide ballot initiative campaign that’s backed by the industry, will make it, in the words of the Denver Post’ s editorial board, “ nearly impossible ” for Colorado voters to amend their state constitution to allow for local fracking bans — or, for that matter, anything else. \\nIt’s a story worth telling in some detail, because it vividly illustrates the many obstacles well-connected and well-funded special interests can put in the way of citizens trying to oppose them. The latest battle in a multi-year campaign by a network of pro-fossil fuel groups to defend the fracking industry against local opponents, Amendment 71 would require 2 percent of registered voters in each of Colorado’s 35 state Senate districts to sign petitions for any future initiative before it could be put on the ballot. Right now, anyone who wishes to amend the state constitution must collect signatures from 5 percent of the number of voters who voted for secretary of state in the last election. \\nThat threshold is still not always easy for grass-roots groups to meet: Two green priorities — an amendment allowing for local bans on fracking and an amendment requiring fracking operations to be at least a half mile from homes or schools — failed to make the cut for this year’s ballot, according to the secretary of state. Disappointed environmentalists attribute that to a lack of time and resources, but also to a very well-financed campaign by the oil and gas industry. A report released by the watchdog group Public Citizen estimated that fossil fuel interests outspent anti-fracking activists by a factor of 24-to-1. \\nNonetheless, greens feel ballot measures are among the best options in their political toolbox in a state where well-heeled oil and gas interests have managed to convince both Democratic and Republican politicians that what’s good for their industry is good for the state’s economy. \\n“The political system in Colorado is really aligned with the oil and gas industry,” said Suzanne Spiegel, an organizer with Frack Free Colorado. She described the state’s Democratic governor, John Hickenlooper, as “incredibly supportive” of fossil fuel interests. A former oil and gas geologist, Hickenlooper touts the industry as crucial to the state economy. He once claimed to have joined Halliburton executives in drinking one of the company’s fracking fluids to demonstrate its safety. The governor’s office did not respond to a request for comment on this article. \\nFor groups like Spiegel’s, ballot initiatives provide an alternative to a political system they see as in the pocket of the fracking industry. “One of the great things about Colorado is that we currently have access to this channel of direct democracy,” Spiegel said. But, she added, a victory for Amendment 71 “would all but eliminate it.” \\nBoth liberal and conservative groups that rely on grass-roots organizing have united to oppose the measure. Oil and gas interests, meanwhile, have thrown in millions of dollars from their sophisticated political operations to make sure the amendment passes on Tuesday. \\nFossil Fuels’ Grip on Colorado \\nThe origins of the current political fight date back 2012, when the top two Colorado oil and gas companies, Anadarko and Noble Energy, geared up to challenge local opposition to fracking. Four Colorado towns were moving to ban fracking or place a moratorium on it. Longmont, Colorado had already succeeded in becoming the first town to do so earlier that year. \\nThe fracking boom had hit the state several years before, and some Coloradans were alarmed by the speed at which wells seemed to be multiplying. According to the federal Energy Information Administration , natural gas production doubled in the state between 2001 and 2015, and oil production doubled between 2012 and 2014. With that came a flood of political donations from the oil and gas industry to state and local officials. \\nBy 2014, when environmentalists began collecting signatures for two anti-fracking amendments (neither of which ultimately made it onto the ballot), the industry was fully mobilized. In addition to offering two pro-fracking ballot measures of their own, oil and gas interests set up a series of benignly named advocacy groups. Among these were Protecting Colorado’s Environment, Economy, and Energy Independence — often referred to as simply “Protect Colorado” — and Coloradans for Responsible Energy Development (CRED). \\nAccording to IRS filings (posted online here and here by Greenpeace), these two spent $27 million to promote the industry that year. A political strategist working with the groups, Mark Truax, attended a September 2015 meeting of the Interstate Oil and Gas Compact Commission (IOGCC), where industry executives, lobbyists and regulators from around the US gather to discuss strategy. Truax outlined the political groups’ efforts on behalf of the pro-fracking measures, including a sophisticated voter outreach organization, according to a transcript of the meeting published in Boulder Weekly and made from a recording obtained by Greenpeace researcher Jesse Coleman. \\nOn the recording, Truax touted the way the pro-oil and gas groups had targeted 3.9 million voters by demographic to win their sympathy toward fracking. He explained how the groups had built coalitions among businesses in the state and how the industry focused on electing pro-oil and gas city council members. \\nIndustry representatives also worked closely with the state regulator, the Colorado Oil and Gas Conservation Commission . The group’s director, Matt Lepore , was present at the IOGCC meeting where Truax discussed strategy, and emails obtained by Greenpeace’s Coleman through a Freedom of Information Act request show that Lepore and other regulatory officials met with CRED as the group was developing one of its outreach campaigns. \\n“As a public agency, we make ourselves available to any interested party that wants to learn more — or ask about specific issues — related to the COGCC’s work,” said Todd Hartman, a spokesperson for the Colorado Oil and Gas Conservation Commission, in a statement to BillMoyers.com. “As you might expect, we’d push back very hard” on the idea that the agency coordinates on communications efforts with the industry, he said, adding that COGCC meets monthly with a coalition of environmental groups. \\nAcademic Dispute \\nTo succeed, the oil and gas industry had to maintain the status quo. And in 2014, they did: No new towns passed fracking bans, and, as part of a compromise with Hickenlooper, environmentalists agreed to end their campaign to put anti-fracking ballot measures on the statewide ballot. As part of the compromise, however, Hickenlooper convened a task force to study ways in which Coloradans could have more input on fracking in their communities. Initially, fracking opponents were hopeful. “The governor’s announcement of the Oil and Gas Task Force is the first step forward in solving the problem of fracking occurring anywhere and everywhere,” said Rep. Jared Polis , a Democrat whose congressional district includes Boulder. \\nBut oil and gas interests already had been at work, commissioning researchers at the Leeds School of Business at the University of Colorado Boulder to work on a series of studies that supported industry talking points. One study, underwritten by an industry-funded group called the Common Sense Policy Roundtable , along with two other groups not affiliated with the industry, declared that a moratorium on fracking would hurt the state’s economy. Another, commissioned and funded by the American Petroleum Institute , demonstrated that fracking had a positive economic impact on Colorado communities. \\nThe reports got coverage in The Denver Post and The Colorado Springs Gazette , neither of which disclosed that the Common Sense Policy Roundtable was an industry group. When the relationship between the Leeds School researchers and the industry groups came to light, Bronson Hilliard, a spokesperson for the school at the time, told High Country News that the researchers didn’t know about the group’s funding. “CU-Boulder policy researchers are under no obligation to understand industry organizations’ financial ties or to report them,” he wrote in a statement . \\nBut emails between researchers and industry employees, obtained by Greenpeace and Boulder Weekly , appear to show that the industry weighed in as the study was being written, requesting revisions. “I hope this new version is in line with what you envisioned… We look forward to further feedback and comments,” one CU-Boulder researcher said in an email sharing his findings with an API adviser. The emails also suggest a hope that the research would play a role in influencing the governor’s task force. The task force’s legislative recommendations ultimately did little for activists who were seeking greater control of fracking in their own communities. \\nThe End of Local Control \\nThough the ballot measures that anti-fracking activists championed in 2014 and the governor’s subsequent task force ultimately failed, towns were having some success banning fracking. By 2015, five Colorado communities as well as Boulder County had voted to implement local bans or moratoria on drilling. These sorts of bans represent a rare area of agreement between Republican presidential nominee Donald Trump and Democratic presidential nominee Hillary Clinton: Both have spoken in favor of “local control” — the idea that communities should be able to decide whether or not to approve fracking. \\n“I’m in favor of fracking, but I think that voters should have a big say in it,” Trump told Denver television station KUSA . “I mean, there’s some areas, maybe, they don’t want to have fracking. And I think if the voters are voting for it, that’s up to them.” Clinton has made similar statements, and that panicked oil and gas lobbyists , because the idea of local control has been so potent. In addition to the Colorado communities, New York and Maryland have both banned fracking, as have five counties in California. \\nBut the Colorado communities’ bans were overturned this May when the state’s Supreme Court ruled that Colorado law does not allow for “local control.” \\nSo this year, anti-fracking activists wanted to put a new cause on the ballot: A “local control” amendment to the state constitution that would allow towns to ban fracking. National groups such as 350.org, Food and Water Watch and Greenpeace lined up behind local groups’ efforts to put the measure on the ballot, along with one that would have required fracking operations to be roughly half a mile from homes. \\nUltimately, however, Secretary of State Wayne Williams , a Republican, ruled that activists did not gather enough signatures to put these measures on the ballot. Activists handed in about 107,000 signatures — more than the 98,492 required. But Williams did not believe there were enough legitimate signatures to clear the bar. Advocates for the amendments decided they didn’t have the resources to challenge that decision. \\nThe industry had prepared for a long and hard fight, but by September, it was all over. So Noble Energy and Anadarko decided instead to pour their money into another initiative — one that would likely make it so they wouldn’t be fighting new activist ballot initiatives every year going forward. \\n“Raise the Bar” \\nAmendment 71 first surfaced as a campaign by business leaders and politicians called “Raise the Bar.” But the idea had its genesis at least a year ago. Greenpeace’s tapes of the September 2015 IOGCC meeting reveal a discussion about an initiative to change “the actual ballot process itself.” Mark Truax, the political strategist working with the oil- and gas-backed industry groups CRED and Protect Colorado, told the meeting participants, “We are in the process of evaluating that right now.” \\nColoradans have long complained their ballot is cluttered with proposed amendments and referenda that the average citizen cannot be expected to know anything about. The number of measures on the Colorado ballot is often quite large, creating a genuine frustration among voters. \\n“This is too much,” Seth Masket, a University of Denver political science professor and commentator, wrote in Pacific Standard last month , describing his four-page ballot that included 15 state and local initiatives. “There are some legitimately interesting ones, including an increase in the minimum wage, the creation of a new public health care system, and switching from a closed caucus to an open primary in presidential nominations. But is the ballot really the right place to hammer these things out? Do I and other Colorado voters have the necessary expertise to decide whether a substantial restructure of our public-health system will be in the state’s best interests?” \\nTo bolster its argument for Amendment 71, Protect Colorado, one of the industry groups, has noted that most signatures on the recent anti-fracking ballot initiatives did not come from the regions where fracking is most intense, and argued that more communities should be involved in deciding what goes on the ballot. \\nBut the big money behind the initiative is raising alarms beyond the environmental community. The Denver Post editorial board — a body that often writes in support of the oil and gas industry — recently published an editorial opposing Amendment 71 for that very reason. “The campaign and the cause are the antithesis of grass roots,” The Post wrote. “The real muscle behind Raise the Bar is coming from the oil and gas industry.” \\n“They have a really good shot of winning this thing, honestly,” said Frack Free Colorado’s Spiegel. “Their marketing is great around it. ‘Don’t make it so easy to change the constitution’ — people will get behind that if they don’t know where it’s coming from or why.” \\nActivists are already planning to run another ballot measure campaign to try and legalize fracking bans in 2018. “But if 71 gets adopted,” said Spiegel, “our job is going to be really hard.” 0 0 0 0 0 0'"}, "time": 1742563794.9524791}