{"duration": 0.06544256210327148, "input_args": {"text": "'Obama Votes Against US at UN October 27, 2016 Daniel Greenfield \\nObama\\'s abstention from a UN vote against the US is a new low for the most anti-American administration in American history. Under Obama, our foreign policy has been reoriented toward damaging our own interests as much as possible. But actively opposing US policy at the UN is a new low. \\nThe resolution A/RES/71/5 is on the \"Necessity of ending the economic, commercial and financial embargo imposed by the United States of America against Cuba\". \\nIt was introduced at the request of Cuba back in \\'91 with a memorandum that accused America of \"pursuing an aggressive policy against Cuba with the declared aim of imposing on it the political, social and economic order which the united States authorities consider most fitting. This policy has included direct military intervention, the threat of nuclear annihilation, the instigation and carrying out of countless acts of sabotage and plans to assassinate Cuban leaders.\" \\nAs Obama\\'s creepy toady Ben Rhodes tweeted, \"No reason to vote to defend a failed policy we oppose.\" \\nExcept the failed policy is that of the United States. By \"we\", Rhodes means that Obama and the left aren\\'t going to defend the United States in international forums when they disagree with the US. \\nAll this is yet another reminder that the people running the country are not of the country. They\\'re a hostile foreign ideology that sees itself as separate from the United States and does not believe it has any responsibilities toward the United States. \\nAt the UN, Samantha Power took the anti-American positions to applause from a UN united with Obama against America. \\n\"For more than 50 years, the United States had a policy aimed at isolating the government of Cuba. For roughly half of those years, UN Member States have voted overwhelmingly for a General Assembly resolution that condemns the U.S. embargo and calls for it to be ended. The United States has always voted against this resolution. Today the United States will abstain. [Applause.] Thank you. \" \\nThis is treason.'"}, "time": 1742561960.840146}