{"duration": 0.07776618003845215, "input_args": {"text": "'Report Copyright Violation If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. Somebody over there in Benghazi thought they didn\\'t have to listen to the Black President and wound up getting their asses smoked.YES Hillary and Obama had to go offline with a private email server to avoid the traitors and racetards within the Government intent on defying Obama as a weak black BOY.It is no secret that Obama approved weapons to Syria but he said no shoulder fired missiles and no artillery. If those \"Rebels\" had gotten their hands on Surface to air missiles the US would be in WWIII with Russia right now because their planes would be being shot down just like that Russian jet and Helicopter on the Turkish border last Summer. That was an American made missile and probably came through Benghazi.So Obama showed some people over there in Benghazi that when he gives an order it will be followed and the message was received.Obama also did a major purge of the entrenched racists and other incompetents in the higher ranks of the military after that. Anonymous Coward ( OP ) Re: If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. Yeah Bitch, Benghazi was a false Flag done on the anniversary of 9/11. Anonymous Coward Re: If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. $3.50 Report Copyright Violation Re: If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. Somebody over there in Benghazi thought they didn\\'t have to listen to the Black President and wound up getting their asses smoked.YES Hillary and Obama had to go offline with a private email server to avoid the traitors and racetards within the Government intent on defying Obama as a weak black BOY.It is no secret that Obama approved weapons to Syria but he said no shoulder fired missiles and no artillery. If those \"Rebels\" had gotten their hands on Surface to air missiles the US would be in WWIII with Russia right now because their planes would be being shot down just like that Russian jet and Helicopter on the Turkish border last Summer. That was an American made missile and probably came through Benghazi.So Obama showed some people over there in Benghazi that when he gives an order it will be followed and the message was received.Obama also did a major purge of the entrenched racists and other incompetents in the higher ranks of the military after that. Quoting: Be Glad U Had Obama 58059507 $3.50 Re: If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. mmm....noThe treacherous two were going against the will of the people AND Congress and were aiding the rebels by moving weapons into Syria through Libya. Congress and the people had said no to involvement in Syria but they did it anyway.THAT was the reason for the email server...that was the reason for the Benghazi attack. That was not a bunch of religious zealots that attacked the embassy...it was more than likely Syrian Special Forces that heard about the shipments and came to intervene.No way of knowing for sure...but THAT makes one hell of a lot more sense than any of the other stories \"I would rather be exposed to the inconveniences attending too much liberty than those attending too small a degree of it.\" Thomas JeffersonLiberty means personal responsibility...which is why most men hate it.2112 so people will finally understand the avatar... [ link to www.youtube.com (secure) ] Push back against the establisment Report Copyright Violation Re: If Hillary And Obama Didn\\'t Use email Server And Stop Benghazi Sending Shoulder Fired Missiles We\\'d Be In WWIII With Russia Right Now. Somebody over there in Benghazi thought they didn\\'t have to listen to the Black President and wound up getting their asses smoked.YES Hillary and Obama had to go offline with a private email server to avoid the traitors and racetards within the Government intent on defying Obama as a weak black BOY.It is no secret that Obama approved weapons to Syria but he said no shoulder fired missiles and no artillery. If those \"Rebels\" had gotten their hands on Surface to air missiles the US would be in WWIII with Russia right now because their planes would be being shot down just like that Russian jet and Helicopter on the Turkish border last Summer. That was an American made missile and probably came through Benghazi.So Obama showed some people over there in Benghazi that when he gives an order it will be followed and the message was received.Obama also did a major purge of the entrenched racists and other incompetents in the higher ranks of the military after that. Quoting: Be Glad U Had Obama 58059507 So this justifies the death of innocents? Also links and proofs for a hypothesis are generally the norm.#STABBITYLIVESMATTER GAME KNOWS GAME. DONT TRY IT.-Self Anonymous Coward'"}, "time": 1742561975.9799366}