{"duration": 0.11085820198059082, "input_args": {"text": "'Is there any merit in taking a cynical view of life? Are the observations of cynicism realistic, brave observations on human nature, freed from sentimentality, or are they only the somber commentary offered by one who is a loser at the game of life, taking solace in his weakness and failure? There are compelling arguments either way. What is not disputed, however, is that François de La Rouchefoucauld was one of the most brilliantly cynical epigrammers who ever lived.\\nIt probably did not help that he came from a long line of noblemen, for nothing so enfeebles the soul as much as inherited wealth and titles. He was born in 1613 and inherited the title of duke on the death of his father in 1650. Receiving the usual education of his class, he dabbled in military matters in his teens. Various itinerant love affairs followed with well-placed women, but some of these ended badly; we find him imprisoned in Bastille for a week in 1636 for political intrigue.\\n\\nAlthough married, he continued to pursue other women, as was the custom of the time and his station. Marriages in those days were business affairs to be ignored at each party’s pleasure or necessity; one such dalliance resulted in an illegitimate child, but the woman eventually rejected him for a more appealing competitor. In 1652 he found himself mixed up with a quasi-revolt called the Fronde, an adventure that left him with impaired sight when he was struck with a musket ball in the head. Health problems also intervened to add to his misery in the form of gout and melancholy.\\nIn late seventeenth century France, the Paris salons were centers of debate, discussion, and the flowering of controversial ideas. By now La Rochefoucauld had acquired an acrid talent for stinging prose, and he knew how to use it. His failures in love and war had primed his spirit for a cynical view of life, and this predilection meshed well with the taste of the salons for savage wit. Nothing is so shallow as sophistication.\\nFrom his frequent visits to the salon of Mme. de Sable in Paris, he had begun to piece together a body of epigrams that represented his worldview. One of his peers had more commercial goals in mind, for a bootleg collection of 189 of his sayings was first published without his permission (and with no attribution) in 1663. Two years later he finally put out a proper edition; this contained 317 maxims. The volume was titled Sentences et maximes morales , but this is usually shortened to Maxims. \\nThere is a philosophy here. It centers around the idea that all men are self-seeking egoists to a fault; any “virtue” a man displays is only a smokescreen concealing his self-love: “Our virtues are only vices in disguise.” Human vanity takes precedence over nearly all else: “Virtues are lost in self-interest, as rivers are in the sea.” Even the nobler emotions like love and altruism, according to La Rochefoucauld, are only a “kind of traffic in which self-love ever proposes to be the gainer.” He took a dim view of women, finding them fit only for love (for men such as himself, of course) and procreation. One of his crueler maxims was “few women’s worth lasts longer than their beauty.”\\n\\nBut life’s realities eventually caught up with him, softening his rougher edges. His wife, who had cared for him in his infirmities for eighteen years, died in 1670; his mother’s death followed two years later. Two of his sons would eventually die of injuries received in France’s ruinous wars of the period.\\nThis gloomy picture was brightened by the entry into his life of the Mme. de La Fayette, who was twenty years his junior. She invited him to stay with her in Paris, and he was carried there with difficulty. She seems to have viewed him as a reform project; she would later say that “He gave me understanding, but I reformed his heart.” Perhaps his fame made him an interesting captive. The union worked, and seemed to alleviate his dark picture of humanity; and when his final hours came, he asked for, and received, the last rites of the Church in 1680.\\nA fair assessment of La Rochefoucauld must take into account his undeniable wit, his probing sensitivity, and his ability to strip away the pretenses behind many human actions. Yet all in all, his maxims are meager in result. Many of them are superficial and shallow, the product of a personality still nursing the wounds of an early disillusionment. We weary of his aphorisms after two or three pages, and hesitate to reopen his book later.\\nWorse still, he was wrong to say that virtue and altruism are shams. Nothing is more vital to life, and we can see them around us every day, if only we know where to look, and as long as our senses are not blinded by fear. Timor animi auribus officit , as Sallust says: fear blocks out the ears.\\n\\nAny bitter weakling can be a cynic, but it takes depth of character to accept the world’s—and man’s—faults and foibles, and to balance those against man’s unquestioned capacity for greatness of soul. Broader life experiences might have corrected La Rochefoucauld’s errors, but he preferred to remain in a state of arrested development while receiving the applause and notoriety of Paris society. His maxims can bring smiles to our faces, as it is easy to find amusement in the flaws of others; yet we forget that his barbs were directed at us as well.\\nMontaigne was far wiser, for he took a balanced view of life, accepting the world’s absurdities and joys with the equanimity and calm resolution of a Greek or Roman sage. He was also a better man. La Rochefoucauld was intelligent without being wise, and never found the confidence in himself to submit his ego to the consolatory power of a higher philosophical authority in any form. Cynicism, in the end, strips a man of his most important protective armor, and leaves him naked to face the cruelties of life. No cynic ever died a happy man.\\nRead More: 7 Tips On How To Get Into The Best Shape Of Your Life \\n'"}, "time": 1742562317.8779082}