{"duration": 0.07921171188354492, "input_args": {"text": "'SANTA MONICA  —   The coastal town known affectionately  —   or pejoratively  —   as the People’s Republic of Santa Monica has decided to cut ties with Wells Fargo bank over its involvement in the Dakota Access pipeline, LAist. com reports. [The pipeline was the target of protests earlier this winter, when   group camped out in the cold to obstruct construction at the site. Protesters claimed that the pipeline disturbed Native American sites and posed an environmental risk.  In a an article favorable to the protesters, the Santa Monica Daily Press noted: Native Americans who live on the Standing Rock Sioux Reservation say the pipeline threatens their sacred lands and water supply.   …     The motion for Santa Monica to change banks came from Councilmembers Tony Vazquez and Terry O’Day. “If you’re paying any attention to national media today or in fact global, you know one of the most symbolic fights for our future is happening at Standing Rock over the Dakota Access Pipeline,” O’Day said. “It is a fight over sovereignty and respect for native people. It is a fight over the respect of humanity and the future of humanity. ” The article did not note that the pipeline does not, in fact, cross Native American land, and that other pipelines already cross underneath the water sources supposedly threatened by the pipeline’s slated route. Santa Monica currently uses Wells Fargo to handle some $1 billion in city transactions. The bank has also contributed nearly $1 million to local   LAist. com notes. In one of his final acts as president, Barack Obama halted the construction of the pipeline. President Donald Trump signed an executive order resuming construction in his first week in office. Other   cities have similarly cut ties with Wells Fargo over the pipeline. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563117.719047}