{"duration": 0.08333015441894531, "input_args": {"text": "'We Are Change \\nWikileaks has been leaking more emails then we can keep up with but two of the biggest bombshells recently released by the international whistle-blower organization are that the Department of Justice and State Department were in collusion with the Clinton campaign.\\nThe emails show Clinton campaign manager John Podesta being warned by Department Of Justice Assistant Secretary General Peter Kadzik from a non-government email address about Hillary’s investigation.\\nKadzik wrote to Podesta with the subject line “heads up,” tipping him off to the investigation into Hillary Clinton on Benghazi.\\n“There is a HJC oversight hearing today where the head of our Civil Division will testify. Likely to get questions on State Department emails. Another filing in the FOIA case went in last night or will go in this am that indicates it will be awhile (2016) before the State Department posts the emails,” Kadzik wrote.\\nPeter Kadzik is also in charge of investigating Huma Abedin’s emails. Kadzik was also an attorney for John Podesta and in Podesta’s own words he was a “ fantastic lawyer” who “kept me out of jail.” \\nIn another bombshell, Podesta made false statements to a grand jury during the investigation into the Monica Lewinsky trial, which Podesta himself summarizes in another leaked email. \\nA further revelations about Kadzik is the fact that Peter Kadzik represented Marc Rich as his attorney – the same Marc Rich that Bill Clinton controversially pardoned and the FBI released it’s investigation files into on Monday.\\nIf that’s not enough Kadzik’s son tried to get a job working for the Clinton campaign . Then there is the fact that Kadzik had multiple dinners with Podesta during the email investigation .\\nThese are obvious conflicts of interest here and one that needs to be brought forward.\\nIn another example of collusion between the Clinton campaign and the government’s investigation of it’s candidate Hillary Clinton, it’s been revealed that FBI deputy director Andrew McCabe’s wife received $675,000 in political donations from Clinton campaign surrogate Terry McAuliffe’s PAC and the Democratic Party of Virginia.\\n\\nTerry McAuliffe was the person that enabled the FBI to open an investigation into the Clinton Foundation when Terry McAuliffe himself was investigated for corruption .\\nOther Wikileaks emails show collusion between officials in the U.S. State Department. Two recently leaked emails show that not only was Clinton’s campaign tipped off by a DOJ insider but the U.S. State Department colluded with the New York Times the day prior to announcing Hillary’s private server.\\nLauren Hickey told Clinton aides that then-State Department spokeswoman Jen Psaki “just cleared” a statement to a New York Times reporter. \\n“Hi guys – Jen just cleared. She made the highlighted change — just rephrased a line about NARA updates state is undertaking. Yes on your point re records – done below. And yes will let you know — should be in the new few minutes.” – Lauren Hickey.\\nAdditionally an email from Brian Fallon, Clinton’s press secretary who used to be the DOJ’s director of public affairs until joining Clinton’s campaign in April 2015, highlights that Fallon was being leaked information from the DOJ on Hillary Clinton’s investigation in the early stages of a status hearing. So what makes you think he didn’t get further information? To add to that, again a private non-government email was used to relay this information to Podesta and the rest of the campaign.\\n\\n“DOJ folks inform me there is a status hearing in this case this morning, so we could have a window into the judge’s thinking about this proposed production schedule as quickly as today.”\\n– Brian Fallon.\\n\\nWhat more will be revealed about the inner workings of Clinton’s campaign and the investigation into Hillary Clinton’s private server? Stay tuned to We Are Change.\\nThe post WIKILEAKS: Emails Show Clinton Collusion Between State Department And DOJ appeared first on We Are Change .\\n'"}, "time": 1742562769.4012122}