{"duration": 0.06317663192749023, "input_args": {"text": "'Keywords: food packaging , packaging \\nOne of the major reasons why lots of people choose organic foods is to avoid exposure to chemicals. However, most of these organic foods, such as beans , often come in packaging which, if not done well, there are lots of chemicals present that can greatly interfere with the normal physiology especially if there is a wrong choice of packaging company. \\nVarious types of food packaging can possibly leach compounds into your food. Investigate your packaging, kitchen, and you’ll observe a lot of materials to be concerned about. Regardless of the possibility that you’re for the most part a “real food” type of individual, you presumably have canned merchandise, oats, pasta’s, and granola bars packaged in plastic bags, plastic wrap and plastic storage in your washroom. \\nMost by far of food and refreshment cans which seem, by all accounts, to be made of metals like steel and aluminum in reality are lined with BPA, BPS or “deplorable substitutes” like polyvinyl chloride (PVC), which contains the known cancer-causing agent vinyl chloride. Your canned soup, soda, significantly seltzer or juices are likely exposing you to BPA and different compounds you’re in an ideal situation not ingesting. \\nEven packaging made of evidently amiable paper might be lined with chemicals of concern like PFASs, which can be found in pizza boxes and the wrapping of slick takeout food. Extra chemicals from flame retardants to BPA have worked their way into our paper packaging as laudable efforts to recycle paper have presented a variety of different contaminants. \\nThe Environmental Working Group (EWG) has added yet another database to its arsenal of chemical data for consumers, permitting the individuals who need to avoid exposure to toxins to check for BPA in their food packaging. They built up the database since they contend that “Consumers have a right to recognize what’s in their food – particularly with regards to an ingredient, for example, BPA, that has been linked to cancer, infertility, mind, nervous system and cardiovascular abnormalities, diabetes, obesity and different genuine disorders. There’s no simple route for your average consumer to discover what their food is stuffed in, and little research demonstrating the amount of these chemicals migrate into our food. \\nA whole-food, unpackaged eating regimen is your best safeguard against the chemicals in packaging. Also, it is very important to check the reputation of the packaging company and if they are positively or negatively rated. Since there are such a large number of unknowns with regards to packaging, your most solid option is to avoid it when conceivable. Proper packaging is can go a long way in ensuring that you retain the health of your body. \\nOne of the key things in making the packaging safe is by entrusting a packaging company that knows the importance of eliminating all chemicals in the food stuffs. There are packaging companies that are more careful when dealing with food. Packaging your foods wrongly and without proper care can not only pose a risk in your health, but it can ruin your name as the packaging company. Below are some of the ways that you can drastically reduce the harm that may arise during the food packaging. At the point when conceivable avoid canned foods and beverages, plastic wrap, and plastic bottles. Instead, pick a glass when you can, and cook beans yourself but if you must buy, look out for the reputable packaging companies. Accomplish your very own greater amount food preservation to lessen your exposure to packaging chemicals. Have a go at dehydrating some of your garden’s harvest and storing it in glass containers. Avoid putting hot food in plastic storage containers or heating foods packaged in plastic in the microwave. Plastics are significantly more inclined to leach chemicals when heated. Experts recommend keeping plastics out of the dishwasher too. \\nBy following the above measures, it can go a very long way in ensuring that you do not consume chemicals that are risky to your health. \\nAuthor Bio: Karen Cole is Freelance writer in Health & Beauty niche. She is currently doing research about food packaging and www.allinpackaging.co.uk is helping her a lot in completing the research. Hope you all like this post. You might also like…'"}, "time": 1742563278.2903757}