{"duration": 0.07111811637878418, "input_args": {"text": "'Share on Facebook Share on Twitter This is something I have always had a bit of a hard time with growing up. Seeing what success means to the world and how it has been defined as having money, a good job, working hard, sacrificing etc. Sure this may only be the western world, but that’s where I grew up so that’s what I was exposed to. If I grew up somewhere else maybe it would have been different. I’m sure people don’t even think of the word success or put any particular meaning to it in some places. advertisement - learn more It wasn’t until I really began to see through the whole idea of success as I got into my later teens that I realized we are all chasing a common dream. Something that has been defined for us. It’s not even something we feel passionate about inside or that we absolutely love doing that will lead us to success. It’s simply that we are chasing an idea of what success is. I saw this picture recently and it made me laugh. Mainly because it’s soo true. Have a look below.Here you got this one “unsuccessful” guy on the bottom, who’s just having a nice stroll, crisp smile going on, real nice strut and then you got this “successful” guy above who’s sitting in traffic yelling on his cell phone or to the driver in front of him. The truth is, when we see these two scenarios we often think that someone who just strolls through life, takes it slow, doesn’t go hard at chasing money is not as successful as someone who is wearing a suit, has nice things, is working to get to the top of their company and who may be rich. You literally hear this stuff all the time. It’s all just an illusion of success. But ask yourself the questions: does it really feel resonant inside to chase money? To do what you don’t want to be doing simply to be considered successful? To have to sacrifice and slave for more toys? How about being in competition with everyone so you can get ahead? Wouldn’t you rather live in and experience a world where you could just do what it is you felt inspired to do the most? And then be able to change at any point the moment you wish to experience something new? The truth is, success is literally everything we are doing. No matter what situation you are in, what circumstance you are experiencing, you were successful at creating that. We don’t need to judge any experience as being more successful than the other because we are here to experience! We are here to have a variety of dynamic experiences that give us different circumstances and we are choosing all of them. advertisement - learn more We are all successful, plain a simple. And it’s not even that we need to be or need to focus on success. It’s simply that we don’t need to chase it or define ourselves by it. We simply do what we feel inspired to do and all we need will come from choosing to experience in that manner. Much Love \\nThe Sacred Science follows eight people from around the world, with varying physical and psychological illnesses, as they embark on a one-month healing journey into the heart of the Amazon jungle. \\nYou can watch this documentary film FREE for 10 days by clicking here. \\n\"If “Survivor” was actually real and had stakes worth caring about, it would be what happens here, and “The Sacred Science” hopefully is merely one in a long line of exciting endeavors from this group.\" - Billy Okeefe, McClatchy Tribune'"}, "time": 1742563594.6281035}