{"duration": 0.10527300834655762, "input_args": {"text": "'Now that Joaquín Guzmán Loera, the crime lord known as El Chapo, has been extradited from Mexico and has pleaded not guilty in Brooklyn to charges of running the planet’s biggest drug empire, his prosecution will enter a crucial phase  —   provided, of course, he does not manage to tunnel free from the   jail in Manhattan where he is being held. Two chief questions will define what comes next: Will Mr. Guzmán decide to go to trial? And if he does, what sort of defense will he mount to counter what appears to be a Matterhorn of evidence against him? When Robert L. Capers, the United States attorney in Brooklyn, outlined the government’s case against Mr. Guzmán at a news conference on Friday, he seemed unable to disguise a sly smile of satisfaction. After all, that morning, Mr. Capers’s office had filed a memorandum that set forth in exhaustive detail the cinematic story of Mr. Guzmán’s rise from a teenage marijuana farmer to an international kingpin who armed himself with a diamond encrusted pistol. It further noted that dozens of witnesses were lined up to testify and corroborate what prosecutors described as extensive secret recordings in which Mr. Guzmán discussed drug transactions. Several lawyers who have represented drug lords in the past said that the aggressive tenor of the memo suggested that, at least for now, federal prosecutors were serious about trying Mr. Guzmán and were unlikely to offer him a deal to plead guilty to lesser charges. Mr. Guzmán, moreover, is facing life in prison on a sweeping count of running a continuing criminal enterprise. So there was no real downside, the lawyers said, for him to fight the government’s case. “The government has made it clear that they’re going full bore with this,” said David O. Markus, who negotiated the 2006 guilty pleas for Gilberto and Miguel Rodríguez Orejuela, Colombian brothers who helped found the Cali cartel. “For El Chapo, if there’s no offer on the table and it’s life if you go to trial and life or near it if you plead guilty, it’s pretty easy  —   he’ll go to trial. ” Before Mr. Guzmán has to make that decision, however, a number of complicated issues are certain to arise. Given that he has been indicted not only in Brooklyn, but also in six other federal districts, his legal team is likely to question whether he is being prosecuted in the appropriate jurisdiction. They could also attack the manner in which he was sent to New York, some lawyers said, casting doubt on whether he was properly extradited. Then there is the question of his hiring a private lawyer. For the moment, Mr. Guzmán is being represented by two seasoned public defenders, Michael Schneider and Michelle Gelernt. While there is a   narco bar of lawyers, mainly in Florida and Texas, who regularly handle cartel cases, many of them are already representing people who may appear as witnesses at Mr. Guzmán’s trial. Further complicating matters, the federal government has said that it wants to seize $14 billion in profits that Mr. Guzmán was said to have made while running the Sinaloa cartel, leaving his financial situation unclear. “Many good criminal defense lawyers may shy away from the case not only because of the conduct that’s been charged, but because it’s hard to get paid if the government argues that all his money is   tainted,” said Benjamin Brafman, one of New York City’s top defense lawyers. But if Mr. Guzmán does end up before a jury, Mr. Brafman and other lawyers said that he could borrow a tactic from the manifold Mafia trials that have taken place in Brooklyn and defend himself by attacking the credibility of the government’s witnesses. According to the prosecution’s memo, “a large coterie of cooperating witnesses”  —   among them, Colombian cartel members, Mexican couriers and United   distributors  —   is ready to testify about every aspect of Mr. Guzmán’s organization, including bribes paid to politicians and murders of rival drug dealers and government and law enforcement officials. “It’s inconceivable to me that these people don’t have baggage of their own,” Mr. Brafman said, “if, indeed, they were involved in the organization for a long time. ” The case of Vicente Zambada Niebla, the son of Ismael Zambada García, who long served as Mr. Guzmán’s top lieutenant in the Sinaloa cartel, offers another possible avenue of defense. Mr. Zambada was arrested by the Mexican authorities in 2009 and extradited to Chicago, where he was poised to stand trial as the cartel’s chief logistics officer for importing drugs into that city. But a few years into the case his lawyers suddenly claimed that he could not be prosecuted in the United States because he had been secretly working as an informant for the Drug Enforcement Administration. Though the government subsequently acknowledged that D. E. A. agents had in fact met with Mr. Zambada, it denied that it had engaged with him in any quid pro quo. Nonetheless, in 2014, the D. E. A. announced that Mr. Zambada would not stand trial because he had pleaded guilty to trafficking charges and was working as a government informant. The possibility that Mr. Guzmán might also become an informant is a complicated one. Some lawyers said that because he was accused in court papers of kidnapping, torture and causing the deaths of thousands of people, it would be hard to imagine the government allowing him to cooperate  —   unless, perhaps, he had reliable and damning information on   Mexican officials. Others said they found that prospect dubious because of Mr. Guzmán’s reputation as a Robin   hero in his homeland. “He has this mythic legacy behind him,” said W. Rob Heroy, a lawyer for Carlos Ramon   a Mexican who pleaded guilty in 2014 to producing and distributing heroin in the United States, much of it in and around Charlotte, N. C. “Maybe the government would want him as an informant, but I just can’t see El Chapo getting done with all of that and then going to work at a Cinnabon in Omaha. ”'"}, "time": 1742563670.0614803}