{"duration": 0.1267378330230713, "input_args": {"text": "'Hillary Will “FIX” Obama’s Failed Economy by RECYCLING His FAILED POLICIES Hillary Will “FIX” Obama’s Failed Economy by RECYCLING His FAILED POLICIES Politics By Amy Moreno October 27, 2016 \\nHillary can’t admit to the American people how BAD the Obama economy is. \\nShe has to “tip toe” around it so she doesn’t offend Mr. Thin-Skin. \\nAlthough, it doesn’t matter much what Hillary says because she has no idea how to fix it. \\nHer plan is to recycle his failed policies as “new failed policies” and round and round we go. \\nFrom Investors.com \\nElection 2016: If you want to know how bankrupt the Democratic Party is today of pro-growth ideas, check out Hillary Clinton’s latest speech on the economy. She has absolutely nothing new to offer that President Obama hasn’t already tried. \\nClinton admits in her speech that things aren’t all they should be in the economy after seven-plus year of Obamanomics. “The challenges we face are significant,” she said. She even took a couple subtle digs at Obama, complaining about “long-term neglect” of poor communities and the fact that the unemployment gap between blacks and whites has been widening, whereas it was narrowing when her husband was in the White House. \\nSo what are the “big, bold” ideas she said she’d implement that will “drive growth”? Spend more money on infrastructure, raise taxes on the rich, impose more mandates on businesses that raise the cost of labor, make college cheaper and saddle the economy with more regulations. \\nIs Clinton really not aware that this is exactly what Obama prescribed, and that his policies have produced the worst economic recovery in history? \\nHer biggest idea is to make “the biggest investment in American infrastructure in decades,” saying that will create “millions of good paying jobs.” \\nApparently she’s forgotten that Obama’s stimulus plan included, as Obama put it, “the largest new investment in our nation’s infrastructure since Eisenhower built an interstate highway system in the 1950s.” \\nHow did that work out for jobs? We’ve had one of the slowest rates of job growth since the Great Depression, and annual economic growth never topped 3%. Oh, and according to Hillary, our roads and bridges are still crumbling. \\nClinton also says she wants to invest in “advanced manufacturing.” But Obama has already nearly doubled spending on this — as part of his plan to create a million manufacturing jobs in his second term. (Manufacturing jobs have climbed only 330,000 since he made that promise.) \\nOther “bold” Clinton ideas are also straight out of the Obama playbook: She wants a “cleaner, more resilient power grid,” free child care, paid maternity leave, more power to unions. She wants to expand on the growth-killing Dodd-Frank bill. \\nPlus, of course, she wants to raise taxes on the rich, as if Obama hasn’t already done that several times. \\nWhat’s most amusing about Clinton’s speech, however, is her claim that cutting taxes and reducing regulations as a growth strategy “has been proven wrong again and again.” \\nIn fact, the strongest periods of growth in the past three decades occurred during the tax-cutting, deregulating Reagan years, and after Bill Clinton agreed to cut taxes and deregulate the banking industry. In the 1960s, it was the result of Kennedy cut taxes. \\nThe inconvenient truth here is that not one of the items on Clinton’s list will do anything to get the economy out of its Obama-induced malaise. This is a movement – we are the political OUTSIDERS fighting against the ESTABLISHMENT! Join the resistance and help us fight to put America First ! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742563566.6469066}