{"duration": 0.015816926956176758, "input_args": {"text": "'The Washington Post released the latest salvo in the media’s effort to take down President Donald Trump on Wednesday: a joke made last year by House Majority Leader Kevin McCarthy ( ) suggesting that Russian President Vladimir Putin pays Trump. [The joke occurred during a private conversation involving the House Republican leadership. The conversation was recorded. The exchange  —   from the transcript alone, since the Post has not made the audio available  —   is as follows:  McCarthy: The Russians hacked the DNC and got the opp [sic] research that they had on Trump. McCarthy: laughs, [Crosstalk] Ryan: The Russian’s [sic] hacked the DNC  …     McHenry:   …    to get oppo  …     Ryan:   …    on Trump and like delivered it to  …    to who? [Unintelligible] McCarthy: There’s  …    there’s two people, I think, Putin pays: Rohrabacher and Trump  …    [laughter]  …    swear to God. Ryan: This is an off the record  …    [laughter]  …    NO LEAKS  …    [laughter]  …    alright?! [Laughter] Ryan: This is how we know we’re a real family here. The full context of the conversation is unclear, but the House leadership appeared to be discussing the crisis in the Ukraine, and Russian efforts to spread disinformation there. The apparent target of the joke is Rep. Dana Rohrabacher ( ) whom the Post describes uncharitably as “a fervent defender of Putin and Russia. ” The Post‘s Adam Entous does not explain why he did not post the audio of the conversation, but two reasons seem possible: one, the laughter on the audio would underline the fact that McCarthy’s comments were intended to be humorous two, the volume of different voices might reveal who had made, and leaked, the recording. Though it is obvious from the transcript alone that the remark is a joke, the Post treats it as a serious scoop, claiming in the first paragraph that McCarthy “made a politically explosive assertion in a private conversation on Capitol Hill with his fellow GOP leaders. ” Later, the Post adds: “It is difficult to tell from the recording the extent to which the remarks were meant to be taken literally. ” No, it is not. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628545.9434125}