{"duration": 0.201979398727417, "input_args": {"text": "'ReadyNutrition Readers and fellow warriors in the war of sustainability, the election may have been finished, but the unrest is not. I mention “may” have been finished, as the electors of the Electoral Vote have not weighed in on their final verdict. That verdict, due on December 19 may even be amended or reversed, with the entire thing not coming before Congress until January 6. In the meantime, civil disorder is increasing throughout the U.S. in both frequency and locations.\\nAs of this writing, riots and unrest along with demonstrations have occurred in the following large metropolitan areas: Miami, Atlanta, Salt Lake City, New York City, Birmingham, AL, Chicago, Washington, D.C., Eugene, OR, Portland, OR, Indianapolis, Phoenix, Denver, Baltimore, Las Vegas, and Fresno, CA to name a few. These are no gangs of urchins around a burning barrel on a street corner: these riots and demonstrations are made up of thousands of angry protestors that have clashed both with Trump supporters and law enforcement, at times violently.\\nLaw enforcement officers reported that more than 25,000 marched from Union Square in Manhattan all the way to Trump tower in midtown. Protests and demonstrations were marked by frequent arrests and clashes with police. On 11/11/16, a man was shot with two suspects detained in Portland, OR, where the clashes are intensifying; the man was shot on Morrison Bridge and law enforcement has stated it is related to the election turmoil.\\nMichael Moore , left-wing radical filmmaker was also in New York in an attempt to personally confront Trump at his Trump tower on Saturday 11/12/16. He said the following: \\n“[Trump is an] illegitimate president and does not have the vote of the people.” \\nIn Washington, D.C. protestors blocked the Interstate 395 tunnel that leads to Capitol Hill for several hours. In Chicago thousands marched through the city streets and (what a coincidence) ended up in front of the hotel owned by Trump downtown. In Indianapolis, two police officers were injured by protestors who hit them with rocks. In Los Angeles the police estimated the protestors to be numbering more than 8,000 people.\\n\\nCredit: CNN Portland, OR placed a curfew in effect for minors in an effort to prevent kids from being beaten up or hurt in the middle of all of it. 10:15 pm is the curfew for those under 14 years of age, and midnight for everyone ages 14-17 years old. In Baltimore the protestors marched from the Washington Monument on Charles Street to the Inner Harbor. Police had to move two reporters from Fox news out of harm’s way when the protestors began throwing rocks and bottles and shouting insults. There were also thousands protesting in Baltimore on Thursday night after the Ravens-Browns football game, blocking traffic for several hours in all directions from the stadium.\\nOne of the interesting things to note is that in all of these cities, the placards of the protestors have many of the same motifs, and further: one type has “#notmypresident” printed on it. Perhaps some of you readers have seen this and can clarify what that means. The reason for the question is that the George Soros machine of destabilization so successfully employed in other countries, such as Ukraine, the former Yugoslavia (Croatia and Serbia, specifically), and Hungary…that machine is up and running in the United States. Paid protestors and other rabble rousers are being paid by Soros and bussed into the target cities to foment riot and dissent. This isn’t the first time Soros has funded riots on American soil and it won’t be the last.\\n\\nCredit: BET Many protestors in Baltimore held placards with “People’s Power Assembly 443.221.3775” on the front. This, too, bears the hint of more subversive efforts paid for by those behind the scenes wishing to take the country to the bottom. Where does all of this lead? Well for starters, keep in mind those two previous dates mentioned regarding the Electoral votes. In addition to this, there is a petition circulating calling for the electors to reverse their original votes with more than 2 million signatures.\\nAs if that isn’t enough, there are people openly calling on Twitter and Facebook for Trump to be “taken out,” in a myriad of violent manners. As mentioned in other articles, under the John Warner Defense Act of 2006, Obama has the ability to declare a “catastrophic emergency,” defined as one that interferes with (basically) any and every aspect of our society from government to finance. In the “interests of public safety” he can supplement that with Presidential Directive 51 (PD-51) and declare a state of martial law due to civil unrest. He can also call in foreign outsiders (such as the UN) to help him “reinstitute order under the law.”\\nWith that in mind, I wish to refer you to something worth considering. All News Pipeline had an article (a good one in itself…Stefan Stanford and Susan Duclos with ANP are top-notch reporters and writers) with a comment posted that in my opinion truly summarizes what is happening here in this post-election period. The comment can be found at www.allnewspipeline.com/Shocking_Maps_Show_Overthrow_of_America.php , when you scroll to the bottom after the article. Posted by Andrew Mali , here it is in its entirety and well worth some deep thought for all of us as preppers, patriots, and concerned citizens:\\n“I’m probably going to get a lot of hate for this, but I feel it needs to be said. There is no coincidence that Trump won by electoral vote and lost the popular vote. This whole thing is a setup, to cause mass anger across the country. Right now, the Left is throwing a fit because they think Trump will be the new president, while the Right is distracted by celebrating it. He won’t. It is in the works right now to reverse the decision when congress meets Jan 6 to approve the electoral votes (maybe even something before that). This means the violence could last until then. \\nThe purpose of this is to start a civil war that tears the country apart. What the elite gain from this is the ability to take control of the country by U.N. force, and to call our republic and constitution a failure. “Out of the ashes, the phoenix will rise.” A new country owned by the U.N. with a new government and leader. One does not simply walk into the National Archives and shred the constitution, therefore, we must tear down our country and way of life. This keeps the elites from putting their fingerprints on our demise. \\nShould we fail to kneel to their will and destroy ourselves, they will use Russia to destroy us so much that any survivors will be left begging the mercy of the U.N. to take them as refugees to a country that is controlled by the U.N. Now is not the time to be running off to fight a civil war, but is the time to be preparing, and praying that God confuses their plans.” \\nQuite a comment, and also spot-on. Bottom line: it’s going to get worse before it gets any better. You guys and gals need to stay on top of what is happening both nationwide and in your immediate locale. As one eye is on the news, the other needs to be on the preps. Bullets, beans, and Band-Aids are the rule of the day, with plenty of prayer around all of it…the truly indispensable part of your preparations.\\nObama still has plenty of time to either take down the society with civil unrest as an excuse or by starting a war before he leaves office. In either case (as the comment pointed out) we must remain vigilant and prepare for society as we know it to change with the blink of an eye. The next few weeks will be a good indicator of what is to happen. In the meantime, keep your powder dry, and keep up that good fight! JJ out! \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 14th, 2016 Sign of the Times: Riot Control Gear Sales Are Soaring… Emergency Survival Food Sales Soar as We Get Closer to… We Will Not Go Gently Into the Night: The Silent Majority… How Martial Law Will Lead to the Creation of the… Landing Strips, Farms and Hideaways: Secret Escapes of the… '"}, "time": 1742562116.1597896}