{"duration": 0.07050180435180664, "input_args": {"text": "'Cuban dissident leaders who protested President Barack Obama’s “normalization” concessions to the Castro regime are eagerly awaiting President Donald Trump’s anticipated rollback of these reforms, expecting Trump to be “fair to dissidents and the exile community. ”[Trump will arrive in Miami, the capital of America’s Cuban exile community, on Friday to issue an address on America’s diplomatic stance with Cuba. Reports suggest Trump will limit U. S. travel to the country and restrict the ability of    business interests to exploit the Cuban people in negotiations with the Castro regime.  Speaking to the Spanish newswire service EFE, Antonio Rodiles, the leader of the dissident group Estado de SATS, said he expected the Trump Cuba policy to “point in a different direction than what has happened, which has been concessions, concessions with nothing in return, and the result has been more repression and more control on behalf of the regime in Havana. ” Rodiles called Trump’s announcement, “without a doubt a positive step for us,” expressing confidence that Trump would make the respect for human rights on the island a key provision of any deal with dictator Raúl Castro. He particularly lauded reports that the Trump administration would make it more difficult for the Castro regime to benefit from American businesses. “It is tremendously contradictory that the armed forces are to receive most of the benefit of the new relationship with the United States, and at the same time are tasked with repressing those of us who defend human rights and liberties in the country,” he argued. Rodiles had called President Obama’s visit to the island in 2016 a “pat on the back” to the Castro regime and firmly opposed “normalization. ” Rodiles is not alone in his anticipation of the positive results of a Trump era policy that would undo the damage Obama’s “normalization” has caused. The head of the Patriotic Union of Cuba (UNPACU) dissident group, José Daniel Ferrer, wrote an open letter to President Trump this week urging an aggressive rejection of Obama’s policies. “It is the moment to revert as much as possible these policies that only benefit the Castro regime and do not [benefit] the oppressed people at all or very little,” he wrote. “It is time to impose strong sanctions on Raúl Castro’s regime, and on Nicolás Maduro’s,” he added, noting that the Cuban regime controls the highest levels of the socialist dictatorship in Venezuela and the freedom of one country is directly linked to the freedom of the other. “Due to its outstanding position in the free world, the United States should not remain indifferent before the crimes that both regimes commit against their people,” the letter continued. While noting that UNPACU initially supported the Obama “normalization” process, the letter concluded that the   implications of the policy, particularly the increase in human rights violations against dissidents, has forced them to rescind their support. Among the specific instances of this mentioned in the letter are “the tripling of the number of political prisoners on the island,” the beatings dissidents regularly receive from government agents, and robberies of dissident homes. A third prominent dissident, Agustín López Canino, told EFE, according to the U. S.  Martí news network, that he expects Trump to “be fair to dissidents and the exile community and condition the situation on human rights in Cuba, that facilitate a true presence of civil society” in the government. López Canino decried   Cuba as suffering under “ferocious capitalism,” where   corporations are getting rich without the existence of a truly free market. The Ladies in White  —   a Cuban dissident group consisting of wives, daughters, sisters, and mothers of political prisoners  —   have not explicitly weighed in on the new Trump policy. This week, however, they sent a letter to the European Union, signed by their leader Berta Soler, calling for Europe to cut the Cuban regime off economically. Soler writes that, in response to the EU seeking a bilateral economic agreement with the Castro regime, “far from changing its attitude and understanding these negotiations as the beginning of an agreement that would pull it towards becoming a part of the international democratic community, has taken it as a legitimization of its power and since then has acted with total impunity. ” The letter requests an EU resolution condemning the Castro regime and a firm stance in favor of respecting human rights on the island. The Ladies in White have received the EU’s Sakharov Prize for Human Rights Advocacy. Few details are currently public about the Trump Cuba policy scheduled for reveal Friday. On Tuesday, Secretary of State Rex Tillerson told the U. S. Senate that the policy would undo “concerning” moves by the Obama administration that had provided “financial aid” to the Castro regime. “We believe that we have achieved very little when it comes to changing the behavior of the regime and its treatment of the people, they have little incentive to change,” he said. Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742563661.0235212}