{"duration": 0.05048370361328125, "input_args": {"text": "'WASHINGTON  —   The Supreme Court on Tuesday weighed whether cities can sue banks under the Fair Housing Act for predatory lending, even if foreclosures that stem from such loans affect a city only indirectly. The case before the justices was brought by Miami after the 2008 financial crisis. The city said that discriminatory mortgage lending practices by Bank of America and Wells Fargo had led to a disproportionate number of defaults by minority home buyers and, in turn, to financial harm to the city. “We are aggrieved in every sense of the word by the discrimination that was propounded here,” said Robert S. Peck, a lawyer for the city. The justices appeared divided over whether Miami’s asserted injuries were enough to allow it to sue under the housing law. Justice Elena Kagan said the law was a “distinctive kind of   statute, which really is focusing on community harms. ” “Here the cities are standing up and saying, ‘Every time you do this redlining and this reverse redlining, essentially a community is becoming blighted.’ And who better than the city to recognize that interest and to assert it?” she asked. Chief Justice John G. Roberts Jr. appeared to disagree, telling Mr. Peck that the harms Miami claimed to have suffered were secondhand. “Your injuries are derivative of the injury to the homeowners who had the subprime mortgages and who suffered the foreclosure and so on,” the chief justice told him. “I understand your argument that you’re down the line, but I don’t see how you can say that your loss of property taxes is a direct injury. ” Justice Anthony M. Kennedy also appeared skeptical of aspects of the city’s arguments. “The statute doesn’t prohibit decreasing property tax values,” he said. Other justices worried that a ruling for Miami would allow all sorts of people and entities to sue for indirect harm from discriminatory practices. Justice Kagan asked about restaurants and dry cleaners, Justice Sonia Sotomayor about corner grocers and Justice Stephen G. Breyer about “a magazine that writes about successes in integration and wants to write about this community before it got wrecked or whatever. ” Curtis E. Gannon, a lawyer for the federal government arguing in support of the city, offered a limiting principle. He said people, businesses and local governments hurt by a decline in property values ought to be able to sue under the housing law. The law allows suits from “aggrieved persons. ” No one disputed that cities may sometimes count as persons in a legal sense, but Neal K. Katyal, a lawyer for the banks, said Miami was not aggrieved just because it asserted an indirect financial injury. He said the city had tried to piggyback on the borrowers’ interest in being free from discrimination and had “cut and paste” their grievances into its lawsuit. Miami’s asserted injuries were too remote, Mr. Katyal said, calling the city’s legal theory “  liability. ” “You have to have discriminatory loans,” he said. “Those discriminatory loans have to lead to defaults. The defaults have to lead to foreclosures. The foreclosures need to lead to increases in vacancies. The increase in vacancies needs to lead to reduction in property values. ” Mr. Peck, the city’s lawyer, said its harm was more direct. “The banks’ practice of providing minority borrowers with more expensive and riskier loans than they qualified for, or that nonminority borrowers received, actually frustrated and counteracted the city’s efforts on fair housing,” he said. The court heard a single hour of argument in two consolidated cases, Bank of America v. Miami, No.   and Wells Fargo v. Miami, No.  . A trial court dismissed the suits in 2014, saying the city had not demonstrated that its claims were covered by the housing law. The United States Court of Appeals for the 11th Circuit, in Atlanta, reversed those rulings last year, allowing the cases to proceed. The appeals court said it was enough for the city to contend that it had “suffered an economic injury resulting from a racially discriminatory housing policy. ” A   tie in the Supreme Court, which seemed a viable prospect on Tuesday, would leave the appeals court’s ruling in place, handing a victory to Miami but setting no national precedent.'"}, "time": 1742563168.744407}