{"duration": 0.061448097229003906, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) JoAnna Klein, a science writer, brings us today’s introduction. Earlier this month, the scientific journal Conservation Biology published a study that found that nearly half of the fish sampled at roughly 10 percent of Los Angeles sushi restaurants were not what they were purported to be on menus. In many cases fish were substituted with cheaper, more environmentally sustainable catches. But in some instances, replacement fish were actually endangered or threatened. Halibut and red snapper were found to be the most frequently misidentified. Between 2012 and 2014, researchers from the University of California, Los Angeles and Loyola Marymount University sent their students to 26 Los Angeles restaurants with various price points and high ratings on Yelp and Zagat. Their mission was simple: Order dishes containing each of nine targeted fish that are common on menus and often mislabeled confirm with the restaurant that the fish was what the menu said it was collect a piece of sushi about the size of a kernel of corn drop it in a labeled jar of ethanol and take it back to the lab for DNA analysis. Knowing rates of mislabeled fish is important, the authors say, because it threatens consumer health. It also threatens a marine ecosystem and the billion dollar fishing industry that depends on it. But studies in the past have been inconsistent in terms of seafood mislabeling rates. “We wanted to see why there is that huge level of variation,” said Demian Willette, a biologist who helped lead the study. So they did the same thing at the same place each year for four years. The students collected more than 350 samples over all. In every restaurant, there was at least one case of mislabeled fish. But the researchers say you can’t blame the restaurant in every case. Like their diners, and even their grocers, the restaurants were most likely victims of fish fraud. For consumers going forward, Mr. Willette suggested asking your waiter directly what you’re ordering. The Monterey Bay Aquarium’s Seafood Watch also offers resources and a phone app to help  . (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Are we at “peak millennial?” Why cities can’t assume more young people will live there. [The New York Times] • Gov. Jerry Brown declared a state of emergency after recent severe flooding. [Los Angeles Times] • California Republicans are demanding audits and hearings over the bullet train project. [San Francisco Chronicle] • President Trump’s abandoning of the   Partnership could leave Central Valley farmers hurting. [Fresno Bee] • Charlie Liteky, who received the Medal of Honor then later returned it in protest, died in San Francisco. He was 85. [The New York Times] • Lawyers are pushing an unexpected theory of how the Oakland warehouse fire started. [East Bay Times] • A proposal to ban the display of Vietnam’s flag on city poles has divided San Jose’s Vietnamese community. [The Mercury News] • Investors announced a plan to bring a Major League Soccer team to San Diego. [The Associated Press] •   are trying to commercialize A. I. music for everything from jingles to pop hits. [The New York Times] • Beyoncé’s mother resides in a home atop the Hollywood Hills surrounded by black contemporary art. [The New York Times] • Videos: How some Californians had fun during the weekend flooding. [Orange County Register] Under cover of darkness, a woman vandalized a mosque in Davis early Sunday. Caught on surveillance video, she draped bacon on a door handle and broke half a dozen window panes at the Islamic Center of Davis. Pork is forbidden under Islamic dietary laws. A hate crime inquiry was opened by the authorities in Davis, a college town known more for its   culture and farmers’ markets. Throughout the day Monday,   dropped by the mosque with flowers and messages of support. An online campaign raised nearly $20, 000 for repairs. Lynsie Mason, 23, a nearby resident, walked over with a box of doughnuts and a card. Mosque leaders said hate incidents were rare. Ahmed Ali, a postdoc in civil engineering at U. C. Davis, said he was less rattled by the vandalism than perplexed. “The motivation is unknown. Why?” he said. “I mean if she wants to steal something, that’s fine. She might be in need. ” He paused and then added, “It’s just hate. ” Before he was a photographer, Michael Zagaris was a law school dropout in the 1960s. He started dropping acid and hanging out at the Fillmore music club in San Francisco with a notion that he would write a book. Armed with a tape recorder and a camera, he interviewed the musicians who performed there. It was Eric Clapton who suggested to Mr. Zagaris that he should try to sell his pictures. And that’s the moment he found his calling  —   photographing rock ’n’ roll. As luck had it, San Francisco was assuming a central place in rock history at the time. Looking back, Mr. Zagaris said in an interview, “I was in Europe for the Renaissance. ” Late last year, he put out a new photography book, “Total Excess,” with images of the Rolling Stones, Led Zeppelin, the Grateful Dead, Lou Reed, the Clash and others at the height of their fame in the 1970s. He shared a selection below: California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742628610.0247145}