{"duration": 0.05789494514465332, "input_args": {"text": "'Tuesday on MSNBC’s “Andrea Mitchell Reports,” President Barack Obama’s national security adviser Susan Rice addressed reports she was responsible for the unmasking of names of Trump associates after the election during the transition period.  Rice said unmaking names in intelligence reports she received is standard procedure insisting, “I leaked nothing to nobody,” adding there is “no equivalence” between unmasking and leaking. Rice said, “The allegation is that somehow Obama Administration officials utilized intelligence for political purposes. That is absolutely false. I was the national security advisor. My job is to protect the American people and the security of our country. That’s the same as the secretary of state, the secretary of defense, the CIA director, and every morning to enable us to do that, we receive, from the intelligence community, a compilation of intelligence reports that the intelligence community selected for us on a daily basis to give us the best information as to what is going on around the world. I received those reports as did each of the other officials, and there were occasions when I would receive a report in which a U. S. person was referred to. Name not provided, just U. S. person. And sometimes in that context, in order to understand the importance of the report, and assess it’s significance, it was necessary to find out, or request the information as to who the U. S. official was. ” She continued, “I leaked nothing to nobody and never have and never would. Let me explain this. First, to talk about the contents of a classified report  —   to talk about the individuals on the foreign side, who were the targets of the report itself, or any Americans that may have collected upon incidentally is to disclose classified information I’m not going to do that. Those people putting these stories out are doing just that. I can’t describe any particular report, and I have no idea what re reports  —   I don’t know the time frame, the subject matter, and I don’t know who they think was collected upon. ” She added, “When the intelligence community would respond to a request to identify an American, that would come back only to the person requested it, brought back to them directly. To me, or to whoever might have requested it, on occasion, and this is important. It was not then typically broadly disseminated throughout the nation security community or the government. So the notion that some people are trying to suggest that by asking for the identity of an American person, that is the same as leaking it is completely false. There is no equivalence between   unmasking and leaking. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742563909.4426699}