{"duration": 0.017164945602416992, "input_args": {"text": "'\\nAs election day draws near, accusations against both US presidential candidates are becoming more and more brutal, with Fox News reporting the FBI believes up to five foreign intelligence agencies managed to hack into Hillary Clinton’s private email server.\\nAccording to the report , there is about a 99 percent chance that the server used by then-Secretary of State Clinton for work communications in violation of security protocols was compromised. The allegations were confirmed by House Homeland Security Committee Chairman Michael McCaul, who said that FBI director James Comey had told him about the exposure previously.\\n“She exposed [information] to our enemies,” the Republican representative from Texas said on “Fox & Friends” on Thursday morning. “Our adversaries have this very sensitive information… In my opinion, quite frankly, it’s treason.” \\nMcCaul added that there are concerns not only about the content of the emails, but also access to the communication protocols of special access programs used on government-issued electronic devices.\\n“Now countries like Russia and China and Iran have the most highly-sensitive programs in the United States. And the President of the US is communicating with them,” he alleged. “They are not stupid. They can figure that out as well.” \\nMcCaul has said earlier that he has been briefing Republican candidate Donald Trump on security issues.\\nDirector Comey previously hinted at the possibility that foreign nations had hacked into Clinton’s server, but the Democrat candidate pushed back, saying the FBI director was “speculating.”\\nThe new accusations come after the FBI relaunched an investigation into the use of Clinton’s private server after discovering additional emails on the laptop of ex-Representative Anthony Weiner in the course of a separate investigation. Weiner’s electronic devices, as well as those belonging to his wife, senior Clinton aide Huma Abedin, were seized during that probe.\\nAfter the bombshell that investigation was being reopened dropped last week, some Democrats accused the FBI director of trying to influence the election. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by RT.com of RT.com . '"}, "time": 1742628580.9779499}