{"duration": 0.021899938583374023, "input_args": {"text": "'A sports betting website has added U. S. Senator Kamala Harris ( ) to its list of possible presidential winners in 2020, entering the charts at   odds. [BetOnline. ag favors President Donald Trump to win   at   odds. However, he is also favored to leave office before the end of his first term.  “Even though he is the favorite, his odds are pretty long,” said Dave Mason, the sports betting book manager for BetOnline. The    winner in 2020 is not a Democrat. It is Vice President Mike Pence, at   odds. The most favored Democrat is Sen. Elizabeth Warren ( ). At   odds, she is the frontrunner on the left. Warren is followed by former First Lady Michelle Obama, at   odds. Mrs. Obama said in April that she would not run for public office. However, other than Elizabeth Warren, she remains the most likely Democrat to win in 2020, according to BetOnline. Hillary Clinton and Speaker of the House Paul Ryan are both long shots at  . Others joining Harris at   are former Obama administration cabinet member Julian Castro, New York Governor Andrew Cuomo, former New York mayor Michael Bloomberg, Facebook pioneer Mark Zuckerberg, and Sen. Amy Klobucher ( ). Not much is known about Harris, Mason said, but is beginning to gain attention. “If they’re a hot story, bets come in,” Mason said. Harris is making all kinds of news  —   most recently for creating a playlist for   Music Appreciation Month. It is illegal to bet on political outcomes in the United States, though it is legal to buy stakes in prediction markets, and legal to “bet” in indirect ways (i. e. by donating to favorites in the hope of preferred access or influence after a victory). Some Americans bet on politics through overseas bookmakers, using foreign bank accounts. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562442.761594}