{"duration": 0.09087991714477539, "input_args": {"text": "'Things got heated Wednesday on ESPN’s “First Take” during a debate about retiring Dallas Cowboys quarterback Tony Romo suiting up for the Dallas Mavericks Tuesday night.  “First Take”   Stephen A. Smith questioned Romo’s special treatment because of the lack of success he experienced as the starter in Dallas compared to black athletes such as former Philadelphia Eagles quarterback Donovan McNabb. “Do you know of any black athlete that won just two playoff games, didn’t have any kind of postseason success whatsoever that gets celebrated like this?” Smith asked. “Usually there is a requirement to have some kind of success in order to garner the celebratory atmosphere and ambiance that we saw for Romo. ”   Max Kellerman responded by saying he could not think of any athlete of any race who is “feted” to the same extent as Romo. “[A]s an     …     I’m enlightening you about the fact that these are the kinds of things away from the white community that when folks in the black community huddle amongst ourselves and talk about things and talk about discrepancies, it’s the kind of stuff that irks us,” Smith replied. “Because we know that those are the kinds of things that are not reserved for us. Sports is supposed to be the closest thing to a meritocracy. Where is it here?” ESPN’s Will Cain called Smith’s white privilege argument “so much nonsense and so much junk,” adding to make the debate racial “detracts” from the “real racial issues. ” “What you just said was so much nonsense, and so much junk,” Cain told Smith. “To make this racial is so far beyond the pale that it makes real racial issues hard to pay attention to. It detracts. ” Smith angrily replied, “You don’t get to just chirp chirp chirp and talk about what we’re supposed to feel, and I don’t get a chance to respond. What the hell do you think this is? Let me be very, very clear: You’re not black. Don’t think for one second you get to tell me how to feel. ” Follow Trent Baker on Twitter @MagnifiTrent'"}, "time": 1742562662.9035816}