{"duration": 0.029314756393432617, "input_args": {"text": "'PHILADELPHIA  —   Amid confusion over whether he would speak at a black church this weekend, Donald J. Trump’s halting attempts to win over   voters took him to Philadelphia on Friday, where he spoke with a small group of business owners and community leaders and had an emotional meeting with the mother of a young woman who was killed by undocumented immigrants. After largely avoiding black audiences during his campaign, Mr. Trump had arranged to appear at a prominent black church, Great Faith Ministries, in Detroit on Saturday. After a New York Times report that he would not address the congregation and would give only scripted answers to questions   by the pastor, his campaign said Thursday that Mr. Trump would speak to the crowd for five to 10 minutes. But on Friday afternoon, the pastor, Bishop Wayne T. Jackson, insisted that talk of Mr. Trump speaking was only “rumors” and that he would be allowed to offer only a short greeting to the congregation, not a pitch for why they should vote for him. “When we have guests, whether they are a celebrity, an actress, an actor, or whether it’s just somebody who is well known, we do allow them to say, ‘I’m here today,’” Mr. Jackson said. “A greeting. Thank you very much and sit down. There is not going to be a 10 minute speech from nobody. No. ” The Trump campaign did not immediately respond on Friday. The night before, his senior communications adviser, Jason Miller, had said Mr. Trump was eager to present himself to members of the church. “If you know anything about Mr. Trump, it’s that he will want the opportunity to take his vision and message of opportunity directly to the people on Saturday,” Mr. Miller had said. Mr. Trump’s support among black voters remains dismal, low even by Republican standards, owing to a string of slights that include his questioning of President Obama’s birth certificate and his dismissive treatment of Black Lives Matter protesters. But in swing states like Pennsylvania, winning over even a few new   voters could mean the difference. Mr. Trump believes his calls to end illegal immigration can transcend racial lines, and on Friday, he met with a black woman, Shalga Hightower, 55, who wept as she described how her    daughter Iofemi was murdered, along with two friends, by a group of men which included two undocumented immigrants. Mr. Trump asked about the fate of the young men and Ms. Hightower said that they had all received life sentences. “But they should have never been here,” said Mr. Trump, looking solemn as he consoled the crying mother. “But they should have never been here, absolutely,” she replied. When reporters asked about a few dozen protesters who could be heard shouting outside, Ms. Hightower’s son, Jamar Hightower, 26, jumped into the discussion. “It’s way bigger than that,” he said. “I mean there’s freedom of speech and they can think what they want. But, at the end of the day, I feel as though this man is the only one that’s actually standing up to do something about it. ” The Hightowers and the 12 local leaders, most of them Republicans, who met with Mr. Trump Friday were aware that many black Americans have a dim view of the candidate. Even so, Daphne Goggins, a local party leader, thanked Mr. Trump for coming and wept as she said: “For the first time in my life, I feel like my vote is going to count. ” And Renee Amoore, the founder of a consulting firm, said she appreciated Mr. Trump for “coming to the hood. ” “That’s a big deal,” she said. “Let’s be clear here, folks. ”'"}, "time": 1742628411.310418}