{"duration": 0.0757303237915039, "input_args": {"text": "'The World Economic Forum’s annual gathering of globalist political, financial and cultural elitists is underway in Davos, Switzerland, but the organization’s founder is planning an emergency Washington, D. C. meeting in 2017 for worried elites worldwide to discuss how to deal with   Donald J. Trump. [“The World Economic Forum is listening to Donald Trump,” Bloomberg’s Stephen Morris and Erik Schatzker wrote on Sunday. “The organization will convene a special meeting in Washington this year to discuss issues raised during the  ’s campaign and the populist wave that swept him to victory, WEF founder Klaus Schwab told Bloomberg Television on Sunday. The gathering will explore U. S. investment and   opportunities for companies that participate in the forum, he said. ”  Klaus Schwab, who in 1971 founded the group that eventually became the World Economic Forum which hosts the annual retreat for business, political and cultural elites in the Swiss Alps, told Bloomberg that the event in Washington, D. C. —  which was previously not planned —  is going to be meant to address globalist concerns with the rise of populism as evidenced by the election of Trump to the presidency. “It’s very natural that with the new administration we plan a major event in the U. S. to see what are the implications of the new president and how the business community could engage,” Schwab said, adding that in Davos in 2017 there are populists present who the globalists plan to hear from to try to assuage a “silent fear” of the masses. “People have become very emotionalized, this silent fear of what the new world will bring,” Schwab added. “We have populists here and we want to listen. We have to respond to these individuals’ fears and to offer solutions. It’s not just enough to listen we have to provide answers and that’s what we’re here for in Davos. ” Schwab said that the Davos gathering is not supposed to be about the glamorous parties and receptions for the elites present, or about the “outrageous excesses of life” exhibited by them there, but rather his goal is to create a “global village” where in the words of Morris and Schatzker “participants can mull weighty issues facing the world without the distractions of a large city. ” “My biggest fear is that we will believe there are very simple answers to very difficult questions,” Schwab said. “The right solution will require a lot of effort and many steps in the right direction. I am optimistic that in a new   world we still have the notion of a joined and shared destiny. ” In 2017, the “Party of Davos” so to speak, the World Economic Forum’s annual gathering there in the Swiss Alps, is as Breitbart News has previously reported a gloomier event than usual. Last year, the world elites gathered in Davos were certain that British voters wouldn’t vote to Leave the European Union and that Donald J. Trump would never be elected president of the United States —  and that all these fears of populist uprisings around the world would never materialize. But they were wrong, and now Davos attendees are scrambling to try to figure out why.'"}, "time": 1742563348.0143127}