{"duration": 0.06044936180114746, "input_args": {"text": "'0 Add Comment \\nA LAID BACK and fun to work for Dublin business is forcing its employees to have fun with a mandatory Fancy Dress Friday in honour of Halloween. \\nMaintaining a chilled out work atmosphere in an effortless manner, several employees with pending deadlines have been forced to wear costumes in a bid to pretend to have fun at up and coming tech company SplattTrap. \\n“Yeah, I mean we’ll be down 25% in revenue if we don’t secure new customers by the end of next week and maybe face layoffs, but the boss said fuck that, if I didn’t bake a bunch of stupid fucking Halloween cupcakes that he could pose with on the company’s Facebook page I’d be in serious trouble,” explained junior sales executive Brenda Gowan. \\n“We run a really, really chill office, which allows people to be as productive as possible without all that pressure you see in conventional companies,” SplattTrap CEO Eoin Deveney shared with WWN, “and it’s shame some people thought they could ignore the 22 emails which stated we absolutely had to dress up and have fun today, I wasn’t fucking around,” Deveney added. \\nThe CEO of the company not quite located in Dublin’s ‘Silicon Docks’ area had spent close to 42 hours fretting over his own costume, which only added to the hurt he felt when he noticed several casually dressed personnel desperately ringing clients, seeking new business in order to keep the lights on. \\n“I couldn’t even tell you what we do here at SplattTrap, in terms of product and services, but what I do know about SplattTrap is that we had been saying since the start of August people had to spend loads of money on a costume and have fun, it was mandatory. I’ll be calling a meeting in a minute to tear strips off some people” Deveney confirmed. \\nEmployees at SplattTrap, who really needed to focus on their work, were told to up their charity donations to €50 each as part of Fancy Dress Friday as the current total ‘wasn’t worth boasting about on social media’.'"}, "time": 1742562072.2957273}