{"duration": 0.12238788604736328, "input_args": {"text": "\"Minorités ethniques , caucase , ossétie \\nVladikavkaz. Crédit : Lori / Legion-Media \\nVladikavkaz, chef-lieu de l’Ossétie du Nord (Caucase russe), est souvent qualifiée de « Saint-Pétersbourg du Caucase » , car aucune autre ville de la région ne compte autant de représentants du monde créatif : peintres, photographes et artistes. \\n« Dans mon village natal, on aimait raconter cette blague : jetez une balalaïka par la fenêtre, celui qui l’attrapera commencera à en jouer » , raconte l’Ossète Alik Pagaïev, chef de la troupe du théâtre équestre Narty de Vladikavkaz. \\nDes femmes ossètes au travail, XIXe siècle. Crédit : Photo d'archives \\nToutefois, la créativité n’est pas l’unique trait national. Toujours d’après Alik Pagaïev, les Ossètes sont très ouverts à tout ce qui est nouveau, très respectueux envers les valeurs des autres et n’oublient jamais leurs racines. Histoire \\nLes Ossètes tirent leur origine des nomades iranophones, les Scythes et les Sarmates. Dans les chroniques du IIe siècle ap. J.-C., ces tribus étaient considérées comme une sérieuse force militaire et politique . Lire aussi : Les Balkars, un peuple montagnard contre vents et marées \\nL’Etat médiéval d’Alanie existait déjà au XIe siècle. Ses habitants étaient réputés dans la région pour leur habileté militaire . Le noyau de leur armée était la cavalerie. \\nMalgré ce talent, ils furent balayés par l’offensive mongole et pratiquement exterminés vers le XIVe siècle. Il ne restait plus dans les montagnes que quelques centaines d’habitants. Pourtant, le peuple a réussi à survivre et à s’assimiler plus tard en Russie. \\nLe monde compte actuellement environ 700 000 Ossètes dont 528 500 habitent en Russie d’après le recensement de la population de 2010. La plupart vivent en Ossétie du Nord ( 459 600 ), les autres se sont installés à Moscou ( 7 900 ) et à Saint-Pétersbourg (un peu plus de 3 000 ). On en compte 45 900 en Ossétie du Sud. Ouverts aux nouvelles cultures \\n« Le Caucase a commencéàêtre rattachéà la Russie au XVIIIe siècle. Les Ossètes ont perçu ces changements comme leur salut : il était très difficile de survivre en montagne, alors qu’il fallait – et l’intelligentsia le réalisait clairement – se développer , a indiqué Anna Kabissova, photographe et journaliste. \\nAprès que l’Ossétie eut rejoint la Russie, de nombreux Ossètes sont partis faire des études à Saint-Pétersbourg . Puis nous avons vu apparaître notre propre école d’art » . Elle a fait remarquer qu’à la différence des habitants des républiques musulmanes , les Ossètes chrétiens sont arrivés plus facilement à s’entendre avec les Russes. Photo d&#39archives \\nL’Ossétie du Nord, XVIIIe siècle. Oustinov / RIA Novosti \\nUn artiste ossète jouant du violon. 1 / 2 \\n« Les Ossètes saisissent vite. Nombreux sont ceux qui s’étonnent : un jeune Ossète originaire d’un village retiré en montagne vient faire ses études à Saint-Pétersbourg ou à Moscou . Deux ans plus tard, il est complètement intégré, il parle russe sans accent et il a de très bon résultats. Je pense que c’est le trait qui a aidé notre peuple à survivre dans les temps les plus difficiles » , estime Alik Pagaïev. Offrandes aux dieux, pirojkis et bière \\nLes rites chrétiens coexistent en Ossétie avec les coutumes païennes dont les traces se retrouvent dans des dizaines de fêtes populaires. Les Ossètes peuvent faire des sacrifices symboliques en tuant un poulet ou un mouton pour les offrir à leurs invités lors d’une fête. Lire aussi : Shabbat et chachlik : la vie des Juifs dans le Caucase russe \\nLes célèbres pirojkis nationaux sont une nourriture rituelle. Ces chaussons, grands, ronds et fins, fourrés de viande, de fromage et de pommes de terre symbolisent pour les Ossètes le soleil. Pour toutes les fêtes, chaque famille fait cuire trois chaussons. \\nUne autre tradition nationale est le brassage de la bière. Les femmes fabriquent de la bière selon une recette locale pour de nombreuses fêtes. Les Ossètes ont leur propre Oktoberfest : le festival de bière organisé chaque année au mois d’octobre à Vladikavkaz rassemble des Ossètes de toute la Russie et d’autres pays. \\nDes jeunes ossètes interprètent une danse folklorique. Crédit : Yakov Berliner / RIA Novosti \\nD’après son goût et son aspect, la boisson ressemble plus au kvas russe , mais elle est légèrement alcoolisée (1,5–2 degrés). Cette bière est brassée dans une grande chaudière sur un feu de bois. \\nLes principaux ingrédients sont ceux de tous les autres peuples, le houblon et le malt, auxquels viennent s’ajouter tantôt des côtes de mouton, tantôt du sucre, tantôt… les recettes se comptent par centaines. Lire aussi : Les Caréliens : vivre à la frontière des mondes Le sens des affaires en moins \\n« Demandez-moi quelle est l’activité que j’aime le moins et je vous répondrai : faire du commerce, poursuit Alik Pagaïev. Les Ossètes ne possèdent pas le sens des affaires. Nous avons un grand nombre de peintres talentueux et de bons sportifs , surtout dans la lutte libre, ainsi que d’éleveurs de chevaux, mais nous essayons d’éviter le domaine du commerc e » . Respect des invités et amour de la langue maternelle \\nParmi les autres traits, il y a aussi le tact. « J’ai travaillé en Kabardino-Balkarie (république du Caucase russe, ndlr) et j’étais toujours étonné de leur habitude à parler leur langue devant les autres. Je viens chez des Kabardes qui m’ont invité, mais ils parlent entre eux leur langue et je ne les comprends pas. En Ossétie, s’il y a un invité, nous parlons russe » , ajoute Alik Pagaïev. Lire aussi : Bienvenue chez les Evenks, un peuple de Sibérie qui lutte pour son identité \\nCertains jeunes des grandes villes ne parlent pas leur langue. « C’est dommage, car il est important de la préserver. Chez nous, mes enfants ne parlent qu’ossète. Si je les entends parler russe, je leur explique : vous parlerez russe quand ce sera indispensable, mais chez nous on parle notre langue » , souligne-t-il.\""}, "time": 1742563323.5338874}