{"duration": 0.14199280738830566, "input_args": {"text": "'Alexander Dugin El Pantano va a convertirse en el nuevo nombre de la secta globalista, de los adeptos de la sociedad abierta, de los maníacos del lgbt, del ejército de Soros, de los posthumanistas, etc. Drenar el pantano no es sólo el imperativo categórico norteamericano. Es un desafío global para todos nosotros. Cada pueblo está ahora bajo el poder de su propio pantano. Todos juntos debemos comenzar la lucha contra el pantano ruso, el pantano francés, el pantano alemán y así sucesivamente. Necesitamos purgar nuestras sociedades de la influencia del pantano. Así que en lugar de pelear entre nosotros, vamos a drenarlo juntos. ¡Los drenadores del mundo entero deben estar unidos! \\nEl otro punto es que el antiamericanismo ha terminado. No porque estuviera equivocado, sino exactamente por lo contrario: porque el pueblo estadounidense inició la revolución precisamente contra ese aspecto de los EEUU que todos odiamos. Ahora, la élite gobernante europea, así como parte de la élite rusa (que todavía es liberal) no puede ser culpada (como antes) de ser demasiado pro-americana. Debe ser culpada de ahora en adelante por ser lo que es: una pandilla corrupta, pervertida y codiciosa de banksters y destructores de culturas, tradiciones e identidades. Así que vamos a drenar el pantano europeo. Basta de Hollande, Merkel, Bruselas. Europa para los europeos. Los Soros y su secta deben ser juzgados públicamente. \\nEl pantano es a partir de ahora un fenómeno extraterritorial. Exactamente como una red terrorista internacional. El pantano está en todas partes y en ninguna parte. Ayer, el centro del pantano, su núcleo, estaba situado en los EEUU. Hoy, ya no. Es la oportunidad para todos nosotros para que comencemos a cazarlos. El pantano no tiene ya una forma manifiesta y regionalmente fija. Sin embargo, existe y sigue siendo muy, muy poderoso. Pero su carácter anti-nacional ahora es evidente, explícito. El pantano no se esconde ya detrás de Norteamérica. Se ha exiliado. ¿Dónde?, ¿a Canadá?, ¿a Europa?, ¿a ucrania?, A otros planetas donde algunos actores y actrices dopados prometieron emigrar en el caso de la victoria de Trump. Así que ahora es el momento de cumplir la promesa. Parece como el rapto globalista. Ahora son absorbidos en el no-espacio, la u-topia. En la tierra de la utopía liberal, en tierra de nadie. Somos testigos de la desterritorialización del pantano, de la élite globalista, del Gobierno Mundial. ¿Cuál es la estructura del pantano? En primer lugar, es la ideología, el liberalismo. Necesitamos el juicio de Nuremberg sobre el liberalismo: la última ideología política totalitaria de la Modernidad. Cerremos esta página de la historia. Segundo: El pantano es una cultura post-modernista especial. Está basada en la descomposición de cualquier entidad, por la digitalización, el esquizomorfismo obligatorio y así sucesivamente. Drenarlo significa restaurar la unidad apolínea del arte. El arte debe volver al holismo. Tercero: el capitalismo transnacional global. Es el motor material del pantano. Es el crédito y el Sistema de Reserva Federal haciendo cuentas verdes envenenadas. Tenemos que terminar con todo esto y regresar al sector real y al enfoque mercantilista. \\nYo sugeriría redescubrir las ideas de Pitirim Sorokin. Vio la dinámica social de la historia como una cadena de paradigmas sociales: ideacional, idealista y sensata. Ideacional es la dominación absoluta del espíritu sobre la materia, el ascetismo y la subyugación violenta del mundo material a la aspiración espiritual y religiosa. El tipo idealista es equilibrado y basado en la coexistencia armoniosa del espíritu y la materia, donde la parte espiritual es ligeramente dominante pero no exclusiva (como en el tipo ideacional). El tipo sensato de la sociedad es la dominación de la materia sobre el espíritu, del cuerpo sobre el alma. El tipo sensato de la sociedad es el pantano. Y recientemente parecía que \"sensato\" y \"Norteamérica\" eran sinónimos. Después de Trump todo es diferente. Ahora lo sensato es global y ex-céntrico. Hay una especie de \" translatio Imperii \" - a ninguna parte o bien a todas partes. \\nPero Sorokin hizo hincapié en que la naturaleza cíclica de la sociedad sólo exige esta sucesión: ideacional-idealista-sensata. Después de sensata no puede seguir idealista. No hay una posible evolución desde el pantano hasta el semi-pantano. Después del pantano viene el sol. El fuego, el Espíritu. El Espíritu en su forma radical, ideacional. Así que para drenar el pantano necesitamos el fuego solar. El gran incendio. Debe ser en abundancia. \\nEl pantano y el fuego son dos elementos opuestos distribuidos a través de la tierra. La geopolítica se vuelve ahora vertical. Ambos están en cualquier punto. El significado del lugar ahora es el impulso del proceso de drenaje del pantano. ¿Dónde? Aquí y ahora. El pantano ya no es la hegemonía norteamericana, el presidente de Estados Unidos rechaza tal hegemonía. Así que es la hegemonía \" tout court \", la hegemonía como tal, con un vacío puramente post-modernista en el centro. Estados Unidos es el extremo occidental del mundo. Es el espacio de la medianoche. Y allí se alcanza el punto final de la caída. Así que el momento es el del cambio de los polos. Occidente se convierte en Oriente. Putin y Trump en dos rincones opuestos del planeta. En el siglo XX estos dos extremos fueron las formas más radicales de la modernidad: capitalista y comunista. Dos monstruos apocalípticos, Leviatán y Behemoth. Ahora se convierten en dos promesas escatológicas: la Gran Rusia de Putin y Norteamérica en estado de liberación por Trump. El siglo XXI finalmente ha comenzado. \\nAsí que todo lo que necesitamos ahora es el Fuego. '"}, "time": 1742563788.739758}