{"duration": 0.05527234077453613, "input_args": {"text": "'With his Twitter account, President Donald Trump can move the media  —   and can also apparently tip celebrities’ scales. [Singer Barbra Streisand tweeted Saturday that Trump is making her gain weight, because after hearing the morning news, she switches from liquids to pancakes doused in maple syrup.  Donald Trump is making me gain weight. I start the day with liquids, but after the morning news, I eat pancakes smothered in maple syrup!  —   Barbra Streisand (@BarbraStreisand) March 5, 2017,  Trump just accused Obama of tapping his phones. Seriously crazy times. Time for more pancakes.  —   Barbra Streisand (@BarbraStreisand) March 5, 2017,  The    singer and vocal supporter of former Democratic presidential candidate Hillary Clinton issued the tweets after Trump accused President Obama’s administration’s of tapping the phones at Trump Tower before the election in a series of tweets on Saturday. Former Obama spokesman Kevin Lewis denied the charge in a statement Saturday. “A cardinal rule of the Obama Administration was that no White House official ever interfered with any independent investigation led by the Department of Justice,” Lewis said. “As part of that practice, neither President Obama nor any White House official ever ordered surveillance on any U. S. citizen. Any suggestion otherwise is simply false. ” Streisand has been one of Trump’s most outspoken celebrity critics. Just last week, she penned a column for the Huffington Post saying that the new president’s first 40 days in office paled in comparison to those of his predecessor. “Trump has promised to ‘make America great again.’ What makes America great is when our government is as good as our people, and acts with compassion and decency and humility,” she wrote. “He has failed this test already in his first 40 days. ” At a pricey New York City fundraiser for Hillary Clinton in June, the singer mocked Trump by performing a rendition of Stephen Sondheim’s 1973 song “Send in the Clowns. ” Streisand previously called Trump “clueless, reckless, graceless and heartless,” and also “terrifyingly scary. ” In August, the singer vowed to move to Australia if Trump won the election. But Streisand isn’t the only celebrity who claims Trump is affecting their weight in February, Girls star Lena Dunham claimed that the pain of what she called the Republican’s “ ” election victory contributed to her recent weight loss.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561851.1452827}