{"duration": 0.08025026321411133, "input_args": {"text": "'For years, antinuclear activists, concerned parents, local officials and others have worried about Indian Point, a   nuclear plant on the Hudson River in northern Westchester County that provides cheap energy and robust tax revenue, but also carries the risk of disaster. The news on Friday that the state had negotiated a deal that could shut down the plant within five years sent shock waves of jubilation, relief and anxiety through the suburbs north of New York City. On one side was an almost gleeful disbelief that what had seemed an insurmountable goal  —   ridding the county of nuclear power  —   would come to pass. Nada Khader, executive director of the Wespac Foundation, a nonprofit group in White Plains that advocates social justice, was told about the development by a reporter. “This is really amazing for Wespac, an organization whose many, many members have been working for decades to shut Indian Point,” she said. “All of us want to shift to safe energy. We absolutely welcome this news. ” But there were also misgivings about what the closing would mean for utility customers, Indian Point employees and the nearby schools that rely on the plant’s tax dollars. Officials in Westchester County said they were blindsided by the deal and were upset that they were not consulted. Robert P. Astorino, the county executive and a vocal supporter of Indian Point, which is in the village of Buchanan, said more than $4 million enters the county’s coffers every year from the plant, representing nearly 1 percent of the tax base. “No one from the governor’s office had the common courtesy to call the county affected by this,” Mr. Astorino, a Republican, said. “So we’re all trying to figure out what will happen in the future and the costs of this potential closure. There are enormous economic consequences to something like this. ” Perhaps no single entity will suffer the financial effects of the shutdown more than Hendrick Hudson schools, a district with 2, 400 students that draws from parts of a   towns and villages near the plant. The superintendent, Joseph E. Hochreiter, said taxes from the company that owns Indian Point, Entergy, made up   of the district’s $75. 8 million operating budget annually. “We’ve enjoyed some of the lowest property tax increases of any school district in Westchester County and that has made this a very appealing community to move to and stay in,” he said. “Entergy plays a major, major role in keeping taxes down. If they are not operating at the capacity that we’re accustomed to, we are going to have budget deficits. ” Converting Indian Point’s property to another use  —   whether residential or commercial  —   may not be possible, given the environmental history of the   site. Still, after years of   over the potential for a catastrophe, many residents said they would be happy to have a   county. Opponents of the plant had seized on the Sept. 11 terror attacks and, later, the Fukushima Daiichi nuclear disaster in Japan to galvanize support for shutting Indian Point. More recently, critics had focused on fighting a natural gas pipeline that was constructed on the plant’s land. Elected officials, residents and environmental activists have criticized the project, saying that a rupture could unleash a nuclear catastrophe. While Gov. Andrew M. Cuomo, a Democrat, has long called for the plant’s closing, few thought a decision to shut it down was imminent. Nancy Vann, a retired Wall Street lawyer who lives in Peekskill, has fought against Indian Point for years. She is president of Safe Energy Rights Group, which was formed in response to the natural gas pipeline. “I’m very, very happy about this,” she said, referring to news of the agreement. But like others, she was concerned about the plant’s spent fuel rods. Under the deal, they will be moved off site eventually. “Indian Point won’t be completely safe until the spent fuel rods are all put into hardened dry cask storage,” she said. “I just want people to realize that the fact that Indian Point is closing  —   and not immediately  —   doesn’t mean it will be safe right away. ” Michael B. Kaplowitz, chairman of the Westchester County Board of Legislators, listed other concerns  —   from the plant’s decommissioning costs and the fate of its 1, 000 employees, to the effects on the local area. While he is eager to see details of the deal, he said that on balance, shutting it made sense. “It’s a net societal gain because of the specter of terrorism,” he said. “The better the details are for the company, the worse it is for the rate payers and taxpayers. I’m hoping that given the leverage the state has that the tax payers and rate payers do better than the Entergy shareholders. ” “I can say,” he added, “that I’m encouraged that it looks like we are turning the page on a nuclear power plant that doesn’t belong 25 miles from New York City. ”'"}, "time": 1742564195.6431046}