{"duration": 0.016096830368041992, "input_args": {"text": "'Leave a reply Maureen Moss – Not a typical newsletter from me, these are words that flowed forth this morning. \\nClearly the week ahead for the United States and those across the world will be one of the most significant in history. The Presidential election is historic in and of itself, though the weeks to follow may prove to be more so. Nothing is as it appears to be. \\nWe are in the beginning times of an entirely new civilization, as was humanity some 200,000 years ago. Everything not harmonized with this new civilization will be dismantled… not sometime in the future… in the weeks directly in front of us. \\nHundreds of thousands of years and billions of people will be shaped by who we become individually and then collectively and how this Earth is restructured by the events unfolding now. \\nWe must trust we are being brought into harmony under the impulse of One system of operation. \\nLong knowing that a new humanity and new global reality would be born… in this our lifetime… certainly we had little idea of how that would occur. \\nNot all that long ago we came to know the responsibility we personally held to lift and stabilize our consciousness, open wide our hearts and free ourselves from the captivity of a deceptive, fearful lower nature having multiple realities. \\nCertainly we started becoming aware of our desire to know ourselves authentically, thus beginning the journey to return to a singular loving nature no longer conflicted by dual pillars of truth nor at odds or war with ourselves. \\nAll this, in Divine right time and in preparation for a new reality to be born on Earth. It had to begin within ourselves. \\nCertainly not as instinctively, was how an entire distorted external reality (politically, socially, economically and more,) operating in reverse truth, riddled with deception, lies and manipulation would come to find its true nature. \\nFew would have considered how much could potentially come to Light under the glare of so much darkness, or that it would come through a Presidential election… far from over on election day regardless of the seeming winner…in the United States of America. \\nThis election is a seismic evolutionary event . \\nIn this week ahead, and those to follow… through the flurry and activity of the end times and the beginnings… as you witness the distorted psychology of the human system exposed and broken down from every angle… breathe, stay in your center and with an open heart, open mind and love… be in observance of this most profound display of activity on behalf of humanities evolution… and that of the Earth. \\nHold each other close and stay in your center . We will get through this…it has already been written. \\nGod Bless You,'"}, "time": 1742628542.0643036}