{"duration": 0.05285787582397461, "input_args": {"text": "\"Entrepreneurship is growing faster in Moscow than in any other region of the country. Source:Reuters \\nThe average individual entrepreneur “survives” only 5.7 years, according to new research by the PwC consulting firm. \\nThe conclusions, based on data from the Federal Tax Service and the Levada Center from 2010 to 2016, were published in a new report, “The Development of Individual Entrepreneurship in Moscow,” the RBC website reports . \\nTransforming the business potential of BRICS \\nThe researchers concluded that, since 2010, the number of registered individual entrepreneurs in Moscow has increased by 51 percent to 244 thousand. However, the entrepreneurs' businesses last, on average, less than 6 years. The main reasons for the closures are economic problems (51 percent) such as declining demand, increasing competition, and growing costs, and tax issues (10 percent). \\nAccording to PwC, entrepreneurship is growing faster in Moscow than in any other region of the country. Muscovites now make up 7 percent of all individual entrepreneurs in Russia, 3 percent higher than in 2010. \\nBut growth has not been even. According to PwC, the main wave came in the 2010-2012 period, when the annual increase was 9-10 percent. Due to rising insurance rates, the number of individual entrepreneurs declined by 2 percent in 2013. The rate rebounded in 2014 and 2015 by 4 and 7 percentage points respectively. In the first half of 2016, it stood at 5 percent. \\nHowever, it can be difficult to state with clarity what these rates mean in practice. Individual entrepreneurs may indeed be people starting small businesses, but they can also be individuals formally registered this way for tax benefits. \\nNew Russian app to manage small business \\nPwC also concluded that 61 percent of individual entrepreneurs work in the service sector, 27 percent in retail, 8 percent in wholesale trade, and 4 percent in manufacturing. \\nOutside Moscow, the growth dynamic of entrepreneurship has been less impressive. For nearly six years, PwC concluded, the national rate has been negative: -8 percent. \\nThe second fastest entrepreneurship growth rate was recorded in St. Petersburg (41 percent), followed by the Moscow Region (31 percent). \\nFirst published by The Moscow Times . Facebook\""}, "time": 1742562181.8730884}