{"duration": 0.12390851974487305, "input_args": {"text": "'BEIJING  —   Ji Wanchang strolled through a Beijing luxury mall one recent morning with an eye out for luxury coats. But at one store, a clerk told him a   Moncler and other coats were “sample sizes” and not for sale. A second clerk, selling a wolf   Yves Salomon, said the coat was reserved. Mr. Ji sighed. In both cases, the fur wouldn’t match their labels, he suspected  —   and the clerks knew selling a fake to Mr. Ji, who is well known on sight in many of China’s shops, meant big trouble. “Ma’am, I don’t want to make things difficult for you,” he told a sales clerk, who nodded and bowed. “I’ve found problems with your clothes, so please correct them. ” Mr. Ji is what is known in China as a professional counterfeit hunter. Part Ralph Nader, part bounty hunter, Mr. Ji rummages for fake or substandard goods in shops. Then, using China’s consumer protection laws, he collects tens of thousands of dollars from the companies that make or sell them. The laws are part of China’s growing effort to weed out the fake clothes, electronics, food and furniture that swamp its stores and frustrate companies and consumers alike. But Mr. Ji’s livelihood is now under threat. Some government officials say Mr. Ji and the unknown number of others like him abuse a law that was meant merely to empower consumers to report fakes. If proposed new government rules get accepted, people like Mr. Ji will no longer be able to go pro. Even as China grows and matures, and moves to protect brands and ideas, it still struggles with how to get rid of fakes. Overseas governments, overseas companies and even its own increasingly choosy consumers complain that China’s counterfeit products hurt brand names and common people alike. Chinese leaders have stepped up efforts to cull them, in part to protect homegrown companies that are starting to produce their own innovative products. Last year, China’s courts handled about 120, 000 intellectual property cases, up 9 percent from 2014, according to official media. One   effort was intended to empower the consumer. In 2009, the government promised consumers that if they found a product that flouted food safety laws, they could win 10 times the value of that product in compensation. In 2013, China bolstered an earlier consumer protection law by increasing payouts to buyers of other kinds of fake goods, while a decision from China’s supreme court was widely seen as supporting counterfeit hunters. Mr. Ji and his peers have used these laws to their advantage, buying knockoffs in bulk  —   the more they turn in, the more they are paid  —   and filling their storerooms withcounterfeit products. Mr. Ji’s group, the Jinan Old Ji   Rights Defense Work Studio, has a network of about 20 informers who report suspected fake products. He says his biggest success to date is collecting about $178, 000 in compensation from a company that tried to pass off its blankets as pure cashmere. China’s   boom has given counterfeit hunters a new front. “The main purpose of suing them is to ask them to correct themselves,” said Yu Fengxing, another counterfeit hunter, who chases merchants who sell fakes on online marketplaces run by the Alibaba Group, China’s largest   company. He became an   counterfeit hunter after he bought an item marketed by a merchant on Alibaba’s Tmall platform as a foot treatment and discovered that it was probably just makeup. In a statement, Alibaba said it was committed to fighting fakes on its platforms. Among overseas companies, people like Mr. Ji have fans. “A lot of my clients would, in some circumstances, support the activities of these kinds of consumer warriors because ultimately they may be uncovering information that helps us do our job,” said Scott Palmer, an intellectual property lawyer at Sheppard, Mullin, Richter  Hampton, which represents American corporations in China. But government officials complain that the program is increasingly expensive and increasingly abused. Even some foreign business groups complain. Counterfeit hunters often profit “from complaints that target minor product labeling errors instead of true quality or safety issues,” said James Zimmerman, chairman of the American Chamber of Commerce in China, in emailed comments. Proposed government rules released in August and under official consideration said that payouts for fakes would not be available to those who sought them “for commercial purposes. ” Mr. Ji, defending his work, says he has to recoup his legal fees, which he incurs when the companies he accuses of selling fakes fight back. He says he makes about $148, 000 a year but his   pay is only about $30, 000 to $44, 000 after expenses. “When they encounter a fake product, more than 80 percent of Chinese people will just suck it up and not take it very seriously, as long as their lives are not in danger,” Mr. Ji said. “If there are more professional counterfeit warriors, the quality of goods will improve at once. ” Mr. Ji never set out to be a consumer rights activist. Born in the northern region of Inner Mongolia, he was so poor he could not afford to enroll in a university. His jobs have included running a carwash, selling clothes on the street and operating a   food stall. In 2000, a friend of his bought a children’s educational compact disc that turned out to contain pornographic content. Furious, he and his friends “laid siege” to the store where they had bought it, demanding compensation, Mr. Ji said. “At that time, I did not understand what defending your rights is,” he said. Later, Mr. Ji bought a copy of China’s consumer law and a manual on how to tell fakes from genuine products. From that point, he had a new career. On a recent week in October, Mr. Ji traveled to four courthouses in five days across China, filing lawsuits against shopping malls, accusing them of fraud for selling substandard goods. Based in the eastern city of Jinan, he says he goes to court about 100 times a year. Mr. Ji’s work has earned him the enmity of counterfeiters and their thugs, who he says have beaten him up, bound his hands and feet, and telephoned him with death threats. In 2007, police in the southern province of Fujian detained him for 37 days, charging him with extortion, but released him. Still, Mr. Ji views the work as necessary. Every month, he says, he receives more than a hundred phone calls from people curious about how to get compensation from a fake product. On a recent afternoon, a man from the eastern city of Tai’an called Mr. Ji, who was en route to check out a shopping mall in Beijing. How, the caller asked, could he emulate Mr. Ji? Mr. Ji told the aspiring   that he could not “just casually enter any shop and buy eight or 10 pieces and demand compensation. ” His profession was built on navigating tricky relationships with local courthouses and police, Mr. Ji said, adding that recently some thugs from Tai’an wanted “my life, my arms and my legs. ” “Not everyone can be a counterfeit hunter. This industry isn’t a gift that falls down from heaven,” Mr. Ji told the caller. “You haven’t seen the hardships and suffering we’ve gone through. You’ve only seen our glorious side. ”'"}, "time": 1742562010.427667}