{"duration": 0.0354611873626709, "input_args": {"text": "'On the Tuesday edition of Breitbart News Daily, broadcast live on SiriusXM Patriot Channel 125 from 6AM to 9AM Eastern, Breitbart    Alex Marlow will continue our discussion of the first 100 days of the Trump administration. [He’ll be joined by the renowned conservative writer and historian Patrick J. Buchanan. Buchanan, who was the subject of a recent Politico profile, will weigh in on Trump’s first 100 days. As the opening paragraph of Politico’s article details, Buchanan is nothing short of a living legend whose keen insights into the populist nationalist movement predate Trump’s political ascendancy by decades:  His first date with his future wife was spent in a New Hampshire motel room drinking Wild Turkey into the wee hours with Hunter S. Thompson. He stood several feet away from Martin Luther King Jr. during the “I Have a Dream” speech. He went to China with Richard M. Nixon and walked away from Watergate unscathed. He survived   too, and sat alongside Ronald Reagan at the Reykjavík Summit. He invaded America’s living rooms and pioneered the rhetorical combat that would power the cable news age. He defied the establishment by challenging a sitting president of his own party. He captured the fear and frustration of the right by proclaiming a great “culture war” was at hand. And his   candidacy in 2000 almost certainly handed George W. Bush the presidency, thanks to thousands of Palm Beach, Florida, residents mistakenly voting for him on the “butterfly ballot” when they meant to back Al Gore. We’ll also hear from Rep. Louis Gohmert ( ) and White House Deputy Press Secretary Sarah Huckabee Sanders. Live from London, Rome, and Jerusalem, Breitbart correspondents will provide updates on the latest international news. Breitbart News Daily is the first live, conservative radio enterprise to air seven days a week. SiriusXM Vice President for news and talk Dave Gorab called the show “the conservative news show of record. ” Follow Breitbart News on Twitter for live updates during the show. Listeners may call into the show at:   .'"}, "time": 1742564221.7227337}