{"duration": 1.2424063682556152, "input_args": {"text": "\"More Election Coverage Millions Gather Under Times Square Countdown Clock To Celebrate End Of 2016 Election More than 10,000 balloons and nearly two tons of red, white, and blue confetti were released at the moment polls closed. Close More than 10,000 balloons and nearly two tons of red, white, and blue confetti were released at the moment polls closed. NEWS November 8, 2016 Vol 52 Issue 44 · News · Politics · Election 2016 \\nNEW YORK—Marking the joyous occasion with singing, dancing, and a chorus of ecstatic cheers, an estimated 2 million citizens gathered beneath the Times Square countdown clock Tuesday night to celebrate the end of the 2016 election season, sources reported. \\nThe crowd of revelers—many of whom had arrived in the early morning to stake out prime viewing locations—reportedly swelled in volume throughout the night, spilling over into nearby streets as many popped bottles of champagne, embraced loved ones, and finally joined together in a boisterous countdown seconds before the polls were scheduled to close. \\n“God, this is so amazing,” said local man Mark Edwards, gazing up at a fireworks display signaling the conclusion of the incessant media coverage, debates, stump speeches, and campaign advertisements of the election cycle. “I can’t even begin to describe how excited everyone is here. It’s really unbelievable.” \\n“W !” he shouted, his voice nearly drowned out by the sound of Kool & The Gang’s “Celebration” emanating from loudspeakers situated on buildings around the square. \\nAccording to witnesses, the scene was one of unbridled merriment, with roars of delight sweeping through the crowd every time the enormous LED screens in Times Square showed that voting had ended in another state. As vote totals began to come in, thousands in attendance reportedly raised their arms in jubilation, unfurled homemade banners, or placed calls to family members, often yelling to be heard over the sound of whistles, noisemakers, and the exuberant din of the crowd. \\nThroughout the night’s revelry, celebrants were also seen craning their necks and hoisting children onto their shoulders to view the One Times Square Astrovision screen displaying live feeds of equally raucous celebrations in downtown Los Angeles, Chicago’s Loop, Miami Beach, Market Square Park in Houston, and other locations throughout the country \\n“We stood out in the cold all day to get a good spot, but what’s a few extra hours of discomfort when you’ve been looking forward to this for so long?” said Alice Castillo, who told reporters she had driven there from Baltimore with her two daughters to be part of the excitement. “Could we have stayed home and watched it all on TV? Of course. But nothing compares to the thrill of sharing this incredible moment with so many other people.” \\n“When the clock struck zero and everyone erupted into cheers, it was pretty magical,” Castillo added. \\nWhile the crowd was said to have thinned after the polls closed along the East Coast, a reported 250,000 remained well into the night to take in the joyful atmosphere and pack the area’s overflowing bars. One of the Times Square celebrants, 36-year-old Brett Cleaver, said the night’s festivities had caused him to reflect on the past year and consider how tonight represented a fresh start. \\n“Beginning tomorrow, I’m going to try to cherish every second I have where I don’t hear the phrase ‘swing state’ or see footage from a campaign rally,” Cleaver told reporters, beaming at the prospect of never again looking at an article that speculated on how undecided voters would react to Donald Trump’s or Hillary Clinton’s latest statements. “For tonight, though, I’m just soaking up as much of this moment as I can.” \\nAdded Cleaver, “I’m already excited to come back and do this again in 2020.” Share This Story: WATCH VIDEO FROM THE ONION Sign up For The Onion's Newsletter \\nGive your spam filter something to do. Daily Headlines \""}, "time": 1742562977.7939665}