{"duration": 0.08450627326965332, "input_args": {"text": "'April, known as the month of deluges, is certainly flooding New York’s theater landscape. There are 14  —   count ’em 14  —   shows opening on Broadway, with more   forms of entertainment cropping up like wild crocuses all over the rest of the city. Audience members can submerge themselves in everything from the brassy manipulations of a little old matchmaker named Dolly (embodied by a little old diva named Bette) to the more recessive mysteries of humanity according to American theater’s patron saint of the inarticulate, Annie Baker. “Hello, Dolly!” Jerry Herman’s   whinnying war horse from 1964 returns after a   absence from Broadway, in a feverishly awaited production directed by Jerry Zaks and featuring David Hyde Pierce as the curmudgeonly tycoon Horace Vandergelder. The show also includes a staircase made for one really grand entrance, a slew of singing waiters and, in their midst (in the title role) she whom the patrons of louche bathhouses in the 1970s hailed as the Divine Miss M. If you don’t know that’s Bette Midler, don’t bother joining the queue for   cancellations. Tickets: hellodollyonbroadway. com “Oslo” You probably already know the   outcome of this intricately wrought drama about the Middle East peace talks of 1993. (Spoiler: they’re still fighting.) But that doesn’t keep J. T. Rogers’s portrait of the backdoor diplomacy that led to the Oslo Accords from being a nail biter, or from inspiring hope. Vividly directed by Bartlett Sher, and starring Jefferson Mays and Jennifer Ehle as a    pair of married diplomats, this   tale moves from downstairs (where it opened last summer at the Mitzi E. Newhouse Theater) to upstairs (at the more commodious Vivian Beaumont) just in time to become a   for the Tony Awards. Tickets: lct.      “The Antipodes” Nobody’s saying what this latest offering from Signature Theater is about, exactly. But the fact that it was written by Annie Baker, the hugely influential Pulitzer   author of “The Flick,” automatically makes it a   for students of contemporary American drama  —   and for those of us who just like to hear Ms. Baker’s fumbling characters talk about nothing and everything. The director, auspiciously, is Lila Neugebauer, whose energizing production of Sarah DeLappe’s “The Wolves,” a   study of a girls’ soccer team, was a knockout. Tickets: signaturetheatre. org “Groundhog Day” Andy Karl is not playing the   mammal of the title. But his performance in this musical adaptation of the 1993 movie seems guaranteed to confirm his status as an    star. Mr. Karl (who took a lickin’ but kept on tickin’ on Broadway as “Rocky” in 2014) portrays a   cynical news reporter, and when I saw the show at the Old Vic in London last year, he was dazzling (and original) enough to make me forget what’   Bill Murray, who created the part on film. Danny Rubin adapted his original screenplay and Tim Minchin, the man who gave us the blissfully naughty score of “Matilda the Musical,” wrote the music. Matthew Warchus, another talented “Matilda” alumnus, directs. Tickets: groundhogdaymusical. com “Six Degrees of Separation” John Guare’s masterwork, about a world in which   is an   passkey, is one of the best plays ever written about New York society and its more liberal denizens. It returns to Broadway 26 years after it didn’t win (but should have) the Tony Award for best play, with a cast that includes Allison Janney (back onstage after many   years of being winningly waspish on television) and John Benjamin Hickey. They portray a sophisticated but    husband and wife Corey Hawkins (“24: Legacy,” “Straight Outta Compton”) is the seductive young man who (another spoiler) is probably not Sidney Poitier’s son. Tickets: sixdegreesbroadway. com'"}, "time": 1742562382.241215}