{"duration": 0.16861438751220703, "input_args": {"text": "'Wells Fargo’s board said on Monday that it would claw back an additional $75 million in compensation from the two executives on whom it pinned most of the blame for the company’s scandal over fraudulent accounts: the bank’s former chief executive, John G. Stumpf, and its former head of community banking, Carrie L. Tolstedt. The clawbacks  —   or forced return of pay and stock grants  —   are the largest in banking history and among the largest in corporate America. A   committee of Wells Fargo’s directors investigated the extensive fraud. Wells Fargo’s board said in a report issued on Monday that Mr. Stumpf had turned a blind eye to the fraudulent accounts being created under his nose and that Ms. Tolstedt, who ran the branch system, had focused obsessively on sales targets and withheld information from her boss and the board. Wells Fargo’s misdeeds, which came to light in September, have at least temporarily become a more widely recognized symbol of the bank than its signature stagecoach. Bankers across Wells Fargo’s giant branch system were tacitly encouraged to meet their sales goals by committing fraud opening unwanted or unneeded accounts in customers’ names and, sometimes, moving money into and out of the sham accounts. While the amount of money customers lost was relatively small  —   the company has refunded $3. 2 million  —   the scope of the fraud was huge: 5, 300 bankers were fired for creating as many as two million unwanted bank and credit card accounts. In one detail revealed by the report, a branch manager had a teenage daughter with 24 accounts and a husband with 21. The warning signs were glaring and could be traced back at least to 2004, the investigators said. Ms. Tolstedt, who ran the national network of Wells Fargo branches, set up ruthless sales goals that even she acknowledged were unreachable. Mr. Stumpf, who had a long and trusting relationship with Ms. Tolstedt, left her on her own to run her department, the investigators said in the scathing   report. Neither Ms. Tolstedt, who was allowed to retire in July but was subsequently fired, nor Mr. Stumpf, who was permitted to retire in October after being castigated during congressional hearings on the scandal, was available on Monday to comment. Mr. Stumpf cooperated with the board’s investigation Ms. Tolstedt declined to be interviewed. All told, Mr. Stumpf will surrender $69 million, and Ms. Tolstedt will lose $67 million, including stock options that they forfeited last year. While those figures are bigger than any previous bank clawback, they fall far short of the largest clawback in corporate history. In 2007, William W. McGuire of UnitedHealthGroup was forced to give back $618 million over backdating options. Ms. Tolstedt’s lawyer, Enu Mainigi of the Washington firm Williams  Connolly, issued a statement challenging the board’s findings. “We strongly disagree with the report and its attempt to lay blame with Ms. Tolstedt,” Ms. Mainigi said. “A full and fair examination of the facts will produce a different conclusion. ” The board’s report, compiled by the law firm Shearman  Sterling after interviews with 100 current and former employees and a review of 35 million documents, said it was obvious where the problems lay. Structurally, the bank was too decentralized, with department heads like Ms. Tolstedt given the mantra of “run it like you own it” and granted broad authority to shake off questions from superiors, subordinates or lateral colleagues. Many things collectively should have raised suspicion, the report said. Customers were failing to fund, or put money into, their new accounts at alarming rates. Regional managers were imploring their bosses to drop sales goals, saying they were unrealistic and bad for customers. Particularly in Arizona and Los Angeles, where the toxic culture was most pronounced, some managers explicitly told subordinates to sell people accounts even if they did not need them. Because of the bank’s decentralized structure, the problem went unnoticed for a long time. When it finally came to light  —   thanks in part to an investigation by The Los Angeles Times  —   the bank was slow to take action. Mr. Stumpf was warned as early as 2012 about “numerous” complaints about the company’s sales tactics  —   from both customers and employees  —   but he ignored growing evidence that the problem was pervasive, the board said in its report. Much of the   climate, the report said, stemmed from Ms. Tolstedt, who led Wells Fargo’s retail branch network for eight years. The report casts her as a powerful and insular leader who set unreasonable targets, castigated those who criticized them and actively ignored signs that some managers and employees were cheating to meet them. “She resisted and rejected the near unanimous view of senior regional bank leaders that the sales goals were unreasonable and led to negative outcomes and improper behavior,” the report said. Timothy J. Sloan, who succeeded Mr. Stumpf as chief executive, was largely exonerated by the report, even though he was also a career Wells Fargo executive. As president and chief operating officer, he became Ms. Tolstedt’s immediate supervisor in November 2015. At that point, the report said, he “assessed her performance over several months before deciding that she should not continue to lead the community bank. ” Mr. Stumpf, who retired in October, exercised all of his remaining options and converted them to stock  —   which he retained  —   in the months before Wells Fargo announced its $185 million settlement with the Consumer Financial Protection Bureau, the Office of the Comptroller of the Currency and the Los Angeles city attorney in September. He held 2. 5 million shares as of late February, currently valued at $137 million. Asked about the timing of Mr. Stumpf’s options exercise, Stephen W. Sanger, the board’s chairman and the leader of its investigation, said at a news conference on Monday that it was a routine move that did not raise concern. The $28 million that the board is taking back from Mr. Stumpf  —   the proceeds of a 2013 equity grant  —   will be deducted from his retirement plan payouts, Mr. Sanger said. Nearly all public companies have clawback provisions, but boards are typically loath to invoke them. Wells Fargo’s example may inspire future directors, said Charles M. Elson, a professor of finance at the University of Delaware and an expert on corporate governance. “I welcome the move,” he said. “I’m a shareholder of Wells Fargo, and I’m glad they did it. ” Mr. Sanger took over as the board’s chairman from Mr. Stumpf. All four members of Wells Fargo’s independent investigation group were on the board before the settlement was announced. The report depicted the board as hoodwinked by bank executives who withheld important facts. It praised the changes the bank had made recently, which include ending sales goals for its retail bank employees. Such conclusions are unlikely to quiet the bank’s critics. Better Markets, a nonprofit organization that advocates stricter regulation of Wall Street, called the report a compendium of “    cosmetic actions” and called on shareholders to oust all of Wells Fargo’s board members at the company’s annual meeting on April 25. Two influential advisory firms have also recommended significant changes to the company’s board. Mr. Sanger said that the report issued on Monday concluded nearly all of the bank’s investigation and that no further terminations or clawbacks were expected. But other investigations  —   including criminal inquiries by the Justice Department and several state attorneys general  —   remain in progress, raising the possibility of criminal charges. The board’s law firm is still looking into reports that the bank retaliated against former employees who tried to blow the whistle on its wrongdoing. Last week, a federal regulator, the Occupational Safety and Health Administration of the Labor Department, ordered Wells Fargo to rehire and pay $5. 4 million to a former employee who said he was fired after making internal complaints about wrongdoing that he had observed. The agency has also warned Wells Fargo that it is likely to order the bank to reinstate another worker who said she was fired in 2011 after trying to call her supervisors’ attention to accounts that she said had been fraudulently created. So far, Shearman  Sterling has found no evidence of retaliation, said Stuart J. Baskin, a partner at the firm. “We still have a few loose ends, but we don’t think it’s likely to change any findings,” he said. Wells Fargo is eager to put its sales scandal behind it, but customers are not quite so willing to move on. The number of consumer checking accounts opened in February dropped 43 percent compared with a year earlier, and credit card applications declined 55 percent. The financial damage caused to customers by Wells Fargo’s fraudulent acts was relatively minimal, but the issue has loomed large in the public imagination in part because the bank’s transgressions were so blatant  —   and so simple. “People getting accounts they didn’t sign up for?” said Stephen Beck, the founder of CG42, a strategy company that studies banks’ brand perception. “I don’t need an M. B. A. in finance to understand that’s wrong. Our expectation is that it is going to take quite a bit of time for Wells to recover. You can’t just advertise ‘Trust me,’ which is what they’ve tried to do so far. ” Mr. Sloan, the bank president, said at a news conference after the report was issued that he had some regrets about how the bank’s leadership  —   and he in particular  —   had handled the years of warnings. “In hindsight, I wish we would have taken more action and would have done things more quickly,” he said. The bank’s sales incentives should have been eliminated sooner, he said.'"}, "time": 1742564149.643157}