{"duration": 0.48165464401245117, "input_args": {"text": "\"by Lambert Strether \\nBy Lambert Strether of Corrente . \\nDallas readers: Yves writes to say her plane is getting in early, and so, there having been no untoward events, the Meetup will be held as scheduled! \\nTPP, TTIP, TISA \\nCETA: A week of pressure from four Belgian regions opposed to CETA, led by the courageous Walloons, produced a revised “joint interpretive instrument” and, importantly, a new list of conditions that must be met before Belgium can ratify the deal” [ Rabble.ca ]. “Unfortunately, the joint interpretive ‘instrument’ is mostly artful deception. To take just one example, the instrument’s affirmation of the right to regulate is meaningless. Of course, the parties have not entirely given up their right to regulate. But the fact is, even if the instrument had full legal force under international law, CETA would still threaten the ability of Canada or EU governments to regulate in the public interest, enhance public services, and hold multinational companies accountable for their actions. ‘The critical point missing,’ as we wrote previously, ‘is that while the parties retain the right to regulate, they must do so in conformity with their CETA obligations and commitments.'” So it will be interesting to see if Obama tries a similar deception on TPP. But wait! \\nWallonia’s principled stand did, however, produce some important results. While most of the media attention in Canada appears to have focused on the joint instrument, the more interesting and potentially significant development may be the accord between Belgian governments that spells out the grounds for Belgium’s federal government to sign CETA. \\nFor example, Belgium will now ask the European Court of Justice to give an opinion on the legality of CETA’s investment court system within the EU. Even more importantly, four of Belgium’s regional governments also state that they reject CETA (notably its investment chapter) as negotiated and that Belgium will refuse to ratify the treaty unless these concerns are addressed. In other words, while Belgium is now in a position to sign CETA, it will not be able to ratify the deal as it stands. \\nThis means that CETA’s investment chapter, at a minimum, must be revised or the investment court system scrapped, before CETA can be ratified by Belgium. The accord also includes assurances that if any Belgian regional government refuses to ratify CETA, the federal government must give notice to the EU that Belgium cannot ratify, an act that could potentially trigger the end of CETA’s provisional application in all European member states. \\nThe German constitutional court staked out a similar position in the event that Germany fails to ratify CETA. That decision, by the way, will not be made by the German government alone, but in conjunction with Germany’s second chamber, which is currently controlled by the anti-CETA Greens and Left parties. \\nSo while CETA proponents have undoubtedly cleared a big albeit unanticipated hurdle in getting the deal signed, their machinations may have made CETA’s full ratification even less likely. CETA’s passage in Europe is far from assured, despite the apparent breakthrough in Belgium. \\nAnd then there is the voice of the Canadian establishment– \\nCETA: “CETA puts Canada’s trade debate to rest once and for all” [ Globe and Mail ]. “The rationale for launching CETA in Canada was in large part to establish a measure of diversification from the country’s trade relations within the North American free-trade agreement. Given the tone around trade in the U.S. presidential election, this decision now looks especially prescient.” \\nCETA: “What the Canada-EU Deal Means for the Future of Trade” [ Fortune ]. “All of the factors that drove Europe to conclude this agreement provide insights for current trade challenges in the U.S. President Obama is trying to get Congress to approve just after the presidential election the Trans-Pacific Partnership (TPP) agreement… Now is the time to resolve as many specific congressional objections to the deal as possible. It is impossible to renegotiate the TPP in the time available, so as with the last-minute negotiations between the EU and Belgium, both the administration and Congress will need to be pragmatic and come to an agreement quickly on outstanding issues.” \\nTISA: “The 21st round of negotiations for the Trade in Services Agreement kicks off this morning in Geneva, and stakes are high for significant progress to be made this round in order for the deal to wrap up by its early December deadline. Significant issues remain, including data flows — where the European Union is still working to come up with a consolidated position — and new services, on which the EU and others are continuing to push for the right to apply different regulations to domestic and foreign constituents rather than afford the same treatment to all TISA partners. The round is scheduled to last through Nov. 10” [ Politico ]. \\n2016 \\nDays until: 5. That’s not very many days! \\nDebates \\n“Presidential Candidates Dr. Jill Stein & Gov. Gary Johnson [Pt. 1]” [ Tavis Smiley ]. A forum-style “conversation” between the two. \\n“‘I had a team of people who were relentless, totally in the head of what Trump might do,’ [Hillary Clinton] says” [ People ] “‘A lot of this comes down to who gets into whose head. It’s like an athletic contest or maybe a high-stakes entertainment performance.” \\nWar Drums \\n“In the five and a half years since the uprising in Syria began, it has become the most catastrophic war of our young century” [Dexter Filkins, The New Yorker ]. I would have thought that our invasion of Iraq in 2003 set the baseline for “catastrophic”? What the heck was Filkins thinking when he wrote that sentence? And The New Yorker used to be famous for its fact-checking. When did that get crapified, anyhow? \\nThe Voters \\n“[W]hile Trump and many of his supporters may fetishize a past that is deeply retrograde, liberals and progressives have also demonstrated a troubling tendency to fetishize a future that they presume is on their side. There’s something peculiarly telling about this kind of progress fetishism, which has been conscripted as ideology-of-first-resort for Clintonite New Democrats” [ The Baffer ]. “When our historical terrain has effectively focused most of our political energies to differentiating ourselves from the not-woke-enough opponents of progress, we can lose all critical introspection. We can uncritically pass over the fact that, say, liberal multiculturalism can end up being really racist , tolerance of queer sexualities can end up repackaging biologically determinist languages of eugenics, and so on. Moreover, as the rise of the New Democrats has made crystal clear (from Bill and Hillary to Obama), we will dependably base our biggest political choices on our future-focused need to have our place on the right side of history confirmed. So what if that means more drone strikes, deportations, mass incarceration of minorities, destructive free trade agreements, corporate concessions, and financial deregulation? It’s messy ‘maintaining’ history, after all.” \\n“Early Voting a Poor Predictor of Final Results” [ RealClearPolitics ]. One of several reasons: “[W]e don’t know the effect to which campaign strategy is creating the appearance of a participation surge by merely cannibalizing Election Day voters by mobilizing voters who would have voted on Election Day anyway.” \\nDownballot \\n“The presidential race may be inducing whiplash, but the House battleground remains relatively stable in the final week. We rate only 40 House races in Lean or Toss Up, and Democrats would need to sweep 35 of them to win control, so Republicans remain overwhelming favorites to hold onto their majority. But there is still plenty of uncertainty about the size of that majority: Democrats could gain anywhere from 5 to 20 seats” [ Cook Political Report ]. ” Republican voters have begun coming home to Donald Trump amid the Comey news… Even if control is not at risk, the ultimate size of the GOP majority matters a great deal, especially to Speaker Paul Ryan. To the extent Republicans lose seats, almost all of the casualties will be swing-district moderates who are more loyal to Ryan than Trump. The narrower the majority, the less room for error Ryan will have in winning reelection to his position and navigating the 2017 legislative minefield.” \\nWell done, DSCC: For Senate this year, Dems nominated two weed opponents (NV, NH), corp lobbyists (PA, IN), & a trust fund kid former Republican (FL) \\n&mdash; Lee Fang (@lhfang) November 2, 2016 \\nThe Trail \\n“SEPTA strike halts transit service in Philadelphia” [ Progressive Railroading ]. Effect on voting? \\n“[T]he race between [Clinton and Trump] is now a precise dead heat in the latest ABC News/Washington Post tracking poll, 46-46 percent. A majority, 55 percent, continues to expect Clinton to win, though that’s down 5 points from its peak last week” [ ABC ]. ” Among other results is a gradual collapse in support for Libertarian Party candidate Gary Johnson, from a peak of 9 percent support in September to just 3 percent now. Jill Stein of the Green Party has 2 percent and has held steady.” Amazingly, Trump now leads on honesty and trustworthiness. Of course, it’s madness to focus on individual polls; RCP’s 4-way average has Clinton up by 1.9, though falling. \\n“With the fallout over the FBI email probe continuing to take up oxygen, Trump has stayed uncharacteristically on message. Campaigning near Philadelphia on Tuesday, the GOP nominee and his running mate focused on the projected 25 percent average increase in premiums for some Affordable Care Act plans, as open enrollment began. Trump let Mike Pence do most of the talking, and the Indiana governor closed his remarks on repealing the law by asking Republicans to “come home'” [ RealClearPolitics ]. Hitherto, Trump has been the anti-Napoleon, always interrupting his enemy when they are making a mistake. Not so this week (though there are 5 days to go). Kellyanne Conway must have gotten Trump’s attention somehow. Or Ivanka. \\n“Donald Trump Voters, Just Hear Me Out” [The Moustache of Understanding, New York Times ]. Four paragraphs in, he turns to the topic of Trump: “Trump is not only a flawed politician, he’s an indecent human being.” Persuasive! I dunno. If a vote for Trump would finally force Friedman off the Times Op-Ed page, would it be worth it? Tough call. \\nRealignment \\n“Will this be the election that finally kills off the Democratic and Republican parties?” [ McClatchy ]. “Just days before Election Day, interviews with more than 40 independent voters in swing states underscores that the nomination of two deeply unpopular candidates for president is aggravating and reinforcing a growing trend in the country away from the Democratic and Republican parties, which more and more voters see as out of touch with their lives and out of date in a new century. The number of free agent voters registering as independent or unaffiliated is soaring, while Republican and Democratic numbers flatline. Independent registrations have jumped since 2008 by 22.3 percent in states that keep registration data by party. Democrats over that same time increased 2.7 percent and Republicans 3.6 percent…” \\n“6 Reasons Why A New Civil War Is Possible And Terrifying” [ Cracked ]. “‘Trust’ isn’t just an intangible concept when we’re talking about the potential for civil warfare. Sinisa Malesevic is a professor who studies the sociology of civil wars and a survivor of the Yugoslavian civil war. He’s someone Marvel really should’ve reached out to for script advice, and he noted the breakdown of trust was one of the first traumatizing steps to war, ‘… in a very short period of time, there is a complete sense of fear, you do not know who is who, who is supporting which side … that fear spreads.'” And: “Colonel Couvillon also thought any conflict was likely to start in a rural area, ‘…people talk about, is it gonna be class warfare, race warfare … is it gonna be north versus south? Personally, I think it’s gonna be urban versus rural.'” Another interesting piece from Cracked, of all places. \\nDemocrat Email Hairball \\n“Opinion: Hillary Clinton is irreparably damaged, even if she wins” [ MarketWatch ]. “[W]e are in for a fiasco in politics that will make even this fiasco of a campaign pale by comparison. There is hardly any scenario that is too far-fetched. Even if the polls are right and Clinton’s lead translates into an electoral victory, she will be so damaged going into office that her chances of getting anything done will be virtually nil. In this sense alone, Trump’s claim that this scandal is “worse than Watergate” could prove to be true. As an incumbent, Richard Nixon at least had an administration in place when he won re-election in 1972, though it took nearly another two years before he was forced to resign under threat of impeachment.” \\n“U.S. Sen. Ron Johnson said Monday he believes Hillary Clinton’s actions with her private email server are impeachable offenses should she be elected president” [ Beloit Daily News ]. “Johnson cited 18 U.S. Code 793 (f) and 18 U.S. Code 2071, which have to do with the willful destruction or removal from proper custody of information relating to national defense. Johnson honed in on the latter of the two, which reads in part that anyone found to have concealed or removed records ‘shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the United States.’‘I’m not a lawyer, but this is clearly written,’ Johnson said. ‘I would say yes, high crime or misdemeanor, I believe she is in violation of both laws.'” In principle, I agree. If a high official can privatize their communications, and then decide what to destroy and what to retain before turning them over to law enforcement, the term “public records” becomes literally meaningless. Nixon, deep within his withered and wormy soul, retained a shred of conscience: He didn’t simply destroy the tapes . Clinton would have destroyed the tapes without hesitation; in fact, that’s exactly what she did with “her”— that is, the public’s — mail. \\n“Wisconsin Rep. Jim Sensenbrenner told conservative radio host Charlie Sykes Tuesday that there would be a ‘constitutional crisis’ if Clinton was indicted, and when asked about impeachment, answered, ‘I think that is something that is speculative in nature. I’m speculating, what I can say is that I think Richard Nixon would have been indicted and he would have been impeached. He stopped the impeachment by resigning as a result of Watergate and he stopped the indictment by President Ford pardoning him” [ CNN ]. On pardons, see Jerri-Lynn’s post today . \\nStats Watch \\nADP Employment Report, October 2016: “ADP sees significant softening for Friday’s employment report, estimating October private payrolls will come in at 147,000” [ Econoday ]. “Though ADP’s revision does point to an upward revision to September’s data in Friday’s report, the October estimate is soft and could further lower expectations for a rate hike at today’s FOMC meeting.” And but: ” ADP is showing jobs growth equalling the rate of people entering the jobs market. The growth this month is as Econintersect forecasted based on economic potential” [ Econintersect ]. “ADP employment has not been a good predictor of BLS non-farm private job growth. \\nGallup U.S. Job Creation Index, October 2016: “American workers’ reports of hiring activity at their place of employment remained relatively strong in October, with many more saying their employer was adding rather than subtracting jobs” [ Econoday ]. “For nearly all of Gallup’s JCI trend since August 2008, net hiring in the private sector has far outpaced government net hiring. But the latest poll shows the narrowest gap between net hiring in the two sectors since April 2009, with nongovernment hiring (plus 32) essentially tied with government hiring (plus 31).” \\nMBA Mortgage Applications, week of October 28, 2016: “Purchase applications for home mortgages fell a seasonally adjusted 0.4 percent in the October 28 week, following a sharp 7 percent decline in the prior week to the lowest level since January” [ Econoday ]. \\nShipping: “US west coast employers and [ILWU and PMA] union leaders are to continue talks about extending the current employment contract covering dockworkers.The two sides met on Tuesday to discuss an extension beyond mid-2019 as part of an effort to restore confidence in ports along the Pacific seaboard” [ Lloyd’s List ]. \\nShipping: “Are conditions finally improving for the air cargo industry?” [ Air Cargo News ]. “September market round-up shows that air cargo volume demand increased by 5% year on year in September — a level of increase not seen for two years. ‘With such an increase in total weight transported, a further worldwide yield improvement over previous months, and industry sources claiming that October will be even better, one could be forgiven for thinking that the industry shows signs of improving health,’ the analyst said.” There’s a calendar effect that only accounts for a fraction of the increase. “At the recent Air Cargo Forum there was much speculation as to what had caused the improvements.” A sporty game! \\nShipping: “A majority of Splash readers fear container freight rates will only pick up later than 2020. With 10 days to go until voting closes in our quarterly online survey, called MarPoll, roughly one quarter of the more than 500 respondents to date feel container freight rates will pick up only after 2020” [ Splash 24/7 ]. “‘Shipping may have to accept the bubble has burst and what was will not be again. There is a new normal and companies need to plan as such,’ one respondent noted” \\nShipping: “[The Boston Consulting Group Inc.] said shipping capacity will outstrip demand by between 8.2% and 13.8% in 2020, compared with a 7% gap today. If borne out, that forecast would indicate this year’s plunging freight rates and shrinking profits for marine carriers will only grow worse, particularly on major trade lanes across the Pacific and between Asia and Europe” [ Wall Street Journal , “More Pain Ahead for Ocean Shipping”]. “The shipping industry hasn’t adjusted to a slowdown in global trade, with shipyards churning out giant container vessels and carriers holding onto excess capacity even as rates fall. Historically, container shipping demand grew over 5% annually, often outpacing global economic growth. Between 2015 and 2020, BCG estimates container demand will rise between 2.2% and 3.8% annually.” And we’re still building out warehouses… \\nShipping: “Cummins shipped just 16,400 engines in North America in the quarter, down 33% from a year ago. That’s in line with a downturn in orders for big rigs that’s triggered layoffs among truck makers and led Cummins to cut its spending on research and engineering more than 14% in the first nine months of the year” [ Wall Street Journal ]. \\nShipping: “Shipping finally emerging from 2009 downturn, Mitropoulos argues” [ Lloyd’s List ]. “Signs are finally materialising that the industry is emerging from its protracted downturn, according to a former secretary-general of the International Maritime Organization.Efthimios Mitropoulos was speaking on Tuesday morning at the Shipping and the Law Conference in Naples.” Great courage! \\nHoney for the Bears: “Most of the leading indicators are based on factors which are known to have significant backward revisions – and one cannot take any of their trends to the bank. I continue to pose the question: “[W]hat good is a leading indicator where the data is continued to change after it is issued?'” [ Econintersect ]. “The only indicators with minimal backward revision are ECRI, RecessionALERT, and the Chemical Activity Barometer. Unfortunately, the Chemical Activity Barometer is targeted to the industrial sector of the economy – and at best seems to be a coincident indicator, not a leading indicator. Both ECRI and RecessionALERT were forecasting economic improvement beginning at mid-2016 – and is now forecasting flat (but relatively better) growth beginning 5 months from now. Econintersect sees NO dynamic which will deliver better growth anyone will feel in the foreseeable future. All economic growth will only be seen when one uses a calculator.” \\nInfrastructure: “A pipeline explosion in Alabama is roiling U.S. fuel markets and putting a spotlight on tight domestic shipping capacity. The major Colonial pipeline fuel artery was severed for the second time in two months this week” [ Wall Street Journal ]. \\nFodder for the Bulls: “Update: The Endless Parade of Recession Calls” [ Calculated Risk ]. “Looking at the economic data, the odds of a recession in 2016 are very low (extremely unlikely in my view). [a recession in 2017 is very unlikely]. Someday I’ll make another recession call, but I’m not even on recession watch now.” \\nFodder for the Bulls: “Eurozone factories had their most active month for almost three years in October, and raised their prices for the first time in more than a year, according to a survey of purchasing managers released Wednesday” [ Wall Street Journal , “Eurozone Factory Survey Shows Expansion”]. \\nToday’s Fear & Greed Index: 18 Fear (previous close: 22, Fear) [ CNN ]. One week ago: 43 (Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Nov 2 at 11:26am. Heading for single digits? \\nPolice State Watch \\n“Raided but never charged, cannabis distributor seeks return of seized assets” [ San Diego Tribune (RF)]. “‘It’s the dirty little secret of the American justice system,’ [James] Slatic said in an interview. ‘They can come in and take all your money and property just on the say-so of a police officer. Once they do that, you have to go to court and prove why your money is not guilty.'” (Obama made noises about ending asset forfeiture, but resumed it . Of course, asset forfeiture will be a lot easier when digital cash arrives! \\nStanding Rock and #NoDAPL \\n“I used to think there was no rational argument for civilian possession of military-style weapons. But in light of the disparate treatment of the armed Malheur National Wildlife Refuge occupiers (who were acquitted of all charges Friday) and the protesters in North Dakota supporting the Standing Rock Sioux Reservation in its fight against construction of an oil pipeline, it’s apparent that such weapons are now an effective component of the protester’s toolkit” [Letter to the Editor, Los Angeles Times ]. Well, the difference isn’t that the Malheur occupiers were white, given that the (sadly but mostly) white Occupy movement was treated to a 17-city coordinated paramilitary crackdown orchestrated by Obama’s DHS; the difference is that they were right wing (and white). So the Sioux are both the “wrong” color, and their cause is percieved by the country at large as on the left (though I think the Sioux themselves would reject that framework). \\n“Want to Help the Standing Rock Sioux? Here’s Where to Donate” [ Money (!!)]. “A GoFundMe set up by protester Ho Waste Wakiya Wicasa has raised more than $1 million, which will be used for the camp’s operating expenses. “The money goes as quickly as it comes, but without it having been as much as it is, we certainly wouldn’t have been able to be as productive as we have been in the fight,” Wicasa told Fox News. The funds raised have been used for groceries, yurts, toilets, a medical area, a generator, and bail for those arrested.” \\n“After 37 Ohio State Highway Patrol troopers left for the Standing Rock protests in North Dakota Saturday, a majority of Cincinnati City Council issued a letter to Gov. John Kasich requesting the troopers be brought home” [ USA Today ]. “The signers said the trooper should come home so they can focus on Ohio issues, naming the heroin epidemic and increased traffic fatalities.” Tough choice. After all, the troopers could use the practice. \\nBlack Injustice Tipping Point \\n“Net worth of white households in D.C. region is 81 times that of black households” [ WaPo ]. “The Urban Institute report, called “The Color of Wealth in the Nation’s Capital,” said the Great Recession and housing crisis of 2007 to 2009 exacerbated long-persistent disparities, with black and Hispanic households losing about half of their wealth.” \\nClass Warfare \\n“Data can help hotel executives manage workforce” [ Hotel News Notes ]. “Performance evaluations are another area where big data can play an important role. Instead of the usual, subjective assessments by supervisors, employees can be judged through company-tracked data, which may measure:” Punctuality; results of client/manager surveys; tracking of output keyed directly to the percentage of time and input of all contributing workers; and non-health related biometric data or other feedback associated with wearable technology, such as how employees traverse during the workday. \\nThis creates a more objective review process – reducing bias and the threat of lawsuits – and takes pressure off supervisors. \\nThat little point on wearables seems a little Orwellian. They won’t be able to force me to wear my wearable at all times , right? \\n“The east sides of New York, London and Paris are noticeably and famously poorer than their western sides. And it turns out there’s a reason for that” [ MarketWatch ]. “Researchers have found that it’s due to the impact of air pollutants at the time of the Industrial Revolution, as prevailing winds in the U.S. and Europe typically blow from west to east. And it’s an impact that has lasted into today” ( original study ). \\n“Twenty-First Century Victorians” [ Jacobin ]. “Today’s upper middle class maintains the fiction of a meritocratic society, just as the Victorians did. This story allows them to shore up their economic position behind the backs of workers, who are taught that their health problems and dismal career prospects represent individual faults, not systemic dysfunction. Of course, exercising, eating organic food, and pushing children to use their spare time usefully are not inherently bad things. However, they become markers of bourgeois values when they are marshaled to assert one class’s moral superiority over another and to justify social inequality. It was just as obnoxious in the nineteenth century as it is today.” \\nUPDATE “Behind 2016’s Turmoil, a Crisis of White Identity” [Amanda Taub, New York Times ] “Whiteness, in this context, is more than just skin color. You could define it as membership in the ‘ethno-national majority,’ but that’s a mouthful. What it really means is the privilege of not being defined as ‘other.’ Whiteness means being part of the group whose appearance, traditions, religion and even food are the default norm. It’s being a person who, by unspoken rules, was long entitled as part of ‘us’ instead of ‘them.'” Peak identity politics? I wonder how many of the academic entrepreneurs pushing this stuff live in leafy suburbs, or nice little college towns… \\n“Socially influenced preferences” [ Stumbling and Mumbling ]. Wait, what? Actors aren’t atomized, “rational” individuals? \\nNews of the Wired \\n“How Ancient Humans Reached Remote South Pacific Islands” [ New York Times ]. “‘Our paper supports the idea that what people needed was boating technology or navigation technology that would allow them to move efficiently against the wind,’ Dr. Montenegro said.” \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (Re Silc): \\nOK, OK. There are plants in this. The grass, those fronds in the background… \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate\""}, "time": 1742561697.392727}