{"duration": 0.10136270523071289, "input_args": {"text": "'WASHINGTON  —   The White House on Friday revived President Trump’s unproven wiretapping allegations against the Obama administration, insisting that there is new evidence that it conducted “politically motivated” surveillance of Mr. Trump’s presidential campaign. Senior government officials, including James B. Comey, the F. B. I. director, and lawmakers from both parties, have repeatedly and forcefully rejected the president’s claim, saying they have seen no evidence of direct surveillance. A spokesman for former President Barack Obama has denied that Mr. Obama ever ordered surveillance of Mr. Trump or his associates. But Sean Spicer, the White House press secretary, asserted to reporters during his daily news briefing that members of Mr. Obama’s administration had done “very, very bad things,” just as Mr. Trump alleged without proof on March 4 when he posted messages on Twitter accusing Mr. Obama of “wire tapping” his phones at Trump Tower. “The question is why? Who else did it? Was it ordered? By whom?” Mr. Spicer said. “But I think more and more the substance that continues to come out on the record by individuals continues to point to exactly what the president was talking about that day. ” Mr. Spicer appeared to be basing his assertions on reports from   news outlets that took out of context a   interview with a former Obama administration official. Mr. Spicer’s comments came in the midst of a drumbeat of developments in the multiple investigations into Russian contacts with Mr. Trump’s associates, and a week after the president failed to make good on his campaign promise to replace Mr. Obama’s signature health care law. The two story lines have helped drag down Mr. Trump’s approval ratings, which slumped to a low of 35 percent in Gallup’s tracking poll on Wednesday. Mr. Spicer’s remarks on Friday seemed designed to give new life to the allegations against Mr. Obama after weeks of trying to focus attention on the damage that Mr. Spicer said had been caused by leaks from the investigations into Russia’s involvement in the 2016 presidential campaign. The allegations dominated his briefing, crowding out other parts of the White House agenda, including the president’s signing of two executive orders on trade and meeting with manufacturing executives. Mr. Trump hastily left that signing ceremony without adding his signature to the trade orders as a reporter shouted a question about possible testimony in the Russia inquiry by Michael T. Flynn, his former national security adviser. The White House said Mr. Trump signed the directives later. At Mr. Spicer’s news conference, the press secretary chastised reporters for failing to accept that Mr. Trump had been right all along. “The substance we are talking about continues to move exactly in the direction that the president spoke about in terms of surveillance that occurred,” Mr. Spicer said, even as he deflected questions about the White House’s role in providing intelligence reports to Representative Devin Nunes, Republican of California, the chairman of the House Intelligence Committee. The senior Democrat on that committee, Representative Adam B. Schiff of California, arrived later in the day at the White House to view the intelligence reports. In a statement, Mr. Schiff confirmed that they were the same materials Mr. Nunes had seen, and said that nothing justified Mr. Nunes’s failure to share them with the entire committee. “The White House has yet to explain why senior White House staff apparently shared these materials with but one member of either committee, only for their contents to be briefed back to the White House,” Mr. Schiff said in a statement. Mr. Spicer provided no evidence of the surveillance allegations. But he pointed several times to news reports that he claimed backed up the president’s accusations. One was a March 2 interview with Evelyn Farkas, who served as deputy assistant secretary of defense in the Obama administration until leaving the government in October 2015. TheGatewayPundit. com, a   site, called it a “notorious” interview and said it proved Obama administration officials had disseminated “intel gathered on the Trump team. ” Reince Priebus, the White House chief of staff, said on the Hugh Hewitt radio show that Ms. Farkas had made “just an incredible statement. ” Breitbart News reported on Mr. Priebus’s comments. The comments by Ms. Farkas, Mr. Spicer said, were evidence that Mr. Trump or his associates “were surveilled, had their information unmasked, made it available, was politically spread. ” He said that such stories were proof that Obama administration officials had “misused, mishandled and potentially did some very, very bad things with classified information. ” In fact, the reports do not back up the allegations that Mr. Trump or any officials in his campaign were ever under surveillance. In the March 2 interview on MSNBC’s “Morning Joe” program, Ms. Farkas said she had expressed concern to her former colleagues about the need to secure intelligence related to the Russian hacking of the American election. Ms. Farkas was commenting on a New York Times article a day earlier that documented how in the days before Mr. Trump’s inauguration, Obama administration officials had sought to ensure the preservation of those documents in order to leave a clear trail for government investigators after Mr. Trump took office. In a statement she gave to The American Spectator, a conservative publication, Ms. Farkas said the furor over her remarks was “a wild misinterpretation of comments I made on the air in March. ” She added, “I was out of government, I didn’t have any classified information, or any knowledge of ‘tapping’ or leaking or the N. Y. T. article before it came out. ” White House officials also confronted on Friday the disclosure that Mr. Flynn, who resigned in February over his contacts with Russian officials, has offered to testify before the two congressional committees investigating the Trump campaign’s ties to Russia about those contacts in exchange for immunity from prosecution. Mr. Trump said on Twitter on Friday morning that he agreed with Mr. Flynn’s proposal. “Mike Flynn should ask for immunity in that this is a witch hunt (excuse for big election loss) by media  Dems, of historic proportion!” Mr. Trump wrote. The president has been eager to dismiss as “fake news” all allegations that members of his campaign colluded with the Russians, and the post appeared to be an effort to discredit the congressional inquiries that are examining those claims. It also appeared to be aimed at defusing any speculation that Mr. Flynn might be seeking immunity because he has incriminating information to share about Mr. Trump or his associates. It was not clear from the president’s post on Friday whether he fully appreciated the potential effect on his administration if Mr. Flynn received immunity to participate fully in the investigation. Mr. Trump has said previously that seeking protection from prosecution is a telltale sign of wrongdoing. “If you’re not guilty of a crime, what do you need immunity for, right?” he said in September at a campaign rally in Orlando, Fla. Mr. Trump was referring to Hillary Clinton aides who received immunity during an F. B. I. inquiry into her use of a private email server. Mr. Spicer declined to address the inconsistency, telling reporters on Friday only that Mr. Trump “believes that Mike Flynn should go testify. ” “He thinks that he should go up there and do what he has to do to get the story out,” Mr. Spicer said. The F. B. I. is investigating whether any of Mr. Trump’s advisers colluded with Russia in its efforts to disrupt the 2016 election. An immunity deal would make it extraordinarily difficult for the Justice Department to prosecute Mr. Flynn. Mr. Schiff said Mr. Flynn’s decision to seek immunity from prosecution was a “grave and momentous step,” but not one that investigators were ready to consider at this stage. “While Mr. Flynn’s testimony is of great interest to our committee, we are also deeply mindful of the interests of the Justice Department in the matter,” Mr. Schiff said in a statement. He added that before considering immunity for any witness in the inquiry, “we will of course require a detailed proffer of any intended testimony. ”'"}, "time": 1742562272.3593426}