{"duration": 0.09351730346679688, "input_args": {"text": "\"Posted on October 28, 2016 by Jack Burns \\nAs The Free Thought Project has reported, Project Veritas ’ undercover sting operation, of the Clinton Campaign and the Democratic National Committee’s alleged subversive tactics using Democracy Partners and Americans United for Change, has now been exposed for the whole world to see. This week, PV released the fourth video in their series, and once again, Democracy Partners’ founder, Robert Creamer , is at the center of the controversy (It must be noted DP makes no mention on its website of Creamer as its founder and currently has him listed as a consultant ). \\nCreamer, who visited the White House 342 times (47 of those with Barack H. Obama), was caught on PV’s fourth video, and in emails, arranging an illegal $20,000 foreign contribution to Americans United for Change (AUFC), the same group which proudly stated was creating chaos at Trump events. \\nActivists at PV arranged the donation with the knowledge it was illegal, to see if AUFC would take the bait. They did. And in return, they agreed to unwittingly take on another PV activist as an AUFC staffer. In other words, PV paid AUFC $20K, and was allowed to place the pseudo-donor’s “niece” inside the organization, a move PV felt was worthwhile to be able to expose the organization’s dirty deeds. It worked. \\nPV’s first video revealed AUFC’s Scott Foval coordinated and arranged for paid instigators to go out and “start shit” with Trump protesters, all of which was caught on tape for the mainstream media to use in its echo chamber to paint Trump and his supporters as racists, xenophobes and bigots. \\nPV’s second video showed how AUFC’s organization and its affiliates commit intentional mass voter fraud. The second video is an instructional video of sorts on, “how to successfully commit voter fraud on a massive scale,” according to PV president James O’Keefe . \\nIn the third PV video, Creamer can be seen stating Hillary Clinton herself wanted “ ducks on the ground ” in some bizarre idea to stage anti-Trump demonstrations by activists dressed as Donald Duck. The DNC’s Donna Brazile was also implicated in collaboration with the scheme. \\nBut it’s the fourth video that’s getting all of the attention now, as it purports to show AUFC knowingly received a $20,000 illegal wire transfer out of Belize. Creamer, who we know has a close relationship with the White House via visitor logs, also brags about his friendship with Barack Obama, and intimates he can arrange meetings with the president and the former secretary of state, for a price. \\n“I’ve known the president since he was a community organizer in Chicago,” Creamer proudly stated adding, “Every morning, I am on a call at 10:30 that goes over the message being driven by the campaign (Clinton) headquarters.” With Creamer having spent nearly a year inside the White House, and his relationship with the president, it may be easy for some to conclude the Obama administration was also involved in Creamer’s schemes. \\nPV invented the donor and shell company based in Belize, Charles C. Roth III of Repulse Bay Company, who the organization claimed to Democracy Partners was a rich donor who wanted to make a difference and stop Trump from becoming the next POTUS. Creamer then tapped the president of AUFC, Brad Woodhouse, to iron out the details of the illegal contribution. The wire transfer was arranged and transmitted. Creamer confirmed as much. \\nOn a recorded phone call Creamer can be heard saying the funds “absolutely came through.” In exchange for the donation, the outspoken friend of the Obamas granted an internship to Roth’s niece, an undercover PV journalist, to work inside Democracy Partners. \\nIn another recorded video session, Creamer can be seen and overheard describing what he and his partners at AUFC do. Creamer stated he gets his marching orders at his 10:30 conference call to troll the Trump/Pence campaign creating incidents for the “earned media” to cover which echo the message the Clinton campaign wanted to project. That “earned media”, as we’ve come to realize through the latest email dump by Wikileaks, is the mainstream media which is apparently in the tank for Clinton. \\nCreamer also discussed allegations of sexual misconduct by Trump accusers and intimated those allegations came first through his organization’s connections, which is a contention Trump made at the third and final debate with Clinton. Creamer also hinted around at the possibility of arranging a meeting between Roth and Obama. “I do a lot of work with the White House on their issues,” he stated plainly adding, “helping to run issue campaigns (immigration, ACA, gun violence).” \\nWhile the PV sting was focused on the presidential election of 2016, and the White House, the DNC, and the Clinton Campaign’s involvement in painting Donald Trump as a racist, xenophobe, and bigot, Creamer’s comment on his involvement in working with the White House on issues of gun violence, leaves more questions than answers. \\nAs an aside, here you have a well-connected political hit man like Creamer, working with AUFC to create violence, chaos and anarchy at Trump rallies, discussing his role in promoting gun violence issues for the White House. Taken together, considering Creamers comments and actions, all may lend credibility to conspiracy theorists’ claims the Obama administration has been actively promoting false flag school shootings, on-air shootings of reporters, and mall shootings, all in an attempt to sway the American public against the people’s right to keep and bear arms (2 nd Amendment to the U.S. Constitution). Creamer admitted as much saying he was, “trying to make America more like Britain when it comes to gun violence issues.” \\nTurning again to PV fourth video, upon realizing PV was soon to go public with its expose’, AUFC returned the 20k foreign company shell company donation on September 9 th . O’Keefe, as an epilogue to the video, openly wondered why AUFC held onto the funds for a month before returning what they undoubtedly knew to be an illegal contribution. Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742563620.213369}