{"duration": 0.15816164016723633, "input_args": {"text": "'By wmw_admin on October 30, 2016 Finian Cunningham — Strategic Culture Oct 29, 2016 \\nThe Western media storm has suddenly quietened. For several months, there has been a howling campaign orchestrated by Western governments to discredit the anti-terror operations carried out by the Syrian army and its Russian ally to retake the crucial battleground city of Aleppo. \\nWestern leaders, amplified by dutiful media outlets, have been relentlessly accusing Russia of war crimes and threatening to launch prosecutions at the International Criminal Court in the Hague. Dubious images and claims of children suffering in Aleppo, allegedly from Syrian and Russian air strikes, were broadcast like a blizzard. Western news presenters were breaking down in tears. Politicians were continually interviewed with stoney faces issuing sanctimonious condemnations. \\nRemarkably, this week the emotive Western media onslaught over Aleppo has abated. What’s going on? How can such apparent concern about humanitarian conditions suddenly cease? The evident switch-like attention suggests that the seeming Western outcry was a psychological operation from the outset. \\nSyrian and Russian forces had consistently rejected Western claims of indiscriminate bombing against civilians in Aleppo. They countered that it was their legal right to vanquish illegally armed insurgents holding the eastern part of the strategic city under a reign of terror since 2012. \\nRussia’s initiative of implementing a three-day ceasefire in east Aleppo last week proved several points. \\nFirstly, the besieging militants once again, as with the earlier failed ceasefire called by US secretary of state John Kerry and Russian foreign minister Sergey Lavrov, refused to separate into so-called «moderate rebels» and the known terror groups of Jabhat al Nusra. That failure to dissociate proved that the Western narrative of «good rebels and bad rebels» is bogus. Whereas Russia’s assessment of the violence being waged by a proxy army of amalgamated extremists going by myriad, chimerical names is vindicated. That means that all anti-government militants are legitimate targets for elimination if they do not surrender. \\nWhen Syrian and Russian operations resume to finally take all of Aleppo, then any further Western objections and protests are undermined by the recent debacles of truces being repudiated by the militants of all stripes. \\nSecondly, the truce and UN aid efforts last week in Aleppo were again constantly violated, unilaterally, by the militants, who fired and shelled at six humanitarian corridors established by the Syrian and Russian authorities. Although one group of nearly 50 civilians managed to escape from east Aleppo and were taken into care – recounting experiences of being held as human shields and living under a reign of terror for the past four years – the majority of the residents were evidently prevented by their terrorist captors from availing of the humanitarian access. There were reports of an Imam being executed by the militants in east Aleppo for daring to instruct some civilians to break out of the besieged city quarter. There were also other reports of the insurgents stealing food aid from starving residents. In desperate phone calls, besieged people were even calling for the Syrian army and Russian forces to redouble their military operations to liberate the city. \\nTaken together, it would seem untenable for the Western media to maintain the narrative that Syrian and Russian military are somehow brutally pounding a noble rebel resistance and massacring civilians. That narrative just doesn’t hold water if a cursory admission of factual circumstances is permitted. \\nIt seems significant that the Western media hysteria over Aleppo tamped down just as reports emerged of the White House backing away from a contemplated increased military intervention in Syria. \\nOn Monday this week the Washington Post headlined : «White House skepticism stalls plan to boost CIA-backed rebels in Syria». \\nThe newspaper added: «Officials said there are growing doubts about what the fighters can achieve because of Russia’s intervention, and President Obama now seems inclined to leave the fate of the CIA program, which has been the centerpiece of US strategy, up to the next occupant of the White House.» \\nA quick aside here is to note the explicit admission that CIA support for «rebels» has been a centerpiece of US strategy. Given that the recent truces facilitated by Russia have demonstrated beyond doubt that there is no practical distinction between militants, the Washington Post is in effect acknowledging that CIA support for terrorists, not «rebels», has been central to US policy in Syria. \\nAnyway, the more important point here is that the Obama administration appears to be throwing in the towel on exercising a military option in Syria. Recall that for the past several months, there were frequent Washington mutterings of a «Plan B» involving military intervention, if diplomatic wrangling with Russia over regime change in Syria came to naught. \\nWhen the Kerry-Lavrov ceasefire broke down last month due to Western-backed terrorists breaching the accord and due to the massacre by the American air force of Syrian troops at Deir ez-Zor on September 17, the Syrian and Russian military resumed operations with greater intensity on September 22. John Kerry immediately went into a huff and broke off bilateral relations with Moscow. Washington began dropping menacing hints that it was exploring «non-diplomatic options» – meaning supplying more anti-aircraft missiles and other weapons to the terrorists via the Gulf Arab client regimes. \\nHowever, the Washington Post is now reporting that Obama’s National Security Council has rebuffed the putative military options, knowing that the repercussions of a full-scale   US and Russia would be a high risk. In other words, it was all a bluff, and Moscow called Washington’s bluff. \\nWhat might have sealed the matter were reports last week of Russia’s Northern Fleet on its way to the Mediterranean Sea to station off the Syrian coast. The fleet includes the nuclear-powered Admiral Kuznetsov aircraft carrier, as well as seven other vessels. \\nVoice of America headlined : «Russia’s navy deployed to Syria in show of force». It added that it was Russia’s largest naval mission since the end of the Cold War in 1991, involving destroyers and anti-submarine ships. \\nAmong the Russian flotilla currently off Syria are three missile ships despatched separately from the Black Sea base at Sevastopol on the Crimean Peninsula. Those vessels are equipped with air defense and anti-ship cruise missiles. The array of firepower is a blunt message to the US and its NATO allies that Russia is not going to desist from its Syrian strategy. \\nRussia has evidently set an unwavering course on Syria. That is, to ensure that   of President Bashar al Assad remains in power as the legitimate sovereign authority as mandated by the people of Syria; and to ensure that the US-led covert war for regime change is brought now to a swift, definitive end. Taking the final terrorist redoubt in east Aleppo is crucial to finishing this nearly six-year war that has cost half a million lives and up to 10 million refugees – nearly half the nation. \\nThe Western sponsors of this dirty war to topple Assad – a longtime Russian and Iranian ally – appeared to make a last-ditch effort to thwart the Russian objective. The combined massive psychological operation mounted in the West involved media demonization and criminalization of Russia’s military intervention, in addition to reckless latent threats from Washington of an escalation in its own intervention, even to the point of precipitating a full-scale war with Russia. \\nRussia’s formidable naval power dispatched to the Mediterranean is an eloquent statement by Moscow that it is not going to be intimidated by Western psychological posturing either over alleged war crimes or a military confrontation. \\nNot only that but the assembled fire power now at Russia’s disposal off Syria and the ongoing strategic advances by the Syrian army on the ground around eastern Aleppo indicate that the war over Syria is possibly entering a final, victorious chapter. \\nAnd it looks like the Obama administration knows it has no other choice but to throw in the towel. \\nA successor Clinton administration may well try to revive the regime-change scheme. Hillary Clinton certainly has warmongering advocates aplenty in the Pentagon and the CIA – but that contingency would not be for at least three or four more months until she becomes inaugurated in mid-January. \\nWe can therefore expect in the coming weeks that Russia and its Syrian ally will ramp up military operations to bring this war to an end.'"}, "time": 1742561841.65192}