{"duration": 0.0791785717010498, "input_args": {"text": "'Holistic Medicine \\nIt is beyond belief that I have to continue to write about the problems with the flu vaccine. The flu vaccine has a long history of not protecting the vast majority who receives if from becoming ill with the flu. Nor does it change mortality rates. Nor does it change hospitalization rates. \\nThe flu vaccine is ineffective for the elderly—the most susceptible group recommended to receive annual injections. Although the Powers-That-Be will say the flu vaccine is approximately 50% effective, the real data provides a different picture. (I have written about this many times in my newsletter and in blog posts. Go here to read one post: http://blog.drbrownstein.com/the-truth-about-the-flu-vaccine/ ). \\nThe Cochrane Collaboration, an independent group who does not take Big Pharma Cartel money has reported that the flu vaccine does not protect adults against influenza nor does it affect the number of people hospitalized for the flu. Furthermore, Cochrane scientists have reported that the flu vaccine does not prevent people from missing work due to influenza illness. (1) \\nThere is not one randomized, double-blind controlled study that shows the flu vaccine is effective at preventing the flu. Not one. In fact, there are studies that show those who get the flu vaccine are more susceptible to other viral agents. \\nDo all hospital workers need to be vaccinated with the flu vaccine? There is not a single study showing that this practice is effective. \\nI would take this a step further: no one needs a flu vaccine since it fails well over 50% who receives one. \\nConventional doctors are proud to say they practice evidence-based medicine. The next time your health care provider tells you to get a flu vaccine, ask them to show you the evidence that the flu vaccine works. If they were truly practicing evidence-based medicine, they would refuse to vaccinate with a product that fails well over 50% who receives it. \\n(1) Cochrane Database of Systemic Review, 2010. Issue 7. Art No. CD001269 \\nRead the full article at Dr.Brownstein.com. \\nComment on this article at VaccineImpact.com. Leaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people. In this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine. FREE Shipping Available! Order here . Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? eBook – Available for immediate download. \\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.” \\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines. \\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary. \\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field. \\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual. \\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot. \\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions. \\nIn this eBook, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe. Read : Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? on your mobile device!'"}, "time": 1742563010.8865495}