{"duration": 0.22897815704345703, "input_args": {"text": "'“I know maybe the president is watching. ” So said Brian Kilmeade,   of “Fox and Friends,” on Thursday morning’s show. It was no mere boast, since President Trump has publicly stated his affection for the show and for Fox News, the channel on which it airs. If Mr. Trump was indeed tuning in, he was far from alone. Fox News has been the most watched cable news network for 15 years, but depending on the hour, the news narrative it presents to its large and loyal conservative audience can sharply diverge from what consumers of other media outlets may be seeing. We watched Fox News from 6 a. m. until midnight on Thursday to see how its coverage varied from that of its rivals on a day when cable news was dominated by the health care debate in Congress, the terrorist attack in London and the investigation into Russian interference in the presidential election. One notable way Fox News stood apart from its competition, as it has been known to do for years, was in the stories it chose to highlight and the tone  —   in some of its opinion shows, unapologetically supportive of Mr. Trump and his agenda  —   with which it covered them. There was extensive coverage of the health care vote, for example, but there was also considerable time given to topics, like a rape case in Maryland, that viewers would not have heard about if they had turned to CNN or MSNBC. The rape case, which involved an undocumented immigrant and went virtually uncovered on most networks, received almost hourly updates on Fox, and at times was used as proof that Mr. Trump’s calls for tighter borders and a crackdown on immigration were justified. During coverage of the London terrorist attack, in a break from the rather muted coverage on CNN, “Fox and Friends” veered into discussing the faith of the “Muslim mayor” of London. A morning news show noted that most British police officers did not carry guns (a fact that a guest labeled “lunacy”) and considered how the attack represented the broader terrorist threat. And while other networks were devoting time to the apology made by Representative Devin Nunes of California, the Republican chairman of the House committee investigating Russian interference in the election, for not sharing information about intelligence with the committee’s top Democrat before giving it to Mr. Trump, Fox was touting a report about “potential” evidence that Mr. Trump’s team may indeed have been surveilled by the Obama administration. It was presented as vindication of Mr. Trump’s earlier assertions that his phones had been wiretapped. Still, while people who do not watch Fox News may think it presents a uniform voice from morning to night, the network’s content varies plenty. It offers a heavy dose of opinionated fare  —   “Fox and Friends” and its entire   lineup  —   and has something closer to a more traditional news format for much of the afternoon. And just like any cable news network, when news breaks, it can find itself scrambling. With all that in mind, if you weren’t watching Fox News on Thursday, this is how the news played out through its distinctive lens. _________ It promised to be an eventful day in Washington, with the debate over the health care bill providing the twists, turns and   negotiations that cable news channels love. But when “Fox and Friends” began at 6 a. m. the   Ainsley Earhardt was holding up the gruesome front page of The New York Post. “Anguish, terror strikes in the shadow of Big Ben,” she said, reading the paper’s headline, as the camera zoomed in on a photograph of a bloodied victim. “It’s like she’s looking at us,” added Mr. Kilmeade of the cover photo. The crew of “Fox and Friends” spent a large chunk of the morning focusing on the London terrorist attack, and updates on the situation kept coming through the morning on the shows “America’s Newsroom” and “Happening Now. ” Many of these updates came with an underlying message: that the world can be a dark and often dangerous place, and that it is under the threat of “radical Islamic terror,” as was said with emphasis on “Fox and Friends. ” (That phrase is one that Mr. Trump proudly and frequently uses.) The message of fear would resonate throughout the day, in the London coverage and later in segments on the Maryland rape case. “Police say the attacker was   but many say this attack highlights the importance of properly vetting immigrants and refugees,” said Ed Henry, a substitute host on “America’s Newsroom. ” Mr. Henry later said to a panel of guests, “It seems to me that it’s harder and harder for Democrats to say that the travel ban doesn’t make sense. ” On “Happening Now,” an interview with Danny Coulson, a former deputy assistant director at the F. B. I. centered on the “lunacy” of not equipping police officers with guns, words that echoed Mr. Trump’s comments about security guards after the nightclub shooting in Orlando, Fla. Mr. Kilmeade repeatedly turned his focus to London’s “Muslim mayor,” Sadiq Khan, calling on him to discuss the difference between his faith and that of the attacker. “Fox and Friends” also spent time on comments that Mr. Khan made in 2016 about how terrorism preparedness was “part and parcel” of living in a big city. After the attack this week, Donald Trump Jr. wrote a Twitter post about Mr. Khan’s comments and was roundly criticized for taking them out of context. “Fox and Friends” did not note that. _________ As the day progressed, more time was given to covering the health care bill. The 6 p. m. and 11 p. m. editions of the news show “Special Report,” hosted by Bret Baier, along with “The O’Reilly Factor” and “Hannity,” spent significant portions of their broadcasts discussing the bill and its fate. But with the bill in trouble, there were several conspicuous stretches when health care, seemingly the top news story of the day, disappeared from the Fox News airwaves. The vote on the bill, which had been scheduled for Thursday, was postponed around 3:30 p. m. Still, it took Tucker Carlson, whose show comes on at 9 p. m. 45 minutes to address it. On Fox News’s 7 p. m. show, “The First 100 Days,” which is supposed to focus on, well, the president’s first 100 days, the bill barely registered 10 minutes of airtime. The panel of the 5 p. m.   show “The Five” discussed the bill and the vote in the program’s first 10 minutes before moving on to topics like surveillance, the London attack and a segment on Mayor Bill de Blasio of New York. (One panelist, Kimberly Guilfoyle, complained that “all the garbage isn’t collected” in her neighborhood.) Mr. Carlson’s attention was on immigration, and his guest, Ann Coulter, opined that Mr. Trump should focus on immigration and a border wall. It wasn’t the first time the wall was mentioned. “America’s Newsroom,” Fox’s midmorning show, devoted an entire segment to the wall Mr. Trump says will be built along the Mexican border. The coverage featured graphics, talk about how companies would bid for the chance to build the wall and a discussion about potential requirements for the structure, like “withstand assault,” “unclimbable” and “aesthetically pleasing on the U. S. side. ” _________ “Since other networks are determined to ignore it, we open tonight with more coverage of the horrific alleged rape in Rockville, Maryland,” Mr. Carlson said at the start of his show. All week, Fox News had been covering a story of a    Maryland girl who said she had been raped by two of her high school classmates, one of whom is an undocumented immigrant. The way the story was discussed throughout the day on the network was not unlike a Trump campaign speech: criticism of the mainstream media, accusing it of having a liberal agenda that prioritizes identity politics over safety proclamations that sanctuary cities and states are rife with danger from illegal immigration mentions of Kathryn Steinle, the woman killed by an undocumented immigrant in San Francisco in 2015 who was often invoked on the campaign trail by Mr. Trump, Senator Ted Cruz of Texas and other conservatives and descriptions of a border so porous that there are “waves of unaccompanied children coming across. ” The Maryland case was a topic on Fox News from the morning to almost midnight. The coverage was also laced with critical comments aimed at other networks for not giving the case enough attention. “In my mind, they’re telling our little girls that this little girl’s life doesn’t matter as much as these illegal immigrants’ lives matter because they don’t want to spread a negative story,” Ms. Earhardt, referring to other news outlets, said on “Fox and Friends. ” (Howard Kurtz, the network’s media analyst, said that Fox’s   shows had dedicated more than 53 minutes of attention to the case  —   and that rival morning shows and evening newscasts had virtually ignored it.) The “Fox and Friends”   Steve Doocy introduced a segment on the case by saying: “Where’s the mainstream media’s outrage? Hmm, we couldn’t find it. ” On “The Five,” the panelist Greg Gutfeld said the case wasn’t being covered sufficiently because it didn’t fit the media’s “liberal feminist narrative. ” Ms. Guilfoyle deemed it a “shameful blackout. ” A guest on “America’s Newsroom,” Ed Martin, bluntly stated that “they’re raping and killing our people, and that’s what Trump won on. ” _________ Even as Fox latched on to stories on Thursday that were not being emphasized on other networks, its afternoon hours hewed closer to traditional news coverage. For instance, Fox showed all 50 minutes of Sean Spicer’s White House press briefing, just as CNN and MSNBC did. And when Fox’s 3 p. m. anchor, Shepard Smith, came on, skepticism of the president ramped up. Mr. Smith has an evenhanded reputation that sets him somewhat apart from his colleagues in the minds of some, but the unpopularity of the health care bill was mentioned throughout the afternoon. During Fox’s 2 p. m. hour, a National Journal editor, Josh Kraushaar, said that Mr. Trump’s brand would be “undermined somewhat” if he could not get the votes for the bill. On Neil Cavuto’s 4 p. m. slot, after the vote had been postponed, The Post’s Daniel Halper said that Mr. Trump’s low approval ratings gave him “a lot less leeway” with members of the House. Mr. Smith called Mr. Trump’s claim that he had been wiretapped by the Obama administration “unfounded. ” He even asked a guest, “Is there a longtime danger from this that maybe his followers don’t understand or haven’t thought about?” While Mr. Smith was on the air, the House decided to delay its vote on the health care bill until Friday, prompting Mr. Smith to say, “For this to go down in flames, according to analysts on both sides of the political aisle, would be very bad for this White House. ” _________ The ability of different Fox News programs to lurch between news and opinion was demonstrated clearly when it came to Representative Duncan Hunter, Republican of California. On “Special Report,” Mr. Baier said that Mr. Hunter was under investigation by the Justice Department for misspending campaign funds. Less than two hours later, Mr. Hunter, along with Representative Chris Collins, Republican of New York, appeared live on “The O’Reilly Factor” to discuss the health care bill. Mr. Hunter argued that the bill would “save America. ” Eric Bolling, who was filling in for the host, Bill O’Reilly, did not raise the investigation with the congressman. _________ While the London attack, the Maryland rape case and critiques of the media moved to the fore during certain stretches, an implicit defense of Mr. Trump was also a consistent theme. Mr. Cavuto dinged the media for being too harsh on Mr. Trump. “If you want to be liked by the media, you better be like the media, which means these days you better not like Donald Trump,” Mr. Cavuto said, noting that the president had boycotted his show. He added of the media, “I’m not saying it’s time to get over Trump  —   I’m saying it’s time to get over yourselves. ” And even though Mr. Trump’s first push for major legislation was in peril by the end of Thursday night, the mantra from numerous Fox hosts and analysts was: Don’t blame him. Mr. Hannity started his 10 p. m. show by denouncing Republicans in the House, saying they were “ill prepared for this moment to lead, and now they failed the president. ” The Fox Business Network host Lou Dobbs appeared on the show and specifically called out Speaker Paul D. Ryan for proving “he’s not a leader. ” (That sentiment was not particular to Fox. Lawrence O’Donnell opened his 10 p. m. show on MSNBC by saying that Mr. Ryan had “failed his first big test as speaker. ”) Earlier in the day, Mr. Bolling  —   who appeared on “The Five” before filling in on “The O’Reilly Factor”  —   said of the bill’s troubles, “Make no mistake, this is on Paul Ryan, not Donald Trump. ” Ms. Guilfoyle echoed that, saying, “It certainly won’t be because of a lack of effort from President Trump. ” Earlier, on “America’s Newsroom,” Mr. Henry was quick to draw a comparison with Mr. Trump’s predecessor. “The criticism of Barack Obama, for so long, he wouldn’t get his hands dirty, didn’t like dealing with Congress  —   this president is getting his hands dirty,” Mr. Henry said. While some other networks were at the center of controversy last year for hiring some people with very close ties to Mr. Trump, Fox News remains the home for his defenders. A list of the guests who appeared on the network on Thursday includes Mr. Spicer, Jerry Falwell Jr. the former Arkansas governor Mike Huckabee and the British   politician Nigel Farage. Mr. Huckabee and Charlie Gasparino of Fox Business Network both said they would be perfectly pleased if Mr. Trump turned to tax cuts and moved past health care. As Mr. Trump weathered the fallout from his claim that he was wiretapped by Mr. Obama, numerous guests discussed recent unverified reports that some members of Mr. Trump’s team were surveilled by the Obama administration. Mr. Farage appeared on “Fox and Friends” to heap praise on the president after the reports, made public by Mr. Nunes. “For Donald Trump to use a term like ‘somewhat vindicated’ is mastery of understatement, isn’t it?” Mr. Farage said. “I should think he’s pleased that he has been proved to be right. ” Mr. Kilmeade later said that this was not the first time the president had been vindicated after making a comment that others criticized. “Sweden, same thing,” Mr. Kilmeade said, referring to Mr. Trump’s comment that immigrants were causing crime in Sweden, something even Mr. Trump himself later clarified. “What’s going on with Sweden? Nothing’s going on with Sweden?” Mr. Kilmeade said. “A week later, there are riots and people are talking about what’s actually going on in some of those ghetto areas. So those are areas on which he spoke out, and he ended up being proven right here. ” Throughout the afternoon, a countdown clock previewing Mr. Carlson’s show made a promise: “Trump Team Surveillance EXPOSED. ” Nothing of the sort came up on the 9 p. m. show for the first 30 minutes, but Mr. Carlson, along with Mr. Hannity and other hosts, mentioned a report by the Fox correspondent James Rosen that a potential “smoking gun” could be coming. As the night wore down, and in the aftermath of the delayed health care vote, Mr. Hannity turned his attention fully to this latest topic. He even went so far as to ask a guest on his show whether this could “make Watergate look like kindergarten. ” To find that out, you would have to tune in again.'"}, "time": 1742562198.4651675}