{"duration": 0.21849298477172852, "input_args": {"text": "'2909 Views November 11, 2016 29 Comments Guest Posts The Saker \\nby Pepe Escobar Donald Trump’s red wave on Election Day was an unprecedented body blow against neoliberalism. The stupid early-1990s prediction about the ‘end of history’ turned into a – possible – shock of the new. \\nThe new global nativism? Perhaps a new push towards democratic socialism? Too early to tell. \\nOnce again. A body blow, not a death blow. Like the cast of The Walking Dead , the zombie neoliberal elite simply won’t quit. For the Powers That Be/Deep State/Wall Street axis, there’s only one game in town, and that is to win, at all costs. Failing that, to knock over the whole chessboard, as in hot war. \\nHot war has been postponed, at least for a few years. Meanwhile, it’s enlightening to observe the collective American and Eurocrat despair about a world they can’t understand anymore; Brexit, Trumpquake, the rise of the far-right across the West. For the insulated financial/tech/think-tank elites of liquid modernity, criticism of neoliberalism – with is inbuilt deregulation, privatization a-go-go, austerity obsession – is anathema. \\nThe angry, white, blue collar Western uprising is the ultimate backlash against neoliberalism – an instinctive reaction against the rigged economic casino capitalism game and its subservient political arms. That’s at the core of Trump winning non-college white voters in Wisconsin by 28 points. Blaming “whitelash” , racism, WikiLeaks or Russia is no more than childish diversionary tactics. \\nThe key question is whether the backlash may engender a new Western drive towards democratic socialism – read David Harvey’s books for the road map – or just nostalgic nationalism raging against the neoliberal Washington/EU/NAFTA/ globalization machine. \\nRead my lips: much lower taxes \\nTrump is proposing to turn the tables on the neoliberal game. Throughout his campaign he criminalized free trade – the essence of globalization – for decimating the American working class, even as US businesses blamed free trade for forcing them to squeeze workers’ wages. \\nSo let’s see how Trump will be able to impose his priorities. In parallel to addressing the appalling structural decline in US manufacturing, he wants to pull a China: a massive $1 trillion infrastructure project over 10 years via public-private partnerships and private investments encouraged by lower taxes. That’s supposed to create a wealth of jobs. \\nLower corporate taxes in this case translate into a whopping $3 trillion over 10 years, something like 1.6 percent of GDP. That would be the way to incite huge multinationals to repatriate the hundreds of billions of dollars in profits stashed abroad. This fiscal shock would create 25 million jobs in the US over the next 10 years, and propel a 4 percent growth rate. \\nAnd then there’s the protectionist drive that will renegotiate NAFTA and kill TPP for good. Not to mention raising import tariffs over manufactured products (many by de-localized US multinationals) imported from China and Mexico. \\nIt’s open to fierce debate how Trumponomics will manage to square the circle; with more economic growth fueled by less taxes, imports will rise to satisfy internal demand. But if these products are subjected to stiffer tariffs, they will become more expensive, and inflation will inevitably rise. \\nAnyway, the bottom line of protectionist Trumponomics would be a huge blow against global trade. Deglobalization, anyone? \\nAsia braces for impact \\nPredictably, the heart of deglobalization will be the Trump-China relationship. Throughout the campaign, Trump blamed China for currency manipulation and proposed a 45 percent tariff on Chinese imports. \\nIn Hong Kong banking circles, no one believes in it. Key argument: the already strapped basket of “deplorables” simply won’t have the means to pay more for these Chinese imports. \\nAnother thing entirely would be for Trumponomics to find mechanisms to hurt US companies that de-localize in Asia. That would translate into serious problems for outsourcing Meccas such as India and the Philippines. Outsourcing in the Philippines, for instance, serves mostly US companies and attracts revenue as crucial to the nation as total Filipino worker remittances from abroad, something like 9 percent of GDP. \\nIt’s quite enlightening in this context to consider what Narayana Murthy – founder of Indian IT major Infosys – told the CNBC TV-18 network; “What is in the best interest of America is for its corporations to succeed, for its corporations to create more jobs… to export more… so I’m very positive.” \\nour months ago Nomura Holdings Inc. issued a report titled “Trumping Asia” . No less than 77 percent of respondents expected Trump to brand China a currency manipulator; and 75 percent predicted he will impose tariffs on exports from China, South Korea and Japan. \\nSo no wonder all across Asia the next months will be nerve-wracking. Asia – and not only China – is the factory of the world. Any Trump trade restriction over China will reverberate all across Asia. \\nBrace for impact: deglobalized Trumponomics vs. Neoliberalism will be a battle for the ages. The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742564079.2102666}