{"duration": 0.13153958320617676, "input_args": {"text": "'PRIPYAT, Ukraine  —   The road through the forest, abandoned, is at times barely discernible, covered with the debris of fallen tree limbs, vines, leaves and moss pushing up through cracks in the crumbling asphalt. The moss is best avoided, says our guide, Artur N. Kalmykov, a young Ukrainian who has made a hobby of coming here to the exclusion zone surrounding the nuclear reactor at Chernobyl, set aside in perpetuity after the catastrophe in 1986. It can be radioactive, having carried buried radiation to the surface as it grew. Above all, he says, watch out for windblown dust, which could well be laced with deadly plutonium. Despite the dangers  —   which are actually minimal these days, except when the wind is howling  —   and the risk of arrest, Mr. Kalmykov is at home here. “In Kiev my head is full,” he said. “Here I can relax. I could hang out in Kiev. But this is more interesting. ” What Mr. Kalmykov and fellow unofficial explorers of the Chernobyl zone, members of a peculiar subculture who are in their 20s and call themselves “the stalkers,” have found is more interesting still: vast tracts of   in the ostensibly protected forest. Mr. Kalmykov, a computer programmer who discovered the   areas while exploring the zone on his weekends, took his findings to Stop Corruption, one of the civil society groups that popped up in Ukraine after the Maidan revolution two years ago, events supposed to usher in a new era of clean government in Ukraine. And yet on Ukraine’s dirtiest patch of land, Stop Corruption says, based on the stalkers’ evidence, the    dealings of the bureaucrats who manage the area are flourishing as always. Distracted by the 30th anniversary of the catastrophe on April 26 and the general turmoil in Ukraine, the group says, the Exclusion Zone Management Agency has turned a blind eye to the Chernobyl logging. The Zone of Alienation, as it is also known, is a rough circle with an   radius, fenced off with barbed wire. Access is strictly controlled, so that delegations and guided tours typically travel a few fixed routes. Outside those areas frequented by tourists, Stop Corruption said, under the guise of salvage logging of trees killed in wildfires, healthy pines are being felled in great numbers for sale in Ukraine and Romania, from where the timber may be resold throughout Europe. “We thought these incidents were isolated and unimportant, but when we started to investigate, it turned out the problem was gigantic and systemic,” said Vadim V. Vnukov, the group’s head lawyer. Lumber from Chernobyl, while not exactly glowing in the dark, would pose risks to anybody living in a house made from it, Mr. Vnukov said. “There is a clear health risk here,” he said. “We ran into a system worked out over the decades, and under any government, this system of corruption was preserved. ” Today, scientists say, the average radiation level in the zone is about a quarter as harmful to human health as it was in the immediate aftermath of the explosion and fire. A typical reading in the zone is about 100 microsieverts per hour, or comparable to the exposure that an airplane passenger might receive on a   flight. But harmful risks lurk. Placed near the moss, for example, a Geiger counter hummed like an electric shaver. “It’s not as dangerous as it seems,” Mr. Kalmykov said with a shrug. “Some people are just radiophobic. ” In an interview in his offices in Kiev, Vitalii V. Petruk, the head of the Exclusion Zone Management Agency, denied that any illegal logging had taken place since he assumed the job in September. But since the revolution, he is the fifth director of the zone, which like the rest of Ukraine has been in a state of flux. Loggers fell burned trees after forest fires, to avoid pest outbreaks, and cut firebreaks and routes for electrical wires, he said. Since 2004, it has been legal in Ukraine to sell timber from the zone if it passes radiological controls. Mr. Petruk is an unabashed advocate of increased commercial activity in the zone, including logging. “How do we turn our shame into our advantage?” he said. His answer is “Zone of Change,” a proposal by his agency for increased logging to feed a   steam power plant at the site that he noted would reduce dependence on Russian natural gas. Into this landscape recently, one careful step after another, Mr. Kalmykov pushed deeper into a thicket of vines and fallen branches. (To show reporters sites where he suspected illegal logging activity, Mr. Kalmykov and all in his party obtained permits to visit the zone, in contrast to his usual practice of slipping in to explore surreptitiously.) At an abandoned house on the roadside, with the rhythmic chirp of a Geiger counter in the background and moldy children’s clothes lying about, an eerie sense arose of a sneak preview of the end of the world. The concept of the exclusion zone, an important experiment for the nuclear industry, was to limit, through isolation, the lethality of an accident at the nuclear plant. (Fewer than 200 people stayed here after the evacuation of more than 100, 000.) Radioactive elements degrade at predictable intervals, called   that can vary enormously. Particles left in the soil while their   tick past harm nobody the average particle   at Chernobyl is about 30 years. But logging in a postapocalyptic forest would pose a number of health concerns. Trees, like moss, absorb radiation from the subsoil. Also,   churns up soil, stirring radioactive dust and accelerating erosion. At one point along the road, the forest opens to a   area of several acres, sliced into healthy pine groves, though near a burned patch. “Look, they didn’t touch the dead trees,” Mr. Kalmykov said, pointing to the still standing, blackened pines. “During the change in government, nobody was paying attention, and people didn’t miss this moment” to make some money, he said of the loggers. “Everybody knows. The necessary people get the necessary money. ” A logger, his sweaty face flecked with dust and sawdust, said he simply cut the trees marked by his bosses at the exclusion zone administration. “I don’t decide,” said the man, who declined to give his name. “They say we don’t need the burned logs. ” Asked if he worried about radiation, he said he did not, as by now the radiation had settled deep into the soil. “We stamp it down so it does not come out,” he said, patting the ground with his boot. “Want to buy some wood?”'"}, "time": 1742561921.573618}