{"duration": 0.12630677223205566, "input_args": {"text": "'CINCINNATI  —   They stormed the stage together wearing similarly colored clothes  —   hues that almost perfectly matched the bold blue of Hillary Clinton’s presidential campaign logo. With a “Stronger Together” sign hanging in the background and a Katy Perry pop song blaring from the speakers, they cheered each other on like old pals, cracking jokes about Donald J. Trump and pointing with enthusiasm at a young supporter who waved a placard that read “Girl Power. ” Senator Elizabeth Warren of Massachusetts, a towering political figure among today’s liberal Democrats, brought her energy, folksy appeal and populist roar to a candidate not known for energizing crowds. For Ms. Warren, the joint event with Mrs. Clinton here on Monday, the first time the two Democrats campaigned onstage together, was a moment for her to elevate her profile as the liberal voice of the party and a favorite to be vice president. For Mrs. Clinton, it was a chance to woo the party’s liberal wing and convince economically   voters that she, too, is a populist champion running for president to improve their lives. “I got into this race because I wanted to even the odds for people who have the odds stacked against them,” Mrs. Clinton told the crowd. “To build an economy that works for everyone, not just those at the top, we have got to go big and we have got to go bold. ” Mrs. Clinton stood onstage grinning and nodding, her hands clasped calmly at her waist, as Ms. Warren eviscerated Mr. Trump in remarks that lasted roughly half as long as Mrs. Clinton’s   address. Ms. Warren told an electrified crowd of roughly 2, 600 gathered in the grand corridor of the Cincinnati Museum Center, under murals of factory and farmworkers, that the presumptive Republican nominee would “crush you into the dirt to get whatever he wants. ” And when Ms. Warren, a onetime critic of Mrs. Clinton, turned from the lectern to face the presumptive Democratic nominee, declaring that she “has never backed down” from fighting for the middle class, Mrs. Clinton flashed a wide, satisfied smile, appearing to let out a sigh of relief that she had the liberal senator from Massachusetts in her corner. She mouthed two simple words to her supercharged surrogate: “Thank you. ” The event was the culmination of warming relations between Mrs. Clinton and Ms. Warren, who has criticized the financial policies of the Bill Clinton era. Before she was a senator, Ms. Warren turned her ire on Mrs. Clinton, then a New York senator, for shifting her position to support bankruptcy legislation that would have made it more difficult for families to get debt relief. Those differences seemed a distant memory on Monday as Mrs. Clinton struck an almost identical tone and praised Ms. Warren’s   in the Senate. “Some of the best TV since Elizabeth came to the Senate is on ” Mrs. Clinton said. “Whenever you see her pressing a bank executive or a regulator for answers,” she continued. “Remember: She is speaking for every single American who is frustrated and fed up. ” Both women framed their remarks on Monday by portraying Mr. Trump as a selfish corporate titan whose business record has not benefited American workers. Mrs. Clinton reeled off a list of   Trump enterprises. “Trump suits were made in Mexico,” she said. “Trump furniture is made in Turkey, instead of Cleveland. Trump barware is made in Slovenia, instead of Toledo. ” Living up to her newfound reputation as Trump    Ms. Warren roused the crowd with stinging criticism of the Manhattan businessman. But she also appeared cautious not to overshadow her party’s presumptive nominee, looking back at Mrs. Clinton occasionally as she spoke, as if in deference to an elder. “Donald Trump says he’ll make America great again,” Ms. Warren said, calling his slogan “goofy,” a take on Mr. Trump’s favorite insult for the Massachusetts senator. “I ask, for who exactly? For families that don’t fly to Scotland to play golf?” In response, Mr. Trump’s campaign called Ms. Warren a “sellout” for supporting Mrs. Clinton, pointing to the presumptive Democratic nominee’s Wall Street donors. In an interview with NBC News, Mr. Trump called Ms. Warren a “racist” and “a total fraud. ” Many in the crowd viewed the joint event as a practice run for what could transpire should Mrs. Clinton select Ms. Warren as her running mate. While an   ticket is unlikely, James Hamilton, the Washington lawyer leading Mrs. Clinton’s   search, has begun vetting Ms. Warren and other candidates. Ever since she endorsed Mrs. Clinton this month, Ms. Warren has been a powerful surrogate, attacking Mr. Trump in spades and visiting the Clinton campaign’s headquarters in Brooklyn to encourage young staff members with a simple message: “Don’t screw this up!” If Ms. Warren’s liberal policy positions could make it difficult for her to get a place on a ticket, on Monday she and Mrs. Clinton seemed to have little daylight between them as they each vowed to restructure the American economy to help the middle class. In an address that spoke to the “frustration, the fear, the anxiety and, yes, the anger” over an economy in which the wealthiest Americans have thrived as   wages have remained virtually stagnant, Mrs. Clinton hit the same themes that elevated Ms. Warren in the Senate and fueled the candidacy of Senator Bernie Sanders of Vermont in the   Democratic nominating contest. In a season defined by anger over globalization and economic inequality, Mrs. Clinton firmly declared that “this is not a time for half measures” as she laid out her   plan to lift wages and create jobs. In Ohio, a battleground state, Mrs. Clinton delivered a promise to strengthen labor unions, close loopholes that give tax breaks to corporations for moving jobs overseas, raise the minimum wage and make college affordable. “Why do the richest Americans and biggest corporations get away with manipulating the tax code so they pay lower rates than you do?” Mrs. Clinton asked to boos from the crowd. With Mr. Sanders not yet ready to campaign for his primary opponent (while acknowledging he would vote for her to defeat Mr. Trump) Mrs. Clinton’s rally with Ms. Warren could help her continue to win over the liberal voters who had flocked to Mr. Sanders’s message. Some 45 percent of Mr. Sanders’s supporters now have a positive view of Mrs. Clinton, according to an NBC   Street Journal poll. Both Mrs. Clinton and Ms. Warren seemed to relish criticizing Mr. Trump’s response to Britain’s momentous decision on Thursday to leave the European Union, which has jolted global financial markets and caused the British pound to tumble to its lowest level since 1985. On a trip to visit his Turnberry golf course in Scotland last week, Mr. Trump declared Thursday’s vote “a great thing” and drew parallels between the rise of populist anger in Britain and voters’ sentiments in the United States. “Basically, they took their country back,” Mr. Trump said, adding that a cheaper British pound would help his golf course business. “Donald Trump cheered on Britain’s current crisis, which has sucked millions of dollars out of your retirement accounts, because, he said, it might bring more rich people to his new golf course,” Ms. Warren said.'"}, "time": 1742562173.264365}