{"duration": 0.07820677757263184, "input_args": {"text": "'Clinton Insider: Rigging Only Way Hillary Can Win She’s going to lose and she knows it, he said Jamie White | Infowars.com - October 28, 2016 Comments \\nHillary Clinton and the Democrats have begun stealing the election using every underhanded tactic because it’s the only way she can win, says Clinton insider Larry Nichols. \\n“She’s going to lose and she knows it,” Nichols said on The Alex Jones Show Thursday. “Unless she can amass and pull off the biggest amount of voter fraud in the history of this country.” \\nNichols explained that the establishment is already doing what it can to prevent an open and transparent election. \\n“The DNC filed a lawsuit to try to force the removal of poll watchers at the polls,” he said. “Why would they do that if they know there’s no cheating going on? Why would they fight the voter ID if they don’t plan to have massive voter fraud?” \\nThe mainstream media and the Clinton campaign are also doing everything they can up until Election Day to make everybody believe that the election is already over in Hillary’s favor, Nichols said. \\n“Folks, do not believe it,” he said. “The polling is a part of this game plan to destroy your confidence in your ability to win.” \\n“I believe Donald Trump is winning,” Nichols added. “You’re winning. You’ve just got to stay the course.” \\nNichols warned that voters must take extra steps to ensure their vote isn’t being altered. \\n“You’ve got to make people at the precinct prove that your vote was recorded properly,” he said. “If they can’t show you proof, then demand a paper ballot.” \\nThe damning videos provided by Project Veritas exposing high-level Democrat operatives discussing how they steal elections illustrate that worries about voter fraud aren’t unfounded, with even the New York Times acknowledging a recent survey showing that most voters fear their ballot won’t count because they believe “the political process is so dominated by corporate interests.” NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742563408.3611128}