{"duration": 0.41828083992004395, "input_args": {"text": "' Note to America: Don\\x92t Be So Sure You\\x92ve Put Trump Behind You\\nTake it from a Brit, right-wing populism will thrive until you deal with it genuinely.\\nBy Gary Younge October 31, 2016 \" Information Clearing House \" - \" The Nation \" - A I \\x92ve been living in Britain for the last year and have returned to the United States to cover the election from a small town in Indiana\\x97with the experience of Brexit on my mind.\\nOn June 24, a significant proportion of the British electorate woke up and thought they were living in a different country. Britain narrowly voted to leave the European Union. It felt like the politics of fear, isolation, and xenophobia had delivered an utterly devastating and enduring blow to the body politic. There are many lessons from that night, and indeed we in Britain are only just beginning to learn them. But as it relates to the American elections, I want to dwell on just three.\\nThe fact that the messenger is deranged doesn\\x92t mean the message itself contains no significant truths.\\nFirst, don\\x92t let the polls guide your strategic decisions about voting. If you want Hillary Clinton to win, vote for her. If you favor Jill Stein, vote for her. Don\\x92t cast your vote thinking you\\x92re compensating for a result that has not been declared but that you think you\\x92ve factored in. You don\\x92t know.\\nThe Brexit result caught the currency traders, pollsters, betting agencies, and commentators off guard. One of the leading voices of the Leave campaign, Nigel Farage of the UK Independence Party, conceded defeat at 10 pm the night of the election; less than six hours later he claimed victory.\\nAs I write, polls suggest a runaway victory for Clinton. They could be right. But politics is in a very volatile state\\x97they could also be wrong. And the only way you\\x92ll know for sure will be when it\\x92s too late to do anything about it.\\nSecond, the fact that the messenger is deranged doesn\\x92t mean the message itself contains no significant truths. Before the Brexit referendum, liberals broadly dismissed Leave voters as ignorant, angry, and bigoted. Some of them were undoubtedly all three. But that\\x92s not primarily what was driving many of them. It took the Brexit result for the nation to pay attention to communities devastated by neoliberal globalization. Had Remain won, those who were forgotten would have remained forgotten.\\nTrue, politicians have drawn mostly the wrong conclusions: condemning the free movement of people rather than the free movement of capital. Nonetheless, regions long ignored, accents rarely heard, and issues seldom raised are traveling from the margins to the mainstream of British politics.\\nSimilarly, if Hillary Clinton wins, that should not blind us to some of the themes that have made Trump\\x92s candidacy viable. In Muncie, Indiana, where I have spent most of this election season, huge manufacturing plants have closed since the passage of NAFTA, leaving one-third of the town in poverty. And while Trump\\x92s base is not particularly poor, a significant portion of the nation is desperate. It\\x92s not difficult to see why. The price of everything apart from labor has shot up in the past 40 years, while inequality has grown and social mobility has slumped. Trump\\x92s original Brexit strategy of targeting Rust Belt towns in Pennsylvania, Michigan, and Wisconsin may not have worked electorally, but what he identified remains a politically salient fault line that doesn\\x92t just go away if Clinton wins. If these problems are not tended to, a less erratic and more focused right-wing populist than Trump could easily exploit them.\\nWhich brings us to the third lesson. Trump is deluded about many things, but he\\x92s right to insist that the media and political classes are out of touch with the population. They exist in a fetid ideological comfort zone where radical change is considered apostasy at precisely the moment when radical change is both necessary and popular.\\nLeading up to the Brexit vote, leaders of the Remain campaign preferred to caricature those in the opposing camp rather than engage them. They de\\xadrided not only the leaders of the Leave campaign but its followers. You cannot convince people they are doing well when they are not. Yet throughout the Brexit campaign, Remain advocates lectured voters on all the advantages they derived from the European Union and how much worse things would be if they left. From Tony Blair to David Cameron, people who had stiffed working people in a range of ways now insisted they alone could save them from themselves. People just weren\\x92t buying it.\\nSimilarly, people in Muncie and elsewhere are aware that some of the worst things to come out of Washington\\x97\\xadincluding NAFTA, financial deregulation, and the Iraq War\\x97were bipartisan efforts in which the mainstream media acted as cheerleaders. That is why, I assume, Delaware County, where Muncie resides, voted for both Trump and Bernie Sanders in the primaries. When Democrats wheel out high-ranking Republicans who now disown Trump, they don\\x92t realize they are making Trump\\x92s point for him: The establishment that has done nothing for you hates me\\x97I must be doing something right .\\nBrexit and the US elections are not synonymous. But there is plenty of overlap in the nationalist nostalgia, xenophobia, political dislocation, and class grievance that they draw upon.\\nTime and again in Muncie, Trump supporters, some of whom voted for Obama, say they really just want to \\x93shake things up.\\x94 They are not alone. \\x93The Democratic establishment is very, very happy with incremental change,\\x94 says Dave Ring, who backed Bernie and runs an organic farm and food store in Muncie called the Downtown Farm Stand. \\x93And the rest of the public is out here like, \\x91We don\\x92t have time for incremental change. We don\\x92t have time for that. Why would we want to wait?\\x92\\x94\\nThis sense of urgency will not go away if Hillary wins, any more than a Remain vote would have signaled that all was well with British society. We didn\\x92t wake up in a different country on June 24; it was simply a country we had ceased to recognize. A defeat for Trump, regardless of its magnitude, should not be misunderstood as an endorsement of the status quo. Just because you haven\\x92t descended into the abyss, as Britain did, doesn\\x92t mean you\\x92re not standing dangerously close to its edge.\\nŠ 2015 The Nation FBI in Internal Feud Over Hillary Clinton Probe: The surprise disclosure that agents from the Federal Bureau of Investigation are taking a new look at Hillary Clinton\\x92s email use lays bare, just days before the election, tensions inside the bureau and the Justice Department over how to investigate the Democratic presidential nominee.\\nFormer FBI Official: FBI Has An \\x91Intensive Investigation\\x92 Ongoing Into Clinton Foundation [VIDEO] : \\x93The FBI has an intensive investigation ongoing into the Clinton Foundation,\\x94 Fuentes said Saturday, citing current and former senior FBI officials as sources.\\nEx-FBI assistant director calls the Clintons a \\'crime family\\' and claims their \\'foundation is a cesspool\\': A former FBI official described the Clintons as a \\'crime family\\' days after the bureau reopened its investigation into Hillary\\'s personal email server.\\nHillary\\'s emails matter: A retired CIA officer explains why: Apparently while investigating disgraced ex-Congressman Anthony Weiner\\x92s transmission of sexually explicit images to a fifteen-year-old girl, the FBI discovered more emails relevant to Hillary Clinton\\x92s own infamous case.\\nHillary\\'s exiled aide pleads ignorance over emails on her sexting husband\\'s laptop, but faces JAIL if it\\'s proved she lied to FBI : Questions are mounting over right-hand woman Abedin\\'s future on the Clinton campaign as she was pictured in New York today at campaign HQ while her boss was in Florida.\\nYahoo holds key to FBI probe of Hillary-Huma emails: Huma Abedin and Hillary Clinton may have violated national-security laws with emails that Huma forwarded to herself at humamabedin@yahoo.com, which ended up on a laptop owned by her husband, former Congressman Anthony Weiner.\\nClinton\\x92s unfavorable rating hits new high in poll | Trump targets Democratic states in final sprint: Sixty percent of voters view Hillary Clinton unfavorably, according to a ABC News/Washington Post poll released Monday morning, the highest level of unpopularity yet for the Democratic presidential nominee'"}, "time": 1742628358.0488555}