{"duration": 0.04957127571105957, "input_args": {"text": "'— Marianne Lyles (@MarianneLyles) November 2, 2016 \\n\\nPolice are still developing information on a suspect and have warned that the scene remains dangerous. \\n“There’s definitely danger out there, someone is out there shooting police officers,” officer Parizek said. \\n2 officers killed: “There’s literally a clear and present danger if you’re a police officer” https://t.co/MjAzXn8pUr \\n— Des Moines Register (@DMRegister) November 2, 2016 \\n\\nDes Moines PD have paired up their officers as a precaution following the shootings. \\n“We are always vigilant about our safety, but we still got to get out there and do it,” Parizek told the media. \\nDes Moines police briefing press re: officers shot: “I can’t even begin to talk about how bad this is” @news4buffalo \\n— Katie Alexander (@KatieNews4) 2 November 2016 \\n\\nPolice will not be releasing names of either officer during initial presser, family getting notified. At least two more expected during day pic.twitter.com/9qIshG9jPP \\n— Jacob J. Peklo (@JacobPekloTV) 2 November 2016 \\n\\nThe Urbandale Schools District said that all schools will be closed Wednesday as a result of the fatal shootings and ongoing investigation. \\nAll @UrbandaleSchool Schools & Adventuretime cancelled today Wed Nov 2. All buildings closed. Staff do not report to buildings #UCSDAlert \\n— Urbandale Schools (@UrbandaleSchool) November 2, 2016 \\n\\n1st look at scene where 2 officers were shot & killed in an apparent ambush in Des Moines. Following this #BREAKING news in the #AlertCenter pic.twitter.com/c3kYpNRrrU \\n— Julian Glover (@JulianGloverTV) November 2, 2016 \\n\\nIn a statement the governor’s office said that “an attack on public safety officers is an attack on the public safety of all Iowans.” \\n“We call on Iowans to support our law enforcement officials in bringing this suspect to justice,” it added. Share Google + phyllis.goldner \\nI gain around 6.000-8.000 bucks monthly for freelancing i do from my home. Everyone prepared to do basic freelance jobs for 2h-5h a day from comfort of your home and get reasonable paycheck for doing it… This is a work for you… http://chilp.it/8d93f4b Phil Freeman \\nFuck off! Phil Freeman \\nThis is the result of the vicinage no longer tolerating roaming, uniformed, armed, militarized, abusive, banker revenue agents preying upon the working poor. No cop is safe, and this, however unfortunate, can and will continue. I suggest the police nation wide reconsider their role in OUR society. A come to geezuz moment of clarity is in order, that is unless you wish to continue digging holes. We are tired of your shit. ACAB! AlPennG \\nAT THE PRESS BRIEFING THE OFFICER CALLED THE PERSON THAT SHOT THE OFFICERS A COWARD WHICH THEY ARE BUT WHAT DO YOU CALL CRIMINAL COPS THAT SHOT UNARMED AMERICANS IN THE STREETS AND IN THE HOMES!?!?!? I WOULD LIKE HIM TO TELL US THAT Social Trending BREAKING: Two Cops Shot, Killed in ‘Ambush Style’ Attacks While Sitting in Their Vehicles, Shooter At Large November 2, 2016 Breaking: Podesta Told Mills ‘Dump All Those Emails’ on Day News of Clinton’s Private Email Server Broke November 1, 2016'"}, "time": 1742562149.4335608}