{"duration": 0.0570521354675293, "input_args": {"text": "\"  \\nDonald Trump has a Twitter problem. He has so little self-control when it comes to his chosen form of communication that in the final days of his presidential run, Trump’s team actually took control of his Twitter account away from him. Well, it seems that now that the election is over, Trump is back in control of that account, and he will be the president of out of control tweets. \\nAs everyone knows by now, Trump’s new position as President-elect has sparked nationwide protests by people who are standing against the hate and bigotry that Trump represents. In NYC alone, a massive peaceful protest broke out, filling the streets with people who wanted to make a statement: Donald Trump’s bigotry does not represent all Americans. Wow! #NotMyPresident protest in NYC right now. pic.twitter.com/RY7ALHQFih \\n— Maddow Blog (@MaddowBlog) November 10, 2016 \\nNotoriously thin-skinned, the moment Trump got his Twitter account back, he let loose in a rage for the ages, accusing the protesters of being paid to do what they are doing, and of being incited by a biased media. Here is a screenshot of that tweet, just in case someone around him decides it would be wise to delete it: \\nSo, in other words, Trump has once again showed America how temperamentally unfit he is to be president. If people exercising their First Amendment rights in protesting him and his policies provokes this kind of reaction, what will he do with the nuclear codes and the power of the presidency at his disposal? What will he do when a foreign leader insults him, or stands up to him or disagrees with him? We should all be terrified at the thought of such a situation. \\nTwitter reacted with mockery as well as horror: \\n— Derek Faraci (@WH_Woolhat) November 11, 2016 This is at the moment of his peak validation and respect. What happens when he suffers actual setbacks? Like every leader in history? https://t.co/hUTz8zu5TV \\n— Benjy Sarlin (@BenjySarlin) November 11, 2016 If you can't handle some protesters how are you ever gonna stand up to Vladimir Pyou know what nevermind https://t.co/MxksoxCzOI \\n— Dan Amira (@DanAmira) November 11, 2016 Four years of this. Why is he tweeting? Why is he crying on twitter after winning? Why? pic.twitter.com/90lCM4b4IC \\n— Vic Berger IV (@VicBergerIV) November 11, 2016 \\nDonald Trump is unhinged, and he keeps proving it. No matter how “presidential” or “gracious” he may have seemed during his meeting with President Obama or during his victory speech, do not be fooled. Make no mistake – this man is a hot-head and a loose cannon, and the 59 million suckers in America just made him the most powerful man in the world. \\nFeatured image via Spencer Platt/Getty Images Share this Article!\""}, "time": 1742564290.4444387}