{"duration": 0.15942716598510742, "input_args": {"text": "'A few months ago, Sarai Gonzalez’s proudest distinction was being a funny older sister. She hammed it up during dance parties in her family room in Green Brook, N. J. She wore studded pink   and baked a mean cupcake. Now, Sarai, 11, is in a Get Out the Vote ad.   Miranda is praising her on Twitter. She recently attended an event for Hispanic Heritage at the White House, where she hugged the president and was in high demand for selfies, wearing a blue satin gown. “It was like a flash,” Sarai said. In record time, she had gone from unknown little girl to Latina icon, all thanks to a viral music video: Sarai is the nerdy, round and confident tween who confronts bullies on the streets of Brooklyn in the video for “Soy Yo” or “That’s Me,” by the Colombian group Bomba Estéreo. If you’re Latina, chances are you’ve already seen her. The video, released by the band last month, got a million views in its first days. (It now has more than six million.) It was featured all over, from NBC News to Fusion. It spawned a hashtag, schoolchildren’’s art, and animated GIFs, which in turn became memes. “Soy Yo” seemed to appear at precisely the right moment  —   a defiant, and adorable, rebuke to the   rhetoric of the Trump campaign, and haters in general. “Don’t worry if they don’t accept you,” goes the song’s chorus, in Spanish. “If they criticize you, just say, ‘That’s me.’ ” The video resonated particularly with Latinas. Rarely in American life, especially in an era of ugly debates over immigrants, had popular culture created a young, brown,   character so heroic, free of victimhood, full of   dignity. Sarai made Latinas visible. Real Latinas. And they responded, in a chorus of “yes, that’s me. ” “It’s a reminder that Latinos are part of American life, American space is Latino space,” said María Elena Cepeda, who studies Latino representations in popular culture and teaches at Williams College. “Right now, that is a pretty transgressive statement. ” For Sarai, the video became like a home movie forever on repeat. “My mom was always checking it,” Sarai said. “My dad was playing it when he was washing clothes. ” It all came together through a mix of accident and authenticity. Sarai’s father, Juan Carlos Gonzalez, is from Costa Rica. Her mother, Diana Gonzalez, is from Peru. They came to the United States when they were about Sarai’s age. Devout Catholics, they met in church. Mrs. Gonzalez is a computer analyst at a Newark hospital and Mr. Gonzalez left his job as a construction engineer to be a    father. Sarai is the oldest of their three daughters, and as a child, “she would sing everywhere. ‘Mother Goose,’ ” Mrs. Gonzalez said. “The microphone, that was her best friend. ” And she was always  . In her mostly pink bedroom, a   sign says, “I am awesome!” Last year, recognizing her charisma, Sarai’s parents enrolled her in a program run by Actors, Models and Talent for Christ, or A. M. T. C. a Christian talent and modeling ministry. She traveled to Orlando, Fla. and was picked up by an agent in New York. But it was her father who saw the casting call for the video on an actors database. The director, Torben Kjelstrup, also entered the picture almost by chance. Mr. Kjelstrup, who lives in Copenhagen, won a contest to make the video for “Soy Yo,” which is off Bomba Estéreo’s 2015   album, “Amanecer. ” He didn’t intend to make a political statement. He was inspired by the message of the song  —   “about being yourself,” he said  —   and by a photo of his girlfriend from high school. “She had braces, red hair, this incredibly ugly track suit,” he said. “She just had something. ” He pictured “a story about her walking down the street, just emitting this   that rubs off on the viewer. ” He wanted to “paraphrase a   video,” so he headed to Brooklyn. (The video is shot in Williamsburg and Bushwick.) He held auditions over the summer that drew more than 100 young actors. “When I saw Sarai,” he said, “when she was waiting, the look on her face was just priceless. ” It was her first role, if you don’t count playing one of “The Three Little Pigs” in a school production. Mr. Kjelstrup had little trouble building out her character: short overalls, Crocs, big glasses and pigtail braids. That look, paired with Sarai’s attitude, was contagious. Immediately, thousands shared the video on social media many posted childhood photos. A woman who saw it in Montana, Alma Castillo, tweeted: “#Soyyo you have captured my infancia! Thank you for making me feel proud! #Latina” Melissa Zepeda, a student and barista in Austin, Tex. wrote on Instagram: “I wish this song and video was released when I was actually around this age, when I probably needed it the most. When I was too nerdy, too American, too fat, too Mexican. ” Jillian Báez, author of the forthcoming book “Consuming Latinas: Latina Audiences and Citizenship,” about how Latinas perceive media targeted toward them, said the response showed the therapeutic power of the video. “I absolutely think it can be recuperative for Latina audiences who may not have seen themselves when they were little girls. ” There have been startlingly few unconventional Latinas in popular culture. “Ugly Betty,” adapted from the Colombian telenovela “Yo Soy Betty, La Fea,” is virtually the only nerd Google “Latina girl nerds” or “Hispanic girl nerds” and the hits are for pornography. If Latinas are portrayed at all, said Isabel   author of “Dangerous Curves: Latina Bodies in the Media,” “the expectation is that they are going to be sexual, they are going to be spectacle. ” Sarai’s character is empowered, without any of that baggage. She drives off two snickering white girls by playing a recorder to the track of Andean panpipes. She confronts older boys, busting out dance moves learned from watching clips of Will Smith on “The Fresh Prince of  . ” If the video resonated most of all with Latinas, it may have been for this fluid blending of cultures, which came naturally to a little girl raised between them. “We would blast the music in our family room and my mom and dad would dance with me,” Sarai said. “It was pretty funny. ” Lately the family has a new ritual. At night, Sarai crawls into bed with her parents to look at the latest photos fans have posted. “I always cry,” her mother said. At Sarai’s age, Mrs. Gonzalez and her sister, recently arrived to the country from Peru, had to work in the Georgia tobacco fields with their parents. “I never saw myself on television,” she said. “I see myself finally on the big screen. And I don’t have to be a size 2 or have perfect skin or a certain color hair,” she added. “I can be myself. ” “This little girl is in every Latina woman,” said her husband. When her parents get emotional, Sarai tells them what to write. “Wow!! You look beautiful,” she wrote to the barista in Texas, who had never fit in. “Sarai sends a hug. ” Then she sent some hearts. Pink ones.'"}, "time": 1742563396.4463413}