{"duration": 0.01610255241394043, "input_args": {"text": "'http://humansarefree.com/2016/11/wikileaks-john-podesta-attended-satanic.html Here\\'s more evidence of Satanism among the government\\'s \"elite\" New WikiLeaks emails suggest John Podesta attended a “Spirit Cooking” dinner party at Marina Abramovich’s house. Given what we know about the performance artist’s occult fascination, it’s safe to assume they weren’t saying the Lord’s Prayer. So what happened at this dinner party? Marina Abramovich demonstrates what Spirit Cooking is in a YouTube video. Painting a wall with pig blood, Abramovich smears the sentence: “WITH A SHARP KNIFE CUT DEEPLY INTO THE MIDDLE FINGER OF YOUR LEFT HAND EAT THE PAIN.” Another daubed message reads: “FRESH MORNING URINE SPRINKLE OVER NIGHTMARE DREAMS.” Anramovich then throws blood over a small statue in the corner of the room, before writing “SPIRIT COOKING.” Blood is then ceremoniously run around the four corners of the room. Another message on the wall reads: “MIX FRESH BREAST MILK WITH FRESH SPERM MILK DRINK ON EARTHQUAKE NIGHTS.” Here\\'s her email to Tony Podesta: At 7 mins 30 Abramovich is seen in a projected video with a snake wrapped around her head, it’s tail in her nostril. Warning: in case you hadn’t guessed, this video contains graphic content. Spirit Cooking, according to an article about Marina Abramovich, “is about the conversion of matter into energy, of the material into the spiritual. Abramovic derives her inspiration from the popular belief that the spirits still need food even though it is no longer solid, but in the form of light, sound and emotions. [ Alexander : The only spirits that need food in the form of light, sound and — negative — emotions are the Archons who control mankind . They have e ntrapped our souls eons ago in the reincarnation cycle and torture us in this dimension of pain and sufferance, so that we polarize the pure energy that we receive from the Source into the much-needed negative energy, which they use to feed on and keep this Matrix running . The so called \"elite\" are empty vehicles used by these demonic beings to control and torture us — indefinitely. Luckily, in this incarnation we have the opportunity to learn how to escape their control when we get to the \"other side.\" ] This superstition is found in numerous cultures and there are even strict rules as to how this spiritual fare should be prepared. In this paradox, in the material underpinning of something immaterial, the physical and spiritual worlds meet. Or to use her own words, ‘When you make something visible for something invisible, the invisible becomes visible.’ Marina Abramovich has long been associated with the occult. Her performance art often features Satanic themes and mock human sacrifice. Take a look at this performance at the MoCA annual gala. Warning: NSFW. And, as all Satanists, she is fond of Baphomet and the pentagram (cut straight into her body). By Baxter Dmitry Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742628581.9960518}