{"duration": 0.03499603271484375, "input_args": {"text": "'324 324 likes \\nHis heated rhetoric is a response to the endless episodes of fraud, dirty trick and foul play by the Hillary campaign, as it seems that she will stop at nothing to become the first female POTUS – just the sort of abuse of power that the founders warned about. \\n1775-76 erupted in response to a long train of abuses – acts of oppression and hostility listed in the Declaration of Independence that is being largely repeated in modern day America. \\nCould Hillary’s reported election victory – or Donald Trump’s defeat – signal civil unrest and a new wave of resistance, particularly if the results are widely viewed as fraudulent or “rigged”? Trump, for one, has certainly been talking up the possibility of a stolen election. \\nThe scenario is plausible enough that the Pentagon and Homeland Security have been carrying out secret drills in the lead up to the election to prepare for the possibility of a martial law response to violence or civil unrest. \\nAs SHTF detailed in an exclusive report, a whistleblower has come forward on the ominous contingency plan to keep and/or restore order if the populace revolt against the establishment’s “selection” for president: \\nIf there is any truth to it, the 2016 election could be a kick-off for total tyranny. \\nAccording to an unnamed source – who has provided accurate intel in the past – an unannounced military drill is scheduled to take place during a period leading up to the election and throughout the month after. \\nDate: October 30th – 30 days after the election Suspected Region: Northeast, specifically New York \\n1st Phase: NROL (No Rule of Law) – drill involving combat arms in metro areas (active and reserve). Source says active duty and reserve service members are being vaccinated as if they are being deployed in theatre. \\n2nd Phase: LROL (Limited Rule of Law) – Military/FEMA consolidating resources, controlling water supply, handing out to public as needed. \\n3rd Phase: AROL (Authoritarian Rule of Law) – Possible new acronym or term for “Martial Law”. Curfew, restricted movements, basically martial law scenario. \\nSource said exercise involves FEMA/DHS/Military \\nAt this point, no one can say for certain what will happen in the aftermath of November 8, but it is clear that millions and millions of Americans are dissatisfied with the status quo, troubled about the economic realities perpetuated by the Fed and angry that Hillary may be put in the Oval Office rather than a jail cell, despite a trail of corruption with virtually no end. \\nHow far will things go? \\nAnd will things ever be reset without a new American Revolution? This entry was posted in World News and tagged Donald Trump , Mac Slavo , Revolution , SHTFPlan , Trump . Bookmark the permalink . Post navigation'"}, "time": 1742628431.7423525}