{"duration": 0.20009827613830566, "input_args": {"text": "'Bullion Banks Pass the Parcel On El Salvador’s Gold Reserves Posted on Tweet Home » Gold » Gold News » Bullion Banks Pass the Parcel On El Salvador’s Gold Reserves \\nAll central banks still report gold as one line item of “ gold and gold receivables”, which allow bullion banks to increase their unallocated balances which can then be used in myriad leveraged and hypothecated ‘gold’ trading transactions. If you think 4 LBMA bullion banks passing a parcel of central bank gold claims around between them is excessive, wait until you see 28 bullion banks doing the same thing… \\n\\n\\nSubmitted by Ronan Manly: \\nEighteen months ago I wrote a short synopsis of a gold sales transaction by the central bank of El Salvador wherein it had sold 80% (about 5.5 tonnes) of its official gold reserves. The title of the post was “El Salvador’s gold reserves, the BIS, and the bullion banks“. If you thought, why the focus on the Banco Central de Reserva de El Salvador ( BCR ), it’s not a major player on the world gold market, you’d be correct, it’s not in its own right that important. \\nHowever, the point of the article was not to profile the gold transactions of a relatively obscure central bank in Central America, but to introduce the topic of central bank gold lending to LBMA bullion banks, and the use of short-term ‘ gold deposits ‘ offered by these bullion banks. \\nThe reason being is this is a very under-analysed topic and one which I will be devoting more time to in the future. Gold loans by central banks to bullion banks are one of the most opaque areas of the global gold market. The fact that I’m using the central bank of El Salvador as the example is immaterial, it’s just convenient since the BCR happens to report the details of its gold lending operations, unlike most central banks. A Quick Recap \\nAt the end of September 2014, the BCR claimed to hold 223,113 ozs of gold (6.94 tonnes), of which 189,646 ozs (5.9 tonnes) was held in the form of “ deposits of physical gold ” with the Bank for International Settlements (BIS), and 33,467 ozs (1.04 tonnes) which was held as “ time deposits ” of gold (up to 31 days) with 2 commercial bullion banks, namely Barclays Bank and the Bank of Nova Scotia . \\nThe following table and all similar tables below are taken from the BCR’s ‘Statement of Assets backing the Liquidity Reserve’, or ‘Estado de Los Activos Que Respaldan la Reserva de Liquidez ’, which it publishes every 3 months. BCR gold position as of 30 September 2014 \\nIn November 2014, the BCR executed a small sale of 5007 ozs of its gold from its quantity held with the BIS, leaving a holding of 218,106 ozs (6.784 tonnes) as of 31 December 2014, comprising 184,639 ozs held in “ deposits of physical gold ” with the BIS, and 33,467 ozs of “ time deposits ” (of between 2 and 14 days duration) with 2 bullion banks, namely BNP Paribas and the Bank of Nova Scotia. Notice that as of the end of 2014, BNP Paribas was now holding one of the time deposits of gold, and that Barclays was not listed. BCR gold position as of 31 December 2014 \\nNotice also in the above table the tiny residual time deposit gold holding attributed to Standard Chartered Bank Plc. Rewind for a moment to 30 June 2014. At the end of June 2014, the BCR’s gold deposits were placed with 3 LBMA bullion banks, namely, Barclays, Bank of Nova Scotia, and Standard Chartered. \\nThis is the way short-term gold deposit transactions work. A central bank places the short-term gold deposit with one of a small number of bullion banks, most likely at the Bank of England, and when the deposit expires after e.g. 1 month, the central bank places the deposit again, but not necessarily with the same bullion bank. The deposit rates on offer (by the bullion banks) and the placements by the central banks are communicated over a combination of Bloomberg terminals, or by phone and then the transactions are settled by Swift messages. More about the actual mechanics of this process in a future article. BCR gold position as of 30 June 2014 BCR sold its gold at the BIS, put the rest on deposit \\nIn March 2015, the BCR sold 174,000 ozs (5.412 tonnes ) of gold, which left El Salvador with 44,000 ozs. When I wrote about this transaction 18 months ago I had speculated that: \\n“Since the Salvadoreans had 189,646 ozs on deposit with the BIS and needed to sell 179,000 ozs, the gold sold was most definitely sold to the BIS or to another party with the BIS acting as agent. \\nIt would not make sense to sell some or all of the time deposits that are out with the bullion banks such as Barclays and Scotia , since a large chunk of the BCR gold at the BIS would have to be sold also. It would be far easier to just deal with one set of transactions at the BIS. \\nThe above would leave the time deposits of 33,467 ozs (and accrued interest) out with the bullion banks, rolling over each month as usual. The other roughly 11,000 ozs that the BCR held with the BIS could be left with the BIS,or else this too could be put out on deposit with the bullion banks.” \\nThis speculation turns out to have been correct. By 31 March 2015, the BCR held 10,639 ozs of gold “ deposits of physical gold ” with the BIS, and the same 33,467 ozs of “ time deposits “, but this time split evenly between BNP Paribas and Barclays. The entire 174,000 ozs of gold sold came from the “ deposits of physical gold ” that El Salvador held with the BIS. BCR gold position as of 30 March 2015 \\nBy 30 June 2015, the central bank of El Salvador had moved its remaining 10,639 ozs of “ deposits of physical gold ” from the BIS, and placed it into “ time deposits ” with bullion banks, with the entire 44,106 ozs being evenly split across Bank of Nova Scotia, BNP Parias and Standard Chartered, each holding 14,702 ozs. BCR gold position as of 30 June 2015 \\nOver the 12 months from end of June 2014 to 30 June 2015, a combination of at least 4 LBMA bullion banks, namely, Barclays, Bank of Nova Scotia, Standard Chartered and BNP Paribas were holding short-term gold deposits on behalf of the central bank of El Salvador. I say at least 4 banks, because there could have been more. The snapshots every 3 months only reveal which banks held gold deposits on those dates, not the full list of deposits that could have been placed and matured over each 3 month period. \\nThese time deposits are essentially obligations by the bullion bank in question to repay the central bank that amount of gold. The original gold which was first deposited into the LBMA system could have been sold, lent or otherwise encumbered. It has become a credit in the LBMA unallocated gold system. Ultimately it needs to be paid back to the central bank by whichever bullion bank holds the deposit when the central bank decides that it no longer wants to roll its short-term deposits. This is why the anology of pass the parcel is a suitable one. \\nLooking at the more recent 3 monthly snapshots from September 2015 to June 2016, the same 4 LBMA bullion bank names were still holding the BCR’s gold deposits, namely Bank of Nova Scotia, Barclays, Standard Chartered and BNP Paribas. \\nAs of 30 September 2015 – Bank of Nova Scotia, Barclays and BNP Paribas, evenly split between the 3 of them. BCR gold position as of 30 September 2015 \\nOn 31 December 2015 – Bank of Nova Scotia, BNP Paribas, and Standard Chartered, evenly split between the 3 of them. BCR gold position as of 30 December 2015 \\nOn 30 March 2016 – Bank of Nova Scotia and BNP Paribas, evenly split between the 2 of them. BCR gold position as of 30 March 2016 \\nOn 30 June 2016, the BCR gold deposits were held by Bank of Nova Scotia and BNP Paribas, evenly spilt between the 2. The 30 June 2016 file on the BCR website doesn’t open correctly so this data was taken from the Google cache of the file. IMF Reporting standards \\nFinally, let’s take a quick look at what monetary gold and gold deposits actually are, as defined by the International Monetary Fund (IMF). \\n“Monetary gold is gold owned by the authorities and held as a reserve asset. Monetary Gold is a reserve asset for which there is no outstanding financial liability”, IMF Balance of Payments Manual (BPM) \\nIn April 2006, Hidetoshi Takeda, of the IMF Statistics Department published a short opinion paper on the ‘Treatment of Gold Swaps and Gold Deposits (loans)‘ on behalf of the Reserve Assets Technical Expert Group (RESTEG) of the IMF Committee on Balance of Payments (BoP) Statistics. The paper was called “ Issues Paper (RESTEG) #11 “. In the Issues paper, Takeda states: \\n“monetary authority make g old deposits ‘to have their bullion physically deposited with a bullion bank , which may use the gold for trading purpose in world gold markets ‘” \\n“‘The ownership of the gold effectively remains with the monetary authorities, which earn interest on the deposits, and the gold is returned to the monetary authorities on maturity of the deposits’” \\n” Balance of Payments Manual, fifth Edition (BPM5) is silent on the treatment of gold deposits/loans. However, the Guidelines states that, “To qualify as reserve assets, gold deposits must be available upon demand to the monetary authorities ” \\nYou can see from the above that once the gold balance that is represented by the gold deposit is under the control of a bullion bank as a unallocated balance, then it becomes an asset of the bullion bank and can be used in subsequent bullion bank transactions, such as being lent again, or used to support its trading book, etc. \\nThe big question is whether the gold as represented by the gold deposit is available on demand by the central bank which lent it. For ‘available on demand’ think using an ATM or walking into your local bank and withdrawing some cash from your account. It’s as simple as that. \\nTakeda said: \\n“Regarding the statistical treatment of gold deposits/loans, keeping the status quo is suggested. That is, if the deposited/loaned gold is available upon demand to the monetary authorities, it can be included in reserve assets as monetary gold. However, if the gold is not available upon demand, it should be removed from reserve assets “ \\nTakeda’s paper also covers the topic of “ Double counting of gold from outright sales of gold acquired through gold swaps or gold deposits/loans” where he says logically: \\n“double counting of gold can occur when a bullion bank sells outright gold acquired through gold deposits/loans from… monetary authorities” \\nIf the gold sold is not removed from the central bank’s balance sheet, it could: \\n“pose a problem when international statistical standards allow swapped/deposited gold to remain in the reserve assets of the gold provider.” \\nGiven that nothing has changed in the IMF’s reporting standards since 2006, i.e. the IMF did not take on board Takeda’s recommendations on gold loan accounting treatment, and given that all central banks still report gold as one line item of “ gold and gold receivables” , then you can see how these gold deposits that are being continually rolled over by central banks using a small number of LBMA bullion banks based in London a) are being double counted if the gold involved has been sold, b) only represent claims by a central bank on a bullion bank, and c) allow bullion banks to increase their unallocated balances which can then be used in myriad leveraged and hypothecated ‘gold’ trading transactions \\nIf you think 4 LBMA bullion banks passing a parcel of central bank gold claims around between them is excessive, wait until you see 28 bullion banks doing the same thing! Coming soon in a future article. \\nRonan Manly'"}, "time": 1742563068.2765968}