{"duration": 0.13419008255004883, "input_args": {"text": "'WASHINGTON  —   One topic has dominated conversations among elected Republicans since President Trump’s stunning victory: Will he actually pursue his campaign agenda of   nationalism, all but obliterating the   distinctions that have defined America’s political parties for a century? While some of his advisers suggested that he would slip back into a more conventional Republican approach, Mr. Trump dropped hints in interviews, Twitter posts and other public comments that he intended to push his party away from its   internationalist dogma on trade, foreign alliances, immigration, infrastructure spending and prescription drug access. The hints are over. An inaugural speech delivered with the same blunt force that propelled Mr. Trump’s insurgent campaign has dashed Republican hopes for a more traditional agenda. With his “new decree,” he declared himself modern America’s first populist president  —   and all but dared his own party to resist his Republican reformation. “Every decision on trade, on taxes, on immigration, on foreign affairs will be made to benefit American workers and American families,” he said. Mr. Trump’s vision will inevitably collide with establishment Republican leaders in Congress, and the outcome could determine not just the success of Mr. Trump’s presidency, but also the identity of his party. Republicans have resisted Democratic efforts to spend big on the nation’s roads, bridges, tunnels and rail lines use the federal government’s power to bargain for lower prescription drug prices block trade agreements and limit foreign interventions. Republican leaders have sought a   approach on immigration laws, offering a pathway to citizenship for illegal immigrants, and tried to restrain popular programs like Social Security and Medicare. If the president is able to blur party lines on such issues and harness an ascendant   coalition to win that clash, he will have untethered conservatism from the Republican Party and shifted the party away from the   approach that has been its hallmark since Ronald Reagan stood 36 years ago in the same position on the Capitol steps as Mr. Trump. But Mr. Trump is about to discover that his hopes for a realignment may not come easily. As in his campaign, he faces an array of obstacles: his historic unpopularity and lack of discipline, advisers who hope to nudge him back toward conventional Republicanism and, perhaps most significant, other party leaders who have a more conservative outlook on domestic policy and government spending and a more hawkish attitude on foreign affairs. The alarm and anxiety within the Republican Party’s congressional wing toward its own president are remarkable. And among Mr. Trump’s most outspoken intraparty critics, the warnings of resistance are unambiguous. “There are three branches of government,” said Senator John McCain, Republican of Arizona. “We now have a majority in both houses. And both majorities I think hold to basic conservative Republican principles. ”   the threat of reprisal, Mr. McCain said he intended to be true to what he saw as his party and his voters: “Trump carried Arizona by four points. I carried my state by 14 points. ” Senator Jeff Flake of Arizona, who like Mr. McCain has repeatedly clashed with Mr. Trump, said that he was preparing for the president to back his opponent in a primary next year  —   but that it would not dissuade him from putting up opposition on some issues. “There are some of us who will be pushing to get back to the roots of the party: limited government, economic freedom, individual responsibility, free trade,” Mr. Flake said. “Those are things that the party has stood on for a long time. ” Mr. Trump and some of his closest advisers say such resistance is not just futile but foolish. And they are already pledging to harness Mr. Trump’s following in the states and districts of recalcitrant Republicans to sound warnings of their own. “The incentive for many of these members will be to follow Mr. Trump’s lead because he won many of their states,” said Kellyanne Conway, the president’s campaign chief turned senior White House adviser. Aiming at perhaps the most powerful congressional Republican, and one of the more orthodox conservatives, Ms. Conway pointedly recalled Speaker Paul D. Ryan’s inability to carry his own state in 2012 as the party’s   nominee. “Speaker Ryan knows   lost by seven points in Wisconsin, and Mr. Trump just won the state,” she said. As Ms. Conway noted, many Republican skeptics were doubtful that Mr. Trump could win in the first place. But even some on the right who are sympathetic to elements of his vision worry that there is no infrastructure to undergird and promote Trumpism  —   unlike Reagan’s conservative movement or former President Bill Clinton’s centrist “third way” approach. Traditional conservatives dominate Capitol Hill, Washington’s think tanks and advocacy groups, as well as   statehouses. “Populism has been an energy that has carried Republicans into office, but once in office very few of them stay populist,” said Matthew Continetti, editor in chief of the conservative Washington Free Beacon. Reihan Salam, the executive editor of National Review, said, “I think it’s likely that Trump is premature,” arguing that Mr. Trump is aligned with the party’s voters but a step ahead of its congressional wing. “He is only one man. ” There are Republicans who still believe that Mr. Trump will govern more as a   conservative even as he attracts a broader coalition of   voters to the party. “I don’t think he is going to fundamentally reshape the party on issues,” predicted Gov. Scott Walker of Wisconsin. He added that Mr. Trump’s political legacy would be to “open the eyes” of voters who had not supported Republican presidential hopefuls in recent years. Mr. Walker said Mr. Trump himself had said he was not “a policy guy” and argued that the president would lean heavily on Vice President Mike Pence and the White House chief of staff, Reince Priebus, to carry out his agenda. That is exactly what worries some Republicans who share Mr. Trump’s views: that the president will be undermined by some in his inner circle. When Mr. Trump veered away from orthodoxy during the transition, some of his advisers quickly tried to recast his comments with a more conservative veneer. “My concern with Reince is he’s bringing in a lot of the   folks,” said Rick Santorum, a onetime senator from Pennsylvania, who ran a     campaign for the Republican presidential nomination in 2012. “They’re not fans of the agenda, much less real fans of Trump. ” And, Mr. Santorum added of Mr. Pence’s roots in traditional conservatism, “candidly this is not where Mike has been in the past, either. ” Still, Mr. Santorum said, he spoke on the phone to Mr. Trump this past week, and the incoming president was every bit as committed to his style of politics as he was during the campaign. “He’s not going to change,” Mr. Santorum said. Mr. Trump’s Inaugural Address reflected as much, and it highlighted the influence of the most prominent nationalists entering the West Wing this weekend, the senior advisers Stephen K. Bannon and Stephen Miller. The new president not only outlined his brand of politics, but also sent a message to those who work in the building behind him. “We will no longer accept politicians who are all talk and no action,” Mr. Trump said. “The time for empty talk is over. ” Or as Ms. Conway put it, “When he says, ‘We’re going to build the wall,’ he means it, and when he says, ‘We’re going to renegotiate trade deals,’ he means it. ” “  or undercutting or trying to change Donald Trump is a fool’s errand,” she added. “People who watched this campaign should have discovered that by now. ”'"}, "time": 1742563597.0025413}