{"duration": 0.031600236892700195, "input_args": {"text": "'By Sarah Jones on Tue, Nov 1st, 2016 at 1:26 pm Comey struggled with not wanting to appear biased as the FBI investigated Russian interference with the U.S. presidential election, and so he told the Obama administration not to accuse Russia of the DNC hackings lest they be seen as \"partisan\". Share on Twitter Print This Post \\nRussia did hack the Democrats. So all of that email information that the media has been reporting came from a foreign entity that seeks to alter the outcome of the U.S. election. \\nBut FBI Director James Comey struggled with not wanting to appear biased as the FBI investigated Russian interference with the U.S. presidential election, and so he told the Obama administration not to accuse Russia of the DNC hackings lest they be seen as “partisan”. \\nRepublican FBI Director James Comey advised the Obama administration not to publicly accuse Russia of hacking the DNC and more “on the grounds that it would make the administration appear unduly partisan too close to the Nov. 8 election,” officials “familiar with the deliberations” told the Washington Post. \\nThese sources with knowledge of the internal discussions spoke to the Post on the condition of anonymity. \\nThere are a few reasons why Comey might want to keep his agency’s investigation of Russian interference under the radar, but given his choice to publicly suggest that his agency might be re-opening its exhaustive investigation of Clinton’s emails, which resulted from a Republican-led, bogus, overreaching and seemingly endless Benghazi investigation that also cleared Clinton, it seems odd that Comey was going to stay silent on the Russia matter. \\nComey’s decisions is especially odd given the reports that the Russians have been communicating and coordinating with Republican presidential nominee Donald Trump to the point that he is already “compromised.” \\nOnly one of these matters might allow a foreign power control over the United States president. \\nThe same sources tell the Post that Comey made the decision to reveal the Clinton emails to Congress because he had already testified in that matter and said the investigation was closed, which suggests that he was concerned with his own reputation. \\nNot sure I’m buying that because if Comey really only cared about his own reputation ahead of not appearing partisan he wouldn’t have said anything at all, but that doesn’t mean that his motives were nefarious. \\nThere might well be good reason for this – after all, this is the FBI and they can’t tell us everything, but as of right now Comey has mishandled this `and appears to be trying to influence an election to help Republicans. Just because he is a Republican and just because he has donated to Republicans doesn’t mean he isn’t doing his job properly. \\nBut Comey has a lot of explaining to do right now. He is under fire for good reason, as the explanations he’s giving for these decisions don’t make sense and are contradictory.'"}, "time": 1742628427.2341158}