{"duration": 0.027913808822631836, "input_args": {"text": "'Zero Hedge November 1, 2016 \\nWith both Harry Reid and Hillary Clinton voicing extreme accusations of violating federal law against FBI Director Comey’s decision to be transparent about his investigation into Clinton’s emails, it appears President Obama is having none of it. As White House spokesman Josh Earnest stated: “President Obama doesn’t think Comey is trying to influence the election.” \\nSenate minority leader Harry Reid claiming Comey may have violated federal law… \\n“I am writing to inform you that my office has determined that these actions may violate the Hatch Act,” Reid wrote in a letter to Comey, according to the Wall Street Journal. \\nThe Hatch act prohibits government officials from using their positions to influence an election. \\n“Through your partisan actions, you may have broken the law.” \\n“When Republicans filibustered your nomination and delayed your confirmation longer than any previous nominee to your position, I led the fight to get you confirmed because I believed you to be a principled public servant,” Reid wrote. \\n“With the deepest regret, I now see that I was wrong.” \\nBut, President Obama has now crushed that narrative: \\nJohn Earnest explains: \\n“President Obama doesn’t think Comey tried to influence the election.” \\n“Obama still believes Comey has “good character”” \\n“Obama has a lot of confidence in AG Loretta Lynch” \\nWhich, roughly translated into images is this… \\n\\nFurthermore, as we noted last night , Harry Reid had suggested that ” talked w/ top NatSec officials who say that Comey “possesses explosive information” about Trump’s ties to Russia.” \\nThat has also been completely rebuffed as The White House says it “has not been briefed on the existence of any FBI investigation on activities, habts of Donald Trump.” \\nSo more lies?!'"}, "time": 1742562124.030764}