{"duration": 0.07333064079284668, "input_args": {"text": "\". Actually, ‘Nobody’ Won the 2016 Presidential Election — and It Was a Landslide “Nobody for President, that’s my campaign slogan,” Nick Cannon asserted in “ Too Broke to Vote ,” hi... Print Email http://humansarefree.com/2016/11/actually-nobody-won-2016-presidential.html “Nobody for President, that’s my campaign slogan,” Nick Cannon asserted in “ Too Broke to Vote ,” his viral criticism of the American electoral process from March of this year. Now, it turns out nobody for president won the 2016 election in a landslide.According to new voter turnout statistics from the 2016 election, 47 percent of Americans voted for nobody, far outweighing the votes cast for Trump (25.5 percent) and Hillary (25.6 percent) by eligible voters.And the “I voted for nobody” group is actually much larger than the 47 percent reported because that number only includes eligible voters.How many millions of Americans under the legal voting age — not to mention the countless millions who have lost their voting rights — voted for nobody, as well? Factoring in those individuals, around 193 million people did not vote for Trump or Clinton. That’s nearly two-thirds of the population of the United States.Nobody also seemingly won the presidential primaries, with only 9 percent of Americans casting their votes for either Trump or Clinton. So when does nobody take office? Nobody won the majority of votes in the primaries or the general election, and the two main candidates who were running didn’t “win” the popular vote — they simply slightly outcompeted each other considering neither garnered over 50 percent of the eligible voters’ ballots.That’s where the real debate begins.As I wrote back in August when the primary voter turnout rates came in, one could argue that Trump (and Obama ) do not have a legitimate mandate to rule over the people of the United States. Trump did not win the majority of Americans’ votes — not even close. When all Americans are included, Trump only garnered the votes of about 19 percent of us. This means the United States will be ruled over by a small minority of voters who elected someone to continually impose their political positions on the other 81 percent of us. Ron Paul: ' US Elections Are Rigged & Voting is Used to Pacify the Public ' Of course, as is the case with Democrats looking to assign blame for Hillary’s loss, pundits and political pontificators argue the people who didn’t vote have no right to complain about the outcome. After all, a non-vote or a vote for a third-party candidate was, in actuality, a vote for Trump. But that logic is flawed. The majority of Americans don’t vote anymore because the political system no longer represents them . We’ve been disenfranchised by decades of corrupt, unrepresentative politicians.The United States, according to a highly-cited academic study, is effectively an oligarchy “elected” by a minority of voters ruled by a smaller minority of disliked politicians who represent an even smaller minority of billionaires and special interests. You know it, I know it, hell, even former U.S. President Jimmy Carter knows it . The majority of Americans voted for nobody not because they don’t care or because they are apathetic — they voted no confidence in a political system that forgot about them a long time ago. By Nick Bernabe Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742563081.0438807}