{"duration": 0.10167241096496582, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. A powerful earthquake in a mountainous stretch of central Italy devastated historic towns in three regions. The stunned mayor of one, Amatrice, reported that “half the town no longer exists. ” More than 100 people were killed in the quake and its aftershocks, many more were injured, and more than 1, 000 people are spending the night in emergency camps. Watch video from the scene. ______ 2. Turkey sent tanks, warplanes and special forces across the Syrian border to attack Islamic State positions, escalating the Syrian conflict days after a suicide bomber killed more than 50 people at a Turkish wedding party. Turkey also insisted that Syrian Kurdish militias, which it distrusts, retreat from the territorial gains they made with U. S. backing. ______ 3. Bernie Sanders is establishing a new group, Our Revolution, to fight economic inequality and special interests. But some of his core staff members have stepped down. One objection is that tax rules would allow Our Revolution to accept large donations from anonymous sources. Another is the leadership role of Mr. Sanders’s former campaign manager, Jeff Weaver, above left in March, whom some do not trust. ______ 4. Donald Trump’s efforts to reach out to   are alienating some black voters, who reject his portrayal of black America as defined by misery, poverty and urban perils. “Black America also has a large community of striving, successful,   people:   in the work force,” said a black leader. ______ 5. Hillary Clinton remained on the West Coast for a second day of   including one hosted by Tim Cook, Apple’s chief executive. Our election model currently gives the Democrats a 60 percent chance of retaking the Senate. But the   trajectory may not be so smooth, because of    candidates in key states like Pennsylvania, Florida, North Carolina, Nevada, Iowa and Ohio. Above, the end of a lunch in Washington in January. ______ 6. The last major guerrilla struggle in Latin America is over. Colombia’s government and FARC rebels announced a final deal, ending a conflict that, over 52 years, claimed some 220, 000 lives and displaced more than 5 million people. President Juan Manuel Santos, who has staked his legacy on peace, must now sell the agreement to his people, who will be asked to vote in an    referendum on the deal. ______ 7. Astronomers reported a tantalizing discovery: Circling our nearest neighboring star is a   Goldilocks planet, one at just the right distance from its sun to be neither too hot nor too cold for liquid surface water. A scientist on the team said it was like a neon sign, flashing, “I’m the nearest star, and I have a potentially habitable planet!” ______ 8. Unease over the banning of “burkinis” has begun building in France, as images and reports of sometimes humiliating beachfront confrontations between the authorities and Muslim women circulate. The interior minister, Bernard Cazeneuve, cautioned that enforcement efforts should not “stigmatize” people or “set one against another. ” ______ 9. Trolls and hackers renewed their assaults on the “Ghostbusters” star Leslie Jones. Her personal website was breached, plastered over with a picture of the gorilla Harambe  —   which became a racist meme after being killed in a Cincinnati zoo  —   images of her driver’s license and passport, and what appeared to be nude photos of her. The musician Questlove posted on the gravity of the attack: “It’s racist  sexist. It’s disgusting. This is hate crimes. This ain’t ‘kids joshing round.’ ” ______ 10. Good economic news: The U. S. housing sector is finally back on its feet. A new report shows that more new homes were sold last month than in nearly a decade. Analysts say builders have begun serving the   end of the market, including young adults who are entering their prime   years. ______ 11. Finally, more good news: European scientists have figured out how to identify women with   breast cancer who can recover well without  chemotherapy. If most of the genes that control the growth and spread of cancer are inactive, then surgery, hormonal treatment and radiation appear to be enough to discourage recurrence. The finding could spare tens of thousands of women annually from the harshest cancer treatments. Above, survivors at an N. F. L. game last fall. ______ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742564152.4733558}