{"duration": 0.11905741691589355, "input_args": {"text": "'Four days after students at a high school newspaper in Kansas published an article that questioned the credentials of a recently hired principal, she resigned. The episode, which unfolded at Pittsburg High School in Pittsburg, Kan. about 125 miles south of Kansas City, garnered news coverage and won praise from journalism organizations for investigative reporting by student journalists. The story began to germinate on March 6, when the Pittsburg Community Schools announced it had hired Amy Robertson as the high school principal. In a statement, it said her “diverse and extensive experience impressed district staff and leadership and repeatedly propelled her to the top” of the list of candidates. She had “decades of experience in education” and was the chief executive of a consulting firm that advised companies on education, the statement said. Maddie Baden, a    junior and a staff member of the   newspaper The Booster Redux, set out to write a profile. Emily Smith, a teacher and adviser to The Redux, said on Wednesday that she had not expected the reporting to lead to questions about Ms. Robertston’s credentials. “We’re Midwesterners,” she said. “As soon as somebody puts something on paper, we think they’re honest about what they’re saying. ” But in multiple interviews over several days, Ms. Robertson provided details of her background that did not hold up, Ms. Smith said. Then Ms. Robertson became increasingly evasive. “She was asked direct questions,” Ms. Smith said. “She couldn’t give direct answers. ” Ms. Smith coached the students to press for clearer responses, pushing them to be more assertive with an adult in authority than they were accustomed. The students questioned the legitimacy of Corllins University, an institution where Ms. Robertson said she got her master’s and doctorate degrees. It lists no physical address on its website and has been the subject of consumer complaints and warnings about its lack of accreditation. Her profile on LinkedIn, the professional networking site, did not identify where she had earned her master’s degree and Ph. D. listing only “ . ” Smaller details also aroused the students’ curiosity. For instance, Ms. Robertson said she had earned a bachelor’s of fine arts degree from the University of Tulsa, but when the students checked, they learned it does not confer that kind of degree, Ms. Smith said. The students and Ms. Smith met with the school superintendent, Destry Brown, about their concerns, and he was “supportive and open,” she said. They kept reporting and “continued to write up to five minutes before it went to print,” she said. On Friday, The Redux, a monthly broadsheet published 10 times a year, hit the newsstands with a   story, headlined “District Hires New Principal” and with the subheading, “Background called into question after discrepancies arise. ” On Tuesday night, the board of education met and announced that Ms. Robertson had resigned. “In light of the issues that arose” she felt it was in the district’s best interest, a board statement said. Ms. Robertson, who was to assume the $   position starting on July 1, could not be immediately reached for comment on Wednesday. Ms. Robertson, who lived in Dubai, United Arab Emirates, was the principal of the Dubai American Scientific School, and recently had her license temporarily suspended by education authorities there, The Gulf News reported. Immigration issues prevented her from getting needed permits, The News reported. Mr. Brown praised the students for their persistence but acknowledged he felt a twinge of disappointment about how it unfolded. He said Ms. Robertson’s hiring was contingent on passing a background check and producing needed documentation. He said the details would have come out eventually, but the students’ work sped thing up. “I believe strongly in our kids questioning things and not believing things just because an adult told them,” he said. “I have a little bit of heartburn over the whole article. I wasn’t going to stop that because I believe in that whole First Amendment thing. ” Journalism groups were also full of praise. Tom Rosenstiel, executive director of the American Press Institute, a journalism research and training group, said his organization has seen outstanding work from college students working with professional journalists on investigations but said that what the high school students did “really stands out. ” At a time of shrinking resources in newsrooms, students are helping to fill gaps in coverage, he said, adding, “There’s a sense that significant journalistic investigations can come from anywhere now. ” Student journalists are routinely underestimated by those in positions of authority, Frank LoMonte, executive director of the Student Press Law Center, said on Wednesday. The students consulted with him about their reporting on the article. The article might never have appeared had it not been for the Kansas Student Publications Act, which grants students independent control over their editorial content, including material that might paint a school in an unflattering light, he said. A 1988 Supreme Court ruling gave administrators the authority to censor the content of student journalists. Ten states, including Kansas, passed laws giving students independent control, although administrators can still remove material that is obscene, defamatory or poses a danger to the school. Similar bills are pending in nine other states, Mr. LoMonte said. “If that same situation happened in Texas, New York or Florida, that story would not have seen the light of day,” he said. He credited school administrators for taking a   approach and letting the students pursue the reporting. “I hope it really emboldens young people to take on substantive news stories even if they are afraid of administrative censorship,” he said. “This story proves you can make positive changes in your community through journalism. ”'"}, "time": 1742564425.0172775}