{"duration": 1.2853951454162598, "input_args": {"text": "'Gwynn Guilford and Nikhil Sonnad of Quartz profile Stephen K. Bannon’s (or, to those who wish to maximize their SEO, Steve Bannon) beliefs based on his public statements  —   past interviews, speeches, and films. [From Quartz:  The three tenets of Bannonism, Bannon’s political philosophy boils down to three things that a Western country, and America in particular, needs to be successful: Capitalism, nationalism, and “  values. ” These are all deeply related, and essential. America, says Bannon, is suffering a “crisis of capitalism. ” (He uses the word “crisis” a lot —  more on that later.) Capitalism used to be all about moderation, an entrepreneurial American spirit, and respect for one’s fellow Christian man. In fact, in remarks delivered to the Vatican in 2014, Bannon says that this “enlightened capitalism” was the “underlying principle” that allowed the US to escape the “barbarism” of the 20th century. Since this enlightened era, things have gradually gotten worse. (Hence the “crisis. ”) The downward trend began with the 1960s and ’70s counterculture. “The baby boomers are the most spoiled, most   most narcissistic generation the country’s ever produced,” says Bannon in a 2011 interview. He takes on this issue in more detail in Generation Zero, a 2010 documentary he wrote and directed. The film shows one interviewee after another laying out how the “capitalist system” was slowly undermined and destroyed by a generation of wealthy young kids who had their material needs taken care of by hardworking parents —  whose values were shaped by the hardship of the Great Depression and World War II —  only to cast off the American values that had created that wealth in the first place. This shift gave rise to socialist policies that encouraged dependency on the government, weakening capitalism. Eventually, this socialist vision succeeded in infiltrating the very highest levels of institutional power in America. “By the late 1990s, the left had taken over many of the institutions of power, meaning government, media, and academe,” says Peter Schweizer, a writer affiliated with Bannon’s Government Accountability Institute, a conservative think tank, in Generation Zero. “And it was from these places and positions of power that they were able to disrupt the system and implement a strategy that was designed to ultimately undermine the capitalist system. ” (As he says “undermine the capitalist system,” the film zooms in on the word “Lucifer” in that   epigraph from Saul Alinsky.) Underlying all of this is the philosophy of Edmund Burke, an influential   Irish political thinker whom Bannon occasionally references. In Reflections on the Revolution in France, Burke presents his view that the basis of a successful society should not be abstract notions like human rights, social justice, or equality. Rather, societies work best when traditions that have been shown to work are passed from generation to generation. The baby boomers, Bannon says in a lecture given to the Liberty Restoration Foundation (LRF) failed to live up to that Burkean responsibility by abandoning the    values of their parents (nationalism, modesty, patriarchy, religion) in favor of new abstractions (pluralism, sexuality, egalitarianism, secularism). For both Burke and Bannon, failure to pass the torch results in social chaos. Read the rest of the story here.'"}, "time": 1742563621.8265865}