{"duration": 0.3604137897491455, "input_args": {"text": "\"[Photo: Demonstrators protesting legislative threats to privatize public housing instituted under Chavez. Credit: Venezuela Analysis .] =By= Mike Weisbrot Editor's Note Mike Weisbrot deserves a round of applause for not trying to make this a simple issue. I, and I imagine you, have read plenty of those. So set you brain to hold more than four strands and off you go! T he international media have provided a constant fusillade of stories and editorials (not always easily distinguished from each other) about the collapse of the Venezuelan economy for some time now. Shortages of food and medicine, hours-long lines for basic goods, incomes eroded by triple-digit inflation and even food riots have dominated press reports.\\nThe conventional wisdom has a set of predictable narratives to explain the current economic mess. “Socialism” has failed — never mind that the vast majority of jobs created during the Hugo Chávez years were in the private sector, and that the size of the state has been much smaller than in France. The whole experiment, it is said, was a failure from the beginning. \\nAccording to this narrative, nationalizations, anti-business policies, populist overspending during the years of high oil prices and the collapse of oil prices since 2014 sealed Venezuela’s fate. Adherents to this explanation say the downward spiral will continue until the chavistas are removed from power, either through elections or through a coup (most pundits don’t seem to care which). \\nThe reality is somewhat more complicated. First, the Bolivarian experiment did pretty well until 2014. From 2004 — after the Chávez government got control over the national oil industry — until 2014, real income per person grew by more than 2 percent annually. This is an enormous change from the horrendous long-term decline in the 20 years prior to Chávez, when GDP per capita actually shrank at an average annual rate of 1.2 percent. During the same years (2004–2014), poverty fell by 49 percent and extreme poverty by 63 percent — and this counts only cash income. The number of people over 60 years old receiving public pensions tripled, and millions of Venezuelans gained access to health care and education. It is the gains over this decade of chavismo that explain how the United Socialist Party of Venezuela (PSUV) was able to win 41 percent of the vote in National Assembly elections in December 2015, despite serious shortages of consumer goods, 180 percent inflation and a deep recession. \\nNow for the downward spiral of the economy over the past three years: Was this inevitable? And is it irreversible until the PSUV leaves power? To answer these questions, we must look at how Venezuela got into this situation, and how it might get out of it. The Story of Venezuela’s Economic Recession \\nIn the fall of 2012, and again in February 2013, the government sharply reduced the availability of foreign exchange. It was during this time that shortages of basic goods accelerated, along with inflation and the black market price of the dollar. The official exchange rate, at which the government sold the vast majority of dollars earned from oil sales, was at 6.3 Bolivares Fuertes (Bs.F) per dollar. But a parallel market already existed, and the shortage of dollars at the official rate drove the parallel market sharply upward. At the same time, the higher parallel market price of the dollar increased inflation, because it increases the price of imported goods. \\nAnd when inflation goes up, more people want to buy dollars, because they see the dollar as something secure that won’t lose value to inflation. But this drives the price of the dollar up on the parallel market, which increases inflation even more. This cycle continues, causing an “inflation-depreciation” spiral. In October 2012, inflation was at 18 percent, and the parallel market rate was at 13 percent. By the end of 2015, annual inflation was at 180 percent and the parallel market rate was at 833 percent. The shortages of consumer and other goods also contribute to this spiral, and they have increased with it. \\nBy the first quarter of 2014, the Venezuelan economy was already in recession, even though international oil prices were more than $100 a barrel. By January 2015, prices had fallen to $48 a barrel, and are about the same today. This depleted the government’s revenue by a similar percentage, and the government resorted to printing money to cover expenses. The money creation would not necessarily accelerate inflation, but in the context of the inflation-depreciation spiral it certainly did. So inflation rose even faster. \\nSince late March, the parallel market rate has fallen from a peak of more than 1,211 to about 1,025 Bs. per dollar today — about a 15 percent drop in the price of the dollar as measured in domestic currency — after shooting up rapidly for more than three years. At the same time, the government allowed the price of the dollar on a third market, called the SIMADI or DICOM rate, to go up. It is now at about 640 Bs. per dollar, or more than 60 percent of the parallel market rate. \\nHowever, this does not mean that the economy is on the road to stabilization. \\nFirst, the parallel rate is still 100 times the lower official rate of 10. Second, one of the main things that has slowed the inflation-depreciation spiral has been the deepening recession. There are far fewer people with money to buy dollars, and many are depleting their dollar savings in order to buy necessities. This has pushed down the price of the dollar on the parallel market. \\nWhat this means is that the Venezuelan economy cannot recover under the current exchange rate system. It is stuck in recession. Furthermore, the multiple exchange rate system, with its vast differences between the different rates, creates an enormous incentive for corruption. Anyone with access to official dollars can multiply their income by 100 simply by selling them on the black market, which is completely accessible to almost anyone. \\nBut the official exchange rate system is only one way that the government’s dollar revenue is lost. Gasoline, even after the recent price increases, is about 6 Bs. per liter — or about one US cent per liter at the SIMADI exchange rate. Electricity and gas are also heavily subsidized. These subsidies cost the government more than 13 percent of GDP. For comparison, the total income tax revenue (individual plus corporate) of the US federal government in 2015 was about 10.6 percent of GDP. At the same time, there are price controls that are difficult or impossible to maintain in the current economic situation. In 2015, overall consumer prices increased by 180 percent; yet food prices, which are subject to price controls, increased by 300 percent. This is a pretty clear demonstration that price controls are not working. A Possible Path to Recovery \\nMillions of Venezuelans now make their living from arbitrage of some sort — from waiting in line for hours for a small allocation of subsidized food and reselling it, to trading currency on the parallel market, to selling stolen goods. Even a dictatorship with considerable repressive power to crack down on all illegal transactions would have trouble maintaining a functioning economy with the magnitude of these price distortions. But Venezuela is not a dictatorship; in fact, the state is very weak in terms of law enforcement. \\nGiven this situation, it is clear that serious reforms are necessary in order to restart the economy. The Union of South American Nations (UNASUR) has assembled a team of economists, headed by former president of the Dominican Republic, Leonel Fernández, which has presented a set of proposals. (Full disclosure: I am one of the members of this team.) \\nThe most obvious change that is needed is to unify the multiple exchange rate system. This should be done quickly, and in one step. The government can auction a fixed amount of dollars each day, with the price determined by supply and demand. Although allowing the currency to float seems scary to many people, the price of the dollar would undoubtedly stabilize at something considerably less than the current parallel market rate of about 1,000. A floating rate is also the only way to avoid wasting scarce foreign exchange reserves in a futile attempt to maintain an overvalued fixed rate. \\nSince devaluations generally lead to price increases, it would be necessary to protect people from any rising costs of essential goods, including food. This could be done with a vast expansion of the government’s current system of the Tarjeta Misiones Socialistas (a card system providing direct subsidies to lower-income families), which would give people a large discount that could compensate for any price increases. This system would be in place before the unification of the exchange rate. \\nThe energy subsidies could then be phased out more gradually over the next 18 months. To make this economically and politically acceptable, the additional government revenue as energy prices are allowed to rise would be added to the tarjetas (cards). This would be a net gain for the vast majority of Venezuelans. Some price controls — including those that do not allow producers to meet their costs — would be phased out. \\nOther measures to protect people’s living standards would include indexing wages to inflation, and creating a temporary public works program to create employment. These could be financed by a wealth tax similar to one in Colombia, and by a tax on financial transactions. \\nThe government can help finance the transition by selling some of its foreign assets. At the same time, it will have to restructure its debt in order to reduce the $17 billion of debt payments (interest and principal) that would otherwise be due over the next year and a half. \\nAll of this is feasible even with current oil prices because Venezuela has already adjusted its level of imports to match the fall in oil prices, which provide more than 90 percent of the country’s dollar earnings. It has been an enormous adjustment; imports have fallen by more than half since 2012. For comparison, Greece, after more than six years of depression, has reduced its imports by 28 percent. \\nThis means that the hard part of the adjustment — the one that often requires people to reduce their living standards in order to sharply reduce imports — has already been done. It is relative prices now that have to be adjusted in order to recover. The result is that Venezuela can return to growth rather quickly, without the prolonged recession that neoliberal adjustment normally creates. Left Critiques of Proposed Economic Reforms \\nMuch of the left — including people inside the government and among the base of its party, the PSUV — rejects these economic reforms. They think it is a “ paquetazo ” (package) similar to International Monetary Fund (IMF) or neoliberal reforms that increased poverty in the past. They see the fixed exchange rate as socialistic and a floating exchange rate as a “free market” reform. But in reality, the informal economy for dollars constitutes one of the most destructive “free markets” that exists; it is the “ capitalismo salvaje ” (“savage capitalism”) that Hugo Chávez used to denounce. (Chávez himself successfully floated Venezuela’s currency in February 2002, and dollar reserves actually increased despite serious political instability.) And we can recall that the IMF supported fixed, overvalued exchange rates with disastrous results in Argentina, Brazil, Russia and a number of Asian countries in the last years of the 20th century. \\nThere is nothing neoliberal about a program in which the government creates employment, protects wages from inflation (which has not happened since inflation began to skyrocket nearly four years ago), subsidizes food and essential items on a large scale, and protects people generally from the burden of the adjustment of relative prices. \\nYet there are those on the left who seem to think that Venezuela can recover without fixing its most fundamental and destructive imbalances. Alfredo Serrano, an adviser to the government, posted eight “ economic theses ” on Venezuela on September 1. In 2,700 words, there is no mention of Venezuela’s dysfunctional exchange rate system. \\nAt the same time, the US government — which has sought “regime change” in Venezuela for the past 15 years — is trying to further destabilize the economy. In March 2016 President Obama once again declared that Venezuela posed an “unusual and extraordinary threat to the national security” of the United States, and imposed economic sanctions. The sanctions themselves are not economically important, but they send a message to investors who know what happens to countries that are labeled an “extraordinary threat” to the United States. The Obama administration has also pressured US financial institutions not to do business with Venezuela. \\nThe international media and their usual sources are also playing their traditional role, and some of the widely reported stories have been wrong. By 2015, there were widespread reports that the poverty rate had increased to 76 percent when this was practically impossible. The IMF, which has a long history of politically influenced forecasts, projected that GDP would shrink by 10 percent last year, when the actual figure was 5.7 percent. The media report IMF projections of 720 percent inflation for this year, although this is likely to be way off. It is further evidence of the media’s extreme hostility to the Venezuelan government that so many journalists feel the need to exaggerate, even when Venezuela is facing its worst economic crisis in decades. But even during most of the economic boom between 2003 and 2008, when employment was rising rapidly and poverty was plummeting, it was hard to find anything positive about Venezuela in the major media. \\nNonetheless, it should be clear that the Venezuelan economy will not recover, even if oil prices were to rise rapidly, without some major reforms that can resolve its worst economic imbalances.\""}, "time": 1742561734.922464}