{"duration": 0.031754255294799805, "input_args": {"text": "'You are here: Home / US / New Gallup Poll Reveals What Americans REALLY Think About Gun Control New Gallup Poll Reveals What Americans REALLY Think About Gun Control October 28, 2016 Pinterest \\nA new Gallup poll found that a record low number of Americans, just 36%, favor a ban on “assault rifles,” also known as standard semiautomatic sport rifles. This is the lowest number seen in the 20 years since Gallup first asked Americans the question. \\nGallup reported : \\nThe fewest Americans in 20 years favor making it illegal to manufacture, sell or possess semi-automatic guns known as assault rifles. Thirty-six percent now want an assault weapons ban, down from 44% in 2012 and 57% when Gallup first asked the question in 1996. \\nAssault rifles have been a contentious issue in American life for decades. Two years after President Bill Clinton signed a federal assault weapons ban in 1994, Gallup found that a solid majority of Americans favored such a ban. By the time the 10-year ban expired in 2004, Americans were evenly divided. And by 2011, public opinion had tilted against the assault weapons ban, with 53% opposed and 43% in favor. In Gallup’s 2016 Crime poll, conducted Oct. 5-9, opposition now exceeds support by 25 percentage points, 61% to 36%. \\nSupport for a ban on assault rifles has waned across party lines, though the level of support has dropped most markedly among Republicans. Among Democrats, 50 percent support a ban whereas just 25 percent of Republicans do. In 1996, Democrats supported a ban on assault rifles at a rate of 63 percent along with 50 percent of Republicans. \\nFor independents, the trend is downward as well. In 2000, 63 percent of independents backed a ban on assault rifles, but now that number is all the way down to 31 percent. \\nPeople who own guns aren’t the only ones who care about the issue, either. For people who don’t have a gun in the home, 55 percent supported banning assault rifles in 2004; today, the number is down 10 points at 45 percent. \\nIn 2004, 44 percent of those in households with a gun supported an assault weapons ban, but today that number has shrunk to 26 percent — which represents an all-time low. \\nGallup reported that this trend fits an overall trend of decreasing support for strict gun laws — particularly relative to the levels seen in 1990: \\nThe decline in support for an assault weapons ban mirrors the trend for those saying there should be a law banning the possession of handguns, except by the police or other authorized people. Currently, 23% of Americans favor such a ban, down from 26% in 2011 and 36% in 2004. \\nAt the same time, 55% of Americans say laws covering the sale of firearms should be made more strict, with 10% saying the laws should be less strict and 34% saying they should be kept as they are now. The percentage favoring stricter gun laws has fluctuated between 43% and 60% since 2004, with no clear increase or decrease in support. But it is down from levels consistently at or above 60% in the 1990s, including a high of 78% in 1990. \\nMaybe people are starting to see through the media’s narrative that getting rid of guns will keep us safe? Many Americans know how important the Second Amendment is and are unwilling to let the government scare them into giving up their right and cede more power to the federal government. \\nGood, hopefully more people wake up and refuse to give up their rights.'"}, "time": 1742628486.62844}