{"duration": 0.06777024269104004, "input_args": {"text": "'President Donald Trump reversed himself Wednesday on the leadership of the Federal Reserve and the fate of the U. S.   Bank. [In an interview with the Wall Street Journal, Trump said that was open to the possibility of renominating Federal Reserve Chairwoman Janet Yellen once her current term of office expires next year. During the campaign he was critical of Yellen, describing her as “political” for keeping rates low, and said that he “most likely” would replace her as Fed chief.  “I like her, I respect her,” Trump said.  He added that “it’s very early. ” When asked if Yellen was “toast,” the president said, “No. Not toast. ” This has caught many on Wall Street and Capitol Hill by surprise, overturning the near universal expectation that Trump would pick a new head for the central bank. The possibility that Trump may support the status quo at the Fed has some supporters scratching their heads. On Wall Street, this is widely viewed as the result of the influence of Gary Cohn and other financiers on the president. “I think we’re seeing the influence of guys like Gary Cohn, Steven Mnuchin and Steve Schwarzman. They probably explained that markets want him to show he’s   about the Fed and favors a dovish stance,” said one investment banker, who spoke on the condition of anonymity. “Dovish” is Wall Street lingo for leaning toward keeping interest rates lower. “I do like a   rate policy, I must be honest with you,” Trump told the Wall Street Journal in response to questions about Yellen. Cohn is Trump’s chief economic adviser and holds the position of director of the National Economic Council. A lifelong Democrat, Cohn was the number 2 man in charge of Goldman Sachs until he left to join the Trump administration. Treasury Secretary Mnuchin is also a Goldman alum and has close ties to Wall Street. Schwarzman is a   friend of Trump’s and the   of the Blackstone Group, a   Wall Street private equity firm. He reportedly speaks to Trump by phone several times a week and was recently seated beside Trump at a White House gathering of corporate chiefs. Trump also said he no longer opposes the   bank, which he accused of “ ” and called unnecessary during the campaign. “It turns out that, first of all, lots of small companies are really helped, the vendor companies,” Trump told the Wall Street Journal. Around 40 percent of   money is used to subsidize exports from Boeing. Less than 20 percent goes directly to small businesses. The language Trump used, referring to small businesses as ‘vendors’ indicates the influence of big businesses that benefit from   subsidies. They have long argued that they pass along subsidies to smaller businesses that manufacture parts for their exports, a   theory of subsidies. “  doesn’t help the economy. It doesn’t drain the swamp,” writes     critic Tim Carney at the Washington Examiner. Jeff Immelt, the chief executive of General Electric, applauded Trump’s change of heart on  . By supporting the Export Import Bank @POTUS is showing great leadership and focusing on creating jobs for American manufacturers.  —   Jeff Immelt (@JeffImmelt) April 13, 2017,    Disclosure: Tim Carney is my brother.  '"}, "time": 1742628307.223117}