{"duration": 0.055624961853027344, "input_args": {"text": "'SEOUL, South Korea  —   Did you ever wonder what it would be like to be at your own funeral? Some South Koreans aren’t waiting to die to find out. It’s become a trend in recent years to act out a mock funeral service as a way of better appreciating life. The Hyowon Healing Center in Seoul runs one such program, with financial backing from a funeral service company. After an instructional lecture and video, participants are led into a dimly lit hall decorated with chrysanthemums, where they sit, often tearfully, beside caskets and write their last testaments. Then they put on burial shrouds and lie down in the coffins. A   man dressed in a black robe, “the Envoy from the Other World,” hammers the lids closed. The participants are left encased in utter darkness for 10 minutes  —   which can feel like an eternity. “There was not a single ray of light coming in, and how I cried in the dark, suffocating coffin!” a recent participant wrote in a blog post. Jeong   the director of the Hyowon program, said 15, 000 people had gone through mock funerals at the center since 2012. The program is free. Some participants had terminal illnesses and wanted help preparing for the end others had suicidal impulses that they wanted to dispel. Businesses send employees as part of a motivational program. At the end of the      session, Mr. Jeong tells the participants: “Now, you have shed your old self. You are reborn to have a fresh start!” It takes a few minutes for them to readjust, but soon they are chatting, laughing and taking selfies with their coffins. Mr. Jeong said he keeps an eye out for the few morbid souls who seem to feel a little too “comfortable in the coffin. ” But most participants say they feel strangely refreshed afterward, gaining a new perspective on the things that matter in life, like family. “I feel my heart pumping,” one participant wrote in a blog post, where she confessed to having thought about suicide before the mock funeral service. “I am alive!”'"}, "time": 1742563877.7527828}