{"duration": 0.09831809997558594, "input_args": {"text": "'Welcome to Our Picks, a guide to the best stuff to read, watch and listen to from around the internet. Check this space for the     article, the next great podcast for your commute, the   tweetstorm. And yes, we’re also tooting our own horn here. We’ll share can’  Times articles from the week and reveal some gems you might have overlooked. We want to hear from you! Send us feedback about our selections to ourpicks@nytimes. com. • There’s a town that has so many bald eagles, the locals call them pigeons. What the residents of Dutch Harbor, Alaska, now know all too well is that when you live among hundreds of bald eagles, the U. S. national bird becomes less majestic and more, well, annoying. [California Sunday Magazine] • If you’re planning on a hospital stay soon (and even if you aren’t) you should read and know these five ways to reduce costs. The most important? Don’t be afraid to ask questions. [Medium] • The people who created the . .. controversial Comic Sans font tell the story of how it came to be. [The Guardian] • Photographs of these Japanese commuters will make you glad that it’s the weekend. [Huck Magazine] • If you’re having trouble finding love on dating apps, perhaps you’re just not doing it right. Now, you can pay someone to ghostwrite your flirtatious Tinder messages. [New York magazine] • Winning isn’t everything. Read about why it’s important to focus on failure. [Ozy] • How does a product earn a “Made in the USA” label? It’s more complicated than you think. [How Stuff Works] • Good news out of Detroit. The “Motor City” has just surpassed Silicon Valley as a hub for   car research. [ReadWrite] • Four basketball players from across the world were recruited by a powerhouse New Jersey high school with promises of college scholarships, new homes and a better life. What they found instead was that promises are easily broken. [NJ Advance Media] • Why don’t men live as long as women? Blame it on the testosterone. The hormone does a lot of good things  —   it increases your metabolism and boosts your mood and libido  —   but for men it carries a price. [Nautilus] • Nan Talese is the editor for novelists such as Margaret Atwood and Ian McEwan. She broke through gender barriers in the literary world, “becoming one of the first female editors of literary fiction. ” She’s also married to famed writer (and former Times reporter) Gay Talese. Here, in a Vanity Fair profile that Ms. Talese initially resisted, the story of a complicated marriage between two brilliant literary minds and the professional rise of a woman unaccustomed to the spotlight. [Vanity Fair] • Music isn’t just about the lyrics. That’s why a growing number of sign language interpreters are infusing emotions and other visual cues into their interpretations of songs at live concerts. In this video, Amber Galloway Gallego shows us how it’s done. [Vox on YouTube] • One very thoughtful stepmother reckons with the evil archetype she stepped into with this Times Magazine essay. • So you’ve adapted to your home the “  magic” of tidying up,  and now you have a lot of clutter to sell. Here are eight apps and websites that can help. • In the early 1900s, Wrigley pitched its gum as being good for children’s teeth. Did you grow up with   wisdom that is now considered outdated? Tell us about it in the form at this link. • Nicholas Piazza keeps 600 pounds of hair in his Staten Island garage (“Russian hair cut right off people’s heads,” he said of two    braids). He’s one of the last Old World wigmakers in the city. These are not your     bobs. • A scientist studying “nutritional human cannibalism” during the Paleolithic era has been wondering for a decade, How nutritious are humans actually? Now we know. • We’ll let you in on a little secret. For the past year, a group of New York Times employees has been meeting to discuss one episode of one podcast a week. It’s like a book club, but for audio. Here’s a list of nine episodes we’ve discussed this year. Now, we’d like you to join The New York Times Podcast Club. We’ve started a Facebook group where you can join and chime in with your thoughts. Each Monday, we’ll post a new episode up for discussion. This week, we’re discussing all seven episodes of “ . ” Join the Facebook group ≫ Listen to “ ”: iTunes | Stitcher | RadioPublic'"}, "time": 1742562113.1554315}