{"duration": 0.04332447052001953, "input_args": {"text": "'posted by Eddie We are in the generation of social and medical cannabis evolution. Not only are the numbers of cannabis advocates increasing, but creative innovators around the globe are developing new ideas left and right. There are now more ways than ever to get your medicinal or social intake of marijuana. If you thought you’ve seen it all, though, think again. The world’s first-ever cannabis inhaler is starting to roll out and goes by the name of Vapen Clear , and there’s nothing else like it out there! So What is the Vapen Clear? Well it looks exactly like your typical inhaler. It performs in the the same way too, but without the albuterol. The Vapen Clear releases the psychoactive compound THC. It packs a powerful 10mg expenditure per puff, which equals to 100 total puffs per cartridge but can be toned down to meet your needs. Whereas normal vaporizer pens heat the contents, the Vapen Clear doesn’t heat the THC. Rather, it uses a propellant to blast the medicine directly inside your lungs. Not only is the Vapen Clear the first of its kind, but it also comes in three different designs based on your favorite strain. For example, the “Daytime” inhaler comes with THC from a sativa strain, because a sativa produces energy. In like manner, there is the “Nighttime” inhaler that comes with an indica strain to provide a more mellow and chill effect. Then there’s the “Afternoon” inhaler, which provides a steady buzz from a hybrid of the two. The Benefits The smell of cannabis can mask all others. While many cannabis consumption methods leave a strong odor behind, the Vapen Clear has virtually no smell whatsoever. Again, the product doesn’t heat the oil, unlike other vaporizers.Discreetness is obviously another benefit. When people see an inhaler, they think asthma, not cannabis. Therefore, the chances of someone accusing you of medicating are slim. Size is another factor, and we’re pleased to tell you that it doesn’t disappoint. In fact, it’s so small that you can carry it with you wherever you go. Whether you slide it into your pocket or drop it into your purse, it’s easy to take. Not to mention, you don’t have to worry about lugging batteries and lighters along with it. So if you are a cannabis connoisseur who stays on-the-go, this product is perfect for you. Where Can You Find It? The Vapen Clear inhaler is currently only available in Arizona at select specialist centers. However, if you want one but cannot get it just yet, not to worry. Soon, Vapen products will be available in California, Colorado, Nevada, Oregon, and Washington.'"}, "time": 1742562161.554433}