{"duration": 0.15864109992980957, "input_args": {"text": "'  Dr. Eowyn | 2 Comments \\nI’ve been blogging every day, every week, every month for more than 7 years now. \\nBlogging for FOTM requires that I’m really “plugged in,” ear-to-the-ground on news and goings on, including conspiracy theories. \\nAfter more than 7 years of being “plugged in,” I’ve come to the conclusion that the conspiracy theories that I, who began as an innocent, had initially thought to be outlandish turn out to be credible. That’s my honest, sober observation — from a person who is a full professor, has a Ph.D., was well-trained in and had taught epistemology and the scientific method to undergraduate and graduate students. I go to where the empirical evidence leads me. \\nOne of the most far-out conspiracy theories is that a shadowy group of élites controls governments. In the United States, those élites variously are called shadow government, secret government or deep state. (See “ Deep State: Who really rules America ”) \\nAn even more far-out version of that conspiracy theory is that the shadowy élites are satanists. \\nThis post is about Hillary Clinton and her close associates being satanists. Really. Exhibit A Larry Nichols in 2009 \\nI originally reported the following more than a year ago in “ Clinton friend and assassin Larry Nichols says Hillary Clinton is a satanist “. \\nLarry Nichols is a former Green Beret and a longtime associate of Bill Clinton. The two men first met in Arkansas in the late 1970s when Bill was an up-and-coming politician. When Bill was elected governor of Arkansas, he inserted Nichols as the marketing director of the Arkansas Development Finance Authority , an Arkansas state agency that was one of the entities investigated by the Senate Whitewater Committee . \\nOn the Pete Santilli radio show on September 24, 2013, Nichols admitted that he had killed people as the Clintons’ hit man or assassin-for-hire. (See “ Bombshell: Long-time Clinton associate says he killed people for Bill & Hillary “) \\nOn June 24, 2015, interviewed by Alex Jones for InfoWars , Nichols dropped another bombshell. He said, beginning at the 28:44 mark in the audio above: \\n“Back when Hillary was first lady, she would go home on the weekends to California with Linda Bloodworth-Thomason * and some of the other ladies of ‘Designing Women’. And they went to a church for witches. Witches, witches, witches . . . . You know that lady that was tryin’ to run for the Senate and sometimes she’d gone to some place where they did witch stuff? Hillary went to a church and worshiped Satan . . . . What . . . I think is scaring the hell out of you: there are people that love them [Clintons], no matter what.” \\n* Note: Linda Bloodworth-Thomason, together with her husband Harry, was the producer of Designing Women , a popular TV sitcom (1986-1993). Exhibit B \\nI first reported the following in a post about two months ago, “ Hillary aide talks about animal sacrifice to demon Moloch in WikiLeaks email “. \\nIn early August 2016, WikiLeaks released a (hacked) email from W. Lewis Amselem to Cheryl Mills, Hillary’s chief of staff. At the time of the email, Amselem served in the State Department under then-Secretary of State Hillary Clinton as head of the U.S. delegation to the Organization of American States (OAS). (He has since retired.) In the email, Amselem made mention of “sacrificing a chicken in the backyard to Moloch” — an ancient demon. \\nBelow is a screenshot I took of the WikiLeaks email (you can see the email for yourself here ). I painted a red bracket around the animal sacrifice phrase. \\nIn the Old Testament , Gehenna was a valley by Jerusalem, where apostate Israelites and followers of various pagan gods sacrificed their children by fire (2 Chr. 28:3, 33:6; Jer. 7:31, 19:2–6). One of those gods was Moloch (aka Molech, Molekh, Molok, Molek, Molock, Moloc, Melech, Milcom or Molcom), an ancient Ammonite god who demanded a particular kind of propitiatory child sacrifice from parents. ( Amselem is a Sephardic Jewish surname.) Exhibit C \\nThe latest evidence of satanism on the part of a Hillary Clinton associate is an email recently released by WikiLeaks . \\nThe email was sent from Tony Podesta, a powerful Democrat lobbyist, to his brother John Podesta , a longtime Clinton associate who is the chairman of the 2016 Hillary Clinton presidential campaign. Tony had forwarded an invitation to attend a satanic ritual called “spirit cooking dinner” from Marina Abramovic, 69, a Serbian “performance artist” who now lives in New York. Abramovic’s email says: \\n“Dear Tony, \\nI am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining? “ \\nTony appended to Abramovic’s invitation this message to John Podesta: \\n“Are you in NYC Thursday July 9 Marina wants you to come to dinner. ” Here’s a screenshot of the email (you can view it on WikiLeaks here ): Paul Joseph Watson of InfoWars explains that “spirit cooking” is a “sacrament” in Thelema — a religion founded by British occultist-satanist Aleister Crowley, whose motto was “Do As Thou Wilt”— in which menstrual blood, breast milk, urine and sperm are mixed to create a “painting.” According to Abramovic, if the ritual is performed in an art gallery, it is merely art, but if the ritual is performed privately, then “spirit cooking” is a “spiritual ceremony”—“to symbolize the union between the microcosm, Man, and the macrocosm, the Divine” and “a representation of one of the prime maxims in Hermeticism ‘As Above, So Below’.” Mike Cernovich cuts (no pun intended) to the quick: Spirit cooking is an “occult practice used during sex cult rituals , as explained in the book Spirit cooking with essential aphrodisiac recipes .” So who is Marina Abramovic? Let’s begin with this disturbing image of Abramovic posing with a bloody goat’s head — a representation of Baphomet: Here’s a video of Abramovic on “spirit cooking painting”: Cassandra Fairbanks of WeAreChange.org has more information on Marina Abramovic: She is known for gory “performance art” in the name of “confronting pain and ritual.” One of Abramovic’s performances involved repeatedly stabbing herself in her hands. Another featured her throwing her nails, toenails, and hair into a flaming pentagram, then jumping inside the pentagram and fainting. Exhibit D \\nMany FBI agents involved in the now re-opened criminal investigation into Hillary Clinton’s emails, who we would expect to know more about her than we do, regard Hillary Clinton as the antiChrist. \\nSpencer Ackerman reports for The Guardian , Nov. 4, 2016: \\n“Deep antipathy to Hillary Clinton exists within the FBI, multiple bureau sources have told the Guardian, spurring a rapid series of leaks damaging to her campaign just days before the election. \\nCurrent and former FBI officials, none of whom were willing or cleared to speak on the record, have described a chaotic internal climate that resulted from outrage over director James Comey’s July decision not to recommend an indictment over Clinton’s maintenance of a private email server on which classified information transited. \\n‘The FBI is Trumpland,’ said one current agent. […] \\nThe currently serving FBI agent said Clinton is ‘the antichrist personified to a large swath of FBI personnel ,’ and that ‘the reason why they’re leaking is they’re pro-Trump.’” \\nH/t FOTM ‘s Anon and Will Shanley \\nSee also:'"}, "time": 1742564488.9510624}