{"duration": 0.10852670669555664, "input_args": {"text": "'(actualizada a las 21:34 26.10.2016) URL corto 0 26 1 0 MADRID (Sputnik) — El presidente del Gobierno en funciones y líder del Partido Popular, Mariano Rajoy, resaltó durante su discurso de investidura que España se encuentra ante \"una nueva etapa política\" en la que deberá primar el diálogo frente a los intereses de partido. \"Soy consciente de que entramos en una nueva etapa política: cualquier ley o reforma que pueda venir a esta cámara en el futuro tendrá que ser fruto del acuerdo, de la cesión y del entendimiento\", explicó. © REUTERS/ Sergio Perez El debate de investidura de Mariano Rajoy En su intervención, Rajoy destacó que la ausencia de mayorías absolutas le obligará a llevar a cabo una labor de Gobierno \"basada en acuerdos\" porque \"así lo exigen los resultados electorales\".\\n\"Debemos asumir la necesidad de diálogo no como un peaje incómodo sino como una oportunidad de alcanzar consensos\", explicó el líder conservador, que será investido gracias a la abstención de los socialdemócratas y el voto a favor de los liberales. \\nSegún Rajoy, lo inédito de la situación política de España, cuyo Gobierno lleva más de diez meses en funciones, debe hacer que los partidos \"dejan a un lado las confrontaciones ideológicas y sumen esfuerzos de manera excepcional\". Se abre una nueva etapa política, abierta al diálogo y consenso #InvestiduraRajoy pic.twitter.com/w9FjK9KD6A \\n\\u200b\"España no admite más demoras, la inestabilidad política se ha convertido en el mayor riesgo para nuestra economía\", afirmó el líder conservador. © AFP 2016/ Georges Gobet La falta del Gobierno en España \"se empieza a notar en la economía\" Al igual que en el discurso con el que abrió su fallida sesión de investidura de finales del mes de agosto, Rajoy insistió en que \"España necesita un Gobierno con urgencia\" porque la inestabilidad política y la parálisis institucional son \"nubarrones\" que amenazan las mejoras económicas.\\nEn ese sentido, explicó que la celebración de unas terceras elecciones en medio de un año serían \"perjudiciales para el país\" y solicitó la confianza de la cámara para formar Gobierno y de ese modo evitar unos comicios que \"dañarían\" la imagen exterior española. \\nEl líder conservador defendió que un Gobierno presidido por él es lo \"más razonable\" porque los españoles colocaron al Partido Popular como fuerza más votada en las pasadas elecciones de junio y en los comicios de diciembre de 2015. \"Parece justo y razonable que quienes de verdad no desean repetir las elecciones apoyen esta solución\", dijo sobre al resto de fuerzas sobre su propia investidura. \\nA pesar de su invitación al diálogo, el candidato advirtió al resto de grupos parlamentarios de que \"no dará marcha atrás\" en las grandes reformas llevadas a cabo por su Gabinete en los últimos cuatro años, entre las que se encuentra una polémica reforma laboral. \\nNo obstante, Rajoy invitó a todos los parlamentarios a \"abordar en común\" los retos más importantes de su agenda, entre los que, además de citar cuestiones como el elevado desempleo, destacó al \"desafío secesionista que algunos están planteando en Cataluña\" como el más relevante. \\n\"Mi obligación es defender la soberanía nacional, la unidad de España y el respeto a la ley\" afirmó tajante el candidato. — Partido Popular (@PPopular) 26 октября 2016 г. \\nEn el marco de su discurso de talante dialogante, Rajoy se mostró abierto a buscar acuerdos sobre el encaje de Cataluña en España que puedan satisfacer alguno de los anhelos del soberanismo, pero advirtió que \"nadie puede privar al pueblo español de su derecho exclusivo a decidir sobre su futuro y sobre su territorio\". \\nLa intervención de Rajoy para solicitar su confianza a la cámara fue más una apelación al resto de partidos a adoptar una disposición favorable a la búsqueda de consensos que una exposición programática ya que la aritmética parlamentaria impide al Partido Popular sacar adelante reformas sin el apoyo de otros grupos. ...'"}, "time": 1742563324.513437}