{"duration": 0.07904744148254395, "input_args": {"text": "'Posted on November 1, 2016 by Dr. Eowyn | 1 Comment \\nTwo bioethicists — UK professor Julian Savulescu and Canadian professor Udo Schuklenk — are urging that medical schools not admit prospective students who object to abortion and euthanasia. \\nJulian Savulescu is director of the Uehiro Centre for Practical Ethics at the University of Oxford, UK, and editor of the Journal of Medical Ethics ; Udo Schuklenk is the Ontario research chair in bioethics at Canada’s Queen’s University, and editor of the journal Bioethics . \\nIn a co-authored article titled, “ Doctors Have no Right to Refuse Medical Assistance in Dying, Abortion or Contraception ,” published by the journal Bioethics on Sept. 22, 2016, Savulescu and Schuklenk maintain that: Patients’ have an absolute right to abortion and to euthanasia or “assisted dying”. The problem is that there are doctors who conscientiously object. These doctors are respected for their “integrity” and given the prerogative not be involved in providing patients with abortion, artificial contraceptives, and euthanasia. Physicians who refuse to abort and euthanize should be punished or even fired. Conscientious objectors should be barred from admission into medical schools. \\nSavulescu and Schuklenk write in the “Abstract” of their article: \\n“[T]here should be better protections for patients from doctors’ personal values and there should be more severe restrictions on the right to conscientious objection, particularly in relation to assisted dying. We argue that eligible patients could be guaranteed access to medical services that are subject to conscientious objections by: (1) removing a right to conscientious objection; (2) selecting candidates into relevant medical specialities or general practice who do not have objections; (3) demonopolizing the provision of these services away from the medical profession. \\nSome points made in their journal article by these two toxic men who actually pretend they are bioethicists: \\n(1) Anti-Christian: \\nWithout naming it, Savulescu and Schuklenk blame Christianity — which they refer to only as “organized religion”— for the objection to abortion and euthanasia. As they put it: \\n“The more religious a society is, the more religious values are imposed on people. Many of the conscientious objection protections we are grappling with today were written into constitutional arrangements in times gone by when the influence of churches was significantly more powerful than it is today. In strongly Christian societies, like Ireland, abortion remains illegal…. [Atheists] Richard Dawkins got it right, when he noted, ‘religion is not simply vicars giving tea parties. There are evil consequences.’” \\n(2) Doctors should be denied the right to be a conscientious objector to abortion, euthanasia, and artificial contraception: \\n“Enlightened, progressive secular countries like Sweden, have labour laws in line with our arguments. Sweden provides no legal right of employees to conscientious objection. Employees could be sacked for failing to provide legal services under labour law. The same holds true, for instance, for Finland…. These countries have resolutely prioritised patient access to care over the protection of doctors’ idiosyncratic moral convictions with regard to these services. Other countries ought to follow Sweden and Finland…. Conscientious refusal to provide contraception is common and mistakenly supported by medical boards and medical associations…. For religious GPs, obstetricians and pharmacists to refuse to provide the oral contraceptive pill is simply unprofessional. There is no requirement for a healthcare system to accommodate unprofessional behaviour…. If a professional norm [conscientious objection] is no longer fit for purpose, it should be changed.” \\n(3) Doctors who are conscientious objectors should be punished or perhaps fired: \\n“Doctors who did behave like this would be acting with a gross lack of professionalism and would therefore be subject to censure and appropriate remedies by their professional, statutory bodies…. [I]f society thinks contraception, abortion and assistance in dying are important, it should select people prepared to do them, not people whose values preclude them from participating. Equally, people not prepared to participate in such expected courses of action should not join professions tasked by society with the provision of such services.” \\n(4) Medical schools should deny admission to conscientious objectors: \\n“Therefore, even if we did not change the system for those already practising medicine, given that there is an oversupply of people capable and willing to become medical professionals, we should select those willing to provide the full scope of professional services, and those who are most capable. Medical schools and training programmes should carefully outline the nature of the job and screen for conscientious objection where it is relevant to job performance. Requirements of the job should be written into the contract. \\n(5) Abolish medical doctors’ monopoly on medical care by licensing non-physicians to perform abortion and euthanasia: \\n“Finally, if conscientious objection continues to be tolerated in medicine and results in treatment denial, alternative ways of guaranteeing reasonable and fair access to these goods ought to be provided. One way of doing this is to de-monopolize the provision of the relevant service. If the quality of such a service could match that provided by medical professionals, and sufficient supply could be ensured, then this would be a viable alternative. This would require new training, selection, regulatory and oversight procedures, which would be cumbersome and expensive. But there is no reason why only doctors could competently provide, for example, contraception, abortion or assisted dying services.” \\n(6) Conscientious objector doctors are like the Nazis: \\n“Part of the force behind respecting conscientious objection is a common commitment to ethical relativism: if that is what someone believes, then they are right to believe it, and that alone makes it a kind of truth…. But ethical relativism is practically ethical nihilism. If one accepted ethical relativism, the holocaust was, from the Nazi’s perspective, right.” \\nLastly, I find it curious that Savulescu and Schuklenk, with degrees in medicine, cannot distinguish between “reign” and “rein”. \\nTo “reign” is to be a sovereign or monarch; to “rein” is to curb. In their article, Savulescu and Schuklenk write that secular doctors who are conscientious objectors “ought to reign in their values too”. \\nTsk, tsk. \\nTo sign a petition to support the Life at Conception Act, click here . \\n~Eowyn'"}, "time": 1742562808.3561807}