{"duration": 0.053771257400512695, "input_args": {"text": "'Share on Facebook \\nMany of us, for some time now, have been calling out the white nationalism brewing in the nation, most specifically from the Donald Trump campaign for president and many, many of his supporters. Well, now Trump has brought that white supremacy directly into the White House with who he has named as his Chief Strategist and Senior Counselor. \\nTrump just named Breitbart Executive Chairman Steve Bannon to the role of Chief Strategist and that should horrify all of us. President-elect Trump to name Stephen Bannon of Breitbart his Chief Strategist & Senior Counselor \\n— Jake Tapper (@jaketapper) November 13, 2016 NEW YORK, NY – NOVEMBER 09: Republican president-elect Donald Trump’s campaign manager, Kellyanne Conway, and Trump campaign CEO Stephen Bannon (Photo by Chip Somodevilla/Getty Images) \\nAccording to Think Progress : \\n“Trump also named Steve Bannon, the executive chairman of Breitbart News, as “chief strategist and senior counselor” to the president. He will be one of Trump’s closest advisers and, one can presume, one of the most powerful people in America.” \\nBannon previously served as the Trump campaign CEO, and apparently, Trump believes he should carry that role into the White House. \\nWhile at Breitbart, Bannon gave white supremacy and the alt-right a voice, embracing it with open arms. According to the Daily Wire : \\n“ Andrew Breitbart despised racism. Truly despised it. He used to brag regularly about helping to integrate his fraternity at Tulane University. He insisted that racial stories be treated with special care to avoid even the whiff of racism. With Bannon embracing Trump, all that changed. Now Breitbart has become the alt-right go-to website, with Yiannopoulos pushing white ethno-nationalism as a legitimate response to political correctness, and the comment section turning into a cesspool for white supremacist mememakers.” \\nThink Progress reported: \\n“Bannon gave a platform to Milo Yiannopoulos, a prominent white nationalist figure who was banned from Twitter for indicting racist abuse and harassment .” \\nSo now, a man who openly gave white supremacists an open platform to spread vicious hate has now been given one of the most powerful roles in the Trump administration, and in turn, the world. \\nYou can best be sure the alt-right white supremacists are rejoicing at this choice that gives calling it the White House a whole new meaning. \\nWe should all be disgusted and terrified. This is absolutely shameful, yet not at all surprising. The fact that this all comes after our first black president is all the more mortifying. \\nFeatured Photo by Spencer Platt/Getty Images'"}, "time": 1742562299.7961779}