{"duration": 0.0881342887878418, "input_args": {"text": "'¿Qué hacer si tu pareja se muda a tu piso? CONSEJOS vivienda \\nTu pareja y tú habéis decidido dar un paso importante en vuestra relación: vivir juntos. Dentro de poco, se mudará a tu piso y comenzaréis a compartir ese espacio que, hasta ahora, era sólo para ti. Pero ¿está preparada tu casa? Te ofrecemos unos consejos con los que acondicionar tu hogar para convertirlo en vuestro nidito de amor. \\n1. Camas separadas : Llegará un momento en vuestra relación en que os agobiaréis durmiendo juntos. Los ronquidos, el calor corporal o las posturas que adopta tu pareja al dormir harán que acabéis optando por pernoctar en camas separadas. ¿Por qué no adelantarse a ese momento y hacerlo desde el principio? Os aportará comodidad y evitará que dentro de 30 años tengáis que pasar por el incómodo momento de confesar que preferís dormir solos. \\n2. Esconde a tus padres : Nunca llegaste a reconocer que, a tus cerca de cuarenta años, sigues viviendo con ellos y sólo ibais a tu casa cuando no estaban. Ahora ya es demasiado tarde para confesarlo. La única opción que te queda es colocar una trampilla en el suelo y meter allí a tus progenitores. Recuerda darles de comer y ofrecerles cada día un cuenco con agua: si tu pareja los descubre, que al menos en su primer encuentro estén con vida. \\n3. Inventario de tus pertenencias : Haz un inventario detallado y minucioso de todas y cada una de tus pertenencias. Que tu pareja sea el amor de tu vida no significa que no tenga tendencias cleptómanas. No te lo tomes como un símbolo de falta de confianza (o sí) sino como una manera de evitar que tus objetos más preciados acaben en Wallapop o en el mercadillo de los domingos. Este consejo está especialmente recomendado para aquellas personas cuyas parejas se llamen Vladimir Livitchenko o “La Rulas”. \\n4. Fotos ficticias de amigos y familiares : En realidad, sólo te quedan tus padres, tu tía Adela y dos amigos del colegio, pero si pones un corcho lleno de fotos de desconocidos y dices que son tu familia y amigos, siempre tendrás una coartada para irte de casa cuando no te apetezca estar con tu pareja. Un “Cariño, me ha llamado mi prima Sole para echar un café” o un “Hoy salgo de cañas con los del barrio” siempre sonarán mejor que un “Me voy al parque tres horas porque no te aguanto más”. \\n5. Tener un bebé por casa : Tener un bebé en casa y presentárselo a tu pareja como el hijo que nunca le confesaste que tenías será la prueba definitiva para saber si realmente te quiere. Si no sale corriendo nada más ver al niño, o te propone dejarlo a las puertas de un convento, es que merece la pena. No hace falta que el hijo sea tuyo, siempre puedes pedírselo prestado unos meses a otra pareja de amigos o alquilárselo por dos euros la hora. Es el precio del amor. \\n6. Habitación del pánico : Un espacio seguro en el que resguardarse cuando tu pareja está desquiciada y no atiende a razones. Puede valer el cuarto de la plancha, pero asegúrate de que está equipado con latas de conservas para más de dos meses. Hay enfados que no se pasan en una tarde. \\n7. Amante en el armario : “Si no tengo amante”, estarás pensando. No te preocupes, en España hay muchos actores en paro que por un bocadillo al día estarán encantados de hacerse pasar por uno. La idea es tenerlo siempre en el armario, escondido detrás de los abrigos, y si en algún momento te hartas de tu pareja, se lo enseñas y finges que llevas engañándole con esa persona varios meses. En el 89% de los casos conllevará a la ruptura inmediata con tu pareja. En el otro 11% el asunto suele derivar en una propuesta para realizar un trío. \\n8. Falsifica el contrato de alquiler : ¿Por qué vas a hacer que tu pareja te pague sólo 350 euros cuando puedes hacer que te pague 700? Falsifica el contrato e infla el precio. ¿No dice siempre que haría cualquier cosa por ti? Ahora es el momento de que lo demuestre. \\n9. Compra la Filmoteca Nacional : El cénit de toda relación llega cuando la actividad de la pareja se reduce a ver películas juntos, repanchingados en el sillón. La idea puede parecer arriesgada, pero ni Netflix ni Movistar Plus te ofrecerán los 36.000 títulos de la Filmoteca Nacional. Y haznos caso, los vais a ver todos, quizá en sólo un domingo. \\n10. Alquila un piso en el edificio de enfrente y contrata un francotirador : Es muy violento tener que decirle a tu pareja que no te gusta que traiga visitas a casa. Por eso, siempre es más sencillo alquilar un piso frente al tuyo y contratar un francotirador que pase allí las 24 horas apuntando hacia vuestra ventana. Si tu pareja trae al piso a alguien que no te cae bien, sólo tendrás que hacer una señal para que abra fuego.'"}, "time": 1742562163.9570918}