{"duration": 0.09109115600585938, "input_args": {"text": "'posted by Eddie Scientists studying ancient stone arrangement alongside Aboriginal traditional owners in Australia’s Victorian bush say the site could pre-date Stonehenge and even Egypt’s Great Pyramids. But Wurdi Youang, as it’s known by the people of the Wada Warrung nation, is apparently not the only mysterious stone circle in Australia — just the most intact. Monash University astronomer Dr. Duane Hamacher has been studying Indigenous Australian astronomy for years, and told ABC’s Lateline he believes the Wurdi Youang structure could date back more than 11,000 years. If that’s proven, it will be yet another example of the world’s longest surviving culture’s innovations pre-dating their better known European equivalents. “Some academics have referred to this stone arrangement here as Australia’s version of Stonehenge,” Dr Hamacher said on the program Wednesday. “I think the question we might have to ask is: is Stonehenge Britain’s version of Wurdi Youang? Because this could be much, much older.” Traditional owners like Bryon Powell and the scientists they’re working with say the stones have possible solar indications, marking the movements of the sun over the year, including the summer solstice, equinox and winter solstice. A sacred sundial, if you will. The egg-shaped area is fifty metres wide and contains over 100 basalt boulders. After being noted by early European settlers and recorded by archaeologists in 1977, Wurdi Youang was only relatively recently given the attention it deserves as a site once sacred and significant. Local custodian Reg Abrahams sees the site as playing a role in contesting the increasingly-dated disproved notion that Indigenous Australians were simply nomadic hunter-gatherers. “If you’re going to have a stone arrangement where you mark off the seasons throughout the year with the solstices and equinoxes, it kind of makes sense if you’re at least most of the year in one specific location to do that,” he told the ABC. He continued: “You see a lot of agricultural and aquacultural practices, so evidence of this agriculture may go back tens of thousands of years, pre-dating what anthropologists commonly think of as the dawn of agriculture which is about 6,000 years ago in Mesopotamia.” Mysterious Mullimbimby site Wurdi Youang is just one of many stone arrangements created by Aboriginal nations that have been recorded across Australia, including in Carisbrook, Victoria and outside Mullumbimby, northern New South Wales. The site 40 kilometres outside of Mullumbimby is the stuff of legend. But a few amateur archaeologists say it’s based on much more than hearsay. It was said to contain 181 large standing pieces of sandstone — with the nearest sandstone deposit located over 20 kilometres away. In 2015, a teacher at the Brunswick Valley Historical Society, Richard Patterson unearthed letters from 1939 president of the Australian Archaeological and Education Research Society, Frederic Slater . “The mound is one of the oldest; I should say the oldest, forms of temples in the world and dates back to the Palaeolithic age with the advent of first man,” Slater is alleged to have written. Slater documented inscriptions from the site’s stones, which he said were made up of hand signs, letters and “sacred signs” that amounted to 28,000 words in the ancient language. In the 1940, the site was reportedly bulldozed by the farmer with a deed to the land, following government threats to seize his property, making further investigation virtually impossible. \\nA documentary on Indigenous astronomy called Star Stories of the Dreaming was released earlier this year, featuring the CSIRO’s Ray Norris and Euahlayi lawman Ghillar Michael Anderson sharing Indigenous belief systems associated with astronomy. Source:'"}, "time": 1742561924.30603}