{"duration": 0.04847526550292969, "input_args": {"text": "\"Thu, Oct 27th, 2016 at 7:42 pm Just another day in the life of Donald Trump's presidential campaign. Share on Twitter Print This Post \\nIt was a standard day in the life of Donald Trump’s presidential campaign, as the Republican nominee spent much of his time on the campaign trail Thursday making outrageous and insulting comments. \\nThis was on clear display at a rally in Toledo, Ohio, when Trump proposed one of his most ridiculous ideas yet: Cancel the election and just anoint him president. \\nVideo: Trump jokes: “We should just cancel the election and just give it to Trump, right? What are we even having it for? Her policies are so bad!” pic.twitter.com/Stz46iDbpf \\n— Bradd Jaffy (@BraddJaffy) October 27, 2016 \\n“I’m just thinking to myself right now, we should just cancel the election and just give it to Trump, right?” Trump asked the crowd. “What are we even having it for? … Her policies are so bad.” \\nDespite Trump’s plea to cancel the election as he continues to struggle in the polls, it will be the voters who decide which candidate has the better policies – thankfully. \\nThe remark also aligns closely with other recent comments in which Trump claimed the process is rigged against him, and he will only accept the outcome of the election if it’s favorable for him. \\nBut Trump wasn’t done at his Buckeye State rally. He also made sure to take a dig at minority communities. \\nVideo: Help me out there. Did Trump just say “we’re going to work on our ghettos” before mentioning inner cities, violence and African Americans? pic.twitter.com/v9KqZSLbh6 \\n— Bradd Jaffy (@BraddJaffy) October 27, 2016 \\nTrump’s comments: \\nWe’re gonna work on our ghettos … take a look at what’s going on where you have pockets of, areas of land, where you have the inner cities, and you have so many things, so many problems, so many horrible, horrible problems – the violence, the death, the lack of education, no jobs. We’re gonna work with the African-American community and we’re going to solve the problem of the inner city … You can’t walk out the street. You buy a loaf of bread and you end up getting shot. \\nThe Republican nominee’s “ghetto” comment is the newest addition to what is the standard Trump narrative that black communities are hellscapes. This particular set of remarks comes a day after he visited North Carolina for a rally and told supporters – mostly white – that he would enact “a new deal for black America.” \\nIn the closing days of this election, Donald Trump is once again showing that there is no better version of who he is. The man who built a campaign on racial resentment is doubling down on it as this election season comes to a conclusion.\""}, "time": 1742562860.2470486}