{"duration": 0.1866912841796875, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Kentucky’s Democratic primary is underway, and both parties are voting in Oregon. Bernie Sanders is under pressure from Democratic leaders after his supporters caused an uproar at the Nevada Democratic Party’s convention over the weekend, above, and unleashed a torrent of threats at the state party chairwoman. Mr. Sanders condemned violence but defended his supporters, accusing the state’s “Democratic leadership” of misusing its power. _____ 2. The Fox anchor Megyn Kelly launched her first   special on Fox with a special guest: Donald Trump. It was a convivial, easygoing interview that was taped more than two weeks ago. _____ 3. The National Transportation Safety Board announced its findings in last year’s Amtrak crash in Philadelphia, which killed eight. The engineer, distracted by reports of damage to another train, sped into a dangerous curve, thinking he was on a straightaway, with a speed limit of 110 m. p. h. The board’s chairman called for the installation of a system that automatically slows speeding trains, “because humans make mistakes. ” _____ 4. The Justice Department is investigating allegations of   doping involving many top Russian top athletes, following a buildup of accusations. One former Russian official, above, has described a broad and intricately managed doping scheme that he said culminated at the 2014 Winter Olympics in Sochi, which Russia dominated. _____ 5. The Senate unanimously passed a bill that would allow the families of those killed on Sept. 11, 2001, to sue Saudi Arabia over suspicions that its officials played a supporting role in the attacks. If the bill passes the House, President Obama has promised a veto, but some in Congress believe they could pull off a rare override. _____ 6. “It is sad and embarrassing for the Australian government. ” That’s a NASA scientist adding his voice to the international uproar over the layoff of one the world’s most authoritative experts on sea levels. John Church is one of 275 experts who are losing their jobs as Australia reorients its national science agency toward more commercial enterprises. _____ 7. The U. S. military has said that its lethal airstrikes on a hospital in the Afghan city of Kunduz last year were a mistake. But a Times special report finds that Afghan forces’ distrust of the hospital’s operator, Doctors Without Borders, might have played a central role. Some in the Afghan military see the group’s focus on treating the injured as helping and sometimes hiding the enemy. _____ 8. The Senate passed a measure calling for $1. 1 billion in emergency funds  to combat a feared U. S. outbreak of the Zika virus. That sets up a confrontation with House Republicans, who have agreed on just $622 million reallocated from other programs. Neither measure is anywhere near President Obama’s request of $1. 9 billion. _____ 9. A comprehensive analysis by an influential national scientific group concluded that genetic engineering does not make crops unsafe to grow or eat. But the findings had caveats, and the report is unlikely to end the debate over what are known widely as G. M. O. s, for genetically modified organisms. _____ 10. Finally, TV networks are going retro. The upfronts  —   presentations to advertisers on coming offerings  —   include new versions of old hits like “Twin Peaks,” “MacGyver,” “Tales From the Crypt” and “Gilmore Girls. ” As a TV executive put it, “Where you have a title that people recognize, value and appreciate, that’s something we want to take advantage of. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562216.0069675}