{"duration": 0.09460663795471191, "input_args": {"text": "'Written by Michael S. Rozeff Saturday November 12, 2016 What happens next in Washington? Trump fills out his administration. At the same time, Washington insiders attempt to capture Trump and influence his positions, policies and decisions. The presidency is an institution, not a man, not a president. The presidency is a network of enormous power with Trump now at its center. Washington insiders who live and breathe politics are now in a race for positions of power and influence. They hanker and vie for appointments. Trump must make appointments. He cannot operate alone. He must delegate power to make decisions. He cannot monitor all information pertinent to every issue in which the government has a hand. The presidency is not 100 percent centralized. Decision-making power is allocated to levels below the president himself and to levels surrounding him. It also lies outside the presidency in Congress. Trump has his ideas and desires for actions, but their realization depends on the people he appoints. He loses control and locks himself in with every appointment that he makes. People around him want his power and want to influence him. They have a heavy influence on what he hears, whom he sees, the options presented to him, and the evaluations of competing personnel. Trump will likely form a very small team of offshoots of himself, people whom he trusts implicitly, in order to extend his capacity to choose people who will adhere to and execute his agenda.Power in Washington is not simply the apparatus of administering the presidency that will take up headlines for the next few months. After the U.S. Treasury robs the tax-paying Americans, new robbers (the Lobby) appear to rob the Treasury using every device they can get away with. There is a second contingent, the power-seekers. Those who covet the exercise of power unceasingly work toward their own narrow aims. As long as Washington remains the place that concentrates unbelievably large amounts of money and powers, it will remain the swamp that Trump has promised to drain but won’t. He cannot drain it, not without destroying Washington’s power and he cannot accomplish that, nor does he even hint that he wants to accomplish that. His stated aims are the redirection of money and powers, not their elimination for the sake of a greater justice, a greater right, and a truly greater people and country.The presidency is an establishment and Washington is another. By being elected, Trump struck a blow at the members of the establishment who will be packing their bags while weeping over their losses (see here and here .) But elections do not strike the roots of the presidency, the establishment or Washington. Neither will demonstrations against Trump. The Obama establishment is dead. The Democratic establishment is dead, at least for 4 years. There was a time, a very brief time under the Articles of Confederation, when Americans recognized the evils of the establishment and avoided instituting one. This gave way almost immediately (in 1787) to the constitutional seed that planted the enormous tree that now cuts out the sun of justice from American lives. A domestic war failed to uproot that tree. Long live the establishment, the Union, the American state, and may they be possessed of immense powers over our lives — these became the social and political reality. Trump isn’t going to change it. He’s a president administering a presidency. He’s at the top of the heap. His credo is still “Long Live the Establishment!” Reprinted with permission from LewRockwell.com . Related'"}, "time": 1742562606.428106}