{"duration": 0.07996368408203125, "input_args": {"text": "'. CDC Scientist Confirms Donald Trump is Right About Vaccines and Autism Donald Trump is no stranger to controversy, including the vaccine debate. In a series of tweets and ... http://humansarefree.com/2016/11/cdc-scientist-confirms-donald-trump-is.html Donald Trump is no stranger to controversy, including the vaccine debate. In a series of tweets and interviews over the past few years, the presidential candidate has stated that he strongly believes that there is a link between \"monstrous\" vaccines and autism . He has suggested that delivering vaccines in smaller doses over time could reduce autism rates among U.S. children. Despite being cast to the lunatic fringe by the mainstream media for his remarks, CDC scientist Dr. William Thompson has confirmed Trump\\'s suspicions — namely, that   autism is real .Congressman Bill Posey from Florida helped expose the corruption of the Center for Disease Control (CDC) . He recently read a statement on the House floor written by CDC scientist Dr. William Thompson.In the statement, Dr. Thompson admitted to omitting data from a study which showed that autism rates were higher among African American boys who received the MMR vaccination before the age of three.(1) \"Regardless of the subject matter, parents making decisions about their children\\'s health deserve to have the best information available to them. \"They should be able to count on federal agencies to tell them the truth. For these reasons, I bring the following matter to the House floor,\" Posey stated.(2) He then proceeded to read the statement provided by Dr. Thompson. The statement pertained to a 2004 study published in the journal Pediatrics. The doctor revealed that he and his colleagues intentionally destroyed data in the study which showed that African American MMR-vaccinated boys under the age of three had   for autism. According to the whistleblower, the CDC held a meeting of scientists to discuss whether they should destroy the evidence. The authors decided to scrap their findings. Fortunately, Dr. Thompson saved computer files and hard copies of the omitted data for legal reasons.(3) \"Mr. Speaker, I believe it is our duty to insure that the documents that Dr. Thompson are not ignored. Therefore I will provide them to members of Congress and the House Committees upon request. \"Considering the nature of the whistleblower\\'s documents as well as the involvement of the CDC, a hearing and a thorough investigation is warranted,\" Posey concluded.(2) Because the report pertains to vaccines, the mainstream media continues to ignore these revelations. Meanwhile, they continue to parade Donald Trump as a kook for suggesting that there is a link   The double standard boggles the mind and sickens the stomach.Trump hasn\\'t backed down from the vaccine debate despite the mainstream media\\'s backlash against his remarks. In 2015, he appeared on the conservative radio host Laura Ingraham\\'s show stating: \"I\\'ve known people that had totally magnificent children, functioning a hundred percent, everything beautiful, smart as a whip, and they go for this shot and get this shot of this massive dose, of everything at one time, and they end up with horrible autism.\"(4) In addition, Trump stated on a Fox News television program in 2012: \"I\\'ve seen people where they have a perfectly healthy child, and they go for the vaccinations and a month later the child is no longer healthy.\"(5) Trump made similar remarks in a series of tweets in 2014, after a CDC report revealed that autism rates in U.S. children had increased by 30 percent in the last two years.(6)The CDC report that coincided with Trump\\'s tweets did not actually state what caused the spike in autism rates. Given Dr. Thompson\\'s recent testimony, however, it\\'s easy to think of at least one possibility. By S. Johnson  '"}, "time": 1742561703.094232}