{"duration": 0.1049509048461914, "input_args": {"text": "\"Gamechanger: Russia successfully tests its first-ever hypersonic weapon ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. Syrian War Report – October 31, 2016: Al-Nusra-led Forces Failed to Break Aleppo Siege By South Front on October 31, 2016 …from SouthFront \\nAs SouthFront forecasted on October 28, the Jaish al-Fatah militant coalition, led by Jabhat Fatah al-Sham (formerly Jabhat al-Nusra, the Syrian Al-Qaeda branch) has not been able to deliver a devastating blow to the Syrian government forces and to break the siege of eastern Aleppo. \\nAfter the initial success based on massive usage of VBIEDs and a lack of support by the Russian Aerospace Forces (President Vladimir Putin declined the general staff’s request to deliver air strikes in Aleppo area), Jaish al-Fatah stalled in the trench warfare in non-populated urban areas. Fatah al-Sham-led attempt to cut off the Ithriyah-Aleppo Highway also failed. \\nThe Syrian military also deployed reinforcements from the Syrian Army Tiger Forces and its commander, Major General Suheil Al Hassan, arrived the city to coordinate military operations against the joint terrorist forces. Hezbollah and Harakat Hezbollah al-Nujaba were set to assist to Al Hassan-led operations. \\nBy October 31, Al Hassan–led forces, supported by the Syrian Air Force, have repelled attacks on the Minyan area and the 3000 Apartment Project, retaken the al-Assad Neighborhood and made a series of counter-attacks in the 1070 Apartment Project. \\nSince the start of Aleppo offensive, Jaish al-Fatah has lost about 120 fighters, 7 armored vehicles, 19 VBIEDs, 7 ‘technical’ vehicles, 2 battle tanks and 2 artillery pieces. The government forces have lost about 45 fighters, 3 battle tanks, 2 ‘technical’ vehicles, 1 Shilka vehicle. \\nSeparately, the pro-government forces liberated Tal Qarah, Kafr Qaris, Tal Susin, Fafin, Babinnis, Tal Shair and the Infantry School from ISIS in northeastern Aleppo. The advance was synchronized with operations of the Kurdish YPG in the same area. \\nOn October 30, the army and the NDF liberated the town of Tell Kurdi and the area of Tell Sawwan in Eastern Ghouta near the Syrian capital, Damascus. These areas had been controlled by the Jaish al-Islam militant group. The liberation of Tell Kurdi and Tell Sawwan decreases significantly the militant-controlled area near Damascus and sets a foothold for advance on Duma, the last major militant stronghold in the region. \\nOn October 28, the government forces took control of the Air Defense Battalion hill between Deir Khabiyan and the 137th Regiment in Western Ghouta and splitted the militant-controlled area into two separate pockets. Next days the army and the NDF continued offensive operations in the direction of Khan Shih. On October 31, the government delegation arrived to the town to negotiate with members of the FSA, Jaish al-Islam and Jabhat Fatah al-Sham terms and conditions of their surrender. \\nThree Russian attack submarines armed Kalibr cruise missiles have joined a Russian naval taskforce heading towards Syria. The Royal Navy has been reportedly tracking two nuclear-powered Akula-class submarines and a diesel-powered Kilo-class submarine. The subs entered the North Atlantic from portsaround Murmansk and joined the Admiral Kuznetsov battle group as it sailed down the North Sea last week. The Kuznetsov and its battlegroup are now off the north African coast. The mainstream media speculates that the subs will deliver missile strikes on peaceful targets in Aleppo city. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on October 31, 2016, With 245 Reads Filed under WarZone . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742563012.4809546}