{"duration": 0.0784921646118164, "input_args": {"text": "'Criminal Minions CAUGHT Pushing Voter Fraud To Get Hillary Elected Posted on October 26, 2016 by Shae Weatherall in Politics Share This \\nThere isn’t anything that Hillary Clinton supporters won’t stoop to do or say in order to get their candidate elected. We’ve seen massive amounts of corruption involving every level of Hillary’s minions all the way up to the Chair of the Democratic National Committee. Apparently, nothing is off limits when they’re doing Hillary’s bidding, and now they have a new racket that is going to make criminal voter fraud a whole lot easier. \\nElection fraud has already become a big concern again this election cycle as voting machines are reportedly “malfunctioning” and switching votes in favor of Hillary. One Texas county was even forced to abandon the machines altogether and go to paper ballots. \\nThere has been some progress in protecting the integrity of our elections by implementing voter ID laws, but Democrats have been fighting it tooth and nail. Hillary and her minions claim that it’s racist or oppressive or some crap to expect United States citizens to possess and show picture ID to vote. It’s apparently not a problem, though, to ask them to show ID for a pack of cigarettes or to board a plane or for a hundred other things. Go figure. \\nEven as they were whining about how requiring photo identification to vote is oppression, Hillary’s minions were already working on a solution. They knew there was a good chance they would lose the fight against states who wanted to stop dead “Democrats” from voting, and so now, we’re seeing the Hillary supporters’ machine at work. \\nHillary’s minions have taken to the internet to advertise and sell near-perfect replicas of state driver’s licenses. According to an ad on craigslist which has now been removed, the entire purpose of purchasing one of the fake ID’s is specifically to fraudulently vote for Hillary Clinton . \\nThe text on the ad reads: “ I can provide you with a high-quality fake ID it comes with holographic and also barcode [sic]. This can be used anywhere, we are offering special deals for people who will go to the polls on November 8th, we need to get Hillary in office . We only meet in a public location and accept cash only no trades. All states, cities, and addresses available. Buy 2 get 1 free. Election special free IDs* ( you have no say as to information on these, they are already pre-populated and must be used to vote on Nov. 8th) ” Screenshot captured before removal of Craigslist ad for Fake IDs. “ Fake IDs Let’s Get Hillary Elected – $1 (Detroit). “ Lower portion of screenshot captured before removal of Craigslist ad for Fake IDs. “ Fake IDs Let’s Get Hillary Elected – $1 (Detroit). “ Larger view of photo included in the Craigslist ad. selling forged driver’s licenses. “ Fake IDs Let’s Get Hillary Elected – $1 (Detroit) .” Notice how the same face is used to create several IDs from varying states. \\nIt’s extremely disturbing to hear over and over again about the lengths to which Democrats and Hillary and her minions (including the liberal media) will go in order to try to secure her election as president. Have they no shame, pride, or confidence at all? Maybe they all realize — like the rest of us do — that Hillary really is that awful of a person , in every possible way, and the only chance she has to get into the White House as president is to steal the election . They must know it. Otherwise, why would they try to hard to use fraud and corruption to get her there? \\nIf true-blue, red-blooded Americans have anything to say about it — and we most certainly do — Hillary ‘Rotten’ Clinton is not moving back in our house at 1600 Pennsylvania Avenue. We now know that during the years and even decades that we’ve suspected mass corruption and fraud within the Democrat Party, we were right and we will never be fooled again.'"}, "time": 1742562173.3596334}