{"duration": 0.06710934638977051, "input_args": {"text": "'Iran’s Defense Minister Hossein Dehghan issued a statement to Iranian state media confirming the recent test of a ballistic missile, and claiming the test did not violate the nuclear deal. [“The recent test was in line with our plans and we will not allow foreigners to interfere in our defense affairs. The test did not violate the nuclear deal or (U. N.) Resolution 2231,” Dehghan told the Tasnim news agency, as quoted by Reuters.  Dehghan is most likely correct about the nuclear deal, which gave Iran tremendous latitude and major economic incentives, while requiring few concessions from Tehran. He is on shakier ground regarding U. N. resolutions, but the U. N. Security Council has decided to form a committee to study Iranian missile testing, rather than issue an immediate condemnation. As Reuters notes, “critics” of the relevant U. N. resolution (meaning primarily Iran and Russia) claim it merely discourages Iran from developing   ballistic missiles, rather than outright forbidding tests. The Iranian parliament issued a statement declaring that Iran is “against weapons of mass destruction, so its missile capability is the only available deterrence against enemy hostility. ” They dismissed international condemnation of Iranian missile testing as “illogical. ” The Trump administration condemned the missile launch in strong terms. “I will tell the people across the world that is something you should be alarmed about,” said Nikki Haley, the new ambassador to the United Nations. “The United States is not naive. We are not going to stand by. You will see us call them out, as we said we would, and you are also going to see us act accordingly. ” “We are officially putting Iran on notice,” National Security Adviser Mike Flynn declared at a White House press briefing on Wednesday, citing both Iran’s ballistic missile launch and the recent attack on a Saudi frigate by   insurgents in Yemen. Flynn said Iran had been “emboldened” to pursue such provocative behavior by the “weak and ineffective” response of the Obama administration. National Security Advisor Michael Flynn at White House briefing: ”As of today, we are officially putting Iran on notice.” pic. twitter.   —   ABC News Politics (@ABCPolitics) February 1, 2017,  White House press secretary Sean Spicer added that the Trump administration wishes to make it clear that Iran’s actions “are both provocative and in violation” of the nuclear deal, despite Tehran’s claims to the contrary, and “we’re not going to sit by and do nothing. ” Analyst Benham Ben Taleblu of the Foundation for the Defense of Democracies told Business Insider he agreed that “ ” language about missile testing in the nuclear deal gave Iran a loophole to conduct testing that “definitely violates the spirit, if not the letter” of standing U. N. resolutions. Taleblu observed that even without nuclear warheads, Iran’s focus on missiles allows it to maintain a “conventionally weak and asymmetrically strong” military. In other words, Iran uses insurgents and terrorists to destabilize its enemies across the region, and if any of those enemies decides to counterattack Iran, it will find the border lined with enough missiles to make retaliatory actions too costly to contemplate.'"}, "time": 1742563538.2355776}