{"duration": 0.03974556922912598, "input_args": {"text": "'In the latest Wikileaks UFO news, a recently released email implies the U.S. government’s knowledge of so-called “Fastwalker” UFOs. “Fastwalker” is a term used by NORAD and branches of armed forces to describe unidentified aerial phenomena moving and/or changing directions at high speed far beyond what current aerospace technology is capable of.\\nThe March 6, 2015 email concerning Fastwalkers was written by Bob Fish, a NASA historian and Apollo Curator for the USS Hornet Museum, and sent to John Podesta, Chairman of the 2016 Hillary Clinton presidential campaign and former adviser to Presidents Bill Clinton and Barack Obama.\\nSo-called “Fastwalker” UFOs are often spotted in ISS live feeds.\\nIn the email, Fish describes overhearing members of the U.S. government’s Defense Satellite Program (DSP) discussing recent sightings of Fastwalker UFOs. According to Fish’s email, these Fastwalkers came from unknown locations in distant space :\\nOne of these times, a member of that group was really excited – said they’d just picked up Fastwalker (I assumed that same day). He described how it entered our atmosphere from “deep space” (origin actually unknown, of course, but from the backside of the satellite) and zipped by the DSP satellite pretty closely on its way to earth.\\nFish’s email is pure hearsay, no doubt, but Fish seems to recognize that such anecdotal evidence, blurred photographs, and crop circles will never win over the minds of the general public. In another email dated March 5, 2015, Fish wrote Podesta again, this time to stress the need for hard scientific proof of extraterrestrial intelligence :\\nWhat needs to be collected and publicly disseminated is hard scientific data collected from instruments that are known to be accurate and reliable. Within the US, this information has existed for many years and is still available today, if one knows “where to look” and “what to look for.\\nSome of these emails were forwarded to Leslie Kean, an investigative journalist and noted UFO researcher who co-founded the Coalition for Freedom of Information (CFi), an “independent alliance advocating for greater government openness on information about UFOs.” Kean has been known to accuse the government of UFO coverups in the past, so her presence in these email chains adds some credibility to the theories that the Obama administration might be close to announcing the government’s knowledge of UFOs . Fingers crossed, and eyes to the skies.\\nSource: Mysterious Universe \\n'"}, "time": 1742563305.1058884}