{"duration": 0.07243227958679199, "input_args": {"text": "'BREAKING: Miami Woman BUSTED On Election Fraud — Guess Which Party It Benefited? By Karen Shiebler   \\nWe have all heard Republican presidential candidate Donald Trump whining about voter fraud. He has been repeating the idea to his followers, encouraging them to go to the polls to watch out for the “rigged” election . \\nNaturally, Trump and his minions are warning that the election is being stolen from him. His accusations imply that Democrats are stealing votes from Republicans. \\nElection officials in all of the key states, many of whom are Republicans themselves, have assured the candidate that the election is not in fact rigged. \\nNow, however, we have some actual proof of voter fraud. \\nThe Miami Herald reports that a 74 year old Florida woman has been arrested in Miami Dade county, after witnesses noted that she was marking ballots. The woman, Gladys Coego, was a temporary worker hired by the county elections office. She was supposed to be opening ballots that had been mailed in to the office. \\nHer job was to simply check for any paper tears. Instead, in violation of the law, she looked for ballots that had not been marked for the mayoral vote. On those ballots, she marked the name of Republican candidate Raquel Regalado. \\nAt least one coworker saw her marking those ballots before turning them in, and reported her actions to supervisors. \\nA supervisor then observed her using a pen that she’d snuck into the office to mark the ballots. Having been caught by the boss, Coego admitted what she had done. No reason was given, and there are no known ties between Coego and the Regalado campaign. \\nMs. Coego turned herself in to the Turner Guilford Knight Correctional Center. It is expected that she will be charged with two counts of felony for illegally marking other people’s ballots. \\nThere are only two counts because only two of the ballots were definitely changed by Ms. Coego. Authorities do think, though, that more ballots were affected, based on what her coworkers observed. \\nSo why did this older lady run the risk of changing the marks on official ballots? \\nWhy, because she really wanted the Republican candidate for mayor to win, that’s why. Although she herself is registered without a party affiliation, the votes that she changed were in favor of the Republican Regalado. \\nSo. It still looks like the Trump campaign is dead wrong when it claims there is “widespread” voter fraud going on. And it looks like they’re wrong about which side is cheating, too. \\nI swear. You can’t make this stuff up. \\nFeatired image via YouTube Screengrab . \\nAbout Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742562879.002002}