{"duration": 0.1427593231201172, "input_args": {"text": "'Good morning. Here’s what you need to know: • Matteo Renzi, the Italian prime minister, said he would resign after voters rejected constitutional changes he backed, intensifying the populist wave crashing through the European Union. If early elections occur next year, 2017 may shape up to be a seminal year in the E. U.’s history. France, Germany and the Netherlands will go to the polls with strong euroskeptic candidates in the running. Russia’s president, Vladimir V. Putin, is widely revered as a kind of white knight among new nationalists on both sides of the Atlantic. “Viva Trump, viva Putin, viva la Le Pen” was one Italian   politician’s reaction to Sunday’s vote. _____ • In Austria, voters defied the   populist wave by selecting Alexander Van der Bellen, 72, a former Green Party leader, as their next president. The election of the   Mr. Van der Bellen ends a bitter yearlong campaign, which had pitted him against Norbert Hofer, a leader of the   Freedom Party. _____ •   Donald J. Trump renewed his hard line on American companies that plan to move operations to other countries, warning of a coming tax of 35 percent on goods moved “back across the border” to be sold. One of Mr. Trump’s signature ideas  —   slapping high tariffs on Chinese imports  —   would raise costs for European companies. Our reporters traced the ripple effects such a move would have on the global supply chain. The Trump family’s international business empire and those who have interacted with him and his children create a web of complications. _____ • Mr. Trump’s freewheeling phone calls to world leaders are upending decades of diplomacy. The   is broadening the field of candidates for secretary of state as his transition team remains divided over how to fill the most prominent gap in his prospective cabinet. _____ • The Obama administration ended a major standoff with thousands of Native Americans and their supporters over an oil pipeline. The Army Corps of Engineers said that it would not approve permits for a section near a Sioux reservation in the Dakotas that tribal leaders said would threaten water supplies and sacred sites. _____ • “Long live Fidel!” thousands of people cried along a   route to the cemetery in eastern Cuba where Fidel Castro’s ashes were interred.. Here is a selection of images from his half a century in power, which left a complicated legacy of transformation and turmoil. _____ • In Italy, the referendum’s outcome will likely postpone, if not derail, plans to restructure Monte dei Paschi di Siena, the country’s most troubled bank. • Eurozone finance ministers hope to reach a compromise on Greek debt relief. • Big banks, including Credit Suisse, are putting the world’s rain forests in peril by providing loans to companies linked to deforestation and forest burning in Southeast Asia. • “Football Leaks,” an investigation by European news outlets, detailed how prominent soccer players appeared to have avoided paying taxes. And here’s a look at how Panama is trying to shed its image as a tax haven after the Panama Papers revelations. • Taxi drivers in Romania are set to boycott the Bucharest airport to protest the growing presence of the Uber   service. • The euro fell against the dollar. Here’s a snapshot of global markets. • In Oakland, Calif. the death toll rose to 33 after a blaze tore through a warehouse hosting a musical event, one of the deadliest structure fires in the United States in years. [The New York Times] • Britain’s Supreme Court will begin hearing the government’s challenge to a court ruling that requires it to seek parliamentary approval to start the process of leaving the European Union. [Reuters] • Prosecutors begin closing arguments in the genocide trial of the former Bosnian Serb military commander Ratko Mladic. [Reuters] • Mainstream publishers, other than those deemed   have so far been untouched by the crackdown in Turkey, unlike journalists, teachers and lawyers. [The New York Times] • Two of Africa’s longest rules are ending. Yahya Jammeh, who led Gambia for 22 years, was ousted in an election, and José Eduardo dos Santos, who ruled Angola for almost four decades, said he would soon step down. [Quartz] • Syrian government troops now control about half of what had been for years a rebels’ enclave in Aleppo. The United Nations Security Council votes today on a draft resolution that would demand a   truce. [The New York Times] • New York’s Metropolitan Opera is performing an opera written by a woman for the first time in more than 100 years. Here, we offer a playlist of other female composers, who are often overlooked. • Lapo Elkann, the   Fiat heir, was enjoying a comeback when he was arrested after a sordid story of drugs, an escort and faking his own kidnapping. • Soccer update: Real Madrid tied Barcelona thanks to a late goal. Roma pounced on two Lazio mistakes. • In the Upper Engadin, a section of the Swiss Alps, art galleries have emerged as an   alternative. • And here’s a taste of culinary archaeology: the torta tenerina, found on menus in Ferrara, Italy, is a simple cake with an almost creamy interior, and it could well be the ancestor of all “flourless” chocolate cakes. The decision by the American   maker Carrier to keep some jobs from being relocated to Mexico comes as its industry faces scrutiny over pollution. A recent global accord will curb hydrofluorocarbons, a chemical common in most   that contributes to global warming. So the race is on to find greener alternatives as demand for   rises around the world. At Santa Clara University in California, heating and cooling systems are fueled by rooftop solar panels. And hydrofluoroolefins, an HFC substitute that is more energy efficient, are becoming popular. These technologies probably weren’t on the mind of the American engineer Willis Carrier, above, who paved the way for modern  . In 1902, with cold water and an ammonia compressor, he figured out a way to control air temperature and the moisture in it. Some of  ’s next steps might be a return to the more distant past. In parts of the Middle East, the medieval wind tower is making a comeback. A physics professor has designed a smaller version of the structure, which pulls fresh air into buildings. “We’ve taken a traditional technology,” the professor explains, “and dragged it into the 21st century. ” Giovanni Russonello contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742563581.3526728}