{"duration": 0.052262306213378906, "input_args": {"text": "'By Nili Nathan \\nPosted Friday, October 28, 2016 at 07:48am EDT \\nKeywords: autism and vaccines , robert de niro and vaxxed , robert de niro on autism and vaccines , un-vaxxed , vaxxed \\nThe answer is evident to film festival attendees who were shocked when Robert De Niro, under enormous pressure, pulled the film “VAXXED” from the Tribeca Film Festival. For all others, you may not need to see VAXXED first before you see Un-VAXXED. \\nA new film by award-winning author and filmmaker, Dr. Leonard G. Horowitz, contributes more than the “discussion” actor Robert De Niro sought to prompt by screening the controversial film VAXXED at the 2016 Tribeca Film Festival in New York. De Niro, whose son, like millions of other children who became vaccine-injured, came under fire from both sides of the vaccination safety debate after “pulling” VAXXED from the event. Agents pressured the Hollywood celebrity to censor that film by producer Del Bigtree and director Andy Wakefield. De Niro later pledged to investigate who caused the censorship, and why. \\n“Un-Vaxxed: A Docu-Commentary for Robert DeNiro” was the Overall Grand Jury Winner of Cinema Los Angeles, a Film Festival which takes place annually in central Los Angeles from November 1-2 nd . \\nI saw the trailer and the filmmakers, Dr. Leonard Horowitz and Sherri Kane promise to continue the dialogue and contribute to the questions actor Robert De Niro asked while being interviewed on TODAY (April 2016). He wanted answers and an investigation to the autism controversy around vaccines. \\nYou can see “Un-Vaxxed: A Docu-Commentary for Robert DeNiro” at the World International Film Festival (WIFF) on November 1, 2016 playing at the Crest Theatre, 1262 Westwood Blvd, Los Angeles, CA 90024. For tickets visit the venue’s website at: \\nhttp://www.crestwestwood.com/events/2016/11/1/cinema-los-angeles-un-vaxxed-a-docu-commentary-for-robert-de-niro \\nBio on Dr. Leonard G. Horowitz taken from his website: Dr. Leonard G. Horowitz is the world’s most prolific, best credential, and most controversial drug industry whistleblower. This award-winning author, film-maker, pharmaceutical industry critic, and intelligence industry analyst has published seventeen books and dozens of peer reviewed scientific articles. Dr. Horowitz’s first of three American bestsellers, Emerging Viruses: AIDS & Ebola–Nature, Accident or Intentional?, is largely credited for prompting the global vaccination risk awareness movement. The book caused several governments to reconsider their “immunization” policies, and became the center of political debate in 2008 when Barack Obama’s minister, Rev. Jeremiah Wright, credited Horowitz and this book for evidencing HIV/AIDS as a genocidal weapon of mass depopulation targeting Africans and African Americans courtesy of covert U.S. military contractors named in the publication. Dr. Horowitz’s second bestseller, Healing Codes for the Biological Apocalypse, prompted a revolution in the music and natural healing industries. The retired dentist and naturopathic physician’s consumer health guidebook, Healing Celebrations: Miraculous Recoveries Through Ancient Scripture, Natural Medicine and Modern Science, pioneered the protocol adopted by thousands of natural healers and doctors worldwide.'"}, "time": 1742563011.5875013}