{"duration": 0.03095531463623047, "input_args": {"text": "'Comedian Mike Epps has been accused of mistreating an animal after cameras caught the Hangover star dancing onstage alongside a harnessed kangaroo Friday night during a Festival of Laughs comedy tour show in Detroit. [In a viral video, the animal is seen swinging its arm at Epps before the comedian runs off the stage. Treatment of the kangaroo spurred accusations of “animal cruelty” from some audience members, who watched the spectacle play out inside the Joe Louis Arena.  Whyyyy did they bring the kangaroo on stage at Mike Epps show 😩😭. I love Detroit pic. twitter.   —   Amber ♍ (@_AmNico) April 1, 2017,  i commented on Mike Epps picture of him with that poor kangaroo on stage and said that it’s animal cruelty to have had it on stage and  …      —   yajara (@yeeeezyyyy) April 2, 2017,  I didn’t think Mike Epps playing with that kangaroo last night was funny at all. That kangaroo look miserable and ready to snap.  —   P (@Pariss_Franceee) April 1, 2017,  . @TheRealMikeEpps I’m a FAN ‼ But have 2 Say Animals Should Not Be used for entertainment #Born2BWild~ this is just cruel Entertainment 😞 pic. twitter.   —   Anika (@anikasleem) April 3, 2017,  @TheRealMikeEpps That was the cruelest comedy act clip I’ve seen. You must be so proud of yourself. Terrorising animals on stage is NOT entertainment,  —   Lynda (@lynda_perth) April 3, 2017,  @TheRealMikeEpps Nah, ur a ”man” that makes money tormenting animals. If that’s what you’ve gotta do for a laugh, your in the wrong game.  —   Nick Wright (@itsnik3) April 3, 2017,  Epps defended the stunt in a social media message that has been deleted. A video, captured and published by The Shade Room, shows the comedian feeding a banana to a Kangaroo. “Yeh look how nice Iam 2 him! Theses guys are license zoo keepers ! #iloveanimals,” Epps wrote on Instagram. He later posted an apology note to his social media account, and said he would be donating to a kangaroo conservation charity. According to TMZ, the kangaroo that appeared onstage Friday night belongs to traveling zoo animal handler Javon Stacks. Stacks told the gossip outlet that the animal was not harmed in any way during Friday night’s performance. However, according to a   report from the outlet, the U. S. Department of Agriculture is investigating the incident to determine whether the kangaroo handler was in control of the animal at all times, a requirement under the federal Animal Welfare Act. Epps was recently tapped to play the lead role in the forthcoming Lee   bio drama, Richard Pryor: Is It Something I Said? The film, which the Weinstein Company will produce, will reportedly star Eddie Murphy, Kate Hudson, and Oprah Winfrey.    Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628405.7452233}