{"duration": 0.03710198402404785, "input_args": {"text": "\"The So-Called OPEC Cartel Whiffs Again Marathon Talks, No Deal By Wall Street Journal. Posted On Monday, October 31st, 2016 A weekend marathon of talks between major oil producers failed to finalize plans to implement an output cut, threatening the viability of an agreement reached last month to reduce production by as much as 2%. The talks were also aimed at securing coordinated cuts with producers outside OPEC, such as Russia, the world’s largest oil producer. Instead, Iraq and Iran’s insistence on exemptions emerged as a big sticking point Friday as those members refused to agree to cut their burgeoning output. You need to login to view this content. \\nDavid Stockman’s Contra Corner isn’t your typical financial tipsheet. Instead it’s an ongoing dialogue about what’s really happening in the markets… the economy… and governments… so you can understand the world around you and make better decisions for yourself. \\nDavid believes the world -- certainly the United States -- is at a great inflection point in human history. The massive credit inflation of the last three decades has reached its apogee and is now going to splatter spectacularly. \\nThis will have lasting ramifications on how governments tax and regulate you… the type of work you and your family members will have available and what you get paid… the value of your nest egg… and all other areas comprising your quality of life. Login \\nDavid Stockman's Contra Corner is the only place where mainstream delusions and cant about the Warfare State, the Bailout State, Bubble Finance and Beltway Banditry are ripped, refuted and rebuked. Subscribe now to receive David Stockman’s latest posts by email each day as well as his model portfolio, Lee Adler’s Daily Data Dive and David’s personally curated insights and analysis from leading contrarian thinkers.\""}, "time": 1742562321.4985526}