{"duration": 0.07562112808227539, "input_args": {"text": "'posted by Eddie Pythagoras was a Greek philosopher, mathematician and founder of Pythagoreanism. He was also a high ranking member in many mystery schools and secret societies, including the Egyptian Priesthood and The Order Of The Magi. Pythagoreanism is a religious movement in which he attempted to merge education, science and religion in perfect unity. The Pythagorean School consisted of nine temples for the different subjects which included- geometry, music, astronomy, philosophy, medicine, politics and especially mathematics. His esoteric teachings were guarded closely and more secretive, candidates were given a probationary period to pass through. This was used to test their mental capabilities and their ability to maintain secrecy. Those who passed through this process were initiated into a select brotherhood in which they pursued religious and ascetic practices he had developed. This group were called Esoterici – The Esoteric. Pythagoras, Phidias and Fibonacci are all names that come up in association to the golden ratio, Phi or the Fibonacci sequence. But Pythagoras was the first to use it on a musical scale. According to legend, Pythagoras discovered musical tones when he walked passed a blacksmiths and was captured by the sounds emanating inside. He thought the harmonies could be translated into a mathematical equations. He later went into the blacksmiths and learnt how the sounds were made by observing their tools. He realised that the hammers had simple ratios to each other, one hammer was half the size of the first, another was 2/3 the size, and so on. This story cannot be validated, however it is fascinating to think that one of the most (if not the most) significant audio scales were discovered in this way. The fibonacci sequence is the number sequence 0,1,1,2,3,5,8,13 and so on to infinity. This mathematical formula is found by adding up the two numbers before it in the sequence 0+1=1 1+1=2 1+2=3 2+3=5 and so on. The space between these numbers gives us the golden ratio of 1.618. This sequence unifies the properties of space, time, light, gravity and our genetic makeup within our DNA code. Our faces have this ratio and so do our bodies, you can find this ratio in our upper arm to lower arm and upper leg to lower leg. Even our brains are constructed with this ratio, with our pineal gland (which is thought to be the seat of the souls in many teachings) spiraling with this magical formula. Our pineal gland also produces melatonin and DMT which is thought to cause dreams and spiritual states. This ratio exists within flower petals, trees, seeds, natural foods, shells, the galaxies in the universe, it is truly the mathematical language of the universe. Given the significance of this, you may be able to see why listening to music tuned at this frequency could be a good thing. You can view more information about Pythagorean tuning and in specific the frequency of 432Hz in the video below. \\nsource: By Luke Miller Truth Theory From Around the Web Founder of WorldTruth.Tv and WomansVibe.com Eddie ( 8922 Posts ) \\nEddie L. is the founder and owner of WorldTruth.TV. and Womansvibe.com. Both website are dedicated to educating and informing people with articles on powerful and concealed information from around the world. I have spent the last 36+ years researching Bible, History, Alternative Health, Secret Societies, Symbolism and many other topics that are not reported by mainstream media.'"}, "time": 1742562832.9334533}