{"duration": 0.29081273078918457, "input_args": {"text": "'  Recipient Email => \\nDonald Trump grabbed a new lifeline. Speaking at a rally in Charlotte, North Carolina, on October 15th, he raised a hand as if to take an oath and declared : “I am a victim!” The great business tycoon, the one and only man who could fix America and make the place great again (trust me, folks), was laying claim to martyrdom — and spinning another news cycle. “I am a victim,” he declared, “of one of the great political smear campaigns in the history of our country. They are coming after me to try and destroy what is considered by even them the greatest movement in the history of our country.” \\n“I am a victim.” That pathetic line echoed in my head, which is why I’m writing this. In my long life, I had seen a large white man stand up in a public arena and proclaim those words — the shrill, self-pitying complaint of the remorseless perpetrator — only once before. That was in a courtroom in lower Manhattan in 1988. The man was Joel Steinberg , a New York lawyer who, over a 12-year period, had brainwashed and beaten into oblivion a woman named Hedda Nussbaum, once a successful young editor of children’s books. In the early years of their relationship, she had run away several times, seeking help, and every time a doctor or friend had called Steinberg to come and get her. At that point — time and again — Steinberg would administer “punishment,” breaking her bones and her spirit. She took on what police would later describe as “a zombie-like quality.” \\nSome years earlier, a teenage girl had hired Steinberg to arrange an adoptive home for her baby. Instead he kept the child, Lisa, until one evening when she was six years old and “stared” at him in a way he didn’t like. He responded by striking her repeatedly in the head. After which he went out to dinner with his cocaine dealer, leaving the child unconscious on the floor. Nussbaum, by then so traumatized, so absent from anything like life, thought vaguely of calling a doctor, but she was not allowed to use the phone in Steinberg’s absence. Instead, she sat on the floor and watched over the girl as she lay dying. \\nOn trial for the child’s murder, Steinberg blamed everyone but himself. “I’m the victim here,” he whined in court. He swore that he had “never hit anyone,” not anyone , even though he was known to have assaulted a business associate and three other women before he settled into the single-minded, single-handed demolition of Hedda Nussbaum. \\nJudge Harold Rothwax observed that Steinberg was “a man of extraordinary narcissism and self-involvement” who had “an extreme need to control everyone in his ambit” while he lived a “life of self-gratification.” Yet Steinberg could not see in himself the man Judge Rothwax described. He thought people should feel sorry for him. He had been disbarred and had lost a child (not to mention his Greenwich Village apartment). He railed at those who had conspired to bring him down: the police, the neighbors, the judge, the prosecutor, the expert medical witnesses, his defense attorney, the jurors, the press, and Hedda Nussbaum. “I’m the victim here,” he claimed. \\nAt the time, nearly 30 years ago, the public blamed Hedda Nussbaum. The district attorney, the police, the doctors and psychiatrists who treated her intensively for more than a year before the trial all agreed that, on the evening in question, she was too physically and mentally “incapacitated” either to cause the girl’s injuries or take action to save her. Nonetheless, she was tried and condemned by the press and public opinion, including women who called themselves “feminists.” In court, the jurors were merciless. When they began to deliberate, only four thought Steinberg guilty of murder as charged, five were “in the middle,” and three held out for lesser charges, feeling certain that Hedda Nussbaum had somehow been responsible for killing the child. \\nThey finally agreed upon a verdict of manslaughter. Even then, a woman juror assured the press that Nussbaum was “a very sick woman” who should have been charged and convicted of “some crime.” Another juror, also female, expressed popular opinion this way: “I just feel that she was to blame.” And a third woman juror, who claimed that “certain others” agreed with her, said, “Poor Joel. Joel’s a victim. We have to send a message to the system: ‘You don’t make victims out of nice men like Joel.’” \\nJudge Rothwax sentenced Steinberg to eight and a half to 25 years. Released after 17 years, Steinberg, now in his seventies, still claims to have done nothing hurtful to anyone. He has not paid a civil court-ordered settlement of $15 million to the birth mother of the dead child, nor has he ever been charged with any crime for what he did to Hedda Nussbaum. \\nTwo lessons lurk in this story, one old and one very up to date. First, it’s a reminder of how much women at that time, even after a great wave of feminism, still blamed women (including themselves) for whatever happened to them at the hands of men; second, a man with a character like Steinberg’s is not the kind of guy you want to choose for high office — or any office at all. \\nJoel Steinberg stalked a far tinier stage than Donald Trump and he did more deadly damage, but the two men seem to be brothers under the skin, sharing common character defects well described in psychiatric texts: extreme narcissism, a taste for sexual predation, and very similar views of the women on whom they prey. Like Steinberg, who was incapable of seeing himself as the judge accurately described him, Trump seems blind to the real nature of his own behavior. (His current wife describes him as a “boy.”) Neither man seems capable of taking responsibility for the harm he’s done, and when their own actions finally call down retribution, branding them as losers — ah, then come the conspiracy theories and the vindictive wail of the victim. \\nMen Who Use Women \\nLast June, I published a piece at TomDispatch venturing to explain why candidate Donald J. Trump was getting “rock-bottom ratings” in the polls from women voters. Nearly 70% of them reportedly couldn’t stand the guy. I pointed out what seemed to me to be the obvious: “Trump’s behavior perfectly fits the profile of an ordinary wife abuser.” \\nIn a sworn deposition introduced in divorce proceedings , his first wife Ivana swore under oath that he had torn out her hair and forcibly raped her, raging at her because he didn’t like the results of a “scalp-reducing” procedure (meant to remove a bald patch) performed on him by a plastic surgeon she had recommended. (Before she collected a $14 million divorce settlement, she toned her story down, saying the assault was not “criminal.”) \\nAbout one in three American women are survivors of some version of such treatment, euphemistically called “ domestic abuse .” That’s roughly 65 million women voters who, as I wrote last June, “know a tyrant when they see one.” I raise this subject again because the now-infamous tape of Trump’s open-mic Hollywood Access bus ride in 2005 added a new page to the rap sheet of this particular abuser. \\nIn that piece of mine, I traced the history of the principal tactics of coercion used by controlling men like Trump. Some of those tactics, including Steinberg’s favorites, involve physical force, but most, when used by a skilled abuser, require no force at all. Trump applies the handiest tools to his targeted victims regularly, leaving no physical marks behind: threats, intimidation, degradation, put-downs, humiliation, insults, trivial demands, occasional indulgences (a flash of charm, for example, or a bit of feigned reasonableness). The lesson is simple and clear: the mind can be bent and the spirit shattered without battering the body. \\nI neglected, however, to mention one of the most insidious tactics of such abusers, perhaps because it’s so obvious that it regularly hides in plain sight. In the military, it’s called “pulling rank.” High status is itself a powerful coercive force that can stifle resistance in a lower-status victim and so silence him or her. Status is Trump’s brandished weapon, his open carry. On this, he couldn’t have been clearer in boasting of his pussy-grabbing skills on that Hollywood Access tape : “When you’re a star they let you do it. You can do anything.” \\nThe most chilling moments on that tape, however, occur after Trump emerges from the bus in all his orange splendor, followed by his escort Billy Bush — now a former NBC “personality” — who could be heard on that tape laughing as Trump recounted his compulsive assaults. Bush then greeted his television colleague Arianne Zucker, who like so many women on American TV was less fully clothed than the men around her, and whom Trump had been ogling from the bus while sucking Tic Tacs to freshen his potty mouth for a possible kissing attack. Billy Bush “asked” Ms. Zucker, “How about a little hug for The Donald?” \\nIn that short bus trip across the parking lot, Bush had learned just what to do to get in good stead with his high-status guest, and so, without missing a beat, he threw his lower status co-worker to his peppermint-salivating pal. He then collected a hug from her, too, as Trump is heard exonerating himself with the bizarre remark, “Melania said this was okay.” \\nIt hardly seemed to matter what Arianne Zucker wanted or believed to be okay. Billy Bush’s question wasn’t actually a question, but a notice of what was expected. Clearly, she wanted to keep her job and, just as clearly, hugging predatory, high-status stars and coworkers had never been part of her job description, but was a little instant add-on of coercion from her colleague.Setting the star power aside, all of this amounts to commonplace harassment in what appears to be a hostile workplace , and it just happens to be against the law. \\nOne in three women between the ages of 18 and 24 say that they have been harassed at work . Yet 70% of all workers (woman and men) harassed on the job do not report the offense, often for fear of disbelief or reprisal. Think of all the women in television who were subjected to harassment and worse by Roger Ailes — the charges now reach back 50 years — fired at last by Fox News, only to become official media adviser to whom else but presidential candidate Donald Trump. \\nSome in the media glossed over Trump’s bragging as just so much “ lewd conversation ” — or as Trump himself put it “ locker room talk ”— while his wife Melania dismissed it as “ boy talk .” In fact, Trump’s unwanted kissing and groping — his self-described M.O. substantiated by one victim after another — can be classified in his home state (under New York Penal Law, Article 130 , Section 130.52: forcible touching) as a Class A misdemeanor. That may not sound serious, but it’s punishable by a maximum fine of $1,000 (chump change for The Donald) and a more sobering potential year behind bars. \\nIt was that tape, all over the media on October 7th, that prompted Anderson Cooper during the second presidential debate to ask Trump three times if he had actually done the sort of things he described to Billy Bush, which Cooper correctly named “sexual assault.” Trump finally answered: “And I will tell you, no I have not” — and women who had lived for five, 10, 20, even 30 years with nagging memories of a Trump assault and humiliation had to restrain an immediate impulse to smash the TV set and instead called a news outlet or a lawyer. \\nAs of this writing, more than a dozen women have gone public with reports of Trump’s sexual attacks since the release of that Hollywood Access tape. They join a list of women and girls who had previously reported offenses ranging from outright sexual assault to crashing dressing rooms at beauty contests where nude and semi-nude women and girls were preparing to compete for the titles of Miss Universe or Miss Teen America. That brings the number of Trump’s accusers , as I write, to at least 24. Journalists and lawyers have generally managed to verify their accounts. \\nOf course, Trump has repeatedly denied the women’s allegations, saying before, during, and ever since the third presidential debate that he had never seen those women before, had no idea who they were, found them insufficiently attractive to warrant his attention, and that their stories had, in any case, been debunked . None of his claims were true. (And, for good measure, he announced during his version of a Gettysburg Address that he would sue every one of them after the election was over.) \\nIn my June post, I wrote: \\n“Trump’s behavior perfectly fits the profile of an ordinary wife abuser — but with one additional twist… Trump has not confined his controlling tactics to his own home(s). For seven years, he practiced such tactics openly for all the world to see on The Apprentice , his very own reality show, and now applies them on a national stage, commanding constant attention while alternately insulting, cajoling, demeaning, embracing, patronizing, and verbally beating up anyone… who stands in the way of his coronation.” \\nIn this fashion, he humiliated his male Republican primary opponents, demeaning them with nicknames — Little Marco, Lyin’ Ted, Low-Energy Jeb — and denigrated his only female primary opponent, Carly Fiorina, by unfavorably appraising her appearance. (“Look at that face! Would anyone vote for that?”) More recently, of course, he’s disparaged “Crooked Hillary” in a similar fashion . (“Such a nasty woman!”) \\nGrowing Up in America \\nHillary Clinton, as Trump himself has acknowledged, is a fighter who will not quit — unperturbed even by his stalking her on stage throughout the second presidential debate and body-shaming her afterwards. “She walked in front of me,” he said of a moment in that debate when she crossed the stage to speak to a questioner in the audience. “Believe me, I wasn’t impressed.” In the third debate, she called him out directly on his behavior. “Donald thinks belittling women makes him bigger,” she said. “He goes after their dignity, their self-worth, and I don’t think there is a woman anywhere who doesn’t know what that feels like.” \\nHere was something new under the sun: a woman on a presidential debate stage calling out an insufferable man — a serial predator, at that — on behavior so common among men for so long that the vast majority of women in this country have experienced it and learned to call it “life.” \\nSome women still see it that way. The New York Times , for instance, interviewed a 62-year-old woman voting for Trump who said that other women offended by his “banter” should “ grow up .” I like to think that hers is a good description of what’s happening nationally at the moment, though obviously not in the fashion that she imagined. After all, grown-up women led the way, among congressional representatives, in calling Trump out. Republican Congresswomen Barbara Comstock of Virginia and Martha Roby of Alabama both asked him to withdraw from the race. Kay Granger of Texas, Mia Love of Utah, and Ann Wagner of Missouri said they could not vote for him. Republican Senators Lisa Murkowski of Alaska, Susan Collins of Maine, Deb Fischer of Nebraska, and Shelley Moore Capito of West Virginia withdrew their support. Susana Martinez, Republican governor of New Mexico, said she would not support Trump, while former Republican presidential candidate Fiorina said that Trump should step aside. Republican former Secretary of State Condoleeza Rice wrote on her Facebook page: “Enough! Donald Trump should not be President. He should withdraw.” \\nStill, don’t expect a serial abuser to be a quitter either. Faced with accusations of abhorrent and criminal acts he can’t acknowledge, plus impending incomprehensible defeat at the polls, and the very real possibility of becoming one of those people he so despises — a loser — Trump casts about for others to blame. Given his character, it’s not surprising that he follows, as if by instinct, what we might call the Joel Steinberg path to self-exoneration — painting himself, and himself alone, as the ultimate innocent victim of abusive others in a world whose every aspect is “rigged” against him. \\nIn his own telling, he, not the women he’s demeaned or assaulted, is the abused one and he’s taking it for us, for America. It’s quite a self-portrait when you think about it and should make us appreciate all the more those women who stepped before the cameras, reported his sexual assaults, and left themselves open to further abuse from Trump and his supporters. They have done something rare and brave. It’s one thing for a woman to say publicly that she has been sexually assaulted or battered or raped. Feminist speak-outs taught us decades ago to support our sisters by sharing our experience in this way. But it’s another thing to name the perpetrator and call him to account. That’s what these women have done. And wonder of wonders, most women and a whole lot of men believe them , and more than 60%, in the tepid language of the pollsters, “have some concerns” about the issue. Count that as a positive change of recent years — a light in dismal times. \\nOn the dark side, you never know what a sore loser and his loyal, bullying, misogynist followers might do. Say, for example, followers of the type who show up outside Hillary rallies with banners reading “Trump that Bitch!” The moment the trial of Joel Steinberg ended, armed guards surrounded him and hustled him off to prison. Unfortunately, when this election is over, whether Trump wins or loses, he’s not likely to go away. \\nAnn Jones, a TomDispatch regular , is the author of several books on violence against women, including the feminist classic Women Who Kill and Next Time, She’ll Be Dead: Battering and How to Stop It , which Gloria Steinem calls “the one book you should read” on the subject. It includes a chapter on the Steinberg case. She is also the author of the Dispatch Books original , They Were Soldiers: How the Wounded Return from America’s Wars — The Untold Story . (Reprinted from TomDispatch by permission of author or representative)'"}, "time": 1742563124.9694977}