{"duration": 0.09243154525756836, "input_args": {"text": "'By Allen L Roland, PhD on November 2, 2016 The politics of fear is ruling this Presidential election and it’s time for our conscience and self-respect to take over and erode fear in the process. There is no better reminder in this process than Chris Hedges whose activist voice to power echoes those of Amy Goodman and others, including myself, who know that this is our moment in 2016 and our conscience and self-respect, not our fears, must be our guide: Allen L Roland, PhD \\n\\n“ Just remember,’ a Marine Corps lieutenant colonel told me as he strapped his pistol belt under his arm before we crossed into Kuwait, ‘that none of these boys is fighting for home, for the flag, for all that crap the politicians feed the public. They are fighting for each other, just for each other.” ~ Chris Hedges , War Is a Force That Gives Us Meaning \\nOn a realistic note ~ there is only one party (the War party) ~ there is only one candidate ~ there is only one choice because in the New World Order, there is no choice for it has already been decided by the global establishment ~ all the rest is kabuki theater presented for our entertainment ~ but there are still pockets of truth although their voices have been muted by the corporate media. Chris Hedges is one of those voices as is Amy Goodman and Abby Martin ~ see Abby’s take on Hillary Clinton; Video / 24 minutes ~ \\nAbby Martin Exposes What Hillary Clinton Really Represents \\nOn a much lighter note ~ kindly allow me to digress for a few hilarious moments and offer Lionel Nation’s take on the total absurdity of this latest Clinton Weiner gate email scandal ~ You Tube / 30 minutes ~ \\nReturning to the subject at hand ~ the following are excerpts from a public endorsement letter from Chris Hedges to the STEIN/BARAKA HEADQUARTERS ~ \\n“ My reporting and writing, which has taken me to many parts of America, has convinced me that the traditional mechanisms of reform, including the two major political parties, have been captured by corporate power . \\nWe no longer live in a functioning democracy, but a system the political philosopher Sheldon Wolin calls “inverted totalitarianism.” \\nWe will step outside this system and build alternative movements, including alternative political parties, or see the rise of a Christianized fascism, of which the Trump campaign is the dress rehearsal. \\nIt is imperative that you join me in contributing to the Stein/Baraka presidential campaign and vote for Jill and Ajamu in the upcoming election. There is no longer any genuine threat from Donald Trump that can be used as an excuse to vote for Hillary Clinton. \\nThe current policies of austerity and endless war, of wholesale surveillance, of Wall Street fraud and abuse, along with a refusal to enact a massive green energy program to save our environment, will by 2020 ensure the rise of a far-right candidate endowed with a discipline and political skill that eludes Trump. \\nIf Jill and the Green Party can get 5 percent of the vote we will have $10 million in federal funds in 2020 and broad, nationwide ballot access. This election is about building the momentum for this historical moment. \\nThe time for resistance, genuine resistance, is now. We must step outside the political mainstream. We must, like Greece and Spain, invest in movements and parties to reverse our corporate coup. \\nWe must dismantle the neoliberal policies and imperial adventurism that have laid waste to our civil liberties and are destroying the nation and the planet . \\nDon’t be ruled by fear this election. Be ruled by your conscience. “ \\nChris Hedges \\nAllen L Roland, PhD \\nHeart centered spiritual consultant and advisor Allen L Roland can be contacted at Allen is also a lecturer and writer who shares a weekly political and social commentary on his web log and website allenroland.com . He is also featured columnist on Veterans Today and is a featured guest on many radio and Television programs.'"}, "time": 1742561937.725247}