{"duration": 0.14695119857788086, "input_args": {"text": "'WASHINGTON  —   Long before Donald J. Trump took aim at immigrants, there was Representative Steve King of Iowa. Since Mr. King’s election to the House in 2002, and before that in the State Legislature, where he first tried out his   trademark talking point, Mr. King, a Republican, has injected himself into the immigration debate with inflammatory and at times boorish statements. Against the backdrop of an emboldened white nationalist movement in the United States, his Twitter post over the weekend  —   “We can’t restore our civilization with somebody else’s babies”  —   suggested that Mr. King was sliding from his typical messages to something far darker. It was praised by both the white supremacist David Duke and The Daily Stormer, a   website. But it was also quickly criticized by many Republicans, including Speaker Paul D. Ryan, whose office said he “clearly disagrees” with Mr. King, and Representative Carlos Curbelo, Republican of Florida, who is of Cuban descent. Mr. Curbelo responded on Twitter: “What exactly do you mean? Do I qualify as ‘somebody else’s baby? ’” The tweet, written to show support for Geert Wilders, a   Dutch parliamentarian who has called for shutting down mosques in the Netherlands, put Mr. King in a familiar position, as the subject of condemnation in his own party. “Now we’re in the Trump era, where anything goes,” said David Kochel, a Republican strategist from Iowa who helped lead Jeb Bush’s presidential campaign. “He’s always been consistent with these extreme views, but this articulation of   white nationalism is a few clicks past ‘cantaloupe calves,’ which was reprehensible to begin with. I don’t believe these views represent anything but the most extreme elements of the   fringe. ” While Mr. King has also left room for rape victims,   light bulbs, the District of Columbia and other topics in his incendiary outbursts on Twitter, television and the House floor, his most memorable droplets of disdain have been for unauthorized immigrants, most notably Mexicans who he once proclaimed had “calves the size of cantaloupes” from hauling drugs across the border. But except for the 2013 fruit analogy  —   which led John A. Boehner, the speaker at the time, to publicly chastise Mr. King and privately make a decidedly less nice   analogy about him to aides  —   Republicans have largely written off Mr. King as a fringe player in legitimate policy debates. “Remarks of this nature are always deplorable no matter the political climate in our country,” Mr. Curbelo said in an email. “One of the president’s recurring themes and messages is that all Americans bleed the same red blood despite our great diversity. Mr. King’s sentiment directly contradicts this idea. ” A spokeswoman for Mr. Ryan, who has been loath to dip into controversies stirred by Mr. Trump, said, “The speaker clearly disagrees and believes America’s long history of inclusiveness is one of its great strengths. ” In Iowa, the state’s Republican chairman, Jeff Kaufmann, said: “I do not agree with Congressman King’s statement. We are a nation of immigrants, and diversity is the strength of any nation and any community. ” Mr. Trump’s spokesman, Sean Spicer, claimed ignorance of the Twitter post on Monday Mr. King’s spokeswoman said he was too busy to be interviewed. Mr. King, 67, represents the most conservative corner of Iowa, and has long held policy positions rooted in deeply conservative beliefs, especially concerning immigration, which he once deemed a “  Holocaust. ” He has often said he was made aware of illegal immigration as a small child by his father, the onetime mayor of a small Iowa town who taught him to take a hard line. Mr. King dropped out of Northwest Missouri State University to run a construction contracting business, and ran for the State Senate in 1996 when he first cottoned to the idea of an   America, something he would push for legislatively throughout his career. “Our language is getting subdivided by some forces of the federal government,” Mr. King once said. “It is time to speak with a common voice. The argument that diversity is our strength has really never been backed up by logic. ” He has argued vociferously  —   long before Mr. Trump ran for office pushing strict   measures  —   including against protections for young adults brought over as children who have been successful in America, a group many Republicans support. In 2006, he suggested a complex plan for building an electrified wall at the border, noting that this was a practice used to control livestock. In 2012, he compared immigrants to dogs. He also accused former President Barack Obama of advancing immigration policies based on race. “The president has demonstrated that he has a default mechanism in him that breaks down the side of race, on the side that favors the black person,” he said in a radio interview in 2010. Some of his other pet issues have also had a racial tone. For instance, he once railed against a   funding measure for settlements for   farmers and American Indians on the House floor. “We have a very, very urban senator,” he said, referring to a measure that Mr. Obama supported when he was a senator. Mr. King has also long targeted the Affordable Care Act he skipped his middle son’s wedding in 2009 to cast a vote against it. While many politicians, including Mr. Trump, often try to back away from statements that offend, Mr. King amiably doubles down. On Monday, confronted about his tweet, he told CNN, “I meant exactly what I said,” adding that he would “like to see an America that’s just so homogeneous that we look a lot the same, from that. ” These sorts of remarks make Iowans of both parties cringe, even though many Republicans do so anonymously. “He’s a grandstander who says things that embarrass the whole state,” said Michael L. Fitzgerald, a Democrat, who has been Iowa’s treasurer since 1983. “Democrats think he’s an ass, and sometimes Republicans do too. ” Mr. King faced his first primary challenge in a decade last year in a safe Republican district, but he has succeeded in many respects because people in the district find him personally affable and helpful. Both parties note that Mr. King does not try to run for statewide office, mindful of the limits of his popularity. The test going forward will be of Mr. King’s   limited national sway over Republicans, which he has sought to expand by trying to attract Republican presidential hopefuls to his annual pheasant hunting outing near his home. In 2016, Senator Ted Cruz, Republican of Texas, campaigned vigorously with Mr. King, retelling a joke over and over about how Chuck Norris wore Steve King pajamas, to demonstrate the congressman’s super toughness. Mr. King’s weekend tweet “is proof that it’s hard to get attention in our current politics,” Mr. Kochel said. “For Congressman King, it’s always been tough to stay out in front of this sad pack. ”'"}, "time": 1742563114.1343513}