{"duration": 0.048195838928222656, "input_args": {"text": "'\\nJeff Stein | VOX \\nHillary Clinton found herself in a no-win dilemma as she moved to launch her presidential run while also aiding her husband’s globe-trotting philanthropy — and her team knew it. \\nSometime before announcing her candidacy, Clinton had agreed to go to a Clinton Global Initiative fundraiser in Morocco planned for May 2015. The king of Morocco had personally pledged to give $12 million with the understanding she’d attend, according to emails released last week by WikiLeaks. \\nBut then there was the awkward fact that Clinton would be running for president by then. That set up a bind: Go to the event, and Clinton would be appearing to indulge a foreign government known for egregious human right abuses to help her family’s private charity. Pull out, and Clinton would be going back on her word to the Moroccan king. \\n“The King has personally committed approx $12 million both for the endowment and to support the meeting. It will break a lot of china to back out now when we had so many opportunities to do it in the past few months,” Clinton aide Huma Abedin wrote in an email in November 2014, several months before Clinton declared her candidacy. “She created this mess.” \\nHillary Clinton ultimately decided against attending, and Chelsea Clinton and Bill Clinton went instead. (Politico has reported a Moroccan phosphate export firm gave “at least” $1 million, but it’s not clear if the other $11 million came through. The foundation doesn’t have to disclose the gift and has declined to confirm one way or another to reporters.) \\nBut since this story broke late last week, Clinton has been getting attacked for it far and wide. And this time it’s not just Donald Trump and Fox News: Even mainstream outlets like the Atlantic and the Associated Press have published tough pieces about the controversy. (The Huffington Post said it amounted to a “brutal, clean hit” on the Democratic nominee.) \\nThis controversy has stoked wildly misleading allegations implying that Clinton is corrupt, even in some leading news outlets. But while those claims are overblown, the story still illustrates how the foundation helped put wealthy donors into Clinton’s orbit — and allowed them to buy a rare chance to shape her perspective that few average Americans will ever get. '"}, "time": 1742628301.1481571}