{"duration": 0.08450436592102051, "input_args": {"text": "'Una soprano se come un plato de albóndigas en plena representación de “La Bohème” ENCARNABA EL PAPEL DE UNA COSTURERA CONSUMIDA POR LA TUBERCULOSIS soprano \\nEl pasado fin de semana, los aficionados a la ópera congregados en La Scala de Milán se quedaron boquiabiertos cuando la protagonista de la obra no sólo sacó una fiambrera repleta de albóndigas sino que, además, procedió a comérselas al tiempo que cantaba con la boca llena la conocida aria “Mi chiamano Mimì”. Era el final del primer acto, un momento en el que los dos protagonistas de la pieza de Puccini, Mimí y Rodolfo, se declaran su amor. \\nEl público milanés contemplaba estupefacto una situación que claramente se salía del libreto: en “La Bohème” se retrata las estrecheces de los artistas en el París de finales del siglo XIX, jóvenes que pasan hambre y frío, por lo que muchos aficionados creyeron que la aparición de las albóndigas respondía a una provocación del director de escena. La explicación era mucho más sencilla pero no llegó hasta la rueda de prensa posterior a la representación. \\nDiana Damrau (Guzburgo, 1971) es una soprano de coloratura alemana especializada Mozart, Mahler y Strauss. Era la primera ocasión en la que cantante se enfrentaba a la partitura de Puccini y, para poder interpretar el papel de Mimí, una costurera consumida por la tuberculosis, estuvo seis meses sometida a una dieta estricta. Dieta que rompió el sábado en pleno escenario: “Ha sido un infierno cantar en italiano”, ha dicho Damrau en la posterior rueda de prensa. “En italiano todo suena a comida. Hasta el propio nombre de Puccini suena a tipo de pasta: ‘Puccinis a la carbonara’”, ha manifestado la soprano entre lágrimas mientras daba mordiscos a una pizza “alla napoletana”. “Antes de desmayarme en escena, he preferido sacar las albóndigas”, ha concluido conteniendo un eructo. \\nHan llovido muchas críticas sobre Damrau, que ha corrido a refugiarse en casa de su madre, la autora de las albóndigas. Sin embargo, ha salido en su defensa el director musical de La Scala, Riccardo Chailly, argumentando que el público de hoy en día ya no está acostumbrado a este tipo de actos por parte de tenores y sopranos, pero ha recordado que antes era lo habitual: “El gran tenor wagneriano Wolfgang Windgassen se comió un buey entero mientras interpretaba el papel de Parsifal en la mítica representación de 1954 en el Festival de Bayreuth”. \\nEn estos momentos, la soprano valora dejar la ópera “a no ser que algún compositor escriba una obra llamada ‘Ratatouille’ o ‘Il Masterchef’ y que tenga un papel a mi medida”.'"}, "time": 1742563126.3123195}