{"duration": 0.09995508193969727, "input_args": {"text": "'Halloween is here again. That means your   have planted surprise spiders around the office. You’ve been invited to a haunted hayride. Your neighbor’s yard has a full cemetery, rigged with motion detectors and   zombies.   from the start, I have always dreaded this time of year. Haunted houses, ghost tours and horror film fests are not my thing, and why people love having the daylights scared out of them completely escapes me. I decided to try to understand my friends who are on the lookout for thrills this time of year. As it turns out, there are many possible reasons some people like to be scared stiff. Each person’s threshold for experiences that provoke fear is made up of a unique recipe that blends nature and nurture. “The ingredients vary from person to person,” said Frank Farley, a psychologist at Temple University and a former president of the American Psychological Association. Dr. Farley is interested in what draws certain people to extreme behaviors, like driving racecars, climbing Mount Everest and flying hot air balloons across oceans. In the 1980s, he coined the term “Type T” personality to refer to the behavioral profile of  . What makes someone   he said, comes down to a mix of genes, environment and early development. David Zald, a neuropsychologist at Vanderbilt University, studies one piece of the equation. His research partly focuses on dopamine, a chemical involved in our brain’s response to reward. In the past, he has found that people who lack what he calls “brakes” on dopamine release tend to pursue thrilling activities. When you go to a haunted house, you’re grappling with a conflict, Dr. Zald said: The experience could either be fun or terrifying, and how you weigh that balance could depend in part on dopamine levels. “Having a greater amount of dopamine pushes someone to pursue the goal of excitement,” he said, “whereas someone who basically has less dopamine is more likely to hold back and say, ‘No, this isn’t worth it to me. ’” Socially, we get cues about how to respond to fear from those around us, said Margee Kerr, a sociologist and author of the book “Scream: Chilling Adventures in the Science of Fear. ” Early on, that’s taking notes from our parents about how to deal with distress. Later, experiencing stressful situations with others can cultivate social bonds. Part of that has to do with emotional contagion, or a communal response to shared experiences, Dr. Kerr said. If your friend is captivated by the horror movie you are watching together, you process that by recreating the same feeling in your own mind, and that can bring you closer together. People also tend to hold onto memories of fear more intensely, she said, so if you have positive associations with a scary situation, like going to a haunted house, you’ll likely want to do it again.   can also be a way of testing oneself. Josh Randall and Kristjan Thor, creators of Blackout, a haunted house experience that consistently tops rankings of “Most Extreme Haunted Houses,” said they see many people coming to their events with a goal of  . “It’s almost like a dare to themselves,” Mr. Thor said. “People want to be able to conquer something. ” For many, being scared is a jolting escape from daily life. When immersed in a scary situation, you can suspend your disbelief and live in the moment  —   and that loss of control can feel really good. This is key for Blackout, Mr. Randall said: “For a finite period of time, that audience member can turn off the real world, and live in a fantasy world. ” After talking with the experts, I was starting to see why some friends love getting spooked. But why do I hate being scared so much? It could be because I was never exposed to horror movies or haunted houses growing up, so by the time I did experience these things, I was  . It could be that the regions in my brain involved in coding fear and anxiety are more sensitive. Most likely, it is a mix of many different factors. Regardless of the reason though, “it’s perfectly O. K. not to like scary things,” Dr. Kerr said. For people who cannot fathom sitting out a haunted house, it’s important not to coerce your more cautious friends into doing something they do not want to, Dr. Kerr said. “That can compound the fear, and make it even worse. ” So, for any friends who were thinking of inviting me to the haunted house this weekend, save your breath  —   I have a doctor’s note.'"}, "time": 1742561649.8734224}