{"duration": 0.0416262149810791, "input_args": {"text": "'Source: Global Research \\nIs a war in the making — a third world war? \\nIf there is much talk about such a possibility, it is mainly because of the tensions between the United States and Russia. Tensions between the two most powerful nuclear states in the world have never been this high since the end of the Cold War in 1989 and the demise of the Soviet Union in 1991. \\nThere are at least two flash points, one more dangerous than the other. In Eastern Ukraine, Russian backed rebels will not surrender to the US supported regime in Kiev because they see US control over Ukraine as part of a much larger agenda to expand NATO power to the very borders of Russia. This has been happening for some years now. \\nBut it is the Washington-Moscow confrontation in Allepo, Syria which portends to a huge conflagration. The US is protective of major militant groups such as Al-Nusra which has besieged Eastern Allepo and is seeking to overthrow the Bashar al-Assad government. Washington has also set its sight on ‘regime change’ in Damascus ever since the latter’s determined resistance to Israeli occupation of the strategic Golan Heights in Syria from 1967 onwards. The drive for regime change intensified with the US-Israeli quest for a “new Middle East” following the Anglo-American invasion and occupation of Iraq in 2003. It became more pronounced in 2009 when Bashar al-Assad rejected a proposal to allow a gas pipe-line from Qatar to Europe to pass through his country, a pipe-line which would have reduced Europe’s dependence upon Russia for gas. Russia of course has been a long-standing ally of Syria. Together with Iran and the Lebanese Hezbollah, it is helping the Syrian government to break the siege of Eastern Allepo and to defeat militants in other parts of Syria. \\nIt is obvious that in both instances, in Ukraine and Syria, the US has not been able to achieve what it wants. The US has also been stymied in Southeast Asia where its attempt to re-assert its power through its 2010 ‘Pivot to Asia’ policy has suffered a serious setback as a result of the decision of the new president of the Philippines, Rodrigo Duterte, to pursue an independent foreign policy that no longer adheres blindly to US interests. At the same time, China continues to expand and enhance its economic strength in Asia and the world through its One Belt One Road (OBOR) projects and the Asia Infrastructure Investment Bank (AIIB) and via its leadership of BRICS. China’s regional and global economic role is leading to its pronounced presence in security and military matters. As a result of all this, the US’s imperial power has clearly diminished. It is a hegemon in decline. Source of image: lhvnews.com \\nIt is because it is not prepared to accept its decline that some US generals are threatening to demonstrate US’s military might. If a hegemon is a danger to humankind when it is at its pinnacle, it becomes an even greater threat to peace when its power is diminishing. Like a wounded tiger, it becomes even more furious and ferocious. A new US president may be inclined to give vent to this frustration through an arrogant display of military power. \\nHow can we check such wanton arrogance? There will be elements in the elite stratum of US society itself who would be opposed to the US going to war. We saw a bit of this in 2013 when those who were itching to launch military strikes against Syria based upon dubious “evidence” of the government’s use of chemical weapons were thwarted by others with a saner view of the consequences of war. It is also important to observe that none of the US’s major allies in Europe wants a war. Burdened by severe challenges related to the economy and migration, the governments know that their citizens will reject any move towards war either on the borders of Russia or in Syria and West Asia. \\nThis also suggests that a self-absorbed European citizenry may not have the enthusiasm to mobilise against an imminent war. Let us not forget that it was in European cities from London to Berlin that the biggest demonstrations against the war in Iraq took place in 2003. Anti-war protests will have to be initiated elsewhere this time. \\nGovernments in Moscow and Beijing, in Tehran and Jakarta, in Pretoria and La Paz, should come out openly against war. They should encourage other governments in the Global South and the Global North to denounce any move towards a war that will engulf the whole of humanity. Citizens all over the world should condemn war through a variety of strategies ranging from signature campaigns and letters to the media to public rallies and street demonstrations. \\nIn this campaign against an imminent war, the media, both conventional and alternative, will have a huge role to play. It is unfortunate that well-known media outlets in the West have supported war in the past. It is time that they atone for their sins!'"}, "time": 1742628597.3876944}