{"duration": 0.05112886428833008, "input_args": {"text": "\"Email \\nWhen FBI Director James Comey (shown on right) announced that the investigation into Hillary Clinton’s use of a private, unsecured e-mail server was being reopened, there seemed reason for cautious hope that justice just might be served. That hope, it would appear, was in vain. Comey announced Sunday afternoon, eight days after it was revealed that 650,000 e-mails were found on the laptop belonging to Anthony Weiner, that the FBI again was closing the investigation without recommending indictment. \\nDonald Trump wasted no time accusing the FBI of pulling punches and being part of a “rigged system” protecting Clinton from the consequences of her crimes. On Sunday night, he told a crowd of 8,000 in the Detriot, Michigan, suburb of Sterling Heights, “The investigations into her crimes will go on for a long, long time.” He added, “The rank-and-file special agents in the FBI won't let her get away with her terrible crimes — including the deletion of 33,000 emails after receiving a congressional subpoena.” Trump's remarks drew enthusiastic applause from the crowd, many of whom were undoubtedly aware of Comey’s decision hours earlier. Trump went on to say, “Right now she's being protected by a rigged system!” As proof of that “rigged system,” Trump said, “You can't review 650,000 new emails in eight days! You can't do it, folks!” \\nBut is Trump correct? He has shown his woeful lack of understanding of technology in the past, referring to the need to protect “the Cyber” in the first presidential debate and calling on Americans to “boycott Apple until such time as they give that security number” for the encrypted iPhone used by San Bernardino shooter, Syed Farook. Of course there is no such animal as “the Cyber,” and Apple had made clear the fact (known by anyone who knows anything at all about the way encryption — especially that found on any iPhone running iOS 8 and up — works) that it did not hold “that security number” to unlock Farook’s device. Listening to Trump discuss technology is sometimes like trying to explain to your grandmother that Facebook is a website you visit, not something “on your computer.” So, is Trump’s assertion that it would be impossible to “review 650,000 new emails in eight days” just another of his disconnected moments as he looks for the correct exit to get off “the information superhighway”? Or was he on to something. \\nAs it happens, he was right on the money. \\nEven with powerful, modern computers and a large team trained to sift the data, it is difficult to believe that the FBI actually looked at, analyzed, cross referenced, and cleared 650,000 e-mails in eight days. That would be 81,250 per day. Even if the FBI team working on clearing those e-mails was comprised of 500 agents (an unrealistic number), they would each have had to clear more than 20 e-mails an hour. This assumes an eight-hour workday and the agents (all 500 of them) working over the weekend. \\nThe task would have required an agent actually reading each e-mail and cross referencing the information it contained. Simply doing a keyword search would not have been sufficient, since that would require that the agents all know every keyword to be found in all classified e-mails — or at least have a master-list of those keywords (which would be a security nightmare to create and maintain). Plus, it is likely that an e-mail discussing classified intelligence would not use any of those keywords anyway. \\nSo, Trump is correct: “You can’t review 650,000 new emails in eight days!” Taking into account, then, that there was not time to make the determination (based on the data) that there was insufficient cause to recommend indictment, it also appears that Clinton is “being protected by a rigged system.” \\nUnfortunately for Clinton, that system may not extend to either the “rank-and-file special agents in the FBI” or the rank-and-file detectives in the NYPD. As The New American reported when the reopened “investigation” was made public, the case stems from a search that was conducted on the laptop of ex-congressman Anthony Weiner when NYPD officers and detectives served a search warrant in relation to allegations of child pornography. Once the investigators found the Clinton e-mails, they brought the FBI into the loop, and Comey announced that the investigation would be reopened. \\nAs The New American ’s Selwyn Duke wrote then: Sex crimes with children, child exploitation, money laundering, perjury, and pay to play, reads the partial list of crimes that, claim New York City Police Department sources, could “put Hillary and her crew away for life.” \\nAccording to a report by True Pundit , those sources also said that if the FBI gave Clinton another pass, they were prepared to go public with the information themselves: NYPD detectives and a [sic] NYPD Chief, the department’s highest rank under Commissioner, said openly that if the FBI and Justice Department fail to garner timely indictments against Clinton and co- conspirators, NYPD will go public with the damaging emails now in the hands of FBI Director James Comey and many FBI field offices. “What’s in the emails is staggering and as a father, it turned my stomach,” the NYPD Chief said. “There is not going to be any Houdini-like escape from what we found. We have copies of everything. We will ship them to Wikileaks or I will personally hold my own press conference if it comes to that.” \\nHopefully between the rank-and-file FBI agents and the rank-and-file NYPD detectives, something may yet come of this. Of course, Clinton may be in the White House by then and the investigation could be even more mired in politics than it has been so far. Having another Clinton in the White House, it seems, would be just like the last time.  \""}, "time": 1742628488.9337418}