{"duration": 0.11343598365783691, "input_args": {"text": "'\\nOutbreak of Violent Riots A number of riots have broken out in Los Angeles, Oakland, Portland, Austin and Manhattan following the election of Donald Trump to the U.S. presidency. One anti-Trump protester in Los Angeles is quoted in a CNN interview saying, “ People have to die ” and graffiti on a monument in New Orleans reads “ DIE WHITES DIE ” in response to Trump’s election. Rioters are breaking windows of businesses, looting stores, lighting trash cans on fire, shooting flares and brutalizing people who might support Trump or disagree with their violent leftist ideology.\\nShortly after midnight on Wednesday morning, a female driver in Oakland was hit by another car on the highway, and when she pulled over to the right shoulder, a group of anti-Trump rioters surrounded her car, broke the back window and she sustained multiple serious injuries. A shocking video which surfaced Thursday shows a man in Chicago being ripped from his car and brutally attacked by multiple anti-Trump agitators who are seen punching and kicking him in the head as one steals his car, dragging the man as he hangs onto the back left window. Many believe this is the handywork of financier George Soros who has funded multiple uprisings in recent years. What we can all agree on is this is worse than a zombie apocalypse; this epidemic of hate and criminal behavior will only lead to more unrest if allowed to grow.\\nAt times like these, it is more important than ever to ensure that you have the knowledge and ability to defend yourself and your loved ones from threats that may come at the most unexpected times, possibly when you are stuck in traffic and physically unable to get away from violent degenerates who may be at your window seeking to cause you harm.\\nSituational Awareness Let’s start with your general state of awareness in your day-to-day life. It is an unfortunate truth that many place themselves in needlessly volatile situations by not paying close attention to risks that they could face in their immediate surroundings, be it during simple daily tasks, like operating a vehicle or working around heavy machinery, or the more imminent threat of violent agitators that are now filling the streets in major cities, many of whom seek to cause damage to your property and/or harm to you and your loved ones. Utilizing techniques of avoidance, risk reduction, de-escalation and general situational awareness is essential to your survival.\\nHow to Use Cooper’s Color Codes A scale of situational awareness called Cooper’s Color Codes, named after Colonel Jeff Cooper’s combat preparedness methods, is often used in firearms training for situational awareness. The four colors are used as a measure of the degree of situational awareness which an individual may reach at any given point in the day.\\nWhite — In condition white, your state of awareness is one that is relaxed and largely unaware of your surroundings. Generally, the only time a person should be in condition White is if he or she is asleep or somehow incapacitated.\\nYellow — In condition yellow, you may be relaxed, but you have a heightened sense of awareness for who is around you and what noises and movements occur in your vicinity. You are not captivated by a cell phone screen; you are keeping track of who is behind or near you, especially when near a crowd. This awareness is in no way a paranoia; it is a general sense of awareness for threats to the safety of you and your loved ones.\\nOrange — In condition orange, you have identified something that is likely to cause harm, and you are focused in on a particular person or situation that poses a threat. This means that should an attack of any kind occur, you would be expecting this and ready for it at this stage.\\nRed — In condition red, you know that there is an immediate threat in your presence. However, this is not necessarily the point at which one who is armed would fire upon a target. Instead, this is the point where one who is armed may draw their firearm and make commands for an attacker to stop what they are doing. It is important to take steps to de-escalate at all cost, there is no reason to use deadly force if a situation can be solved without it.\\nThose who carry firearms, especially those who open-carry where concealed carry is criminalized, are obligated to have a heightened situational awareness at all times because any person who gets within arms reach could possibly attempt to take the firearm from them. On a number of occasions, concealed carry holders have stopped attempted robberies by merely maintaining a condition Yellow situational awareness and being prepared to draw their firearm in the moments they had as the gunman turned away from them. Many who seek to cause you harm are not expecting you to be prepared to fight back, and they will run when they see that you are prepared to defend yourself.\\nWeapons of Opportunity While firearms are effective tools of self-defense, they are not always available, and sometimes they are not practical; for this reason, it is important to consider keeping weapons of opportunity on your person, in your vehicle and even in your workplace. A weapon of opportunity is an everyday object that could be used as a defensive weapon if needed. Having situational awareness only becomes truly effective when you have the tools of defense at your disposal. Various weapons of opportunity are likely sitting all around your home and workplace; these are the heavy or sharp objects that can be grabbed at a moments notice, like a pen, key, belt or even a coffee mug. Various weapons of opportunity for your vehicle could be a crescent wrench, tire iron, lug wrench or crow bar. Make sure to check your local laws as there have been individuals who have been prosecuted for carrying opportune weapons like a baseball bat, but they had no substantiating evidence, like a baseball glove or ball, to show that they meant to use the item for its intended use.\\nWhy Gun Control Kills In some states, like California and New York, there have been such extreme gun control measures that non-violent people have been prohibited from carrying firearms for self-defense. This means that non-criminals are treated the same as convicted felons in these states; this only endangers lives and forces well-to-do people into vulnerable positions in which they become defenseless targets of murderers and thieves, and as we see today, individuals are being taken out of their cars and brutalized by anti-Trump rioters, like in Chicago, on of the most anti-gun cities in the country. Laws have not stopped the illegal acquisition of firearms, but they have caused many peaceful people to be victimized by criminals, and it’s time that this bureaucratic overreach is reversed.\\nReestablishing the foundations of self-defense and self-sufficiency in our society will require that we maintain awareness of threats to life and liberty and that we keep the tools of defense close by our side, ready to be used when the worst happens. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 16th, 2016 A Navy SEALs Secrets to Situational Awareness Situational Awareness Hard Core Chicks: Eight Self Defense Tactics Every Women… Emergency Survival Food Sales Soar as We Get Closer to… The Video Carjackers Don’t Want You To See '"}, "time": 1742562835.9113245}