{"duration": 0.11379718780517578, "input_args": {"text": "'Anton Yelchin, who played the young incarnation of Chekov, an excitable officer on the Starship Enterprise, in the rebooted “Star Trek” movie series, died early Sunday morning when he was pinned by his car in his driveway at his home in Los Angeles. He was 27. Officer Jenny Houser of the Los Angeles Police Department said Mr. Yelchin was hit around 1:10 a. m. The car, an SUV, had rolled backward down a steep driveway and trapped him against a brick mailbox pillar and a security fence. Officer Houser said he was found dead by friends who had come to his house, in the Studio City neighborhood, after he did not show up for a rehearsal. (On Monday, The Associated Press reported that the vehicle, a 2015 Jeep Grand Cherokee, was one of 1. 1. million vehicles recalled by the manufacturer, Fiat Chrysler, in April because their gear shifters had confused drivers, causing the vehicles to roll away, according to National Highway Traffic Safety Administration records.) Mr. Yelchin was born on March 11, 1989, in Leningrad (now St. Petersburg) Russia, in what was then the Soviet Union. His parents, Irina Korina and Viktor Yelchin, were superstar figure skaters with the Leningrad Ice Ballet. But the Yelchins, who are Jewish, fled the Soviet Union six months later, facing political and religious oppression and fearing for their son’s safety. They settled in Los Angeles. His parents survive him. “It is a very bad situation over there,” Viktor Yelchin told The Los Angeles Times. “I would get angry, too  —   I’d say, ‘Why should we have to buy things on the black market? Why should we have to stand in line? ’” As a child actor, Anton made memorable appearances on television shows like “ER,” “The Practice” and “Curb Your Enthusiasm,” on which he played a child magician who frustrates Larry David with a card trick. He also appeared in the films “Charlie Bartlett” (2007) with Robert Downey Jr. in which he played the title role, a talkative student who appoints himself his school’s resident therapist, and “Alpha Dog” (2006) in which he played an innocent boy who becomes an unwitting pawn in a drug war. His breakthrough came in the director J. J. Abrams’s 2009 resuscitation of “Star Trek,” the venerable   adventure franchise. Mr. Yelchin was cast as Pavel Chekov, the   Starfleet officer portrayed by Walter Koenig in the original “Star Trek” television series and movies. As played by Mr. Yelchin, Chekov was endearingly antic, humorously navigating his way through   scenarios and  —   even in the 23rd century  —   having difficulty with the “V” sounds in words like “Victor” and “Vulcan. ” Mr. Yelchin reprised the role in a 2013 sequel, “Star Trek Into Darkness,” and will be seen in a third film, “Star Trek Beyond,” to be released this summer. His other recent roles included the voice of Clumsy Smurf in two “Smurfs” movies and a member of a   band fighting its way out of a   skinhead club in the horror film “Green Room” (2015). His   mourned his death on social media. In an Instagram post, Zachary Quinto, who plays Spock in the new “Star Trek” movies, wrote that Mr. Yelchin was “one of the most open and intellectually curious people I have ever had the pleasure to know. ” In a post on Twitter, John Cho, who plays Sulu in the new movies, called Mr. Yelchin “a true artist  —   curious, beautiful, courageous. ”'"}, "time": 1742563200.3302853}