{"duration": 0.04783487319946289, "input_args": {"text": "'Trump rape accuser skips press conference, citing threats ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Iraqi forces retake new district in Mosul as house to house search for militants intensifies By GPD on November 4, 2016 \\nArmy officials said the new military gains in Samaha will “ensure security” for the larger district of Gogjali whose residents have partly fled to Kurdish controlled Khazir overnight. \\nBy Rudaw \\nGOGJALI, Mosul– Iraqi special forces have cleared a second neighborhood of ISIS militants in the eastern outskirts of Mosul city after they retook control of nearby Gogjali district Wednesday. \\nMilitary commanders told Rudaw the house to house search will continue in both Gogjali and Samaha districts for remaining militants in the area, asking residents to stay indoors. \\nArmy officials said the new military gains in Samaha will “ensure security” for the larger district of Gogjali whose residents have partly fled to Kurdish controlled Khazir overnight. \\n“We still are afraid of Daesh,” said a female Kurdish resident of Gogjali in burqa outfit telling Rudaw that the head to toe black dress was compulsory under ISIS rule. \\nRudaw correspondent Hardi Muhammad who is travelling with the Iraqi Special Forces inside Mosul said that the distance between army units and ISIS positions in the neighborhood is less than 300 meters. \\n“We still hear sporadic gunfire around Gogjali district but it’s unclear what is exactly taking place here,” said Muhammad. \\nMajor General Maadan Saadi, commander of the Second Golden Brigade told Rudaw they still need additional information about militants in the city and urged residents to inform the army units of possible ISIS positions. \\n“We have been carrying out searches today in the connecting roads between Gogjali and surrounding areas, we also question the locals about them which our forces need,” said General Saadi. \\nThe army is particularly concerned with booby trapped houses and landmines planted by the militants that have recently killed dozens of anti-ISIS Shiite militia elsewhere near Mosul. \\nAt least 15 Hashd-al Shaabi militants were killed and dozens more were severely wounded on Tuesday when the Shiite militia entered several liberated villages near the township of Tal Afar in Nineveh Plains. \\nRudaw correspondent Shady Rasoul who is in Khazir refugee camp north of Mosul said at least 5,000 refugees had fled Gogjali over the past two days and taken shelter in the Kurdish controlled camp. \\nShe said the camp now hosted over 7000 displaced people but the number was most likely to grow. \\n“It’s difficult to know exactly how many will seek refuge here but we estimate that around 100,000 people will likely leave Mosul for camps in Dohuk province,” visiting Iraqi Migration Minister Darbaz Muhammad told Rudaw’s Shady Rasoul in Khazir refugee camp. \\nMany of the residents have left their homes because of “indiscriminate ISIS shelling” according to Rasoul who had interviewed several fleeing families. Related Posts: New World Order, Weiner and Revelation The   GPD   20 Reads Filed under Military  '"}, "time": 1742562230.9188008}