{"duration": 1.5181994438171387, "input_args": {"text": "'There has been rioting in the streets of every major city of the United States after the US presidential election and all of the governors have declared states of emergency. As you’re heading home from work, a presidential announcement is made that martial law has been declared, and the US government has temporarily suspended your rights under the Constitution. An executive order demanding the turn-in of all firearms has been signed and placed into effect. The federal government with the aid of local police departments and other state law enforcement agencies is now confiscating the firearms door-to-door. \\nYou’ve been catching all of this in a radio broadcast as the announcer in a faltering voice also states that the US is on the brink of war. As you turn off the main highway, listening to the news and heading home, you notice that there are a number of vehicles…about a half dozen black blazers and several police cars…parked outside of your house with federal agents pounding on your front door. The S has hit the fan, and it looks as if you might have to skip dinner. You drive by without stopping, only to see the road blocked off about 200 feet down and similar operations occurring at your neighbors’ homes. Parking your car off the shoulder, you grab your backpack and supplies from the vehicle. It’s time to run. \\nRead part 1 of Mantracker here \\nIt is the hope of all decent people that such events do not occur. But what if they do? It’s time to make a getaway and not play around with the semantics or second guess any longer. This is just one reason out of innumerable that you may be on the run and the hunt has begun. Now is the time to focus your energies on getting away. Let’s cover some of the basics and finer points now, in this article to prepare you for bleak circumstances such as the outlined scenario.\\nBasic Escape and Evade Techniques Part of your E & E , your Escape and Evasion is going to depend on how much notice you receive before you are actually being pursued. The situation above is a bleak one: the hunted individual is about to be stripped of all of his belongings and equipment. He must now retreat from what was to be his retreat and cut his losses.\\n1. Know the area of your immediate E&E Urban , suburban , or rural , you have to focus on cover and concealment. Cover physically protects you (in varying degrees) from gunfire. Concealment may provide cover, but primarily it obstructs or prevents your pursuers/attackers from seeing you. In an urban or suburban area, it is difficult to slip undetected into the woodline, due to the higher population density and the scarcity of woods. Have you pre-planned a hide location until you can escape the populated area under cover of darkness? Do you have some maps to aid you in your endeavors?\\n6 laws of survival \\nHow to create a bug out plan \\nA rural area is a better start. The woods can hide you, support you, and shelter you if you know how to use them. When you enter the woods, you want to stay off any main paths or trails and “bust brush” as much as possible.\\n2. Keep your signature low, and cover your tracks When you’re “busting brush,” you want to move through the woods and thickets through the paths of least resistance, taking care not to break off branches or step into places that leave a noticeable (and trackable) sign, such as a dried, muddy creek bed or open area with snow on the ground. You can take a stout pine branch with needles (green is best) to brush away signs of your passage akin to a broom. Make sure you take the branch off of the direction of your travel, so the trackers don’t see a branch removed from the tree. Move stealthily and with a purpose, don’t just stagger through the brush with your emotions getting the best of you. Focus and concentrate on taking care with each step, yet don’t move as slowly as a sloth.\\n3. Don’t make tracks if possible One method is to take two heavy trash bags and place a good quantity of leaves and twigs in them. Take two to three sticks and lash them to the bottoms of your shoes/boots. Stepping into the bags, tie them off around your feet up by the instep. This will break up the pattern of your boot-print and enlarge the surface area of your tread…spreading your weight out to prevent you from making a track. You’ll have to fix and adjust the bags periodically. The thick contractor-type bags are the best that can take the wear. Don’t walk all over or step over things such as a moss-covered log that will show you’ve stepped there.\\n4. Move at night after the initial escape Once you’ve put some distance between yourself and the pursuer(s), wait until it’s dark before you travel again. This is as the situation dictates, depending on how badly they want you. It may be necessary to flee and postpone that normal wait time until it’s dark out of urgency. When moving at night, be aware of the moon and the amount of light that is on you. Cover up exposed portions of the skin, both to protect your body and to shield you from reflecting any light.\\n5. Mask your smell Mud, dirt, and other “stuff” can be rubbed all over you to help conceal your scent, as dogs may come into play. If you wear cologne or any other fragrance, wash it off when the opportunity presents itself from a stream or creek.\\n6. Dogs could be your worst nightmare A tracking dog can present a problem. Bleach or cayenne pepper can help to throw those dogs off the scent. Another thing you can prep in advance is skunk scent. You see one as a roadkill? Remove the glands and store them in an airtight container, glass is best. Later you can use this either through diluting (a container with water and a little of the gland/musk added to the container), and then spreading it in the area the dogs will travel. The more the merrier.\\nRule: You don’t beat the dog; you beat the handler . If you come to a fence? Happy Birthday, especially if the fence is a long one that’s high. Chain-link is the best. Where you can, cross the fence. When you’re across run down about 30-40 feet, and then re-cross it, going back to the first side. Run another 30-40 feet, and then climb across again. Do this over and over again, the whole length of the fence. Take care when you cross over it not to run right along it…go out and away from the fence, perpendicular to it by about 10-15 feet, and then come back in at the end of 30-40 feet.\\nThe dog will have to keep the trail, and the handler will have to put the dog(s) over the fence, and then climb over to follow…the handler will be half dead after about a couple hundred feet of this.\\nThe real art is at the end of the fence to take a “hide” sight, watch where they appear, double back, and then go across from the first (original) crossing point on the fence, and head on a 90-degree angle away from all of it. That’ll kill them.\\nWith dogs, take ‘em on a “joy ride” and give them plenty of fairly steep rocks to climb, hills to traverse, and bust through brush and stickers the whole time…this will give the dogs a hard time and half kill the handler. It’s up to you if you want to ambush them when they’re most tired or when you see the opportunity.\\nTake out the handler or handlers first. The dogs are not your enemy: they’re a tool in the hands of men who know how to use them. You should be armed: the 2 nd Amendment gives you the permission, and it’s up to you to actually use it…it is one of your rights. Use your own judgment as to whether to take out the dogs or not. Don’t forget to capitalize on the resources the handler may have left you when you deal with him. A radio might come in handy for the cross-chatter, and you may also have more equipment and tools.\\n7. Areas to avoid while fleeing Open areas are an invite to be picked up, or to be seen from even a tremendous distance. Skirt the woodline, staying back within it by at least 30 to 50 feet. Bodies of water should only be crossed when you must. Don’t worry…the dogs can pick up your trail on the other side, and maybe even better when you’re dripping water all over the place. Tunnels are death-traps; stay out of them at all cost, especially man-made tunnels. Better to walk another ¼ mile than enter a concrete tunnel where even a ricochet bullet from a pursuer may find its mark. Stay away from all human habitations and avoid any main roads or built-up areas with a lot of human traffic.\\n8. They know your needs and have the edge (so they think) You have to drink, eat, and sleep. They know it. They can work in shifts, and have the manpower to continue the search uninterrupted. You must eat on the move, drink on the move, and sleep in “bursts” that give you enough time to rest, yet ample time as they move closer to you.\\n9. Use every means at your disposal You have to get away, or you can end up in a FEMA camp , a prison, or worse. Live off of the land …that’s why you have been studying and training so much…it has to be in preparation for the worst-case scenario and this is it! You’ll have to feed yourself from the rivers and streams , shield any fire that you may use, construct camouflage lean-to’s and “spider holes” to hide in. You also need to plan on where you’re eventually going to go to completely evade the pursuers and give them the slip. Adapt, overcome, and survive .\\n10. Know their relentlessness Look at guys such as Eric Rudolph and the Unabomber. They’ll hound you to the very corners of hell, and for decades. When does it end? It never ends…just as your preparations never truly end.\\nIn the type of scenario that we just outlined at the beginning of this article, it ends when we have restored the Constitution of the United States to its primacy as the law of the land. It ends when we can form a government of the people, by the people, and for the people that governs with such a mindset. It ends when we can be safe and secure with our neighbors and our own family members…not having to constantly look over our shoulder to see if “Big Brother” is watching you.\\nTherefore, in reality, it never ends. Even in times of good, you must always be vigilant that things do not take a turn for the worse and denigrate into what we have now. Nothing is new under the sun. We have seen such times before and we’ll see them again. Prepare yourself mentally and physically for the challenges ahead of you, and keep fighting that good fight…one day at a time. JJ out! \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 14th, 2016 How Your Guard Dog Security Could Easily Be Compromised ManTracker: How to Be One and How to Avoid One How To Navigate Using the Sun and Stars A Green Beret’s Guide to Improvised Home Defense, Part Land Navigation: Finding Your Way in an Urban Environment… '"}, "time": 1742563352.5126157}