{"duration": 0.04894733428955078, "input_args": {"text": "'Russia outstrips USA in anti-meteorite defence 07.11.2016 AP photo The US government has held exercises to simulate a collision of planet Earth with an asteroid up to 250 meters in diameter. The asteroid may supposedly ram into Earth on September 20, 2020. Pravda.Ru asked coordinator of Kosmopoisk public association, cryptophysicist, researcher and writer Vadim Chernobrov what means of protection against space bodies Russia had. \"The Americans often carry out large-scale and regional exercises, the legend of which is about meteorites. Russia should not be envious about such measures at all, because Russia holds similar exercises on a regular basis without advertising them. \"One of the most recent exercises was held in the Tyumen region. I have to say that the world\\'s largest of such exercises was conducted in Russia in the first half of 2013, although the event had not received any coverage at all. The event was held soon after the fall of the Chelyabinsk meteorite. As we know, pieces of that space body started falling on Earth on February 10. The last pieces fell on 20 February - the process took ten days. Print version Font Size \"The Russian Defence Minister ordered to hold large-scale exercises in the area of the crash site soon after the phenomenal event. The legend of the exercises did not contain a word about the meteorite danger, but everyone knew that the event was connected with the fall of the Chelyabinsk meteorite . In fact, their goal was to show both the defence minister and the president, that our troops, if necessary, would be ready to go to any location in Russia and take all necessary measures in this regard.\" Prior to 2050, as many as eleven asteroids may approach our planet at distances smaller than the average radius of the lunar orbit (385,000 kilometers). The dimensions of these space bodies vary from seven to 945 meters, RIA Novosti said. One of them will pass near Earth on October 12, 2017. Experts note that the distance between asteroid 2012TS4 and planet Earth will be 115,000 kilometers, while its speed will be 6.8 kilometers per second. The diameter of this celestial body is not less than 17 meters. The most dangerous space object, which will soon fly past Earth is known as Asteroid Apophis , 393 meters in diameter. Apophis is said to approach Earth on April 30, 2029 at a speed of seven kilometers per second. Pravda.Ru Read article on the Russian version of Pravda.Ru Behind Russia\\'s space shield'"}, "time": 1742563918.9741952}