{"duration": 0.12730789184570312, "input_args": {"text": "'ERBIL, Iraq  —   More than two years ago, a Christian farmer in his 70s named Mosa Zachariah fled his village near Mosul with, as he put it, only the pants he was wearing. He left behind his house, “tons of wheat” and a BMW. But now that his town, an early target of the Iraqi security forces as they advance on Mosul itself, has been cleared of the Islamic State forces, it is not jubilation he feels, but fear of what awaits him if he tries to return. He wistfully talked about his city’s diversity as something completely unattainable now. “In that time, the Muslims and Christians were like brothers,” he said. Musab Juma, a Shiite who used to live in the Mosul area, said he would not be going back, either. He relocated to Najaf, in southern Iraq, where he has a food stall and has decorated his home with old photos and antiques from his hometown. Yazidis and Kurds and Shabaks, other minorities that were once vital pieces of Mosul’s human tapestry, have moved on, too. And many Sunni Arabs, who make up most of Mosul’s population, say they will never go home again, even if that is where their parents and grandparents are buried. Before the Islamic State’s occupation began more than two years ago, Mosul was Iraq’s most diverse city. Its rich culture, stretching back to the ancient Assyrians, and reputation for tolerance made it a vital symbol of an Iraq that could at least aspire to being a unified and whole nation. Now, as Mosul’s exiled civilians watch the battle for their city unfold, the only thing they seem to have in common is the belief that they once shared a special history that can never be reclaimed. Some of that belief, but not all, was torn apart after the   invasion of Iraq in 2003, when many Christians felt threatened and fled as Arabs and Kurds fought over old animosities. Mosul, home for many former Baathist army officers suddenly tossed from power after the invasion, became a center of the Sunni insurgency and a stronghold of Al Qaeda in Iraq, the precursor of the Islamic State. “Until 2003, the Mosul community was living in peaceful coexistence, but after that, things changed,” said Jafar Khaleel, 46, who left Mosul in 2014 after the Islamic State onslaught. “The Sunnis don’t trust the Shiites. The Shabak cannot live with the Christian. This is what the American occupation left behind. ” Back then, there was a social compact for Iraq’s minorities that at least promised security in exchange for tolerating the tyranny and lack of personal freedoms under Saddam Hussein’s government, led by an elite class of Iraq’s minority Sunni population. Today, there is widespread nostalgia for that time, though it is not shared by most of Iraq’s Shiite majority, now in power. “For generations, life was normal there,” said Sabah Salim Dawood, 62, a Christian from Mosul. “In the factories, on the farms, in the offices, nobody asked, ‘What are you?’ ” Now there is a sense of unraveling that feels permanent. “A man cannot describe in words what he misses,” said Omar Ahmed, 29, who used to work in Mosul’s Health Ministry and is now exiled in the northern Kurdish region. Walking through a ransacked church recently in Bartella, a mostly Christian town at the edge of Mosul, reveals an elegy to what has been lost. Some walls have been burned others are streaked with Islamic State graffiti. A whiteboard on a wall in an anteroom lists a daily schedule for Islamic State recruits  —   fitness routines, weapons instructions and Shariah law lessons. Strewn on the floor are dusty reminders of those who once prayed there: Christian storybooks, copies of a “quarterly social  cultural journal” published by the Chaldean Church, a Santa Claus figurine, photographs of schoolgirls and a pink plastic rose. An old Iraqi tourist guide from the 1980s celebrated Mosul as a city whose rich history as a place of great Arab conquests important to the region’s   past that made it “a city of great importance. ” Its nickname as the “the city of two springs”  —   because autumn and spring weather are so similar  —   was a testament to the city’s livability. “Since 1969, a Spring Festival has been held every year in Mosul,” the tourist guide noted. “Flower processions and folk dancing by thousands of people from every walk of life bring much gaiety to the place. ” Moslawis, as they are known, have their own dialect, and jokes, many based on their reputation for being stingy, which goes back to a famine in 1917, when they suffered as the Ottoman Empire took food from the city to feed its starving army. The rest of Iraq is known for its generosity, but a common joke goes that the only time a Moslawi will invite someone in for lunch is during Ramadan, when everyone is fasting. Even so, the city is also known for its food, especially Mosul’s kibbe, flat bulgur wheat discs stuffed with ground meat that are famous all over Iraq. There is the abundance of cultural heritage, the remnants of empires: ancient churches, monasteries, tombs, shrines and an antiquities museum that is important not just to Mosul but the broader Middle East. Nearly all have been destroyed or defaced by the Islamic State. Putting the city back together socially is “going to take a very, very long time,” said Rasha   a Sunni Arab from Mosul who now lives in Dubai, in the United Arab Emirates, where she is a research fellow at the   Studies and Research Center and writes about her home city. “I think everyone is going to live on their own. The Yazidis are going to live on their own. Christians are going to live on their own. The Sunnis are going to live on their own. ” As a child, she recalls, her classroom had seven Christians, seven or eight Kurds, two or three Yazidis, one or two Shiites, and the rest Sunni Arabs. There were four or five languages spoken, she said, plus three religions and two sects of Islam. “That diversity you didn’t find anywhere else,” she said. Walking to school, she would pass by a winged bull statue from Assyrian times, at the old city walls, that has been demolished by the Islamic State. “I really regret now that I took them for granted,” she said. Perhaps most painful is seeing former friends turn into enemies. Muhammad Sayed, 26, is Shiite, so for him there was only this choice when the Islamic State took over Mosul: Leave or be killed. Like many Shiites from the city, he eventually moved to Najaf, a holy city for his sect, where he now bakes bread and sells it on the street. “The Islamic State destroyed my childhood and my memories,” he said. “They turned some of my friends into murdering terrorists, some of the friends that I studied with in primary school and high school, and I have the most beautiful memories with them. But they have joined the terrorists, and for them, I have become an infidel. ” The task of trying to stitch Iraq back together is immensely complicated. But for Iraqis who have been displaced, it all boils down to a single, simple human emotion. “The major problem in Iraq is dealing with fear,” said Falah Mustafa, the Kurdish region’s foreign minister, at a recent panel discussion in Erbil, about Mosul’s future. “It’s immensely painful to be betrayed by your neighbor. ”'"}, "time": 1742562121.0677047}