{"duration": 0.1446855068206787, "input_args": {"text": "'Let’s just get this out of the way, shall we? Ayelet Waldman: intemperate tweeter, guerrilla oversharer, provocateur, literary exhibitionist, cyclone of sass. When The New York Times Book Review didn’t select her novel “Love and Treasure” as one of its 100 Notable Books of 2014, she unleashed a  tweetstorm of hurt. (  excerpt: “there are MANY books on that notable list with reviews that were NOWHERE near as good as mine. ”) When she announced in a 2005 essay that she loved her husband, the novelist Michael Chabon, more than she loved her children, outraged mothers everywhere clucked and   and when she expressed surprise, the chorus came back  —   Well, what on earth did you expect? But here’s my question for those who sneer at or   her new memoir about the possible therapeutic value of LSD, “A Really Good Day: How Microdosing Made a Mega Difference in My Mood, My Marriage, and My Life”: What on earth did you expect? Here is the truth about Ms. Waldman, which complicates matters for those who don’t like her: She has spent many years struggling with punishing, ungovernable moods. Originally, doctors told her she had bipolar II disorder years later, a psychiatrist decided premenstrual dysphoric disorder more closely corresponded with her symptoms, and Ms. Waldman agreed. But whatever it’s called, hers is not a mood disorder of the quiet, novelistic variety. It’s big and operatic, often driving her to do the very things for which she’s been publicly shamed: acting out, picking fights, trawling for affirmation. Just because she doesn’t have a picturesque version of melancholy doesn’t make it any less real or any less deserving of compassion. And after reading “A Really Good Day,” you understand just why Ms. Waldman might have been willing to experiment to find relief. She’d exhausted her family. She’d exhausted all manner of therapies. And she’d exhausted just about every drug in the pharmacopoeia  —   including the ones that sound like Spanish dances (Cymbalta, Strattera, Concerta) the ones that look like typing tests (Zoloft, Effexor, Seroquel) and the ones that could well be craters on the moon (Valium, Ambien, Lunesta). Her Ambien dependence proved particularly problematic. When she took too much, she’d have text exchanges with Mr. Chabon that looked like this: Hence Ms. Waldman’s   trial with LSD  —   10 micrograms every three days. A microdose, as she explains, is anywhere from   to   of what one would find on a   tab of acid. It doesn’t turn the world into a bubbling lava lamp. This dosage, taken at this rate, is “” according to the psychologist and former psychedelic researcher James Fadiman. Mr. Fadiman’s (admittedly informal, nonrandomized) research suggests that people who follow this protocol simply feel   …     better. Ms. Waldman wanted to know what something as luxuriously pedestrian as “better” was like. “A Really Good Day” is a captain’s log of her    trip. It combines daily reports of her moods with the research she’s done about the history of psychedelics and her extended meditations on drugs and the law. (Before becoming a writer, Ms. Waldman was a federal public defender.) And what does she find? That the experience really is transformative. “You’ve been much happier,” her younger daughter tells her. “You’ve been controlling your emotions. Like, when you’re angry, you’re  . ” The reader doesn’t have quite as uniformly positive an experience. Part of the problem is aesthetic: Ms. Waldman has a tendency to slide into the prefab language of psychotherapy or  . (“It is suddenly so obvious that what I need to do is just get out of my own way. ”) Her sense of humor can be unsubtle. (On the weak magic mushrooms she once tried in college: “It’s possible that all I ate was a handful of dried shiitakes dipped in cow manure. ”) She’s a fan of extended metaphors, and almost no one should be a fan of extended metaphors. They involve beating a dead horse, converting it to glue, and then discovering the glue doesn’t work. If you see what I mean. And her observations can be trite. Her anxious   while meditating  —   “Now you’re thinking about thinking! Stop berating yourself for thinking!”  —   will surprise exactly no one. But then Ms. Waldman will capture you with genuinely brave and human moments, like when she confesses that she yells at people because she enjoys it. Or when she says her talents aren’t considerable enough to earn her a great artist’s tempestuous mood swings. Or expresses guilt that her oldest child has had to bear the brunt of her anger and depression. Her reminiscences about her time defending poor, defenseless clients in Los Angeles are riveting. I am not sure they belong in this book  —   especially when she talks about the unfairness of our sentencing guidelines (I mean, agreed, but this is neither the time nor the place for  )  —   but I’d love to see an independent memoir about her legal work one day. Ms. Waldman’s survey of the history and literature of psychotropic drugs is informative, though it can also, on occasion, be too sloppy and loose. She casually drops the phrase “Alzheimer’  benzos” (short for benzodiazepines, that class of   drugs including Valium and Xanax) without so much as a footnote, and this claim is hardly settled science. She writes that Francis Crick “reportedly” experimented with LSD when he envisioned the double helix, and then takes it back in a footnote. “Couldn’t we just pretend it’s true?” she asks. No, we can’t. There are other uncareful moments of this kind, and other undocumented declarations. I mention them not to be picayune, but because writing about drug research is a delicate business, requiring a certain amount of control in one’s voice. You really don’t want readers doubting your authority when you’re making an argument in favor of a maligned and illegal substance. But it’s an argument that needs to be made. As she did with her 2009 essay collection, “Bad Mother,” which decriminalized ordinary mommy infractions and helped bring a sense of proportion to the messy enterprise of parenting, Ms. Waldman brings a huge dose of compassion and, yes, good sense to “A Really Good Day. ” Whatever her foibles or stylistic lapses, she makes a persuasive case for the therapeutic use of psychedelics. (Want to be inspired? Read the research on the effects of hallucinogens on dying cancer patients.) As ever, Ms. Waldman is wielding her powers of provocation to goad us into an uncomfortable but necessary conversation. Quibble with her style, her methods, her desire to attract attention. In normalizing the conversation about LSD, she may one day help others feel normal.'"}, "time": 1742562148.7919354}