{"duration": 0.06681561470031738, "input_args": {"text": "'West Point Academy And Children Are The New Champions For Gay Marriage By Jonathan Lenhardt on November 4, 2013 Subscribe \\nAnother day, another bit of ground my socially conservative Republican counterparts have lost on the gay marriage debate. This past Saturday, November 2, 2013 West Point Military Academy’s Cadet Chapel hosted the first ever male same-sex marriage ceremony . This follows two female same-sex marriages late in 2012. \\nNeedless to say, somebody at the academy has decided to join the 21st Century and not a moment too soon; gay marriage was made legal in New York State way back in mid-2011 . Still, long time coming aside, it was a huge day for West Point graduates 28-year-old Larry Choate III (Class of 2009), and 27-year-old Daniel Lennox (Class of 2007), and we at Liberal America sent our congratulations. \\nSadly, however, there is still a raging debate on gay marriage and whether or not it should be made legal courtesy of the Big G, (U.S. Federal Government). Fifty two percent of Americans say yes according to a Gallup poll conducted this past July, and we already know what we, here at The Liberal Conservative , think about federal laws on not just gay marriage but marriage in general – spoiler alert: we’re for gay marriage, just not via federal law. \\nNow the thing that the far-right, Tea Party-indoctrinated “Republicans,” have to realize is that there is a certain group of people to which they have fallen behind on this matter, and many others. This is a group of people that they should be ashamed and embarrassed to have fallen behind. This is a group of people who have proven to be more mature, more merciful, kinder, and warmer than they are. \\nChildren . \\nIf you’ve ever checked out any of the ?Kids React To…? videos on YouTube such as the one above or this one or – more importantly – this one , then you’re familiar with the work of The Fine Brothers , Benny and Rafi. They’ve been at this for a while now and, as The Daily Dot explains, when they’re not getting kids’ reactions to things like, Nyan Cat, Justin Bieber, or Rebecca Black, they have their delightful cast of youngsters tackling issues like race relations, rape culture, bullying, and, yes, ?gay marriage. \\nThirteen children were asked to react to videos of same-sex marriage proposals and offer their opinion. With the exception of a single young boy, the children reacted universally positive; and then with anger when they inevitably discover that not everybody is allowed to marry who they love in the United States – the “freest” nation on Earth. \\nTo the proposals themselves the kids, Californians aged 5 to 13 years, were floored by the displays of love they were fortunate to witness in the videos. And when he discovered the truth about gay marriage in America young Dylan wondered: \\nWhy would you be that mean to someone? \\nIndeed. Why would we be that mean to someone? \\nSomeone in the audience yells “Religion!” and I roll my eyes in disappointed concurrence. \\nThis author’s personal favorite reaction comes from 5-year-old Lucas who, apart from looking gloriously like Zachary Quinto as Spock, turns to one of the Fines after the first video and asks “So, they’re gay?” When this is confirmed he simply lets out a nonchalant and confirming, “Oh.” Standing against gay marriage is..illogical.'"}, "time": 1742628316.4923656}