{"duration": 0.05230903625488281, "input_args": {"text": "'usapoliticsnow admin 2016 Election , US News \\nVoter fraud has been a running theme in this election with the Democratic party and will continue to be through the election. Trump has been warning voters for months about fraud and it’s certainly happening, especially in swing states like Florida. \\nThis time around, absentee ballots are being fraudulently filled out in Democratic Broward County, Florida, which was just discovered with a sworn testimony via affidavit. The witness describes going into a back room where SOE employees were sitting at a table with stacks of absentee ballots, filling them out assembly line style. \\nHere’s a larger version of the section listed in the Tweet… \\nNewsmax reports, According to the affidavit, the former employee alleged that on Monday about 8:30 p.m. she had been told to take a stack of absentee ballot forms to what is known as the Pitney-Bowes Room at the Supervisor of Elections (SOE) office in Lauderhill, Fla. Through the locked door’s window, she saw four workers sitting at a table in the room with “stacks of documents and writing something,” according to the affidavit. \\nShe knocked on the door — and an SOE worker opened the door, took the stack from her “and closed the door,” she alleged. “The employee seemed very rushed.” When the former employee returned a short time later with a second stack, the woman was allowed into the room. \\nNewsmax reports, According to the affidavit, the former employee alleged that on Monday about 8:30 p.m. she had been told to take a stack of absentee ballot forms to what is known as the Pitney-Bowes Room at the Supervisor of Elections (SOE) office in Lauderhill, Fla. \\nThrough the locked door’s window, she saw four workers sitting at a table in the room with “stacks of documents and writing something,” according to the affidavit. She knocked on the door — and an SOE worker opened the door, took the stack from her “and closed the door,” she alleged. “The employee seemed very rushed.” When the former employee returned a short time later with a second stack, the woman was allowed into the room. \\n'"}, "time": 1742562015.7041543}