{"duration": 0.05425620079040527, "input_args": {"text": "'Oakland, one of California’s many sanctuary cities, set up a $300, 000   fund on Tuesday in response to President Donald Trump’s executive order last week that aims to cut off federal funds to “jurisdictions that willfully refuse to comply” with federal immigration enforcement. [According to the San Francisco Chronicle, the fund will be disbursed to to a “rapid response network” composed of 12 Oakland organizations to help families that cannot afford legal representation and whose illegal status could result in deportation. Money will also go towards creating an emergency hotline for residents, holding “know your rights” workshops, and providing free consultations.  “Without counsel, up against a federal prosecutor, they’re supposed to represent themselves in one of the most complex areas of law, where the stakes are permanent separation from their families,” Eleni   immigration program director of Centro Legal de la Raza, told the Chronicle. According to the Chronicle, over a quarter of residents in Oakland are  . The publication further noted that on Tuesday, during a City Council meeting to discuss Oakland’s budget for the next two years, Mayor Libby Schaaf said, “I caution that we are at a moment of unprecedented uncertainty in this new, I would say, horrific federal environment. ” Schaaf had previously warned, according to the San Jose Mercury News, that Turmp’s order would “destroy trust in government” and complaining that “it’s disrespecting the American tradition of a peaceful transfer of power. ” Trump’s order states, “Sanctuary jurisdictions across the United States willfully violate Federal law in an attempt to shield aliens from removal from the United States.  These jurisdictions have caused immeasurable harm to the American people and to the very fabric of our Republic. ” It stipulates that such jurisdictions will not be eligible to receive Federal grants unless they are found necessary for law enforcement purposes as prescribed by the Attorney General of Secretary of Homeland Security. Oakland is located just over 10 miles away from San Francisco, another sanctuary city where Kate Steinle was infamously murdered by an illegal alien and felon with multiple convictions and deportations in July 2015. Only one mayor from a major California city agreed with Trump’s order. Last week, Fresno Mayor Lee Brand told the Fresno Bee, “I’m not going to make Fresno a sanctuary city because I don’t want to make Fresno ineligible from receiving potentially millions of dollars in infrastructure and other types of projects   …      My philosophy is to follow the law and to avoid these national   questions. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742563187.9348853}