{"duration": 0.04507732391357422, "input_args": {"text": "'#FROMTHEFRONT #RUSSIA 09.11.2016 - 5,734 views 4.9 ( 8 votes) Syrian War Report – November 9, 2016: Russian Navy Is Ready to Strike Terrorists in Aleppo 4.875 out of 5 based on 8 ratings. 8 user reviews. Syrian War Report – November 9, 2016: Russian Navy Is Ready to Strike Terrorists in Aleppo Donate Loading the player... \\nIf you’re able, and if you like our content and approach, please support the project. Our work wouldn’t be possible without your help: PayPal: southfront@list.ru or via: http://southfront.org/donate/ or via: https://www.patreon.com/southfront \\nThe Russian Navy’s aircraft carrier group is ready to launch military strikes targeting terrorists in the province of Aleppo in the next 24 hours, Gazeta.ru reported Tuesday, citing a source in the Russian Ministry of Defense. The attack will likely target militants outsde the city of Aleppo, with Kalibr cruise missiles. According to the report, the Admiral Kuznetsov battlegroup has completed its deployment to the Mediterranean Sea and is getting ready to strike. \\nAfter the success in the 1070 Apartment Project and nearby areas, the Syrian army and its allies attacked Jaish al-Fatah militants in the area of Minyan in the western part of Aleppo city. Following a series of firefights, the government forces seized a large part of Minyan and pushed Jaish al-Fatah militants to retreat from the area. According to pro-government sources, Jaish al-Fatah is on the verge of losing of Minyan to the army. \\nThe Russian Aerospace Forces delivered a series of air strikes on the Al-Nusra(Al-Qaeda)-led militant coalition, Jaish al-Fatah, in the province of Idlib. Since November 8, Russian warplanes made up to 55 air strikes on militant weapon depots and supply lines. 3 weapon depots and a convoy, consisting of 4 vehicles, and 5 militant tactical units were reported destroyed. The Russian Aerospace Forces’ activity in the province is linked with reports that Jaish al-Fatah is deploying reinforcements to western Aleppo where the militant coalition has recently lost the area of 1070 Apartment Project and the strategic Motah Hill to the Syrian government forces. \\nThe recently released video depicts a militant vehicle that has been targeted by an Iranian Toophan anti-tank on the road between Daer Mkaren – Efreh in the western countryside of Damascus. Iran provides to the Syrian army’s troops and other pro-government groups a wide range of supplies, including anti-tank guided missiles. Toophan is a series of Iranian-made anti-tank guided missiles. Toophan 1 was a reverse-engineered copy of the US-made BGM-71 TOW missile. \\nDonate'"}, "time": 1742564112.7780082}