{"duration": 0.11088204383850098, "input_args": {"text": "'Donate We Are All Deplorables We can\\'t battle the bigotry stoked by Trump without a strategy to alleviate the economic misery behind it, writes Chris Hedges. By Chris Hedges / truthdig.com \\nMy relatives in Maine are deplorables . I cannot write on their behalf. I can write in their defense. They live in towns and villages that have been ravaged by deindustrialization. The bank in Mechanic Falls, where my grandparents lived, is boarded up, along with nearly every downtown store. The paper mill closed decades ago. There is a strip club in the center of the town. The jobs, at least the good ones, are gone. Many of my relatives and their neighbors work up to 70 hours a week at three minimum-wage jobs, without benefits, to make perhaps $35,000 a year. Or they have no jobs. They cannot afford adequate health coverage under the scam of Obamacare. Alcoholism is rampant in the region. Heroin addiction is an epidemic. Labs producing the street drug methamphetamine make up a cottage industry. Suicide is common. Domestic abuse and sexual assault destroy families. Despair and rage among the population have fueled an inchoate racism, homophobia and Islamophobia and feed the latent and ever present poison of white supremacy. They also nourish the magical thinking peddled by the con artists in the Christian right, the state lotteries that fleece the poor, and an entertainment industry that night after night shows visions of an America and a lifestyle on television screens—“The Apprentice” typified this—that foster unattainable dreams of wealth and celebrity. \\nThose who are cast aside as human refuse often have a psychological need for illusions and scapegoats. They desperately seek the promise of divine intervention. They unplug from a reality that is too hard to bear. They see in others, especially those who are different, the obstacles to their advancement and success. We must recognize and understand the profound despair that leads to these reactions. To understand these reactions is not to condone them. \\nThe suffering of the white underclass is real. Its members struggle with humiliation and a crippling loss of self-worth and dignity. The last thing they need, or deserve, is politically correct thought police telling them what to say and think and condemning them as mutations of human beings. \\nThose cast aside by the neoliberal order have an economic identity that both the liberal class and the right wing are unwilling to acknowledge. This economic identity is one the white underclass shares with other discarded people, including the undocumented workers and the people of color demonized by the carnival barkers on cable news shows. This is an economic reality the power elites invest great energy in masking. \\nThe self-righteousness of the liberal class, which revels in imagined tolerance and enlightenment while condemning the white underclass as irredeemable, widens the divide between white low-wage workers and urban elites. Liberals have no right to pass judgment on these so-called deplorables without acknowledging their pain. They must listen to their stories, which the corporate media shut out. They must offer solutions that provide the possibility of economic stability and self-respect. \\n\"The liberal class has no hope of defeating the rise of American fascism until it unites with the dispossessed white working class. It has no hope of being an effective force in politics until it articulates a viable socialism.\" \\nMartin Luther King Jr. understood the downward spiral of hating those who hate you. “In a real sense all life is inter-related,” he wrote in “Letter From a Birmingham Jail.”“All men are caught in an inescapable network of mutuality, tied in a single garment of destiny. Whatever affects one directly, affects all indirectly. I can never be what I ought to be until you are what you ought to be, and you can never be what you ought to be until I am what I ought to be. …” \\nWe cannot battle the racism, bigotry and hate crimes that will be stoked by the Donald Trump presidency without first battling for economic justice. This is not a gap between the tolerant and the intolerant. It is a gap between most of the American population and our oligarchic and corporate elites, which Trump epitomizes. It is a gap that is understood only in the light of the demand for economic justice. And when we start to speak in the language of justice first, and the language of inclusiveness second, we will begin to blunt the protofascism being embraced by many Trump supporters. \\nI spent two years writing a book on the Christian right called “ American Fascists : The Christian Right and the War on America.” I spent many months with dispossessed white workers in states such as Missouri, Kansas, Florida, Pennsylvania, Ohio and California. I carried into the book project all the prejudices that come with being raised in the liberal church—a disdain for a magic Jesus who answers your prayers and makes you rich, a repugnance at the rejection of rationality and science and at the literal interpretation of the Bible, a horror of the sacralization of the American empire, and a revulsion against the racism, misogyny, homophobia, Islamophobia, anti-Semitism and blind intolerance that often afflict those who retreat into a binary world of good and evil. \\nThose enthralled by such thinking are Christian heretics—Jesus did not come to make us rich and powerful and bless America’s empire—and potential fascists. They have fused the iconography and symbols of the American state with the iconography and symbols of the Christian religion. They believe they can create a “Christian” America. The American flag is given the same sacred value as the Christian cross. The Pledge of Allegiance has the religious power of the Lord’s Prayer. That a sleazy developer and con artist was chosen as their vehicle—81 percent of evangelicals voted for Trump—for achieving this goal is startling, to say the least. But this is not a reality-based movement. Most of those who profit from this culture of despair, many wrapped in the halo of the ministry, are, like Trump, slick, amoral trolls. \\nMy view of the tens of millions of Americans who have fallen into the embrace of the Christian right’s magical thinking underwent a profound change as I conducted interviews for the book. During that time I did what good reporters do: I listened. And the stories I heard were heartbreaking. I grew to like many of these people. The communities they lived in, many of which I visited, looked like the towns where my family lived in Maine. They were terrified of the future, especially for their children. They struggled with feelings of worthlessness and abandonment. I fear the Christianized fascism in which they enshroud themselves, but I also see them as its pawns. \\nThey hate a secular world they see as destroying them. They long for the apocalyptic visions of Tim LaHaye’s “Left Behind” series . They want the cruelty and rot of “secular humanism” to be obliterated before they and their families are lifted into heaven by the rapture (an event never mentioned in the Bible). \\nI finished my book with a deep dislike for megachurch pastors who, like Trump, manipulate despair to achieve power and wealth. I see the Christian right as a serious threat to an open society. But I do not hate those who desperately cling to this emotional life raft, even as they spew racist venom. Their conclusion that minorities, undocumented workers or Muslims are responsible for their impoverishment is part of the retreat into fantasy. The only way we will blunt this racism and hatred and allow them to free themselves from the grip of magical thinking is by providing jobs that offer adequate incomes and economic stability and by restoring their communities and the primacy of the common good. Any other approach will fail. We will not argue or scold them out of their beliefs. These people are emotionally incapable of coping with the world as it is. If we demonize them we demonize ourselves. \\nArlie Russell Hochschild ’s book “Strangers in Their Own Land: Anger and Mourning on the American Right” in story after story makes clear that members of the white underclass are also victims and deserve our empathy. \\nThe liberal class has no hope of defeating the rise of American fascism until it unites with the dispossessed white working class. It has no hope of being an effective force in politics until it articulates a viable socialism. Corporate capitalism cannot be regulated, reformed or corrected. A socialist movement dedicated to demolishing the cruelty of the corporate state will do more to curb the racism of the white underclass than lessons by liberals in moral purity. Preaching multiculturalism and gender and identity politics will not save us from the rising sadism in American society. It will only fuel the anti-politics that has replaced politics. \\nLiberals have sprinkled academic, corporate, media and political institutions with men and women of different races and religions. This has done nothing to protect the majority of marginalized people who live in conditions that are worse than those that existed when King marched on Selma. It is boutique activism. It is about branding, not justice. \\nMurray Bookchin excoriated the irrelevancy of a liberal class that busied itself with “the numbing quietude of the polling booth, the deadening platitudes of petition campaigns, car[-]bumper sloganeering, the contradictory rhetoric of manipulative politicians, the spectator sports of public rallies and finally, the knee-bent humble pleas for small reforms—in short the mere shadows of the direct action, embattled commitment, insurgent conflicts, and social idealism that marked every revolutionary project in history.” \\nHuman history, as Bookchin and Karl Marx understood, is defined by class struggle. America’s corporate elites successfully fused the two major political parties into a single corporate party, one that seized control of electoral politics, internal security, the judiciary, universities, the arts, finance and nearly all forms of popular communication, including Hollywood, public relations and the press. There is no way within the system to defy the demands of Wall Street, the fossil fuel industry or war profiteers. And Trump is about to remove whatever tepid restraints are left. \\nOswald Spengler in “The Decline of the West” predicted that, as Western democracies calcified and died, a class of “monied thugs,” people such as Trump, would replace the traditional political elites. Democracy would become a sham. Hatred would be fostered and fed to the masses to encourage them to tear themselves apart. \\nThe only route left is revolt. If this revolt is to succeed it must be expressed in the language of economic justice. A continuation of the language of multiculturalism and identity politics as our primary means of communication is self-defeating. It stokes the culture wars. It feeds the anti-politics that define the corporate state. \\n“The heirs of the New Left of the Sixties have created, within the academy, a cultural Left,” Richard Rorty wrote. “Many members of this Left specialize in what they call the ‘politics of difference’ or ‘of identity’ or‘of recognition.’ This cultural Left thinks more about stigma than about money, more about deep and hidden psychosexual motivations than about shallow and evident greed.” \\nOur enemy is not the white working poor any more than it is African-Americans, undocumented workers, Muslims, Latinos or members of the GBLT community. The oligarchs and corporations, many of them proponents of political correctness, are our enemy. If we shed our self-righteousness and hubris, if we speak to the pain and suffering of the working poor, we will unmask the toxins of bigotry and racism. We will turn the rage of an abandoned working class, no matter what its members’ color, race or religious creed, against those who deserve it. © 2016 TruthDig \\nChris Hedges writes a regular column for Truthdig.com . Hedges graduated from Harvard Divinity School and was for nearly two decades a foreign correspondent for The New York Times. He is the author of many books, including: War Is A Force That Gives Us Meaning , What Every Person Should Know About War , and American Fascists: The Christian Right and the War on America. His most recent book is Empire of Illusion: The End of Literacy and the Triumph of Spectacle . 4.0 ·'"}, "time": 1742628522.8325768}