{"duration": 0.06196260452270508, "input_args": {"text": "'Once called the world’s greatest purveyor of violence by Reverend Martin Luther King Jr., the US government has made a habit of issuing vapid self-serving and hypocritical statements about humanitarian crises all over the world.\\nIn some cases, a flack standing behind a government podium will give a boilerplate condemnation of the violence and horrors, while in many cases a simple press release will do.\\nSo it was the normal routine on Tuesday, when UN Ambassador Samantha Power issued another typical empty condemnation of the humanitarian crisis in Yemen, where thousands have been killed and thousands more are starving to death. But the bullshit did not stand long.\\nActivists immediately pointed out it was the government for which Power was speaking that was leading the slaughter, providing the very weapons the Saudis were using to bomb civilians and damage the food supply.\\nIn fact, it was a US-made bomb that Saudi Arabia used on a Doctors Without Borders hospita l in Northern Yemen in August that forced the organization to leave the country. The Saudis have targeted hospitals, schools, and other civilian targets in their brutal bombing campaign to destroy the Shiite Houthi rebels.\\nIn October, the Saudis even bombed a funeral, which an analysis by Shadowproof reveals happened just weeks after the US shipped hundreds of millions of dollars in weapons to Saudi Arabia.\\nAmong the weapons the Saudis have received from the US are the controversial CBU-105 Sensor Fuzed Weapon from Textron Systems of Wilmington, Massachusetts. The CBU-105 is a cluster bomb, which are banned by a large number of a countries for their lethality on civilians both during and after conflicts. Cluster munitions may detonate well after they are dropped, maiming and killing children and others.\\nSaudi Arabia received the weapons as part of one of the biggest arms deals in US history, negotiated by then-Secretary of State Hillary Clinton. Clinton completed the historic arms deal despite telling John Podesta in a private email that she knew Saudi Arabia was financing and arming ISIS. \\nThe Saudis appeared quite appreciative of Clinton’s work and even made millions of dollars worth of donations to Hillary Clinton’s favorite charity, the Clinton Foundation.\\nSo, yes, no one is going to take the US condemnations of Saudi war crimes in Yemen seriously when the US is knowingly supplying the weapons used to commit them. Ambassador Power can point her blood-soaked finger at herself.\\nThe post US Condemnation Of Yemen Slaughter Backfires As World Blames US appeared first on Shadowproof .\\n'"}, "time": 1742562492.0924523}