{"duration": 0.06575465202331543, "input_args": {"text": "'The NBC presidential forum on Wednesday night in Manhattan brought together the candidates Hillary Clinton and Donald J. Trump to try to determine who has the strength, preparation and presence of mind to lead during a time of crisis. It sure wasn’t Matt Lauer. In an event aboard the decommissioned aircraft carrier Intrepid, the “Today” host was lost at sea. Seemingly unprepared on military and foreign policy specifics, he performed like a soldier sent on a mission without ammunition, beginning with a disorganized offensive, ending in a humiliating retreat. Mr. Lauer interviewed the candidates in turn for a   each. He began by asking Mrs. Clinton to defend her use of a private email server as secretary of state. And asking again. And again. Roughly a third of his questioning dealt with the emails  —   a matter certainly connected to national security, but also a staple issue of this year’s   reporting. It suggested, as the rest of the forum confirmed, that Mr. Lauer was steadiest handling issues familiar to anyone with a passing knowledge of the morning politics headlines. That emphasis left relatively little time for the forum’s   and military subjects. Mr. Lauer and the audience asked about complex topics  —   the Middle East, terrorism, veterans’ affairs  —   and Mr. Lauer pressed for simple answers. “As briefly as you can,” he injected when an audience member asked how Mrs. Clinton would decide whether to deploy troops against the Islamic State. There’s a difference between an interviewer who has questions and one who has knowledge, and Mr. Lauer illustrated it. He seemed to be plowing through a checklist, not listening in the moment in a way that led to productive  . Short on time, he repeatedly interrupted Mrs. Clinton in a way he didn’t with Mr. Trump. (“Let me finish,” she protested at one point.) Candidates should expect to be challenged. They’re applying for a challenging job. But where Mr. Lauer treated Mrs. Clinton like someone running for president, he treated Mr. Trump like someone running to figure out how to be president, eventually. That interview was the apotheosis of this presidential campaign’s forced marriage of entertainment and news. The host of NBC’s morning show interviewed the former star of its reality show “The Apprentice,” and the whole thing played out as farce. Like Mrs. Clinton, Mr. Trump has had a few controversies related to the military. You might recall him feuding with a Gold Star family, or mocking Senator John McCain of Arizona for being captured in Vietnam, or likening his   attendance to military experience. Mr. Lauer evidently didn’t recall any of that. He kicked off by asking Mr. Trump what in his life had prepared him to be president, the kind of whiffle ball   question you ask the boss’s nephew you know you have to hire anyway. Mr. Lauer did press the Republican candidate on his claims of a “secret plan” to defeat the Islamic State and his repeated praise of Vladimir V. Putin, the president of Russia, leading Mr. Trump to cite the Russian authoritarian’s poll numbers and compare him favorably with President Obama. In general, though, Mr. Lauer’s questioning of Mr. Trump was like watching one student quiz another to prep for a test neither had done the reading for. The host asked soft   questions that invited the candidate to answer with word clouds. Mr. Lauer prefaced one question by saying that “nobody would expect you” to have read deeply into foreign policy before running for president. He asked Mr. Trump if he would be “prepared on Day 1,” a    question that will elicit only one answer from any candidate not about to drop out. Most egregiously, Mr. Lauer allowed Mr. Trump to repeat, unchallenged, the false claim that he had opposed the war in Iraq when, as reported by BuzzFeed, he supported the invasion on record in 2002. Any minimally prepared interviewer would have been ready for that claim, even if Mrs. Clinton had not earlier rebutted it in front of Mr. Lauer’s face. NBC News has a vast staff of anchors and reporters. Why turn over the grilling to a guy who had a hard enough time questioning Ryan Lochte? Giving a showcase to your top morning host works only if you’re showcasing something the host does well. Maybe the thinking was that Mr. Lauer would have sufficient training wheels in a format that wasn’t a debate. In fact, he asked each candidate not to attack the other in answers, an absurd request that neither one followed anyway. (Though again, Mr. Lauer criticized only Mrs. Clinton for it.) But the forum was a sort of introductory skirmish before the debates. It gave the candidates a chance to practice, to scout each other  —   and above all, to test the current news media waters, to see how willing a network anchor is to challenge and correct. Mr. Lauer, fortunately, is not going to moderate a presidential debate. But Fox News’s Chris Wallace is, and he recently said that he did not consider it his job to   candidates as a moderator. Let’s not mistake who this helps most: the   website PolitiFact has found far more false statements from Mr. Trump than from Mrs. Clinton. Why would a journalist be allergic to verifying the truth? On an MSNBC panel, Chris Matthews guessed that Mr. Lauer didn’t correct Mr. Trump on Iraq because of perceptions. “You have to call the guy a liar when you do that,” he said. “That’s the difficult thing for a Matt Lauer to do, because it sounds like an opinion. ” But it’s not. When a candidate says he didn’t say something that he did, that’s a matter of fact. Here’s what an opinion looks like: It’s a travesty to be steamrollered by a candidate because you’re worried that doing your job will look bad. To put it in military terms, weakness is an invitation to attack. Going into the debates, what we saw at NBC’s forum should make you very, very worried about our first line of defense.'"}, "time": 1742628583.926843}