{"duration": 0.05758047103881836, "input_args": {"text": "'TOKYO  —   Defense Secretary Jim Mattis assured Japan’s prime minister on Friday that the United States would stand by its mutual defense treaty with the country, despite statements by President Trump during last year’s campaign that suggested he might pull back from American security commitments in Asia. “I want there to be no misunderstanding during the transition in Washington that we stand firmly, 100 percent, shoulder to shoulder with you and the Japanese people,” Mr. Mattis said at the start of a meeting with Prime Minister Shinzo Abe. Mr. Trump, when he was running for president, had complained that the defense treaty was   even suggesting that the United States should threaten to withdraw from it unless Japan did more to compensate Washington for helping to defend its territory. “You always have to be prepared to walk,” Mr. Trump said in August. “I don’t think it’s going to be necessary. It could be, though. ” With North Korea threatening to test an intercontinental ballistic missile and China claiming sovereignty over nearly all of the South China Sea, the Trump administration is now emphasizing its “ironclad” commitment to the security of Japan and South Korea. Still, Mr. Trump’s conflicting signals and his transactional approach to diplomacy have made allies nervous. So even as the president shakes up Washington, Mr. Mattis has scored points in Asia by emphasizing that the United States’ relationship with its allies has not fundamentally changed. In Japan, that included assurances about Article 5 of the treaty, which commits the United States to helping defend territory that Japan administers should it be attacked. “Due to some of the provocations out of North Korea and other challenges that we jointly face, I want to make certain that Article 5 of our mutual defense treaty is understood to be as real to us today as it was a year ago, five years ago, and as it will be a year and 10 years from now,” Mr. Mattis told Mr. Abe. Japan hosts about 50, 000 American troops on bases throughout the country, and it relies on the American nuclear umbrella. Given that the alliance has lasted since the end of World War II, analysts said it was somewhat surprising that it would be necessary to reassure Japan that it remained solid. “It’s sad that we’ve even come to this point,” said Jeffrey Hornung, a fellow in the security and foreign affairs program at Sasakawa Peace Foundation USA, a research institute based in Washington. “But in the context that we’re in, that reassurance is very important. ” A particular concern for Mr. Abe, who is scheduled to meet with Mr. Trump in Washington next week, is confirmation that the United States would defend Japan in any confrontation with China over a set of disputed islands in the East China Sea, known in Japan as the Senkaku and in China as the Diaoyu. Former President Barack Obama declared during a visit to Tokyo three years ago that the security treaty obligated the United States to do so, the first president to state that commitment publicly. Mr. Mattis did not explicitly mention the islands publicly Friday, but American officials said later that he had reiterated the United States “longstanding” position on the islands in his private meeting with Mr. Abe. Mr. Mattis made a point of saying on Friday that he had served on the Japanese island of Okinawa as a young Marine. Mr. Abe, for his part, said it was important that Japan was one of the first places Mr. Mattis had visited as defense secretary. Earlier Friday, Mr. Mattis wound up a   visit to Seoul, South Korea, where he sought to reassure officials that the American commitment to defend their country, particularly in the face of North Korea’s accelerating nuclear threat, was also unchanged. “Any attack on the United States, or our allies, will be defeated,” Mr. Mattis said in a joint appearance with the South Korean defense minister, Han  . “And any use of nuclear weapons would be met with a response that would be effective and overwhelming,” he added, using a formulation that has been employed by previous Pentagon chiefs. During Mr. Mattis’s talks with South Korean officials, the two sides affirmed that they would move ahead with plans developed under the Obama administration to deploy a new antimissile system to counter North Korea’s   missiles. China has objected to the deployment of the system, known as Thaad, which stands for Terminal High Altitude Area Defense. “Due to North Korea’s threatening rhetoric and destabilizing behavior, we are taking defensive steps like deploying the highly effective Thaad antimissile unit,” Mr. Mattis said on Friday. Mr. Mattis did not specify when the Thaad system would be deployed. American and South Korean officials have said that it would be before the end of the year, though American officials would like to see the timetable accelerated.'"}, "time": 1742628522.1895998}