{"duration": 0.031769514083862305, "input_args": {"text": "'  DCG | 2 Comments \\nRules are for little people. \\nFrom Daily Mail : Hillary Clinton did not disclose ‘expensive gifts,’ free vacations, and complimentary private jet travel her family received from business interests while she was at the State Department, according to leaked emails and federal disclosure records reviewed by the DailyMail.com. \\nLong-time Clinton aide Doug Band claimed in a confidential 2011 memo published by Wikileaks this week that he helped obtain free vacations and personal travel for Bill Clinton and his family as part of his duties. \\nDuring Hillary Clinton’s tenure at the State Department, she did not report any gifts or travel reimbursements for herself or her spouse in her financial disclosure filings. \\n‘In support of the President’s for-profit activity, we also have solicited and obtained, as appropriate, in-kind services for the President and his family – for personal travel, hospitality, vacation and the like,’ wrote Band in the Nov. 16, 2011 memo to attorneys conducting an internal review of the Clinton Foundation. \\nHe added that his job involved ‘supporting [Bill Clinton’s] family/personal needs (e.g., securing in-kind private airplane travel, in-kind vacation stays, and supporting family business and personal needs).’ \\nThe memo did not say whether Hillary Clinton was one of Bill Clinton’s family members who received vacations, gifts, or personal travel. Band did not respond to request for comment. \\nIn November 2011, according to the memo, the telecommunications company Ericsson agreed to give Bill Clinton $400,000 in private plane travel. The company also paid the former president an additional $750,000 to speak at its conference that month in Hong Kong. \\nIt was the largest speaking fee Bill Clinton had received up until that point, and with the added plane fare, the payment reached well over $1 million. \\nAlthough Hillary Clinton reported in her disclosure filings that her husband received a $750,000 honorarium for the speech, she did not disclose the additional $400,000 in private plane expenses from Ericsson in the spousal income or gifts and reimbursements sections . \\nIn another Nov. 17, 2011 email, Band complained that Bill Clinton was not required to submit an internal conflict-of-interest disclosure form – unlike other top officials at the Clinton Global Initiative – despite the fact that the former president received ‘expensive gifts’ for his home from CGI sponsors . Bill Clinton and Doug Band \\nBill Clinton ‘does not have to sign such a document even though he is personally paid by 3 CGI sponsors, gets many expensive gifts from them, some that are at home etc,’ wrote Band. \\nHillary Clinton did not disclose any gift or travel expenses that she or her husband received while at the State Department. The federal disclosure form requires officials to report gifts to themselves or a spouse totalling more than $350 from a single source, such as ‘tangible items, transportation, lodging, food, or entertainment’ and ‘travel-related cash reimbursements.’ \\nHowever, a federal official does not have to disclose gifts to a spouse that are ‘totally independent of their relationship’ – for example, business-related benefits that a spouse receives from his employer. While many of the companies involved in CGI and Bill Clinton’s for-profit business had interests before the State Department, government ethics experts said it can be difficult to determine whether a gift to a public official’s spouse is connected to their relationship . \\nIt is also unclear whether Hillary Clinton travelled on any of these ‘personal trips’ and ‘in-kind vacations,’ which Band wrote were given to Bill Clinton’s ‘family.’ The Clintons have a 36-year-old daughter, Chelsea, who is also involved in the Clinton Foundation. \\nA spokesperson for Clinton’s campaign did not respond to request for comment. \\nAccording to the National Legal and Policy Center, a government watchdog group, failure to report certain gifts in a financial disclosure form could violate the Ethics in Government Act or the Federal False Statements Act. \\nFederal laws ‘require full disclosure of such expensive gifts and reimbursements when special interests use a spouse to target a government official,’ said Ken Boehm, chairman of the NLPC. \\n‘The just-disclosed emails of Clinton associate Doug Band that Bill Clinton and his family members benefitted from hundreds of thousands of dollars in free travel and gifts from special interests while Hillary Clinton was Secretary of State raises substantial ethical and legal issues because the Financial Disclosure reports filed by Secretary Clinton does not show these expensive gifts and reimbursements,’ said Boehm. \\nDCG'"}, "time": 1742628502.7280128}