{"duration": 0.049704551696777344, "input_args": {"text": "'Several Hollywood celebrities came to Stephen Colbert’s defense this week after the Late Show host sparked a social media firestorm when he made what some critics called a homophobic and vitriolic joke about President Donald Trump during a broadcast. [“The only thing your mouth is good for is being Vladimir Putin’s c*ck holster,” Colbert said during his monologue on Monday night’s Late Show, during which he also called the president a “ ” and a “ . ”  The joke elicited    laughs from Colbert’s studio audience but the real reaction came later on social media, as thousands of viewers demanded that CBS penalize the   host for what they said was an   attack on the president, and the hashtag #FireColbert became a trending topic on Twitter. Still, some celebrities leapt to the   host’s defense, including Star Trek actor George Takei, comedian Patton Oswalt, and actress Rosie O’Donnell. “Now the little right wing mushrooms want to #FireColbert because he made fun of the Troll King. Waaaa! It’ll go as well as #BoycottHamilton,” Takei wrote on Twitter Wednesday, appearing to refer to the social media outrage that enveloped the Broadway show Hamilton when the cast lectured Vice President Mike Pence from the stage during a performance in November. Now the little right wing mushrooms want to #FireColbert because he made fun of the Troll King. Waaaa! It’ll go as well as #BoycottHamilton.  —   George Takei (@GeorgeTakei) May 3, 2017,  Meanwhile, Oswalt tweeted that he wished he had thought of the “hilarious” phrase before Colbert did, while O’Donnell used the hashtag “#GiveColbertARaise. ” #CancelColbert for coming up with the hilarious phrase ”cock holster” before I did.  —   Patton Oswalt (@pattonoswalt) May 3, 2017,  cause he is slaying it nightly #giveCOLBERTaRAISE https:  .   —   ROSIE (@Rosie) May 3, 2017,  Actor Mark Ruffalo also appeared to lend his support to the embattled host by   several messages Wednesday, including one that urged fellow users to make “#GiveColbertARaise” a trending topic.    The supportive messages from celebrities come as both Colbert and CBS have remained silent on the controversy and social media campaign. Neither the   host nor the network had issued a public statement as of Wednesday evening, and representatives for CBS did not immediately return Breitbart News’ request for comment. On Wednesday, CBS announced that the May 9 episode of The Late Show would reunite the stars of Comedy Central’s Daily Show, on which Colbert got his start. Jon Stewart, Samantha Bee, John Oliver, Rob Corddry and Ed Helms are set as guests for the episode.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628347.665282}