{"duration": 0.13648343086242676, "input_args": {"text": "'WASHINGTON  —   It is an iconic photograph of American patriotism, depicting the heroism of service members raising the flag over Iwo Jima during World War II, which inspired the book and movie “Flags of Our Fathers. ” But while the image has become a symbol of the sacrifices of American troops, the Marine Corps has also had to defend it for 70 years against accusations that it was staged and that some of the men were misidentified. Now, the man who wrote the   book, which chronicled how his father and five Marines came together to lift the flag in the famous photograph, has raised new doubts about the image, saying that he now believes his father is not actually in it. The author, James Bradley, revealed his conclusion in an interview on Tuesday, just days after the Marine Corps said that it had opened an inquiry into whether the identifications in the photograph were correct. He said that his father, John, a Navy corpsman, had participated in raising a flag on Iwo Jima on Feb. 23, 1945, but had not taken part in another   the same day, which became the famous photograph. His father, he said, probably thought that the first   was the one that was captured in the famous picture taken by Joe Rosenthal, a photographer for The Associated Press. Mr. Bradley’s doubts tell a story about the fog of war, the efforts of a son to memorialize his father and the apparent willingness of the Marines to at first brush aside questions about one of their most historic moments. Mr. Bradley said he had become convinced that his father was not in the photograph after studying evidence that was published in a 2014 article in The Omaha   which described doubts raised by amateur historians who compared that photograph to images of the first  . They found that the pants, headgear and cartridge belt on the Navy corpsman identified as John Bradley were different from the gear he wore that day. Mr. Bradley said he had waited a year to examine the evidence in the newspaper article because he was working on a new book in Vietnam, and then became ill. He did not come forward with his belief that his father was not in the photograph, he said, because there was little interest from the news media and the Marines. “It wasn’t top of mind,” Mr. Bradley said in the interview. “It wasn’t a priority. I was overseas, and this past fall I was recovering from a disease I got in New Guinea that almost killed me. Now there’s interest in this, and I’m talking about it. I didn’t have the energy to carry the water all by myself. ” The photograph, taken during one of the bloodiest battles of the war, was splashed across the front pages of newspapers throughout the country less than 48 hours after it was taken, exceptionally fast for the time. It was an immediate source of patriotism and controversy. President Harry S. Truman used it to sell bonds to fund the war, and Mr. Rosenthal brushed back accusations that it had been staged. And two years after the image was taken, one of the men identified as being in it hitchhiked to Texas from Arizona to tell the family of a man who died on Iwo Jima that the man had been incorrectly named as one of those depicted. That spurred a congressional investigation that led the military to acknowledge that it had misidentified one of the men. “Flags of Our Fathers,” first published in 2000, was on   lists for nearly a year. It was later made into a movie directed by Clint Eastwood. The photograph was also the inspiration for the Marine Corps War Memorial in Arlington, Va. a statue in which six    figures are depicted in the positions captured by Mr. Rosenthal. Mr. Bradley said that his father had met with the sculptor of the memorial, who based some of the figures on his body. All of the men identified in the photograph are dead. Three of the men died fighting the Japanese on Iwo Jima. John Bradley died in 1994. The 2014 article in the Omaha newspaper detailed how Stephen Foley, a man in Ireland who worked at a building supply company, and Eric Krelle, an   historian, had concluded that Mr. Bradley was misidentified after poring over the images and studying uniforms worn on the island. At the time, however, the Marines and James Bradley discounted the research. “Listen, I wrote the book based on facts told to me by guys who had actually been there,” Mr. Bradley was quoted saying in the article. “That’s my research. That’s what I trust. ” He added: “At the end of the day, the truth is the truth. Everything is possible. But really?” The Marines said at the time that they “firmly” stood by the established accounts of who was in the photograph. Last year, Dustin Spence, a historian from California who made a documentary about the   and Mr. Foley approached the Marines with findings that they said showed problems with the identifications, Mr. Spence said in a telephone interview. The Marines, Mr. Spence said, did not seriously look into their claims. “I believe it’s something difficult for some in the Marine Corps to swallow,” Mr. Spence said. The Smithsonian Channel said it had gone to the Marines after “months of thorough, scientific analysis” and had since been working closely with the service. It added that it would broadcast the findings this year. The Marine Corps acknowledged the inquiry in a statement, but provided few details. ”Our history is important to us, and even today, this iconic image still represents the fighting spirit of Marines and is a symbol of the tremendous accomplishments of our corps,” the Marines said. “As such, with the information and research provided by the Smithsonian Channel, who used advanced digital technology to examine battle footage, the Marine Corps decided to review their photo enhancements, film analysis and findings. ” It added, “Joe Rosenthal’s photo captured a single moment in the   battle during which more than 6, 500 U. S. servicemen made the ultimate sacrifice, and it is representative of the more than 70, 000 U. S. Marines, sailors, soldiers and Coast Guardsmen that contributed to the battle. ” A summary on the paperback edition of “Flags of Our Fathers” reads: “Here is the true story behind the six flag raisers and the immortal photograph that came to symbolize the power and courage of America during World War II. In ‘Flags of Our Fathers,’ the son of one of the flag raisers captures the glory, the heartbreak, and the legacy of the six ordinary boys who came together at a crucial moment in one of history’s bloodiest battles  —   and lifted the heart and spirit of a nation at war. ”'"}, "time": 1742564174.930094}