{"duration": 0.03204989433288574, "input_args": {"text": "'\\nNo parent ever wants to find out that their child is sexting. \\nBut if happens, how far is too far when it comes to teaching them a lesson? \\nLast week, a 13-year-old girl from Riverside, California, could be seen “bawling her eyes out” on the corner of a busy intersection as she held a handwritten sign that read: \\n“I\\'m 13 and I ask for d*ck pics.” Image Credit: Screenshot/ NBC LA \\nAccording to NBC LA, the teen was forced to be publicly humiliated by her parents after they found out she was sexting. \\nWitnesses said the teen had been standing near the busy street for hours while her mother kept watch from a nearby car. \\nThe teen had to hold the sign up for so long, in fact, that local resident, Krista Wilson, called the police to complain about possible child abuse : \\nWilson also stated that as people drove by the teen, she could see \"tears running down her face,” while “grown men were reading it [the sign] and laughing.” \\nWilson wasn\\'t the only person who complained. \\nA witness snapped a photo of the girl then posted it to a Facebook news page and, in no time, it received countless views and comments. \\nMany were completely outraged by the parents\\' actions: \\n“This is so horrific! That poor little girl; she is 13! This is NOT the way to teach a child appropriate behaviour. She is a product of a hyper-sexual culture and doesn\\'t deserve public humiliation like this. I\\'d be surprised if this doesn\\'t contribute to actual trauma.” \\nWhile another wrote: \\n“It certainly was a teachable moment, instead her so called parents have shamed her. 13 is such an impressionable age for self esteem and the like. Way to go crappy parents ????” \\nOne commenter simply said: \\n“Exploitation and abuse.” \\nOn the other hand, there were those who defended the mother\\'s punishment, stating that something worse could have happened if the child\\'s sexting continued: \\n“I\\'m with the mom! Great job all the people who say oh it\\'s bullying and etc etc get over it! This girl was being taught a lesson. Most parents don\\'t give two shits these days what their kids are doing. I don\\'t care about all the haters either. GOOD JOB MOM!!! Keep up the good work.” \\nAnother supporter of the parents\\' decision said: \\n“Stop judging the parents, they are doing what they feel is the best course of action given the situation! If the teenager wasn\\'t embarrassed to show her body and ask for the same in return, than she shouldn\\'t be embarrassed for the punishment her parents gave her either!” \\nAnother suggested this could have been the last straw for the parents: \\n“Maybe the parents tried a different approach and Lil kid tryna to be grown didn\\'t learn so now shes learned the hard, embarrassing way.” \\nDuring the incident, police did arrive on scene to assess the situation. \\nThey spoke to the mother and concluded that the punishment, while extreme, was not enough to warrant child abuse charges. \\nSo far, no legal action has been taken against the mother. However, it has been reported that a social worker would be contacting the mother to help her with parenting strategies. '"}, "time": 1742628605.4173727}