{"duration": 0.04179644584655762, "input_args": {"text": "'In a telegram to Egyptian President Abdel Fattah   Pope Francis denounced Friday’s Ramadan massacre of Egyptian Christians while promising continued prayers for the victims, their families, and the entire nation. [The strongly worded message, signed by the Vatican’s secretary of state on behalf of the Pope, called the slaughter a “senseless act of hatred” and a “violent outrage,” resulting in “tragic loss of life and injury. ”  While expressing his “heartfelt solidarity” with all those affected by the attack, Francis said he was particularly mindful of the children who lost their lives when masked gunmen opened fire on a busload of Christian pilgrims on their way to the Monastery of St. Stephen in the Minya province south of Cairo on Friday morning. Commending “the souls of the deceased to the mercy of the Almighty,” the Pope also assured their grieving families and all who have been injured of his “ardent prayers” while pledging his “continued intercession for peace and reconciliation throughout the nation. ” On Saturday morning, the Pope traveled to Genoa, Italy, for a pastoral visit and opened his meeting with bishops, priests, and the religious with a moment of silence and a Hail Mary for the Christians murdered in Minya: #PopeFrancis begins Genoa mtg with bps, priests, religious with moment of silence  Hail Mary for Christians murdered in Egypt pic. twitter.   —   Cindy Wooden (@Cindy_Wooden) May 27, 2017,  Pope Francis visited Cairo in late April, shortly after twin suicide bombings by Islamic State militants took the lives of at least 46 Egyptian Christians who were celebrating Mass in two churches in the Minya province on Palm Sunday, a week before Easter. The pontiff took the occasion to condemn the attacks, repeating his statement that killing in the name of God is blasphemy. “Let us say once more a firm and clear ‘No!’ to every form of violence, vengeance and hatred carried out in the name of religion or in the name of God,” the Pope told a peace conference meeting at the   university, Egypt’s highest Islamic authority. The Minya province has the highest Coptic Christian population in the country and has been the scene of a number of attacks on the Christian minority. Christians in Minya have lived in constant fear of attacks from the area’s large Salafi Muslim population. In certain local villages, the faithful celebrate Mass before a cross drawn on a wall, making it easy to erase quickly to avoid attacks. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742563957.5054026}