{"duration": 0.06652593612670898, "input_args": {"text": "'  Sean Adl-Tabatabai in News , World // 0 Comments \\nA disturbing new report suggests that over two-thirds of wild animals living on Earth are set to become extinct by the year 2020. \\nThe comprehensive report by the WWF and Zoological Society of London says animal populations across the globe will continue to plummet by 67% by 2020 due to a mass extinction that is killing the natural world. \\nThegaurdian.com reports: \\nThe creatures being lost range from mountains to forests to rivers and the seas and include well-known endangered species such as elephants and gorillas and lesser known creatures such as vultures and salamanders. \\nThe collapse of wildlife is, with climate change, the most striking sign of the Anthropocene, a proposed new geological era in which humans dominate the planet. “We are no longer a small world on a big planet. We are now a big world on a small planet, where we have reached a saturation point,” said Prof Johan Rockström, executive director of the Stockholm Resilience Centre, in a foreword for the report. \\nMarco Lambertini, director general of WWF, said: “The richness and diversity of life on Earth is fundamental to the complex life systems that underpin it. Life supports life itself and we are part of the same equation. Lose biodiversity and the natural world and the life support systems, as we know them today, will collapse.” \\nHe said humanity was completely dependent on nature for clean air and water, food and materials, as well as inspiration and happiness. \\nThe report analysed the changing abundance of more than 14,000 monitored populations of the 3,700 vertebrate species for which good data is available. This produced a measure akin to a stock market index that indicates the state of the world’s 64,000 animal species and is used by scientists to measure the progress of conservation efforts. \\nThe biggest cause of tumbling animal numbers is the destruction of wild areas for farming and logging: the majority of the Earth’s land area has now been impacted by humans, with just 15% protected for nature. Poaching and exploitation for food is another major factor, due to unsustainable fishing and hunting: more than300 mammal species are being eaten into extinction, according to recent research. \\nPollution is also a significant problem with, for example, killer whales and dolphins in European seas being seriously harmed by long-lived industrial pollutants. Vultures in south-east Asia have been decimated over the last 20 years, dying after eating the carcasses of cattle dosed with an anti-inflammatory drug. Amphibians have suffered one of thegreatest declines of all animals due to a fungal disease thought to be spread around the world by the trade in frogs and newts. \\nRivers and lakes are the hardest hit habitats, with animals populations down by 81% since 1970, due to excessive water extraction, pollution and dams. All the pressures are magnified by global warming, which shifts the ranges in which animals are able to live, said WWF’s director of science, Mike Barrett. \\nSome researchers have reservations about the report’s approach, which summarises many different studies into a headline number. “It is broadly right, but the whole is less than the sum of the parts,” said Prof Stuart Pimm, at Duke University in the US, adding that looking at particular groups, such as birds, is more precise. \\nThe report warns that losses of wildlife will impact on people and could even provoke conflicts: “Increased human pressure threatens the natural resources that humanity depends upon, increasing the risk of water and food insecurity and competition over natural resources.” \\nHowever, some species are starting to recover, suggesting swift action could tackle the crisis. Tiger numbers are thought to be increasing and the giant panda has recently been removed from the list of endangered species. \\nIn Europe, protection of the habitat of the Eurasian lynx and controls on hunting have seen its population rise fivefold since the 1960s. A recent global wildlife summit also introduced new protection for pangolins, the world’s most trafficked mammals, and rosewoods, the most trafficked wild product of all. \\nBut stemming the overall losses of animals and habitats requires systemic change in how society consumes resources, said Barrett. People can choose to eat less meat, which is often fed on grain grown on deforested land, and businesses should ensure their supply chains, such as for timber, are sustainable, he said. \\n“You’d like to think that was a no-brainer in that if a business is consuming the raw materials for its products in a way that is not sustainable, then inevitably it will eventually put itself out of business,” Barrett said. Politicians must also ensure all their policies – not just environmental ones – are sustainable, he added. \\n“The report is certainly a pretty shocking snapshot of where we are,” said Barrett. “My hope though is that we don’t throw our hands up in despair – there is no time for despair, we have to crack on and act. I do remain convinced we can find our sustainable course through the Anthropocene, but the will has to be there to do it.”'"}, "time": 1742561884.2861626}