{"duration": 0.03770136833190918, "input_args": {"text": "'Physicist, cosmologist, and author Stephen Hawking has predicted that mankind will have to populate another planet within 100 years to survive. [Hawking made the prediction in an upcoming documentary titled Expedition New Earth, which the BBC has teased with Hawking’s comments.  “Professor Stephen Hawking thinks the human species will have to populate a new planet within 100 years if it is to survive,” reiterated the BBC in a statement. “With climate change, overdue asteroid strikes, epidemics and population growth, our own planet is increasingly precarious. ” Hawking has become known for his futurist predictions, in 2014 he also claimed that “the development of full artificial intelligence could spell the end of the human race. ” Michael Guillen Ph. D. a former science editor for ABC News, disputed Hawking’s prediction in an article for Fox News, claiming that the author has “become a    celebrity, who’s flung off the chains of academic rigor to make sensational pronouncements. ” “Does Stephen really expect to be taken seriously? I doubt it,” Guillen proclaimed. “Despite everything, he is too smart for that. My impression is he’s become the Donald Trump of science, given to saying outrageous things for the fun of it and to attract attention. ” “Apart from being spectacularly unscientific, his prophecy is also wrongheaded,” he continued. “Hawking says we ought to escape to Mars. Interestingly, some scientists think   once lived on the Red Planet. But a global catastrophe produced what we see today, a moribund world lacking a thick,   atmosphere  —   wanting for greenhouse gases, such as carbon dioxide, to keep warm. ” Guillen added that “Winter temperatures can dip below minus 195 degrees Fahrenheit and summer temperatures barely reach 70 degrees,” before declaring that “for the adventure, I’d go to Mars this minute. But for refuge? !” “No thanks, Stephen. I’m not giving up on Earth,” he concluded. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564534.5807323}