{"duration": 0.016071319580078125, "input_args": {"text": "'World’s tallest church being eroded by urinating revellers  14 Get short URL The church is the tallest in the world. © akinchelow / Instagram The 162m tall Ulm Minster church in Germany isn’t just attracting people answering the call of God but also those answering the call of nature and it’s now contributing to the erosion of its sandstone base. \\nIncreased patrols and fines have failed to stop those who use the landmark as a meeting point and to urinate on the base of the church. The urine’s acid and salts has contributed to the erosion of its sandstone base, according to the Südwest Presse . A photo posted by Zara :] (@osnapitszara) on Oct 15, 2012 at 5:50pm PDT There are 768 steps to the top of the Ulm Minister, but the views from above are worth the climb! #GermanTownTuesday pic.twitter.com/Hn6DUutcun — German Embassy (@GermanyinUSA) June 21, 2016 \\n\"I\\'ve been keeping an eye on it for half a year now and, once again, it\\'s coated with urine and vomit\" the church’s head of maintenance Michael Hilbert told the Presse. Hilbert said he does not want to be known as the “pee police” but that the issue “is about preserving law and order.\" \\nFines for public urination have doubled to €100 but this has done little to stem the practice. \\nLocated at the popular Münsterplatz, the church will probably see an increase in those needing to relieve themselves next month as a wine festival and Christmas markets land on its doorstep. Hilbert said free toilets are needed in the area to help prevent further deterioration of the church\\'s base because of the urination on the church. \\nDuring the town’s holiday of Schwörmontag this year, the southern part of the church was closed off to the public in an effort to prevent the offence, but this failed to make much of an impact according to one city spokeswoman. \\n“As long as there are people” the problem will persist, she told the Presse, admitting that public urinators had proved elusive,with virtually none of the perpetrators caught in the act. \\nThe Lutheran church is the tallest church in the world and the fourth tallest structure built prior to the 20th century, making it one very large tree to pee on.'"}, "time": 1742628553.4834266}