{"duration": 0.14618277549743652, "input_args": {"text": "'NTEB Ads Privacy Policy How Donald Trump Moving The U.S. Embassy From Tel Aviv To Jerusalem Could Trigger The Psalm 83 War God is concerned with His nation of Israel and with His chosen people, the Jews. In the third chapter of Joel, we read that God wages the Battle of Armageddon because people have divided up Israel, a place that He calls \"my land\". by Geoffrey Grider November 18, 2016 In the third chapter of Joel, we read that God wages the Battle of Armageddon because people have divided up Israel, a place that He calls “my land” \\n“They have said, Come, and let us cut them off from being a nation; that the name of Israel may be no more in remembrance.” Psalm 83:4 (KJV) \\nOne of Donald Trump’s main campaign promises is that he would move the U.S. Embassy from its currents location in Tel Aviv, Israel, to the Old City Israeli capital of Jerusalem. See for yourself how the massive AIPAC audience erupted in frenzied cheers when he said it: \\nMost people , unsaved people, honestly probably didn’t even bat an eye when he said as most people don’t really care about what happens in tiny, little Israel. But to the Bible believing Christian, those words rang out with a clarion call that something really big just appeared on the end times prophecy radar. Back on October 28, 2016, the headline over on jpost.com was “ Ivanka Trump Says Her Father Will Move US Embassy To Jerusalem ‘100%’ If Elected “. \\nI truly hope that President Trump will make America great again, I really do. But if you think for one moment that that’s why God allowed him to be elected you are deceiving yourself. God is not concerned so much with America, He really isn’t. God is concerned with His nation of Israel and with His chosen people, the Jews. In the third chapter of Joel, we read that God wages the Battle of Armageddon because people have divided up Israel, a place that He calls “my land”. Read it for yourself: \\n“I will also gather all nations, and will bring them down into the valley of Jehoshaphat, and will plead with them there for my people and for my heritage Israel, whom they have scattered among the nations, and parted my land.” Joel 3:2 (KJV) The reason why the Palestinian continue to reject the Two State Solution \\nMultiple times a “two state solution” has been offered to the Palestinian people, and every time it is offered they reject it. Why? Because in the Two State Solution, Jerusalem stays with Israel as it rightly should and infuriates the Palestinians. When Lucifer fell in Isaiah 14, it was because he was no longer satisfied with the good things that God had given him, he wanted it all. Lucifer wanted to sit in God’s Seat and replace God: \\n“For thou hast said in thine heart, I will ascend into heaven, I will exalt my throne above the stars of God: I will sit also upon the mount of the congregation, in the sides of the north: I will ascend above the heights of the clouds; I will be like the most High. Yet thou shalt be brought down to hell, to the sides of the pit.” Isaiah 14:13-15 (KJV) \\nNow that you know that , can you see why there is coming such a fierce battle over Jerusalem? Because Jerusalem is God’s Holy Place, the Bible calls it the “city of the great King”. Why? Because it will be to Jerusalem that Jesus will return to as King of Kings and will rule with a “rod of iron” over the nations. That’s why. The coming battles that will take place there will be fought through humans, but it is actually a battle between God and the Devil. So now let’s take a look at Psalm 83, there is a war mentioned there connected with the time of Jacob’s trouble . \\n“For they have consulted together with one consent: they are confederate against thee: The tabernacles of Edom, and the Ishmaelites; of Moab, and the Hagarenes; Gebal, and Ammon, and Amalek; the Philistines with the inhabitants of Tyre; Assur also is joined with them: they have holpen the children of Lot. Selah.” Psalm 83:5-8 (KJV) \\nLook at all the nations that surround Israel to attack her , what do they all have in common? They are Muslim nations! Look at a Google map of Israel and you will see that in 2016 Israel is 100% surrounded by 100% Muslim nations. See the word Selah at the end of verse 8? That little clue tells us that the Psalm 83 War is connected with the time of Jacob’s trouble. (please read our article entitled “ THE REAL MEANING OF THE WORD SELAH IN THE BIBLE ” for further insight on this issue.) THE BIBLE BELIEVERS GUIDE TO UNDERSTANDING THE DIFFERENCES BETWEEN THE RAPTURE AND THE SECOND COMING \\nWhen Donald Trump moves the Embassy to Jerusalem , thus declaring that the United States recognizes it as Israel’s capital, the entire Arab world will go crazy. We believe it is not only possible but probable that this will trigger, at some point, the Psalm 83 War. But if we are that close to that, we are even this much closer to this: The Rapture of the Church must come first \\nWhat part of the time of Jacob’s trouble will the Church be involved in? None of it. Why? Because it is the time of (write this on the chalkboard 100 times) Jacob’s trouble. It has nothing to do with the church. Putting the Church of Jesus Christ into the time of Jacob’s trouble – Israel’s trouble – is nothing more than bad, old-fashioned replacement theology . If that offends you because you put the Church in Matthew 24 where it doesn’t belong, then guess what? Be offended. Because stealing any of Israel’s promises, including the negative ones, is replacement theology. \\nIf we are really this close to the time of Jacob’s trouble and the Psalm 83 War, then we are really, really close to the time of the Pretribulation Rapture of the Church . A sobering thought, isn’t it? Donald Trump’s miracle win was really just that – a miracle. But it was a miracle with a purpose , to accomplish God’s will and plan in these end times. We have been saying this to anyone who will listen for well over a year now. \\nHave you ever stopped to consider the physical structure of the word ‘Jerusalem’? Take a closer look – Jer USA lem. Now what do you see? \\nFor the Bible believer and prophecy watcher , we are most certainly living in exciting times. Perhaps the most exciting since May 14, 1948 . \\nAre YOU ready for what comes next? Mere minutes after posting this article, the UK Daily Mail published this: The two-time White House hopeful, former Fox New Channel weekend host and former governor of Arkansas will be America’s next ambassador to Israel, a presidential transition official confirmed to DailyMail.com on Friday. He is scheduled to meet with President-Elect Donald Trump Friday at 2:00 p.m. Huckabee, an ordained Baptist preacher and electric bass player, will become the tip of Trump’s spear as he seeks to shake up U.S. foreign relations in the Middle East, beginning with relocating America’s embassy in Israel from Tel Aviv to Jerusalem. ‘That’s going to happen,’ the transition official said. ‘Governor Huckabee is going to see it through.’ source SHARE THIS ARTICLE  '"}, "time": 1742563207.7879527}