{"duration": 0.10175585746765137, "input_args": {"text": "'JERUSALEM  —   For three hours, Prime Minister Benjamin Netanyahu of Israel held forth on all sorts of topics  —   on Israel and the Middle East, on his record and on his plans. One subject that Mr. Netanyahu studiously avoided in his expansive conversation with American visitors last weekend, though, was the United States election. Much of the rest of the world is absorbed by the contest between Donald J. Trump and Hillary Clinton, but it is a topic Mr. Netanyahu will not touch. Four years after he was accused of meddling in the American election on behalf of President Obama’s opponent, the hardly bashful Israeli leader this time has taken a virtual vow of silence. The unusual reluctance comes after years of toxic relations between him and Mr. Obama, culminating in an acrid public feud over the   nuclear agreement with Iran. With Mr. Netanyahu seemingly aligning himself during that fight with Mr. Obama’s Republican critics, some Israel backers feared the country was squandering its traditional bipartisan support. The prime minister now seems intent on extricating himself from the partisan tussle. “Everybody understands here in Israel that the most important thing for us is to go back to where we were for the last 68 years, which is bipartisan,” said Yair Lapid, a centrist party leader who hopes to succeed Mr. Netanyahu. “This is why nobody will take sides in a presidential campaign. ” But if Israel is staying away from the American campaign, the campaign is staying away from Israel, too. While it was an occasional topic of questioning during primary debates, it has been all but absent from the discussion in the general election. In part, that reflects a   campaign of invective that has overlooked many policy questions. But it also underscores the plethora of other issues that have seized Washington’s attention, principally the rise of the Islamic State, the war in Syria and relations with Russia. The   dispute, once a dominant part of any White House foreign policy, seems to be slipping to a   issue. During his meeting last weekend with a bipartisan delegation of former American national security officials, Mr. Netanyahu expressed concern about the United States’ pulling back from the region. Dennis Ross, a Middle East adviser to Mr. Obama and other presidents who organized the visit, said afterward, “Everyone feels they have a stake in the election, and they want an America that will be engaged and that will be effective in the region. ” Still, Mr. Netanyahu scrupulously avoided addressing the election itself. “I think we were all struck by the fact that it wasn’t raised,” said Meghan O’Sullivan, a former adviser to President George W. Bush. Similarly, during a meeting last week, Senators Tim Scott, Republican of South Carolina, and Cory Booker, Democrat of New Jersey, mentioned the election only to have Mr. Netanyahu skirt the subject. What a difference four years makes. Back in 2012, Mr. Netanyahu hosted Mitt Romney, Mr. Obama’s challenger, in Jerusalem and lavished praise on him. While Mr. Netanyahu’s team at the time denied any effort to influence the election, Mr. Obama’s camp was convinced otherwise. The rift widened when Mr. Netanyahu accepted a Republican invitation to address Congress in 2015 to assail Mr. Obama’s efforts to negotiate a deal with Iran curbing its nuclear program. Nachman Shai, who heads a parliamentary caucus on   relations, said Mr. Netanyahu had steered away since then from openly courting Republicans. “Because he had these tough eight years with Obama, he can’t afford it again,” Mr. Shai said. “He needs a direct line with the U. S. president. ” This spring, Mr. Netanyahu canceled a trip to Washington to attend a conference of the American Israel Public Affairs Committee, or Aipac, which aides explained by saying he wanted to avoid meeting with candidates. Last fall, amid controversy over Mr. Trump’s call to bar Muslims from entering the United States, the Republican abruptly announced and then just as abruptly canceled a visit to Jerusalem, saying of Mr. Netanyahu, “I didn’t want to put him under pressure. ” Even Mr. Trump’s Aipac speech vowing to dismantle the Iran agreement was greeted with silence in Jerusalem. “If Bibi was going in any way to support or give Trump some type of compliment, that would have been the time to do it,” Gadi Wolfsfeld, a scholar at Hebrew University, said at the time, using Mr. Netanyahu’s nickname. Israel Hayom, the newspaper financed by the American casino magnate Sheldon Adelson, an ally of Mr. Netanyahu, championed Mr. Trump with a blast of positive coverage at the time. But like Mr. Adelson himself, who has endorsed Mr. Trump without following through on promises of large contributions, the paper has not been the unrestrained cheerleader some expected. The   newspaper Haaretz, however, wrote this week that leaders of the Trump campaign’s efforts to recruit votes among American citizens here have ties to Mr. Netanyahu’s governing coalition. In a first for an American candidate, thee Trump campaign plans to open what it calls a “floating office” moving from home to home in West Bank settlements in coming days. Mr. Netanyahu and Mr. Obama have tried lately to put their difficulties behind them by negotiating a   American security aid package for Israel. The deal is all but complete, and the White House has been discussing how to announce it. The two leaders will both attend the United Nations General Assembly conclave this month, but it seems most likely that it would be signed by   officials. But to Mr. Netanyahu’s consternation, administration officials are still debating whether the president will lay down a final marker before the end of his time in office on the   impasse, perhaps with a speech outlining terms for an agreement or even a United Nations resolution. Some argue it would be a way to stop waiting for the two sides to finally step up others consider it a fruitless waste of the president’s waning time in office. Mr. Netanyahu’s office declined to comment this week on the American election. Over the summer, the prime minister told reporters “it’s not smart to interfere,” saying he would be “happy to work with whoever gets elected. ” He has made clear to advisers that they should not discuss the election even in private. Dani Dayan, the normally outspoken Israeli consul general in New York, articulated the official line in an interview with The New York Times Editorial Board last month: “Any American president is good for Israel. ” But that is not an opinion universally held in Jerusalem. While Mr. Netanyahu may be more comfortable with Republicans who share his hawkish security views, Mr. Trump is an unknown who has criticized American intervention in the Middle East and called for curtailing foreign aid. His initial promise to be “a neutral guy” between Israelis and Palestinians disturbed many here before he later voiced steadfast support for Israel. Mrs. Clinton, on the other hand, is a known quantity, for better or worse. Her husband, former President Bill Clinton, is still popular here, and many noticed that at the Democratic National Convention, he wore a pin spelling Hillary in Hebrew. But Mrs. Clinton’s history as Mr. Obama’s secretary of state makes her suspect in Mr. Netanyahu’s camp, and neither Clinton has warm feelings toward the prime minister. “I don’t know who is better in terms of Israel,” Mr. Shai said. “We know a lot about Hillary and we know very little about Donald Trump. ”'"}, "time": 1742563714.3625278}