{"duration": 0.06313037872314453, "input_args": {"text": "'By Ryan Chikaraishi / filmsforaction.org \\nAfter the Japanese bombed Peal Harbor in December of 1942 President Roosevelt, an alleged “progressive” Democrat, issued Executive Order 9066, which forcibly removed around 110,000 Japanese citizens regardless of citizenship living on the west coast and “relocated” them. My grandparents were forced from their homes and given two weeks to pack what they could carry before eventually ending up at camp, concentration camps as the Japanese refer to them, in Rohwer, Arkansas. They were forced to reside in hastily constructed stables that smelled of manure, were surrounded by barbed wire, and had armed guards 24/7. However, there was some beauty from the chaos for my grandparents. They met in camp and recently celebrated their 71st wedding anniversary and still reside in Chicago. \\nThousands of law-abiding citizens had their lives transformed overnight. They lost their livelihoods, possessions, had to register with the War Relocation Authority, and they were considered potential enemy combatants and spies because of their ethnic background despite most of them being born and raised in America. My grandparent’s families lost most of what they owned and had to rebuild from nothing after the war. After resettling my Grandfather was fired from a job because there were “too many Japanese” working there and it looked bad for business. \\nThe same poisonous conditions are building up in 2016 and this time the targets are Muslims. \\nIn Dec of 2015 Donald Trump was asked by Time if he supported the internment of Japanese American citizens during WWII, his response was, “I would have had to be there at the time to tell you, to give you a proper answer. I certainly hate the concept of it. But I would have had to be there at the time to give you a proper answer.” \\nGiven the context of his anti-immigrant, islamaphobic, and racist diatribes one can only shudder in fear of a statement that refuses to unequivocally denounce such abuses driven by racism and xenophobic ignorance. His own statements and policy recommendations have called for a “total and complete shutdown on Muslims entering America” as well as a national registry. \\nAnd what is probably most unsettling of all is that there is legal and historical precedent, as well as the executive powers to do this again. In a scene out of the 1940s Trump surrogate Carl Higbie told Megan Kelly of Fox News “We’ve done it with Iran back a while ago,” and, “we did it during World War II with the Japanese.” The devil seems to be in the legal details as well. The Immigration and Nationality Act of 1952 has a clause that states: \\n\\nWhenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. \\n\\nThat is scary. While it is true that the first amendment protects the practice of religion there are ways to discriminate and “shut down” Muslims from entering America by excluding them based on their nationality and Trump has modified his comments on his Muslim ban, possibly because he is aware of this. In July of 2015 he stated he would halt immigration, “from any nation that has been compromised by terrorism.” This includes around 40 countries, many of which are allies of the U.S. and even Western allies such as France and Germany. \\nAnother frightening legal precedent regards one of the most infamous Supreme Court cases of all time, Korematsu v. The United States. In a 6-3 ruling the court upheld the government’s decision to incarcerate Japanese citizens during the WWII. This case has technically never been overturned. The NY Times reported that one reason it hasn’t been overruled is because a similar case has not happened again. Well, we might not have to wait long now. Trump might very well be on his way to not only using his executive powers to ban Muslims, thus discriminating based on religious background, but by also appointing what could turn out to be two justices to the Supreme Court. Trump is also eyeing Kansas Secretary of State Kris Kobach for Attorney General, who has plans to create a Muslim registry. \\nSupreme Court justices themselves admit that we are not far off from this happening again. In 2014 the late Justice Scalia told a group of students in Hawaii, “But you are kidding yourself if you think the same thing will not happen again” when referring to the detainment of Japanese people during WWII. And since the “war on terror” is a never-ending war and we already have Guantanamo Bay as well as various clandestine centers around the world the implications of what already exists and what is yet to come are dystopian to say the least. \\nWith Trump’s recent appointment of Stephen Bannon, the executive chairman of the leading alt-right news source, Breitbart News, and a man that the former Grand Wizard of the KKK, David Duke, has praised, the future is more Orwellian than ever and I fear greatly for our Muslim brother and sisters. \\nWe are headed into disturbingly familiar scenario by a man that spouts racist drivel and emboldens white ethno-nationalism in a veiled attempt to internalize his authoritarian proclivities. It’s up to us to makes sure that history does not repeat itself. The indigenous holocaust, transatlantic slave trade, Jim Crow, Japanese internment, endless war against the “other”; these things are all events that were allowed to happen due to outright racism and colonial policies, but they were also perpetuated by indifference and ignorance. We must be the generation that refuses to be indifferent and rises up to challenge injustices like these head on even if it means directly confronting these pernicious machinations directly and forcefully until they are vanquished forever. \\nThis work is licensed under an Attribution-NonCommercial-ShareAlike 4.0 International License 4.0 ·'"}, "time": 1742628501.6294677}