{"duration": 0.056578636169433594, "input_args": {"text": "'American liberals are now living a nightmare they never imagined would come true: a Donald Trump presidency. Not only did Trump win, but he did so after pollsters and pundits forecasted a solid landslide victory in Hillary Clinton’s favor.\\nIn their mind, this was not supposed to happen. The glass ceiling should have broken and their cups should have been overflowing in celebration. Instead, many are dumbfounded, unable to comprehend how things could have gone so wrong. As the hours crawled by, Clinton voters took to social media and consoled one another—“it’s still too early…she can still take Michigan…this can’t happen…” And yet, despite the prophecies of the foremost data pundits, here we are: a Trump presidency, and Republicans in control of both the House and Senate.\\nThis demonstrable failure on the part of the Democratic Party will not be a cause for reevaluation but will be passed on to third party voters, who have long served as their proverbial whipping boy. The corpse of Ralph Nader’s 2000 campaign is still unearthed every election season to serve as bogeyman, after all.\\nEarly on, Clinton warmed to right wing ideologues while maligning those on the left pushing for more authentic and progressive policies. Her surrogates boasted of a more efficient platform, mocking her leftist detractors as half-witted and starry-eyed.\\nThe reinvention of Clinton as a cool and relatable pop culture icon who was still “your abuela” was a wasted effort; her campaign was a theater of pretentious absurdity that alienated those forced to straddle the intersections of race, gender, and poverty, who will face a multitude of struggles whether or not the glass ceiling shattered around them.\\nClinton, and those ensnared in the sputtering limelight of her campaign, turned some the most consequential issues—from universal healthcare and police brutality to the prison industrial complex and a living wage—into detached and immaterial concerns.\\nThis staggering loss to a candidate portrayed as both a balmy object of ridicule and a calamitous threat to numerous communities should serve as a moment of clarity, but if things are to remain guided by the reactionary sentiment we’ve seen expressed so often, then the next few years will push us further towards the edge of the cliff.\\nThere should be no exoneration of the Democratic Party, whose funeral knell should have rung decades ago. The bourgeois liberals who have long enjoyed spreading political fan-fiction instead of mobilizing, who have denounced even the most benign criticism of Clinton as being untimely and lending credence to right wing populism, are frantic. Yet, they still take up spaces across the media landscape that they do not deserve. It is time we make them irrelevant.\\nAs liberals apply for Canadian citizenship and drown their sorrows in bottles of maple syrup, the rest of us must organize. There is no retreating. Mourn if you must, but come hell or high water, we must mobilize.\\nThe post The Left Must Mobilize In The Face Of A Trump Victory appeared first on Shadowproof .'"}, "time": 1742564134.0923522}