{"duration": 0.0527803897857666, "input_args": {"text": "'This is What Happens When a Currency Hits an All-Time Low Posted on Home » Headlines » Finance News » This is What Happens When a Currency Hits an All-Time Low \\nThis opportunity doesn’t always exist… but it does for now, at least for US dollar investors: \\n\\nFrom Simon Black, Sovereign Man : \\nI’ll start with an admission that I don’t do vacations very well. Or frequently. \\nOver the past ten years I’ve probably only taken a week or two off in total. \\nA big part of that is a deep character flaw of me being a workaholic… but that’s a natural extension of genuinely loving all the exciting business ventures and wonderful people that I’m involved with each day. \\nI do recognize, however, that taking a break is healthy, and I’m trying to get better at it. \\nThe last few weeks in particular have been a blur. \\nMy fellow executives at our agriculture business and I have been busy negotiating credit facilities with some of the largest financial institutions in the world, all while the company has been planting hundreds and hundreds of acres at a record pace. \\nMy team at Sovereign Man and I have also just concluded months of discussions about a unique investment and citizenship deal in a foreign country with its prime minister. \\nAnd I just received approval for my second banking license after working on this for most of the past year. \\nSo it was definitely time for a break… and for me that means South Africa. \\nSouth Africa is a wonderful country to visit, especially out here in the Western Cape. \\nThis may be the only place in the world where in the span of a single afternoon you can see penguins, whales, and great white sharks on the coast, followed by baboons, elephants, lions, and rhinos just an hour inland. \\nIt’s really special. \\nThe weather is also fantastic. Like central Chile, the climate here in Cape Town is classified as “Mediterranean”, which means it never gets too hot or too cold. \\nThe food is great, the people are extremely welcoming. And with the currency (South African Rand, or ZAR) being so cheap, this place is even more spectacular. \\nI’ve been to South Africa probably a dozen times or more, and I remember coming here years ago when the rand was very strong, around 6 to the dollar. \\nBack then South Africa was very expensive. \\nNow it’s the opposite. The US dollar is overvalued, and the rand is extremely cheap. \\nWhen I was here last year, I wrote to you when the rand had hit an all-time low against the US dollar, describing just how cheap South Africa had become. \\nMy rental car was just $8 per day. Going out to eat for a multi-course meal at some of the most luxurious restaurants in town, with wine, was barely $15 per person. \\nIn economics there’s a concept called the Law of One Price, which suggests in general that things should more or less cost the same around the world. \\nThe Economist magazine routinely publishes its Big Mac Index , comparing the prices of Big Macs around the world , from London to Tokyo to Sydney, after converting local prices to US dollars. \\nA Big Mac in South Africa, for example, costs 30 rand, or about $2.14, compared to an average Big Mac price in the US of $5.04. \\nIn theory, the two prices should be more or less the same. Whenever they’re far apart, it suggests that a currency may be undervalued or overvalued. \\nSouth Africa’s currency has been massively undervalued. And anytime that happens, there are usually two ways it corrects. \\nFirst, an undervalued currency will get stronger. \\nThat’s already happened. Last year when I wrote to you, the rand was at 16 per dollar. Now it’s strengthened to 14. \\n(Fewer rand per dollar means the rand is getting stronger) \\nThe second thing that happens is that inflation kicks in, and local prices rise. \\nSo instead of a Big Mac costing 30 rand, the price may rise to 40 or 50 rand. \\nThat’s why it makes so much sense to buy inexpensive, high quality assets in an undervalued currency whenever they’re available. \\nLook at South African stocks as an example. \\nWhen I was here last December, the JSE All Shares Index was at roughly 48,000. Today it’s 51,300, an increase of 6.875%. \\nBut given that the rand strengthened from 16 to 14, in US dollar terms the JSE All Shares Index is up 22.1%. \\n(By comparison, the S&P 500 index in the US is up just 5.9% in the same period.) \\nThis is what happens when undervalued assets and currencies correct. \\nWhen the currency gets stronger, you make money. And if there’s local inflation and prices rise, the value of your asset increases… and you make money. \\nThis opportunity doesn’t always exist… but it does for now, at least for US dollar investors. \\nThe US dollar is at a multi-year, multi-decade, and even all-time high against a number of other currencies. \\nFrom the UK to Europe to Colombia to here in South Africa, there are places all over the world where the currencies are cheap. \\nThe trick is finding high quality assets in those places which are also relative bargains– inexpensive real estate, undervalued businesses, discounted collectibles, etc. \\nThis takes a little bit of patience and legwork, but the risk-adjusted returns can be phenomenal. \\nI suppose that’s why I’m combing through real estate listings right now instead of shark diving with my friends… so much for vacation. \\n(Our Chief Investment Strategist Tim Staermose is a master of this ethos, and his 4th Pillar investment newsletter has scored some big wins recommending deeply undervalued companies in deeply undervalued currencies.) \\nIt’s possible that the US dollar will continue to stay strong for quite some time, so this opportunity isn’t going away tomorrow. \\nBut it definitely makes sense to think globally and look for opportunities to trade an overvalued currency for something that can make you a lot of money– deep-discount, high quality assets denominated in undervalued currencies. This entry was posted in Finance News and tagged Simon Black , Sovereign Man . Bookmark the permalink . Post navigation'"}, "time": 1742628426.012173}