{"duration": 0.14457941055297852, "input_args": {"text": "'Email \\nJust days before the presidential election, numerous pundits and politicos are weighing in on who the next occupant of the Oval Office might appoint to the Supreme Court should current justices retire during the next presidential term. \\nWhile party affiliation has not shown itself to be a reliable guide to the ideological fidelity of a judge once he\\'s secured a seat on the high court\\'s bench, there are some clues as to what Hillary Clinton might look to accomplish with her appointments should she be sworn in next January. \\nFirst, given her constant claim that she will make sure to ensure the safety of American children by the enactment of \"common sense gun restrictions,\" it is more likely than not that a President Hillary Clinton would seek to seat a pro-confiscation jurist on the Supreme Court. \\nAlthough in 2008 the Supreme Court ruled in favor of protecting individual gun rights from government abridgment, the decision is D.C. v Heller was 5-4 and even a slight shift toward curtailing the exercise of the rights protected by the Second Amendment could seriously threaten the liberty of Americans. \\nIn fact, there is no doubt how Hillary Clinton will handle the Second Amendment and how judges she nominates will look at the issue. \\nLeaked audio from a New York fundraiser makes Clinton\\'s gun control agenda crystal clear: She wants to reinstate her husband\\'s disarmament design. \\n“I was proud when my husband took [the National Rifle Association] on, and we were able to ban assault weapons, but he had to put a sunset on it 10 years later. Of course [President George W.] Bush wouldn’t agree to reinstate [the ban],” said Clinton. \\nIn other words, she wouldn\\'t hesitate to reinstate it if given the chance. \\n\"We’ve got to go after this. And here again, the Supreme Court is wrong on the Second Amendment. And I am going to make that case every chance I get,\" the Democratic nominee promised. \\nDuring the third presidential debate, Clinton spoke of the Heller decision, saying she \"disagreed with the way the court applied the Second Amendment in that case” and that she would work to get that decision overturned. \\nThere\\'s another recent Supreme Court ruling   has in her sights: the Citizens United case (Citizens United v. Federal Election Commission ). \\nIn 2009, the Supreme Court came to a narrow decision in this case, too, ruling 5-4 that \"expenditures by for profit corporations, labor unions and other associations cannot be restricted by government.\" \\nHillary Clinton considers this holding, too, to be up for overruling should she move in to the White House in 2017. \\nAt another debate, Clinton said the Citizens United case \"undermined the election system in our country because of the way it permits dark, unaccountable money to come into our electoral system.\" \\nIn other words, Clinton doesn\\'t want any organization being able to influence U.S. political policy unless they make a substantial donation to the Clinton Foundation first. \\nFinally, there is little chance of Roe v. Wade being overturned by a Clinton-appointed Supreme Court and, in fact, the legal prohibition on late-term abortion is likely to be removed during a Hillary Clinton presidential administration. \\nThe holding in the case of Gonzalez v. Carhart (2007) that retained the restriction on late term abortions will be in the crosshairs during a Clinton presidency as Mrs. Clinton has made it clear that she wants an exception carved out of the ruling in the case of a threat to the health of the mother. \\nIn its opinion, the Court declared that \"uncertainty [in the medical community] over whether the barred procedure is ever necessary to preserve a woman’s health,\" thus it did not qualify for protection under the Roe v. Wade decision. \\nThis won\\'t do in the world Clinton and her cronies inhabit, a world where unborn babies are masses of cells and killing babies is a form of birth control. \\nDuring the last presidential debate, Hillary Clinton declared, “I do not think that the United States government should be stepping in and making those most personal of decisions. So you can regulate if you are doing so with the life and the health of the mother taken into account.” \\nThese decisions are likely only a few of the cases that would come under renewed scrutiny should Hillary Clinton become president. \\nWhile we may not know which decisions Clinton would target, we do know a bit about the philosophy she would employ in the selecting of Supreme Court nominees. During   debate, Clinton explained how the Constitution would figure into the process she would use to identify potential high court justices. When asked about who she would nominate, Clinton explained: You know, I think when we talk about the Supreme Court, it really raises the central issue in this election, namely, what kind of country are we going to be? What kind of opportunities will we provide for our citizens? What kind of rights will Americans have? And I feel strongly that the Supreme Court needs to stand on the side of the American people, not on the side of the powerful corporations and the wealthy. For me, that means that we need a Supreme Court that will stand up on behalf of women’s rights, on behalf of the rights of the LGBT community, that will stand up and say no to Citizens United, a decision that has undermined the election system in our country because of the way it permits dark, unaccountable money to come into our electoral system. \\nSo, along with gun control, free speech, and abortion, Clinton would try to appoint justices that would carry her water and \"uphold\" the \"rights\" of the radical homosexual lobby, among others. \\nIt isn\\'t surprising that in her answer to the question   certain Supreme Court decisions and how as president she would try to influence them, Hillary Clinton never mentioned the Constitution. \\nNone of the foregoing analysis of Hillary Clinton\\'s judicial assault on   the fundamental liberties it was written to protect would matter should Americans appreciate the correct constitutionally established relationship among the three branches of the federal government and the absolute sovereignty of the people. \\nTake a lesson from Thomas Jefferson, who explained the proper procedure in a letter to Abigail Adams: \\n\"You seem to think it devolved on the judges to decide on the validity of the sedition law. But nothing in the Constitution has given them a right to decide for the Executive, more than to the Executive to decide for them.” \\nJefferson then told Mrs. Adams that each branch of the general government is “independent in the sphere of action assigned to them.” \\nTo allow the nine black-robed justices to be the ultimate and unchallengeable arbiter of what is and is not constitutional, Jefferson added, “would make the judiciary a despotic branch.” \\nRestoring the Supreme Court back to its intended sphere of influence would take away from any future president the power to permanently and prejudicially undermine   fundamental liberty. \\n\\n  Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742561814.3163886}