{"duration": 0.04799032211303711, "input_args": {"text": "\"4 Shares\\n3 0 0 1\\nAmateur footage emerged on Saturday showing what appears to be Turkish soldiers executing two female PKK insurgents at point-blank range.\\nAl-Masdar News that released the footage says they are not able to independently verify it.\\nA ceasefire between Turkey and the PKK ended last year and clashes have since claimed hundreds of lives on both sides.\\nThe PKK operates primarily in the mountanious terrain of southeastern Turkey and often uploads footage of its Kurdish fighters ambushing Turkish government troops.\\nMORE... 2 bombers, stopped by police, blew themselves up in Turkey Dispute over Kurds and Coup attempt threatens U.S.-Turkey alliance The attempted coup d’état made Turkey band together Erdogan vows heavy price for coup plotters The tension between Kurdish fighters and Turkish government have always been high in past years. In yet one of the most recent cases, a Turkish court banned the co-leader of Turkey's pro-Kurdish opposition from traveling abroad as part of a court case in which she has been accused of being a member of an armed terrorist group, Hurriyet daily reported on Saturday, Reuters reported.\\nFigen Yuksekdag, co-chair of Peoples' Democratic Party (HDP), is facing jail time up to 15 years over comments she made last year in the southeastern border town of Suruc. The prosecutor of the case requested the ban.\\nHDP described the court's decision to bar Yuksekdag from foreign travel as 'political and arbitrary', saying in a statement that it will make a formal appeal for its overturn.\\nThe move comes days after the co-mayors of Diyarbakir, the largest city in the southeast, were detained as part of a security crackdown. Turkey's largely Kurdish southeast has been rocked by violence following the collapse of a ceasefire between the state and the Kurdistan Workers Party (PKK) last year.\\nPresident Tayyip Erdogan has accused the HDP of being a political extension of the outlawed PKK and repeatedly called for the prosecution of its members. He has also said the removal of elected officials and civil servants accused of links to the PKK was a vital part of the battle against it.\\nSeveral other HDP lawmakers including co-chair Selahattin Demirtas are also being prosecuted, largely over terrorism charges, after the parliament earlier this year lifted the immunity of HDP deputies, along with the immunity of MPs from other parties.\\nMeanwhile three Turkish soldiers were killed and five others were wounded by mortar fire from PKK militants near the southeastern town of Cukurca, security sources said.\\nSoldiers who were on an operation in Cukurca in Hakkari province bordering Iraq and Iraq returned the fire, sources said. Operations were under way to hunt down the militants.\\nThe autonomy-seeking PKK took up arms in 1984, and more than 40,000 people have died in the conflict. It is considered a terrorist group by Turkey, the United States and the European Union.\""}, "time": 1742562472.0728915}