{"duration": 0.06438899040222168, "input_args": {"text": "'By Sean Colarossi on Wed, Oct 26th, 2016 at 8:34 pm Not even an overwhelming victory by Hillary Clinton is likely to convince Republicans that they should do their job. Share on Twitter Print This Post \\nSince Republicans have essentially conceded that Donald Trump is going to lose the general election to Hillary Clinton, they’re already making plans in the event that she decides to do her job and nominate Supreme Court justices. \\nAccording to a report from the Huffington Post on Wednesday, one conservative thinker says that John McCain’s recent suggestion that his party should block any nominee put forward by Clinton isn’t that farfetched. \\nThe report: \\nSome conservatives certainly seem to be warming up to McCain’s controversial suggestion last week that Senate Republicans should dig in their heels and block any and all Supreme Court nominees put forth by a future President Hillary Clinton. \\nWho needs a fully functioning Supreme Court after all? \\n“As a matter of constitutional law, the Senate is fully within its powers to let the Supreme Court die out, literally,” wrote the Cato Institute’s Ilya Shapiro in a column Wednesday on The Federalist. \\nShapiro is well-versed in constitutional issues, and his argument has a legal, if contorted, basis. Nothing in the Constitution explicitly stands in the way of senators who would be willing to destroy the nation’s highest court ― if not an entire branch of the federal government ― to stop Clinton from selecting judges who share her views. \\n… \\nTo Shapiro, there’s nothing wrong with even more Senate obstructionism because “the Constitution is completely silent” on how the upper chamber provides its “advice and consent” on the president’s nominees. \\n… \\n“So when you get past the gotcha headlines, breathless reportage, and Inauguration Day, if Hillary Clinton is president it would be completely decent, honorable, and in keeping with the Senate’s constitutional duty to vote against essentially every judicial nominee she names,” he concluded. \\nThe original argument from Republicans was that they would block President Obama’s Supreme Court appointment until voters had a chance to weigh in via the Nov. 8 election. Forget the fact that this isn’t how the constitutional system is meant to operate, but that was their reasoning. \\nNow, faced with the growing prospect that Hillary Clinton will be elected the 45th President of the United States, they are beginning to change their tune. \\nThe obstruction that defined the Republican Party throughout Obama’s presidency looks like it will be sticking around after he is gone. It’s yet another reason why down-ballot races are more critical than ever this year.'"}, "time": 1742563593.0914528}