{"duration": 0.05789303779602051, "input_args": {"text": "'16934 SHARES \\nAfter Thursday’s Bundy verdict and Standing Rock response, the judicial system seems to be communicating loud and clear that white lives matter more. \\nOn the same day that Ammon Bundy and his gang of domestic terrorists were acquitted for taking over federal property while armed to the teeth , over 100 Native Americans protecting their own land were arrested, gassed, beaten with batons, and shot with rubber bullets . The difference in how each group was treated couldn’t be more stark. \\nFrom the very beginning, the system was set up to favor the Bundys. Shortly after the takeover of the Malheur Wildlife Refuge in rural Oregon took place earlier this year, the police response was muted . \\n“During Saturday’s rally, not a police officer was visible. And so far law enforcement agencies have not approached the refuge or blocked access to the territory,” The Oregonian reported in January. \\nEven though the wildlife refuge was on federal property, no FBI agents or military units were deployed to remove the Bundy militia from the building. The Bundys’ acquittal came from an all-white jury , who took just 6 hours of deliberation to find the gang not guilty of the crimes they were charged for, despite the Bundys livestreaming the event to the world . And as the Associated Press reported, the threat of violence was very real, as federal authorities recovered nearly 17,000 live rounds of ammunition at the bird sanctuary, as well as almost 2,000 shell casings from rounds previously fired. \\nTo contrast, the response from both state law enforcement and private security to the nonviolent civil disobedience exercised by the Standing Rock Sioux at the site of the Dakota Access Pipeline was incredibly heavy-handed. As water protector Dallas Goldtooth wrote on his Facebook profile , Native Americans protesting pipeline construction were dragged out of a religious ceremony at gunpoint, one of their horses was so badly injured by private security that it had to be put down, and national guardsmen were used to clear the protest site despite an order from President Obama’s Department of Justice halting pipeline construction within 20 miles of the Missouri River. \\nThe Sacred Stone Camp further described the violence carried out against unarmed indigenous protesters in a post to their website : \\nIn addition to pepper spray and percussion grenades, shotguns were fired into the crowd with less lethal ammunition and a sound cannon was used (see images below). At least one person was tased and the barbed hook lodged in his face, just outside his eye. Another was hit in the face by a rubber bullet… A member of the International Indigenous Youth Council (IIYC) that had her wrist broken during a mass-arrest on October 22nd was hurt again after an officer gripped her visibly injured wrist and twisted it during an attempted arrest. At least six other members of the youth council verified that they had been maced up to five times and were also shot and hit with bean bags. \\nGerman Lopez, a writer for Vox.com, summed up the injustice of the Bundy verdict : \\n“It is impossible to ignore race here. This was a group of armed white people, mostly men, taking over a facility. Just imagine: What would happen if a group of armed black men, protesting police brutality, tried to take over a police facility and hold it hostage for more than a month?” Lopez wrote. “Would they even come out alive and get to trial? Would a jury find them and their cause relatable, making it easier to send them back home with no prison time?” \\n\\nZach Cartwright is an activist and author from Richmond, Virginia. He enjoys writing about politics, government, and the media. Send him an email at [email protected] , and follow his work on the Public Banking Institute blog . 16934'"}, "time": 1742563663.3358524}