{"duration": 0.14870977401733398, "input_args": {"text": "'in: Medical & Health , Multimedia , Natural Medicine , Sleuth Journal , Special Interests Cannabis contains a compound that may kill brain cancers that chemotherapy and radiation can’t touch, so why isn’t it being used today? In recent years, we’ve focused heavily on educating our readers about the still relatively unknown role that cancer stem cells play in cancer, both in terms of conventional cancer treatment failure and the exceptionally promising role that natural interventions play in targeting these highly malignant cells. It is encouraging to witness a growing awareness that cancer has been completely misunderstood , and that in order to make progress against the global epidemic we will have to go back to the wisdom of the ancients by using foods and spices instead of toxic chemicals and radiation to fight a disease that should be classified more as a survival mechanism unmasked than an inexorably lethal, genetically-driven condition . Even the National Cancer Institute now admits that it had been wrong for decades about “early stage” breast ( DCIS ) and prostate (HGPIN) “cancers,” and that they should be reclassified as indolent or benign lesions of epithelial origin, i.e. not “cancer” at all! Essentially, therefore, millions were overdiagnosed and overtreated for cancers they never had. Even now, despite this admission, the vast majority of conventional doctors have yet to account for, acknowledge, or integrate this radically different definition of cancer and its implications for treatment into their “standard of care.” Only last week, we featured a new review on natural therapies that target cancer stem cells , many of which included common foods and spices. You can view it here. But one substance conspicuously absent from the list was cannabis , which is the herb we now turn to to give it a fair representation in the context of this topic. A recent article published in the Journal Neuroimmune Pharmacology titled, “ The Antitumor Activity of Plant-Derived Non-Psychoactive Cannabinoids ,” reviewed the therapeutic potential of a non-psychoactive class of phytochemicals found in cannabis known as cannabinoids . Unlike THC, cannabinoids do not activate the cannabinoid 1 and cannabinoid 2 receptors in the central nervous system in any significant way, making their activity less controversial as they do not produce changes in perception and sensation associated with “recreational” and/or “psychedelic” drugs. There are actually over 60 cannabinoids in cannabis, but the second most abundant one, cannabidiol (CBD), has been found to inhibit and/or kill a wide range of cancers in the animal model, including gliobastoma (a difficult-to-treat type of brain cancer), breast, lung, prostate, and colon cancer. There have been a wide range of mechanisms identified behind these observed anti-tumor activities, including anti-angiogenic (preventing new blood vessel formation), anti-metastatic, anti-cell viability, but the one we wish to focus on in this report is its ability to to inhibit the stem-like potential of cancer cells. Stem cells are unique within the body as they are capable of continual self-renewal, theoretically making them immortal relative to regular body cells (somatic cells), which die after a fixed number or replication cycles. In their normal state of function they are essential for healing and bodily regeneration, as they are capable of differentiating into the wide range of cells that make up the body and need to be regularly replaced when damaged. This so-called pluripotent property of stem cells is also observed in tumor formation and maintenance, as cancer stem cells are capable of producing the entire range of different cells that make up a tumor colony. Unlike regular tumor cells, cancer stem cells are uniquely tumorigenic because they are capable of breaking off from an existing lesion or tumor and forming a new tumor colony of cells. In this sense, they are “mother cells” at the heart of cancer malignancy, whose ability to colonize other tissues by producing all the “daughter cells” necessary to form a new tumor make their existence highly concerning from the perspective of cancer prevention and treatment. Radiation and chemotherapy, while capable of reducing the size of a tumor, actually enrich the post-treatment residual lesion or tumor with higher levels of cancer stem cells , and in some cases transform non-cancer stem cells into cancer stem cells , ultimately making the post-treatment state of the treated tissue far worse than its pre-treatment condition. This is why identifying and using natural, safe, effective and affordable ways to target cancer stem cells versus the non-tumorigenic tumor cells in a lesion or tumor is the only rational way to treat cancer, and should be the primary focus of present day cancer treatment approaches. The new review discussed the way that cannabidiol targets and/or inhibits the cancer stem cell subpopulation in cancers such as the highly treatment-resistant form of brain cancer known as glioblastoma, which is widely considered by conventional medicine as “incurable.” A 2013 study, 1 mentioned in the review, found that patient-derived glioblastoma cells when exposed to cannabidiol saw a significant down-regulation of the genetic tumor marker Id-1, which has been closely correlated with brain cancer cell invasiveness. They also found that cannabidiol was capable of inhibiting neurosphere formation (a sign of cancer stem cell tumor formation), as well as was capable of inhibiting glioblastoma tumor invasiveness in an animal model. The results of this preclinical study were so compelling that the researchers concluded cannibidiol might make an ideal adjunct treatment: With its lack of systemic toxicity and psychoactivity, cannabidiol is an ideal candidate agent in this regard and may prove useful in combination with front-line agents for the treatment of patients with aggressive and high-grade glioblastoma tumors. Integrative approaches often focus on using natural interventions as “adjuncts” to conventional, inherently toxic approaches like chemotherapy and radiation, we believe that another possibility exists, namely, that cannabidiol in combination with a wide range of other natural substances studied for targeting glioblastoma is more effective (and certainly far safer) than a combination approach. To view other anti-glioblastoma substances, view our database on the subject . Another highly relevant study published in 2007 titled, “Cannabinoids induce glioma stem-like cell differentiation and inhibit gliomagenesis,” 2 found that cannabinoids target the stem-like properties of glioma cells, encouraging their differentiation into functioning, non-tumorigenic cells, and inhibiting the dysregulated increased production of glioma cells. A more recent 2015 study, 3 found that glioblastoma cells treated with cannabidiol inhibited their self-renewal by down-regulating “critical stem cell maintenance and growth regulators.” Another study, published last month, found that cannabidiol inhibits glioma stem-like proliferation by inducing autophagy, a natural form of programmed cell death. 4 Consider, finally, that the cancer stem cell targeting and killing properties of cannabidiol are only one of a wide range of potential mechanisms through which cannabis as a whole plant, comprised of hundreds of different phytochemicals and phytonutrients, can treat cancer. We have indexed hundreds of studies on cannabis’ therapeutic properties, a good subset concerning its ability to prevent, kill, or regress a wide range of different cancer types. You can view them all on our cannabis research database . Research on cannabis and brain cancer has only just begun, but considering the abject failure if not also sheer violence of conventional approaches, waiting for sufficient quantities of Pharma or government capital to flow in the direction of a non-patentable substance already saddled with archaic laws in some cases criminalizing its possession is a no win proposition. Anecdotes of healing with cannabis are not uncommon. One such report can be viewed on our colleague Dr. Jeffrey Dach’s website, titled, “ Cannabis Oil Brain Tumor Remission ,” demonstrating just how powerful cannabis and its cannabinoids may be for accomplishing what conventional approaches can not. A couple years ago, we reported on a similar case of temporary remission in childhood leukemia using cannabis extract . Also, consider reports like this one, where a woman clearly being victimized by conventional medicine was able to replace 40 different medications through using raw cannabis juice . The short of it is that the future of medicine , if it is to continue to advertise itself to be concerned with alleviating human suffering and being guided by “evidence,” must incorporate this safe, time-tested, affordable and effective healing agent into its standard of care. Failing to do so will not de-validate cannabis, rather, but the medical system itself. One might ask, if cannabis can treat “incurable” brain cancers, and is safer and more effective than chemotherapy and radiation, shouldn’t withholding it or information about its healing properties be considered criminal? Instead we still live in a time and age where simply possessing it or using it is in some jurisdictions classified as a criminal offense of dire if not irreparable consequence to our civil liberties. Perhaps we are at a critical turning point now and the aforementioned research will lead us all forward to a more enlightened medical ethos that respects the right of a patient to choose his or her treatment as long as it does no harm to others. References 1 Soroceanu L, Murase R, Limbad C, Singer EL, Allison J, Adrados I, Kawamura R, Pakdel A, Fukuyo Y, Nguyen D, Khan S, Arauz R, Yount GL, Moore D, Desprez PY, McAllister SD (2013) Id-1 is a Key transcriptional regulator of glioblastoma aggressiveness and a novel therapeutic target. Cancer Res 73:1559–1569 2 Tania Aguado, Arkaitz Carracedo, Boris Julien, Guillermo Velasco, Garry Milman, Raphael Mechoulam, Luis Alvarez, Manuel Guzmán, Ismael Galve-Roperh. Cannabinoids induce glioma stem-like cell differentiation and inhibit gliomagenesis. J Biol Chem. 2007 Mar 2;282(9):6854-62. Epub 2007 Jan 2. 3 Singer E, Judkins J, Salomonis N, Matlaf L, Soteropoulos P, McAllister S, Soroceanu L (2015) Reactive oxygen species-mediated therapeu- tic response and resistance in glioblastoma. Cell Death Dis 6:e1601 4 Nabissi M, Morelli MB, Amantini C, Liberati S, Santoni M, Ricci-Vitiani L, Pallini R, Santoni G. Cannabidiol stimulates Aml-1a-dependent glial differentiation and inhibits glioma stem-like cells proliferation by inducing autophagy in a TRPV2-dependent manner. Int J Cancer. 2015 Oct 15;137(8):1855-69. doi: 10.1002/ijc.29573. Epub 2015 May 8. PubMed PMID: 25903924. © November 1, 2016 GreenMedInfo LLC. This work is reproduced and distributed with the permission of GreenMedInfo LLC. Want to learn more from GreenMedInfo? Sign up for the newsletter here http://www.greenmedinfo.com/greenmed/newsletter . Submit your review'"}, "time": 1742562022.9387991}