{"duration": 0.04784989356994629, "input_args": {"text": "'  protesters in Venezuela’s Barinas state burned down the childhood home of late dictator Hugo Chávez on Monday, as well as the old home of his grandmother, and attacked a number of government buildings with Molotov cocktails. [The attacks appeared to be a reaction to the news that soldiers had killed yet another young man peacefully protesting in Venezuela, bringing the death toll during this latest round of protests up to 62. Protesters appear increasingly frustrated with the socialist opposition’s tactic of staging an   march per day calling for presidential elections, which would be run by socialist government officials and have little chance of being free and fair.  The Venezuelan newspaper El Nacional reported that multiple photos began surfacing on social media of the burned down home on Monday evening. Social media users noted that the fire began shortly after the news that the military had killed    Yorman Alí Bervecia Cabeza for protesting against socialism. The Associated Press later confirmed that protesters had burned down the Chávez home with opposition legislator Pedro Luis Castillo, who represents Barinas. Queman casa Materna de Chavez en Barinas Enardecidos tras el asesinato de Yorman Bervecia. pic. twitter.   —   Daniel García (@DanielInformaVE) May 22, 2017,  Hoy quemaron la casa natal de Chavez, porque para quemar la de @NicolasMaduro habría que invadir Colombia #FueraMaduro #dictadura pic. twitter.   —   Broderick Zerpa (@Beisbologo) May 23, 2017,  The Spanish newspaper ABC, which has been on the forefront of reporting on the corruption of both the Chávez regime and that of successor Nicolás Maduro, reported that protesters also burned down the home of Chávez’s grandmother and attacked the local headquarters of the ruling United Socialist Party of Venezuela (PSUV) the National Electoral Council (CNE) the regional headquarters of the Secretariat of Education, and the Institute of Housing. The newspaper adds that protesters looted fifty businesses, including multiple bakeries and areperas, restaurants that specialize in the Venezuelan corn arepas. While Chávez’s socialist policies had already collapsed the Venezuelan economy, Maduro’s imposition of strict price controls, ration cards, and government requirements on bakeries have left much of the nation without food. An estimated 15 percent of Venezuelans subsist off of industrial garbage, while three out of four Venezuelans lost an average of 19 pounds in 2016 due to food shortages, Protesters also attacked military convoys and set armored vehicles on fire. Así quedó la tanqueta en #Barinas que reprimió a los ciudadanos #22May #Venezuela (También quemaron sedes del PSUV, CNE, casa de Chávez) pic. twitter.   —   Juan Zubillaga (@jgzubillaga) May 22, 2017,  ABC adds that protesters also burned down yet another statue of Chávez, noting that at least four statues have been taken down or burned since this latest wave of protests began. The   Spanish newspaper ABC notes that the socialist opposition group Democratic Unity Roundtable (MUD) appeared to distance itself from these incidents, as it had “only organized for Monday a protest for health, congregating medical and nursing professionals in Caracas and other cities to protest the sanitary crisis plaguing the country. ” The MUD is a coalition of   parties that currently has the majority in the National Assembly. They are calling for the release of political prisoners, free and fair elections, and an end to the use of the military to kill peaceful protesters. The MUD spearheaded an attempt at dialogue with the government throughout 2016 that largely failed and served to diminish the intensity of opposition against Maduro, which has led to growing unpopularity among opponents of the government, Incidents like the destruction of the Chávez statue in Barinas have occurred nationwide, the most recent before this one being in Zulia state, with another statue going down in Carabobo, near Caracas. In westernmost state Táchira, which has been in open revolt for at least three years, protesters beheaded a statue of Chávez in 2014. The socialists have littered Venezuela with such statues, as well as murals and “street art” meant to applaud Chávez and his work imposing the dysfunctional socialist system on the country. Among the most popular “street art” images is a   of Chávez’s eyes, meant to send the message that the late dictator is still spying on all Venezuelans from beyond the grave. The Chávez family also holds great influence in the country still. The late dictator’s brother Adán runs the Institute of Housing, which the protesters attacked, and his daughter María Gabriela Chávez is believed to be the nation’s wealthiest woman. The latest string of protests, which began 53 days ago in response to the Supreme Court attempting to annul the National Assembly and install itself as the nation’s legislative body, has left 62 people dead so far. Maduro has allowed the Bolivarian National Guard (GNB) to use violence against unarmed protesters to an outrageous degree, including the use of armored tanks to run protesters over, shoot them to death, or asphyxiate them with tear gas.'"}, "time": 1742628541.6650007}