{"duration": 0.08715534210205078, "input_args": {"text": "'Eliott Abrams, who was deputy national security adviser in the George W. Bush administration, has been removed from the list of candidates for Deputy Secretary of State. [According to “three Republican sources” who spoke to CNN, Abrams was personally scratched off the list by President Donald Trump, due to “outspoken” criticism of Trump during the 2016 campaign. Abrams had been seen as the top contender for the job, supported by Secretary of State Rex Tillerson, White House Chief of Staff Reince Priebus, and even senior adviser Jared Kushner, who is President Trump’s   .  The CNN sources were bitingly critical of Trump for deciding not to nominate Abrams. “This is a loss for the State Department and the country and, for that matter, for the President,” said one, while another maintained Abrams was bumped off the list because of “Donald Trump’s thin skin and nothing else. ” However, even the CNN article concedes there is more than “thin skin” behind the decision. For one thing, Abrams was not merely critical of Trump in a few random comments last year. He penned a May 2016   for the Weekly Standard entitled, “When You Can’t Stand Your Candidate,” which declared Trump unfit for office, incorrectly predicted he couldn’t possibly win, and compared him to George McGovern. (For those who lack    Abrams’ perspective on political history, that is not a flattering comparison.) Abrams called for a floor fight at the Republican convention in 2016, to remind Trump “how many in the party oppose and even fear his nomination,” warned any Republican with future political aspirations to avoid becoming Trump’s running mate, called for a purge of Trumpians from the GOP after Hillary Clinton’s inevitable 2016 victory, and suggested running a   spoiler candidate to ensure a crushing defeat for Trump. Moreover, there is a substantial difference in foreign policy vision between Trump and Abrams, whom CNN has no difficulty identifying as a “neoconservative” and supporter of the Iraq War. Senator Rand Paul ( ) of the Foreign Relations Committee strongly opposed Abrams’ nomination, as reported by Breitbart News earlier this week, because Abrams’s worldview was utterly incompatible with Trump’s foreign policy agenda. In Senator Paul’s case, “strongly opposed” means he wrote an   for Rare entitled, “Do Not Let Eliott Abrams Anywhere Near the State Department,” which is roughly as unambiguous as Abrams writing a piece about Trump called “When You Can’t Stand Your Candidate. ” “Crack the door to admit Elliott Abrams and the neocons will scurry in by the hundreds,” warned Paul. “Neoconservative interventionists have had us at perpetual war for 25 years. While President Trump has repeatedly stated his belief that the Iraq War was a mistake, the neocons (all of them  ) continue to maintain that the Iraq and Libyan Wars were brilliant ideas. These are the same people who think we must blow up half the Middle East, then rebuild it and police it for decades. ” Paul was particularly critical of Abrams’ devotion to “” slamming the practice as both expensive and ineffective. He was concerned that Abrams would be a poor fit not only for Trump but for Secretary of State Tillerson as well, praising Tillerson for “foreign policy realism” he found utterly lacking in Abrams. Paul viewed Abrams as an exemplar of the sneering,   political class in Washington that Trump was elected to fight, and which shows every intention of fighting dirty in return, as the geysers of leaked information pouring from the new administration attest. (In fact, this very story is the subject of leaks intended to manipulate media coverage, as noted above.) Paul said Abrams was untrustworthy due to his role in the   scandal: “His conviction for deceiving Congress over secret arms deals, better known as the   scandal, show that his neocon agenda trumps his fidelity to the rule of law. The Constitution directs Congress to approve or disapprove of war. It would be a mistake to appoint anyone to the State Department who was previously convicted for defying Congressional authority. ” Senator Paul is hardly the only observer to see Abrams’ possible appointment this way. The Washington Post found it surprising Abrams was ever under consideration, acknowledging his resumé and reputation as a tough negotiator, but finding little in common with Trump’s foreign policy vision beyond being “fiercely  . ” Fox News host Tucker Carlson said he was “baffled” while interviewing Senator Paul about his  . Doug Bandow at Forbes said choosing Abrams “would be a particularly stunning reversal of candidate Trump’s claim to reject his predecessors’ failed policies of perpetual war. ” In short, there is ample reason to believe Trump’s decision was about more than “thin skin,” and his skin didn’t have to be very thin to think Abrams wouldn’t be a good fit for an administration he previously regarded as an improbable catastrophe. Six weeks of   leaking and bureaucratic sabotage might understandably have reduced the president’s tolerance for a Number Two official at the State Department who (according to Senator Paul) once declared Donald Trump unfit to occupy the chair where Washington and Lincoln once sat —  but evidently had no such reservations about Hillary Clinton.'"}, "time": 1742563665.3644598}