{"duration": 0.09810447692871094, "input_args": {"text": "\"Citizen journalism with a punch Russia's New MiG-29K Carrier-Based Fighter to Be Battle Tested in Syria \\nThe Russian aircraft carrier Admiral Kuznetsov is on its way to Syria. It’ll be its first-ever combat deployment and the first battle test of its MiG-29K fighters Originally appeared at Strategic Culture Foundation \\nThe MiG-29K is all-weather ship-based multirole 4++ generation fighter aircraft developed by the Mikoyan design bureau . Along with the Su-33, the aircraft is now part of the mixed wing on the Admiral Kuznetsov, the Russian aircraft carrier sailing to deploy in the Mediterranean. The MiG-29 K/KUB version is a two-seated variant which also can be used as a training aircraft. \\nThe MiG-29K was originally built for the Indian Navy, according to a contract signed in 2004. India has purchased 45 of MiG-29s over the last decade to be based on aircraft carriers: Vikramaditya and the future INS Vikrant set to become India’s first indigenous carrier in 2018. India might yet increase its MiG-29K fleet. The Mediterranean deployment is the best chance to showcase the ship-based jet’s capabilities to potential clients. \\nThe aircraft is in service with the Russian Navy since 2010. At the end of 2015, the MiG aviation company fulfilled a government contract for the delivery of 24 fighters for the naval aviation to be delivered to the Navy before the end of the year. The Mig-29K will eventually replace the Su-33. \\nThe fighter looks like the land-based version of the MiG-29. In reality, this is a completely different aircraft with foreign electronics replaced by domestic versions, and the «friend or foe» identification system completely rebuilt. The modification is devised for rigors of deck operation. The MiG-29K has folding wings, reinforced landing gear and an arrestor hook for carrier operations. It can perform short take-offs and land at low speeds. \\nThe plane is able to attain very high angles of attack. It has upgraded pilot displays and radar-absorbent coatings to reduce its radar signature. The open architecture allows the installation of new equipment and weapons. The MiG-29K boasts composite materials and an integrated digital «fly-by-wire» system with multiple backups. It is designed to operate from unprepared airstrips with its air intakes specially protected against debris. \\nThe aircraft has a length of 17.3m, height of 4.4m and a wingspan of 11.9m. The maximum take-off weight is 24,500 kg. \\nThe weapons suite includes a 30 mm cannon with 100 rounds in the port wing root, RVV-AE and R-73E air-to-air missiles, Kh-25ML/25MP, Kh-29T, Kh-31G/31A, Kh-35U air-to-surface missiles . The Kh-31A is a supersonic anti-ship missile resistant to air-defence. The Mig-29K is the only platform to carry it. The short-range R-73 infrared-guided missile can be targeted and fired through a helmet-mounted sight without the plane being pointed at an enemy fighter. Other armaments include rockets and guided aerial bombs. Kh-31P passive radar seeker missiles are used as anti-radiation weapons. The plane can carry 6.5 tons of precision-guided munitions. \\nAccording to the plans, the aircraft may test the new Kh-38M (X-38) missiles in Syria. The missile has folding wings and tail fins for internal carriage, and would have a variety of seeker heads for different variants. Depending on the variant, it can have laser, active radar, IR or satellite guidance. The weapon’s range is up to 40 km (21.6 nmi). The speed is Mach 2.2. It can be armed with HE fragmentation, cluster warhead, armor-piercing warhead weighing up to 250 kg (551 lb). The Kh-38 has a 5-meter (16-ft) circular error probability. \\nThe MiG-29K has two RD-33MKs turbofan engines to give it excellent acceleration and a top speed of Mach 2.25. Equipped with smokeless combustion chamber and new full authority digital engine control (FADEC) system they are engineered to reduce infrared signature and improve aircraft camouflage . With 4,560 kg of internal fuel, a combat radius is 850 km (531 mi). It can be increased to 1,300 kilometers with 3 underwing fuel drop tanks. \\nThe fighter can both conduct aerial refueling and «buddy» refuel other aircraft. \\nThe MiG-29K is equipped with three multifunctional color liquid-crystal displays a four-channel digital fly-by-wire flight control system, passive anti-radar missile homing system, Sigma-95 GPS receiver, TopGun helmet-mounted targeting system and electronic countermeasures (ECM). An onboard oxygen generating system eliminates the need for heavy oxygen canisters. The types of combat missions can be increased by adding optronic/infrared imaging reconnaissance pods. \\nThe avionic suite is based around the Zhuk-ME pulse Doppler radar. With a detection range of up to 120 km, the Zhuk-M radar is capable of terrain mapping and following. In the air targeting mode, the Zhuk-ME can track up to ten air targets while engaging four targets simultaneously. In air to surface mode the radar can detect a tank from up to 25 kilometres (16 mi) away and a bridge at the distance from 120 kilometres (75 mi) away, a naval destroyer could be detected up to 300 kilometres (190 mi) away, while up to two surface targets can be tracked at once. The radar has a scanning area of +/- 85 degrees in azimuth and +56/-40 in elevation. The fighter has multichannel infra-red search and track (IRST) system with target designation system. IR and laser sighting devices for ground targets illumination can also be installed. \\nThe MiG-29K boasts low radar cross section, advanced aerodynamics, electronic-warfare capabilities, standoff weapons and a melee of air-to-ground weapons to strike terrorist targets. \\nA deployment of ship-based strike aircraft in the areas far away from the mainland is something only a first-rate world power can do. Russia showcases it’s a member of the club. The deployment will significantly beef up the strike capability of Russian forces deployed in Syria. The overall strengthening of the Navy in the Mediterranean supports the policy aimed at strengthening Russia’s foothold in the Middle East and North Africa.\""}, "time": 1742563749.651629}