{"duration": 0.0641326904296875, "input_args": {"text": "'Weekly Standard senior editor Christoper Caldwell writes at the New York Times:[President Trump presents a problem to those who look at politics in terms of systematic ideologies. He is either disinclined or unable to lay out his agenda in that way. So perhaps it was inevitable that Mr. Trump’s chief strategist, Stephen K. Bannon, who does have a gift for thinking systematically, would be so often invoked by Mr. Trump’s opponents. They need him not just as a hate object but as a heuristic, too. There may never be a “Trumpism,” and unless one emerges, the closest we may come to understanding this administration is as an expression of “Bannonism. ” Mr. Bannon, 63, has won a reputation for abrasive brilliance at almost every stop in his unorthodox career  —   as a naval officer, Goldman Sachs mergers specialist,   financier, documentary screenwriter and director, Breitbart News   impresario and chief executive of Mr. Trump’s presidential campaign. One Harvard Business School classmate described him to The Boston Globe as “top three in intellectual horsepower in our class  —   perhaps the smartest. ” Benjamin Harnwell of the Institute for Human Dignity, a Catholic organization in Rome, calls him a “walking bibliography. ” Perhaps because Mr. Bannon came late to conservatism, turning his   energy to political matters only after the Sept. 11 attacks, he radiates an excitement about it that most of his conservative contemporaries long ago lost.   …     Many accounts of Mr. Bannon paint him as a cartoon villain or internet troll come to life, as a bigot, an   a misogynist, a  . The former House speaker Nancy Pelosi and Representative Jerrold Nadler, Democrat of New York, have even called him a “white nationalist. ” While he is certainly a   conservative of some kind, the evidence that he is an extremist of a more troubling sort has generally been either massaged, misread or hyped up. There may be good reasons to worry about Mr. Bannon, but they are not the ones everyone is giving. It does not make Mr. Bannon a fascist that he happens to know who the   Italian extremist Julius Evola is. It does not make Mr. Bannon a racist that he described Breitbart as “the platform for the  ”  —   a broad and imprecise term that applies to a wide array of radicals, not just certain white supremacist groups.   …     When Mr. Bannon spoke on Thursday of “deconstructing the administrative state,” it may have sounded like gobbledygook outside the hall, but it was an electrifying profession of faith for the attendees. It is through Mr. Bannon that Trumpism can be converted from a set of nostalgic laments and complaints into a program for overhauling the government.   Read the complete column at the New York Times.'"}, "time": 1742563909.3292592}