{"duration": 0.028891801834106445, "input_args": {"text": "'In a report this week, CNN en Español catches up with a Venezuelan embassy whistleblower who revealed a   scheme to sell official Venezuelan identification documents to Middle Eastern citizens, including many suspected of ties to Hezbollah. [The revelations in CNN’s report are not new, though the whistleblower’s consistency in repeating his story is notable, and CNN received denials (and threats to have their journalists expelled from the country) from Venezuelan officials.  In November 2015, Misael López Soto fled the Venezuelan embassy in Baghdad and posted a video to YouTube detailing how his officials requested he participate in a scheme to sell authentic documents to Mideast nationals. “I have made public how, under the complacent eye of diplomats in the mission [in Baghdad] local employees delivered visas, passports, birth certificates, and other types of Venezuelan documentation to citizens of Syria, Iraq, Palestine, and, in some cases, Pakistan,” he said in the video. López added that those who benefitted from the project could very well have ties to international terrorist organizations. “In many cases, they were tied to terrorist groups, most of the Shiite variety,” he said at the time, and placed the average price of such a document at up to $15, 000. López also alleged that Venezuelan nationals would receive Iraqi identities for the right price, leading to individuals with criminal pasts resorting to bribing socialist Venezuelan officials to leave the country. López  —   now living in Toledo, Spain  —   has not changed his story. In an interview with CNN en Español this week, he reiterated that he believed many of those buying government documents from the Venezuelan embassy in Baghdad did so as part of their involvement in terrorist activity. Ambassador Jonathan Velasco, López says, “gave me an envelope full of visas and passports and told me ‘take care of this, you have a million dollars in your hands. ” “He later explained to me that, in Iraq, people paid a lot of money for a visa or a passport. I thought it was a joke,” he continued. López vividly recalls one incident in which a colleague at the embassy attempted to sell visas to Venezuela to thirteen Syrians for $10, 000 apiece. “Her excuse was that they wanted to go to the World Cup in Brazil in 2014,” he told CNN. “I suspected they were terrorists so I completely refused. ” CNN traced López’s claims back to 2013 and found evidence that up to 173 Middle Eastern nationals received authentic Venezuelan documents, including passports, between 2008 and 2013. CNN concluded some these individuals had ties to the terrorist organization Hezbollah, which has long boasted ties to the socialist government in Caracas. The relationship between Hezbollah and the government of late dictator Hugo Chávez traces back to 2007, according to the Spanish book Boomerang Chávez. Spanish journalist Emili Blasco, who wrote the book, alleged that Chávez sent his   Affairs Minister Nicolás Maduro to Damascus, Syria. There, Maduro met with, among others, Syria’s head of state Bashar   and Hezbollah chief Hassan Nasrallah. At least 300 Hezbollah members subsequently received Venezuelan identification documents, according to subsequent reports. The Center for a Secure Free Society (SFS) a   think tank, published a report in 2014 revealing that the Venezuelan government had issued an estimated 173 passports, visas, and permits to Middle Eastern nationals between 2008 and 2012, matching the timeline in the book Boomerang Chávez. SFS also accused Cuba of funding the scheme to provide these documents. Cuba’s role in the scheme surfaced once again in documents released by the International Consortium of Investigative Journalists (ICIJ) in early 2016. The “Panama Papers” revealed that law firm Mossack Fonseca played a role in transferring Cuban funds into a shell corporation later used by Venezuela to buy advanced passport printing equipment. The plan to purchase new printing equipment traced back to 2005, according to the documents ICIJ made public. Multiple Venezuelan government officials denied these allegations to CNN journalists in investigations spanning the past year and published this week. In one case, Venezuelan officials threatened to expel a CNN journalist after attempting to ask Foreign Minister Delcy Rodríguez about López’s claims.'"}, "time": 1742628562.6920693}