{"duration": 0.01568889617919922, "input_args": {"text": "'The FBI has learned of more emails involving Hillary Clinton’s private email server while she headed the State Department, FBI Director James Comey told several members of Congress, telling them he is reopening the investigation. “In connection with an unrelated case, the FBI has learned of the existence of email that appear to be pertinent” to Clinton’s investigation, Comey wrote to the chairs of several relevant congressional committees, adding that he was briefed about the messages on Thursday. “I agree that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” \\nFBI Director Comey, in letter to members of Congress, says FBI is investigating additional emails in Clinton private server case pic.twitter.com/Ue0qlhqT5w \\n— Bradd Jaffy (@BraddJaffy) October 28, 2016 \\n\\nThe FBI director cautioned, however, that the bureau has yet to assess the importance of the material, and that he doesn’t know how long that will take.\\nFBI Dir just informed me, \"The FBI has learned of the existence of emails that appear to be pertinent to the investigation.\" Case reopened\\n— Jason Chaffetz (@jasoninthehouse) October 28, 2016 \\n\\nStocks fell after Comey’s announcement, CNBC reported.\\nRepresentative Bob Goodlatte (R-Virginia), chair of the House Judiciary Committee, praised the decision to reopen the case.\\n“Now that the FBI has reopened the matter, it must conduct the investigation with impartiality and thoroughness,” he said in a statement. “The American people deserve no less and no one should be above the law.” \\nAlmost 15,000 new Clinton emails were discovered in September.\\n\\nIn mid-October, Rep. Jason Chaffetz (R-Utah), chair of the House Oversight and Government Reform Committee, promised at least “four new hearings” after Congress returns from recess in November based on the new emails, which lawmakers received but have not been made public.\\n“This is a flashing red light of potential criminality,” Chaffetz said.\\nThe new evidence points to a “quid pro quo” arrangement between the FBI and the State Department, he noted.\\nDEVELOPING — DETAILS TO FOLLOW\\nSource: RT News \\n'"}, "time": 1742628543.3095064}