{"duration": 0.09441614151000977, "input_args": {"text": "\"Share on Facebook This can result in fatigue, dizziness, shortness of breath, pale or yellow skin, irregular heartbeats, muscle weakness, mental confusion, unsteady movements, and mental confusion or forgetfulness. (1) Nobody wants to deal with those sort of health issues so pharmaceutical companies have come up with a solution: multivitamins. One of the most popular brands in America is Centrum. In one capsule, you can receive all the necessary nutrients you need to maintain a healthy lifestyle. It sounds too good to be true. And it is. Americans take this pill on a daily basis, and the only difference it makes to the consumer is a significantly lighter wallet. The World-Wide Popular Health Scam Named Centrum Last year, Centrum was ranked as the second leading U.S. multivitamin brand, its sales being 189.6 million American dollars. (2) This multivitamin was created by Pfizer, the world's largest pharmaceutical company. Pfizer is also dubbed “manufacturer of fine chemicals,” after a history of health care fraud and illegal marketing (3) that began soon after begin launched in 1849. (4) Despite its sketchy background, Centrum is extremely popular, probably due to the multi-billion dollar ad marketing campaign by Pfizer, most of which are trumped claims with dubious backings. (3) Why Centrum is Bad For Your Health Here is a list of Centrum's ingredients under three categories: 1. Minerals and Vitamins (with Poor Absorption) Calcium Carbonate – This is the least absorbable forms of calcium available in the market. Only a small percent is ingested into the body. Ferrous Fumarate – This iron supplement often causes constipation which causes an overgrowth of harmful flora. As a result, you may experience gastrointestinal issues, a compromised immune system, and problems with nutrient absorption. This is an obviously bad choice for a multivitamin. (5) DL-Alpha Tocopherol – This is a synthetic form a vitamin E supplement. Researchers at Oregon State University found that the body excretes this artificial form three times as faster than the natural. Meaning, the benefit is decreased threefold. (6) Nickelous Sulfate and Tin – This would be great if you had a nickel or tin deficiency. Except no one has this problem. Even so, when minerals are bound to a sulfate, this decrease their absorption ability. Talc – This is a mineral made up of mostly magnesium, silicon, and oxygen. However, talc can contain asbestos, a substance known to cause cancers. (7) 2. Fillers and Binders Pregelatinized Corn Starch – This is purely a binder with no benefits. It is likely to be made from genetically modified corn which creates a number of adverse reactions, especially for those who are sensitive to it. BHT – Butylated hydroxyanisole is a preservative that science has found to be toxic to the liver, thyroid, lungs, kidneys, and can affect blood coagulation. It can also promote tumors. Gelatin – This multivitamin is officially unfit for vegetarians and vegans. Hydrogenated Palm Oil – The process of hydrogenating any oil makes the oil rancid, turning it into a strong free radical which promotes cancer and heart disease. Sodium Benzoate – This is an overused preservative that has been shown to cause organ toxicity. Sodium Aluminosilicate – This common food additive for its anti-caking effects can cause health organ deterioration. It contributes to the detrimental properties of table salt. (8) 3. Artificial Colors FD&C Yellow No. 6 Aluminum Lake – Yes, there is food coloring in a multivitamin, and this one was actually derived from coal tar, a reproductive toxin. Studies found it to cause adrenal tumor in the lab animals. (9)(10) How To Choose a Good Multivitamin A health supplement should not have a minuscule amount of good properties with such detriment along with it. Instead, pick a multivitamin without additives and artificial colors, with the benefits of the vitamins are absorbed. It would be a good idea to choose a tried and true brand from a health food store as opposed to the commercially popular kinds found in a pharmacy. Remember you get what you pay for, and it’s better to pay for a better vitamin now than for disease treatment later on. Unfortunately, Centrum isn't the only health scam on the market. Most cheap multivitamins and supplements can do more harm than good. Many multivitamin trials have resulted in cardiovascular issues, depleted cognitive function, and acute respiratory tract infections. Especially in women, there has been cases of cancer and even mortality. (11) Of course, it would be optimal to simply eat all the nutrients we need. This can sometimes become challenging but, don't worry, you can still have your proper vitamins supplemented. Here are a few recommended brands: Douglas Labs\""}, "time": 1742561862.3019335}