{"duration": 0.055396318435668945, "input_args": {"text": "'Samsung sales double in Pakistan after reports of exploding devices Posted on Tweet (Image via mirror.uk) \\nAmidst reports of plummeting mobile phone sales, widespread losses, exploding Note 7s, J5s and washing machines, Samsung might have found a morally depressing silver lining. Our correspondent understands from his sources that Pakistani businessmen, investors, realtors and dealers have expressed interest to invest in faulty Samsung devices. \\nOne Pakistani businessman, speaking on the condition of anonymity, said, “Yeah, I am one of the biggest traders in my district. I’ve dealt with guns, grenades, IEDs, but never something as innovative as an exploding cell phone. You have no idea how tough it is to smuggle such goods through airports. As it is, our potential recruits are dumb enough to scan themselves , so forget the thought of taking weapons past the scanner. But if we manage to get to get a few phones, it will be revolutionary!” \\nAnother, an investor whose line of work involves making losses by financing suicide-bomb teachers and trainees, is glad that his colleagues are trying to use phones instead of the regular IEDs. “Teachers and trainees are less likely to die by the explosion of a single phone and I might have a chance of getting my money back,” he exclaimed, with an expression of delight on his face that is seen only when he looks at goats. \\nRealtors of Pakistan (No, not the kind who sell land like in the rest of the world) are overjoyed by the thought of burying washing machines instead of landmines, which they claim are far less expensive and far more beautiful to look at. \\nSources also add that lobbies in Pakistan wanted their government to ink MoUs with Samsung to import their Note 7s and washing machines, but didn’t as they aren’t sure who’s running their government. \\nSamsung hasn’t commented on the interest shown by Pakistanis yet. Indian sources expect that they will dignify Pakistan with a (non-)response the same way the United Nations responds to Nawaz Sharif for his ‘Mummy!-India-used-my-rubber’-type complaints.'"}, "time": 1742562404.9716716}