{"duration": 0.056571245193481445, "input_args": {"text": "'Alaska Airlines Makes History with First Bio-Fueled Commercial Flight Nov 22, 2016 0 0 \\nUsing renewable bio-fuel made from sustainable forest wastes of branches and bark from the Pacific Northwest, Alaska airlines made history this week. A flight from Tacoma, WA to Washington, D.C. used only biofuel to carry its passengers. \\nAlaska airlines will have removed much of its traditional fuel from its fleet by the year 2020 under its sustainability plans and claims it is the first airline to use a wood-based alternative fuel on a commercial passenger flight. \\nAlaska Air says it used 1,080 gallons of the biofuel on the flight. Though bio-fuels are much more expensive to burn that traditional petroleum-based fuels for now, they burn cleaner and don’t require fracking, cause oil spills, or cause other environmental disasters in order to support the commercial aviation industry. \\nTraditional jet fuel is a hydrocarbon, almost exclusively obtained from the kerosene fraction of crude oil. Two types of fuels are used in commercial aviation: Jet-A and Jet A-1. Fuel specifications for aviation fuels are very stringent. As greener fuels are developed, the aviation industry will have to change also, adapting their rules to allow biofuels like the ones that airlines are starting to test. \\nSolar airplanes are also in development, but there are no commercial flights using solely solar, just yet. \\nThough there are numerous plants that would lend themselves to the sustainable creation of bio-fuels, hemp could be one of the most successful. It grows easily (like a weed), and requires no pesticides to cultivate. Researchers at University of Connecticut have found that the fiber crop Cannabis sativa, known as industrial hemp , has properties that make it very attractive as a raw material, or feedstock, for producing biodiesel – a sustainable diesel fuel made from renewable plant sources. \\nMany experts argue that a single farm growing Cannabis could produce enough fuel to power their whole farm with the oil from the seeds they produce. \\nRichard Parnas, a professor of chemical, materials, and biomolecular engineering who led the study says , \\n“For sustainable fuels, often it comes down to a question of food versus fuel,” says Parnas, noting that major current biodiesel plants include food crops such as soybeans, olives, peanuts, and rapeseed. “It’s equally important to make fuel from plants that are not food, but also won’t need high-quality land.” \\nThough Alaska’s first commercial flight using a managed-forests’ ‘waste’ is a step in the right direction, far too many forests are clear-cut to be relying solely on forest debris to replace petrochemically made fuel for the entire globe. Cannabis could be a great alternative.'"}, "time": 1742563501.0114605}