{"duration": 0.06916213035583496, "input_args": {"text": "'Posted on October 27, 2016 by Sean Adl-Tabatabai in News , US // 0 Comments \\nJohn Podesta’s emails released by WikiLeaks reveal that the Democratic National committee (DNC) forced Bernie Sanders out of the race in order to ensure a Clinton victory. \\nThe DNC functioned as an unofficial Clinton campaign department, rather than the impartial organisation it was supposed to be. \\nObserver.com reports: \\nIn December 2014, Clinton campaign manager Robby Mook sent an email to top staffers in which he described a conversation he had with White House Political Advisor David Simas about picking DNC employees who would serve in the best interest of Clinton. Jen O’Malley Dillon was cited as their pick to serve in a “general election planning/preparation role.” \\n“Jen O’Malley Dillon, a former deputy campaign manager to Obama in 2012 who is now at Precision Strategies, a firm co-founded by senior Clinton aide Teddy Goff, has informally advised the Clinton campaign and also served as an adviser to theDNC in a role described by some Democrats this spring as a frequent go-between,”reported BuzzFeed in July. “Sanders, a frequent Wasserman-Schultz critic, never enjoyed the same dynamic.” \\nThe Podesta emails have also revealed that DNC interim chair Donna Brazile worked behind the scenes as a surrogate for the Clinton campaign, violating the neutrality her position as DNC vice chair demanded. Brazile tipped off the Clinton campaign to a difficult CNN town hall question, forwarded them aSanders Outreach campaign outline, and sent an email from CNN staff about a report on the Clinton campaign. Clinton campaign staff also described Brazile as aClinton campaign surrogate in email correspondence. \\nAn April 2015 email confirmed that the DNC and Clinton campaign coordinated torig the debate schedule for Clinton. “Through internal discussions, we concluded that it was in our interest to: 1) limit the number of debates (and the number in each state); 2) start the debates as late as possible; 3) keep debates out of the busy window between February 1 and February 27, 2016 (Iowa to South Carolina)” read the email from Charlie Baker, a senior advisor to the campaign from the Dewey Square Group. “The other campaigns have advocated (not surprisingly) for more debates and for the schedule to start significantly earlier.” \\nA memo from Mook’s assistant dated April 2015 was shared with Clinton staff and the DNC, it outlined a shared strategy to to elevate “pied-piper” candidates such asDonald Trump. “We think our goals mirror those of the DNC,” stated the memo, attached to the email under the title “muddying the waters.” \\nMook expressed frustration in a March 2015 email over the DNC hiring a convention CEO without consulting the Clinton campaign. “Madame Secretary, I’m not going to call anyone or say anything until you have your conversation with DWS, but this concerns me a lot,” wrote Mook. “John–you, Charlie and I may need to sit down with Debbie to make clear how we want things to change/improve before we are willing to consider playing ball with them.” This suggests the Clinton campaign let the DNC and then-chair Debbie Wasserman Schultz know who was boss, and after the incident the DNC and Clinton campaign coordinated more closely together to boost Clinton’s candidacy. \\nThe released WikiLeaks emails boost the case that the DNC and Democratic Partyleadership subverted democracy to ensure Clinton’s coronation. This collusion and unethical coordination is equivalent to an athlete using performance-enhancing drugs to win a race. While Clinton received over two million more votes than Bernie Sanders in the primaries, her candidacy benefited from the Democratic Partyleadership bending and breaking the rules to rig the primaries for her campaign.'"}, "time": 1742562703.2988532}