{"duration": 0.05279731750488281, "input_args": {"text": "'Videos Thursday, 03 November 2016 Hillary Clinton: \"I\\'m Sick and Tired of the Negative, Dark, Divisive, Dangerous Vision and Behavior” of Trump Supporters Email \\nNow that her coronation appears to be escaping her grasp, Democrat Party presidential candidate Hillary Rodham Clinton is showing another side of her personality . On Tuesday night a heckler interrupted her speech, waving a sign that read “Bill Clinton is a rapist.” Her response, instead of showing her usual controlled aplomb and restraint, surprised the crowd at its intensity and ferocity. Pointing at the offender and shouting at the top of her voice, Clinton exploded: I’m sick and tired of the negative, dark, divisive, dangerous vision and behavior of people who support Donald Trump! \\nThe protestor was immediately led away and his sign was torn apart. It turned out that the protestor was vying for a cash prize being offered by Alex Jones of InfoWars.com to anyone appearing either on television or at a Clinton rally chanting “Bill Clinton is a rapist” and wearing a t-shirt bearing the same slogan. \\nNBC News tried to downplay the interruption, noting that while other protestors have shown up at rallies featuring President Obama and Bill Clinton himself, they are bringing attention to “decades-old allegations from three women who accuse Bill Clinton of sexual misconduct. The former president has denied all of the allegations.” \\nThe video of Hillary’s outburst is here: \\nThere’s an old saying, “A measure of a person is the size of the thing that gets her goat.” Hillary’s goat, in the form of a protestor interrupting her speech, was sufficient to expose how close to the edge Hillary lives when things don’t go her way. \\nTNA contributor Selwyn Duke has posted numerous verbal tirades from Clinton on his website, none of which are acceptable to be printed here. They do, however, reflect the mental instability of an individual behaving like a child when her candy is taken away. Her foul mouth shows the degree of corruption from which she suffers, as explained in James 3:5,6: Likewise, the tongue is a small part of the body, but it makes great boasts. Consider what a great forest is set on fire by a small spark. The tongue also is a fire, a world of evil among the parts of the body. It corrupts the whole body, sets the whole course of one’s life on fire, and is itself set on fire by hell. \\nJesus Himself said it best of all: What goes into someone\\'s mouth does not defile them, but what comes out of their mouth, that is what defiles them. \\nClinton has spent nearly her entire adult life seeking power. Now that the ultimate prize — once so close she could taste it — is escaping her, the real Hillary is being exposed. \\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . \\nPlease review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563284.761603}