{"duration": 0.03625082969665527, "input_args": {"text": "'November 4, 2016 9:46 am \\nLower bitstream would be enough, nothing to do with hosting. Reply - Share JJ November 4, 2016 8:38 am \\nSurprisingly uk radio 4 this am…a report about the 3 rebel suicide bombs killing so many in western Aleppo, numbers of dead and injured .tied in with announcement of end of humanitarian pause by the end of the day………..even a reference to the numbers of foreign fighters from tens of countries present there. \\nlast chance saloon for those defiant war criminal murderous rebels, now Russian fleet is in place. Fireworks in Syria this November Fifth? Maybe? Perhaps Stefan de Mistura may approve of Aleppo being saved by legitimate government and State of Syria. Reply - Share JJ November 4, 2016 8:45 am MOSCOW, October 16. /TASS/. The Russian Defense Ministry and the US Department of Defense will soon sign a document on safety of flights above Syria, all technical issues have been agreed, the head of the Main Operations Directorate of the Russian Armed Forces General Staff, Col. Gen. Andrey Kartapolov, said Friday. “Now all technical issues have already been agreed and today Russian and American legal experts are verifying the text of the document. We hope that the document will be signed as soon as possible,” Kartapolov said at a briefing for foreign military attaches and journalists. The general recalled that three video conferences of Russian and US militaries had been held earlier. The conferences were dedicated to drafting a memorandum on prevention of incidents and ensuring safety of flights above Syria. “This will ensure conditions to prevent specific situations that could create an incident in Syrian airspace during activities of the aviation of the Russian Federation and partners in the coalition. We are speaking for expansion of cooperation in that sphere and are open for contacts with all interested sides,” Kartapolov said. READ ALSO General Staff: Russian forces delivered air strikes on 380 IS facilities in Syria Russian Navy ships may join Syria operation — General Staff Russian military officer says US ashamed of cooperating with Russia against IS Putin: Russian forces show impressive results in Syria, hundreds of terrorists killed Lavrov, Kerry satisfied with work of military on Syria Earlier, Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said that during the third video conference, the sides managed to bring their positions closer and agree on the order of further activities. Russia’s Aerospace Forces … Read more » Reply - Share JJ November 4, 2016 9:35 am Russian President Vladimir Putin during a meeting of the operational Security Council discussed the situation in Syria, including in the context of a decision to hold another humanitarian pause – according to the Kremlin website. The Defense Ministry denied the information about the death of Russian soldiers as a result of the shelling of the helicopter in the Syrian province of Hama. As noted in the Ministry of Defense, the helicopter VKS Russia made an emergency landing by performing routine delivery of humanitarian assistance in one of the settlements 40 km northwest of Palmyra. “During the inspection of the helicopter crew on the ground landing site underwent mortar fire fighters – told the Center for reconciliation of the warring parties in the CAP -. car crew was not injured and was promptly delivered to the search and rescue helicopter at an air base Hmeymim “. The number of settlements that have joined the reconciliation process has increased to 884. The number of armed groups that have declared their commitment to adopt and implement a cessation of hostilities conditions, has not changed – 69. During the day recorded 39 attacks by illegal armed groups in the provinces of Damascus (16) Aleppo (15), Daraa (6), Latakia (1) and Hama (1). The Russian VKS and Air Force Syria opposition armed groups, have declared a cessation of hostilities and to report to the Russian or American centers reconciliation information about their location, strikes not applied. Terrorists in Syria have used humanitarian pause in Aleppo to regroup and replenish the arsenal, said the official representative of the Russian Foreign Ministry Maria Zakharova. “The situation in Syria, unfortunately, very heavy, the … Read more » Reply - Share'"}, "time": 1742628590.1346285}