{"duration": 0.05182647705078125, "input_args": {"text": "'by Yves Smith \\nI just received an e-mail from AirBnB which patently violates the CAN-SPAM Act by virtue of not having an unsubscribe option. It’s even cheekier for AirBnB to be contacting me since I am deeply opposed to AirBnB and have never once visited their site, and never have or would use their service, either as a lodger or a host. That means they are very likely to have violated the CAN-SPAM Act in a second manner, by virtue of having harvested my e-mail address . \\nA big problem with CAN-SPAM is the only parties with a right of action are “Internet Access Services” and not “natural persons,” as in end recipients. \\nHere are the relevant provisions of the CAN-SPAM Act per Wikipedia : \\nThe 3 basic types of compliance defined in the CAN-SPAM Act, unsubscribe, content and sending behavior compliance, are as follows: \\nUnsubscribe compliance A visible and operable unsubscribe mechanism is present in all emails. Consumer opt-out requests are honored within 10 business days. Opt-out lists also known as Suppression lists are only used for compliance purposes. \\nContent compliance Accurate “From” lines (including “friendly froms”) Relevant subject lines (relative to offer in body content and not deceptive) A legitimate physical address of the publisher and/or advertiser is present. PO Box addresses are acceptable in compliance with 16 C.F.R. 316.2(p) and if the email is sent by a third party, the legitimate physical address of the entity, whose products or services are promoted through the email should be visible. A label is present if the content is adult. \\nSending behavior compliance A message cannot be sent through an open relay A message cannot be sent without an unsubscribe option. A message cannot be sent to a harvested email address A message cannot contain a false header A message should contain at least one sentence. A message cannot be null. Unsubscribe option should be below the message. \\nHere’s the offending message, with the subject line, “Discrimination and Belonging: What it Means for You,” in its entirety: The Airbnb Community Commitment Hi, Earlier this year, we launched a comprehensive effort to fight bias and discrimination in the Airbnb community. As a result of this effort, we’re asking everyone to agree to a Community Commitment beginning November 1, 2016. Agreeing to this commitment will affect your use of Airbnb, so we wanted to give you a heads up about it. What is the Community Commitment? You commit to treat everyone—regardless of race, religion, national origin, ethnicity, disability, sex, gender identity, sexual orientation or age—with respect, and without judgment or bias. How do I accept the commitment? On or after November 1, we’ll show you the commitment when you log in to or open the Airbnb website, mobile or tablet app and we’ll automatically ask you to accept. What if I decline the commitment? If you decline the commitment, you won’t be able to host or book using Airbnb, and you have the option to cancel your account. Once your account is canceled, future booked trips will be canceled. You will still be able to browse Airbnb but you won’t be able to book any reservations or host any guests. What if I have feedback about the commitment? We welcome your feedback about the Community Commitment and all of our nondiscrimination efforts. Feel free to read more about the commitment . You can also reach out to us at . The Airbnb Team Sent with ♥ from Airbnb \\u200cA\\u200ci\\u200cr\\u200cb\\u200cn\\u200cb\\u200c,\\u200c \\u200cI\\u200cn\\u200cc\\u200c.\\u200c,\\u200c \\u200c8\\u200c8\\u200c8\\u200c \\u200cB\\u200cr\\u200ca\\u200cn\\u200cn\\u200ca\\u200cn\\u200c \\u200cS\\u200ct\\u200c,\\u200c \\u200cS\\u200ca\\u200cn\\u200c \\u200cF\\u200cr\\u200ca\\u200cn\\u200cc\\u200ci\\u200cs\\u200cc\\u200co\\u200c,\\u200c \\u200cC\\u200cA\\u200c \\u200c9\\u200c4\\u200c1\\u200c0\\u200c3\\u200c Airbnb Ireland, The Watermarque Building, South Lotts Rd, Ringsend, Dublin 4, VAT Number: 9827384L 0 0 0 0 0 0 This entry was posted in Guest Post on'"}, "time": 1742562719.8821}