{"duration": 0.18719220161437988, "input_args": {"text": "\"Email \\nIn the following interview with the X22Report Spotlight report, Dr. Jim Willie unleashes with both guns blazing on a subject I’ve been warning about for about for over two years now, which is the loss the U.S. Dollar’s status as the World’s Global Reserve Currency. \\nFor the simple fact that no one under the age of 70 has never known a planet earth where the U.S. Dollar has not been the World’s Reserve Currency, most Americans in particular have no idea what it will mean when we lose that status. \\nThe subject is not one that is taught in schools until well into the graduate school level in most cases, so unless a person has done independent research on the subject, the average American cannot comprehend how painful it will be for individual American families not IF, but WHEN the inevitable finally happens. \\nLosing the World Reserve Currency status is a process, just like losing the world’s faith in the U.S. was a process. Both are processes that have been well underway for the better part of the last two decades, especially this past decade. Roughly ten years ago, 75% of global trade was denominated in U.S. Dollars, and that makes sense. After all, we’ve been the Reserve Currency. \\nOver the last ten years, that figure has dropped to roughly 35% of all global trade which is now settled in U.S. Dollars, because countries are rushing to distance themselves from the U.S. for many of the reasons Dr. Willie outlines in another interview from earlier today titled, Dr. Jim Willie: Unprecedented Bond Dumping Means U.S. Dollar Collapse Ahead . \\nThe bottom line is this: The U.S. has grossly abused its privilege of being the World Reserve Currency, largely because we've adopted the practice of monetizing our debt by printing money out of thin air. Giving that process a fancy name like Quantitative Easing, doesn't change the reality of what it is. We print money out of thin air, and rip-off every country we've borrowed from when we pay them back with Dollars worth less than the ones we borrowed. \\nNow, the world has lost all faith in the only thing that backs the U.S. Dollar in the first place: The Full Faith and Credit of the United States Government. In the interview, Dr. Willie gives a BLISTERING account of what to expect. He begins the first 30 seconds of the interview by explaining how once the U.S. Dollar is finished being phased out, a process that as I’ve said is well underway, he expects the Dollar to experience a massive currency devaluation of 30% almost instantly. \\nAfter the initial devaluation of 30%, Dr. Willie expects there to be another another 30% devaluation six to eight months down the road, followed by a long series of 20% devaluations over the next several years, until we reach a point in about 4-5 years when our currency is completely devalued, and worth about 10% of what it is today. \\nFor a country with a trade deficit of over $500 BILLION, and as a country that imports over 50% of our food… that means conditions Americans once considered to be unthinkable here in the United States, will soon become ordinary. Let that sink in for a moment. The unthinkable will become ordinary. The time to prepare is now. Brace yourself for a very intense interview… one of Dr. Willie’s most intense ever! \\nDO NOT MISS THE SECOND VIDEO BELOW WITH CANADIAN BILLIONAIRE NED GOODMAN, AS HE LECTURES ON THE COMING COLLAPSE OF THE U.S. DOLLAR! \\n\\nAs individual Americans or as families, in the past when we’ve heard news from pundits or politicians talking about issues like trade deficits, bad trade deals, or the federal debt, many times what we hear goes in one ear and out the other, because many of us cannot SEE or FEEL how those reports affect our families on a daily basis, or in our every day lives. \\nThe loss of the Reserve Currency is not something that might happen. It’s not something that could happen. It’s an eventually that there’s no chance of avoiding. That ship set sail far too long ago to fix the damage already done, and what lies ahead. It’s not an event where a vote is taken, and we’ll lose the status over night thanks to anything done by a U.N. vote, or by our own politicians in Washington. What's done is done, now it just has to play out. \\nAs explained, it’s a process, and it’s well underway. I could not be more serious when I say that conditions Americans once considered to be unthinkable in the United States, will soon become ordinary. If you’re fortunate enough to still be working, and you have an income, do not squander your opportunity to protect your family. Begin preparing. There is a reason Peter Schiff has said: The Collapse of the Dollar Will Be the Single Biggest Event In All of Human History . \\nHow The Coming Dollar Collapse Will Leave Americans Destitute \\nAn increasing number of financial experts are saying the United States dollar is no longer a reliable and dependable currency – and that its downfall is inevitable. There are even some experts who think the dollar is so unstable that the Chinese Yuan will soon become the world’s reserve currency, or currency of choice. \\n“Our addictions to debt and cheap money have finally caused our major international creditors to call for an end to dollar hegemony and to push for a ‘de-Americanized’ world,” investment advisor and financial strategist Micheal Pento wrote in an op-ed piece for CNBC . \\nOthers agree. \\n“In my view the dollar is about to become dethroned as the world’s defacto currency basically,” Canadian billionaire investor Ned Goodman said. “We’re headed to a period of stagflation , maybe serious inflation , and the United States will be losing the privilege of being able to print at its will the global reserve currency.” \\nGoodman believes the US already is in another recession. The unemployment numbers are understated and the “real” unemployment number likely is closer to 15 percent, he said. \\nOver half of 200 international institutional investors surveyed by the Economist think that the Yuan will eventually replace the dollar as the world’s reserve currency. The reserve currency is the money most commonly accepted for international trade. \\n\\nWhy Reserve Currencies Matter \\nHaving money with a reserve currency status enables a nation to dominate and control the world’s financial markets, as their currency is used for international trade and transactions. The US has the ability to maintain a $17 trillion national debt largely because the dollar is the reserve currency. \\nA nation with a reserve currency can simply print money to pay its debts. \\nIn past centuries nations such as Britain, France, Spain, the Netherlands, and Portugal lost their status as super powers in part when their money lost reserve currency status. Reserve currencies collapse because people no longer trust or believe in the governments that issue them. \\nGoodman says that the US dollar became the reserve currency in the 1970s because Saudi Arabia agreed to only accept only the dollar as payment for oil. Goodman noted that at least one major producer, Russia, is now accepting Yuan in payment for oil. \\nGoodman was referring to a deal that Chinese President Xi Jinping and Russian leader Vladimir Putin made last May. Under the terms of deal, Russian companies can borrow money directly from China in exchange for oil. \\nThe US dollar once was backed by gold and silver, Goodman said, but now is “backed by nothing.” \\nAustralia Starts Using Yuan \\nOne of America’s oldest and closest allies may have taken the first step to ending the dollar’s reign as the reserve currency. CNBC reported that the Yuan will now be traded in Australia’s financial markets. Among other things that will let Chinese customers pay Australian firms in Yuan. China is the biggest market for Australia’s exports such as iron and coal. \\nStory continues below video \\n\\nThe Australian government has endorsed the deal because China is Australia’s biggest trading partner. Arthur Sinodinos, Australia’s Assistant Treasurer (treasury secretary) even went on CNBC’s Asia Squawk Box show to endorse the deal. \\n“It’s a big vote of confidence by both countries in the future of the relationship,” Sinodinos said. Not even recent economic problems in China seemed to dampen Sinodinos’ enthusiasm for the arrangement. \\n“There’s no doubt that the Chinese authorities are having to manage issues in the financial sector to make sure that growth is sustained, but they’ve shown great skill at that in the past they were very adept at the fallout from the global financial crisis,” Sinodinos said. In other words, Sinokinos believes the Chinese are doing a very good job of managing their economy and their currency is reliable. \\n\\nHow will the Dethroning of the Dollar Affect You? \\nObservers disagree widely on how the end of the dollar’s reign as reserve currency would affect the US economy and average Americans. Retired neurosurgeon and pundit Dr. Ben Carson thinks it would turn the US into a third world nation and lead to unrest that would lead to martial law, as Off The Grid News recently reported. \\nGoodman believes there will soon be a massive sell off of US dollars that will lead to inflation. He also suggested a way for people to protect their assets. \\n“The Chinese have three and a half trillion US dollars and they’re spending these dollars as quickly as they can, and it will not be long before the rest of the world and the US will be thinking likewise. I do.” Goodman said. \\nIn the 1930s, everyone wanted US dollars, he said, but today they’re trying to get rid of them. He thinks that many investors are trying to spend all of their dollars to buy hard assets in order to avoid losing money invested in dollars. \\nThat means average people might be able to protect themselves by investing in hard assets such as gold, real estate or silver, Goodman said. \\nArticle posted with permission from The Last Great Stand   shares\""}, "time": 1742562456.6327016}