{"duration": 0.10227203369140625, "input_args": {"text": "'“Mr. Wonderful te hace pensar a saco” SELECCIÓN DE RESEÑAS Y RECOMENDACIONES DE USUARIOS «Te hace pensar a saco, tía» \\n\\n¡Holiiis! Soy súper súper súper fan de las cositas cuquis de Mr. Wonderful. Son tan m nas… Así que dije: no dejes para mañana los museos que puedas visitar hoy, y fui al de Mr. Wonderful. Súper chulo, tía. Había mogollón de cosis. ¡Jo, es que las quería todas! Había una taza que decía: “Sonríe, que es lunes, podría ser peor”. Y, jolines, cuánta razón: ¡Era lunes! ¡Y es verdad que podría ser peor! Me imaginé que podría haber nacido en el Tercer Mundo y me dio un yuyu… Hacía años que una taza no me emocionaba tantisisísimo. \\nPILUCA DE CASADAMUNT \\nCasa de mi tía Charo «La decadencia hecha restaurante» \\n★ \\nHacía años que no iba a la casa de mi tía Charo. Por una recomendación muy fuerte de mi madre fui a visitarla. Error. Deprimente. La comida, abundante pero no exquisita. Mi tía Charo ha perdido el don de hacer paellas. La proliferación de restaurantes de ‘nouvelle cuisine’ la ha perjudicado bastante. Lo peor de todo: el trato. La tita Charo me recibió asegurando que había engordado. A la tercera vez que me preguntó si tenía novia decidí no volver hasta que no llegue el momento de repartir la herencia. Decepcionante. \\nBERNAT CANO «Un lugar de fantasía» \\n★★★★ \\nMe gusta acercarme al Palau de la Generalitat con unas gafas con nariz postiza y pasarme horas enfrente, fantaseando con que una patrulla de Mossos d’Esquadra entra allí y encarcela a todos los que hay dentro. Entonces, me imagino que, cuando se llevan al president, un agente me reconoce y me da las llaves del edificio, mientras dice: “Tenga. Esto le pertenece”. Algún día, amigos… Algún día… \\nXAVIER GARCÍA ALBIOL \\nEntradas baratas para ver monólogos «Entradas baratas de monólogos Dani Rovira» \\n★ \\n¿Cómo va esto? Ay alguien k me pueda ayudar? Quiero entradas para ver a Dani Rovira en un monólogo de risa. No encuentro el botón de comprar. Mi hijo Kevin me ha dicho que se puede comprar por el internet pero soy nueva y no se hacerlo Holaaaa? Me llamo Rosa y quiero 2 entradas de Dani Rovira de monólogos, Voy con mi amiga Maite porque me separé hace un año. Busco también algún hombre que quiera conocer gente en concreto a mi, ¿en esta pagina se puede buscar amistad tanbien? Nada de guarrerias es para conocer gente. Luego dios dirá. Ya me mandareis las entradas al correo. De Dani Rovira, dos, cerquita del escenario gracias. \\nROSA CASTRO \\n“El calçot railer”, escuela de cocina catalana «Una experimentación que no deseo a nadie pero atrayente» \\n★★ \\n(Traducción automática) La pasión del viajar es la cocina típica del paraje. Me gusta el conocimiento del proceso de alimentación de la tribu de cada pueblo. La recomendación de mi hermano-en-la-ley de esta escuela de la comida fue recibida con alegría. Pero la decepción me golpeó en la cara como agresión con arenque podrido. El producto era vintage. El pollo fue artífice de debate sobre su color, como un meme de Facebook: algunos percibían que era azul con rayas negras, la oposición lo recibió blanco con ribetes de oro. El maestro fumaba durante la preparación. ¿Resultado? La gran estafa. Cuatro horas empleadas en el frotis de tomate contra pan, que tuvo el bautizo de «pantumaca». Eso no fue plato, eso fue guarrada. \\nBRENDA WALSH \\n\\nEl Mundo Today publica cada viernes en la revista OnBarcelona de El Periódico una selección de las reseñas que la capital catalana recibe en internet.'"}, "time": 1742563960.411051}