{"duration": 0.09110450744628906, "input_args": {"text": "'Spokane, Washington Defeats Monsanto’s Motion to Dismiss PCB Lawsuit Nov 20, 2016 0 0 \\nFor years now, high levels of polychlorinated biphenyls, or PCBs, have been documented in the Spokane River. These are a dangerous class of chemicals produced in the United States, solely by Monsanto, from 1930 until 1977. A lawsuit was launched by numerous U.S. cities against Monsanto in an attempt to remove PCBs from their waterways, and Spokane Washington was among them. In the most recent turn of events in the ongoing PCB saga, Monsanto failed to have Spokane’s lawsuit dismissed by courts . This is a win for the water movement, no less significant than the recent developments at Standing Rock. \\nThere have been numerous outspoken defenders of our water supply, and their voices have grown louder. This issue has become paramount at the Standing Rock stand-off where Native American ‘water protectors’ are standing up for clean water, along with a number of other unalienable human rights , but Standing Rock speaks to a wider environmental catastrophe happening all around us. \\nJudge Mendoza who commented on the court’s decision stated, “The public harm at issue here comes from PCBs reaching the River, but the nuisance itself is Monsanto’s production, marketing, and distribution of the PCBs.” \\nLakes, rivers, oceans and groundwater supplies have been compromised more recently with fracking chemicals , lead, agricultural poisons including pesticides , herbicides , fungicides, and petrochemical fertilizers, PFOA and PFOS ( perflourinated chemicals ), as well as tainted with neurologically impairing fluoride , along with pharmaceutical company drugs including antibiotics, anti-convulsants, mood stabilizers and sex hormones, but PCBs have been contaminating our waterways for nearly a century now. The seemingly clear Spokane River contains some of the most toxic waters in Washington. \\nPCBs are but one type in the chemical onslaught we are being subjected to, but they are extremely dangerous. Congressman Gude issued a statement in 1976 which called attention to this contaminant: \\n“The most important thing about PCB’s … is that we have identified a mad dog—a known bad actor in the case of PCB. There is no doubt about its toxicity and danger in the environment. It has caused millions of dollars worth of damage in the United States; the time has arrived to get rid of it.” \\nThough the probable damage caused by PCBs has been known for decades now, with Monsanto completely aware of the chemicals’ health-damaging nature all along, there are still 1.4 billion pounds of PCBs that the company produced which haven’t been cleaned up. PCBs are an extremely toxic, persistent chemical that can cause cancer, neurological damage, immunological damage, and many other severe human health problems. \\nSpokane’s defeat against Monsanto and the company’s attempt to dismiss responsibility for contaminating the entire planet with PCBs is an enormous win – on par with recent developments at Standing Rock. \\nAs the Spokesman reports , \\n“The lawsuit, which does not specifically state what the city is seeking in monetary damages, also alleges that Monsanto is responsible for the high levels of polychlorinated biphenyls, or PCBs, in the Spokane River. \\nMarlene Feist, the city’s utilities spokeswoman, called the suit “long-term litigation,” and noted that the city will spend $300 million to keep PCBs and other pollutants from entering the river in coming years . \\nPCBs have entered the river by various means, including through commercial and industrial products such as paint, hydraulic fluids, sealants, inks and others.” \\nA spokesman for Monsanto, Charla Lord, says that “Monsanto is not responsible for the costs alleged in this matter.” \\nThis is a contentious point, after all, since these international companies have no problem ruining ancient burial grounds, and destroying water supplies in the name of profit – all the while denying responsibility for any ‘collateral’ damage their practices (manufacturing carcinogenic chemicals, fracking or dumping oil in our oceans, etc.) cause. \\nSpokane’s lawsuit names two companies that spun off from Monsanto in the 1990s, and joins other municipalities seeking damages from the company, including San Diego, San Jose and Westport, Massachusetts. Though monetary compensation does little to repair the environmental and health damage that has already occurred, it will at least force these corporations to think twice about polluting on purpose – a practice they’ve become habitual about. \\nThis lawsuit also brings light, the fact that Monsanto has not only damaged our agriculture through GMOs and their associated chemical herbicides , but that the multinational corporation has been in the poison business from the very beginning. Our water represents only a fraction of the damage this single company has done. It is time to put a stop to their war on human health and the planet at large. We can only hope Spokane finishes this lawsuit successfully and other U.S. cities follow, to start lawsuits of their own.'"}, "time": 1742562930.5368605}