{"duration": 0.11334943771362305, "input_args": {"text": "'It may have been “Tiny House Nation” that finally broke me. Last month this offbeat real estate show on the FYI network began its third season of cramming homeowners into trailers, bungalows and other mini abodes. The homes are little. The season premiere was not. The running time was nearly 65 minutes uninterrupted  —   a full hour and a half with ads. There’s been a lot of talk in the business about “Too Much TV”  —   the surfeit of hundreds of original scripted series every year. But there’s a corollary issue:   TV. Even as viewers’ time becomes more precious, individual episodes are bloating. Television has come down with a case of gigantism. HBO’s   drama, “Vinyl,” began with a   pilot, directed by Martin Scorsese, that vamped on like the coda to “Freebird. ” The series premiere of FX’s drama “Fargo” ran around 97 minutes with ads. “Fargo,” the Coen brothers movie it was based on, ran 98. Episodes of Netflix’s romantic comedy “Love” ambled up to 40 minutes. As a critic, I’m used to championing greater options for artists. We’re lucky to live in a time when TV creators have freedom from arbitrary constraints. But more and more of my TV watching these days involves starting an episode, looking at the number of minutes on the playback bar and silently cursing. Historically, network television was like a container ship the product had to fit standard boxes for ease of shipping. Networks needed predictable schedules and had to turn over specific time slots to affiliates. It was a process  —     episodes were a presence in the early days of television  —   but 30 minutes generally came to mean comedy, and 60, drama. Episodes used to be longer, in that commercial breaks were shorter, but the journey from beginning to end stayed the same. And networks occasionally tinkered with length. NBC supersized its popular Thursday night sitcoms in the early aughts Fox inflated “American Idol” like a Macy’s parade balloon. But those stunts were exceptions. Today’s great fattening, like so many trends in TV now, is in part the influence of streaming TV. The only thing limiting the length of a Netflix or Amazon binge show is your ability to sit without cramping. The menu is bigger, and so are the portions. Meanwhile, basic cable channels realized that there was no reason their “hourlong” series needed to end on the hour. If they pushed a 10 p. m. drama’s end to, say, 11:17, they could give their creators the kind of narrative real estate available on   HBO and Showtime. The most dramatic early claimer of elbow room was FX’s   drama, “Sons of Anarchy,” which piled on plot and ended its   episodes with music montages. Now it’s common for cable hits to plump up. The most recent season finale of “The Walking Dead” ran 90 minutes, though I have rarely seen an episode of “The Walking Dead” that needed its full 60. Like its zombies, it could be hacked down by a third and shamble along just as well. At best, extended episodes can make room for complexity. But focus and showmanship still matter. In a   era, being able to hook an audience is more important, not less. The best examples of Big TV make the most of each moment, instead of padding them out. Take Louis C. K. ’s   barroom drama “Horace and Pete,” whose first episode ran almost 68 minutes and played like live theater. Its third episode  —   essentially a long dramatic monologue about infidelity by Laurie Metcalf  —   is 43 minutes of regret and catharsis, the camera holding tight to Ms. Metcalf’s face. I did not look at my watch once. Louis C. K. may have earned the right to go long by proving he could also go short his FX comedy, “Louie,” included stories that would run only a few minutes if that was all they needed. AMC’s “Better Call Saul,” a more conventional drama, regularly overstays its   slot by a few minutes. But it uses its time mindfully, to suspend tension and let character moments play out. There’s a certain       aspect to longer episodes, even with great shows. When the sixth season of the sitcom “Community” moved to Yahoo from NBC, it was finally free of   constraints  —   and something was off. The pacing was sluggish the jokes were less crystalline. Maybe “Community”  —   a product of the fractious   compromise between art and business  —   needed limits in order to transcend them. Those time constraints and network scissors, much as writers love to bash them, can be the Marie Kondo method of comedy. The first season of Netflix’s “Unbreakable Kimmy Schmidt” was originally made for NBC, and like its spiritual forebear “30 Rock,” it was packed like a diamond. The second season, made for streaming, is still funny, but you can feel the drag in some of its    episodes. TV was raised with rules, the product of technology and business models that had little to do with art. It’s shedding those strictures as it grows up, which is good  —   that’s given us anarchic comedies like “Broad City” and    dramas like “Rectify. ” But freedom also proves the values of the discipline you learn under restrictions. I appreciate ambitious storytelling. But I also appreciate getting a full night’s sleep.'"}, "time": 1742564260.421028}