{"duration": 0.09225082397460938, "input_args": {"text": "'Editor’s Note: The Monsanto Tribunal happened from October 14th through 16th in The Hague, Netherlands. The People’s Assembly was a parallel event, where farmers, consumer movements, and their associated networks discussed how we can feed the world in a safe way. Both events are now over, so what happens now? Read the article below to find out.\\nREAD: Monsanto “Crimes Against Humanity” Tribunal Officially Begins October 14th In Hague Netherlands \\nThe hearings of the Monsanto Tribunal were very impressive, and so was the People’s Assembly. During the last two days of the event, the world watched witnesses’ testimonies, lawyers’ pleas, and the first impressions of the judges. At the Tribunal, 750 people participated in The Hague representing 30 nationalities from all over the world, thousands of people followed online on the livestream and social media, and the Tribunal received a lot of press attention.\\nBoth victims and experts thanked us for giving them a voice on this important international platform — and a very well documented voice in this new process to hold corporations accountable for their acts.\\nThe chairwoman of the Tribunal, Judge Tulkens, expressed the importance of the Tribunal in an interview with the French newspaper, Le Monde:\\nThe questions of the access to water and to healthy food are old. Those are not new issues coming out of the mind of angry activists. Those issues, just like the right to a healthy environment are likely to become more important with climate change. It is our duty to set legal tools to face those issues. The Monsanto Tribunal is a step and a tool within this dynamic.” \\nThe Tribunal received quite a lot of media coverage. From French and German TV news programs to many newspapers and radio programs in various countries. See the links on our social media platforms (and later on the website).\\nDid Monsanto attend the Tribunal? Monsanto was invited to the Tribunal, but decided not to appear for their defense. We did get their attention though. They issued a statement in 5 languages saying that we are ‘pushing’ the wrong issues, since the real discussion is about feeding the world. Monsanto fails to see feeding the world in a safe way was exactly the topic of the Tribunal and of the discussion farmers, consumer movements, and their associated networks had in the parallel People’s Assembly.\\nMany eminent speakers stressed that Monsanto and agribusiness giants like them do not feed the world. Rather, they are involved in producing commodities, feed for animals, fuel for cars, and sugar for the food industry at a very high cost for human health and environment. This is production that feeds profit, not people. It’s the small- and medium-scale farmers that are actually feeding the world.\\nWhat is the purpose of the Monsanto Tribunal and the People’s Assembly? This Tribunal and People’s Assembly are about showing the tremendous costs of industrial farming for humans, for health, and for nature . They are also about standing up to Monsanto and their likes, and stopping them from poisoning our world and controlling our food supply. One way to do this is by showing the true cost of the current global food system, and the very real alternatives that exist.\\nNnimmo Bassey at the opening said :\\nBeing an ambassador to this Tribunal is like being an ambassador to mother Earth. If mother Earth could speak, Monsanto ought to be in jail long before now. Food is a celebration, it is culture, it is life. This is a struggle not against one multinational corporation, it is a struggle for life, it is a struggle for liberty. A struggle to stop big companies from colonizing our food systems, colonizing our agriculture, holding mother Earth as a slave for their profits.” \\nIf you want, you can follow the Monsanto Tribunal on Facebook , where many pictures and videos have already been posted. You can also see them if you have no Facebook yourself. In the coming weeks, we will continue to release short interviews of the witnesses, experts and lawyers, as well as the speakers in the People’s Assembly. We will also add all of this to our website , including all the hearings of the Tribunal and the written testimonies in different languages. Please be patient, we will keep you informed!\\nWhat happens now that the Tribunal is over? The judges are now thoroughly reviewing the evidence from legal briefs and witness testimonies to answer the six questions posed in the Tribunal’s terms of reference. They will then present a legal advisory opinion, hopefully soon but if necessary next spring: we will supply logistic support, but the timing is up to them.\\nAs Judge Tulkens said:\\nWe will try to deliver the legal opinion before December 10th, the International Day of human Rights. It will be addressed to Monsanto and to the United Nations. From this legal opinion, other jurisdictions can be involved and more judges will step in. We, as the judges [at the Monsanto Tribunal]have seen, heard, noted and deliberated. Chances are that the international law will take into consideration new issues such as the ones related to ecocide.” \\nWhat you can do to help We would like to thank you and all the volunteers for your amazing support. This would not have been possible without you. Stay tuned, follow us on social media, show your support and share messages wherever and whenever you can. Ask friends to sign their support . Together we will put an end to the era of poisoning and exploiting the world and move onward to a system where we work with nature instead of waging a war against it.\\nNote: Image from the Monsanto Tribunal. \\nOriginally published on the Monsanto Tribunal website . \\nVia: Food Revolution\\nh/t Stillness in the Storm \\n'"}, "time": 1742561637.8147392}