{"duration": 0.07898592948913574, "input_args": {"text": "\"Videos Protesters Disrupt “Affirmative Action Bake Sale” At UT-Austin The bake sale hosted by the Young Conservatives of Texas — in which prices varied depending on the buyer's race and gender — was meant to protest the consideration of race in admissions. | October 27, 2016 Be Sociable, Share! The Young Conservatives of Texas at UT Austin held a bake sale at the West Mall to discuss affirmative action policies on Wednesday, Oct. 26, 2016. The Young Conservatives were met with criticism, which resulted in a protest and several intense conversations among students. (Photo: Shelby Knowles/Texas Tribune/cc) \\nA controversial bake sale meant to protest race-based admissions at the University of Texas at Austin drew its own opponents on Wednesday. \\nThe campus branch of the Young Conservatives of Texas hosted the bake sale — in which prices varied depending on the buyer’s race and gender — to draw attention to affirmative action, which the event’s organizers said “demeans minorities on our campus by placing labels of race and gender on their accomplishments.” A cookie cost $1.50 for Asian males, 75 cents for white females and 25 cents for Hispanic females. \\nMore than 100 of their classmates showed up to host a counter-protest, calling the bake sale an offensive and inappropriate stunt. \\n“The labeling of races and the different prices of each is unacceptable…” said Jarvis Dillard, a UT freshman and one of the students protesting the bake sale. “White males have privilege above all the other races.” \\nIn a statement Wednesday, Greg Vincent, the university’s vice president for diversity and community engagement, called the event “inflammatory and demeaning.” \\n“Focusing our attention on the provocative nature of the YCT’s actions ignores a much more important issue: They create an environment of exclusion and disrespect among our students, faculty and staff,” the statement says. \\nThe young conservatives group held a similar bake sale in 2013 and was similarly chastised by Vincent, who called that event “deplorable.” \\nUT-Austin’s affirmative action policies have put the university in the spotlight over the past few years. In June 2016, the U.S. Supreme Court upheld the university’s affirmative action system in a 4-3 vote after it was challenged by a white woman, Abigail Fisher, who was denied admission. Fisher argued she was passed over by UT while less qualified minority students were not. \\nThe university considered the Supreme Court decision — which gives a small boost in admission to black and Hispanic students — a win. As of 2015, however, black students only made up 3.9 percent of the student population. During the protest, UT student body president Kevin Helgren said the campus has a long way to go in terms of inclusivity and diversity. \\n“Institutionalized racism exists and affirmative action helps to combat that,” Helgren said during the protest. “The act of putting financial values on groups of people based on their gender or on their race, in my opinion, is a really prominent way to engage in racism in 2016.” \\nOn the young conservatives’ Facebook event page, the group wrote: “YCT is a truly colorblind organization and believes that all government institutions are constitutionally prohibited from discriminating on the basis of race in all circumstances, including affirmative action.” \\nChristopher Shafik, a 19-year-old member of the young conservatives group, said “people assume that because we are in a position against affirmative action that we’re racist.” He said the opposite is true, and that the organization must work to change its image on campus. This work by T he Texas Tribune is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 International License. \\n\""}, "time": 1742562290.4175029}