{"duration": 0.07122445106506348, "input_args": {"text": "'Sean Hannity took to Twitter Thursday afternoon to warn of a “total end of the Fox News Channel as we know it” in the wake of a report that suggested Fox News   Bill Shine lacks support from the network’s top brass. [In a post on his Twitter account Thursday, Hannnity linked to a report by New York magazine’s Gabriel Sherman that claimed Shine  —   a   veteran at Fox News  —   had requested a public statement of support from network CEO James Murdoch and   Lachlan Murdoch, but failed to receive one. According to Sherman’s report, Shine privately fears for his future at the network as it has endured a series of controversies, including the recent ouster of longtime star anchor Bill O’Reilly.  A Fox News spokesperson told Sherman that Shine denied having approached James and Lachlan Murdoch personally to ask for a statement of support, while a Murdoch spokesman said Shine had not directly requested a statement. “Gäbe i pray this is NOT true because if it is, that’s the total end of the FNC as we know it. Done. Best Sean,” Hannity wrote in the first of a series of tweets defending Shine Thursday afternoon. Gäbe i pray this is NOT true because if it is, that’s the total end of the FNC as we know it. Done. Best Sean https:  .   —   Sean Hannity (@seanhannity) April 27, 2017,  After tweeting again to correct the spelling of Sherman’s first name in his initial post, Hannity suggested that a   employee inside Fox News is “trying to get an innocent person fired. ” Somebody HIGH UP AND INSIDE FNC is trying to get an innocent person fired. And Gabe I KNOW WHO it is. Best Sean https:  .   —   Sean Hannity (@seanhannity) April 27, 2017,  Hannity later tweeted “#Istandwithbill” and “#Istandwithshine. ” #Istandwithbill https:  .   —   Sean Hannity (@seanhannity) April 27, 2017,  I’ll change it. #Istandwithshine https:  .   —   Sean Hannity (@seanhannity) April 27, 2017,  Shine joined Fox News at its inception in 1996 and served as Hannity’s producer on Hannity and Colmes before rising through the ranks to become   of the network last year. This week, the executive was named as a defendant along with Roger Ailes, executive Irena Briganti and consultant Peter Snyder in a harassment lawsuit brought against the network by former anchor Andrea Tantaros. Shine was also mentioned in a racial discrimination lawsuit brought against Fox by former reporter Kelly Wright this month, though he is not named as one of the defendants in that case. Attorneys for Fox News issued a statement Thursday denying they had conducted any electronic surveillance on Tantaros. “Fox News and its executives flatly deny that they conducted any electronic surveillance of Ms. Tantaros. They have no knowledge of the anonymous or pseudonymous tweets described in her complaint. This lawsuit is a flimsy pretext to keep Ms. Tantaros and her sexual harassment claims in the public eye after the State Supreme Court directed her to bring them in arbitration. ”   This story has been updated to include a Fox spokesperson’s statement to Sherman, and another statement from Fox’s attorneys regarding the suit brought by Tantaros. Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564099.5335445}