{"duration": 0.17404389381408691, "input_args": {"text": "'Megyn Kelly  —   breakout star of the 2016 presidential campaign, anchor of the “The Kelly File” on Fox News, current object of employment desire for multiple networks,   author, mother, wife, daughter and friend (the last four being how she describes herself)  —   has something she wants everyone to know. Really. A lot. Listen up. Not just that it is dangerous when   Donald J. Trump calls out a single citizen on social media, seemingly giving permission to his followers to turn into rabid attack dogs, although she knows firsthand what that is like, having been the original target of his wrath for almost a year, starting in August 2015. Not just that hard work and an unsparing sense of your own strengths and weaknesses (and those of other people) can put you in a good place, though she writes about that a lot in her book, which is called, naturally, “Settle for More,” a catchphrase she also drops strategically into conversation. But also (and this may seem   but it is not) that she in no way apologizes for wearing that   dress to the Republican National Convention in July. You know, the one that sent the internet into what she called a “meltdown” because it revealed a whole lot of   …     shoulder! And thus, was unlike any dress that had been seen on a serious anchor ever, except maybe at the White House Correspondents Dinner. Definitely never behind a desk. “It was a lovely dress,” she said  —   this in a car during a brief respite back home in New York between book tour stops. “A convention is a kind of   extravaganza, and there are certain settings where you can take risks. So I just thought: ‘Yes, I can do this. I can be smart and challenging while I wear spaghetti straps, and everyone is just going to have to get their heads around that. ’” Just to prove it, she has worn it again. Because, she said, “I felt very strongly, I was not going to be defined by what someone else deemed appropriate. ” Indeed, for the past few years, ever since Ms. Kelly, 46, began making a name for herself as the person willing to call out power players on their own contradictions, contortions (verbal and  ) and   she has become famous for refusing to be boxed in by anyone else’s “appropriate”: not her network’s, nor a political party’s, nor the mythical dos and don’ts of career girl dress. She took on Newt Gingrich over his “anger issues” in October, sparred with the Republican Svengali Karl Rove over his electoral math in 2012 and challenged the conservative radio host Mike Gallagher over his dismissal of maternity leave. These moments have become widely known as “Megyn Moments,” so named by Jim Rutenberg, media columnist for The New York Times, in a profile last year. But what has been less widely acknowledged is that they extend far beyond her reports and interviews at the anchor desk into a broader statement about how women should be able to frame their gender. Put simply, she doesn’t just say what she wants. She wears what she wants. “You cannot underestimate the effect of that,” said Tammy Haddad, chief executive of Haddad Media and a former MSNBC political director. “Her personal image and her business image are one and the same. The intensity she brings to her work, she brings to her look, and she doesn’t allow it to get in her way. That’s good for all women. And it is completely different from what came before. ” For years, industry wisdom suggested that a female anchor, like many female executives, should dress like her male colleagues: in a suit, with a dark jacket and blouse. See, for example, Barbara Walters and Diane Sawyer. In 1996, when MSNBC began, Katie Couric donned a beige jacket and black turtleneck for the debut broadcast by 2006, when she became the first woman to solo anchor the “CBS Evening News,” she had loosened up enough to wear a white jacket and black  . This has, admittedly, changed, with the brightly colored and sometime patterned sleeveless sheath dress currently a favorite of newswomen such as Mika Brzezinski of “Morning Joe” and Gayle King,   of “CBS This Morning. ” However, the fact that Ms. Kelly is on at 9 p. m. rather than during breakfast puts her choices in a different category, Ms. Haddad said: “She is talking to the   audience, the critical audience. ” And what she is telling them, Ms. Kelly said, is “that, within reason, they can make their own choices about how they look and how they act. ” “I do think there is a new archetype for women emerging that rejects the bounds that have been placed on them,” she added. A 1992 profile of Ms. Sawyer in Vanity Fair, for example, subtitled, “How she finally beat the glamour rap. ” Ms. Kelly, who appeared on the magazine’s cover last February, only the second female newscaster to do so, has no problem with the glamour rap. In part because she doesn’t ignore it. Describing the haircut she got before the second Republican debate, for example, when she was deep in her Trump war and decided to lop her   waves into a   crop, Ms. Kelly quite cheerfully took a   invitation and turned it into a taunt  —   thus owning the vulgarity and weaponizing what might otherwise have seemed a mere beauty decision. In her book she writes that when she went to meet Mr. Trump for the first time since their public tussle to discuss having him do an interview with her, she wore her favorite black sheath Gucci dress. “I feel strong in it,” she said. By acknowledging the role clothes play in her own life and psyche, she is contravening one of the last taboos: If women want to be taken seriously, they are not supposed to take fashion seriously. A patently idiotic idea. (If you want to be taken seriously, you had better think seriously about every message you are sending, including the ones in your outfits.) In this she is part of a handful of women in the public eye who are breaking that rule, including Michelle “no sleeves” Obama and Sheryl “no hoodies” Sandberg. “We talk about it a lot: What is the world we are trying to create for our daughters  —   she has one, I have two  —   and how we can move things forward?” said Debra Netschert, a managing director of Jennison Associates, an asset management firm, who has been friends with Ms. Kelly for about four years. It is not a coincidence that in 2010, when Ms. Kelly moved from the morning show “America’s Newsroom” to become   of the afternoon show “America Live,” she hired her own stylist. Generally, the Fox anchors use the Fox stylist, just as they use the Fox hair and makeup people, which is why there is what is generally known as a “Fox Look”: for women, clingy brightly colored   dresses that “pop” on TV, tousled hair and a lot of eye makeup, lip gloss and base. But, she said, that means “we all sort of look the same. ” When she started in TV after a   career as a lawyer, she wore mostly navy, black and gray suits, and pinstripes  —   a “lot of Ann Taylor and Theory”  —   but then Fox put her in its wardrobe, “which was weird, because I had never really worn color before,” she said. So when she got her own show, she said she decided “I wanted to define myself differently. ” Which is to say, “as myself,” rather than as the network’s product. She enlisted the help of her neighbor, Dana Perriello, whom she knew first as a mom, but who had a sideline as a personal stylist. Because they were friends before they worked together, “She knew who I was,” Ms. Kelly said, and Ms. Perriello had an idea about how Ms. Kelly could express herself. They began to define a “Megyn look,” which had to do with clothes that were “strong, stylish, sleek, tailored, feminine, but not frilly,” Ms. Kelly said. “I don’t like frills. ” “She wanted to be fashionable not just in the news world, but in any world,” said Ms. Perriello, who puts outfits together for Ms. Kelly  —   dress, shoes, jewelry  —   and sends her look books of everything  . Now Ms. Kelly wears mostly dresses by Victoria Beckham, Stella McCartney, Roland Mouret and Narciso Rodriguez, though Ms. Perriello is increasingly adding separates (and sleeves). The   dress was by Ralph Lauren. In the photograph for this article, Ms. Kelly wore a black Fendi stretch jersey dress and silver Jimmy Choo   stilettos. Her color palette is once again dominated by black and white, with the occasional red and blue thrown in. She likes a cutout and a high spiked heel. She also likes leather and, Ms. Perriello said, “hardware. ” She has recently been wearing a lot of asymmetrical cuts, “which is not very common in news,” Ms. Perriello said. What she does not wear is florals or anything too lacy. Also, “You will never catch me in a dress without a pair of Spanx and a bra,” Ms. Kelly said, and she is happy to explain why. In fact, she thinks it is good to explain why: “After three children, it all came back together, but it didn’t come back together the way it used to be. ” Though earlier this year she said that she, along with many of her female colleagues, was sexually harassed by the former Fox News chief Roger Ailes, and though she writes about it in her book, all of that happened during her “frumpy   suit period,” not during her later, more   period. A fact she pointed out to underscore that such harassment was really about power and not  . No woman is “asking for it” because of what she wears, and no woman should be judged for it, though judging  —   in a dismissive and derogatory way  —   is exactly what Ms. Kelly experienced earlier this year when Mr. Trump and assorted others resurfaced a 2010 GQ shoot of Ms. Kelly in a black slip and stilettos, draped over a chair. In January, @gene70 tweeted the photo with the message, “And this is the bimbo that’s asking presidential questions?” Mr. Trump retweeted it. Ms. Kelly was having none of it. “They tried to   me!” she said. “But I think I looked great. I had just turned 40, and I was pregnant. Some people at Fox still think it was a mistake, but I refuse to have to dismiss these options because of other people’s prejudices, and my willingness to engage just proves they are wrong. ” In other words, it was appropriate because Megyn Kelly said it was appropriate. Rhetorically, this is not unlike the argument Gloria Steinem used when someone told her at her 40th birthday that she didn’t look 40. Ms. Steinem responded: “This is what 40 looks like. ” Ms. Kelly, however, may not like the comparison. She has regularly refused to categorize herself as a feminist, because she thinks it is nichifying. She also rejects descriptions such as “pioneer” and “trailblazer,” and says, “You don’t want to get drunk on your own wine,” and, “I’m just trying to be authentic. ” The irony is, insisting on her femininity while also insisting on her due  —   that she can have her career and her family, too, and in your face with a spaghetti strap if you don’t like that  —   may be the most authentically feminist act of all.'"}, "time": 1742564039.8228557}