{"duration": 0.0951075553894043, "input_args": {"text": "'American baking is a jumble of   pies, babkas and pastelitos, of red bean buns, coconut layer cakes and sourdoughs. In home kitchens along a single    chocolate chip cookies may evolve with more defining characteristics than Darwin’s finches. You might not glean this from watching Season 2 of “The Great American Baking Show,” an   cooking series that had its premiere on ABC three weeks ago. Judged by the cookbook author and British television personality Mary Berry and the American pastry chef Johnny Iuzzini, the show is a spinoff of the immensely popular “The Great British Bake Off,” which is leaving for Channel 4 after seven seasons on the BBC. This is meant to be an American edition, though much like before, amateur bakers meet in a plain white tent outside of London, surrounded by   slopes of lawn and wild rabbits sniffing clean country air. Something isn’t quite right. Familiar faces are missing, and compressing the show into a holiday themed box (by which the producers mean Christmas they always mean Christmas) is immediately confusing. Can the definition of American baking really be limited to fruitcake and gingerbread? The married actors Nia Vardalos and Ian Gomez share the hosting duties and recite a less cheeky version of the terrible puns baked into the DNA of the show, but they lack the onscreen charisma of Mel Giedroyc and Sue Perkins, who brought a sweet, surreal goofiness to the role on “The Great British Bake Off. ” At one point, Ms. Vardalos directs the bakers to paint a holiday picture with a   cookie scene: “It could be Santa’s workshop, it could be an   rink with children, there are no limits!” There are limits. The original show broadcasts Christmas specials, but it doesn’t exclusively define British baking with the holiday. At its best, it is a celebration of the complexities of modern, multicultural Britain. Not the more commonly exported Britishness of “Downton Abbey” or “The Crown. ” Not the tweedy white men smoking pipes and sipping claret until they can’t feel feelings anymore. The bakers on “The Great British Bake Off” provide a cheerful lesson on the country as it really is: There is no one color to Britishness, no one faith or accent. All the bakers have equal claims on Britishness, and this notion is so indisputable, it’s built right into the title of the show. Postelection America could have used this kind of lesson as well. The original values regional British masterpieces, dedicating challenges to shiny raised pork pies and Battenberg cakes. And the   hosts often interrupt an episode to present   about the history of a particular biscuit. But “The Great American Baking Show,” which underestimates American baking, does none of this with its own specialties. In Episode 4, which aired last Thursday, the bakers are at least given a little room. There is no insistence on marzipan Santas or snowmen, so they build tall, colorful meringue pies and dozens of savory tarts. A baker from Atlanta mixes a streaky orange pimento cheese filling, while another from Los Angeles sautées beef inspired by Korean barbecue. One squeezes lime over crumbled paneer. You finally get a sense of what makes American home cooking so exciting: It doesn’t fit too neatly into any one category. Ms. Berry plays her part the same way, more of a stern coach than a judge, listening with patience and critiquing fairly. Mr. Iuzzini replaces Paul Hollywood, a British celebrity chef who judged alongside Ms. Berry, and tends to intimidate bakers with technical questions early in the process. He later assesses them kindly as well. Though the chemistry between the judges and hosts starts off as a weak and awkward flicker, it brightens as the show goes on. And Ms. Vardalos, who gained fame with her 2002 film “My Big Fat Greek Wedding,” is at her strongest when she goes off script. There’s a moment in the first episode when Mr. Iuzzini is judging cakes and finds the pale blue frosting at the base of an eggnog cake to be somehow incorrect. Instead of indicating Christmas, the colors indicate “Mediterranean, or even Greek. ” “We have Christmas,” Ms. Vardalos says. “The Great American Baking Show,” like the original, zooms in on illustrations of what the bakers are working toward for their “showstopper challenge,” a grand baking project that takes many hours to complete. Something about this has always filled me with tenderness toward even the most charmless bakers. Maybe it’s because, with any ambition, there is often a gap between what you want to do and what you actually achieve. A miserable, insurmountable abyss in some cases. I admire the way the American bakers will dust off their aprons and walk up to the judging table where Ms. Berry and Mr. Iuzzini are waiting, even on a bad day, with a wonky, toppling, broken, undercooked thing. And they stand by their work and invite criticism. This spinoff often misses the point, but at least there is none of the egregious brand placement or useless cruelty, the silly, artificial editing or dramatic music that ruins so many American cooking competitions. There is also nothing to obscure that moment when the bakers are made to understand all the ways in which they have succeeded, and failed. The hosts have changed, the cakes have changed, but this has stayed the same: The bakers nod and grimace and promise to do better next time. And I believe them.'"}, "time": 1742563826.7576838}