{"duration": 0.03942298889160156, "input_args": {"text": "'Lukas Mikelionis, Heat Street, October 24, 2016 \\n{snip} According to Misao Dean, Professor of English at the University of Victoria, the canoe can be a symbol of colonialism, imperialism and genocide due to history. She also accused the canoers of cultural appropriation because they are primarily white men and have a privileged place in society. \\nIn a radio interview for CBC Radio , which wasn’t picked up by the Internet until several months later, she claimed “we have a whole set of narratives that make the canoe into a kind of morally untouchable symbol, something that seems natural, that seems ordinary, and seems to promote values that we ascribe to.” \\n“But I think if you look a little further that narrative obscures or erases another narrative–and that narrative is about, to be blunt, it’s about theft and genocide”, the professor said. \\n{snip} \\n“It’s not a coincidence that it was white men of a certain age . . . Certainly the majority of wilderness canoers are people who have a very privileged place in society. They’re frequently highly educated people. They’re almost completely white,” she said. \\nCBC Radio host Jim Brown then asked a question: “Should we look at the canoe as a non-controversial symbol or should we look at it as a symbol of colonialism?” \\nTo which the academic replied: “Absolutely a symbol of colonialism. It seems to me that this narrative we tell ourselves about the canoe about how canoeing makes us in touch with nature, how canoeing makes us in some way guiltless of the terrible things that the Canadian government and Canadians in general did to First Nations people.” \\n{snip} \\nEither way, somebody should break the news to Canada’s woke Prime Minister Justin Trudeau about this. It’s 2016, after all. Thrilled to let you know we’re going to need another seat in our canoe: Sophie is pregnant! #threeisthenewtwo pic.twitter.com/gm76BwAe4p'"}, "time": 1742561702.9200232}