{"duration": 0.07983994483947754, "input_args": {"text": "'President Donald Trump is expected to sign an executive order on religious liberty issues on Thursday  —   the National Day of Prayer. [According to Politico, two White House senior officials confirmed that Trump will sign the order but would not release the details of the latest draft. A prior draft of the order, however  —   leaked to the   Nation in February  —   reportedly would “create wholesale exemptions for people and organizations who claim religious objections to   marriage, premarital sex, abortion, and trans identity. ”  The leak of the original draft to the Nation, says Politico, was “the handiwork, many conservatives believed, of Ivanka Trump and Jared Kushner, who have sought to project themselves as friendly to the LGBT community. ” Leftwing groups condemned the draft executive order as overtly discriminatory. The Nation continued: The   draft order, a copy of which is currently circulating among federal staff and advocacy organizations, construes religious organizations so broadly that it covers “any organization, including closely held   corporations,” and protects “religious freedom” in every walk of life: “when providing social services, education, or healthcare earning a living, seeking a job, or employing others receiving government grants or contracts or otherwise participating in the marketplace, the public square, or interfacing with Federal, State or local governments. In a statement released Wednesday, Father Frank Pavone, national director of Priests for Life, said the report of the order is “very welcome news. ” “Speaking as one who has spent the last five years in federal courts  —   and who is still in court  —   defending the right of religious groups and individuals to practice our beliefs, President Trump’s anticipated executive order is cause for celebration,” Pavone said. “For far too long, government has been trying to confine faith to the four walls of houses of worship. I’m confident that President Trump’s order will reinforce the Constitution’s guarantee that our religious beliefs are to be protected, not attacked. ” Reports of the new executive order come amid complaints that the Trump Department of Justice is still continuing its contraceptive mandate cases against religious   such as the Little Sisters of the Poor. Catholic News Agency reports the plaintiffs in these cases expected the federal government would drop its appeals once Trump took office. However, the Becket Fund for Religious Liberty  —   which represents many of the plaintiffs in the HHS contraceptive mandate cases  —   observed that the Obama administration’s lawyers who litigated these cases are still on board in the Trump Department of Justice. During his presidential campaign, Trump had promised faith leaders and employers relief from the Obamacare mandate that requires most employers to provide contraception,   drugs, and sterilization procedures to their workers in health insurance plans. In a letter to the Catholic Leadership Conference last October, Trump told Catholic leaders prior to the November election that Hillary Clinton’s support for the HHS mandate “is a hostility to religious liberty you will never see in a Trump Administration. ” Trump wrote: On life, I am, and will remain,  . I will defend your religious liberties and the right to fully and freely practice your religion, as individuals, business owners and academic institutions. I will make absolutely certain religious orders like The Little Sisters of Poor are not bullied by the federal government because of their religious beliefs. “We are grateful to have a president who is committed to defending a value so basic to Americans as religious freedom,” Pavone said. “We look forward not only to his executive actions, but also to legislation that will further protect religious liberty from unjust government mandates and from the oppressive restrictions of such measures as the Johnson Amendment. ”'"}, "time": 1742563868.4752276}