{"duration": 0.12127995491027832, "input_args": {"text": "'Hillary Clinton delivered a lacerating rebuke on Thursday of her likely Republican opponent, Donald J. Trump, declaring that he was hopelessly unprepared and temperamentally unfit to be commander in chief. Electing him, she said, would be a “historic mistake. ” Speaking in a steady, modulated tone but lobbing some of the most fiery lines of her presidential campaign, Mrs. Clinton painted Mr. Trump as a reckless, childish and uninformed amateur who was playing at the game of global statecraft. “This is not someone who should ever have the nuclear codes,” she said, “because it’s not hard to imagine Donald Trump leading us into a war just because somebody got under his very thin skin. ” Mrs. Clinton, whose campaign had grappled for weeks over how to handle Mr. Trump, seemed to find her footing as she addressed an audience in San Diego that laughed and cheered as she deconstructed Mr. Trump’s foreign policy pronouncements. They were, she said, “not even really ideas, just a series of bizarre rants, personal feuds and outright lies. ” The speech, which mixed biting sarcasm and somber assessments of the foreign crises of the Obama years, unfurled what is likely to be the core argument that Mrs. Clinton will carry into the general election. Her remarks were billed as a major foreign policy address, and she was flanked by a row of 19 American flags as majestic as those that often back Mr. Trump at his public events. Yet the speech was devoid of new policy prescriptions, and she skipped over difficult episodes during her tenure as secretary of state, including the NATO intervention in Libya and its bloody aftermath in Benghazi. Instead she borrowed a tactic from President Obama, reeling off zingers that are catnip to   channels. It won her the kind of sustained live coverage that Mr. Trump has enjoyed routinely but Mrs. Clinton has not, though the announcement by Speaker Paul D. Ryan that he planned to vote for Mr. Trump stole her thunder in the opening moments of the   address. She said she imagined Mr. Trump was “composing nasty tweets” about her even as she spoke. And indeed he was: “Bad performance by Crooked Hillary Clinton!” Mr. Trump wrote. “Reading poorly from the teleprompter! She doesn’t even look presidential. ” But Mrs. Clinton sought to turn Mr. Trump’s prolific Twitter habit into an additional bullet point demonstrating that he was “unfit” for the presidency, as she put it. She twice referred to the scene in the White House Situation Room where as secretary of state, she advised Mr. Obama on the raid on a compound in Pakistan that killed Osama bin Laden. “Imagine Donald Trump sitting in the Situation Room, making    decisions on behalf of the United States,” Mrs. Clinton said, eliciting cries of “No!” from her audience. “Imagine if he had not just his Twitter account at his disposal when he’s angry, but America’s entire arsenal. ” In an interview with The New York Times during Mrs. Clinton’s speech, Mr. Trump said that Mrs. Clinton’s performance was “terrible” and “pathetic. ” He added: “I’m not   at all. I’m the opposite of  . ” For Mrs. Clinton, whose formal speeches tend to be earnest and laden with policy prescriptions, it was a striking departure  —   a rollicking political indictment that doubled as Mrs. Clinton’s first   response to Mr. Trump’s drumbeat of criticism about her ethics and judgment during a   in public life. The speech came after weeks of study by Clinton aides to determine which attacks by Mr. Trump’s Republican rivals had not worked. It was studded with punch lines: Mr. Trump “doesn’t have a clue what he’s talking about,” Mrs. Clinton said at one point. “Donald doesn’t see the complexity,” she said at another. “This isn’t reality television,” she said of a Trump presidency. “This is actual reality. ” After her campaign had initially issued a tepid response to Mr. Trump’s proposal of defaulting on the national debt, calling the idea “risky,” Mrs. Clinton said Thursday that such action would lead to “an economic catastrophe. ” “He believes we can treat the U. S. economy like one of his casinos,” she said. The speech was roughly 10 days in the making and written by Mrs. Clinton’s speechwriters, Dan Schwerin and Megan Rooney, and top policy aide, Jake Sullivan, with outside advisers including Mr. Obama’s former chief speechwriter, Jon Favreau, reviewing a late draft. Ms. Rooney, a former State Department speechwriter, was perched on the arm of Mrs. Clinton’s chair on a flight from Boston to San Diego on Wednesday night, making revisions on her laptop and making sure the lines echoed Mrs. Clinton’s sardonic humor. The address was a meaty rebuttal to Democrats who had expressed concern that Mrs. Clinton’s campaign lacked gumption in going after Mr. Trump, particularly because Mr. Obama and Senator Elizabeth Warren of Massachusetts have relished opportunities to skewer him. By turns mocking and stern, Mrs. Clinton derided Mr. Trump for suggesting that Japan should acquire nuclear weapons to deter North Korea, that the United States should have walked away from the nuclear deal with Iran, and that “maybe Syria should be a free zone for ISIS. ” “He says he has foreign policy experience because he ran the Miss Universe pageant in Russia,” Mrs. Clinton said. “And to top it off, he believes America is weak. An embarrassment. He called our military a disaster. He said we are, and I quote, a ‘  country. ’” In vivid strokes, Mrs. Clinton framed not just her case against Mr. Trump but the broader   debate in the election: She cast herself as the defender of an   world order against an insurgent who did not understand, let alone respect, the network of alliances the United States constructed after World War II to safeguard its interests. Mrs. Clinton presented herself as a   commander in chief, a fervent believer in America as an exceptional country, tested by her time in the Situation Room. She highlighted her ability to go “toe to toe” with leaders in Beijing and Moscow, contrasting that with what she said was Mr. Trump’s “bizarre fascination with dictators and strongmen who have no love for America. ” “I’ll leave it to the psychiatrists to explain his affection for tyrants,” she said. “I just wonder how anyone could be so wrong about who America’s real friends are. ” Even as she excoriated Mr. Trump, Mrs. Clinton kept a close eye on domestic politics. She noted, for example, that she understood the deep qualms that voters had with trade deals. Still, Mr. Trump’s threats to impose tariffs on Chinese imports, Mrs. Clinton said, would set off a trade war of the kind that deepened the Great Depression in the 1930s. Mrs. Clinton recited a handful of highlights from her time at the State Department, including her role in brokering a   between Israel and Hamas in Gaza in 2012 and rallying the world to impose sanctions on Iran over its nuclear program. But she failed to flesh out her proposals for dealing with the Islamic State or the civil war in Syria. To Mrs. Clinton, such policy details were not as important as the    differences between her and Mr. Trump. “He has said that he would order our military to carry out torture and the murder of civilians who are related to suspected terrorists, even though those are war crimes,” Mrs. Clinton said. “He says he doesn’t have to listen to our generals or our admirals, our ambassadors and other high officials, because he has, quote, ‘a very good brain. ’” “He also said, ‘I know more about ISIS than the generals do, believe me.’ You know what?” she continued. “I don’t believe him. ” Mrs. Clinton ended her remarks on a more solemn note, arguing that Mr. Trump’s proposals, like barring Muslims from entering the United States, “could fuel an ugly narrative about who we are. ” Mr. Trump, she said, would undo decades of statecraft by Republicans and Democrats. Striking a bipartisan note, Mrs. Clinton recalled an advertisement Mr. Trump took out in newspapers in 1987, during the Reagan administration, “saying that America lacked a backbone and that the world was, you guessed it, laughing at us. ” “You’ve got to wonder why somebody who fundamentally has so little confidence in America and has felt that way for at least 30 years wants to be our president,” she said.'"}, "time": 1742562043.6626468}