{"duration": 0.15428709983825684, "input_args": {"text": "'  Men Are Binded By Their Shared Realization Of Truth Men Are Binded By Their Shared Realization Of Truth \\nAndré is a young European who left his decaying country in 2012 for greener pastures. He enjoys exploring subterranean places, reading about a host of interconnected topics, and yearns for Tradition. November 18, 2016 Politics \\nThe 9 th of November 2016 was a great day. We will remember it as well as our parents remember the first moon landing in July 1969 or the fall of the Berlin wall. Liberal mainstream media—almost a pleonasm—are either stunned or agitating. Some of these crybullies clamour to themselves how “fearful” they are, lament on the “destruction of the West”—a curious expression as it seldom appears under leftist pens—or have difficulties to acknowledge that the man they have despised and defamed every day for months will be the 45 th President of the United States. \\nOutside the US, The Donald’s victory is creating waves, too. So many liberals allegedly connected to the Canadian Immigration website to crash it. In France, the bourgeois bohemians who work in the media, academia and everything that constitutes the big left establishment do the same posturing than their American counterparts, whereas the petits blancs (impoverished, disenfranchised whites) and local “righters” rejoice. \\nIn Brazil, where your humble servant lives, the official media is making some tedious comments that deliver a flabby criticism. Local leftist talking heads condemn the “ white protestants ” and reality shows in a very cliché posturing that mixes anti-white prejudice with a critique of capitalism, whereas some new traditionalists, among whom some have been avid readers and makers of Alt-Right content, are grateful . \\nThis is our victory. Feels good, man \\nA pro-Pepe Facebook group has had a substantive discussion about where a red-pilled foreigner considering moving to the US after the Donald won should go. To make a long story short, some have advised potential newcomers to go live in the Midwest, in Texas as long as one stays away from Houston or Dallas, in Wyoming for the gun rights, in Pennsylvania excluding Philadelphia and the urban areas, close to the Appalachian mountains if one enjoys outdoors, while staying away from Illinois. Most of those who participated were whites, but I have spotted some Latino and Arab names. Some made jokes on these names but no fuss. \\nAnd here the following question arises. What defines us? Liberals have been shrieking about “xenophobia” or “racism” all the time. Yet, strictly national boundaries are much less relevant than before, even for us , even when we all rejoiced about Trump’s promise to make a wall. All over the world we are rejoicing around the GOP candidate’s victory. \\nAmerican “Trumpists” undoubtedly feel closer to non-Americans who have been dissenting from the NWO on the Internet and wanted the Donald to pass than to American libtards. A lot of us are OK with having non-whites around: we don’t pander to arrogant, aggressive anti-whites, but that does not mean we would have to be “racists” as the liberal caricature wants us to be. To cut in more personally, I know of no genuine red-pilled or Alt-Righter who would have rejected me as a frog, although I remember some stars and stripes cucks blaming me for daring to speak about American politics without owning a US passport. The frog is green after all \\nSo, once again, what defines us? Why are we a “we”? Race plays a role for sure. We struggle to keep the white people from getting dissolved into the acid bath of wide-scale miscegenation and dispossession. We want a right to solidarity based at least partly on race, i.e. on lineage and identity, just like all the pseudo-minority groups out there. We fight the double standard that allows them to be communitarian, tribalistic, nepotistic, without being ever responsible of what they do, whereas we are supposed to keep our heads down and be taught everything by liberal social engineers in a world where we would have no freedom, no future, no dignity. \\nBut even then, there have been Blacks, Latinos , and many women who participated into bringing The Donald to the White House. I have a race-mixed friend who supported Trump all along. This is not to say “I’m not a racist!,” afraid cuckservative-style, but to show there are some and we know it firsthand. \\nIt is no mystery why most of us are white: we are united around a civilization that was primarily built by people of European descent. But there is more, too. \\nAnd this “more” that, I think, defines and binds us; this “more” is shared awareness . On the periphery of the System centers, we managed to grow and gather \\nWe are all aware, broadly speaking, of the same phenomena and trends. We have witnessed the break-up of families and harmonious relationships between men and women. We have been faced with the untold prohibition to make the least critic of feminism, “minority groups” aggressive identitarianism, and with the pervasive omnipresence of these leftist norms commonly referred to as political correctness. We have seen neoliberalism allowing a handful of careless, irresponsible assholes sending the jobs overseas, importing third-world immigration, then force us into a life of chronic unemployment or endless struggles against other low-wage individuals for a small place under the sun. \\nWe saw how conservatism was a sham that never faced the genuine problems. We witnessed societies crumble, conflictual “minoritarian” group identities being crafted by the likes of Soros, and the meritorious worker or professional—whatever his race—getting exploited to the benefit of the lower and upper parasites. We saw the liberal establishment using various social categories like pawns to create horizontal struggles and depopulation . \\nOf course, some disagreements can be found on this or that particular issue, but we all see the same devastated landscape in lieu of the brilliant civilization the West once was. \\nAnd here is the major fault line. The leftists deny or value —they often go from the former to the latter—the replacement of native European population, the aggressive and tribalistic stance of “minority groups” towards the silent majority, the forced inclusion of individuals into sick identity politics games, the perpetual hostility and institutionalized prejudice against whites and males… Either the leftists utterly deny what we are aware of, for example when they say that whites are not under replacement, or they demonize it as a remnant of some “privilege” or “prejudice.” \\nAll their talk about “oppressed minorities” dissimulates the very real disenfranchisement of the white majority, of non-white meritorious and integrated Westerners, and serves to deny us from our rights to public empathy, to dignity, or to even basically survive in a world of our own. They work on language and representations because their job consists in manipulating these, thus brainwashing us into seeing the world through their lenses and denying the legitimacy of any other vision. \\nThe importance of shared awareness explains why we united on the Internet. A lot of us were closet nationalists years ago, and still are. We could not, and often still cannot, be nationalists in public, or we would have been excluded from normal social life by the local leftists and cowards. Leftist hegemony was and is still real in the mainstream. You know hegemony when you see it and spend countless hours thinking about how you can thrive even when living under it. \\nIn the mid-2000, I found out about the information website Fdesouche (“Native French”) quote. By the standards of today, this news aggregator seems hardly interesting: it mostly collates pieces written by others. But then, it was fantastic. Here I could recognize what I already felt about the world—that something was wrong with all these non-whites thugs holding the streets and getting lavish promotion when they bragged about it. It was all concentrated before my eyes, and others were talking about what they went through daily as well. At least, others felt and saw the same as I did! I was not crazy, not bound to a life of unauthenticity or forlorn solitude among the almighty left. We were assembling. And we were on the Internet. “Fdesouche.com—The website they want to keep you from visiting” \\nAs most of us found ourselves under attack from non-native Frenchmen, and knowing intuitively that identity goes deeper than the fleeting winds today called culture, we often despised immigration in general. But eventually things changed, thanks to Alain Soral , mostly, who emphasized how racial struggle was leading to sterile battles among disenfranchised people while letting the truly powerful off the hook. Mathias Cardet, a black journalist who worked with Soral, showed how gangsta-rap culture was injected and nurtured among non-whites by powerful interests. \\nAfter all, one can be black or Arab and wanting to live in peace as a free individual, not as an identity politics pawn who spends his life attacking another social category. \\nBeing pro-white, pro-masculinity and pro-tradition does not require being white: I often felt closer from Muslims with good intentions, i.e. Muslims who were genuine believers and not rancorous people using Islam as a mask for anti-white tribalism, than from white liberals. The Muslims would not share my blood, but they would share some of my awareness and yearning for Tradition, two things that white liberals eagerly reject. “Faith front, warriors’ alliance against common foes” \\nThe Internet is immaterial. It is, basically, a network where information flows. Awareness, and the will to spread it, are immaterial as well. This is why we could meet and act on the Internet. After all, the Alt Right and manosphere have been sharing ideas, media contents, memes, advises—and only later proceeded to meetups, panicking the totalitarian liberals in the process. \\nTrump’s victory is a major one. Regardless of what The Donald will actually do, it is an event of considerable historical magnitude. But it is only the beginning—make no mistake about that. The libtards’ establishment still holds loads of money, of institutions, of cultural territory. It has started to crumble and leak , yet it is still there. \\nMajor battles are waiting ahead. We have to further our awareness, make thorough research on every aspect of leftism, and develop more proper cultural references. \\nAlways remember the libtards never cared one second about us. They would have let us die off, alone, poor, childless, traumatized and demonized, had we not chosen to follow the path of the red pill. \\nAmerica is a first-tier power, but it is still a battlefield among others. Wherever we are, it is time to thicken our mutual relationships and cooperate more closely. It is a battle, not between nationals and foreigners, but between workers and parasites, between those who feel the void and wrongness in the rotten core of postmodernity and those who dwell in the last liberal trend, between the realists who want freedom and responsibility in a healthy world of values and cultures against those who ravel in blue pill, media bullshit, complacency, parasitism and cucking for the empire of nothing. \\nWe are the future. It doesn’t matter where we are. We are those with true awareness, those with genuine and healthy values, those who struggled to hone their abilities, and most importantly those who actually deserve to inherit the Western world. So, save it and conquer it, country after country, institution after institution, outlet after outlet—or there will be nothing left.'"}, "time": 1742628295.2722025}