{"duration": 0.06194138526916504, "input_args": {"text": "'It was as though time had stood still at Latisha Hopewell’s apartment in Lower Manhattan. A colorfully decorated Christmas tree again stood near the entrance of her mostly unadorned apartment. Freshly opened presents for her daughters, Shaun and Shani Bates, were stacked beneath the tree, as the girls sat next to their mother on a large, green sofa in their living room. Two years ago, the setting was the same. Ms. Hopewell had gone back to college a year and a half earlier to set an example for her daughters and to finally secure not another job, she said, but a career. Though she was stretched exhaustingly thin among classes, a   job and parenting, she talked about a renewed dedication to completing a path she had begun nearly 20 years earlier, and how a degree would allow her to provide for her daughters in a way she had always wanted. Now Ms. Hopewell, 37, is ebullient, and full of smiles, hugs and laughs. After spending the last three and a half years studying forensic psychology at the John Jay College of Criminal Justice in Midtown, it was official: She was a college graduate, the first in her family. “It feels great,” she said, adding that “it will feel better once I walk down that aisle. ” She finished her degree in December but is saving the big celebration for after the graduation ceremony later this year. She has already rewarded herself in other ways, though: After her last class, she took a few days off work to spend time with her daughters during their winter break from school and to catch up on   sleep. This milestone has been a long time coming for Ms. Hopewell. She attended Buffalo State College from 1997 to 2001, but left before graduating to get a job to pay off tuition debt. It was meant to be a brief hiatus  —   until, she said, life happened. She became pregnant with Shaun and then with Shani several years later. There were low points and hardships, including living in a homeless shelter for three years. She has largely raised her daughters on her own. Though she always knew she would find her way back to school, Ms. Hopewell said the motivation she needed came from an unexpected place. “She started it,” Ms. Hopewell said, pointing at her older daughter, Shaun, who is 13. She would needle her mother when Ms. Hopewell was stumped by Shaun’s homework despite having gone to college. “I didn’t finish,” Ms. Hopewell recalled telling her daughter. But that line will not work anymore. “I have no excuses now,” she said. Ms. Hopewell said Shaun had taken on the “super   role,” picking up the slack to take care of Shani, who is 8, when her mother went back to college. Their days typically began with Shaun waking up her sister and Ms. Hopewell seeing the girls off to school before she headed to John Jay. After her morning classes, Ms. Hopewell said, she would go home to make dinner for her children before leaving for her   job as a medical data clerk. Though friends and family pitched in to help look after her daughters when they could, there were times when she had no choice but to take Shaun and Shani to the library so that she could use a computer to write papers. The family made it work, but some of the pressure was lifted in 2014. After hearing of her struggles, a social worker from Educational Alliance, a beneficiary agency of   of New York, one of the eight organizations supported by The New York Times Neediest Cases Fund, helped Ms. Hopewell get a laptop so she could do schoolwork at home. The organization used $1, 525 from the fund to help Ms. Hopewell in 2014, including $500 for the laptop. Despite the challenges, Ms. Hopewell said she never doubted she would graduate. “There were plenty of nights I cried and asked why I did this to myself,” Ms. Hopewell said. “But at the end of the day I know it’s beneficial for my family and I want bigger and better things, and I have to do it. ” Among those things is a house in Atlanta and financial security. “I don’t want my kids to have to worry about anything,” Ms. Hopewell said. “I want to leave a legacy for my kids when I leave this earth, and living paycheck to paycheck is not going to get it. ” The laptop is still being put to good use. Even Shaun borrows it for her homework when her mother does not need it. Though going back to school meant less time together as a family, Ms. Hopewell said she thought the experience had brought them closer, and they continue to inspire one another. “It’s quite amazing actually  —   juggling work and school and us,” Shaun said of her mother’s achievements. “I’m very proud of her for taking the time to go back to school so she can be a role model for us. ” And her mother’s drive, Shaun said, has been infectious. “Now that she believes in herself more, she instills that motivation in me more,” Shaun said. The   student said she hoped to study neuroscience at Harvard one day. There is more class time in store for Ms. Hopewell as well. She is looking into graduate programs for social work at several local colleges and hopes to start as early as this fall. The goal is to become a licensed counselor for   adolescents. But for now, the adolescents she is most focused on are the two in her apartment, she said. She hopes they see from her experiences that education is the best way to avoid repeating her struggles. “This experience showed me that I’m raising   young ladies who can adapt to any situation and make the best of it,” Ms. Hopewell said. “Their capabilities are endless. ”'"}, "time": 1742628428.216458}