{"duration": 0.08090686798095703, "input_args": {"text": "'Warren E. Buffett, the billionaire investor, on Saturday lauded the “miraculous” qualities of the United States economy in highlighting another stellar year for his company, Berkshire Hathaway. Mr. Buffett, whose record of beating the stock market over the past 50 years is unparalleled, is known for being persistently optimistic about the prospects of the American economy. But his usual hymn to the dynamism of the American economy in his annual letter to Berkshire Hathaway shareholders that was released on Saturday morning reached new heights. “Americans have combined human ingenuity, a market system, a tide of talented and ambitious immigrants, and the rule of law to deliver abundance beyond any dreams of our forefathers,” Mr. Buffett wrote. He was a vocal supporter of Hillary Clinton during last year’s presidential campaign and he did not mention President Trump in his letter. But his celebration of the American economy’s ability to deliver growth stands in stark contrast to President Trump’s darker descriptions of the country’s economic prospects. That Mr. Buffett went out of his way to give credit to a “tide of talented and ambitious immigrants” was also worthy of note in light of the Trump administration’s crackdown on immigrants. Last year was another outstanding one for the man known widely as the Oracle of Omaha. Berkshire Hathaway’s stock price was up 23 percent in 2016, about double the return on the Standard  Poor’s 500 index. Berkshire’s operating companies, which include the insurance firm Geico, the railroad company BNSF and numerous others, also performed well in an improving economy, with operating earnings increasing to $17. 5 billion in 2016 from $17. 3 billion in 2015. Mr. Buffett’s investment letters, which accompany Berkshire’s report, are highly anticipated. After all, he is 86 years old, sitting on a mountain of $85 billion in cash and, as a recent documentary about his life made clear, showing little sign of slowing down. Mr. Buffett also revealed in his letter that a recent bet on Apple had paid quick dividends. He owns a 1. 1 percent stake in the company that he purchased at a total cost of $6. 7 billion. His 61 million shares are now worth over $8 billion. Over the years, Mr. Buffett has had a complicated relationship with Wall Street. He has been a withering critic of the culture of high pay, group think and excessive fees yet he has also swooped in to buy big stakes in investment firms when they hit rough times. In his 2016 letter, Mr. Buffett took special aim at hedge funds, which in recent years have faced persistent outflows of investor money because of poor performance, stubbornly high fees and a broad move toward cheaper, passive options like index funds and   funds. Underscoring his   thesis that, over time, highly paid   hotshots lose out to a cheap index fund, Mr. Buffett presented the latest results of a bet he made nine years ago. Since then, a standard S  P index fund overseen by Vanguard is up 85 percent, easily outpacing the hedge funds’ return of 22 percent. Annually, the gap is just as wide: 7 percent for the index fund and 2. 2 percent for the hedge funds. As usual, Mr. Buffett did not mince words in expressing his astonishment as to how elite investment professionals could register such mediocre returns while raking in steep fees. “I’m certain that in almost all cases the managers at both levels were honest and intelligent people. But the results for their investors were dismal  —   really dismal,” he wrote. “And, alas, the huge fixed fees charged by all of the funds and    involved  —   fees that were totally unwarranted by performance  —   were such that their managers were showered with compensation over the nine years that have passed. ”'"}, "time": 1742562119.6868098}