{"duration": 0.15938854217529297, "input_args": {"text": "'ABC’s decision to cancel its popular   comedy series Last Man Standing shocked fans, as it was one of the network’s   comedy series in its most recent sixth season. [The series stars (or starred) Tim Allen as Mike Baxter, the marketing director for sporting goods store Outdoor Man and a family man who splits time between work and managing his   household, which includes his wife Vanessa (Nancy Travis) and daughters Mandy (Molly Ephraim) Eve (Kaitlyn Dever) and Kristin (Amanda Fuller).  The series was unique in that it was one of the few (if not the only) broadcast network shows to explore the life of a politically conservative working man and his experience coming to terms with today’s   culture. So when ABC canceled the show last week, fans were quick to accuse the network of making the decision for political reasons. The show is   (though reportedly written by liberal writers) and star Allen is himself politically conservative and a supporter of President Donald Trump. ABC Entertainment President Channing Dungey held a press call Tuesday morning to discuss the network’s Fall   lineup, which, for the first time in six years, does not include its   rated comedy. While some reporters asked about Last Man‘s cancellation, the press call raised more questioned than it answered. Here are five questions that remain about the network’s decision to cancel the show.   1. Was the cancellation of the show motivated by politics in any way, either by the series’ own   worldview or by star Tim Allen’s own politics? Despite getting this exact question on the conference call, Dungey avoided answering it directly. “I cancelled Last Man Standing for the same business and scheduling reasons I cancelled The Real O’Neals, Dr. Ken, The Catch, American Crime,” Dungey said. “It was challenging because it was a steady performer but when we made the decision not to continue with comedies on Friday, that’s where it landed. ” The Real O’Neals, Dr. Ken and American Crime were ratings disasters (and none of them moved the cultural conversation much, with the exception of O’Neals, which appeared to exist solely to piss off Christians) so there’s no surprise in those cancellations. But Last Man Standing was a ratings highlight in its sixth season, which brings up the next puzzling question  …     2. If comedy “remains a priority” for the network, as it said on Tuesday’s call, why would it cancel its    comedy series? Last Man Standing was ABC’s    comedy only behind the critically adored (and decidedly progressive) Modern Family. The sixth season finale of LMS drew 6. 06 million viewers and a respectable 1. 1 rating in its March 31 broadcast, good enough to make it the   primetime program that night in a tie with CBS’ Blue Bloods. In fact, the entire sixth season averaged 6. 41 million viewers, down just five percent from its previous season, a rare feat for a show at this point in its run. When considering Last Man‘s Friday night time slot, that’s a downright miracle, considering Friday night is where broadcast network shows typically go to die a more prolonged death. For comparison, in its second season, Dr. Ken drew an average 4. 41 million viewers, down a steep 16. 3 percent from its first season. The Real O’Neals fared even worse in its sophomore season, drawing an average of 3. 07 million viewers, a drop of 22 percent. Those cancellations were obviously  . Which then begs the question  …    . 3. Why did ABC bring back the perpetually   Quantico when it draws   of Last Man Standing‘s viewership? If you haven’t seen the network’s government spy thriller Quantico, you’re hardly alone. The show’s second season averaged just 2. 8 million viewers per episode, down a whopping 35. 7 percent in viewership from its first season and an absolutely astonishing 45 percent in the key demo. So what to do when faced with these embarrassingly awful figures? Dungey confirmed Tuesday that ABC was bringing back Quantico for a third season, albeit with a smaller initial order of episodes. We’re “optimistic and excited about it,” Dungey said. She said the smaller episode order would allow the network to “see how it performs for us. ” Of course, there’s no way the renewal has anything to do with the show’s open hostility toward President Donald Trump and his supporters, right? Right? 4. Why would ABC move one of its   flagship series, Marvel’s Inhumans, to Friday night, traditionally a wasteland for unwanted shows? Dungey said on the call that the network wants to make Friday night a “destination” for   and fantasy fans. To achieve that, ABC set its     series Once Upon a Time at 8 p. m. Friday, followed by Marvel’s Inhumans, a superhero   and then once Inhumans finishes its run, the network will run Agents of S. H. I. E. L. D. in its place. Here’s the question: Inhumans is set to air its first two episodes in IMAX theaters for two weeks ahead of the show’s launch on TV. It’s ostensibly a   show for the network, and undoubtedly costs a ton of money to produce. Why would the network move this show to the 9 p. m. hour on Friday when it is traditionally the   time on television? And it isn’t just me who has asked this question: “Did ABC Already Doom Marvel’s Inhumans With Its Timeslot?” wondered CinemaBlend’s Mick Joest on Tuesday. Maybe the network just doesn’t believe it’s going to be very good. The move to Friday does make at least a little bit of sense for Once Upon a Time after a stellar first four seasons and a modest drop in Season 5 (and after the departure of most of its core cast members) the sixth season of the fantasy drama averaged just 3. 2 million viewers and a 0. 94 in the key demo, down 28. 3 percent and 31. 6 percent, respectively. Then again, the network just renewed Once for a total reboot in its seventh season. Why would ABC move its premiere family show from its comfortable Sunday night family slot to be a   for Inhumans? Instead, Sunday nights will begin with America’s Funniest Home Videos, then move to To Tell the Truth, then reality show Shark Tank, and then new Kyra Sedgwick drama Ten Days in the Valley. Which seems an odd sort of lineup for a traditional family TV night. 5. Is there any other show in history that has not only retained its audience but has beaten most other comedies of its type that has been cancelled as abruptly? Ever? Tim Allen broke his silence Tuesday to say he was “stunned and blindsided” by ABC’s decision. He likely joins many of the fans of his show (at least 138, 000) who now feel as if the only family entertainment they could enjoy has been taken off the air, for reasons that can’t possibly boil down to ratings and scheduling. A representative for ABC did not immediately respond to a request for comment, but the article will be updated if we hear from them.   Follow Daniel Nussbaum on Twitter: @dznussbaum '"}, "time": 1742562408.8934827}