{"duration": 0.21709108352661133, "input_args": {"text": "'No-fly zone would ‘require war with Syria and Russia’ – top US general Published time: 22 Sep, 2016 20:34 Edited time: 23 Sep, 2016 15:08 Get short URL US Defense Secretary Ash Carter and Chairman of the Joint Chiefs of Staff Joseph Dunford testify before the Senate Armed Services Committee on Capitol Hill in Washington, DC, September 22, 2016 © Yuri Gripas / Reuters Speaking to the US Senate, the Pentagon’s leaders blamed Russia for the Aleppo aid convoy attack, but admitted they “had no facts.” Only US coalition planes should be allowed over Syria, they said, though that would require war against both Syria and Russia. \\nDefense Secretary Ash Carter and General Joseph Dunford , Chairman of the Joint Chiefs of Staff, faced the Senate Armed Services Committee on Thursday to report on the ongoing military operations and “national security challenges” faced by the US. They also asked the senators for more reliable funding, saying the uncertainty was hurting the defense industry. \\n“Not only our people – our defense industry partners, too, need stability and longer-term plans to be as efficient and cutting-edge as we need them to be,” Carter told the senators. Speaking about #sequester at #SASC , Ash Carter said it was unfair to \"defense industry partners\" too. pic.twitter.com/tQvNE4FWRc — Nebojsa Malic (@NebojsaMalic) September 22, 2016 \\nThe lawmakers were far less interested in the war against Islamic State (IS, formerly ISIS/ISIL) than about the future of the Syrian government, Iran’s “malign influence,” and “aggression” by China and Russia – all ranked far ahead of terrorism on Carter and Dunford’s list of security challenges. \\nThe Pentagon had “no intention” of sharing intelligence with Russia when it came to Syria, Dunford told the lawmakers unequivocally. Secretary Carter explained that the joint implementation councils envisioned by the ceasefire proposal negotiated in Geneva wouldn’t share intelligence, just coordinate efforts – but that they were a moot point anyway, since the ceasefire was effectively dead. \\nREAD MORE: AP leaks one of the 5 Syria ceasefire docs, Moscow says always wanted them public \\nBoth the lawmakers and the Pentagon chiefs blamed that development on Russia, focusing on the alleged airstrike against the humanitarian convoy in east Aleppo while the US-led airstrike against the Syrian Army fighting IS in Deir ez-Zor went unmentioned. \\n“I don’t have the facts,” Dunford said, when asked about the convoy attack by Sen. Richard Blumenthal (D-Connecticut). “It was either the Russians or the regime,” he added. \\n“There is no doubt in my mind that the Russians are responsible,” whether directly or because they backed the government in Damascus, Dunford said, describing the attack as “an unacceptable atrocity.” \\nCarter explained Dunford’s logic in a response to Sen. Lindsey Graham (R-South Carolina), saying that “the Russians are responsible for this strike whether they conducted it or not, because they took responsibility for the conduct of the Syrians by associating themselves with the Syrian regime.” Read more US airstrikes on Syrian troops were ‘intentional,’ lasted nearly 1 hour – Assad to AP \\nThe latest proposal by Secretary of State John Kerry involves grounding only Syrian and Russian airplanes, Carter told Sen. Jeanne Shaheen (D-New Hampshire). \\n“There can be no question of grounding US aircraft” over Syria, he said, adding that US jets conduct their strikes “with exceptional precision… that no other country can match.” \\nSen. Roger Wicker (R-Mississippi) asked about what it would take for the US to impose a no-fly zone over Syria, using the phrase “control the airspace.” \\n“Right now… for us to control all of the airspace in Syria would require us to go to war against Syria and Russia,” Dunford replied, drawing a rebuke from committee chairman John McCain (R-Arizona), who argued a no-fly zone was possible without war. \\nAsked about the video of US-backed Syrian rebels insulting US Special Forces in Al-Rai and running them out of the northern Syrian town, Carter and Dunford shrugged it off. \\nREAD MORE: ‘Crusaders! Infidels! Dogs! Get out!’ US-backed rebels force US commandos to leave Syrian town \\nA “very small minority took verbal action” against US troops, said Dunford, who admitted he did not watch the video but had discussed it with US commanders. He said the incident was “irrelevant” because the US-backed forces and Turkey were making “great progress” along Syria’s northern border. — RT America (@RT_America) September 21, 2016 \\nIn their exchange with Graham, Carter and Dunford confirmed there is a plan to arm the Kurdish militia in Syria, over Turkish objections, as a way of advancing on the IS stronghold of Raqqa. Once Raqqa is taken, however, an Arab force would be required to hold it. “We have a plan,” Dunford said, but described it as “not resourced.” \\nDunford agreed with Graham’s assertion that the US had two objectives – to destroy IS and to “remove Assad,” referring to the Syrian president – but admitted the Kurds were not interested in the latter. \\n“If the main fighting force inside of Syria is not signed up to take Assad out, where does that force come from?” Graham asked. Neither Dunford nor Carter had an answer to that. \\nBoth the Pentagon heads and the lawmakers agreed throughout the hearing that caps on military spending mandated by sequestration were harmful and needed to be repealed. Lack of funding posed a significant threat to readiness and maintenance, Carter and Dunford argued, before pointing out that the US military was still the strongest, most powerful and most competent in the world. '"}, "time": 1742563956.7060385}