{"duration": 0.056288957595825195, "input_args": {"text": "'The New York Times waited until President Donald Trump was safely aloft in Air Force One before publishing its latest “scoop”: that the president told Russian Foreign Minister Sergey Lavrov in their private meeting on May 10 that former FBI James Comey was a “nut job. ”[The Times reports that Trump’s remarks were contained in “a document summarizing the meeting,” which it had not obtained but “which was read to The New York Times by an American official. ”  The headline on the Times story claims: “Trump Told Russians That Firing ‘Nut Job’ Comey Eased Pressure From Investigation. ” However, that is not what Trump actually said, according to the remarks as reported by the Times. The Times quotes Trump as follows: “I just fired the head of the F. B. I. He was crazy, a real nut job,” Mr. Trump said, according to the document, which was read to The New York Times by an American official. “I faced great pressure because of Russia. That’s taken off. ” Mr. Trump added, “I’m not under investigation. ” Trump appears to be referring to “pressure” in foreign policy. At no point does he say he felt any legal pressure. The Times includes a comment from White House Press Secretary Sean Spicer, who does not dispute that Trump made the comment, but attempts to explain the context: “By grandstanding and politicizing the investigation into Russia’s actions, James Comey created unnecessary pressure on our ability to engage and negotiate with Russia. ” The Times does not report what else may have been in the document, which would appear to have been classified. The Times used the same dubious methods in reporting Tuesday that President Trump had “asked” Comey to end the investigation into former National Security Adviser Michael Flynn. In that story, the Times relied on a Comey “associate” who read from a purported memorandum by Comey, which the newspaper never obtained or verified itself. And it spun Trump’s words as a “request,” when Trump had, in fact, merely said: “I hope you can let this go. ” CNN, predictably, convened a panel of experts immediately after the story was published, all of whom agreed that the Times story provided “bombshell” evidence of obstruction of justice. Spicer also told the Times: “The investigation would have always continued, and obviously, the termination of Comey would not have ended it. Once again, the real story is that our national security has been undermined by the leaking of private and highly classified conversations. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562589.9889321}