{"duration": 0.08310294151306152, "input_args": {"text": "'The State of New Jersey says you can’t eat the fish or shellfish from the Lower Passaic River and Newark Bay. That’s because they’re living in the Diamond Alkali Superfund Site, where toxic leftovers from the manufacture of chemicals like DDT and the infamous Agent Orange oozed into surrounding waterways to be taken up by the animals that inhabited them. It’s an evolutionary miracle some of these animals are even alive. No, seriously. A fish that adapted to survive in this water shows evolution at its finest, according to a study published Thursday in Science. The Atlantic killifish is a slippery sliver of silver about the size of a fat finger and as common as the minnow. Starting in the late 1990s, researchers became aware that the fish was tolerant of the toxic waters at the Lower Passaic Superfund site and at least three other highly polluted areas along the Atlantic coastline. The new study found that over just a few decades, distinct populations of killifish independently developed similar genetic adaptations that make life possible in the most unlikely environments. The findings show that evolution doesn’t have to start in one place to be repeated. “It’s these shared changes as well as the unique pattern of changes in these different populations that provide us with a really useful field example of how animals can respond to rapidly changing and extreme environments,” said Diane Nacci, a biologist at the Environmental Protection Agency who worked on the study. She and other researchers, led by Noah Reid, an evolutionary geneticist at the University of Connecticut, compared the whole genomes of 384 killifish from these areas and nearby,   waters. They found that in all regions, one particular genetic pathway was the source of the pollution tolerance, although slightly different patterns of genetic changes were responsible in each population. Normally, toxic chemicals like dioxins and polychlorinated biphenyls, or PCBs, set off a number of changes inside sensitive fish that interfere not just with the survival of adults, but also with the development of their embryos. But in the tolerant fish, the trigger for those changes is turned off, allowing some fish to survive levels of PCBs thousands of times higher than the levels affecting sensitive fish. The mutation occurred rather quickly. This speedy evolution was made possible, the researchers think, by the huge and genetically diverse killifish populations that may have harbored a rare mutation. “Whenever you have large population sizes, there’s a chance some might actually carry mutations on their genomes that are advantageous in novel environments, like pollution,” said Michael Tobler, an evolutionary ecologist at Kansas State University who was not involved in the study but wrote a complementary paper on the research for the same issue of Science. “Any that didn’t have this lucky mutation didn’t make it. ” Those that did reproduced, and so became the   Atlantic killifish. But in smaller populations with less diversity, the chance that a rare mutation like this already exists is slim: Evolution is put on hold until that mutation develops. This story “adds to the body of literatures suggesting that preserving genetic diversity within species might be important for buffering them against global climate change,” Dr. Reid said. But it’s not a mop for the pollutants we have imposed on our environment over the past century. “At first sight this study might tell us, well, it will all be fine,” Dr. Tobler said, addressing the argument that perhaps we need not worry if nature appears to be finding solutions on its own. “These killifish can do it, and there’s probably many species out there that can respond in this particular manner, but there’s probably going to be lots of species out there that can’t. ” Additionally, adaptations typically come at a cost. The story of evolution predicts that once the water becomes clean, a tolerant fish won’t do as well as a sensitive fish. What’s the consequence of turning off this pathway, which is responsible for dealing with toxicity at less extreme levels? Researchers are still looking for answers.'"}, "time": 1742562104.2056773}