{"duration": 0.04995250701904297, "input_args": {"text": "'Renuncian a llevar a su hijo a la escuela porque quieren educarlo en Forocoches SEGÚN LOS PADRES, ESTE FORO ES EL PRIMER PASO PARA LICENCIARSE EN LA UNIVERSIDAD DE LA CALLE Xunta de Galicia \\nLuis Fedra y María Ramos, residentes en Vigo, han decidido renunciar a que sus tres hijos sean educados por la vía tradicional. “No queremos que vayan a la escuela, preferimos educarlos en Forocoches”, explica Luis. \\nLos niños han dejado de ir a clases esta semana y ya tienen sus cuentas de usuario en este foro de Internet, que se encuentra entre las 40 webs más visitadas de España. “La universidad de la calle hoy en día es este foro: sus hilos de discusión recorren los temas más relevantes de la actualidad y de la sociedad de la España de hoy y de siempre”, defienden los padres. \\nSegún dicen, una criatura educada conjuntamente por la comunidad de Forocoches recibirá la formación necesaria “para vivir en un país como España, con todas sus particularidades”. La escuela, insisten, “crea una burbuja irreal y luego los críos crecen y no entienden nada de lo que ocurre en la vida real, en la calle”. \\n“La Lei de Apoio á Familia fomenta el vacío legal del estudio alternativo”, reconoce un portavoz de la Xunta de Galicia, que pasa la pelota al Ministerio de Educación. Mientras la discusión se atranque en disputas administrativas, Luis y María se encargarán de que sus tres retoños lean y estudien temas de Forocoches como “Ford Fiesta síntomas raros”, “Los mejores chicles del siglo” o “Que te la chupen con aparatos sí o no???”. \\nSegún han explicado algunos usuarios registrados de Forocoches, “los pequeños shurmanos han empezado nerviosos y no se han atrevido a comentar mucho, pero es normal porque es su primer día. Aquí hay mucho troll y ya irán viendo el panorama, pero vamos, peor que en el cole no va a ser”, en palabras de “pollamalaga93”. \\nLos padres se muestran optimistas también tras el estreno de los niños en el foro. “Carlitos, que siempre ha sacado buenas notas en Historia, ya ha creado su primer hilo de discusión: ‘Te UNIRIAS al EJERCITO si MARRUECOS nos INVADIERA?’. Le han contestado más de cien personas”, certifica la madre con orgullo.'"}, "time": 1742628405.8116918}