{"duration": 0.1096048355102539, "input_args": {"text": "'BARRY GREY, WSWS.ORG O ne week before Election Day, with the polls tightening and the outcome uncertain, the entire US political system has been thrown into turmoil by the unprecedented intervention of the Federal Bureau of Investigation (FBI). The letter sent Friday to Congress by FBI Director James Comey, informing it of a new avenue of investigation into Hillary Clinton’s use of a private email server, has lifted the lid on a raging conflict within the state apparatus. Long-simmering tensions are exploding into open political warfare. Since Friday, various officials within the FBI and the Justice Department have let it be known that the investigation into Clinton has generated sharp divisions, with local FBI offices demanding a more aggressive investigation into Clinton’s alleged mishandling of classified information as well as a separate probe into allegations of corruption involving the multi-billion-dollar Clinton Foundation. This internecine conflict intensified after Comey announced last July that the investigation into Clinton’s emails was completed and no criminal charges would be brought. With his letter to Congress, Comey intervened on the side of the faction calling for more aggressive action against Clinton. Justice Department officials have let it be known that they opposed Comey’s decision to make public, just 11 days before the November 8 election, the agency’s review of additional emails. The Democratic Party and the Clinton campaign, along with former attorneys general, Republican as well as Democratic, have bitterly denounced Comey’s action. Harry Reid, the top Senate Democrat, sent a letter accusing Comey of violating the Hatch Act, which prohibits federal employees from publicly acting in support of one or another candidate. At least one Democratic congressman has demanded that the FBI chief immediately resign. Only a few weeks ago, Clinton and the Democratic Party were indignantly denouncing Trump’s charges that the election was rigged. Such charges, they claimed, were an unpatriotic slur on the pristine character of US elections and American democracy. Now, under changed circumstances, it is they who are shouting foul and accusing the FBI of trying to rig the vote against them. In fact, both factions of the ruling class have utilized the methods of scandal-mongering to fight out their battles. Over the past several months, the Democrats have centered their campaign against Trump on sex scandals and neo-McCarthyite, manufactured claims that Trump is a proxy of the Kremlin. In his letter to Comey, Reid doubled down on these charges by accusing the FBI of refusing to make public “explosive information about close ties and coordination between Donald Trump, his top advisors, and the Russian government—a foreign interest openly hostile to the United States…” Trump, for his part, had pointed to the pro-Clinton bias of the media, denounced the failure of the FBI to prosecute Clinton, and made thinly veiled appeals to anti-immigrant and racist sentiment by charging that Election Day would see systematic ballot-stuffing in predominantly immigrant and minority communities. In fact, the entire election is a mockery of genuine democracy. Neither of the parties can offer any policies to address the real concerns of working people. Mud-slinging and scandal-mongering are used to bury the burning issues of war, social inequality and attacks on democratic rights. The latest turn in the presidential race underscores the reactionary basis on which Clinton and the Democrats have conducted their campaign. They have sought to oppose the fascistic Trump from the right, seeking to win the support of Republican leaders and voters as well as the military/intelligence establishment by promoting Clinton’s credentials as an advocate of military intervention, while declaring Trump unfit to serve as commander in chief. Their barely disguised indifference to the plight of workers and lack of support within the working class have made them highly vulnerable to the machinations of pro-Trump forces within the state. These developments have also underscored the treacherous role of Bernie Sanders. Having won mass support in the working class and among young people by portraying himself as a socialist and opponent of the “billionaire class,” he has sought to use his influence to channel social opposition back behind the Democratic Party and the campaign of Clinton, the favored candidate of Wall Street. He has thereby played a critical role in preempting and blocking the emergence of an independent political movement of the working class. Regardless which candidate wins the election next Tuesday, nothing will be resolved in the crisis of the two-party system. Both candidates, the two most unpopular in US history, are despised by broad masses of the population, and the election result will be seen as illegitimate by a majority of the American people. A Trump victory will be seen by tens of millions of workers as a declaration of war against the working class. A Clinton win will be seen as a continuation of the reactionary status quo. Nor will the ferocious conflicts within the state recede. These are rooted objectively in a historic crisis of American and world capitalism. Economic crisis and decay, ever-widening social polarization and intensifying geopolitical conflicts have fatally eroded the foundations of bourgeois democracy. The unprecedented political crisis that has erupted in the 2016 elections is the outcome of a protracted process. The breakdown of the political system emerged in open and explosive form in the 1998 impeachment of Bill Clinton on the basis of a sex scandal. In an editorial titled “Is America drifting towards civil war?” published by the World Socialist Web Site following the vote by the House of Representatives to impeach Clinton, we wrote: “The crisis in Washington arises from an interaction of complex political, social and economic processes. Bourgeois democracy is breaking down beneath the weight of accumulated and increasingly insoluble contradictions.” That watershed event was followed by the stolen election of 2000 and the launching one year later of the “war on terror” after the 9/11 attacks. Fifteen years of uninterrupted and ever expanding war, accompanied by a frontal attack on democratic rights and the erection of the framework of police state rule, the greatest economic crisis since the Great Depression, and a further transfer of wealth to the rich have only increased the power of the military and intelligence “deep state” and further eroded the traditional constitutional framework of capitalist rule in America. These processes have found a toxic expression in the degrading spectacle of the 2016 election. In an election dominated by the growth of social opposition and disgust with the entire political system, voters are left with the “choice” between two corrupt, right-wing representatives of the richest 1 percent. It is crucial that the working class intervene into the political crisis as an independent force fighting for a program that addresses its needs and interests, not the drive for profit of the financial aristocracy. Short of this, the crisis of the two-party system will produce only a further lurch to the right, with more brutal attacks on working class living standards and an accelerated movement toward dictatorship and a new world war. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE ABOUT THE AUTHOR The author is a senior member of the Social Equality Party, publisher of wsws.org, and a formation which he naturally favors as an option in this election. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742563525.4024696}