{"duration": 0.10365486145019531, "input_args": {"text": "'Palestinian factions and terrorist groups hailed an attack carried out by three terrorists that killed a female Israeli police officer in Jerusalem on Friday and wounded others nearby. [The attack took place near the Damascus Gate in Jerusalem’s Old City and saw three Palestinian terrorists armed with knives and guns open fire and start stabbing those nearby, critically wounding Hadas Malka, 23, a policewomen who died of her wounds. Others were wounded in the assault, and all three terrorists were shot dead by Israeli security forces at the scene.  The Islamic State used its Amaq news agency to claim that “soldiers of the caliphate” attacked a “gathering of Jews. ” Hamas rejected the IS claim of responsibility while Israeli officials expressed skepticism over the IS statement. The Islamic Palestinian factions praised the combined attack, with an Islamic Jihad spokesman Dahoud Shihab saying in a statement released immediately after the terrorist event that “The martyr’s blood that was spilled at the gates of the   Mosque is a clear message that the intifada continues and that the Palestinian people will not give up. ” Shihab praised “the pure martyrs who were killed while fasting,” and noted that the attack in Jerusalem “is proof that Jerusalem is the land of the jihad. Praise be to the pure martyrs who rose up to defend the purity and sanctity of the blessed land while screaming in the faces of all those who seek normalization. ” Hamas also praised the attack in Jerusalem. Hazem Qassem, one of Hamas’ spokesmen, said in a special statement that the attack was additional proof “that our Palestinian nation continues its revolution against the criminal occupation and that the intifada will continue until we achieve full freedom. ” According to him, the death of the three terrorists “is proof that the occupation is the true face of terror, terror against which the Palestinian nation is exercising its right to defend itself and its holy places. ” The Abou Ali Mustafa Brigades, the military arm of the Popular Front for the Liberation of Palestine, also praised the attack and called the carnage “a natural response to the crimes of the continuing occupation against our people. ” “The act sends a clear message to the leaders of the occupation that the opposition and the intifada continue and are revitalized and we haven’t been broken despite all the steps and tools of criminal oppression,” the statement added.  The terrorist organization called for the Palestinian people “to continue the heroic attacks that spill the blood of the occupation and to continue supporting the resistance. ” Israeli “occupation” refers to Israel’s presence in the West Bank, home to historic Jewish communities like Hebron and Beit El, as well as Israel’s control over eastern Jerusalem, which contains the Temple Mount and Western Wall. Instead of condemning the terrorist attack, the Fatah movement, led by Palestinian President Mahmoud Abbas, slammed what it called “the killing of three young Palestinians by the forces of the Israel occupation in East Jerusalem. ” Fatah was referring to the three terrorists who were eliminated in the middle of carrying out their murderous assault against Israelis. The statement, published by the movement in the official WAFA Palestinian news agency, added that the deaths of the three attackers represents “the continuation of Israeli policies of escalation and is proof that the Israeli occupation government is continuing its policies. ” Abbas’s Fatah movement called “for the Israeli occupation government to immediately cease the escalation that does not serve the security or stability of the region. ” The movement further called on the international community “to seriously consider the possibility of security international protection for the innocent Palestinian people. ”'"}, "time": 1742562160.675202}