{"duration": 0.12131452560424805, "input_args": {"text": "'Outgoing President Barack Obama is using his power over U. S. immigration rules to help Cuba’s dictatorial government shut down emigration from the island’s backward economy. [Late Thursday, Obama cancelled the   “   foot” migration policy, which allowed Cubans to get a U. S. Green Card once they were officially “paroled” into the United States. The policy, which was established by President Bill Clinton in 1995, also forced Cubans caught at sea back to the island dictatorship.  Since 2009, roughly 100, 000 Cuban migrants have used the “dry foot” policy to migrate into the United States, although at enormous cost to taxpayers. Currently, thousands of Cubans are migrating through Central America, heading to the California and Texas borders in the expectation they’ll get asylum and Green Cards. Clinton’s wet    policy narrowed a 1966 law which provided Green Cards to all escapees from Cuba’s   regime. Many Cubans used the policy to migrate into Florida and other states during the 1960s and even in the 1980s, when Cuba’s leaders sent thousands of criminals to Florida, causing a huge drop in wages for unskilled Americans in Miami. A White House statement said Obama’s new ‘ ’ policy will treat migrating Cubans like it treats ordinary migrants from Mexico and many other countries, only a few of whom are allowed to file for asylum.  “By taking this step, we are treating Cuban migrants the same way we treat migrants from other countries,” said a statement from the White House. “The Cuban government has agreed to accept the return of Cuban nationals who have been ordered removed, just as it has been accepting the return of migrants interdicted at sea. ” But Obama’s   policy for Cuban migrants is sharply different from his   policy towards the people of Honduras, Guatemala and El Salvador.  Since 2012, Obama has used his administrative power to permit at least 350, 000 people from these three countries to cross the U. S. border and then quickly file for file for asylum and work permits, even though they are mostly fleeing for economic reasons. The cost to taxpayers of Obama’s help for the unskilled Central American adults, youths, and children will exceed $200 billion over the next 75 years, unless most are sent home, according to multiple estimates. Obama’s statement sought to justify his shutdown of Cuban immigration as a   policy, not as a policy intended to drive up Americans’ wages by reducing economic competition from unskilled migrants. The United States, a land of immigrants, has been enriched by the contributions of   for more than a century.  Since I took office, we have put the   community at the center of our policies. With this change we will continue to welcome Cubans as we welcome immigrants from other nations, consistent with our laws. During my Administration, we worked to improve the lives of the Cuban people  —   inside of Cuba  —   by providing them with greater access to resources, information and connectivity to the wider world. Sustaining that approach is the best way to ensure that Cubans can enjoy prosperity, pursue reforms, and determine their own destiny. As I said in Havana, the future of Cuba should be in the hands of the Cuban people. In 2014, Obama declared the national socialist government of Cuba was a legitimate government, and promised to boost trade with   companies in the tropical island prison.  “I believe that we can do more to support the Cuban people and promote our values through engagement. After all, these 50 years have shown that isolation has not worked.  It’s time for a new approach,” Obama said in December 2014.  To the Cuban people, America extends a hand of friendship.  Some of you have looked to us as a source of hope, and we will continue to shine a light of freedom.  Others have seen us as a former colonizer intent on controlling your future.  José Martí once said, “Liberty is the right of every man to be honest. ”  Today, I am being honest with you.  We can never erase the history between us, but we believe that you should be empowered to live with dignity and  .  Cubans have a saying about daily life:  “No es facil”  —    it’s not easy.  Today, the United States wants to be a partner in making the lives of ordinary Cubans a little bit easier, more free, more prosperous. Obama’s new decision does not kill off a 1995 agreement, under which the U. S. accepts 20, 000   emigrants each year.    advocacy groups praised Obama’s new restrictions on Cubans seeking to escape the dictatorship. “The Obama Administration has taken a positive step toward a more sensible Cuban immigration policy, one that ends preferential treatment for Cubans compared with others who arrive without visas,” said a statement from program director Geoffrey Thale, at the Washington Office on Latin America.  Up until now, U. S. policy has permitted Cubans who arrive at a U. S. border without a visa to be paroled into the country, and put on a path toward citizenship, an advantage that no other Latin Americans enjoy, and one that has seemed particularly unfair when children and families fleeing violence in Central America are subject to deportation. This change ‘normalizes’ our treatment of Cuban immigrants. Cubans have been seeking entry into the United States primarily because of economic stagnation at home. The U. S. embargo is one of many factors that has contributed to that stagnation, and so WOLA and many colleagues have recommended to the Administration that it should both end preferential treatment for Cubans and increase the number of visas available to Cubans who pursue regular immigration routes. The population of Cuba is 11. 2 million.'"}, "time": 1742564402.449631}