{"duration": 0.03205585479736328, "input_args": {"text": "'President Donald Trump fired off a series of tweets on Monday morning defending his executive order suspending travel from several   countries, referring explicitly  —   and defiantly  —   to the order as a “travel ban. ”[The media pounced on Trump’s use of the phrase “travel ban,” with CNN and others declaring that Trump had undermined his own legal case, which may soon come before the U. S. Supreme Court for a decisive ruling.  Trump tweeted: People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!  —   Donald J. Trump (@realDonaldTrump) June 5, 2017, The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S. C.  —   Donald J. Trump (@realDonaldTrump) June 5, 2017, The basis of the legal challenges to Trump’s executive orders is the argument that his executive order is really an effort to exclude Muslims from the U. S. on religious grounds, and is therefore a violation of the First Amendment. But Trump’s tweets said nothing about religion. In fact, they arguably strengthen his argument that the executive orders are not motivated by religious bias, because they refer specifically to a “travel ban” and not a “Muslim ban. ” The government has argued that the travel restrictions would apply equally to people of all faiths from the countries subject to the temporary suspension. Only the word “ban” is common to both phrases. While that word suggests the president might have intended more permanent restrictions, nothing in the wording of his orders provides for that. In a Washington Post article titled “Trump’s latest tweets will likely hurt effort to restore travel ban,” correspondent Matt Zapotosky notes that the tweets “made clear  —   despite his own press secretary’s past remarks to the contrary  —   that the executive order is a ‘ban,’ not a pause on some sources of immigration or an enhanced vetting system. ” But the press secretary’s comments are irrelevant to the case, and so is the difference between a “pause” and a “ban. ” Zapotosky provided no further explanation as to how “travel ban” conveyed religious bias against Muslims. Zapotosky argues that Trump’s new endorsement of the first version of the “travel ban” also helps build a case that it was motivated by religious bias  —   but again, he fails to explain how. A federal court in Boston actually upheld that first version of the order on the grounds that the president had sweeping authority to designate classes of aliens that could be excluded from the country, and that the courts did not have authority to dictate national security policy. What appears to have happened is classic confirmation bias. Journalists and political critics of the president seem to have read “Muslim ban” into the phrase “travel ban,” confusing wishful thinking on their part for legal analysis. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628546.0229137}