{"duration": 0.0671226978302002, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nFormer comedian and current Senator Al Franken (D-MN) wasn’t joking when he suggested that FBI Director James Comey answer to the Senate regarding his unprofessional behavior. \\nOn Sunday, Franken called for the Senate Judiciary Committee to hold hearings concerning Comey’s handling of the investigation into Hillary Clinton’s private server and whether or not she compromised national security. \\nThe Minnesota senator also said he believes Clinton can count on his state’s voters despite a last-minute campaign stop from Donald Trump, though the senator admitted that he’s always “nervous.” \\n“I think that there should be hearings, and I’m certain there will be hearings in the Judiciary Committee on this matter,” the Franken told CNN’s Jake Tapper on “State of the Union.” \\nFranken’s remarks reflect growing Democratic anger with Comey after the director told lawmakers 11 days before Tuesday’s presidential election that his agency was reviewing new emails that may or may not be connected to their previous investigation. \\nComey, who previously cleared Clinton of any criminal negligence, sent a vaguely worded letter to top Republicans that falsely gave the impression that the FBI was reopening the Clinton investigation. \\n“Even more troubling is what we’ve heard from sort of the rogue elements of the FBI seemingly tipping off former (New York City) Mayor (Rudy) Giuliani that something was up. I mean, it just seems like — that’s not the FBI,” Franken said. \\n“We will have hearings. I’m sure that FBI Director Comey will be before us,” Franken said. “I think he should be able to answer questions about this, and he should be able to control the FBI.” \\nThe senator also went to bat for the Clinton Foundation after Tapper questioned him on whether or not the organization should be shut down should Clinton win the election. However, the Minnesota lawmaker redirected his answer to address alleged illegal activities perpetrated by Donald Trump’s foundation. \\n“I think that sometimes people should compare the two foundations, the Trump Foundation and the Clinton Foundation — that the HIV drugs to millions of people vs. the Trump Foundation, which doesn’t seem to have done much of anything for anybody other than Donald Trump,” Franken said. \\nFranken also reassured viewers that he wasn’t worried about which way his home state would vote in the election. \\nTrump is scheduled to visit Minnesota, a state that has not voted for a Republican since 1972, as one of his last few campaign stops before Tuesday. \\nWhen asked if he felt Clinton was in trouble there, Franken replied, “I don’t think so.” \\nHowever, Franken admitted, “I’m always nervous.” \\n“We run through the finish line,” he said. “This is what I tell everybody, I go to canvassing centers, I say, ‘Many of you have jobs, many of you have families — ignore them. Get on the doors.’“ \\nFranken’s nervousness is shared by millions of Americans who worry about the idiocy of some of their family, friends, and neighbors who seem hell-bent on handing the country over to Trump tiny slimy hands. \\nFeatured image via YouTube'"}, "time": 1742561945.391431}