{"duration": 0.20207881927490234, "input_args": {"text": "'On a hot September day in Brooklyn, I got off the G train at Metropolitan Avenue and walked through Williamsburg, a neighborhood so thoroughly celebrated it has become something of a cliché. Though it is only one subway transfer from my Flatbush Avenue apartment, I hadn’t been to the neighborhood in years. Today, it has the same incongruous mix of old and new that defines gentrifying neighborhoods. I walked by    condos next to ornate Orthodox churches and modest postwar townhouses. The crowd included men in suits, fashionably unfashionable   neighborhood elders sitting on McCarren Park benches, and nannies pushing expensive strollers past industrial facades painted with colorful murals. Sleek restaurants had opened alongside bodegas, coffee shops and pharmacies  —     establishments that had somehow held on. Since I have lived the larger part of the last decade along the stretch of Flatbush Avenue south of Crown Heights known as Caribbean Flatbush, the version of Brooklyn that one finds in Williamsburg  —   the Brooklyn of national popular perception a sort of East Coast Portlandia, only richer  —   was largely foreign to me. Sure, I’d been to Smorgasburg, Brooklyn Flea’s roaming   food market, so I knew that $10 jars of pickles and “artisanal mayonnaise” were not entirely mythological. I have drunk more than my share of lambrusco at my favorite Fort Greene happy hour bar, Olea, and devoted many Sundays to multihour brunches with girlfriends among the cozy brownstones of Cobble Hill or Prospect Heights. But while I’m not oblivious to its charms and temptations, upscale Brooklyn  —   whether hip or tony  —   is not my Brooklyn. So, as a writer and parent of a young child, being tasked with exploring the borough’s cushier corners felt like a dream assignment. Who, after all, wouldn’t delight in getting the blessing of your employer to eat and drink and treat yourself to the best of your town? Over a weeklong period, I searched out a side of Brooklyn that scarcely existed two decades ago. I visited boutiques and bistros, spas and cocktail lounges,   cinemas and creative new waterfront parks. It was a quest that would not have been complete without at least one afternoon in Williamsburg. Across the   skyline I spotted my destination: the futuristic silver tower of the William Vale, which had opened just nine days before. Among the newest in a series of luxury hotels that have opened in recent years in the borough  —   including the nearby Wythe and the    1 Hotel Brooklyn Bridge  —   the William Vale is ostentatious even by the standards of “new Brooklyn. ” Along with its standard $  $500 rooms, each of which features an   balcony, it offers a “garden residence,” a    duplex suite with an enormous patio and an outdoor Jacuzzi. Starting rate: $6, 000 a night. The William Vale rises from its   and   surroundings like an opulent monument surrounded by nondescript headstones. As I waited for the elevator in the lobby, which was splashed with abstract color, I made small talk with the host, a thin man in a handsome suit, his hair parted down the middle like a 1950s film villain. “You’re from the neighborhood?” he asked as he escorted me to the 22nd floor. No, farther south, I told him. Flatbush. He looked perplexed. He lived in Upper Manhattan, he said. “In 15 years, I’ve probably been to Brooklyn only a handful of times. ” Now he was commuting here. It felt like the revenge of the bridge and tunnel crowd. At Westlight, the hotel’s Andrew Carmellini bar, I fought back my fear of heights and headed for the outer deck, peering across the East River to the full expanse of Manhattan. Servers wore vaguely retro navy blue dresses, and a Jason Schwartzman   sported a wooden bow tie. While not going out of its way to defy stereotype, the place was welcoming  —   more casual, and less affected, than its showy,   setting would suggest. In a loftlike room lit by globe lights, I pulled up a stool at the   bar and ordered a $14 glass of Sonoma County sauvignon blanc, a fair price of admission for the dizzying views. Counterintuitively, perhaps, another stop I made in Brooklyn was Crown Heights, a neighborhood that was still closely associated with the 1991 riots when I arrived in the city in the  . Today, it exemplifies gentrification. Along Franklin Avenue, chic new restaurants, bars and boutiques open with such frequency that if even a few months pass between visits, I sometimes find myself disoriented. Was that slick sushi spot there before? When did this wine bar open? Within blocks of one another, there is Aita, a   Italian trattoria with pasta that is praised in superlatives an elegant Mexican restaurant with a   tile bar and a pressed copper roof (Chavela’s) and Glady’s. The last of these serves a similar menu to so many   jerk chicken   places except that it has a   Michael Jacober, who is a Per Se alum an evocative   dining room and potent dark and stormy slushies with a fierce kick of ginger. As if overnight, one Crown Heights street has more fine restaurants than some   cities. On a weekday afternoon, I met a girlfriend at Café Rue Dix, a   bistro on Bedford Avenue, where we were greeted with a warm, unironic “Welcome to Africa. ” We sat at a sidewalk table during a happy hour that draws regulars from the neighborhood for its signature cocktail, the Kale Hemingway (white rum, green juice, lime and maraschino, $9)   bread and     spring rolls. The warm, comfortably weathered space does, somehow, feel both distinctly Crown Heights and vaguely Parisian, though this last impression may have been the   cocktail talking. I ducked next door to Marché Rue Dix, a “cultural concept store” opened by Nilea Alexander, the   (with her Senegalese husband, Lamine Diagne) of Rue Dix. The shop had   flooring and sold chunky sunglasses and funky coats,   candles and stylish African imports. Like the nearby and newly opened Crabby Shack, a bright and airy urban seafood spot, Rue Dix’s twin businesses gave me hope that at least some of the spoils of Crown Heights’ transformation might benefit black business owners. Like the wave of gentrification that has washed from Williamsburg ever deeper into Brooklyn  —   north into what was once the Polish enclave of Greenpoint, east into Bushwick and south through    —   I Ubered from neighborhood to neighborhood. It was a luxury I normally afford myself only on the increasingly rare,   occasion of excess. But during my weeklong stint exploring upscale Brooklyn, I went out of my way to treat myself to such extravagances. I booked an afternoon “Urban Oasis”   massage for $135 at Fort Greene’s Cynergy Spa, where a long,   hallway led to a room with gilded mirrors and a white noise machine playing ambient water sounds. Despite its location at a busy   intersection, the place somehow managed to feel like a refuge. Afterward, I dipped into Karasu, the hidden,   bar behind the comfort food restaurant Walter’s, where a sophisticated,   room featured a wall of Japanese whiskeys. Charles Mingus played overhead while I sipped a Nettai, a   snow cone of rum, orgeat, mandarin and yuzu ($14) through a metal straw. I hadn’t felt so relaxed in months. Over the following days, I resisted impulse buys in   boutiques like Sincerely, Tommy and Peace  Riot drank rosé while watching vintage David Lynch at the cushy new Syndicated theater, in Bushwick, which has a full bar, a   “seasonal ingredient” food menu and   table service and with my husband, Tim, and toddler, Roxie, walked the length of Montague Street in Brooklyn Heights, an area that reminds me more of Boston than Brooklyn and which is home to Hillary Clinton’s campaign headquarters. Along the promenade, I couldn’t help but look up at the windows overlooking New York Harbor and wonder, what would it be like to wake up to that view? Or with the new Pier Six park, a model of postindustrial urban redesign, as your front yard? During my week of big spending, I was especially excited for a lavish date night dinner with my husband. But deciding where to go proved difficult. I waffled over whether to really go all out at the widely recommended Blanca, a   prix fixe restaurant behind Roberta’s in Bushwick. At $195 per person, not including drinks, tax and tip, it would have cost over $500. Twice, I made and canceled reservations. Finally, I decided. I just couldn’t do it. Instead, I booked a table at Olmsted for 10:30 p. m. on a Wednesday, an    York dinner hour and the only reservation I could get. When Tim and I arrived, the place  —   with a living wall, exposed bricks that had been painted white, and a backyard aglow with lights  —   was packed. Early Nineties Naughty by Nature (“O. P. P.? Yeah, you know me”) played as we were seated at a table beside the open kitchen, where a man with tweezers and comfortable sneakers carefully placed final touches on plates. The whole dining room smelled like the area around the Ebbets Field apartment complex, where the Golombeck spice factory infuses several city blocks with the scent of cumin and coriander, curry and paprika. It was a comparative bargain at $145 for two, including cocktails. Everything was beautiful, from the delicate porcelain water glasses,   and swirled like soft serve, to the bartender who wore long dreads and danced with the cocktail shaker as if it were a maraca. When the food arrived, one small plate at a time, it was beautiful, too. There was crawfish boil chicharrón in a newspaper cup, earthy chapati  —   small, flat disks served with cucumbers and labne  —   and a $12 rosemary cocktail of fire and acid. Amusing us both, Tim’s main was one giant slice of tomato. Having traveled from the Grand Army Plaza Greenmarket just up the street, it was served breaded and fried,  . How is it, I asked. “It’s like a grilled cheese,” Tim said. “It has that   …     ” he trailed off, transported to some cozy food memory. “I love putting tomatoes on my grilled cheese,” he said, as if struck by a revelation, an    boy excited about food for the first time. We both laughed. We laughed at the novelty of my week and the fundamental strangeness of being granted the opportunity to step into a life so different from my own. But in the end, a week of excess was a reminder of one of the basic promises of New York life, which remains the ability to straddle multiple worlds and to get glimpses into those that aren’t your own. At the forefront of Williamsburg’s   hotel revival, the Wythe Hotel (80 Wythe Avenue    wythehotel. com) is housed in a 1901 waterfront factory. The   (starting at $395) boutique hotel has an   art cinema, a Marlow  Sons sibling restaurant, Reynard, and the Ides, a “ ” cocktail bar where a draft pilsner will set you back $11. The new kid in town, the William Vale (111 North 12th Street thewilliamvale. com) claims the longest hotel pool in New York City, and has 183 guest rooms (from the  $300s) with    windows,   balconies, designer décor and contemporary art. Not yet open, but now taking reservations for February 2017, the   1 Hotel Brooklyn Bridge (60 Furman Street 1hotels. ) will be one of the few luxury hotels south of Williamsburg. Among its selling points are a restaurant by Seamus Mullen and a    rooftop patio with a plunge pool and fire pit. In a nod to Brooklyn’s waterfront history, the room designs incorporate reclaimed wood from the old Domino Sugar factory. From $350.'"}, "time": 1742562441.0966659}