{"duration": 0.019969463348388672, "input_args": {"text": "'CNN, which was dubbed Clinton News Network during the presidential campaign, is locked in a public relations battle with   Donald Trump —  and he’s winning, according to media experts. [“Maybe CNN gets a short term bump from the attention,” David Shuster, the former MSNBC anchor, who once worked for CNN President Jeff Zucker, told the Hill. “But the long term damage to CNN, and the boost to Trump, could be significant. He’s winning this. ”  Last week, CNN dedicated massive amounts of airtime to memos alleging that there was communication between Trump’s presidential campaign and Russian officials. Numerous allegations in the report, which Trump dubbed “fake news,” have since been found to be false: FAKE NEWS  —   A TOTAL POLITICAL WITCH HUNT!  —   Donald J. Trump (@realDonaldTrump) January 11, 2017,  Trump himself has said he believed CNN’s coverage of him would become fair after he beat Hillary Clinton, but he noticed that it had, instead, gotten “worse. ” “I thought that CNN would get better after they failed so badly in their support of Hillary Clinton however, since election, they are worse!” he wrote in November, a few weeks after the election. “CNN is so embarrassed by their total (100%) support of Hillary Clinton, and yet her loss in a landslide, that they don’t know what to do,” Trump also wrote on Twitter. Trump’s loyal supporters had also taken notice of what they thought was CNN’s biased coverage of the Republican nominee. In October, about a month before Election Day, for example, more than 10, 000 Trump supporters chanted “CNN sucks” during a campaign rally in Pennsylvania for   Trump. Supporters shout ”CNN sucks” during @realDonaldTrump rally in PA @BreitbartNews pic. twitter.   —   Alex Swoyer, esq. (@ASwoyer) October 11, 2016,  “If there is one thing we know for sure about Donald Trump, it’s that he can hold a grudge. Just ask Rosie O’Donnell or Graydon Carter,” media analyst Brian Flood told the Hill. “It would probably take Jeff Zucker heading to Trump Tower to kiss the ring to squash the whole thing,” Flood added. “Citizen Trump would hold a grudge for life, but   Trump has shown he’s willing to meet with anyone under the right circumstances. ” Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742628460.711062}