{"duration": 0.06390929222106934, "input_args": {"text": "'Outspoken broadcaster Katie Hopkins is parting ways with LBC Radio “immediately” following a controversial tweet in which she called for a “final solution” to Islamic terrorism. [Hopkins amended the tweet to read “true solution” soon after posting it on Tuesday, explaining that she had found the “typo” to be “disrespectful” to the victims of the attack on the Manchester Arena on Monday which killed 22 people.  But fellow Twitter users were quick to make the connection to the holocaust, labelling Hopkins a “Nazi”. 22 dead  —   number rising. Schofield. Don’t you even dare. Do not be part of the problem. We need a true solution. #ManchesterArena,  —   Katie Hopkins (@KTHopkins) May 23, 2017,  @KTHopkins How come you changed this from “final solution” to “true solution”? Come on, stand by those nazi words, nazi. pic. twitter.   —      (@JohnSeaborn) May 23, 2017,  @JohnSeaborn I stand by my tweet. I find the typo disrespectful to the survivors in Manchester,  —   Katie Hopkins (@KTHopkins) May 23, 2017,  Later the same day Hopkins was accused of inciting racial hatred after she tweeted “Western men. These are your wives. Your daughters. Your sons. Rise up. Demand action. Do not carry on as normal. Cowed. ” Both tweets were reported to the police for hate speech. The Met’s Contact Centre Twitter account confirming that complaints had been received and would be “assessed by specialist officers”. This is the response from the Met Police to the slaughter of our children in Manchester pic. twitter.   —   Katie Hopkins (@KTHopkins) May 23, 2017,  This is not the first time Hopkins’ tweets have landed her in trouble. In March, she was ordered to pay £24, 000 in damages and £107, 000 in costs to social justice activist Jack Monroe after wrongly accusing her of vandalising war memorials. Hopkins had meant to direct her tweet to New Stateman columnist Laurie Penny, who had shown indifference to a memorial to the Women of World War II being sprayed with graffiti reading “Fuck Tory scum”. On Friday morning, LBC Radio appeared to have reached breaking point with Hopkins, announcing via Twitter that she would no longer be hosting her two hour slot, “effective immediately”. LBC and Katie Hopkins have agreed that Katie will leave LBC effective immediately.  —   LBC (@LBC) May 26, 2017,  The station refused to either confirm or deny that Hopkins had been sacked. A spokesman probed for further details responded: “That’s all we’re saying. ” The BBC’s Amol Rajan has reported that there were “massive cheers and applause” from the station’s newsroom when her departure was announced.'"}, "time": 1742563537.1353192}