{"duration": 0.04101419448852539, "input_args": {"text": "'cis , military , belarus , kazakhstan , RBTH Daily About 100 aircraft and more than 9,000 troops took part in the drills. Source: Marina Lystseva/TASS \\nThe annual battle readiness test of the command bodies and alert forces of the Commonwealth of Independent States (CIS) Joint Air Defense System was successfully completed on Oct. 26, the Russian Defense Ministry\\'s department of information and mass communications has said in a statement . \\nThe exercise involved seven of the 11 CIS countries – Armenia, Belarus, Kazakhstan, Kyrgyzstan, Russia, Tajikistan and Uzbekistan. About 100 aircraft and more than 9,000 troops took part in the drills. \\n\"During the training, the battle readiness of the CIS alert forces and air defense assets was tested with flights of training targets, including supersonic and stratospheric,\" the department said. \\nVideo by YouTube \\nThe Russian Air and Space Forces\\' A-50 airborne warning and control systems (AWACS) were used to increase radar detection range in the Eastern European and Central Asian regions during the drills. \\nThe exercise involved MiG-29, MiG-31 and Su-27 fighters, Su-24 and Su-34 tactical bombers, Su-25 attack bombers and Mi-8 and Ka-27 helicopters. The Russian Airspace Forces\\' Tu-160 and Tu-95MS strategic missile-carrying bombers and Tu-22M3 long-range bombers posed as imaginary enemy targets. \\nThe exercise was led by the head of the Russian air force, Colonel-General Viktor Bondarev. Exercise against hijacking \\nThe exercise was pre-planned and had nothing to do with the current military-political situation, said Lieutenant-General Aitech Bizhev, former Deputy Commander of the Air Force for the CIS. Controlling the airwaves: Russia\\'s electronic warfare systems \\nUsually, the CIS air-defense forces practice executing scenarios involving the use of patrol forces against aircraft that violate the CIS borders, as well as in the case of hijacking of aircraft, in helping the crews of aircraft and helicopters in distress, said Bizhev. \\n\"In the summer, these exercises develop into tactical live-fire exercises on the Ashuluk firing range in the Astrakhan Region,\" he added. \"This is the so-called practical stage of the international exercises of the CIS Joint Air Defense System, \\'Combat Commonwealth\\'.\" Soviet reunion \\nThe recent exercise primarily involved command bodies from the Central Command Post to command posts of anti-aircraft missile battalions and individual radar companies\\' control points. \\n\"By and large, such exercises involve all the air defense troops of the former Soviet Union, of course, severely truncated compared with the 1980s,\" said Bizhev. \\nThe most important element of the exercise was the practicing of interoperability when aircraft cross the state borders of the CIS Joint Air Defense System members, as well as the movement of forces and equipment to the forward-based airfields, explained Colonel Sergei Volkov, former chairman of the Russian Air Defense Forces\\' Scientific and Technical Committee. Who are the members of the CIS Joint Air Defense System? \\nThe CIS Joint Air Defense System was established based on an agreement between 10 member countries, signed on Feb. 10, 1995 in Alma-Ata. Initially it included Armenia, Belarus, Kazakhstan, Kyrgyzstan, Russia, Tajikistan, Turkmenistan, Ukraine and Uzbekistan. Azerbaijan, Georgia and Moldova later left the organization. \\nThe S-300PM hit the target, an imitation of a tactical rocket warhead, by the first rocket. Air Defence forces of seven states of the CIS hold military exercises code-named \"Military community -2000\" at the Ashuluk Air Force test range / Source: Vladimir Tyukaev/TASS \\nIn 1997, Turkmenistan effectively withdrew from the CIS Joint Air Defense System, while Uzbekistan cooperates with Russia exclusively on a bilateral basis. All relations in the sphere of defense with Ukraine were terminated after February 2014 over Russia’s seizure of Crimea and support for rebels in the Donbass region. \\nAccording to Volkov, the joint air defense system helps create a more cost-effective duty roster and military personnel training. In addition, according to him, the use of neighboring countries\\' airfields can dramatically increase the range of fighter aircraft.'"}, "time": 1742628571.632403}