{"duration": 0.09484982490539551, "input_args": {"text": "'FBI files detailing speeches delivered by heavyweight champion Muhammad Ali in American mosques in the 1960s show a different, more racist and radical face of the famed sportsman. The speeches feature Ali calling whites “crackers” and “white devils,” and telling black congregants that blacks want to be segregated from whites. [The speeches, which were released after a Freedom of Information Act request by Washington watchdog group Judicial Watch, revealed that Ali had far more radical views about race than his more benign public persona might have led people to believe.  Not only did Ali thunder that the 1964 civil rights act was a “swindle” on blacks, he also went on to excoriate whites, calling them “  devil white people,” and insisting that “the   Negro is the original man and is superior to the white devil. ” The FBI files show that Ali told a crowd at a Washington D. C. mosque that he preferred “dying outright” or going to jail than going into the U. S. Army. In another speech delivered at a Cleveland mosque, Ali said the American flag “represented death and destruction,” but the   “Muslim flag” represents “life and prosperity, justice for all black men. ” According to the FBI reports, the groups Ali spoke to were congregations of the Nation of Islam, an extremist hate group the FBI defined as an “    organization which espouses a line of violent hatred of the white race, Government, law and law enforcement. ” The Nation of Islam is highly   and teaches its followers that whites will all be killed in a coming “War of Armageddon. ” The   heavyweight champion, who passed away in June of 2016 after a lengthy battle with Parkinson’s syndrome, is today portrayed as a courageous crusader for equal rights as well as one of America’s most celebrated sportsmen. But, his   speeches reveal a figure steeped in hate and racist proclamations. Ali’s family recently started a new civil rights campaign to fight   sentiment and have used their famed father’s legacy as a basis to push their effort. Their “Step into the Ring” campaign began after Ali’s son, Muhammad Ali, Jr. was briefly detained at a Florida airport. The boxer’s namesake son said he was racially and religiously profiled by airport authorities. But, the files now reluctantly released by the FBI paint a far more radical Muhammad Ali than his publicly accepted reputation. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562854.8130207}