{"duration": 0.054128408432006836, "input_args": {"text": "'Last week, members of the group Veterans Assisting Veterans (VAV) penned an open letter to “all Americans” criticizing Sen. Elizabeth Warren ( ) and many of her fellow Democrats for their support of illegal immigrants and calling for these politicians to put United States veterans first. [“Senator Warren and others like her should know the difference between legal and illegal activity and chose instead to act out negatively in selfish political theater,” the letter reads. It asks, “Where’s your rally for US Veterans, Senator Warren?” The group wrote they are “deeply troubled by the continued lack of prioritization by some prominent elected members of our government. ”  John MacDonald, a board member and VAV spokesman, signed the letter. He and fellow VAV member Dennis Moschella appeared on “Fox  Friends Weekend” Sunday and were invited back on again Monday morning. During Sunday’s interview, MacDonald reminded Warren, “Illegal immigrants didn’t vote for her. ” According to the Boston Herald, the group has funded the purchase of   wheelchairs for local veterans and horse therapy at Ironstone Farm in Andover, Massachusetts. “A message we have for every politician in this country: There are between 15 and 20 million veterans,” MacDonald said in Monday’s interview. “If we get all our veterans together, people that are serving currently in the armed forces, and call our representatives, we have an unbelievable voting bloc. ” The letter also criticizes Sen. Ed Markey ( ) Reps. Michael Capuano ( ) and Seth Moulton ( ) and Boston’s Democrat Mayor Martin Walsh for not doing enough for veterans issues. Moulton served in the Iraq War. The sole Republican mentioned in the letter is Sen. John McCain ( ). “Even Republican Senator and US Veteran John McCain has seemed to forget about his fellow veterans and the deep troubles at the VA  …     and its extremely sad,” the letter notes. Last December, Breitbart News reported that some employees at the hospice unit of the Veterans Affairs medical center (VAMC) in Bay Pines, Florida, left the body of a deceased veteran in a shower room for over nine hours. In 2015, a damning report published by the Inspector General for Veterans Affairs revealed that a number of former combatants’   documents at the Los Angeles VA Regional Office (VARO) were placed in employee shred boxes without being processed. All but one of the documents labeled for shredding had the potential to affect veterans’ benefits. According to the Boston Herald, Warren spokeswoman Lacey Rose said the   of veterans is of “utmost importance” to the senator. “She also knows that standing up for our veterans and rejecting President Trump’s unlawful, immoral, and irresponsible attacks on immigrants are not mutually exclusive issues. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742561819.769596}