{"duration": 0.09579896926879883, "input_args": {"text": "'Via AP : \\nDonald Trump was elected America’s 45th president Tuesday, an astonishing victory for a celebrity businessman and political novice who capitalized on voters’ economic anxieties, took advantage of racial tensions and overcame a string of sexual assault allegations on his way to the White House.\\nHis triumph over Hillary Clinton will end eight years of Democratic dominance of the White House and threatens to undo major achievements of President Barack Obama. He’s pledged to act quickly to repeal Obama’s landmark health care law, revoke the nuclear agreement with Iran and rewrite important trade deals with other countries, particularly Mexico and Canada.\\nThe Republican blasted through Democrats’ longstanding firewall, carrying Pennsylvania and Wisconsin, states that hadn’t voted for a GOP presidential candidate since the 1980s. He needed to win nearly all of the competitive battleground states, and he did just that, claiming Florida, Ohio, North Carolina and others.\\nGlobal stock markets and U.S. stock futures plunged deeply, reflecting investor alarm over what a Trump presidency might mean for the economy and trade.\\nA New York real estate developer who lives in a sparking Manhattan high-rise, Trump forged a striking connection with white, working class Americans who feel left behind in a changing economy and diversifying country. He cast immigration, both from Latin America and the Middle East, as the root of the problems plaguing many Americans and taped into fears of terrorism emanating at home and abroad.\\nTrump will take office with Congress expected to be fully under Republican control. GOP Senate candidates fended off Democratic challengers in key states and appeared poised to maintain the majority. Republicans also maintained their grip on the House.\\nSenate control means Trump will have great leeway in appointing Supreme Court justices, which could mean a major change to the right that would last for decades.\\nTrump upended years of political convention on his way to the White House, leveling harshly personal insults on his rivals, deeming Mexican immigrants rapists and murderers, and vowing to temporarily suspend Muslim immigration to the U.S. He never released his tax returns, breaking with decades of campaign tradition, and eschewed the kind of robust data and field efforts that helped Obama win two terms in the White House, relying instead on his large, free-wheeling rallies to energize supporters. His campaign was frequently in chaos, and he cycled through three campaign managers this year.\\nHis final campaign manager, Kellyanne Conway, touted the team’s accomplishments as the final results rolled in, writing on Twitter that “rally crowds matter” and “we expanded the map.”\\nThe mood at Clinton’s party grew bleak as the night wore out, with some supporters leaving, others crying and hugging each other. Top campaign aides stopped returning calls and texts, as Clinton and her family hunkered down in a luxury hotel watching the returns.\\nAt 2 a.m., Clinton campaign chairman John Podesta told the crowd to head home for the night. “We’re still counting votes and every vote should count,” he said.\\nTrump will inherit an anxious nation, deeply divided by economic and educational opportunities, race and culture.\\nExit polls underscored the fractures: Women nationwide supported Clinton by a double-digit margin, while men were significantly more likely to back Trump. More than half of white voters backed the Republican, while nearly 9 in 10 blacks and two-thirds of Hispanics voted for the Democrat.\\nDoug Ratliff, a 67-year-old businessman from Richlands, Virginia, said Trump’s election would be one of the happiest days of his life.\\n“This county has had no hope,” said Ratliff, who owns strip malls in the area badly beaten by the collapse of the coal industry. “You have no idea what it would mean for the people if Trump won. They’ll have hope again. Things will change. I know he’s not going to be perfect. But he’s got a heart. And he gives people hope.”\\nTrump has pledged to usher in a series of sweeping changes to U.S. domestic and foreign policy: repealing Obama’s signature health care law, though he has been vague on what he could replace it with; building a wall along the U.S.-Mexico border; and suspending immigration from country’s with terrorism ties. He’s also praised Russian President Vladimir Putin and spoken of building a better relationship with Moscow, worrying some in his own party who fear he’ll go easy on Putin’s provocations.\\nThe Republican Party’s tortured relationship with its nominee was evident right up to the end. Former President George W. Bush and wife Laura Bush declined to back Trump, instead selecting “none of the above” when they voted for president, according to spokesman Freddy Ford.\\nHouse Speaker Paul Ryan, a reluctant Trump supporter, called the businessman earlier in the evening to congratulate him, according to a Ryan spokeswoman.\\nRead the entire story \\n'"}, "time": 1742563319.8995717}