{"duration": 0.1390693187713623, "input_args": {"text": "'GLENDALE, Ariz.  —   The N. C. A. A. on Tuesday “reluctantly” lifted its ban on holding championship events in North Carolina, removing its    prohibition less than a week after the state’s Legislature and governor repealed a   bathroom bill that had led to boycotts of the state. The organization, which governs college athletics, said in a statement that the law’s replacement in North Carolina had “minimally achieved a situation where we believe N. C. A. A. championships may be conducted in a nondiscriminatory environment. ” The earlier law, known as House Bill 2, or H. B. 2, had removed   protections for lesbian, gay, bisexual and transgender people, and it required transgender people to use bathrooms in public facilities that aligned with their sex at birth. While the replacement bill bars local governments from passing their own ordinances on the topic until 2020, it left regulation of bathrooms up to the State Legislature. The N. C. A. A.’s carefully worded statement left the door open to its continuing to make decisions on a    basis and even to retracting hosting opportunities on short notice in light of new developments  —   as it did last year, when it moved several championship events, including men’s basketball tournament games, out of the state. The N. C. A. A. noted that it requires prospective hosts to submit “additional documentation”  —   it includes a questionnaire  —   about their ability to protect visitors from discrimination. At the same time, by providing a clearer blueprint of what is not and, now, is acceptable, the N. C. A. A. gave comfort not only to North Carolina lawmakers but to those in other states considering restrictions similar to those in North Carolina’s new law. In Texas, where next year’s Final Four is set to be held (in San Antonio) the author of such a proposal, known as Senate Bill 6, or the Texas Privacy Act, cheered the N. C. A. A.’s decision on Tuesday. “I applaud the N. C. A. A. for now agreeing that there is nothing discriminatory about the Texas Privacy Act,” its author, Lois Kolkhorst, a Republican state senator, said in a statement, “or our honest efforts to address the serious issue of privacy and safety in our public facilities and school showers, locker rooms and restrooms. ” While advocates on both sides of the debate have tended to describe North Carolina’s compromise as insufficient, the state’s business community, which opposed H. B. 2 on pragmatic grounds, saw the N. C. A. A.’s decision as a   vindication. “We’re grateful to see that the N. C. A. A. has renewed its faith in North Carolina and the Charlotte region once again,” Tom Murray, chief executive of the Charlotte Regional Visitors Authority, said. “The events that the N. C. A. A. touches are far more important to our region than just the significant economic impact they inject into our community. We’re energized that we’ll be able to both partner with the N. C. A. A. and compete to host these events in the coming years. ” J. Michael Bitzer, a political scientist at Catawba College in Salisbury, N. C. said that as a practical matter, “the reluctant hesitancy but acknowledgment of North Carolina having these opportunities from the N. C. A. A. will hopefully start to smooth the waters in this state” and will, to outside businesses, act as a “signal to start putting North Carolina back on their plate of opportunities. ” Bitzer added that this was so even though the policy landscape in North Carolina remained ambiguous: The new law, he said, “certainly took H. B. 2 off the books, but it didn’t necessarily take off the policies, considering that the state still controls nondiscrimination policy. ” (Republicans enjoy   supermajorities in the Legislature, he noted.) The two sides that struck the deal last week were motivated in no small part by a desire to placate the N. C. A. A. in a state where college sports are culturally vital (and where the flagship university’s men’s basketball team won its sixth national championship on Monday night). North Carolina Coach Roy Williams and Duke Coach Mike Krzyzewski had publicly criticized H. B. 2. Both sides welcomed the N. C. A. A.’s decision on Tuesday. “We are pleased with the N. C. A. A.’s decision and acknowledgment that our compromise legislation ‘restores the state to   …     a landscape similar to other jurisdictions presently hosting N. C. A. A. championships,’ ” the State Senate leader, Phil Berger, and the House Speaker, Tim Moore, both Republicans, said in a statement. Gov. Roy Cooper, a Democrat, said in his own statement that while “more work remains to be done,” the N. C. A. A.’s decision was “good news. ” Critics of the state’s new law condemned the N. C. A. A. “The N. C. A. A.’s decision to backtrack on their vow to protect L. G. B. T. Q. players, employees and fans is deeply disappointing and puts people at risk,” Chad Griffin, the president of the Human Rights Campaign, said. “After drawing a line in the sand and calling for repeal of H. B. 2, the N. C. A. A. simply let North Carolina lawmakers off the hook. ” Athlete Ally also released a statement criticizing the N. C. A. A. Hudson Taylor, the organization’s founder and executive director, had said that the N. C. A. A.’s rescinding of its ban would set “a challenging precedent. ” “If the N. C. A. A. is willing to go back to North Carolina when there is still an overt lack of L. G. B. T. protections and respect under the law,” he said in an interview on Monday, “then other states looking to pass  . G. B. T. legislation know they will still be rewarded with N. C. A. A. events and can go forward with that legislation. ” Advocates on the right also continued to train a cautious eye on the N. C. A. A. “H. B. 2 was never as controversial as the media and liberal activists wanted us to believe,” said Francis De Luca, president of Civitas, which calls itself North Carolina’s Conservative Voice. He added, “We will be watching to see if the N. C. A. A.’s action matches their rhetoric. ” The N. C. A. A. is expected to begin announcing championship events through 2022 this month. Last week, the Atlantic Coast Conference, which is headquartered in the state and had joined the N. C. A. A. in moving its   championships out of the state after the passage of H. B. 2 last year, announced that it was again open to staging such events, like its football title game, in the state. The N. B. A. which moved its   Game in February from Charlotte in response to the old law, is expected to address the issue at its owners’ meeting this week. The N. C. A. A.’s boycott of North Carolina for championship events had intense reverberations in the state. The Duke and North Carolina men’s basketball teams had to begin play in the N. C. A. A. tournament in Greenville, S. C. rather than in Greensboro, N. C. closer to campus. An Associated Press study found that House Bill 2 could have cost the state nearly $4 billion over 12 years because of canceled events.'"}, "time": 1742561809.4327116}