{"duration": 0.09580659866333008, "input_args": {"text": "'Posted on February 9, 2015 by DCG | 20 Comments \\nNew Zealand Herald : A $200,000 public sculpture being installed in Auckland is causing a stir with locals, who say it resembles a penis. The Auckland Council-commissioned Transit Cloud has been created as part of a project to breathe new life into traditionally working class New Lynn. \\nThe aerial component – four aluminium mesh cloud forms – hangs more than 8m over a lane linking New Lynn’s shiny new railway and bus station with the town’s library and shopping mall. \\nThe clouds allude to the sky, but two of the forms are being viewed very differently by locals. “Oh my God, it’s a cock and balls,” said Phil Wellman, of Blockhouse Bay. \\n“Don’t you think it’s rude?” said Henderson mother Janine Waters, walking her two young children in a pram. “It’s definitely that. What else could it be,” she said. Another woman, who did not want to be named, called the forms “masculine”. \\nFrances Toohey, who works at Pita Pit by the lane, said the sculpture was very phallic. Customers had been commenting a lot, she said. “What the hell is that? It’s certainly not a cloud. It looks like a penis,” said Joy Dale, of Mt Roskill. She said the sculpture was a waste of ratepayers’ money and the council would be better spending the money on more security and patrols in the area. \\nSculptor Gregor Kregar, who with his artist wife Sara Hughes and architect Davor Popadich created the work, said there was never any intention of creating a large phallic image in the sky . \\nTransit Cloud, he said, was connected to 30,000 tinted ceramic dots in the laneway floor, acknowledging the local portage history and modern transport focus of the precinct. The forms above resembled clouds and liquid matter, like raindrops. \\n“Art is out there to stir reaction,” said Kregar. He was confident people would embrace the work after 50m of neon lights are connected in each form. The sculptor gave the Herald images of the clouds lit up in his New Lynn studio to show how the finished work would look at night. \\nMr. Popadich was surprised by the public response to the sculpture, saying it had a joyful and fun aspect . Council arts and culture manager Kaye Glamuzina said art was always controversial and interpretation subjective. \\nFrom Kregar’s website : \\n“ I utilize familiar subject matter such as human figure, body parts , television sets, bottles, inorganic rubbish and animals. I am interested in how the familiar subject can be represented in a way that displaces the original meaning and imbues the subject with new and unfamiliar meanings. My work deals with issues of ambiguity and the uncanny yet it is strongly connected to the social, economical and political environment I live in.” \\nLet’s take a look at some of his other work, shall we? \\nThis exhibition brings together what appear to be two very different groups of work; Gnomes and Geometric constructions. They do not appear, at first glance, to have any relationship to one another, yet conceptually and historically their paths cross at many points. The gnomes are caught in an existence between the happy and helpful gnome and the frozen mystical being. Practising this alchemy of the everyday, the gnomes are turned from the familiar into sublime, the trivial into a precious and valuable, achieving the noble levels of human perception, emotion and appreciation of the world . Wall “art” next to oversized gnomes. \\nSculptor Gregor Kregar is known for his works that challenge the traditional meaning of his subjects . Often representing works in a way that displaces traditional interpretations, Kregar imbues his subjects in new and unfamiliar environments or surroundings. In Reflective Synthesis two oversized gnomes dominate the gallery space in Kregar’s exploration of the trivial everyday aesthetic of his subject, in relation to its mystical and scientific history. \\nHope the taxpayers are happy with this most recent purchase! \\nDCG'"}, "time": 1742563320.4914396}