{"duration": 0.09297823905944824, "input_args": {"text": "'This article is dedicated to one of our readers, AArizonian…keep your powder dry, Brother! – JJ \\nReadyNutrition Readers, the title to this piece answers a question posed by the individual that you prevented from reaching the White House, none other than Hillary Rodham Clinton. When asked by Congress whether or not it was actually an anti-Islamic film that prompted the destruction of the American Embassy in Libya, she responded with “What difference does it make?”\\nIt made all the difference in the world. Her “indifferent” masquerade was a façade to cover her wrongdoing: the allowed destruction of an American embassy, and the death of the American Ambassador to Libya and three of his staff. Undoubtedly many of you who took to the polls remembered these events. It made a difference to you, and guess what?\\nThen you made all of the difference. I stress (as I did with a piece I recently wrote for SHTFplan.com) that the battle was won: Hillary Clinton was prevented from taking the presidency. The war is far from over to restoring our nation to a Constitutional Republic where the governors derive their just powers from the consent of the governed…that’s you and I…and making things completely right. Nevertheless, we took the first step the other night.\\nYou made all of the difference. You, stalwart patriots and preppers from all walks of life. Think of the greatness of the moment, and the moment is yours. You earned it and you’re still here, still strong, with more hope than you had the day before. Continue the fight and the work. Obama has more than enough time to bring the country down through any sort of false flag or a war (provoked from our direction). For this reason, you must continue to study, to keep informed, to keep preparing for times of trouble.\\nEven after the Revolutionary War, the country (and our countrymen) did not relax. That musket with the powder and lead balls was required to be in every home, that “Brown Bess” hanging over the fireplace. At any given moment we may be called upon to take the same stand that they took. We are called upon to maintain the posture they held with vigilance: to be ready at all times, to defend the home and our country.\\nYou voted and did that the other night…took the stand against the tyranny that almost overtook us. Keep in mind how close it came. Clinton won the popular vote and the electoral vote was far from a landslide. We still face another almost three months with Obama in office. So what’s the point of this piece? The point is to recognize you, our readers, and to tell you that you made a difference last night…just as you make a difference here, to us at ReadyNutrition.\\nAt any time can come an EMP (Electromagnetic Pulse) attack, from a foreign country either provoked or allowed…or one carried out by Obama prior to his exit from office. At any time can come a natural disaster or a war. Do not be lulled into a false sense of security. Stay vigilant as our forefathers did. We are on the tail end of 8 years of absolute agony, of destruction to our country. Strong as it was, 8 years was not enough to take it down.\\nI receive letters from many of you from all across the country. People from near where I live, now, in Montana. People from Ohio in the Mahoning Valley, from the Great Plains of Nebraska, from the Yukon in Alaska, and the Florida Panhandle. I receive letters from Seattle, from Dallas, from New York City, and from Baltimore, where I was born and still call home.\\nAll of these letters have one thing in common: they were written by men and women such as yourselves…men and women “who will not go gently into that good night…who will not give up without a fight.” More than just preppers: survivors, patriots, and Americans. The point to this letter is to salute all of you, our readers, and thank you for being part of the ReadyNutrition family. Thank you for your diligence and efforts as you plan, prepare, and pray. Especially that last part of it.\\nBecause we have to hold the mindset of our forefathers and take an active part to preserve ourselves, our families, and our nation. I salute you, my fellow countrymen! I thank you for your letters and readership, and I thank you for voting…casting a vote to give us…our country…another chance. Stay vigilant and determined, and take care of one another. These poor words of encouragement, I pray, will be with you that you may know how important you are to Miss Tess and I and all of us here at ReadyNutrition.\\nFor [to paraphrase Frost]: Two paths diverged upon a great nation…between tyranny and freedom…and you, the nation took the path of freedom….and that made all the difference.\\nBecause you are the difference, and I thank you. May God bless you and your families in all that you do.\\nSincerely,\\nJJ \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 9th, 2016 How To Survive Occupied America How Martial Law Will Lead to the Creation of the… Have a Very Merry Revolutionary War-Remembering Christmas! Emergency Survival Food Sales Soar as We Get Closer to… Why Some People Will Always Bow to Tyrants '"}, "time": 1742628307.8214402}