{"duration": 0.1365489959716797, "input_args": {"text": "'WASHINGTON  —   Some of   Donald J. Trump’s most prominent cabinet nominees  —   with their millions in assets and complex business arrangements  —   are moving unusually slowly through the government’s arduous financial disclosure examinations, threatening the quick start promised for the new administration and raising Democratic concerns that their confirmations could   customary ethical safeguards. On Thursday, the ranking Democrats on all 16 Senate committees released a joint statement saying they would block confirmation votes until each nominee of Mr. Trump had cleared an F. B. I. background check, completed a financial disclosure statement and ethics agreement approved by the federal Office of Government Ethics, and “satisfied reasonable requests for additional information. ” Senator Bob Corker of Tennessee, chairman of the Foreign Relations Committee, and Senator Ben Cardin of Maryland, that panel’s ranking Democrat, engaged in a public spat over Mr. Cardin’s request for three years of tax returns from Exxon Mobil’s chief executive, Rex Tillerson, who has been picked to be the next secretary of state. “As is   precedent for nominees considered by the Senate Foreign Relations Committee, the committee has not asked Mr. Tillerson to provide copies of his tax returns,” Mr. Corker said. And Senator Tom Carper of Delaware, the top Democrat on the Homeland Security and Governmental Affairs Committee, sent letters to the top ethics officials at 17 government agencies, asking if they had been in touch with officials of the Trump transition, whether they had received financial disclosure statements, and whether any Trump pick “refused to provide any information that you believe is necessary to conduct a conflicts analysis as required by law. ” “Given the large and complex financial holdings and boundless, serious potential for conflicts of interest,” Senator Chuck Schumer, Democrat of New York, said in an email, “these nominees need to turn over all relevant financial and background information so that senators can thoroughly review their record before going forward with any hearings. ” Several of Mr. Trump’s cabinet picks would be among the wealthiest public servants in modern history. That alone presents a significant   challenge to Senate Republicans, who hope to begin confirmation hearings in a few weeks. Mr. Trump’s selection process  —   begun, unlike that of most predecessors, after his election rather than before  —   may have added to the challenge of moving quickly now. “They need to step on the gas and get it done,” said Richard Painter, a law professor at the University of Minnesota who served as chief ethics counsel to President George W. Bush. “They need to tell the Senate what they are going to do with their assets. ” Cabinet nominees undergo rigorous background checks by the F. B. I. and the Office of Government Ethics, as well as a complicated process involving the agencies they are nominated to run. This is to ensure that nominees have no financial conflicts of interest or outstanding tax matters that could later expose them to criminal prosecution. For nominees with extensive financial holdings, preparation for confirmation hearings can take weeks or even months, as was the case with Penny Pritzker, a billionaire who is President Obama’s commerce secretary. Previous new administrations have taken longer to name cabinet picks than Mr. Trump has done, in part because they were doing their own vetting that the Trump transition has largely forgone. Three people who have discussed Mr. Trump’s nominees with officials involved in the screening, who spoke on the condition of anonymity to discuss the private deliberations of a highly secretive government agency, were told of the slow pace, which has alarmed Senate Democrats. Mr. McConnell has said he hopes to move ahead on several of Mr. Trump’s nominees “on Day 1. ” Emails to Mr. Trump’s transition team were not returned. Many of Mr. Trump’s nominees come with a complex web of financial interests and investments. They include Mr. Tillerson Steven Mnuchin, a former Goldman Sachs partner picked to head the Treasury the billionaire investor Wilbur L. Ross Jr. chosen as commerce secretary and Betsy DeVos, the  ’s choice to run the Department of Education. Lawmakers have already raised questions about Mr. Tillerson’s seeming reluctance to turn over his personal financial information. The Senate Foreign Relations Committee has tentatively set Jan. 11 for the start of Mr. Tillerson’s confirmation hearing. In keeping with longstanding committee precedent, it has not asked Mr. Tillerson to provide his tax returns, Senator Corker said. “By all accounts, Mr. Tillerson is currently ahead of schedule in providing information to the committee,” he added. “He already has submitted a completed nominee questionnaire and will soon submit an extensive financial disclosure. ” But Mr. Cardin voiced the fears of some Democrats that Mr. Tillerson and other nominees  —   and Republican committee chairmen  —   may take their cues from Mr. Trump’s unusual decision not to release his own tax returns. “I think it is an important part of vetting this candidate because he has never made public disclosures of this type, as he has worked at Exxon Mobil for his entire career and has never been in public service,” Mr. Cardin wrote on Thursday in a letter to committee Democrats. “Mr. Tillerson was actively engaged with many foreign governments that could become relevant if confirmed as secretary of state. The Senate has a responsibility to review all relevant documents during the confirmation process. ” Republicans say the concern is misplaced. Senator Orrin G. Hatch, Republican of Utah, the chairman of the Senate Finance Committee, which will hold the hearing for Mr. Mnuchin, has previously said that Mr. Trump’s nominees “will undergo the same bipartisan vetting process as the nominees from previous administrations. ” This includes scrutiny by the Office of Government Ethics, and his committee’s requirement for three years of a nominee’s most recent federal tax returns. A spokeswoman for Mr. Hatch said on Wednesday that the committee would not schedule a hearing before completion of the bipartisan vetting process. Selections made during a transition are more complicated than those of a sitting president because a nomination cannot be officially made until the new president is sworn in. Candidates typically start to put together their prospective cabinet during the campaign the former governor of Massachusetts, Mitt Romney, conducted an extensive vetting process during his failed 2012 White House run. When an incoming president has chosen a nominee, the transition office works immediately to get forms in order for the ethics office and the F. B. I. The F. B. I. does its own significant vetting, which has been the downfall of some nominees, frequently over tax issues or payments to domestic workers. Often this review is done long before the nomination arrives on Capitol Hill. Federal ethics law requires that financial disclosure forms be submitted no later than five days after a formal nomination, or before a nominee’s hearing, whichever is earlier. Generally, if nominees have any financial entanglements that could create real or potential conflicts of interest, they work with an ethics compliance employee to come up with a plan to address those conflicts. In many cases, though not all, a nominee resolves conflicts through divestiture, the use of a blind trust or a formal recusal from certain matters. This practice protects the public interest, but also the nominee. Cabinet members later found to be acting in their own financial interest in their official capacity can be prosecuted. “If you have substantial assets, they want some sort of assets agreement,” Mr. Painter said. “That can take a few weeks, especially with billionaires. ” Democrats insist the process cannot be disregarded. “When you occupy this country’s highest positions of power, you manage trillions of dollars, enforce more than two centuries of law, control the world’s most powerful military and make decisions that are literally matters of life and death,” said Senator Ron Wyden of Oregon, the ranking Democrat on the Finance Committee. “That’s why nominees need a thorough vetting process, not a rubber stamp. ”'"}, "time": 1742562188.955413}