{"duration": 0.07888126373291016, "input_args": {"text": "\"  Secret Service Rushes Donald Trump Offstage In Nevada As Paid Hillary Supporter With Gun Attacks 'Nobody said it was going to be easy for us,' Trump declared. 'But we will never be stopped. Never, never be stopped.''I want to thank the Secret Service. These guys are fantastic. They don't get enough credit. They don't get enough credit. They're amazing people.'   5, 2016 Secret Service agents rushed Donald trump offstage on Saturday evening during a rally in Reno, Nevada after they determined a protester in the audience with a gun posed a threat to the Republican presidential candidate. ‘Go! Go!’ they shouted as they whisked him away and a combination of local police and private security wrestled the suspect to the ground. Thousands of people scattered like a sea of bodies, screams rang out and authorities dragged the man away as he kicked and strained. Trump returned to the stage just five minutes later. ‘Nobody said it was going to be easy for us,’ Trump declared. ‘But we will never be stopped. Never, never be stopped.’ ‘I want to thank the Secret Service. These guys are fantastic. They don’t get enough credit. They don’t get enough credit. They’re amazing people.’ Secret Service Swarms in to Protect Donald Trump After Scare in Reno Trump had spotted the protester and claimed he was a Hillary Clinton supporter before asking security to ‘take him out.’ As he returned to his speech, Trump thanked a group of fans near the stage who had stepped in to subdue his would-be attacker. ‘You were amazing, fellas,’ he said. ‘I saw what you were doing. That’s a tough group of people right that… Nobody messes with our people, right?’ Trump then returned to his regular speech. JUST NOW: Donald Trump was just rushed off stage during his Nevada campaign rally: https://t.co/7fTJ3N3MQN pic.twitter.com/Hm7CRdFDTU \\n— CBS News (@CBSNews) November 6, 2016 Federal agents and tactical officers from Reno Police removed the man and placed him in a bathroom near a secure entrance where Trump’s motorcade and the press vehicles were staged. Two audience members told DailyMail.com that they had seen the man holding a firearm. That has not been confirmed by law enforcement. As police and good Samaritans took him down, the crowd surged backward and strained against the press section. ‘CNN sucks!’ one man yelled. ‘You people caused this!’ Audience members at the front of the crowd reportedly said they saw the man raise up a sign before a scuffle ensued. Saturday’s incident marked the second time Secret Service had to intervene to get Trump out of harm’s way. In March a man leaped over a police barricade during a Trump rally at an airport hangar in Dayton, Ohio. The man,Thomas Dimassimo, was charged with disorderly conduct and inciting panic, but he never reached the stage. Secret Service tackled him when he was still several yards away from the candidate. ‘I was ready for him, but it’s much easier if the cops do it, don’t we agree?’ Trump said at the time. ‘And to think I had such an easy life! What do I need this for, right?’ At this time a motive is not clear. source  \""}, "time": 1742562029.5825408}