{"duration": 0.250089168548584, "input_args": {"text": "'B y Danny Haiphong Originally posted on 06/07/2016 L iberalism is “an ideology rooted in a nation founded upon imperial conquest and rabid capitalist exploitation.” Its main proponent in is the Democratic Party, which “has become the engine of US imperial rule.” Hillary Clinton is a twin of Barack Obama. “While Obama intensified imperial war, austerity, and domestic repression, liberal supporters sat on the sidelines and watched.” Liberals wage fake wars on Republicans and real wars on the world. It’s no wonder that the complacent liberals and liberal media, despite the pious posturing, did not stop any of the big postwar crimes of subversion and intervention, such as Korea, Vietnam, Iran, Chile, Guatemala and many others. “An American liberal is the arbiter of a more effective politics of exploitation and oppression.” If anything, the 2016 elections have exposed the steep descent into bankruptcy of liberal politics in the US. The concluding years of the 1970s began a right-wing, authoritarian process in the US that grew from the roots of a capitalist economic base in decline. Historians and left academics framed this process not as a sign of decline but as a right-wing backlash. The term neo-liberalism was created to describe the backlash. However, “neo-liberalism” was less new than it was an exposure of what has always been true about American liberalism. American liberalism has always been an ideology created by and for the interests of the American capitalist empire, regardless of the period. \\nA house of concentrated infamy, for the most part the world’s foremost assembly point for crooks and outright criminals. To be a liberal in America has meant being a participant in the highest form of opportunism. Liberals have historically championed the freedoms of American capitalist society and defended developments like the enslavement of Africans as a necessary evil. Once these evils become unmanageable, liberals jump ship and look to support more palatable forms of exploitation. For example, during the Civil War, many American liberals did not oppose slavery. It wasn’t until the combined force of African rebellion and industrial capitalist development dug the slave-ocracy’s grave that many liberals warmed to the idea of abolition. “It was the bankrupt liberal leadership of the labor movement that collaborated with President Roosevelt to “stabilize” capitalism.” During the Great Depression, US capitalism was on the verge of collapse. A recovery in the system seemed nowhere in sight. Socialists played a key role in organizing unions across industries to strengthen the position of the working class in this time of crisis. It was the bankrupt liberal leadership of the labor movement that collaborated with President Roosevelt to “stabilize” capitalism. This leadership proceeded to settle for legislative gains and purge socialist elements. And so began the labor movement’s descent into the back pockets of the Democratic Party. American liberalism has thus historically been able to fester and thrive in the US political landscape in periods of reforms in the capitalist order. The transition from chattel slavery to industrial capital, and subsequently from industrial capital to the so-called age of social welfare, gave American liberals political space to adjust their bourgeois principles to fit the needs of the time. In the current period of capitalist decline, this is no longer possible. The rule of capital has reached its highest stage and it must eliminate all that stands in its way of unfettered profit accumulation. This period of capitalism has stripped liberalism naked of its supposedly “progressive” veneer. US capitalism has no room for welfare politics. The system’s rate of profit is falling and its corporate debt is mounting. Finance capital has speculated the economic base of US society into a hole it cannot crawl out of. It is under these conditions that liberalism has revealed itself for what it really is: an ideology rooted in a nation founded upon imperial conquest and rabid capitalist exploitation. “Finance capital has speculated the economic base of US society into a hole it cannot crawl out of.” I n the US, the home base for liberal politics resides historically in the Democratic Party. During the height of anti-communist hysteria and Black liberation insurgency in the mid 20th century, the Democratic Party was compelled to promote itself as a force of progress. To this day, the Democratic Party takes credit for Civil Rights reforms and anti-poverty programs that were pressured into existence by grassroots movements. However, the wheels of reform have reversed. No longer able to deceive the masses with crumbs, the Democratic Party has become the engine of US imperial rule. Liberals have been instrumental in this political shift. The Obama era has been the quintessential example of what liberal bankruptcy looks like in the age of neo-liberal, capitalist decline. While Obama intensified imperial war, austerity, and domestic repression, liberal supporters sat on the sidelines and watched. In some cases, liberal forces cheered on Obama’s policies (like the intervention in Libya) and decried Republican “obstructionism” as the primary reason for why social conditions continued to worsen under his rule. Yet these same liberals refused to acknowledge that it was Obama who sidestepped a Democratic Party majority in the House and Senate in 2009 and 2010 to push through the corporate Affordable Care Act and dash any hopes of universal healthcare being instituted in the US in the near future. “While Sanders is no revolutionary force, his brand of liberalism is now outmoded by the world capitalist system that he sought to manage.” The case of Bernie Sanders in particular and the 2016 elections have broadly exposed the Democratic Party and its bourgeois liberal base for the agents of Empire they’ve always been. Hillary Clinton and her supporters have tirelessly attacked Sanders throughout the duration of his campaign. The reason for the attacks is simple. While Sanders is no revolutionary force, his brand of liberalism is now outmoded by the world capitalist system that he seeks to manage. Finance capital cannot back a candidate that calls for universal healthcare, affordable public university, or higher taxation of the rich. These policy proposals run in contradistinction to neo-liberal capital’s need to turn everything into a profitable market to ensure its survival. When one asks what an American liberal is today, it is important to be honest. An American liberal is the arbiter of a more effective politics of exploitation and oppression. The American liberal supports the Democratic Party by waging a fake war with the Republicans while the entire establishment moves ever more rightward. The American liberal is no less an enemy of social progress than the right-wing, Republican oriented populace. The American liberal must be combated or its ideological stranglehold over emergent movements now and in the future will continue to lead them astray. APPENDIX The U.S. liberal – the real greater evil. Liberalism: the hard and soft sides of the coinage of social control Submitted by Orwellian Ghost on Thu, 06/09/2016 E xplaining liberalism to North Americans is a thankless and possibly futile task, but it is one that must be attempted for clarity’s sake. Liberalism is a theory of political economy that arose in Great Britain in the 17th and 18th centuries. Its principal inspirations were Thomas Hobbes (1588-1679) and John Locke (1632-1704). It emphasizes individualism, human avarice, the “virtue” of competition and the “justice” of the marketplace. It opposed feudalism and mercantilism. It sought to replace the traditional landowners with the rising commercial and manufacturing classes. It sought to liberate capital, not people (and especially not women, slaves and propertyless males). Liberalism is the foundational ideology of the United States. American Conservatives (aka Tories or Loyalists) were expelled to Canada, the Caribbean or sent back to England. The USA (a few southerners excepted – until the Civil War) began, and remains a homogenously liberal society. What, exactly, is liberalism? Here’s what classical liberal economist Adam Smith (1723-1790) said: “Whenever there is great property, there is great inequality. For one very rich man, there must be at least five hundred poor, and the affluence of the rich supposes the indigence of the many, who are often driven by want, and prompted by envy, to invade his possessions. … Civil government, so far as it is instituted for the security of property is in reality instituted for the defence of the rich against the poor, or of those who have some property against those who have none at all.” Liberal utilitarian Jeremy Benthan (1748-1832) added this: “In the highest state of social prosperity, the great mass of citizens will have no resource except their daily industry; and consequently will always be near indigence … uman beings are the most powerful instruments of production, and therefore everyone becomes anxious to employ the services of his fellows in multiplying his own comforts. Hence the intense and universal thirst for power; the equally prevalent hatred of subjugation. … When security and conflict are in conflict, it will not do to hesitate a moment. Equality must yield.” This means that, in liberal societies, the rich are pitted against the poor, gaining their wealth by appropriating the work of others; and it means that government is in “business” to protect the ruling class. Today, of course, there are two kinds of liberals. Soft-hearted liberals live mainly in the Democratic party. They sometimes toss crumbs to working and middle class people. In a pinch, they will do bad things reluctantly, but they will do bad things nonetheless, to protect the ruling class. Hard-hearted liberals live mainly in the Republican party. They do bad things gleefully, and never toss crumbs. They try to get racists and religious fundamentalists worked into a frenzy to oppose soft-hearted liberals, to protect the ruling class. They are the good cops and the bad cops, the soft and hard sides of the coinage of social control. \\nSubmitted by Dosamuno on Tue, 06/14/2016 – 12:31 Why hasn’t there been a revolution in the United States? —Because it doesn’t have an American Embassy. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE ABOUT THE AUTHOR Danny Haiphong is an Asian activist and political analyst in the Boston area. He can be reached at wakeupriseup1990@gmail.com . Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda?   REMEMBER: ALL CAPTIONS AND PULL-QUOTES BY THE EDITORS, NOT THE AUTHORS.'"}, "time": 1742561882.2958066}