{"duration": 0.11663055419921875, "input_args": {"text": "'One of the most passionately debated stage works of our time is a    operetta. Is Gilbert and Sullivan’s enduringly popular “The Mikado” a droll satire of Victorian England? A racist caricature of Japan? Some amalgam of the two? Recent revivals have ended up in the cross hairs of these questions, sparking protests across the nation, along with earnest wondering about how  —   and even if  —   this 1885 piece should be staged in the 21st century. When an outcry arose last year over a planned revival of the New York Gilbert and Sullivan Players’ old production  —   which had featured a mostly white cast in yellowface makeup, and employed some ugly stereotypes to evoke the imaginary Japanese town of Titipu  —   the company initially responded by saying that it would scrap the makeup. Then, realizing that the complications were more than skin deep, it decided to scrap the entire staging and take a year to rethink its approach, diversify its cast and create a new show. The result will open on Wednesday at Kaye Playhouse at Hunter College in Manhattan. Finding the right balance is not easy: Some of the most severe critics of “The Mikado” find it too inherently offensive to be performed, while some ardent fans view any changes as bows to excessive political correctness. Shortly after the New York company announced it was replacing last year’s “Mikado” with “The Pirates of Penzance,” David Wannen, its executive director, received a letter from a   pirate who complained that he was offended that the troupe did not plan to cast real pirates. David Auxier, the director of the new “Mikado” production, recalled that “Sometimes the conversation got to be: ‘You’re never going to please everybody, so why try? ’” He added: “I said, ‘We’re starting from the understanding that we’re never going to please everybody. But we’re still going to try. ’” As the use of yellowface  —   which can refer not only to makeup, but to broader attempts at racial impersonation or caricature  —   has drawn protests at “Mikado” revivals from Seattle to New York, companies presenting it have responded with a variety of approaches. A   2013 staging by Skylark Opera and Mu Performing Arts in St. Paul inverted the libretto, setting the piece in England and casting   actors in key roles. This year, the Lamplighters Music Theater in San Francisco decided not to set its new production in Japan after local   performers threatened protests. Instead it moved the action to Renaissance Italy and changed the opening line from “If you want to know who we are, we are gentlemen of Japan” to “If you want to know who we are, we are gentlemen of Milan. ” A production by the   Gilbert and Sullivan Players this fall was set in a 1960s   hotel in Las Vegas to, as the organizers put it, “recontextualize the origins of the show in Japonisme and commodity racism. ” It still drew protests. In New York, emotions have run high on all sides. A Save the Mikado NYC Facebook page sprang up, calling for the operetta “to be performed exactly as conceived by Gilbert and Sullivan, with only a very small number of minor alterations that have been standard for over half a century. ” Another Facebook group, Artists Against The Mikado, was “dedicated to the controversial idea that minstrel shows where white people dress up as fake Japanese is a little out of date. ” The old “Mikado” production had used yellowface, and the troupe had invented a minor role, played by a child, that was credited as a “coolie,” which company officials said they had not realized was a slur. A 2004 version of the staging included “a man with a Fu Manchu mustache and impossibly long fingernails,” Josephine Lee, a professor of English and   Studies at the University of Minnesota, writes in her influential 2010 book, “The Japan of Pure Invention: Gilbert and Sullivan’s ‘The Mikado,’” which traces the work’s long, complex racial history. In an interview, Ms. Lee questioned the commonly heard defense that “The Mikado” should not be considered racist because it is meant in fun. “There are lots of instances in blackface minstrelsy that are lighthearted and funny  —   and also offensive,” she said. Before mounting their new “Mikado,” the New Yorkers sought advice, listened to critics and sent out casting calls that stressed a desire for diversity. At a forum held in November at the Kaye Playhouse, Jonathan Jenkins Ichikawa, a professor of philosophy at the University of British Columbia who has performed in Gilbert and Sullivan works, noted that many of the most offensive elements of recent productions were invented by stage directors. “You don’t need to do a lot of violence to the work to not tape actor’s eyes back to make their eyes look ‘slanty,’” he said, recalling productions he had appeared in that did just that. So the New York company set about trying to strip away those elements. Like Mike Leigh’s 1999 film “” which told the story of Gilbert and Sullivan as they created “The Mikado,” the new production will firmly establish the operetta as a work of the Victorian imagination. A new prologue features the composer and librettist planning their next opera and admiring some Japanese objects. When a sword falls, knocking Gilbert unconscious, he dreams “The Mikado” proper, set in an imaginary Japan as conceived by a   Englishman. The production will emphasize the work’s satire of Victorian mores, and do away with racially charged performance tics and excessive bowing and shuffling in its choreography. While the ensemble would never be mistaken for, say, the multicultural cast of “Hamilton,” it is the troupe’s most diverse yet. Erin Quill, an   actress, wrote about the controversy last year on her lively blog, The Fairy Princess Diaries. Ms. Quill, who spoke at the company’s forum in November, said in an interview that she was “cautiously optimistic” about the new production. “Am I glad this conversation is happening?” she asked. “Absolutely. Do I wish this conversation had been 20 years ago? Of course. ”'"}, "time": 1742562959.5783784}