{"duration": 0.05145692825317383, "input_args": {"text": "'Donald Trump expects to be in a position to offer the United Kingdom a free trade deal within the “first six months or the first year” of his administration, says Anthony Scaramucci, the noted entrepreneur and host of the Wall Street Week programme who will serve as the incoming president’s Director of Public Liaison and Intergovernmental Affairs. [Speaking to ITV News, the SkyBridge Capital founder confirmed that the current plan is to “get in the White House and get the president inaugurated and then take the steps necessary to make sure the UK is at the front of the line, as opposed to at the back the line, on trade deals”.  Scaramucci’s reference to “the back of the line” was a call back to outgoing president Barack Obama threatening that the British would be at the back of the queue for a trade deal if they voted to leave the European Union (EU) which does not allow its members to strike trade deals on their own. Obama’s use of the word “queue” which is uncommon in   raised suspicions that he had been fed lines by the   former prime minister, David Cameron, and Scaramucci’s decision to use the more traditional “line” may have been significant. Scaramucci’s positive comments come shortly after the   himself pledged to get a trade deal “done quickly and done properly” after Brexit in an interview with The Times of London, while congratulation the British public on their decision to leave an EU which is “basically a vehicle for Germany“. “We see the unique, special relationship bond and love that these countries and people have for each other,” Scaramucci told ITN, echoing sentiments expressed by Trump himself. “I’m a big fan of the UK” said the Republican leader, reminiscing about his Scottish mother’s pride in the Queen. Asked how he thought the   would get on with the EU in office, Scaramucci was upbeat. “Way better than the EU thinks. I know him very, very well, and I understand exactly what he’s thinking, and I understand his kindness and his gregarious nature and his charm  —   he really wants to get along with the rest of the world. ” Earlier in the week, however, Scaramucci warned attendees of the ongoing Davos conference in Switzerland that “the European leadership and the European elites   …     had better pay much closer attention to the working class families and the middle class”. He also reiterated the  ’s view that European NATO members must start “paying their bills” and refocus their efforts on “radical Islamic terrorism” rather than the former Soviet Union.'"}, "time": 1742564444.2748358}