{"duration": 0.06784486770629883, "input_args": {"text": "'The godfather of whistleblowers: Remembering Phillip Agee, ex-CIA By Thomas C. Mountain Posted on November 2, 2016 by Thomas C. Mountain \\nBefore Edward Snowden and Julian Assange there lived the godfather of whistleblowers, Phillip Agee, Ex-CIA. Phil named names, exposed CIA agents and brought down whole agency operations back when he published his book “Inside the Company” in 1975. \\nThe difference with back then and today’s whistleblowers is that Phil Agee actually exposed CIA undercover agents, some of whom, being involved in covert wars, were killed as a result, something Snowden and Assange differ with Agee over. \\nFrom a Third World perspective, Phil Agee did us a lot of good by helping us kick the criminals working for the CIA out of our countries. The undercover agents who were killed were not the good guys Hollywood would have you believe. Kidnapping, torture, disappearances and assassinations is what the CIA does, or oversees. \\nIf you are a political activist in the Third World, you want to know your enemy so you can protect yourself from these criminals secretly draped in the red, white and blue of Yanqui Imperialism. \\nHere is Africa we have learned from bitter experience that the CIA’s preferred fronts are aid workers, journalists and clergy. \\nNow if Snowden or Assange would publish the names of the clergy, journalists and aid workers working for the CIA, then maybe we could prevent them from committing their malicious crimes of espionage, you know, save lives and protect our loved ones and fellow countrymen and women. \\nIf people living in the Western countries were shocked by Snowden’s exposé then they were pretty naive. J. Edgar Hoover’s FBI never respected anyone’s privacy, least of all the president of the USA. And if you were deemed a threat, like over 200 Black Panthers and American Indian activists, no compunctions about gunning you down. \\nExposure of US government spying doesn’t really help us here in the Third World because we are being kidnapped, tortured, disappeared and assassinated. Spying on our mobile phones is quite a way down on the list of our worries. \\nHopefully the next generation of whistleblowers will remember Phillip Agee and not just expose crimes but actively prevent any future damage by naming names, exposing agents and destroying operations of the international criminal cartel known as the CIA. \\nThomas C. Mountain is an independent journalist in Eritrea, living and reporting from here since 2006. His speeches, interviews and articles can be seen on Facebook at thomascmountain and he can best be reached at thomascmountain at g mail dot com. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742563615.4275982}