{"duration": 0.07809972763061523, "input_args": {"text": "'The smile that spread across my face a few seconds after the Zaffre Quartet began the rousing finale of Mozart’s String Quartet in G was the first hint that I’d stumbled onto something special. A few minutes later, as I glanced around my living room, my friends’   and   confirmed I wasn’t the only one enjoying the music. I barely listen to classical music, so how did a live string quartet end up in my apartment on a Saturday night? As I scrolled through my Twitter feed last month, a tweet about Groupmuse caught my attention. Groupmuse, which specializes in what it calls “classical music   concerts,” sees itself as offering a fairly straightforward process: Set up an event as a host, hire musicians from its site, invite friends and people who use the Groupmuse site, sit back and relax. (Or you can simply attend an event, rather than hosting.) Each attendee contributes at least $10 to compensate the performers. Millennials are Groupmuse’s largest audience. Concerts are in New York, Boston, San Francisco and Seattle, with some elsewhere, and there are plans for nationwide expansion next year. “All you need is four chairs,” Sam Bodkin, the Groupmuse founder, said in a telephone interview. “So whether you’re under a bridge or on top of a building, we can create the great masterworks in the history of Western culture. That makes it a scalable and flexible experience that communities everywhere can gather over. ” From     jazz clubs to experimental art shows, I regularly graze at the vast array of New York’s cultural buffet. And as a young black woman, I’m no stranger to navigating spaces in which I’m one of just a handful of minorities. But I still sometimes feel uncomfortable in those spaces  —   many of them considered highbrow cultural bubbles, even the ballet, which I love and attend every season. As with the ballet, there’s a perception that classical music isn’t the most welcoming, and certainly not the most diverse in its performers or audience members. Add to that the formal settings in which classical music is often presented, and you have the roots of my lack of interest. But if I didn’t have to leave my couch, did I have a valid excuse not to at least consider it? I made two decisions: to invite other classical music newbies, and not to listen beforehand to any of the music that would be played. The goal was to have my ears be a blank slate, even if my mind had some preconceived notions. Mr. Bodkin, who discovered classical music at 19 in a friend’s basement, offered me a few tips, highlighting the relationship between consonance and dissonance and the importance of focus and encouraging me to relinquish the idea of a linear narrative. “You do need to listen to classical music in a different way,” he said. “It’s not going to be about something specific it’s about an abstract emotional journey. ” Any jitters quickly dissipated as the quartet began the hourlong show: two   sets and an intermission. During the performance, four of my guests (three friends and a Groupmuse newbie stranger) and I were treated to a swift lesson in Classical 101, with movements from works by Mozart, Haydn and Brahms. Before each piece, the cellist Julia Yang gave quick talks, providing contexts for the work and insights about the composers. As it turns out, quite a bit did resonate for me. I quickly picked up parallels between the music in my living room and sequences that accompanied the ballets I loved. Having set out the drinks before the show, playing hostess was a breeze, and not having to spend the usual energy on my attire (I opted for leggings and a long sweater) meant I could put the focus where it needed to be: on the music. However, it was the radical proximity of the guests and performers that made the evening. “I’ve never thought about classical music as emotional and soulful, and I don’t know if I would’ve if I was sitting in a different environment,” my friend Reginald Scott told me. During intermission, the violinist Zenas Hsu said, “You’re not elevated on the stage, so there’s definitely a deeper connection. ” After the performance, the quartet stayed to talk, a stark departure from the usual rush out the   doors and into the subway. Orchestras and other   institutions must cultivate the next generation of loyal patrons if they are to remain culturally relevant and financially stable. Their pitches land in the email inboxes of millennials like myself on a regular basis: Join a young patrons group and receive insider perks. In all of their appeals, there’s a constant: You have to go to them. Groupmuse works because, like many apps and tech   it has shifted (and in some cases inverted) ideas around the delivery and consumption of goods and services. Not so different than Spotify, here, the music comes right to you. “Contemporary classical music patrons have done an absolutely invaluable service in preserving this art form, but institutional change is hard,” Mr. Bodkin said. “We’re creating the next generation of classical music listeners and the New York Philharmonic will be there to benefit from that. ” As my concert evening drew to a close and I cleared away the wine glasses, I was already thinking about hosting another Groupmuse. And who knows, maybe I’ll get dressed up and see a show at Lincoln Center or Carnegie Hall. For now, though, I’ll start with a Spotify playlist.'"}, "time": 1742628375.7377203}