{"duration": 0.10976743698120117, "input_args": {"text": "'DALLAS  —   As a demonstration against police shootings made its way downtown here on Thursday, it differed from others around the country in one startling way: Twenty to 30 of the marchers showed up with   and other types of   rifles and wore them openly, with the straps slung across their shoulders and backs. In Texas, it was not only legal. It was commonplace. The state has long been a bastion of   sentiment and the kind of place where both Democrats and Republicans openly talk about the guns they own and carry, on their person, in their vehicles, at their offices, at their homes and even in the halls of the Texas Capitol. And in recent years, as gun rights continued to expand, activists have exploited a   freedom to openly carry a rifle in public by showing up at demonstrations with their   long guns. Advocates have carried their rifles at the Alamo in San Antonio and outside mosques in the Dallas suburbs. But city and county leaders said the presence of armed protesters openly carrying rifles on Thursday through downtown Dallas had created confusion for the police as the attack unfolded, and in its immediate aftermath made it more difficult for officers to distinguish between suspects and marchers. Two men who were armed and a woman who was with them were detained, fueling an early, errant theory by the police that there was more than one gunman. Mayor Mike Rawlings of Dallas suggested in an interview on Sunday that, in the wake of the attack, he supported tightening the state’s gun laws to restrict the carrying of rifles and shotguns in public. “There should be some way to say I shouldn’t be bringing my shotgun to a Mavericks game or to a protest because something crazy should happen,” said Mr. Rawlings, a Democrat. “I just want to come back to common sense. ” The state’s   culture, the mayor said, had imperiled people on the streets of Dallas. “This is the first time  —   but a very concrete time  —   that I think a law can hurt citizens, police and not protect them,” he said, adding that he was not   and that he owned a shotgun himself. “I think it’s amazing when you think that there is a gunfight going on, and you are supposed to be able to sort who the good guys are and who the bad guys are. ” According to the authorities, Micah Johnson, 25, opened fire on police officers who were accompanying marchers protesting policing practices. Mr. Johnson, who had been in the Army Reserve, used a rifle to fire from a parking garage and while on foot on the streets below, killing five police officers. The Dallas police chief, David O. Brown, described to CNN’s “State of the Union” on Sunday the amount of confusion the armed protesters initially caused. He said the event had attracted “20 or 30 people” who “showed up with   rifles slung across their shoulder. ” “They were wearing gas masks,” Mr. Brown said. “They were wearing bulletproof vests and camo fatigues, for effect, for whatever reason. ” When the shooting started, “they began to run,” he said. And because they ran in the middle of the shooting, he said, the police on the scene viewed them as suspects. “Someone is shooting at you from a perched position, and people are running with   and camo gear and gas masks and bulletproof vests, they are suspects, until we eliminate that. ” “Doesn’t make sense to us, but that’s their right in Texas,” he said. He did not say whether he supported restricting the carrying of rifles on the streets. On Saturday, President Obama also told reporters that one of the challenges for the Dallas officers who were being shot at was that Texas was an   state. “Imagine if you’re a police officer and you’re trying to sort out who is shooting at you and there are a bunch of people who have got guns on them,” Mr. Obama said. One of the state’s most prominent   activists, C. J. Grisham, the founder and president of Open Carry Texas, disputed the extent of the confusion caused by marchers carrying rifles. In videos from the scene, he said, “you can see that police are walking right past people who are   rifles and it’s not a problem. So obviously it’s not that difficult to tell who the good guys and the bad guys are. ” It was unclear what effect the comments from Mr. Rawlings, Chief Brown and Mr. Obama would have on Texas gun laws.   Republicans control the governor’s office, the State Legislature and all but one of the nearly 30 statewide elected offices. Alejandro Garcia, a spokesman for Lt. Gov. Dan Patrick, said that Mr. Patrick was “not surprised the president and   forces are once again attempting to use a shooting tragedy to score points for their own political agenda. ” The Rev. Terry Holcomb, an   leader and a pastor of the Crossroads Baptist Church in Oakhurst, Tex. said he and others would oppose any efforts to ban the open carrying of   long guns as a result of the Dallas attack. “You would expect something like this in New York or California, but it will not see the light of day in Texas,” Mr. Holcomb said. “Let’s just call it for what it is: The liberal left is   and  . ” Even Democrats said they were not optimistic that substantial changes to Texas gun laws were in store. “From my perspective, I don’t see anything changing in Texas,” said Representative Beto O’Rourke, a Democrat, who represents El Paso. The legality of carrying a rifle on the streets is just one element of a gun culture that continues to define and divide the state. It is not just that many Texans are armed. It is that many are allowed to display the fact that they are armed, and more now do so than at any point in modern Texas history. Beyond the carrying of rifles in public  —   a tactic used by a small group of   advocates  —   more than one million Texans have   permits to carry concealed handguns. Last year, the Legislature voted to give those with   licenses the option of carrying their weapons unconcealed, in holsters on their hips or on their shoulders. That law, which is now in effect, did not affect the carrying of rifles in public. Lawmakers also allowed students and faculty members at Texas’ public and private universities to carry concealed handguns into classrooms and other campus buildings. The law, which has drawn fierce opposition at many universities, takes effect on Aug. 1. Amid the confusion on the scene, the Dallas police on Thursday released a picture on social media of one of the armed marchers. The police called the man “a person of interest” and asked for the public’s help in identifying him. That man, Mark Hughes, turned himself in and was later released. The other armed man was not allowed to legally carry a gun, and the police arrested him on a misdemeanor charge. He appeared to still be in custody on Sunday. A woman who was with the two men and who was detained was later released. A lawyer for Mr. Hughes said that his client was simply exercising his rights in Texas when carrying his rifle at a demonstration. The lawyer, Michael C. Campbell Jr. said, “He’s within the parameters of the law. ”'"}, "time": 1742562407.447908}