{"duration": 0.04713916778564453, "input_args": {"text": "\"Share on Facebook Hillary's emails truly are the gifts that keep on giving. While France led the proponents of the UN Security Council Resolution that would create a no-fly zone in Libya, it claimed that its primary concern was the protection of Libyan civilians (considering the current state of affairs alone, one must rethink the authenticity of this concern). As many “conspiracy theorists” will claim, one of the real reasons to go to Libya was Gaddafi's planned gold dinar. One of the 3,000 Hillary Clinton emails released by the State Department on New Year's Eve (where real news is sent to die quietly) has revealed evidence that NATO's plot to overthrow Gaddafi was fueled by first their desire to quash the gold-backed African currency, and second the Libyan oil reserves. The email in question was sent to Secretary of State Hillary Clinton by her unofficial adviser Sydney Blumenthal titled “France's client and Qaddafi's gold” . From Foreign Policy Journal : The email identifies French President Nicholas Sarkozy as leading the attack on Libya with five specific purposes in mind: to obtain Libyan oil, ensure French influence in the region, increase Sarkozy's reputation domestically, assert French military power, and to prevent Gaddafi's influence in what is considered “Francophone Africa.” Most astounding is the lengthy section delineating the huge threat that Gaddafi's gold and silver reserves, estimated at “143 tons of gold, and a similar amount in silver,” posed to the French franc (CFA) circulating as a prime African currency. And here is the section of the email proving that NATO had ulterior motives for destroying Libya (UPDATE: The link has since been killed, but here is the web cache ): This gold was accumulated prior to the current rebellion and was intended to be used to establish a pan-African currency based on the Libyan golden Dinar. This plan was designed to provide the Francophone African Countries with an alternative to the French franc (CFA). (Source Comment: According to knowledgeable individuals this quantity of gold and silver is valued at more than $7 billion. French intelligence officers discovered this plan shortly after the current rebellion began, and this was one of the factors that influenced President Nicolas Sarkozy's decision to commit France to the attack on Libya . According to these individuals Sarkozy's plans are driven by the following issues: A desire to gain a greater share of Libya oil production Increase French influence in North Africa Improve his internal political situation in France Provide the French military with an opportunity to reassert its position in the world Address the concern of his advisors over Qaddafi's long term plans to supplant France as the dominant power in Francophone Africa Ergo as soon as French intel discovered Gaddafi's dinar plans, they decided to spearhead the campaign against him- having accumulated enough good reasons to take over.\""}, "time": 1742564390.3513875}