{"duration": 0.15097665786743164, "input_args": {"text": "'Mysterious Universe \\nAs the Halloween season draws near, stories of strange experiences and supernatural hauntings ride high, and popular interest in haunted houses, phantom beings, other things deemed “paranormal” abound. \\nSo far as the serious study of apparitions goes, opinions about the concept of “ghosts” remains varied, manifesting in a number of different folkloric motifs since humankind’s earliest days. Ghosts are most often represented in cultural traditions as being spirits of the deceased, and thus, legends often conjoin ghosts with death and the afterlife. In equal measure, traditions pertaining to belief in ghosts often view them as the stuff of terror, or perhaps even as harbingers of things–often terrible–yet to come. \\nThis attitude, and the “fear” associated with belief in ghosts, has especially been the case with ghost stories in America. We have little doubt that thanks can be attributed to tales of popular hauntings the likes of The Amityville Horror to account for much of this. Such stories, though supposedly based in some element of fact (which is often debatable, upon further review) are further vilified on the big screen, making them the lasting stuff of horror cinema. \\nThe attitudes and, more frankly, the biases that begin to emerge toward our ideas about ghosts in relation to cultural standards become all-too apparent, once consideration beyond these lasting stereotypes is given. In William Butler Yeats’ The Celtic Twilight, the famed poet retold a number of ghostly legends recounted to him by the people of Ireland; particularly an older gentleman Yeats identifies as an acquaintance named “Paddy Flynn.” \\nIn the chapter on “Village Ghosts,” Yeats describes the Irish belief that to have a ghost living within one’s home is actually good luck; a stark contrast when paired alongside the modern “horror stories” of the last few decades: \\n“The house ghost is usually a harmless and well-meaning creature. It is put up with as long as possible. It brings good luck to those who live with it. I remember two children who slept with their mother and sister and brothers in one small room. in the room was also a ghost. They sold herrings in the Dublin streets, and did not mind the ghost much, because they knew they would always sell their fish easily while they slept in the ‘ha’nted’ room.” \\n“Harmless” and “well-meaning” usually aren’t the first terms that spring to mind in relation to ghost stories today. Yeats does, however, go on to describe that some of the ghosts of Ireland were viewed as harbingers, appearing before the death of another, or in the very most classic sense, returning to fulfill “unfinished business” of some sort: \\n“I have some acquaintances among the ghost-seers of western villages. The Connacht tales are very different from those of Leinster. These spirits have a gloomy, matter-of-fact way with them. They come to announce a death, to fulfill some obligation, to revenge a wrong, to pay their bills even—as did a fisherman’s daughter the other day—and then hasten to their rest.” \\nYeats further noted that, “it is demons, and not ghosts, that transform themselves into white cats or black dogs,” the latter evoking the popular image of the “Black Shuck” of the British Isles, although the mention of a white cat representing a demon seems to contrast starkly with the traditions about black cats as the ‘familiars’ of witches. \\nOn the subject of animals, and their relationship with the unexplained, some time ago I received an email from one of my followers, who shared his own story of what he perceived may have been an encounter with the ghost of a cat: \\n“I have a friend near Barnardsville NC who used to have a black cat. The cat was old and eventually died in the house. One day, after having drunk a cup of coffee, I was standing at the sink, rinsing the coffee cup, and out of the corner of my eye I saw her black cat (then deceased already) charging my ankles, like a kitten would. I called to my friend and told her that her cat had just attacked my ankles. She started laughing and assured me that her cat was dead (which I knew). I told her that, perhaps, her cat didn’t know she was dead, yet.” \\nSomewhat in keeping with this idea of animal specters, Yeats went on to discuss in The Celtic Twilight how some traditions in Ireland hold that ghosts, believed to be the spirits of dead people, may return in the form of various animals: \\n“In the surrounding villages they adopt strange disguises. A dead old gentleman steals the cabbages of his own garden in the shape of a large rabbit. A wicked sea-captain stayed for years inside the plaster of a cottage wall, in the shape of a snipe, making the most horrible noises. He was only dislodged when the wall was broken down; then out of the sold plaster the snipe rushed away whistling.” \\nNearby on the Isle of Man, which lays between Ireland and England, there is a strange bit of folklore about a family named Irving who had been “haunted” by a voice which emanated from within the walls. This occurred during the 1930s, and the case was even investigated by the famous ghost researcher Harry Price around the time of the disturbance. The strange twist to the story had been that the “voice” claimed it had belonged to a mongoose, which had travelled as a stowaway from India and had been trained to speak by its master. The supposed creature even claimed a name, calling itself “Gef.” \\nSome commentators have offered that, rather than a ghost, the affair might have been imagined by young Voirrey Irving, the apparent target of the poltergeist, though perhaps inspired by Rudyard Kipling’s story Rikki-Tikki-Tavi, first published in 1894. Skeptic Joe Nickel has made the case that Voirrey had actually been attempting ventriloquism– perhaps poorly in some instances–as one account detailed by a news reporter indicates that Voirrey had been caught making the “mongoose” noises herself. \\nTo this, her father intervened and attempted to make the case for Voirrey’s innocence, steering the reporter’s attention away from the girl in what appeared to be obvious collusion by members of the Irving family in a hoax. Regardless, could the strange “Gef” affair have nonetheless been inspired by those earlier legends of “ghosts” spectrally morphing into animal forms, and like the ghost of the old sea captain in snipe’s garb, haunting the walls of his former residence? “Hamlet and his father’s ghost,” by Henry Fuseli \\nOne might argue, based even on any peripheral survey the likes of which we’ve undertaken here, that the “fear” of the ghostly experience is probably more likely the raw juxtaposition of the unordinary against the consensus reality of the everyday. But moving beyond our generally accepted attitudes about the supernatural, and our fear of it, also leads us to more basic questions, which include the most fundamental of them all: “what is a ghost?” Even simpler, perhaps we must ask with equal sincerity, “is there anything of real substance to the idea that ghosts exist?” \\nIn short, perhaps the cultural standards that “the ghost of legend” is identified against have colored people’s attitudes about them. In turn, popular portrayal of ghosts almost inevitably come to represent to a culture of “fear” having been built around them in most parts of the world. Hence, although ghosts remain a fun and “scary” motif (especially around Halloween), one might question whether it is really the ghost itself that frightens us so badly… or, could instead be our age-old prejudices against the unknown that are the true source of fear?'"}, "time": 1742564329.3469346}