{"duration": 0.09360671043395996, "input_args": {"text": "'Elon Musk entertained the 2017 TED Conference by previewing how Tesla intends to solve almost all vehicle congestion by massive boring under cities to create an   tunnel transport system. [TED (Technology, Entertainment, Design) is a   media group that every year since 1990 has created and freely distributed a series of   interviews that feature innovative TED figures under the motto “ideas worth spreading. ”  Musk, who originally hails from Canada, sat down with TED’s Head Curator Chris Anderson in Vancouver to talk about solving his new The Boring Company which will solve   transportation congestion through a system of robotic transporter sleds that will lower vehicles to underground tunnels, and then whisk them to their destination at 130 miles per hour. Musk gave as an example the   of Los Angeles, where an   trip from downtown to Westwood usually takes about 40 minutes. Riding in his electric powered tunnels, travel time would be slashed to a 5 to   hop. Andersson asked him why he was not onboard for the development of flying cars that have been all the rage lately, due to announcements by Google, Uber, and others that the world of the   series the Jetsons is about to arrive. Musk answered, “I do rockets, so I like things that fly. There’s a challenge of flying cars in that they’ll be quite noisy. If something’s flying over your head, a whole bunch of flying cars going all over the place, that is not an   situation   …     You’ll be thinking, ‘Did they service their hubcap, or is it going to come off and guillotine me? ’” Musk referred to the jumbotron and played a video simulation of how a vehicle would drive on to a robotic electric powered cart that would be lowered to the appropriate tunnel level and then quickly accelerate. Musk commented that the greatest advantage of a   system is that the carts can move at unlimited speeds in   tunnels without generating huge externality complaints. Andersson asks Musk how tunnels would meld with Musk’s Hyperloop initiative. Musk commented that the SpaceX’s Hyperloop test track being built in Reno, Nevada, adjacent to his Gigafactory is already the second biggest vacuum chamber in the world. The only one bigger is the   Large Hadron Collider under the France —  Switzerland border that is used as an atomic particle accelerator that cost $7. 5 billion. For transportation, Musk believes a vacuum tunnel system can transport people, freight, and vehicles in   capsules at a fraction of the current time and costs. Musk said that based on initial Hyperloop testing, “We’re cautiously optimistic that it’ll be faster than the world’s fastest bullet train, even over a .  stretch. ” Asked by Andersson, “What’s happening at Tesla?” Musk said that the company’s $35, 000 Tesla Model 3 will arrive in July, and it will have the same autopilot features as Tesla’s $100, 000 vehicles that claim to offer   driving. “Once you solve cameras for vision, autonomy is solved if you don’t solve vision, it’s not solved   …     You can absolutely be superhuman with just cameras. ” Musk stated that Tesla will have a large enough charging network that they will conduct a   LA to New York test national test by the end of 2017: “November or December of this year, we should be able to go from a parking lot in California to a parking lot in New York, no controls touched at any point during the entire journey. ” Musk displayed the first picture of the Tesla Semi truck, which he recently unveiled as part of his Master Plan, Part Deux: “With the Tesla Semi, we want to show that an electric truck actually can   any diesel semi. If you had a tug of war competition, the Tesla Semi will tug the diesel semi uphill. ” Musk suggests will be quick and nimble, “like a sports car,” he says. Musk sees solar electricity as the fuel source of the future that will powerhouses, vehicles and almost all terrestrial corporate activity. With the spiking demand, Tesla plans to announce four more Gigafactories by the end of the year.'"}, "time": 1742562211.695327}