{"duration": 0.05023455619812012, "input_args": {"text": "'Good morning. Welcome to California Today, a morning update on the stories that matter to Californians (and anyone else interested in the state). Tell us about the issues that matter to you  —   and what you’d like to see: CAtoday@nytimes. com. Want to receive California Today by email? Sign up. Let’s turn it over to Brooks Barnes, our Hollywood reporter based in Los Angeles, for today’s introduction: You could hear a collective gasp in Hollywood on Tuesday morning, as the show business capital awakened to word from its town crier, TMZ, that Angelina Jolie had filed for divorce from Brad Pitt. There was an     feeling to it: As a couple, Ms. Jolie and Mr. Pitt were perhaps most important to Hollywood as a marketing tool, “proof that   movie star glamour and storybook romance had not yet faded away entirely,” said Janice Min, chief creative officer of The Hollywood   Media Group. And then most of moviedom went normally about its day. Contrary to the East Coast stereotype, Hollywood is not a place where people lounge around under palm trees. There are meetings to attend, numbers to crunch, emails to answer. Just like in the rest of America. Divorce fallout speculation was largely confined to the machinery that pumped out that imagery of Ms. Jolie and Mr. Pitt as   epitomized: “Extra,” “Entertainment Tonight,” People magazine and other celebrity news outlets. Lisa Gregorisch, the senior executive producer for “Extra,” said that her team in Burbank was finishing a regularly scheduled 6:30 a. m. meeting when the news started to break. “We turned on a dime, with literally every single person here, 140 people, working an angle,” she said. “What went wrong. Their past loves. The kids. The custody. Angelina’s health. The social media response. ” There are also the questions of their precise worth  —   hundreds of millions, at least  —   and whether a prenuptial agreement governs the dividing of assets. Ms. Gregorisch had been planning an Emmy Awards   for her Tuesday night show. Not anymore. “Extra” devoted   coverage to the divorce. The main challenge, she said, was “walking a fine line in terms of respect for them in a painful time and the interests of our viewers. ” On the print side, Jess Cagle, editor in chief of People magazine, was scrambling on Tuesday to figure out how to race out a new cover. (The publication typically closes its weekly issue on Monday nights.) For People, which has landed numerous “Brangelina” scoops over the years, the divorce story “is absolutely one of the biggest” of the past couple of years, Mr. Cagle said in an email. “On a    scale,” he said, “this is approximately 17. ” • Senator Elizabeth Warren of Massachusetts assailed the chief executive of San   Wells Fargo over a fraud scandal: “You should resign. ” [The New York Times] • Sacramento lawmakers are collecting thousands of dollars in per diems even when absent. [The Associated Press] • Homelessness is a big issue in San Diego. Why isn’t it on the county’s November ballot? [Voice of San Diego] • San Diego has become a destination for “stem cell tourism” as companies send patients across the border for treatments. [KPBS] • Curtis Hanson, the director of “L. A. Confidential,” died in Los Angeles. He was 71. [The New York Times] • Los Angeles police officers violated department rules in two fatal shootings last year, an oversight board said. [Los Angeles Times] • Oakland’s housing crisis is displacing the city’s arts and music counterculture. [East Bay Express] • Colin Kaepernick said he has received death threats, but he’s “not too concerned about it. ” [The Mercury News] • The plight of a tiny California pension fund illuminates a debate sweeping the country’s public pension system. [The New York Times] • California accounts for a fifth of all public companies on the major American markets, data show. [The New York Times] • Sacramento’s “Library of Things” loans out items like sewing machines and guitars. It also has a   lab. [99% Invisible] • Check out this image of three California wildfires captured by a NASA satellite on Sunday. [NASA] • When a New Yorker comes to Los Angeles: Culture shock in small talk and ripe avocados. [New Yorker] San Francisco hit fall overflow this week with the unofficial start of the tech company conference season. The companies that sell ideas about virtual life, cloud computing and telecommuting bring in thousands of customers each year for valuable    meetings. Over the weekend, Oracle Corporation shut off several blocks of downtown as part of its   OpenWorld conference. While traffic backs up and reroutes, the   area called Oracle Cloud Plaza served organic food (and, throughout the   event, an estimated three million cups of coffee). It’s a huge boon to the hotel business: On Monday, a Hampton Inn in the Soma neighborhood had a couple of rooms left for Tuesday night at $479 a night. Those prices will come back down to $179 when conference season ends in late October. That is after the Salesforce conference, which the company says now has 170, 000 people registered. The Opal, a 2.  hotel on Orbitz, has two rooms left at $570 a night.  —   Quentin Hardy, deputy technology editor for The New York Times, based in San Francisco California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742628516.6515644}