{"duration": 0.027720928192138672, "input_args": {"text": "'Get short URL 0 16 0 0 Rejecting the Trans Pacific Partnership free trade agreement would be a gigantic self-inflicted wound for the United States as it would slow growth and prevent fully advancing US interests in the Asia Pacific region, US Secretary of State John Kerry said. \\nWASHINGTON (Sputnik) — Kerry called on the US Congress to approve the TPP agreement and said rejection of the agreement would be a conscious turning of our backs on the Asia Pacific at the very moment the United States ought to be linking arms. © AFP 2016/ NICHOLAS KAMM Obama to Advocate TPP Deal in Peru Summit of Asia-Pacific Leaders \"[It would be an] act that would hurt American workers, slow the economy, hinder our ability to advance the full range of US objectives in a region that is by common sense with five of the fastest growing nations in the world,\" Kerry at the Chicago Council on Global Affairs in the state of Illinois on Wednesday. © Flickr/ Backbone Campaign China Developing Two Free Trade Deals for Asia-Pacific as US-Backed TPP Losing Momentum The TPP would link the US with the economies of 11 other Pacific Rim nations in a trade zone with lower tariffs and fewer import restrictions. Critics of the TPP agreement claim it undermines domestic companies, laws, regulations and institutions through an extra-judicial process that stacks the deck in favor of multinational corporations.\\nKerry explained one of the main benefits of the TPP deal lies in mandating a level playing field between private sector and state-owned companies in addition to abolishing 18,000 foreign taxes on American goods and services. \\nTo maintain a growing economy, Kerry added, the United States has be able to sell its goods to places where 95 percent of the world’s customers live. \\n\"If we’re going to live up to our responsibilities in Asia… if we’re going to do what’s necessary to protect our interests, we have to maintain a steady and reliable presence in that region,\" Kerry maintained. ...'"}, "time": 1742564598.7762642}