{"duration": 1.465158224105835, "input_args": {"text": "'Gene Wilder, who established himself as one of America’s foremost comic actors with his delightfully neurotic performances in three films directed by Mel Brooks his eccentric star turn in the family classic “Willy Wonka and the Chocolate Factory” and his winning chemistry with Richard Pryor in the   smash “Stir Crazy,” died early Monday morning at his home in Stamford, Conn. He was 83. A nephew, the filmmaker Jordan   confirmed his death in a statement, saying the cause was complications of Alzheimer’s disease. Mr. Wilder’s rule for comedy was simple: Don’t try to make it funny try to make it real. “I’m an actor, not a clown,” he said more than once. With his haunted blue eyes and an empathy born of his own history of psychic distress, he aspired to touch audiences much as Charlie Chaplin had. The Chaplin film “City Lights,” he said, had “made the biggest impression on me as an actor it was funny, then sad, then both at the same time. ” Mr. Wilder was an accomplished stage actor as well as a screenwriter, a novelist and the director of four movies in which he starred. (He directed, he once said, “in order to protect what I wrote, which I wrote in order to act. ”) But he was best known for playing roles on the big screen that might have been ripped from the pages of the Diagnostic and Statistical Manual of Mental Disorders. He made his movie debut in 1967 in Arthur Penn’s celebrated crime drama, “Bonnie and Clyde,” in which he was memorably hysterical as an undertaker kidnapped by the notorious   bank robbers played by Faye Dunaway and Warren Beatty. He was even more hysterical, and even more memorable, a year later in “The Producers,” the first film by Mr. Brooks, who later turned it into a Broadway hit. Mr. Wilder played the    accountant Leo Bloom, who discovers how to make more money on a bad Broadway show than on a good one: Find rich backers, stage a production that’s guaranteed to fold fast, then flee the country with the leftover cash. Unhappily for Bloom and his fellow schemer, Max Bialystock, played by Zero Mostel, their outrageously tasteless musical, “Springtime for Hitler,” is a sensation. The part earned Mr. Wilder an Academy Award nomination for best supporting actor. Within a few years, the anxious,   popeyed Mr. Wilder had become an unlikely movie star. He was nominated for a Golden Globe for his performance as the wizardly title character in “Willy Wonka and the Chocolate Factory” (1971). The film was a   disappointment, partly because of parental concern that the moral of Roald Dahl’s story  —   that greedy, gluttonous children should not go unpunished  —   was too dark in the telling. But it went on to gain a devoted following, and Willy Wonka remains one of the roles with which Mr. Wilder is most closely identified. His next role was more adult but equally strange: an otherwise normal doctor who falls in love with a sheep named Daisy in a segment of Woody Allen’s “Everything You Always Wanted to Know About Sex but Were Afraid to Ask,” in 1972. Two years later, he reunited with Mr. Brooks for perhaps the two   entries in either man’s filmography. In “Blazing Saddles,” a raunchy,    spoof of Hollywood westerns, Mr. Wilder had the relatively quiet role of the Waco Kid, a boozy   who helps an improbable black sheriff (Cleavon Little) save a town from railroad barons and venal politicians. The film’s   humor may have lost some of its edge over the years, but Mr. Wilder’s next Brooks film, “Young Frankenstein,” has never grown old. Mr. Wilder himself hatched the idea, envisioning a    film faithful to the look of the Boris Karloff “Frankenstein,” down to the laboratory equipment, but played for laughs rather than for horror. He would portray an American man of science, the grandson of the infamous Dr. Frankenstein, who tries to turn his back on his heritage (“that’s   ”) but finds himself irresistibly drawn to Transylvania to duplicate his grandfather’s creation of a monster in a spooky mountaintop laboratory. Mr. Brooks’s original reaction to the idea, Mr. Wilder recalled, was noncommittal: “Cute. That’s cute. ” But he eventually came aboard as director and   and the two garnered an Oscar nomination for their screenplay. Serendipity played a role in the casting. Mr. Wilder’s agent asked him to help find work for two new clients, and thus Marty Feldman became Frankenstein’s assistant, Igor (“that’s  ”) and Peter Boyle the monster. Madeline Kahn, whose performance as the chanteuse Lili Von Shtupp had been a highlight of “Blazing Saddles,” played the doctor’s socialite fiancée. Cloris Leachman was Frau Blücher, the sound of whose name caused horses to whinny in fear. The name Blücher, Mr. Wilder said in a 2008 interview with The San Jose Mercury News, came from a book of letters to and from Sigmund Freud: “I saw someone named Blücher had written to him, and I said, ‘Well, that’s the name. ’” And Mr. Wilder certainly knew a lot about Freud. His first of many visits to a psychotherapist is the opening scene in the memoir he published in 2005, “Kiss Me Like a Stranger: My Search for Love and Art. ” “What seems to be the trouble?” the therapist asks. “I want to give all my money away,” he says. “How much do you have?” “I owe three hundred dollars. ” Soon the jokes and evasions give way to the torments of sexual repression, guilt feelings and his “demon,” a compulsion, lasting several years, to pray out loud to God at the most embarrassing times and in the most embarrassing places. But never onstage or onscreen, where he felt free to be someone else. Gene Wilder was born Jerome Silberman in Milwaukee on June 11, 1933. His father, William, a manufacturer and salesman of novelty items, was an immigrant from Russia. His mother, the former Jeanne Baer, suffered from rheumatic heart disease and a temperament that sometimes led her to punish young Jerry angrily and then smother him with regretful kisses. He spent one semester at the   Military Institute in Hollywood. His mother saw it as a great opportunity in reality, it was a catch basin for boys from broken families, where he was regularly beaten up for being Jewish. Safely back home after that misadventure, he played minor roles in community theater productions and then followed his older sister, Corinne, into the theater program at the University of Iowa. After Iowa, he studied Shakespeare at the Bristol Old Vic Theater School in England, where he was the first freshman to win the school fencing championship. He next enrolled part time at the HB Studio in New York, while also serving a   Army hitch as an aide in the psychiatric unit of the Valley Forge Army Hospital in Pennsylvania  —   an assignment he requested because, he said, “I imagined the things I would see there might relate more to acting than any of the other choices. ” He added, “I wasn’t wrong. ” After his discharge, he won a coveted spot at the Actors Studio, and it was then that he adopted the name Gene Wilder: Gene for Eugene Gant, the protagonist of Thomas Wolfe’s “Look Homeward, Angel,” and Wilder for the playwright Thornton Wilder. In his first major role on Broadway, Mr. Wilder played the chaplain in a 1963 production of Bertolt Brecht’s “Mother Courage and Her Children. ” The production ran for less than two months, and he came to believe that he had been miscast. The good news was that he met the boyfriend of the star, Anne Bancroft: Mel Brooks, who wore a pea coat the night he met Mr. Wilder backstage and told him, “You know, they used to call these urine jackets, but they didn’t sell. ” So began the conversation that ultimately led to “The Producers. ” Mr. Wilder’s association with Mr. Brooks led, in turn, to one with Richard Pryor, who was one of the writers of “Blazing Saddles” (and Mr. Brooks’s original choice for the part ultimately played by Mr. Little). In 1976, Mr. Pryor was   behind Mr. Wilder and Jill Clayburgh in “Silver Streak,” a comic thriller about murder on a transcontinental train. The two men went on to star in the 1980 hit “Stir Crazy,” in which they played a hapless pair jailed for a crime they didn’t commit, as well as “See No Evil, Hear No Evil” (1989) and “Another You” (1991). Mr. Wilder’s first two marriages, to Mary Mercier and Mary Joan Schutz, ended in divorce. In 1982, he met the “Saturday Night Live” comedian Gilda Radner when they were both cast in the suspense comedy “Hanky Panky. ” One evening, he recalled in “Kiss Me Like a Stranger,” he and Ms. Radner innocently ended up at his hotel to review some script changes. The time came for her to go instead, she shoved him down on the bed, jumped on top of him and announced, “I have a plan for fun!” He sent her home anyway  —   she was married to another man  —   but before long, they began a relationship. By his account, Ms. Radner was needy, obsessed with getting married and, once they married in 1984, obsessed with having a child, a project that ended in miscarriage just months before she learned she had ovarian cancer in 1986. Of their first year of living together, he wrote: “We didn’t get along well, and that’s a fact. We just loved each other, and that’s a fact. ” He left, only to find that he needed to go back. Ms. Radner died in 1989. “I had one great blessing: I was so dumb,” Mr. Wilder once said of her last years. “I believed even three weeks before she died she would make it. ” In memory of Ms. Radner, he helped to found an ovarian cancer detection center in her name, in Los Angeles, and Gilda’s Club, a network of support centers for people with cancer. He also contributed to a book, “Gilda’s Disease” (1998) with Dr. M. Steven Piver. Mr. Wilder himself developed  ’s lymphoma in 1999. With chemotherapy and a   transplant, he was in remission by 2005. In 1991 Mr. Wilder married Karen Boyer, a hearing specialist who had coached him in the filming of “See No Evil, Hear No Evil,” in which his character was deaf and Mr. Pryor’s was blind. She survives him, as does a daughter from an earlier marriage. His sister died in January. Even before he became ill, Mr. Wilder had begun slowing down. He made his first and last attempt at a television series, the   and   comedy “Something Wilder,” in 1994. He returned to the theater in 1997 in a London production of Neil Simon’s “Laughter on the 23rd Floor. ” In 1999 he was a writer for two TV movies in which he starred, “Murder in a Small Town” and “The Lady in Question,” playing a theater director turned amateur sleuth. In 2001 he appeared at the Westport Country Playhouse in Connecticut in a program of   farces. Shortly after appearing in an episode of “Will  Grace” in 2003  —   he won an Emmy for that role  —   he declared that he had retired from acting for good. “I don’t like show business, I realized,” he said in 2008. “I like show, but I don’t like the business. ” He was by then enjoying a new career as a novelist. His “My French Whore,” published in 2007, was the story of a naïve young American who impersonates a German spy in World War I. (“Just fluff, but sweet fluff,” the novelist Carolyn See wrote in her review in The Washington Post.) It was followed by two more novels, “The Woman Who Wouldn’t” and “Something to Remember You By,” and a story collection, “What Is This Thing Called Love?” But it was, of course, as an actor that Mr. Wilder left his most lasting mark. In his memoir, he posed a question about his life’s work, then answered it: “What do actors really want? To be great actors? Yes, but you can’t buy talent, so it’s best to leave the word ‘great’ out of it. I think to be believed, onstage or onscreen, is the one hope that all actors share. ”'"}, "time": 1742564094.8584397}