{"duration": 0.03971433639526367, "input_args": {"text": "'GaryNorth.com October 31, 2016 The world of 1900 was nothing like the world of 1800. The world of 2000 was nothing like the world of 1900. Why? Because of 2% per annum economic growth per capita. \\nNo one can perceive this low an increase in one year. But when compounded, no one can miss the changes in our lives over a lifetime. I dealt with this in my Mises Institute lecture, “ How Come We’re So Rich? ” \\nIn my life, I experienced only one major change in my productivity. In late 1980, I switched to a computer to write. I used a primitive version of WordPerfect on a mini-computer: Satellite Software International. In one week, I doubled my output. I continued to use the DOS-based version of the program for the next 25 years. \\nFor small businesses, the big breakthrough was VisiCalc: the first spreadsheet. This was the “killer App” that made the Apple II the first business microcomputer in 1979. There have been improvements since then, but VisiCalc fundamentally changed the process of business planning. It came as a result of a “what if” class assignment at the Harvard Business School. If any other business program has had a greater impact on how businessmen run their businesses, I am unaware of it. Maybe computerized accounting programs are more widely used, but they are digital versions of paper-based principles that go back six centuries. There has been nothing to match double-entry bookkeeping during this period. \\nTim Berners-Lee converted the Internet into the World Wide Web in 1990. It was a hobby project. The graphics user interface for the Internet launched a communications revolution five years later. A group of nerds at the University of Minnesota invented it. YouTube followed a decade later. Facebook changed the way a billion people live. These were revolutions. They were all originally hobby projects. The applications of these technologies have been decentralized and marginal, but our world is different. \\nThere are occasional big ideas. There are not many of them. Then decentralized marginal extensions of them change our world. \\nThis takes the liberty. It takes a free market. No central planner or planning committee could foresee these applications, let alone design one. Yet there are still socialists who imagine that some planning committee could do this. They see all around them the fruits of the private ownership of the means of production, and then they go online to call the rest of us to vote for central planning. \\nWe think of Bernie Sanders as a socialist. But, compared with Marx, Lenin, and Mao, he is a free enterpriser. He wants wealth redistribution. He and his followers use the word “socialism,” but they still want Facebook and YouTube in private hands. The world around us is the world of decentralized capital. Sanders and his camp want government redistribution of wealth, but they don’t want the world run by the Department of Motor Vehicles. The Best of Gary North Tags: Gary North [ ] is the author of Mises on Money . Visit http://www.garynorth.com . He is also the author of a free 31-volume series, An Economic Commentary on the Bible . Copyright © 2016 Gary North'"}, "time": 1742563129.610844}