{"duration": 0.13341236114501953, "input_args": {"text": "'10 Signs of Vitamin B12 Deficiency (And best food sources of Vitamin B12) http://blogs.naturalnews.com/10-signs-vitamin-b12-deficiency-best-food-sources-vitamin-b12/ \\nBy Twain Yobra \\nPosted Friday, October 28, 2016 at 10:11am EDT \\nVitamin B12 is crucial for the brain, nerves, DNA and blood cells. Unfortunately, it becomes harder and harder for our bodies to absorb vitamin B12 as we age. In fact, 4 in every 100 women between age 40 and 60 have vitamin B12 deficiency . But age isn’t the only contributing factor – avoiding certain foods is what’s making you vitamin B12 deficient. \\nHere are signs of vitamin B12 deficiency and the foods you should eat to combat them. \\nSigns of vitamin B12 Deficiency Being sleepy all the time despite getting adequate sleep at night Strange sensations in the body – pins and needles sensations Feeling of weakness and sluggishness Loss of memory and impaired thinking Feeling dizzy while doing simple things like walking Skin looks pale (yellow) Tongue gets swollen and red Anemia Blurry vision \\n\\nNote that very low levels of vitamin B12 can have more harmful effects. Also, vegan and vegetarian diets don’t offer enough vitamin B12 so you’ll need supplementation if you’re either. But non-vegetarians can get enough vitamin B12 from their diet. Below are great sources of vitamin B12 \\n15 Best food sources of vitamin B12 \\n1. Oysters: Oyster has high amounts of vitamin B12, it is also a great source of zinc. Zinc boosts testosterone, libido and benefits the ovaries. \\n2. Clams: Clams contain more vitamin B12 than any other food. They’re also rich in potassium. \\n3. Mussels: Other than vitamin B12 mussels are also rich in protein, potassium, omega 3s and vitamin C. \\n4. Sardines: This fish is known for its omega 3 properties, it can also fight vitamin B12 and D deficiency. \\n5. Crab: Crabs are loaded with lots of nutrients, they’re rich in magnesium, zinc, and vitamins A, B and C. \\n6. Salmon: 3 ounces of cooked salmon have 4.8 mcg of vitamin B12. Salmon is also contains vitamin D and omega 3s. \\n7. Trout: This fish can help you fight inflammation and improve brain function. \\n8. Tuna: Just make sure the tuna is bred in a clean environment. It’ll give you lots of omega 3s and vitamin D. \\n9. Grass-fed beef: Beef will give you lots of proteins and B vitamins. \\n10. Haddock: This fish has low amounts of mercury and it will give you omega 3s. \\n11. Milk: Not only is milk a good source of vitamin D and calcium, recent studies show it can reduce PMS symptoms. \\n12. Yoghurt: Yoghurt is rich in probiotics, magnesium, calcium and protein. Plain greek yoghurt is the best option. \\n13. Whole eggs: Eggs will also give you vitamin D and aid absorption of calcium in the bones. \\n14. Chicken: Chicken will give you lots of protein and keep you full. \\n15. Turkey: Turkey has small amounts of vitamin B12 so it may not be the best option for folks with severe deficiency. \\nFor more information on eating healthy and staying fit, download your FREE 3 Weeks Flat Stomach Guide to help you improve your health and physique. And like our Facebook page . You might also like…'"}, "time": 1742564264.818313}