{"duration": 0.12668514251708984, "input_args": {"text": "'Photo by Jedimentat44 | CC BY 2.0 I would not rank Vladimir Putin high on a list of leaders. If I lived in Russia I’d be working for major reforms in my government, just as I’m doing where I do live, in the United States. I regularly go on Russian media and criticize the Russian government. Russia is illegally and immorally bombing people in Syria, just as the United States is doing in Syria, Iraq, Pakistan, Afghanistan, Libya, Somalia, and Yemen. But there are Putin Halloween masks for sale in U.S. stores. Time magazine has Putin on the cover accusing him of trying to damage U.S. elections. A Google search for “Hitler Putin” brings back 11 million results. This demonization of a foreign leader should frighten us more than that leader himself. Wars do not only kill, if they kill at all, a foreign leader. But they do kill large numbers of children, grandparents, mothers, and fathers. They enrage people, endanger us, damage the natural environment, justify the removal of our rights, and divert unfathomable resources from areas where they could have done a world of good. The actual Adolph Hitler had no plans or ability to invade the United States and was defeated primarily by Russians who lost at least 27 million lives in the process. For over 70 years, since the end of World War II, the United States has bombed dozens of nations, and in every case that I am aware of U.S. officials have labeled a targeted individual “Hitler.” In May the Politico newspaper reported on Pentagon testimony in Congress to the effect that Russia had a superior and threatening military, but followed that with this: “‘This is the “Chicken-Little, sky-is-falling” set in the Army,’ the senior Pentagon officer said. ‘These guys want us to believe the Russians are 10 feet tall. There’s a simpler explanation: The Army is looking for a purpose, and a bigger chunk of the budget. And the best way to get that is to paint the Russians as being able to land in our rear and on both of our flanks at the same time. What a crock.” Politico then cited a less-than-credible “study” of Russian military superiority and aggression and added: “While the reporting about the Army study made headlines in the major media, a large number in the military’s influential retired community, including former senior Army officers, rolled their eyes.” The United States has overseen the expansion of NATO to Russia’s border. The buffer zone of the last Cold War is gone. U.S./NATO missile bases are now in Romania and being built in Poland. The U.S. has organized in Eastern Europe the largest military exercises seen there since World War II. The U.S. role in supporting a violent coup that created an anti-Russian government in Ukraine was exposed before the coup. When the people of Crimea voted overwhelmingly to rejoin Russia, the U.S. media characterized Russian actions that resulted in total casualties of zero as “an invasion of Ukraine.” Without presenting us with any evidence, the U.S. government has accused Russia of shooting down an airplane, of exposing the corruption within the Democratic National Committee (shouldn’t we be grateful?), and of somehow sabotaging the upcoming U.S. election. Every atrocity committed by Russia or Syria in Syria is big news. Every U.S. atrocity there is a yawn. The stakes are high every time the United States overthrows a government. The disasters of Iraq and Libya have fueled the current catastrophes in those countries and Syria and around the region. But the stakes are higher when the United States and Russia confront each other. These are nuclear nations. Russia has announced that it is considering re-opening a base in Cuba. The Cuban Missile Crisis, in case anyone has forgotten, was one of the many times since the creation of nuclear weapons that humanity has come close to intentionally or accidentally destroying itself. The nukes are of far greater strength now. And our understanding has grown of how a limited nuclear war anywhere on earth would create a crop-destroying nuclear winter followed by mass starvation. We don’t need to take this sort of risk. To avoid it we need to turn away from war. And that means we need to stop using human rights abuses by targeted governments as excuses to bomb people. We should protect human rights through leadership by example and consistent application of the rule of law. Doing so would then open the United States up to the possibility of opposing human rights abuses by some of the nasty governments that it props up and sells or gives weapons to, beginning perhaps with Saudi Arabia, a monarchy that makes Vladimir Putin look like Mohandas Gandhi. This piece was first published by the Fairbanks Alaska Daily Miner. David Swanson wants you to declare peace at http://WorldBeyondWar.org His new book is War No More: The Case for Abolition . NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS ABOUT THE AUTHOR Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”] Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?'"}, "time": 1742562434.0074687}