{"duration": 1.1391525268554688, "input_args": {"text": "'Donald Trump vs. Hillary Clinton 2016 In Their Own Words 2016 Election Through the Eyes of Prophecy \\nBy Dave Robbins \\n\\nAs we approach the presidential election on November 8, 2016 I don’t think the candidates could be more divided. \\n\\nOne is pro-life, the other is pro-choice. One is pro-gun, while the other is anti-gun. One believes global warming is a hoax, and the other claims the science is settled. One wants to build a wall, while the other is essentially for opening the borders. One believes in a traditional marriage between one man and one woman, while the other supports same-sex marriage. And the list goes on and on. \\n\\nEach of these issues is certainly important and should be considered before making a final decision on who to vote for in November. \\n\\nHowever, for those who follow prophecy, this upcoming election goes beyond that. Knowing that a world government is prophesied for the near future, one area that we are following closely is the ongoing process of globalization. (moving toward a global governing system) \\n\\nIt is possible that this upcoming election will set the course of the United States of America on a path toward either full involvement or total dissention from this prophesied world government. If everyone understood the prophecies concerning the future global political authority, the entire election would be determined on that issue alone. That is why we chose to devote an entire article to that subject in this magazine. \\n\\nAnd yes, one candidate is vehemently opposed to globalization, while the other supports it in every way. \\n\\nSince the next President of the United States will serve at least a four-year term, and quite possibly eight, we thought it would be important to let you see where each candidate stands on the important issues. \\n\\nWhy? With all the prophecies converging at the same time, it is likely that the next president will be in office during some of the most significant prophetic fulfillments concerning the end time. \\n\\nAlthough there are more technical issues at hand (i.e. taxes, infrastructure, job creation, etc.), these do not necessarily show the character of an individual. That is why we have chosen the more defining topics which let us see the person behind the persona. In our opinion, these are the most critical. \\n\\nTherefore, instead of giving you my opinion, I will let the candidates speak for themselves… Abortion \\nTrump: Pro-Life \\n\\nAre you pro-life? Mr. Trump, “Yes…It’s an issue. I mean it’s an issue, and it’s a strong issue…What I am saying is this: With caveats – life of the mother, incest, rape. That’s where I stand. So, I’m pro-life, but with the caveats. You have to have it with the caveats.” Pregnancy outside of those caveats? Mr. Trump stated, “It depends why?” “I’m, pro-life…very simple, pro-life.” [i] \\n\\n“…friends of mine years ago were going to have a child, and it was going to be aborted. And it wasn’t aborted. And that child today is a total superstar, a great, great child. And I saw that. And I saw other instances. And I am very, very proud to say that I am pro-life.” [ii] \\n\\nClinton: Pro-Choice \\n\\n“Politicians have no business interfering with women’s personal health decisions. I will oppose efforts to roll back women’s access to reproductive health care, including Republican efforts to defund Planned Parenthood. As president, I’ll stand up for Planned Parenthood and women’s access to critical health services, including safe, legal abortion,” [iii] \\n\\n“The unborn person doesn’t have constitutional rights.” [iv] \\n\\n“I believe we need to protect access to safe and legal abortion, not just in principle, but in practice.” [v] Climate Change \\nTrump: “It’s a Hoax…” \\n\\nOn December 30, 2015, Trump told the crowd at a rally in Hilton Head, S.C., “Obama’s talking about all of this with the global warming and…a lot of it’s a hoax. It’s a hoax. I mean, it’s a money-making industry, okay? It’s a hoax, a lot of it.” [vi] \\n\\nIn an “Energy Policy” speech in North Dakota on May 26, 2016 Trump stated, “…rescind all the job-destroying Obama executive actions including the Climate Action Plan…We’re going to cancel the Paris Climate Agreement and stop all payments of U.S. tax dollars to U.N. global warming programs.” [vii] \\n\\n“There has been a big push to develop alternative forms of energy–so-called green energy–from renewable sources. That’s a big mistake. To begin with, the whole push for renewable energy is being driven by the wrong motivation, the mistaken belief that global climate change is being caused by carbon emissions. If you don’t buy that–and I don’t–then what we have is really just an expensive way of making the tree-huggers feel good about themselves.” [viii] \\n\\nClinton: The Science is Settled. \\n\\n“It’s hard to believe that people running for president refuse to believe the settled science of climate change.” [ix] \\n\\n“I believe in science. I believe that climate change is real and that we can save our planet while creating millions of good-paying clean energy jobs.” [x] \\n\\n“Go talk to a scientist!” she said. “I really am tired of the debate, which is a phony debate. Climate change is real. It is here. It has to be dealt with.” [xi] Gun Control \\nTrump: Pro-Gun \\n\\n“The Second Amendment to our Constitution is clear. The right of the people to keep and bear Arms shall not be infringed upon. Period…The Second Amendment guarantees a fundamental right that belongs to all law-abiding Americans. The Constitution doesn’t create that right – it ensures that the government can’t take it away. Our Founding Fathers knew, and our Supreme Court has upheld, that the Second Amendment’s purpose is to guarantee our right to defend ourselves and our families. This is about self-defense, plain and simple…It’s been said that the Second Amendment is America’s first freedom. That’s because the Right to Keep and Bear Arms protects all our other rights. We are the only country in the world that has a Second Amendment.” [xii] \\n\\nClinton: Anti-Gun \\n\\nGeorge Stephanopoulos asked, “Do you believe that an individual’s right to bear arms is a constitutional right; that it’s not linked to service in a militia?” Mrs. Clinton replied, “I think that for most of our history there was a nuanced reading of the Second Amendment until the decision by the late Justice (Antonin) Scalia. And there was no argument until then that localities and states and the federal government had a right – as we do with every amendment – to impose reasonable regulations. So I believe we can have common-sense gun safety measures consistent with the Second Amendment…But I’m going to continue to speak out for comprehensive background checks; closing the gun show loophole; closing the online loophole; closing the so-called Charleston loophole; reversing the bill that Sen. (Bernie) Sanders voted for and I voted against, giving immunity from liability to gun makers and sellers. I think all of that can and should be done, and it is, in my view, consistent with the Constitution.” [xiii] \\n\\n“When it comes to guns, we have just too many guns,” Clinton said. “On the streets, in our homes, in our neighborhoods.” [xiv] \\n\\n“I am not here to make promises I can’t keep. I am here to tell you I will use every single minute of every day, if I am so fortunate enough to be your president, looking for ways that we can save lives, that we can change the gun culture…It is just too easy for people to reach for a gun to settle their problems. It makes no sense.” [xv] \\n\\n“I was proud when my husband took [the National Rifle Association] on, and we were able to ban assault weapons, but he had to put a sunset on so, 10 years later, of course [President George W.] Bush wouldn’t agree to reinstate them…We’ve got to go after this…And here again, the Supreme Court is wrong on the Second Amendment. And I am going to make that case every chance I get.” [xvi] \\n\\n“I don’t know enough details to tell you how we would do it or how it would work, but certainly the Australia example is worth looking at,” Clinton said at a New Hampshire town hall…The Australian program reduced the number of firearms in circulation by implementing a gun buy-back plan for citizens. [xvii] Immigration \\nTrump: “I will Build a Great, Great Wall…” \\n\\n“You cannot have…illegal immigration. You don’t have a country if you have that…As has been stated continuously in the press, people are pouring across our borders unabated. Public reports routinely state great amounts of crime are being committed by illegal immigrants. This must be stopped and it must be stopped now.” [xviii] \\n\\n“I will build a great, great wall on our southern border. And I will have Mexico pay for that wall.” [xix] \\n\\nMr. Trump responded to a question on mass deportation: “No, I would not call it mass deportations…We’re going to do it (deport illegals) in a very humane fashion. Believe me. I have a bigger heart than you do. We’re going to do it in a very humane fashion…I want terrorists out. I want people that have bad thoughts out. I would limit specific terrorist countries, and we know who those terrorist countries are.” [xx] \\n\\nClinton: “We will not Build a Wall.” \\n\\n“We will not build a wall. Instead, we will build an economy where everyone who wants a good paying job can get one. And we’ll build a path to citizenship for millions of immigrants who are already contributing to our economy…I believe that when we have millions of hardworking immigrants contributing to our economy, it would be self-defeating and inhumane to kick them out.” [xxi] \\n\\n“In 2003, I sponsored the DREAMER (sic) Act. I sponsored I think in every Congress after that. I have been consistent and committed to comprehensive immigration reform with a path to citizenship.” [xxii] \\n\\nMrs. Clinton made this statement concerning Syrian refugees: “We’re facing the worst refugee crisis since the end of World War II and I think the United States has to do more…I would like to see us move from what is a good start with 10,000 to 65,000 (incoming refugees) and begin immediately to put into place the mechanisms for vetting the people that we would take in.” [xxiii] \\n\\n“I would stop (deportations) of the undocumented (illegal) people living in our country,” Clinton responded. “I do not want to see them deported…I want to see them on a path to citizenship. That’s exactly what I will do.” [xxiv] \\n\\n“You can count on me to defend President Obama’s executive actions on DACA and DAPA when I am president,” Clinton said, referring to Obama’s 2012 (DACA) and 2014 (DAPA) executive amnesties, which gave work permits and access to federal benefits to millions of illegal immigrants. [xxv] Obamacare \\nTrump: “…Repeal and Replace Obamacare…” \\n\\nSpeaking at the Iowa Freedom Summit in January 2015, Mr. Trump stated, “Someone has to repeal and replace Obamacare… (Obamacare is) a total catastrophe. It kicks in in 2016 and it will be a disaster. People are closing shops. Doctors are quitting the business. I have a friend who was a doctor and he says he has more accountants than patients. He needs that because it is complicated and terrible.” [xxvi] \\n\\n“We are going to repeal Obamacare. We are going to replace Obamacare with something so much better.” [xxvii] \\n\\nClinton: “I will Defend the Affordable Care Act…” \\n\\n“I will defend the Affordable Care Act, but as president I want to go further…I want to strengthen the Affordable Care Act.” [xxviii] \\n\\n“You know, before it was called Obamacare it was called Hillarycare…”I am a staunch supporter of President Obama’s principal accomplishment, namely the Affordable Care Act.” [xxix] \\n\\nConcerning Obamacare for illegal immigrants: “There are two steps here. If someone can afford to pay for an insurance policy off the exchanges that were set up under the Affordable Care Act, I support that. If they can afford it, they should be able to go into the marketplace and buy it. However, it is not going to apply to people who are in need of subsidies in order to afford that…What I do want to see is that we have more options for undocumented (illegal) people to be able to get the health care they need…It’s not only the right and moral thing to do for them. It’s also important that we keep ourselves healthy, and public health requires that. So I see this as a two-step process.” [xxx] Warrantless Surveillance/Database \\nTrump: Bulk Data Collection is Fine \\n\\nMr. Trump said that he would be “fine” with restoring provisions of the Patriot Act to allow for the bulk data collection. “As far as I’m concerned, that would be fine,” Trump said. [xxxi] \\n\\nMr. Trump also told the Daily Signal , “I support legislation which allows the NSA to hold the bulk metadata. For oversight, I propose that a court, which is available any time on any day, is created to issue individual rulings on when this metadata can be accessed.” [xxxii] \\n\\nClinton: Does not Regret Her Vote on Patriot Act \\n\\nConcerning plans for expanded online surveillance of potential extremist attackers: “We already know we need more resources for this fight. The professionals who keep us safe would be the first to say we need better intelligence to discover and disrupt terrorist plots before they can be carried out…That’s why I’ve proposed an ‘intelligence surge’ to bolster our capabilities across the board, with appropriate safeguards here at home.” [xxxiii] \\n\\nDuring the Democratic Presidential debate on October 13, 2015 Anderson Cooper asked: “Governor Chafee, you and Hillary Clinton both voted for the Patriot Act which created the NSA surveillance program. You’ve emphasized civil liberties, privacy during your campaign…Secretary Clinton, do you regret your vote on the Patriot Act?” \\n\\nClinton replied, “No, I don’t. I think that it was necessary to make sure that we were able after 9/11 to put in place the security that we needed. And it is true that it did require that there be a process. What happened, however, is that the Bush administration began to chip away at that process. And I began to speak out about their use of warrantless surveillance and the other behavior that they engaged in. We always have to keep the balance of civil liberties, privacy and security. It’s not easy in a democracy, but we have to keep it in mind.” [xxxiv] \\n\\n“Well, the NSA has to act lawfully. And we as a country have to decide what the rules are. And then we have to make it absolutely clear that we’re going to hold them accountable. What we had because of post-9/11 legislation was a lot more flexibility than I think people really understood, and was not explained to them.” [xxxv] Real ID/National ID'"}, "time": 1742562985.2117834}