{"duration": 0.172987699508667, "input_args": {"text": "'Arthritis(inflammation of one or more joint) Illness A spine problem you were born with. Fibromyalgia (a disorder that causes fatigue and muscle pain) Compression fractures \\nTo get quick and effective relief from back pain, you can follow some tips mentioned over here to get rid of this irritating pain. \\nSometimes back pain is serious. In such conditions, it’s obvious that you will call your doctor. But for routine and mild back pain, you can do some home remedies for quick relief . \\nIce & Heat to the Rescue In first 24-48 hours of an injury, ice is best as it reduces inflammation. Use ice for about 20 minutes on your back then take it off to give your back skin rest. If pain persists, talk to a doctor. After 48 hours you can switch to heat if you prefer. But in first 48 hours when you have acute pain, an ice pack is only recommended. \\nMove Your Spines \\nOur body is made to move, so does our spine. Keep doing your daily life activities to feel better. Go to work, make the beds, walk the pet. If you are in a state to do aerobic exercises such as bicycling, swimming and walking then carefully do them. Just don’t overdo it. You can keep your back pain in mobile by doing so. \\nExercise and Stretch \\nRegular physical activity keeps you away from this types of pain. A simple exercise like walking, running can be proved very helpful in healing such pain. It is advisable to consult your physician for a list of exercises suitable for your age and health conditions. \\nStretch: Apart from exercise, stretch helps you recover from back pain quickly. Always stretch before any physical activity or exercise to warm up yourself. Also, stretch for 10-15 minutes before going to bed. Sitting for long hours in a desk chair all day and bending forward after every other minute to see monitor or file is the reason of back pain in office goers. If you are among those people, then don’t forget to stretch your legs and do office yoga to get rid of this pain. \\nMassage Your Back \\nHeat some sesame oil or coconut oil on a low flame with eight cloves of garlic in it. Apply the mixture on the affected area and massage it thoroughly for at least 10-15 minutes . Leave it for 3-4 hours then wash it off with warm water or if you wish you can take a bath of warm water. \\nIf you do not want to do so much effort, then mix some camphor in your massage oil and apply it to your back. \\nTo help keep your back healthy and avoid further pain: \\nSleep Well \\nBad posture while sleeping often causes back pain. Always sleep on your side and firm surface rather than on soft mattresses like an amerisleep mattress. If you feel back pain on a regular interval, then t here are mattresses available in the market, especially for back pain patients. \\nAlways sit in a chair that is designed to keep your back straight and practice good posture when you stand. \\nHealthy Weight \\nIt has often seen that overweight is the cause of back pain. Our ribs and area above the legs already bear most of the body’s weight, and when you are overweight, it puts extra weight on that part of our body. So, eat fruits and green vegetables and avoid eating processed food. Hit gym regularly to get your body lean and toned. \\nAlso, avoid lifting heavy weights. \\nCalcium \\nAs you know, calcium makes our bones strong. It also protects your spine from osteoporosis. Eating calcium-rich foods in your diet such as milk and dairy products, finger millet, green leafy veggies, sesame, small fish with bones, etc. reduce the chances of getting serious lower back pain. So, increase your calcium intake. \\nChange Your Lifestyle \\nIf you work in an office , bend forward after every few minutes and sit for longer hours then keep stretching and doing office yoga at work to avoid getting lower back pain. \\nAuthor – This post is written by Jane who has written reviews about mattresses available in the market for back pain . You might also like…'"}, "time": 1742563600.2991288}