{"duration": 0.13830161094665527, "input_args": {"text": "\"Videos Jill Stein Blasts ‘Attack-Dog’ Media, Clinton Protectionists After Daily Beast Smear The Green Party presidential candidate questioned the lack of ‘disclosure on the conflict of interest posed by Chelsea Clinton's position as a director of the corporate owner of the Daily Beast, IAC’ after The Daily Beast published an article criticizing Stein’s investments. | October 31, 2016 Be Sociable, Share! Green party presidential candidate Jill Stein delivers a stump speech to her supporters during a campaign stop at Humanist Hall in Oakland, Calif. on Thursday, Oct. 6, 2016. \\nAUSTIN, Texas — Green Party presidential candidate Dr. Jill Stein accused The Daily Beast, a popular news and opinion website, of hiding its ties to the Clintons after publishing an attack on Stein’s investment portfolio on Wednesday. \\n“ Jill Stein’s Ideology Says One Thing—Her Investment Portfolio Says Another ” declared the headline for an analysis of Stein’s investments and finances by Yashar Ali. The article suggests that Stein has millions of dollars invested in mutual funds which support industries she opposes on the campaign trail, including fossil fuels and the military-industrial complex. \\n“If Mr. Ali is truly interested in conflicts of interest of political candidates and their families, where is his disclosure on the conflict of interest posed by Chelsea Clinton’s position as a director of the corporate owner of the Daily Beast, IAC ?” Stein fired back in a detailed response sent to the Daily Beast prior to publication and published to her campaign website in full on Wednesday . \\n\\n— Dr. Jill Stein (@DrJillStein) October 27, 2016 \\nAli’s analysis was based on Stein’s financial disclosure filing with the U.S. Office of Government Ethics, a requirement for all presidential candidates, which the office published in March. Ali also used Stein’s 2015 tax return , which the candidate released voluntarily earlier this year. Ali reported that Stein and her husband, Richard Rohrer, “have investments (with the exception of real estate) valued at anywhere from $3,832,050 to $8,505,000,” then criticized the candidate for her investment in a series of index funds or mutual funds which offer investors relatively safe and consistent returns on their money. However, in exchange for reliable earnings, investors also give up control over where their money is used. \\n“Like many Americans who hold retirement accounts, pension funds, or who invest in the American economy, my finances are largely held in index funds or mutual funds over which I have no control in management or decision-making,” Stein wrote in her response. \\nShe added: “Over the years I have taken steps to divest from the worst of these holdings — transferring my checking and savings accounts from Bank of America largely to a credit union, and divesting from GE, Dupont and Merck stocks I had been given decades ago.” \\nWhile “green” mutual funds exist, Stein noted that many of these funds actually invest in fracking and biofuels, making them “not much better than the non-green funds.” She continued: \\n“I have not yet found the mutual funds that represent my goals of advancing the cause of people, planet and peace. Admittedly I have not spent a lot of time researching elusive ethical investments. I prefer using my time fighting for social, economic and ecological transformation, and recycling capitalist money into the fight to do so.” \\nShe also wrote that she inherited “over a half-million dollars” from her parents, and that she’s used her investments and capital to “help build the social and political movements needed for transformative change.“ \\nAli’s article was designed to distract voters from larger issues of corruption within the Clinton campaign and the Democratic Party, she suggested. She elaborated; \\n“He has created an imagined conflict of interest, perhaps to distract from the very real, harmful conflicts of interest in the Clintons’ pay-to-play schemes, back-room fundraising, and quarter-million dollar speeches for the predatory banks, health insurance industry, and fossil fuel tycoons, who have directly benefited from Hillary Clinton’s policy record as Senator and Secretary of State, as well as from Bill Clinton’s actions as President.” \\nIn October, Forbes staff writer Dan Alexander estimated that Bill and Hillary Clinton were worth about $45 million, though he noted that their tax returns and financial disclosure filings left millions in earnings unaccounted for. In February, CNN reported that the Clintons earned $153 million in speaking fees between 2001 and the spring 2015 launch of Hillary Clinton’s latest presidential campaign. \\nUnder Stein’s “Green New Deal” platform , the United States would transition away from foreign wars and fossil fuels by investing heavily in renewable energy. \\nIn addition to its ties to Chelsea Clinton, The Daily Beast’s editor, Michael Weiss, has been criticized for supporting neoconservative U.S. foreign policy, including military intervention and empire building. In August, Richard Silverstein , writing for alternative media analysis site The Unz Review, noted that Weiss is frequently tapped to advocate for war on TV news programs. He wrote: \\n“Weiss, age 36, has been an itinerant freelance journalist and military interventionist gun-for-hire, plying his trade from Washington DC, to London, to the outlying lands of former Russian empire, to the ruins of Syria. \\nWith his role as CNN commentator and senior editor at the Daily Beast, he is a leading light among a new young generation of neoconservative intellectuals.” \\nIn April 2015, Stein told MintPress News that the media deliberately marginalizes third-party voices in order to keep voters from being fully informed about all their choices. \\nShe told Carmen Russell-Sluchansky: \\n“It illustrates what they are terrified of. If people learn that they have an option that reflects what they want, they will vote for it. Half the population doesn’t vote because they don’t like what they see as their options.”\""}, "time": 1742564063.8967779}