{"duration": 0.06063222885131836, "input_args": {"text": "\"Getty - Justin Sullivan The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nEarlier this week, Americans learned that Virginia Governor Terry McAuliffe's Super PAC, Common Good VA, donated $500K to Jill McCabe's senate run. \\nJill just so happens to be the wife of Andrew McCabe — the current Deputy Director of the FBI — who oversaw the investigation into Hillary Clinton's private email server. \\nIf that wasn't enough to give you trust issues, it turns out that Hillary Clinton herself headlined a fundraiser for Common Good VA. The event took place in June of 2015, just one month before the FBI officially launched its investigation into Clinton's email server. \\nAccording to The Daily Mail , the fundraiser that Clinton helped spearhead raised over a million dollars. \\nClinton returned to Common Good in October of 2015 for another speech. That speech conveniently took place just one week before Jill McCabe received two donations, one on October 25th in the sum of $175,000 and the other on October 27th for $125,000. \\nIn addition, one of Common Good's biggest donors, James Bernard , gave the PAC $100,000 just three days before McCabe got her October donations. \\nThere's more. \\nBernard is a big Hillary supporter, too. In fact, he's listed on her site as a “Hillblazer,” someone recognized for raising or contributing $100K or more to the campaign. \\nYet, he's the not the only Hillblazer who donated to Common Good before McCabe was given her biggest campaign contribution. \\nIndependent Journal Review discovered that Louisa Cohlan also donated $100k to Common Good. Her $100k donation took place on Sept 30th of 2015, which was one day before McCabe received a $150,000 from the PAC. \\nCohlan has an interesting tie to the Clintons. In 2014 , Louisa and her husband Johnathan purchased a 4.1 million dollar vacation home that the Clinton family used while Bill was still president. 'Auction planned for home where Clinton family stayed during Skaneateles vacations' http://t.co/dsPxh4qkws #PLANY pic.twitter.com/8tkSMPVl9w \\nOther donors who contributed $100K to the PAC include: \\nSamuel Nappi, who is also a major Clinton Campaign donor and supporter. \\nThe late Mark Weiner , a good friend of Bill Clinton and major fundraiser for the Democrat Party. \\nAnd Robert L. Johnson, America's first African American billionaire who also donated $100K to the Clinton Campaign \\nHowever, the deep ties Hillary's campaign has to Common Good go even deeper than that. \\nThe Daily Mail's investigation revealed the ties Clinton's staff have to the PAC: \\nZuzenak, who oversaw the donations to Jill McCabe, left Common Good VA last May to join the Clinton campaign as its Virginia field director. \\nHe isn't alone in the move. Common Good VA's executive director Michael Halle also joined the Clinton campaign as battleground analytics director in the spring of 2015. \\nThe group's former fundraiser, Amanda McTyre, is now a finance director for Clinton, and staffer Marissa Astor left to become an assistant Clinton campaign manager. \\nAnd the cake-topper, Clinton's current campaign manager, Robby Mook, also worked for the PAC prior to the campaign role he has now. \\nOne thing is for certain: Such revelations will raise new questions about possible foul play and major conflict-of-interest surrounding Hillary's candidacy. Because with it all staring you in the face, everything seems all too convenient to just be a mere coincidence. \""}, "time": 1742561652.8539488}