{"duration": 0.043586015701293945, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / Ken Adachi – Why Trump Will Win Essential Reading “WIPED OFF THE MAP”– The Rumor of the Century By wmw_admin on January 21, 2008 \\nHow President Ahmadinejad’s words were mistranslated and deliberately distorted. So that the term “wiped off the map” has now become synonymous with the Iranian leader’s attitude to Israel – even though he never uttered those words 9/11 and Zion: What Was Israel’s Role? By Nick Kollerstrom on August 31, 2012 \\nWhen Netanyahu said the very next day, ‘This is very good for Israel”, he wasn’t just blurting out something indiscreet, he was publicly congratulating the various agents who had worked so hard The “Six Million” Myth By wmw_admin on April 16, 2011 \\nLong before it became a crime in some countries to question the Holocaust, in fact before it is even supposed to have happened, Zionists were invoking the figure of “Six Million” and talking of a sacrifice for Israel Juri Lina – In the Shadow of Hermes By wmw_admin on July 15, 2011 \\nFixed and a “must see” for all serious students of REAL history. This outstanding video from the author of “Under the Sign of Scorpio” challenges many modern myths. With English subtitles Back to the Future!!! Part 1 By wmw_admin on May 21, 2007 \\nGeological evidence points to an cataclysmic event that almost defies comprehension. The problem is that it may just happen again … and soon too. Affidavit of Richard Tomlinson By wmw_admin on February 14, 2008 \\n“I firmly believe that there exist documents held by the British Secret Intelligence Service (MI6) that would yield important new evidence into the cause and circumstances leading to the death of the Princess of Wales.” Who Really Murdered Holly Wells and Jessica Chapman? By wmw_admin on February 28, 2015 \\nRevelations that a US soldier was the killer would have jeopardised public support for the “War on Terror”. Hence a frame-up was required. A Joe Vialls classic recovered.\""}, "time": 1742563687.455722}