{"duration": 0.20903491973876953, "input_args": {"text": "'WASHINGTON  —   President Trump’s point man on   negotiations is a longtime Trump Organization lawyer with no government or diplomatic experience. His liaison to   leaders is a former   villain with a penchant for résumé inflation. And his Oval Office gatekeeper is a   former New York City cop best known for smacking a protester on the head. Every president sweeps into office with a coterie of friends and   who sometimes have minimal experience in the arcana of the federal government. But few have arrived with a contingent more colorful and controversial than that of Mr. Trump, whose White House is peppered with assistants and advisers whose principal qualification is their long friendship with Mr. Trump and his family. There is Jason Greenblatt, the former Trump Organization lawyer, whose portfolio now includes peace in the West Bank, international trade deals and relations with Cuba. Omarosa Manigault, whose star turn on “The Apprentice” propelled the show’s breakout first season, is now among about two dozen aides with the rank of assistant to the president  —   and one of the few with   privileges for the Oval Office. Most other staff members must go through Keith Schiller, who rose from   security guard at the Trump Organization to its director of security. Mr. Schiller is now the director of Oval Office operations, controlling physical access to a president whose whims and frustrations routinely send aides throughout the building scurrying to deflect, defend and justify. The influence of longtime Trump friends and associates  —   some of them with vague portfolios  —   comes as a leadership void has been created by the Trump administration’s slow pace in filling top jobs in many agencies. It has also added to the confusion of a West Wing already legendary for its power struggles, while bewildering Washington policy hands. “Titles do matter,” said Paul C. Light, a presidential scholar at New York University. “You don’t say: ‘You are my buddy you are my friend you were with me on my television show. I’m going to give you a really great title.’ These are not things to be handed out like candy. ” To help him wrangle Silicon Valley chief executives and modernize United States government technology systems, Mr. Trump has hired Reed Cordish, the scion of a Baltimore real estate dynasty who is married to a close college friend of Ivanka Trump, who set them up. In a statement, Mr. Cordish said his real estate experience had taught him how to successfully meld public and private interests. The president also recently hired Andrew Giuliani, the son of former New York City Mayor Rudolph W. Giuliani and a Trump family friend, to work in the White House Office of Public Liaison and Intergovernmental Affairs. Mr. Giuliani, 31, who made headlines after he sued Duke University for kicking him off the college golf team, previously worked in sales and marketing at a small suburban New York financial firm. Personal relationships with the president often bestow a power exceeding official West Wing job titles. Valerie Jarrett, a businesswoman, former city official in Chicago and longtime friend of the Obamas, was renowned for her unmatched access to President Barack Obama and reach into policy matters far beyond her official portfolio. Sarah Huckabee Sanders, a White House press spokeswoman, said Mr. Trump had recruited highly skilled advisers with refreshingly different backgrounds. “Even though some of the staff doesn’t have government experience it doesn’t mean they are amateurs,” she wrote in an email. “President Trump has promised to change Washington and you can’t do that by putting Washington bureaucrats in charge of everything. ” If Mr. Trump appears more eager than past presidents to bring in longtime associates with limited Washington experience, friends said, it stems partly from his background of four decades at the helm of a closely held family business, with no experience in public service. He has had to assemble a White House team largely from scratch, tapping a party apparatus he believed had tried to deny him the nomination and a Republican policy elite that had largely opposed him. The bulk of his senior White House aides were unknown to him until two years ago. ”Trump doesn’t have a longtime staff of political aides these loyalists fill that vacuum,” said Christopher Ruddy, a friend and chief executive of Newsmax Media, the conservative news site. “He is figuring out who he can depend on. ” Mr. Schiller, 58, a    former narcotics detective, has protected Mr. Trump for 18 years. The head of a Praetorian Guard of private security detectives, Mr. Schiller occupied a Trump Tower office on the same floor as his boss and learned, he said, to anticipate his wishes. A fierce protector of Mr. Trump’s image and interests, he physically removed a reporter from a 2015 news conference on the campaign trail after he repeatedly questioned Mr. Trump without being called on. Five activists later sued Mr. Schiller, the Trump Organization and other Trump security guards, claiming they had been assaulted during a protest outside Trump Tower in September 2015. Mr. Schiller has acknowledged hitting one man but said the man attacked him first. No longer responsible for Mr. Trump’s physical safety, he is now a combination gatekeeper, valet and security blanket  —   a familiar face for a president who detests solitude and whose wife and youngest son have remained at Trump Tower. But Mr. Schiller has not entirely shed his role as Mr. Trump’s enforcer. During a briefing on health care legislation on Friday, he shouted at reporters to clear out of the Roosevelt Room after they tried to question Mr. Trump about continuing controversies. Mr. Greenblatt’s ties to Mr. Trump have translated into more striking levels of power and prestige. A lawyer who helped Mr. Trump negotiate business deals for two decades, Mr. Greenblatt rose to become the Trump Organization’s chief legal officer and executive vice president. Now, as special representative for international negotiations for the White House, Mr. Greenblatt, 49, is charged with negotiating trade agreements and overseeing the   conflict and United   relations. Mr. Trump has called him “brilliant. ” But experts say it is hard to imagine how anyone, no matter how intelligent, could handle three such sensitive and complex assignments without previous experience. “Our sense is that the Trump White House views the foreign policy establishment as pretty feckless. They seem to think that applying a business approach can work better,” said Martin S. Indyk, the executive vice president of the Brookings Institution, who was President Obama’s special envoy to the Middle East. “Not to have experience or knowledge of the issues in dispute, nor any relationship with the Palestinians, will be a challenge,” he said. In announcing his appointment, Mr. Trump said Mr. Greenblatt’s success in negotiating complex transactions and building consensus made him the ideal roving global negotiator. Mr. Greenblatt has told reporters that after so many years at Mr. Trump’s side, “I know how he thinks I know how to get his bidding done. ” In a brief telephone interview, Mr. Greenblatt suggested calling back later when “I’ll have something to actually say that’s meaningful. ” Through the press office, he addressed the trade aspect of his portfolio, saying that working with Mr. Trump taught him how government can impede job creation. Still, C. Fred Bergsten, a senior fellow at the Peterson Institute for International Economics and a member of the president’s Advisory Committee for Trade Policy and Negotiations, said he had never known a White House official “outside of the trade policy network who has been assigned negotiation of trade issues. ” By law, the Office of the United States Trade Representative is charged with negotiating trade deals. Various   secretaries also weigh in on policy. “So what would that leave for this guy?” Mr. Bergsten asked. “It’s very mysterious. ” A sign of Mr. Greenblatt’s expansive role came last month, not long after he traveled to Capitol Hill with Peter Navarro  —   a   economist who is head of Mr. Trump’s newly created National Trade Council  —   to discuss trade policy with staff aides of the Senate Finance Committee. Mr. Greenblatt missed a   session with senators because Prime Minister Benjamin Netanyahu of Israel was visiting the White House that day. “He’s got to negotiate Middle East peace,” Mr. Navarro quipped to the senators, according to a person who spoke on the condition of anonymity. “So he can’t be here today. ” Although Mr. Greenblatt has not been given the title of special envoy to the Middle East, he appears to be acting in that role too. Visiting the region this week, he met Mr. Netanyahu in Israel on Monday and is scheduled to meet the Palestinian president, Mahmoud Abbas. A State Department spokesman said Monday that a senior National Security Council official was accompanying Mr. Greenblatt, but was unsure whether a State Department official had been included. Mr. Greenblatt appears more independent of the State Department than at least some previous envoys he has told others he reports not to Secretary of State Rex W. Tillerson, but to the president’s    Jared Kushner, 36, one of the most senior White House advisers. And where past envoys were foreign policy specialists, Mr. Greenblatt told the Jewish Telegraphic Agency in April that his main sources of information were daily email alerts, material supplied by the American Israel Public Affairs Committee and a weekly Jewish radio program. “There’s just a tremendous amount of literature out there, emails and all that, so I read all of those as often as I can,” he said then. Still, Mr. Greenblatt seemed at that point somewhat taken aback that Mr. Trump had identified him to the news agency as his principal adviser on Israel, telling reporters that Mr. Greenblatt was so passionate that “when he goes on vacation, he goes to Israel. ” “I knew that he was relying on me for certain aspects of Israel, but I didn’t know I was his top adviser,” he said. Ms. Manigault, 43, has no policy experience, a spotty history in her previous federal positions and a résumé that has cast her  —   inaccurately  —   as a university professor and a former top aide to Vice President Al Gore. Yet, to the consternation of the president’s chief of staff, Reince Priebus, and others, Mr. Trump has given her the same title of presidential assistant as Mr. Priebus and other senior aides  —   and regularly includes her in   strategy sessions on the budget and other matters. She said in a January interview in Variety that Mr. Trump “really wanted me to have the freedom to work on many different things. ” In a statement from the White House press office, Ms. Manigault said that “while some people try to tear me down,” she was focused on giving women, minorities and other groups a voice in the White House. Nominally, Ms. Manigault directs the office of communications in the White House’s public liaison office, a midlevel post. She is also a bridge to   groups, including the heads of more than 60 historically black colleges and universities who met with Mr. Trump in the Oval Office last month. She also joined a State Department delegation to the inauguration of Haiti’s president, Jovenel Moïse. She said Mr. Moïse had invited her because of her previous hurricane relief work in the country. “She is the     in the White House, and she has the ear of the president,” said Paris Dennard, a White House director of   outreach under President George W. Bush. “That is a good thing. ” During the presidential campaign, Ms. Manigault cast herself as an insider, saying Mr. Trump has called her “his Valerie Jarrett. ” In an interview published last June in Essence magazine, she said, “I’m the person who pulls him back when he goes too far. ” In her White House post, she has already had a few   reminiscent of her     role on “The Apprentice,” including a much publicized confrontation with a veteran White House reporter. (Mr. Trump also sponsored a   dating show called “The Ultimate Merger” in which she starred.) Ms. Manigault has told others that she earned her way to a White House position. She grew up on welfare in a housing project in Youngstown, Ohio, and lost her father to violence at age 7, but went on to earn a college degree and, at age 24, a job in the office of Vice President Al Gore. But while her ascent is impressive, it is not quite as she has described it. On a 2005 résumé provided by a former employer, she described herself as Mr. Gore’s “senior scheduling and advance coordinator” overseeing all aspects of his schedule. She continues to maintain that description is accurate and that she succeeded at the job. But numerous former staff members in that office said that she was pushed out of an   $   job replying to invitations to Mr. Gore after 13 months, leaving a pile of unanswered correspondence under her desk. “She was the worst hire we ever made,” said Mary Margaret Overbey, Mr. Gore’s former office administrator. Ms. Manigault transferred to a job as deputy associate director of presidential personnel, then eight months later moved to the Commerce Department. In her statement, she said she performed well in that job. But Cheryl Shavers, then the agency’s under secretary for technology administration, disagreed, saying Ms. Manigault “was unqualified and disruptive,” so “I had her removed. ” On her official website and elsewhere,  Ms. Manigault also has identified herself as a professor at Howard University in Washington. But Anthony D. Owens, a university spokesman, said she actually was a “facilitator and presenter. ” A letter from the university that Ms. Manigault provided states that she was an instructor, a temporary position. Ms. Manigault also maintains that the only requirement left for her to complete a doctorate at Howard is to defend her dissertation. But Carolyn M. Byerly, chairwoman of the university’s communications department, said that according to the university’s rules, the   period for her to do that expired more than a decade ago. Ms. Manigault tweeted her support for former Secretary of State Hillary Clinton in 2014, but when Mr. Trump decided to run for president she joined his campaign and defended him vigorously. At an   victory party in November, she gave a television interview during which she warned that Mr. Trump’s campaign was keeping an “enemies” list. Her “Apprentice”  pugnacity notwithstanding, Mr. Trump insists there is a side of her that she keeps well hidden. “Omarosa’s actually a very nice person,” he joked at a Roosevelt Room breakfast that she helped organize last month to celebrate Black History Month. “Nobody knows that. ”'"}, "time": 1742562260.3229542}