{"duration": 0.1020822525024414, "input_args": {"text": "'During one critical exchange at today’s Senate Judiciary Committee hearing on FBI oversight, FBI Director James B. Comey testified about why the intelligence community purportedly believed that Russia favored Donald Trump for U. S. president over Hillary Clinton. [Comey confirmed that the basis for the intelligence community’s assessment that Russian President Vladimir Putin allegedly wanted Trump in office was not because the billionaire was, as Sen. Al Franken claimed without citing any evidence, “ensnared in” Russia’s “web of patronage. ”  Instead, the FBI chief provided two primary reasons for Russia allegedly favoring Trump over Clinton during the 2016 presidential race. One reason, according to Comey, was that Putin “hated” Clinton and would have favored any Republican opponent. The second reason, Comey explained, was that Putin made an assessment that it would be easier to make a deal with a businessman than someone from the political class. Comey’s statements provide a rare window into the intelligence community’s assessments about Russia and Trump. The comments are a far cry from the conspiracies alleging Putin held blackmail information over the billionaire.  In fact, in the exchange, Comey refused to lend any weight to those claims. Those conspiracies were fueled by a controversial   dossier alleging collusion between Russia and Trump’s presidential campaign. The dossier contains wild and unproven claims about Trump and sordid sexual acts, including the   claim that Trump hired prostitutes and had them urinate on a hotel room bed. In today’s exchange, Franken stated that “the FBI, CIA and the NSA all concluded that Russia did in fact interfere in the 2016 election in order to, quote, help   Trump’s election chances when possible by discrediting Secretary Clinton. And the agencies concluded that the Russians had a clear preference for President Trump. ” Franken asked, “What is your assessment of why the Russian government had a clear preference for President Trump?” Comey replied: The intelligence communities’ assessment had a couple of parts with respect to that. One is he wasn’t Hillary Clinton, who Putin hated and wanted to harm in any possible way, and so he was her opponent, so necessarily they supported him. And then also this second notion that the intelligence community assessed that Putin believed he would be more able to make deals, reach agreements with someone with a business background than with someone who’d grown up in more of a government environment. Not satisfied with Comey’s response, Franken further probed whether the intelligence community believed Russia wanted Trump in office because of Trump’s business interests, claiming that Trump “had already been ensnared in their web of patronage. ” Franken asked: OK, well, I’m curious about just how closely Russia followed the Kremlin playbook when it meld (ph) in our democracy, specifically whether the Russians had a preference for President Trump because he had already been ensnared in their web of patronage  —   web of patronage is a quote from the report. Is it possible that in the Russian’s views  —   view Trump’s business interests would make him more amenable to cooperating with them, quote, more disposed to deal with Russia as the I. C. report says? Comey replied, “That was not the basis for the I. C.’s assessment. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Joshua Klein.'"}, "time": 1742561843.8708043}