{"duration": 0.04031944274902344, "input_args": {"text": "'FBI Finds Previously Unseen Hillary Clinton Emails On Weiner’s Laptop Sources earlier described to Fox News\\' Bret Baier as an \"avalanche of evidence...\"   \\nCrushing the hope-filled “it’s just a backup of what they have already seen” narrative of a campaign clutching at straws to defend their candidate, and confirming Fox News Bret Baier’s earlier reporting , CBS News reports that the FBI has found new, non-duplicate emails related to Hilary Clinton’s tenure as Secretary of State on Anthony Weiner’s laptop . \\nSources earlier described to Fox News’ Bret Baier as an “avalanche of evidence…” \\nAnd tonight we are getting further clarification, from US Officials, as to what that evidence consists of (via CBS News) These emails, CBS News’ Andres Triay reports, are not duplicates of emails found on Secretary Clinton’s private server. At this point, however, it remains to be seen whether these emails are significant to the FBI’s investigation into Clinton. It is also not known how many relevant emails there are. \\nThis is a major problem for the surrogates, lawyers, life-long friends, and defenders of the status quo as it destroys the narrative that has been painted suggesting these emails found on Weiner’s laptop are merely backups of what law enforcement officials have already seen (and found no intent in). But what is most intriguing is the question of whether the missing 33,000 ‘personal’ emails ‘deleted’ by Bryan Pagliano in the full knowledge of Hillary Clinton (according to Wikileaks emails), are also on the estranged husband of Clinton right-hand-lady Huma Abedin’s laptop. \\ns Federal law enforcement officials concluded to CBS News tonight : “These emails have never been seen before” \\nFox’s Bret Baier summed up what happens next… “I pressed again and again on this very issue… The investigations will continue, there is a lot of evidence. And barring some obstruction in some way, they believe they will continue to likely an indictment .” \\nThis article originally appeared on ZeroHedge.'"}, "time": 1742562868.4593997}