{"duration": 0.1687767505645752, "input_args": {"text": "'BALMEDIE, Scotland  —     Donald J. Trump has already built a wall  —   not on the border with Mexico, but on the border of his exclusive golf course in northeastern Scotland, blocking the sea view of local residents who refused to sell their homes. And then he sent them the bill. David and Moira Milne had already been threatened with legal action by Mr. Trump’s lawyers, who claimed that a corner of their garage belonged to him, when they came home from work one day to find his staff building a fence around their garden. Two rows of grown trees went up next, blocking the view. Their water and electricity lines were temporarily cut. And then a bill for about $3, 500 arrived in the mail, which, Mr. Milne said, went straight into the trash. “You watch, Mexico won’t pay either,” said Mr. Milne, a health and safety consultant and   novelist, referring to Mr. Trump’s campaign promise to build a “beautiful, impenetrable wall” along the border and force the Mexicans to pay for it. The Milnes now fly a Mexican flag from their hilltop house, a former coast guard station that overlooks the clubhouse of Trump International Golf Links, whenever Mr. Trump visits. So do Susan and John Munro, who also refused to sell and now face an almost    earthen wall built by Mr. Trump’s people on two sides of their property. Michael Forbes, a quarry worker whose home sits on the opposite side of the Trump property, added a second flag  —   “Hillary for President”  —   perhaps because Mr. Trump publicly accused him of living “like a pig” and called him a “disgrace” for not selling his “disgusting” and “slumlike” home. As many Americans are trying to figure out what kind of president they have just elected, the people of Balmedie, a small village outside the once   city of Aberdeen, say they have a pretty good idea. In the 10 years since Mr. Trump first visited, vowing to build “the world’s greatest golf course” on an environmentally protected site featuring    sand dunes, they have seen him lash out at anyone standing in his way. They say they watched him win public support for his golf course with grand promises, then watched him break them one by one. A promised $1. 25 billion investment has shrunk to what his opponents say is at most $50 million. Six thousand jobs have dwindled to 95. Two golf courses to one. An     luxury hotel never materialized, nor did 950   apartments. Instead, an existing manor house was converted into a   boutique hotel. Trump International Golf Links, which opened in 2012, lost $1. 36 million last year, according to public accounts. “If America wants to know what is coming, it should study what happened here. It’s predictive,” said Martin Ford, a local government representative. “I have just seen him do in America, on a grander scale, precisely what he did here. He suckered the people and he suckered the politicians until he got what he wanted, and then he went back on pretty much everything he promised. ” Alex Salmond, a former first minister of Scotland whose government granted Mr. Trump planning permission in 2008, overruling local officials, now concedes the point, saying, “Balmedie got 10 cents on the dollar. ” Sarah Malone, who came to Mr. Trump’s attention after being chosen as the “Face of Aberdeen” for a regional marketing campaign and is now a vice president of Trump International, disputed some of the figures publicly discussed about the project, saying that Mr. Trump invested about $125 million and that the golf course now employed 150 people. “While other golf and leisure projects were shelved due to lack of funds,” she said, “Mr. Trump continued to forge ahead with his plans and has put the region on the global tourism map, and this resort plays a vital role in the economic prosperity of northeast Scotland. ” Mr. Salmond said that Mr. Trump’s impact on business in Scotland might actually be a net negative because his xenophobic comments have appalled the Scottish establishment so much that the Royal  Ancient Golf Club of St. Andrews, known simply as the RA, is unlikely to award his other Scottish golf course, the   Trump Turnberry, another prestigious golf tournament like the Open anytime soon. “I don’t see the RA going back to Turnberry, which is a tragedy in itself,” Mr. Salmond said. “But it’s also a huge economic blow: Several hundred million pounds lost  —   or, in Trump terms, billions. ” Mr. Trump, whose mother emigrated from Scotland to New York in 1930, never showed any great interest in her place of birth. But in 2008, the same year he applied for planning permission in Balmedie, he visited the   cottage on the Isle of Lewis in Western Scotland where she grew up. After emerging from his private jet and handing out copies of his book “How to Get Rich,” he reportedly told locals how Scottish he felt. “I feel very comfortable here,” Mr. Trump said before spending less than two minutes with his cousins in his mother’s homestead, The Guardian reported at the time. Within about three hours his jet had taken off. The visit clearly did not impress Mr. Ford, then the chairman of the planning committee at Aberdeenshire Council, which refused Mr. Trump permission for his golf course on environmental grounds. The ancient dunes, the committee concluded, were a “site of special scientific interest,” or as Mr. Ford put it, “Scotland’s equivalent of the Amazonian rain forest. ” In the end, it was Mr. Salmond, a   golf fanatic whose constituency includes Balmedie, who came to Mr. Trump’s defense, granting permission to proceed in the “national economic interest. ” “Six thousand jobs across Scotland, 1, 400 local and permanent jobs in the northeast of Scotland,” Mr. Salmond said at the time. “That outweighs the environmental concerns. ” Eight years later he contends that Mr. Trump took him in: “If, knowing what I know now, I had the ability to go back, I would rewrite that page,” Mr. Salmond said in an interview. “Most developments balance economic against environmental issues. The problem, and it’s a big problem, is that Donald Trump didn’t do what he promised. ” Mr. Trump later fell out badly with Mr. Salmond (whom he now calls “mad Alex” and a “ ”) first because he refused to evict residents by eminent domain and then over his plans to install offshore wind turbines a couple of miles from Mr. Trump’s golf course. “If Scotland doesn’t stop insane policy of obsolete,   wind turbines, country will be destroyed,” Mr. Trump wrote on Twitter in 2014. At a parliamentary inquiry about renewable energy in 2012, Mr. Trump warned that Scotland would get into “serious trouble” if it continued to build wind turbines. Asked what evidence he had, he said, “I am the evidence. ” He then made a formal complaint about a Green Party politician who had made fun of the statement with a still from the Monty Python film “The Life of Brian,” accusing him of blasphemy and threatening to take him to court. The wind turbines, whose foundations are expected to be laid next year, still seem to rankle Mr. Trump. In a meeting right after his election victory, Mr. Trump urged Nigel Farage, the leader of the populist U. K. Independence Party  —   which has failed to win a single seat in Scotland  —   to fight offshore wind farms in Scotland on his behalf. “To actually believe that having a conversation with Nigel Farage and his henchmen about wind energy is going to change Scottish government policy is on the outer limits of possibility,” Mr. Salmond said. As a presidential candidate who was caught on a hot microphone bragging  about sexually assaulting women, Mr. Trump found little sympathy among Scotland’s political leaders, most of whom happen to be women. Nicola Sturgeon, Mr. Salmond’s successor, has called Mr. Trump’s comments “deeply abhorrent” and stripped Mr. Trump of his membership in the Global Scot business network. Kezia Dugdale, who runs the Scottish Labour Party, commented after Mr. Trump’s election that a “misogynist” would move into the White House, while Ruth Davidson, the leader of the Scottish Conservatives, described him as a “  guts, a   fool. ” And in Aberdeen, where 10 years ago public opinion was overwhelmingly in favor of Mr. Trump and his golf course, Robert Gordon University annulled Mr. Trump’s honorary degree after his comments about barring Muslims from entering the United States. Some local residents remain fiercely loyal to him. Stewart Spence, owner of the exclusive Marcliffe hotel, has a photo of Mr. Trump and himself on display in the lobby as well as his own honorary membership of the Balmedie golf course. “How many tourists have the dunes brought in? Zero,” he said. “What he has done is build a beautiful golf course and made the northeast of Scotland an amazing destination. ” As for the American election campaign, Mr. Spence said, “He has done a fantastic selling job to the American people. ” Until six years ago, the Munros could look out their kitchen window and see 10 miles across open land all the way to the Girdleness lighthouse on the other side of Aberdeen. Now they look out onto the nearly    earthen berm built by Mr. Trump’s people. “He has a thing about walls, that Mr. Trump,” Ms. Munro said. “I hope America has a better experience than Balmedie. ”'"}, "time": 1742561931.7640164}