{"duration": 1.200324296951294, "input_args": {"text": "'Home / Foreign Affairs / 5 Shocking Facts About You That Anyone Can Find Online 5 Shocking Facts About You That Anyone Can Find Online The Free Thought Project October 29, 2016 Comments Off on 5 Shocking Facts About You That Anyone Can Find Online – sponsored content by \\nIf you’re an American citizen, then the government has a personal file on you. Think of it like your permanent record from your grade school days. These records contain highly sensitive personal information about you such as where you live, your contact info, your relatives and associates, arrest records, and even speeding tickets. But what many people don’t know, is that this information is all considered “public record,”—and anyone can access it. \\nNow, a controversial new site is taking things a step further by gathering these records together and posting them online, so anyone with a computer and Internet access can see them. \\nYou’re probably wondering what exactly is in your public file that other people can access. Brace yourself because this information goes A LOT deeper than you’d think. \\nHere are 5 shocking personal details about you that are online right now that anyone can access through just a quick online background check . 1) Personal Information \\nOne of the reasons these online background check sites are so popular, is because they can uncover a shocking amount of personal information on just about anyone. Here are just some examples of what might come up. Your full name A complete history of where you’ve lived, including past and current addresses ( it even has pictures of your house!! and detailed info about your neighborhood) An estimate of your home’s value Your birthdate Your astrological sign Your relatives and associates Your close friends (this can also include current and former boyfriends and girlfriends, anyone who you’ve had close ties to can appear on this list) \\nBut that’s not all. This site could even pull up contact info like your phone number. If someone were trying to hide from you, it’d be impossible once you looked them up on this site. It’s actually a little scary to think about how much of your personal data is out there on the Internet for almost anyone to find. \\nClick here to see how exposed you are. 2) Online Activity And Accounts \\nBelieve it or not, personal information is just one section of a report—there’s a lot more that comes after it. This site scours the deep web to uncover details about your online activity. It can find profiles you’ve made on social media platforms, pull up accounts you’ve created on dating sites, and more. Your usernames, photos and videos of you, and more could all be uncovered in just seconds. \\nIn addition to your online activity, this website could reveal things on the Internet you don’t even remember posting – like those embarrassing photos from high school you forgot about. Has someone tagged you in a photo or posted a video of you somewhere without letting you know? Don’t you want to see what’s out there about you? I know I would. \\nProtect your online reputation today , and see what’s on the Internet about you! 3) Driving Tickets \\nEver been issued a speeding ticket? Or maybe you were caught running a red light? Hardly anyone has a squeaky clean driving record. (I know I’ve definitely been busted for doing a California stop a few times.) Well, those traffic tickets you’ve racked up over the years could be part of your permanent, public file. Anyone who runs an online background check on you might be able to find them! \\nAre your traffic tickets posted online? Click here to find out. 4) Criminal Records \\nIf you’ve ever been arrested, charged, or convicted of a crime, those records are all part of your public file, too. Even if it was just a minor offense, like jaywalking or violating an open container law it could show up if someone looked you up. Any sort of criminal history you might have, from a DUI, to misdemeanors, to felonies could be in your background report for ANYONE to see. \\nWould you pass a background check? Find out here . 5) Professional Licenses \\nCertain types of professional licenses issued to you by the government are a matter of public record. Specifically, FAA and DEA licenses can also be included in a background report. \\nJust imagine how much of your personal information could be posted online for other people to see. Knowing what’s in your online background report is crucial to protecting yourself, your family, and your reputation in this day and age. \\nYou need to know what your background check will reveal. You’ll never know until you do a search. \\nDon’t ignore your online reputation any longer. I urge you to take the next 5 minutes and do a search on yourself to find out once and for all what your report says about you. \\nDo a search now to find out what public records will reveal about you. Other people may have already looked you up. Don’t you want to know what they found? Find out today! \\nTo start your search, click here . Share'"}, "time": 1742563659.0632443}