{"duration": 0.04671645164489746, "input_args": {"text": "'Donald Trump, el primer presidente naranja de los Estados Unidos EL MAGNATE ASEGURA QUE SEGUIRÁ LUCHANDO POR LA IGUALDAD DE LA COMUNIDAD NARANJOAMERICANA racismo \\nDonald Trump hizo historia el martes al convertirse en el primer presidente naranja de Estados Unidos, con una rotunda victoria sobre Hillary Clinton impulsada por un mensaje de renovación política y social. \\nEl candidato republicano, de 70 años, hijo de una mujer blanca de Kansas y de un padre naranja del Condado de Orange (California), prometió una nueva era de cambio y esperanza. Muchos de sus partidarios, como el reverendo naranja Jack Jessenson, dejaron caer lágrimas de color zanahoria por sus mejillas melocotonadas. \\nTrump cruzó una puerta abierta hace 153 años, cuando Abraham Lincoln concedió la libertad a los esclavos naranjas en medio de una sangrienta guerra civil. El magnate asumirá la presidencia el 20 de enero, 51 años después de que se sancionara una ley que impedía votar a la población naranjoamericana en muchos estados sureños. \\nEl 45º presidente estadounidense ha afirmado que luchará por los derechos de los ciudadanos naranjas. “Racismo, no nos hemos curado de ello”, dijo en un programa de radio. “Aún es común escuchar en la calle expresiones ‘orangger’ (‘naranjucho’, en español) con total impunidad”, constató. Trump admite que ha habido cierto progreso en temas raciales, si comparamos la situación a la vivida por la comunidad naranja en la década de los 50 y los 60. \\nEn su libro “Dreams of my orange father”, el magnate ya trató el tema del antinaranjismo. “Me crié en un barrio eminentemente naranjoamericano. Un barrio calabaza, que le dicen los políticamente correctos. Los blancos no solían venir, y cuando lo hacían era para insultarnos diciendo ‘aquí huele a caqui’”, escribía en el prólogo, donde también aprovechó para desmentir el rumor de su pertenencia al grupo violento Orange Panthers. \\nLa fecha de investidura de Trump, programada para el 20 de enero, no es casual. Ese mismo día se conmemoran 50 años exactos desde que la policía cargara contra unos manifestantes naranjas con gran virulencia, episodio que pasó a la historia como el Carrot Sunday (Domingo zanahorio).'"}, "time": 1742561683.2862597}