{"duration": 0.2519106864929199, "input_args": {"text": "'Print Email http://humansarefree.com/2016/11/flu-shot-hoax-admitted-no-controlled.html The flu shot is a fraud. But it’s a fraud that’s so deeply embedded in the delusional pro-vaccine culture of the pharma-controlled medical industry that even well-meaning doctors and pharmacists (who are otherwise very intelligent) fail to realize flu shots don’t work. In fact, flu shot vaccine inserts openly admit there is no scientific evidence demonstrating flu shots work . See the vaccine insert photos below for proof.This is probably why people who receive the flu shot almost never receive the insert sheet. It’s not handed out by doctors and pharmacists because they don’t want people to realize the extent of the pseudoscience behind the flu shot scam.It’s so much easier to demand blind obedience while screaming “SCIENCE!” than to actually allow people to read the science and realize the science conclusively states there is “… no decrease in influenza disease after vaccination.”In fact, most people who have taken flu shots aren’t even aware that an insert sheet exists at all.Ever wonder what it says?NOTE: Every photo in this article is 100% factual and true. Ask your pharmacist for a vaccine insert sheet to see one of these for yourself. Insert sheet acquired for GlaxoSmithKline’s FLULAVAL flu shot In the interests of public safety and journalistic inquiry — I’m a multiple award-winning journalist, after all — I acquired a FLULAVAL flu shot vial and insert sheet for the 2014 flu shot, and I read through the microscopic insert text using a magnifier.Here’s a photo of the FLULAVAL vial and box in which the insert was found. Note that this photo clearly shows the flu shot label admitting the shot contains “thimerosal as a preservative.” Thimerosal is made from toxic mercury. But there’s much more in this insert… “No decrease in influenza disease” after vaccination Read the language in the following photo of the FLULAVAL vaccine insert very carefully.It says:FLULAVAL is a vaccine indicated for active immunization against influenza disease… but doesn’t ever claim the vaccine actually works.In the very next bullet point, the vaccine insert admits: …there have been no controlled trials adequately demonstrating a decrease in influenza disease after vaccination with FLULAVAL. In other words, GlaxoSmithKline confirms there is no evidence to back this flu shot .Got that? Amazing, isn’t it? Especially given how many people scream about flu shots being “SCIENTIFIC!” and backed by “EVIDENCE!”It turns out that if you want protection from the flu, you might get the very same results by rubbing a lucky rabbit’s foot or hopping around your living room in some sort of “anti-flu dance.”All of these — the flu shot, the rabbit’s foot and the anti-flu dance — are backed by the same amount of scientific evidence. “Safety and effectiveness not established” There’s even more. If you keep reading the FLULAVAL insert, it says in black and white text, “Safety and effectiveness of FLULAVAL in pediatric patients have not been established.”The same insert also says, “FLULAVAL has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.”As you can also see, this same insert also explains that when you’re being injected with a flu shot, you’re also being injected with mercury, formaldehyde and other toxic ingredients: “Thimerosal, a mercury derivative, is added as a preservative. Each … dose contains 50 mcg thimerosal. Each dose may also contain residual amounts of ovalbumin, formaldehyde, and sodium deoxycholate from the manufacturing process.” Toxic side effects include facial paralysis and more If you keep reading the FLULAVAL vaccine insert, you’ll eventually get to a section called “Postmarketing Experience.”This subhead means here are all the side effects reported by actual users after being vaccinated . In other words, these are the results of turning the human population into vaccine guinea pigs.Just some of the adverse effects experienced after flu shot vaccines include:• Eye pain and chest pain• Arthritis• Dizziness, tremors and losing consciousness (syncope)• Convulsions and seizures• Cranial nerve paralysis or limb paralysis• Swelling of the brain• Partial facial paralysis… and much more. See the text yourself:Here’s a more complete list of some of the adverse effects typically listed on flu shot vaccine insert sheets:Blood and Lymphatic System Disorders: Lymphadenopathy.Eye Disorders: Eye pain, photophobia.Gastrointestinal Disorders: Dysphagia.General Disorders and Administration Site Conditions: Chest pain, injection site inflammation, asthenia, injection site rash, abnormal gait, injection site bruising, injection site sterile abscess.Immune System Disorders: Allergic reactions including anaphylaxis, angioedema.Infections and Infestations: Rhinitis, laryngitis, cellulitis.Musculoskeletal and Connective Tissue Disorders: Muscle weakness, arthritis.Nervous System Disorders: Dizziness, paresthesia, hypoesthesia, hypokinesia, tremor, somnolence, syncope, Guillain-Barre syndrome, convulsions/seizures, facial or cranial nerve paralysis, encephalopathy, limb paralysis.Psychiatric Disorders: Insomnia.Respiratory, Thoracic, and Mediastinal Disorders: Dyspnea, dysphonia, bronchospasm, throat tightness.Skin and Subcutaneous Tissue Disorders: Urticaria, pruritus, sweating.Vascular Disorders: Flushing, pallor.“Do not administer FLULAVAL to anyone…”If you go on to read this entire insert, which is quite lengthy and very difficult for any normal person to read, here’s what else it says:“Safety and effectiveness of Flulaval have not been established in pregnant women, nursing mothers or children.”“Do not administer Flulaval to anyone… following previous administration of any influenza vaccine.”You can confirm all this for yourself by going to any pharmacy and asking for a flu shot insert sheet . While the language printed on the sheet will vary from one manufacturer to another, they all reveal fascinating things like: Flu shot ingredients Documented flu shot side effects (which always include neurological problems such as seizures) Warnings not to give them to children or pregnant women (in most cases) “No adequate and well controlled studies in pregnant women” One of the FLULAVAL vaccine insert sheets I looked at said the following: “There are, however, no adequate and well controlled studies in pregnant women. Because animal reproduction studies are not always predictive of human response, FLULAVAL should be given to a pregnant woman only if clearly needed.” What this paragraph says is, essentially, “We have no evidence this is safe in pregnant women, but it’s okay to inject pregnant women with this anyway, as long as they need it.”And of course the pseudoscience mainstream media is happy to loudly and repeatedly proclaim that all pregnant women “need” the flu shot, a claim founded in nothing but wishy washy junk science and corporate profit motives. So doctors, who obediently inject almost anything into pregnant women as long as Big Pharma tells them it’s okay, are happy to keep poisoning women’s bodies with mercury and formaldehyde even though, as the insert openly admits: “There are, however, no adequate and well controlled studies in pregnant women.” How to transform a quack vaccine into “evidence-based medicine” Keep in mind these vaccine inserts are directly telling you the vaccine isn’t backed by clinical evidence of safety or efficacy . It’s practically claiming, “This vaccine is based on voodoo. Take it at your own risk…”You may be wondering, then, if a vaccine openly admits it doesn’t work and hasn’t been adequantely tested and contains toxic chemicals, how exactly does this vaccine get sold to the public as “evidence-based medicine” that’s loudly proclaimed to be good for children, infants, pregnant women, senior citizens and everyone else?It’s simple: THEY LIE.A medical lie repeated often enough by people in high enough positions of apparent authority will be obediently accepted by the gullible masses. This devious art of lying to the public about vaccines is deeply embedded in the culture thanks to the incessant pro-vaccine propaganda of the mainstream media which asks no question at all about vaccine safety and refuses to discuss vaccine ingredients or neurological side effects, even when they’re printed directly on the vaccine insert.Most people assume something like:“Well, if it wasn’t proven safe and effective, it wouldn’t be allowed on the market, because the FDA protects us all, right?”And so they line up their kids to be injected with mercury and formaldehyde and sometimes even stealth cancer viruses which have contaminated vaccines throughout history .Some of those kids have seizures, go into comas or suffer severe neurological damage that turns them into autistic children. CDC scientist openly admits to vaccine-autism cover-up This was openly admitted by the CDC’s own top scientist in one of the most aggressively censored medical stories of 2014, where Dr. William Thompson publicly wrote the following admission:“My name is William Thompson. I am a Senior Scientist with the Centers for Disease Control and Prevention, where I have worked since 1998. I regret that my coauthors and I omitted statistically significant information in our 2004 article published in the journal Pediatrics. “The omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased risk for autism. Decisions were made regarding which findings to report after the data were collected, and I believe that the final study protocol was not followed.”This story was wholly and dutifully blacked out by the entire national press, by the way. The fact that the CDC committed scientific fraud related to links between vaccines and autism is something they never want you to learn.And yet it’s all right in front of you if you’re willing to read the vaccine insert, read the CDC scientist’s own confession and learn a little about the toxicity of mercury. Chemical-laced vaccine advocates clearly desire to bring harm to children It’s clear from all this that the vaccine industry really does want to harm and destroy children. If vaccine advocates didn’t want to harm children, they would call for the immediate removal of mercury, formaldehyde and other toxic chemicals from all vaccines.If they wanted, they could advocate “clean vaccines” which contain no toxic chemicals. But they consciously choose not to do this. They really do want the toxic chemicals to be injected into pregnant women and children , and that’s exactly why they demand blind vaccine obedience from the masses. No questions allowed. No rational thinking tolerated. No skepticism of vaccines is “politically correct.”In fact, the CDC openly admits that mercury, formaldehyde, MSG, aluminum, antibiotics and other chemicals are still used in vaccines . Here’s a screen shot from the CDC website’s vaccine additives page which openly states this:The same CDC that committed scientific fraud and covered up links between vaccines and autism predictably claims all these toxic chemicals are perfectly safe to be injected into children.That’s how you know they’re truly evil: When they knowingly commit fraud in order to continue the practice of poisoning human bodies with toxic chemicals, that’s an admission that they actively desire to harm health and destroy lives.When I once confronted a vaccine pusher with the fact that flu shots contain mercury and that if the same concentration of mercury was found in a vitamin it would be banned by the FDA , that person told me, “Mercury in vitamins makes them dangerous. But mercury in vaccines makes them work better.”That’s the kind of insane logic you’ll frequently encounter among vaccine pushers / poisoners. For those who reject pseudoscience vaccines, the state points a gun in your face When people come to their senses and realize they probably shouldn’t inject themselves and their children with mercury, formaldehyde, aluminum and other toxic vaccine ingredients, they are quickly met with a belligerent medical police state that shoves guns in their faces and demands they comply.As reported by Police State USA [4]:“A state bureaucracy is threatening a mother with removal of an infant unless her entire family subjects themselves to flu shots. “The Washington Department of Social and Health Services (DSHS) is giving the Tacoma family until February to comply with the mandated regimen of influenza vaccines — imposed on every member of the family — or else they will lose their youngest child, a 2-week-old foster infant that was born on Christmas.”The medical police state, you see, is threatening to carry out yet another medical kidnapping of a foster infant if the entire family doesn’t agree to be obediently injected with toxic chemicals. Click here to read a recent list of medical kidnappings happening in America, many over vaccine issues.Yes, this is all happening in America… even though it sounds like a story out of a North Korea gulag. Make sure you understand this has nothing whatsoever to do with protecting the foster child. This is about a militant health agency “teaching that woman a lesson” and demanding she sacrifice the health of her entire family as a sign of loyalty.The Aztecs used to demand families give up their firstborn sons to have their hearts cut out in ritualistic sacrifices to appease their gods. Today, modern medicine follows the same pattern, demanding families sacrifice their health in order to appease the pharma-corrupted bureaucrats, many of whom are pedophiles and child rapists to begin with. Just recently, a top U.S. Health and Human Services executive was sentenced to 25 years in prison after he “accessed child pornography, solicited child pornography from other members, and exchanged private messages with other members in which he expressed an interest in the violent rape and murder of children,” reports Mediaite.com .As Mac Slavo explains on SHTFplan.com : “Whether you agree with yearly flu vaccines or not, the following report from Tacoma, Washington should scare the hell out of you because if the government moves forward with their threats then every child in America will effectively become a ward of the state. ” A quick summary of the flu shot fraud • Flu shot vaccine inserts openly admit there is no evidence that flu shots work.• Flu shots still contain toxic mercury, a potent neurotoxin.• Flu shot vaccine inserts openly admit flu shots caused seizures, paralysis and other neurological disorders, which is not surprising given that they still contain mercury, a potent neurotoxin.• Vaccine propaganda is so mindless and aggressive that anyone who merely cites the printed vaccine insert is immediately condemned as “anti-science,” even though the science is perfectly clear that many vaccines are backed by no scientific evidence at all.• The CDC has altered vaccine safety data in a conspiracy to hide truthful facts about vaccine risks from the public.• Informed parents who consciously choose to avoid having their children injected with medically useless (but dangerous) vaccines are increasingly criminalized while their children are subjected to medical kidnapping .• For publishing truthful photos of printed vaccine inserts, Natural News is subjected to heavy censorship in an attempt to make sure the public never learns this information. By Mike Adams Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562768.0562904}