{"duration": 0.09054732322692871, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. The police chief in Charlotte, N. C. said a video of the fatal shooting that set off two nights of violent protests did not offer “absolute, definitive visual evidence” that the victim, Keith Scott, was pointing a gun. A lawyer for the dead man’s family said the video showed his hands were by his side when he was shot. In another fatal shooting that has prompted anger over race and policing, Officer Betty Shelby, who killed Terence Crutcher in Tulsa, Okla. was charged with manslaughter. _____ 2. Donald Trump, set to speak about fracking in Philadelphia, opened with comments about the unrest in Charlotte and, more broadly, about violence in largely black urban areas. “Drugs are a very, very big factor in what you’re watching on television at night,” he said. Hillary Clinton, who has called the recent spate of police killings of black suspects “unbearable,” had a day off from campaign events. But she did appear on the mock celebrity interview show “Between Two Ferns,” answering the oblivious questions of Zach Galifianakis, who asked how fast she typed as secretary, and how President Obama liked his coffee. _____ 3. Yahoo reported a vast email breach by an unnamed “  actor” dating to 2014. Some 500 million accounts were hacked  —   a number larger than the population of the United States  —   yielding names, email addresses, telephone numbers, birth dates, passwords, and in some cases security questions. Yahoo said it had begun notifying potentially affected users. Here’s what you can do to protect yourself. _____ 4. The father of the man accused of carrying out bombings last weekend in New York and New Jersey spoke to our reporters, clarifying the warnings he gave to federal agents about his son two years ago. He said he explicitly warned agents that Ahmad Rahami was interested in terrorist organizations like Al Qaeda and fascinated by jihadist music, poetry and videos. “In two months, the F. B. I. came back to me and said he’s clean,” the father said. “They didn’t find anything on him. But they didn’t interview him. ” _____ 5. President Obama honored some of the country’s top filmmakers, artists and musicians at the White House, including Mel Brooks, above, Audra McDonald, Wynton Marsalis and 21 other luminaries. “We’ve got Terry Gross,” Mr. Obama said, referring to the “Fresh Air” host, “and a whole bunch of people who Terry Gross has interviewed. ” The MacArthur Foundation also awarded its “genius” grants. Among the 23 recipients of the fellowship  —   $625, 000 over five years  —   are a few relatively   figures, like the poet Claudia Rankine. Many appeared to be hard to categorize, working across existing genres, disciplines and institutions. _____ 6. “After what happened I had no short or long term plans, I just figured out how to get my life back together, to regain trust and hope that this world wasn’t a horrible place. ” That was the    woman above, one of 11 women who were brutally sexually assaulted during protests in Mexico State a decade ago. International human rights officials are demanding an investigation, which would sweep in President Enrique Peña Nieto, who ordered the crackdown as governor of the state. _____ 7. Scientists are warning of a surprisingly invasive species you may be familiar with  —   from your aquarium. Improperly released pet goldfish have spawned, swollen to the size of footballs, migrated, interbred with other species and become an ecological nightmare in places ranging from Australia to Nevada. So, the experts say, if you’re tired of your goldfish, give it back to the store or to a friend, or kill it in an ice slurry. Don’t toss it in a stream or flush it. _____ 8. Baseball fans  —   and regulators  —   want to know: What’s with all the home runs? A surprisingly long list of players are at or near 30 for the season, including previously unspectacular hitters like shortstop Brad Miller of the Tampa Bay Rays, above. Possible explanations: “juiced” balls, with   interiors, a rush of doping  —   or maybe just the game’s turn toward raw power for both pitchers and hitters. _____ 9. No less a reviewer than the novelist Richard Ford (“The Sportswriter,” “Independence Day”) offers high praise for Bruce Springsteen’s memoir, which comes out next Tuesday. Writing as one of “nine jillion” fans, he says “Born to Run” helps, as much as anything can, explain how the singer went from a New Jersey backwater to going “in front of 90, 000 people for   years in 40 different countries. ” He also says: “You’d think a guy who wrote “Spanish Johnny drove in from the underworld last night’ ’u2009With bruised arms and broken rhythm and a   old Buick . ’u2008. ’u2008. ” could navigate his way around a complete and creditable American sentence. And you’d be right. ” _____ 10. Nine arrests in a corruption case dealt a serious blow to the inner circle of New York’s governor, Andrew Cuomo. A former aide, Joseph Percoco, above with Mr. Cuomo, was among those accused of bribery, extortion and fraud linked to “hundreds of millions of dollars in state contracts and other official state benefits” in economic development programs. The case, the latest in a string of corruption cases plaguing Albany and Mr. Cuomo’s associates, spared the governor himself. _____ 11. Finally, it’s the autumnal equinox in the Northern Hemisphere, so happy fall. And if you’re feeling a little less than fulfilled, here’s a lesson from one of Stanford University’s most popular courses, Designing Your Life. Try using the same approach that goes into making successful products: prototyping, building teams and bias to action (meaning rapid decision making). “The question of ‘What do I do with the rest of my one wild and wonderful life?’ is on everyone’s mind,” said one of the course’s two professors. _____ Martin Tsai contributed reporting.  _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742564171.9605358}