{"duration": 0.10709571838378906, "input_args": {"text": "'Zoey, the wonder dog makes a political statement – an exclusive UnReal Times report Posted on Tweet \\nA cousin of mine, an ardent dog lover who dotes on his pet female golden retriever Zoey, has recently been observing some unusual behavioural changes in his pet. Normally of placid and amiable temperament, like most retrievers, she was quite happy to be fed regularly, thrown the odd bone and tickled under the tummy every now and then. Even visits to the vet was like a jolly excursion for her. “But over the last month or so, while we were watching television after dinner, she would start behaving strangely”, observed my cousin, restlessly tugging at his forelock. \\nAs a regular contributor to UnReal Times (URT), my columnist’s bloodhound instincts took over, as I clearly saw the beginnings of a major newsbreak, outside the world of sordid politics, boringly one sided cricket and just plain boring Bollywood. At least, that’s what I figured, when I decided to probe my cousin further on Zoey’s curious antics. Since this relative was reluctant to give out his real name to URT’s massive readership, we’ll just call him VK. Here he is, being interviewed by your intrepid reporter. \\nURT – “Hi VK, tell us more about Zoey and the television. What gives?” \\nVK – “Well it’s like this. When we put the TV on, the first thing Zoey usually does is lie down and go to sleep. Unfailingly. But in recent times, she has been sitting bolt upright and making a variety of different sounds. I thought of calling my vet, until my wife shushed me and said listen carefully and watch Zoey closely”. \\nURT – “And then what happened? The suspense is killing me”. \\nVK – “Patience, brother. All will be revealed. It took us a while to detect a pattern, but then things started unraveling. Whenever the Prime Minister came on screen and spoke, Zoey would wag her tail vigorously, joyously yelping the while, leap on to our bed, give us a lick or two and, for all the world, look like she had been offered a huge leg of mutton”. \\nURT – “Wow, that is really weird. What else?” \\nVK – “When Arvind Kejriwal appeared on TV, Zoey would go all still, crouch like a tiger advancing on its prey, and emit a fearful, elongated growl, baring her fangs, prior to barking her head off. And wouldn’t stop barking till Kejriwal was off screen. And when the PM appeared again, it was back to tail wagging and whimpering”. \\nURT – “This is scary, man. Is Zoey psychic?” \\nVK – “Wait, you haven’t heard it all. The same hostile body language Zoey exhibited with Kejriwal, she pretty much repeated with RaGa. I tried telling her RaGa is such a sweet, baby faced young chap, but no. It was all a-barking and a-growling. Kejri all over again. Ditto with Akhilesh Yadav and his dad, Sonia Gandhi and Mamata Banerjee. Even the image that went viral, supposedly of one of our ailing political leaders, and turned out to be that of an inert patient from Lima in Peru lying in a coma in her hospital bed for over seven years, could not soothe our Zoey”. \\nURT – “This is too good, yaar. And….?” \\nVK – “The moment either Rajnath Singh, Arun Jaitley or Sambit Patra came on screen, she was back to her happy jumping up and down”. \\nURT – “ Elementary, my dear VK. This can mean only one thing. Our Zoey is a confirmed BJP bhakt. Didn’t you tell me last time that she loves mutton, chicken, pork, fish etc., but shies away from beef?” \\nVK – “Did I? Now you’re being ridiculous.” \\nWhile we were having this discussion in VK’s terrace garden, we heard a blood curdling series of high pitched whinnying and manic barking coming from the TV room. \\nVK – ”Looks like Zoe’s gone nuts. Wonder who’s on TV now?” \\nWe both rushed towards the TV room. To our surprise, we found Zoey cowering under the couch, whimpering in terror, while surprisingly the barking still continued. We turned around looking for the source and found Arnab Goswami on screen shaking his fists and fulminating against those criticizing the Government for surgically striking the enemy. I looked at VK, he looked at me. \\nURT – “Better switch off the TV.” \\nVK – “Yeah. Good idea.” Tweet About Suresh Subrahmanyan \\nBangalore based brand communications consultant, occasional columnist, deeply interested in western classical and Carnatic music and 70s pop and rock, follow cricket and tennis, and an avid fan of P.G. Wodehouse.'"}, "time": 1742562160.4032702}