{"duration": 1.2817611694335938, "input_args": {"text": "'License DMCA \\nI am now convinced that the Oligarchy that rules America intends to steal the presidential election. In the past, the oligarchs have not cared which candidate won as the oligarchs owned both. But they do not own Trump. \\nMost likely you are unaware of what Trump is telling people as the media does not report it. A person who speaks like this is not endeared to the oligarchs. \\nWho are the oligarchs? -- Wall Street and the mega-banks too big to fail and their agent the Federal Reserve, a federal agency that put five banks ahead of millions of troubled American homeowners who the federal reserve allowed to be flushed down the toilet. In order to save the mega-banks\\' balance sheets from their irresponsible behavior, the Fed has denied retirees any interest income on their savings for eight years, forcing the elderly to draw down their savings, leaving their heirs, who have been displaced from employment by corporate jobs offshoring, penniless.\\n-- The military/security complex which has spent trillions of our taxpayer dollars on 15 years of gratuitous wars based entirely on lies in order to enrich themselves and their power. \\n-- The neoconservatives whose crazed ideology of US world hegemony thrusts the American people into military conflict with Russia and China. - Advertisement - \\n-- The US global corporations that sent American jobs to China and India and elsewhere in order to enrich the One Percent with higher profits from lower labor costs. \\n-- Agribusiness (Monsanto et.al.), corporations that poison the soil, the water, the oceans, and our food with their GMOs, hebicides, pesticides, and chemical fertilizers, while killing the bees that pollinate the crops. \\n-- The extractive industries -- energy, mining, fracking, and timber -- that maximize their profits by destroying the environment and the water supply. \\n-- The Israel Lobby that controls US Middle East policy and is committing genocide against the Palestinians just as the US committed genocide against native Americans. Israel is using the US to eliminate sovereign countries that stand in Israel\\'s way. \\nWhat convinces me that the Oligarchy intends to steal the election is the vast difference between the presstitutes\\' reporting and the facts on the ground. - Advertisement - \\nAccording to the presstitutes, Hillary is so far ahead that there is no point in Trump supporters bothering to vote. Hillary has won the election before the vote. Hillary has been declared a 93% sure winner. \\nI am yet to see one Hillary yard sign, but Trump signs are everywhere. Reports I receive are that Hillary\\'s public appearances are unattended but Trump\\'s are so heavily attended that people have to be turned away. This is a report from a woman in Florida: \\n\"Trump has pulled huge numbers all over FL while campaigning here this week. I only see Trump signs and stickers in my wide travels. I dined at a Mexican restaurant last night. Two women my age sitting behind me were talking about how they had tried to see Trump when he came to Tallahassee. They left work early, arriving at the venue at 4:00 for a 6:00 rally. The place was already over capacity so they were turned away. It turned out that there were so many people there by 2:00 that the doors had to be opened to them. The women said that the crowds present were a mix of races and ages.\" \\nI know the person who gave me this report and have no doubt whatsoever as to its veracity.'"}, "time": 1742563981.3896036}