{"duration": 0.06135892868041992, "input_args": {"text": "'\\nDean James AMERICA’S FREEDOM FIGHTERS – \\nLast week, the Pentagon issued a Defense Department directive that allows “Department of Defense (D0D) personnel to carry firearms and employ deadly force while performing official duties.” \\nThe Defense Department has been working on changing the “gun-free” zones on domestic military basis for several years in light of the deadly shootings at military sites in recent years. \\nMilitary.com reports that the directive “also provides detailed guidance to the services for permitting soldiers, sailors, airmen, Marines and Coast Guard personnel to carry privately owned firearms on DoD property.” It authorizes “commanders, 05 and above…[to] grant permission to DoD personnel requesting to carry a privately owned firearm (concealed or open carry) on DoD property for a personal protection purpose not related to performance of an official duty or status.” \\nThe directive also makes clear that DoD will consider further changes to grant “[standard] authorizations for other DoD personnel, who are trained in the scaled use of force or who have been previously qualified to use a government-issued firearm, to carry a firearm in the performance of official duties on DoD property.” This would allow DoD with certain combat training to carry firearms without going through the additional step of making application with a commander. \\nKim Smith at Conservative Tribune notes that the policy was a response to an NRA-backed provision in the 2015 National Defense Authorization Act that required the Defense Department to allow more service members to carry firearms on base. \\n“It is a good first step in that it recognizes personal protection is a valid issue for service members, but there are many roadblocks in the way of making that option available,” NRA spokeswoman Jennifer Baker told the Washington Free Beacon . \\nThose wishing to apply for permission to carry a firearm must be at least 21 years old and meet all federal, state and local laws, the directive said. \\nIt would appear that the Pentagon saw no problems with implementing a policy for which President-elect Donald Trump has expressed support. \\nPresident-elect Donald Trump ran on removing gun-free zones from military bases. On July 9, 2015, Breitbart News reported that Trump pledged to end the gun-free scenarios for U.S. troops by “[mandating] that soldiers remain armed and on alert at our military bases.” \\nThe immediate institution of this directive probably left President Barack Obama incensed, but he undoubtedly realized that there was nothing he could do to prevent its implementation in a couple of months anyway. And that’s good news because it works to ensure the safety of our troops, which should always be a priority. \\nLet us know what you think about this in the comments below! \\nGod Bless. '"}, "time": 1742563187.9962442}