{"duration": 0.09849190711975098, "input_args": {"text": "\"Politics Paul Craig Roberts: 'Putin's Nukes Could Wipe Out Entire East Coast' (PODCAST) \\nIf the US thinks it can continually transgress against Russia until Moscow gives in, it is gravely mistaken Originally appeared at Zero Hedge \\nSuffice to say, though children are at play, this is not a game. \\nThose who have been toying with outright war against Russia, and an escalation of the conflict in Syria, are putting the lives of all Americans at risk. \\nOf course, the threat of nuclear annihilation has been with us since the earliest days of the Cold War, but Russia has now positioned itself with the largest and most destructive nuclear arsenal of any country in the world. \\nEconomist and political critic Dr. Paul Craig Roberts explains how diplomatic relations have broken between Russia and the United States, after the U.S. knowingly attacked pro-Assad Syria forces… that, of course, was the cherry on top of a host of insults, deliberate antagonism and a strategy that could only result in further chaos and war. \\nThe end of negotiations is unfortunately, given that fighting it out could mean thermonuclear war that would make Hiroshima and Nagasaki look trivial in comparison. \\nAfter a period of some patience, Russia is now warning that the United States is dangerously close to turning a proxy war into a direct world war – and they are deadly serious about defending the motherland and their sworn allies – namely Assad. \\nAny further attack could result in immediate destruction. \\nPutin is a formidable opponent and Russia a powerful enemy. At present time, they have the capability of wiping the entire East Coast of the United States off the map – where more than 100 million people live. Will the ranking misleaders in Washington continue to gamble with all of our lives? \\nVLADIMIR Putin’s nuclear stockpile could completely destroy the east coast of the US in one clean swipe should the Russian leader launch an attack on the West, an expert has warned. \\nA staggering 112.6million people could be at risk of extermination from the deadly missiles. \\nRussia has the largest haul of nuclear weapons of any country in the world and reportedly has the most powerful bomb named the SS-18 – menacingly nicknamed the Satan. \\nExperts estimate Russia has 55 of the deadly weapons, but only five would be needed to destroy the East Coast of the US. \\n[…] \\n“Five or six of these ‘Satans’ as they are known by the US military, and the East Coast of the United States disappears.” \\nDr Roberts said: “The atomic bombs that Washington dropped on these helpless civilian centres while the Japanese government was trying to surrender, were mere popguns compared to today’s thermo-nuclear weapons. \\nWhat’s more, the Russian have hinted strongly at the possibility that they would be able to disable electronics, communications and defense shields in the U.S. via electromagnetic warfare – perhaps an EMP . \\nWorst of all, the American misleaders haven’t even got a good reason for putting the population at such a risk – strategy in the middle east is muddied at best, and prodding for war with Russia doesn’t carry a clear narrative either. \\nThe world could change, and American power could end in a few decisive minutes. \\nHopefully it would never come to that, but we shouldn’t live in a false world where we pretend these situations can’t harm us. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742564161.5594106}