{"duration": 0.04427337646484375, "input_args": {"text": "'175 Views Share: Commentary — Seriously, you always hear that we mustn’t deport people because it could break up families. Yet we are encouraging teenagers to run away from their families and try their luck on America’s streets! Latino Invasion Set for New Record \\nThe New Observer March 2, 2016 \\nMore than 17,000 “unaccompanied alien minors” had invaded the US over the Mexican border in the past few months, and the number of “family units” has increased to 21,000, the US House Judiciary Subcommittee on Immigration and Border Security has been informed. \\nThe House was also told that if the present trends continue, there will be a 30 percent increase on the record number of 260,000 invaders who entered the US in 2014. \\n\\n\\n“In the past few months the number of unaccompanied alien minors unlawfully entering the US soared to over 17,000 and the number of family units increased to 21,000,” Chair Rep. Trey Gowdy (R-SC) informed the US House Judiciary Subcommittee on Immigration and Border Security in a February 4 hearing on Capitol Hill. \\n“If these trends continue it is predicted there will be a 30 percent increase in the record high numbers we witnessed in 2014.” \\nThe widespread criminal violence endemic in the nonwhite Third World countries to the south continues to be a major factor in the ongoing invasion, Omar Zamora, public affairs officer for the US Border Patrol Rio Grande Valley (RGV) Sector told the local KVUE TV station. \\n“We’ve got gangs over there that are controlling the neighborhoods, controlling the cities,” Zamora said. \\nAgents of the RRGV Sector, he said, “man the front lines of the battle against drug trafficking and human smuggling.” \\nThe US government has mounted an ad campaign along the Guatemala–Honduras border warning would-be invaders what to expect from human traffickers. \\nAccording to Zamora, the human traffickers engage in everything from child molestation and rape to extortion and fraud. READ Cologne Police Officer Confirms: It was “Refugees” \\n“I think the biggest misconceptions are, ‘Hey they’re just children down there, right? It’s a humanitarian crisis,’” said Zamora, “But what I want to stress is there’s the 50 percent of the other individuals that are running, that are fighting, that have criminal records.” \\nRep. Lamar Smith (R-TX), who chairs the House Border Security Caucus, told KVUE that “If people figure they have a 95 percent chance of being allowed to stay and work and get government benefits, they’re going to come no matter what they might hear on the street or on the radio or see in a leaflet.” \\nIn a February 23 hearing of the Senate Judiciary Committee, Sen. John Cornyn (R-TX) asked agency Acting Chief Ronald Vitiello whether giving undocumented immigrants the impression they won’t be allowed to stay in the US without a legal claim would act as a deterrent and slow the flow of unauthorized crossings. \\n“Yes, I believe that matters,” Vitiello answered.'"}, "time": 1742564538.792611}