{"duration": 0.015842676162719727, "input_args": {"text": "'\\nThis story by Paris Swade . \\nWatch Donald Trump shut down the liberal shill Dana Bash after her ridiculously biased questioning. \\nDonald Trump decided to take a day off of campaigning to attend his hotel opening. That’s because he has been campaigning 7 days a week. \\nWatch this stupid question. \\nDana Bash: “For people who say you’re taking time out of swing states to go do this, you say?” \\nNow watch Trump tear her a new one. Trump shuts down Dana Bash after questioning him for \"taking time off\" to attend his hotel\\'s grand opening. 😁 pic.twitter.com/LtLAu1jkbQ \\n— Deplorable AJ (@asamjulian) October 26, 2016 \\nDonald Trump: “I say the following. You have been covering me for the last, long time. I did yesterday 8 stops and 3 major speeches. And I’ve been doing this for weeks straight. I left for here for an hour-and-a-half. I’m leaving here and going to North Carolina, then I’m going to Florida, then I’m going up to New Hampshire. For you to ask me that question is actually very insulting because Hillary Clinton does one stop and then goes home and sleeps. And yet you ask me that question. I think it’s a very rude question .” I\\'ll say what everyone is thinking. Most unattractive ticket in political history. \\nHillary projects weakness. Kaine, creepiness. pic.twitter.com/MRe5soI5N4 \\n— Deplorable AJ (@asamjulian) October 26, 2016 \\nYou cannot knock the hustle when it comes to Trump. The man literally campaigns 7 days a week. Hillary has taken like every day off this week. She has Obama and Michelle Obama and Joe Biden and Bill Clinton campaigning for her. \\n*** Hillary is crooked, y’all! Share this if you agree! \\nShare this if you are tired of crooked Hillary! It’s time to vote Donald Trump in. He works so hard because \\nShare this if you are voting Trump. Then write “I’m voting Trump!” below! Be proud y’all. '"}, "time": 1742628510.4704096}