{"duration": 1.246164321899414, "input_args": {"text": "'New York Times: Apologist for Power November 7, 2016 \\nSpecial Report: Over the past couple of decades, America’s preeminent newspaper, The New York Times, has lost its journalistic way, becoming a propaganda platform and an apologist for the powerful,   \\nIn recent years, The New York Times has behaved as if whatever the Establishment claims is true must be true, failing to show thoughtful skepticism whether the findings are coming from a congressional report, an intelligence assessment, a criminal investigation or even an outfit as disreputable as the National Football League. \\nIf some powerful institution asserts a conclusion, the Times falls in line and expects everyone else to do so as well. Yet, that is not journalism; it is mindless submission to authority; and it indirectly pushes many people into the swamps of conspiracy theories. After all, if professional journalists simply ratify whatever dubious claims are coming from powerful institutions, inquisitive citizens will try to fill in the blanks themselves and sometimes buy into outlandishly false speculations. New York Times building in New York City. (Photo from Wikipedia) \\nIn my journalistic career, I have found both extremes troubling: the Times’ assumption that the authorities are almost always right and the conspiracy theorists who follow up some “what I can’t understand” comment with a patently absurd explanation and then get angry when rational people won’t go along. \\nThough both attitudes have become dangerous for a functioning democracy, the behavior of the Times deserves the bulk of the blame, since the “newspaper of record” carries far more weight in setting public policy and also is partly to blame for creating this blight of conspiracism. \\nSome of the Times’ failures are well known, such as its 2002 front-page acceptance of claims from officials and allies of George W. Bush’s administration that Iraq was reconstituting its nuclear weapons program and had purchased some aluminum tubes to do so. The Times’ bogus story allowed Bush’s top aides to go on Sunday talk shows to warn that “we must not allow the smoking gun to be a mushroom cloud.” \\nBut the “aluminum tube” story was only part of a long-developing pattern. As an investigative reporter in Washington since 1980, I had seen the Times engage in similar publications of false stories planted by powerful insiders. \\nFor instance, based on self-serving information from Ronald Reagan’s Justice Department in the mid-1980s, the Times knocked down the original reporting that my Associated Press colleague Brian Barger and I did on Nicaraguan Contra rebels getting involved in cocaine smuggling. \\nAnd, once the Times got snookered by its official sources, it and other mainstream publications carried on vendettas against anyone who contradicted the accepted wisdom, unwilling to admit that they were wrong even at the expense of historical truth. \\nSo, when San Jose Mercury News reporter Gary Webb revived the Contra-cocaine story in 1996 — with evidence that some of that cocaine had fed into the “crack epidemic”— the Times (along with other major newspapers) savaged Webb’s articles and destroyed his career. \\nFinally, in 1998 when the CIA’s Inspector General Frederick Hitz confirmed that the Contras indeed had engaged in extensive cocaine trafficking, the Times only published a grudging and limited admission that maybe there was a bit more to the story than the vaunted Times had previously accepted. But Webb’s career and life remained in ruins. He eventually committed suicide in 2004 (and please, conspiracists, don’t go on about how he was “murdered” by the CIA). \\n[For details,   Sordid Contra-Cocaine Saga .”] \\nHiding Gore’s Victory \\nBy the time of Webb’s destruction, the Times was neck-deep in a troubling pattern of getting virtually every major story wrong or sitting on important information that some of its own journalists had dug up. President George W. Bush and members of his national security team in Iraq in 2007 \\nIn 2000, after five partisan Republicans on the U.S. Supreme Court shut down the vote count in Florida to ensure George W. Bush’s “election,” Times executives resisted calls from lower-level editors to join in a media counting of the discarded votes, only grumpily agreeing to take part. \\nHowever, when that vote count was completed in November 2001, the Times executives decided to misreport the findings, which revealed that if all legal votes in Florida had been counted Al Gore would have won (because the so-called “over-votes” – when a voter both marks and writes in the same name – broke heavily for Gore and are legal under Florida law which is based on the clear intent of the voter). \\nYou might have thought that the obvious lede would be that the wrong guy was in the White House, but the 9/11 attacks had intervened between the start and the end of the media recount. So, the Times and other major news organizations buried their own findings so as not to undermine Bush’s authority amid a crisis. The big media focused on various hypotheticals of partial counts that still had Bush “winning.” \\nWhile one might sympathize with the Times’ reasons for misleading the public, what the Times did was not journalism, nor was it a case of treating the American citizens as the true sovereigns of the nation who have a right to know the truth. It was a case of protecting the legitimacy of the Establishment. Those of us who noted the actual vote tabulations were dismissed as “conspiracy theorists,” though we were not. \\n[For the details of how a full Florida recount would have given Gore the White House, see Consortiumnews.com’s “ Gore’s Victory ,” “ So Bush Did Steal the White House ,” and “ Bush v. Gore’s Dark American Decade. ”] \\nRationalizing War \\nSo, when we got to Bush’s plans for invading Iraq in 2002, the Times had already shown its commitment to play ball with whatever the government was saying, no matter how dubious the claims. And, even the humiliation of having been caught publishing a false story about aluminum tubes being evidence of Iraq reconstituting its nuclear weapons program didn’t get the Times to change course. Former New York Times reporter Judith Miller. \\nAlthough one of the reporters on that story, Judy Miller, eventually did leave the newspaper (and landed on her feet at Fox News), the lead author, Michael Gordon, continued as the Times’ national security correspondent. Even more stunning, columnist Bill Keller, who wrote an influential article rallying “liberals” to the cause of invading Iraq, was elevated to the top job of executive editor after his Iraq gullibility had been exposed. \\nEven in the rare moments when the Times claimed it was standing up to the Bush administration, such as publishing James Risen’s article in December 2005 exposing the warrantless wiretapping of Americans, the reality was not exactly a new chapter in Profiles in Courage. \\nIt turned out that the Times had been sitting on Risen’s story for more than a year – it could have been published before the 2004 election – but Bush demanded the story’s suppression. The information was finally shared with the public in late 2005 only because Risen’s book, State of War, was scheduled for publication in January 2006 and included the disclosure, a prospective embarrassment for the Times. \\nThe pattern of the Times bowing down to the White House continued into the Obama administration. Whenever there has been a dubious claim that the U.S. government directs against some foreign “adversary,” the Times dutifully takes the side of Official Washington, rather than applying the objectivity and impartiality that are supposed to be at the heart of U.S. journalism. \\nFor instance, on Aug. 21, 2013, when a mysterious sarin gas attack outside Damascus, Syria, killed several hundred people, the Times simply fell in line behind the U.S.-driven rush to judgment blaming the government of Syrian President Bashar al-Assad. \\nThere were immediate reasons to doubt that conclusion – Assad had just invited in United Nations inspectors to investigate cases of Syrian jihadists using chemical weapons – but the Times and other major Western outlets simply fingered the already demonized Assad. \\nThough we now know that U.S. intelligence analysts did not consider Assad’s guilt a “slam dunk” – and later key elements of the case against Assad collapsed , such as the Times’ miscalculation of the maximum range of the sarin-laden rocket – the Assad-did-it stampede almost led to a major U.S. military retaliation against what now appears to have been the wrong people. \\nCurrent evidence points to a likely provocation by radical jihadists trying to trick the West into entering the war in a big way on their side, but the Times has never fully retracted its false claim that the rocket was fired from a Syrian military base, which was four times outside the rocket’s range. \\nIndeed, to this day, Times’ columnists and other Western journalists routinely cite Assad’s guilt – and President Obama’s supposed failure to enforce his “red line” against chemical attacks – as flat fact. \\nThe MH-17 Case \\nThere has been a similar lack of skepticism toward the propaganda case that has been built around the July 17, 2014 shoot-down of Malaysia Airlines Flight 17 over eastern Ukraine killing 298 people. We saw another rush to judgment, this time blaming ethnic Russian rebels and Russian President Vladimir Putin, but there were problems with that claim from the start. The Dutch Safety Board’s reconstruction of where it believed the missile exploded near Malaysia Airlines Flight 17 on July 17, 2014. \\nI was told by a source briefed by U.S. intelligence analysts that their evidence pointed to a rogue element of the Ukrainian military under the direction of a hard-line, anti-Russian Ukrainian oligarch with the hoped-for goal of shooting down Putin’s plane returning from a state visit to South America. According to this account, MH-17 just became the substitute target. \\nBut the international investigation was put under the effective control of Ukraine’s unsavory SBU intelligence service, although technically called “Dutch-led.” As the Joint Investigation Team’s own progress report noted this year, the inquiry relied both on the Ukrainian government’s hospitality and “evidence” supplied by the SBU, which has been implicated in concealing Ukrainian torture centers. Far from objective, the investigation became part of the West’s anti-Russian propaganda war. \\nSo, when the JIT issued its initial findings in September 2016, skepticism should have been in order. Indeed, there wasn’t really a “report” as such, more a brief summary accompanied by several videos that used computer-generated graphics and cryptic telephone intercepts, provided by the SBU, to create the impression of Russian guilt. \\nA critical examination of the material revealed that the inquiry ignored evidence that went against the desired conclusion , including intercepts revealing that a Ukrainian convoy was pressing deep inside what was called “rebel-controlled” territory, an important point because it showed that a Ukrainian missile battery could have traveled eastward toward the alleged firing point since rebel forces were mostly massed to the north fighting a government offensive. \\nThe alleged route of the supposed Russian Buk battery also made no sense because there was a much more direct and discreet route from the Russian border to the alleged firing location in the southeast than the circuitous wandering all the way west to Donetsk before backtracking to the east. But the SBU-dominated investigation needed to explain why all the “social media” photos showed a Buk battery traveling east toward Russia, not westward from Russia. \\nAnd, there was the JIT’s silence on a Dutch intelligence report from October 2015 saying that the only powerful anti-aircraft missiles in eastern Ukraine on July 17, 2014, were under the control of the Ukrainian military. Plus, the supposed firing location for the alleged purpose of protecting rebel fighters operating far to the north made no sense from a tactical perspective either. Placing a Buk battery far to the southeast would not help shoot down Ukraine’s military planes firing missiles into the rebel lines. \\nIndeed, much of the evidence fit better with what I had been told, second-hand, from those U.S. intelligence analysts – because any scheme to shoot down Putin’s plane would need the deniability that would come from pushing the battery as far into “rebel-controlled” territory as possible so as to manage the political fallout by creating a cover story that Putin was killed by his own supporters. The same cover story also would work for killing the passengers on MH-17 and blaming it on Russia. \\nBut whatever you might think about who was responsible for the MH-17 atrocity — and I agree that the mystery has not been solved — the job of a professional news organization is to examine skeptically the various accounts and the available pieces of evidence, not just embrace the “official” version. But that is what the Times has done regarding MH-17 and pretty much every other case. \\nConcealing History \\nThe Times’ journalistic negligence does not only affect current issues of war and peace, but how the American people understand their recent history. In effect, the false “group thinks” – accepted by the Times – have a long after-life of decay contaminating the public’s thinking whenever the Times recycles a bogus account as historical narrative. President Lyndon Johnson accompanies President-elect Richard Nixon to his inauguration on Jan. 20, 1969. \\nFor instance, in a recent summary of “October Surprise” cases, the Times misled its readers on two of the most important incidents, 1968 and 1980. \\nRegarding the election of 1968 between Richard Nixon and Hubert Humphrey, the evidence is now overwhelming that Nixon’s operatives went behind President Lyndon Johnson’s back to sabotage the Paris peace talks that Johnson felt could end the Vietnam War, a development that also would likely have helped fellow Democrat Humphrey. \\nThat evidence now includes declassified FBI wiretaps of Nixon’s conspirators and Johnson’s own taped phone conversations – as well as various admissions and other corroborations from participants – but the Times has always turned up its nose toward this important story. So, the history doesn’t exist in New York Times World. \\nThus, when the Times addressed this 1968 episode in a Nov. 1, 2016 review of past “October Surprise” cases – in the context of FBI Director James Comey telling Congress that the FBI had reopened its investigation of Hillary Clinton’s emails – the Times offered this summary: \\n“President Lyndon Baines Johnson announced a halt to bombing of North Vietnam, based on his claim that peace talks had ‘entered a new and a very much more hopeful phase,’ and he invited the government of South Vietnam and the Viet Cong to take part in negotiations. Raising hopes that the war might end soon, the announcement appeared to bolster the standing in the polls of Vice President Hubert H. Humphrey, the Democratic  , but Humphrey still fell short in the election against former Vice President Richard M. Nixon, the Republican.” \\nIn other words, the Times treated Johnson’s bombing halt and claim of peace-talk progress as the “October Surprise” to try to influence the election in favor of Humphrey. But the evidence now is clear that a peace agreement was within reach and that the “October Surprise” was Nixon’s sabotage of the negotiations by persuading South Vietnamese President Nguyen van Thieu to boycott the Paris meeting. \\nThe Times got the story upside-down and inside-out by failing to reexamine this case in light of convincing evidence now available in the declassified record. [For details, see Consortiumnews.com’s “ LBJ’s ‘X-File’ on Nixon’s ‘Treason ’” and “ The Heinous Crime Behind Watergate .”] \\nReagan’s Victory \\nThe Times botched the 1980 “October Surprise” case even worse. The currently available evidence supports the case that Ronald Reagan’s campaign – mostly through its director (and future CIA Director) William Casey and its vice   (and former CIA Director) George H.W. Bush – went behind President Jimmy Carter’s back and undermined his negotiations to free 52 American hostages then held in Iran. President Ronald Reagan, delivering his Inaugural Address on Jan. 20, 1981, as the 52 U.S. hostages in Iran are simultaneously released. \\nCarter’s failure became a central factor in his repudiation for reelection and a core reason for Reagan’s landslide victory – that also carried the Republicans to control of the U.S. Senate. But the later congressional investigation into the 1980 October Surprise case – a follow-on to the Iran-Contra scandal which exposed the Reagan-Bush secret dealings with Iran – was stymied in 1992. \\nNaively, the inquiry trusted President George H.W. Bush’s administration to collect the evidence and provide the witnesses for what would amount to Bush’s political suicide. Documents from Bush’s presidential library reveal that his White House quickly set out to “kill/spike this story” in order to protect his reelection chances. \\nFor instance, a memo by one of Bush’s lawyers revealed that the White House had received confirmation of a key October Surprise allegation – a secret trip by Casey to Madrid – but then withheld that information from congressional investigators. Documents also show the White House frustrating attempts to interview a key witness. \\nAfter I discovered the Madrid confirmation several years ago – and sent the document to former Rep. Lee Hamilton, who had headed the House inquiry which concluded that there was no credible evidence supporting the allegations – he was stunned by the apparent betrayal of his trust. \\n“The [Bush-41] White House did not notify us that he [Casey] did make the trip” to Madrid, Hamilton told me in an interview. Asked if knowledge that Casey had traveled to Madrid might have changed the investigation’s dismissive October Surprise conclusion, Hamilton said yes, because the question of the Madrid trip was central to the inquiry. \\nSo, a great deal is now known about the 1980 October Surprise case since the Times accepted the misguided conclusion of Hamilton’s inquiry. But none of that is reflected in how the Times recounted the history in its review of past October Surprise cases: \\n“The Republican nominee, Ronald Reagan, and his aides repeatedly warned that President Jimmy Carter, a Democrat, would try an October surprise, probably in the form of winning the release of American hostages held for more than a year in Iran. The Reagan campaign’s frequent use of the term helped popularize it. Some people have since charged that Reagan aides actually tried to prevent a hostage release before the election, through back-channel communications with Iran, a claim that has been widely refuted. The hostages were freed in January 1981 — on the day Reagan was inaugurated.” \\nYet, rather than being “widely refuted,” the most recent evidence tends to confirm the allegations that have been made by some two dozen witnesses including a detailed account of the Reagan campaign’s interference by then-Iranian President Abolhassan Bani-Sadr. But the Times seems more interested in reinforcing the false conventional wisdom than informing the American people. \\n[For details, see Robert Parry’s America’s Stolen Narrative or Trick or Treason: The 1980 October Surprise Mystery or Consortiumnews.com’s “ Second Thoughts on October Surprise. ”] \\nCrazy Deflategate \\nEven on more trivial matters, the Times simply can’t escape its pattern of accepting the word from the powerful, even when those powers-that-be are as disreputable as the executives of National Football League. New England Patriot quarterback Tom Brady. \\nWhen the NFL decided to accuse New England Patriots quarterback Tom Brady of cheating in a bizarre scheme to slightly deflate footballs in the January 2015 AFC Championship game, the Times again showed no skepticism despite the flimsiness of the accusations as well as the absence of any direct evidence — and the official denials from Brady (under oath) and two equipment employees. \\nThe so-called Deflategate case was also marred by the sloppiness of the halftime measurements of the footballs and the ignorance of many NFL executives about the laws of physics and how weather affects the internal air pressure of footballs, as determined by the Ideal Gas Law. \\nBut the “scandal” took on a life of its own with the NFL leaking exaggerations about the discrepancies in the initial air-pressure measurements and false claims about the proper air pressure in the footballs of the other team, the Indianapolis Colts (the one accurate gauge, used by the NFL officials, showed that the Colts’ footballs were underinflated for both the first half and second half). \\nEventually, even NFL Commissioner Roger Goodell recognized many of the flaws in the case as he concluded that the only game where the footballs could have been deflated was the AFC Championship game when the Patriots’ ball boy carried the footballs to the field unattended (rather than the normal practice of being accompanied by an official) and stopped briefly in a bathroom. \\nBut this NFL conspiracy theory – that the ball boy used his bathroom break to slightly deflate footballs rather than urinating as he claimed – made no sense because the only reason the ball boy ended up unattended was because the preceding NFC Championship had gone into overtime and the NFL decided to delay the start of the AFC game so the public could see both games. \\nThe sudden-death ending of the NFC game caused confusion among the officials and the ball boy took it upon himself to take the balls to the field. \\nTo suggest that Brady somehow anticipated that series of unlikely events so a tiny bit of air could be removed from the footballs, which would have no discernible effect except to make the balls travel slightly slower and thus easier to defend, is absurd on its face. \\nBut the NFL would have lost face by admitting that it had acted so absurdly – and rival owners saw a chance to damage the Patriots’ ability to compete – so the Deflategate story moved on with Brady suspended for four games and the Patriots stripped of two valuable draft choices. \\nA Puff Piece \\nWhile you might say that this “scandal” surely didn’t deserve the attention that it got (and you’d be right), the Times, which treated the NFL claims as fact, didn’t let go even after Brady dropped his appeals and accepted his four-game suspension. NFL Commissioner Roger Goodell \\nThe Times devoted 2½ pages on Sept. 25, 2016, to a puff piece by correspondent John Branch about the “Deflategate Scientists” from the corporate-friendly science firm, Exponent, which was hired by the NFL to produce the “science” to justify Brady’s punishment. \\nThough Exponent discovered that all or virtually all the air-pressure drop could be attributable to the cold, wet weather on the night of the game (and the imprecise process of the halftime measurements further muddled the picture), Exponent still composed some scientific-sounding jargon to give the NFL the cover that it needed to go after Brady. \\nThe firm said, “we conclude that within the range of game characteristics most likely to have occurred on Game Day, we have identified no set of credible environmental or physical factors that completely accounts for the additional loss of air pressure exhibited by the Patriots game balls as compared to the loss in air pressure exhibited by the Colts game balls.” \\nBut Exponent’s phrasing obscured the fact that an innocent explanation did exist on Exponent’s range of measurements though the firm ruled it out by applying “accepted error margins” and fudging the facts around the sequence of the football testing at halftime (a key point because in a warmer environment, the air pressure would rise naturally). \\nArmed with Exponent’s phrasing, NFL investigators then took some unrelated text messages from the two equipment employees describing how NFL officials had over-inflated footballs in a prior game to claim they had the “smoking gun” regarding a plot to under-inflate footballs. \\nHowever, rather than show any skepticism about this “evidence” and the larger absurdity of the Deflategate claims, the Times simply treated the NFL’s case as solid and fawned over Exponent as if it were a temple of noble scientists seeking nothing but the truth. The Times dismissed critics who cited the firm’s reputation as a hired-gun to give powerful industries useful conclusions, such as disparaging the danger from second-hand cigarette smoke. \\nInstead of any serious journalism examining Deflategate’s logical flaws and Exponent’s dubious role in the scandal-mongering, the Times presented Exponent as the real martyrs in the case, reporting “Exponent still receives emails from adamant critics, and its role in Deflategate has cost it several prospective clients, the company said.” \\nA Troubling Pattern \\nGranted, the Deflategate silliness is minor compared to other cases when the Times misrepresented key chapters of U.S. history, concealed government wrongdoing and generated propaganda used to justify wars. But all these examples point to a pattern of journalistic behavior that is not journalistic. \\nToday’s Times is not the brave newspaper that published the Pentagon Papers, the secret history of the Vietnam War. It is no longer the place where a Seymour Hersh could expose the CIA’s “crown jewels” of scandals or where a Raymond Bonner could reveal massacres of civilians by U.S.-backed militaries in Central America. \\nNot that those earlier days were by any means perfect – and not that there isn’t some quality journalism that still appears in the newspaper – but it is hard to imagine the Times today going against the grain in any significant or consistent way. \\nInstead, the Times has become an apologist for the powerful, conveying to its readers and to the world a dangerous and dubious insistence that the Establishment knows best. \\n  .'"}, "time": 1742562756.099201}