{"duration": 0.10931658744812012, "input_args": {"text": "'ABU DHABI, United Arab Emirates  —   Lewis Hamilton may have won the Abu Dhabi Grand Prix on Sunday, and he may have won 10 races this season compared to nine victories for his Mercedes teammate, Nico Rosberg. But Rosberg, who finished the race in second place, not only won the 2016 world drivers’ championship, having earned 5 points more than Hamilton this year, but he also proved that he deserved that title, and above all, that it is still possible in the cutthroat world of modern Formula One to win with the style and grace of a gentleman. After conceding the drivers’ title to Hamilton during the past two seasons, and even losing when they were teammates in   as children, Rosberg finally beat his nemesis. “It feels like I’ve been racing him forever,” Rosberg said of Hamilton. “He has always managed to just edge me out and get the title, even when we were small in  . He’s an amazing driver and one of the best in history, so it’s unbelievably special to beat him because the level is so high. ” It was not just the manner in which Rosberg succeeded, and his generosity in praising his teammate, but also the contrasting style with which Hamilton lost the title, that defined this final duel of the 2016 season. With just 12 points between them before the race, and Rosberg leading the series, Hamilton, who started from the pole position  —   with Rosberg starting second  —   had to win the race and hope that Rosberg failed to finish second or third. There was widespread speculation before the race that Hamilton would use dirty tactics by trying to hold his lead to the first corner, and then drive slowly in order to force Rosberg into a battle with the drivers who were behind him  —   notably those from Red Bull and Ferrari, who started from third to sixth. “That’s not really ever been my thought process,” Hamilton said before the race, adding that it “wouldn’t be very easy or wise to do so. ” But it was exactly what Hamilton did, driving at one point as much as nine seconds slower per lap than he had in qualifying for the pole, and despite his Mercedes engineer regularly telling him to speed up as the team feared it could lose the victory. But even before that point, Rosberg had also fallen victim early in the race to another similar tactic from a competing team, after Max Verstappen in one of the Red Bull cars moved ahead of him after his pit stop, and Verstappen slowed to block Rosberg and help the other Red Bull driver, Daniel Ricciardo, to catch up from behind Rosberg. At that point, Rosberg had to contemplate that he might end up behind both of the Red Bull drivers, with Hamilton winning the race and the title. “The feelings out there in the battle with Max, unreal,” said Rosberg, looking both emotionally and physically exhausted. “I hope I don’t experience that many times again. ” He then proved what a gutsy and precise driver he is when his engineer told him that he absolutely had to pass Verstappen as soon as possible. He did so with a brilliant and brave move on Lap 20 of the   race, despite the knowledge that Verstappen has been criticized all season as a dangerous and unpredictable driver to pass. Rosberg then set several fastest laps of the race and caught up to Hamilton again, showing that he was in full control of his car and himself. But a bigger trial lay ahead in the final laps of the race: As predicted, with Rosberg less than a second behind him, Hamilton drove as slowly as he could in order to push Rosberg into Sebastian Vettel of Ferrari, who was catching him, and Verstappen. Hamilton’s engineer continuously requested he speed up. But Hamilton kept his car as slow as possible, even answering, for an employee of a racing team, insubordinately. “Right now, I’m losing the world championship,” Hamilton said with two laps remaining. “So I’m not bothered if I’m going to lose the race. ” Rosberg had a card of his own to play, of course, had he decided to act like drivers such as Ayrton Senna, Alain Prost and Michael Schumacher in similar situations in the 1980s and 1990s, who all settled titles with knockout crashes into their own teammates. But before the race, Rosberg had said he would only do everything within the rules to win. And after the race, he said he never considered trying to pass in unrealistic circumstances. There was a certain justice that dawned after the race about Hamilton’s tactic, as Vettel repeated twice that he could not have made an attempt to pass Rosberg because Hamilton was actually too close in front of Rosberg, and any leap past Rosberg might send Vettel into a collision with Hamilton’s car. Under immense pressure throughout the season, Rosberg did everything he had to do to hold his advantage  —   Hamilton led the series for a period of only four midseason races  —   and Rosberg did so despite Hamilton’s efforts, both in words and on the track, to impose his will. Paddy Lowe, the technical director of the Mercedes team, explained why he felt there was no question that Rosberg deserved to win the title. “For me, it’s about not just winning races, it’s about sustaining that energy, sustaining that commitment, sustaining that nerve throughout a championship,” Lowe said. “And it all came down to this race today, and he did it, and that is the mark of a real world champion. ” But it was Rosberg’s own contrasting, and worthy, behavior that impressed the most. Despite Hamilton’s tactics on Sunday, and the media grilling them both over its ethical merits, Rosberg refused to say a bad word against Hamilton. “You can understand the team’s perspective, and you can understand Lewis’s perspective  —   so that’s it,” said Rosberg, closing the debate. Hamilton, however, was unrepentant. “I don’t think what I did was dangerous, so I don’t think I did anything unfair,” Hamilton said. “We are fighting for a championship, so I controlled the pace. That’s the rules. ” It was all a stark contrast to the early years of the series, when it was possible for one driver to hand his car to another driver of the same team, as Peter Collins did for Juan Manuel Fangio in 1956 in the final race, handing his own chance at winning his first title to Fangio, who ended up claiming his fourth. But Rosberg has perhaps learned his lessons from a driver from another age as well, as he became only the second son of a Formula One world champion  —   after Graham and Damon Hill  —   to win the title himself. His father, Kéké, won the title while driving for the Williams team in 1982, and after only a single victory that season. “I hope my dad survived that race,” Rosberg said of his victory. “I haven’t seen him yet. I’m sure it was pretty intense for him, so I hope he’s O. K. ”'"}, "time": 1742561718.9416525}