{"duration": 0.11447882652282715, "input_args": {"text": "'Despite a brief   of controversy that preceded it, a conversation between Milo Yiannopoulos, the incendiary   author and lecturer, and Bill Maher, the comedian and host of HBO’s “Real Time,” on that program Friday night was a largely docile, chummy affair. There was little conflict or   as both men chided the political left for avoiding or drowning out Mr. Yiannopoulos’s views rather than engaging with them. Introducing Mr. Yiannopoulos, 32, an openly gay editor at Breitbart News, Mr. Maher said: “I think you’re colossally wrong on a number of things. But if I banned everyone from my show who I thought was colossally wrong, I would be talking to myself. ” Mr. Yiannopoulos began the interview by cracking jokes about gay people (whom he said he did not hire because they did not show up to work on time) and women, and telling Mr. Maher’s audience that they were “very easily triggered. ” “All I care about is free speech and free expression,” Mr. Yiannopoulos explained. “I want people to be able to be, do and say anything. These days, you’re right, that’s a conservative issue. ” Mr. Yiannopoulos had been scheduled to speak at the University of California, Berkeley, earlier this month, on an invitation from the school’s College Republicans group. But his talk was canceled when protests against the speech turned violent and led to rioting that caused about $100, 000 in damages. In January, when Mr. Yiannopoulos gave a lecture in Seattle at the University of Washington, a man was shot during protests outside the site of the speech. He spoke in December at the University of   where he mocked a transgender student while displaying her photograph during his talk. Other schools have withdrawn invitations to him in recent weeks. When it was announced on Wednesday that Mr. Yiannopoulos would be interviewed on “Real Time,” another scheduled guest, Jeremy Scahill, a journalist for The Intercept, said in a statement on his Twitter account that he was withdrawing from the show. “He has ample venues to spew his hateful diatribes,” Mr. Scahill said. “There is no value in ‘debating’ him. ” Mr. Maher followed with his own statement that said, “If Mr. Yiannopoulos is indeed the monster Scahill claims  —   and he might be  —   nothing could serve the liberal cause better than having him exposed on Friday night. ” In the interview on Friday night, Mr. Yiannopolous criticized female comedians like Amy Schumer and Sarah Silverman, and he described the Democrats as “the party of Lena Dunham,” the creator and star of “Girls. ” (Mr. Maher replied: “Let’s not pick on fellow HBO stars. There are so many other people. ”) Describing himself as “a virtuous troll,” Mr. Yiannopolous said, “I hurt people for a reason. ” He said people “want to police humor” because “they can’t control it. ” “Because the one thing that authoritarians hate is the sound of laughter,” Mr. Yiannopolous said. Mr. Maher added, “And also, because when people laugh, they know it’s true. ” Mr. Yiannopolous replied, “Nothing annoys people, or amuses people, like the truth. ” They then discussed an incident from last summer, when Mr. Yiannopoulos was banned from Twitter after helping rally other users to direct racist and sexist remarks at Leslie Jones, a star of “Ghostbusters” and “Saturday Night Live. ” “I didn’t understand, like, the ‘Ghostbusters’ thing,” Mr. Maher said. Mr. Yiannopoulos answered: “I wrote a bad review of a movie. Am I not entitled to do that?” After repeating some of the insults he had leveled at Ms. Jones, he said, “I simply don’t accept  —   I do not accept  —   that the star of a Hollywood blockbuster, that an     is crying over mean words on the internet. Get over it. ” “What actually hurts people is, like, murder, violence,” Mr. Yiannopoulos added. “That kind of stuff. ” He added that “mean words” don’t “hurt people. ” Mr. Maher said, “Which some people would say you have incited. ” Mr. Yiannopoulos reacted with surprise. “What? How?” he asked. “I’m just saying, some people would say,” Mr. Maher answered. Mr. Yiannopoulos replied, “Well, they would be idiots. ” Speaking to his audience, Mr. Maher said, “Stop taking the bait, liberals,” and asked how they could be afraid of someone he described as “little, British, impish” and a slur for gay people. The two men shook hands, and Mr. Maher moved on to his panel discussion. But in an   segment that ran after the HBO broadcast, Mr. Yiannopoulos said that transgender people were “vastly disproportionately involved in sex crime,” drawing jeers, boos and a shout of “liar” from Mr. Maher’s audience. Mr. Yiannopoulos also clashed with the comedian Larry Wilmore, another guest on the show. In remarks to Mr. Yiannopoulos that were bookended by an obscene phrase, Mr. Wilmore took offense at his Twitter trolling of Ms. Jones. “She’s a very thoughtful person and very funny,” he said. Trying to defuse the tension, Mr. Maher wryly suggested to Mr. Yiannopoulos that he shouldn’t be so quick to spar with his fellow panelists. “This is the beginning of your career,” Mr. Maher said. “People are only just starting to hate you. ”'"}, "time": 1742561977.9436905}