{"duration": 0.04182171821594238, "input_args": {"text": "'Samstag, 19. November 2016 Bremen ersetzt als erstes Bundesland Schulnoten durch Emojis Bremen (Archiv) - Deutsch: 😳, Sport: 😄, Mathe: 💩 – so oder so ähnlich könnte schon ab nächstem Schuljahr ein typisches Zeugnis eines Bremer Schülers aussehen. Denn der Senat der Hansestadt hat angekündigt, das Benotungssystem ab dem nächsten Schuljahr vollständig auf Emojis umzustellen. Die neuen Zensuren sollen es Schülern erleichtern, ihre Leistungen in den verschiedenen Unterrichtsfächern richtig einzuschätzen. Bildungssenatorin Claudia Bodegan: \"Die Jugendlichen von heute können mit komplexen Bewertungssystemen wie dem Zahlenraum von 1 bis 6 nichts mehr anfangen, kennen aber jedes einzelne Emoji in- und auswendig. Ich habe Schüler gesehen, die bei einer 5- verständnislos mit den Schultern zucken. Dieselben Schüler brechen in Tränen aus, wenn sie ein 😭 bekommen und geloben feierlich Besserung.\" Hat gerade ein 👻 in Mathe bekommen und traut sich nicht nach Hause: Timmy (9) Im neuen Notensystem soll allerdings nicht jede Note durch ein vorab festgelegtes Emoji ersetzt werden. Stattdessen können Lehrer aus hunderten der kleinen Bilder das für die Leistung des jeweiligen Schülers passendste Symbol aussuchen. Die nötige Kompetenz wird den Pädagogen in einem zweiwöchigen Lehrgang mit dem Titel \"Setzen, 👾!\" vermittelt. Sitzenbleiben ist nach dem neuen Notensystem nach wie vor ab der 9. Klasse möglich. Wer mehr als vier 😿 oder zwei 💩 oder zwei 👎 und ein 🙈 hat, fällt durch. Es sei denn, der Schüler kann seine schlechten Zensuren mit 🐽, 😄, 🚀 oder 😘 ausgleichen. dan, ssi; Foto rechts: Shutterstock; Hinweis: Erstmals erschienen am 17.11.15 Artikel teilen:'"}, "time": 1742564377.8841224}