{"duration": 0.04349255561828613, "input_args": {"text": "'The violence in Dallas last week is intensifying worries in Cleveland about visitors and protesters taking firearms downtown during the Republican National Convention, where thousands of people plan to demonstrate. Ohio’s   laws mean that those who legally own guns can take them into the 1.   area where many of the events and protests connected to the Republican convention will be held next week. Beginning Sunday, protesters are expected to flood into the city, with causes ranging from white supremacy to Palestinian rights. “Obviously, everybody is on edge after Dallas,” Brian Kazy, a member of the Cleveland City Council and its Safety Committee, said in an interview Sunday evening. Mr. Kazy said he had never been concerned about Ohio’s   laws. But then Micah Johnson, an   sniper said to be determined to murder white police officers, went on a rampage in Texas, which also has   laws. “If you had some mass confusion, even if you had a civilian who was carrying who would attempt to help out, I think the mentality of any law enforcement officer would see an individual with a gun, would see an individual possibly shoot and would react to that,” he said. Cleveland officials are promising increased security during the Republican gathering, with resources from city, state and federal authorities. And within the convention area, the Secret Service will set up a smaller perimeter near the Quicken Loans Arena that will have stricter security and prohibit guns. Delegates to the convention, for example, will not be able to take their guns onto the convention floor. However, given the recent tumult around the country, some leaders are anxious that the environment could turn dangerous. Members of one group made up of current and former members of the military called the Oath Keepers, who have shown up at other tense events heavily armed, say they again plan to carry weapons into Cleveland. Stephen Loomis, president of the Cleveland Police Patrolmen’s Association, said he strongly supported citizens’ rights to bear arms, but he is urging people not to take their guns anywhere near Cleveland’s downtown during the convention. “The last thing in the world we need is anybody walking around here with   strapped to their back,” he said. “And the absolute tragedy in Dallas is proof positive that we just cannot allow that to happen. I would really just beg these folks, just leave your guns at home. Come, say whatever it is that you want to say, make whatever point it is that you want to make, but it’s going to be very, very difficult to deal with the R. N. C. as it is. ” He added that officers were already in a “heightened state” because of the passions generated by the presumptive Republican nominee, Donald J. Trump, on both sides and the security challenges as thousands of delegates fill the city. Eric Pucillo, the vice president of Ohio Carry, a gun rights group based in Kent, Ohio, said he understood Mr. Loomis’s concerns, but stressed that people could not be legally prevented from carrying their guns downtown. Convention planners and city officials emphasize that they are prepared for the Republican gathering and the crowds it will attract. The Cleveland police chief said Friday that after the Dallas shootings the city would be changing its security plans but did not go into detail. Dan Williams, a spokesman for Mayor Frank G. Jackson, also declined to describe how Dallas had reshaped the city’s security plans, or whether officials were concerned about the state’s gun laws. “We are going to follow the law and the law is the law period,” Mr. Williams said. “We believe that we are prepared. ” Meanwhile, some are planning to take their own security forces to Cleveland. Tim Selaty, director of operations at Citizens for Trump, said his group was paying for private security to bolster the police presence. While Mr. Selaty said people should be allowed to carry guns, his group is banning long weapons from a rally in a park it is hosting on Monday. “We’re going to insist that they leave any long arms out for sure because we believe that will make sure our people are safer,” he said. “In other words, no   no shotguns or sniper rifles  —   all of the things that you would think somebody would bring in to hurt a lot of people in a very short time. ” But, he said, he does generally believe civilians being armed make for a safer environment and that he “can’t blame” people who are scared because of Dallas and want to come to Cleveland armed. “It’s every citizen’s right to be able to defend themselves and their family, and I believe that an   society is a much politer society,” Mr. Selaty said. “Regardless of whether I’m at a rally for Donald Trump or I’m walking down the street, I would rather have my gun with me than not. You know, it’s better to have a gun when you need one, than need one and not have one. ” The groups coming to Cleveland represent a broad spectrum of views. Some want simply to celebrate Mr. Trump’s nomination others identify as white supremacists and believe Mr. Trump will help advance their views. Large marches are also planned by liberal and progressive groups who see Mr. Trump as a demagogue and his candidacy as a danger to democracy. And some groups are coming with more encompassing causes, such as alleviating poverty, ending military interventions abroad and working on ways to combat institutional racism. In an interview, Mayor Jackson said that anyone coming to the city should feel confident that officials and the police would deal with whatever circumstances “appropriately. ” He added that the authorities did not plan to “overpolice,” but that they had the proper equipment and personnel needed should emergencies arise. “The City of Cleveland is going to conduct itself in a way to have a safe convention for the delegates, for the visitors, for protesters, for demonstrators, and if you come to Cleveland you should feel safe,” Mr. Jackson said. “People have a right to exercise constitutional rights. They have a right to do that and we have an obligation to protect that. What people don’t have a right to do is hurt other people or tear up property. ”'"}, "time": 1742628501.551084}