{"duration": 0.10406732559204102, "input_args": {"text": "'If there is one thing Elaine Fludgate wants to emphasize, it is that she is not the neediest. Nope, not her. What she is, she said, is the luckiest, the most grateful: She was caught before she actually fell through the cracks. For 40 years, Ms. Fludgate, 62, has lived on the Upper East Side of Manhattan. Her most recent job was as an administrator for the Kimmel Center for University Life at New York University, where in 2013 she was a recipient of the college’s    Award for outstanding work. She had a loving partner, Michael, by her side. Ms. Fludgate had a good life. But everything changed in late 2013, after Ms. Fludgate learned that her partner had liver cancer. She left her job to care for him, helping him until he died in March 2015. “The depth of my grief was really unbearable,” Ms. Fludgate said. “He was my life for 32 years. That was just us. So he’s gone, and I’m nothing. ” Ms. Fludgate retreated to her apartment, sitting at times in the dark, leaving her solitude only when her cats needed food. As her savings dwindled, Ms. Fludgate resorted to selling items like furniture and jewelry on eBay. She got rid of almost everything, hanging on to only a few items, including a sentimental pair of earrings she has had since she was 18. “It’s embarrassing,” she said. “I had a great job at a university. And then my life just fell apart. ” After seven months of painful grief, she finally forced herself from the couch, venturing to the Center at Lenox Hill Neighborhood House, an assistance center for older adults, to see what help it could offer her. “I realize you can only go so far deep into the rabbit hole,” Ms. Fludgate said. “So I came here, and I was truly a basket case. ” At the center, she was connected to the Service Program for Older People. She joined a bereavement group, was assigned a social worker and therapists and was prescribed antidepressants. “It was very cathartic to be with people who have experienced the hell of losing a loved one,” Ms. Fludgate said. Then in April 2016, eviction notices started appearing on her apartment door. “If I got thrown out, of course, I’d live in a women’s shelter on Park Avenue because I could tell people I was living on Park Avenue,” Ms. Fludgate said, her coping response characteristic of her humor, not haughtiness. Fortunately, in June, she successfully applied for disability and Social Security benefits, which included enough money to pay off her rental arrears, as well as mounting credit card debt. “It’s incredible, but I just want to get across how quickly, especially in this city, you come from the heights and then to get the depths of depression and the whole thing,” Ms. Fludgate said. She currently receives $1, 570 a month in Social Security, $154 in food stamps and a small stipend from a   job as a counselor for seniors, a job that ends this week. Last summer, her caseworker at the Service Program for Older People asked Ms. Fludgate if she needed anything, but she said she at first felt too guilty and too proud to tell the truth. Before long, Ms. Fludgate acknowledged she could use help and expressed her desire for new furniture to spruce up her barren apartment. The caseworker, Carola Chase, contacted FPWA, formerly the Federation of Protestant Welfare Agencies, one of the eight organizations supported by The New York Times Neediest Cases. It secured a $1, 000 grant in Neediest Cases funds to allow Ms. Fludgate to buy a sofa, a chair and a console table. “It’s really made a big difference,” she said. “I have had people to my house since I got the new furniture. ” Little by little, her life had been improving. On the first day of this year, Ms. Fludgate lost her health insurance coverage and could no longer afford her medication or receive the services that helped her with her grief. She maintains regular contact with the new friends she made in her bereavement group and leans on them often for assistance. She said she was grateful for every bit of support. “If I had stayed sitting on the couch, I would have lost another 20 pounds, but you wouldn’t have got me anywhere,” Ms. Fludgate said. She is considering trying to   the work force full time, she said. But she worries she is at the age where landing a job may be impossible. “I don’t have a   goal,” Ms. Fludgate said. “I’m just trying to do baby steps. ”'"}, "time": 1742561959.555044}