{"duration": 0.08257484436035156, "input_args": {"text": "'Slovenia Adds Water To Constitution As Fundamental Right For All People Nov 20, 2016 1 0 \\n“Everyone has the right to drinkable water.” This is what Slovenia’s newest article in their constitution states as the parliament voted 64-0 in favor of the amendment. \\nThis amendment to their constitution will serve to make water a right for all people in Slovenia and will stop it from being commercialized. Slovenia has some of the cleanest water in the world. \\nThe Guardian reports that the newest amendment states: \\n“Water resources represent a public good that is managed by the state. Water resources are primary and durably used to supply citizens with potable water and households with water and, in this sense, are not a market commodity. “ \\nMiro Cerar, who is the Slovenian Prime Minister, was in full support of the measure and stated that: \\n“People should protect water-the 21st century’s liquid gold- at the highest level. Slovenian water has very good quality and, because of it’s value, in the future it will certainly be the target of foreign countries and international corporations’ appetites. Pressure over it will increase and we must not give in.” Water and people first, corporations second. \\nThis marks Slovenia as the first European Union country to declare water as a common right for all people. According to Rampedre , there are 15 other countries in the world who have also done the same. \\nThis news comes at a great time not only for Slovenia, but also for all people around the world who are protecting water supplies, namely the water protectors in the United States at Standing Rock. With Slovenia making this amendment to the constitution, is it time that the United States does the same? \\nThe lies we are being told by those heavily vested in putting in the pipeline that would run under the Standing Rock Sioux Tribe’s water supply is being seen through. The people are awake and realize the severe consequences this pipeline would create not only for the tribe, but everyone that is affected by the water that runs downstream. Imagine all of the people affected by a pipeline break if this were to happen. \\nAgain, this news comes at a perfect time for water protectors everywhere. If an entire country can amend it’s constitution to protect water, then why can’t others? While the challenge at Standing Rock continues on, this latest story on Slovenia protecting it’s people and it’s water is a major victory for humanity. If you have friends or family helping to protect water, please share this good news with them and the world. Light will always overcome darkness. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742564551.1752272}