{"duration": 0.03174710273742676, "input_args": {"text": "'\\nWikiLeaks has released the 34th batch of emails from the hacked account of Hillary Clinton’s campaign chair, John Podesta, on the eve of the election. This latest tranche includes 888 communications.\\nMuch of the latest emails’ content repeats from previous WikiLeaks releases, because entire email threads are not always released at once.\\n‘Needy Latinos’ considered for VP \\nIn one leaked email, dated August 21, 2015 with the subject line ‘Needy Latinos and 1 easy call,’ Podesta writes to Clinton, “A few calls you might consider making,” apparently in relation to potential vice president choices.\\nPodesta then names Federico Pena, Bill Richardson and South Carolina Governor Jim Hodges. The first two are presumably the “needy Latinos.”\\nPena, former secretary of the US Department of Transportation under President Bill Clinton, endorsed Barack Obama over Clinton for the 2008 election and served as his campaign chair. He is covered extensively in the email.\\nPodesta goes on to say that Pena’s “Cabinet stints ripped up his family,” and that Pena “gave everything to the cause and no time to his family, he went through a messy divorce in the late 90’s and was left really down and felt like no-one reached out to him then so he felt pretty cut off from Clinton World.”\\nPodesta, passing along all of this information after speaking with former Secretary of the Interior Ken Salazar, gives Clinton four steps in completing a call with Pena, writing: “1) you really enjoyed seeing Cindy at the Chambers event and appreciate her support. 2) ask him how he’s been doing 3) ask about his views on the race and what she should be doing in Colorado 4) ask that he consider publicly supporting you.”\\nAn email reply from Hillary Clinton herself reads: “Agree about calls. Just a few additional points: several Latinos have asked that I consider Pena for VP.”\\nOn Richardson, a former governor of New Mexico and US ambassador to the UN under President Clinton, Podesta writes that a recent phone call between Bill Clinton and Richardson went well, “not withstanding the fact that [Richardson] can be a dick.”\\n“He had a good conversation with the President and has been good in his interviews since,” Podesta says of Richardson, telling Hillary that a call to Richardson ahead of his upcoming appearance on NBC’s ‘Meet the Press’ might seal an endorsement.\\nDonna Brazile \\nThe extent of the cozy relationship between the Clinton campaign and CNN was revealed in an email from the former head of the Democratic National Committee, Donna Brazile, which contained, almost verbatim, the wording of a question Clinton was to be asked at a town hall in Ohio.\\nSent the day before the televised event, which aired on March 13, 2016, Clinton is given the wording for a question she will be asked regarding discrimination amongst trade unions.\\nAlso included is the wording of a question her opponent Bernie Sanders is to be asked on income inequality.\\nSource \\n'"}, "time": 1742628605.4649417}