{"duration": 0.06612753868103027, "input_args": {"text": "'Theresa Crouse November 24, 2016 How To Meet The Challenges Of Urban Farming \\nUrban gardening and, to a smaller extent urban farming, started as a way for people who live in urban environments to grow healthy food untainted by chemicals. For some, it was a way to grow food that was healthy; for others, it was a way to be able to afford to eat good food. People wanted to grow their own food even though they lived in a city. \\nRegardless of why or how it started, urban gardening has grown to epic proportions and is now a movement committed to producing healthy, sustainable, locally-sourced food. \\nUrban farming is coming along, but it’s harder to keep animals in many urban areas. \\nIt’s not easy to grow food in a city, so people got creative. They went from growing a couple of plants in a pot or a window box to having a full garden in the middle of the city. \\nThere are several different methods of urban farming that range from a few plants and maybe a couple of chickens grown by one family to entire city lots grown and managed by co-ops of people with the same end goal. Indoor Gardening is great for somebody who has no porch, patio, yard, or roof where they can grow food. All plants are grown inside in containers or even small, indoor greenhouses. Some people are even lucky enough to have a solarium. Container Gardening works well for people who have small yards, porches, patios, decks, or balconies where they can grow food in containers. Window boxes, small raised beds, barrels, pots, and even kiddie pools serve as containers that plants can grow in. Community Gardening is becoming a big deal in a lot of areas. Neighbors or community members are coming together and planting edible plants in community places such as parks or other outdoor public areas. Some communities are now actually encouraging people to grow gardens on empty, abandoned lots because it makes the neighborhood look better and raises property values. Guerilla Gardening is actually one of the most interesting urban gardening methods that I’ve heard about. People subversively grow plants in public places or spaces that don’t belong to them such as vacant lots, road medians, or even strips of dirt beside sidewalks. Green roofs are a relatively new development, at least on a wide-scale basis. Roofs are designed specifically with a growing medium so that plants and trees can be grown to eat, clean the air, or make the area beautiful. \\nThere’s no doubt that urban gardening is a good thing. It brings people together and adds green space to concrete while providing locally sourced food and plants that help clean the air. \\nUrban gardens can also help mitigate soil erosion and the urban heat island effect. Finally, it teaches inner city kids the value of growing things and even provides green recreational and leisure space. \\nThe problem is that some people don’t see the benefit of it. That wouldn’t be so bad if those people weren’t complaining neighbors and members of local governments who want to put a stop to it. This was a huge issue when urban gardening was just something “troublemaking hippies” were doing. \\nThankfully, it’s now becoming the vogue thing to do – thanks in large part to popular restaurants and TV shows that promote locally-sourced foods and environmental sustainability. \\nBecause of the growing popularity and the improvements in property values due to turning a vacant lot into a garden, local governments are coming around. \\nHowever, for many of us, the struggle is still real because the problem still exists: you have no space to grow the garden that you dream of so that your family can eat healthfully and maybe even grow some of your own stockpile. \\nYou have plenty of options, though. You can grow a small garden indoors, or if you have a small yard you can do some raised beds. You can even grow a portable garden! \\nTalk to the Local Farmers \\nBut say you want to do more than grow a few plants in your house or yard – what then? How do you get involved in the bigger scene? \\nWell, if you have a local farmers market, then that would be a great place to start. Go down and talk to some of them. \\nYou’ll be surprised how friendly most farmers are, and how willing they are to share information. Though cities can be huge, the farming community is probably relatively close-knit, so if you can’t find anybody who is directly involved in the local urban gardening projects, somebody can almost surely point you in the right direction. \\nStart Your Own Urban Farming Movement \\nHave you and the neighbors been talking about how nice it would be to start growing your own food? If so, you may have found some resources that you didn’t realize that you had. Hold a neighborhood meeting and see what others are willing to do. \\nIt could be that the big empty lot between you and your neighbor is actually owned by that guy so that he didn’t have somebody move in right next to him. If so, they may be open to making it useful, and you will have a place to start your garden. Organize it! \\nMost municipalities don’t care as much about urban gardening as they do about urban farming. Pepper plants and apple trees don’t seem to cause as many problems as goats and chickens do. \\nWhile laws often support (or at least don’t forbid) urban gardening, most cities do not support the presence of animals within the city limits. That’s a fight you can pick, if you want, at the local level. \\nPersonally, it may be better to talk to your neighbors to see how they feel about seeing or hearing chickens in your back yard. If you can work with them from the beginning, you may not have as many problems as you would have if you had bought some critters without speaking with them first. Even if they say no, at least you know they’re going to complain. \\nYou can also talk to some of the local co-ops about keeping animals on a farm outside the city or participating in a meat-share or produce-share with them. You have so many options; you just need to find them. \\nStart growing your own food even though you live in the city. With just 10 minutes a day, you’ll never have to worry about feeding your family again. Click the banner below to discover a great option to start your urban farming! \\nThis article has been written by Theresa Crouse for Survivopedia. 17 total views, 17 views today'"}, "time": 1742628508.6435273}