{"duration": 0.0949087142944336, "input_args": {"text": "\"Share on Facebook Scholars have estimated that, prior to the ‘discovery’ of the Americas by Europeans, the pre-contact era population could have been as high as 100 million people. American anthropologist and ethnohistorian Henry F. Dobyns, most known for his published research on American Indians and Hispanic peoples in Latin and North America, estimated that more than one hundred and twelve million people inhabited the Americas prior to European arrival. He approximated that ten million alone inhabited an area north of the Rio Grande before European contact. In 1983, he revised that number to upwards of eighteen million. ( source )( source )( source ) It's also important to note that other scholars have estimated the number to be as low as ten million, and everything in between. For example, William M. Denovan, Professor Emeritus of Geography at the University of Wisconsin-Madison, believes there were approximately fifty four million inhabitants. ( source ) The important point to take from this is that there were already a lot of people inhabiting the Americas prior to European contact. People that were advanced, with extensive knowledge of medicine, the cosmos, and much more. What happened when “first contact” transpired? A massive decline of the indigenous population, that's what. It's one of, if not the, most dramatic declines of population in the known history of our planet. The number of Native Americans quickly shrank by roughly half right after European contact. This alarming transformation is attributed to disease, warfare, enslavement (Indian slave trade), and a disruption of the social systems of the indigenous, all of which had devastating effects on the populations that inhabited the Americas. ( source ) Think about this for a moment. A population which was somewhere in the range of ten million to a possible one hundred million people shrank to a few hundred thousand by 1900… This was, as many scholars believe, nothing short of an extermination, which we can attribute to various causes. David Stannard, American historian and Professor of American Studies at the University of Hawaii, reveals in his work that the native people were caught between imported plagues and barbarous atrocities, which resulted in the annihilation of 95 percent of their populations. In his book American Holocaust, he asks what kind of people would do such horrendous things to others. He and many others emphasize that the perpetrators of the American Holocaust drew on the same ideologies as would later the architects of the Nazi Holocaust. ( source ) It doesn't seem like things have changed much at all. Prior to the arrival of the Europeans, the Catholic Church had completely taken over Europe, wielding their power to control both people and ideas. There was no separation of church and state, as all citizens were required to abide by the rules and beliefs of the church. If not, they were deemed outlaws and heretics, and were even hunted and killed. This type of activity and “brainwashing,” so to speak, can be traced back all the way to ancient Rome, and all the way forward into our very recent history. Its influence can be seen in the mass brainwashing and manipulation of our minds today. This point is also made clear by Stannard. In Canada, for example, “ residential schools ” were set up all over the country. These were government-sponsored religious schools established to assimilate aboriginal children into Euro-Canadian culture, a culture that was made by the ruling elite for everyone else to “fit” into. This system originated in France not long after the arrival of the Europeans into the Americas, and was originally conceived by Christian churches and the Canadian government to educate (brainwash) and convert aboriginal youth and to integrate them into Canadian society. But was that the real purpose? When I say Canadian government, I mean the Department of Mining and Natural Resources. In the 1930s, the headmasters of the residential schools were made the legal guardians of all native children, ripping them away from their parents under the oversight of the Department of Mines and Resources. All parents were forced to surrender legal custody of their children to a principal or a church employee, or face imprisonment. A few years later, “Indian Affairs” was taken over by the Federal Government's Citizenship and Immigration Office. ( source )( source )( source ) Children were killed, abused, and raped at these schools. They were also subjected to nutritional experiments by the federal government in the 1940s and the 1950s, and were used as medical test subjects as well. Many of these victims and their bodies have vanished without a trace. Apart from the massive genocide that killed millions, the residential school program itself is considered to be a genocide. Below are three statements that shed light on the harsh reality of what went on: “I was just eight, and they'd shipped us down from the Anglican residential school in Alert Bay to the Nanaimo Indian Hospital, the one run by the United Church. They kept me isolated in a tiny room there for more than three years, like I was a lab rat, feeding me these pills, giving me shots that made me sick. Two of my cousins made a big fuss, screaming and fighting back all the time, so the nurses gave them shots, and they both died right away. It was done to silence them.” – Jasper Jospeh, a sixty four year old native man from British Columbia, speaking while his eyes filled with tears. ( source ) “We do know that there were research initiatives that were conducted with regard to medicines that were used ultimately to treat the Canadian population. Some of those medicines were tested in aboriginal communities and residential schools before they were utilized publicly.” – Chief Wilton Littlechild of the Truth and Reconciliation Commission. ( source ) “We believe that what's already been exposed represents only a fraction of the full, true and tragic history of the residential schools. There are no doubt more revelations buried in the archives.” – Assembly of First Nations Regional Chief Bill Erasmus ( source ) Aboriginal people in Canada, in our very recent history, were deliberately killed, and this has been confirmed by eyewitness testimony, documents, government records, and statements of Indian agents and tribal elders. Some estimate the mortality rate in residential schools to be upwards of fifty percent. We are talking about more than 50,000 native children across Canada, possibly more. ( source ) The massive genocidal campaign that started hundreds of years ago has continued until this very day. And the fact that this system operated under legal and structural conditions which encouraged, aided, and abetted murder is disturbing to say the least. Keep in mind, these horrors were perpetrated in Canada; one can only imagine what went on in the United States and South America. So much of our history is hidden from us. The United States alone classifies more than 500 million pages of documents each year. For a historian looking to examine and preserve the history of their nation, how are they supposed to do this when most of their history is being kept hidden or even deliberately altered? Concluding Comments & Why This Information Is So Relevant Our recent history has shown us that there was a major genocide in Canada – a deliberate mass murder of the indigenous populations by the ruling elite in order to take over their land and its resources and establish their dominance, just as the same group of elite was doing all over the world. This is very recent history, and the brainwashing/assimilation campaign of all people (not just indigenous) continues today. The world has become extremely “Americanized.” Through mass marketing and assimilation tactics, we have been manipulated into leading the same lives and following the same path. This “plan” of “world dominance” and global takeover seems to have started hundreds, if not thousands, of years ago and has extended itself all the way to the present day. So what can we do now? We can listen to the message of the core of indigenous cultures that occupied this land before we did. It's time for us to return to our roots, and stop destroying the planet as we have been for so many years. If we don't choose to change now, it does not look like we will be moving forward. It is this type of message which we should take from our recent, ugly history. Messages about love, respect, oneness, our connection to mother Earth and our spiritual heritage... among other things. We are part of Creation, thus, if we break the laws of Creation we destroy ourselves. We, the Original Caretakers of Mother Earth, have no choice but to follow and uphold the Original Instructions, which sustains the continuity of Life. We recognize our umbilical connection to Mother Earth and understand that she is the source of life, not a resource to be exploited. We speak on behalf of all Creation today, to communicate an urgent message that man has gone too far, placing us in the state of survival. We warned that one day you would not be able to control what you have created. That day is here. Not heeding warnings from both Nature and the People of the Earth keeps us on the path of self destruction. This self destructive path has led to the Fukushima nuclear crisis, Gulf oil spill, tar sands devastation, pipeline failures, impacts of carbon dioxide emissions and the destruction of ground water through hydraulic fracking, just to name a few. In addition, these activities and developments continue to cause the deterioration and destruction of sacred places and sacred waters that are vital for Life. – Chief Looking Horse (you can view a video of him making this statement here ) Related:\""}, "time": 1742628515.103167}