{"duration": 0.034426212310791016, "input_args": {"text": "'. Angelina Jolie Exposes Hollywood Satanic S&M Rituals in Leaked Video A stunning video has surfaced in which a 23-year-old Angelina Jolie reveals the true inner workings ... Print Email http://humansarefree.com/2016/11/angelina-jolie-exposes-hollywood.html A stunning video has surfaced in which a 23-year-old Angelina Jolie reveals the true inner workings of Hollywood as she describes her experiences participating in Satanic S&M rituals to close friends. In 1999 an anonymous source secretly filmed Angelina Jolie, then aged 23, speaking to two close friends about the initiation rituals she had recently taken part in while attempting to establish herself in Hollywood. In the following video (below), Angelina describes in detail the gruesome ritual celebrities must go through. During the ritual you are tied up, raped, and tortured by other members. She compares the secret society rituals to S&M, but claims there are differences.At times Angelina looks crazed and possessed while describing to her friends the experiences she had with the Satanic secret society. She explains that she killed a snake as a sacrifice and was tattooed as part of the initiation ritual. It is well known that many members of various Secret Societies get tattoos as part of the ceremony, as a way of sacrificing more blood to Satan. “My snake, I tried, I had to kill him,” Jolie said. It has long been claimed that Hollywood stars and other celebrities need to join the Luciferian secret society in order to establish their career in the cutthroat business and make it to the top, and in the secrets filmed video Angelina can be heard telling her friends that she has encouraged other celebrities to go through the initiation and join the secret society. Shocking Expose: I Was in the Illuminati I’m Going to Tell You Everything The tape also reveals that Jolie showed a recording of a ritual to one of her friends. Her friend, speaking in halting tones, describes viewing the footage, saying: “I only saw that film that she [Angelina] bought over that night. People who are, like, darker… It’s great to be able to see everybody’s sexuality, but it’s so weird when you just… I have the most amazing compromising pictures of people.“ The video has now been posted online, with the identity of her two friends redacted for their safety. Here it is: By Baxter Dmitry  '"}, "time": 1742628517.6555183}