{"duration": 0.06326079368591309, "input_args": {"text": "'US Election Calls Out Global Warming Hoax November 09, 2016 US Election Calls Out Global Warming Hoax \\nDonald Trump\\'s election as U.S. president triggered fears that his view that global warming is a hoax might lead other nations to scale back ambitions under a landmark climate change deal, while renewable energy stocks fell on world markets. \\nTrump\\'s victory over Democrat Hillary Clinton cast a dark cloud over delegates attending a 200-nation meeting in Marrakesh being held from Nov. 7-18 to celebrate the start of the 2015 Paris Agreement to limit global warming last Friday. \\nLISTEN MORE: RUSSIAN SCIENTIST SAYS THAT WE ARE EXPERIENCING AN ICE AGE RIGHT NOW \\nTrump has threatened to tear up the Paris accord for cutting greenhouse gas emissions, worked out in two decades of tortuous negotiations by countries as diverse as China, Pacific islands and OPEC oil producers. \\nSome delegates expressed concern that Trump, who in the past has dismissed climate change as a hoax, could cause other nations to reconsider their position on global warming. Trump has also said climate change was an invention by China and wants instead to promote jobs in the U.S. fossil fuel industry. \\n\"We will have a lot more hurdles,\" said Ian Fry, head of the delegation of Tuvalu, a Pacific island state which fears rising sea levels, adding Trump\\'s victory could have a \"domino effect on other nations\". \\nThe Paris Agreement allows all nations to set national targets to slow climate change and some could scale those back. The Marrakesh talks are also meant to start writing a \"rule book\" to oversee the pact that might be less stringent without the United States. There are no sanctions for non-compliance. \\nBut many nations vowed to push ahead despite Trump with the sweeping plan to phase out net global greenhouse gas emissions between 2050 and 2100 by shifting from coal and oil to cleaner energies such as wind or solar power. \\n\"No change,\" Japan\\'s delegation chief Shigeru Ushio told Reuters of Japan\\'s policies. He noted that the agreement says it will formally take four years for any country to pull out of the agreement - the length of Trump\\'s presidential term. \\nOn markets, Trump\\'s victory drove down renewable energy stocks. Shares in Vestas <VWS.CO>, the world\\'s biggest wind turbine maker, were down 6.2 percent in mid-morning, while German peer Nordex <NDXG.DE> traded 6.6 percent lower. \\n\"DARK, DARK DAY\" \\nMany delegates expressed hopes Trump as president would accept mainstream scientific findings. A U.N. panel of climate scientists says it is at least 95 percent likely that man-made emissions are the main cause of rising temperatures since 1950. \\nAverage global temperatures this year are set to be the hottest in records dating back to the 19th century, beating 2015. \"Even Donald Trump cannot do anything about the laws of physics,\" Laurence Tubiana, France\\'s climate ambassador, said. \\nShe told Reuters she was betting \"all countries will stick to the Paris Agreement\" as rising temperatures were damaging the global economy with more heatwaves, floods and droughts. \\nCampaigners for more action on climate change were shocked. The United States is the number two greenhouse gas emitter behind China. \\n\"This is a dark, dark day,\" said Jesse Bragg, of Corporate Accountability International. \"My heart is absolutely broken,\" said Becky Chung of SustainUS. \\nAmong statements about climate change, Trump asked in a January 2014 Tweet amid a cold snap: \"Is our country still spending money on the GLOBAL WARMING HOAX?\"  '"}, "time": 1742564195.4031754}