{"duration": 0.08770751953125, "input_args": {"text": "'The mayor of Laredo, Texas, Pete Saenz, is now calling President Donald Trump’s Executive Order to begin construction of a border wall “offensive”. [In an interview with CBS News, Saenz said Trump’s border wall plan is “divisive” because of its physical appearance and the “psychological impact” it will have on tourists visiting Laredo.  “It serves as a negative psychological impact on people that visit our city,” Saenz told CBS. “Could you imagine having a city with a huge wall there? It’s not very inviting. It’s very divisive. ” Saenz’s town of Laredo sits right on the   Border and is a   area for not only illegal aliens, but the Mexican drug trade as well. As Breitbart Texas reported, Laredo is one of the main hubs for drug smuggling by the Los Zetas Cartel, sitting just north of Nuevo Laredo, Mexico, often considered the “home base” of the criminal organization. The CBS News piece also makes a point to portray border walls as not necessarily working, in terms of keeping illegal immigrants out of the country and preventing an   of drugs, titling the piece “Critics on why building a Mexico border wall won’t be effective. ” Unlike local Democratic politicians like Saenz opposing the border wall, U. S. Border Patrol agents have praised Trump’s immediate action at the border, as Breitbart Texas reported. “We know we won’t have a wall along the 2, 000 miles of border,” the President of the Local 2455 of the National Border Patrol Council Hector Garza said. “What we will have is a wall where it is needed. That barrier with proper manpower, resources, technology and other tools will be effective. But most important, for the first time we have a president that wants to secure the border. ” John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742564005.5237048}