{"duration": 0.0750586986541748, "input_args": {"text": "'License DMCA \\nThere is an epic clash of two cultures -- one with a guiding ethic of harmony between people and nature, the other driven by an ethos that encourages the exploitation of both. Yet, for months, our clueless media gave this match-up little coverage. \\nFor the face-off is between Energy Transfer Partners, one of the world\\'s largest pipeline corporations, and the Standing Rock Lakota Sioux Tribe. It\\'s not merely big news, but the panoramic story of America itself. It\\'s a real reality show -- a cultural, political and moral drama featuring raw greed, grassroots courage, class war, ancient rites, human rights, defenders of the common good, the most nefarious Texas oilman since J. R. Ewing, a historic gathering of Native tribes and a Bull-Connor-style sheriff -- all on location near a North Dakota town named Cannon Ball! \\nThe Dakota Access Pipeline is a massive 1,172-mile-long pipeline being constructed by EPT. It will cut through North Dakota, South Dakota, Iowa and Illinois. This pipeline, owned by oilman Kelcy Warren, crosses 200 rivers and countless farms, and it cuts through the ancestral lands and burial grounds of the Tribe. \\nDAPL risks economic and environmental disaster. The corporation plans to bury its oil pipeline under the Missouri, beneath the Lakota people\\'s main source of water for drinking, bathing, irrigation, fishing, and recreation. As a Lakota phrase says -- water is life -- and one rupture could be ruinous. \\nIn April, the Standing Rock Sioux made their stand. Some 35 tribal leaders established Sacred Stone Camp, just off their reservation and near where ETP\\'s engineers intend to tunnel under the river. After the tribe\\'s social media network spread word of the rebellion, a spontaneous migration of Native people -- not coordinated by anyone -- began arriving at the camp to stand in solidarity against ETP. - Advertisement - \\nThey came in cars, campers, and caravans -- some even paddled down the Missouri in traditional canoes. By August, representatives of 280 Native American tribes had joined, making this the largest, most diverse, cross-tribal action in U.S. history. Sacred Stone Camp pulsated with a sense of rediscovered power, ancestral duty, and indigenous culture. Not only were spirits high, but the extraordinary unity of so many diverse Native cultures -- boldly gathering in a show of strength and shouting \"NO\" to yet another arrogant act of gross injustice -- seemed to herald a reawakening. \\nAs the protest gained strength -- and was joined by thousands of progressives and covered by independent media -- ETP and its political minions responded predictably: with panic, whining, lies, and brute force. \\nNorth Dakota\\'s governor, Jack Dalrymple falsely wailed that \"unlawful acts associated with the protest near Cannon Ball have led to serious public safety concerns and property damage.\" He declared a state of emergency, set up road blocks to seal off the reservation, brought in riot-clad troopers, removed state water and health services from the protest area, and used his state PR machine to demonize the activists as a violent threat to surrounding towns of white people. \\nETP\\'s legal beagles have attempted to silence protesters by filing hokey lawsuits against several tribal leaders and activists that may be aimed at bankrupting defendants with legal fees; seeking a federal injunction against anyone interfering with pipeline construction; and threatening to prosecute Native Americans for -- Oh, the irony! -- trespassing on land that was theirs before it was stolen from them. \\nOn Labor Day weekend, a DAPL crew suddenly started construction on the under-river tunnel, reportedly damaging tribal burial sites. When unarmed protesters put their bodies in front of the machinery, a line of private \"pipeline guards\" showed up and blasted at least 30 protesters with pepper spray and sicced a pack of attack dogs on them. At least six people were bitten, including a child and a pregnant woman. - Advertisement - \\nAt least four reporters have been charged with everything from criminal trespass to conspiracy for trying to cover what the mainstream media won\\'t touch. Charges are still pending for some of these journalists. \\nStanding Rock tribe\\'s chair, Dave Archambault has made clear that the Native people are committed to the higher values of \"our lands, people, water, and sacred sites.\" As they have been for millennia, the tribe\\'s actions today must be based on the common good of their grandchildren and their grandchildren-generations into the future. The Standing Rock Sioux are in this fight for the long haul: \"Our fight isn\\'t over until there is permanent protection of our people and resources from the pipeline. We won\\'t stop until they [EPT] stop.\" To find out more and join the fight, go to www.SacredStoneCamp.org .'"}, "time": 1742562219.3937988}