{"duration": 0.09851646423339844, "input_args": {"text": "'Wikipedia: Eliot A. Cohen ... co-founded the Project for the New American Century (PNAC), which was a center for prominent neoconservatives. He has been a member of the Defense Policy Board Advisory Committee, a committee of civilians and retired military officers that the U.S. Secretary of Defense may call upon for advice, that was instituted during the administration of President George W. Bush. He was put on the board after acquaintance Richard Perle put forward his name. Cohen has referred to the War on Terrorism as “World War IV”. In the run-up to the 2003 Invasion of Iraq, he was a member of Committee for the Liberation of Iraq, a group of prominent persons who pressed for an invasion. \\nCohen in WaPo May 3 2016: It’s over. Donald Trump, a man utterly unfit for the position by temperament, values and policy preferences, will be the Republican nominee for president. He will run against Hillary Clinton, who is easily the lesser evil ... \\nCohen in the NYT on May 17 2016: Mr. Trump’s temperament, his proclivity for insult and deceit and his advocacy of unpredictability would make him a presidential disaster — especially in the conduct of foreign policy, where clarity and consistency matter. ... Hillary Clinton is far better: She believes in the old consensus and will take tough lines on China and, increasingly, Russia. \\nCohen in The American Interest on November 10 2016 (immediately after Trump won): Trump may be better than we think. He does not have strong principles about much, which means he can shift. He is clearly willing to delegate legislation to Paul Ryan and Mitch McConnell. And even abroad, his instincts incline him to increase U.S. strength—and to push back even against Russia if, as will surely happen, Putin double-crosses him. My guess is that sequester gets rolled back, as do lots of stupid regulations, and experiments in nudging and nagging Americans to behave the way progressives think they should. \\nCohen on Twitter November 15 2016 Eliot A Cohen @EliotACohen \\nAfter exchange w Trump transition team, changed my recommendation: stay away. They\\'re angry, arrogant, screaming \"you LOST!\" Will be ugly. \\nRetweets 3,719 Likes 3,204 5:07 AM - 15 Nov 2016 \\nI find the above very funny. How could that turncoat think he would be greeted by the Trump organization with anything but derision? Cohen believed he and his ilk would be welcome with candies and roses after insulting Trump in all major media? Who is the arrogant one in the above? \\nOh, by the way. Here is a headline from October 2013: President Obama to Republicans: I won. Deal with it . I do not remember Cohen, or anyone else, calling that \"arrogant\". \\nWhile the papers are full of (badly) informed rumors about who will get this or that position in a Trump administration let\\'s keep in mind that 90% of such rumors are just self promotions by people like Cohen who shill for the rumored job. That is why I will not write about John Bolton or Rudy Giuliani as coming Secretary of State. Both are possible (unqualified) candidates. But others are just as likely to get that position. We will only know who it is after the official release. \\nMeanwhile Trump yesterday had a phonecall with the Russian President Putin. They discussed bilateral relations, Syria and fighting terrorism. Today the Russian and Syrian military started the long expected big campaign against the \"moderate\" al-Qaeda in east-Aleppo city and Idleb governate. Air strikes on east-Aleppo had been held back for 28 days. Today missiles and cruise missiles were launched against fixed targets and dozens of carrier and land launched airplanes attacked Nusra position on the various front and in its rear. Long range bombers flown from Russia joined the campaign. Trump seems to have voiced no objections to this offensive. \\nThe Russian military has upped its air defense in Syria. Additional to the S-400 system around its airport in Latakia seven S-300 systems were deployed as a screen against U.S. cruise missile attacks. These are joined by rehabilitated Syrian S-200 system and Pantsyr S-1 short range systems for point defense. This should be enough to deter any stupid idea the Pentagon hawks, or dumb neocons like Eliot Cohen, might have. Posted by b on November 15, 2016 at 12:13 PM | Permalink'"}, "time": 1742564428.9565916}