{"duration": 0.01587200164794922, "input_args": {"text": "'  Donna Brazile Latest Casualty In Crooked Hillary Email Scandal As CNN Gives Her The Boot For Lying “We are completely uncomfortable with what we have learned about her interactions with the Clinton campaign while she was a CNN contributor,” CNN spokeswoman Lauren Pratapas said in a statement, according to Politico.   CNN has severed its relationship with Democratic strategist Donna Brazile after it became clear that she was secretly sharing information about CNN events with Hillary Clinton’s presidential campaign. \\nEDITOR’S NOTE: Debbie Wasserman-Schultz was fired when WikiLeaks revealed she was heading a covert operation to steal the nomination from Crooked Hillary, she was replaced by Donna Brazile . WikiLeaks then showed us that Donna Brazile was feeding the interview questions from CNN to Crooked Hillary before the interviews and town halls took place. CNN today made a formal announcement of the severing their relationship with Donna Brazile. We are watching the complete destruction of not only the Clinton Crime Machine but of the reputation of the DNC as well. \\n“We are completely uncomfortable with what we have learned about her interactions with the Clinton campaign while she was a CNN contributor,” CNN spokeswoman Lauren Pratapas said in a statement, according to Politico . \\nBrazile apparently emailed Clinton campaign staff leaked information about a CNN town hall in Flint, Michigan. Democrat Donna Brazile On Final Debate and Email Scandal: \\n“One of the questions directed to HRC tomorrow is from a woman with a rash,” Brazile noted in the email . “Her family has lead poison and she will ask what, if anything, will Hillary do as president to help the ppl of Flint.” In March, Brazile emailed to warn the campaign about Clinton’s stance on the death penalty. \\n“From time to time I get the questions in advance,” she wrote in the subject line, noting that she was worried about Clinton’s response. CNN’s Jake Tapper CONDEMNS DNC Chair DONNA BRAZILE \\nAccording to CNN , the network accepted Brazile’s resignation as a CNN contributor on October 14. \\nCNN announced the decision on Monday, October 31, after more emails were revealed.  '"}, "time": 1742628507.2401867}