{"duration": 0.10652041435241699, "input_args": {"text": "'On Friday’s Breitbart News Daily, SiriusXM host Joel Pollak asked Secretary of Commerce Wilbur Ross about the possibility of a free trade deal with Europe in the wake of America’s withdrawal from the Paris climate accords. [Ross recommended such a trade deal for several reasons.  “First of all, Europe has much higher trade barriers than we have,” Ross said. “For example, in automotive, their tariff on American cars going into Europe is ten percent. Our tariff on European cars coming into America is     percent. That’s a     percent disadvantage that our exporting companies are at, relative to the European ones. ”  “Problems like that, we would like to address because those are part of the reason why we have a trade deficit with Europe,” he said. “The other part of the reason is currency,” Ross continued. “The euro has been very, very weak relative to the dollar. That, therefore, makes their competitive position much better than it would have been if the euro had stayed stable. ” “There are quite a lot of issues that we have with Europe, and we would like to try to negotiate them,” said Ross. “If we cannot make a sensible deal, we obviously won’t go forward with it. ” Ross looked beyond European complaints about the United States’s pulling out of the Paris accords to see tough negotiations would be required to convince Europe to lower its tariffs. “The reality is, we do have a big trade deficit with Europe. The other reality is, a lot of that comes from automotive, and no small portion of that is this difference in tariff rates,” he contended. Ross explained that coal was another U. S. industry disadvantaged by the Paris accords in favor of foreign competitors. “Both India and China, who are the two huge users of coal for electric utilities, both of them were permitted to use more   plants in the years going forward,” he said. “In the case of China, on a total basis, they were able to increase their emissions for 13 years, and a lot of that would be coming from coal. ” “It’s ludicrous that U. S. coal would be shut down because we were agreeing to these very strict things, whereas even   more pollutive coal in countries like China would be allowed to flourish. That doesn’t strike me as very balanced,” said Ross. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742563336.6679108}