{"duration": 0.09863615036010742, "input_args": {"text": "'Just days before a public town meeting on Tuesday night, Jess Herbst, the mayor of New Hope, Tex. had an official announcement. “I am transgender. ” The statement said that she had transitioned and would no longer use the name Jeff. The message was  a few hundred words long and appeared on the home screen of the official website of New Hope, a town of more than 630 residents about 40 miles north of Dallas. But she appeared to break barriers for the state. “As far as I know, I am the first openly transgender mayor on record in the state of Texas there could be others who never came out,” Ms. Herbst said in an interview on Wednesday. “But I am the first to say, ‘Yes I am transgender and a seated mayor.’ ” Ms. Herbst informed residents in a statement on the town’s website about the change, and the joys of her life as a woman, including her preference in pronouns and the endurance of her marriage. “As your mayor I must tell you about something that has been with me since my earliest memories,” Ms. Herbst wrote. “I am Transgender. Two years ago, with the support of my wife, daughters and    I began hormone replacement therapy (HRT). “At the time, I did not imagine I would hold the mayor’s position, but here I am. ” Ms. Herbst has been active in local government since 2003 as an elected alderman, road commissioner and mayor pro tempore. In 2016, she was appointed New Hope’s mayor after the previous official in that post died. As of Wednesday morning, the New Hope town website was still referring to her as Mayor Jeff Herbst. But Ms. Herbst implied in her statement that she was patient: “I’m not especially sensitive to the pronoun I’m called, and I expect people to take time to make the change. I use the name Jess, a simple change from Jeff. ” “I live my life as a female now, and I will be performing my duties to the town as such,” she wrote. On the town website, she also invited the public to make comments in the town’s public meeting on Jan 31. Ms. Herbst, 58, said in a telephone interview that after posting her statement on Jan. 23, she attended the council meeting for the first time dressed as a woman.’ ”“It was phenomenally positive everyone was supportive,” she said. “We had a fairly packed crowd for a tiny town  —   there were 15 or 20 people there. I explained to the people who had not just had a chance to see the website, and everybody said, ‘O. K.,’ and we went on and had a meeting. ”” ’But as an elected official who was later appointed as mayor, Ms. Herbst said that she was given a “very stern lecture” by the town attorney about laws that govern elections and canvassing, and that she was told not to change her name before the coming election cycle. Ms. Herbst also said she has received thousands of messages of support, and three negative ones. Replies to announcements on her Facebook page and the town’s website appear to be supportive, with residents praising her for coming forward in a state where, in most parts, it is legal to discriminate against people on the basis of sexual orientation and gender identity, according to the American Civil Liberties Union. In January, Lt. Gov. Dan Patrick, one of the most powerful Republican officials in the state, put Texas on the front lines of the nation’s culture wars when he announced the filing of a bill that would require people in government buildings and public schools to use the bathroom that corresponds with their “biological sex. ” Critics said the bill discriminated against transgender people. Terri Burke, the executive director for the American Civil Liberties Union of Texas, said Mayor Herbst was showing “tremendous courage in discussing her identity with the public. “We applaud Mayor Herbst’s decision to serve her community openly in public office and take a stand against hateful rhetoric coming from some of our legislators,” Ms. Burke said in an email. “Some Texas lawmakers are attempting to exclude transgender Texans from public spaces with legislation like SB6, but we should be making it easier for them to share their skills and talents with us, not pushing them out of public restrooms and public life. ” Ms. Herbst suggested on the city’s website that the culture was changing in the United States and directed constituents to her personal website, where she has kept a diary over the years. It included a gallery of photos titled, “Who I am now,” juxtaposed with a section called who “I used to be,” with images of her life as Jeff. Ms. Herbst said that she had the support of her family. Her wife grew up in New Hope, and the couple have lived in the town with their two daughters since 1999. “It is gender identity, not sexual preference that applies to me,” the mayor wrote. “I love my wife, and she loves me. We have no intention of change. My daughters have been adamant supporters of me and are proud to tell people their father is transgender. ” In the interview Wednesday, Ms. Herbst said she began living full time as Jess toward the end of September, and gradually broke the news to friends, family and  . Finally, there was no one left to tell but the wider town population, and that was when she made the announcement. “I am being who I am and doing what I have to do,” she said. “I am not trying to make some sort of big statement. ”'"}, "time": 1742562768.5114264}