{"duration": 0.07336878776550293, "input_args": {"text": "'LOS ANGELES  —   The powerful economic resurgence that has swept Southern California is on display almost everywhere here, visible in the construction cranes towering on the skyline and the gush of applications to build luxury hotels, shopping centers,   condominiums and acres of apartment complexes from Santa Monica to downtown Los Angeles. But it can also be seen in a battle that has broken out about the fundamental nature of this distinctively   and   city. The conflict has pitted developers and some government officials against neighborhood organizations and preservationists. It is a debate about height and neighborhood character the influence of   developers on City Hall and, most of all, what Los Angeles should look like a generation from now. This is a city that has long defied easy definition  —   at once urban, suburban and even rural  —   filled with people who live in homes with   gardens and open skies dotted by swaying palm trees, often blocks away from gritty boulevards, highways and clusters of office buildings. And it is no stranger to battles between entrenched neighborhood groups and   developers seeing opportunity in a wealthy market the   movement thrived here during the 1990s. But the debate this time has reached a particularly pitched level, fueled by a severe shortage of affordable housing, an influx of people moving back into the city center and the perception that a Southern California city that once seemed to have unlimited space for growth has run out of track. “What’s that old cliché?” Mayor Eric M. Garcetti said in an interview. “The sprawl has hit the wall in L. A. ” “It’s not whether or not density is going to come,” he said. “It’s whether we plan for it or not. People are like, ‘Oh my God, this is L. A. and they are going tall?’ Height makes you think it’s more dense. And it doesn’t always compute that way. You have to convince people. ” The resistance has been sharp, reflecting a widespread notion that much of the development has been disruptive and haphazard, as well as strong sentimental attachment to a city filled with handsome   neighborhoods and classic old homes. “Stop Manhattanwood” billboards have popped up in Hollywood, close to where two   towers were approved by city officials  —   after a long battle by neighborhood groups  —   next to the Hollywood Palladium concert hall. In Beverly Hills, which is a separate city from Los Angeles, a proposal by the Beverly Hilton to build what would be that city’s tallest building, a   hotel, has drawn opposition from the mayor in a   battle that will be decided in a ballot measure this fall. In Los Angeles, neighborhood groups, including opponents of the Palladium project, are collecting signatures for a voter initiative that would impose a   moratorium on    projects that require special city zoning variations. “You have huge buildings going on tiny little streets,” said Jill Stewart, who is directing the ballot initiative campaign. “Areas that cannot absorb the development. And communities that haven’t had the discussion about whether they want these buildings. ” The initiative needs 67, 000 signatures to be placed on the ballot. It already has 104, 000 signatures among its more prominent supporters is Richard J. Riordan, a Republican and a former mayor of Los Angeles. “Our city is rapidly being gentrified,” Mr. Riordan said. “The working poor  —   the lower middle class  —   are being pushed out of L. A. They are giving building permits to the developers, the ones that give money to the politicians, to build   buildings. ” Mitch O’Farrell, a member of the Los Angeles City Council, called the ballot initiative an overreaction, saying the city needed to encourage growth and development. “People have real concerns about how projects will affect their neighborhoods, which are legitimate,” he said. “But there are a lot of additional factors in the equation: the opportunities to bring economic growth, to create projects that improve the look of a community, that enhance the safety and security of a community and that also help provide needed tax dollars. ” A number of factors have contributed to the tensions. Los Angeles, like many other big cities dealing with traffic, has been encouraging development along   lines, such as the one that cuts through Hollywood. The city has also been roiled by a wave of developer   of picturesque homes in   neighborhoods, making way for big houses and stirring sharp opposition in many places. “Los Angeles was built as a suburban city  —   it was always put forth as a suburban city,” said Jonathan M. Zasloff, a law professor at U. C. L. A. who teaches land use and opposes the ballot initiative. “You could be in the city and still be in the country at the same time. So when you got a situation where it’s now a city that looks very different, the people who like the old way are trying to stop it from changing. “Change is scary  —   urbanization is scary,” he added. “People don’t trust the city. This is a way to stop it. But Los Angeles is not an example of a city where development has run riot. It just isn’t. ” There is a long history here of historically distinctive buildings’ being torn down to make way for new construction, setting off battles with preservationists. Many of the 88 cities in Los Angeles County have historical preservation ordinances, but their effectiveness varies, and much of the construction is proposed for open lots and strip malls. “The history of Los Angeles is in large part a history of ambivalence about dense development and especially about tall buildings,” Christopher Hawthorne, the architecture critic for The Los Angeles Times, wrote in an email. “We’ve always wanted to rank as a cosmopolitan,   city. At the same time, for more than a century we’ve had   committees, ballot measures and civic debates about height limits for new buildings. “What’s driving the newest wave of construction and its backlash, more than anything, is geography: We’ve run out of open space to build and at the same time hit the limits of sprawl,” he wrote. “Los Angeles is doubling back on itself, building in its midsection as opposed to gobbling up new territory along its periphery. We have finally realized that there are real benefits  —   in terms of water use, for example  —   to be gained by living more densely and more vertically. ” Los Angeles has also not rewritten its master plan, which regulates what should be built where, in nearly 30 years. That has led city officials to approve many projects case by case, fueling   suspicions that council members are bending to the will of powerful developers. Richard Platkin, a planner who used to work for the Los Angeles Department of City Planning, said the   spot zoning decisions meant that “you have very politically powerful institutions, and occasionally someone with deep pockets, who spends a lot of money to change the zone for one individual parcel. ” “The skyline gets ragged instead of harmonious,” he added. “It’s out of character and out of scale. ” Mr. Zasloff said growth was critical for the future of Los Angeles. “When you have the average renter paying nearly half of his income in rent, that is just unsustainable,” he said. “It’s unsustainable for a city that wants to be a healthy city. You can’t have a healthy city without a healthy middle class. And they have to have a place where you can afford to live. ”'"}, "time": 1742628436.0471847}