{"duration": 0.14630460739135742, "input_args": {"text": "'By Seizing the Definition of ‘Populism,’ Reuters Warns Us of Chaos to Come By Daily Bell Staff - November 10, 2016 \\nAfter Trump & Brexit, populist tsunami threatens European mainstream … Back in May, when Donald’s Trump’s victory in the U.S. presidential election seemed the remotest of possibilities, a senior European official took to Twitter before a G7 summit in Tokyo to warn of a “horror scenario”. Imagine, mused the official, if instead of Barack Obama, Francois Hollande, David Cameron and Matteo Renzi, next year’s meeting of the club of rich nations included Trump, Marine Le Pen, Boris Johnson and Beppe Grillo. -Reuters \\nBack in June, we identified what has become an overarching elite meme: “populism versus globalism.” \\nWe’ve never fully defined populism, and this Reuters article gives us an opportunity to examine the word and the context in which it is being used. \\nWith Trump’s triumph over his Democratic rival Hillary Clinton, the populist tsunami that seemed outlandish a few months ago is becoming reality, and the consequences for Europe’s own political landscape are potentially huge. \\nIn 2017, voters in the Netherlands, France and Germany – and possibly in Italy and Britain too – will vote in elections that could be colored by the triumphs of Trump and Brexit, and the toxic politics that drove those campaigns. \\nThe lessons will not be lost on continental Europe’s populist parties, who hailed Trump’s victory on Wednesday as a body blow for the political mainstream. “Politics will never be the same,” said Geert Wilders of the far-right Dutch Freedom Party. “What happened in America can happen in Europe and the Netherlands as well.” \\nWe can see from these excerpts that “populism” is not seen by Reuters as positive description. In fact, the synonym in the above excerpt is “toxic.” \\n“Populism” is contrasted to the “political mainstream” as well. This informs us that populism is irregular, even aberrant. We are living through unusual times and populism is the result. \\nWatching the “populism versus globalism” meme advance is fascinating because it is such a significant positioning of propaganda. \\nWe can see clearly that in many ways mainstream media around the world is not at all hesitant to reveal the basic organizational structure behind it. \\nThere is no way that populism – and, contrastingly, globalism – would appear ubiquitously in so many arenas without considerable unity among supposedly disparate media. \\nIn other words, the organization behind this is formidable. It’s not just this one example either that provokes our observations. The powers-that-be were not shy about illustrating the essential linkages between publications during Trump’s election. \\nThe mainstream sounded as one when it came to Trump. And top-down control was obviously evident, and commented on as well. \\nThe emergence of “populism versus globalism” doesn’t just provide us with evidence of editorial control. Even more importantly it shows us how those who secretly run our societies find this sort of meme-making to be a priority because it anticipates trends and reinterprets them. \\nBy beginning to disseminate the meme in the summer, elite media shapers were able to position fall’s narrative – Trump’s win in particular – within the larger context they’d already defined. \\nWe would suggest that the wave of “populism” sweeping over the US and Europe is at heart a resurgence of a yearning for freedom that is obviously slipping away – not that there was much of it to begin with. \\nBut the Internet has raised people’s consciousness about what they are losing, and why. As a result, more than ever, people are coming to understand the globalist narrative and are registering their disgust. \\nBut this is NOT going to be how the mainstream media interprets what is going on. We can already see that people’s determination to shake off political, monetary and military control is going to be interpreted as essentially greedy and selfish. \\nWe could see this interpretation emerge within the context of Trump’s increasing appeal. Over and over we were told that his support was “rural” and “white” – and that these individuals were flocking to Trump because they were feeling “left out” of the current prosperity and thus resentful. \\nOf course, one can interpret this trend much differently. Our perspective is that globalism is at fault here. Initiated and expanded by a tiny group of banking interests, globalism seeks to consolidate worldwide power with a tiny group of massive corporations, governments and technocratic leaders. \\nNo wonder why so many people in the West feel left out. This vision provides them no room to grow or prosper. In fact they are not – but their emotion at what’s occurring is perfectly reasonable and logical. We wouldn’t characterize it as resentment so much as rightful anger and frustration. \\nBut Reuters and the other mainstream media have gotten here first and are busily redefining what’s taking place. \\nWe’ve pointed out that the mainstream may be actively enhancing the meme now that they have gotten control of it. \\nThe idea is to marry this emergent propaganda with “directed history” and create a series of economic and political disasters that can be directly (if illegitimately) linked to “populism.” \\nAs populism is denigrated, globalism, in our view, will be uplifted. We’ll be subject to considerable contrasts between “toxic” populism and erudite – “mainstream” – globalism. \\nWe’ve already indicated that we believe this meme is a cultivated one. We don’t believe that the sudden emergence of populism throughout the West is simply coincidental or even evolutionary. \\nWe think this meme is being deliberately cultivated and that it is part of a larger Hegelian dialectic that is intended to reinforce globalism in the long-term. You can see some additional speculation here. \\nHere at DB we analyze elite memes, their significance and impact. It’s clear to us that the mainstream media is “out front” when it comes to defining “populism” and that there are forces urging it on. \\nThe conclusion of the meme will probably involve a series of catastrophes that will further cultivate and expand globalism. It’s happened before, especially after the 20 th century’s world wars. There is no real reason to think the playbook has been significantly adjusted. \\nConclusion: This meme is not only of the utmost importance, it is clearly warning us of considerable distress to come.'"}, "time": 1742561714.2303112}