{"duration": 0.12681078910827637, "input_args": {"text": "'Weeks after a new North Carolina law put transgender bathroom access at the heart of the nation’s culture wars, a federal appeals court in Richmond, Va. ruled on Tuesday in favor of a transgender student who was born female and wishes to use the boys’ restroom at his rural Virginia high school. Advocates for lesbian, gay, bisexual and transgender people note that the ruling from the United States Court of Appeals for the Fourth Circuit applies to North Carolina, where the controversial law approved last month limits transgender people to bathrooms in government buildings, including public schools, that correspond with the gender listed on their birth certificates. As a result of the ruling, those advocates say, that portion of the North Carolina law that applies to public schools now clearly violates Title IX  —   the federal law that prohibits gender discrimination in schools. “Our expectation is that the North Carolina schools reverse course immediately, as in tomorrow,” Sarah Warbelow, the legal director for the Human Rights Campaign, an L. G. B. T. rights group, said Tuesday night. The ruling in favor of Gavin Grimm, a junior at Gloucester High School in southeastern Virginia, does not immediately grant him the right to use the boys’ restrooms rather, it directs a lower court that had ruled against him to   Mr. Grimm’s request for a preliminary injunction to be able to use those restrooms. But it is the first time that a federal appellate court has ruled that Title IX protects the rights of such students to use the bathroom that corresponds with their gender identity. The ruling also comes as some school districts and state governments around the country are grappling with the question of whether transgender people should be allowed to go to the public facilities that correspond with their gender identity, or whether, as many conservatives believe, such access would infringe on the privacy rights of others. Boycotts and protests have followed the passage of the North Carolina law, but Gov. Pat McCrory has essentially stood by it. On Tuesday, Joshua Block, a lawyer with the American Civil Liberties Union, which brought the case on Mr. Grimm’s behalf, argued that such state and local legislation violated federal law. “With this decision, we hope that schools and legislators will finally get the message that excluding transgender kids from the restrooms is unlawful sex discrimination,” he said in a statement. The North Carolina law has prompted the Obama administration to consider whether the state would be ineligible for billions of dollars in federal funding for schools, housing and highways. Mr. McCrory, a Republican who is seeking   in November, and other supporters of the law have played down suggestions that the Obama administration would rescind those billions. Mr. McCrory’s Democratic opponent, Roy Cooper, the state’s attorney general, has said in the past that the law may put the federal funding at risk and has refused to defend the state in a lawsuit challenging it. In a statement Tuesday, Mr. McCrory said he strongly disagreed with President Obama and Mr. Cooper’s objective “to force our high schools to allow boys in girls’ restrooms, locker rooms or shower facilities,” but would evaluate the effect of Tuesday’s ruling on North Carolina law and policy. The A. C. L. U. brought the case on behalf of Mr. Grimm, who was born female but identifies as a male, in June, seeking a preliminary injunction so that Mr. Grimm could use the boys’ restrooms at his school. The school administration initially allowed him to do so, but the local school board later approved a policy that barred him from the boys’ restrooms according to court documents, the policy also “required students with ‘gender identity issues’ to use an alternative private facility” to go to the bathroom. Judge Robert G. Doumar of Federal District Court ruled against Mr. Grimm in September, dismissing his claim that the school board had violated Title IX, although the judge did allow his case to go forward under the equal protection clause of the 14th Amendment. The ruling by a   panel on Tuesday reversed the lower court’s dismissal of the Title IX claim, stating that the District Court “did not accord appropriate deference” to regulations issued by the Department of Education. The department’s current guidelines dictate that schools “generally must treat transgender students consistent with their gender identity. ” Roger Gannam, a lawyer with the conservative Liberty Counsel, which filed an amicus brief in the case on behalf of the defendant, the Gloucester County School Board, said Tuesday that the court had engaged in “blatant judicial legislation. ” “It’s very disappointing, and it’s frightening, in a sense,” he said. Mr. Block of the A. C. L. U. in a phone interview, said he was confident that the District Court would rule in Mr. Grimm’s favor and allow him to use the restroom. And he noted that the five states covered by the Fourth Circuit  —   Virginia, North Carolina, Maryland, West Virginia and South Carolina  —   must now follow the federal Department of Education’s interpretation of Title IX on this issue. The Obama administration has been aggressive in its efforts to ensure that transgender students can use the bathrooms in public schools that correspond with their gender identities. Some federal agencies have threatened to rescind funding to pressure some municipal governments in California and Illinois to change their policies and allow transgender students to do so. In June, the Justice Department filed a “statement of interest” in Mr. Grimm’s case. “We are pleased with the Fourth Circuit’s decision, which agreed with the position that the United States advocated in its brief,” the Justice Department said in a statement Tuesday night. In an email, a clerk for the Gloucester school system said the superintendent, Walter Clemons, “has no comment at this time. ” In a statement released through the A. C. L. U. Mr. Grimm said: “I feel so relieved and vindicated by the court’s ruling. Today’s decision gives me hope that my fight will help other kids avoid discriminatory treatment at school. ”'"}, "time": 1742562887.749635}