{"duration": 0.13879776000976562, "input_args": {"text": "'Growing up as a member of the Gila River Indian Community in Arizona, Brian Howard attended an elementary school that was within the boundaries of Phoenix and beyond those of his reservation. There, in the third grade, he was first called “redskin. ” Did the white classmate intend it as a term of endearment, akin to buddy? Or was it used as a verbal fist, intended to hurt and to sting? “A slur,” said Mr. Howard, 28, a legislative associate for the National Congress of American Indians. “Oh, yeah. Yes. ” But the widespread acceptance of the term as a pejorative  —   “now considered by many to be an offensive term,” according to Webster’s New World College Dictionary  —   has apparently been tossed into linguistic uncertainty by a recent Washington Post poll that centers on the name of a certain   professional football team. Suddenly, the poll seems to suggest, “redskin” is not so bad after all, raising the question of how society should decide what constitutes a slur. After all, if the   victims of the term are not offended, then.   …     According to the poll, nine of 10 Native Americans said they took no offense in the name of the Washington Redskins, a contentious, litigious issue that has pitted     advocates against the team’s owner, Daniel Snyder, and Roger Goodell, the commissioner of the National Football League. In addition, the poll  —   a survey of 504 people across the country  —   found that more than 70 percent of those questioned said they did not consider “redskin” to be disrespectful to Native Americans. What’s more, 80 percent said they would not be offended if called that name by someone who was not an American Indian. (An interesting   might be to spend a day or two at, say, the Pine Ridge Indian Reservation in South Dakota, walking up to random members of the Oglala Lakota community and calling them “redskin”  —   and recording how well that goes over.) The poll’s results have been interpreted as some kind of vindication for Mr. Snyder. It also led to a humbling admission by Robert McCartney, a longtime Washington Post journalist who had written many opinion articles calling on his favorite football team to drop the name, which he considered a racial slur. While acknowledging that he remains “deeply uncomfortable” with the term, Mr. McCartney said that “it’s unsettling to learn now that I vented all that energy and passion on behalf of such a small fraction of the Native American population. ” The connotation of words can evolve over time. Not long ago, for example, “queer” was considered a pejorative for gays and lesbians now it has become what linguists call a reclaimed epithet  —   a word adopted by a group in empowering defiance. In addition, accepted use might depend on the circumstances: The sharing of a certain racial slur among   does not entitle white people to use that term, so freighted is its ignominious history. Things can change in a mere generation. As a boy in Boston in the 1970s and early 1980s, Eugene Chay identified himself as Oriental, or  . It was the accepted term. “I grew up using ‘Oriental’ and being referred to as ‘Oriental,’” recalled Mr. Chay, who is a senior staff lawyer for a civil rights organization called   Advancing Justice. But by the   Mr. Chay had become aware of a shift in the language  —   of the growing sentiment that “Oriental” was geocentric, ethnocentric, and disparaging to Asians. It was a rhetorical tool of separation and otherness, he said. “We didn’t refer to people in the West as Occidental,” he said. “I eventually reached a point in my teens where I did not want to be referred to as Oriental, and where I took to task people who referred to me as Oriental. I asked to be referred to as Asian. ” But redskin? Geoffrey Nunberg, a linguist at the University of California, Berkeley, who served as an expert for Native Americans petitioning to have the federal government cancel the Washington Redskins organization’s trademark registration, said the term was a qualified form of a reclaimed epithet. Some scholastic teams in Indian country have nicknames that include Redskins and Braves, he said, sort of as a way to say, “If you want redskin savages, then we’ll give you redskin savages. ” “It’s used in those schools in that reclaimed way,” Mr. Nunberg said. “But that doesn’t license its use by third parties. ” The term has come to be associated with hostility, and savagery, and a mélange of popular culture stereotypes that include “F Troop” and “Davy Crockett,” removed in some way from the fact of sustained genocide and mistreatment. “A word can be offensive simply because of its history,” Mr. Nunberg said. “You can’t pluck this term out of its history and say, ‘Because my intentions are honorable, it’s O. K.’” Debra Krol, a journalist in Arizona and an enrolled member of the Xolon Salinan Tribe, on the central coast of California, characterized the opposition to the term as symptomatic of the broader movement by blacks, Latinos and   to “strip our language of these terms that are offensive, demeaning. ” “These terms make it easier for people to think of us Indians as not really Americans,” she said. “Kind of like   of a person that blacks used to be under the U. S. Constitution. ” Ms. Krol also said there was disagreement among American Indians about the seriousness of the issue. “There are a lot of people out there who have a problem with it,” she said. “But there are a lot of other people who really don’t care either way  —   who say we have bigger problems to worry about than a sports team’s mascot and a name. ” But Tara Houska, a tribal lawyer and a member of the Couchiching First Nation in Canada, along the Minnesota border, pointed out that during the American Indian Movement of the 1960s, tribal leaders across the country cited mascots and team names like the Redskins and the Cleveland Indians as racist and dehumanizing. “This goes back long before I was born,” said Ms. Houska, 32, who helped organize a protest in Minneapolis in 2014 against the appropriation of Indian culture for team names and mascots. She questioned the methodology of the Post poll  —   which mirrored the results of a poll conducted in 2004 by the Annenberg Public Policy Center  —   saying that a survey of 504 people could hardly represent the feelings of 5. 2 million Native Americans. She also said that those who clung to family lore  —   of, say, being part Cherokee on their mother’s side  —   had experiences profoundly different from those who actually lived the Native American life, whether on or off a reservation. And, she said, the damage has been documented. A decade ago, the American Psychological Association recommended the immediate retirement of Native American mascots and symbols, in part because they appear “to have a negative impact on the   of American Indian children. ” Ms. Houska, who lives in Washington, said she was bracing for all the people who would be waving the poll in her face  —   “the poll, the poll, the poll”  —   and saying she had no right to be offended by the name of the local football team. That the matter is even up for debate baffles her. “It’s a   slur,” she said. “It’s a   racial slur. It should be a    —   but somehow, it’s not. ”'"}, "time": 1742561773.798366}