{"duration": 0.08601593971252441, "input_args": {"text": "'Comments \\nSpecial to Occupy Democrats by Carlos Miller of PINAC News. \\nIt was only last month that Scott Michael Greene accused a group of black teenagers of being “cop haters” because they did not stand for the National Anthem during a high school football game. This morning, he shot and killed two cops in cold blood as they sat in their patrol cars. Greene, 46, was arrested a few hours later after an intense manhunt. \\nBelow is a video he posted on YouTube, along with a screenshot of his comment referring to the black teens as cop haters for not standing during the national anthem at high school game, which caused him to throw a fit of rage leading to him eventually being kicked out of the stadium. \\nHe was angry at police after they had kicked him out of the football game for waving a Confederate flag in front of a group of black students in Urbandale on October 14, 2016. Two days later, he posted the infamous video to YouTube from the encounter titled, “Police Abuse, Civil Rights Violation at Urbandale High School 10/14/16.” \\nOf course, neither Trump nor his campaign have said anything about the killings except a tweet offering the old tired “thoughts and prayers.” \\nIn the video, he tries to explain to the cops kicking him out that he was doing nothing more than expressing his First Amendment rights to wave the Confederate flag. He also said he was assaulted and had his flag stolen from him. However, police said he was causing a disturbance and that he would be arrested for trespassing on school property if he did not leave. They also returned his flag to him. \\nWhile they agreed he had a Constitutional right to wave the flag, they informed him that on school grounds, he was subject to school policies that did not allow the waving of the Confederate flag. Less than a week ago, he stated in the comments section of his video that he was “offended by the blacks sitting through our anthem” and referred to them as being “cop haters.” Now, he is a suspected cop killer. Greene has a long history of arrests, including one incident where he threatened to kill a black man after calling him a racial slur. He also went though mental evaluation and was placed on medication. \\nAccording to the Des Moines Register: \\nHe was charged with a simple misdemeanor count of interference with official acts on April 10, 2014, when he resisted an attempt by officers to pat him down for weapons at an Urbandale residence on Colby Parkway, according to a criminal complaint. The officers wanted to search Greene after noticing that he had a pouch on his belt that resembled a holster. \\nGreene was “noncompliant, hostile, combative and made furtive movements toward his pockets” before the arrest, Officer Chris Greenfield wrote in the complaint. Greene pleaded guilty to the charge about two weeks later. \\nThe complaint does not indicate why officers initially came into contact with Greene. But two days later he reportedly threatened to kill a man in the parking lot of the same apartment complex and he was charged with first-degree harassment, according to another complaint. \\nIn that incident, Greene was accused of approaching a man in the parking lot and shined a flashlight in his eyes. Greene, who lived in the apartments, called the man the N-word and told the man “I will kill you, (expletive) kill you,” according to the complaint. Greene pleaded guilty to a lesser harassment charge on June 30, 2014, and was sentenced to one year of probation. \\nIn a discharge report filed in June 2015 a probation officer wrote that Greene had received a mental health evaluation and “reports to have complied with the medication recommendations.” \\nWatch this confederate flag obsessed cop-killer’s YouTube video:'"}, "time": 1742563147.0368373}