{"duration": 0.05303311347961426, "input_args": {"text": "'Sunday on NBC’s “Meet the Press,” Sen. Dianne Feinstein ( ) said she believes that Russia interfered in the 2016 presidential election and they did alter the outcome.  Partial transcript as follows:  TODD: Let me go to the investigation. You’ve seen the unclassified version of this Intel report. Do you have any doubt in your mind that Russia tried to interfere in the election and then second, do you believe it altered the outcome? FEINSTEIN: The answer is yes on both cases. TODD: You truly, you believe  —   FEINSTEIN: That’s what I believe. I’ve had all of the major classified briefings. I have been astonished at what has been a   effort at Russia to spearfish, to hack, to provide disinformation, propaganda wherever it really could  —   I think this has been a very sophisticated effort. I think in our classified sessions we will be able to get down to the depth and breadth of it. I hope so. I spoke yesterday twice with Senator Warner who is our new vice chairman, and he reviewed with me the terms of this agreement. This investigation has to be full and robust. If it isn’t, both of us will go toward an outside panel. We cannot ignore what has happened. To ignore it is really to commit ourselves to a very bad future. TODD: What is the scope? I’ll be honest. I read it, and it comes across as it’s an investigation into the investigation. It’s an investigation into the intel community’s assessment. Is the intel committee going to do its own investigation? FEINSTEIN: Well, it’s a review of the intelligence that informed the declassified report about Russia’s interference in the election. Now last night I read the declassified report. The declassified report is pretty certain about what Russia did. There are some particulars which are classified which are not part of it, but it’s pretty clear that the hacking was in both political parties, but with the aim of hurting Hillary Clinton, and then if Hillary Clinton were to win the aim clearly was to weaken her. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562083.956228}