{"duration": 0.17040705680847168, "input_args": {"text": "'by JOHN SUMMERLY \\nA wave of viral and bacterial infections is sweeping across the Northern Hemisphere and people are taking longer to heal from an array of symptoms within the respiratory system. If you are resorting to conventional medicine to address these infections with antibiotics, you are not only adding to the problems associated with antibiotic resistance, but you’re also doing little to address the healing mechanisms within your body to address the cause. Herbal remedies not only boost lung health, but they can heal infections and even repair lung damage. Here are 15 of the best herbs to boost lung health. \\n1. LICORICE ROOT \\nLicorice is one of the more widely consumed herbs in the world. In Traditional Chinese Medicine it occurs in more formulas than any other single herb because it is thought to harmonize the action of all other herbs. Licorice is very soothing and softens the mucous membranes of the throat and especially the lungs and stomach and at the same time cleanses any inflamed mucous membrane that needs immune system support. . It reduces the irritation in the throat and yet has an expectorant action. It is the saponins (detergent-like action) that loosen the phlegm in the respiratory tract, so that the body can expel the mucus. Compounds within this root help relieve bronchial spasms and block the free radical cells that produce the inflammation and tightening of the air ways. The compounds also have antibacterial and antiviral effects to them as well which helps fight off viral and bacterial strains in the body that can cause lung infections. Glycrrhizins and flavonoids can even help prevent lung cancer cells from forming which means they can even prevent lung cancer. \\n2. COLTSFOOT \\nColtsfoot has been traditionally by Native Americans for thousands of years to strengthen the lungs. It clears out excess mucus from the lungs and bronchial tubes. It soothes the mucus membranes in the lungs, and has been shown in research to assist with asthma, coughs, bronchitis, and other lung ailments. Coltsfoot is available in dried form for tea or as an alcohol extract known as a tincture. \\n3. CANNABIS \\nThe toxic breakdown of therapeutic compounds in cannabis from burning the plant are totally avoided with vaporization. Extraction and inhaling cannabinoid essential oils of the unprocessed plant affords significant mitigation of irritation to the oral cavity that comes from smoking. Cannabis is perhaps one of the most effective anti-cancer plants in the world shown in study after study to stimulate cannabinoid receptor activation in specific genes and mediate the anti-invasive effect of cannabinoids. Vaporizing cannabis allows the active ingredients to stimulate the body’s natural immune response and significantly reduces the ability of infections to spread. Vaporizing cannabis (especially with very high amounts of cannabinoids) opens up airways and sinuses, acting as a bronchodilator. It is even a proven method to treat and reverse asthma. \\n4. OSHA ROOT \\nOsha is an herb native to the Rocky Mountain area and has historically been used by the Native Americans for respiratory support. The roots of the plant contain camphor and other compounds which make it one of the best lung-support herbs in America. One of the main benefits of osha root is that it helps increase circulation to the lungs, which makes it easier to take deep breaths. Also, when seasonal sensitivities flare up your sinuses, osha root which is not an actual antihistamine, does produce a similar effect and may be help calm respiratory irritation. \\n5. THYME \\nThyme is very powerful in the fight against chest congestion. It produces powerful antiseptic essential oils which are classified as naturally antibiotic and anti-fungal. Thyme is a well known to zap acne than expensive prescription creams, gels and lotions. Thyme tea has the power to chase away and eliminate bacteria and viruses so whether your infection is based on either, it will work. Thyme has been used as a lung remedy consumed since antiquity and is used extensively to day to prevent and treat respiratory tract infections and bacterial infection pneumonia. \\n6. OREGANO \\nAlthough oregano contains the vitamins and nutrients required by the immune system, its primary benefits are owed to its carvacrol and rosmarinic acid content. Both compounds are natural decongestants and histamine reducers that have direct, positive benefits on the respiratory tract and nasal passage airflow. Oil of oregano fights off the dangerous bacteria Staphylococcus aureus, better than the most common antibiotic treatments. Oregano has so many health benefits that a bottle of organic oregano oil should be in everyone’s medicine cabinet. \\n7. LOBELIA \\nDid you know that horses given lobelia are able to breath more deeply? Its benefits are not limited to equestrians. It has been used as “asthmador” in Appalachian folk medicine. Lobelia, by some accounts, is thought to be one of the most valuable herbal remedies in existence. Extracts of Lobelia inflata contain lobeline, which showed positive effects in the treatment of multidrug-resistant tumor cells. Lobelia contains an alkaloid known as lobeline, which thins mucus, breaks up congestion. Additionally, lobelia stimulates the adrenal glands to release epinephrine, in effect, this relaxes the airways and allows for easier breathing. Also, because lobelia helps to relax smooth muscles, it is included in many cough and cold remedies. Lobelia should be part of everyone’s respiratory support protocol! \\n8. ELECAMPANE \\nElecampane has been used by Native Americans for many years to clear out excess mucus that impairs lung function. It is known as a natural antibacterial agent for the lungs, helping to lessen infection particularly for people who are prone to lung infections like bronchitis. Herbal practitioners often recommend one teaspoon of the herb per cup of boiling water, drunk three times daily for two to three weeks but elecampane is also available in tincture format for ease. \\n9. EUCALYPTUS \\nNative to Australia, eucalyptus isn’t just for Koala bears! Aborigines, Germans, and Americans have all used the refreshing aroma of eucalyptus to promote respiratory health and soothe throat irritation. Eucalyptus is a common ingredient in cough lozenges and syrups and its effectiveness is due to a compound called cineole. Cineole has numerous benefits — it’s an expectorant, can ease a cough, fights congestion, and soothes irritated sinus passages. As an added bonus, because eucalyptus contains antioxidants, it supports the immune system during a cold or other illness. \\n10. MULLEIN \\nBoth the flowers and the leaves of the mullein plant are used to make an herbal extract that helps strengthen the lungs. Mullein is used by herbal practitioners to clear excess mucus from the lungs, cleanse the bronchial tubes, and reduce inflammation that is present in the respiratory tract. A tea can be made from one teaspoon of the dried herb to one cup of boiled water. Alternatively, you can take a tincture form of this herb. \\n11. LUNGWORT \\nLungwort is a tree-growing lichen that actually resembles lung tissue in appearance. However, this natural remedy doesn’t just look the part. As early as the 1600s, lungwort has been used to promote lung and respiratory health and clear congestion. Pulmonaria selections come in all kinds so seek an herbologist for direction. Lungwort also contains compounds that are powerfully effective against harmful organisms that affect respiratory health. \\n12. CHAPARRAL \\nChaparral, a plant native to the southwest, has been appreciated by the Native Americans for lung detoxification and respiratory support. Chaparral contains powerful antioxidants that resist irritation and NDGA which is known to fight histamine response. NDGA inhibits aerobic and anaerobic glycolysis (the energy-producing ability) of cancer cells. Chaparral is also an herb that fights harmful organisms. The benefits of chaparral are most available in a tincture extraction but chaparral tea may support respiratory problems by encouraging an expectorant action to clear airways of mucus. \\n13. SAGE \\nSage’s textured leaves give off a heady aroma, which arises from sage’s essential oils. These oils are the source of the many benefits of sage tea for lung problems and common respiratory ailments. Sage tea is a traditional treatment for sore throats and coughs. The rich aromatic properties arising from sage’s volatile oils of thujone, camphor, terpene and salvene can be put to use by inhaling sage tea’s vapors to dispel lung disorders and sinusitis. Alternatively, brew a strong pot of sage tea and place it into a bowl or a vaporizer. \\n14. PEPPERMINT \\nPeppermint, and peppermint oil, contains menthol — a soothing ingredient known to relax the smooth muscles of the respiratory tract and promote free breathing. Dried peppermint typically contains menthol, menthone, menthyl acetate, menthofuran and cineol. Peppermint oil also contains small amounts of many additional compounds including limonene, pulegone, caryophyllene and pinene. Paired with the antihistamine effect of peppermint, menthol is a fantastic decongestant. Many people use therapeutic chest balms and other inhalants that contain menthol to help break up congestion. Additionally, peppermint is an antioxidant and fights harmful organisms. \\n15. PLANTAIN LEAF \\nPlantain leaf has been used for hundreds of years to ease cough and soothe irritated mucous membranes. Many of its active constituents show antibacterial and antimicrobial properties, as well as being anti-inflammatory and antitoxic. Clinical trials have found it favorable against cough, cold, and lung irritation. Plantain leaf has an added bonus in that it may help relieve a dry cough by spawning mucus production in the lungs. \\n\\nSeek the advice of an herbologist or Naturopathic Doctor on the preparation, appropriate dosages and frequency according to your condition. Many of the herbs above may also be combined for cumulative effects. All of the above are available in various forms, as nutritional supplements, tea blends and prepared oils. You can always grow your own as well to ensure your herbs are organic and ethically harvested.'"}, "time": 1742564303.413135}