{"duration": 0.04014396667480469, "input_args": {"text": "'This post was originally published on this site \\n© Mikhail Metzel/TASS \\nKIEV, November 22. /TASS/. The Russian servicemen detained on the border with Crimea are the former servicemen of Ukraine’s army accused of breaking the military oath, Ukraine’s Defense Ministry spokesman on the Donbass military operation Alexander Motuzyanik said on Tuesday. \\n“We don’t know on what purpose these persons crossed the administrative border. They were detained on the territory controlled by Ukraine and it was found out that these are the former servicemen of Ukraine’s Armed Forces who failed to comply with the respective directive and did not leave Crimea,” the spokesman said. \\n“So they broke the military oath and there are the respective criminal proceedings against them,” he said, adding that the detention took place as part of Ukraine’s current legislation. \\nRussia’s Defense Ministry said late on Monday that the Ukrainian Security Service officers had illegally detained Russian contract servicemen in Crimea at about 13:00 Moscow time (10:00 GMT) on November 20 and took them to Ukraine’s Nikolayev Region. \\nThe ministry said further that according to available data, the Ukrainian special services were attempting to fabricate a criminal case against Alexander Baranov and Maxim Odintsov for allegedly committed crimes against Ukraine. \\nRussia’s Defense Ministry does not rule out that psychological and physical pressure will be exerted on the Russian servicemen to obtain necessary confessionary evidence from them. \\nThis information was confirmed earlier on Tuesday by a representative of the Russian Black Sea Fleet. “Officers of the Ukrainian Security Service used substitute persons to entice warrant officer Maxim Odintsov and contract service junior sergeant Alexander Baranov into the Dzhankoi checkpoint allegedly for giving them attested documents of receiving higher education at Ukrainian higher educational institutions,” the fleet’s representative said. \\nShortly after Odintsov and Baranov left Russia’s territory, the servicemen were detained by representatives of the Ukrainian Security Service and brought to Ukraine’s Nikolayev Region, he added. \\nRussia’s Foreign Ministry has come up with a statement that Ukrainian special services have made a provocation against Russian citizens on the territory of Russia by abducting two servicemen in Crimea.”We believe this was an unlawful provocation made by Ukraine’s special services on the territory of Russia against Russian citizens. Our law-enforcement agencies are dealing with this issue,” Sergey Lavrov said. \\nRussia’s human rights commissioner Tatyana Moskalkova plans to send a request to her Ukrainian counterpart Valeriya Lutkovskaya on Tuesday asking her to assist in releasing the two Russian servicemen. \\n{{item.group_date}} '"}, "time": 1742563376.9928732}