{"duration": 0.0593714714050293, "input_args": {"text": "'BOMBSHELL: Justice Clarence Thomas Accused Of Sexual Misconduct (VIDEO) By Karen Shiebler   \\nWay back in 1991, the news in this country was filled with stories of sexual harassment. Anita Hill was a young law professor who sat in front of the U.S. Senate Judiciary Committee as it debated the nomination of Clarence Thomas to the Supreme Court. \\nProfessor Hill described the sexually explicit comments that she said Judge Thomas had made to her when she worked for him. She shared her story and her embarrassment to the entire nation, but her story was evaluated by a panel of white men. \\nIn spite of what many observers felt was damning testimony from Professor Hill, Clarence Thomas was nevertheless confirmed and joined the Supreme Court of the United States. \\nNow another woman has made a claim about Justice Thomas and his inappropriate sexual advances. \\nThis time the claim comes from a woman named Moria Smith. She is Vice President and General Counsel to Enstar Natural Gas Company. Ms. Smith first reported her encounter with the Justice on her Facebook page. \\nSmith claimed that she was a 23 year old Truman scholar in attendance at a Truman Foundation Dinner in 1999. Clarence Thomas was a Justice on the Supreme Court at the time. \\nShe told the National Law Journal that she was in the process of setting the table, putting her in a position of subservience to the guests. As she was setting the table, the young woman says that she was grabbed by Justice Thomas, who cupped her rear and pulled her close to him. \\nShe said : “He groped me while I was setting the table, suggesting I should sit ‘right next to him.’” \\nNaturally, Justice Thomas claims that none of this ever happened. When was the last time that a sexual predator happily agreed with his accuser? \\nMs. Smith had apparently told her story to her friends, though, way back when it first happened. The National Law Review says that it spoke to several of her friends and former roommates who remembered her describing the encounter when it first happened. \\nYet another reason to vote Blue on November 8. We need a Supreme Court that is weighted heavily in favor of those who support women and will stand up against sexual aggression. \\nWatch for more here : \\nFeatured image via YouTube Screengrab . About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742562952.537807}