{"duration": 0.02577686309814453, "input_args": {"text": "'North Africa Tunisian Defense Minister Farhat Horchani (C) attends the unveiling of an anti-militant fence in eastern Tunisia, close to the border with Libya, on February 6, 2016. (Photo by AP) \\nMilitary officials in Tunisia have rejected claims that the country is hosting a base for US drone operations against the Daesh Takfiri terrorist group in neighboring Libya. \\nTunisia’s Defense Minister Farhat Horchani on Thursday ruled out any possibility that foreign forces could have direct access to Tunisian military bases or run their own in the country. \\n“We don\\'t -- and won\\'t -- have a foreign military base in Tunisia,\" Horchani said, adding, “We were one of the few first countries to oppose a foreign military intervention in Libya.” \\nA Tunisian Defense Ministry spokesman also said on Thursday that the North African country has never allowed Washington to operate unmanned planes from its territory for anti-Daesh missions. \\n\"Tunisian soil has never been and never will be used to strike targets in Libya. The drones are used by Tunisians and no one else,\" Belhassen Oueslati said, adding, \"As part of Tunisian-US bilateral cooperation, we have acquired drones to train our military personnel to use this technology and to control our southeastern border with Libya and detect any suspicious movement.\" \\nThe remarks came after US media claimed that Washington has expanded its deployment of drones to North Africa as part of a secret program. \\nA report by the Washington Post said on Wednesday that unmanned aircraft and US military personnel had been deployed to a facility in Tunisia to conduct spy missions in neighboring Libya. The paper added that \"drones began flying out of the Tunisian base in late June,” claiming that the dispatch of the planes was a key element of the extended US air offensive against a Daesh stronghold in Libya. \\nDaesh, which is known for its terror acts in Iraq and Syria, has been operating mostly in northern Libya, a country which slipped into chaos in 2011 following the ouster of longtime dictator, Muammar Gaddafi. \\nForces loyal to Libya’s unity government, which enjoy the support of the West and the United Nations, have been battling Daesh militants over the past six months in the coastal city of Sirte. \\nUS Africa Command (AFRICOM) said on Thursday that since August 1, Pentagon has carried out 351 airstrikes in Libya to help Libyan forces in the fight in Sirte. \\n“There are US service members working with the Tunisian security forces for counter-terrorism and they are sharing intelligence from various sources, to include unarmed aerial platforms,” said Colonel Mark R. Cheadle, spokesman for US Africa Command. \\nTunisia, which is frequented by Western tourists, has suffered several major attacks by the Daesh terrorist group. \\nLast year, a total of 59 foreign tourists were killed in two such assaults by Daesh on the National Bardo Museum in Tunis and a beach resort. Loading ...'"}, "time": 1742628523.5345106}