{"duration": 0.14223980903625488, "input_args": {"text": "'“I’m in the lion’s den, Trevor. ” Tomi Lahren, a    conservative commentator, had left her bubble of more than 4. 3 million followers on social media last week to appear in front of the progressive, diverse audience that attends the weeknight tapings of “The Daily Show With Trevor Noah” in Manhattan. Before the interview began, Mr. Noah requested that the studio audience be polite to Ms. Lahren. “Imagine you’re at Thanksgiving again, and your racist uncle walked in,” he joked. Ms. Lahren hosts a nightly show, “Tomi,” for The Blaze, a website, TV station and subscription service created by the conservative media personality Glenn Beck. And her reputation  —   among supporters, detractors and her prodigious online following  —   has been built on the commentaries with which she closes each show. A segment from August featuring an incendiary address to the San Francisco 49ers quarterback Colin Kaepernick has been watched on Facebook 66 million times. Ms. Lahren criticized Mr. Kaepernick, who had been protesting racial oppression by kneeling during the national anthem before games, pointing at unemployment and homicide rates, and saying that black people should take responsibility for their communities being run “into the ground. ” Ms. Lahren has also been critical of prominent black people like President Obama and Beyoncé in commentaries that have gone viral. During the presidential campaign, she became one of the most visible young supporters of   Donald J. Trump, saying that she was using her show to speak for those who live between the coasts and “are too timid or too bashful or too busy to voice their own opinion. ” It is an approach that has made her a new media star, while also drawing the ire of critics who say her commentaries are often racist. Brendesha Tynes, a professor at the University of Southern California who specializes in addressing social media issues and cyberbullying, initially declined to comment on Ms. Lahren’s “Daily Show” appearance, saying, “We normalize racism when we give these folks a platform. ” She later elaborated, saying Ms. Lahren’s appearance “sends a signal to our children and the world that facts don’t matter, that hate is normal. ” It is likely that Ms. Lahren’s audience has little crossover with Mr. Noah’s. Ms. Lahren, whose name is pronounced “Tommy,” seemed unfazed during her   conversation on politics and race with Mr. Noah, even as the audience booed and laughed at her. “There were some people in the audience that were just there to razz me,” she said afterward, adding that she did not think she persuaded anyone in attendance with her arguments. At one point, she compared the Black Lives Matter movement to the Ku Klux Klan. The next day, however, footage from the interview was popular online, prompting headlines like “Trevor Noah Expertly Skewers Conservative Tomi Lahren” from The Huffington Post, and “Trevor Noah Thoughtfully Confronting Tomi Lahren on Racism on ‘The Daily Show’ Might Be His Best Work Ever” from New York magazine. There was speculation that Ms. Lahren and Mr. Noah could develop a friendly sparring relationship not unlike that of Bill O’Reilly and Jon Stewart. Many conservative outlets praised Ms. Lahren’s appearance. A headline on RedFlagNews. com read “Tomi Lahren Enters the Lion’s Den, Takes On Trevor Noah on His Own Show. ” David Dennis Jr. a journalism professor at Morehouse College, was disappointed by reactions to the interview. “People talked about it as if they were exchanging ideas and talking about beliefs  —   like they were debating sports,” he said, asserting that Ms. Lahren’s words “are literally   to black people. ” When she said, for instance, that the Black Lives Matter movement aimed to murder police officers, “people hear that and they believe that, and they see me as a threat,” Mr. Dennis said, citing the death of Trayvon Martin. Ms. Lahren has frequently denied being racist. In interviews with The New York Times last week, she condemned the fringe movement known as the   which espouses white nationalism and   calling it “disgusting,” and said she would never be “an advocate, a cheerleader or an apologist for the K. K. K. or any other hate group. ” Ms. Lahren, an only child born and raised in South Dakota by parents from ranching backgrounds, studied broadcast journalism and political science at the University of Nevada, Las Vegas, graduating in 2014. She started working at The Blaze in October 2015, after piquing the network’s interest with a viral video criticizing President Obama. In the interviews, Ms. Lahren spoke about issues that inspire her. There are numerous military veterans in her family, she said, including a grandfather who was a paratrooper in World War II and an uncle who was awarded the Purple Heart during Vietnam. Ms. Lahren spoke passionately about the hardships of being a soldier and of being related to one. She does not call herself spiritual  —   “Spiritual sounds like you worship the grass,” she joked  —   but said she believes in God and prays every night and when she runs, often asking “to be a better person. ” But she also blasted organized religion as being “about hierarchy, power, control and greed. ” Minutes later, she said, “The institution of religion is important. ” She is   and does not object to gay marriage. She curses regularly, and professes to love junk food and the rappers Pusha T and Kendrick Lamar. She enjoys argument as sport and, as evidenced by her appearance with Mr. Noah, can be a talented sparring partner. She testified to her authenticity  —   “People like me because I’m real”  —   but said of Mr. Noah and herself, “We both know that we have to play these parts. ” She mocks liberal “snowflakes” as being overly sensitive to   but says she is bothered when people use the word “retard. ” Ms. Lahren says she is surprised when she meets black fans. Charlamagne Tha God, the host of the New   radio show “The Breakfast Club,” is friendly with her. He does not think Ms. Lahren is racist, but “misinformed,” he said in a phone interview. He enjoys her show, he said, identifying with Ms. Lahren’s “political incorrectness. ” He stressed the importance of Democrats speaking directly to people like her. Still, he said, “I have to remind myself that some of the rhetoric she puts out there is troubling. ” He said that in a recent conversation with Ms. Lahren, he questioned what he saw as her contradictory views. For instance, when he asked why she supported Mr. Trump, given the bigotry of some of his supporters, she said that a few bad apples did not represent the movement. “So you have to have that same respect with the Black Lives Matter movement,” Charlamagne recalled telling her. Ms. Lahren said she was an informal adviser to Mr. Trump’s campaign on its use of social media starting in August, and she appeared on the campaign’s behalf via Facebook Live broadcasts in the final weeks before the election. She has about 3. 5 million followers on Facebook and over 800, 000 cumulatively on Twitter and Instagram. She is open to opportunities beyond The Blaze, including any that might involve Mr. Trump. Mr. Trump’s team did not respond to a request for comment. While Ms. Lahren, a fan of the radio host Howard Stern and the rapper Eminem, often seems to enjoy causing controversy, at other times she is more conciliatory. She expressed hope that “The Daily Show” would show an unfamiliar side. “I find that when people are actually around me, it’s impossible not to like me,” she said. “People expect me to be angry, bitter. They expect to me be abrasive, aggressive. I’m not. ”'"}, "time": 1742563382.9333572}