{"duration": 0.021817922592163086, "input_args": {"text": "\"People Shocked At What Hillary Brought With Her To Speech During Scandal Posted on October 30, 2016 by Amanda Shea in Politics Share This Hillary Clinton landing and speaking in Cedar Rapids, Iowa on Friday \\nHillary Clinton is attempting to forge through the FBI investigation, which she hopes people will soon forget, as she refuses to accept defeat at the hands of Donald Trump. As she carries on with her sparsely-planned campaign stops in the final days of the election, Iowans were shocked to see what she brought with her to her speech right after the investigation was announced. \\nNo matter how hard Hillary tries, everything she hides seems to have a way of coming out. Karma is certainly working in favor of the American citizens who deserve to know the truth about this woman trying to bully her way into the White House. \\nWhen she was in Iowa this weekend, just hours after the FBI announced they are re-opening the investigation into her e-mails thanks to her right-hand woman’s dirty husband, Hillary brought a familiar “friend” that the public couldn’t ignore, which is why photos of it have now gone viral. During the second presidential debate, we were first introduced to Hillary’s ironic nemesis, which wasn’t just her opponent Donald Trump. \\nA fly pestered the Democratic candidate on live TV as she spoke, sticking to her and never touching Trump in what seemed symbolic since she stinks of lies and everyone knows flies are attracted to garbage. As embarrassingÂ as this may have been for Hillary, she can’t pass it off as a random event since it happened again in a completely different state. That’s right â\\x80\\x94 while she was in Iowa, a fly once againÂ wouldn’t leave her face. Can't even make this up. How many times has a FLY landed on Crooked Rotten Hillary now?! Today at Cedar Rapids, Iowa. pic.twitter.com/tu0Ivw8rFa \\n— RÎąŃ\\x83 MÎąĎ\\x87ÎšĐźĎ Ń\\x95 đ\\x9f\\x87şđ\\x9f\\x87¸ (@sooperay) October 28, 2016 \\nApparently, there’s something about Hillary’s face that flies flock to. and it’s probably the same thing most Americans find so repulsive. It’s not coincidental that this has now happened twice to this candidate in less than a month, and perhaps the fly is just a sign of what the FBI investigation is about to uncover. \\nLike a crow symbolizing death, the black fly during this election represents the end of Hillary’s campaign since it seems to sense everything she’s trying to hide.\""}, "time": 1742628589.5955062}