{"duration": 0.0889139175415039, "input_args": {"text": "'Posted by Madeline | Oct 30, 2016 | 2016 , Daily Blog | 0 | Thanks Therisa!\\nThe Mind Unleashed \\nOn November 8th, 2016, hundreds and possibly thousands flash-mob meditations will commence at the polling stations everywhere across America. Elevate The Vote says that “this is a non-partisan participatory event that is open to everyone. It’s about the fundamental unity of human life that seems to have been so forgotten in this campaign.” \\nThe intention is to “ elevate the consciousness of every U.S. voter on election day, impacting how we feel about ourselves, politics, this election, and each other.” “Meditation gives you an opportunity to come to know your invisible self. It allows you to empty yourself of the endless hyperactivity of your mind, and to attain calmness. It teaches you to be peaceful, to remove stress, to receive answers where confusion previously reigned.” – Dr. Wayne Dyer Image Source \\nWhile many will love this concept, some may be a bit skeptical of it having any effect. With that, we can look further at the studies that have been done on synchronized meditations and the measurable effects they did create. \\nWhat is known as the Maharishi Effect has actually been studied over 600 times, which was conducted in 33 countries and in over 250 independent research institutions. The evidence overwhelmingly correlates synchronized group prayer and meditation having extremely positive social, political and economic benefits to the world. Positive correlations for numerous health benefits to the individual were also observed and confirmed. \\nThe most well-known study on this effect was done in 1974, which observed three different gatherings of over 7,000 people meditating each morning and evening for three consecutive weeks. The study took place in Fairfield, Iowa (December 17, 1983-January 6, 1984), The Hague, Holland (December 21, 1984-January 13, 1985) and Washington, DC (July 1-July 10, 1985). The results were astounding. According to the Rand Corporation, a think-tank based in California, “acts of global terrorism resulting in fatalities and injuries were reduced by 72%.” Time series analysis was used in this study to rule out possibilities that the reduction in global terrorism was caused by pre-existing trends, drifts in data or cycles. But how was this done then? How did it spread from a small group to a larger one? \\nScientists believe this is due to a coherent resonance being created in the Unified Quantum Field by those meditating. \\nGoing a bit further with it, we can think of a laser. Its coherent light is established by what is known in physics as the Field Effect. The Field Effect’s principle, according to the Institute of Science, Technology and Public Policy is “that it is not necessary to act individually on each individual constituent of a system, but that the system can be handled in one stroke at the collective level.” \\nThe 7,000 people meditating created a Field Effect of harmonious coherence that spread throughout the collective–which in turn helped to reduce acts of terrorism (incoherent, disruptive energy). Synchronized meditation shifts events and timelines in our Quantum Universe. Souce \\nIf you live outside of the U.S. you can also join in by meditating with a global synchronized meditation that begins at 3pm Pacific Time (U.S.). Also, you can add to this movement even if you live in the U.S. by meditating at this time or at a local polling station. If you plan not to vote or already voted, you can also stay at home and meditate that evening. Let us all envision a world at peace, ourselves at peace and all social systems in balance and at peace. \\nTo find out more information about the flash-mob meditations and to see or start one in your local area, visit Elevate The Vote . \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742561835.350108}