{"duration": 0.2016761302947998, "input_args": {"text": "'by Paul Fassa Health Impact News \\nAn episode of Dr. Mark Hyman’s “ Fat Summit ” featured the work of Dr. Dale Bredesen, who specializes in researching and clinically applying his research on those afflicted with dementia, including Alzheimer’s. Alzheimer’s and other forms of dementia are considered incurable by modern pharmaceutical dominated mainstream medicine. \\nFortunately, Dr. Bredesen is a practitioner of functional medicine , which approaches the underlying cause of any disease then focuses on treatments usually involving systems of holistic or alternative medicine instead of pharmaceutical drugs. \\nHis research has been ongoing for 27 years to determine what really causes dementia and Alzheimer’s disease (AD). It was fun witnessing Dr. Hyman’s energetic, fascinating interview of Dr. Bredesen. Some of what was revealed about Alzheimer’s was quite surprising, and his research went beyond the lab to confirm his team’s findings clinically. \\nThey were actually diagnosing root causes and curing the incurable with natural holistic means. What Dr. Bredesen Discovered About Amyloid Plaque \\nAmyloid plaque, the sticky substance that interferes with neuron transmission and destroys brain cells, is commonly considered the cause of Alzheimer’s without knowing how it accumulates to begin with. \\nDr. Bredesen has discovered it is actually a protective measure created by the brain. This is similar to how cholesterol rushes to patch up arterial lesions, yet is considered the root cause by modern mainstream medicine for heart disease. \\nInstead of reducing cholesterol with statin drugs for heart disease symptoms, it’s wiser to get to the root cause of the arterial inflammation damage that the cholesterol is trying patch up. Both Bredesen and Hyman agreed on how important cholesterol is to the body in general and the brain in particular. \\nIt is the major building material for brain tissue and the protective myelin sheath, which promotes rapid transmission of nerve signals to all parts of the body from the central nervous system. \\nVarious independent researchers, functional medicine practitioners, rogue cardiologists, and naturopathic doctors have determined that most arterial inflammation is caused by excess refined sugar intake, which includes artificially synthesized high fructose corn syrup (HFCS). \\nDr. Bredesen and his team have discovered the same holds true for amyloid plaque. Instead of attempting to create chemicals for removing the plaque, which thus far has proven disastrous, why not discover what the plaque is attempting to protect against and treat that? What Invites Amyloid Plaque to Build Up in the Brain? \\nHere’s where modern medical technology combines with integrative medicine. Dr. Bredsen considers it a “perfect fit.” State of the art neurology and biochemical technology is used to determine which of the following basic issues exist, then natural holistic nutritional sources, environmental, and lifestyle changes are used to eliminate them. \\nHere are some of the basic areas discovered that can be remedied without pharmaceutical drugs: \\nInflammation: This can be caused by infectious pathogens but more often by environmental toxins such as: Mercury – dental amalgams and other sources Sleep issues – good sleep is needed for the brain’s glymp h atic action to purge itself of toxins Indoor building materials and mold from interior dampness in homes and work spaces Chronic sinus issues – this opens up the potential for “nasal probiotics” Excess simple carbohydrate consumption – refined starches and sugars Chronic stress – a common denominator for many inflammatory conditions Aspartame – commonly used neurotoxin in diet sodas and other processed foods as a sugar substitute Excess alcohol consumption Insulin resistance – some consider dementia/Alzheimer’s diabetes 3, this is where coconut oil comes to the rescue ( Source ) \\nInsufficient Brain Nutrients: Lacking these nutrients needed for optimum brain and memory function, among them are: Vitamin D – the aversion to sunshine helps create this very common deficiency Vitamin C Vitamin B12 – methylcobil a ba n without folic acid is the preferred supplement source for B12 (Source) Sex hormones – oestrogen and progesterone for women and testosterone for men that need to be sufficient and balanced Omega 3 fatty acids – sourced from pure fish oils or flaxseed oil or ground flax seeds, our processed foods are top heavy with transfat omega-6 fatty acids Low cholesterol – often caused by statins (Source) \\nToxins: Some are already listed here, but amyloid plaque’s network of protein parts is also an attempt to remove those toxins and others. Detoxing with known items that can cross the blood brain barrier was proven helpful. \\nA perfect example is aluminum from vaccines, common underarm deodorants, and other environmental sources. There are mineral waters high in ionic suspended silicon that penetrate the blood brain barrier to bind with and remove aluminum. The most recent pervasive environmental toxin in the food supply is glyphosate, which also adversely affects the brain. Conclusion \\nRemember hearing how destroyed brain cells never come back, the brain loses that portion forever, once a brain shrinks that’s it? It has been medical “common knowledge.” Dr. Bredesen told about ordering another CT scan of a patient who had been under the clinic’s care. \\nThe radiologist thought it was a waste of time, but did it anyway. He was shocked to realize that patient’s shrunken hippocampus and other parts of his brain’s memory storage had grown since his first brain scan at the start of treatments. Another medical myth shattered. \\nDr. Hyman asked Dr. Bredesen to provide dramatic clinical success using their resources of modern technology’s discovery techniques for holistic non-pharmaceutical solutions. \\nSo Dr. Bredesen told of a man who had turned 70 and was so bad off he couldn’t remember with whom he had lunch that very same day. Friends and family were encouraging him to sell his business. His cognitive and memory test scores were among the bottom five percentile. \\nAfter holistic treatments, his test scores went into the 90 percentile group, higher than most younger people in good health. Instead of selling his business, he added another store. All this success without pharmaceutical drugs. \\nGoing directly from animal (mouse) and lab culture studies to human clinical testing would have been impossible if Dr. Bredesen were attempting to create a new drug. Because there was nothing used that had any potential dangers requiring expensive human trials over a longer time, he was able to put his discoveries to the test without FDA oversight. \\nSince Dr. Bredesen is a neurological expert and well versed in biochemistry, he tended to rattle off lines of technical terms that would confuse most of us, but not Dr. Hyman, who would spontaneously and congenially intervene with relaxed layman language. \\nThis made that interview go smoothly in a light-hearted manner without confusion, yet be packed with information, not all of which I’ve included here. And since this interview was part of the “Fat Summit,” some time was spent on discussing the role of fats for brain health. Coconut oil with its high percentage of medium chain lauric fatty acid was agreed upon as an ideal dietary fat for brain health. (Source) \\nNote: The Fat Summit is completed, but the entire week of presentations is available for purchase here . \\nSource links for more information:'"}, "time": 1742563999.7821066}