{"duration": 0.12862801551818848, "input_args": {"text": "'JIDDA, Saudi Arabia  —   My father was on the phone from Australia, giving gravely voiced advice on preparing for the hajj, the annual Muslim pilgrimage to Mecca. “Have you paid the dentist?” he asked. “He ruined my teeth!” I shrieked. “No matter, Baba,” he said, using an Arabic endearment. “This is the hajj. You have to clear your debts, even if you don’t think they are fair. ” The hajj is a   pilgrimage of   rites that honor a birth story of Islam, a trek every Muslim is supposed to undertake at least once. It is a spiritual as well as physical journey, and requires preparations in both spheres. So I had to buy new shoes suitable for long days of walking and safe to wear in surging crowds. I was supposed to seek the forgiveness of anyone I have wronged  —   and forgive everybody who had wronged me. And I had to clear my debts. There is a dentist in the West Bank city of Ramallah who badly damaged my teeth this year, costing me thousands of dollars, days of pain and lasting emotional distress. This dentist has sent me nasty notes, threatening to use his “connections” to destroy my reputation if I did not pay him his outstanding bill of about $1, 000. I protested to my father, crying a little. “God will compensate you,” he soothed. “And then when you see that man again, you can raise your head up high and know he has nothing on you. ” Angry and resentful, I paid the dentist. I also made amends with the greedy landlord who refused to return my $2, 650 security deposit. Eventually, I landed here in Jidda, Saudi Arabia, only to find that my suitcase containing my clothes,   reader, computer charger, and contact lenses had been lost, and I had to forgive the luggage handlers, too. For hundreds of years, pilgrims have come to Saudi Arabia to sanctify God in Islam’s holiest site, heeding the command of the Quran: “And proclaim to mankind the hajj. They will come to you on foot, on very lean camel, they will come from every deep and distant mountain highway. ” Today, they also come by bus and aircraft. They traverse between sites in   corridors with lanes for those who are older and disabled. They eat in modern malls nearby, and some pay $2, 700 a night to stay in towering hotels with views of the Haram, the sprawling mosque built around the black,   building known as the Kaaba. Last year, more than 2, 300 people were killed in a crush during the hajj. The pilgrimage has also become a petri dish for disease many return home with a heavy cough Muslims call the “hajj flu. ” I grew up in a observant   Muslim family in Canberra, Australia, and at 15 started wearing the hijab. I prayed regularly, memorized the Quran and sought to study Shariah, Islamic law. But my faith began to shatter in college. I was 20 when I took off my head scarf, feeling I could no longer visibly represent a religion that did not allow women to preach before men, lead them in prayer or serve as witnesses in some judicial matters. Now, at 38, I have a tangled relationship with Islam. It is the bedrock of my values. It informs how I smile at strangers, give to charity and try to be patient with dentists and landlords. But I date, I own a (modest) bikini, and while I still fast during the holy month of Ramadan, I do not exactly adhere to Islam’s other prescriptions. Still, I had always dreamed of doing the hajj. My oldest sister, Marwa, a farmer in rural New South Wales, and I planned to take a year off and walk to the Kaaba, as the great Sufi woman Rabia   did in the eighth century, from Basra, Iraq. It was one of those   items that got kicked back as life happened. Then a few months ago, a colleague suggested that I apply for a journalist visa to cover the hajj. I posed for a fresh passport photo wearing a black head scarf, red lipstick, and a scowl. “Are you a Muslim, sister?” the man at the Saudi Embassy in Jordan asked, looking suspiciously at the photo. “Yes, sir,” I said, pointing to my rather poetic name, Diaa   the Light of Radwa. Radwa is a mountain in Medina, the   city in Islam. The man stamped my passport with the visa. Suddenly, it was real. In the weeks since, I have sometimes found myself crying as I realized I would soon lay my own eyes on the Kaaba, which is empty  —   a reminder that the heart of Islam is the worship of a singular, inimitable God. I am also dreading the crowds, the heat and the logistics, and especially the minder whom the Saudi Ministry of Information assigns to follow journalists everywhere. And I’m anxious about my parents’ expectations. Then there was the matter of footwear. I had been planning to wear hiking boots  —   sturdy, comfortable, and nobody would squash my toes. My mum quickly nixed that notion. “If you wear shoelaces,” she warned in halting English, “men will try grab you as bend over to untie them. ” Mum has undertaken the pilgrimage several times, and said nothing worked better than socks and Crocs  —   easy to slip on and off. Crocs I got. But socks? Because, she explained, people pee everywhere, and you want to avoid stepping in that. Instead, I bought braided leather sandals. And socks. I have taken my sister Arwa’s advice of wearing a long robe with a zipper, instead of buttons, so nobody can rip it open. Per my mother’s instruction, I tailored it to sit above my ankles, so I won’t trip. (It’s much harder for men, who may wear only two seamless white sheets. That’s it. No underwear, nothing. I can’t imagine working like that.) Hijab is of course required I have added an elastic band, so if the scarf slips, I won’t reveal any strands. My brother Saif says people get really angry at women who look immodest. In the bag I will keep clutched to my chest I have a camera, a notepad, an iPhone, disinfectant gel, medicine for diarrhea, and antibiotics. My brother says it’s too dangerous to let my camera or anything else dangle from my neck it could get snagged. “I cannot begin to describe the crowds,” he wrote on our family WhatsApp group. “You will often be stuck in human traffic moving only by the will of people around you, almost like a wave carrying you. ” Saif undertook the hajj four years ago, when he was 31. “You may get shoved out of the way by a burly Turkish woman,” my brother continued. “A man might think it is his   right to pee in front of you. Just be patient and know why you are there in the first place. ” He called a few days later: “Listen, I forgot to tell you something. ” “Do your business before you go anywhere,” my brother said, describing how he once had to wait two or three hours to move perhaps 50 yards to a hotel. “Toilets, toilets, be very conscious of where they are and how you can get there. ” Diarrhea is an   threat. “You might need to find a quick escape route to a bathroom. ” My father chimed in: “Buy your dates in Taif,” a Saudi city near the holy sites. There, he said, “they only cost a couple of dollars a kilo. If you buy them in Mecca or Medina, it’s around $35 a kilo. Everything is more expensive there. ” And then, Arwa, who made the journey in 2004, refocused me. “The spiritual feeling overtakes” these earthly issues, “the people that rip you off, the men that are sexually assaulting people in front of you,” she wrote on WhatsApp. “It takes over all of that. It’s beautiful and unforgettable. ”'"}, "time": 1742562227.3431637}