{"duration": 0.021414995193481445, "input_args": {"text": "'This post was originally published on this site \\nValeria Monis makes unique ceramics, decorated with patterns based on Russian criminal tattoos. \\nScroll down to see more VALERIA MONIS Artist Valeria Monis now lives in Israel and is working on a series of porcelain, decorated with patterns based on Russian criminal tattoos. / The cat is the symbol of a successful thief. On the forearm or shoulder it symbolises a “native occupant of prison,” on the legs it means “convicted for robbery” or “convicted for life.” VALERIA MONIS \\nThe pattern is painted on dishes and vases. The series is called “From Russia with Love.” / Tattoos of crosses, churches, the Virgin Mary are reserved for the chest, the most significant part, and the back. VALERIA MONIS \\n“In Russian prisons, tattoos serve as a unique language of symbols that represent the prisoner’s personal life stories. The rules for reading them are passed on by oral tradition.” / The text reads: “I call you, I miss you, I’ll drink you drop by drop, my love.” A tattoo worn by lesbians, it was widespread in 1970s-80s. VALERIA MONIS Valeria Monis: “Each ceramic piece is designed, crafted, and illustrated 100% by hand, incorporating illustrations taken from The Russian Criminal Tattoo Encyclopedia by Danzig Baldaev.” / Tattoos of crosses, churches, the Virgin Mary are reserved for the chest, the most significant part, and the back. VALERIA MONIS \\nTattoos confer a criminal’s identity; they are a seal of social standing and a repository of collective memory. In the criminal world, no tattoos means no status. / A female thief’s tattoo. The number of domes symbolises the amount of convictions or number of years served. VALERIA MONIS \\nA humorous tattoo typical for collective labor camps, commonly called “Misha the accordion player.” VALERIA MONIS \\nThis rare tattoo belonged to an old thief named Shulga, whose left hand was missing. He was repeatedly convicted and well-known. VALERIA MONIS \\nWomen’s tattoo symbolising the loss of freedom and loving parents, an unhappy fate, the burden of loneliness or the disappointment of life. VALERIA MONIS \\nThe text reads: “Winged Russia is the queen of planet Earth.” Related '"}, "time": 1742562305.414414}