{"duration": 0.0631704330444336, "input_args": {"text": "'Privatize to Get Rid of Passports and Resolve Immigration By Daily Bell Staff - November 23, 2016 \\nTo silence dissidents, Gulf states are revoking their citizenship Many are left stateless as a result. – The Economist \\nThe Economist “newspaper” is worried that nations are beginning to use passports as a way to punish people that leaders don’t like. \\nThis article focuses mainly on the Middle East, especially Bahrain, which the article calls an “energetic stripper.” \\nMore here: \\nBahrain’s … Sunni royals have dangled the threat of statelessness over its Shia majority to suppress an uprising launched in 2011, during the Arab spring. \\nIn 2014 it stripped 21 people of their nationality. A year later the number was up tenfold. “Gulf rulers have turned people from citizens into subservient subjects,” says Abdulhadi Khalaf, a former Bahraini parliamentarian whose citizenship was revoked in 2012 and now lives safely in Sweden. \\n“Our passports are not a birthright. They are part of the ruler’s prerogative.” Neighbouring states are following suit. Kuwait’s ruling Al-Sabah family have deprived 120 of their people of their nationality in the past two years, says Nawaf al-Hendal, who runs Kuwait Watch, a local monitor. \\nQatar is another big stripper. It suspended citizenship of an entire clan — the Ghafrans— some 5,000 Ghafrans since 2004. But it’s not just travel that is affected when a passport is revoked, but also in many cases jobs, house ownership, even the ability to own a phone or maintain a bank account. \\nIf you are abroad, you cannot return, nor can the birth of a child be recorded, nor even a marriage. The laws allowing passport revocation are broader now, according to The Economist, and include the “terrorism,” which can be defined loosely. \\nLoyalty is beginning to be used as a reason for passport removal, and the West is not exempt. Britain will remove passports based on the contravention of the “public good.” And many EU nations cite terrorism for some passport confiscations \\nIn the US, passports may be suspended by the IRS if overseas citizens owe more than $50,000 and the IRS has filed a notice of lien. However, the largest issue regarding passports remains unexamined by this article. And that issue has to do with the necessity for passports in the first place. \\nIt can be argued of course, that passports are an absolute necessity for nation-states, but passports are basically an invention of the 20 th century. The Guardian tells us, “Passports were not generally required for international travel until the first world war.” Before then, passports were issued in a haphazard manner. Here, from the Guardian: \\nFollowing an agreement among the League of Nations to standardise passports, the famous “old blue” was issued in 1920. Apart from a few adjustments to its duration and security features, the old blue remained a steady symbol of the touring Briton until it gradually began to be replaced by the burgundy-coloured European version in 1988. \\nINTERPOL is another form of global control that is less than 100 years old. Post-World War II, the United Nations has played a more active role in resuscitating and formalizing INTERPOL, see here. \\nThus, international control of people’s movements and actions has drastically increased in the 20th and 21st century. Passports are now starting to represent regions rather than countries. A pan-African passport was announced earlier this year at the African Union (AU) summit in the Rwandan capital Kigali. From the report: \\nWith the launch of the new pan-African document, the continent moved up a notch towards the free cross-border movement of goods and people—in direct opposite to Brexit, the decision by British voters to exit the European Union. \\nOf course, one could argue that expanding a passport’s operational function is not the same as reducing the power of a passport. In fact, even as passports expanded in power and scope in the 20 th century, there were many high-level discussions about getting rid of them. \\nFrom an article posted at Business Insider: \\nIn 1947, the first problem considered at an expert meeting preparing for the UN World Conference on Passports and Frontier Formalities, was “the possibility of a return to the regime which existed before 1914 involving as a general rule the abolition of any requirement that travelers should carry passports”. \\nBut delegates ultimately decided that a return to a passport-free world could only happen alongside a return to the global conditions that prevailed before the start of the first world war. \\nBy 1947, that was a distant dream. The experts advised instead a series of bilateral and multilateral agreements to attain this goal. \\nWorld leaders were still talking about banning passports as late as 1963, when the UN Conference on International Travel and Tourism recognised “the desirability, from both an economic and social point, of progressively freer international travel”. Once again, it was estimated that “it is not feasible to recommend the abolition of passports on a world-wide basis.” \\nNow, neither the public nor governments consider passports as a serious obstacle to freedom of movement, though any would-be traveller from Yemen, Afghanistan or Somalia would no doubt argue differently. \\nThe world survived without passports for thousands – tens of thousands – of years. Likewise, the necessity of an expanding, global police force has not historically been a matter of discussion, much less implementation. Yet today the passport system is globally ubiquitous and growing. INTERPOL is merging some operations with the UN and becoming evermore aggressive and empowered. \\nThe Economist article promotes the idea that passports ought to be seen as travel documents, not weapons of punishment. This is logical as far as it goes. But it never occurs to The Economist editors to argue that passports ought not to exist to begin with. \\nThe Economist like most of the mainstream media is always apt to criticize the powers that government has but never to suggest that the real solution is to do away with those powers. \\nEven a passing familiarity with free-market economics would yield up options other than merely re-calibrating government power. \\nPrivate property is the key to a better and more rational world. If people – rather than their governments – owned a substantial portion of the world’s real estate, immigration might soon cease to be a problem. People themselves would decide who would come and go. The poisonous immigration battles now taking place would be at least mitigated. \\nLikewise, government abuse of passports would be considerably reduced if it were generally accepted that people had a right to invite people onto their own property without government permission. \\nThe argument then comes up that “terrorism” necessitates passports and government control over immigration. But even a cursory examination of the history of al Qaeda and ISIS will show that the West and especially the US fostered these terrorist groups to begin with. \\nHere, from GlobalResearch.com: \\nThe so-called “War on Terror” should be seen for what it really is: a pretext for maintaining a dangerously oversized U.S. military. The two most powerful groups in the U.S. foreign policy establishment are the Israel lobby, which directs U.S. Middle East policy, and the Military-Industrial-Complex, which profits from the former group’s actions. \\nSince George W. Bush declared the “War on Terror” in October 2001, it has cost the American taxpayer approximately 6.6 trillion dollars and thousands of fallen sons and daughters; but, the wars have also raked in billions of dollars for Washington’s military elite. \\nThose controlling government are ever jealous of their prerogatives and the wealth they have access to. They will create an endless amount of crises to justify and expand their control. Government itself, based on monopoly power and resultant force, is purveyor of the problem, always. \\nConclusion: Reshaping public solutions does no good. Jettisoning them to greatest degree possible is the only viable solution.'"}, "time": 1742628523.4241328}