{"duration": 0.12350821495056152, "input_args": {"text": "'MINNEAPOLIS  —   On April 21, as news spread that Prince had been found dead at his Paisley Park compound in Chanhassen, Minn. a crowd began to gather 21 miles away at First Avenue, the Minneapolis club where he had filmed the concert scenes for the 1984 film “Purple Rain. ” Thousands of fans flocked to what became a giant   block party memorial, and local acts took the stage to play covers of Prince’s songs. On Thursday night, Prince’s band the Revolution arrived on that stage for the first time since 2012 to honor, and grieve for, one of their own. For three months after his death, the group had remained silent about details of a reunion, finally confirming a   stand (which grew to include a third) in early July. “I need this as much as you,” the bassist Mark Brown, a. k. a. Brownmark, wrote on Facebook at the time of the announcement. “Sharing the music with you is what will heal. ” Thursday night’s show, the first of the brief run, offered the crowd of 1, 500 the chance to experience Prince’s music as performed by the musicians who helped define it: Wendy Melvoin (guitar) Lisa Coleman and Matt Fink (who’s called Dr. on keyboards) Mr. Brown (bass) and Bobby Rivkin, known as Bobby Z (drums) as well as the   André Cymone and the lead guitarist Dez Dickerson, who had played with Prince in the years before the Revolution. The group had previously reunited at First Avenue for a benefit for Mr. Rivkin after he had a heart attack in 2012, and according to Nathan Kranz, the club’s general manager, Mr. Rivkin did most of the legwork in staging the current reunions. Mr. Dickerson said there was talk of getting back together at the Los Angeles memorial for Prince in May: “Things were being sorted. ” The shows were finally booked in  . “Look at those smiling faces! That’s what we want to see,” Ms. Melvoin said from the stage on Thursday night, perhaps trying to nudge the mood toward celebration from something more somber, before the band surged into its opening song, “Let’s Go Crazy. ” She added, “I expect to hear everyone singing. ” She got her wish, on and off the stage. With no Prince anchoring the band, group vocals  —   harmonies,      —   were plentiful, and Ms. Melvoin stepped up front for rockers like “Let’s Go Crazy” and “Raspberry Beret. ” With Mr. Cymone and Mr. Dickerson joining the band, they recreated “1999,” alternating singers on each opening line. Mr. Cymone took lead on “Little Red Corvette,” and a quick survey of the club showed that most everyone in it was singing along ditto, later, for “Kiss,” which the Revolution played in a way that was close to the original recording, unlike their boss, who had constantly changed the arrangement. A number of guests bolstered the show. The RB singer Bilal was a welcome surprise, having not only aced the BET Awards’ Prince tribute but also one at Carnegie Hall in 2013. At First Avenue, he proved a mellifluous falsetto for hire, especially on “The Beautiful Ones,” whose climax he lifted with his nimble squall. Fans spied other familiar faces onstage: Susannah Melvoin (Wendy’s sister, Prince’s former girlfriend and the lead singer in the Family, a band he masterminded) Omar Baker, Prince’s brother (resplendent in a white fedora and   shoes) the “Purple Rain”   Apollonia (who introduced the encore by tossing gold hoop earrings to the crowd, a motif in the movie) and Prince’s   Mayte Garcia. The crowd members were largely in their 40s and 50s, many from out of town. One of the first in was Scott Bogen, a Twin Cities native who once won $1, 000 impersonating Prince for First Avenue’s     contest. He has lived for the last two decades in Big Sur, where he is a volunteer firefighter, and came back here for the reunion. “We’ve been fighting the fire for five weeks straight,” he said, referring to the West Coast wildfires. “My property burned, but my house survived. ” Mr. Bogen said it was fortunate that the fire didn’t claim the tambourine Prince signed for him in 1981. There were mementos available at the Revolution’s merchandise table  —   four   two hoodies  —   where a line of a dozen that had assembled by 7:13 p. m. had tripled by 7:20. (The club’s doors had opened at 7.) But many in the audience were wearing two   that weren’t for sale: designs featuring a list of the Revolution members’ names or the contents of a lunchbox in “Starfish  Coffee,” a song on Prince’s 1987 double album, “Sign o’ the Times. ” It’s hard to imagine the Revolution tribute’s taking place anywhere other than First Avenue. Prince had used the club as a home performance base since 1981, and it was the spot where he debuted the song “Purple Rain” in 1983, before it made many memorable appearances in the film the following year. A replica of the motorcycle from the movie stood where pinball machines once did. A few fans wore   of Prince’s “Purple Rain” trench    look. Much of Ms. Melvoin’s stage patter revolved around the idea of the show’s being not just in Prince’s memory, but for his heavenly delectation. After a cheer following “America,” she focused on the crowd. “Everybody hear that?” she asked. “Let’s help him hear this. ” When Ms. Melvoin and Ms. Coleman played “Sometimes It Snows in April” as a duo, quiet and acoustic, Ms. Melvoin struggled to keep her composure it was a clear highlight, particularly when she sang, “Always cry for love, never cry for pain,” to some deeply felt shouts from the crowd. At the end of the night, one thing stood out  —   that the band didn’t even try to copy Prince’s singular guitar solos, in particular for “Let’s Go Crazy” and “Purple Rain,” the inevitable show closer. The lack of flash for “Purple Rain” wasn’t total (there were actual lighters in the air) but it nevertheless gave the song a rawer charge than usual. It was stark, yet fitting. Who could ever replace their man?'"}, "time": 1742564159.1241317}