{"duration": 0.01107478141784668, "input_args": {"text": "'The latest round of mass layoffs for cereal maker Kellogg’s has hit Kansas City, where nearly 200 workers will lose their jobs, the company says. [The layoffs of 185 workers are part of a program euphemistically labeled “Special K,” a scaling back of distribution centers all across the country, the Kansas City Business Journal reported.  “As the distribution shifts from our network to our retailers’ networks, so too will the work,” Kellogg’s spokesman Kris Charles said, adding: We’ve been actively engaged in conversations with some of our biggest retail partners who have expressed strong interest in hiring these employees for   roles once the transition is complete. As a result, we are optimistic that our employees will find similar employment once this transition is complete. The new distribution model is already in use for many of Kellogg’s snack product lines, including Pringles,   crackers, its frozen foods products, and others. “The new model will be transformational for Kellogg, reducing complexity and cost structure while driving growth and profitability for the company and its retail partners,” Charles added. “While this is the right move for the company to achieve our   objectives, it was a difficult decision because of its impact on employees. ” Kellogg’s has been struggling the last few years, and customer confidence in its brand name has fallen from sixtieth to   place during the last four years. The layoffs in Kansas City are but a small part of the string of job losses the company announced. Just last week, a distribution center in Florida was informed that 246 employees were going to lose their jobs, nearly 300 were fired in facilities in New York early in May, and only a week later, another 219 lost their jobs in Minnesota. The cuts came on the heels of several announcements by the cereal maker that it was slashing its workforce. The company’s financial struggles coincided with Kellogg’s decision last year to cease advertising with Breitbart News, whose 45, 000, 000 readers, Kellogg’s said, are not “aligned with our values as a company. ” While Kellogg’s decision to cease advertising had no impact on Breitbart. com’s revenue, it did represent an escalation in the war by leftist companies like Target and Allstate against conservative customers whose values propelled President Donald Trump into the White House. After the cereal maker turned its back on conservative customers, Breitbart News launched its #DumpKelloggs petition, which more than 450, 000 people signed. Finally, according to advertising industry watchdog Adweek, Kellogg’s decision to pull advertising from Breitbart News and the ensuing controversy over the move inflicted   damage to the cereal company’s online brand. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628599.412113}