{"duration": 0.10853958129882812, "input_args": {"text": "'A New York City police union official criticized Democrat New York City Mayor Bill de Blasio and the his police commissioner for sanctuary city protections granted to criminal aliens. [The Democrat mayor vowed after President Donald Trump was elected in November that he would keep existing sanctuary cities policies, reported Breitbart Texas. This comes despite the Obama Administration’s Justice Department certifying the nation’s largest city as a sanctuary jurisdiction in 2016. The city stands to  lose millions in federal law enforcement grant money, Breitbart Texas reported. The city could also be forced to repay more than $60 million in previously received law enforcement grants.  Ed Mullins, president of the Sergeants Benevolent Association said on a radio show Sunday, “It’s almost like the world is   right now. ” He added, “The people who are committing crimes they don’t belong in the country,” reported the New York Daily News. Mullins said police officers want to help Immigration and Customs Enforcement (ICE) agents. “Make no mistake about it, the members of law enforcement in the NYPD want to cooperate with ICE. I speak to cops every day  —   they want to cooperate with ICE, they want to work with fellow law enforcement agents. ” “There is a moral obligation, and as the chief law enforcement officer of the city, you yourself have to be able to follow the law. We don’t get to participate in the laws that we want. ” That’s total lunacy,” he added. The New York Immigration Coalition (NYCI) tweeted out the Daily News article saying, “NYPD police union boss says cops want to help ICE deport. Not on our watch. #NoBanNoWallNoRaids #Our NY” NYPD police union boss says cops want to help ICE deport. Not on our watch. #NoBanNoWallNoRaids #OurNY https:  .   —   NYIC (@thenyic) February 27, 2017,  The NYIC describes itself on its Twitter profile as “aim[ing] to achieve a fairer and more just society that values the contributions of immigrants and extends opportunity to all. ” Last week New York City Police Commissioner James O’Neill released an      memo to his officers that said, “The NYPD does not conduct civil immigration enforcement. Specifically, this department does not enforce administrative warrants issued by Immigration and Customs Enforcement agents or federal immigration judges solely in connection with civil immigration violations. ” “It is critical that everyone who comes into contact with the NYPD, regardless of their immigration status, be able to identify themselves or seek assistance without hesitation, anxiety or fear,” O’Neill said. The New York City police commissioner elaborated in his memo, “For example, the NYPD does not arrest or detain individuals for immigration violations such as overstaying a lawfully issued visa. ” He said however, “the NYPD does and will continue to honor federal immigration detainers when there is a risk to public safety. ” Homeland Security (DHS) Secretary John F. Kelly issued comprehensive reforms of President Barack Obama’s immigration policies on February 17, reported Breitbart News. As reported, these policies restored the 287( g) program which provides for cooperation of state and local police officials with DHS agents. The program was stopped by Obama in 2014. Deportation of illegal immigrants hit a   low during President Obama’s last full fiscal year in office, Breitbart Texas reported. The administration waited until the last Friday of the year to release its final FY 2016 report on Immigration and Customs Enforcement removal operations. “We can’t ignore people who commit crimes and facilitate an atmosphere of harboring them because we want to get votes in an election year. It’s just terrible to do that,” police union head Mullins was reported by the New York Daily News to say on Sunday. “If you’re arrested, you commit a misdemeanor, you commit felonies  —   why are we going to tolerate this?” Mullins also put the onus on de Blasio and the police commissioner if any of his officers or a civilian are hurt: “If a member of law enforcement is killed or a member of the public is killed, well that public official that plays this game or that members of law enforcement that play this game, they better be prepared to answer for that. And this will no doubt some time along the line happen, because we’re seen it happen across the country. ” “Criminal aliens routinely victimize Americans and other legal residents,” DHS Secretary Kelly wrote in a   memo obtained by Breitbart Texas. “Often, these victims are not provided adequate information about the offender, the offender’s immigration status, or any enforcement action taken by ICE against the offender. ” Secretary Kelly recently ordered the director of ICE to create a program (“VOICE”) to help those who have suffered at the hands of criminal illegal aliens, Breitbart Texas reported. The program creates a liaison and authorizes the disclosure of suspect immigration statuses and other information. Mayor de Blasio’s spokesperson Austin Finan was reported to respond to Mullin’s comments on the radio, “The City works with ICE to see that violent and dangerous individuals are deported. Neighborhood, precision and    policing have driven crime to historic lows, not the deputizing of police officers to double as ICE agents. ” Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742563324.6606882}