{"duration": 0.15836787223815918, "input_args": {"text": "'After 18 years of trying to get noticed, the rapper and teenage eccentric Lil Yachty has been forced recently to practice blending in. It’s mostly the hair. On a recent Saturday, following a dayslong spate of promotional appearances and photo shoots, the    internet supernova, who found fame online and beyond this year with a series of catchy mixtapes and goofy viral moments, hoped to do a little shopping in the heart of Brooklyn. But before he could peacefully enter Kith, the streetwear store that specializes in sneakers and sugary cereal, Lil Yachty needed to hide his trademark accessory: his   skinny braids adorned with clear plastic beads. As his chauffeured S. U. V. approached the buzzing shop, the Atlanta rapper grabbed a knit cap from the head of a friend, who assented without a word, seemingly familiar with the routine. It worked. Locks tucked atop his head, Lil Yachty, whose face is usually obscured by the clacking tentacles, proved unrecognizable even to those who may have binged on his whimsical music videos or Instagram account. Like a millennial Clark Kent, he went unbothered in the maw of his target demographic, drawing stares only as he stacked five pairs of shoes and two art books (“Pharrell,” “KAWS”) by the register. As with the   spree, there was still some thrill in needing to go undercover. “At the beginning of this year, I used to walk through the local mall and say, ‘One day, I’m not going to be able to walk through this mall,’” Lil Yachty said later in the privacy of a Caribbean restaurant, his hair since released. “No way I could walk through the mall now. Unless I’m hiding. ” Last winter, the teenager born Miles McCollum, who had recently dropped out of college and had been arrested in a Florida mall for credit card fraud, was hoping to shake his anonymity. Rapping was a relatively new pastime (it still is) though striving for fame came naturally to a diligent student of social networks. “I always knew I was going to be something,” he said. “I didn’t know what. ” Now, at the end of a   2016, Lil Yachty seems more certain. “I’m not a rapper, I’m an artist,” he said. “And I’m more than an artist. I’m a brand. ” The stats back him up. In addition to releasing the popular “Lil Boat” and “Summer Songs 2” mixtapes, filled with his taffylike digital wails and cartoon melodies, and reaching No. 5 on the Billboard Hot 100 with his    guest verse on D. R. A. M.’s “Broccoli,” Lil Yachty has modeled Kanye West’s Yeezy line at Madison Square Garden, starred in a Sprite commercial with LeBron James and teamed up with Nautica on a capsule collection for Urban Outfitters. An official debut album with Capitol Records is planned for early 2017. Yet even among the bevy of singular voices in the new Atlanta   scene, where male rappers can wear dresses and carry designer bags, moan about their feelings and dance with their hips, Lil Yachty is demonstrably odd, flaunting his indifference to rap traditionalism and aiming to remain somewhat wholesome: more schoolyard than trap house. “Rappers don’t have endorsements because of their images,” he said. “Endorsement money is huge. And I care about my character. ” He added: “I don’t rap about drinking or smoking, ever, because I don’t do it. I don’t rap about anything I don’t do. ” Instead, Lil Yachty preaches an   positivity fueled by timeless adolescent ambitions: chasing girls, looking cool and hanging out with friends. (Lil Yachty’s crew is known as the Sailing Team: “If you’re a fan of me, then you know my friends, because I push them just as hard. ”) His most menacing raps can feel playful, his sexuality disarmingly juvenile and his boasts betray his age: “Parents mad at my ass ’cause their kids sing my song in class,” he taunts while proclaiming himself the King of the Teens. “We are the youth!” goes another battle cry. As with his breakout viral hits “1 Night” and “Minnesota,” Lil Yachty’s music relies less on technical rapping than on simple melodies that invoke warped nursery rhymes, with bright, bubbly production and an affecting falsetto smoothed with  . Along with Kanye West and Kid Cudi, both of whom count as elder statesmen to someone born in 1997, his most direct influences include the   outre internet rappers Lil B and Soulja Boy, along with pop acts like Coldplay, Daft Punk and Fall Out Boy. While modeling for Nautica last month to his own personal playlist, Lil Yachty mimed air guitar to “Paradise City” by Guns N’ Roses and boogied to Elton John’s “Bennie and the Jets” when he wasn’t belting Chris Martin ballads. Between looks, he dined on his preferred menu of Domino’s pepperoni pizza, candy and cookies, head buried in his two Louis   iPhones. (One had a   message: “LETS BE RICH FOREVER. ”) At the same time, Lil Yachty’s stated indifference toward the catalogs of Tupac and the Notorious B. I. G. has made him a punching bag for rap purists, the poster child for a    new school dismissively dubbed “mumble rap. ” He’s leaned into that mantle, so online schadenfreude bubbles up every time Lil Yachty, say, bombs a freestyle over ’90s beats or fails miserably at dunking a basketball. “I ask myself all the time, ‘How do I always go viral? ’” Lil Yachty said with a grin. “I’m the face of the youth, the new sound. Nobody likes my truth. ” Except the youth, that is. “They relate to me because I’m so like them,” he said, “but on a global scale. ” Music, it turns out, was something of an afterthought, despite his deep roots in Southern rap. Though he was raised mostly by his mother in the Atlanta suburb Austell, his father, Shannon McCollum, lived in the city and worked as a photographer with local acts such as Outkast, Goodie Mob and Lil Jon. But hanging around stars as a child bolstered Lil Yachty’s sense of style and business acumen more than his sense of   history. “I would let him help direct photo shoots, and I would always show him my invoices so he could see what I made,” Mr. McCollum, 46, said. “I used to photograph Miles every week. By 3 or 4, he was so comfortable in front of a camera. ” An obsession with fashion followed. “Once, when he was about 7, we were picking up his friend, and Miles had on a pink polo shirt,” his father recalled. “The little boy got in the back seat and started laughing uncontrollably at Miles, calling him a girl. Miles just said, ‘You don’t know nothing about this, man. ’” In high school, influenced by the bright colors favored by Pharrell Williams and Tyler, the Creator, Lil Yachty would spend the money he earned working at McDonald’s or as an assistant to his father at thrift stores. “  cents, 50 cents, I just knew how to put it together,” he said. His mother even taught him to sew. His confidence and originality helped to win over his eventual manager, Coach K, an Atlanta stalwart who has worked with Young Jeezy, Gucci Mane and Migos. “It was like your first meeting with Marilyn Manson,” Coach K said of encountering Lil Yachty. “You’ve got this freakish look, but he’s not scared of who he is. He’s wearing it with pride. Instantly I said, ‘This is it. ’” Lil Yachty had already determined that packaging a mystique was his strong suit. After graduating from high school, he traveled repeatedly to New York and Los Angeles  —   his father’s day job at Delta gave him access to free flights  —   where he slept on couches and worked to ingratiate himself with   tastemakers like Ian Connor and Luka Sabbat. “I was simply trying to get people who had an audience to hang out with me, so that I could get that audience,” Lil Yachty said. “I was making music, but I wasn’t really pushing it yet. I knew exactly how it worked. ” He corrected himself. “I know exactly how it works. ” Still, even he has been surprised by the speed of his ascent. “It just feels like a dream,” he said, recalling that in January, he couldn’t make it past the door of Kanye’s studio. “I sat in the hallway for hours while ASAP Rocky was in there. They wouldn’t let me in. By August, I was working with him. ” Nautica, too, came calling only after a year of Lil Yachty’s attempting to get the maritime brand’s attention via social media. It was backstage among the V. I. P.s at Jay Z’s Made in America festival in September that Lil Yachty’s new reality started to sink in. “Obama’s daughters knew who I was,” he said. “They were huge fans. Jay Z said my name to me before I introduced myself. ” And yet, persona aside, a teenager can only be a teenager. At an Urban Outfitters    in Williamsburg, Brooklyn, among decidedly less dazzling guests, the rapper hid once again behind his hair and phone as overeager young fans offered him anything they could find to autograph: $5 bills, laptops, water bottles, purses, coats and, yes, eventually breasts. Not yet immune to such attention at close range, Lil Yachty could only giggle to himself, shaking his head as he mouthed the words to his own music.'"}, "time": 1742564323.3472433}