{"duration": 0.028445959091186523, "input_args": {"text": "'Ve la película de su vida y descubre que ha llevado siempre un trozo de lechuga entre los dientes NOTICIA PATROCINADA POR SAMSUNG Verano Azul \\nJordi Carrasco, un informático de Tarragona de 33 años, sufrió ayer una experiencia cercana a la muerte al atragantarse con un “dorito” y, en unos pocos segundos, pudo ver el transcurso de su vida pasar por delante de él “como en una película en definición 4K y formato panorámico”. \\nPese a lo impresionante de la calidad de imagen, Carrasco lamenta que el guión de su vida no estuviera a la altura. “Además, con tanta definición en la imagen he comprobado que llevo treinta años con un trozo de lechuga entre los dientes y nadie jamás me ha avisado”, lamenta. \\n“Los mejores momentos de mi vida, mi primer ordenador, mi primera novia online… todos los momentos memorables en la existencia de un informático se vieron empañados por un simple trozo de lechuga. Qué pena de vida y qué pena dedicar la última tecnología a esto”, se queja. \\nTras una profunda remodelación de sus instalaciones, la antesala de la muerte ha adquirido varios televisores Samsung con tecnología Quantum dot que permiten a los usuarios como Jordi vivir una experiencia más realista. Esto, por supuesto, pide que las vidas de las personas estén a la altura de los avances tecnológicos. \\nLa misma tecnología, además, ha permitido destapar grandes mentiras del pasado: la popular doña Rogelia, personaje de “Mari Carmen y sus muñecos”, era en realidad el actor Quique San Francisco. Por si esto fuera poco, los detalles en alta definición de la serie “Verano Azul” muestran que Chanquete fingió su muerte para huir de la atención mediática y pasó a formar parte de un programa de protección de testigos.'"}, "time": 1742561695.7638938}