{"duration": 0.06351757049560547, "input_args": {"text": "'Comments \\nA man who was believed to be on ecstasy has reportedly had a five hour chat with a hand after a girl he was trying to chat up told him to “talk to the hand ‘cause the face ain’t listening”. \\nSimon Webber, a twenty six year old used car salesman from Worcester, England, claims to have had a “really good chat” with “the hand” and hopes they can “grab a coffee” some time in the future. \\n“The hand was totally peng mate,” claimed Mr Webber during a catch up with Wunderground earlier today. “The girl who owned the hand was well fit so I tried to talk to her but she actually turned out to be a bit of a dick and told me to talk to her hand. I’m really glad now because I instantly hit it off with the hand.” \\n“I’ve not connected with anything like that since the time I took acid while I was camping in the Lake District and met a goat named Boris in the forest,” continued Mr Webber. “Sometimes I feel like I’ve got more in common with things than people, it’s like I can’t have a good conversation with something unless they’re not able to answer me back.” \\n“Me and the hand talked about all kinds of stuff,” revealed a reminiscent Mr Webber. “Brexit, the U.S. elections, diseases that have been eradicated, the potential dangers of genetically modifying food, chemtrail and all sorts of other really interesting things. She’s a great listener, I didn’t get her number but I’m sure I’ll see her around. Hopefully we can hang out again, I don’t want to be getting ahead of myself but I think she could be the one.” \\nAccording to Stacey Poole, the owner of the hand, she had her Saturday night ruined by “some little creature” who was following her around the club all night. \\n“I was just trying to have a good night but that little cretin wouldn’t leave me alone,” complained Stacey. “He tried to talk to me but he was off his nut so I gave him the old ‘talk to the hand’ line and put my hand in his face. The daft twat took it literally and started talking to my hand, at first it was kind of funny but I couldn’t get rid of him, he was following me everywhere, eventually I just had to leave. He ruined my night.” '"}, "time": 1742563422.0143182}