{"duration": 0.18479418754577637, "input_args": {"text": "'CHANTELLE, South Africa  —   A week before South Africa’s local elections on Wednesday, the Zithas held a family meeting inside their entertainment room to decide how to vote. Loyal backers of the African National Congress in every election since the end of apartheid, the family decided it was time for a change. Now, on a leisurely Sunday morning, as his wife and daughter got ready for church, Danny Zitha, 61, a former high school teacher, said the   A. N. C. had left him disillusioned because of its corruption, arrogance and incompetence. He will never go back, he said. “Not at all, as long as I’m alive, sorry,” he said, adding with a laugh, “Maybe after death. ” The A. N. C. which was the party of Nelson Mandela and helped free South Africa from   rule, suffered its worst losses ever at the polls in the municipal elections last week. Unrivaled for the past two decades, the party lost control of two   cities, including the capital, Pretoria, in what many believe is a profound change in how race and the legacy of apartheid influence South African politics. The party’s decline was especially steep in the biggest cities, with many black,   voters in places like Chantelle, a suburb of Pretoria, turning against it.   years after the end of apartheid, such voters appeared more concerned with mundane matters like good governance and taxes than with the party’s heroic liberation past. The emergence of real alternatives for voters, and possibly the growing accountability of political parties, are positive steps for South Africa’s democracy, analysts and even A. N. C. officials have said. In Pretoria, the main opposition party, the Democratic Alliance, defeated the A. N. C. by two percentage points. The A. N. C. ’s share of the vote fell to 41 percent from 55 percent in the last local elections, in 2011. In the voting district including Chantelle, once an   community that is now about 90 percent black, the A. N. C. ’s share of the vote plummeted to 40 percent from 69 percent in 2011. In many ways, the shifting dynamics inside Chantelle reflect larger forces  —   a growing black middle class in a rapidly urbanizing country  —   that are detrimental to the A. N. C. which, especially under President Jacob G. Zuma, has relied on patronage to maintain power. As the election results began trickling in last week, A. N. C. officials said they would engage in “introspection. ” But examples from the rest of the continent are not encouraging: Few liberation movements that assumed power have been able to transform themselves with the changing times and needs. Mr. Zitha and his wife, who is also a high school teacher, moved to Chantelle from Mamelodi, an impoverished township, in 1994. They were one of the first black families in an area that had been restricted to whites under apartheid. Now, Mr. Zitha points to his immediate neighbors on his block of detached homes: a government worker and a prison warden on one side a government worker, a lawyer and a high school teacher on the other side  —   all solid members of the black  . Sensible cars like Toyotas are parked in his garage and those of his neighbors, though some   can also be spotted in Chantelle. “It’s a popular car here, even though I feel it’s quite heavy to maintain a   for a   person like myself,” Mr. Zitha said. ”You’re just pretending to be what you’re not supposed to be. ” In all the previous national and local elections since 1994, Mr. Zitha, his wife and their two older children, after they came of age, voted for the A. N. C. Even so, Mr. Zitha became increasingly dissatisfied with the party’s stewardship of the economy, its upkeep of Chantelle and its culture of corruption under Mr. Zuma. “They’re driving 4x4s, Range Rovers, all those fancy cars,” he said of A. N. C. officials. “Those guys are pompous. They’re just working for themselves and their close relatives. ” Perhaps not surprisingly, it was the Zithas’ youngest child who began questioning the family’s loyalty to the A. N. C. Tshegofatso Zitha, 21, an electrical engineering student, is a “” as black South Africans born after the end of apartheid are called. When she was 15, Ms. Zitha recalled, she learned in school about rape, and began worrying about the large, open field next to her street. Criminals often hid in that field, robbing people of their cellphones. Burglars broke into the Zithas’ house five times over the years. Finding the local A. N. C. official unresponsive, she and some other young women in the area began to carry whistles. “I thought it wasn’t fair because we voted the A. N. C. into leadership here, but we had to find other ways to stay safe,” Ms. Zitha said. She also looked at the adjacent ward, which had been led for some time by the Democratic Alliance. “That place, it’s clean, it’s safe,” she said. “That’s what we want. ” Voting for the first time in 2014, Ms. Zitha backed the Economic Freedom Fighters, a leftist group that finished third in last week’s voting. The rest of her family voted that year for the A. N. C. She waited until   before going to work on her parents and older siblings. “I wanted to see if the A. N. C. would do anything that would benefit any of us in any way,” she said. “So I asked my family, ‘Do you see any difference?’ And they said, ‘No. ’” And so by the time the family got together before the latest election, the Zithas had made up their minds. Mr. Zitha was particularly upset, because he thought the local A. N. C.  government had failed to provide good services despite rising property taxes. “Look at it  —   this is too much,” he said, holding a monthly bill for about $80 in taxes and municipal fees. The Zithas decided to vote for the Economic Freedom Fighters, though they also liked the Democratic Alliance, as did many of their neighbors. One of them, Bongo Matjila, 58, who is also a high school teacher, drove by in his Ford pickup. “We’re friends, we’re brothers, even though we voted for different parties,” Mr. Zitha said, as the two neighbors bantered in his driveway. “We’ve got a common enemy” Mr. Matjila said. “Yeah, if the enemy is this man, we must try hard to get him out of the city,” Mr. Zitha said. “And we got him out. ” An hour later, just a few blocks away, a black Mercedes van pulled into a driveway, containing three A. N. C. supporters active in ward politics. All were from families with deep ties to the A. N. C. and they said they would never quit the party. “I’m used to eating pap,” said one of them, Mogomotsi Mogomotsi, 21, who owns a construction and supply company, referring to the ground corn that is South Africa’s staple. Goms Matabane, 24, who was wearing an A. N. C. baseball cap, said he was extremely disappointed by the election results. “But I’m not really surprised,” he added, “because I’ve been hearing a lot of people saying they’ve lost faith in the A. N. C. ”'"}, "time": 1742562262.1280708}