{"duration": 0.006779909133911133, "input_args": {"text": "'A Florida man accused of raping an    girl after he lured her into his home said her “provocative clothing” signaled consent, police said. [Sydney Allan Markland, 68, was arrested Friday and charged with sexual battery on a victim under 12 years old after police conducted an investigation that lasted several months, WESH reported.  Police said the girl lived in the same neighborhood as Markland and was walking to a friend’s house in July 2016 when he asked her to help carry some fried chicken into his home. The girl told police that she helped Markland because he appeared to be injured. While she was inside the house, Markland allegedly raped the girl and told her not to tell anyone. The Tampa Bay Times reports that the girl told one of her parents, who then called police. Investigators say that Markland’s DNA matched DNA samples taken from the victim’s clothing. Detectives state that Markland told them that his actions are permissible in his culture and that the victim’s “provocative clothing” and “actions” suggested that she consented to “sexual contact,” WKMG reported. “She was wearing provocative clothing,” Markland said, according to the detectives’ report. “Her actions suggested that she was consenting to sexual contact. ” Detectives say Markland admitted to “sexually battering” the child after they ate chicken wings and prayed together. Markland is being held without bail at the Marion County Jail. Investigators say Markland may have sexually assaulted others because he knows a lot of the children in the neighborhood, and neighbors reportedly say they saw children stop by Markland’s home regularly. “Kids will go in there, and he will give them candy and stuff,” said neighbor Steve Sarju. “Not to go inside, he will stay on his porch and say ‘Have a candy. ’”'"}, "time": 1742628489.0170317}