{"duration": 0.0385594367980957, "input_args": {"text": "\"BREAKING! NYPD Ready To Make Arrests In Weiner Case…Hillary Visited Pedophile Island At Least 6 Times…Money Laundering, Underage Sex, Pay-for-Play,Proof of Inappropriate Handling Classified Information \\nThe amazing citizen journalist Mike Cernovich broke this story this morning at Danger and Play . Florida residents have been complaining that they’re not getting their absentee ballots. Chelsey Marie Smith, was working full-time at Broward County Supervisor of Elections main office blew the whistle on the voter fraud scheme: LIVE on #Periscope : Breaking news! Voting fraud uncovered in Florida #MAGA3X https://t.co/q7jeEz6Rgh \\n— Mike Cernovich 🇺🇸 (@Cernovich) November 4, 2016 \\nThe Florida State Attorney is actively investigating the fraud case that involves Secretary of Elections Brenda Snipes: Source: FL State Attorney investigators are actively reviewing Broward County Voter Fraud Case \\n— Jack Posobiec 🇺🇸 (@JackPosobiec) November 4, 2016 \\n\\nDemocrat Dr. Brenda Snipes was appointed by Jeb Bush in 2003 and is no stranger to controversy. On October 20, the Sun Sentinal reported that former Oakland Park Commissioner Anne Sallee noticed something troubling about her vote-by-mail ballot. It is missing Constitutional Amendment 2, the medical marijuana question. \\nSallee, now Broward chapter director of the Florida Restaurant and Lodging Association, knows her way around government. Yet she said she spent a week unsuccessfully trying to get someone at the Broward elections office to pay attention to her complaint. \\nShe was cleared on Wednesday of another election snafu, the early posting of primary election results. Her office also was criticized for sending out inaccurate voter ID cards, and for printing ballots for November that include the word “no” in the “yes” line on the county’s transportation sales surtax question. \\nThere were multiple reports that Hillary personally met with Brenda Snipes days ago: There were multiple reports Hillary personally met with Brenda Snipes days ago. No photos, but where there's smoke… \\n— Jack Posobiec 🇺🇸 (@JackPosobiec) November 4, 2016 \\nAccording to a former Secretary of Elections Department employee, there is a secret room where Democrat insiders fill out those absentee ballots. \\nThe woman provided her sworn testimony via affidavit. \\nThe affidavit by Chelsey Marie Smith accuses Broward County officials of filling out blank absentee ballots to officials who she saw filling the ballots out at the Supervisor of Elections headquarters. Via: GP Page 1: \""}, "time": 1742562096.2178938}