{"duration": 0.09892535209655762, "input_args": {"text": "'TJC: Please tell us about your new film, The Coming War on China . JP: The Coming War on China is my 60th film and perhaps one of the most urgent. It continues the theme of illuminating the imposition of great power behind a facade of propaganda as news. In 2011, President Obama announced a ‘pivot to Asia’ of US forces: almost two-thirds of American naval power would be transferred to Asia and the Pacific by 2020. The undeclared rationale for this was the ‘threat’ from China, by some measure now the greatest economic power. The Secretary of Defense, Ash Carter, says US policy is to confront those ‘who see America’s dominance and want to take that away from us’. The film examines power in both countries and how nuclear weapons, in American eyes, are the bedrock of its dominance. In its first ‘chapter’, the film reveals how most of the population of the Marshall Islands in the Pacific were unwittingly made into nuclear guinea pigs in a programme whose secrets – and astonishing archive – are related to the presence of a missile base now targeting China. The Coming War on China will be released in cinemas in the UK on December 1st and broadcast on ITV (in the UK) on December 6th. TJC: How do you assess Australia’s role in America’s ‘Pivot to Asia’? JP: Australia is virtually the 51st state of the US. Although China is Australia’s biggest trader, on which much of the national economy relies, ‘confronting China’ is the diktat from Washington. The Australian political establishment, especially the military and intelligence agencies, are fully integrated into what is known as the ‘alliance’, along with the dominant Murdoch media. I often feel a certain sadness about the way my own country – with all its resources and opportunities – seems locked into such an unnecessary, dangerous obsequious role in the world. If the ‘pivot’ proceeds, Australia could find itself fighting, yet again, a great power’s war. TJC: With regards to the British and American media, how can the US get away with selling China as a threat when it is encircling China? Obama and vassal leader Abe: Nothing that this duo plots is good for humanity. JP: That’s a question that goes to the heart of modern-day propaganda. China is encircled by a ‘noose’ of some 400 US bases, yet the news has ignored this while concentrating on the ‘threat’ of China building airstrips on disputed islets in the South China Sea, clearly as a defence to a US Navy blockade. TJC: Obama’s visit to Japan, and particularly to Hiroshima, was a really cynical act. What was your impression of Japan and the political situation there? JP: Japan is an American colony in all but name – certainly in terms of its relationship with the rest of the world and especially China. The historian Bruce Cumings explores this in an interview in the film. Within the constraints of American dominance, indeed undeterred by Washington, Japan’s current prime minister Shinzo Abe has developed an extreme nationalist position, in which contrition for Japanese actions in the Second World War is anathema and the post-war ‘peace constitution’ is likely to be changed. Abe has gone as far as boasting that Japan will use nuclear weapons if it wants. In any US conflict with China, Japan – which last year announced its biggest ever ‘defence’ budget – would play a critical role. There are 32 US military installations on the Japanese island of Okinawa, facing China. However, there is a sense in modern Asia that power in the world has indeed moved east and peaceful ‘Asian solutions’ to regional animosities are possible. TJC: Do you think the new trade and investment deals like the Transatlantic Trade and Investment Partnership (TTIP) and especially the Transpacific Partnership (TPP) will affect China’s business operations? JP: It’s difficult to say, but I doubt it. What is remarkable about the rise of China is the way it has built, almost in the blink of an eye, a trade, investment and banking structure that rivals that of the Bretton Woods institutions. Unknown to many of us, China is developing its ‘New Silk Road’ to Europe at an astonishing pace. China’s response to threats from Washington is a diplomacy that’s tied to this development, and which includes a burgeoning alliance with Russia. This interview was originally published by the Plymouth Institute for Peace Research . NOTE:   T.J. Coles is the author of Britain’s Secret Wars (2016, Clairview Books). John Pilger, internatinally renowned Australian journalist and antiwar activist needs little introduction to our audience.   \\nWhat will it take to bring America to live according to its own propaganda?  '"}, "time": 1742561973.5884418}