{"duration": 0.02783513069152832, "input_args": {"text": "\"  DEAD POOL DIVA: Huma Kept Those Hillary Emails FBI Found In A Folder Marked ‘Life Insurance’ Was Huma Abedin stockpiling emails from Crooked Hillary's illegal private server as a buffer between herself and an untimely death? You decide. by Geoffrey Grider October 30, 2016 Did Huma steal those emails and then save them as life insurance to protect herself from joining the Clinton Dead Pool? \\nHuma Abedin is no fool. She may be the closest aide to Hillary Clinton, but she also spent the last 20 years watching enemies of the Clinton Crime Family spontaneously commit suicide. So it is with great amusement but virtually no surprise that today we are finding out that the folder Huma kept those incriminating Hillary emails in was called ‘ Life Insurance ‘. So did Huma steal 10,000 emails and saved it on her comp just in case Clinton targeted her? \\nHence: “life insurance” \\n— Charlie Kirk (@charliekirk11) October 30, 2016 Account suspended \\nWhy can you no longer see the tweet below? Because this: “This account has been suspended. Learn more about why Twitter suspends accounts, or return to your timeline.” Guess Twitter is not a fan a free speech. No wonder the FBI went around the DOJ & Loretta Lynch a file called “Life Insurance” can only mean one thing. What is in those emails crazy! pic.twitter.com/5SHBatOXOa \\n— ⏰0⏰ (@0HOUR1__) October 30, 2016 \\nWas Huma Abedin stockpiling emails from Crooked Hillary’s illegal private server as a buffer between herself and an untimely death? You decide. The Clinton Dead Pool , also known as the Clinton Body Count , is an exclusive club with a sky-high membership fee – your life. Life insurance indeed , Huma may have just saved her own life. SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING\""}, "time": 1742564113.199908}