{"duration": 0.031716346740722656, "input_args": {"text": "'Posted on November 3, 2016 by DCG | 1 Comment \\nWestworld was originally done in 1973. From Wikipedia , “Westworld is a 1973 science fiction Western thriller film written and directed by novelist Michael Crichton about amusement park androids that malfunction and begin killing visitors . It stars Yul Brynner as an android in a futuristic Western -themed amusement park, and Richard Benjamin and James Brolin as guests of the park. \\nSometime in the near future a high-tech, highly realistic adult amusement park called Delos features three themed “worlds” — West World (the American Old West ), Medieval World ( medieval Europe ), and Roman World (the ancient Roman city of Pompeii ). The resort’s three “worlds” are populated with lifelike androids that are practically indistinguishable from human beings, each programmed in character for their assigned historical environment. For $1,000 per day, guests may indulge in any adventure with the android population of the park, including sexual encounters and even a fight to the death. Delos’s tagline in its advertising promises, “Boy, have we got a vacation for you!” \\nThe HBO remake premiered on October 2 nd and stars Evan Rachel Wood, Thandie Newton, Jeffrey Wright, James Marsdan, and a bunch of other actors I’ve never heard of. Their parents must be so proud… \\nFrom Fox News : HBO has been known to push the boundaries in their original programming, featuring scenes depicting incest, rape and over-the-top gore. But some say they might have finally hit gone too far when Sunday night’s episode of their new futuristic show “Westworld” featured a four-minute orgy scene with approximately 40 actors engaging in a variety of sex acts . \\n“HBO is a network that broadcasts ‘Sesame Street’ re-runs. And yes, parents should turn it off, stop paying for it and block it,” Dan Gainor, Vice President of Business and Culture at the Media Research Center, told FOX411. “‘Westworld’ is a disturbing reminder of the sick and demented way Hollywood views the world.” \\nBut industry insiders said nudity and adult content is fine for cable television. “Good or bad TV, this is something that is on pay cable, and viewers who don’t like it can tune it out. It’s appropriate for the story they are telling ,” TV producer Geoff Skinner told us. He added that it’s a parent’s responsibility to monitor the programming a child watches. \\n“Parents like myself should never allow a child to watch this until they are old enough to understand all of the thematic and semiotics that this show is trying to achieve.” \\nFormer television executive Scot Safon said the show does not misconstrue its adult content, and the sexual scene in question was in line with the plot of the series . In other words, viewer beware. \\n“It is deliberately disturbing and provocative, and it makes its intentions very well-known from the opening credits onward,” Safon shared with us. “ It is a show about ideas and it is done with tremendous artistry. I trust the artists here, and would assume that their extended orgy sequence is in line with the vision of the show .” \\nBut branding and communications expert Scott Pinsker warned that HBO has to find a delicate balance and not push the boundaries so far it pushes away its main audience. \\n“HBO is in the business of distributing movies, sports and original content, but it’s primary objective is to promote the HBO brand. It’s a delicate balancing act, because many HBO viewers want to see edgy, risqué content that pushes the envelope, but if HBO goes too far, they can alienate their core audience,” Pinsker said. \\nHe added, “Instead of censoring content, they should have internal standards of what’s appropriate for their brand, and then advise their audience accordingly, so they can decide whether or not to watch.” \\nHBO did not immediately respond to a request for comment. \\nDCG'"}, "time": 1742628522.0848072}