{"duration": 0.04510807991027832, "input_args": {"text": "'WikiLeaks Initiates Phase 3: The Dump That Will Take Hillary Down   Dawn Parabellum   Corrupt democrat, Hillary Clinton \\nWikiLeaks is putting Hillary Clinton and the corrupt Democrats who surround her on notice. With a warning sounded last night about the initiation of “phase 3” from the website, which has been leaking devastating emails about Hillary’s insiders, the “election dump” promises to be the one that brings her to her knees. \\nWikileaks announced on Twitter that it would soon launch “phase three of [its] election coverage.” The tweet also asked those who wish to see more dumps to donate to the site to assist with their funding. The tweet read, “We commence phase 3 of our US election coverage next week.” We commence phase 3 of our US election coverage next week. You can contribute: https://t.co/MsNZhrTzTL @WLTaskForce pic.twitter.com/XferJnMGux \\n— WikiLeaks (@wikileaks) October 30, 2016 \\nThis dump is supposed to be even more damaging to the already flailing political career of Hillary Clinton. Wikileaks supporters now include a number of disgruntled Republican voters and Bernie Sanders supporters. \\nImmediately after the site announced this dump, several WikiLeaks followers replied with tweets expressing hope that phase three would ultimately damage Democratic presidential nominee Hillary Clinton ‘s campaign for good. However, some expressed concern that it could be too little, too late. @wikileaks @WLTaskForce by next week, I assume you mean tomorrow, and not 3 days before the election. Near 30%+ in some states already voted \\n— Mel (@melimel521) October 30, 2016 \\nNew archives of emails released to the public would definitely devastate the Clinton campaign even further, and after the FBI’s announcement that they will reopen the investigation against Hillary, it could be the straw which breaks the camel’s back. \\nSo far, no amount of corruption or criminal activity has gotten devout Democrat voters to see Hillary for who she is: a power hungry sociopath. She has been caught rigging elections across the globe and cheating to get the Democrat nomination. It’s even been proven, thanks to WikiLeaks, that she cheated during the debates against Donald Trump . \\nThere is some speculation that the emails released this time won’t all be Hillary Clinton related, eluding to the possibility of even more Democrats and their corruption being exposed. Hillary Clinton’s rigged podium helped her cheat during the debates with Donald Trump \\nHackers who have taken responsibility for the hacks of John Podesta’s emails may have more up their sleeves. Guccifer 2.0, who claims to be a lone Romanian male, was also involved in the hack on the Democratic Congressional Campaign Committee. \\nHopefully, these leaks will finally get Democrat voters to realize who they have been bowing down to over the past few years. Accessing the leaked emails is not difficult, in fact, I personally check the new dumps daily. If Democrats cared half as much about honesty and integrity as they did about making sure we have the first female president, Hillary would already be no more than a stain on American history.'"}, "time": 1742562187.9835653}