{"duration": 0.07828450202941895, "input_args": {"text": "'NATO forces Russia to take retaliatory moves 02.11.2016 Russia is forced to take defensive measures against the backdrop of NATO\\'s increasing activities on Russia\\'s western borders, Russian Defense Minister Sergei Shoygu said, speaking at a meeting of the joint board of the military departments of Russia and Belarus, RIA Novosti reports. At the July summit in Warsaw, NATO member countries agreed to build up military forces in Eastern Europe. Four multinational battalions are to be deployed in the Baltic States and Poland in 2017. To crown it all, NATO officials intend to strengthen the presence of the alliance in the Black Sea region. All these actions are being made in response to Russia\\'s alleged threat, NATO officials say. However, Russian officials, including President Putin, have repeatedly stated that Russia would never attack any NATO country. At the same time, they added, Russia would not simply sit and watch NATO increasing its military presence near Russia\\'s borders. Print version Font Size \"On western borders of the Unified State (Russia and Belarus - ed.), the United States and other NATO members have been building up their offensive potential by opening new bases and developing military infrastructure. There are continued attempts to impose the will of NATO members on other countries by economic and political dictatorship, as well as by military force. The information warfare is being conducted openly,\" Shoygu said.These actions, the Defense Minister said, undermine the strategic stability and force Russia to take retaliatory measures. The high level of cooperation with Belarus makes it possible to successfully address issues of strengthening the defense capacity of the Unified State, he added. \"This approach is especially relevant now, when international mechanisms designed to resolve critical situations are stalled, and hotspots of tensions have neared our borders,\" Defense Minister Shoygu said. Also read: Russia prepares nuclear surprise for NATO According to him, the military cooperation between Russia and Belarus has been developing actively. In September of 2017, Russia and Belarus are to conduct strategic military exercises \"Zapad-2017\" that will become a \"major joint training event for our armed forces in 2017,\" said Shoygu.In addition, the Defense Minister said that Russia and Belarus pay great attention to the implementation of the agreement on the joint protection of borders and the creation of the joint regional air defense system. In 2016, Russian companies have completed capital repairs of the S-300PS anti-aircraft missile systems that Belarus received from Russia at no cost. \"These measures \"will help to exclude violations of airspace of the Unified State,\" concluded Shoygu.'"}, "time": 1742564277.1730113}