{"duration": 0.038326263427734375, "input_args": {"text": "\"You are here: Home / US / WATCH What this Trump Hater Just Did In His UNDERWEAR WATCH What this Trump Hater Just Did In His UNDERWEAR October 29, 2016 Pinterest \\nSome guy in Wisconsin decided that he couldn’t wait to put some clothes on before he torched a Trump/Pence sign… and it was all caught on camera by the homeowners. \\nKevin and Jane Leighty of Platteville, Wisconsin caught their angry neighbor on camera taking a blowtorch to their Trump/Pence sign in his underwear. Man wearing only his underwear takes blowtorch to his neighbors' Trump sign — and they caught it all on camera https://t.co/XxdHdjAveM pic.twitter.com/mwWFZAwlBI \\n— NBC News (@NBCNews) October 26, 2016 \\nAccording to Jane Leighty, witnesses walked past the scene of the crazed man setting his neighbor’s sign on fire and did nothing to stop him. \\nAlthough I wouldn’t recommend going near a crazy man with a blowtorch in his underwear, as Leighty noted, they didn’t even have to — they could have just called the police. Instead, according to the homeowner, some even congratulated the man for his criminal activity. \\nThe people going by is what really hurts too that no one called the police just to say “hey go check this out.” They didn’t have to confront him. The two guys that come up and fist pumped him and go “yeah alright!” Really? \\nLeighty made it clear that she wasn’t going to back down in the face of a crazed fool and some punks who think it’s hilarious to set fire to someone’s property: \\nAll we had was a little sign, you know, and if they’re offended by it they should have probably left that one there because every time they take it down it’s coming up bigger and better and the next one’s going to be a billboard. \\nGood for them. It’s a sad state of affairs when you can’t express your support of a candidate without someone vandalizing your property, but here we are. \\nThere have been numerous instances throughout the election cycle of Trump supporters having their yard signs vandalized and in some cases being physically and verbally harassed and/or threatened for their support of the candidate. \\nEven with all these instances, the media has chosen to focus primarily on any incident they can dredge up at Trump rallies — which we now have confirmation, thanks to Project Veritas , that Democrat operatives incite via a tactic called “birddogging.” \\nThese anti-Trumpsters — often liberals, although it’s unclear what this man’s political bent was for sure — have shown their true colors throughout this election cycle. They can’t handle the fact that someone else may not think the same way they do, which is truly pathetic. \\nGood for the Leighty’s; it takes guts to stand up for your rights, and that’s exactly what they are doing by not giving in to a crazed bully.\""}, "time": 1742561928.567691}