{"duration": 0.0579988956451416, "input_args": {"text": "'Truthdigger of the Week: Standing Rock Sioux Chairman David Archambault II Posted on Oct 29, 2016 Dave Archambault, outside the Washington, D.C., courthouse where appeals court judges heard his tribe’s challenge to the Dakota Access pipeline. (Jessica Gresko / AP) \\nDemonstrations against the construction of a $3.8 billion oil pipeline in North Dakota began to receive much-needed mainstream media coverage this week when law enforcement and protesters faced off in a tense confrontation that ended in at least 140 arrests. While many people only recently may have learned of the fight against the Dakota Access pipeline (DAPL), Standing Rock Sioux tribe Chairman David Archambault II has worked for two years to prevent its construction. \\nSome background: The proposed pipeline would cut across the Missouri River just upstream of land belonging to the Standing Rock Sioux. It could threaten the tribe’s only water source if a leak were to occur (and as many environmental activists note , leaks always occur.) Over the past several months, the tribe has begun to receive support from other “water protectors,” and peaceful demonstrations—such as prayer circles—have become a regular aspect of life on the Standing Rock reservation. \\nArchambault attended Standing Rock High School and earned a bachelor’s degree in business administration from North Dakota State University and a master’s in management from the University of Mary in Bismarck, N.D. As chairman of the tribe, he has been at the forefront of opposition to the DAPL. In an August op-ed for The New York Times, Archambault wrote: \\nOur tribe has opposed the Dakota Access pipeline since we first learned about it in 2014. Although federal law requires the Corps of Engineers to consult with the tribe about its sovereign interests, permits for the project were approved and construction began without meaningful consultation. … \\nAdvertisement Square, Site wide \\nThe Dakota Access route is only a few miles shorter than what was proposed for the Keystone project, yet the government’s environmental assessment addressed only the portion of the pipeline route that traverses federal land. Domestic projects of this magnitude should clearly be evaluated in their totality—but without closer scrutiny, the proposal breezed through the four state processes. \\nArchambault represents his community and its fight to protect the water, eloquently expressing the racial, economic and political factors moving the construction of the DAPL forward. “Perhaps only in North Dakota, where oil tycoons wine and dine elected officials, and where the governor, Jack Dalrymple, serves as an adviser to the Trump campaign, would state and county governments act as the armed enforcement for corporate interests,” he writes in his op-ed. “It’s a familiar story in Indian Country. This is the third time that the Sioux Nation’s lands and resources have been taken without regard for tribal interests.” \\nIn recent months, demonstrations against the DAPL have increased in size, and the police response has grown more intense. Law enforcement and DAPL officials have set dogs on protesters , used pepper spray , sound cannons and rubber bullets . As the situation intensifies, Archambault continues to speak powerfully on the injustices. \\nEarlier in October, for example, he explained the status of the ongoing legal challenges to the pipeline and urged President Obama to get involved. \\n</p><p> \\n“Any time infrastructure projects like this come near, we are invisible,” he told Amy Goodman on Democracy Now! “We have lands, treaty lands, that are being encroached on. And we know that there are sacred places there, and we know that the pipeline needs to stay away from those sacred places, but they keep—they continue to come and desecrate those sacred places.” \\nOther protests against the government have ended in violence—take, for example, the armed standoff between Ammon Bundy and law enforcement in Oregon earlier this year. But the Standing Rock Sioux tribe remains committed to peace, even as police continue to escalate the confrontation. As tribal chairman, Archambault reinforces this commitment to peaceful and spiritual protest. \\n“[W]e’re asking everybody to remain prayerful and peaceful and not to react to any form of aggression that law enforcement brings,” he said in an interview on National Public Radio . “We don’t want to see the construction workers get hurt, we don’t want to see law enforcement get hurt, and we definitely don’t want to see people who are standing up to protect water to get hurt.”'"}, "time": 1742562073.2173905}