{"duration": 0.358776330947876, "input_args": {"text": "'The chant erupts in a college auditorium in Washington, as admirers of a conservative internet personality shout down a black protester. It echoes around the gym of a central Iowa high school, as white students taunt the Hispanic fans and players of a rival team. It is hollered by a lone motorcyclist, as he tears out of a Kansas gas station after an argument with a Hispanic man and his Muslim friend. Trump Trump Trump  In countless collisions of color and creed, Donald J. Trump’s name evokes an easily understood message of racial hostility. Defying modern conventions of political civility and language, Mr. Trump has breached the boundaries that have long constrained Americans’ public discussion of race. Mr. Trump has attacked Mexicans as criminals. He has called for a ban on Muslim immigrants. He has wondered aloud why the United States is not “letting people in from Europe. ” His rallies vibrate with grievances that might otherwise be expressed in private: about “political correctness,” about the ranch house down the street overcrowded with day laborers, and about who is really to blame for the death of a black teenager in Ferguson, Mo. In a country where the wealthiest and most influential citizens are still mostly white, Mr. Trump is voicing the bewilderment and anger of whites who do not feel at all powerful or privileged. But in doing so, Mr. Trump has also opened the door to assertions of white identity and resentment in a way not seen so broadly in American culture in over half a century, according to those who track patterns of racial tension and antagonism in American life. Dozens of interviews  —   with ardent Trump supporters and curious students, avowed white nationalists, and scholars who study the interplay of race and rhetoric  —   suggest that the passions aroused and channeled by Mr. Trump take many forms, from earnest if muddled rebellion to deeper and more elaborate bigotry. On campuses clenched by unforgiving debates over language and inclusion, some students embrace Mr. Trump as a way of rebelling against the intricate rules surrounding privilege and microaggression, and provoking the keepers of those rules. Among older whites unsettled by new   neighbors, or suspicious of the faith claimed by their country’s most bitter enemies, his name is a call to arms. On the internet, Mr. Trump is invoked by anonymous followers brandishing stark expressions of hate and   surprisingly amplified this month when Mr. Trump tweeted a graphic depicting Hillary Clinton’s face with piles of cash and a   star that many viewed as a Star of David. “I think what we really find troubling is the mainstreaming of these really offensive ideas,” said Jonathan Greenblatt, the national director of the   League, which tracks hate groups. “It’s allowed some of the worst ideas into the public conversation in ways we haven’t seen anything like in recent memory. ” Mr. Trump declined to be interviewed for this article, and his spokesman declined to comment. Outside a former aircraft factory in Bethpage, N. Y. not far from a strip of halal butchers and Indian restaurants now known as Little India, a Long Island housewife who gave her name as Kathy Reb finished a cigarette on a spring evening. Nervously, she explained how she had watched the complexion of her suburb outside New York City change. “Everyone’s sticking together in their groups,” she said, “so white people have to, too. ” The resentment among whites feels both old and distinctly of this moment. It is shaped by the reality of demographic change, by a decade and a half of war in the Middle East, and by unease with the newly confident and confrontational activism of young blacks furious over police violence. It is mingled with patriotism, pride, fear and a sense that an America without them at its center is not really America anymore. In the months since Mr. Trump began his campaign, the percentage of Americans who say race relations are worsening has increased, reaching nearly half in an April poll by CBS News. The sharpest rise was among Republicans: Sixty percent said race relations were getting worse. And Mr. Trump’s rise is shifting the country’s racial discourse just as the millennial generation comes fully of age, more and more distant from the horrors of the Holocaust, or the   racism of Jim Crow. Some are elated by the turn. In making the explicit assertion of white identity and grievance more widespread, Mr. Trump has galvanized the otherwise marginal world of avowed white nationalists and   “race realists. ” They hail him as a fellow traveler who has driven millions of white Americans toward an intuitive embrace of their ideals: that race should matter as much to white people as it does to everyone else. He has freed Americans, those activists say, to say what they really believe. “The discussion that white Americans never want to have is this question of identity  —   who are we?” said Richard Spencer, 38, a writer and an activist whose   nonprofit is dedicated to “the heritage, identity and future of people of European descent” in the United States. “He is bringing identity politics for white people into the public sphere in a way no one has. ” Another Republican once sounded alarms about globalization, unchecked immigration and the looming obsolescence of   culture. But in two bids for the Republican nomination, that candidate, Patrick J. Buchanan, won a total of four states. Mr. Trump won 37. Mr. Buchanan’s 1992 and 1996 campaigns were dismissed as a political and intellectual dead end for Republicans. “I said, ‘Look, we’re the white party,’” Mr. Buchanan said in an interview from his Virginia home, recalling his attacks on multiculturalism and   immigration. “‘If this continues, we’re going the way of the Whigs.’ Everyone said, ‘That’s a terrible thing to say. ’” Mr. Buchanan was campaigning against a backdrop of overwhelming white political and cultural dominance in America. But in the years that followed, the number of immigrants living in the United States illegally would double and then triple, before leveling off under the Obama administration around 11 million. Deindustrialization, driven in part by global trade, would devastate the economic fortunes of white men accustomed to making a decent living without a college degree. Demographers began to speak of a    future when   whites would be a minority of the American population. In states like Texas and California, and in hundreds of cities and counties around the country, that future has arrived. “It is the changes that are taking place that have created the national constituency for Donald Trump,” Mr. Buchanan said. For many Americans, President Obama’s election, made possible in part by the rising strength of nonwhite voters, signaled a transcendent moment in the country’s knotty racial history. But for some whites, the election of the country’s first black president was also a powerful symbol of their declining   in American society. Work by Michael I. Norton, a professor at Harvard Business School, suggests that whites have come to see   bias as more prevalent than   bias, and that they think further black progress is coming at their expense. On talk radio and Fox News, complaints about bigotry are routinely dismissed as a mere hustle  —   blacks “playing the race card” or being racist themselves. And during Mr. Obama’s presidency, whites have increasingly seen his policies as freighted with preference toward blacks, according to data collected by Michael Tesler, a political scientist at the University of California, Irvine. Mr. Tesler used polling questions about the causes and depth of racial inequality  —   such as whether blacks suffer greater poverty because of discrimination or lack of effort  —   to classify people as either “racial conservatives” or “racial liberals. ” During Mr. Obama’s two terms, Mr. Tesler found, racial liberals accelerated their migration to the Democratic Party. As the 2016 campaign began, the Republican Party was not just the party of most white voters. It was also, to use Mr. Tesler’s phrase, the party of racial conservatism. Few politicians were better prepared than Mr. Trump to harness these shifts. While open racism against blacks remains among the most powerful taboos in American politics, Americans feel more free expressing worries about illegal immigrants and dislike of Islam, survey research shows. In Mr. Trump’s hands, the two ideas merged: During Mr. Obama’s presidency, he has become America’s most prominent “birther,” loudly questioning Mr. Obama’s American citizenship and suggesting he could be Muslim. When Mr. Obama ran for   few Americans said they disapproved of him because of his race. But they were comfortable citing his supposed religion. In 2012, according to surveys conducted for the Cooperative Congressional Election Study, a majority of Mitt Romney’s voters said Mr. Obama’s religion made them less likely to vote for him. Almost all of these voters believed he was not Christian, an opinion that closely correlated with conservative racial attitudes found in Mr. Tesler’s research. Mr. Trump “is speaking an   message  —   that Obama’s foreign, which is mixed in with being black, and perceptions that he is Muslim,” Mr. Tesler said. “It is a catchall for expressing ethnocentric opposition to Obama, without saying you’re against him because he’s black. ” In June 2015, two weeks after Mr. Trump entered the presidential race, he received an endorsement that would end most campaigns: The Daily Stormer embraced his candidacy. Founded in 2013 by a   named Andrew Anglin, The Daily Stormer is among the most prominent online gathering places for white nationalists and   with sections devoted to “The Jewish Problem” and “Race War. ” Mr. Anglin, 31, explained that although he had some disagreements with him, Mr. Trump was the only candidate willing to speak the truth about Mexicans. “Trump is willing to say what most Americans think: It’s time to deport these people,” Mr. Anglin wrote. “He is also willing to call them out as criminal rapists, murderers and drug dealers. ” Mr. Trump’s campaign electrified the world of white nationalists. They had long been absent from mainstream politics, taking refuge at obscure conferences and in largely anonymous havens online. Most believed that the Republican Party had been subverted and captured by liberal racial dictums. Many in this new generation of nationalists shun the trappings of   white supremacy, appropriating the language of multiculturalism to recast themselves as white analogues to La Raza and other civil rights organizations. They call themselves “race realists” or “identitarians”  —   conservatives for whom racial heritage is more important than ideology. But across this spectrum, in Mr. Trump’s descriptions of immigrants as vectors of disease, violent crime and social decay, they heard their own dialect. Mr. Spencer, a popular figure in the white nationalist world, said he did not believe that Mr. Trump subscribed to his entire worldview. But he was struck that Mr. Trump seemed to understand and echo many of his group’s ideas intuitively, and take them to a broader audience. “I don’t think he has thought through this issue in a way that I and a number of people have,” Mr. Spencer said. “I think he is reacting to the feeling that he has lost his country. ” This year, for the first time in decades, overt white nationalism   national politics. In Iowa, a new “super PAC” paid for   robocalls featuring Jared Taylor, a   race realist, and William Johnson, a white nationalist and the chairman of the American Freedom Party. (“We don’t need Muslims,” Mr. Taylor urged recipients of the calls. “We need smart,   white people who will assimilate to our culture. Vote Trump. ”) David Duke, the Louisiana lawmaker turned   radio host, encouraged listeners to vote for Mr. Trump. Modern political convention dictates that candidates receiving such embraces instantly and publicly spurn them. In 2008, when it was revealed that a minister who endorsed the Republican nominee, Senator John McCain, had made   and   remarks, Mr. McCain forcefully repudiated them. Mr. Trump did something different. Asked about the robocall, Mr. Trump seemed to sympathize with its message while affecting a vague  . “Nothing in this country shocks me I would disavow it, but nothing in this country shocks me,” Mr. Trump told a CNN anchor. “People are angry. ” Pressed, Mr. Trump grew irritable, saying: “How many times you want me to say it? I said, ‘I disavow. ’” Asked six weeks later about Mr. Duke’s support, he said he had been unaware of it: “David Duke endorsed me? O. K. All right. I disavow, O. K.?” Later, on Twitter, he repeated the phrase: “I disavow. ” Mr. Trump has often used those words when confronted by reporters. The phrase is comfortingly nonspecific, a disavowal of everything and nothing. And whatever Mr. Trump’s intentions, it has been powerfully reassuring to people on the far right. “There’s no direct object there,” Mr. Spencer said. “It’s kind of interesting, isn’t it?” Mr. Trump’s new supporters took his approach as a signal of support. In an interview on a “ ” radio show called “The Political Cesspool,” Mr. Johnson, of the American Freedom Party, praised Mr. Trump’s handling of the controversy. “He disavowed us,” Mr. Johnson acknowledged, “but he explained why there is so much anger in America that I couldn’t have asked for a better approach from him. ” Mr. Taylor, who has written that blacks “left entirely to their own devices” are incapable of civilization, and whose magazine, American Renaissance, once published an essay arguing that blacks were genetically more prone to crime, wrote on his blog that Mr. Trump had handled the attacks on him “in the nicest way. ” Like others in his world, Mr. Taylor does not know if Mr. Trump agrees with him on everything. In an interview, he suggested that it did not really matter, and that Mr. Trump was expressing the discomfort many white people felt about other races. “Ordinary white people don’t want the neighborhood to turn Mexican,” Mr. Taylor said, adding, “They just realize that large numbers of Mexicans will change the neighborhood in ways they don’t like. ” At a Trump rally last month in Richmond, Va. as at most Trump rallies, the audience was mostly white men. They strolled by police barricades in work boots or pressed khakis, grinning at a ragtag assortment of protesters nearby. In interviews, they complained about the Mexican flags brandished outside Trump events and wondered why the government was paying to fix up Section 8 houses for people with   iPhones. They recounted Hispanic   mocking them. “They’ll tell you straight to your face, ‘This is our country now  —   no more gringos! ’” said Nick Conrad, a sheet metal worker who wore a “Hillary Clinton for Prison”   and wraparound sunglasses. “They’re not in it for our culture. They’re not here to assimilate. ” Mr. Conrad shrugged. “He says what everyone thinks,” Mr. Conrad said of Mr. Trump. “He says what we’re all thinking. He’s bringing people together. We say, ‘Hey, that’s right we can say this. ’” Mr. Trump dismisses those who accuse him of embracing or enabling racism. “I’m the least racist person,” he declared in December in an interview with CNN. But on the flatlands of social media, the border between Mr. Trump and white supremacists easily blurs. He has retweeted supportive messages from racist or nationalist Twitter accounts to his nine million followers. Last fall, he retweeted a graphic with fictitious crime statistics claiming that 81 percent of white homicide victims in 2015 were killed by blacks. (No such statistic was available for 2015 at the time the actual figure for 2014 was 15 percent, according to the F. B. I.) In January and February he retweeted messages from a user with the handle @WhiteGenocideTM, whose profile picture is of George Lincoln Rockwell, the founder of the American Nazi Party. A couple of days later, in quick succession, he retweeted two more accounts featuring white nationalist or Nazi themes. Mr. Trump deleted one of the retweets, but white supremacists saw more than a twitch of the thumb. “Our Glorious Leader and ULTIMATE SAVIOR has gone full    to his most aggressive supporters,” Mr. Anglin wrote on The Daily Stormer. In fact, Mr. Trump’s Twitter presence is tightly interwoven with hordes of mostly anonymous accounts trafficking in racist and   attacks. When Little Bird, a social media data mining company, analyzed a week of Mr. Trump’s Twitter activity, it found that almost 30 percent of the accounts Mr. Trump retweeted in turn followed one or more of 50 popular   white nationalist accounts. At times, a circular current seems to flow between white nationalists and Mr. Trump on Twitter. Criticized for his recent message about Mrs. Clinton, Mr. Trump insisted that no allusion to Jews was intended and denounced reporters for drawing the connection. Mr. Trump’s social media director said in a statement that he had “lifted” the image from an   Twitter feed where “countless images appear. ” Among them, it turned out, was a series of photos of Mrs. Clinton’s head arranged in the shape of a swastika. The original image was later traced by Mic, an online magazine aimed at younger readers, to the politics section of 8chan, a message board ridden with   memes and racist images. There and on other message boards, such as 4chan and Reddit, Mr. Trump’s attacks on political correctness and illegal immigration resonate with a broader audience. Some claim membership in the “” a loose and contested term that can encompass white nationalists,   conservatives and anonymous trolls whose taunts are laced with GIFs and obscure internet slang. After Mr. Trump attacked a profile of his wife, Melania, in GQ, the article’s author, the journalist Julia Ioffe, who is Jewish, was inundated with   abuse on social media, including a cartoon depicting Ms. Ioffe in a concentration camp. Asked whether he condemned the attacks, Mr. Trump told an interviewer: “I don’t have a message to the fans. A woman wrote an article that’s inaccurate. ” Mr. Trump’s influence is playing out perhaps most vividly on college campuses, an otherwise deeply liberal redoubt where young people grapple openly and frenetically with their own race and identity. For a generation weaned on a diet of civic multiculturalism, supporting Mr. Trump breaks the ultimate taboo. Students writing Mr. Trump’s name and slogans in chalk have been accused of hate crimes and spurred calls for censorship. And on campuses frozen by unyielding political correctness and expanding definitions of impermissible speech, some welcome the provocation that Mr. Trump provides. Three days after a gunman claiming allegiance to the Islamic State killed 49 people in a gay club in Orlando, Fla. a crowd of college students gathered two blocks from the site of the massacre. They wore Trump hats or   and chanted, “Build that wall. ” They cracked jokes about trigger warnings or whether the sidewalk counted as a safe space. A few minutes later, a black S. U. V. pulled up, delivering Milo Yiannopoulos, a   gay conservative raised in London and now a minor celebrity among the  . Since 2014, Mr. Yiannopoulos has toured college campuses in the United States and England, staging a performance that is equal parts spectacle and stump speech. Mr. Yiannopoulos dismisses statistics on campus rape as an official fiction and favors the slogan “Feminism is a cancer. ” His barbs are directed chiefly at liberals, feminists and Black Lives Matter activists, all of whom routinely show up to protest or disrupt his speeches. His followers film these confrontations and share them enthusiastically on YouTube and Facebook. In one video, Mr. Yiannopoulos arrives at a speech on a sedan chair carried by several young men wearing Trump hats. “I knew I could have fun on campuses because they are so uptight and they are so ruled by the people I don’t like,” said Mr. Yiannopoulos, who considers himself a “  fundamentalist. ” He added, “Less cynically, they’re an important battleground. ” Shortly after the shooting, Mr. Yiannopoulos announced plans to speak at the University of Central Florida in Orlando. The university canceled his appearance, first citing a shortage of security personnel and then claiming that no suitable space was available on the   campus. Instead, Mr. Yiannopoulos spoke near the nightclub. He stood just feet from the network television encampments, though none had sent cameras or reporters to cover him. Wearing a dark pinstriped suit under the unrelenting Florida sun, he warned of a gathering menace from Muslim immigrants, sprinkling his speech with anecdotes about sexual assaults in Germany and   swimming pools. In Mr. Yiannopoulos’s telling, liberals were dupes and hypocrites, so blinded by glib multiculturalism that they could not even admit how dangerous Islam was to gay people, like the victims of the Orlando massacre. To cheers and whoops, he praised Mr. Trump’s plan to bar Muslims from entering the country. Afterward, fans lined up to get his autograph. Most seemed to be Trump supporters, but not all were conservative. Several described themselves as socially liberal or libertarian. A few said they just wanted to hear what Mr. Yiannopoulos had to say. “The setup of U. C. F. has very few places where people are allowed to speak,” said Allen Greathouse, a slender    from Melbourne, Fla. “You can only speak in the   zones. ” Another student, Simon Dickerman, said he was voting for Mr. Trump. He volunteered that he frequently visited 4chan, an online message board where users compete with one another to post ever more provocative content, from Nazi shorthand to racist cartoons. Mr. Dickerman said he understood why such images bothered some older people, though they carried little such charge to him and his friends. “Of course they don’t actually want Jews to die,” Mr. Dickerman said. “They want to shock. ” His peers, he added, “are kids who don’t really know about the Holocaust. ” “And they don’t care about history,” he said. “And some of them think it’s funny. ”'"}, "time": 1742562091.0732396}