{"duration": 0.12817811965942383, "input_args": {"text": "'Call for Action to Tackle Growing Ethnic Segregation Across UK Anushka Asthana and Nazia Parveen, Guardian, November 1, 2016 \\nPoliticians must urgently tackle the increasing ethnic polarisation of many of Britain’s towns and cities, according to a senior academic, as he revealed figures showing how rapidly the white British population had dwindled in urban “pockets” across England. \\nProf Ted Cantle, who first authored a report into community cohesion after a series of race riots in 2001, said his new study showed that in the most extreme cases the white British population had more than halved in two decades. \\nCantle, who co-authored the report with Prof Eric Kaufmann at Birkbeck, University of London, told the Guardian that white British families should be encouraged to remain in ethnically diverse areas to reduce the trend. \\nHe warned that segregated societies “breed intolerance and prejudice”, adding: “And we know the opposite is true–there is a huge amount of research that shows any form of contact does break down stereotypes.” \\nThe leading academic said he would not describe the trend as white flight because that indicated that people were moving because of ethnic mixing, while this research only established the facts and not necessarily the causes. \\n“White people are leaving urban areas in a disproportionate number–and they avoid moving to diverse areas when they do move. But we can’t say that is white flight because the motivations are many and various,” he said, arguing it could be to do with the dream of a place in the country or an older cohort retiring to rural communities. \\nBut he said interviews he had carried out in recent years as part of the study had highlighted a sense among some white British people that an area they had lived in was “no longer for them”. \\nIn one case a community cohesion officer in Yorkshire told Cantle he was the first Asian to move into a particular street and that within three years virtually every white British family had gone. “Some of those families made no bones about it, they said they are moving out because ‘they’ are moving in,” he said. \\nThe research looked at two existing studies and drew from census data from 1991, 2001 and 2011–examining the figures in a way that has not been done before. \\nThe report authors stressed that the findings were nuanced, with more diversity in some areas, and different ethnic groups mixing together. \\nHowever, when looking at the white British population compared with all other ethnicities together it found increasing polarisation, with the steepest decline in the white population in “urban pockets” where the numbers were already well below the national average. \\nSome of the largest declines were in Slough, where the white population fell from 58.3% to 34.5%, in Birmingham, where it went from 65.6% to 53.1% and in Leicester, where it decreased from 60.5% to 45.1%. \\nIn one London borough, Newham, the figure was just 16.7% in the latest data set. \\nBut the study found even more marked changes when it examined the figures at ward level. In one part of the Blackburn and Darwen authority area 7.8% of the population was white British, down from 42.3% in 1991. \\nSmaller council areas in Birmingham saw similar declines, from 40.4% to 11.2% in Small Heath and from 30.7% to 7.2% in Handsworth. The trend was repeated in parts of Bradford, Luton and across London boroughs. \\nGreen St East in Newham had a white British population of 31.6% in 1991. Twenty years later is had declined to just 4.8%. While Southall Green, in Ealing, went from 18.9% to 4.6% in the same period. \\nMeanwhile, there were only tiny changes in ethnic diversity in the most predominantly white areas, such as Barrow-in-Furness, mid-Devon, Bassetlaw and Mid Sussex. \\n“The focus of policy needs to shift; this is not just about minorities,” said Cantle. “Politicians and policymakers need to encourage white British residents to remain in diverse areas; to choose, rather than avoid, diverse areas when they do relocate, encouraging similar choices with respect to placing pupils in diverse schools; in other words to create a positive choice for mixed areas and a shared society.” \\nCantle called for “salesmanship” of the positive benefits of mixed areas, including the cultural choices, and activities. We’ve never sold the idea that mixed communities are more exciting places with more going on,” he said, adding that after the Brexit vote there had been a bit of move in the opposite directions with the immediate surge in hate crime. \\nBut he also argued that some negative practices ought to be stamped out–including businesses recruiting workers from single, eastern European countries. \\nThe publication of the report triggered an immediate debate with experts claiming that the diversity in areas with fewer white British families meant segregation was the wrong description. “It is simply wrong to suggest that inner cities have become more ‘ethnically segregated’. In fact, people are more likely to live near those of a different ethnicity than ever before. What is undoubtedly true is that more needs to be done to promote integration–and not just in the most diverse areas,” said the economist, Jonathan Portes. \\nHowever, Cantle’s report argues that polarisation between the white British majority and other ethnic groups is a significant fact that requires urgent action. \\nCantle’s research comes after the government was accused of sitting on a major study into community cohesion by Dame Louise Casey. The study is thought to include some uncomfortable findings. \\nCasey, whose report has been finalised, will warn that successive governments have failed to do enough to tackle the difficult issues raised by Cantle 15 years ago. \\nShe is expected to suggest that faith schools should make their pupils mix with children of other religions, in a report that she has promised will be “making the difficult choices and telling the truth”. \\nIt is not clear why her review has not yet been published although sources have pointed out that much has changed since she was first appointed by the then prime minister, David Cameron, including the EU referendum result and a new government. The government insists the review will be out by the end of the year. \\nChuka Umunna MP, chair of the all-party parliamentary group on social integration, said the report from Cantle and Kauffman laid “bare the striking pace of change in some of our communities”. \\nIn a foreward to the study, he argued there were consequences for policymakers. “It is clear we cannot carry on with a laissez-faire approach to integration in our country. Integration is a two-way street and all parts of society have a role to play in preventing the UK becoming more fragmented. \\n“If we fail to do so, we risk sleepwalking into a situation where the divisions exposed during the EU referendum campaign become deeper as we grapple with the challenges thrown up by globalisation.”'"}, "time": 1742561975.3770926}