{"duration": 0.12910962104797363, "input_args": {"text": "'Videos US Admits Use of Depleted Uranium in Syria Between the strikes on the two dates, 5,100 rounds of 30mm DU ammunition were used by A-10 Thunderbolt II aircraft. This equates to 1,524kg of DU. CENTCOM said that the ammunition was selected because of the “nature of the targets”. | November 2, 2016 Be Sociable, Share! Secretary of State John Kerry is threatening to cut off all contacts with Moscow over Syria, unless Russian and Syrian government attacks on Aleppo end. The State Department says Kerry issued the ultimatum in a Wednesday, Sept. 28, 2016, telephone call to Russian Foreign Minister Sergey Lavrov. ( ) – The US has finally confirmed that it has fired DU ammunition Syria, after it had earlier stated that the weapons would not be used. US Central Command (CENTCOM) has acknowledged that DU was fired on two dates – the 18 and 23 November 2015. Between the strikes on the two dates, 5,100 rounds of 30mm DU ammunition were used by A-10 Thunderbolt II aircraft. This equates to 1,524kg of DU. CENTCOM said that the ammunition was selected because of the “nature of the targets”. The news comes as governments are debating a UN General Assembly resolution on DU weapons in New York. And, although DU use has only been admitted on two dates, ICBUW and PAX are concerned that this disclosure could be the sign that DU has, or will, be used more widely in the conflict. In March 2015, and following the deployment of A-10s to the conflict, the US had confirmed to journalists that the aircraft would not be armed with DU, stating: “U.S. and Coalition aircraft have not been and will not be using depleted uranium munitions in Iraq or Syria during Operation Inherent Resolve.” Justifying the decision, CENTCOM public affairs explained that: “The ammunition is developed to destroy tanks on a conventional battlefield; Daesh does not possess large numbers of tanks.” CENTCOM confirms DU use IRIN news finally extracted the confirmation that DU had been used from CENTCOM on October 20, and after weeks of denials. The revelations first came to light after an aide to Congresswoman Martha McSally (Rep, AZ) – herself a former A-10 combat pilot – responded to a question from DU activist, and constituent, Jack Cohen-Joppa. However a number of CENTCOM sources initially denied that the information was accurate. Confirming that the data were indeed accurate, a spokesperson for CENTCOM said earlier denials were due to “an error in reporting down range.” “Without the chance disclosure from McSally’s office, and the dogged pursuit of CENTCOM by IRIN, the US would not have volunteered this data,” said ICBUW Coordinator Doug Weir. “Sadly this is typical of the poor transparency we have seen from the US and we urge CENTCOM and the Coalition to clarify their policy on DU use in Syria and explain how its use fits with its public claims that the ammunition is solely for use against armoured targets. ” Unclear why DU was used The US regularly states that DU ammunition is specifically used only for engaging armoured targets, in accordance with its own legal guidelines, although evidence from a number of conflicts has shown that these guidelines are commonly ignored. ICBUW had earlier analysed the target information released by CENTCOM for the two dates in question. On neither date did CENTCOM explicitly state that it had launched attacks against armoured vehicles, with the majority of strikes against Islamic State light tactical vehicles, vehicle-borne improvised explosive devices and oil infrastructure. Such targets have been attacked regularly by the US-led Coalition, apparently without resorting to the use of DU. The most unusual strike that ICBUW identified took place on the 18 th November, when the US attacked 283 parked oil tankers , however the A-10’s alternative 30mm ammunition type – a high explosive incendiary round – would presumably have been sufficient to destroy tankers laden with oil. Footage released from the strike is indicative of 30mm DU use. Recently published data from the 2003 Iraq War showed that A-10s used more DU against targets that were not tanks or armoured vehicles, questioning the current US justification that DU was needed in Syria. Historic data from the Gulf War also demonstrated that most armoured targets destroyed by A-10s were targeted by Maverick missiles, not DU. What must happen now ICBUW and PAX are calling for urgent clarification from the US authorities on both the incidents and its DU policy for the conflict, and for them to swiftly release detailed and accurate targeting data to ensure that the relevant authorities can conduct clearance and risk awareness efforts and isolate and recover contaminated material. “Given DU’s nature as a toxic and radioactive heavy metal, and concerns previously expressed by Syrian civilians that it might be used, it’s deeply worrying that the US chose to use DU again,” said PAX’s researcher Wim Zwijnenburg. “The US should provide all target data and technical assistance to mine-clearance organisations and local authorities to ensure that swift clean-up operations for this low-level radioactive waste is undertaken to prevent Syrian civilians being exposed.” “Public relations efforts are indicated” The US has long been conscious of the stigmatisation of the use of DU weapons. As far back as 1991 the US military were advised that: “… fielding and combat activities [with DU] present the potential for adverse international reaction .” It was therefore predictable that Russian state media quickly highlighted news that DU had been used in Syria, with Russia’s embassies in Paris, Ottawa and London tweeting the news, as Russia sought to draw attention away from its own conduct in the conflict. Russia has its own stocks of DU weapons and consistently abstains on DU resolutions at the UN General Assembly. It seems inevitable that, given the widespread global opposition to the use of the weapons, the Russian and Syrian governments will continue to use the news that DU has been used against the US and its coalition allies. This report prepared by ICBUW Be Sociable, Share!'"}, "time": 1742561983.840834}