{"duration": 0.06973910331726074, "input_args": {"text": "'Posted on October 28, 2016 by Baxter Dmitry in News , US // 0 Comments \\nWhistleblower Edward Snowden warned reporters that in this era of mass surveillance and mainstream media collusion with the state, journalists are an endangered species facing extinction. \\n“ Journalists are increasingly a threatened class when we think about the right to privacy, ” Snowden said. “ Yes, I can give you tips on how to protect your communications, but you are going to be engaging in an arms race that you simply cannot win .” \\nSnowden, speaking via video feed at a German conference, urged journalists to be brave and fight the system by exposing privacy violations and government intrusions to the masses. \\n“You must fight this on the front pages and you must win, if you want to be able to report in the same way that you’ve been able to do in the previous centuries.” \\nSnowden went on to bemoan the fact mainstream media is not taking the government to task and provoking public debate about short-sighted and secret government policy. \\n“ Policy is only short-sighted here because it is not being publicly debated. It is not being openly scrutinized outside of this audience of a few special interests .” \\nBy failing to live up to their duties in a functioning democracy, the mainstream media have played their part in granting the government a previously unthinkable amount of power. The Clinton presidential campaign is a case in point. Unencumbered by the law and unscrutinized by the media, Clinton as president will wield a dictator’s authority. \\nSnowden believes journalists simply must resume criticizing the powers that be, and provoking public debate – and the topic of spying and hacking should be top of the agenda. \\n“ We have technologies that can protect communications in an unbreakable format when they’re in transit. Governments have reacted to this as if we’ve thrown them in a pool of acid, saying you know, “you’re shutting us out, you’re going dark.” This is false. \\nAny government official who claims we’re going dark is lying. We know this because we have classified documents from inside governments and we have reportage from journalists who have been in private sessions with these officials. Things are pretty bad for our side. For the government’s side, it’s never been easier. How do we reconcile this with this idea that these are theoretically, as far as our understanding of mathematics goes, unbreakable communications? \\nIt’s because what we’re doing is we’re thwarting mass surveillance when we use encryption. We’re not stopping targeted surveillance. Because even, again, if you have the most well-encrypted device in the world, if the government spends a million dollars to pay a hacker to exploit your phone personally, they will very likely succeed. \\nIn our current state of the art, offense is easier than defense. This is an unfortunate artifact of the fact that governments around the world have prioritized offensive capabilities for the benefit of spying on people so much more strongly than they have defensive capabilities, preventing our countries from being hacked. And this is what’s leading to the kind of dynamics we see today. \\nWhether it’s the Office of Personnel Management; whether it’s this recent Democratic National Committee hack; whether it’s all of these other things about infrastructural attacks; fear of the power grid being attacked—these were preventable problems. \\nBut unfortunately we don’t have this pressure—that should be simply blistering—coming from newspapers, going, “We are the most advanced societies in the world, we are the most connected societies in the world, and in some sort of computer-based conflict. We have more to lose.” \\nWe can hack Russia ten times; it will cause less damage to them than one hack to us will cause. We can hack North Korea 1,000 times, and they will suffer less damage than if they hacked us a single time. This is not a game that we want to get into, so why are we doing so? It’s because policy is short-sighted.” \\nThe whole interview is available here:'"}, "time": 1742564099.9103084}