{"duration": 0.1002657413482666, "input_args": {"text": "'Home | Win | Forget Your Encyclopaedia Get the Pokiespedia Forget Your Encyclopaedia Get the Pokiespedia By Don Partridge 09/11/2016 10:27:21 \\nSYDNEY – Australia – What the hell are Pokies? Well, they’re something the antipodean folks down under like to call the slots. \\n\\n\\n\\nIf you’re ever in Australia and you wander into a watering hole somewhere in the Outback or in a city, you’ll chance upon a pokie, and that’s when the fun starts. You feed your money into that machine whilst you’re plastered out of your skull on Aussie nectar, and you wake up the next day, not only with a raging headache, but a bucket full of cash, or if you’re an unlucky bugger, nothing. \\nBut you don’t have to be in the land of Oz to play the pokies, you can be anywhere when you play them online. \\nSo what sort of games can you encounter playing the pokies? \\nDifferent types, all sorts, and the good ol’ classics. \\nClassic – Classic slots are great if you can still find ’em. They only have one payline, although the classic games you find these days may not be limited to only one line. \\nMultiple Payline – Multiple payline games are all over the place and you can find games from 3 to 50 paylines. By activating more paylines with more coins you bet the more opportunities you will have for creating a winning combination and hitting the payload. \\nFeature – Features pokies come with special symbols that increase your chances. Features include wild symbols, scatter symbols, multipliers and jackpot symbols. Racking up a load of symbols in certain combinations can get you some serious wonga. \\nBonus – Bonus slots are a real find, because it’s like a game within a game. You may be chugging along, and hit a bonus, then you win more cash, and you continue the game and win even more cash. What’s not to like in a Bonus pokie? \\nProgressive – Progressive slots, no we’re not talking about socialists, they are in fact a popular category of online casino games. As the name suggests the more you progress into the game the more your jackpot grows. The progression index can be activated by any number of factors, but getting a payout from these machines is a real bonus as your jackpot can be huge, monstrous, enormous! \\nUnique – You have a favourite film character, film or theme? There’s probably a pokie for that. These pokies are branded to specific films or brands, and all have unique features to their game play. Best way to find out what they do is play them. \\nRules of the Game \\nFirst things first, there are no specific rules, play for free online, but most of all play for fun. Go to www.pokiespedia.com to get a feel for which games you like and then keep on playing. \\nIt’s a simple way of making some good money, choose the size of your bet, press the button and you’re away on a roll. As outlined above, there are many different types of pokies, and it’s up to your preference which ones you think is the best. \\nPlaying online is also a discreet way of playing the pokies, you could be in your pyjamas or lying on a deck chair on the beach, it’s a fantastic way of dealing out some chance. You could even be pretending to talk to your wife whilst having fun on the pokies, and if she gets angry that you’re not listening to her, just nod your head in agreement, or better still, get her to join in. \\nThere’s nothing like feeling really alive, the thrill of playing the pokies, yes, it’s a game of chance, but there is skill there too, and you can literally play it anywhere. \\nGo on..'"}, "time": 1742563677.342278}