{"duration": 0.023158550262451172, "input_args": {"text": "'BERLIN  —   Chancellor Angela Merkel’s party suffered the latest in a string of defeats in German state elections on Sunday, when her Christian Democratic Union was ousted from power in Berlin after its worst showing in the capital since World War II, according to preliminary results. Voters in Berlin turned out in higher numbers than in previous years, many responding to voter mobilization calls from the   Alternative for Germany party. The party is now poised to enter the  ’s legislature for the first time, although its share of the vote, 14. 2 percent in the preliminary results, was less than what it was two weeks ago in Ms. Merkel’s home state,   where it placed second. Ms. Merkel’s party won 17. 6 percent of the vote in Berlin, not enough to allow it to continue as the junior partner in a governing coalition with the Social Democrats. The   Social Democratic Party earned 21. 6 percent of the vote and is expected to form a government with two other parties: the Left Party, with 15. 6 percent, and the Greens, with 15. 2. “We are all angry that the AfD got in,” Michael Müller, Berlin’s mayor and the Social Democrats’ leading candidate, told cheering supporters in the capital, referring to the Alternative for Germany party. “But I can assure you that Berlin will remain an international city, open to the world. ” The result proved that the Alternative for Germany party is not as popular in Berlin as it is elsewhere, but it managed to draw considerable support, mostly from the city’s eastern districts. It campaigned hard against the chancellor’s decision last year to allow more than one million migrants into the country. Berlin is the 10th state in which the party has earned representation, and with little more than a year to go before the 2017 general election, the party appears to be gaining enough strength to earn seats in the national Parliament. Some commentators viewed the result as a chance for a rebirth of Germany’s struggling traditional parties and its overall democracy. “The success of the Alternative for Germany is a   call that it can’t be taken for granted that society is liberal and will remain so,” Heribert Prantl, a journalist at the newspaper Süddeutsche Zeitung, wrote in a commentary. “Nor can it be taken for granted that minorities (and not only the refugees) are and will be respected. ” Many former supporters of the chancellor’s party drifted to the liberal Free Democratic Party, which voters returned to the state legislature with about 6 percent of the vote after it was ousted in the 2011 election. But the upstart Pirate Party, which won seats in the state Parliament in 2011, was voted out. Ms. Merkel, who governs on the national level in a coalition with the Social Democrats, had blamed Mr. Müller, the   mayor, for refusing to be held accountable for the chaotic circumstances faced by the 79, 000 refugees who arrived last year in the capital. “Based on my own experience, I know that leaders of government are always responsible, and they will be made responsible,” the chancellor said in an interview with the Berlin newspaper Tagesspiegel before the vote. Yet many in Ms. Merkel’s own conservative bloc have criticized her for allowing the refugee influx to become a crisis. Horst Seehofer, the leader of a Bavarian sister party to Ms. Merkel’s conservatives, has been among her loudest critics. In an interview released Friday, Mr. Seehofer threatened to withhold his party’s support for her in the 2017 election unless she agreed to set a limit on the number of new refugees to be admitted. Frank Henkel, the leading candidate for Ms. Merkel’s party in Berlin, blamed squabbling for the party’s poor showing in Berlin, saying the infighting had alienated voters and led them to question the bloc’s ability to govern.'"}, "time": 1742628475.3875272}