{"duration": 0.03939175605773926, "input_args": {"text": "'Former London Mayor Ken Livingstone will know on Tuesday whether he still has a future in the UK Labour Party when a disciplinary hearing sparked by comments he made about Hitler resumes. [Mr. Livingstone has been giving evidence behind closed doors as he fights to stay a member of the party after his controversial claim that Adolf Hitler supported the creation of a Jewish state. The allegation was made in a radio interview last May when he said the Nazi leader had supported Zionism in the 1930s before he “went mad and ended up killing six million Jews. ” He was suspended immediately thereafter.  Mr. Livingstone also claimed there was a “  campaign by the Israel lobby to smear anybody who criticises Israeli policy as  ”. His case is being heard by Labour’s national constitution committee which will decide if he engaged in conduct which was “grossly detrimental” to the party. Before entering the tribunal on Friday, the veteran   expressed his hope that he would be allowed to remain in the Labour fold. “I’m always hopeful. It’s pretty fair. The injustice was actually suspending me for something I hadn’t said,” Mr. Livingstone said. “Have I said anything that wasn’t true? All the Jewish activists who spoke on my behalf yesterday, all actually confirmed what I said was true. “The big difference is that, though I said that Hitler supported Zionism, MPs like John Mann were immediately claiming that I said Hitler was a Zionist. “That was repeated on the Jewish Chronicle website with appalling other stories saying that I said Jews were like Nazis, none of this is true. “So, as long as the truth prevails, we will be OK. ” Afterwards Mr. Livingstone said he had been questioned for four hours. Asked if the case was “all about Palestine” he said: “No it’s about a smear against supporters of Jeremy Corbyn. If the charge is upheld, he could be expelled from the party.  '"}, "time": 1742563890.4030468}