{"duration": 0.06563687324523926, "input_args": {"text": "'Posted on November 2, 2016 by Dr. Eowyn | 1 Comment \\nBob Woodward, 73, is the Washington Post reporter who, with his colleague Carl Bernstein, broke the story of Nixon’s Watergate — a puny scandal compared to Hillary’s unsecured email and the Clinton Foundation. Woodward is now the associate editor of WaPo . \\nSpeaking to Fox News Sunday ‘s Chris Wallace on Oct. 23, 2016, Woodward called Hillary Clinton’s Clinton Foundation “corrupt”. \\nHere’s the transcript: \\nWALLACE: Then there are the allegations about the Clinton Foundation and pay to play, which I asked Secretary Clinton about in the debate, and she turned into an attack on the Trump Foundation. But, Bob, I want to go back to the conversation I was having with Robby Mook before. When — when you see what seems to be clear evidence that Clinton Foundation donors were being treated differently than non-donors in terms of access, when you see this new — new revelation about the $12 million deal between Hillary Clinton, the foundation, and the king of Morocco, are voters right to be troubled by this? \\nBOB WOODWARD: I — yes, it’s a — it’s corrupt . It’s — it’s a scandal . And she didn’t answer your question at all. And she turned to embrace the good work that the Clinton Foundation has done. And she has a case there. But the mixing of speech fees, the Clinton Foundation, and actions by the State Department, which she ran, are all intertwined and it’s corrupt. You know, I mean, you can’t just say it’s unsavory. But there’s no formal investigation going on now, and there are outs that they have. But the election isn’t going to be decided on that. \\nHowever, Woodward said he expects Hillary will win the election, but asked: \\n“I think the issue is what’s going to be the aftermath of this campaign: Can somebody govern?” \\nWriting on Nov. 1, 2016, Alt Media freelance journalist Jim Stone claims that Woodward had “suddenly vanished from the Washington Post , the phone operator says he’s no longer there and no one is giving details or even reporting in the MSM that he is gone.” \\nStone asks if Woodward “has been offed by the Clinton death machine”. \\nIndeed, Woodward’s last article for WaPo was published on April 5, 2016, eons ago in journalism time. Woodward’s personal website is also down. I tried it just a minute ago and got this message: Service Temporarily Unavailable \\nThe server is temporarily unable to service your request due to maintenance downtime or capacity problems. Please try again later. \\nWoodward’s Watergate co-investigator, Carl Bernstein, has also recently spoken out about Hillary’s corruption in the context of the FBI reopening its criminal investigation of Hillary’s emails. Bernstein said : \\n“Well, there’s no question that the e-mails have always been the greatest threat to her candidacy for president, that her conduct in regard to the e-mails is really indefensible and . . . the one thing . . . actually that could really perhaps affect this election. \\nWe don’t know what this means yet except that it’s a real bombshell. And it is unthinkable that the Director of the FBI would take this action lightly . . . unless it was something requiring serious investigation . . . . I want to add here that in the last, oh, 36, 48 hours, there has been an undercurrent of kind of speculative discussion among some national security people that something might surface in the next few days about e-mails. . . . [I]t’s very possible that some members of Congress very quickly are going to get an idea of what these e-mails are, and what this is all about, and for whatever purpose put some information out there.” \\nSo if the Clintons “offed” Bob Woodward for calling the Clinton Foundation “corrupt,” then Carl Bernstein would have to be offed as well. \\nSee also:'"}, "time": 1742561915.3398714}