{"duration": 0.13854026794433594, "input_args": {"text": "'Most politicians have a public record of speeches and votes on issues of the day, but Donald J. Trump, the Republican nominee for president, has left a different type of record: a   presence in TV shows, movies, documentaries, pageants and even professional wrestling events over 30 years. His first television appearance seems to have been an uncredited 1981 cameo on the sitcom “The Jeffersons. ” Since then, Mr. Trump has seized on opportunities to create a recurring character over three decades: a    New York billionaire named Donald Trump. His cameos have included numerous TV shows (“The Nanny,” “Fresh Prince of ” “Sex and the City”) and movies (“Home Alone 2,” “Zoolander” and Woody Allen’s “Celebrity. ”). Including his many interviews on   talk shows, appearances on beauty pageant and professional wrestling shows, and a recurring role on his reality program “The Apprentice,” his credits have numbered in the hundreds, according to the Internet Movie Database. His memorable cameos have been collected in at least one YouTube supercut. This public record has created problems for Trump the candidate. It was an appearance in 2005 on “Access Hollywood,” that caused serious damage to his campaign earlier this month.    audio leaked in which Mr. Trump used lewd and vulgar language to describe women and his behavior toward them, prompting a series of women to come forward and claim that he had groped them or otherwise behaved inappropriately. On talk shows, frequent discussions about the presidency Mr. Trump’s interest in the presidency has been threaded through his pop culture persona for decades. In 1988, as tabloids covered his tumultuous marriage to Ivana Trump, he began to discuss his presidential aspirations on the talk show circuit. When asked by Oprah Winfrey if he planned to run, Mr. Trump replied, “Probably not, but I do get tired of seeing the country ripped off. ” He added: “I think I’d win. I tell you what, I wouldn’t go in to lose. ” Shortly after the 1988 election, Mr. Trump told David Letterman that he was mulling a presidential run. “I’m not sure that you want to see the United States become a winner,” Mr. Trump told Mr. Letterman. This    continued for years. “Is it another phony campaign?” Mr. Letterman asked Mr. Trump in a “Late Show” segment last year, “or are you really running?” We all know how that turned out. In a recent interview with The Times, Mr. Letterman described their relationship as ultimately playful, but called Mr. Trump a “damaged person” because of his behavior on the campaign trail. On sitcoms and in movies, a symbol of wealth, ruthlessness and New York City  Mr. Trump has almost always played himself. He won a Razzie Award for his 1989 portrayal of “Donald Trump” in “Ghosts Don’t Do It,” a romantic comedy. Between 1989 and 2004, he showed up in at least 10 movies as himself  —   or some approximation. Whether he appeared as a V. I. P. at Studio 54 or a rascal’s dad in “Little Rascals,” his character played up ruthless behavior toward wealth, business practices and women. In one case, Mr. Trump had a direct hand in shaping his characters: Peter Marc Jacobson, a creator of the sitcom “The Nanny,” said that he had received a note from Mr. Trump’s representative that quibbled over a script’s reference to the real estate mogul’s wealth. The script called him a millionaire. “Since he’s a billionaire, he would like the line changed accordingly,” the note read. In the end, Mr. Jacobson changed the script to say “zillionaire. ” He also framed the note. “It’s so bizarre and so narcissistic that somebody would want something like that changed,” Mr. Jacobson said. “It’s a sitcom. You want to be humble about it. ” On reality TV, a stern mentor  In “The Apprentice” and “The Celebrity Apprentice,” competition reality shows that Mr. Trump hosted from 2004 through 2015, the businessman found a way to use business failures to his advantage, claiming they had made him the consummate businessman. “I fought back and I won,” Mr. Trump said. “Big league. ” Now was time to pass on that knowledge to somebody else, he said. “The Apprentice” billed itself as a show that collected contestants from all economic and educational backgrounds. The ultimate prize was a job close to Mr. Trump. But behind the scenes, more than 20 people who worked on the show said that Mr. Trump’s behavior was sexist and demeaning toward women, according to a report filed in October by The Associated Press. One former crew member said that Mr. Trump asked a group of male contestants if they’d sleep with one of their female competitors. That person, whom The Associated Press did not identify because of a nondisclosure agreement, added: “Everyone is trying to make him stop talking, and the woman is shrinking in her seat. ” On “Saturday Night Live,” a host  —   and a target  Mr. Trump hosted the comedy sketch show twice, once in 2014 and again last November, several months after he had announced his run for the presidency. “Whatever one can say about Donald Trump, he’s shrewd about the TV business,” James Poniewozik, a critic for The Times, wrote in his review of Mr. Trump’s 2015 hosting gig. “He knows what pressures producers work under, he knows what he can deliver in ratings and he knows the leverage that gives him. ” Lately, Mr. Trump has been the subject of overt mocking from the SNL crew, which has cast the actor Alec Baldwin to exaggerate Mr. Trump’s mannerisms and lampoon his recent statements about immigration, women and minorities. Mr. Trump did not appreciate the joke. “Watched Saturday Night Live hit job on me,” Mr. Trump tweeted on Oct. 16. “Time to retire the boring and unfunny show. Alec Baldwin portrayal stinks. Media rigging election!” On professional wrestling, a wealthy benefactor  Mr. Trump has made several appearances on World Wrestling Entertainment Inc. productions. In his role, he appeared as himself, styled as a beloved voice of the people who butted heads with Vince McMahon, W. W. E. ’s chief executive. In 2007 on “WrestleMania 23,” Mr. Trump tackled Mr. McMahon to the floor and shaved his head. “Donald Trump is in a world he is not familiar with,” a commentator says. “This is not real estate. ” Another time, Mr. Trump appeared as a moneyed benefactor, dropping what appeared to be $50 and $100 bills in a gesture of audience appreciation. “Right now I’m dropping buckets of cash,” Mr. Trump said. The audience went wild. When asked about the origins of Mr. Trump’s relationship with professional wrestling, the W. W. E. declined to comment. A divisive Hollywood star In recent years, Mr. Trump has become a polarizing presence in the entertainment industry. In 2007, in the midst of an ugly feud with Rosie O’Donnell and three years into firing people on “The Apprentice,” Mr. Trump was feted with a star on the Hollywood Walk of Fame. (The celebrity typically has to  raise around $30, 000 for a star and its maintenance.) But on Wednesday, Mr. Trump’s star, a site already vulnerable to vandals, was destroyed by a man with a hammer. His name had been chipped away.'"}, "time": 1742563584.2731597}