{"duration": 0.09851646423339844, "input_args": {"text": "'On the penultimate episode of this season’s “RuPaul’s Drag Race,” the last four contestants gathered backstage, waiting to find out who would be eliminated from the competition to be named “America’s Next Drag Superstar. ” As they sat in the “untuck” lounge, they made lighthearted small talk, trading compliments and   shade. The conversation turned, suddenly, to activism. Chi Chi DeVayne, a sweet Louisiana queen with a thick,   accent, praised Bob the Drag Queen, a gifted, tenderhearted New York comedian, on her work in support of marriage equality. “I wish that I had the guts to stand up for gay rights,” she said wistfully (the contestants often use male and female pronouns interchangeably). Bob smiled and replied, “Go do it, you can start anytime. ” Ms. DeVayne, dazzling in full makeup and a fuchsia ball gown, shook her head firmly. “You can’t do it in Shreveport,” she replied. “They’ll blow your head off. ” That exchange reflected the cultural significance of “Drag Race,” for this particular moment in time. Queer and gay culture has been so widely   and incorporated into mainstream popular culture that it can feel commonplace, embraced by default. On the surface, that feels like a positive thing  —   queer narratives, like those featured in “Carol,” “The Danish Girl,” “Modern Family” and “Transparent” go a long way toward humanizing difference. We may live in troubled times, but this visibility suggests people are finding their way. Yet, pop culture has barely started grappling with more complex and ugly contemporary narratives, ones that make clear that universal acceptance is still a fantasy  —   like North Carolina’s law limiting bathroom access to transgender people. This is what makes “Drag Race,” which airs its Season 8 finale on Monday night, so valuable. Bob and Ms. DeVayne are both 30, but they may as well be from parallel universes. They, like the show, remind viewers that these discrepancies, these gaping chasms exist. We live in a time of extreme dualities. In a recent interview with E. Alex Jung of New York magazine, RuPaul laid out the subversive function of his show. “They talk so much about acceptance now today and it’s like, yes, but trust me  —   I’m old,” he said, ”It’s superficial. ” “Things haven’t changed that much. You see it in politics right now,” he added. “And you know, people will have you think, ‘Oh, we’re fashion. We’re gay. That’s my gay over there!’ It’s like, no. We’re still a very, very, very primitive culture. ” Now, more than ever, we need axes of realness to anchor and make sense of this strange world we live in. “Drag Race” has always been a show that knows how to balances scripted moments and genuine interactions  —   by turning the shadiness and catty drama underlining the plot of almost every major reality show into a   theatrical performance, in which contestants earn points for the ability to mock one another. Drag lives to be weird, to mock conformity, and pokes hole in the artifice of normativity, exposing the notion of fixed identity and gender as an inherently flawed premise. “Drag Race,” which in every episode asks competitors to construct new identities and costumes, lives to point out that our meat suits can be altered, that anyone can paint and sew a new persona, that all appearances are illusions anyway. Last season, the show almost deflated that premise. Season 7 was dominated by two contestants, Violet Chachki and Pearl, who both shimmered on the surface, but didn’t seem to have much depth below, at least, none that they were willing to reveal. Phenomenally talented, and already Instagram famous before their first appearance on the show, they were willowy and   exceptionally gifted at pulling off classically “fishy” looks, which in drag slang means feminine to the point of passing. They won competition after competition, and praise from the judges. “Drag Race” no longer seemed to exist to expose the performance of hyperfemininity, it seemed to cultivate it. The preference for heteronormative standards of beauty was tremendously disappointing. But this season rebounded from that. One of the earliest and most severe eliminations was a pageant queen. And two of the season’s stronger contestants had male drag names. Weirdness reigned, through strong performances by Acid Betty, with her psychedelic palette, and the transformations of Thorgy Thor, a hippie with dreads and round glasses who invented a new character during every challenge. Kim Chi, one of the show’s first breakout   contestants, constructed some of the most sophisticated looks to grace RuPaul’s stage, a combination of flora and fauna and dessert pastry. Charming and chubby, with a lisp, his most revealing moment came when he tearfully revealed that he has hidden his exquisite talents at makeup and costume design from his own mother, for fear she will be repulsed by his love of drag. In another, he confessed that he was a virgin. Moments like that, both shocking and sad, affirmed the importance of “Drag Race,” the rare space on television that relishes honesty and exploration, that doesn’t subscribe to the notion that all is well now that we live in a    world. At its best, drag exposes the charade of modern life, the idea that there are set rules to follow, and even if there are, that you can win by following them. Personality, growth, the ability to evolve and, really, to survive, were the traits that the judges prioritized this season. But, you wonder, how can the show itself grow and evolve from here? At this point in its life cycle, RuPaul’s universe has expanded so much that a generation has been weaned on the show and its spinoffs, like “RuPaul Drag U. ” “Drag Race” is its own feedback loop, its own perpetual motion machine. It’s as mainstream as a show about drag can get. At the same time, “Drag Race” flourishes in cultlike purgatory. Even the show’s network, Logo TV, aimed at the lesbian, gay, bisexual and transgender audience, is squirreled away, available only to cable subscribers. Without streaming services like iTunes and Amazon Prime, “Drag Race” might not have the fandom and staying power that it currently does. That won’t matter much on Monday night, when the finale is aired. It’s not yet clear who will win. In the    episode, after the group trooped back out to hear the verdict, RuPaul informed Ms. DeVayne that she would not advance to the final round and win the $100, 000 or the title. She seemed unsurprised, and smiled. “You have taught me how to be a better person,” she said, about loving who she is and where she is from. “And $100, 000 can’t buy that. ” At that, Ms. DeVayne snapped her fingers so clear and loud it almost sounded like a bell, before sashaying away.'"}, "time": 1742628378.7867463}