{"duration": 0.0794363021850586, "input_args": {"text": "\"The propaganda popsicle stand that is The New York Times is floating the idea that Trump supporters are calling for a new American Revolution if Hillary wins. \\nBut beneath the cheering, a new emotion is taking hold among some Trump supporters as they grapple with reports predicting that he will lose the election: a dark fear about what will happen if their candidate is denied the White House. Some worry that they will be forgotten, along with their concerns and frustrations. Others believe the nation may be headed for violent conflict. \\nJared Halbrook, 25, of Green Bay, Wis., said that if Mr. Trump lost to Hillary Clinton, which he worried would happen through a stolen election, it could lead to “another Revolutionary War.” \\n“People are going to march on the capitols,” said Mr. Halbrook, who works at a call center. “They’re going to do whatever needs to be done to get her out of office, because she does not belong there.” \\n“If push comes to shove,” he added, and Mrs. Clinton “has to go by any means necessary, it will be done.” \\nWhat’s ominous about this level of programming is that we know the system is already gearing up for this possibility with an election military drill that could go live at any time until a month after the election, as previously reported: \\nAccording to an unnamed source – who has provided accurate intel in the past – an unannounced military drill is scheduled to take place during a period leading up to the election and throughout the month after. \\nIt appears that the system is gearing up to handle outbreaks of violence, chaotic rallies and poll stations, and the possibility that the people of the United States may become very dissatisfied with the outcome by using military force and martial law. \\nThe drill could, of course, go live at any time; Homeland Security and the military are prepared to contend with a period of unrest, and restore order to a divided and broken country – regardless of whether people like their new leader or not. \\nAs you know, DHS is already monitoring this election and prepared to take over its ‘critical infrastructure’. The scope of this drill would, of course, take things much further: \\nHi Guys, \\nI got some gouge from a former military colleague who is in contact with active duty personnel and he received an email about an upcoming drill. We need confirmation on this, but if we put it out there we might get a leaker to come forward and confirm: \\nDate: October 30th – 30 days after the election Suspected Region: Northeast, specifically New York \\n1st Phase: NROL (No Rule of Law) – drill involving combat arms in metro areas (active and reserve). Source says active duty and reserve service members are being vaccinated as if they are being deployed in theatre. \\n2nd Phase: LROL (Limited Rule of Law) – Military/FEMA consolidating resources, controlling water supply, handing out to public as needed. \\n3rd Phase: AROL (Authoritarian Rule of Law) – Possible new acronym or term for “Martial Law”. Curfew, restricted movements, basically martial law scenario. \\nSource said exercise involves FEMA/DHS/Military \\nIf the Powers That Shouldn’t Be are planning to steal this election for Hillary as hard as it appears they are , then it makes sense they’d be planning to try and clean up their mess afterward. \\nEither way, the people have about reached their limit and are sick and tired of this level of corruption coming out of this government… and we know what happened the last time America finally got fed up with a tyrannical government. Piper writes for The Daily Sheeple . There’s a lot of B.S. out there. Someone has to write about it. Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742561911.3091958}