{"duration": 0.05237269401550293, "input_args": {"text": "'American Thinker October 29, 2016 \\nTo believe recent mainstream media polling releases, one would have to suspend reality enough to believe that John Podesta’s email leaks, the ongoing Project Veritas video series, a world on fire, and new revelations about Obamacare are driving the public to embrace Hillary Clinton as never before. Things are apparently so good for the former first lady that ABC has her with a 12-point lead, a margin not seen in a presidential election since 1984. CNN is less confident but still has her sporting a comfortable 5-point lead. Fox News has wavered between “too close to call” and the current 3-point edge that is contingent on her achieving President Obama’s D+7 support level from 2008, which borders on complete insanity. \\nThe purpose of this article is to prove that the media is either lying to massively impact motivation or turnout for Trump or has absolutely no idea what the actual score is. The media don’t care if I know what they are doing with their nonstop analysis of new “chaos” within the Trump campaign. They are playing this sad song for the record number of independent voters who appear to be requesting ballots or voting early in battlegrounds across America. \\nThe first clue is that in the same week, ABC and CNN have polls showing a massive lead and a comfortable lead, respectively. These two polls are seven points apart. Obama’s landslide win from 2008 was by a margin of 7.6%, and he still lost 22 states. Still, the enthusiasm and novelty of his campaign, combined with the natural pendulum swing that takes place after eight years of either party in the White House, left little doubt that he would win easily. Currently, ABC and CNN have the distance of Obama’s landslide margin between their polls. \\nFor those keeping score at home, here is how these polls play out on a map: \\n5 points \\nObama won re-election in 2012 by 3.9%. The tightest red state was North Carolina, which Mitt Romney carried by 2.0%. In the event of a five-point Clinton win, I suspect that North Carolina would be the only possible state to flip, but it wouldn’t surprise me for the map to stay identical to 2012. In this scenario, as in 2012, Hillary is not competitive in Arizona, Georgia, or Texas, as the media indicates today. \\n12 points \\nThis map should show you that the media aren’t even trying to be objective anymore. The blue nightmare above sees the GOP holding a likely minimum of six states, and no more than 11. At a twelve-point margin, there are no swing states. None. Not even second-tier swing states like Missouri, Arizona, or Georgia. For the first time since 1996, the Democrats would have made inroads into the Deep South and would threaten some of the reddest states. \\nWhy is this important? The media are deliberately misleading the electorate and can’t even keep their own lies between the networks laced with a scent of historical accuracy. Recent state polls from battlegrounds like Ohio, Florida , North Carolina, Nevada, and others, combined with what we already know about levels of minority support, absentee balloting, early voting turnout, and enthusiasm, indicate that Trump is ahead or neck and neck in the Electoral College. Regardless of the final outcome, competition in these states cannot possibly correlate with a 12-point loss. Companies that release polling like this deserve all the ridicule they will receive for compromising their integrity.'"}, "time": 1742562332.1189113}