{"duration": 0.059061527252197266, "input_args": {"text": "'FBI Investigates Saudi Wife-Abusing Clinton Foundation Donor in Straw Donor Scheme November 2, 2016 Daniel Greenfield \\nIt\\'s midnight in America. And the Clintons and the Democratic Party keep finding ways to cover themselves in glory. I\\'m sure the line on this will be that the FBI is acting \"inappropriately\" by investigating this. Investigating political corrupt ion interferes with corrupt politicians being elected. \\nThe FBI is investigating an alleged illegal donation scheme involving a wealthy Saudi family that supports Democratic Florida Senate candidate Patrick Murphy. \\nMurphy, who has covered himself in glory so often already, is denying everything. And I mean absolutely everything. \\nThe Murphy campaign declined to say whether the candidate is aware of the FBI probe \\nWhat\\'s your name? I decline to answer that question. \\nMurphy, 33, is running against Rubio, the incumbent Republican, in a race that could help decide which party controls the Senate in 2017. Rubio currently leads Murphy by an average of 5.6 percentage points, according to RealClearPolitics. \\nThe FBI investigation, however, relates to Murphy’s first run for the House in the 2012 campaign cycle. \\nThe allegation — originally submitted by a Republican super PAC run by a former top aide to Senate Majority Leader Mitch McConnell (R-Ky.) — is that Murphy’s high school friend and major political donor, Ibrahim Al-Rashid, coordinated a “straw donor” scheme to boost Murphy. \\nMurphy knows nothing! \\nMurphy’s campaign declined to say whether Murphy’s attorneys had discussed the FBI investigation with Al-Rashid’s attorney. \\nUh-huh \\nAl-Rashid is the son of a powerful and politically connected Saudi billionaire. He’s been a major financial benefactor of Murphy’s, giving almost $400,000 to his campaigns and to outside groups supporting the Florida congressman. \\nHere\\'s how some of these donations worked. \\nOne example within the alleged scheme: A woman who describes herself in federal donation reports as the “owner” and “property manager” of a Texas-based company, Limestone Property Management, gave Murphy’s campaign $300. \\nBut she is neither the property manager nor the owner of the Texas-based company. In fact, she doesn’t work there. \\nShe lived in Miami at the time and was Ibrahim Al-Rashid’s “cleaning lady,” according to a Miami-Dade Police Department report filed in 2012 over a home burglary at Al-Rashid’s property. \\nTexas property manager vs Saudi\\'s cleaning lady. That\\'s quite a difference. \\nMurphy has been forced to return Al-Rashid\\'s donations before for purely Islamophobic reasons. \\nAl-Rashid’s three sons have followed in their father’s political footsteps, contributing large sums to top Democrats, including Rep. Patrick Murphy (D., Fla.), whose Senate race could help decide which party controls the Senate in 2017. \\nMurphy has already returned a portion of al-Rashid’s donations due to his involvement in a domestic assault incident. \\nIbrahim al-Rashid allegedly forced his way into his estranged wife’s Pennsylvania home, where al-Rashid allegedly “grabbed her by the wrist, struck her about the head and face with a closed fist then threw her to the ground,” according to a copy of the police report viewed by the Free Beacon. \\nFollowing the 2014 incident, al-Rashid allegedly sent his wife a text message stating, “I am not sorry this time I hope you die in hell,” according to the police report. \\nMurphy, a longtime friend of al-Rashid, was recently forced to donate around $16,000 in campaign funds to domestic violence groups after the assault charge became a public liability for the campaign. Murphy also returned all of the donations made by al-Rashid during the last three political cycles. \\nIs the Clinton Foundation involved in this? Do the Clintons do their business in golden and marble toilets? \\nNasser al-Rashid, one of Saudi Arabia’s wealthiest figures and an adviser to the country’s royal family, has donated somewhere between $1 million to $5 million to the Clinton Foundation, putting him in an elite category of prominent donors. \\nThe Clintons. If there\\'s dirt anywhere, you\\'ll find it on them.'"}, "time": 1742564304.6307535}