{"duration": 0.09549713134765625, "input_args": {"text": "'LONDON  —   Christopher Steele, the former British intelligence agent who prepared the dossier on Donald J. Trump’s supposed activities in Russia, has gone underground. The strange story of the dossier, which United States intelligence agencies, the F. B. I. Senator John McCain and many journalists have had for weeks, if not months, and which Mr. Trump presumably must have known about, appears to have had personal consequences for Mr. Steele. According to neighbors and news reports, Mr. Steele hurriedly left his home in Surrey, a county southwest of London, on Wednesday to avoid attention or possible retribution once his identity as the author of the dossier was revealed, first by The Wall Street Journal. The Journal reported that Mr. Steele had declined its interview requests because the subject was “too hot. ” Mr. Steele, 52, was a longstanding officer with MI6, the British equivalent of the C. I. A. serving in Paris and Moscow in the 1990s before retiring. In 2009, he started a private research firm, Orbis Business Intelligence Ltd. with Christopher Burrows, now 58. Mr. Burrows has refused to confirm or deny that Mr. Steele and Orbis wrote the memos that made up the dossier, initially under contract to a Washington firm paid to dig into harmful matters from Mr. Trump’s past. Mr. Burrows’s profile page on LinkedIn describes him as a former counselor in the Foreign Office, with postings in Brussels and New Delhi in the early 2000s. Diplomatic postings are sometimes used to provide cover for intelligence agents. Mr. Steele’s profile on LinkedIn gives no specifics about his career. He is known in British intelligence circles for his knowledge of the intricate web of   companies and associates that control Russia. Mr. Steele, as a known former MI6 agent, was thought not to have gone to Russia in his investigations but to have used contacts inside and outside the country to prepare the dossier, which United States intelligence agencies have said they cannot substantiate. But the file was used to prepare a   appendix to the intelligence presentation American officials gave to Mr. Trump last Friday. Mr. Trump has denied the allegations in the dossier in the sharpest terms, and called them “fake news. ” Russia has denied that it holds any compromising material on Mr. Trump. John Sipher, who retired from the C. I. A. in 2014 after 28 years with the agency, described Mr. Steele as having a good reputation and “some credibility. ” Mr. Sipher was stationed in Moscow in the 1990s, and then ran the C. I. A. ’s Russia program for three years, according to an interview he gave to PBS NewsHour. He now works at CrossLead, a   technology company. “I have confidence that the F. B. I. is going to follow this through,” Mr. Sipher said. “My nervousness is that these kind of things are going to dribble and drabble out for the next several years and cause a real problem for this administration going forward. ” An investigator for a business research firm in London similar to Orbis, who knows the work of the company but who has met Mr. Steele only briefly, said he was not impressed by the dossier. “I have a lot of experience in this world,” he said. “If I were the client, I would throw it back and say, ‘Where’s the evidence guys? I can’t use this.’ ” The investigator, who asked for anonymity because he did not want to discuss publicly the work of a competitor, said that “all intel has to be caveated. ” “Maybe they went to a usually reliable source,” he added, “but there’s no explanation about the credibility of these sources. ” He continued, “Maybe sometimes sources want to tell the investigators what their clients want to hear. ” Referring to companies like Orbis and his own, he said: “Usually your job would be to stop clients from dealing with corrupt, questionable counterparts in a   country like Russia, but this same network could be put to use” to compile reports like the one on Mr. Trump. “There’s a risk that maybe the sources fed questionable intelligence, knowing that it would do more damage to Trump’s enemies than to Trump,” the investigator suggested. Orbis’s website says that it was “founded by former British intelligence professionals. ” Based in Grosvenor Gardens, near Victoria Station in London, the company says it has a “sophisticated investigative capability” and mounts “  operations” and “complex, often   investigations. ” According to the website, it also offers “  source reporting on business and politics at all levels,” and “draws on extensive experience at boardroom level in government, multilateral diplomacy and international business to develop bespoke solutions for clients. ” Mr. Steele and Orbis have previously investigated corruption at FIFA, the governing body of world soccer. In October, David Corn of Mother Jones magazine wrote about the dossier and described his conversations with Mr. Steele, whom he did not identify by name or nationality. According to the British newspaper The Telegraph, a friend of Mr. Steele’s said that after his name and nationality were revealed, he had become “terrified for his and his family’s safety. ” Mr. Steele’s wife and children also were not at home.'"}, "time": 1742562292.4303885}