{"duration": 0.12171244621276855, "input_args": {"text": "'VANDENBERG AIR FORCE BASE, Calif.  —   A Falcon 9 rocket roared into the sky on Saturday carrying 10 communications satellites  —   a return by SpaceX and its billionaire leader, Elon Musk, to the business of launching satellites to orbit. But financial details disclosed this past week about the company overshadowed the successful liftoff, raising questions about the viability of Mr. Musk’s   plans for SpaceX and his vision of sending people to Mars. SpaceX, based in Hawthorne, Calif. has been set back since September, when a different Falcon 9 caught fire and exploded on a launchpad in Florida, destroying the rocket and its payload, a $200 million Israeli satellite that Facebook had planned to lease to expand global internet services. The company’s rockets had been grounded since then. An internal investigation concluded that a failure of a helium vessel in the second stage liquid oxygen tank had led to the conflagration. The Federal Aviation Administration, which regulates commercial space launches, accepted SpaceX’s report on the explosion’s causes on Jan. 6 and issued a launch license, clearing the way for Saturday’s liftoff here, on the other side of the country. To prevent a recurrence, SpaceX adjusted its fueling procedures to avoid overcooling of the helium. Saturday’s countdown proceeded smoothly, with the liftoff occurring within a   window that would send the rocket on a trajectory to line up with the orbit of a group of current Iridium Communications satellites. The new satellites are more powerful than the original ones, which have been in orbit nearly two decades and have outlived their designed lifetimes. SpaceX also repeated its feat of recovering the first stage of the Falcon 9 rocket, landing it on a floating platform named “Just Read the Instructions” in the Pacific. Less than 90 minutes later, mission control received confirmation that all 10 satellites had been successfully deployed. Over the next 14 months, the company plans six additional Falcon 9 launches to deploy 60 more Iridium satellites that will completely replace the constellation. In the   the successful launch helps put SpaceX back on track. The explosion and subsequent   grounding created a backlog of launches, including cargo missions for NASA to the International Space Station. September’s explosion was SpaceX’s second failure in 15 months a Falcon 9 rocket carrying NASA cargo disintegrated in flight in June 2015. On Friday, The Wall Street Journal reported that SpaceX had lost $260 million in 2015 after the earlier accident, and revenue dropped 6 percent to $945 million. In earlier years, SpaceX officials including Mr. Musk described the company as consistently profitable that claim has been removed from SpaceX’s website. Company officials did not dispute the numbers reported in The Wall Street Journal article, but portrayed a rosy future. “Since 2002, we have been at the forefront of revolutionizing space technology, with a solid track record of success, strong customer relationships and more than 70 future launches on our manifest, representing over $10 billion in contracts,” Bret Johnsen, SpaceX’s chief financial officer, said in a statement. “Furthermore, with over $1 billion in cash reserves and no debt, the company is in a financially strong position and is well positioned for future growth. ” SpaceX hopes to launch its larger Falcon Heavy this spring. The Heavy, years behind schedule, would become the world’s most powerful rocket since NASA retired the Saturn 5 more than 40 years ago. SpaceX also plans to refly one of its recovered boosters this spring. By reusing instead of throwing away rocket boosters, SpaceX hopes to significantly reduce the cost of launches. Also on the schedule is an   abort test of SpaceX’s Dragon 2 capsule, a crucial safety prerequisite that it must conduct before the company can begin ferrying NASA astronauts to the space station next year. By applying Silicon Valley entrepreneurial practices to aerospace, SpaceX has undercut prices and disrupted the rocket launch business. That brought in many customers like Iridium, which is paying more than $450 million for the seven launches. The   bid from one of SpaceX’s competitors was $1. 2 billion, said Matthew J. Desch, Iridium’s chief executive. Without SpaceX’s lower costs, Iridium could not have afforded to replace its group of satellites, Mr. Desch said. “The Falcon 9 is perfect for what we want to do,” he said. But the lower costs make it difficult to see how SpaceX could earn enough profit to finance its grand ambitions. In September, Mr. Musk unveiled his vision for what he called the Interplanetary Transport System  —   a gigantic rocket with 42 engines that could take 100 passengers to Mars as early as 2024. SpaceX has described plans to offer satellite internet services with more than 4, 000 satellites. The forecasts described by The Wall Street Journal, which were produced in early 2016, show how much the company is depending on this new business. SpaceX projected that current rocket launching business would quintuple in revenue, to $5 billion, in 2025. Satellite internet services, still in the early planning stages, were projected to bring in more than $30 billion in revenue and generate the bulk of more than $20 billion in profit for the company. During the September announcement, Mr. Musk spoke of “a huge   partnership” to get to Mars, but did not describe what kind of partnership he foresaw. The incoming Trump administration has not outlined in detail its plans for NASA, although some of the  ’s advisers, including Newt Gingrich, are pushing for a greater reliance on commercial companies like SpaceX. Other Republicans, however, have been strong defenders of the Space Launch System, the big, expensive rocket that NASA is developing for a Mars mission.'"}, "time": 1742562292.184956}