{"duration": 0.09117341041564941, "input_args": {"text": "'HONG KONG  —   Alarmed over North Korea’s increasingly provocative behavior, the United States said Tuesday that it had started to deploy an antimissile system in South Korea that China has angrily opposed as a threat to its security. The deployment of the Terminal High Altitude Area Defense system, or Thaad, came after North Korea launched four ballistic missiles on Monday, apparently in response to joint naval exercises by South Korea and the United States. Those launchings led South Korea to call for the accelerated deployment of Thaad. A spokeswoman for the United States forces in South Korea said that one of five major components of the missile system had arrived on Monday. Officials said it could take a couple of months for the system to become fully operational. Defense Secretary Jim Mattis had urged the South Koreans to move ahead with the deployment of the system during a visit to Seoul in February. In telephone calls on Monday to South Korean and Japanese leaders, President Trump said the United States would stand with its Asian allies and take steps to defend against North Korea’s growing ballistic missile threat. Mr. Trump emphasized that the United States was taking steps to “enhance our ability to deter and defend against North Korea’s ballistic missiles using the full range of United States military capabilities,” the White House said in a statement. China has been incensed over the deployment of the system, fearing it could give the United States military the ability to quickly detect and track missiles launched in China, according to analysts. A spokesman for China’s Ministry of Foreign Affairs, Geng Shuang, said Tuesday that China would “take the necessary steps to safeguard our own security interests, and the consequences will be shouldered by the United States and South Korea. ” Mr. Geng warned the two countries not to “go further and further down the wrong road. ” Yang Xiyu, a former senior Chinese official who once oversaw talks with North Korea, said China was worried that the deployment of the system would open the door to a broader American network of antimissile systems in the region, possibly in places like Japan and the Philippines, to counter a growing Chinese military. “China can see benefits only for a U. S. regional plan, not for South Korea’s national security interest,” he said. The state media recently encouraged Chinese citizens to boycott South Korean products and companies over the Thaad issue. The Chinese authorities recently forced the closing of 23 stores owned by Lotte, a South Korean conglomerate that agreed to turn over land that it owned for use in the Thaad deployment. Hundreds of Chinese protested at Lotte stores over the weekend, some holding banners that read, “Get out of China. ” Adm. Harry B. Harris Jr. the head of the United States Pacific Command, announced the start of the deployment, saying that “continued provocative actions by North Korea, to include yesterday’s launch of multiple missiles, only confirm the prudence of our alliance decision last year to deploy Thaad to South Korea. ” The developments come as South Korea is consumed by turmoil over the impeachment of President Park   whose administration agreed to the Thaad deployment. But with the president facing possible removal from office over a corruption scandal, the fate of the system had been in doubt. Its accelerated deployment could make it harder, if not impossible, for her successor to head off its installation. Moon   an opposition leader who is the   in the race to replace President Park, acknowledged that it would be difficult to overturn South Korea’s agreement to deploy the system. But he has insisted that the next South Korean government should have the final say on the matter, saying that Ms. Park’s government never allowed a full debate on it. Last year, thousands of people in Seongju, a rural southern county in South Korea, protested when it was announced that a Thaad battery would be established there. They said they feared that the system would harm their agricultural livelihoods. Many South Koreans also worry that any expansion of military ties with the United States could worsen already festering tensions with North Korea and China. Under its deal with Washington, South Korea is providing the land for the missile system and will build the base, but the United States will pay for the system, to be built by Lockheed Martin, as well as its operational costs. The United States military statement said that “the first elements” of Thaad were deployed on Monday, the same day as the North’s missile launchings. A   cargo plane landed at the United States military’s Osan Air Base, about 40 miles south of Seoul, on Monday evening, carrying two trucks, each mounted with a Thaad launchpad. More equipment and personnel will start arriving in the coming weeks, South Korean military officials said. “South Korea and the United States are doing their best to make the Thaad system operational as soon as possible,” the South Korean Defense Ministry said in a statement on Tuesday, adding that the system was necessary “to protect South Korea from the nuclear and missile threat from North Korea. ” The ministry declined to specify when the system would be operational. But the South Korean news agency Yonhap reported that the deployment was likely to be completed in one or two months, with the system ready for use by April. The arrival of Thaad equipment was announced after South Korea’s acting president, Hwang   talked with Mr. Trump on the phone on Tuesday morning. The two leaders condemned the North’s missile tests as a violation of the United Nations Security Council resolutions and agreed to beef up the allies’ joint defense posture, strengthen sanctions and step up pressure against the North, Mr. Hwang’s office said. On the phone with Mr. Trump, Mr. Hwang called the North’s nuclear and missile threat a “present and direct danger” to its allies, his office said. The Japanese prime minister, Shinzo Abe, said he spoke for 25 minutes on Tuesday with Mr. Trump, who reiterated his pledge to stand by Japan “100 percent,” according to the public broadcaster NHK. “I appreciate that the United States is showing that all the options are on the table,” Mr. Abe said, adding that Japan was “ready to fulfill larger roles and responsibilities” to deter North Korea. Takashi Kawakami, a professor of international politics and security at Takushoku University in Tokyo, said the deployment of Thaad could put the United States in a stronger position to consider a   strike on North Korea. If the United States took such action, he said, “North Korea is going to make a counterattack on the U. S. or Japan or another place, so in this case they will use Thaad. ” With tensions increasing over the deployment of the system, some in China have advocated stern measures, including severing diplomatic relations with South Korea, or more. A retired general, Luo Yuan, even suggested that China destroy the system with a military strike. “We could conduct a surgical   operation that would destroy the target, paralyzing it and making it unable to hit back,” General Luo wrote in Global Times, a   newspaper.'"}, "time": 1742562339.9208386}