{"duration": 0.03153347969055176, "input_args": {"text": "'You are here: Home / US / The Clinton Shakedown Scam Summed Up With One Meme The Clinton Shakedown Scam Summed Up With One Meme October 28, 2016 Pinterest \\nRegan Pifer writes that everyone should donate to the Clinton Foundation immediately! \\nAfter all, it takes hundreds of thousands of dollars to support Bill and Hillary, along with the Clinton Foundation board members, to fly around the world in their Boeing 757, and to stay in $13,900/night villas with a 60-foot swimming pool. \\nThat kind of luxury ain’t going to pay for itself! \\nOh, and–in between the opulence and indulgence–former president Bill Clinton and his donors stopped to serve “meals to 250 underprivileged children” in Jaipur, India on July 16, 2014. \\nI wonder how many more meals, medicine, or school supplies could have been provided with an extra $13,900. \\nThis is a typical Clinton Foundation site visit. \\nAccording to The Daily Caller : \\nThe trip provides a glimpse into the lavish lifestyle of the Clinton Foundation and dozens of its wealthiest donors — all done in the name of charity, according to a Daily Caller News Foundation investigation… \\nThe Clinton excesses on this particular trip were seen in several Third World nations. Indonesian officials, for example, warned the foundation that Pangkalan Bun Airport’s landing strip was too short for the Boeing 757 and that the party would have to switch to a smaller aircraft. \\nOfficially, the Indonesian stop was to visit a Clinton Climate Initiative project where a local forest preserve was being cultivated to offset carbon emissions. But flying 41 people — donors, their families and foundation staff — aboard an aircraft designed for nearly 300 sent the trip’s “carbon footprint” sky high… \\n…[T]he 757 and Gulfstream burned 60,000 gallons of jet fuel, worth at least $220,000 using current commercial aviation rates. \\nSixty thousands gallons of jet fuel produced 200 tons of carbon dioxide emissions, enough energy to power 21 average U.S. homes for a year, according to the U.S. Environmental Protection Agency. It would fuel a passenger car 478,000 miles in a year. \\nThe Clinton entourage’s carbon dioxide consumption exceeded a year’s total emissions by countries like Guinea-Bissau, Tonga, the British Virgin Islands, Lichtenstein and the Solomon Islands, according to the World Bank . \\nThe Clinton Foundation led a workshop in what not to do –a mismanagement of funds and resources for the gluttonous indulgence of donors. \\nImagine if the “C” in the Clinton Foundation stood for compassion as opposed to corruption…'"}, "time": 1742628484.8918474}