{"duration": 0.09892821311950684, "input_args": {"text": "'October 29, 2016 -  By Eduard Popov for Fort Russ - translated by J. Arnoldski - \\n\\n\\nFor the first time since the Cold War, the “Russian question” has become an important part of the debates between US presidential candidates. In turn, Russia is highly interested in a favorable outcome of the elections in the United States. In Russia itself, discussion has long been raging over which one of the US presidential candidates is better for Russia’s interests: Donald Trump or Hillary Clinton?  \\nRussian society’s sympathy undoubtedly belongs to Donald Trump, as Clinton has a high disapproval rating given her personal qualities and approach to Russia. If she is elected president of the United States, then she will likely become the most unpopular head of the White House in Russian public opinion. \\nThe “Russian question” is part of a more global question of the new world system in which the US is losing its status as the world’s sole superpower. Russia is playing an important role in changing the American Empire’s status, perhaps even a leading one. But the American crisis is even more comprehensive and goes far beyond Russia’s influence. A Russia dreaming of returning its former imperial greatness is less to blame for the fall of the US’ imperial influence than the irrationality of the American elites themselves.  \\nRussia survived two collapses in the 20th century consequential of internal factors.  The two Russian revolutions of the 20th century (1917 and 1991) were the result of a low quality of the ruling class and the undermining of their authority in society. The external factor was important, but still only a subsidiary cause of the collapse of the government and society. I believe that America is facing a similar crisis.  \\nAs the author of these lines was told 10 years ago by an astute and recognized scholar, a former citizen of the USSR who emigrated to the US in the early 1990’s, America is today undergoing the same wrenching transformations that the Soviet Union experienced in the Perestroika period. This scholar’s view of the future of his new homeland was exclusively pessimistic - he believed that the US would not cope with its own restructuring primarily because of the unsuitability of its own elites. \\nOf course, my opinion as a person who knows little of America and the opinion of the more knowledgeable above-mention citizen are only personal ones. But the emergence of the phenomenon of Donald Trump is not a detail, but an objective consequences of the deep crisis of the American system.  \\nThe Trump phenomenon demonstrates at least two critical factors: (1) the complete alienation of the American elites (or as the Czech communist ideologist Dr. Skala says, the American ‘nomenklatura’) from the people, and (2) the American nomenklatura’s complete loss of touch with reality. Both are painfully reminiscent of the situation in the USSR before Perestroika.  \\nThe late Soviet elites (the ‘nomenklatura,’ as they were pejoratively called in society) turned into a closed caste. Even though, in my opinion, they were still more democratic than the current American elite, the Soviet nomenklatura sacrificed the interests of real modernization of the country’s social-economic system and ideology for the sake of pursuing geopolitical phantoms. Perhaps I am wrong, but such \"false idols\" prevail in the minds of the current American nomenklatura even more.  \\nIn the US, factories are closing, migration is growing, Mexico is slowly realizing a Reconquista (the return of their lands in the southwestern states of the US that were annexed as a result of an unjust war), and all of this is happening against the backdrop of imperial overstretch. The US is striving to control not only its backyard, Latin America (which is being actively penetrated by Chinese capital, another manifestation of the phantom thinking of the American nomenklatura), but also Ukraine, for which Russia is ready to fight to the last breath.  \\nAmerica does not have the strength for this. But the American nomenklatura does not have the slightest interest in taking care of things at home and concentrating on domestic issues. Continuing American expansion is akin to Trotsky’s permanent revolution. Such is intriguing and vivid, while home repairs and cleaning toilets is infinitely boring and tedious. \\nThis is why the US presidential elections will be won by the political lunatic and American Trotskyist, Hillary Clinton, who does not strive for realism or call for cleaning the Augean stables like Donald Trump does. \\n\\nObviously, for Russia it is better to deal with a US government which defends its own national interests, not phantoms of pseudo-democracy and its declining imperial power. But little depends on Russia’s opinion. Therefore, it is advisable to prepare for and objectively observe the course of the fight whose outcome is practically a foregone conclusion.  \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563702.0194335}