{"duration": 0.11033105850219727, "input_args": {"text": "'Diez consejos para preparar tu casa de cara a la llegada de tu primer hijo NUESTROS EXPERTOS TE ASESORAN vivienda \\nEl momento ha llegado. Sólo quedan unos pocos meses para que nazca vuestro hijo y tenéis que adaptar vuestro hogar ahora que vais a ser uno más. Ofrecemos unos consejos para que vuestro piso sea el sitio idóneo para vosotros y vuestro primogénito. \\n1. Habitación infantil no regida por patrones patriarcales y sexistas : En lugar de pintarla de azul o rosa, mezcla los dos colores y obtendrás un violeta marronáceo francamente desagradable aunque 100% inclusivo y no discriminador. Con los juguetes puedes probar a poner un Action Man con peluca y bikini haciendo la colada y una Dora La Exploradora sosteniendo una metralleta, así el niño aprenderá a no asociar a un género concreto las labores del hogar o la violencia. \\n2. Disfraza al niño de lámpara : Ciertos caseros pueden ver en un bebé un foco de problemas con los vecinos: ruidos, malos olores, llantos a altas horas de la noche… Por eso, recomendamos que durante el día sientes al bebé en una mesa y le pongas una pantalla de lámpara sobre la cabeza. Así, ante la visita inesperada del dueño del piso, podrá parecer una parte más del mobiliario doméstico. \\n3. Inclúyele en el contrato de alquiler : El bebé va a disfrutar de las comodidades de vuestro hogar como cualquier otro inquilino. Por eso, es lógico que contribuya a los gastos derivados de alquiler, luz y agua. Desde luego, mientras sea menor de edad no podrá pagar su parte correspondiente, pero piensa lo bien que os vendrá en un futuro la inyección económica que os proporcionará el pago de la deuda millonaria que vuestro hijo habrá adquirido con vosotros por contrato. \\n4. Vestid siempre como personajes de fantasía : Ir siempre disfrazados del Pato Donald o Bob Esponja alimentará la imaginación y la creatividad del bebé. Se llevará una gran desilusión cuando descubra que en realidad sólo sois unos funcionarios de Correos a punto de cumplir los 40, pero al menos vivirá feliz sus primeros años creyendo que su familia es especial. \\n5. Instala en su móvil la app de Idealista : Vivir con tu hijo es una experiencia inigualable, pero seamos sinceros, estabais mucho más tranquilos viviendo solos. Instalad la app de Idealista en el móvil que cuelga encima de su cuna, que el niño se sienta “invitado” a buscar cuanto antes su apartamento de soltero. \\n6. Esconde el porno : Trata de buscarles un sitio seguro a todas esas cintas de porno ruso, las esposas, los electrodos y el resto de juguetes que tu pareja y tú empezasteis a usar para avivar la pasión sexual que había desaparecido entre vosotros. Los niños de hoy en día nacen muy espabilados y, si lo descubriese, podría venderlo todo en el Cash Converters a la primera de cambio. \\n7. Roba columpios del parque y ponlos en el salón : Es importante que los niños jueguen y se diviertan, pero nada da más pereza que llevarles al parque una fría tarde de febrero. Teniendo los columpios en casa, podréis permitiros no sacar al niño a la calle durante meses. Recomendamos que desatornilléis el columpio y lo subáis a vuestro piso de noche y siempre con el rostro cubierto si no queréis tener que leeros los consejos de nuestro artículo “Cómo cuidar a tu hijo en Alcalá Meco”. \\n8. Compra calimocho : Cuando menos te lo esperes, tu hijo habrá crecido e, irremediablemente, querrá hacer botellón con sus amigos. Mejor que sea en casa en lugar de en un callejón de mala muerte y mejor con un buen vino que con un cartón de 60 céntimos. Además, un lingotazo a las botellas de vino puede ayudaros a volver a conciliar el sueño cuando el bebé os despierte a las 4 de la mañana. \\n9. Fabrícale un pijama con flecos de fregona : Ya que el niño va a pasar horas y horas arrastrándose por el suelo de la casa, al menos que limpie el suelo. \\n10. Llena su habitación de peluches : Si, servirán para divertir y hacer compañía al niño, pero principalmente debes de usar los peluches para esconder dentro de ellos el dinero que ganaste en el Euromillón sin que lo supiera tu pareja para gastártelo tú.'"}, "time": 1742564302.099278}