{"duration": 1.4377925395965576, "input_args": {"text": "'As the American financial system collapsed in the fall of 2008, Stephen K. Bannon began to fantasize about destroying something else: the elite economic and political establishment that he believed had created the crisis. Mr. Bannon, who was named Donald J. Trump’s campaign chief on Wednesday, was at the time a highly improbable revolutionary, a wealthy former Goldman Sachs banker and a budding filmmaker. But his   Southern roots tugged at him: panicked by the swooning market, his father, a telephone company lineman with no college degree, had sold much of the stock in his retirement account. “Steve felt it was outrageous,” said Scot Vorse, his former business partner and a longtime friend. It was the start of a remarkable reinvention that turned a polished corporate dealmaker who once devised $10 billion mergers on Wall Street into a purveyor of     media who dwells in the darker corners of American politics. The website he runs, Breitbart News, recently accused President Obama of “importing more hating Muslims” compared Planned Parenthood’s work to the Holocaust called Bill Kristol, the conservative commentator, a “renegade Jew” and advised female victims of online harassment to “just log off” and stop “screwing up the internet for men,” illustrating that point with a picture of a crying child. With its provocative content,   style and populist message, Breitbart is, in many ways, a mirror of Mr. Trump’s presidential campaign  —   which explains why the Republican nominee was so drawn to Mr. Bannon, Breitbart’s chairman. “Steve is a fighter. He loves the fight. He loves the scrum,” said Andrew Marcus, who met Mr. Bannon, a Navy veteran, while making a documentary about Breitbart’s founding editor, Andrew Breitbart, who died in 2012. Mr. Bannon, 62, who grew up in a Democratic family in Virginia that fled the party in favor of Richard Nixon’s    Republicanism, has quietly advised Mr. Trump throughout his campaign, according to friends and colleagues. But as Mr. Trump’s candidacy has started to sputter and flail, Mr. Bannon’s role has intensified, so much so that Mr. Trump asked to meet with him over the weekend and offered him the position of chief executive. That vaunted post, which makes Mr. Bannon the single most influential figure in the Trump campaign, is a leap of faith by a candidate who has long eschewed political professionals: Mr. Bannon has never before worked on a national campaign, let alone overseen one. But his résumé is thick with the kind of experience Mr. Trump covets: a deep understanding of how the news media works and how public perceptions are molded. Over the past decade, Mr. Bannon has built a small but potent media empire designed to directly challenge the country’s cultural and political elite, whom he sees as incorrigibly detached from   America and responsible for dismantling its backbone  —   an industrial economy that employed its families and the secure borders that protected them. He made movies that lionized Sarah Palin and vilified the Occupy Wall Street movement as fraudulent rebels backed by   liberals. A trailer for that film, called “Occupy Unmasked,” is a fevered compilation of rioting, profanity, a burning American flag and a man appearing to brush his bare behind against a police car. “We are finally telling you the true story of the radicals behind the Occupy movement,” Mr. Breitbart, the film’s star, says grimly into the camera. Mr. Bannon, who declined to be interviewed for this article, has made little secret of his desire to frighten Americans out of complacency, fusing relentless provocation and a hodgepodge of conservative ideas to make the case for rebellion against the political order. “Fear is a good thing,” he said in a 2010 interview. “Fear is going to lead you to take action. ” His timing was serendipitous: Mr. Bannon’s ventures in   film and news were perfectly timed to capture the emerging fury of the Tea Party movement, which was still smarting from the federal bailout of Wall Street banks like his former employer, Goldman Sachs, and the growing sense that the nation’s top tier had sold out the working and middle classes. By 2014, Mr. Bannon had jumped from the political sidelines into the arena. When a   Republican candidate named David Brat challenged Eric Cantor, the House majority leader known for his close ties to Wall Street, Breitbart News put its thumb on the scale, publishing dozens of positive articles about the underdog’s bid. Mr. Bannon was childhood friends with a top adviser to Mr. Brat, whose victory stunned Republican elders. It was a foretaste of the   movement Mr. Trump would soon lead. “He is somebody who puts his activism on par with his intellectual work,” said David Bossie, president of the conservative group Citizens United, who has collaborated on film projects with Mr. Bannon. “A lot of intellectuals sit back and write columns and let other people do the work,” Mr. Bossie said. “Steve is a believer in doing both. ” The credential that has earned Mr. Bannon a spot in the Trump campaign  —   his stewardship of Breitbart News  —   was something of an accident. The death of Mr. Breitbart, at age 43 of heart failure, was a shock to his reporters and fans. Mr. Bannon threw himself into the    management of the site, opening branches in Los Angeles and London and leading   conference calls during which he issued directives on what stories to pursue. His business acumen has paid off: Breitbart received 18. 3 million unique visitors in July, according to data from comScore, up about 40 percent from the year prior. The site has outpaced conservative rivals like The Daily Caller, and Breitbart executives say that monthly traffic has increased by 16 times since the year Mr. Bannon took over. But some inside Breitbart chafed at Mr. Bannon’s outspoken style of management, complaining that he upbraided staff members and seemed to embrace outright advocacy over journalistic principles. In March, several top reporters and executives resigned, saying that Mr. Bannon’s insistence on articles favorable to Mr. Trump had compromised Mr. Breitbart’s ethos that nothing was sacred. “He is someone who is prone to   tirades at all hours of the night,” said Kurt Bardella, a former spokesman for Breitbart, who quit after complaining that the site had transformed into “Trump’s de facto ‘super PAC. ’” Ben Shapiro, a former editor at Breitbart, said Mr. Bannon’s language could be startling. “There are very few people who have dealt with Steve Bannon who have not been cursed at,” he said. Tensions spiked after Michelle Fields, a Breitbart reporter, accused Mr. Trump’s campaign manager, Corey Lewandowski, of shoving her at a rally. (Battery charges against Mr. Lewandowski were later dropped.) To the surprise of many on staff, Breitbart published an article that questioned portions of Ms. Fields’s account, a rare case of a publication publicly challenging its own reporter. She later quit. Allies of Mr. Bannon say that he is simply a   manager with high expectations  —   a description echoed on Wednesday by Breitbart’s chief executive, Larry Solov, who in a memo to the staff described Mr. Bannon as “a huge piece of manpower. ” Mr. Marcus, the documentary filmmaker, said that it frequently fell to Mr. Bannon to rein in the excessive instincts of Breitbart News and its staff in meetings. “He was a voice of reason,” Mr. Marcus said of the time he spent inside the company, following Mr. Breitbart around. “Steve was the one saying, hey, maybe you want to dial that back a bit. ” Like Mr. Trump, who remains closely involved with his real estate business despite his candidacy, Mr. Bannon is not walking away from his pastimes. A new documentary he directed, “Torchbearer,” which follows the “Duck Dynasty” star Phil Robertson to the Parthenon and other famed locations, is scheduled to be released this fall. The film may echo the bleaker themes of Mr. Trump’s campaign. “We discuss how empires rise and fall, and how they lose God in their societies,” said Mr. Bossie, of Citizens United, who is a producer. Asked if Mr. Bannon could succeed as a campaign manager, typically the ultimate insider role, Mr. Bossie said that Mr. Bannon’s outsider status would be “a plus, not a minus. ” “This,” he added, “is the year of the outsider. ”'"}, "time": 1742563087.5808551}