{"duration": 0.21446442604064941, "input_args": {"text": "'Comments \\nA private group of technical experts has reviewed meta-data about the Trump Organization’s internet usage and just concluded that the Republican nominee is using a personal email server to surreptitiously communicate from the Trump-email.com domain with a controversial Moscow-based bank, Alfa Bank. \\nThe timing of the Russian communications coincides perfectly with milestones throughout the election (see chart at bottom), and the very high level of secrecy deployed to hide them is going to be hard to explain away for the Trump campaign. \\nAdding fuel to the building controversy, when researchers contacted Alfa Bank for comment, the Trump Organization quickly shut down the server: \\nThe Times hadn’t yet been in touch with the Trump campaign—Lichtblau spoke with the campaign a week later—but shortly after it reached out to Alfa, the Trump domain name in question seemed to suddenly stop working. \\nThe computer scientists believe there was one logical conclusion to be drawn: The Trump Organization shut down the server after Alfa was told that the Times might expose the connection. Weaver told me the Trump domain was “very sloppily removed.” Or as another of the researchers put it, it looked like “the knee was hit in Moscow, the leg kicked in New York.” \\nBut with their eyes watching, the Trump Organization casually re-connected with Alfa Bank only four days later, on a different server. All of this was captured in the Domain Name System (DNS), which is the internet’s internal directory system. DNS leaves log records all over saying how often website visits happen, and it’s the very same web services which was attacked last week , taking down Twitter, The New York Times and others. DNS is the system that routes our internet requests using names instead of numbers, and it keeps logs with IP address numbers and timestamps. \\nIn this case, the meta-data practically screams to experts, because it shows that there is little other traffic of any other kind by design. As we learned from Edward Snowden, the meta-data of a situation is incomplete, but it can tell you a lot. \\nThe new domain is owned by one of Trump’s hospitality marketing contract companies, which dispels Trump’s blown cover story that the private server is just used for marketing. \\nDomain registration information also confirmed that the same marketing team works on both Trump-email.com and the new client-contact.com email addresses being used. Furthermore, the world-renowned technical expert Paul Vixie revealed that the Trump Organization went to extra-ordinary lengths to shut out all traffic that isn’t from Alfa Bank. \\nThere is a more sinister reason for creating a private email server that only participates in conversation with one specific party was identified by computing legend Paul Vixie: \\nEarlier this month, the group of computer scientists passed the logs to Paul Vixie . In the world of DNS experts, there’s no higher authority. Vixie wrote central strands of the DNS code that makes the internet work. After studying the logs, he concluded, “The parties were communicating in a secretive fashion. The operative word is secretive . This is more akin to what criminal syndicates do if they are putting together a project.” \\nPut differently, the logs suggested that Trump and Alfa had configured something like a digital hotline connecting the two entities, shutting out the rest of the world, and designed to obscure its own existence. Over the summer, the scientists observed the communications trail from a distance. \\nIronically, the academics and others started looking for foreign interference in order to protect both campaigns from outside meddling. It appears as if only one of the two campaigns conspired to that end: \\nThe computer scientists posited a logical hypothesis, which they set out to rigorously test: If the Russians were worming their way into the DNC, they might very well be attacking other entities central to the presidential campaign, including Donald Trump’s many servers. “We wanted to help defend both campaigns, because we wanted to preserve the integrity of the election,” says one of the academics, who works at a university that asked him not to speak with reporters because of the sensitive nature of his work. \\nWhen researchers contacted Alfa Bank for comment, suddenly the Trump Organization shut down their email domain quickly. \\nFour days later, the Trump Organization and Alfa Bank resumed communications – and it was the bank who contacted the Republican nominee’s company from Moscow, somehow knowing the new code to interact with the Trump private email server. \\nThis new information shows that after Trump asked Putin to hack America’s election to prejudice them against Democratic candidate Hillary Clinton in late July, traffic between the campaign and the Russian bank spiked. \\nIn the end, this is yet another matter that the FBI will surely have to investigate.. The question is: will they be fair and release the files from their inquiry in the kind of “act of radical transparency” that Director James Comey imposed on Hillary?'"}, "time": 1742563307.1959312}