{"duration": 0.043033599853515625, "input_args": {"text": "\"By Gordon Duff, Senior Editor on October 28, 2016 Radio Host and Trump supporter claims 'Jewish mafia' controls US \\n[Editor’s note: The insanity has hit, Trump mouthpiece and Arch Zionist Alex Jones is on the warpath against the ‘Jewish mob’; Israel’s newspaper’s are shocked, as you can see below – or are they? Trump, grandson of a brothel owner, son of a slum lord, grew up in Meyer Lansky’s mob-run New York and by his 30s became the ingenue/money boy of Jewish mob kingpin Roy Cohn; it was Roy Cohn and the Jewish mob that built Trump’s empire and ran interference for him with the Gambinos, John Gotti & company. Now, covering this up seems to be really important, but to whom and why? \\nThe article below was published in today’s Jerusalem Post. Not a word of it is true, moreover, it is an obvious deflection piece written to save Trump’s Nazi supporters backing in face of VT’s slam dunk assertions of Trump’s Zionist fanaticism. \\nAfter all, Trump has pushed for war on Iran, for clearing out the West Bank and for a one state solution in Israel with Palestinians going through the chimney’s. \\nBut why then are America’s Jew haters, the human filth that would gas America’s Jews the big Trump lovers? Some of it comes from the Nazi movement itself, largely begun as a fundraiser by the ADL/JDL/AIPAC/SPLC lobby. You see, no swastikas painted on synagogues, no big corporate donations. On Alex Jones by Brother Nathaniel , a long accused rabid anti-Zionist: \\nTHE CONTROVERSY OF ALEX ‘BULLHORN’ JONES being an alleged Zionist shill has now expanded to his apparent Zionist-Jewish connections on his 1) Personal Staff 2) Website Advertisers 3) Link To Time Warner President, Edgar Bronfman Jr. \\nJones’ seeming allegiance to Zionism, which explains why he virtually never targets Zionist Jews or the racist, Zionist rogue state of Israel when engaging in his notorious rants and attacks , may well stem from a Protestant-Zionist belief system, and the widely circulated reports that his wife is a Jew –– which makes his two children Jewish under Talmudic law and eligible for the Israeli Law Of Return . \\nWith additional information on Jones which this site is now providing, Alex Jones’ Zionist connections prompting his reticence to expose global Zionism, becomes ever more obvious. \\nTrump has played the hate card from day one, building his base on hatred of blacks/African Americans, “Messicans” and, of course, he has played the terror card, the “yellow hordes” card and the “elite liberal” card as well. \\nThat one is aimed at the Jews. Trump, whose empire was built by Roy Cohn and who has been supported and financed by Jewish organized crime and now by Vegas boss Shelly Adelson, who can buy and sell Trump out of his “trump change,” has always been a front for the Jewish mob. Jewish mobsters, as oft pointed out by Ian Greenhalgh, have surrounded Trump and embarrassed him, if you can imagine that, more than once. \\nYears ago, during nasty litigation, radio host Jeff Rense, former partner of Alex Jones, tracked Jones and his backing to the Jewish mob and the Bronfman crime family, accused of their complicity in financing 9/11. \\nNow we see the Zionist press pulling out the “anti-Semite card” on Alex Jones, one of Israel’s strongest supporters in the US. Is this a joke? Of course, this kind of childishness would only work with the brain dead Jew hating Nazi’s that have flocked to Trump. With Trump’s effusive love of everything Israel and everything Zionist, one might ask why the Nazi’s flock to him, but Nazi’s have never been thinkers and are great followers, even when they are sent over a cliff like lemmings. \\nComment boards at VT have been inundated with paid trolls, some who track back to Israel, others employed by Trump surrogate operations tied to his campaign. Toads and trolls get up to $50 for a comment placed even on wrong articles. Thus, we have closed comments to cut off this income source and clean out the trash were we can even though this is the best money Trump pays out except for hookers. \\nWhen are American Jews going to rise off their knees and hit back at, well, at Israel, the ADL and the rising tide of Naziism in the US paid for by their donations? \\nIf the read below doesn’t have you laughing, we are sorry. Humor is where we find it and this is humor at its best. G]\""}, "time": 1742628585.2479537}