{"duration": 0.07424354553222656, "input_args": {"text": "\"Email \\nAmerica learned a worrisome bit of news on Sunday when mainstream media outlets began reporting that while the Department of Justice was in possession of tens of thousands (possibly hundreds of thousands ) of new (and unseen) emails pertinent to the investigation into Hillary Clinton’s private email server, they were NOT allowing the FBI to have access to those emails ! \\nThis is extremely frustrating news, as there is less than two weeks to go before Election Day and most Americans would like to know for sure if Hillary Clinton is indeed a crook before they go and pull the voting lever. Yahoo News reported that the FBI had not yet attained a warrant to see the emails, but this should be a moot point for two reasons – first, Anthony Weiner (the subject of the investigation that dug up the new Abedin/Clinton emails) has been cooperating and gave investigators clearance to all of his devices and electronic material. Secondly, Abedin previously swore to investigators that she had turned over all of her devices and all of her recorded emails. The discovery of a new device and thousands of new emails proves she lied to investigators and could be facing prison for doing so. (UPDATE: The FBI’s warrant finally came through Sunday evening and they should begin combing through every email on the laptop soon.) \\nWhile the DOJ may be stonewalling the FBI for now, Fox News’ Bret Baier explained that the FBI doesn’t need a warrant because Weiner has already given them permission to search the computer. I emailed that 2 sources say Weiner is cooperating w/ FBI- & co-owned laptop. Also NY FBI had info 4 a few weeks- pressure was building https://t.co/AHbQVtvQzg \\nMore from the Daily Caller : \\nAdditionally, the U.S. Attorneys offices and local law enforcement have access to the FBI laboratory , for example, to conduct “scientific examinations of evidence for any federal, state, and/or local law enforcement organization in the United States.” \\n“With all of these law enforcement agencies, both local and federal, now looking into this case, it’s a sign that they’re really going after him,” a law enforcement source told The NY Post back in September. “They want to nail him.” \\nLess than two weeks ago, The Daily Mail reported that a federal grand jury was expected to hear the allegations against Weiner in the coming weeks. Weiner, as a result of the grand jury convening, already received a federal subpoena for his devices, as reported by CNN in September. The FBI confiscated Weiner’s electronic devices on October 3, The New York Times reported . \\nWhat does it all mean? \\nThe FBI is going to get those emails, each and every one, the DOJ knows this, which means the only possible reason for belaboring the handoff to the FBI is to slow the course of the investigation ensuring that any new information is held until AFTER Election Day. This is corruption and election fraud of the highest order, coordinated by Obama’s DOJ and executed by Attorney General Loretta Lynch. \\nArticle reposted with permission from Constitution.com Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742562153.9674811}