{"duration": 0.14455342292785645, "input_args": {"text": "'At Fox Searchlight’s holiday party in New York last week, the Bagger bumped into a couple of stars from two of the studio’s splashiest 2016 productions: one of the films soared to great heights, while the other crashed to an unimagined low. The first actor was Natalie Portman, who is raking in rave reviews for her performance in the title role in “Jackie” and is expecting her second child in a few months. The Bagger asked how she was faring on the awards circuit. “While pregnant and sober?” Ms. Portman dryly replied. The other actor was Colman Domingo, who played Hark in the slave revolt film “The Birth of a Nation,” which, for the first half of this year, before controversy engulfed it, was considered one of the brightest prospects for the awards season. He said now that the uproar had subsided, he wanted to share his frustrations and disappointments about how everything played out. “You walk into these rooms, and it’s almost like a bittersweet look people give you in their eyes,” Mr. Domingo said. “I look at the work of my peers on the film, and I wish it was being celebrated. The cinematography, the music. Aja Naomi King’s is one of the best performances of this year. But we’re under the veil of the whole controversy, and people almost don’t want to touch it. ” It is hard to overstate the ebullience that met “The Birth of a Nation” at its premiere at Sundance in January. “Birth,” which tells of the slave rebellion led by Nat Turner in 1831, was the passion project of its director, writer and star, Nate Parker, who spent eight years pulling the financing together. The film arrived in Park City, Utah, just as Hollywood was fielding intense scrutiny for its   roster of Oscar acting nominees, and after a bidding war “Birth” sold to Fox Searchlight for $17. 5 million, a festival record. There were projections of awards, and while other films featuring black protagonists  —   “Moonlight,” “Fences,” “Hidden Figures” and “Loving”  —   have come to dominate Oscar chatter, “Birth” was initially at the fore. “It felt like the film had an urgency,” Mr. Domingo said. Then, in the summer, after Oprah Winfrey and Spike Lee heartily endorsed the film, news articles emerged detailing harrowing rape accusations made in 1999 against Mr. Parker at Penn State, where he was a student and wrestler, and his roommate at the time, Jean McGianni Celestin (who would go on to share a story credit on the film). Mr. Parker was acquitted, and the case against the roommate, who was initially convicted, was reversed. After news broke that Mr. Parker’s accuser had killed herself in 2012, the scandal went nuclear. It all came to a head at the Toronto International Film Festival in September, when audiences responded to “Birth” with standing ovations. At a jammed news conference attended by every lead in the cast, including Mr. Domingo, Mr. Parker deflected a pointed question (asked by the Bagger). Few would doubt the importance of the film, the Bagger said, but people were having trouble separating the artist from the art. And since the film’s message was one of moral accountability, people felt Mr. Parker should offer his accuser’s family an apology. Would he now? Mr. Parker demurred, saying he was there to promote the film and celebrate the hundreds of people who made it. At that moment, Mr. Domingo, who had been sitting near Mr. Parker on the panel, said he felt the wind leave his sails. “That’s when I knew that the 45 minutes of the cast speaking in detail about the film would be eviscerated,” said Mr. Domingo, who is also a playwright and stars in television’s “Fear the Walking Dead. ” “I was disappointed,” he continued. “I would’ve handled it differently. Could he have handled it better? I don’t know what it’s like to walk in his shoes. I try to deal with things in a different way. I think I’m always trying to see the other’s point of view, dealing in a very    way. It’s    instead of   . But it’s possible he felt embattled by the time he got to Toronto. This was something he created with the spirit of love and community, and suddenly he’s battling other forces of something he dealt with 17 years ago. ” (Mr. Parker’s acquittal came in 2001.) Over all, Mr. Domingo believed that Mr. Parker, whom he described as “deeply passionate, generous and kind,” had handled the matter “the best way he can. ” Mr. Domingo also found fault with the Bagger’s question, a criticism others have echoed. “Looking back in hindsight, I can see Nate’s point of view. Why apologize when he was vindicated?” he asked. “But I believe with the media, you must answer every question in some way. And in very, very, touchy situations, we must answer every question again and again. Even if we’ve said it before, we have to say it again. ” His   shared his discomfort. Aunjanue Ellis, who played Nat Turner’s mother, wrote in Ebony that she “agonized” over how Mr. Parker handled the fallout from the accusations and that she grieved for the accuser and her family. Still, she urged people to see the film, as did the groundbreaking director Julie Dash, telling the Bagger, at the Toronto film festival: “No will always mean no. It will always be attached to that film. However, do not miss this experience of seeing that film. ” But people did miss seeing that film, in droves: according to Box Office Mojo, it has earned just $15. 8 million domestically. Its case was not helped by some middling reviews. But there is no question that the controversy dealt a death blow. (Mr. Parker’s representatives did not respond to questions for this article.) Looking back, Mr. Domingo said he felt there was “a huge takedown by any means necessary,” not just toward the film but also toward black resistance in America. After a summer, he said, of “dealing with black men on the streets and retaliation and Black Lives Matter, Blue Lives Matter, All Lives Matter, it’s almost as if this film was too powerful,” he said. “It was like a big slap on the hand: Never try this again. Who do you think you are? If this were ‘Madea’s Halloween,’ would they try to take it down? Absolutely not. ” While opinionators, including Damon Young of the digital magazine Very Smart Brothas, have dismissed the notion of a concerted takedown, it’s hard not to compare Mr. Parker’s scandal with that of Casey Affleck, the star of the current release “Manchester by the Sea. ” Mr. Affleck, who is white, faced sexual harassment complaints from two women  —   neither of whom would comment  —   and reached a settlement with them in 2010. Different circumstances, to be sure  —   “Birth” also prominently featured rapes, while “Manchester” is about a   family  —   but, still, the matter has not seemed to hurt Mr. Affleck’s Oscar chances this season. In the end, Mr. Domingo said, the controversy could be seen as a reflection of how he often sees his position in American culture. “I feel in many ways as a black man in this country, you should apologize, or feel gratitude,” he said. In recent days, Mr. Domingo said, he has discerned a shift around “Birth,” with more people being able to see it on its own merit. “This is one of the seminal moments in my career,” he said. “One of the moments I’m so proud of in every way. But you can’t feel proud of your work without the other feelings on top of it. ”'"}, "time": 1742564013.6025827}