{"duration": 1.3523139953613281, "input_args": {"text": "'If Jared Kushner did not realize that the establishment press and Democrats will never give him or President Donald Trump a free ride after Democrats politicized Trump’s firing of FBI Director James Comey, he is now learning how viciously the antagonistic press can pile on when seeking to destroy their opposition. And it looks like the establishment media are just getting started. [After the Washington Post named Kushner as the “person of interest” in the FBI’s Russia investigation, Kushner, in just a matter of days, as Fox News’s Howard Kurtz wrote, “has become the media’s biggest target —  that is, right after his   . ”  Kushner may have thought firing Comey would be a “win” for Trump because Democrats blamed Comey for costing Hillary Clinton the election. But the media never granted Trump a honeymoon period and will not give him automatic “wins” because they consider him an illegitimate outsider. And, as Kushner is finding out, because he is regarded as Trump’s top adviser, Kushner will always be in the media’s crosshairs no matter how much he tries to “moderate” Trump or court and charm the media. After media outlets initially reported that a White House official in Trump’s inner circle was a “person of interest” in the FBI’s Russia investigation, the Washington Post last Friday dropped a supposed “bombshell” report naming Kushner as the “person of interest” who allegedly wanted a “back channel” to communicate with Russian officials. But as Breitbart    Joel Pollak noted, nothing in the Post’s article was new: “The meeting with Kislyak was reported nearly three months ago. The meeting with the banker was reported two months ago. And stories about a potential ‘back channel’ were reported almost two months ago. ” In fact, Kushner is reportedly not even a “target” of the investigation. There is also no smoking gun proving Kushner colluded with Russia or did anything illegal, for that matter, as former Director of National Intelligence James Clapper emphasized on Sunday. But the media have treated Kushner, like they do with nearly every Republican who does not have favored status with them, as if he is guilty until proven innocent. The establishment press have largely brushed aside the notion that Kushner may have wanted to set up the “back channel” to discuss Syria policy, especially if he feared that the Obama administration may have been spying on Trump’s campaign team. Fox News reported that the idea for a “back channel” was not even Kushner’s idea in the first place. The media have also downplayed the fact that Russians often embellish things to engage in disinformation campaigns. Take CNN’s report, based on leaks from two anonymous former intelligence officials and even a congressional source, about the Russians having potentially “derogatory” information on Trump and his top aides. CNN reported that the Russians believed they had “leverage” on Trump’s inner circle, especially regarding financial issues. It is only until after the sensational claims are made that the outlet points out that this information “could have been exaggerated or even made up” because “the Russians could be overstating” things. There are certainly more questions that need to be answered —  like whether Kushner met with Russian banker Sergey Gorkov as a representative of his private company or as a representative of Trump’s transition team. But the controversy surrounding Kushner, which the media have ginned up with their anonymous leakers from the Deep State intent on undermining Trump, has given the media an excuse to damage Kushner politically. As if the media had many of these stories in their back pockets for the perfect time, the media immediately blitzed Kushner with an onslaught negative pieces. Here are ten ways the antagonistic press, with help from Deep State officials, have recently ganged up on Kushner. 1. Romney Redux: Kushner Depicted as Soulless Slumlord, The establishment media never investigated Obama’s top confidante and adviser Valerie Jarrett’s real estate holdings to depict her as a slumlord despite a body of evidence that was right in front of them. But nearly four months into Trump’s presidency, the media suddenly had the resources and the wherewithal to find former tenants who lived in Kushner’s properties to depict Trump’s    as a seedy slumlord. ProPublica and the New York Times collaborated on an extensive story about Kushner’s real estate holdings and depicted Kushner as a seedy and greedy slumlord. The piece was titled, “The Beleaguered Tenants of ‘Kushnerville. ” They found former tenant Kamiia Warren, who reportedly moved out of her East Baltimore townhouse when a neighbor started acting strangely —  like shouting through and banging on the walls at night, which often woke up her child. According to the report, “Warren sent a letter reporting the problem to the complex’s property manager” and “submitted the requisite form giving two months’ notice that she was transferring her Section 8 voucher  —   the federal   subsidy that helped her pay the rent  —   elsewhere. The complex’s   manager signed the form a week later, checking the line that read ‘The tenant gave notice in accordance with the lease. ’” Three years later, according to the report, she was sued for $3, 014. 08 by JK2 Westminster LLC, Kushner’s real estate company, and the lawsuit “claimed she owed the money for having left in advance of her lease’s expiration, though she had received written permission to leave. ” The establishment media are at their best when depicting Republicans (or even Democrats like Kushner who are now associated with Republicans) as heartless (see: Mitt Romney). The report points out that “Warren was raising three children alone while taking classes for a bachelor’s degree in health care administration” and paints Kushner and his associates as villains who preyed on an innocent single mother. According to the report, Warren lost her first appeal because “she did not have a copy of the form the manager had signed. The judge ruled against Warren, awarding JK2 Westminster the full sum it was seeking, plus court costs, attorney’s fees and interest that brought the judgment to nearly $5, 000. ” Kushner’s company has reportedly pursued such actions against “hundreds” of past tenants over the last five years. When Warren could not afford to pay the judgment, Kushner’s company “filed a request to garnish her wages from her   elder care job. Five days earlier, Warren had gone to court to fill out a handwritten motion saying she had proof that she was given permission to leave Cove Village in 2010  —   she had finally managed to get a copy from the housing department. ” But since she did not know that she had to attach a copy of her form to the motion, it was denied. Warren’s bank account was ultimately “zeroed out” and when she returned to court with all of the proper paperwork, her case was reportedly dismissed again without explanation. One of Kushner’s lawyers reportedly told her, “This is not going to go away. You will pay us. ” Soon after, according to the report, “the court sent notice of a $4, 615 lien against Warren. ” 2. Kushner Threw Trump Under Bus, Claimed    Thinks GOP Base Is ‘Stupid’ When a former Kushner employee (  York Observer editor) claimed that Kushner once told her that Trump was promoting “birtherism” even though “he really doesn’t believe it” because “he knows Republicans are stupid and they’ll buy it,” the press jumped on the comments as proof that Trump is a “man with no real morals, no real beliefs, but who is willing to peddle any sort of hatred or monstrous thought if he thinks that it will help him toward the nebulous goal of ‘winning. ’” 3. Media Report Trump ‘Angry’ at Kushner, Relationship Showing ‘Unmistakable Signs of Strain’ Though Trump went on the record to publicly support Kushner, the media did their best to undercut Trump’s comments with stories about how Trump was losing confidence in Kushner’s judgment and political acumen. Trump explicitly told the New York Times that “Jared is doing a great job for the country” and “I have total confidence in him. He is respected by virtually everyone and is working on programs that will save our country billions of dollars. In addition to that, and perhaps more importantly, he is a very good person. ” Yet, media outlets pointed out that Trump was not that close to Kushner before Kushner joined his campaign and quoted anonymous sources who said that Trump has yelled at Kushner in recent meetings. The Times reported that Trump has even made snide and disparaging comments about Kushner’s family after Kushner’s sister reportedly tried to peddle her brother’s access in the White House and “dangled the availability of   visas to the United States as an enticement for Chinese financiers willing to spend $500, 000 or more” to invest in Kushner’s real estate holdings. 4. Huffington Post: Marrying Ivanka on Calculating Kushner’s ‘Checklist’ to ‘Rehabilitate’ Family Name, According to the   Huffington Post, “when Charles Kushner was heading to federal prison in 2005 for illegal campaign contributions, tax evasion and witness tampering, his son Jared got some advice from Howard Rubenstein ― the dean of New York damage control ― on how to rehabilitate the Kushner name, Charles would later tell a family friend”: Step one: Buy a New York newspaper. Don’t be too particular, Rubenstein told Jared, according to the family friend’s recounting of their conversation with Charles. Any newspaper will do. Step two: Buy a big Manhattan building. Any building will do. Step three: Marry the daughter of a rich New York family. Anyone will do. The Huffington Post notes that Jared Kushner “went on to do just that. He bought the New York Observer in 2006, made a   $1. 8 billion purchase of 666 Fifth Ave. in 2007 and married Ivanka Trump in 2009. ” “Whether or not Kushner was indeed working through a checklist, his actions during those years have served him well,” the “story” points out. “They also laid the groundwork for the meticulous public relations strategy that has made possible Kushner’s current paradoxical role in the press, as a blameless yet uniquely powerful member of the Trump administration. ” Kushner’s spokesman reportedly denied the account and Rubenstein told the outlet that the account was “preposterous” and “I never said that or anything like that. ” But when it comes to making Trump’s    look bad, such a story is too good for outlets like the Huffington Post not to print. 5. Former Kushner Employees Smear Jared: ‘Vindictive Sh*thead’ Media outlets who were uncurious for eight years about former employees of top Obama administration officials suddenly started interviewing former employees and editors of Kushner’s newspaper —  the New York Observer. Of course, the media found those who were all too eager to smear Kushner. An “anonymous” editor described to the Washington Post that Kushner was insistent on getting a “hit job” on a banker who would not help Kushner refinance one of his buildings. Kushner was reportedly still upset when the paper’s editors —  even after assigning three different reporters to find dirt on the banker —  decided that “there’s no story there. ” Politico spoke to another former Kushner employee —  Harleen Kahlon —  who claimed that Kushner asked her to “take one for the team” and forego her performance bonus based on meeting “agreed upon metrics on page views and audience growth. ”: Kahlon abruptly quit. Ever since, whenever she sees him on TV or on the streets of New York, she points him out to people as: “the guy that stole my money. Just before the election, Kahlon described her former boss on Facebook thusly: “We’re talking about a guy who isn’t particularly bright or   doesn’t actually know anything, has bought his way into everything ever (with money he got from his criminal father) who is deeply insecure and obsessed with fame (you don’t buy the NYO, marry Ivanka Trump, or constantly talk about the phone calls you get from celebrities if it’s in your nature to ‘shun the spotlight’) and who is basically a shithead. ” 6.   Officials Claim Kushner Guilty of Espionage, May Even Be Russian Agent, Though Obama’s former Director of National Intelligence James Clapper said that his “dashboard warning light was clearly on” when he found out about Kushner’s dealing with Russian agents, he emphasized that there is “no evidence of collusion. ” But the media rushed to get former Deep State officials who were all too eager to slam Kushner. Former intelligence agent Malcolm Nance suggested Kushner may be guilty of espionage and called for Kushner’s security clearance to be revoked immediately. Former double agent Naveed Jamali went as far to say he thought Kushner was actually a Russian agent, a comment which even shocked an MSNBC host. 7. Media Suggest Kushner Family Want to Profit off Trump Presidency, Media outlets hinted that Kushner and his family may be more interested in using Trump’s presidency to pad their bottom lines and enhancing their images. They pointed to the fact that a day before Kushner’s sister sought funding from Chinese investors through the   investor visa program, Trump extended the program when he signed the most recent spending bill, “raising many eyebrows. ” Even the suggestion that Kushner and his family may be trying to profit off Trump’s name has made Trump livid, according go the Times. The Times pointed out Kushner’s sister’s   pitch to Chinese nationals “violated two major rules: Politically, it undercut his immigration crackdown, and in a personal sense, it smacked of profiteering off Mr. Trump  —   one of the sins that warrants expulsion from his orbit. ” 8. Kushner Is ‘Naive,’ ‘Unqualified’ and Dumb  …     Establishment media outlets used comments from former intelligence officials to push the narrative that Kushner was “in over his head” and naive to handle foreign affairs. When asked about Kushner’s alleged action, Michael Hayden, the former CIA and NSA Director, told CNN, “right now, I’m going with naïveté, and that’s not particularly comforting for me. ” “What manner of ignorance, chaos, hubris, suspicion, contempt would you have to have to think that doing this with the Russian ambassador was a good or an appropriate idea? ,” he asked. Former KGB spy Jack Barsky told CNN that Kushner was “naive” and “completely unqualified” to deal with the Russians because of the “inexperience he has in international affairs. ” He called Kushner’s alleged actions “ . ” 9.   …     Or Maybe ‘Desperate’? The Atlantic’s David Frum suggested that perhaps Kushner was not naive but rather desperate to get financing for his family’s Manhattan tower. “Maybe Kushner was desperate, not dumb   …     His family faced a huge hike in its debt servicing costs in December 2016. ” Frum wrote. He cited a Bloomberg News report that claimed a Manhattan tower that Kushner’s family   “has been losing money for three years and faces increasing loan fees in 2017, which may explain why the family has been negotiating with Chinese insurance behemoth Anbang on new financing”: The fees, at 666 Fifth Avenue, kicked in last month and escalate with each payment until the loan is repaid, a 2011 refinancing agreement shows. December brings another hurdle: Interest paid on the bulk of about $1. 1 billion of loans jumps to 6. 35 percent, more than double what it was after the debt was refinanced in 2011. And as the city’s biggest office construction boom in a quarter century creates a glut of supply, the property’s occupancy rates are falling. Seventy percent of the building was filled as of September, filings by LNR Partners, the loan managers, show. This is well below 91 percent for the New York metro area reported at year’s end by Reis, the   firm, said Bloomberg Intelligence analyst Jeffrey Langbaum. 10. Media: ‘Miserable,’ ‘Unhappy’  Distraught Kushner May Want to Go Back to NYC, After Kushner was named as the “person of interest,” the media quickly reported that Kushner has been “miserable,” “unhappy” and “frustrated” with his job as he has come under more scrutiny. It is as if they had these paragraphs already written, ready to be fired off at the best possible moment. The Times cited anonymous “friends” who told the outlet that Kushner “and his wife, Ivanka Trump, have made no   commitment to remain by Mr. Trump’s side, saying they would review every six months whether to return to private life in New York. ” Politico reported that there is a “sense of uncertainty about how long Kushner and Ivanka Trump  —   who associates say likes, but doesn’t love, Washington  —   are planning to stick it out. Some have noted that they rent their Kalorama mansion, which allows them to keep their options of moving back to Manhattan more open. ” On Wednesday, the Times reported that Trump “has not ruled out the possibility” that Kushner and Ivanka “would return to New York this year. ” Writing in the Guardian, Walter Shapiro predicted that Kushner’s “life in the coming months and maybe years will be a study in misery” because “he will probably spend more time with his personal lawyer, Clinton justice department veteran Jamie Gorelick, than with Ivanka or his children. Whether it is an appearance under oath on Capitol Hill or the inevitable FBI interview, every sentence Kushner utters will bring with it possible legal jeopardy. ” Shapiro, citing Kushner’s sister’s   visa exploits, wrote that perhaps “Kushner just calculated that all the hype surrounding his White House role was a     family branding opportunity. ” He also suggests that Kushner may end up behind bars, if he is not careful, like his father: “the worst thing that can happen to an   real estate investor (as Trump himself knows well) is bankruptcy. When the FBI and special prosecutor Robert Mueller get involved, the penalties can theoretically involve steel bars locking behind you. ” If Kushner did not realize it already, he should be well aware by now that the Democrats, the institutional left, and the   establishment media seek to destroy, do not give an inch, and play for keeps. And they may just be warming up.'"}, "time": 1742564619.824725}