{"duration": 0.06580710411071777, "input_args": {"text": "'Returning home on Saturday night after a dinner in Manhattan with some longtime friends, Gregory Locke boarded a No. 1 subway train and was confronted with an ugly sight. The car’s windows and posters were covered in   graffiti, according to accounts from Mr. Locke and another passenger in the car, Jared Nied. Messages like “Jews belong in the oven” and “destroy Israel, Heil Hitler,” had been written over subway maps, as shown by photographs taken on the train. Swastikas were drawn in black marker on the doors and windows. Mr. Locke, 27, a New York lawyer, said in a phone interview that his first reaction was shock, “especially once I realized how many instances of graffiti were on the train car. ” “But the shock quickly subsides and turns into a sort of a realistic horror,” he said. “You realize it’s appalling but it’s also not surprising at the same time. ” Neither man reported the graffiti to the police, and neither the New York Police Department nor the Metropolitan Transportation Authority had a record of any report. Mr. Nied, 36, was returning home from his work as a   around 7 p. m. and boarded the train at 42nd Street. He said in a phone interview that his reaction to the graffiti, which he noticed immediately, must have been written on his face, and he soon attracted the attention of another commuter. “There was a lady sitting across from me under the map, and she said, ‘Oh that’s absolutely horrible,’” he said. “‘Do you think there’s any way we can erase it? ’” Mr. Nied had many times used a Sharpie when he had meant to use a   marker, and he knew from experience that alcohol would work to erase the graffiti. “A light bulb went on, and I just asked, ‘Does anyone have hand sanitizer? ’” he said. Mr. Nied and several other commuters began to wipe away the graffiti, their actions captured in photographs taken by Mr. Locke, who wrote on Facebook about his experience. By late Sunday afternoon, more than 518, 000 people had reacted to the post on Facebook, and the post had been shared more than 354, 000 times. “I’ve never seen so many people simultaneously reach into their bags and pockets looking for tissues and Purell,” Mr. Locke wrote. “Within about two minutes, all the Nazi symbolism was gone. ” Mr. Nied said that the episode had lasted less than five minutes and that the passengers were able to erase the graffiti before the train reached 96th Street. He returned a bottle of hand sanitizer to one of the riders, apologizing for having used most of it. “We sat down and glanced around at each other and settled back into the commute,” he said. Both men said they understood that there might be skepticism about their accounts. “I understand the criticism, but unfortunately, I don’t have an answer for it,” Mr. Locke said. “I would probably be suspicious, too, if I didn’t take the pictures. ” Detective Ahmed Nasser of the New York Police Department said that while the episode had not been reported on Saturday, other reports of   graffiti had been logged recently: A recycling container downtown was reportedly defaced with the words “Jews are a virus” in black ink in January, and swastikas were found etched on a northbound F train this month. A separate episode, in which a passenger on a B train saw that a swastika on an American flag had been transformed into a message of love, drew a comment from Gov. Andrew M. Cuomo on Sunday. On Saturday night, Mr. Nied sent a text to his wife, Jacquline, and to a friend with a photograph of the graffiti, but he did not consider the prospect that someone else might have taken photos. He said it had not even crossed his mind until more than an hour later, when his wife looked at her phone. “She said, ‘Dude, you’re going viral,’” he recalled. He added: “It was a very New York moment in that we all came together, we all teamed up, and then we settled back down. I don’t think any of those people really spoke, truth be told. Everyone kind of just did their jobs of being decent human beings. ”'"}, "time": 1742628417.2238433}