{"duration": 0.034354448318481445, "input_args": {"text": "'posted by Eddie The emails released by WikiLeaks were leaked by brave members of the US intelligence community in an effort to expose Hillary Clinton’s corruption and stop her being elected, according to State Department insider Steve Pieczenik . The Clintons have initiated a “ silent coup ” in their bid for power, Pieczenik claims, explaining that the White House, judiciary, CIA, FBI, Loretta Lynch and James Comey have all been “ co-opted ” through political cronyism. But Piecezenik, a State Department veteran who has served in seven administrations, claims there is mutiny within the intelligence community and a “ counter-coup ” is in operation. “ In order to stop this coup we in the intelligence community have informally got together and with their permission I am starting to announce that we have initiated a counter-coup through Julian Assange and WikiLeaks. “ \\n\\nPieczenik was Deputy Assistant Secretary of State under Henry Kissinger, Cyrus Vance and James Baker, and served the administrations of Gerald Ford, Jimmy Carter, Ronald Reagan and George H.W. Bush as deputy assistant secretary. He is a legitimate insider with connections in all departments and agencies. FBI Mutiny His claims might explain the unprecedented and mysterious actions by the FBI on Tuesday. The FBI Vault silently and unexpectedly made documents relating to the investigation into Hillary Clinton available to the public – documents that were not due to be declassified until 2041. We can finally stop blaming Russians. Pieczenik states clearly that US intelligence – brave men and women in the FBI, CIA and wider intelligence community – submitted the emails to Julian Assange and WikiLeaks in order to thwart “ the second American revolution .” This counter-coup is working against Hillary Clinton and her campaign. Their goal is a peaceful transition of power away from the corrupt Clintons. “ Something had to be done to save the republic ,” he explains. source:'"}, "time": 1742562250.2667737}