{"duration": 0.06370258331298828, "input_args": {"text": "'Several health insurers will raise premiums by roughly 20 percent on plans sold through Obamacare exchanges. [The biggest Obamacare rate hikes will take place in Delaware, Virginia, and Maryland, which will ask for premiums on average higher than 30 percent in 2018. In Maryland, the average premium from CareFirst will rise by at least 50 percent. Oregon, North Carolina, and Maine health insurers will raise premiums by 20 percent or higher.  The health insurers’ rate hikes reflect the continuing collapse of Obamacare, as many state Obamacare exchanges continue to experience insurers exiting the Obamacare exchanges. Insurers also remain concerned about President Donald Trump’s potential decision to discontinue subsidies for health insurers to lower the cost of premiums. Conservatives argue that the Obamacare subsidies amount to handouts to large health conglomerates. Rick Notter, an executive at Blue Cross Blue Shield Michigan, said, “It’s still a very volatile market. There are so many uncertainties. ” Notter argues that the individual health care market continues to experience turbulence through the uncertainty that comes out of D. C. Republicans, who passed a health care bill through the House, point to insurers’ rate hikes and withdrawals from Obamacare exchanges as fundamental problems with the Affordable Care Act. “The laws of economics were in place long before today. These companies were losing hundreds of millions of dollars,” a White House official said. Sen. Tim Kaine ( ) argues that Republicans’ attempt to repeal Obamacare, as well as President Trump’s threat to remove subsidies to health insurers, created the health insurance rate hikes. Kaine said, “These actions, these statements, these inactions, this uncertainty, has created a huge set of chaos in the individual marketplace leading to instability for insurance carriers, higher premiums, and reduced competition. ” Kevin Lewis, the chief executive at Maine Community Health Options, said that its 19. 6 percent increase in 2018 arises from healthy people exiting the Obamacare markets. “It’s the classic case of people who are healthier jumping out of the market,” Lewis said. “It’s a bit of a   prophecy. ” President Donald Trump, citing that two million Americans have withdrawn from their Obamacare plans since signing up in January, declared that Obamacare is in a “ . ” 2 million more people just dropped out of ObamaCare. It is in a death spiral. Obstructionist Democrats gave up, have no answer = resist!  —   Donald J. Trump (@realDonaldTrump) June 13, 2017, '"}, "time": 1742561710.5628645}