{"duration": 0.07499265670776367, "input_args": {"text": "'Home / Foreign Affairs / Rothschild Bank Now Under Criminal Investigation Over Missing $4 Billion in Global Corruption Probe Rothschild Bank Now Under Criminal Investigation Over Missing $4 Billion in Global Corruption Probe Jay Syrmopoulos May 12, 2016 13 Comments \\nLast year the veil of invincibility seemingly came off the secretive Rothschild banking empire, as Baron David de Rothschild and his company the Rothschild Financial Services Group were indicted by French prosecutors for allegedly defrauding British pensioners in a scheme that saw large sums of money embezzled. \\nOnly two months ago, we reported on the Swiss branch of the Edmond de Rothschild Group announcing that they were the target of a French criminal probe “regarding a business relationship managed by a former employee.” \\nNow, the Luxembourg unit of Rothschild banking empire is being investigated by the Luxembourg state prosecutors office — alleged to have sent hundreds of millions of dollars to an account at a bank in Luxembourg that originated from 1Malaysia Development Berhad (1MDB). \\nThe fund, 1MBD, was established by Malaysian Prime Minister Najib Razak in 2009 as a government investment fund. There have been widespread accusations of corruption surrounding Razak after $1 billion dollars in deposits into his personal bank accounts were revealed. The deposits totaled hundreds of millions of dollars more than had previously been exposed by probes into state fund 1MDB, according to the Wall Street Journal. \\nThe Luxembourg investigation stems from an international probe of money that may have flowed from the Malaysian government investment fund, which is at the center of various worldwide corruption probes. \\nAccording to a report in the WSJ : \\nThe Luxembourg unit of Edmond de Rothschild Group, a private bank that manages money on behalf of wealthy clients, said it is “cooperating” with an official investigation of money that may have flowed from a Malaysian government investment fund at the center of various world-wide corruption probes… \\nThe Luxembourg investigation widens probes of 1MDB already under way by authorities in Switzerland, Malaysia, Singapore, Hong Kong and Abu Dhabi. Swiss authorities said in January that 1MDB-related losses from misappropriation could reach $4 billion. The Luxembourg prosecutor said its case was connected to the investigation in Switzerland. \\n1MDB was created to invest in local energy and real-estate projects to boost the Malaysian economy. The fund amassed $11 billion in debt which it has struggled to repay. Last July,The Wall Street Journal reported that almost $700 million was transferred to Mr. Najib’s bank accounts via a web of entities, money which investigators believe originated with 1MDB. 1MDB has denied sending money to Mr. Najib’s accounts and denied wrongdoing and said it is cooperating with probes \\n“Edmond de Rothschild Europe is actively cooperating in the judicial proceedings,” a spokeswoman for the Edmond de Rothschild Group told the WSJ. \\nThe Edmond de Rothschild Group oversees roughly $164 billion in assets, according to Bloomberg. The private bank and asset management firm to the elite was founded by Edmond de Rothschild in Paris in 1953. Edmond’s son Benjamin de Rothschild succeeded his father as head of the group in 1997. Last year, Benjamin appointed his wife, Ariane, chairwoman of the executive committee. The Swiss unit traces its roots to the acquisition of Banque Privee in Geneva in 1965. \\nBut the history of the Rothschild banking empire stretches far further back in time. \\nAccording to The Richest : \\nThe Rothschild Family as we know it is descended from Mayer Amschel Rothschild, who was born in what is now Frankfurt, Germany. The son of Jewish moneychanger and trader Amschel Moses Rothschild, Mayer Amschel Rothschild was the fourth of 8 children, and went on to establish a huge international banking empire. \\nThrough his 5 sons, Mayer Amschel Rothschild expanded his banking business, which was founded in the 1760s, to international areas and, as such, managed to bequeath his huge wealth, unlike many rich members of the Jewish community at the time. Mayer Amschel’s 5 sons were each stationed at one of the major European financial centres, one in Frankfurt, London, Naples, Vienna, and Paris. \\nThis passing on of Mayer Amschel’s wealth and business meant that his sons could continue to build on the foundations of their father’s success. In the 19th century the Rothschild Family were at the height of their powers, and were known all around the financial world. Their great fortune and ingenious business minds meant that they carried great power during this time. They utilised this power by affecting some very significant events in human history in order to profit greatly from it. This included backing the British forces with huge sums of money during the Napoleonic Wars (more on that later) and funding Brazil’s claim for independence from Portugal. \\nThe Rothschild banking dynasty is a family line that has been accused of pulling the political strings of many different governments through their control of various economic systems throughout the world. Historically, there is ample evidence to show that the family has used insider trading to bilk money from both private and public funds. \\nTowards the end of the Napoleonic Wars, in 1813, Nathan Mayer Rothschild saw Napoleon’s war efforts as a threat to his business practices and decided to step in to help defeat the French conqueror. He became the most important financier of the British war effort pouring the equivalent of $900 million dollars in today’s dollars in 1815 alone. The defeat of Napoleon, and subsequent ending of the Napoleonic Wars, which started in 1803 and raged throughout the continent for 12 years before finally coming to an end in 1815. \\nDuring the Battle of Waterloo in the Napoleonic wars, Nathan Rothschild was responsible for one of the oldest cases of “insider trading,” which led to the Rothschild family robbing a whole nation blind. When the battle of Waterloo took place in 1815, horse messengers were the fastest method of communicating information. The Rothschild’s took advantage of this by having their own spies on the frontlines of the battle that would then expedite the information to the family faster than the messengers used by the military. \\nWhen the British won the battle, Nathan Rothschild, was, of course, the first to know, and he immediately went to the stock exchange and started selling stocks while putting out the rumor that the French had won the war. This created a panic on the floor of the stock exchange and investors all over England began frantically selling their stocks. With the price of all stocks plummeting Rothschild was able to buy out the whole English market for a fraction of its cost. When word returned that the English had actually been victorious, the value of the market soared, and overnight Nathan Rothschild expanded his family’s wealth and cemented their position as one of the richest, and most influential families in the world. \\nAlthough the Rothschild family now keeps a very low public profile, they still have significant business operations across a wide spectrum of sectors. While you may not find any one particular Rothschild on the Forbes’ most rich list, the family is estimated to control $1 trillion dollars in assets across the globe, thus having a strong voice across the geopolitical spectrum that many perceive as a hidden hand manipulating events silently from behind a veil of virtual secrecy and silence. Share'"}, "time": 1742628410.1607409}