{"duration": 0.03380084037780762, "input_args": {"text": "'Email Print It has been revealed that there are about 650,000 emails on Huma Abedin’s husband’s laptop. Of the 650,000 emails, thousands are labeled “classified” National Security material forwarded from another email server. According to sources, the emails were discovered in a folder labeled, “Life Insurance”. Is it possible the folder was mislabeled by Abedin to deliberately conceal its contents? This also begs the question: How did Huma Abedin get National Security clearance? \\nThe NY Post explains where FBI originally dropped the ball when they first investigated Abedin: Skeptical agents showed Abedin three separate email exchanges she had with an IT staffer regarding the operation of the private Clinton server during Clinton’s tenure at State. Abedin claimed she “did not recall” the email exchanges. So if you believe Abedin, she didn’t know the private clintonemail.com server that hosted her [email protected] account even existed until she heard about it in the news. Comey was a believer; he didn’t even bother to call her back for further questioning. Case closed. But Abedin’s role in this caper begs for fresh scrutiny. Making false statements to a federal agent is a felony. So is mishandling classified information. By forwarding classified emails to her personal email account and printing them out at home, Abedin appears to have violated a Classified Information NonDisclosure Agreement she signed at the State Department on Jan. 30, 2009, in which she agreed to keep all classified material under the control of the US government. An infographic puts it in a simpler form, stating how government emails were forwarded to her Yahoo account — for what? No one knows. There was allegedly a counter-espionage case going on around the time. With 500,000,000 email accounts hacked earlier last year, Abedin has put our National Security in danger. How did Huma Abedin get National Security clearance? How did #HillarysHuma get National Security Clearance⁉ #WheresHuma #GoHillary find Huma Abedin pic.twitter.com/wLS2JSYEQ1 \\n— Νia🚨650,000Emails (@nia4_trump) October 30, 2016 Join us on Facebook to Stop The Takeover. Click on the button to subscribe. Leave a comment... '"}, "time": 1742564162.9492517}