{"duration": 0.8065810203552246, "input_args": {"text": "\"Is Hillary Clinton The Athaliah Of Our Generation? Just Check Out What One Eyewitness Is Saying…   June 6th, 2016 \\nIt is amazing to me that the American people would willingly choose an exceedingly wicked woman such as Hillary Clinton to lead them. Perhaps this is just more evidence of how incredibly far we have fallen as a nation. There are many out there that are comparing Hillary Clinton to Queen Jezebel from ancient Israel, but to me there is another figure in the Bible that is much more appropriate. Somewhere around 2800 years ago, King Jehoram of Judah was married to a very wicked woman named Athaliah. When Jehoram unexpectedly died, his son Ahaziah became king of Judah for about a year, but then he died too. At that point Athaliah seized power and tried to kill off all male descendants that might pose a threat to her reign. Fortunately, one very young male descendant did survive, and Athaliah was finally deposed after six horrible years. If you take a close look at the careers of Hillary Clinton and Athaliah, there are definitely some striking parallels between the two… \\n-They were both initially married to the ruler of the nation. \\n-They both had very prominent roles while their husbands ruled. \\n-They both had an extraordinary lust for power. \\n-They both exhibited extreme paranoia and dealt ruthlessly with anyone that was a potential threat to their hold on power. \\n-Athaliah greatly promoted the worship of Baal in ancient Judah, and one of the key elements of Baal worship was child sacrifice. Since Roe v. Wade was decided in 1973, more than 58 million babies have been murdered in the United States, and Hillary Clinton has spent her entire career telling women that they have “a right to choose” to kill their children. \\nIt would take an entire set of encyclopedias to document all of the evil things that we already know that Hillary Clinton has done, but now disturbing new evidence is coming forward. \\nFormer Secret Service agent Gary Byrne is a 29 year veteran of the military and federal law enforcement, and his new book entitled “ Crisis of Character ” has been the topic of the top headline on the Drudge Report for two days in a row. According to Byrne, Hillary Clinton was so angry and so violent while the Clintons were living in the White House that Secret Service agents and White House staff constantly “lived in terror of her next tirade” … \\n“What I saw in the 1990s sickened me,” he writes in the intro of the book, “ Crisis of Character: A White House Secret Service Officer Discloses his Firsthand Experience with Hillary, Bill, and How They Operate .” \\nThe book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade . \\nIn recent years, the media has been absolutely brutal on celebrities that have committed domestic violence, and rightfully so. \\nBut why does Hillary Clinton get away with it? \\nAccording to Byrne, one particularly violent encounter with Hillary resulted in Bill Clinton having a “real, live, put-a-steak-on-it black eye” … \\nA former Secret Service officer who helped protect Hillary Clinton while she was in the White House charges in a new tell-all book that the former first lady had a ‘volcanic’ temper and occasionally got violent with her husband – and that a loud 1995 fight left the president with a black eye . \\nIn the book, ‘ Crisis of Character ,’ former agency officer Gary Bryne, details arriving at work after a 1995 shouting-match that left a light blue vase ‘smashed to bits’ and Bill sporting a ‘real, live, put-a-steak-on-it black eye.’ \\nThings got so bad that Secret Service agents had discussions about the possibility they might have to protect the president from his wife’s physical attacks , the New York Post reported in advance excerpts of the book. \\nNow let me ask you a question… \\nWhat should be done to a violent husband that gives his wife a black eye? \\nOf course the answer is obvious. \\nSo why wouldn’t we treat Hillary Clinton exactly the same way as a society? \\nThere are many other extremely interesting details in Byrne’s new book, including the fact that he once interrupted Bill Clinton making out with a woman that was not his wife … \\nByrne — who was subpoenaed to testify before the grand jury that investigated Bill Clinton’s affair with intern Monica Lewinsky — claims in the book that he interrupted the president’s sexual shenanigans in the White House. \\nByrne says he walked into a room where the president was “involved inappropriately with a woman” who was neither his wife nor Lewinsky . \\nThese are the people that we want to put back into the White House? \\nAre we completely nuts? \\nThere are even more shocking details from the book that I cannot share with you because they are so sordid that they are not appropriate for many of the family friendly websites this article will be appearing on. \\nIn the end, I am so glad that Byrne has decided to come forward, because the American people deserve to know the truth about Hillary Clinton. As a former Secret Service agent, he says that there is no way that the Clintons should ever be allowed back into the White House … \\n“Hillary Clinton is now poised to become the Democratic nominee for president of the United States, but she simply lacks the integrity and temperament to serve in the office. From the bottom of my soul I know this to be true. So I must speak out. \\nI had no animosity toward the Clintons. Out of a sense of loyalty to our First Family I even secretly disposed of sordid physical evidence that might later have been used to convict the president. The blue dress wasn’t the only evidence of his misdeeds. But I could not keep from asking myself how our nation’s leaders could be so reckless, so volatile, and so dangerous to themselves and to our nation. And yes, to me and my family. \\nI want you to hear my story. It’s about the men and women risking their lives to protect this nation. And more important, it’s about how the Clintons must never again be allowed to put them or you and your children—at risk.” \\nOf course what Byrne is saying meshes very well with what other Secret Service agents have said in the past. Investigative journalist Ron Kessler interviewed many of them for his book entitled “The First Family Detail” , and he revealed in that book that many agents consider it to be “a form of punishment” when they are assigned to Hillary Clinton… However, Hillary is exposed as being the complete opposite of her husband and daughter, and instead is reportedly very rude and acted nasty toward a number of agents. ‘Hillary was very rude to agents, and she didn’t appear to like law enforcement or the military,’ former Secret Service agent Lloyd Bulman recalled to Kessler. ‘She wouldn’t go over and meet military people or police officers, as most protectees do. ‘She was just really rude to almost everybody. She’d act like she didn’t want you around, like you were beneath her.’ \\nIf we are not going to believe Secret Service agents, who are we going to believe? \\nOver the years, literally dozens of insiders have come forward to tell the truth about the Clintons, and yet the American people continue to embrace them. \\nIn the end, we get the leaders that we deserve, and the people that we send to Washington are a reflection of who we are as a nation. \\nSo if we send this generation’s version of Athaliah to the White House in November, what will that say about us? \\nPerhaps that is something that we all should be thinking about in the months ahead… Was The Gotthard Base Tunnel Opening Ceremony An Illuminati Ritual Intended To Honor Satan? » William Lutz \\nWhen a woman is attacked by a man, she is the pampered victim of domestic violence who gets special treatment. On the other hand, when a man is attacked by a woman, he is the aggressor who initiated the fight. That’s a perfect example of feminist double standards. Hitlery physically abused her husband and it was swept under the rug. I don’t know why certain people such as the Clintons are not held accountable for their actions. theShipIsSinking \\nTwo questions:“Why are the Clintons (and a long list of others including the Bush Dynasty, Nixon and other “conservatives”) not held accountable for their actions?” Answer: The elite and their puppets are not subjects of the rest of the laws that apply to the most of us. This is why the halls of congress and the White House are filled with lawyers with a few exceptions. From their point of view and the way the laws are written they are people and we are dumb animals to be used as slave labor. Thus the Personal Income Tax. \\n(Implied) “Why the double standard against men?” Answer: It is part of their sexist war on Men, especially “white,” heterosexual, conservative men who love the constitution and the Bible. Their religion of Militant Liberalism (supported by both parties) is the apex of Hypocrisy, Hate, Intolerance, and Ignorance. \\nAnd Oh the homosexual/lesbian/gender queer/gender identity crises agenda/insanity also just is another pawn in their game to destroy the few real Men left along with the concept of our current constitutional Republic based on protecting personal freedoms, privacy, and liberties. Gay Veteran \\nwhy don’t you explain that homosexual/lesbian/gender queer/gender identity crises agenda/insanity theShipIsSinking \\nNot that long ago businesses had the right to refuse service to anyone for any reason. Now we have whores like your friends who demand us bow and worship your idol the phallus. If we refuse service to your abomination called a “wedding” on the basis of our Biblical faith like good little liberal zombies your friends run to the state and have them file lawsuits against us. Your buddies in the socialist nations (what we are currently becoming) have even pushed the issue to the point of offending them is a crime under “hate speech laws” (more like outlawing speech they hate) with a prison term because they cannot stand to have your feelings “hurt.” \\nThis is still a constitutional republic. We still have freedom of religion and freedom of speech. We are not about to bow to the religion of Militant Liberalism and nor will we be silent about the apostasy that the reprobate are spreading across this nation. The Original Constitution was based on a very limited federal government and States Rights for a reason. So we could live in the land of freedom and opportunity with the people choosing the way they wish to be governed, Now we are at the whims of special interest groups and indoctrination systems (de-education and the media) desiring to stomp on the rights of the majority in the name of their idols called Diversity on a national level with a joke for representation. \\nDon’t worry, go vote for that whore Hitlery Clinton and she will be happy to give you a job exterminating any who refuses to worship the liberal agenda and her ideas for the new america where the original constitution For the United States ratified in 1788 is no more. Yes, that same constitution you swore to uphold. We have a Domestic Terrorist Enemy sitting in the WH and one running for the office of presidency and nobody is doing much at all. Do we need to call out the Oathkeepers to protect our citizen when going to political rallies such as in San Jose? I thank you for your service and I will remind you that the commies who seek the highest position in the land will not be so accepting of you if you are of a conservative mindset. Gay Veteran \\n“Not that long ago businesses had the right to refuse service to anyone for any reason….” \\nyeah, the days of Jim Crow \\n“…Now we have whores like your friends who demand us bow and worship your idol the phallus….” \\nwhat about lesbians, moron \\n“…If we refuse service to your abomination called a “wedding” on the basis of our Biblical faith like good little liberal zombies your friends run to the state and have them file lawsuits against us…..” \\nhow about the baker who oppose interracial marriages because of their Biblical faith? \\nbut I tell you what, simple solution: NO lawsuits but you put a sign in your store window saying “we do not serve ”. truth in advertising, you know \\n“…Your buddies in the socialist nations (what we are currently becoming) have even pushed the issue to the point of offending them is a crime under “hate speech laws” (more like outlawing speech they hate) with a prison term because they cannot stand to have your feelings “hurt.”…” \\nI have no “buddies” in socialist nations, and fully support the Bill of Rights. \\n“…Now we are at the whims of special interest groups….” \\npoor thing, I bet you miss saying ni**er too \\n“…Don’t worry, go vote for that whore Hitlery Clinton….” \\nshows what a moron you are by assuming I would vote for Killery, the war-mongering neo-con psychopath \\n“…Do we need to call out the Oathkeepers to protect our citizen when going to political rallies such as in San Jose?….” \\nprobably IF the police don’t do the job they’re PAID to do \\n“…I thank you for your service….” \\nthen you are a fool, I was a mere cog in the imperial war machine. \\nSTOP worshiping the military!!! Rastus \\n“I was a mere cog in the imperial war machine”. Then change your user name “veteran” if your not proud of your service. I was a veteran like some that post here but we don’t broadcast it like you deviants like to. theShipIsSinking \\nLiberalism (endorsed by both parties) is the apex of Hypocrisy, Hate, Intolerance and Ignorance. \\nThank you for your post and your service. Gay Veteran \\nwell junior, like I’m going to ask your permission for my screen name jack nichols \\nfaggots krinks \\nWatch ‘Last Week Tonight with John Oliver’ for the answers. At no way, no how are Democrats ever held accountable for anything. He may mention a few irrelevant congressional or state Dems but that is it. Obama never, Hillary never. This is standard procedure for the majority of media outlets. This why for an alternative opinion we are stuck with Talk Radio, whom i’ll never forgive for all the hate they gave The Donald. \\nMost people don’t have the intellectual wherewithal to seek another opinion to ensure what they see/read is not slanted/a lie. Hence people are pushed a certain direction and willingly go. iris \\nI think we’re plenty intelligent enough, but have been duped through social engineering via: Public schools are actually discouraging critical thinking, questioning, independence, in favor of blind acceptance and a herd mentality. Even many Christian churches are teaching this, often, unwittingly. The MSM also reinforces this daily inundation. Also, escapism is rampant in our society. It’s much easier to seek entertainment after a long day’s work, or a long day of no job at all, and the longer that habit is entrenched, the harder it is to break free from it. Not saying that enjoying life is bad, it’s very good, but so often, the acceptable forms of seeking thrills are destructive ones, in our culture. At the end of the day, we are each accountable for our lives, however. We can’t blame everything on the forces at work, whether it’s local or global. We can receive freedom, meaning, joy and empowerment in God. It’s a whole different paradigm. Rastus \\nWe are in a spiritual war that even most Christians do not understand. The powers, principalities and forces of darkness are on a full frontal attack. Get your spiritual house in order! theShipIsSinking \\nYes, and none of us knows when our time might be up! William Lutz \\nWell many Republicans are never held accountable for anything either. That is why I hate both parties. Both consist of greedy crony politicians who care about wealth and power, not us. They are not in office to serve the interests of ordinary Americans. \\nFurthermore, the two party system is outdated; we’ve had it for too long. Don’t you think it’s time to abolish it? That’s why I’m choosing a third party candidate this year. krinks \\nPLEASE! When a scandal hits you’d swear the Purp’s first name was Republican. When a scandal hits that involves Dem they never mention party, EVER. Not even on Faux News. theShipIsSinking \\nAll the Media Propaganda puppets serve the same masters along side the same agenda (Death or Enslavement for all) and this includes Faux News and many of the fake Alt Media whores like Alex Jones and David Icke. donjusko \\nTrump 2016 robert \\nSad to say Americans have been buying into nonsense and lies for a long, long time. The Clintons are just another sample of that along with the Bush dynasty, Obamacare, nation building, living on credit and debt etc. There is no end to what people will accept; at least enough people to put people into power. Here we go again. iris \\nYes. The kingdoms of this world will never change, until Christ’s return. And our votes may be getting hijacked, so we need to continue as individuals to look to God and do good, as He empowers us. Jodie Lynn Gaeta \\nI couldn’t care less about what some tell-all book says about Hillary. Her stance on Obamacare, illegal immigration, education, civil liberties, etc. is enough to have convinced me not to vote for her. iris \\nAgree. I don’t think she’s competent. Letfreedomring \\nAnyone else notice Hillary became the democratic nominee on 6/6/16 by winning California where the Satanists had a huge celebration today? loadnup \\nYup… D-Day all over again with a different twist,… watchmannonthewall \\nMichael, you’ve made a very appropriate connection between Athaliah and Hillary. Both Jezebel and Athaliah were in power when the nations of Israel and Judah were in apostasy! Isaiah writes that God gives women to lead and children to oppress us when He judges us. (Is. 3:12) \\nHillary’s history is one of stonewalling, deception, lies, false accusations, division, in-your-face, and you can fill in all the others. I’ve been getting updates from Judicial Watch for years on her activities and distain for our system of government and laws! \\nWhether she is elected or not, no doubt the fact she is where she is confirms how far the moral standards of the nation have fallen since Gary Hart dropped out of the presidential race after the affair he had with Donna Rice became known in 1987. Less than 10 years later the people of the nation didn’t give a rip about what extracurricular activities went on in the Oval Office, as long as the economy kept humming, and now many support evil Hillary! \\nI would say God help us, but I don’t think He is listening anymore, unless we say the right things! Abe \\nYou said a mouth full!! I just got a 60 page packet from Judicial Watch from stuff 3 months ago to get us where were at today. It’s not looking good for Broomhildary!I But she’s made of teflon! Hopefully like Gotti and this will be her end! I hope the people are awake! Or at least enough of them. The late 50’s to early 70’s was pure hell! I hoped never to go through that again. I can see it rearing it’s ugly head on the horizon, but will be worse because will have a total financial collapse along with it. get a clue \\nThe Bilderbergers pick who the next puppet is. The people of the nation don’t get what they want because we’re slaves to BANKERS! Shabaz101 \\nHey guys lets say you preferred Sanders over Hilary, now Hilary bags nomination, who is lesser evil as compared to the “Deranged DJ Trump” and his volatile unpredictable nature. loadnup \\nYou would be well served to listen to his presentation on international affairs…. he is not unpredictable. He is real and he says what we folks here in the daily trenches are seeing, feeling, living through. The man has done multiple acts of kindness for folks from vets, people who have lost their homes to other folks in need of expensive medical services. That tells me that his heart is in the right place as he never sought recognition for these hidden acts of mercy… iris \\nVOTE TRUMP Put The Benghazi Murderer In Jail !. afchief \\nIs Hillary a democrat? Then she is a compulsive liar. greanfinisher . \\nWhatever she is, I hope it’s not contagious. watchmannonthewall \\nIt is! Evil is very contgious! Many men do not want to discipline themselves. That is why so many voted for her and support her. And the media loves her! You know what little truth they tell the American public. Again, like mind joins to like kind! The broadness and depth of her support is clear evidence, to me, the nation is lost. There was a chance to right the ship 20 years ago if the leaders and public had insisted on integrity in the presidency, as they should have. Not now! Gay Veteran \\njust like any republican politician Patrick Grimes \\nComparing Hillary to Athaliah or Jezebel are both good fits. Both were murderous psychopaths and both had an insatable lust for power. I don’t see how anyone in their right mind could vote for this demonically controlled woman. In my view only those who are mentally challenged or mentally deranged or both would consider such a candidate. Rastus \\nTry demonically influenced or inhabited. It will make more sense. greanfinisher . \\n‘She was just really rude to almost everybody. She’d act like she didn’t want you around, like you were beneath her.’ That would fit the description of any aristocrat. After all, members of the oligarchy typically are rude, arrogant and do not associate with commoners. greanfinisher . \\nBest to simply sit out this rubber-stamped ‘election’. loadnup \\nAh, that’s a big NO…. by sitting out the election you are implying that you think hitlery and all her evil should be running this country…. no matter how much you may hate the establishment you are “duty” bound to vote, that is, make your tiny voice heard even if for just that one instant in time to say “No more” to the festering evil around us.. watchmannonthewall \\nSort of like “Horton Hears a Who”! That one little voice may make all the difference! greanfinisher . \\nI have no duty whatsoever to vote in a ‘rigged election’ (or should I say ‘purchased’?). All that I would be simply doing here is applying a rubber stamp on a candidate who was already pre-screened by the party’s political bosses. By the way, I’m hardly supporting the gun confiscatin’ Killary horror. Bill G Wilminton NC \\nIt’s a lost cause as his own party is backing the gun confiscatin’ racketeer. greanfinisher . \\nI think that a vote for either of those two clowns would be wrong. In fact, I would even go on to say that the Republican base is just as dissatisfied with Trump as the Democratic base is with Clinton. Why would the Democrats want to ‘elect’ a tyrant who would simply send more jobs to third world sweat shops, confiscate all firearms, tax the daylights out of the middle class, impose martial law, launch more wars, increase the national debt even further and create more havoc in the land? Don’t blame the Democrats as they didn’t ask for that lyin’ witch. Of course, the Republicans have their own issues with Trump as well. JB \\nI thought the parallels to Athaliah in 2 Kings was interesting. Again, “there’s nothing new under the sun.” A lot of folks are putting their trust in Donald Trump, but if the Lord’s hand is indeed involved in this and we (as a nation) are being judged, she may very well end up becoming our next leader; one can’t go against the will of God. It’s horrifying to read even a smidgeon of what she may have said and done in the past, yet the church continues to walk in the flesh, seemingly more interested in building larger buildings, generating funds, social programs, welcoming committees and welcoming non Christians into their congregations, embracing false teachers and false doctrines – in a word, a climate of apostacy, just as it was in Judah under King Jehoram. The only way out of this is if “my people” (the church) repents, seeks His face, chooses to walk in the Spirit, and seeks revival/ times of refreshing – and leaves it up to the Lord to “heal their land.” iris \\nI hope by your saying welcoming non Christians into congregations, you’re referring to membership. Many people who stumble into churches, being afraid, confused, or truly seeking God, hear the gospel there, and find new life in Christ Jesus. But I so agree, if you meant membership. There are plenty of “Christian” pastors and priests in certain denominations, which have stated that they either don’t believe in God, or that their belief system is so inclusive as to deny the efficacy of Christ’s finished work on the Cross as the only way of salvation. \\nThis is an aside, but   licentiousness and legalism are the two sides of one coin. Rastus \\nPlease, briefly explain your aside. iris \\nWell, here’s an example. After coming to faith in college, I stumbled into a church which believed the whole Bible was inspired, and the final authority, which I was glad to hear, (and still believe) and got immediately involved. 3 years into that denomination, and in one of their Bible colleges, I realized that they were almost completely legalistic, and that this was definitely not how I first knew Jesus Christ. I left church altogether for a few years, (not Jesus, but was leery of church at that point). God helped me through that time, and I started going back to church, but never that denomination again. It has been 35? years since I had dealings with it, but in reading about them now, one would never recognize them, as they have changed their positions on several major fronts, but again, from a man-centered perspective, and now are quite liberal in certain areas, and not in a good way. I think this change has been about money and church growth. \\nI don’t think legalists realize their hypocrisy, and usually mean well, but it’s grace + nothing, for me. He who began a good work in me will be faithful to complete it until the day of the Lord Jesus, Philippians 1:6. My hope is in Him, and not in myself. The more I walk that way, the same way i was walking in Christ at first, the more joy, peace, love and righteousness come from my life. But the opposite happens when I revert back to the old nature of earning, proving, appearances, etc., and the ways and things of the world seem to present a stronger temptation for me. \\nI think the move towards practicing contemplative meditation, also known as “holy yoga” in Christian circles, might be an expected outcome for someone who has subscribed to the grace + works doctrines. Imo, that is another work, according to what I’ve heard some of them say. They are trying to grow spiritually, get closer to God through this “practice”, rather than resting in faith in Christ alone, and His finished work on the Cross. iris \\nThere’s a good book on the subject of spiritual abuse, by Jeff VanVonderen, a Christian counselor and former pastor. The Subtle Power of Spiritual Abuse. He’s also written other books, one on breaking free from substance addiction, and is a recovered addict, himself. He has a lot of humor, humility and logic and is good about showing the contrast between grace and faith vs works and sin. \\n  as we walk in faith, we will be keeping the Law, but that it can’t happen the other way around. \\nGod bless, and thanks for asking! loadnup \\n“”Just as it was in the days of Noah, so also will it be in the days of the Son of Man.” Between the truth that “Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear,” and the throngs clambering for more bread and circus who have nothing to do with any organized religion (not that all those who attend church have an abiding faith in the one Triune God) we are surrounded by the abomination of a kind of desolation that brings destruction to our very doors…. pray, prep and protect. carson \\nif their putting their trust in don trump…then jeremiah 17:5…?….!! watchmannonthewall \\nGreat verse! One of my favorites. Wish many Christians would consider the message. A parallel verse is Hosea 5:11. Both say the same thing, but in different words! carson \\nyeah I wish they would too. God’s word is a lamp to the feet the light to the path…but instead many would rather listen to what men say. watchmannonthewall \\nI recently read somewhere that spending on religious construction was up nearly 10%. I believe it was from year ago figures but possibly just in the last month. Nonetheless, I thought it rather interesting considering all of the confusion about the economy. chriscas \\nAnd the witch just clinched the nomination! I guess I’m going to have to roll the dice on Trump this November…. loadnup \\nI don’t even consider it “rolling the dice.” The whore/horror that she is is so revolting to me that when I “accidently” see a picture of her the satanic refection on her face nauseates me to the point of guttural revolt… anyway, the Donald is who I will be voting for and promoting to any with “ears to hear.” Pray, prep and protect. Bill G Wilminton NC \\nVote Trump send the Hildebeast to Jail !. Gay Veteran \\noh Bill, you’ll end up as disappointed as the few Obama voters who finally woke up! NO one who would actually threaten TPTB gets to the top of the political heap in AmeriKa Bill G Wilminton NC \\nTPTB thru main stream media have been attacking Trump since he began the Repub primary race. But something happened “the people” love what he SAYS and figured out that Trump speaks for “We the People” \\nTPTB are still attacking Trump that makes me believe that Trump is for real or maybe in a different faction of TPTB. ….his plans are definitely not NWO congruent and the ” repub establishment” are crapping in their pants….ha ha what a show \\nMy belief is that Trump is for real and the 60 million disenfranchised voters that did not vote in the last election are going to landslide Trump over Hillary….LANDSLIDE. \\nVote Trump \\nthe fact that Trump is alive shows that TPTB do not fear him Bill G Wilminton NC \\nThey TPTB believed that we are all sheeple forever…..and when Trump first came on the scene just laughed….but the “sheeple” are pissed, mad, angry, and “not taking it anymore” and exhuberantly supporting Trump \\nI pray for the safety of Mr Trump !. A.S. \\nNow it makes perfect sense why Bill had so many mistresses. He was NOT getting any love and attention at home, from his own wife, so why not look elsewhere to fill the void. greanfinisher . \\nThat racketeerin’ wench even makes the Wicked Witch of the West seem adorable by comparison. RageHard84 \\nYou could be right. DJohn1 \\nI seldom see you commit yourself anymore when it comes to politics. That is what makes this article so unusual. I changed political parties this election. I have been in the past a Democrat. No more. I guess the major question will be who is likely to do the least amount of damage if elected. So far Donald Trump may be the person who will do the least amount of damage though not by much. Hillary will lead us right into world war III if I am right. Bernie is likely to bankrupt what is left of this country with socialism. Trump might actually straighten up and fly right with the team he puts together. Then there is the great unknown. Meaning the people that become vice presidents. Never forget we are one heart beat away from that person taking office. I think I would look real close this election to whomever is appointed as the vice candidate. I think what scares people the most is the archie bunkerisms that Donald has spouted. We are at the end of an age. The new age being born will happen in January. Remember one thing. Donald Trump has accomplished more with less money than any candidate in history. That is a form of genius. I have been in voted office before. I was one of the most successful people at it that there was in a very small pond. The only reason I succeeded was I was dead honest about everything. I prayed a lot. Secretly for the most part. I wasn’t ashamed. I simply followed scripture. The other reason was the good Lord showed me what to do. He helped me pick a really good team to back me up. And that is what I hope Donald will do. Pick a really good team. And when things go down the toilet in a hurry. I suggest you go somewhere quiet and ask God what to do. Never advertise it. That is a form of using God. He doesn’t like that. I can think of at least 5 times when things looked hopeless and God made it come back and I won. And that is what it will take given the circumstances we find ourselves facing after the next election. None of the current people running have done that much. IF Donald picks a good team and wins then it will come out whether or not he is the leader I think he may be. The most likely thing that will happen is Bernie Sanders will become President because Hillary will go to jail. If Donald does win, that will be a minor miracle in itself. Because the electorial college is likely to elect a democrat. Gay Veteran \\nKillary is a known warmonger, Trump isn’t. want war with Russia? vote for the HildeBeast Tatiana Covington \\nWait long enough, and the same old same old archetypes *will* recur. Laws of chance guarantee it, same as with dice. iris \\nSounds like that church you refer to fell for the Willowcreek church growth model. Those leaders who buy into that, buy into the consensus based, compromise based, business oriented method of attracting new members, and was the brainchild of Peter Drucker, who recommended using the Hegelian dialectic to accomplish goals in churches. He wasn’t a Christian, but identified as a Communitarian. I really think that model is actually about dismantling orthodox Christianity. In fact, have read direct quotes from some of the “mega” pastors, stating that “pillars of the church? Yeah, those are just the folks who are holding things up”, and that same person called those believers in existing churches who didn’t want to go along with the new way of doing things, so later, left, “blessed subtractions”. Every current or former Willowcreek affiliated church I’ve seen, has left a wake of spiritual destruction. It’s one thing to love people and point them to Jesus’ grace, quite another to dilute or even scoff at absolute and Biblical truths. watchmannonthewall \\nThank you for your thoughts on the matter and additional information. I never paid much attention to the mega churches until recently but do remember in the early 90’s our former pastor being invited to Willowcreek for a conference. I understood he turned it down but seems that somehow he must have gained access to their program(s). I do know that later the children’s ministry leaders all attended conferences there. Also know that later, his relatives, graduates from ORU were invited to speak and come on staff at JO’s church in Houston where afterwards they were taken to a back room and had their presentation critiqued to improve performance by focusing on their ability to connect with the audience. Not sure what the definition of “Communitarian” is, but seems this might be an aspect of it. Very interesting! I will say that they all began deeply committed to the Lord, but don’t think they know, as with so many others, it is no longer commitment the way the Lord says one must approach Him. “Now the serpent was more subtle than any beast of the field.” Paul spoke of how he did not use enticing words for his audiences but simply declared the good news of Jesus Christ, in power. The Holy Spirit then moves as He wills. Today the leaven has permeated the loaf. iris \\nYep. Communitarian is a word to describe a blending of Communism and Humanitarian. So I assume Drucker was saying he was a loving humanist with communist leanings. Yes, too, to what you mentioned above. We were in a church for 9 years, which was in line with the fellowship they identified as, when we started. Within a few years, the incremental changes were noticeable, and since I was involved with a couple of ministries there, I found out the last year we were there, by accident, that they had been a Willowcreek church for 17 of their then 25 years of existence. The leadership had never told the “underlings”, and left the fellowship’s logo on the street sign. I guess a lot of folks felt as we did, as their 20,000 names on the books, anyway, dropped by about half, within a year or so. Ten years since we left now; that church is no longer Willowcreek and getting back to its roots, but damage was done, and powerful factions in that mega church are still involved and on the board. This is what you get when you try to mix the mindset and ways of the world with the walk of faith. Oil and water don’t mix though, so sadly, the intention of the WC model was effective for years. So many churches have succumbed. watchmannonthewall \\nI want to let you know how thankful I am for what you shared. My father was a founding member of the church, before the current pastor came, and I was deeply involved until some nasty things were said. I deliberately stepped back so as to let them do what they, pastor and wife, wanted. I never understood why things happened the way they did, but now that you have added some detail I can finally understand what actually went on. I’m thankful God protected me from the deception and moved me into the walk I now have. Good word! iris \\nPraise God, He saw that your heart was for Him and protected you, even though it was painful. A good book about what’s happened is titled, Deceived on Purpose, by Warren Smith. I’ve had my share of “friendly fire”, too, but then, it can be just as bad or worse, outside of the body of Christ. I do think our “body” is very sick and suffering, though. Seniorsquadldr \\nToo late! America has demanded it’s destruction. America has called on Satan to destroy America, the Establishment has heard their cries, Satan has heard their cries. The lake of fire is going to be full of Americans. Repent and believe in the gospel. Jesus hears the cries of the faithful, born again believer. The born again believer will be spared the second death and the eternity of the eternal burning fire that does not consume. iris \\nAmen. We can still seek His face as individuals, and He will save those of us who do. It doesn’t mean we won’t suffer or die here, but here is only temporary, and we’ll go from here to There with Him forever. Mart1963 \\nIt seems when The US has a queen enthroned then the great city of Babylon (New York city will be destroyed). This city is described in the Bible as the city that rules over the kings of the world (UN building is located in New York city) and their is a woman holding a cup witht he filth of her abominations coming out of it (Statue of Liberty and the flaming cup). \\nIf she become president then I suggest all God’s people move out of that city. If New York city is destroyed then move out of the US because of the soon to be incoming destruction. \\nRevelation 18:4-8New International Version (NIV) \\nWarning to Escape Babylon’s Judgment \\n4 Then I heard another voice from heaven say: “‘Come out of her, my people,’ so that you will not share in her sins, so that you will not receive any of her plagues; 5 for her sins are piled up to heaven, and God has remembered her crimes. 6 Give back to her as she has given; pay her back double for what she has done. Pour her a double portion from her own cup. 7 Give her as much torment and grief as the glory and luxury she gave herself. In her heart she boasts, ‘I sit enthroned as queen. I am not a widow; I will never mourn.’ 8 Therefore in one day her plagues will overtake her: death, mourning and famine. She will be consumed by fire, for mighty is the Lord God who judges her. Gay Veteran \\nbilge James Staten \\nHe also should have added these Scriptures. Jeremiah 50-51, Revelation 17-18, portions of Isaiah 13-18 and Isaiah 47. In Jeremiah 50-51 it states the nation being destroyed is the Hammer of the whole earth and she is cut asunder and broken. My understanding is this is an idiom for the Policeman of the world. She is destroyed in a surprise attack. There is also a phrase the Hindermost of the nations and Rabbis for centuries have understood this to be a young nation compared to the other nations of the world, an end time nation, the last of the great nations. She sits on many waters, she is a mingled people from her beginning, she is rich beyond measure, the economic engine for the world, the consumer nation of the world, and she has a large Jewish population. In the Revelation area of Scripture it describes that in “One Hour’s Time” great riches come to nothing. If America is being described she is destroyed in a surprise attack? One would be hard pressed to read these passages and not think this sounds like America? There are dozens of characteristics. This is the short version!!! Your only hope is 1st Corinthians 15:1-4 iris \\nThank you, that’s a lot of evidence. It’s looking, walking and quacking like it’s a duck, isn’t it? God bless and take care. James Staten \\nIris, I have been looking at this for over 20 years, and as we move toward Rosh Hashanah every year, I start looking up. Many bible scholars seem to believe this attack takes place around Tishri 1 on the Jewish calendar? I would hope not, BUT. Blessings, James iris \\nI agree. Although Jesus said that we can’t know the exact day or hour, He also told us to be looking for the signs of the end of the age. In May of 2018, the reinstated nation of Israel will be 70 years old, and the fig tree has always been a symbol of Israel in the Bible. Jesus said when the fig tree blossoms in the end times (He talks about this period in 3 of the 4 gospels), those of that generation will see the end of history as we know it now. Also, all of the feasts and prophecies to do with the earthly ministry of Messiah until His return, have had fulfillment in Christ’s birth, ministry, death, resurrection and Pentecost (Shavuot). The Feast of Tents, Rosh Hashanah and Yom Kippur are still outstanding, and I think it’s highly probably that He’ll return on one of the days associated, especially Rosh Hashanah, since there is more than one shofar sounding. The last trumpet for that one is supposed to be the long one (the last trump Paul was referring to?). \\nOf course, some other things have to happen first, but the way things are moving, I wouldn’t be surprised if His return is very soon. Only Yeshua of Bethlehem will be able to split the Mt. of Olives when He returns. If I’m still here by then, I’ll know that it is Him when that happens. I also think some of these end time signs may have happened under the table and just haven’t come to light, yet. \\nI read a note by a Christian mathematician (math people get it about incredible odds), who had calculated out something about fulfilled prophecy. He said that if just 8 of the over 300 prophecies regarding Messiah which Jesus has already fulfilled, could be illustrated, it would be the same as blindfolding a person, covering the entire state of Texas with a layer of quarters, marking one of them, and expecting the person to pick up the marked quarter on the first try! There are only several prophecies about Messiah which Jesus hasn’t fulfilled, and those all pertain to His second coming, thousand year reign and the great white throne judgement. \\nGod bless you, too! James Staten \\nIris..I do believe we are on the same page. I saw an article within the last hour that showed an Emmy type presentation recently for Abortionist, with an actor and actress presenting awards…Lord have mercy…Keep Looking Up James Staten \\nGV…Let me add another few thoughts with the tragic news coming out of Florida. The Bible says that Satan comes to kill, steal and destroy. In the line of my previous comments dealing with America. There was a Pastor R A Coombes who wrote a book that many feel is a classic in the area of America the Babylon. He and I exchanged a few e-mails before he went home to be with the Lord. The last several months of his life he studied a particular area of scripture in Jeremiah 51:12. ..the Lord will send foreigners to Babylon before the day of her calamity…they will be Fanners and Winnowers who will stir up strife, and do everything to devastate the land before her Judgment. Satan hates Christians and Gays. He is an equal opportunity employer. I find it ironic that just four miles from the Pulse Nightclub, just a day or so ago a young 22 year old Christian singer was gunned down for her strong faith. More food for thought!!!! iris \\nCould well be NYC, and yes, the UN is headquartered here. It looks more and more to me, like it might be the U.S. itself, but possibly the EU, or perhaps the whole global system. Things have changed drastically around the world in the last few decades. God bless. Gay Veteran \\nodd article, not a word about her being a neo-con warmongering psychopath. \\nwhen CBS interviewed her, she was asked about the death of Libyan dictator Moammar Khadafi. Her response? “We came, we saw, he died, hee, hee, hee”. She should have been put into a straightjacket and taken to the nearest mental hospital Gay Veteran \\nwell, well, well, war criminal loving Azazel is back with his bilge gogenhouser \\nIt is inconceivable that a grown man could support slick hellarrhoid, someone so wicked, so vile. Heathens, reprobates and blood suckers, they call themselves democrats. More like demoncrat. These are the people that support slick hellarrhoid. Demoncrats are without morals they are without standards ProclaimingGodsTruth \\nThis is what happens when a nation so richly blessed by Almighty God has dumped HIM in favor of evil and wickedness, idols and Baal worship. \\nExamine our presidents and leaders over the past years – not too good where they. \\nAmerica is getting who America deserves! Without God at the helm of America we’ve had it, finished! And … you can see this happening all over and everywhere – economy, financial, our now a “mixed” military, crime, societal, trade, EBT recipients, weather, drought, etc. \\nBottom-line: Unless this nation repents from the top down, I believe America as the great nation and superpower it once was is finished. \\nExample from OT – Ancient Nineveh; the Prophet Nahum went there and preached repentance. They told him to get lost! Nineveh was destroyed approx 50 yrs later. Think God’s kidding … think again! lonebear \\nShe is the epitome of evil. You can see it written all over her face. I can hardly stand to look at her Preacher62 \\nCasting pearls before swine is definitely condemned. watchmannonthewall \\nPerhaps the division of the nation is simply a picture of what the leaders of this nation have tried to do to Israel, and many people either support them or stand aside? Do unto others as you would have them do unto you. Does God live by His own rules? \\nRecall that the scripture mentions at least twice, the kings of the Medes were bound to abide by their own Law. Darias had to throw Daniel into the lions den and Esther’s husband could NOT revoke the decree issued to Haman to to allow his wife’s enemies to attempt to take her peoples’ lives. He had to issue a second decree to allow them the right to oppose their enemies and fight for their own lives. \\nThese points are in scripture because God wants us to know how He works. Not one word will return void! Gay Veteran \\nyou Israel Firsters need to send YOUR money to Israel watchmannonthewall \\nYou simply do not understand: The Israel we speak of is not the one you see or know. Gay Veteran \\nthe land is soaked with the blood of the children and babies your “god” ordered murdered watchmannonthewall \\nIf one actually reads and understands scripture, one would know that it is precisely because the children of Israel did NOT do what you are accusing them of, i.e., they refused to obey God, that the events in the Middle East over these past few years and those in FL this weekend occurred. You might want to go back and study the scripture a bit deeper. He did say to do what you said, but they didn’t! Now maybe some will finally figure out why He said to do it and be more inclined to obedience rather than to think they need to correct Him. BTW- I’m pretty sure that less than the 58 million babies who have been aborted over the last 40 years were killed then during the <7 years of war that took place until Joshua passed on. There probably weren't 20 million people in the entire ME then. Are you as incensed over the murder and bloodshed of these babies as what you think happened 3400 years ago, or do you have a different agenda? iris\""}, "time": 1742561960.7693386}