{"duration": 2.193741798400879, "input_args": {"text": "'Following is a transcript of   Donald J. Trump’s interview on Tuesday with reporters, editors and opinion columnists from The New York Times. The transcription was prepared by Liam Stack, Jonah Engel Bromwich, Karen Workman and Tim Herrera of The Times. More on the Trump transition here. ARTHUR SULZBERGER Jr. publisher of The New York Times: Thank you very much for joining us. And I want to reaffirm this is on the record. DONALD J. TRUMP,   of the United States: O. K. SULZBERGER: All right, so we’re clear. We had a very nice meeting in the Churchill Room. You’re a Churchill fan, I hear? TRUMP: I am, I am. SULZBERGER: There’s a photo of the great man behind you. TRUMP: There was a big thing about the bust that was removed out of the Oval Office. SULZBERGER: I heard you’re thinking of putting it back. TRUMP: I am, indeed. I am. SULZBERGER: Wonderful. So we’ve got a good collection here from our newsroom and editorial and our columnists. I just want to say we had a good, quiet, but useful and   conversation in there. So I appreciate that very much. TRUMP: I appreciate it, too. SULZBERGER: I thought maybe I’d start this off by asking if you have anything you would like to start this off with before we move to the easiest questions you’re going to get this administration. [laughter] TRUMP: O. K. Well, I just appreciate the meeting and I have great respect for The New York Times. Tremendous respect. It’s very special. Always has been very special. I think I’ve been treated very rough. It’s well out there that I’ve been treated extremely unfairly in a sense, in a true sense. I wouldn’t only complain about The Times. I would say The Times was about the roughest of all. You could make the case The Washington Post was bad, but every once in a while I’d actually get a good article. Not often, Dean, but every once in awhile. Look, I have great respect for The Times, and I’d like to turn it around. I think it would make the job I am doing much easier. We’re working very hard. We have great people coming in. I think you’ll be very impressed with the names. We’ll be announcing some very shortly. Everybody wanted to do this. People are giving up tremendous careers in order to be subject to you folks and subject to a lot of other folks. But they’re giving up a lot. I mean some are giving up tremendous businesses in order to sit for four or maybe eight or whatever the period of time is. But I think we’re going to see some tremendous talent, tremendous talent coming in. We have many people for every job. I mean no matter what the job is, we have many incredible people. I think, Reince, you can sort of just confirm that. The quality of the people is very good. REINCE PRIEBUS, Mr. Trump’s choice for chief of staff: [inaudible] TRUMP: We’re trying very hard to get the best people. Not necessarily people that will be the most politically correct people, because that hasn’t been working. So we have really experts in the field. Some are known and some are not known, but they’re known within their field as being the best. That’s very important to me. You know, I’ve been given a great honor. It’s been very tough. It’s been 18 months of brutality in a true sense, but we won it. We won it pretty big. The final numbers are coming out. Or I guess they’re coming out. Michigan’s just being confirmed. But the numbers are coming out far beyond what anybody’s wildest expectation was. I don’t know if it was us, I mean, we were seeing the kind of crowds and kind of, everything, the kind of enthusiasm we were getting from the people. As you probably know, I did many, many speeches that last   period. I was just telling Arthur that I went around and did speeches in the pretty much 11 different places, that were, the massive crowds we were getting. If we had a stadium that held  —   and most of you, many of you were there  —   that held 20, 000 people, we’d have 15, 000 people outside that couldn’t get in. So we came up with a good system  —   we put up the big screens outside with a very good loudspeaker system and very few people left. I would do, during the last month, two or three a day. That’s a lot. Because that’s not easy when you have big crowds. Those speeches, that’s not an easy way of life, doing three a day. Then I said the last two days, I want to do six and seven. And I’m not sure anybody has ever done that. But we did six and we did seven and the last one ended at 1 o’clock in the morning in Michigan. And we had 31, 000 people, 17, 000 or 18, 000 inside and the rest outside. This massive place in Grand Rapids, I guess. And it was an incredible thing. And I left saying: ‘How do we lose Michigan? I don’t think we can lose Michigan.’ And the reason I did that, it was set up only a little while before  —   because we heard that day that Hillary was hearing that they’re going to lose Michigan, which hasn’t been lost in 38 years. Or something. But 38 years. And they didn’t want to lose Michigan. So they went out along with President Obama and Michelle, Bill and Hillary, they went to Michigan late that, sort of late afternoon and I said, ‘Let’s go to Michigan.’ It wasn’t on the schedule. So I finished up in New Hampshire and at 10 o’clock I went to Michigan. We got there at 12 o’clock. We started speaking around 12:45, actually, and we had 31, 000 people and I said, really, I mean, there are things happening. But we saw it everywhere. So we felt very good. we had great numbers. And we thought we’re going to win. We thought we were going to win Florida. We thought we were going to win North Carolina. We did easily, pretty easily. We thought strongly we were going to win Pennsylvania. The problem is nobody had won it and it was known, as you know, the great state that always got away. Every Republican thought they were going to win Pennsylvania for 38 years and they just couldn’t win it. And I thought we were going to win it. And we won it, we won it, you know, relatively easily, we won it by a number of points. Florida we won by 180, 000  —   was that the number, 180? PRIEBUS: [inaudible] TRUMP: More than 180, 000 voted, and votes are still coming in from the military, which we are getting about 85 percent of. So we won that by a lot of votes and, you know, we had a great victory. We had a great victory. I think it would have been easier because I see every once in awhile somebody says, ‘Well, the popular vote.’ Well, the popular vote would have been a lot easier, but it’s a whole different campaign. I would have been in California, I would have been in Texas, Florida and New York, and we wouldn’t have gone anywhere else. Which is, I mean I’d rather do the popular vote from the standpoint  —   I’d think we’d do actually as well or better  —   it’s a whole different campaign. It’s like, if you’re a golfer, it’s like match play versus stroke play. It’s a whole different game. But I think the popular vote would have been easier in a true sense because you’d go to a few places. I think that’s the genius of the Electoral College. I was never a fan of the Electoral College until now. SULZBERGER: Until now. [laughter] TRUMP: Until now. I guess now I like it for two reasons. What it does do is it gets you out to see states that you’ll never see otherwise. It’s very interesting. Like Maine. I went to Maine four times. I went to Maine 2 for one, because everybody was saying you can get to 269 but there is no path to 270. We learned that was false because we ended up with what,  . PRIEBUS: I’ve got to get, we’ve got to get Michigan in. TRUMP: But there is no path to 270, you have to get the one in Maine, so we kept going back to Maine and we did get the one in Maine. We kept going to Maine 2, and we went to a lot of states that you wouldn’t spend a lot of time in and it does get you  —   we actually went to about 22 states, whereas if you’re going for popular vote, you’d probably go to four, or three, it could be three. You wouldn’t leave New York. You’d stay in New York and you’d stay in California. So there’s a certain genius about it. And I like it either way. But it’s sort of interesting. But we had an amazing period of time. I got to know the country, we have a great country, we’re a great, great people, and the enthusiasm was really incredible. The Los Angeles Times had a poll which was interesting because I was always up in that poll. They had something that is, I guess, a   technique in polling, it was called enthusiasm. They added an enthusiasm factor and my people had great enthusiasm, and Hillary’s people didn’t have enthusiasm. And in the end she didn’t get the   vote and we ended up close to 15 points, as you know. We started off at one, we ended up with almost 15. And more importantly, a lot of people didn’t show up, because the   community liked me. They liked what I was saying. So they didn’t necessarily vote for me, but they didn’t show up, which was a big problem that she had. I ended up doing very well with women, which was  —   which I never understood why I was doing poorly, because we’d go to the rallies and we’d have so many women holding up signs, “Women for Trump. ” But I kept reading polls saying that I’m not doing well with women. I think whoever is doing it here would say that we did very well with women, especially certain women. DEAN BAQUET, executive editor of The New York Times: As you describe it, you did do something really remarkable. You energized a lot of people in the country who really wanted change in Washington. But along with that  —   and this is going to create a tricky thing for you  —   you also energized presumably a smaller number of people who were evidenced at the   convention in Washington this weekend. Who have a very   …     TRUMP: I just saw that today. BAQUET: So, I’d love to hear you talk about how you’re going to manage that group of people who actually may not be the larger group but who have an expectation for you and are angry about the country and its  —   along racial lines. My first question is, do you feel like you said things that energized them in particular, and how are you going to manage that? TRUMP: I don’t think so, Dean. First of all, I don’t want to energize the group. I’m not looking to energize them. I don’t want to energize the group, and I disavow the group. They, again, I don’t know if it’s reporting or whatever. I don’t know where they were four years ago, and where they were for Romney and McCain and all of the other people that ran, so I just don’t know, I had nothing to compare it to. But it’s not a group I want to energize, and if they are energized I want to look into it and find out why. What we do want to do is we want to bring the country together, because the country is very, very divided, and that’s one thing I did see, big league. It’s very, very divided, and I’m going to work very hard to bring the country together. I mean, I’m somebody that really has gotten along with people over the years. It was interesting, my wife, I went to a big event about two years ago. Just after I started thinking about politics. And we’re walking in and some people were cheering and some people were booing, and she said, you know, ‘People have never booed for you.’ I’ve never had a person boo me, and all of a sudden people are booing me. She said, that’s never happened before. And, it’s politics. You know, all of a sudden they think I’m going to be running for office, and I’m a Republican, let’s say. So it’s something that I had never experienced before and I said, ‘Those people are booing,’ and she said, ‘Yup.’ They’d never booed before. But now they boo. You know, it was a group and another group was going the opposite. No, I want to bring the country together. It’s very important to me. We’re in a very divided country. In many ways divided. BAQUET: So I’m going to do that thing that executive editors get to do which is to invite reporters to jump in and ask questions. MAGGIE HABERMAN, political reporter: I’ll start, thank you, Dean. Mr. President, I’d like to thank you for being here. This morning, Kellyanne Conway talked about not prosecuting Hillary Clinton. We were hoping you could talk about exactly what that means  —   does that mean just the emails, or the emails and the foundation, and how you came to that decision. TRUMP: Well, there was a report that somebody said that I’m not enthused about it. Look, I want to move forward, I don’t want to move back. And I don’t want to hurt the Clintons. I really don’t. She went through a lot. And suffered greatly in many different ways. And I am not looking to hurt them at all. The campaign was vicious. They say it was the most vicious primary and the most vicious campaign. I guess, added together, it was definitely the most vicious probably, I assume you sold a lot of newspapers. [laughter] I would imagine. I would imagine. I’m just telling you, Maggie, I’m not looking to hurt them. I think they’ve been through a lot. They’ve gone through a lot. I’m really looking   …     I think we have to get the focus of the country into looking forward. SULZBERGER: If I could interject, we had a good conversation there, you and I, and it was off the record, but there was nothing secret, just wanted to make sure. The idea of looking forward was one of the themes that you were saying. That we need to now get past the election, right? MATTHEW PURDY, deputy managing editor: So you’re definitively taking that off the table? The investigation? TRUMP: No, but the question was asked. PURDY: About the emails and the foundation? TRUMP: No, no, but it’s just not something that I feel very strongly about. I feel very strongly about health care. I feel very strongly about an immigration bill that I think even the people in this room can be happy. You know, you’ve been talking about immigration bills for 50 years and nothing’s ever happened. I feel very strongly about an immigration bill that’s fair and just and a lot of other things. There are a lot of things I feel strongly about. I’m not looking to look back and go through this. This was a very painful period. This was a very painful election with all of the email things and all of the foundation things and all of the everything that they went through and the whole country went through. This was a very painful period of time. I read recently where it was, it was, they’re saying, they used to say it was Lincoln against whoever and none of us were there to see it. And there aren’t a lot of recordings of that, right? [laughter] But the fact is that there were some pretty vicious elections they say this was, this was the most. They say it was definitely the most vicious primary. And I think it’s very important to look forward. CAROLYN RYAN, senior editor for politics: Do you think it would disappoint your supporters who seemed very animated by the idea of accountability in the Clintons? What would you say to them? TRUMP: I don’t think they will be disappointed. I think I will explain it, that we have to, in many ways save our country. Because our country’s really in bad, big trouble. We have a lot of trouble. A lot of problems. And one of the big problems, I talk about, divisiveness. I think that a lot of people will appreciate   …     I’m not doing it for that reason. I’m doing it because it’s time to go in a different direction. There was a lot of pain, and I think that the people that supported me with such enthusiasm, where they will show up at 1 in the morning to hear a speech. It was actually Election Day, they showed up at, so that was essentially Election Day. Yeah, I think they’d understand very completely. THOMAS L. FRIEDMAN, opinion columnist: Mr.   can I ask a question? One of the issues that you actually were very careful not to speak about during the campaign, and haven’t spoken about yet, is one very near and dear to my heart, the whole issue of climate change, the Paris agreement, how you’ll approach it. You own some of the most beautiful links golf courses in the world   …     [laughter, cross talk] TRUMP: [laughing] I read your article. Some will be even better because actually like Doral is a little bit off   …     so it’ll be perfect. [inaudible] He doesn’t say that. He just says that the ones that are near the water will be gone, but Doral will be in great shape. [laughter] FRIEDMAN: But it’s really important to me, and I think to a lot of our readers, to know where you’re going to go with this. I don’t think anyone objects to, you know, doing all forms of energy. But are you going to take America out of the world’s lead of confronting climate change? TRUMP: I’m looking at it very closely, Tom. I’ll tell you what. I have an open mind to it. We’re going to look very carefully. It’s one issue that’s interesting because there are few things where there’s more division than climate change. You don’t tend to hear this, but there are people on the other side of that issue who are, think, don’t even   …     SULZBERGER: We do hear it. FRIEDMAN: I was on ‘Squawk Box’ with Joe Kernen this morning, so I got an earful of it. [laughter] TRUMP: Joe is one of them. But a lot of smart people disagree with you. I have a very open mind. And I’m going to study a lot of the things that happened on it and we’re going to look at it very carefully. But I have an open mind. SULZBERGER: Well, since we’re living on an island, sir, I want to thank you for having an open mind. We saw what these storms are now doing, right? We’ve seen it personally. Straight up. FRIEDMAN: But you have an open mind on this? TRUMP: I do have an open mind. And we’ve had storms always, Arthur. SULZBERGER: Not like this. TRUMP: You know the hottest day ever was in   98. You know, you can make lots of cases for different views. I have a totally open mind. My uncle was for 35 years a professor at M. I. T. He was a great engineer, scientist. He was a great guy. And he was   …     a long time ago, he had feelings  —   this was a long time ago  —   he had feelings on this subject. It’s a very complex subject. I’m not sure anybody is ever going to really know. I know we have, they say they have science on one side but then they also have those horrible emails that were sent between the scientists. Where was that, in Geneva or wherever five years ago? Terrible. Where they got caught, you know, so you see that and you say, what’s this all about. I absolutely have an open mind. I will tell you this: Clean air is vitally important. Clean water, crystal clean water is vitally important. Safety is vitally important. And you know, you mentioned a lot of the courses. I have some great, great, very successful golf courses. I’ve received so many environmental awards for the way I’ve done, you know. I’ve done a tremendous amount of work where I’ve received tremendous numbers. Sometimes I’ll say I’m actually an environmentalist and people will smile in some cases and other people that know me understand that’s true. Open mind. JAMES BENNET, editorial page editor: When you say an open mind, you mean you’re just not sure whether human activity causes climate change? Do you think human activity is or isn’t connected? TRUMP: I think right now   …     well, I think there is some connectivity. There is some, something. It depends on how much. It also depends on how much it’s going to cost our companies. You have to understand, our companies are noncompetitive right now. They’re really largely noncompetitive. About four weeks ago, I started adding a certain little sentence into a lot of my speeches, that we’ve lost 70, 000 factories since W. Bush. 70, 000. When I first looked at the number, I said: ‘That must be a typo. It can’t be 70, you can’t have 70, 000, you wouldn’t think you have 70, 000 factories here.’ And it wasn’t a typo, it’s right. We’ve lost 70, 000 factories. We’re not a competitive nation with other nations anymore. We have to make ourselves competitive. We’re not competitive for a lot of reasons. That’s becoming more and more of the reason. Because a lot of these countries that we do business with, they make deals with our president, or whoever, and then they don’t adhere to the deals, you know that. And it’s much less expensive for their companies to produce products. So I’m going to be studying that very hard, and I think I have a very big voice in it. And I think my voice is listened to, especially by people that don’t believe in it. And we’ll let you know. FRIEDMAN: I’d hate to see Royal Aberdeen underwater. TRUMP: The North Sea, that could be, that’s a good one, right? ELISABETH BUMILLER, Washington bureau chief: I just wanted to follow up on the question you were asked about not pursuing any investigations into Hillary Clinton. Did you mean both the email investigation and the foundation investigation  —   you will not pursue either one of those? TRUMP: Yeah, look, you know we’ll have people that do things but my inclination would be, for whatever power I have on the matter, is to say let’s go forward. This has been looked at for so long. Ad nauseam. Let’s go forward. And you know, you could also make the case that some good work was done in the foundation and they could have made mistakes, etc. etc. I think it’s time, I think it’s time for people to say let’s go and solve some of the problems that we have, which are massive problems and, you know, I do think that they’ve gone through a lot. I think losing is going through a lot. It was a tough, it was a very tough evening for her. I think losing is going through a lot. So, for whatever it’s worth, my, my attitude is strongly we have to go forward, we have so many different problems to solve, I don’t think we have to delve back in the past. I also think that would be a very divisive, well I think it would be very divisive, you know I’m talking about bringing together, and then they go into all sorts of stuff, I think it would be very, very divisive for the country. SULZBERGER: I agree, I think speaking not as a journalist now, it’s very healthy. There, and then we’re going to go MICHAEL D. SHEAR, White House correspondent: Mr. Trump, Mike Shear. I cover the White House, covering your administration   …     TRUMP: See ya there. [laughter] SHEAR: Just one quick clarification on the climate change, do you intend to, as you said, pull out of the Paris Climate   …     TRUMP: I’m going to take a look at it. SHEAR [interrupts]: And if the reaction from foreign leaders is to slap tariffs on American goods to offset the carbon that the United States had pledged to reduce, is that O. K. with you? And then the second question is on your sort of mixing of your global business interests and the presidency. There’s already, even just in the 10, two weeks you’ve been   instances where you’ve met with your Indian business partners   …     TRUMP: Sure. SHEAR: You’ve talked about the impact of the wind farms on your golf course. People, experts who are lawyers and ethics experts, say that all of that is totally inappropriate, so I guess the question for you is, what do you see as the appropriate structure for keeping those two things separate, and are there any lines that you think you won’t want to cross once you’re in the White House? TRUMP: O. K. First of all, on countries. I think that countries will not do that to us. I don’t think if they’re run by a person that understands leadership and negotiation they’re in no position to do that to us, no matter what I do. They’re in no position to do that to us, and that won’t happen, but I’m going to take a look at it. A very serious look. I want to also see how much this is costing, you know, what’s the cost to it, and I’ll be talking to you folks in the    future about it, having to do with what just took place. As far as the, you know, potential conflict of interests, though, I mean I know that from the standpoint, the law is totally on my side, meaning, the president can’t have a conflict of interest. That’s been reported very widely. Despite that, I don’t want there to be a conflict of interest anyway. And the laws, the president can’t. And I understand why the president can’t have a conflict of interest now because everything a president does in some ways is like a conflict of interest, but I have, I’ve built a very great company and it’s a big company and it’s all over the world. People are starting to see, when they look at all these different jobs, like in India and other things, number one, a job like that builds great relationships with the people of India, so it’s all good. But I have to say, the partners come in, they’re very, very successful people. They come in, they’d say, they said, ‘Would it be possible to have a picture?’ Actually, my children are working on that job. So I can say to them, Arthur, ‘I don’t want to have a picture,’ or, I can take a picture. I mean, I think it’s wonderful to take a picture. I’m fine with a picture. But if it were up to some people, I would never, ever see my daughter Ivanka again. That would be like you never seeing your son again. That wouldn’t be good. That wouldn’t be good. But I’d never, ever see my daughter Ivanka. UNKNOWN: That means you’d have to make Ivanka deputy President, you know. TRUMP: I know, I know, yeah. [room laughs] Well, I couldn’t do that either. I can’t, that can’t work. I can’t do anything, I would never see my, I guess the only son I’d be allowed to see, at least for a little while, would be Barron, because he’s 10. But, but, so there has to be [unintelligible]. It’s a very interesting case. UNKNOWN: You could sell your company though, right? With all due respect, you could sell your company and then   …     TRUMP: Well   …     UNKNOWN: And then you could see them all the time. TRUMP: That’s a very hard thing to do, you know what, because I have real estate. I have real estate all over the world, which now people are understanding. When I filed my forms with the federal election, people said, ‘Wow that’s really a big company, that’s a big company.’ It really is big, it’s diverse, it’s all over the world. It’s a great company with great assets. I think that, you know, selling real estate isn’t like selling stock. Selling real estate is much different, it’s in a much different world. I’d say this, and I mean this and I said it on “60 Minutes” the other night: My company is so unimportant to me relative to what I’m doing, ’cause I don’t need money, I don’t need anything, and by the way, I’m very   I have a very small percentage of my money in debt, very very small percentage of my money in debt, in fact, banks have said ‘We’d like to loan you money, we’d like to give you any amount of money.’ I’ve been there before, I’ve had it both ways, I’ve been   I’ve been   and, especially as you get older,   is much better. UNKNOWN: Mr.     …     TRUMP: Just a minute, because it’s an important question. I don’t care about my company. I mean, if a partner comes in from India or if a partner comes in from Canada, where we did a beautiful big building that just opened, and they want to take a picture and come into my office, and my kids come in and, I originally made the deal with these people, I mean what am I going to say? I’m not going to talk to you, I’m not going to take pictures? You have to, you know, on a human basis, you take pictures. But I just want to say that I am given the right to do something so important in terms of so many of the issues we discussed, in terms of health care, in terms of so many different things. I don’t care about my company. It doesn’t matter. My kids run it. They’ll say I have a conflict because we just opened a beautiful hotel on Pennsylvania Avenue, so every time somebody stays at that hotel, if they stay because I’m president, I guess you could say it’s a conflict of interest. It’s a conflict of interest, but again, I’m not going to have anything to do with the hotel, and they may very well. I mean it could be that occupancy at that hotel will be because, psychologically, occupancy at that hotel will be probably a more valuable asset now than it was before, O. K.? The brand is certainly a hotter brand than it was before. I can’t help that, but I don’t care. I said on “60 Minutes”: I don’t care. Because it doesn’t matter. The only thing that matters to me is running our country. MICHAEL BARBARO, political reporter: Mr.   can I press you a little further on what structures you would put in place to keep the presidency and the company separate and to avoid things that, for example, were reported in The Times in the past 24 hours about meeting with leaders of Brexit about wind farms   …     TRUMP: About meeting with who? BARBARO: Leaders of Brexit about wind farms that might interfere with the views of your golf course and how to keep, what structures, can you talk about that meeting, by the way? TRUMP: Was I involved with the wind farms recently? Or, not that I know of. I mean, I have a problem with wind   …     BARBARO: But you brought it up in the meeting, didn’t you? TRUMP: Which meeting? I don’t know. I might have. BARBARO: With leaders of Brexit. MANY VOICES: With Farage. TRUMP: Oh, I see. I might have brought it up. But not having to do with me, just I mean, the wind is a very deceiving thing. First of all, we don’t make the windmills in the United States. They’re made in Germany and Japan. They’re made out of massive amounts of steel, which goes into the atmosphere, whether it’s in our country or not, it goes into the atmosphere. The windmills kill birds and the windmills need massive subsidies. In other words, we’re subsidizing wind mills all over this country. I mean, for the most part they don’t work. I don’t think they work at all without subsidy, and that bothers me, and they kill all the birds. You go to a windmill, you know in California they have the, what is it? The golden eagle? And they’re like, if you shoot a golden eagle, they go to jail for five years and yet they kill them by, they actually have to get permits that they’re only allowed to kill 30 or something in one year. The windmills are devastating to the bird population, O. K. With that being said, there’s a place for them. But they do need subsidy. So, if I talk negatively. I’ve been saying the same thing for years about you know, the wind industry. I wouldn’t want to subsidize it. Some environmentalists agree with me very much because of all of the things I just said, including the birds, and some don’t. But it’s hard to explain. I don’t care about anything having to do with anything having to do with anything other than the country. BARBARO: But the structures, just to be clear, that’s the question. How do you formalize the separation of these things so that there is not a question of whether or not you as president   …     TRUMP: O. K. BARBARO:   …     are trying to influence something, like wind farms? TRUMP: O. K. I don’t want to influence anything, because it’s not that, it’s not that important to me. It’s hard to explain. BARBARO: Yes, but the structures? TRUMP: Now, according to the law, see I figured there’s something where you put something in this massive trust and there’s also  —   nothing is written. In other words, in theory, I can be president of the United States and run my business 100 percent, sign checks on my business, which I am phasing out of very rapidly, you know, I sign checks, I’m the   type. I like to sign checks so I know what is going on as opposed to pressing a computer button, boom, and thousands of checks are automatically sent. It keeps, it tells me what’s going on a little bit and it tells contractors that I’m watching. But I am phasing that out now, and handing that to Eric Trump and Don Trump and Ivanka Trump for the most part, and some of my executives, so that’s happening right now. But in theory I could run my business perfectly, and then run the country perfectly. And there’s never been a case like this where somebody’s had, like, if you look at other people of wealth, they didn’t have this kind of asset and this kind of wealth, frankly. It’s just a different thing. But there is no  —   I assumed that you’d have to set up some type of trust or whatever and you know. And I was actually a little bit surprised to see it. So in theory I don’t have to do anything. But I would like to do something. I would like to try and formalize something, because I don’t care about my business. Doral is going to run very nice. We own this incredible place in Miami. We own many incredible places, including Turnberry, I guess you heard. There’s one guy that does  —   when I say Turnberry, you know what that is, right. Do a little [inaudible]. But they’re going to run well, we have good managers, they’re going to run really well. So I don’t have to do anything, but I want to do something if I can. If there is something. BARBARO: Can you promise us when you decide exactly what that is, you’ll come tell The New York Times about it? [laughter] TRUMP: I will. I’ve started it already. SULZBERGER: One of our great salesmen, by the way. TRUMP: I can see that. I’ve started it already by, I mean, I’ve greatly reduced the   and the business. I’ve greatly reduced meetings with contractors, meetings with different people that, you know, I’ve also started by  —   ’cause I’ve said over the last two years, once I decided I wanted to run, I don’t want to build anything. ’Cause building, like for instance, we built the post office, you’ll be happy to hear, ahead of schedule and under budget. Substantially ahead of schedule. Almost two years ago of schedule. But ahead of schedule, under budget, and it’s a terrific place. That’s the hotel on Pennsylvania. FRIEDMAN: Just so you know, General Electric has a big wind turbine factory in South Carolina. Just so you know. TRUMP: Well that’s good. But most of ‘em are made in Germany, most of ‘em are made, you know, Siemens and the Chinese are making most of them. [cross talk] TRUMP: They may assemble  —   if you check, I think you’ll find that the, it’s delivered there and they do most of the assembly. JULIE HIRSCHFELD DAVIS, White House correspondent: Mr.    —   I’m sorry I entered late, but I did want to ask you about   …     BAQUET: You should introduce yourself. DAVIS: I’m Julie Davis, one of the White House correspondents. TRUMP: Hi, Julie. DAVIS: I apologize for my delayed flight. I wanted to ask you about personnel. They say personnel is policy. TRUMP: I can’t quite hear. DAVIS: Personnel. TRUMP: Personnel. DAVIS: You hired Steve Bannon to be the chief strategist for you in the White House. He is a hero of the  . He’s been described by some as racist and  . I wonder what message you think you have sent by elevating him to that position and what you would say to those who feel like that indicates something about the kind of country you prefer and the government you’ll run. TRUMP: Um, I’ve known Steve Bannon a long time. If I thought he was a racist, or   or any of the things that we can, you know, the terms we can use, I wouldn’t even think about hiring him. First of all, I’m the one that makes the decision, not Steve Bannon or anybody else. And Kellyanne will tell you that. [laughter] KELLYANE CONWAY: 100 percent. TRUMP: And if he said something to me that, in terms of his views, or that I thought were inappropriate or bad, number one I wouldn’t do anything, and number two, he would have to be gone. But I know many people that know him, and in fact, he’s actually getting some very good press from a lot of the people that know him, and people that are on the left. But Steve went to Harvard, he was a, you know, he was very successful, he was a Naval officer, he’s, I think he’s very, very, you know, sadly, really, I think it’s very hard on him. I think he’s having a hard time with it. Because it’s not him. It’s not him. I’ve known him for a long time. He’s a very, very smart guy. I think he was with Goldman Sachs on top of everything else. UNKNOWN: What do you make of the website he ran, Breitbart? TRUMP: The which? UNKNOWN: Breitbart. TRUMP: Well, Breitbart’s different. Breitbart cover things, I mean like The New York Times covers things. I mean, I could say that Arthur is   because they covered an   story. SULZBERGER: [laughing] I am, I am. I’ll take whatever you say. I am always right, but I’m not  . [laughter, cross talk] TRUMP: The New York Times covers a lot of stories that are, you know, rough stories. And you know, they have covered some of these things, but The New York Times covers a lot of these things also. It’s just a newspaper, essentially. It’s a newspaper. I know the guy, he’s a decent guy, he’s a very smart guy. He’s done a good job. He hasn’t been with me that long. You know he really came in after the primaries. I had already won the primaries. And if I thought that his views were in that category, I would immediately let him go. And I’ll tell you why. In many respects I think his views are actually on the other side of what a lot of people might think. DAVIS: But you are aware, sir, with all due respect, that   and Jews and many folks who disagree with the coverage of Breitbart and the slant that Breitbart brings to the news view him that way, aren’t you? TRUMP: Yeah, well Breitbart, first of all, is just a publication. And, you know, they cover stories like you cover stories. Now, they are certainly a much more conservative paper, to put it mildly, than The New York Times. But Breitbart really is a news organization that’s become quite successful, and it’s got readers and it does cover subjects that are on the right, but it covers subjects on the left also. I mean it’s a pretty big, it’s a pretty big thing. And he helped build it into a pretty successful news organization. Now, I’ll tell you what, I know him very well. I will say this, and I will say this, if I thought that strongly, if I thought that he was doing anything, or had any ideas that were different than the ideas that you would think, I would ask him very politely to leave. But in the meantime, I think he’s been treated very unfairly. It’s very interesting ’cause a lot of people are coming to his defense right now. PRIEBUS: We have never experienced a single episode of any of those accusations. It’s been the total opposite. It’s been a great team, and it’s just not there. And what the   is saying is 100 percent true. [cross talk] TRUMP: And by the way, if you see something or get something where you feel that I’m wrong, and you have some info  —   I would love to hear it. You can call me, Arthur can call me, I would love to hear. The only one who can’t call me is Maureen [Dowd, opinion columnist]. She treats me too rough. I don’t know what happened to Maureen! She was so good, Gail [Collins, opinion columnist]. For years she was so good. [cross talk] SULZBERGER: As we all say about Maureen, it’s not your fault, it’s just your turn. [laughter] ROSS DOUTHAT, opinion columnist: I have a slightly different, but somewhat Steve   question, I guess. It’s about the future of the Republican Party. You started out here talking about winning in so many states where no Republican has won in decades, especially Midwestern Rust Belt states. And I think many people think that one of the reasons you won was that you deliberately campaigned as a different kind of Republican. You had different things to say on trade, entitlements, foreign policy, even your daughter Ivanka’s child care plan was sort of distinctive. And now you’re in a situation where you’re governing and staffing up an administration with a Republican Party whose leaders, and Reince, may differ with me a little on this, but don’t always see    on those views. TRUMP: Although right now they’re loving me. [laughter] UNKNOWN: Well, right now they are. [cross talk] TRUMP: Paul Ryan right now loves me, Mitch McConnell loves me, it’s amazing how winning can change things. I’ve liked Chuck Schumer for a long time. I’ve actually, I’ve raised a lot of money for Chuck and given him a lot of money over the years. I think I was the first person that ever contributed to Chuck Schumer. I had a Brooklyn office, a little office, in a little apartment building in Brooklyn in Sheepshead Bay where I worked with my father. And Chuck Schumer came in and I gave him, I believe, I don’t know if he’s willing to admit this, but I believe it was his first campaign contribution, $500. But Chuck Schumer’s a good guy. I think we’ll get along very well. DOUTHAT: I guess that’s my question is, how much do you expect to be able to both run an administration and negotiate with a   Congress as a different kind of Republican. And do you worry that you’ll wake up three years from now and go back to campaigning in the Rust Belt and people will say, well, he governed more like Paul Ryan than like Donald Trump. TRUMP: No, I don’t worry about that. ’Cause I didn’t need to do this. I was telling Arthur before: ‘Arthur I didn’t need to do this. I’m doing this to do a good job.’ That’s what I want to do, and I think that what happened in the Rust Belt, they call it the Rust Belt for a reason. If you go through it, you look back 20 years, they didn’t used to call it the Rust Belt. You pass factory after factory after factory that’s empty and rusting. Rust is the good part, ’cause they’re worse than rusting, they’re falling down. No, I wouldn’t sacrifice that. To me more important is taking care of the people that really have proven to be, to love Donald Trump, as opposed to the political people. And frankly if the political people don’t take care of these people, they’re not going to win and you’re going to end up with maybe a total different kind of government than what you’re looking at right now. These people are really angry. They’re smart, they’re workers, and they’re angry. I call them the forgotten men and women. And I use that in speeches, I say they’re the forgotten people  —   they were totally forgotten. And we’re going to bring jobs back. We’re going to bring jobs back, big league. I’ve spoken to so many companies already, I say, don’t plan on moving your company, ’cause you’re not going to be able to move your company and sell us your product. You think you’re going to just sell it across what will be a strong border, you know at least we’re going to have a border. But just don’t plan on it. And I’ll tell you, I believe, and you’ll hear announcements over the next couple of months, but I believe I’ve talked numerous comp  —   in   conversations with top people  —   numerous companies that have, leaving, or potentially leaving our country with thousands of jobs. FRIEDMAN: Are you worried, though, that those companies will keep their factories here, but the jobs will be replaced by robots? TRUMP: They will, and we’ll make the robots too. [laughter] TRUMP: It’s a big thing, we’ll make the robots too. Right now we don’t make the robots. We don’t make anything. But we’re going to, I mean, look, robotics is becoming very big and we’re going to do that. We’re going to have more factories. We can’t lose 70, 000 factories. Just can’t do it. We’re going to start making things. I was honored yesterday, I got a call from Bill Gates, great call, we had a great conversation, I got a call from Tim Cook at Apple, and I said, ‘Tim, you know one of the things that will be a real achievement for me is when I get Apple to build a big plant in the United States, or many big plants in the United States, where instead of going to China, and going to Vietnam, and going to the places that you go to, you’re making your product right here.’ He said, ‘I understand that.’ I said: ‘I think we’ll create the incentives for you, and I think you’re going to do it. We’re going for a very large tax cut for corporations, which you’ll be happy about.’ But we’re going for big tax cuts, we have to get rid of regulations, regulations are making it impossible. Whether you’re liberal or conservative, I mean I could sit down and show you regulations that anybody would agree are ridiculous. It’s gotten to be a   . And companies can’t, they can’t even start up, they can’t expand, they’re choking. I tell you, one thing I would say, so, I’m giving a big tax cut and I’m giving big regulation cuts, and I’ve seen all of the small business owners over the United States, and all of the big business owners, I’ve met so many people. They are more excited about the regulation cut than about the tax cut. And I would’ve never said that’s possible, because the tax cut’s going to be substantial. You know we have companies leaving our country because the taxes are too high. But they’re leaving also because of the regulations. And I would say, of the two, and I would not have thought this, regulation cuts, substantial regulation cuts, are more important than, and more enthusiastically supported, than even the big tax cuts. UNKNOWN: Mr.   I wanted to ask you, there was a conference this past weekend in Washington of people who pledged their allegiance to Nazism. TRUMP: Boy, you are really into this stuff, huh? PRIEBUS: I think we answered that one right off the bat. UNKNOWN: Are you going to condemn them? TRUMP: Of course I did, of course I did. PRIEBUS: He already did. UNKNOWN: Are you going to do it right now? TRUMP: Oh, I see, maybe you weren’t here. Sure. Would you like me to do it here? I’ll do it here. Of course I condemn. I disavow and condemn. SULZBERGER: We’ll go with that. I’d like to move to infrastructure, apologies, and then we’ll go back. Because a lot of the investment you are talking about, a lot of the jobs you are talking about  —   is infrastructure going to be the core of your first few years? TRUMP: No, it’s not the core, but it’s an important factor. We’re going for a lot of things, between taxes, between regulations, between health care replacement, we’re going to talk repeal and replace. ’Cause health care is  —   you know people are paying a 100 percent increase and they’re not even getting anything, the deductibles are so high, you have deductibles $16, 000. So they’re paying all of this money and they don’t even get health care. So it’s very important. So there are a lot of things. But infrastructure, Arthur, is going to be a part of it. SULZBERGER: It’s part of jobs, isn’t it? TRUMP: I don’t even think it’s a big part of it. It’s going to be a big number but I think I am doing things that are more important than infrastructure, but infrastructure is still a part of it, and we’re talking about a very   infrastructure bill. And that’s not a very Republican thing  —   I didn’t even know that, frankly. SULZBERGER: It worked for Franklin Roosevelt. TRUMP: It didn’t work for Obama because unfortunately they didn’t spend the money last time on infrastructure. They spent it on a lot of other things. You know, nobody can find out where that last  —   you know, from a few years ago  —   where that money went. And we’re going to make sure it is spent on infrastructure and roads and highways. I have a friend, he’s a big trucker, one of the biggest. And he orders these incredible trucks, the best, I won’t mention the name but it’s a certain truck company that makes  —   they call them the   of trucks. You know, the most expensive trucks. And he calls me up about two months ago and he goes, ‘Man, I’m going to buy the cheapest trucks I can buy.’ And I said, ‘Why?’ and  —   you know, and this is the biggest guy  —   he goes, ‘My trucks are coming back, they’re going from New York to California and they’re all busted up. The highways are in such bad shape, they’re hitting potholes, they’re hitting everything.’ He said, ‘I’m not buying these trucks anymore, I’m going to buy the cheapest stuff and the strongest tires I can get.’ That’s the exact expression he used, ‘the cheapest trucks and the strongest tires.’ We’re hitting so many bad points, we, you know, I said, ‘So tell me, you’ve been doing this how long?’ 45 years. He built it over 45 years. I said, ‘Have you ever seen it like this?’ He said, ‘The roads have never been like this.’ It’s an interesting   …     BAQUET: What did, what did, I’m curious what Mitch McConnell and Paul Ryan said when you said, ‘I’m going to launch a   infrastructure program.’ Are they reluctant to spend that? TRUMP: Honestly right now   …     DOUTHAT: Trillion. Trillion, I think, was the figure. BAQUET: Because they would be in the wing of the Republican Party that would say, ‘That’s great, but you’re not going to be able to do that and balance the budget.’ TRUMP: Let’s see if I get it done. Right now they’re in love with me. O. K.? Four weeks ago they weren’t in love with me. Don’t forget  —   if I read The New York Times, and you don’t have to put this on the record  —   it can be if you want, you might not want   …     SULZBERGER: You say if, but you do   …     TRUMP: Well, I do read it. Unfortunately. I would have lived about 20 years longer if I didn’t. SULZBERGER: There’s Nixon’s quote right there if you’d love to reread it  —   TRUMP: I know. But when you look at the different, all the newspapers, I was going to lose the presidency, I was going to take the House with me, and the Senate had no chance. It was going to be the biggest humiliation in the history of politics in this country. And instead I won the presidency, easily, and I mean easily  —   you look at those states, I had states where I won by 30 and 40 points. I won the presidency easily, I helped numerous senators  —   in fact the only senators that didn’t get elected were two  —   one up in New Hampshire who refused to say that she was going to vote for me, who by the way would love a job in the administration and I said, ‘No, thank you.’ That’s on the record. This is where I’m different than a politician  —   I know what to say, I just believe it’s sort of interesting. She’d love to have a job in the administration, I said, ‘No, thank you.’ She refused to vote for me. And a senator in Nevada who frankly said, he endorsed me then he unendorsed me, and he went down like a lead balloon. And then they called me before the race and said they wanted me to endorse him and do a big thing and I said, ‘No thank you, good luck.’ You know, let’s see what happens. I said, off the record, I hope you lose. Off the record. He was! He was up by 10 points  —   you know who I’m talking about. So, others  —   if you look at Missouri, [Senator Roy] Blunt, he was down five points a few days before the election, he called for help, I gave him help, and I think I was up like over 30 points in Missouri. I was leading by a massive amount, 28 points. I gave him help and he ended up winning by four points or something. I brought a number of them. Pennsylvania, brought over the finish line. Let’s see, we brought Johnson, in, you know, that was a good one. We brought him over the line in Wisconsin. Winning Wisconsin was big stuff, that’s something that   …     FRIEDMAN: Mr.   I came   …     TRUMP: So right now I’m in very good shape, but FRIEDMAN: I came here thinking you’d be awed and overwhelmed by this job, but I feel like you are getting very comfortable with it. TRUMP: I feel comfortable. I feel comfortable. I am awed by the job, as anybody would be, but I honestly, Tom, I feel so comfortable and you know it would be, to me, a great achievement if I could come back here in a year or two years and say  —   and have a lot of the folks here say, ‘You’ve done a great job.’ And I don’t mean just a conservative job, ’cause I’m not talking conservative. I mean just, we’ve done a good job. SHEAR: To follow up on Matt, after you met with President Obama, he described you to folks as  —   that you seemed overwhelmed by what he told you. So I wonder if you are overwhelmed by the magnitude of the job that you’re about to inherit and if you can tell us anything more about that conversation with the president and the apparently subsequent conversations that you’ve had on the phone since then. And then maybe talk a little bit about foreign policy, that’s something we haven’t touched on here, and whether or not you believe in the kind of world order  —   a world order led by America in terms of having this country underwrite the security and the free markets of the world, which have been in place for decades. TRUMP: Sure. I had a great meeting with President Obama. I never met him before. I really liked him a lot. The meeting was supposed to be 10 minutes, 15 minutes max, because there were a lot of people waiting outside, for both of us. And it ended up being  —   you were there  —   I guess an     meeting, close. And it was a great chemistry. I think if he said overwhelmed, I don’t think he meant that in a bad way. I think he meant that it is a very overwhelming job. But I’m not overwhelmed by it. You can do things and fix it, I think he meant it that way. He said very nice things after the meeting and I said very nice things about him. I really enjoyed my meeting with him. We have  —   you know, we come from different sides of the equation, but it’s nevertheless something that  —   I didn’t know if I’d like him. I probably thought that maybe I wouldn’t, but I did, I did like him. I really enjoyed him a lot. I’ve spoken to him since the meeting. SHEAR: What did you say to him? TRUMP: Just a basic conversation. I think he’s looking to do absolutely the right thing for the country in terms of transition and I really, I’m telling you, we had a meeting, Arthur, that went for an hour and a half that could have gone for three or four hours. It was a great  —   it was just a very good meeting. UNKNOWN: Sort of like this meeting. [cross talk, laughter] TRUMP: He told me what he thought his, what the biggest problems of the country were, which I don’t think I should reveal, I don’t mind if he reveals them. But I was actually surprised a little bit. But he told me the problems, he told me things that he considered assets, but he did tell me what he thought were the biggest problems, in particular one problem that he thought was a big problem for the country, which I’d rather have you ask him. But I really found the meeting to be very good. And I hope we can have a good  —   I mean, it doesn’t mean we’re going to agree on everything, but I hope that we will have a great   relationship. I really liked him a lot and I’m a little bit surprised I’m telling you that I really liked him a lot. Let’s go foreign policy, sure. Sure. FRIEDMAN: What do you see as America’s role in the world? Do you believe that the role   …     TRUMP: That’s such a big question. FRIEDMAN: The role that we played for 50 years as kind of the global balancer, paying more for things because they were in our ultimate interest, one hears from you, I sense, is really shrinking that role. TRUMP: I don’t think we should be a nation builder. I think we’ve tried that. I happen to think that going into Iraq was perhaps   …     I mean you could say maybe we could have settled the civil war, O. K.? I think going into Iraq was one of the great mistakes in the history of our country. I think getting out of it  —   I think we got out of it wrong, then lots of bad things happened, including the formation of ISIS. We could have gotten out of it differently. FRIEDMAN: NATO, Russia? TRUMP: I think going in was a terrible, terrible mistake. Syria, we have to solve that problem because we are going to just keep fighting, fighting forever. I have a different view on Syria than everybody else. Well, not everybody else, but then a lot of people. I had to listen to [Senator] Lindsey Graham, who, give me a break. I had to listen to Lindsey Graham talk about, you know, attacking Syria and attacking, you know, and it’s like you’re now attacking Russia, you’re attacking Iran, you’re attacking. And what are we getting? We’re getting  —   and what are we getting? And I have some very definitive, I have some very strong ideas on Syria. I think what’s happened is a horrible, horrible thing. To look at the deaths, and I’m not just talking deaths on our side, which are horrible, but the deaths  —   I mean you look at these cities, Arthur, where they’re totally, they’re rubble, massive areas, and they say two people were injured. No, thousands of people have died. O. K. And I think it’s a shame. And ideally we can get  —   do something with Syria. I spoke to Putin, as you know, he called me, essentially   …     UNKNOWN: How do you see that relationship? TRUMP: Essentially everybody called me, all of the major leaders, and most of them I’ve spoken to. FRIEDMAN: Will you have a reset with Russia? TRUMP: I wouldn’t use that term after what happened, you know, previously. I think  —   I would love to be able to get along with Russia and I think they’d like to be able to get along with us. It’s in our mutual interest. And I don’t go in with any preconceived notion, but I will tell you, I would say  —   when they used to say, during the campaign, Donald Trump loves Putin, Putin loves Donald Trump, I said, huh, wouldn’t it be nice, I’d say this in front of thousands of people, wouldn’t it be nice to actually report what they said, wouldn’t it be nice if we actually got along with Russia, wouldn’t it be nice if we went after ISIS together, which is, by the way, aside from being dangerous, it’s very expensive, and ISIS shouldn’t have been even allowed to form, and the people will stand up and give me a massive hand. You know they thought it was bad that I was getting along with Putin or that I believe strongly if we can get along with Russia that’s a positive thing. It is a great thing that we can get along with not only Russia but that we get along with other countries. JOSEPH KAHN, managing editor: On Syria, would you mind, you said you have a very strong idea about what to do with the Syria conflict, can you describe that for us? TRUMP: I can only say this: We have to end that craziness that’s going on in Syria. One of the things that was told to me  —   can I say this off the record, or is everything on the record? SULZBERGER: No, if you want to   …     TRUMP: I don’t want to violate, I don’t want to violate a   …     SULZBERGER: If you want to go off the record, we have agreed you can go off the record. Ladies and gentlemen, we are off the record for this moment. [Trump speaks off the record.] TRUMP: Now we can go back on. SULZBERGER: I’m going to play the cop here. We’ve got only two and a half minutes left, because they have a hard stop at 2. And by the way, I want to thank you again, on behalf of all of us   …     TRUMP: Thank you. SULZBERGER:   …     for this meeting, and really I mean that. We are back on the record. Maggie, you get the last question. TRUMP: Is he a tough boss, folks? Is he tough? HABERMAN: I have two questions, very, very quickly. One is your vice   left open the idea of returning to waterboarding. You talked about that on the campaign trail. I’m hoping you can talk about how you view torture at this point, and also what are you hoping that Jared Kushner will do in your administration and will you bring him in formally? TRUMP: O. K. O. K. So, I didn’t hear the second question. HABERMAN: Jared Kushner. What will Jared Kushner’s role be in your administration? TRUMP: Oh. Maybe nothing. Because I don’t want to have people saying ‘conflict.’ Even though the president of the United States  —   I hope whoever is writing this story, it’s written fairly  —   the president of the United States is allowed to have whatever conflicts he wants  —   he or she wants. But I don’t want to go by that. Jared’s a very smart guy. He’s a very good guy. The people that know him, he’s a quality person and I think he can be very helpful. I would love to be able to be the one that made peace with Israel and the Palestinians. I would love that, that would be such a great achievement. Because nobody’s been able to do it. HABERMAN: Do you think he can be part of that? TRUMP: Well, I think he’d be very good at it. I mean he knows it so well. He knows the region, knows the people, knows the players. I would love to be  —   and you can put that down in a list of many things that I’d like to be able to do. Now a lot of people tell me, really great people tell me, that it’s impossible, you can’t do it. I’ve had a lot of, actually, great Israeli businesspeople tell me, you can’t do that, it’s impossible. I disagree, I think you can make peace. I think people are tired now of being shot, killed. At some point, when do they come? I think we can do that. I have reason to believe I can do that. HABERMAN: And on torture? Where are you  —   and waterboarding? TRUMP: So, I met with General Mattis, who is a very respected guy. In fact, I met with a number of other generals, they say he’s the finest there is. He is being seriously, seriously considered for secretary of defense, which is  —   I think it’s time maybe, it’s time for a general. Look at what’s going on. We don’t win, we can’t beat anybody, we don’t win anymore. At anything. We don’t win on the border, we don’t win with trade, we certainly don’t win with the military. General Mattis is a strong, highly dignified man. I met with him at length and I asked him that question. I said, what do you think of waterboarding? He said  —   I was surprised  —   he said, ‘I’ve never found it to be useful.’ He said, ‘I’ve always found, give me a pack of cigarettes and a couple of beers and I do better with that than I do with torture.’ And I was very impressed by that answer. I was surprised, because he’s known as being like the toughest guy. And when he said that, I’m not saying it changed my mind. [An earlier version made a mistake in transcription. Mr. Trump said “changed my mind,” not “changed my man. ”] Look, we have people that are chopping off heads and drowning people in steel cages and we’re not allowed to waterboard. But I’ll tell you what, I was impressed by that answer. It certainly does not  —   it’s not going to make the kind of a difference that maybe a lot of people think. If it’s so important to the American people, I would go for it. I would be guided by that. But General Mattis found it to be very less important, much less important than I thought he would say. I thought he would say  —   you know he’s known as Mad Dog Mattis, right? Mad Dog for a reason. I thought he’d say ‘It’s phenomenal, don’t lose it.’ He actually said, ‘No, give me some cigarettes and some drinks, and we’ll do better.’ SULZBERGER: So, I, with apologies, I’m going to go to our C. E. O. Mark Thompson, for the last, last question. TRUMP: Very powerful man   …     MARK THOMPSON: Thank you, and it’s a really short one, but after all the talk about libel and libel laws, are you committed to the First Amendment to the Constitution? TRUMP: Oh, I was hoping he wasn’t going to say that. I think you’ll be happy. I think you’ll be happy. Actually, somebody said to me on that, they said, ‘You know, it’s a great idea, softening up those laws, but you may get sued a lot more.’ I said, ‘You know, you’re right, I never thought about that.’ I said, ‘You know, I have to start thinking about that.’ So, I, I think you’ll be O. K. I think you’re going to be fine. SULZBERGER: Well, thank you very much for this. Really appreciate this. TRUMP: Thank you all, very much, it’s a great honor. I will say, The Times is, it’s a great, great American jewel. A world jewel. And I hope we can all get along. We’re looking for the same thing, and I hope we can all get along well.'"}, "time": 1742563158.046586}