{"duration": 0.07408833503723145, "input_args": {"text": "'News anchors arrived at the White House Thursday afternoon for a private lunch with President Trump after a week of negative news reports and before he heads on his first overseas trip, a   visit to the Middle East and Europe. [The    luncheon, first reported by Politico, was expected to cover Trump’s upcoming trip to Saudi Arabia, Israel, Rome, Brussels, and Sicily.  Spotted arriving at the White House for the luncheon were all the network and cable news heavy hitters, including: Fox News’s Bret Baier and Chris Wallace CNN’s Wolf Blitzer and Jake Tapper ABC News’s David Muir NBC News’s Kelly O’Donnell CBS News’s Scott Pelley PBS Newshour’s Judy Woodruff, and Christian Broadcasting Network’s Jennifer Wishon. MSNBC’s Greta Van Susteren and ABC News’s George Stephanopolous also attended, according to a tweet by a Bloomberg News reporter. Additional attendees were noted by Politico: Here’s the group who met with Trump today for lunch pic. twitter.   —   Hadas Gold (@Hadas_Gold) May 18, 2017,  Chris Wallace just showed up to White House to meet with @realDonaldTrump. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  Wolf Blitzer arrives at White House. Saunters into West Wing for anchors lunch with Trump. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  More anchors arrive for lunch with Trump. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  . @DavidMuir arrives for anchors lunch with Trump. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  . @ScottPelley arrives at White House for lunch with Trump. Smooth     action. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  . @jaketapper arrives for the Trump lunch. pic. twitter.   —   Kristina Wong (@kristina_wong) May 18, 2017,  CNN later reported that Trump spoke more about Deputy Attorney General Rod Rosenstein’s decision to appoint a special counsel to investigate Russian interference in the U. S. elections and any collusion with the Trump campaign. According to the Independent Journal Review: “I believe it hurts the country terribly because it shows we’re a divided,     country,” he said, according to CNN. “And we have very important things to do right now,” he added, citing trade deals, military issues, and the spread of nuclear weapons. “It also happens to be a pure excuse for the Democrats having lost an election that they should have easily won because of the Electoral College being slated so much in their way,” he said. “That’s all this is. I think it shows division, and it shows that we’re not together as a country. And I think it’s a very, very negative thing. ” Trump closed his comments by stating that “hopefully, this can go quickly, because we have to show unity if we’re going to do great things with respect to the rest of the world. ” This is the second time Trump has met with TV news anchors privately. The first time was before his address to a joint session of Congress. Pelley reportedly moved the CBS evening news show from New York to Washington partly as a result of the lunch. Trump, who has blasted CNN as “fake news,” is an avid consumer of cable news and reportedly recently installed a new large screen TV in the White House.'"}, "time": 1742561637.0708776}