{"duration": 0.05278515815734863, "input_args": {"text": "'Leaked tapes of CNN employees released by Project Veritas this morning reveal CNN editors displaying their leftist bias. Editors can be heard claiming there is “no debate” on climate change while calling Fox News “unbearable. ”[Joe Sterling, who was then News Desk Editor for CNN’s online venue “The Wire” was recorded dismissing any skepticism on the climate change issue, and comparing it to creationism.  “That issue, climate change, I mean science is pretty much on board and there are a few dissenters. There’s no debate. It’s like, you know,   saying there’s a debate over, you know creationism, and all that stuff. There is no debate. ” The tapes reveal more bias from   Assignment Desk Editor Nicky Robinson, who can be heard attacking   channel Fox News. “Fox News, I think Fox News is unbearable. It’s horrible,” Robinson can be heard saying. Over 119 hours of raw audio from inside CNN has been released by Project Veritas, with over 100 more hours yet to be released. The audio was recorded in 2009 by an anonymous whistleblower inside CNN’s Atlanta headquarters, identified only as “Miss X. ” “We’ve got 100 million people out there who’ve got   to speak for them” said Project Veritas founder James O’Keefe at a press conference announcing the leaks. “Project Veritas is determined to expose malfeasance, corruption, and wrongdoing. ” “We’ve already have two whistleblowers come forward since we announced these tapes. People are coming to us now, on the inside. ” In a comment to Breitbart Tech, O’Keefe spoke of his concern at the growing leftist bias of social media companies, and warned them that Project Veritas would investigate them too. “Yes we know about it, we’re concerned about it, we’re fighting it” said O’Keefe, responding to our question about social media bias. “[CNN Leaks] is the first in a long effort to target and expose abuse within the media, and that includes social media. Who knows? Maybe we have someone inside with a camera right now, recording everything. ” You can follow Allum Bokhari on Twitter and add him on Facebook. Email tips and suggestions to abokhari@breitbart. com.'"}, "time": 1742563228.746649}