{"duration": 0.05836629867553711, "input_args": {"text": "'Stephen Colbert believes Republicans in the House “kicked America in the balls” with their passage of the American Health Care Act on Thursday. [During his Thursday night monologue on CBS’ Late Show, Colbert  —   whose use of a slur to describe the president earlier this week has apparently already been forgotten  —   railed against the bill, which is meant as a GOP alternative to former President Obama’s Affordable Care Act.  “The new bill would cut taxes for the wealthy up to $883 billion,” Colbert said during his nearly   monologue. “Now listen, if hearing that raises your blood pressure, calm down. You can’t afford the medication anymore. ” Colbert went on to skewer White House chief of staff Reince Priebus for a quote in which he said “the president stepped up and helped us punt the ball into the end zone. ” (The Hill journalist Molly Hooper later said she misquoted Priebus, and that he had said “punch” instead of “punt”). “Yes, a punt into the end zone,” Colbert repeated, quoting what Priebus did not say. “Accurate because it gives you zero points and gives your opponent good field position. ” “I think a more accurate football metaphor might have been, the GOP just kicked America in the balls,” he added. Colbert sparked a social media campaign to get him fired from CBS this week after referring to President Donald Trump’s mouth as “Vladimir Putin’s c*ck holster” during his Monday Late Show monologue. The host addressed the controversy during his Wednesday show, but stopped short of offering an apology. “I don’t regret that. He, I believe, can take care of himself. I have jokes, he has the launch codes. So, it’s a fair fight,” Colbert said Wednesday. “So while I would do it again, I would change a few words that were cruder than they needed to be. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562068.7509713}