{"duration": 0.06047177314758301, "input_args": {"text": "'Hacked emails reveal Hillary funded Trump campaign Posted on Tweet \\n“He is the only person who can help me win the presidential election” \\nWashington, Nov 2 : Just as things were getting to the point where it cannot get any worse in the sleaziest American presidential campaign ever (unless otherwise it was revealed during the Halloween that Donald Trump is a real zombie), comes the potentially game-changing news that the Republican nominee Donald Trump’s campaign has been, for the most part, funded by his fierce Democrat rival Hillary Clinton. \\nThese details emerged in a series of hacked e-mails of Hillary that she had stored in her ‘pen drive’. In one of the emails, Hillary writes to her campaign adviser John Podesta, “It is now more than abundantly clear that the only person who can make me win in the election is Donald Trump.” She goes on to add, “But we cannot sit idly hoping that he would do the job for us on his own. We must actively encourage his campaign. In other words, we must fully bankroll him”. \\nPodesta, in his reply to the e-mail, concurs with Hillary’s line of thinking, “yeah, you have put it way better than we can.” In fact, he goes one step ahead and lays it all brutally down: “It is only smart that we start funding his campaign before his camp gets all wise and starts funding our campaign. We don’t want a Face/Off kind of situation here where one is the front of the other and vice-versa. As it is, it is difficult telling the two campaigns apart”. \\nAnd as part of the carefully constructed plan, Hillary’s team allowed Russian hackers to not only hack her e-mails but also bank accounts, knowing fully well that the hacked mails and money would eventually find their way from the Russians to the Trump camp. \\nAt one point, Podesta does raise the question what if the Russians pass on only the mails and keep the money themselves. “Do you want to trust the Russians with all the money? Looks like a dangerous gambit. I’m red-flagging it here itself”. \\nBut Hillary, who had worked out her strategy pretty smartly, replies Podesta: “When I say money, we are not going to put actual money that Russians would doubtless run away with.” She adds that the plan is to go the Sodexo coupon route. “We put humongous amount of Sodexo coupons. Russians wouldn’t know to use them and would pass it to Trump’s team. I am pretty sure they will lap it up, as I am even more pretty sure that Trump wouldn’t have given lunch and dinner allowance to his team”. \\nUnderstandably, the latest e-mail reveals have caused further confusion in a campaign that has never been short of that. The Trump campaign managers lashed out Hillary and her team and accused them “of (metaphorically) sneaking into enemy’s room and poisoning his drink and food”. \\nTrump’s spokesperson said “they have used our hands to poke our eyes, which anyway we ourselves were doing. This reveals their desperation. But we aren’t fazed. We will continue to do what we have been doing without anybody’s bidding.” \\nTrump himself, in a speech to his supporters, thundered, “so you now get the real picture. All my gaffes, stupid remarks and silly antics have all been the fault of that woman. The ridiculous things that I say on a daily basis is all the work of Hillary.” \\nHe added: “The crazy things I come up with at all meetings, the media has been there always. I know. I have seen them. Why did they not find out that it was all Hillary’s fault”. \\nTrump also said that those claiming that I have not paid my taxes have a clear answer now. “How can I pay taxes for Hillary’s money?” \\nTrump’s parting words were: “Hillary and her conspiracies are a conspiracy of China. She could be the effect of global warming”. \\nMeanwhile, the Hillary campaign team responded to the allegations by saying, “it is more than a real possibility that the Trump’s team might be using Hillary Clinton’s body double to create her emails and money accounts.” \\nHillary’s aide, in a non-hacked e-mail response, said, “Trump campaign team is financing Hillary’s body double and funding themselves. It doesn’t take much to figure this out. It is not rocket science. Just do your math.” \\nThe aide added: “We have also reasons to believe that the Trump campaign team is using a Trump body double to address his meetings so that they will have less embarrassment to manage later”. \\nElsewhere, in a totally understandable development, a latest media poll suggested that 100 per cent of Americans would prefer Hillary’s body double to Hillary and Trump’s body double to Trump. “The body doubles are assured of a landslide victory”, revealed the poll.'"}, "time": 1742628305.378063}