{"duration": 0.1111607551574707, "input_args": {"text": "'  Chris Menahan “Trump Supporter gets what she’s been asking for… A Beatdown from a Latina.” \\nShocking video out of California shows Hillary Clinton supporters violently attack a homeless woman who was doing all she could to defend Donald Trump’s Star on the Hollywood Walk of Fame. \\nFriday, newly surfaced video shared by one of Hillary Clinton’s Hillbullies shows an Hispanic thug lay his hands on the brave woman and steal her signs, all while shouting “GET YOUR ASS OUTTA HERE, B*TCH!” \\nOther Hillbullies are then seen spitting on her signs and stomping them with their feet. \\nAs the innocent woman is seen frantically trying to protect herself from the terrorist thug, he violently trips her to the ground. \\nHillary supporting onlookers are then seen chastising her and as she lay motionless. \\n“Didn’t I tell you, about five minutes ago, that somebody was going to walk by here — and no I won’t defend you — because you spewed hate, and you got hate,” one Hillbully says. “You got exactly what you were dishing out, I told, I warned you on that, didn’t I?” \\nThe YouTube video, which was shared by user “Koali Fikator,” has this sickening description: “After Bullying Everyone, Trump Supporter gets what she’s been asking for… A Beatdown from a Latina.” \\nAll the woman did was hold up signs saying she wants to put Americans first: \\nShe didn’t assault anyone, she merely exercised her right to free speech as an American! \\nThese left-wing terrorists used violence to suppress her free speech simply because she supports Donald Trump for president! That’s the definition of terrorism! \\nGet this story out to everyone so they can see how these Hillbullies operate! . @ScottAdamsSays : \"I can\\'t vote for a bully.\" So he endorses Trump. The #Hillbullies have made violence against Trump supporters legitimate. pic.twitter.com/4nVscp6mki \\nCourtesy of Information Liberation Don\\'t forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:'"}, "time": 1742562612.9273884}