{"duration": 0.08309507369995117, "input_args": {"text": "'On Friday, Tom Van Flein, chief of staff to Rep. Paul Gosar ( ) and   legal counsel to former Alaska Governor Sarah Palin, discussed with Breitbart News Daily SiriusXM host Raheem Kassam the recent effort to overhaul the House ethics system. [Flein said the problem with the reform package presented, and then withdrawn, this week was that “it lacked transparency, so it was sort of dropped on the American public without any hearings, without any discussion, and that ultimately led to its failure. ”  “It was a failure of process and the lack of transparency,” he emphasized. “It wasn’t because it did not have merit, however. And it was not, as the New York Times falsely stated in their Fake News, that it was ‘gutting’ the OCE [Office of Congressional Ethics] at all. It was modifying that agency to install some basic due process rights. ” “As it’s been going now, members of Congress have been subjected to secretive proceedings, abusive proceedings,” he explained. “There is a presumption of guilt. There’s a failure to disclose charges so people are not even aware of what the details are of the charges against them. They’ve been punished for simply hiring an attorney to represent them. And it’s being used for partisan purposes to get bad headlines and make people look bad. So the reforms were needed. ”  “I’m very familiar with that, by the way, having represented Governor Palin,” he added. “I think I handled 23 or 24 ethics complaints, of which we got all of them dismissed, but they all caused headlines, negative headlines. And then when the matter gets dismissed, after tens of thousands of dollars in legal fees and six months of proceedings, you don’t get any news update on that. It’s certainly not on the front page, which is where the complaint goes. ” Van Flein estimated that the ethics reform plan would resurface in Congress in “six months to a year. ” “When   Trump sent out his tweet that said, ‘Hey, we need to focus on some other issues first,’ I think the members of Congress heard that loud and clear and said, ‘You know what? He’s right. Before we clean up our own house here, let’s get our economic package going. Let’s get our tax reform going. Let’s get the things that matter to the new President and to the new Congress. Let’s get the important issues going in the next six months. And then we can clean up messes like this at some point later,” he said. Kassam asked if it was wrong for Congress to have different priorities than the White House. “Not at all,” Van Flein replied. “It’s a separate branch of government, and they have their own priorities and their own problems to deal with. But I do think it’s been a great sign of respect to the   what they did. ” He said it was hard to tell if concern about bad press, a conflict with the White House, or conflict with “vindictive” Democrats were motivating factors in withdrawing the ethics reform proposals, as Kassam suggested. “I think what was motivating is, now that there is a clear majority in the House and Senate, and a President that might sign it, that they took the opportunity to say this is long overdue. And by the way, it was bipartisan, prior to earlier this week. You would think that only the Republicans wanted to reform this. There were many Democrats previously calling for the same reforms that were presented in this package. It did not gut this agency, by the way. It just made it more transparent,” Van Flein argued. “They’re going to pursue it. It’s going to come up again,” he predicted. “Because it affects every member of Congress, and it’s extremely unfair, and they at least have the power in their lives to change the law  —   unlike, you know, the rest of us, when an administrative agency or a bureaucracy is unfair to the average person it takes a lot sometimes to get these changes made. ” Kassam asked if Van Flein thought the existing ethics system was abused more frequently to damage Republicans than Democrats. “In general, that appears to be the case,” he said. “Why don’t the Republicans do it back?” asked Kassam. “I would like to believe that the conservatives, at least, believe that there has to be merit before signing your name on a complaint, saying that somebody did something wrong, that there’s some factual basis for this,” Van Flein suggested. “And I would like to believe that at least the conservatives are dealing with the world of facts, rather than a world of delusion. That may not be the case, but I think it is, or at least I think the majority is that way. ” He said using spurious ethics complaints and lawsuits to preoccupy opponents and drain their financial resources implements “at least two of Alinsky’s tactics,” referring to Rules for Radicals author Saul Alinsky. “You can isolate the person and personalize it, even though what we’re really talking about are policy issues that they disagree with. They want to isolate a target and make it personal,” he explained. “And then they want to use the state’s own rules  —   in part that have been written by members of Congress  —   against themselves  —   hold other people accountable to the very rules that they later destroy or abandon or don’t comply with, with impunity, it seems. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628385.2355597}