{"duration": 0.029633045196533203, "input_args": {"text": "'This post was originally published on this site \\nsouthfront.org Loading the player… \\nThis analysis originally appeared in December 2015 \\nRecent days and weeks have seen several news items pertaining to the future state of the Russian nuclear triad. The scope of modernization plans suggests the role Russia’s strategic nuclear forces are to play as of Russia’s security foreign policy. \\nThe scale of Russian strategic nuclear modernization is impressive. President Putin recently attended the laying down of Aleksandr III, the seventh Borey-class ballistic missile submarine out of eight planned which carry 16 multi-warhead Bulava SLBMs each. Three of these ships are already in service, the whole series is to become operational by 2020. It was also announced that the first PAK-DA heavy bomber flight is to take place in 2020, with the aircraft becoming operational by 2025. In the interim, Russia’s Long-Range Aviation will receive several squadrons of Tu-160M2 bombers, whose production is expected to resume in the upcoming years. The Sarmat heavy ICBM research and development has been recently declared complete, and the missile will begin launch testing in 2016 or 2017. The missile’s unique capabilities include the ability to strike any target on the planet using multiple possible trajectories, for example, it could be used to strike North America not only by flying over the North Pole, but also using an alternative trajectory over the South Pole which would render US ABM systems irrelevant. The construction of Voronezh-DM over-the-horizon ballistic missile attack early warning radars is continuing. Finally, the Russian General Staff announced the development of a system allowing strategic ballistic missiles to be retargeted following launch, which thus far was impossible to do because once the target selection was completed prior to launch there was no way to alter it once the missile was in flight. \\nThis brief outline of current developments shows that Russia is pursuing a sophisticated strategy of deterrence. The comparatively small and uniform French, Russian, and Chinese nuclear arsenals are capable of deterring only one threat, namely a nuclear attack on their national territory. The variety of capabilities inherent in Russia’s triad means that its national leadership has a range of responses at its disposal and can use its capabilities to deter not only nuclear attacks against its territory but also conventional attacks against its military targets, including outside of Russia’s borders. \\nSyria is an example of what these capabilities mean for Russia. It is no accident that Putin’s request to raise the strategic nuclear force readiness level to 95% came when he instructed the General Staff to destroy any potential threat to Russian aircraft or ground facilities in Syria. The Russian military presence in Syria is not large enough to guarantee survival against a concerted NATO attack. Fifty aircraft located at a single airbase, even one protected by the S-400, are still vulnerable due to their exposed location and lack of strategic depth. Russian conventional forces could not easily come to Hmeimim’s aid in the event of it being attacked by NATO forces. What makes Hmeimim secure from attack is the credible and flexible deterrence posture. \\nWhat makes that deterrence both credible and flexible is the variety and modernity of Russia’s delivery vehicle force which is not limited to having to launch a multi-warhead ICBM or SLBM, and which can penetrate all current or planned defenses. The credibility of Russia’s nuclear deterrent is strengthened by the existence of a powerful conventional deterrent in the form of Kalibr and Kh-101 cruise missiles. The use of these missiles against ISIS targets was likely motivated to dissuade any countries hostile to Russia’s presence in Syria because it demonstrated Russia could use these weapons to retaliate against any attack on Hmeimim. The target state would then have to choose between backing down or escalating, thus risking a nuclear exchange with Russia. If Russia simply had an ICBM and SLBM force, Hmeimim would be a much more tempting target because an ICBM launch would be disproportionate response to the attack. Russia’s strategic force modernization plans indicate that its leadership anticipates Syria-like scenarios in the years to come. \\nDonate '"}, "time": 1742628571.4005868}