{"duration": 0.08892369270324707, "input_args": {"text": "'Share This \\nAs a Spirit Airlines flight prepared to take off from Fort Lauderdale International Airport in Florida, passengers boarded and attempted to get comfortable. However, it only took one observant passenger’s quick glance to realize the entire flight was in trouble after he spotted what was on a Muslim man’s phone. \\nAutumn Lynn was aboard the flight when she heard a man three rows behind her begin to scream for a flight attendant. It quickly became clear that an “older man of Middle Eastern descent” had been texting a friend about a bomb on the plane – and the petrified man immediately freaked. \\n“We are about to take off and three rows behind me there is a man of Middle Eastern descent that sent a message from his phone which said ‘the bombs are ready,’” Autumn explained on a Facebook Live video, which was taken while she was on the plane, according to Daily Mail . “They have brought us back to the gate, and we’re waiting to be evacuated. He’s still on the plane.” \\nEventually, the pilot declared an emergency evacuation and passengers were taken off of the plane. Autumn witnessed the flight attendants confiscating the man’s cell phone until the Broward Sheriff’s Office deputies arrived, nearly two hours later. \\n“They pulled the man off the plane, he was an older man, of Middle Eastern descent,” Autumn explained. “They ripped him out of the seat and dragged him off the plane.” \\nThe Sheriff’s deputies confirmed the aircraft was checked for any threat and cleared. Thankfully, the man’s texts were false. Unfortunately, for the passengers on the plane, their departure was delayed for over six hours before it took off for their final destination of Dallas/Fort Worth Airport. Reportedly, no arrests were made. \\nAlthough nothing resulted from this particular incident, it’s better that the proper precautions were taken by both the flight crew and the deputies to ensure nothing happened on the plane. It’s better to be safe than to be sorry –especially when we’re talking about the lives of many innocent people.'"}, "time": 1742562353.900548}