{"duration": 0.15009427070617676, "input_args": {"text": "'Picture it: Manhattan, 2017. A crisp Saturday morning. Every table in Rue La Rue Cafe  —   a new restaurant in Washington Heights dedicated to Rue McClanahan and her hit television series, “The Golden Girls”  —   was occupied, including one in a replica of the kitchen set from the show. The pumps Ms. McClanahan (Blanche) wore in the pilot episode are displayed in a glass case. Mannequins draped in her gowns surrounded a pianist and guitarist playing mellow jazz on a corner stage. Behind them, on a pedestal, was her 1987 Emmy for lead actress. When the musicians took a break, a mounted television was turned up so customers could watch episodes that play steadily. Conversation happily quieted as Bea Arthur (Dorothy) and Hal Linden were heard saying good night after a   date. “This is a museum!” said a woman in line to order. From behind the counter, the   Michael J. LaRue, replied, “It’s a museum with good food. ” Few series radiate the necessary warmth to justify a tribute restaurant, but “The Golden Girls,” that enduring electric blanket of American television, is a part of the culture that people have held tight. It has been 25 years since the end of the sitcom about four older Miami housemates  —   Dorothy, the salty wit Rose (Betty White) the lovable dim bulb Sophia (Estelle Getty) the Italian spitfire and Blanche, the Southern vixen  —   but fans keep finding new ways to love it, with countless parodies, action figures and   and Hulu’s recent nabbing of exclusive streaming rights. For all the show’s zany plots, what fans seem to cherish most are the intimate scenes in which the four friends sit around their kitchen table, sharing a cheesecake and talking into the night. That spirit has now become a guiding force for Mr. LaRue, 53, who owns the restaurant with Ms. McClanahan’s son, Mark Bish. Mr. LaRue first met Ms. McClanahan at an animal rights charity event at Studio 54. They quickly became best friends, he said, and she repeatedly asked him, in jest, to marry her so she could be Rue LaRue. When Ms. McClanahan died in 2010, he became the executor of her estate, which includes an extensive personal archive that Ms. McClanahan wanted made available to her fans. “A little voice in my head said, ‘Restaurant! ’” Mr. LaRue said during a recent interview. A   resident of Washington Heights, he had no other neighborhood in mind for the new spot. “Before, we’d have to go downtown for good food and live entertainment,” he said. “I want people to stay in the neighborhood, and if they don’t live here, to come uptown. ” Construction on the space, formerly a pet store, lasted nearly a year. The bathroom was outfitted to match the show’s pink and mint tiles, with a bawdy door Ms. McClanahan had designed for her California house. The banana leaf Martinique wallpaper on two walls was   to match its exact look in Blanche’s bedroom. CHOCnyc, an Inwood bakery, created a cheesecake in honor of each Girl, and the Bronx Brewery provided two custom beers. The menu, from Michele Weber, formerly the chef at Good Enough to Eat, will feature nods to the show  —   lasagna al forno, Genügenflürgen cake  —   and recipes shared by the cast: Ms. Arthur’s chutney, Ms. White’s angel food cake, Ms. Getty’s pasta salad. There are also signature coffee blends: Sophia’s “Picture It” Sicilian Roast (inspired by a favorite line of the character) Rose’s St. Olaf blend, Dorothy’s   Roast, and, for a little spice, Blanche’s Gentlemen Caller’s Beans. “My grandma loved the show,” said Patrick Rickerfor, 41, who was making his fourth visit to Rue La Rue. “She was from Honduras and didn’t understand English all that well, but she got the slapstick comedy. ” Ana Perez, 28, was back for the second day in a row. “I’m a Blanche,” she admitted proudly. Anabel Perez, 23, her sister, said, “I’m a Dorothy. ” “And we’ve got a little Sophia over there,” Ana added, gesturing to their young cousin, buried in a game on her smartphone. “It was my favorite show growing up. That episode where Mario Lopez got deported makes me cry. ” Junko (a Sophia) and Paul Lindberg (a Rose) were   when they noticed that the cafe had opened. They threw their bags down at home and raced over. “We used to walk by here every day, thinking, ‘When’s it going to open? ’” Ms. Lindberg said. “My mom in Japan keeps asking me, ‘Is that cafe open yet? ’” Bix Gabriel, from Bloomington, Ind. and her sister Marisa Gabriel, from Adelaide, Australia, overheard talk of the place in an Ethiopian restaurant a few nights earlier and frantically Googled. “We sang the theme song coming in,” Bix Gabriel said. “The show was so progressive and ahead of its time,” Joe Samalian, Ms. Gabriel’s husband, added. “It passes the Bechdel test like you wouldn’t believe. ” “I must say,” Marisa Gabriel said, leaning in, “‘The Golden Girls’ is the best cure for postpartum depression. I have two children, and I watched it each time, and it helped me immensely. ” Mr. LaRue echoed a similar sentiment: “I know people who put on ‘Golden Girls’ DVDs the way others take a Valium. ” One of the walls features photographs of Ms. McClanahan’s six husbands, while another is dedicated to Ms. White, the last surviving Girl, who hopes to get to Rue La Rue in the spring. Near the end of Ms. McClanahan’s life, Ms. White sent her a fresh orchid every week, as well as pears and oranges from California. “She would call and say, ‘Can I talk to Ruesy? ’” Mr. LaRue recalled. “One day, right before the stroke, do you know what they were talking about? Ryan Reynolds. Betty was in that movie ‘The Proposal,’ and Rue’s in the hospital, like, ‘Who’s that young man? He’s delicious.’ She was   up until the last minute of her life. ” Mr. LaRue is full of these stories, and happy to share them. “She sewed for me, she baked for me,” he said. “My mother died when I was 8 years old. I had this hole in my being that I didn’t even realize. ” A sidewalk plaque at the entrance bears Ms. McClanahan’s name and the opening lyrics of the show’s theme song, “Thank You for Being a Friend. ” Some of her ashes are buried underneath. “There’s never a time when ‘The Golden Girls’ is not playing on this globe,” Mr. LaRue said. “It taps into something that we all share as human beings  —   a fear that as we age we’re going to become irrelevant and alone. The show is a tonic for that fear. It says you can still look good and have sex and have a very full life, with friends. ” “I once asked Rue why she got married so often, and she said, ‘I don’t want to die alone,’” he recalled. “And she didn’t I was there, holding her. I was able to look in her eyes and tell her, ‘Everything’s going to be O. K. you have nothing to worry about. ’” He smiled, suddenly teary. “I still miss her. ” Looking around the cafe, he added, “But she would love this. ” On the television, Ms. McClanahan, Ms. Arthur and Ms. White sang “Mr. Sandman” to lull a baby to sleep. Patrons, seeking shelter from the cold, happily watched. The baby quieted, and the Girls tried to tiptoe off. He cried, and they started up again. They sang until he slept.'"}, "time": 1742563982.45161}