{"duration": 0.1408534049987793, "input_args": {"text": "'Yahoo News FBI Director James Comey wrote his bombshell letter to Congress on Friday about newly discovered emails that were potentially “pertinent” to the investigation into Hillary Clinton’s private email server before agents were able to review any of the material because the bureau had not yet gotten a search warrant to read them, three government officials who have been briefed on the probe told Yahoo News. \\nWhen Comey wrote the letter, “he had no idea what was in the content of the emails,” one of the officials said, referring to recently discovered emails that were found on the laptop of disgraced ex-Rep. Anthony Weiner , the estranged husband of top Clinton aide Huma Abedin. Weiner is under investigation for allegedly sending illicit text messages to a 15-year-old girl. \\nAs of Saturday night, the FBI had still not gotten approval from the Justice Department for a warrant that would allow them to read any of the newly discovered Abedin emails, and therefore are still in the dark about whether they include any classified material that the bureau has not already seen. \\n“We do not have a warrant,” a senior law enforcement official said. “Discussions are underway [between the FBI and the Justice Department] as to the best way to move forward.” \\nThat Comey and other senior FBI officials were unaware of what was in the emails — and whether they contained any material the FBI had not already obtained — is important because the campaign of Donald Trump and Republicans in Congress have suggested that the FBI director would not have written his letter unless he had been made aware of significant new emails that might justify reopening the investigation into the Clinton server. \\nBut a message that Comey wrote to all FBI agents Friday seeking to explain his decision to write the controversial letter strongly hinted that investigators did not not yet have legal authority establishing “probable cause” to review the content of Abedin’s emails on Weiner’s electronic devices. \\nIn that message, Comey told agents that he had only been briefed on Thursday about the matter and that the “recommendation” of investigators was “with respect to seeking access to emails that have recently been found in an unrelated case.” \\nComey approved the recommendation to seek judicial access to the material that day, he wrote. \\n“Because those emails appear to be pertinent to our investigation, I agreed that we should take appropriate steps to obtain and review them,” he told agents. Comey’s letter to Congress has brought the FBI director under withering criticism. Top Justice Department officials were described by a government source as “apoplectic” over the letter. Senior officials “strongly discouraged” Comey from sending it, telling FBI officials last week it would violate longstanding department policy against taking actions in the days before an election that might influence the outcome, a U.S official familiar with the matter told Yahoo News. “He was acting independently of the guidance given to him,” said the U.S. official. \\nComey insisted in his message to agents that he felt he had “an obligation” to inform Congress about the new material because he had previously testified that the bureau’s investigation into the Clinton email server was completed. He said it would be “misleading to the American people were we not to supplement the record.” He added, “Given that we don’t know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression.” \\nThe decision to send the letter “wasn’t easy,” said the senior law enforcement official. Comey and top FBI officials debated what course to take once they learned about the discovery on Weiner’s laptop –– said to include thousands of Abedin’s emails. In the end, the official said, Comey feared that if he chose to move forward and seek access to the emails and didn’t immediately alert Congress, the FBI’s efforts would leak to the media and the director would be accused of concealing information. \\n“This was the least bad choice,” the senior official said. \\nBut Comey’s letter to Congress — suggesting that the FBI might now revisit the Clinton email probe — may have been even more misleading, some critics charged Saturday. \\n“This letter is troubling because it is vaguely worded and leaves so many questions unanswered,” Sen. Patrick Leahy, the ranking Democrat on the Senate Judiciary Committee, and three other Democrats on the panel wrote Comey and Attorney General Loretta Lynch. \\n“It is not clear whether the emails identified by the FBI are even in the custody of the FBI, whether any of the emails have already been reviewed, whether Secretary Clinton sent or received them, or whether they even have any significance to the FBI’s previous investigation,” the senators wrote. A Yahoo News review of Abedin’s interview with FBI agents last April — when the Clinton email probe was in full swing — shows that the longtime Clinton aide hinted that there might be relevant material on her husband’s personal devices. But agents do not appear to have followed up on the clues. \\nAbedin, who served as Clinton’s deputy chief of staff and held a top-secret security clearance, disclosed she had access to four email accounts while working at the State Department. \\nThese accounts, Abedin said, included an official State Department email account, but also an account on Clinton’s private email server that Abedin used to communicate with Clinton and her top aides, as well as a personal Yahoo account. She used both the Clinton email account and the Yahoo account to “routinely” forward State Department emails and documents so she could more easily print them, she said. In addition, she told the agents, she had a separate email account that she had previously used “to support her husband’s political activities.” \\nAbedin’s interview — conducted by agents at the FBI’s Washington field office last April 5 — was the first tip-off that the longtime Clinton aide might have circulated official State Department material among her multiple accounts. At one point, agents even confronted Abedin on one apparently sensitive email about U.S. policy towards Pakistan that had been forwarded to her State Department account from an aide to the late Richard Holbrooke, then a special State Department envoy to Afghanistan and Pakistan. Abedin had forwarded the email to her Yahoo account in order to print it, but told agents she was “unaware of the classification of the document and stated that she did not make judgments on the classification of material she received. Instead, she relied on the sender to make that assessment and to properly make and transmit the document.” There is no indication from the eight-page FBI report on the interview, however, that the agents ever pressed her on what has now turned into an explosive issue in the final days of the 2016 campaign: Did Weiner have access to any classified government documents on his laptop and iPhone — devices that, he apparently used to exchange sexually charged messages with women he met online, including in one alleged case, an underage teenager in North Carolina? \\nThe fact that FBI agents failed to do so shows that the original probe into the Clinton email server was “not thorough” and was “fatally flawed,” said Joseph DiGenova, a former U.S. attorney and independent counsel who has been a strong critic of Comey and the FBI probe. “The first thing they should have done was gotten a sworn affidavit about all her accounts and devices,” he said, adding that agents should have immediately followed up to obtain the devices, including Weiner’s. \\nBut it is still far from clear which State Department emails might be on the devices that Weiner had access to. In a separate civil lawsuit brought by a conservative group, Judicial Watch, Abedin gave testimony in June that appeared to differ in some respects from what she told the FBI. Asked in that case about her email accounts, Abedin told Judicial Watch lawyers that she rarely used the personal Yahoo account, and that when she did, she only used it to forward State Department “press clips” so she could print them.'"}, "time": 1742562300.8802652}