{"duration": 0.0588984489440918, "input_args": {"text": "'BREAKING: Soros Election Tampering Explodes… Illegally Funneling Cash \\nI am very sorry when children have nightmares. I don’t want children to have nightmares. Nobody on Conservative Tribune’s staff wants children to have nightmares. I think I can safely stake that out as our editorial policy without consulting too many of my superiors. \\nHowever, from that starting point on which Ms. Schmidt and I can surely agree, here are two reasons why I believe this story is prima facie bosh. \\nFirstly, I question the genesis of this nightmare, and I find it unbelievable that the writer didn’t. Did Schmidt not think that the child’s bad dreams might have been the result not of the perfidy of Donald Trump but of the political leanings and discussions of her parents? If she did, does she not feel that maybe the tone of the piece was out of line? \\nSecondly, let’s assume that these parents have been completely unbiased in presenting the election to their children (which I find an unlikely possibility, but hey, it could happen). The world can be a nightmarish place — and unfortunately, one of the things that makes it that way is an extremist movement connected, however tangentially you believe it to be, to their religion. \\nIf you want to talk about bad dreams, talk to survivors of the San Bernardino terrorist attack . Talk to survivors of the Boston bombing. Talk to survivors of 9/11 . These people have very real nightmares, sometimes each and every night, about very corporeal things done to them in the name of Islam — and they’re the ones who survived . \\nThese aren’t idle thoughts. They are concrete events. \\nFor that matter, it’s worth pointing out that the same terrorists probably wish to perpetrate the same nightmarish fate (or worse) on this 7-year-old and her family, simply for the crime of being Westernized. Is this what we wish to ignore in the name of making Donald Trump our national bogeyman? \\nIf Schmidt is so concerned about the nightmares that Trump’s candidacy is giving 7-year-olds, perhaps she ought to go talk to grown men and women who still have those nightmares, thanks to radical Islamic terrorism. \\nIf the topic of radical Islamism and how to prevent it is so traumatizing to your children, it’s time to turn off the TV instead of blaming those willing to address it. \\nPlease like and share on Facebook and Twitter if you agree The New York Times’ story is balderdash. What are your thoughts on this story? Scroll down to comment below! Advertisement Popular Right Now'"}, "time": 1742564539.7294748}