{"duration": 0.05494403839111328, "input_args": {"text": "'Politics US Republican presidential nominee Donald Trump gestures while speaking to a crowd of donors at the McGlohon Theater in Charlotte, North Carolina, on October 26, 2016. (Photo by AFP) \\nUS Republican presidential nominee Donald Trump will win the November 8 election, says an American professor who has correctly predicted almost every presidential election in the United States. \\nProfessor Helmut Norpoth, of New York’s SUNY Stony Brook University, said his model shows Trump performed comparatively better in the primaries so he will triumph next month, The Independent reported on Thursday. \\nNorpoth developed a model which, when applied retroactively, successfully predicted every presidential election in the United States since 1912 all but one, which was the 2000 election, when it said Democratic nominee Al Gore would beat Republican candidate George W. Bush. But instead Bush won the election. \\nAl Gore won the popular vote, but Bush was awarded more votes in the Electoral College following a disputed result in Florida. So Bush was declared winner. \\nThe political scientist’s model suggests that the person who emerges as the strongest candidate in the primaries will go on to win the presidency. \\n“I think he was the strongest candidate in the primaries and that he will prevail,” Professor Norpoth told the New York Post . \\n“The model predicted a Trump win in February and nothing has changed since then. Whatever happens in the real world doesn’t affect the model,” he stated. US Democratic presidential nominee Hillary Clinton Professor of Political Science at Stony Brook Helmut Norpoth, New York \\nRecent polls show that Democratic presidential nominee Hillary Clinton Clinton’s national lead over Trump is shrinking as Election Day is approaching. \\nThe former secretary of state has the support of 49 percent of likely voters, while the billionaire businessman has 44 percent support, according to the CNN/ORC survey released on Monday. \\nIn addition, preliminary figures suggest the US presidential race remains tight in so-called swing states, despite boasting by Clinton’s campaign that she is far ahead. \\nClinton, the Democratic presidential nominee, has an edge in several of the roughly 10 swing states that will decide the 2016 White House race. \\nTrump has also potential advantages of his own in some battleground states. \\nOn Wednesday, Trump said that he would win the key battleground states of Ohio, Florida and North Carolina, that could help him claim the election. \"I think I\\'m gonna win,\" Trump told ABC News. \\nThe billionaire said that he intends to pour in millions of dollars in the final days of the campaign. Loading ...'"}, "time": 1742564597.1050425}