{"duration": 1.4692833423614502, "input_args": {"text": "'ESCADA, Brazil  —   Not a soul was in sight on the narrow dusty street, except for a cat skittering under a   moon. It was 2:30 a. m. and in a small pink house up 29 steps carved jaggedly into a red clay embankment, Vera Lúcia da Silva was readying her baby for a journey to the city of Recife, two and a half hours away. Cradling Sophia Valentina, she walked through the   town, then climbed into a government van for the jostling ride, arriving just after sunrise. They make the arduous trip several times a week. It is the only way to get the treatment and therapy Sophia needs for an ominous array of problems caused by the Zika virus. Now more than a year old, Sophia is a child of the Zika epidemic, one of nearly 2, 500 babies in Brazil born to infected mothers, with brain damage so profound the consequences are only beginning to be understood. Thirteen months after the World Health Organization declared Zika a global health emergency, some of the public alarm over the   virus that swept through Latin America is receding. In November, the W. H. O. lifted its emergency designation, but Zika has hardly disappeared. Thousands of new Zika infections continue to be reported throughout Latin America, and W. H. O. officials said that their action simply signals that, like malaria or yellow fever, Zika is a continuing threat in the region rather than an urgent pandemic. For families of Zika babies, however, the disastrous effects are only deepening. That is especially true in the impoverished cities and villages of northeastern Brazil, where the connection between the mysterious virus and infants born with tiny misshapen heads was first detected and where hundreds of families are struggling to give these babies the best lives possible. Family relationships have been upended, precarious livelihoods shattered. Some parents have had to leave jobs to devote themselves to their child’s care. High rates of teenage pregnancy in Brazil add another layer of hardship, as adolescents with braces on their teeth and homework to finish find themselves the mothers of afflicted infants. And doctors and researchers are just starting to grasp the medical consequences of Zika. Besides the alarmingly small heads characteristic of microcephaly, many babies have a long list of varied symptoms, leading experts to rename their condition “congenital Zika syndrome. ” They can have seizures, breathing problems, trouble swallowing, weakness and stiffness in muscles and joints preventing them from even lifting their heads, clubbed feet, vision and hearing problems, and ferocious irritability. Some have passed their first birthdays, but have neurological development closer to that of    infants, doctors say. Some microcephaly cases appear so dire that experts liken them to a previously rare variant called “fetal brain disruption sequence. ” And new issues keep cropping up, including hydrocephalus, excess fluid in the brain. Now, new waves of impaired children, who appeared normal at birth, are being identified. For some, microcephaly and other symptoms are emerging months later, as their brains, with malformations or debilitated or destroyed cells, fail to develop enough to match their physical growth. Experts predict there will be more children who still seem unaffected, but whose problems will surface in toddlerhood or their school years. Doctors don’t yet know the extent of the disease, said Dr. Vanessa Van der Linden, a neuropediatrician in Recife who helped discover the link between Zika and microcephaly. “We only know what’s easy to see. ” Dr. Van der Linden is one of scores of devoted doctors and therapists helping families at public and nonprofit hospitals and clinics. Brazil’s government is drawing on its overstretched resources, including providing modest disability payments to poor families. Many families are on waiting lists for services. Therapy programs sometimes drop children because their development is too stunted for therapy to help any further. For older babies who still cannot make eye contact or interact, Dr. Van der Linden said, “if you did physical therapy every day, it doesn’t mean they will be better. ” For Zika families, the difficulties are only beginning. The children are still small enough to be held, fed and carried. But ultimately, many may be unable to walk, attend regular schools, or live on their own as adults. “These babies, most of them or all of them, they’re going to live very long lives, you can keep them alive a long time, and they will need assistance from someone 24 hours a day,” said Dr. Ernesto Marques, an infectious disease expert at the University of Pittsburgh and the Oswaldo Cruz Foundation in Recife. “The consequences to the society are huge. ” These are the stories of three families: a couple persevering with ingenuity and grit despite their baby’s frequent medical setbacks a girl who became a Zika mother at 14, forcing her to mature well beyond her years newlyweds whose relationship could not withstand the pressures of caring for their disabled baby. “Grave risk of aspiration,” read the piece of paper near the bed where Ms. da Silva was wrapping Sophia in a pink hooded fleece for their     walk to the van. A doctor had explained what that medical report meant. “She is going to choke,” Ms. da Silva said, twisting her fingers anxiously. “Food is going to go to her lungs. ” Sophia had serious dysphagia, swallowing problems afflicting older Zika babies whose brains cannot coordinate skills for eating. Doctors advised adding thickener to her formula, but if unsuccessful, she would need a feeding tube threaded through her nose. A previous feeding tube had caused Sophia to vomit black blood. “I am asking God that she will not have to use the feeding tube,” Ms. da Silva, 32, implored, as outside, roosters crowed in the darkness and dogs barked like town criers. Her husband, Ronaldo, 34, tried to reassure her. “God,” he said, “would never give us 100 kilos if we could only carry 50 kilos. ” But the weight keeps piling on. After another    van ride to Recife and hours of waiting on hard plastic chairs, Sophia, in a ruffled top with pink hearts and “Love” spelled in rhinestones, was placed on an elevated mat at the Altino Ventura Foundation clinic. Five therapists examined her. One shook a yellow rattle by her ear. Another removed Sophia’s tiny lavender eyeglasses, waved a shiny silver pompom and flickered a flashlight, but her eyes seemed barely able to follow the stimuli. “Sophia is a child with very compromised visual, auditory and motor skills,” concluded Kyrla Melo, a physical therapist. “She has no head control, she does not roll over, she does not sit. ” Already, another clinic had discharged Sophia from its physical therapy group. “The doctor said Sophia was not developing,” Ms. da Silva said. “Children who are not developing are getting dropped from the therapies. ” She was upset. “I think it is very wrong. Their duty was to work so our babies would develop. ” Sophia’s parents provide any support they can. They fashioned homemade versions of the physical therapy equipment clinics use: They made rattles of Coke bottles filled with beans they placed colorful plastic balls in a tiny inflatable pool they stuffed a pair of Mr. da Silva’s jeans with plastic foam, to prop Sophia into a sitting position. A doctor told them bright colors might stimulate Sophia’s vision, so they painted their gray door and shutters pumpkin orange, changed curtains and sofa covers to cherry red, and draped sunny yellow fabric in the kitchen. Resourcefulness is second nature to them. Before they married, Mr. da Silva, who works painting oil refinery pipes, spent a year of evenings   and leveling a plot atop a cliff strewn with scraggly plants, preparing ground for their house, with its corrugated red tile roof and laundry lines spangling the sides. The cliff borders one side of a narrow cobblestone street. On the other side, houses are at or below ground level, with barred windows to deter thieves and drug dealers. After their first child, Richarlisson, was born, Ms. da Silva, a former teacher, tried five years for another pregnancy, losing one to miscarriage. At three months pregnant with Sophia, near a neighbor’s well, a mosquito bit her arm. She developed diarrhea and a rash on her arm, belly and face. A doctor said it could be chikungunya, a   illness that seldom has lasting effects and is not transmitted to a fetus. Zika, carried by the same mosquito, was barely known in Brazil then. Things seemed fine until a   ultrasound. “Your daughter has microcephaly,” a doctor told Ms. da Silva. “A smaller head, and the child’s brain has not developed. ” Ms. da Silva despaired. Still, two weeks later, when a doctor said, “If you don’t want a child with microcephaly, you are not obligated to have it,” she rejected abortion. “No, even if she has microcephaly, I am going to love her the way she comes,” she said. At birth, Sophia’s left leg hooked across her body and a doctor announced, “Sophia Valentina is not going to walk. ” Ms. da Silva got angry. “You think you know more than God, huh?” she chastised the doctor. “My daughter is not even 24 hours old. ” Using baths to relax the leg and gently manipulating it in a cloth diaper sling, Ms. da Silva and her sister coaxed it into normal position. Another doctor said Sophia’s hands were “not going to hold anything” the da Silvas trained her fingers to grasp lollipops and shake rattles. When neighbors gossiped, one saying Sophia had “a deformed head and a crippled leg,” Mr. da Silva talked his wife out of confronting them. Some people are kind, he said, like his boss, who kept him on when difficulties forced the company to lay off all but seven of 300 employees. Still, Ms. da Silva spent five months arguing with city officials who kept denying her government van rides to Recife. She called one employee “Satan,” and finally landed a seat after threatening to alert a newspaper and embarrass the mayor in an election year. But whenever Sophia’s doctors schedule new appointments, Ms. da Silva must walk 40 minutes to reserve a van seat in person with the health department during certain hours. They sometimes miss previously scheduled appointments to reserve a van for another appointment. One morning, Sophia stopped moving. She was breathing, her eyes were open, but her body seemed frozen. Ms. da Silva wept, “afraid of losing my little doll. ” Sophia was weak and undernourished because she had not adapted to the nasal feeding tube inserted two weeks earlier. Doctors said she would need a new tube every 15 days. The next month, November, Sophia was hospitalized for 10 days for pneumonia. In December, a shunt was inserted in her brain, which had filled with excess fluid, causing 32 seizures in one day. January brought another hospitalization for pneumonia. Sophia, now 14 months old, is on a waiting list for an abdominal feeding tube. “My daughter is a warrior,” Mr. da Silva said. On the red sofa behind the orange shutters, Ms. da Silva gazed in anguished wonder at her baby girl. “Sophia Valentina,” she murmured. “She is going to surprise me. ” Alícia Isabela do Nascimento Martins was born two months premature, delivered by emergency cesarean section. She was hospitalized for 70 days, until her lungs could breathe on their own, her heart could beat steadily, and her body no longer needed a feeding tube. But doctors could not fix the brain damage she suffered when her mother was infected with Zika during pregnancy. Alícia, now nearly 18 months old, has microcephaly, rigid muscles, seizures, and problems with vision, breathing and swallowing. Raising such a baby would challenge anyone, but Alícia’s mother, Íris Adriane do Nascimento Santos, is practically a child herself. She gave birth at 14. Nearly 450 teenagers have given birth to babies with microcephaly in Brazil’s epidemic, Health Ministry officials said. Some juggle school with caring for these infants. Some rely on their parents. “I never imagined that situation,” Íris said, braces on her teeth glinting as she struggled to quiet Alícia with one of her only successful methods, repeatedly playing a musical cartoon on her cellphone. “This feeling, this reality,” she said, voice strained. “It was devastating. ” Her pregnancy so young angered her mother, who nonetheless rushed Íris to the hospital at seven months, rather than let her lose the baby. From the beginning, Íris endured scare after scare. Once, Alícia’s heart stopped “in front of me,” she said. She cried because Alícia had “such a little head,” but doctors waited a month to tell her Alícia had microcephaly and brain calcifications, confirmed by a brain scan. When Alícia was finally discharged from the hospital, Íris sank into a deep depression, enveloped, she said, by “a feeling of rejection” toward her baby. “I did not have that ‘daughter love. ’” They moved in with Alícia’s father, Túlio Martins de Cristo, 20, in the house where his mother lived. He and his mother fed, diapered and did almost everything for Alícia. “Íris would sleep,” said her mother, Enilsa José do Nascimento, 45, a nurse technician. “And her baby would be next to her bed, crying, screaming. ” Íris didn’t even go to the hospital when, twice, Alícia stopped breathing from apnea. Íris was “unlit to life,” her mother said. Without her boyfriend and his mother, “I think her baby would have died. ” Her mother brought Íris salads and juices, urging her to eat. “You have a baby that depends on you,” she said. “Look, she is not ugly, your baby is so pretty. ” Finally, her boyfriend’s mother urged Íris to attend a meeting of the Union of Mothers of Angels (U. M. A.) a group of around 350 Zika mothers. “There were mothers in the same situation as me and even others in worse situations,” Íris marveled. Suddenly, Íris was overcome with urgency to improve Alícia’s chances. “Jeez, get up, Íris!” she told herself. “My God, I am losing time!” She told her mother: “I have to make my daughter walk. If she cannot walk, she is going to be able to see. ” Everything changed. Through rigorous exams, she had qualified for a competitive school, but she switched to a night school. She now takes Alícia to at least two therapy and doctors’ appointments daily, usually in Recife, two hours and at least two bus rides from her hometown, Paulista. She moved in with her mother and    sister, who watch Alícia while Íris attends classes from 7 p. m. to 10 p. m. Afterward, she does homework, then rises when Alícia wakes, often at 4 a. m. On Alícia’s first birthday, Íris had planned visits to three clinics for vision, touch and physical therapy. They also visited Dr. Cristiane Marcela Santos, an ear, nose and throat specialist at Agamenon Magalhães Hospital. “Fifteen?” Dr. Santos exclaimed, stunned that Íris was so knowledgeable. “You are 15 years old?” Everywhere, Íris said, “I ask a lot of questions. ” In pink shorts and lavender top, Alícia’s body resembled a   ’s, but her head was 36 centimeters in circumference, well below normal. Her good hearing and diminished irritability are positive developments, but other symptoms include tight muscles. To keep her hands unclenched, her fingers were splayed open with bright pink tape, which is sometimes also applied to relax her back and chin. Dr. Santos asked about Alícia’s early brain scans. “Calcification in almost all of her brain,” Íris replied. “Has she ever gotten so suffocated that she turned purple and you had to tap her back?” “It happens a lot,” Íris said. “Very serious,” Dr. Santos said. As a mother, Íris seemed “very secure and mature,” Dr. Santos said. “Life made her like this. They stop their own lives so they can live their children’s lives. ” Now just past her 16th birthday, Íris has no time for angst. “I changed my life for Alícia,” she said. “It was me for her and her for me. ” Benches were filling with Zika mothers outside the Association for the Assistance of Disabled Children in Recife when Jaqueline Vieira arrived, cradling her son Daniel, his head too small for his   body, his fingers folded into fists. Blue eyeglasses were strapped to his head, and blue braces decorated with pictures of Mickey Mouse were strapped to his legs. The braces were supposed to be worn all day to fix his   “ballerina feet,” Ms. Vieira knew. But the metal scratched her and made cuddling Daniel uncomfortable, so she mostly put them on for public outings. It was the kind of balancing act she’d become used to. Raising Zika babies is hard enough for families with stable marriages and incomes. But Zika has ripped some marriages apart and torn economic safety nets. Since Daniel’s birth 16 months ago, Ms. Vieira has separated from her husband, lost monthly government assistance, relinquished a job and now patches together a livelihood with other government help. On the bench that Monday, Ms. Vieira barely registered that it was her 26th birthday. Over the weekend in Olinda, their hometown up the coast from Recife, Daniel had convulsed in seizures for three hours straight, his lips purple. Ms. Vieira feared he would stop breathing, but couldn’t get to a hospital with doctors on duty from her downtrodden neighborhood at that late hour, when rats scurry on the rutted roads but no buses were running. She and the other mothers compared notes. One said she briefly couldn’t find her baby that morning, then noticed he’d rolled off the bed. “That’s good,” another said. “He moved. I wish I had a baby like that. ” Suddenly, a van appeared, transporting them to a beauty parlor for pampering paid for by a local singer. At the Velvet Salon, the air was gauzy with   mist. Mothers rested their babies on   settees. Ms. Vieira left Daniel with a cousin because being inside too long agitated him. She chose a   manicure: “She Said Yes” as a base coat, “Kitty White” on top. A hairstylist turned her unruly dark curls straight and shiny. Gazing into a mirror, she snapped a selfie. “Look at me!” she crowed. The respite was  . That afternoon, Daniel’s medicine ran out and Ms. Vieira had no money for more. Daniel’s very conception defied the odds. Ms. Vieira developed uterine cancer when her other child was a toddler. She had resisted doctors’ advice to have her uterus removed, even though they said her chances of having another child were slim. While undergoing chemotherapy, she began dating Dalton Douglas de Oliveira, five years her junior, who attended her evangelical church. They rushed marriage so their church wouldn’t learn of their premarital sex. A month after the wedding, she learned she was three months pregnant. “It was the biggest joy of my life,” she said. Her husband was excited, too. “We wanted to have our child,” he said. Still, “the belly condemned us,” he said, causing stress because what had clearly been a   conception prompted the church to bar them from communion for months. Five months into pregnancy, Ms. Vieira became distraught when a doctor said that an ultrasound showed hydrocephalus, a   brain, and that the baby might die, she recalled. But at seven months, another doctor disagreed, saying, “Look, your son is special, he has a small problem, but what he has is microcephaly,” Ms. Vieira said. “It was good news. ” Her relief evaporated after Daniel’s birth. “I thought it was God’s punishment because I got pregnant even though I was not supposed to,” she said. Caring for a sick child strained the couple’s relationship. Daniel cried so inconsolably that “I thought my life would end,” Ms. Vieira said. Mr. de Oliveira said his wife would not ask him for help and admitted he was too angry at her to offer. “My problem was direct with her and not with the baby,” he said. At two months, Daniel awoke laboring for breath. At the hospital, Ms. Vieira recalled, doctors suspected mold or dust at home was aggravating his lungs, and recommended improving their home’s air quality or moving. Mr. de Oliveira thought his wife, long embarrassed by their     home, was exaggerating. She found another house he declined to move. Things exploded after that. Ms. Vieira gave television interviews claiming her husband “would not give attention to the boy,” she said, adding that the publicity prompted donations from abroad. He retaliated, posting a video insulting her. She began dating and told him, “You are not going to see your son,” he said. After technical disputes about child support, he stopped paying. And when he ignored her on the street, she told people he was really shunning Daniel’s illness. Ms. Vieira, a former supermarket bakery worker receiving government assistance for cancer, struggled to afford Daniel’s seizure medicine, Sabril, about 300 reais ($97) a month. To help, a group of police officers began buying it, and she and other mothers sometimes shared pills. But Daniel’s seizures worsened, seemingly weakening his ability to support his head. She made a cellphone video documenting one episode. “Do you see his little shoes shaking?” she asked. Ms. Vieira started giving Daniel more Sabril  —   three   daily instead of the prescribed two. After his   seizure crisis, she gave him four. Then she ran out. “I had this crazy feeling,” she said. “He had to take the medication, no matter how. ” She called the police officers, but they couldn’t gather enough money. She texted 319 U. M. A. members on WhatsApp. Hours passed. Nobody had extra Sabril. Desperate, she called her estranged husband at his plaster business, demanding the unpaid child support. “If I had it, I would have given it to you,” he said. Borrowing his mother’s credit card, he visited five pharmacies before finding Sabril. Ms. Vieira, in a turquoise U. M. A.   that said “Microcephaly, it’s not the end,” made him pass the medicine through the window bars of her mint green,   house. Soon after, the government stopped Ms. Vieira’s cancer assistance, concluding that she could work. But she felt unable to handle a job, and now collects unemployment and will apply for government Zika benefits. Mr. de Oliveira, 21, resumed paying child support, and increased the amount. Ms. Vieira now allows him to see Daniel. “I still pray to God so that he can be a healthy and perfect child,” he said. “I keep asking, keep asking, keep asking. ” The afternoon after the medication crisis, Ms. Vieira, sifting among pregnancy ultrasounds showing Daniel’s underdeveloped head, found a photo of him smiling. “I love this smile,” she said. Because of Daniel, “I am a better human being,” she said, adding that “if I had had a normal baby, I would not have given as much attention. ” She worries about being inattentive to her    João Pedro. Even while walking him home from school, she carries Daniel, shielding him from sun with a turquoise umbrella. One day, João Pedro playfully covered Daniel’s face with his hand, chanting, “Are you smiling?” When Daniel didn’t respond, João Pedro scampered to a rusty playground, near weathered horses nibbling meager grass. Later, when his neurologist, Dr. Maria Durce Costa Gomes Carvalho, squeezed Daniel into her packed schedule, his rare smile was still absent. He cried and cried. “Look at this tantrum, Daniel, oh my God!” Dr. Gomes exclaimed. “He did not used to be like this,” Ms. Vieira said. Dr. Gomes asked if Daniel looked at things. “Not a lot,” Ms. Vieira said. “Even with glasses?” “No. ” Daniel’s medication was adjusted, reducing his seizures. Dr. Gomes couldn’t predict if he would walk or talk. “What matters  —   right, Jaqueline?  —   is their every achievement. ” Ms. Vieira sighed. “I cannot wait,” she said, “until he falls out of bed. ” Fluffy clouds fluttered over Maria Farinha Beach one Sunday morning and vendors traipsed through the coconut palms selling quail eggs. The   sand was soft, and Ms. Vieira brushed Daniel’s hand through it, trying to awaken his sense of touch, supporting his stiff torso while his head slumped forward. Just days after the salon outing, her hair had reverted to springy curls. She looked tired. She took Daniel to the water, filled with romping children. She dipped him in the ocean, jumped him over a wave, swung him high, and dipped him again.'"}, "time": 1742563893.1612766}