{"duration": 0.047417402267456055, "input_args": {"text": "'US Presidential Elections Sound a Warning of Catastrophes to Come By Daily Bell Staff - November 08, 2016 \\nWhat’s wrong with Hillary Clinton’s brand? … As momentous an occasion as this should be for women around the world, Ms. Clinton would begin her term in the Oval Office with her unpopularity ratings at near-record levels. All of which leads to the question: What’s wrong with Brand Hillary? – The Globe and Mail \\nIn the run-up to today’s election, many articles on Hillary in the mainstream media have tried to explain more fully why Hillary is electable and desirable as the leader of the US. \\nA common theme of these articles is that Hillary’s troubles are not mentioned or analyzed in detail. The Economist magazine, like many other publications, recently came out with an endorsement of Hillary. \\nBut the endorsement simply dealt with Hillary’s legislative and professional history. As always when it comes to Hillary in the mainstream media, deeper questions are glossed over. \\nThis approach to covering Hillary is deliberate and has generated increasing skepticism among large portions of the American public. Correctly, alternative media reports have pointed out this declining credibility but not enough have explained its widening ramifications. \\nMore: \\nMs. Clinton is one of the most qualified presidential candidates in recent memory – and her credentials are that much more impressive compared to those of her opponent. \\nAfter her time as first lady – in the state of Arkansas, and in the White House – Ms. Clinton served her country as a U.S. Senator and as secretary of state. \\nThe article goes on to ask why Hillary has not been “able to break through in a way that inspires fervent support and popularity.” \\nAt this point a significant analysis would grapple with underlying issues regarding Hillary’s background and approach to politics and life. These issues are well known. But instead, these issues are presented as “multiple scandals, ranging from Lewinsky to Benghazi, and most recently, her e-mails.” \\nThe use of the word “scandal” implies something embarrassing. The significance of these problems in her personal and professional life goes far beyond embarrassment. It illustrates her approach to the US political system and generally how she wields power. \\nHaving skipped past this analysis, the article then minimizes the scandals themselves, stating, ”Any politician who has been in the game that long has their fair share of scandal.” \\nThe article continues to evolve toward ephemera, suggesting that a big problem with Ms. Clinton is her inability to “appear likable to voters.” This is a political problem to be sure, but it is not the UNDERLYING problem, which is much more significant. \\nFinally, the article brings up the idea that a big reason for the disconnect between Hillary and voters has to do with her gender. “As disheartening as that still is, society and the media still stereotype women and paint them with a negative brush.” \\nThe article explains that much criticism of Hillary is gender-related. She has been scrutinized because of her health problems and has too-often been seen by the media as a wife and mother rather than as a businesslike politician with a long, professional history. \\nAs stated, articles like this are at variance with what many believe to be true. Hillary is seen, at this point, by tens of millions as a person with an extremely shady past who may be part of a larger political mafia with her husband that deals in extortion, cover-ups, drug-dealing and even murder to generate vast profits for their Clinton Foundation, and thus for themselves. \\nSince this information is so widely dispersed, articles that don’t deal more directly with these issues can be seen either as painfully naive or as concealing something. It is one of the reasons that trust in the mainstream media has plunged so precipitously. \\nAdditionally, as we pointed out recently, belief in “conspiracy theories,” has risen to over 50 percent. Hillary’s campaign and its coverage may be directly responsible. Once people were increasingly and regularly exposed to the disconnect between what they believed about Hillary and what was being presented, they began to reexamine various “conspiracy” reports they’d previously discounted. \\nEven among those voting for Hillary, there is widespread sentiment that she may have committed criminal wrongdoings and deserves a trial rather than the presidency. \\nWe’ve advanced the idea that none of this has come about by accident, not the FBI fumblings, nor reports of her healthcare problems, nor even the email “scandals.” All of this in fact was known well in advance of her latest presidential run. \\nThis is simply not a coincidence in our view. The idea, increasingly it seems, is to shatter cultural cohesion in the West with an eye toward creating increased globalization and an internationalized society. This presidential election and its mainstream coverage has done just that. \\nGoing forward, it is probable that cultural destruction will be increasingly significant throughout the West, employing numerous strategies – political, ethnic, economic and military. \\nThese elections – whether Hillary wins or Trump – are evidently the starting gun, along with the European immigrant crisis, for a new series of elite programs. These will likely yield up serial catastrophes that will change lives and belief structures going forward for millions and even billions \\nConclusion: Building an international world, whether the effort is to be successful or not, is a massive and horribly disruptive and bloody prospect. Americans would be wise to perceive this latest presidential elections as a kind of warning of what it is to come.'"}, "time": 1742628509.0139806}