{"duration": 0.13367629051208496, "input_args": {"text": "'Seattle Mayor Ed Murray, famed as a staunch gay rights advocate and a champion of progressive causes, has been accused of sexually molesting several teenaged boys 30 years ago, reports have revealed. [A trio of men came forward to allege that Murray had sex with them decades ago when they were underage. At least one said he was 15 when the mayor molested him back in the 1980s, according to the Seattle Times.  A man identified only as “D. H. ” now 46, filed a lawsuit against the    Murray alleging that the famed mayor and activist began molesting him when he was only 15 and exacerbated problems he had during his life starting when he was a teen. He also claims that Murray was fully aware of his underage status. D. H. claims that he has been “dealing with this for over 30 years,” and filed the lawsuit as part of the “healing process. ” The accuser said he hoped the lawsuit would help him to repair his mental issues after years of “the shame, the embarrassment, the guilt, the humiliation that I put myself through and that he put me through. ” The plaintiff also alleged that he took money from Murray for the sexual encounters up to 50 times over a four or five year period. After the lawsuit had been made public, Murray issued a press release calling the accusations false: These false accusations are intended to damage a prominent elected official who has been a defender of vulnerable populations for decades. It is not a coincidence that this shakedown effort comes within weeks of the campaign filing deadline. These unsubstantiated assertions, dating back three decades, are categorically false. Mayor Murray has never engaged in an inappropriate relationship with any minor.   …     Mayor Murray will vigorously fight these allegations in court. Murray also pledged to continue his bid for   as the city’s Mayor. The Seattle mayor has been the subject of such allegations in the past, with one case going as far back as 1984. Jeff Simpson came forward decades ago alleging that he met Murray in a Portland center for troubled children and was later molested for an extended period by the man who would become mayor. A police investigation was launched in the 80s, but no charges were ever filed. “I don’t necessarily think that he destroyed my life,” Simpson said about his experience, “But I believe a lot of the problems I have stemmed from this. ” Simpson’s story was buttressed by Lloyd Anderson, another man who claims to have been molested by Murray back in the 1980s. “Look, the guy took advantage of my situation,” Anderson said of his experience in the 1980s. “I was young, I was homeless and doing drugs and everything. ” Mayor Murray characterized some of the allegations as a “ ” attack on his career. “The two older accusations were promoted by extreme     activists in the midst of the marriage equality campaign, and were thoroughly investigated and dismissed by both law enforcement authorities and the media,” he said in a statement. Murray insists that these lawsuits and allegations are politically motivated. The mayor has a long history of fighting for progressive causes. When he was in the state legislature, for instance, he led the fight for the state to recognize gay marriage. And once elected Seattle’s mayor, Murray launched a campaign to push the city’s minimum wage to $15 an hour. Murray has also been a leading opponent of President Donald Trump favoring efforts to torpedo the president’s immigration policies. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com'"}, "time": 1742561679.493003}