{"duration": 0.14954900741577148, "input_args": {"text": "'Rep. Al Green ( ) speaking on the House floor Wednesday morning, said President Trump “must be impeached. ”[“It’s a position of conscience for me,” Green said. “This is about what I believe. And this is where I stand. I will not be moved. The president must be impeached”:  Rep. Al Green calls for Trump’s impeachment: ’No one is above the law and that includes the president’ pic. twitter.   —   Philip Lewis (@Phil_Lewis_) May 17, 2017,  Green joined other Democratic lawmakers to call for the president’s impeachment, although Democratic leadership in Congress said it was too soon to move ahead with such action, Fox News reported. “I rise today, Mr. Speaker, to call for the impeachment of the President of the United States of America for obstruction of justice,” Green said, suggesting that Trump’s firing of former FBI Director James Comey obstructed an investigation into his campaign’s alleged ties to Russia. “We cannot allow this to go unchecked —  the president is not above the law, it is time for the American people to weigh in. ” Green was the first of his Democratic colleagues in the House to call for Trump’s impeachment, inspired by a New York Times report claiming that Trump asked Comey to end an investigation into the former National Security adviser, Michael Flynn. The Hill reported that Green started calling for Trump’s impeachment on Monday, when he said his colleagues in Congress should take up the mantra “ITN: Impeach Trump Now. ” Green originally said that he would wait a few weeks before starting impeachment proceedings, KHOU reported. Many Democrats and Republicans in Congress, however, are not ready to jump on the impeachment bandwagon just yet. “Members are reminded to refrain from engaging in personalities toward the president such as accusations that he committed an impeachable offense,” Rep. Brian Fitzpatrick ( ) told lawmakers after the speech. Ranking member of the House Intelligence Committee, Rep. Adam Schiff ( ) said Wednesday that impeachment is not something that should be rushed. “No one should rush to embrace the most extraordinary remedy for removing a president,”  Schiff said.'"}, "time": 1742562506.2380233}