{"duration": 0.11573147773742676, "input_args": {"text": "'I was walking around campus between classes one day at the university I attended in Abuja, Nigeria, when he came up to me. “I’ve seen you somewhere before,” he said. He was slim, attractive. I thought it was the usual flirting. But then I realized that his face did look familiar. Church. I’d seen him at church a few times. So we chatted a bit. He wasn’t a student there. He was there to see a friend. For some reason he also mentioned that his birthday was coming up. I gave him my phone number. He called me  —   a lot. I never answered, and I never called him back. It went on like that for a month. Then one day, I looked at the date and realized it was his birthday. I decided to give him a call. From then on, we talked every single day on the phone. I have trouble sleeping, and we would talk almost all night. “What’s your genotype?” he asked me in one of our first telephone conversations. “Which one is the genotype and which one is the blood type?” I asked him. “I’m SS,” he told me. Then I remembered. “O. K.,” I said. “I’m AA. ” By then, I knew what the sickle cell trait was. Hemoglobin SS meant he had   sickle cell anemia. A family friend had lost kids to it. My school had tested me for it. But when he told me, I was like, O. K. sure. It didn’t seem like a thing. We became very close. My mom knew about him. My siblings knew about him. But he was older. I was just 16. I had a strict curfew every night. He was in his  . One time, about a year after we met, we went to a cafe for lunch. It was one of those hot days before the rainy season would come and unleash showers across the Nigerian landscape. At the cafe, we talked as I wolfed down a slice of chocolate cake. We got up to leave, paid the bill and I hugged him goodbye. At some point in the hug, it happened. He was leaning in with his lips. I realized he was trying to kiss me! It would have been my very first kiss  —   if it had happened. But it didn’t. I was stunned. I was so upset that I just turned my face away and walked to my car. After I got home, he called me to apologize. I told him not to call me, but after two days I really missed talking to him. He liked me. I really, really liked him. I wouldn’t call it a crush. A crush is like a joke. He was quiet, and he had a gentle soul. A couple of years later, when his birthday came around again, he said he wasn’t feeling too well, so I went to his house. He lived with his parents, and I didn’t really like going to his house, because it took a lot of lying to my parents to go there. We sat on the couch and watched music videos on MTV. The   boy band, the Wanted, came on with their song “All Time Low,” and I got so excited because it was my latest obsession. “I love this song!” I said. “What do you think?” But he just shrugged his shoulders. He was kind of indifferent. I was so naïve. I didn’t notice how sick he was. I didn’t want to notice. I just kept talking and talking. I left after three hours, but after that I found myself checking on him constantly, every 30 minutes or so. He kept saying he was fine. But a few days later, he ended up in the hospital. When I went to visit him, it was a shock  —   I had never seen a “sickler” before. I saw the yellow eyes. I saw how skinny he was. He kept wincing from the pain, but putting up a brave act. “They’re saying my kidneys are failing and stuff,” he finally said. I was so freaked out. A few mornings later, I planned to go back and bring him some Ogbono soup, his favorite. It’s a concoction of ground African bush mango seeds, cooked onions and crayfish with dark, leafy vegetables swimming in bright red palm oil. The plan was for my mom to make it but to say that I made it. So we began cooking the soup. Then we boiled water to cook semolina flour for fufu to go with it. All the while, I kept calling him, but he wasn’t answering. So I called one of his friends, and we planned to go together. I packed the soup and fufu and drove over to his friend’s house. When I got there, his friend told me to come in and sit down. And that’s how I got the news he died. I wept all the way home, and every day after that. My father asked who the hell was this guy who just turned his daughter’s life upside down. I would sit in my room with the curtains closed. For weeks, it just seemed like a good idea to sit in the dark. After the funeral, I had to ask one of his friends: “Did he know how much I actually cared about him?” “No,” came the response. “No, he didn’t. ” I’m still dealing with the guilt of that, because it seems to me he had everything I would have wanted in a boyfriend.'"}, "time": 1742562610.1710386}