{"duration": 0.029752254486083984, "input_args": {"text": "'Marrying couple installs Gift Envelope Scanner at wedding hall door to check for ₹500 & ₹1000 notes Posted on Tweet \\nChiranjeevi and Soubhagyavati, a couple who will be entering wedlock tomorrow, have undertaken a first-of-its-kind, unique feat – the bride and groom have installed an X-ray scanning device at the entrance of their wedding hall, to scan guests’ gift envelopes for the recently discontinued ₹500 & ₹1000 notes. (Image via Ephemera Studio) \\n“With great difficulty, we’ve had to put all the wedding preparations on hold, stand in queues to deposit old currency for new legal tender and without even a day’s break, resume the preparations and planning. All thanks to demonetization. At the end of it all, the last thing we want is another set of old currency notes which we’ve to take to the banks for another exchange stint. We don’t want to be loitering around banks when should be honeymooning in exotic locations. In order to prevent this, we wish to inform all our guests that we have installed an envelope scanning device right at the entrance. You will be asked to pass your envelope through the scanner. If your envelopes are found to contain old currency, they will be handed right back to you. We’d rather you congratulate us without any gifts, than give us invalid currency,” Soubhagyavati, the bride-to-be told The UnReal Times . \\nWhile the move has already reduced the anticipated guest number by the hundreds, the couple is determined to stand by their idea. “A lot of people have already informed us about ‘urgent meetings,’‘spouses unwell,’ and other things right after we announced this development. That’s still okay. We’re not yet done though. We’re also thinking of setting up an online transfer kiosk – so that people can swipe their credit cards and transfer money to us electronically, on the spot, if they really wish to gift us money,” an animated groom-to-be, Chiranjeevi added. \\nThe couple’s move won praise from across the border. “What a great idea! Pity I didn’t do this even in one of my weddings. The next time I marry, I surely should emulate this,” an amazed PTI chief and former world-cup winning Pakistani cricket captain Imran Khan exclaimed. Bollywood actor Kamaal R Khan, however, was indifferent. “Makes no difference to me, I anyway put only ₹2 coins in all envelopes whenever I attend weddings,” the Deshdrohi actor chuckled. MNS Chief Raj Thackeray lauded the move, while also suggesting that those caught gifting such notes be made to gift an equal amount to the Indian army, by cheque. \\nWhile many other wedding couples have been scampering all over the country in search of scanners, some have urged banks to grant them permission to conduct the weddings in their own offices. “It’s extremely efficient this way – the moment we get old currency, we exchange it then and there. No loss of time. Plus it’s booming business for the banks too,” one such groom said. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742628557.7392423}