{"duration": 0.018920183181762695, "input_args": {"text": "'November 6, 2016 \\nDistracted by suffering refugees, confused by convoluted Brexit negotiations or just plain scared by a Trump presidency? No? Neither is your Prime Minster. Today Theresa May did what every true leader does in a crisis – which is to turn everyone’s attention to meaningless ephemera; like poppies, Grammar Schools and who should present the new ‘Bake-off’? \\nTaking a break from quashing the Orgreave Inquiry, Mrs May said FIFA’s stance of not politicizing sport was ‘outrageous’. A spokeswoman explained: ‘In these times of austerity, we need cheap, meaningless gestures accompanied by hollow outrage. If over-paid under-achieving footballers are not allowed to wear a poppy – then the terrorists have won. It’s a known fact that Afghan jihadists fear the poppy…although admittedly 80% of their income is based on the opium trade…um…er…I may not have thought this through…’ \\nArmed police are expected to patrol our streets, opening fire on anyone not wearing a poppy or failing to whistle the tune from ‘The Dambusters’. A Police Inspector remarked: ‘We may be perpetuating a mawkishly sentimental view of war but don’t think for a second you can get away with recycling last year’s poppy – we’re wise to that dodge!’ \\nWithout a doubt this is the most important issue of 2016 – whether 22 footballers can wear poppies for 90 minutes in a stadium filled with 60,000 people wearing poppies. Some cynics have suggested Theresa May’s use of misdirection in these troubled times, is the political equivalent of David Copperfield pulling an elephant out his arse. Her spokeswoman countered: ‘The important thing is to remember those who sacrificed their lives in war– rather than the reasons behind it or making sure it never happens again’. Share this story... \\nPosted: Nov 6th, 2016 by Wrenfoe   Wrenfoe   Politics'"}, "time": 1742628505.1662006}