{"duration": 0.15073871612548828, "input_args": {"text": "'BRUSSELS  —   As the lights go dark in a theater here, gunfire and explosions are heard. Some in the audience gasp, including several women wearing head scarves. Onstage, a Muslim terrorist in an orange prison jumpsuit appears. During the play, we learn that he has killed people at a Jewish school whom, in other circumstances, he might have befriended, we come to understand. The play is “Géhenne,” or “Hell,” the latest by Ismaël Saidi, a comic Belgian playwright and actor, whose work  —   with its comedic touches and visceral understanding of the frustrations of young, underprivileged European Muslims  —   has been used by the French and Belgian governments as a cultural weapon against radicalization. His play “Jihad,” from 2014, was about three hapless Belgian Muslims who travel to Syria but eventually understand that their attempt at holy war is a grave mistake. But with “Géhenne,” the somewhat hopeful message of “Jihad”  —   that terrorists can come back from the dark side  —   has been tempered. Mr. Saidi, a practicing Muslim and former police officer, said that performing “Jihad” in prisons across Belgium and France for the past two years has caused him to doubt whether violent religious zealots can ever really change. If a person doesn’t want to, “you can take this guy to A. A. all your life, but one day he will drink again,” Mr. Saidi said in a recent interview after a performance of “Géhenne” before a packed audience of nearly 1, 000 people at the Théâtre   here. His latest play implicitly argues for prevention, suggesting that teaching young people how to get along in a multicultural society is far better than trying to reform violent criminals. “The only cure I think is like a vaccination that had to be done long before,” he added. Mr. Saidi’s more sober outlook about deradicalization  —   which he said was shaped by conversations with inmates jailed on terrorism charges  —   was echoed by a report released last month by two French senators. They found that France’s approach, especially creating a handful of rehabilitation centers to   violent terrorists, had been ineffective. But even as the centers’ effectiveness is questioned, some are not ready to jettison such efforts. Ouisa Kies, a sociologist who has worked with terrorists in French prisons, said culture was fundamental to programs that help bring jihadists back from violence. “The problem is that France is very late to this,” she said. “The failure is in coordination and evaluation, not in the contents of the programs. ” In the past two years, after a flurry of terrorist attacks, the French government has begun investing in efforts to shape young hearts and minds. It has given money to schools and other venues that host “Jihad,” while the Belgian government has spent 50, 000 euros (about $54, 000) to underwrite tours of the play. “Jihad” has also been included in the French Education Ministry’s school curriculum aimed at preventing radicalization. Muriel Domenach, who leads the French government’s task force on the prevention of radicalization, called Mr. Saidi’s work both funny and important. “It’s a   counternarrative,” she said. It shows “that of course there’s discrimination, lack of prospects” for many young Muslims, “but at the same time it’s everyone’s responsibility, including citizens who are Muslim, to be taking action. ” The play, in which three men tell stories of personal humiliation that led them to militant Islam, was seen as prescient when it debuted in Schaerbeek, an area of Brussels with a large North African immigrant population. That happened just weeks before terrorists attacked the satirical newspaper Charlie Hebdo and a kosher supermarket in Paris in January 2015. (Some of the terrorists involved in the attacks in Paris on Nov. 13, 2015, were from Schaerbeek.) Mr. Saidi, who was born in Belgium to parents from Morocco, dislikes being told he was prescient. “What pains me is that this is about things we’ve been living for the past 25 years,” he said of “Jihad” after a performance at a cultural center in    a Paris suburb with a large immigrant population. “Syria is just an excuse,” he added. “My play is about broken identities. ” It’s shot through with a quick,   humor. When the   jihadists meet an Arab named Michel, unaware that he’s Christian, one tells him not to worry, he’s not in Belgium looking for a job so he can use his real name. The “Jihad” performance was well received that night. “We need the kind of humor you find in ‘Jihad’ to talk about this topic,” said Hamza Irfan, 15, who attended with an   program. “It speaks to everyone. It doesn’t feel boring, or depressing, or too light it just feels serious. ” Naghmana Kayani, who runs the   program, said “Jihad” was an important tool in potential prevention. “Every time there’s an attack, it affects us,” she said. Instead of trafficking in stereotypes, she added, “Jihad” helps “fight against obscurantism. ” More than 100, 000 people have seen “Jihad,” and Mr. Saidi holds emotional public conversations with audiences afterward. He still performs in prisons, but not for those convicted of terrorism. “They hate it,” he said, referring to his play. “So it’s bad for them, and bad for me. ” Taking “Jihad” on tour and discussing it with audiences has changed him in other ways, and made him question his faith. “I am still the same, but the way I see things changed,” he said. “I love something that I hated before: I love doubt. ” That doubt comes through in “Géhenne,” in which Mr. Saidi plays Ismaël, who has lost his legs after blowing himself up at the Jewish school. In prison, he imagines a conversation with a Roman Catholic priest who smokes hash with him and says he questions the existence of God, and with a woman he takes a shine to and who he eventually discovers is Jewish  —   the first Jew he has ever met. At the end of the play, we discover the woman and her daughter were victims of his attack, and the conversations are visions of a world that might have been. “He killed her and her kid, and he understands at the end,” Mr. Saidi said. “That’s hell for him. ” He said that doing a benefit performance of “Jihad” for members of 13 Onze 15, an association of survivors and family members of victims of the Nov. 13 terrorist attacks in Paris, had caused him to revise “Géhenne” so that Ismaël seeks forgiveness after realizing what he’s done. “Everyone was really, really moved,” said Aurelia Gilbert, who survived the attack at the Bataclan concert hall in Paris. “It gives a life, a name, a story behind those guys. They’re not only the faces you see in the newspaper, and they are dead. ” After the recent performance of “Géhenne” in Brussels, a Belgian woman who gave her name only as Antoinette said that she had come to see the play because her daughter had converted to Islam and had gone to Syria. She had traveled to Syria to bring her daughter back. The play “shows how young people should reflect on what’s going on, on what they’re doing,” Antoinette said. “It’s a really complex problem, for those who go and those who return. ” Mr. Saidi said that his message in “Géhenne” was “that everything begins with ignorance and hate. ” He added, “If somebody had taught Ismaël love for someone else, and not hatred for Jews, nothing would have happened. ”'"}, "time": 1742563197.2970576}