{"duration": 0.030607938766479492, "input_args": {"text": "'Mon, 24 Oct 2016 21:12 UTC © www,syrian-cyber-army.net Several Belgian media outlets announced that they had fallen victim to a cyberattack. A Syrian hacker group claimed responsibility, saying the attack was retaliation for the Belgian air force bombing a village near Aleppo. A number of Belgian media websites, including De Standaard, RTBF, Het Nieuwsblad, Gazet van Antwerpen and Het Belang van Limburg, reported they have been subjected to a coordinated DDoS (distributed denial-of-service) attack on Monday afternoon, which temporarily shut down their sites. The attack was claimed by a group calling itself the Syrian Cyber Army, as punishment for the media helping to cover up their government\\'s actions in Aleppo . \"We attacked the Belgian media that hide the work of its air force in Syria,\" a statement on their website reads . \"We call on the international community to support us in shaming the Belgian authorities, who orders the killing of dozens of civilians in the town of Hassadjek near Aleppo on October 18, and caused damage to civilian infrastructure,\" the Syrian hackers wrote. \"Instead of strikes on Daesh [Islamic State], the international coalition led by the United States targets only civilians and deceives the international community about its goals in Syria.\" The attack comes in the wake of information from the Russian Defense Ministry that two Belgian F-16 jets flying from Jordan struck Hassadjek in Aleppo province on October 18, killing six civilians. The Belgian government has strongly denied involvement in the bombing, and has demanded that Russia take back the accusations. The Het Nieuwsblad has alleged that Russia supports and finances the hacking group. The hacking attack itself appears to have been carried out from Turkey. However, the federal prosecutor\\'s office has yet to start an investigation. Over the course of the civil war, Syrian hacking groups have claimed attacks on various news organizations they believe paint the Assad government in a negative light. Among these is the Syrian Electronic Army, formed in 2011, which has targeted the BBC, al-Jazeera and National Public Radio, among other outlets. Their tactics range from DDoS attacks - in which thousands of computers will overwhelm a server by requesting access all at once - to spamming, malware, phishing and defacing websites. Some of the attacks have been humorous at times. After hacking the BBC Weather\\'s Twitter, a headline read \"Saudi weather station down due to head on-collision with camel.\" Comment: Belgium is falling right in line with the US: Proof doesn\\'t matter; \\'blame Russia\\' for everything.'"}, "time": 1742561972.5221083}