{"duration": 0.07220149040222168, "input_args": {"text": "'Sen. Rand Paul ( ) mocked the “crocodile tears” in Washington after Democrats expressed outrage over President Trump’s firing of FBI Director James Comey. [“I was not a huge Comey fan, he politicized investigations, both sides of the aisle lost confidence. Lots of crocodile tears in dc,” he tweeted Wednesday morning.  I was not a huge Comey fan, he politicized investigations, both sides of the aisle lost confidence in him. Lots of crocodile tears in dc,  —   Senator Rand Paul (@RandPaul) May 10, 2017,  After the bombshell news of Comey’s firing broke Tuesday evening, Democrats took to Twitter and the airwaves to express shock and concern over Comey’s firing, despite some of them having previously clamored for his dismissal. Paul also tweeted: “Hypocrisy and fake outrage? Dems had been calling for months for the firing of Comey!” he added a few minutes later. Hypocrisy and fake outrage? Dems had been calling for months for the firing of Comey!  —   Senator Rand Paul (@RandPaul) May 10, 2017,  Comey had been unpopular on both ends of the political spectrum prior to Trump’s decision. Last July, he roiled Republicans after he announced that although Hillary Clinton was “careless” with her emails, there was no evidence of criminal intent and the FBI would not pursue charges. Democrats celebrated Comey then. But when Comey announced in October the FBI was reopening the investigation into Clinton, less than two weeks before the elections, Democrats were furious and later blamed him for her loss. Earlier this year, he made headlines again when he confirmed the FBI was investigating Russian interference in the elections, as well as any coordination between Moscow and the Trump campaign. This last week may have been the last straw, after he appeared in front of the Senate Judiciary Committee, and gave an impassioned defense of his decision to announce the reopening of the investigation, again angering Democrats. At the same time, he revealed that Clinton aide Huma Abedin had forwarded classified emails to husband Anthony Weiner, but that the FBI did not recommend charges against either, arguing there was no evidence of criminal intent. Later, anonymous officials told some news outlets that Comey had misspoken and that Abedin had only forwarded a “handful” of emails, including classified ones, but not “hundreds and thousands” of emails as “regular practice,” as Comey had said. And his refusal to clarify whether there was any evidence underlying Democrats’ accusation of collusion had long angered Trump supporters, making him deeply unpopular with them too. “There’s a lot of hypocrisy going around,” Paul said in an interview Wednesday morning on Fox News. “Chuck Schumer in November said he lost confidence. Hillary Clinton saying that he completely destroyed the whole election  …     Eric Holder says Comey violated   Department of Justice procedures. ” “So I think you have a lot of people looking at it from the Democrat side who have said they have lost confidence in him, I think you have Republicans saying they should have prosecuted Clinton, nobody’s happy with his tenure at the FBI, so I think it was long past time for him to go,” he added. Trump in his statement announcing Comey’s firing said it will “mark a new beginning for our crown jewel of law enforcement. ”'"}, "time": 1742561918.2801685}