{"duration": 0.04758501052856445, "input_args": {"text": "'CAMBRIDGE, Mass.  —   Top strategists from the campaigns of Donald J. Trump and Hillary Clinton, interrupting each other and sometimes raising their voices, engaged in an angry debate on Thursday about how Mr. Trump pulled off his upset victory. Emotions were still raw at the campaign   held at Harvard’s Institute of Politics, particularly over the influence of Stephen K. Bannon, who left Breitbart News  —   which he has called a “platform” for the white nationalist    —   to help run Mr. Trump’s campaign. Mr. Bannon will serve as a senior aide to Mr. Trump. David Bossie, Mr. Trump’s deputy campaign manager, called Mr. Bannon a “brilliant strategist. ” That provoked the Clinton campaign’s director of communications, Jennifer Palmieri, to respond, “If providing a platform for white supremacists makes me a brilliant tactician, I am more proud to have lost. ” Mr. Bannon was scheduled to participate in the event but did not attend. That did not stop several hundred demonstrators from protesting him Wednesday evening outside Harvard’s John F. Kennedy School of Government, where the   was held as part of a   conference. With campaign managers and pollsters talking over one another and a large crowd of campaign veterans from the news media looking on, Ms. Palmieri said her proudest moment from the campaign was a speech Mrs. Clinton gave in Nevada condemning the  . “I would rather lose than win the way you guys did,” Ms. Palmieri said. Kellyanne Conway, who was Mr. Trump’s third and final campaign manager, asked, “How exactly did we win?” She answered her own question: by connecting with voters in places “where we were either ignored or mocked roundly by most of the people in this room. ” “Do you think I ran a campaign where white supremacists had a platform?” Ms. Conway asked Ms. Palmieri. “You’re going to look me in the face and tell me that?” Ms. Conway went on, pointing out Mrs. Clinton’s failings. “Do you think you could have just had a decent message for the white   voters?” she asked the Clinton advisers. “How about it’s Hillary Clinton, she doesn’t connect with people? How about they had nothing in common with her? How about you had no economic message?” Joel Benenson, Mrs. Clinton’s pollster, accused the Trump campaign of using “dog whistles” about immigrants and minorities to appeal to white voters in battleground states. Robby Mook, Mrs. Clinton’s campaign manager, disputed the notion that Mr. Trump won primarily by appealing on economic issues, citing exit polls in Michigan and Wisconsin showing Mrs. Clinton carried more voters who ranked the economy as their top issue. The highly charged exchange was followed by a more restrained conversation between Ms. Conway and Mr. Mook, moderated by the CNN host Jake Tapper. CNN will broadcast the discussion on Sunday. But it was the more raucous session earlier in the day where the passions of the campaign still seemed at a barely contained boil. The participants, half a dozen from each campaign who faced each other while seated at two tables, argued about whether Mr. Trump had won a mandate. “You won the Electoral College don’t pretend you have a mandate,” Mr. Benenson said. “Two and a half million more Americans thought she was a better candidate. ” “Hey guys,” Ms. Conway replied. “We won. Why is there no mandate?” Mrs. Clinton’s advisers argued repeatedly that two public letters by James B. Comey, the F. B. I. director, about Mrs. Clinton’s emails less than two weeks before Election Day pushed enough undecided voters away from her to swing the election. They also said that voters were seeking fundamental change in Washington, a strong headwind Mrs. Clinton could never overcome. In a rare point of agreement, both campaigns faulted the news media. They said leading newspapers and TV networks were so convinced Mr. Trump was unelectable that they never took him seriously. That led to “ ” on Mrs. Clinton’s use of a private email server, Mr. Mook said. “Mr. Trump had a unique ability to speak directly to the American people and go past the media, whether in 140 characters or making a statement somewhere,” Mr. Bossie said. The Trump strategists repeatedly said the Clinton campaign had tried to disqualify Mr. Trump based on his temperament and statements, while misunderstanding the appeal of his promise to keep Americans safe from terrorism at home and abroad. “They wanted to frame the race as, ‘Do you trust him to have his finger on the button? ’” said Tony Fabrizio, Mr. Trump’s pollster. “At the end of the day, what a lot of voters didn’t buy was that it was ever going to be a time where you have to worry about his finger on the button,” he said. “This wasn’t Barry Goldwater. ” Asked by Mr. Tapper whether Mr. Trump’s recent posting of misinformation on Twitter about millions of undocumented immigrants voting was presidential, Ms. Conway defended the message. “He’s the   so that’s presidential behavior,” she said. At one point, Ms. Conway threw up her hands in frustration at the close scrutiny of the campaign. “Everybody wants to go back in a time machine and do things differently so this result that nobody saw coming won’t come somehow,” she said.'"}, "time": 1742628557.1356146}