{"duration": 0.05874800682067871, "input_args": {"text": "'Israel’s Defense Minister to ‘Palestinian’ Paper: Hamas’ Next Attack on Israel will be its Last Oct 29, 2016 Previous post In an effort to communicate directly with the Palestinian people, Defense Minister Avigdor Liberman warned, in a rare interview with the Al Quds daily, that Hamas would be destroyed if it dares attack Israel again. \\nIsrael’s defense chief threatened the Hamas terror organization which rules the Gaza Strip, and dismissed the Palestinian Authority (PA) head as an incapable leader in a rare interview published Monday in the Al Quds daily, a popular Palestinian newspaper. \\nThe positions of Defense Minister Avigdor Liberman are well known, but it is unusual for the Palestinian media to interview him. \\nHe started his interview saying, “it’s important for me to talk directly to Palestinian people … I tried to do that since I took office … because I believe there is misunderstanding.” \\nLiberman said PA head Mahmoud Abbas is not capable of signing a peace deal with Israel. “This agreement needs someone else, someone capable of taking a tough decision,” he said. \\nLiberman expressed support for a two-state solution, restating his proposed plan that it should be based on an exchange of territories, and saying that Israel does not need some areas, such as the Arab town of Umm el-Fahm in the north. \\nHe warned Hamas against testing Israel with violence. \\n“If they (Hamas) impose a war on Israel, this war will be the final war for them; we are going to destroy them completely,” Liberman was quoted as saying in the full-page interview. \\nHowever, he said that Israel has no interest in reconquering and occupying the Gaza Strip and emphasized that Israel does not want another war with Hamas. \\nHamas official Fathi Hammad said his group is “in no way afraid and this is a powerful message from Gaza to Liberman.” \\nIn the interview, Liberman also said that Israel is ready to invest in an airport, sea port and industrial park in Gaza — if Hamas ceases its violent actions against Israel and “ stops building tunnels and launching rockets .” \\n“Gaza could be the Singapore or Hong Kong of the Middle East,” he said. \\nIsrael has in the past presented \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742562031.7272162}