{"duration": 0.07856082916259766, "input_args": {"text": "'As protests against Donald Trump and an imminent presidential administration enter a sixth day, politicians, lobbyists, bureaucrats, and other officials are primarily concerned about the continuity of government. Those inside the Beltway aim to normalize the specter of a Trump presidency, even though a number of them recognized Trump as dangerous months ago. But now, while a seedy cast of characters congeals around Trump to form the administration that will run the United States, resistance has the most potential to discourage and undermine Trump before his administration enacts some of the worst parts of his agenda.\\nPresident Barack Obama’s administration expanded and institutionalized several powers, especially related to national security, which will make it easier for Trump to impose his authority domestically and internationally. Those now-entrenched powers fuel much of the panic among the progressive establishment, and because Obama faced minimal challenge, dire threats exist.\\nAware of the discontent with Trump’s victory, Obama remarked the day after Election Day, “We have to remember that we’re actually all on one team. This is an intramural scrimmage. We’re not Democrats first. We’re not Republicans first. We are Americans first. We’re patriots first. We all want what’s best for this country.”\\n“Donald Trump is going to be our president. We owe him an open mind and the chance to lead,” Clinton declared during her concession speech. She also stated, “Our constitutional democracy enshrines the peaceful transfer of power, and we don’t just respect that. We cherish it.”\\nOnly a few months ago Clinton argued Trump could not be trusted to make “life-or-death decisions” because he is “thin-skinned” and quick to get angry when facing even the “smallest criticism.” She invited voters to imagine what apocalyptic event might transpire if he had his “finger anywhere near the button,” a clear reference to nuclear weapons. She maintained a Trump presidency would “embolden” the Islamic State. She suggested he would start a “trade war” with China, and his plans would create $30 trillion of debt. She said it mattered Trump “makes fun of disabled people, calls women pigs, proposes banning an entire religion [Islam]” from the country,” and “plays coy with white supremacists.”\\nNot only that, Clinton aggressively pushed the idea that Trump worships Russian Prime Minister Vladimir Putin, has a network of advisers with ties to the Kremlin and business assets linked to Russian oligarchs, encouraged Russia to interfere with the U.S. election to help elect him, and his foreign policy will be everything on Putin’s “wish list.”\\nAlong the same lines, Obama previously suggested Trump’s rhetoric helped the Islamic State carry out its agenda. Obama also stated, “If somebody can’t handle a Twitter account, they can’t handle the nuclear codes.”\\nLet’s get this straight: Trump is a Kremlin agent and temperamentally unfit businessman, who traffics in bigotry, racism, and hate, that will make Americans less safe and possibly even commit a rash act that leads to nuclear armageddon. But we need to remember we’re all on the same “team” and have an “open mind” about Trump. Give a man with all the characteristics of a tyrant a “chance to lead.”\\nThis is the problem with New Democrats, like Obama and Clinton. Their political identity is defined by bipartisanship and compromise.\\nPresident Bill Clinton and Vice President Al Gore were part of the rise of New Democrats in the early 1990s. They stood with conservative Democrats, who broke with labor, civil rights, and other liberal causes. They pushed the North American Free Trade Agreement (NAFTA). They backed welfare repeal, bills which fueled the rise of mass incarceration, and signed a 1997 budget that slashed millions for social programs like Medicare and Medicaid. They put corporate interests over environmental protections. They encouraged the deregulation of industry, which greatly boosted Wall Street. Altogether, the Clintons enabled the right and worked with conservatives as unfettered capitalism expanded and the liberal class was further decimated. (For more, read Lance Selfa’s book, “The Democrats: A Critical History.”)\\nThe danger of this kind of bipartisanship is further exemplified by the fact that Obama refused to prosecute officials in President George W. Bush’s administration for torture. He clung to the wrongful notion that his administration had to move forward without looking backward. Now, Trump may push for pro-torture former CIA official Jose Rodriguez, who destroyed videotapes documenting torture, to be CIA director, and Rodriguez could run the CIA and reinstitute torture policies because he never was held accountable. In fact, he was able to write a book and go on a speaking tour defending his role in torturing captives in the “War on Terrorism.”\\nIn addition to impunity for torture, the failure of liberals to challenge Obama means Trump will have a targeted assassination program and flying killer robots to kill any terrorism suspect or enemies he puts on either of the kill lists established by Obama. He will have a massive global surveillance apparatus, which NSA whistleblower Edward Snowden exposed to the world, that remains more powerful than ever in spite of a few minor reforms. He will have structures in place to build on Obama’s record number of deportation of immigrants. More than 2.5 million were deported, and this is why Trump can confidently plan to deport millions of immigrants during his presidency.\\nDemocrats and their liberal supporters have allowed for the development of a body of law that allows the Justice Department to prosecute whistleblowers with the Espionage Act and treat them as spies. The crackdown on truth-tellers also enables the government to snoop on the communications of reporters and even threaten journalists with jail time so they reveal whether their source was someone who disclosed information without authorization. Plenty of people in institutions will want to blow the whistle on Trump, and Trump will use the blueprints for controlling the flow information that Obama designed to guide his administration.\\nAs journalist Branko Marcetic wrote for Jacobin, Trump will have “boundless and unchecked ability to start wars.” Obama repeatedly stretched the Authorization for Use of Military Force (AUMF) in order to “attack ISIS in Iraq, Libya, and Syria, declaring the group an ‘associated force.’ Without any formal declaration of war, the United States currently has ground troops in all three of those countries — thousands , in the case of Iraq.” Obama also pursued an illegal war in Libya that turned into a major disaster.\\nThe era when J. Edgar Hoover ran the FBI was a dark chapter when activists, journalists, and citizens were targeted for their political associations and ties to groups or organizations put on enemies’ lists. Politicians in the 1970s reacted to revelations of abuse of power with hearings aimed at reversing this trend toward authoritarianism. But in recent decades, the Democrats have displayed little concern for how power is abused. They fully embrace the FBI, which still keeps tabs on political activists and has infiltrated and targeted Muslim Americans in their communities.\\nIt must also be be kept in mind that Obama passed the National Defense Authorization Act, which contains a provision that enables the indefinite detention of individuals. Despite a lawsuit against this part of the law, which did not succeed, it remains in force under Trump unless Obama rolls it back.\\nAside from executive power, Trump does not find climate change to be a real and actual serious threat. Obama and the Democrats have had several grand opportunities, especially when faced with the Keystone XL and Dakota Access pipeline projects, to take a stand on fossil fuel extraction. Democrats were encouraged by individuals appointed by Bernie Sanders to include language in the party platform that called for fossil fuel reserves to be kept in the ground . Clinton Democrats and Democratic National Committee appointees opposed protecting the planet, and now Trump can help TransCanada complete the Keystone XL pipeline and cheer Dakota Access, as it colonizes and further destroys indigenous land while contributing to climate change.\\nIt did not take long for Trump to show how tolerant he will be of dissent. He tweeted, “Just had a very, open and successful presidential election. Now professional protesters incited by media are protesting. Very unfair.” This is what an autocrat says to justify cracking down on freedom of expression.\\nOne does not respond to a political moment by calling for unity, like Obama did. It is not the time to beg Trump to include Democrats in his agenda. There is no need for phony praise of Trump’s “respect” for institutions or the “rule of law,” whatever that means. And yet, Obama addressed this moment with a convoluted sports metaphor.\\n“I think of this job as being a relay runner—you take the baton, you run your best race, and hopefully, by the time you hand it off you’re a little further ahead, you’ve made a little progress,” Obama declared. “And I can say that we’ve done that, and I want to make sure that handoff is well-executed, because ultimately we’re all on the same team.”\\nObama, who was complicit in the expansion of power that Trump will be able to enjoy, may see himself as on the same team. However, many Americans and people outside the U.S. face threats to their freedom and lives because the president worked to make dangerous policies part of a bipartisan consensus. Therefore, the appropriate response to what lies ahead is constant protest, especially since a lack of opposition leaves a vacuum that Trump forces may regard as consent or acquiescence to their perilous plans.\\nThe post The Complicity Of Obama, Democrats Set Stage For Dangerous Trump Presidency appeared first on Shadowproof .\\n'"}, "time": 1742628537.2330878}