{"duration": 0.05266308784484863, "input_args": {"text": "'You are here: Home / US / Look Who 97% of Donations from DOJ Employees Went To Look Who 97% of Donations from DOJ Employees Went To October 26, 2016 Pinterest \\nIt will probably come as no surprise to anyone, but a huge majority of federal workers give political donations to… Democrats, namely Hillary Clinton. \\nOf course this isn’t a shocker. Federal workers know their jobs will remain intact if they keep helping the people who have continued to grow government to the outrageous behemoth it has become. \\nFrom The Hill : \\nOf the roughly $2 million that federal workers from 14 agencies spent on presidential politics by the end of September, about $1.9 million, or 95 percent, went to the Democratic nominee’s campaign, according to an analysis by The Hill. \\nEmployees at all the agencies analyzed, without exception, are sending their campaign contributions overwhelmingly to Clinton over her Republican counterpart. Several agencies, such as the State Department, which Clinton once led, saw more than 99 percent of contributions going to Clinton. \\nEmployees of the Department of Justice, which investigated Clinton’s use of a private email server while she was secretary of State, gave Clinton 97 percent of their donations. Trump received $8,756 from DOJ employees compared with $286,797 for Clinton. From IRS employees, Clinton received 94 percent of donations. \\nWhat’s even more ironic is that these people are paid with taxpayer dollars. They keep using their salaries paid for with taxpayer dollars to help elect Democrats, who keep spending taxpayer dollars to keep these people employed with cushy benefits and salaries that are higher than for the same position in the private sector. \\nThe only people who actually suffer, of course, are those who have to foot the bill for everything. And yes, federal workers pay taxes as well, but they are paying taxes using taxpayer dollars that pay their salaries to further push politicians that will keep increasing the size of government AND taxes and their salaries. \\nIt’s especially ironic that the Department of Justice spent so much on Hillary considering she has made fools of them. Obama has completely politicized the department. There is no justice at the Department of Justice anymore. They have lost all credibility thanks to Democrats, just like the FBI.'"}, "time": 1742562283.2890756}