{"duration": 0.08036041259765625, "input_args": {"text": "'Celebrating GLOBAL GRACE DAY, November 9, 2016 As every year, we celebrate the Global Grace Day on this November 9, 2016. First “Global Grace Day” at the Separation Wall in Israel-Palestine, November 9, 2005 By Dieter Duhm / terranovavoice.tamera.org \\nAs every year, we celebrate the Global Grace Day on this November 9, 2016. It is a day of taking a decision for a future worth living. Its date reminds us of November 9, 1938, when Hitler Germany began its first massive attack against German Jews in what was called “Kristallnacht” or the “Night of Broken Glass.” Yet this date also reminds us of November 9, 1989, when the Berlin Wall was opened. The external wall that was overcome back then now also needs to be overcome within people so that we can find a way out of the unspeakable suffering people currently inflict on each other around the world. People shooting each other, intentionally killing one another – this does not belong to the plan of a humane world. Our goal is a world without war, without weapons and without fear. \\nFirst of all, immense gratitude to all those who are offering assistance in this world gone astray; gratitude to all peace workers, all communities and organizations working to support the many people currently fleeing, those that need to persevere in camps without protection, hungry and cold, those that are trapped in war zones (e.g. Mosul, Aleppo) without any prospect for help, those that cross the Mediterranean Sea in crowded dinghies and those that mourn their lost relatives. It is an unending suffering on all continents. Many volunteers travel from hotspot to hotspot trying relieve a kind of distress that can no longer be relieved. We need another solution if want to provide sustainable, lasting help. What could it consist of? \\nWe need a new foundation for human coexistence. The relationship among people is the greatest crisis of our times. The morphogenetic field of war currently dominating this planet needs to be replaced by a new morphogenetic field of peace. The solution consists in creating new fields of life which the existing world of war cannot integrate, for they are anchored in the universal order, the field of the “Sacred Matrix.” This field arises when we create new communities that manifest the fundamental values of life – solidarity, compassion, love and mutual support. Liberating sexuality and the love between the genders from all false restrictions and prejudices, renouncing lies and forevermore ending all forms of sexual violence belong to the work of these communities as well. \\n“Sexpeace” is a key for healing. If truth, trust and love enter at the core issue of erotic love, the entire superstructure of society will change. A different relation to life develops (“re-ligio”), a new relation to animals and all beings. We experience this in Tamera on a daily basis. There is a power greater than all violence. This is the power of communities, which focus in total trust on a common goal for the future and are, while doing so, connected with the inner laws of objective ethics. They can no longer be corrupted nor governed. The power stronger than all violence – this is profound trust among people. Where there is trust, higher powers assist us as well. \\nIn this spirit, we work on the global Healing Biotopes Project . All groups working for peace are warmly invited to join this network. In the name of love for all that lives. 0.0 ·'"}, "time": 1742563939.2379065}