{"duration": 0.1016840934753418, "input_args": {"text": "'WASHINGTON  —   Elaine L. Chao, a veteran cabinet secretary who has served under two Republican presidents, offered remarkably few specifics but many promises of cooperation on Wednesday as she cruised through her confirmation hearing to become transportation secretary. Democrats on the Senate committee charged with reviewing Ms. Chao’s nomination by   Donald J. Trump made it clear that they have no objections to her, suggesting that she will be easily confirmed in a full Senate vote. Senator Bill Nelson of Florida, the top Democrat on the Committee on Commerce, Science and Transportation, praised Ms. Chao for acting with “grace and excellence” in her previous government service. “I certainly look forward to you, in this new administration, doing the same,” he said. Senator John Thune, Republican of South Dakota and the committee’s chairman, called her “an ideal candidate. ” Ms. Chao spent most of the   hearing promising to examine and learn more about drones, fuel efficiency standards, air traffic control services and many other subjects that may soon be part of her portfolio. With most of the spotlight falling on Mr. Trump’s desire for a major infrastructure overhaul  —   in his own words, a priority for his first 100 days in office that could cost $1 trillion  —   Ms. Chao vowed to keep senators informed of emerging plans. She called the overhaul “a heavy lift” that would require cooperation both between the parties and between Congress and the administration. “As the infrastructure proposal is being put together, we will certainly be in great discussion with the Congress, because, once again, we can’t do it on our own,” she said. The selection of Ms. Chao to lead the Transportation Department and its $75 billion budget stands out in the lineup of largely billionaire business executives Mr. Trump has nominated to populate his cabinet. She served as labor secretary for the duration of George W. Bush’s administration and as a deputy transportation secretary under the elder George Bush. Ms. Chao vowed on Wednesday to work with lawmakers on a host of transportation issues  —   including maritime infrastructure and positive train control, a safety system intended to prevent collisions. Emphasizing the need to revitalize the nation’s transportation infrastructure, Ms. Chao called for creativity to fund improvements. Asked whether Mr. Trump would support including federal spending in his infrastructure package, she said, “I believe the answer is yes. ” Support for federal infrastructure funding could put the Trump administration on a collision course with congressional Republicans, who have been reluctant or even openly hostile to increasing domestic spending in recent years. Ms. Chao offered few other funding solutions, though she did propose turning to more   partnerships, referencing the potential capital available from “equity firms, pension funds and endowments. ” That seemed to raise concern from Mr. Nelson, who cautioned against the privatization of government services, alluding to a possible point of friction between Democrats and the incoming Trump administration. Since leaving public service, Ms. Chao has joined the boards of Wells Fargo, News Corporation and Vulcan Materials, among others  —   positions she said she would resign from if confirmed. However, according to documents she filed with the Office of Government Ethics, Ms. Chao will continue for a time to receive payments under financial agreements with Vulcan, which makes construction supplies, and Wells Fargo as she severs her ties with them the payments from Wells Fargo stocks will continue through March 2021. She has agreed to recuse herself from matters involving those companies. Though Wells Fargo came under fire late last year for its business practices, senators did not ask her to elaborate on her continued ties with the embattled company. There was a notably cozy, familiar tone to much of the hearing, as senators questioned a nominee with close ties to one of their own: Ms. Chao is the wife of the Senate majority leader, Mitch McConnell, Republican of Kentucky. Praising Ms. Chao as “incredibly capable” in his introduction, Mr. McConnell cheekily endorsed Mr. Trump’s pick. “She’s got really great judgment, on a whole variety of things,” he said. To capture his feelings, Mr. McConnell turned to the words of a previous Republican senator whose spouse was a transportation and labor secretary, paraphrasing what Bob Dole once said about his wife, Elizabeth. “I feel a little bit like Nathan Hale,” Mr. McConnell said. “‘I regret that I have but one wife to give for my country. ’” Ms. Chao said, “I will be working to lock in the majority leader’s support tonight over dinner. ”'"}, "time": 1742564296.7412996}