{"duration": 0.04987478256225586, "input_args": {"text": "'Thursday on Fox News Channel’s “Hannity,” conservative commentator Ann Coulter, author of “In Trump We Trust: E Pluribus Awesome!” took aim at what she described as “beta males” behind what could be “Rodney King riots” staged to protest a speech she has pledged to give next week at the University of California in Berkeley, CA.  After having her speech canceled by   officials due to safety concerns and then only to have those same officials propose an alternate date for her speech, Coulter dismissed the claim security as a reason for any cancellation. She labeled the protesters as “beta males” with weapons behind what could be “Rodney King riots” allowed by the local police department. “[N]one of this has to do with security,” she said. “After acceding to all their requirements, which were also arbitrary and silly, and they claimed it was on the basis of safety, I suggested two measures that actually would allow free speech to exist on Berkeley if they wanted it to. And that was one thing to announce that any students caught engaging in violence, mayhem, or disrupting an invited speaker’s speech would be expelled. And number two, to have a little talk with the Berkeley chief of police, who is allowing these Rodney King riots to go on whenever conservative speaker speaks. ” “I mean, it is anarchy when you are only enforcing the law in order to allow liberals to speak,” she continued. “But, no, we’ll let these masked rioters show up with weapons and start  —   I mean, they are all little beta males, but with a weapon, even a beta male can do some damage, especially to a   girl. To have them stepping in, those private individuals, according to courts, are acting under color of state law. And for the police to refuse to protect even offensive speech and by the way, and I’m the author of 12 New York Times  . This has damaged my reputation for them to be acting like I’m David Duke out there. But courts have found, even somebody out burning an American flag, the police cannot stand by and let skinheads beat them up. That is viewpoint discrimination. And they are all liable. ” (  RCP Video) Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742564621.1524477}