{"duration": 0.03961467742919922, "input_args": {"text": "'Josh Safran, showrunner for ABC’s Quantico, says the struggling drama series will continue to push political plots that parallel the Trump White House, even if it causes supporters of the president to change the channel. [Safran told The Hollywood Reporter this week that the remaining episodes of Season 2 see the show becoming “a little bit of a West Wing junior,” and will soon tackle fake news.  THR reports: “In coming weeks, the show’s version of Trump, which Safran describes as a parallel   but not a mirror image, will make his entrance, bringing with him more    versions of Steve Bannon, Paul Ryan and other members of Trump’s inner circle. And Hunter Parrish (Weeds, Good Girls Revolt) has joined the series as first son Clayton Haas, a political strategist whom Safran likens to former Obama speechwriter Jon Favreau. ” Quantico, which previously took a swipe at Trump in its first season, has seen a steep drop in ratings  —   nearly 50 percent  —   since its Season 2 opener on September 25. Ratings improved, but only slightly, after ABC moved the series from Sunday to Monday. The most recent episode drew a paltry 0.  in the ratings and 3. 31 million total viewers, well behind NBC’s Taken and CBS’s Scorpion in the same  . But Safran insists that he’s not preoccupied by ratings or if Quantico will be renewed for a third season. Instead, Safran is working to make the show as good as possible. Upcoming episodes will reportedly include storylines about fake news and a debate over a Muslim registry. “Regardless, the show will either come back or it won’t,” he said. “I highly doubt we’re going to double in the ratings and I also highly doubt we’re going to lose half of our audience. I’m blissfully ignorant and just keeping my head down trying to make the show as strong as possible. ” Safran also told THR he thinks it is “probably unlikely” that Trump supporters are watching the show. “It’s a show about inclusion and where the women have what would have been typically male roles. It’s all about people of color working together to do what’s right,” he explained. “We believe in women in power and everyone’s equal and freedom for all. We don’t exactly stand for Trumpian instincts by our very nature. ” “You’ll probably find that 24: Legacy and partially Designated Survivor, which takes more of a bipartisan look at things, have more of a viewership that voted for Trump or who are   than us,” he added. Read Safran’s full interview here.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562045.1912508}