{"duration": 0.06077003479003906, "input_args": {"text": "'Federal Judge: “Where are the Christians”? November 01, 2016 Iraqi refugees that fled violence in Mosul and internally displaced Syrians who fled Islamic State controlled areas in Deir al-Zor,... \\nA federal judge has rebuked the Obama administration over the lack of Syrian Christians being admitted from the war-zone. \\nJudge Daniel Manion addressed the refugee issue and took aim at the Obama administration over how few Christians had been admitted to the U.S. The Judge called it a \"perplexing discrepancy\" that only 56 of 11,000 Syrian refugees to the U.S. in fiscal 2016 were Christian. The rebuke came in a Seventh Circuit Court of Appeals opinion on a Freedom of Information Act lawsuit filed by The Heartland Alliance’s National Immigrant Justice Center. A report from Fox News singled out the following quotes from Manion. \\n“It is well‐documented that refugees to the United States are not representative of that war‐torn area of the world. Perhaps 10 percent of the population of Syria is Christian, and yet less than one‐half of one percent of Syrian refugees admitted to the United States this year are Christian,” he wrote. \\n“To date, there has not been a good explanation for this perplexing discrepancy,” Manion noted. \\nReligious Freedom Coalition / TRUNEWS analysis listen to show dated 11/1/2016 \\n- Article by , Correspondent for TRUNEWS Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563248.0563633}