{"duration": 0.10323286056518555, "input_args": {"text": "'45 Weird Bans on Women in Iran Gender apartheid in the Islamic Republic. October 27, 2016 Dr. Majid Rafizadeh \\nUnder Iran’s Islamic laws, women are prohibited from performing basic day-to-day activities. I had firsthand experience of witnessing many of these strange and bizarre bans while living in Iran and other Muslim countries. Millions of women, including my relatives in Iran and Syria, continue to face these injustices. Some of the following rules, which are derived from Iran’s Islamic constitution and moral police codes, were recently reported on by Deutsche Welle Farsi . They exist in may other Islamic countries as well: \\n1. Women are prohibited from taking selfies with soccer players. Specifically, Iran’s “moral committee” has banned women from taking selfies with famous soccer players. \\n2. Iranian women are prohibited from riding bicycles. Iran’s Supreme Leader, Ayatollah Ali Khamenei, recently issued an Islamic fatwa regarding officially banning women from riding bicycles. He argued that \"riding bicycles often attracts the attention of men and exposes the society to corruption, and thus contravenes women\\'s chastity, and it must be abandoned,” according to Iran’s state-run media. \\n3. Coffee shops are prohibited from hiring women. According to Iran’s police, women are banned from working in any cafés. \\n4. Iranian Muslim women cannot marry non-Muslim men. But Iranian Muslim men can marry non-Muslim women. \\n5. It is forbidden for women to wear boots over their pants. (Why? I am not sure what is Iran’s Islamic logic behind this.) \\n6. Women are not allowed to wear hats instead of veils to cover their hair. \\n7. Women are not allowed to wear tight clothes that show their body curves. \\n8. Women are prohibited from wearing tight clothes for swimming. \\n9. Women are forbidden from changing their religion or criticizing Muhammad, Allah, the Supreme Leader and other Muslim leaders. \\n10. Women are prohibited from entering sport stadiums and watching men’s sports. \\n11. In Iran, buses and subways are divided in two sections. The larger front section is for men, the smaller back section is for women. Women are prohibited from entering the men\\'s section even if there are no seats left in the back and there are plenty of empty seats in front of the bus. \\n12. According to Iran’s moral police, women are banned from wearing leggings. \\n13. Women are prohibited from showing strands of their hair on any side. Article 683 states: “Those women that appear in the streets and public places without the Islamic hijab, shall be sentenced from ten days to two months’ imprisonment or fined from fifty thousand to five hundred thousand Rials.” \\n14. Women are banned from going camping with men. \\n15. Any kind of contraceptive surgery is not allowed for women. \\n16. Women are banned from entering coffeehouses or smoking hookah. \\n17. Women are not allowed to initiate divorce. Men have the right to do so. \\n18. According to Iran’s family code, women cannot travel abroad except with the permission of their custodian or natural guardian (husband, father, etc.). They also cannot obtain a passport without the consent of their husbands. \\n19. Women are banned from wearing clothes with writing on them. \\n20. Women are banned from taking their hijab off in any sport event, including in the Olympics. \\n21. Iranian women are prohibited from pursuing education in some academic fields. Iranian regime\\'s oil minister argued that “education of women in the field of operations such as drilling and processing and so on that require (physical) activities in operational areas and sites is useless and these are masculine (men’s) jobs.” \\n22. Women are not allowed to work in any occupation if their husband disagrees with it. Article 1105 of the Civil Code states, “In relations between husband and wife, the position of the head of the family exclusively belongs to the husband.” In addition, when it comes to employment laws, Article 1117 of the Civil Code indicates, “The husband can prevent his wife from an occupation or technical profession which is incompatible with the family’s interests or the dignity of him or his wife.” \\n23. Women are banned from receiving the same amount of inheritance as their male relatives. Even if a husband dies, the wife will receive only one-eighth of the inheritance if she has a child. \\n24. Women are forbidden from having any physical contact with men, including shaking hands. \\n25. Women are banned from becoming a Supreme Leader. \\n26. Girls, as young as 9 years old, are not allowed to object to their parents decision to marry them off. \\n27. Women are not allowed to object to their husband’s requests for sex. The law of Tamkin means women’s submission, obedience, full accessibility and unhampered sexual availability to her husband. Sexual availability is considered a woman’s duty and a man’s right. \\n28. Women are not allowed to bring lawsuits if they are raped, unless they have four witnesses. \\n29. Women are banned from socializing or dating men. \\n30. Women are banned from attracting attention in public through “flamboyant behavior” such as laughing loudly. \\n31. Women are not allowed to show any part of their skin except the face. It is encouraged to cover the face as well. \\n32. Women are not allowed to have any kind of alcoholic drinks. \\n33. Women are not allowed to dance. \\n34. Women are forbidden from being lesbian. Sex between two women is adultery and the punishments range from stoning to execution. \\n35. Women are banned from listening to “forbidden” music. \\n36. Women are not allowed to have pets, such as a dog. \\n37. Women are banned from adopting except if they have a husband and he agrees to do so. \\n38. Women are prohibited from gambling in any kind of event. \\n39. Women are banned from having sex or marrying a man up to five or six months after their divorce. \\n40. Women are prohibited from having tattoos. \\n41. Women are not allowed to have premarital relationships with men. \\n42. In many of Iran’s provinces, women are banned from performing music on stage. \\n43. Women are banned from being judges. \\n44. Women are banned from striking their husband, but men are allowed to do so in some circumstances. \\n45. Women are not allowed to show their jewelry in public. \\nSome women continue to defy these rules, but many face severe punishment and discrimination for performing some of these normal day-to-day activities. We need to raise our voice in helping Muslim women in Iran and other Muslim countries who desire to experience freedom, social justice, equality, and do not want to be subjugated, dehumanized, treated as second class citizens, or solely as sexual toys for men.'"}, "time": 1742561686.2462003}