{"duration": 0.015894412994384766, "input_args": {"text": "'Fox News host Bob Beckel was fired Friday over an “insensitive” remark he made to an   employee  —   the second time the former Democratic strategist has been let go from the conservative network. [“Bob Beckel was terminated today for making an insensitive remark to an   employee,” Fox said in a statement Friday.  Beckel, an outspoken liberal who had served as Walter Mondale’s 1984 presidential campaign manager, was frequently in hot water during his time at Fox, particularly for his occasional   cursing and controversial remarks. Beckel was a   of The Five, as well as an occasional guest on other Fox programs. It is the second time Beckel has been fired from the company after he was fired in June 2015 over his “personal issues. ” Beckel had previously spent time in rehab for an addiction to prescription pain medication. “We tried to work with Bob for months, but we couldn’t hold The Five hostage to one man’s personal issues,” Bill Shine,   vice president of programming, said in a statement at the time. “He took tremendous advantage of our generosity, empathy and goodwill and we simply came to the end of the road with him. ” Beckel later contested Shine’s claim that he was taking advantage, tweeting that he had been recovering from back surgery. I just can’t understand the anger in Fox statement. I was healing from major back surgery i could not walk, I took no advantage I got well,  —   Robert G Beckel (@RobertGBeckel) June 26, 2015,  Beckel was rehired in January this year but, according to Variety, Fox’s human resource department was made aware of the alleged remark Tuesday. After an internal investigation, Beckel was fired Friday. Fox’s internal culture has been under the spotlight in recent months, amid a catalog of claims of both racial and sexual harassment at the company. Both Former CEO Roger Ailes, who died Thursday, and former host Bill O’Reilly were fired after sexual harassment claims against them were made public. Both men have denied the allegations. Adam Shaw is a political reporter for Breitbart News. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628438.9737308}