{"duration": 0.06696486473083496, "input_args": {"text": "'Buzzfeed…“Trending Now” \\n* * * \\nAs Liberty Blitzkrieg’s Mike Krieger recently asked (and answered) , why are these things happening in the first place? \\nApple claims not to endorse candidates, but their actions suggest otherwise, and some of their executives – including CEO Tim Cook – actively support Clinton’s campaign. Buzzfeed recently obtained an invitation to a private $50,000-per-plate fundraiser Cook is hosting for Clinton with his Apple colleague, Lisa Jackson, at the end of this month. \\n\\nApple isn’t the only corporation doing Clinton’s bidding. Wikileaks founder Julian Assange said Clinton made a deal with Google and that the tech giant is “directly engaged” in her campaign. It’s been widely reported Clinton hired Eric Schmidt —chairman of Alphabet, the parent company of Google—to set up a tech company called The Groundwork. Assange claims this was to ensure Clinton had the “engineering talent to win the election.” He also pointed out that many members of Clinton’s staff have worked for Google, and some of her former employees now work at Google. \\nOf course, I covered Groundwork earlier this year. See: Meet “Groundwork” – Google Chairman Eric Schmidt’s Stealth Startup Working to Make Hillary Clinton President \\nTwitter is another culprit. The company has gotten a lot of slack for banning conservatives and Trump supporters such as Breitbart’s Milo Yiannopoulos and, most recently, rapper Azealia Banks after she came out in support of Trump. Twitter has provided vague answers as to why conservative voices have been banned while they’ve allowed other users to call for the killing of cops. \\n\\nJust yesterday, Buzzfeed revealed that the social media giant’s top executive personally protected the President from seeing critical messages last year. “In 2015, then-Twitter CEO Dick Costolo secretly ordered employees to filter out abusive and hateful replies to President Barack Obama.” \\n\\nThe founders of some of the most popular pro-Trump Twitter handles – including @USAforTrump2016 and @WeNeedTrump—insist Twitter is censoring their content. They’ve pointed out that Twitter changes trending hashtags associated with negative tweets about Clinton (which has been reported before ). On August 4, shortly after the hashtag “HillaryAccomplishment” began trending, it was taken over by anti-Clinton users, who used it to mention Benghazi or Emailgate. Eric Spracklen, @USAforTrump2016 founder, noticed the hashtag was quickly changed—pluralized to #HillarysAccomplishments. \\nMany people have pointed out the exact shenanigans described above for other Clinton-related hashtags. In fact, it’s been my self-described progressive friends who have been most up in arms about it. \\n“They take away the hashtag that has negative tweets for Clinton and replace it with something that doesn’t so the average person doesn’t see what was really trending,” Spracklen said. “This happens every day.” \\n\\nThis new strand, where one cannot even search for alternative viewpoints amid technology companies who stand to benefit from the free-trade policies and eased immigration regulations of a Clinton presidence, represents a dangerous sea change. There’s absolutely no question the digital forums we use every day are censoring conservatives and favoring Clinton. You can’t simply scroll through photos on Instagram, look for a video game in the App Store or do a quick Google search without being fed anti-Trump and pro-Clinton propaganda. \\nPersonally, I’ve definitely noticed a big-time pro-Clinton bias in my Twitter stream on a daily basis, and I don’t follow people/organizations that would define themselves as overtly pro-Clinton. That’s my honest perception, and I don’t have a dog in this fight. \\n* * *'"}, "time": 1742563322.876999}