{"duration": 0.12573623657226562, "input_args": {"text": "'Paranoid apoplexy over the Russkies By Jacob Hornberger Posted on October 28, 2016 by Jacob Hornberger \\nAs I watch the paranoid apoplexy that U.S. officials and their acolytes in the mainstream press are displaying over the hacking of Democratic Party computers and the disclosure of their emails, I’m tempted to say that it might all be some sort of karmic justice. But since I’m a Christian rather than a Buddhist, I’m more tempted to say that it might all be a ratification of the principle, “You get what you sow.” \\nConsider their accusation: that it was the Russkies who did the hacking and the disclosing of those emails. Is there any evidence that they’ve shown us? None! But heaven help anyone who points that out. He will be labeled a lover and defender of Vladimir Putin as well as an American who hates America, one who dares to doubt the word of the U.S. “intelligence establishment.” Why, they might even insinuate that he is a communist or a communist sympathizer, as they did during the old Cold War. \\nWhen it comes to U.S. national-security state accusations against Russia, Americans are supposed to do what they were expected to do during the previous Cold War: hop to, salute, pledge allegiance, and unconditionally accept the conclusions of the U.S. “intelligence community.” Sort of like when they were expected to blindly support the invasion of Iraq based on those WMD conclusions that were being issued by the national-security establishment. \\nDon’t ask questions. Just defer to their authority. They know what’s best for us. They have access to information we don’t have. They’re just protecting “national security.” \\nEvidence? Who needs any stinking evidence? Everyone knows that the Russkies do these sorts of things. It has to be them. Who else? \\nNever mind that these people lie from time to time. Recall Director of National Intelligence James Clapper who lied under oath to Congress about the NSA’s super-secret illegal surveillance scheme on the American people. (Of course nothing happened to him.) Or CIA Director Richard Helm’s lying to Congress about the CIA’s super-secret schemes in Chile to effect regime change there. (He was permitted to plead out to a misdemeanor and hailed as hero back at CIA headquarters.) \\nIn fact, the subject of Chile raises the possibility that the paranoid apoplexy that these people are experiencing over Russia’s supposed efforts to influence U.S. elections might be some sort of psychological payback for all the things that the U.S. national-security establishment has done to influence elections in other countries. \\nIn the 1960s, one could be forgiven for concluding that the CIA was a super-secret political party in Chile, given the millions of dollars that the CIA spent to support its candidates in Chile’s elections. Of course, that wasn’t the worst of it. When the 1970 presidential election failed to go the CIA’s way, it bribed members of the Chilean legislature, bribed national food truckers to go on strike, assassinated an innocent man (Rene Schneider, the head of Chile’s armed forces), orchestrated a violent military coup that left the democratically elected president of Chile dead, and then supported a regime that raped, tortured, executed, and assassinated thousands of innocent people, including two innocent Americans, Charles Horman and Frank Teruggi . \\nAnd they’re complaining of a few hacked emails belonging to some U.S. political hacks? \\nDon’t forget Guatemala. When the Guatemalan people elected Jacobo Arbenz to be their president, U.S. national-security state officials were outraged because he was a socialist (just like Franklin Roosevelt and Lyndon Johnson, who brought us Social Security and Medicare). So, the CIA did some interfering with that election by instigating a violent military coup in Guatemala, one that sent that nation into a 30-year civil war that killed hundreds of thousands of people. \\nWhat about Iran, where the CIA decided that it would do a some influencing in an election in that country by instigating a coup that ousted the democratically elected prime minister of the country? Americans and Iranians are still paying the price for that bit of influencing. \\nLest anyone think that those democracy-busting regime changes are ancient history and that the U.S. national-security establishment has reformed itself, let’s not forget the massive amount of weaponry and foreign aid that is poured into the coffers of Egypt’s brutal military dictatorship, which ousted a democratically elected president it didn’t like. \\nIf there weren’t so many innocent people who have suffered death, rape, torture, execution, and assassination from U.S. interference with the elections of other countries, the rank hypocrisy would be rather humorous. The simple fact of the matter is that U.S. officials lack moral standing to complain about any foreign regime’s supposedly influencing U.S. elections. \\nI’d be remiss if I failed to point out one humorous aspect of this karmic or you-get-what-you-sow experience. U.S. officials just arrested a national-security state official and charged him with stealing U.S. national-security secret secrets. What are the secrets he stole? He stole secret codes that enable U.S. officials to hack into the computers of foreign regimes! How’s that for a bit of dark irony? It’s just a matter of time before they say that Putin is using the codes that their man stole to hack into the email accounts of Democratic Party hacks. \\nOne final question: Why are U.S. officials and their mainstream press supporters complaining that everyone is reading those Democratic Party emails? As those people say to Americans who have had their emails, Internet visits, and telephone calls monitored by the NSA, if you have nothing to hide, what are you worried about? This work by MWC News is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \\nJacob G. Hornberger is founder and president of The Future of Freedom Foundation. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742563129.7487338}