{"duration": 0.07804155349731445, "input_args": {"text": "'The U. S. Commission for International Religious Freedom (USCIRF) offers a grim assessment of the state of religious liberty worldwide in its 2017 report, noting that the state of affairs “is worsening in both the depth and breadth of violations. ”[“The blatant assaults have become so frightening —  attempted genocide, the slaughter of innocents, and wholesale destruction of places of worship —  that less egregious abuses go unnoticed or at least unappreciated,” the report states.  The report goes on to lament that many observers “have become numb to violations of the right to freedom of thought, conscience, and religion” and now simply take them for granted. The USCIRF takes care to distinguish religious liberty from mere freedom of worship, to include the freedom —  either alone or in community with others and in public or private —  to manifest one’s religion or belief in teaching, practice, worship, and observance. Along with its appraisal of the global situation regarding religious freedom, the Council also offers an evaluation of individual nations in its 2017 report. Noteworthy in this regard is its inclusion of Russia for the first time ever in its list of “Countries of Particular Concern” (CPC) for “systematic, ongoing, and egregious violations of religious freedom. ” The report makes note of a decision by the Russian Supreme Court to ban the existence of the Jehovah’s Witnesses in that country as a particularly egregious example of these violations. Their right to religious freedom, the report observes, is being eliminated thoroughly —  and yet “legally” under Russian law. Russia’s continued use of its “ ” law as “a tool to curtail religious freedoms” is one of the reasons USCIRF has recommended that Russia be designated as a “country of particular concern,” the report stated. Not long ago, the Pew Research Center reported that Egypt is now the country with the highest level of government restrictions of religion in the entire world, yet despite this distinction, the 2017 USCIRF report removed Egypt as a CPC, placing the country on its “Tier 2,” its former “Watch List. ” Curiously, the Jehovah’s Witnesses have been banned in Egypt since 1960 —  the very crime the USCIRF adduced for placing Russia on its list of CPCs. Religious persecution in Egypt has been under scrutiny of late, due to the heightened presence of the Islamic State in the region of North Sinai and elsewhere. On Palm Sunday, Islamic State suicide bombers bombed two Christian churches near Cairo, killing at least 45 worshipers and injuring scores more. The USCIRF report acknowledges “the government’s widespread repression of human rights,” while claiming that religious freedom conditions improved in several areas over the past year. As positive signs, the report states that President Abdel Fattah Sisi consistently condemned sectarian attacks and pressed for assistance for victims and accountability for perpetrators, pushed for reform in religious discourse, and attended a Coptic Christmas Eve mass for the third consecutive year. By early 2017, the government also completed rebuilding and restoring more than 50 churches destroyed by extremists in 2013. Egyptian courts have made some progress in bringing to justice perpetrators of past attacks, the report states, and in 2016, prosecutions, convictions, and imprisonment of Egyptian citizens for blasphemy and related charges decreased. As an independent, bipartisan U. S. federal government advisory body, the USCIRF is uniquely positioned to offer counsel to the President and the State Department. Follow Thomas D. Williams on Twitter'"}, "time": 1742563164.480229}