{"duration": 0.061369895935058594, "input_args": {"text": "'During CNN’s coverage of   Donald Trump’s press conference on Wednesday, anchor Jake Tapper stated that it was “irresponsible” of Buzzfeed “to put uncorroborated information on the Internet. I can understand why   Trump would be upset about that. I would be upset about it too. It’s why we did not publish it, and why we did not detail any specifics from it, because it was uncorroborated, and that’s not what we do. ”  Tapper said, “At the beginning of the press conference, Sean Spicer, who’s going to be the White House Press Secretary, suggested that both Buzzfeed and CNN published this dossier full of uncorroborated rumors. That’s not true. That’s false. CNN never did that. We never provided even one detail from that dossier, except this morning when I said, that there was reason to believe that one detail that had been out there because of Buzzfeed was false, involving Trump’s attorney Michael Cohen. So, that conflation whether it’s because Sean Spicer misunderstood, or some other reason, that’s not true. CNN did not do that. ” He continued, “What we did was, say, in our reporting yesterday that broke the story, that the intelligence chiefs  —   intelligence chiefs of the United States when they briefed President Obama Thursday and   Trump on Friday, provided, in their briefing to these two leaders about Russian into the US 2016 election, two pages of a synopsis, and the synopsis was, in part, based on information in that dossier that was uncorroborated and the intelligence chiefs had not yet run to ground, but they believed that the source of the dossier was credible and his sources were credible. And they believed that: A. The   and the president should know that the Russians were claiming they had compromising information on him, and two, that the Russians were claiming that there were contacts between the Trump camp or Trump orbit and the Russian government or the Russian orbit during the campaign. And that information was provided. No one has disputed that that   dossier was in the presentation, and that  —   I’m sorry that   synopsis was in the presentation by the intelligence chiefs to   Trump, to President Obama. We have been asking now, for more than half a day, for several, several hours before we went with the story, for a comment from the Trump campaign. ” Tapper further stated, “And when Mr. Trump went after our own Jim Acosta, saying he’s fake news and he isn’t going to call for him, what I suspect we are seeing here is an attempt to discredit legitimate, responsible attempts to report on this incoming administration with irresponsible journalism that hurts us all, and the media going forward should keep that in mind. So, that’s one, just to get that out of the way. ” Tapper concluded by saying of Buzzfeed’s story, “It’s irresponsible to put uncorroborated information on the Internet. I can understand why   Trump would be upset about that. I would be upset about it too. It’s why we did not publish it, and why we did not detail any specifics from it, because it was uncorroborated, and that’s not what we do. We are in the business of sussing out what is true and what is false. ” (  Real Clear Politics) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742562747.9859872}