{"duration": 0.0333101749420166, "input_args": {"text": "'On Tuesday    Hunter Jackson was suspended for seven days after bringing an empty . 22 shell casing to school to show his friends. [Hunter’s school —  A Place to Grow —  is located in Troy, Illinois.  According to Fox 2 Now, Hunter’s mother, Kristy Jackson, said her son was excited because he had just spent time with his grandpa —  a Caseyville, Illinois, police officer —  who was teaching him about hunting and gun safety. Jackson said: [Hunter] just was wandering around in a field and picked up and put it in his pocket and didn’t tell his parents  …    it’s paranoia.  It’s something that’s become quite an epidemic where guns are automatically assumed that they’re bad  …    and I’m not sure how a   suspension teaches my son anything about tolerance or anything about why he was wrong.  It just means his school doesn’t want him there because of things he enjoys. In a Facebook post, Jackson she went to the school to pick her son up like any other day, only to met by “a stone faced teacher” who said her son had brought a “shotgun bullet” to school. Jackson said her immediate thought was, “My kid? Who just spent the weekend learning gun safety?” She said the teacher then handed her a letter saying “[Hunter’s] behavior warranted a seven school day suspension. Which [Kristy] still was expected to pay tuition for, of course. And a threat that if his enthusiasm for guns continued, he’d be permanently expelled. ” Fox 2 Now reports that the letter also said the school had “repeatedly” told Hunter to quit “using other toys as make believe guns” The school’s   also emailed Jackson to inform her that he was “notifying the Illinois Department of Children and Family Services (DCFS)” about the suspension. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742564303.574663}