{"duration": 0.21273255348205566, "input_args": {"text": "'Republican elected officials, donors and strategists grappled uncomfortably on Wednesday with the inevitability of Donald J. Trump as their presidential nominee, an unexpectedly sudden denouement that left many in a state of political paralysis and others vowing to oppose the party’s new  . While some called for unity, many Republican leaders refrained from falling in line behind Mr. Trump, with dozens avoiding inquiries about where they stood or saying they wanted Mr. Trump to detail his policies or tone down his language first. Others tied themselves in knots as they praised and criticized Mr. Trump in a single breath, or suggested that they could abide Mr. Trump but loathed his agenda. Senator Kelly Ayotte of New Hampshire, who is in a tough   race, signaled that she would “support” Mr. Trump but not “endorse” him, as a spokeswoman put it, a rhetorical contortion that other Republicans repeated privately. Representative Raúl R. Labrador of Idaho, a staunch conservative, said he would support Mr. Trump but derided him for “not knowing much about the Constitution or politics. ” Former Gov. Bob Martinez of Florida, who retains a strong network of donors, said he would raise money for Mr. Trump but was unsure about his proposals, like temporarily banning foreign Muslims from entering the United States. For a party that usually rallies around its presumptive nominee quickly, the brutal primary campaign and the questions about Mr. Trump’s substance and style have fueled a remarkable level of dissatisfaction  —   antipathy that will not fade simply because Senator Ted Cruz of Texas and Gov. John Kasich of Ohio have ceded the race to him. The journey from denial and resistance to grudging acceptance, and even peace, with the Trump nomination may never be complete for some Republicans. But leaders hope to change that quickly, to save the party from splintering and to have a real shot at winning in November. “There will be some that will take days and weeks to realize that there are two choices and that it’s between Donald Trump and the Democratic nominee, which most of us believe will be Hillary Clinton,” said Gov. Phil Bryant of Mississippi. Mr. Bryant, who supported Mr. Cruz, called on him and others to back Mr. Trump. “Realistically, and I think Republicans are realists, this is an opportunity to have a Republican president sitting in the Oval Office,” he said. But Representative Tom Cole of Oklahoma, a veteran House member and Republican strategist, said he was counseling his colleagues in competitive races to be coldblooded about how they approach their nominee. “Position yourself in the way you think is best for you,” he said, allowing that “it is difficult” for some members. “I know a lot of Republicans who are in   districts in blue states who see Trump as more helpful to them than they would have Cruz,” Mr. Cole said, citing Representative Elise Stefanik, who represents a sprawling district in upstate New York. “But if you’re in a heavily Hispanic district, your calculation is very different. ” Mr. Trump’s achievement also drew a rebuke of sorts from the last two Republican presidents. Aides to former Presidents George Bush and George W. Bush said they would not participate in or comment on the presidential campaign. By contrast, they supported the Republican nominees in the last two elections: John McCain in 2008 and Mitt Romney in 2012. Mr. Trump ran a sharply negative campaign against former Gov. Jeb Bush of Florida, the son of the elder Mr. Bush and brother of the younger, who dropped out in February. For some in the party, the question of whether to embrace Mr. Trump is not merely an intellectual exercise. Some staff members at the Republican National Committee were told Wednesday that if they were unable to get behind the nominee, they should leave by the end of the week. Representative Peter T. King of New York, whose Long Island district Mr. Trump won overwhelmingly in the April 19 primary, echoed other Republicans in pledging to vote for Mr. Trump even though he had reservations, calling Mr. Trump “a guy with no knowledge of what’s going on. ” “As far as any involvement or campaigning, it’s really going to depend on him filling in the gaps and consolidating his policies,” Mr. King said. “Right now, there’s no real coherence. ” The lingering resistance to Mr. Trump is especially strong in some of the states and congressional districts with hotly contested races this year. Representative Carlos Curbelo, who is from a competitive district in South Florida and has been outspoken about his refusal to support Mr. Trump, said Hispanics in his district were furious at Mr. Trump over his inflammatory language about Latinos. “Resentment is a kind way of putting it,” Mr. Curbelo said. “People are offended and really incredulous. ” He added that he would consider supporting a   presidential candidate, though that option did not appear to have much support among other Republicans on Wednesday. But the widespread discomfort and anxiety about Mr. Trump was utterly clear in the hours after he became the presumptive nominee on Tuesday night. Most leading Republicans were publicly silent. And the dearth of congratulatory news releases and Twitter posts spoke volumes. Over the last two days, more than 70 Republican governors, senators, representatives, officials and donors were contacted directly or through aides for comments about Mr. Trump. Only about 20 replied, with many aides saying their bosses did not want to take a stand yet others begged off by saying the officials were traveling or “too busy” to email, call or release a statement. Mitch McConnell, the Senate majority leader, said in a news release issued after 7 p. m. Wednesday that Mr. Trump had “the opportunity and the obligation to unite our party around our goals. ” Democrats were gleeful: Mrs. Clinton’s campaign issued a list of more than 40 conservatives denouncing Mr. Trump’s success, among them Gov. Charlie Baker of Massachusetts, who said Wednesday that he would not vote for Mr. Trump. (A spokeswoman later said Mr. Baker would not vote for Mrs. Clinton, either.) Some of the biggest Republican donors were warily eyeing Mr. Trump on Wednesday. Associates of the billionaire Paul E. Singer and of the Ricketts family, both of whom helped finance the failed “Stop Trump” efforts, said they were still evaluating the race. While most donors and Republican leaders had become resigned to the probability that Mr. Trump would be their nominee, the withdrawals of Mr. Cruz on Tuesday night and Mr. Kasich on Wednesday forced them to face up sooner than expected to a question they had been dreading. “A ton of Republicans are waking up this morning  —   and I know because we’ve already chatted  —   and many are saying, ‘I’m not getting in this mess,’ ” said Gregory W. Slayton, a top Republican   who remains adamantly opposed to Mr. Trump. “Some are saying, ‘Well, I’m going to have to back Trump,’ and of course many are saying, ‘I don’t know what I’m going to do.’ ” Two influential Republican groups, the Club for Growth and the Republican Jewish Coalition, said they planned to focus on helping House and Senate candidates this fall and on keeping both chambers under Republican control, rather than making the presidency their top priority. William Kristol, editor of The Weekly Standard, said the hostility toward Mr. Trump could be damaging if the Republican convention this summer gets out of hand or if his unusually high negative ratings end up hurting other Republicans on the ticket. “I think people are underestimating the degree to which you could see a crisis in the Republican Party,” he said. Still, in some quarters, reconciliation between Mr. Trump and his onetime critics is underway. Senator Marco Rubio of Florida, who clashed bitterly with Mr. Trump before dropping out of the presidential race, has had multiple phone conversations with him recently, according to Republicans close to Mr. Trump. (Aides to Mr. Rubio declined to comment.) And Gov. Nikki R. Haley of South Carolina, who supported Mr. Rubio and had castigated Mr. Trump at times, issued a statement Wednesday reiterating that she would support “the Republican nominee for president. ” A spokesman for Ms. Haley said she and Mr. Trump had not spoken. Trent Lott, a former Senate Republican leader from Mississippi who supported Mr. Kasich, said he thought more Republicans would come around to Mr. Trump once they appreciated his appeal among conservative Democrats and independents, as well as among Republicans who do not traditionally vote. “The thing about Trump is, he has been turning out historic numbers, even in my state here,” Mr. Lott said. “I talk to some labor union people in my hometown, they’re for Trump. ”'"}, "time": 1742564105.8077273}