{"duration": 0.0742485523223877, "input_args": {"text": "'Is it possible to break Thanksgiving? And if so, could last week’s chaotically divisive election have actually broken it? A story in The Times on Wednesday explores how the war between the presidential candidates might also lead to war at family dinner. Do you take the year off? Do you put a moratorium on politics at the table? You could. Or you could let Sam Sifton show you how to make a gravy so good it heals all divides. Sam runs the New York Times Food section, operates the paper’s Cooking app, does a column for The Times Magazine and actually wrote the book on Thanksgiving  —   2013’s amusing, invaluable “Thanksgiving: How to Cook It Well. ” On the latest episode of Still Processing, Sam has advice for orchestrating a smooth, enjoyable feast. And so do we. (To start, make extra gravy. “Thanksgiving this year is going to be tough enough without skimping on the gravy,” Jenna says.) Sam had us over to his wonderful kitchen in Red Hook, Brooklyn, to instruct us on making that gravy (Wondra: who knew?) and talk about the rules for peace, harmony and, if you’re going that route, potluck. “This Thanksgiving is gonna be different for lots of folks all across the country,” Sam says. “Some families will be largely jubilant with some   people in the corner of the table. And others will be largely sad with some jubilant outliers. . .. And if you find yourself as the outlier in one of those situations, as many Americans will at Thanksgiving, I think we just gotta  —   this year and perhaps always  —   practice radical acceptance of where you are and who you’re with. ” “The best ways to find those connections and that community is over food,” Jenna says. “As long as you don’t mess with the food too much. ” The Food section has an entire feature on Thanksgiving from all cultures, from all over the country, that is like being in 50 kitchens at the same time. If you’re taking a break from your own family’s dinner, let your mouth water at the ones the Food section discovered. Bon appétit, y’all. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “Still Processing” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for “Still Processing” and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742562702.1295264}