{"duration": 0.39783430099487305, "input_args": {"text": "'  *Articles of the Bound* / The Hillary Clinton File The Hillary Clinton File November 5, 2016, 6:37 am by Roger Aronoff Leave a Comment 0 \\nAccuracy in Media \\nOctober certainly lived up to its reputation as being a month for surprises in this year’s presidential election, especially for Democratic candidate Hillary Clinton. The media have done as much as they could to help minimize the damage, but a massive amount of new information came out that has confirmed and revealed a pattern of deceit, duplicity and corruption, unmatched in any presidential candidacy in modern times. \\nOctober Surprises \\nUntil this recent information made its way into the public consciousness, the narrative for this upcoming election was largely intact. Hillary Clinton, the most intelligent, qualified, experienced, compassionate, and yes, the first ever female candidate was headed for an historic win. Sure, she had some people who didn’t find her honest or trustworthy, but that was just because they spent too much time watching Fox News or listening to conservative talk radio. Her opponent—a crude, rude, undisciplined, tax dodging, female-groping, reality television star with a checkered business career—was going down to defeat in historic fashion, while taking down what’s left of the Republican Party he did so much to destroy. \\nBut with just one week until the most anticipated, feared, dreaded, controversial, shocking and unpredictable campaign in history comes to an end, and we enter the uncharted waters of a post-election that, if the race is close, could be a period of massive civil unrest regardless of which candidate wins—the narrative is in flux. For example, a Washington Post/ABC News tracking poll has shifted in one week from a 12-point lead by Mrs. Clinton, down to a one point lead. And as of November 1, Trump holds a one-point lead in that survey . Both sides largely view the other side’s victory as the end of the world as we know it, and simply unacceptable. \\nDespite the media’s best efforts to hold off this late rally by Trump, the cumulative effect of these various October Surprises has dramatically changed the landscape. While some aren’t complete surprises, they are corroboration and confirmation of a number of very damaging stories. First, we have the WikiLeaks revelations. At this point, with the latest release, there are more than 41,000 emails from what WikiLeaks is calling the Podesta file. John Podesta is a long-time Clinton associate who is the chairman of Hillary’s presidential campaign. He also served as chief of staff to former President Bill Clinton and counselor to President Barack Obama. And he is the former president, and now chairman of the Center for American Progress, a far-left Washington think tank. \\nThe latest batch of 2,500 of Podesta’s emails has produced another major smoking gun, as if any more are needed. The New York Post is reporting that: \\n“Hillary Clinton’s campaign chairman directed her former chief of staff to ‘dump all those emails’ the same day a bombshell report revealed Clinton’s use of a private computer server while U.S. secretary of state, WikiLeaks revealed on Tuesday. \\n“John Podesta sent the message to Cheryl Mills the evening of March 2, 2015, hours after the New York Times reported that Clinton may have violated federal records requirements by using the server, according to the latest batch of Podesta’s hacked emails.” \\nThis sounds like intent to destroy evidence, and obstruct justice. \\nIn these leaks we have learned much about how the Clinton Foundation leveraged Mrs. Clinton’s position as secretary of state to benefit her and the foundation, to bring massive wealth to the Clintons and their cronies, as well as foreign governments and other entities seeking access and favors. We have learned that many people in high-ranking positions in the Obama administration were using their private email accounts to conceal what they wanted to keep hidden from Freedom of Information Act (FOIA) requests. Here is a very handy list of 100 of the most revealing and damaging of the hacked WikiLeaks emails. They aren’t all from Podesta. Some are from FBI documents, others are from Democratic National Committee leaks. \\nWe continue to find out information from FOIA documents released by Judicial Watch , including a new batch of over 300 such documents that show how Hillary Clinton and her top aide Huma Abedin exchanged classified materials over Mrs. Clinton’s unsecured, home-brew server. According to Judicial Watch, these latest documents include: \\n“According to Freedom of Information Act (FOIA) exemptions cited in the documents obtained by Judicial Watch, three of the Clinton-Abedin email exchanges contained material ‘classified to protect national security.’ \\n“Also included in the newly obtained documents is an additional instance of the State Department doing special favors for a high-dollar Clinton Foundation donor. And the documents include instances of the distribution by State Department officials of Clinton’s government schedule to members of the Clinton Foundation staff.” \\nProject Veritas, run by James O’Keefe, has exposed the inner workings of the Democratic machine in action. It has documented direct ties between Mrs. Clinton, the Democratic National Committee, a Clinton super PAC and far-left activist groups paying people to violently disrupt Donald Trump’s campaign rallies, and help arrange voter fraud in various ways. This is criminal activity that is getting virtually no attention in the media, other than through sites such as Breitbart, and Sean Hannity on his Fox News and radio shows. The media, if they mention it at all, simply say that it comes from the “discredited” O’Keefe, that the video has been edited, and that O’Keefe has previously been convicted of a crime while doing some of his undercover videos. They ignore the substance, which is extremely damning. Photo by BrookingsInst \\nThe FBI is responsible for yet another October Surprise. On October 28, FBI Director James Comey dropped a bombshell with just 11 days to go before the election. He announced in a letter to Congress that new information had come to his attention about additional emails that they were previously unaware of that may have bearing on the Hillary Clinton email probe that he had said was completed back in July. It turns out that there were some 650,000 emails from and to Hillary’s top aide of approximately 20 years, Huma Abedin, the estranged wife of former New York Democratic congressman Anthony Weiner, who is under investigation by the FBI for alleged sexting with a minor. \\nBefore that, the FBI summary of their investigation revealed that Clinton “couldn’t remember” 40 times during her three-and-a-half hour interview with the FBI on the Fourth of July weekend. She couldn’t remember, for example, if she had been briefed on protocols for handling classified material. According to the FBI summary, “Clinton could not recall any briefing or training by State related to the retention of federal records or handling of classified information.” \\nThe Clinton Legacy from the ‘90s \\nWhile Hillary Clinton’s recent history has been plagued by scandal and failure, the recent debacles are not so different from the period of time that she and her husband spent in the White House back in the 1990s. We documented much of that corruption in the 1999 documentary, “The Clinton Legacy,” which we are re-releasing with this new report. \\nWhile most people remember Bill Clinton’s impeachment and scandals as being based on sex with an intern and lying about it under oath, there was more—much, much more. FileGate, TravelGate, and Whitewater each exposed Clinton administration corruption wherein the administration inappropriately housed FBI files in the White House, worked with corrupt individuals under criminal investigation, and generally used the full force of government, including the Internal Revenue Service, to retaliate against dissenters or those they did not favor. \\nChinaGate, which resulted in greater Chinese nuclear strike capabilities, foreshadowed the revelations regarding Russia’s uranium purchase , and highlighted the dangers of the Clinton Foundation’s ongoing foreign conflicts of interest. It involved the handing over of missile technology in exchange for cash to the Clintons and their cronies. \\nWith the help of Reid Collins, a reporter and anchor for CBS News for 20 years, and at CNN for 10 years, we tell the story of those years. People forget how bad these scandals really were, and we at AIM believed that had these been on the table, not only would Bill Clinton have been impeached, he would have been removed from office as well. As it was, half the Senate voted to remove him from office, but the Democrats came to his rescue. \\nNow both Democrats and the media are working on behalf of Hillary Clinton to obscure the facts surrounding a number of scandals which could undermine her bid for president. \\nLibya and Benghazi \\nAs we have noted, Hillary Clinton claimed a prominent position in the Libyan intervention which led to the overthrow of dictator Muammar Qaddafi. Her aide, Jake Sullivan, wrote that she had “leadership/ownership/stewardship of this country’s Libya policy from start to finish.” \\nDoes that mean that Mrs. Clinton had a part in sending weapons to the Libyan rebels? Citizens’ Commission on Benghazi (CCB) member, and former CIA officer, Clare Lopez told WorldNetDaily that “We have ample evidence the Libyan gun-running operation was a White House operation and that the State Department under Hillary Clinton ran the show.” Many of these so called rebels were known al-Qaeda affiliated jihadist groups, which is why we called our first CCB report, “ How America Switched Sides in the War on Terror .” \\nBut Hillary Clinton’s involvement in Libya has been more than an embarrassment—it has actually cost lives. The Obama/Clinton administration was offered a chance to negotiate Qaddafi’s abdication under a white flag of truce, as the CCB revealed. But they refused the offer, choosing war instead, and thousands of Libyans died as a result. Later, when four Americans were killed in Benghazi on September 11 and 12, 2012, Hillary was peddling the lie that the attack was based on spontaneous demonstrations in response to a YouTube video called “The Innocence of Muslims.” She knew that it was, in fact, a planned terrorist attack by jihadis, and said so to her daughter, and top officials in both Libya and Egypt. She then lied to the family members of the dead Americans, telling them that we were going to get the filmmaker of “The Innocence of Muslims,” who she said was responsible for their deaths. \\nEver since the West’s intervention that prompted regime change concluded, Libya has devolved into a conflict-ridden haven for the Islamic State and other terrorists. AIM’s Citizens’ Commission on Benghazi has thoroughly documented this tragic blunder. \\nRussian Reset \\nMrs. Clinton’s Russian reset hasn’t fared much better. As we have reported, President Obama and Hillary Clinton’s Russian re-set policy paved the way for Russian aggression in Syria and Ukraine, as well as “Vladimir Putin’s decision to give sanctuary to NSA defector Edward Snowden,” whose leaks have helped ISIS. \\nBack in 2014, Reuters admitted that the Russian reset had failed and that the “Cold War” was back . Now, with Mrs. Clinton running for president, the media portray her international experience as secretary of state as a grand success. The New York Times, in its January endorsement of Hillary , wrote that “The combination of a new president who talked about inclusiveness and a chief diplomat who had been his rival but shared his vision allowed the United States to repair relations around the world that had been completely trashed by the previous administration.” They asserted that Hillary “brought star power as well as expertise to the table.” \\nClinton Foundation Corruption \\nOther things that Hillary Clinton brought to the table included a number of conflicts of interest and an endless string of donors who may have benefited from her term as secretary of state. As we reported, Peter Schweizer, author of Clinton Cash , wrote, “Any serious journalist or investigator will tell you that proving corruption by a political figure is extremely difficult.” He continues, “…That is also why investigators primarily look at patterns of behavior.” \\nIn the case of the Clintons, the pattern of behavior is stunning. We have called it “ blatant, willful, and indisputable ” due to the growing number of examples of favors that were done, and donations accepted, while Hillary was secretary of state. The Associated Press reported that “More than half the people outside the government who met with Hillary Clinton while she was secretary of state gave money—either personally or through companies or groups—to the Clinton Foundation.” Hundreds of millions of dollars were involved. According to the AP, “Clinton met with representatives of at least 16 foreign governments that donated as much as $170 million to the Clinton charity, but they were not included in AP’s calculations because such meetings would presumably have been part of her diplomatic duties.” \\nIn 2015, the Clinton Foundation announced that it would amend four years of tax returns because of an error in how it reported income from foreign government donations, according to Breitbart. The years refiled just happened to include most of the years that Mrs. Clinton served as Secretary of State—2010 through 2013—and involved $20 million. \\nWhile Trump University has garnered significant attention from the media, Laureate Education has received much less mainstream press attention. As Honorary Chancellor of Laureate Education, Bill Clinton received more than $16 million that he routed through a shell corporation, WJC, LLC, as we have reported . Then, “more than $55 million American taxpayer dollars flowed out of Hillary Clinton’s State Department to a non-profit run by Laureate CEO Douglas Becker.” \\nThe recent WikiLeaks documents pertaining to Clinton campaign chair John Podesta reveal that Mrs. Clinton was invited to a Clinton Global Initiative (CGI) event in Marrakesh, Morocco in 2014. However, the Moroccan King Mohammed VI pledged $12 million to CGI and the foundation under the condition that Hillary Clinton attend the conference herself. \\nLongtime Clinton aide Huma Abedin writes in a November 2014 email that “no matter what happens, she will be in Morocco hosting CGI on May 5-7, 2015. Her presence was a condition for the Moroccans to proceed so there is no going back on this.” \\nUltimately, Mrs. Clinton did not attend—but her husband and daughter did. According to The Daily Caller, the CGI event was funded by the Moroccan government-owned mining company OCP, which has been charged with serious human rights violations by the Robert F. Kennedy Center for Justice. “Clinton vigorously supported the Moroccan King when she was Secretary of State and the U.S.-financed Export-Import Bank gave OCP a $92 million loan guarantee during her tenure as Secretary of State,” reports The Daily Caller. “The mining company also contributed between $5 million to $10 million to the Clinton Foundation, according to the charity’s web site.” \\nAnd speaking of mining, this section wouldn’t be complete without mention of the Uranium One deal. Breitbart reported that “ According to Clinton Cash [the book by Peter Schweizer] , the total donations from Uranium One shareholders to the Clinton Foundation exceeded $145 million, in the run-up to Hillary Clinton’s State Department approving the Rosatom deal, which gave Russia control over about 20 percent of U.S. uranium.” The New York Times deserves credit for following up on Schweizer’s reporting, and confirming his findings in a front-page story in 2015. \\nThe Clinton Foundation has also received a number of donations from human (and women’s) rights violating countries, such as the United Arab Emirates, Saudi Arabia and Qatar. The Clintons have committed to not receiving additional donations from foreign governments, corporations, or U.S. companies should Hillary Clinton become president. But until then, the foundation remains a way for bad actors to purchase future influence over this presidential candidate. \\nHillary also refused to discuss pay-for-play involving the Clinton Foundation—and talked over Donald Trump when he tried to comment on it. “…I’m thrilled to talk about the Clinton Foundation because it is a world renowned charity and I’m so proud of the work that it does,” said Hillary Clinton. “I could talk for the rest of the debate.” She touted the foundation’s achievements, but refused to address the lingering scent of scandal. “…we at the Clinton Foundation spend 90 percent of all the money that is donated on behalf of programs for people around the world and in our own country,” she said at the debate. In fact, Schweizer claims that only “six percent goes to other charities,” according to Breitbart. “The other 94 percent is in this stew of marketing, and management, and travel expenses, and sort of all these obscure things, that it’s really hard to dissect what is the end result of that 94 percent being spent.” \\nBut don’t look to the mainstream media to broach these issues. Instead, the spotlight is on Trump. And those media elites who donate to presidential campaigns overwhelmingly support Mrs. Clinton. \\nMedia Collaboration with Clinton and Obama \\nDespite the need for a fair, balanced, and objective press, we have cited the fact that 96 percent of the journalist donations tracked by the Center for Public Integrity went to Hillary Clinton’s campaign. Politico’s Jack Shafer recounts how the WikiLeaks emails expose journalists trying to curry favor with the Clintons through compliments and sharing information about stories not yet published. “Reading the emails, we witness CNBC/ New York Times contributor John Harwood slathering Podesta with flattery, giving him campaign advice and praising Hillary Clinton,” writes Shafer. “In another email, the Washington Post ’s Juliet Eilperin offers Podesta a ‘heads up’ about a story she’s about to publish, providing a brief pre-publication synopsis.” In addition, “CNBC’s Becky Quick promises to ‘defend’ Obama appointee Sylvia Mathews Burwell.” \\nThe list of embarrassing—and disturbing—media cozying up to the Clintons goes on. “POLITICO reporter Glenn Thrush sends Podesta a chunk of his story-in-progress ‘to make sure I’m not [f—–g] anything up,’” writes Shafer. “Beyond WikiLeaks, a January 2015 Clinton strategy document obtained by the Intercept describes reporter Maggie Haberman—then at POLITICO and now at the New York Times —as someone the campaign ‘has a very good relationship with,’ and who had been called upon to ‘tee up stories for us before’ and had never disappointed.” Yet Shafer, as a member of the mainstream media, concludes that these Clinton-pandering media examples are fine—so long as the resultant reporting is “creditable work that is accurate and useful to readers.” Shafer believes these reporters hit the mark, yet, as we have reported, some journalists question whether objectivity is even necessary or prudent during this election cycle. \\nThe reporting about Hillary Clinton has been so biased that journalists can hardly congratulate themselves for an accurate and useful job well done. The scandals mentioned above were largely covered by the conservative media, with a few notable exceptions . \\nYet media pundits such as ABC’s George Stephanopoulos, who donated $75,000 to the Clinton Foundation , and journalists donating to the Clinton campaign, are working hard to disseminate false journalism which excuses or downplays these scandals. \\nJust as the press panders to Hillary Clinton, so, too, the presidential candidate uses the many opportunities supplied by the mainstream media to pander both to the liberal elite and others watching this broadcast media love-fest. Consider, for example, the March 9 Democratic Debate featuring Univision’s Jorge Ramos as a moderator. “You’re telling us tonight that if you become president you won’t deport children who are already here?” he asked Mrs. Clinton. “And that you won’t deport immigrants who don’t have a criminal record?” \\nHillary answered emphatically “Yes” to both questions, engaging in what co-moderator Maria Elena Salinas called “Hispandering.” But the question of criminal records for illegals is moot; currently the Obama administration is releasing dangerous criminal illegal aliens with no intention of deporting them, we noted back in June. “Rep. Brian Babin (R-TX) told Adam Kredo of The Washington Free Beacon that ‘the administration is trying to suppress information about the release of some 86,000 criminal illegal immigrants who have committed 231,000 crimes in just the past two and a half years,’” we wrote. “The administration is not deporting these criminals after they are released from U.S. prisons, reports Kredo.” \\nDuplicity \\nAn open borders policy already in the making threatens the safety of average Americans. Yet Mrs. Clinton wants to continue Obama’s lax immigration policies if, or when, she gains office. \\nWhile Hillary may claim now that she opposes the Trans-Pacific Partnership, she once said that the TPP “sets the gold standard in trade agreements.” Now, as a presidential candidate, she says, “I oppose it now, I’ll oppose it after the election, and I’ll oppose it as president.” \\nYet Mrs. Clinton told Banco Itau that her “ dream ” was “a hemispheric common market, with open trade and open borders, sometime in the future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere.” Hillary said, in one of her many speeches to bankers, that she has both “a public and a private position” on Wall Street reform. Perhaps her “open trade and open borders” comment was yet another example of the presidential candidate holding a private opinion that is opposed to her public statements. Those speeches paid very well. Hillary collected nearly $22 million for 90 speeches in less than two years, between the time she left office as secretary of state until she announced she was running for the presidency. And that was just a fraction of the $153 million that she and Bill took in from speeches between the time they left the White House in 2001, and her announcement to run to get back into the White House. \\nFor example, despite railing against Wall Street and the elite, she has taken millions from big donors—and is indebted to them. “Determined not to fall behind in the money race, Hillary Clinton ramped up her appeals to rich donors and shrugged off restrictions that President Obama had imposed on his fundraising team,” reports The Washington Post this October. “Even as her advisers fretted about the perception that she was too cozy with wealthy interests, they agreed to let lobbyists bundle checks for her campaign, including those representing some foreign governments, the [WikiLeaks] emails show.” By the end of September, the Post reports, Mrs. Clinton had raised $1.14 billion. “Unlike Obama, Clinton fully embraced super PACs from the very beginning of her race, helping pull in larger checks from donors than the president did.” \\nHillary Clinton has lied again and again. One of her most notable lies is about the national security scandal that is EmailGate, in which Mrs. Clinton not only used a private email server for her business as secretary of state, deleting half of the emails, but also sent and received classified information through that server. She demonstrably placed national security secrets at risk in order to hide her affairs from the public, yet FBI Director James Comey decided not to recommend prosecution . The fix was in . So why did Comey bring the case back up with just 11 days until the election? Several reports suggested that FBI agents who were furious at Comey’s July announcement that he was recommending against an indictment, have now threatened to go public with the new information about Ms. Abedin’s emails unless he agreed to do it himself. \\nWhile the search for smoking guns implicating Hillary Clinton in criminal activity continues, through a mountain of emails, there are more than enough smoking guns hiding in plain sight. In a way, the endless search for a single smoking gun clouds the issue and makes it seem as if nothing consequential enough has so far been found. Nothing could be further from the truth. \\nThe record of Clinton scandal, for both of the Clintons, extends back through a number of administrations. It wasn’t possible to cover all of the glorious legacy of Bill and Hillary Clinton in this one report. I encourage you to watch our documentary, “The Clinton Legacy,” which exposes the sordid truth about several of the real Clinton scandals when they occupied the White House back in the 1990s. Roger Aronoff \\nRoger Aronoff is the Editor of Accuracy in Media, and a member of the Citizens’ Commission on Benghazi . He can be contacted at roger.aronoff@aim.org . View the complete archives from Roger Aronoff . 0'"}, "time": 1742562175.8807266}