{"duration": 0.08684325218200684, "input_args": {"text": "'In this episode, we depart from the familiar    format for a dive into the world of music streaming services. It is a topic that fascinates the Haggler, who can still barely fathom that for a mere $10 a month, he can get access to just about any musical recording on the planet. But which streaming app is the best? The Haggler has been mulling this question for a while, and after a lot of dabbling he regards Spotify as the gold standard. It is sturdy and remarkably fast when you play a song from the cloud, it starts so quickly it seems to be waiting for you. The system is also easy to use. Streaming services, at least to the Haggler, are all about creating playlists  —   grabbing albums and songs and putting them in a place where you can find them quickly. That process is simple and intuitive on Spotify. If the system has a weakness, it is a    user interface, which is black and a Halloweenish shade of green  —   a little too goth for the Haggler’s tastes. Far more important, it isn’t great at introducing you to new albums and acts. It has features and algorithms designed to help you find undiscovered music, but they aren’t compelling or visually appealing enough to be much help. The Haggler winds up listening to the same stuff over and over. This is why the Haggler has been rooting for Apple Music since an Android version of it was unveiled in November. The user interface is gorgeous  —   bright, airy and dominated by album art  —   and it is the finest new music introduction system ever created. It’s like a professional matchmaker who never sleeps. It is always trying to find you something to love. But for all its upsides, Apple Music for iOS has been criticized for randomly deleting both songs and playlists. On Android, though, the app behaves even more weirdly. It took the Haggler a while to figure out what was happening. Then, a few weeks ago, it all became clear: Apple Music is stoned. Not   stoned, either. Apple Music is fried. It has the kind of “Where am I?” buzz that should worry its friends. To wit: When the Haggler tries to turn an album into a playlist, only half the songs make the journey. Or all the songs make the journey but there are three copies of many. Or two copies. Sometimes, inexplicably, the songs are arranged alphabetically. “Heh heh heh,” says Apple Music, or so it seems to the Haggler’s ears. “I’m really high right now. ” You sure are! Just as bad, the system is supposed to learn what music you like, but no matter how many times the Haggler presses the “I don’t like this suggestion” button on jazz albums, Apple Music keeps serving up Chet Baker and Bill Evans in a “For you” list on the main menu. That’s especially vexing because each time that button is pressed, up pops this message: “Got it. We’ll keep that in mind. ” But Apple Music forgets. Do you know why? It’s totally baked. When someone consumes this amount of weed, for so long, it’s time for an intervention, and fortunately Apple Music just completed one. On July 8, the company updated the program, promising a fix for an assortment of bugs. A fix for the iOS version was released a few weeks ago. The Haggler doesn’t own an iPhone, so he can’t comment on whether it has improved, though the “My music has vanished!” online complaints do seem to have died down. But he is happy to report that on his Android smartphone, the fixes work. Since the program update, playlists have been rationally sorted. No more triple copies, no more alphabetized albums. So is it time to ditch Spotify? Not so fast. Apple Music is still missing essential features. It doesn’t let users make and share their own playlists, à la Spotify, which is how the Haggler got to know every song from the HBO show “Silicon Valley. ” (Some fan of the show just made a compilation.) Apple Music also lacks crossfade, which allows the next song to fade in, over a customizable number of seconds, as the last song fades out. This is invaluable if you listen to music in part to block out the noise made by the rest of the universe. Also, while it’s off recreational drugs, Apple Music is still balkier than Spotify, and is more likely to leave you staring at a spinning red line as it gathers its wits and looks for songs. And Apple Music has failed to streamline its playlist adding system. On Spotify, a playlist of Drake’s album “Views” is automatically designated “Drake  —   Views. ” On Apple Music, when you create a new playlist, it has no idea what to call it. The name is blank. So you have to type it yourself. This isn’t exactly hard labor. But it adds to the sense that Apple Music needs more tweaks. The Haggler contacted Apple, but the company would not discuss whether any of these tweaks were coming, because it generally does not discuss future iterations of products. What’s odd is that Apple is the user interface master of the world. If anything, you would expect it to take the bar established by Spotify and then leap over it. Instead, at least in a few crucial areas, it’s lagging. Yet recently, after a few hours of rummaging around the “Radio” section of Apple Music  —   a bunch of shows curated by artists and D. J. s  —   the Haggler fell hard for a fantastic indie band from Oklahoma called Broncho and its song “Class Historian. ” On Dr. Dre’s radio station, the Pharmacy, he was reacquainted with A Tribe Called Quest’s “Oh My God” which he hadn’t heard in years. The “For you” list last week included an album of Beethoven’s string trios that the Haggler will never again live without. If only someone could splice together the best parts of Apple Music and the best parts of Spotify, and then subtract each of their flaws. Unlikely, yes. But the Haggler can dream.'"}, "time": 1742563299.0568373}