{"duration": 0.1043403148651123, "input_args": {"text": "'LONDON  —   Across the English Channel, a great and unyielding power holds sway, denying London’s rights. The sovereign state is not sovereign at all. Days before a referendum on leaving the European Union, those are the images of Britain’s plight advanced by the   Brexiteers, who are campaigning for their nation to signal a muscular new era of independence by leaving the   bloc. But the English have been there before. Five centuries ago, King Henry VIII, chafing at the theological and financial clout of the papacy, broke with Rome and led his subjects into the new pastures of the Church of England, with himself as its supreme overlord. It was a step that changed Christendom, molding faith and identity to this day among the world’s roughly 85 million Anglicans. In the process, “England ceased to be part of a huge, medieval,   European empire and instead became an independent sovereign   free from ‘the authority of any foreign potentate’  —   above all the Pope,” Adrian Pabst, a lecturer in politics at the University of Kent, wrote in The Guardian in 2009. “If you ever wondered about the origins of English euroskepticism, look no further than the Protestant Reformation. ” Historical parallels can be facile if not misleading, and the differences between the two eras are profound, not least in the democratic nature of Britain’s decision this time. But the echoes are strong enough to resonate at a moment when Britain is looking to its past for lessons that would apply to its future. Henry’s pique was rooted in Rome’s refusal to annul his first marriage, to Catherine of Aragon. He went on to take five more wives in his quest for a male heir, in direct contradiction of Catholic orthodoxy. The Brexiteers’ campaign is also about divorce  —   of nations and economies, perhaps, but certainly just as permanent, and with potentially   consequences. When Britons vote on Thursday, they may do so at the same polling stations used during national elections. Yet for the side that loses the ballot, “there is no   no consoling thought in defeat that, at least, there’s always next season,” the columnist Alex Massie wrote on The Spectator’s website. “No, defeat is permanent and for keeps. ” By coincidence, perhaps, the campaign has gathered pace at a time when the national imagination has been caught by the blockbuster success of Hilary Mantel’s novels “Wolf Hall” and “Bring Up the Bodies,” set during Henry VIII’s reign and reviving the issue of how the elite relate to adversaries at home and foes abroad. Ms. Mantel was among almost 300 cultural figures  —   actors and writers among them  —   who signed a public letter last month urging a vote to remain part of the European Union. “What kind of nation do we want to be?” the letter asked. “Are we   and open to working with others to achieve more? Or do we close ourselves off from our friends and neighbors at a time of increasing global uncertainty?” The   goes beyond that. Over centuries, England, and then Britain, has strutted the global stage as an imperial overlord whose people sometimes seem more comfortable in the guise of underdogs. The national psyche rests on a history of invasion, submission, conquest and    —   from the Romans and the   through the Normans and on to dynasties entwined with the royal houses of Europe. In more recent years, waves of immigration  —   Jamaicans in the 1950s, then Pakistanis, Indians and other Asians in the 1960s  —   have reshaped the country’s demographics. Christianity, prevalent in Henry’s day, is professed by less than half the population. The loss of an empire and the rise of a complex, interconnected global economy has rekindled the notion that, in times of flux, the English define themselves by their opposition to a bigger outside power  —   the papacy in the 16th century the European Union in the 21st. This    theme suffused Churchill’s speeches during World War II as Hitler’s armies spread across Europe to the Continent’s coastline. “We shall never surrender,” Churchill declared in 1940, albeit with the caveat that Britain would fight on until “the New World, with all its power and might, steps forth to the rescue and the liberation of the old. ” Today’s political leaders can barely resist the Churchillian mantra. Facing hostile questioning from a television audience on Sunday, a rattled Prime Minister David Cameron pointed out that “at my office I sit two yards from” where Churchill “resolved to fight on against Hitler. ” Churchill did not wish to be alone, Mr. Cameron said. “But he didn’t quit,” the prime minister added. “He didn’t quit on democracy, he didn’t quit on freedom. We want to fight for those things today. ” It was also Churchill, who, in 1930, foreshadowed one of the Brexiteers’ arguments in an   article in the Saturday Evening Post. “We see nothing but good and hope in a richer, freer, more contented European commonalty,” he said. “But we have our own dream and our own task. We are with Europe, but not of it. We are linked, but not comprised. We are interested and associated, but not absorbed. ” David Starkey, a Cambridge historian critical of the European Union, has drawn a direct parallel with the modern battle for the nation’s soul. “England’s semidetached relationship with continental Europe is neither new nor an aberration,” he wrote in 2012. “Instead, it is deeply rooted in the political development of the past 500 years. ” The   debate “was couched in strikingly ‘modern’ terms,” Dr. Starkey wrote, with Henry’s opponents arguing the case for papal authority “like a contemporary europhile,” maintaining that England was “subordinate to the laws and values of a   Christendom. ” “Henry VIII’s judges replied, on the contrary, that statute was binding and Parliament sovereign,” Dr. Starkey said. Then, as now, the notion of sovereignty was central to the discussion, and the implications were enormous. By breaking with Rome, some historians argue, the English came to see themselves a nation apart  —   a   magnified by the Act of Union with Scotland in 1707 and by centuries of colonial expansion. “Imperial Britain was isolationist, xenophobic,   and nationalist,” the historian Edwin Jones wrote in 1998, and a combination of these elements “helped to sustain the   of the British” in the early 18th century, he added. In 1848, Lord Palmerston, then the foreign secretary, told Parliament: “I may say without any vainglorious boast or without great offense to anyone that we stand at the head of moral, social and political civilization. Our task is to lead the way and direct the march of other nations. ” But the British always seem to qualify global ambition with the kind of parochial preoccupations that persuaded Adam Smith in 1776 to coin the phrase “a nation of shopkeepers. ” As the empire grew, indeed, a group known as the Little Englanders advocated a retreat from headlong colonial expansion, particularly in southern Africa. These days, the term endures as a derogatory epithet for the Brexiteers, who prefer to claim the mantle of a reawakened Britannia ruling newer waves  —   this time through a web of trade deals and alliances beyond the perceived narrow constraints and petty regulation of Brussels. Some argue that the dominant strand of the Brexiteers’ DNA lies in what A. A. Gill, a columnist for The Sunday Times, called “the most pernicious and debilitating Little English drug, nostalgia. ”'"}, "time": 1742562963.1183803}