{"duration": 0.1187286376953125, "input_args": {"text": "'Comments \\nThe extreme Christian supporters of Republican presidential nominee Donald Trump present themselves as righteous holy rollers doing the work of God, but that is a ruse meant to disguise their true intentions of making women mere sexual pawns and exert patriarchal dominance over them. This fact was aptly pointed out by John Pavlovitz , a minister from Raleigh, North Carolina who published a scathing statement indicting all of the individuals who partake in this behavior. \\nPavlovitz attempted to spare no feelings when he warned women about Trump, his supporters, and how those individuals truly view a woman’s role in society: \\nTo them, you aren’t separate but equal, as they might claim from the pulpit. You may be made in the image of God, but not in the same way that they are. You are inferior. You are lesser than. You are Adam’s rib meat; baby machines, meal preparers, arm candy, pleasure tools designed by God for men to use as they desire. Some of these men of God will have the guts to actually say this, others will simply prove it to you. They are proving it to you now. Listen to them.” Pavlovitz says in their twisted patriarchal world, the men on the Christian Right think all men act like Trump, all men talk this way, all men think this way, but adds, “No, we don’t—but they do.” \\nA line was drawn in the proverbial sand by Pavlovitz who harpooned the hypocrisy of Trump’s supporters. Trump claims to respect women, as do those who are in favor of his candidacy. Yet, that does not rationally follow for if it were true, and if these individuals did have respect for women, they’d dump Trump immediately: \\nIf these professed men of God truly acknowledged your inherent value, they would be fiercely defending you right now, instead of Donald Trump. They would be openly condemning such disregard for the image of God within you, and sharply severing their ties with him—but many of them they aren’t. They’re making excuses. They’re blaming the victim. They’re doubling down. They’re digging in their manly heels right now. \\nThe good minister pulled back the curtain to expose the sickening philosophy of these individuals. They care not about women as human beings, but consider them to be mere disposable objects to be used for their own nefarious purposes: \\nThe real reason they’re doing it, is because to them you aren’t worth defending; not your intelligence or your gifts or your worth. As a result, your consent isn’t really a concern either; you may have noticed that. It’s why, in their minds sexual misconduct almost never occurs, and when it does, it’s because you were dressed too provocatively or sending mixed signals, or because their motives were misinterpreted.They don’t believe you have the right to say or no or to be offended. If anything, they believe you should be flattered. This is the hubris of men who think God made you as an accessory. \\nIn an act of contrition and humility Pavlovitz apologized for the behavior of despicable men who behave as cowardly dogs. He stopped short of apologizing on the behalf of the men, as if he were their spokesperson: \\nAs a Christian and a pastor and a man, I’d liked to apologize to you for these men and what you endure from them, but I won’t apologize to you on their behalf because that would mean aligning myself with them and I will not do that. They don’t speak for me. They don’t speak for many of us. They certainly don’t speak for God. \\nMinister John Pavlovitz’s statement is worthy of a resounding round of applause. As a man of the cloth he truly embodies the values which he espouses, which is a rare and precious trait in a society full of millions of individuals who support Trump and believe that his word is the gospel. It is truly disheartening and frightening to know that while all citizens in the United States have the same rights, and all votes are equal, that so many would use those votes in a way which is detrimental to the lives of their fellow female citizens.'"}, "time": 1742563597.1550975}