{"duration": 0.09323310852050781, "input_args": {"text": "'Sam Sifton emails readers of Cooking five days a week to talk about food and suggest recipes. That email also appears here. To receive it in your inbox, register here. Good morning and welcome to the new cookbook season, which our Food reporters are celebrating in print and online today with our Cookbook Issue, a compendium of all the best new titles and recipes we could find on the shelves this fall. Of course, there are recipes, and we’ll get to them soon enough. Before we do, though, please make sure to read Kim Severson’s luminous profile of Alton Brown, which sees the television chef at a crossroads, hanging around his Georgia man cave and considering the future. Read, too, Melissa Clark’s delightful examination of the British food writer Diana Henry, who has been on a tear of late, publishing excellent cookbook after excellent cookbook. Both articles come with recipes, naturally: for Mr. Brown’s arctic char burger and his breakfast carbonara, and for Ms. Henry’s tuna and white bean casserole, lamb rib chops with dates, feta, sumac and tahini, and sweet potatoes with yogurt and chile. Tejal Rao filed a terrific primer on the latest trend in cookbook aesthetics  —   simple and modern. It comes with recipes as well: a   spaghetti dinner with tomatoes and kale from “A Modern Way to Cook” by Anna Jones, and a Swiss chard slab pie from Kristin Donnelly’s “Modern Potluck. ” Check out Sara Bonisteel’s article on “Land of Fish and Rice” by Fuchsia Dunlop and “All Under Heaven” by Carolyn Phillips. And then cook: Shanghai noodles and bok choy, chicken congee, moo shu pork. Also: David Tanis on Naomi Duguid’s “Taste of Persia” and her recipe for Baku fish kebabs with   sauce. Here’s Florence Fabricant on “Eat in My Kitchen” by Meike Peters and “Mozza at Home” by Nancy Silverton. It comes with a fine recipe for a Mozza staff meal of   chicken thighs, and another for Ms. Peters’s sautéed endives with balsamic butter and marjoram. The presents keep coming! Oliver Strand dives into “Everything I Want to Eat” from the Los Angeles chef Jessica Koslow, and delivers recipes for sticky toffee   date cake and for a socca with shredded vegetables. And Sara has a second article looking at “My Two Souths” by Asha Gomez she delivers Ms. Gomez’s recipe for weeknight fancy chicken and rice along with it. Here’s Christine Muhlke on Naomi Pomeroy’s cookbook “Taste and Technique,” which comes with a recipe for fennel gratin. And Margaux Laskey on “Poole’s: Recipes and Stories From a Modern Diner” by Ashley Christensen, with her recipes for hummingbird cake and a broccoli salad with Cheddar, bacon, grapes and pecans. Emily Weinstein helps round out the table with a look at Marcus Samuelsson’s “The Red Rooster Cookbook” and his recipe for the short ribs he cooked for President Obama. That’s a lot of new recipes for you! Of course, on a Wednesday night in late September, you may not want a recipe at all. Join us instead for a   recipe for a tomato salad that we hacked out of Gabrielle Hamilton’s exquisite and bossy “Prune” this weekend. Get the best beefsteak or heirloom tomatoes you can find at the market today. (And they’re still out there!) Cut them into thick planks and arrange them prettily on a platter. Heat some good salted butter in a pan until it is foamy and about to brown, then pour it all over the tomatoes. Sprinkle some sea salt over the top and serve with bread. It’s legit the best meal imaginable for this time of the year. Or take a spin through Cooking to find something else. And if you run into trouble, reach out for help: cookingcare@nytimes. com. We want you to be happy. See you on Friday.'"}, "time": 1742563130.2106664}