{"duration": 0.03569459915161133, "input_args": {"text": "'The Pentagon cast substantial doubt on a possible role for Turkey in the assault on Raqqa, the Islamic State’s capital in Syria, during a press conference in Iraq on Wednesday. [“We have made clear  …     that we are open to a Turkish role in the continued operations to defeat ISIS in northern Syria. We haven’t come to an agreement about what that role will be or if there will be one,” Dorrian said, “but we talk to Turkey through military channels and I believe at diplomatic levels every day,” said spokesman Col. John Dorrian, as quoted by the Washington Examiner.  Fighting ISIS savages to the death in the cramped streets of downtown Raqqa is probably not a prospect Turkey relishes, but it is very eager to keep the Syrian Kurds and their military alliance out of the battle. Turkey links the Syrian YPG Kurdish militia to the violent PKK separatists it has been battling at home and fears Kurdish territorial gains in Syria could lead to the Kurds carving out Turkish territory for an independent state or at least exacerbating the PKK problem. “I think I’d like to leave it at we would expect Kurds to be involved. And that’s probably about where we’re at,” said Dorrian. He noted the U. S. wants Raqqa liberated by a force that is demographically consistent with its historic population, which includes a fair number of Kurds. That won’t go over well in Ankara, as the Washington Examiner recalls Senate Armed Services chair John McCain warning last week. “I’m not sure there’s an understanding of how seriously Erdogan views this issue, and I’m not sure we appreciate the importance of the role Turkey plays in our effort to retake Raqqa, particularly in the use of Incirlik and other activities that require Turkish cooperation,” said McCain. “I foresee a train wreck here. I think there’s a possibility of an impending conflict between Turkey and the Kurds. ” Turkish Defense Minister Fikri Isik said in February that the Trump administration would not insist on a Kurdish role in the battle of Raqqa. “If we want the Raqqa operation to be successful, then it should be carried out with Arab forces in the region and not the YPG. The new U. S. administration has a different approach to the issue. They are not insisting anymore that the operation should definitely be carried out with the YPG. They haven’t yet made up their minds,” Isik said on that occasion. Writing for the Associated Press, Sarah El Deeb suggests Turkey has annoyed both the U. S. and Russia by constantly denouncing, and occasionally shooting at, the Kurds. The Syrian government is even more irritated because some of the artillery shells Turkey fired at Kurdish forces have hit Syrian positions instead. “As a result, Ankara has effectively unified Russia and the U. S. in the goal of limiting Turkish expansion in the north. Syria experts say Ankara has lost influence to realize its aim of pushing the Kurdish forces back to the east of Manbij across the Euphrates. Moreover, Washington is pushing ahead with partnering with the   forces in the planned attack on Raqqa, despite Turkish opposition,” El Deeb writes. She sees the capture of Manbij by   Syrian Democratic Forces units, a major military ally of the United States, as the event that pushed Turkey into a more aggressive posture. The Turks may be hoping that keeping Manbij in their sights will oblige the Kurds to commit SDF forces to its protection, leaving them less manpower to invest in Raqqa. Turkey would then offer its own forces to take up the slack. U. S. forces flying highly visible American flags are now parked between the Turks and Kurds outside Manbij, while Russia created another buffer zone with Syrian government troops, but it won’t be possible to keep them safely separated for much longer. As American Lt. General Stephen Townsend put it, all of the forces converging on Raqqa are now “within   range of each other. ” “All of this is a reminder of the risk in a rushed attempt to get to Raqqa If Turkish interests are not at least placated to some extent,” Noah Bonsey of the International Crisis Group told the AP. “There is a lot that can go wrong. ”'"}, "time": 1742628597.3303618}