{"duration": 0.07369685173034668, "input_args": {"text": "'At Case Western Reserve University in Cleveland, Ohio, Bill Kochevar was able to eat independently for the first time in 8 years. [After a brutal cycling accident left Bill Kochevar completely paralyzed below the shoulders, he spent eight years without the ability to perform the most basic daily tasks for himself. But Dr. Bob Kirsch and his team of researchers at Case Western Reserve University have given Bill  —   and others like him  —   hope with the results of a new trial.  The trials were part of the “BrainGate2” project, which is focused on improving the lives of paralysis victims using   interfaces.  Before 36 electrodes could be placed into Kochevar’s arms, he first had to learn to operate a virtual hand with the two   electrodes planted in his brain. Those electrodes act as substitute nerve centers, using neuron activity to record signals to manipulate muscle. It took four months of hard work to prepare him for his victory. Kochevar, with the assistance of another   support system, was able to lift a cup and drink from a straw on his own. He was also able to feed himself forkfuls of mashed potatoes. And while that may not seem like much to most people, it’s a   change for someone whose body doesn’t obey even the most elementary commands. Kochevar said that it was “better than [he] thought it would be,” and that “for somebody who’s been injured eight years and couldn’t move, being able to move just that little bit is awesome to me. ” He didn’t even have to “really concentrate hard on it,” which speaks volumes about the success in and of itself. Dr. Kirsch said that BrainGate2 is “really breaking ground for the spinal cord injury community,” as “a major step toward restoring some independence. ” They are currently holding various trials at Massachusetts General Hospital, Providence Virginia Medical Center, and Stanford University in addition to Case Western Reserve. Their goal is to “provide natural, intuitive,   control of assistive devices” with their groundbreaking   implants. For people like Bill Kochevar, they’re just heroes. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562205.776094}