{"duration": 0.12529540061950684, "input_args": {"text": "'SOFIA, Bulgaria  —   The inaugural meeting of the European Trump Society packed the central aisle of a bookstore in Bulgaria’s capital, Sofia, on Friday evening  —   women in furs, men in ski jackets, the floor glistening with melted snow. A live feed from the crowded steps of the United States Capitol filled a projection screen on the back wall. “The election of Mr. Trump means ‘You’re fired!’ to the political elites in America and the world,” declared Boris Angelov, a tabloid editor and a founder of the society, which is strictly Bulgarian at the moment but has wider aspirations. Ilia Lingorski, a former deputy finance minister, shouted from the crowd, “Bulgaria desperately needs its own Trump movement. ” The inauguration of Donald J. Trump as America’s 45th president, with declarations of “America first,” was met with alarm in many corners of the world. But not everywhere. Pockets of celebration broke out here and there, in places where Mr. Trump’s nationalist message matched local stirrings, and his promise of friendlier relations with President Vladimir V. Putin of Russia and a harsher approach to Islamic terrorism were eagerly embraced. About 100 Trump supporters gathered around a statue of President Ronald Reagan in Budapest’s Freedom Square for a “Better World Order Inauguration Party. ” The speaker was Zsolt Bayer, a prominent   pundit who once referred to Jews as “stinking excrement. ” Standing beneath a banner reading “Hungarian Deplorables for Trump,” he called on President Trump to combat political correctness, which Mr. Bayer said had created a world in which “only the white, Christian, heterosexual people do not matter. ” “For decades, we have been waiting for a miracle that will stop our world from running to its demise,” Mr. Bayer said. “Now, we are hopeful that this miracle is in the making. ” Mr. Trump’s support in Hungary rises beyond the small group in Freedom Square. The country’s prime minister, Viktor Orban, eagerly congratulated the new president on his victory. In Moscow, a chain of stores selling Russian military gear offered a   10 percent discount on Friday to all United States citizens and embassy workers. A poster advertising the sale featured a   Mr. Trump, fist raised. Several celebratory parties were held in Moscow before and after Mr. Trump’s inauguration. At one, the crowd sang, “Trump, Trump, he is a superhuman. ” Another featured a triptych of heroic portraits of Mr. Putin, Mr. Trump and the French nationalist leader Marine Le Pen. A group of Russian gunsmiths unveiled a commemorative coin declaring “In Trump We Trust,” and Life News, a Russian tabloid, reported that Mr. Trump had been declared an honorary Cossack. Political activists, media figures and dozens of foreign journalists gathered on Friday evening at a conference site just outside the Kremlin for a celebration of Mr. Trump’s inauguration, an event organized by conservative activists and a conservative television channel. Maria Katasonova, one of the organizers, declined to say who had paid for the spacious hall, meat pies and sparkling wine. “It wasn’t the Kremlin,” she said. Although the event pushed a sense of triumphalism, the mood among the audience was more skeptical. Many said they worried that “  elites” in Washington would stymie Mr. Trump’s efforts. “This is the last day we can celebrate,” said Dmitri Gusev, a Russian political consultant. “Because tomorrow, real life will begin. ” Mr. Trump’s ascent was also cheered by President Rodrigo Duterte in the Philippines. His spokesman, Martin Andanar, said the two men had “hit it off” in a brief conversation, leading to a likely “reboot” in relations between the two nations. Ben Razon, an American of Filipino descent who runs a restaurant in Manila, said of Mr. Trump, “I do hope that he establishes a good working relationship with President Duterte. ” “They understand each other,” Mr. Razon added. “That should be good. ” In India, where the right wing shares a strong political affinity with the American right, Mr. Trump’s inauguration was celebrated by Hindu nationalists and business leaders eager for more trade between the two nations. Hindu Sena, a   fringe group, organized a celebration of Mr. Trump’s victory on Nov. 4  —   four days before he actually won  —   and had earlier held a prayer ritual on his behalf. “Trump’s victory is confirmed early due to his thoughts against Islamic terrorism and love for India and Hindus,” the group’s leader, Vishnu Gupta, said, according to Reuters. In Egypt, support for Mr. Trump remained fervent among the country’s   establishment. Hany Assal, a columnist for the     newspaper, sharply criticized American liberals and Democrats for opposing Mr. Trump. “They are putting obstacles in his way,” he wrote, including “trying to start fights with Russia for no reason. ” On the street,     sentiment seemed to fuel a more subdued attitude toward the new president. “Some people think he is going to be bad because he is openly   but the truth is, America has always been against Islam,” said Bashir Kashta, a Palestinian businessman, as he sipped mint tea on Friday at the historic El Fishawy Cafe in Cairo’s old Islamic district. Samy Abdel Mageed, 56, an engineer smoking a water pipe at an adjacent table, said he had “not met a single person who is excited about Trump or thinks he will change anything for better or worse. ” “America is a country of institutions, and institutions are hard to change,” he said. At the bookstore party in Bulgaria, Borislav Tsekov, another founder of the European Trump Society, proudly surveyed the crowd of about 75 people who had trudged through   slush to attend the event at the Greenwich Book Center. He described the society as a scholarly organization dedicated to studying Mr. Trump’s ideas. Mr. Tsekov, a former lawmaker who has been a member of several political parties, used the gathering to unveil his latest book, “The Trump Doctrine,” a study of the new president’s speeches and writings. Speaking before Mr. Trump was sworn in, Mr. Tsekov criticized the mainstream news media and the global political establishment, saying that they had unfairly portrayed Mr. Trump as a racist and xenophobe. “Well, isn’t he?” cried a voice from the crowd that was then shouted down. Mr. Tsekov was not able to listen to Mr. Trump’s speech on the big screen. He was too busy giving television interviews. But he said he looked forward to reading it and was certain he would approve. His   Mr. Angelov, was delighted with the turnout and looked forward to fresh branches sprouting across Europe. “Trump is very popular in Bulgaria,” Mr. Angelov said. “He is a brand, you know? He is an international brand. ”'"}, "time": 1742562152.2946112}