{"duration": 0.054338693618774414, "input_args": {"text": "'PARIS  —   He stabbed an   police officer and left him bleeding to death on his own doorstep. He forced his way inside the home and stabbed and killed the officer’s female companion. He then sat down and videotaped himself live on Facebook declaring allegiance to the Islamic State, according to the French law enforcement authorities. Sitting just behind him was the couple’s son, a terrified    boy, of whom Larossi Abballa, the killer, said dismissively, “I have not decided what to do with him,” according to David Thomson, a French journalist for Radio France Internationale and the author of a book on jihadists who saw Mr. Abballa’s online posts before they were taken down. The events that unfolded between about 8 p. m. and midnight on Monday  —   when elite police forces broke into the house in the small town of Magnanville, fatally shot Mr. Abballa, 25, and rescued the boy  —   were the second time within 48 hours in which a person appearing to act alone claimed to kill in the name of the Islamic State. In the attacks in both Magnanville and Orlando, Fla. the killers had more than just brushed up against the authorities before, in what has become a distressingly familiar pattern  —   from the set of attacks in Paris in November, to those in Brussels in March and beyond. The Orlando gunman, Omar Mateen, had been interviewed twice by the Federal Bureau of Investigation for his possible links to terrorism, and Mr. Abballa had been convicted for having links to a terrorist network and served about two years in jail before being released. Further complicating the job of protecting Western nations are governments’ dual goal of preserving civil liberties while trying to make people feel secure. The attack in France was shocking not only to neighbors in Magnanville, about 35 miles from Paris, but across the country because it underscored that extremist attacks can happen in the most ordinary places, above all in those where people believe they are safe. Mr. Abballa’s Facebook post from Monday night made clear that he wanted to terrify and destroy those he deemed “unbelievers,” people he had come to hate. He also wanted to encourage other lone wolves to do the same. “It’s super simple,” he said, looking into the camera. “It’s enough to wait for them in front of their offices don’t give them any respite. Know this, whether you are a policeman or a journalist, you will never feel calm again. One will wait for you in front of your homes. This is what you have earned. ” Boasting that he had “just killed a policeman and I just killed his wife,” he called on fellow believers to give priority to killing “police, prison guards, journalists. ” He specifically named several writers and journalists, adding rappers to the list because, he said, they “are the allies of Satan. ” Even more chillingly, he warned that jihadists had “reserved some other surprises for the Euro I am not going to say more. ’’ “The Euro will be a cemetery,” he said, referring to the Euro 2016 soccer tournament being played over the next several weeks in 10 French cities. It was unclear whether Mr. Abballa had specific knowledge of a potential attack on the matches or the crowds gathered for them. The version of the video released by the Islamic State’s Amaq news agency was trimmed by a couple of minutes to omit images of the boy and Mr. Abballa’s references to him. On Twitter, opinion was divided between those who thought the images of a defenseless child were tasteless even by the standards of the Islamic State’s hardened propagandists and those who speculated that the extremist news agency did not want to show Mr. Abballa as unwilling to kill a child. As the special police forces surrounded the murdered officer’s house, where Mr. Abballa was holed up, cordoning off the modest neighborhood that is home to both   and Muslims, Mr. Abballa asked his “brothers” to pray to Allah that he might become a martyr. The video was posted a little before 9 p. m. on Monday as the police began to try to negotiate with him. By the time the security forces reached the couple’s son three hours later, he was in a “stunned” state as people are after a profound shock, said Bernard Cazeneuve, the French interior minister. Many questions remain about Mr. Abballa’s path from his birth and early life in nearby Meulan, France, as the child of parents of Moroccan origin, to his death at the hands of a police SWAT team. Along the way, he spent time in prison and proselytized to other inmates about Islam, said François Molins, the Paris prosecutor. When he was released, he started a small   business, which he named Dr. Food. It delivered sandwiches, according to a Facebook clip he posted. He was one of eight men convicted in Paris in 2013 of aiding a group that had been intending to commit terrorist acts and had planned to go to Pakistan for training. He received a   sentence on Sept. 30, 2013, including a   suspended sentence. He was allowed to go free after his conviction because he had spent two years and two months in jail awaiting trial. However, he was under surveillance for another two years and two months, until Nov. 30, 2015, said Mr. Molins, the prosecutor. “At the trial, Abballa seemed like someone who was not dangerous but was rather stupid,” said Hervé Denis, a lawyer who represented Zohab Ifzar, one of the other defendants. The officer killed on Monday had nothing to do with the investigation that resulted in Mr. Abballa’s imprisonment, Mr. Denis said. “He appeared to be the perfect soldier,” Mr. Denis said  —   someone who would do whatever was needed to help the effort  —   and was “very determined. ” More recently, Mr. Abballa came to the attention of the French law enforcement authorities when he was among several people questioned in a counterterrorism inquiry that Mr. Molins’s office began on Feb. 11 into a group believed to be planning to go to Syria. As part of that inquiry, investigators gathered intelligence from telephone intercepts and various geocoding technologies, but none of the findings indicated that Mr. Abballa was on the verge of violence, Mr. Molins said. Three men in Mr. Abballa’s circle  —   ages 27, 29 and 44  —   were detained for questioning after the killings on Monday. The attack in Magnanville has already prompted calls in France for more stringent handling of those convicted of   activities. On early morning broadcasts on Tuesday, some members of Parliament called for all people suspected of potential terrorist leanings to be placed in detention. But France is already stretched to the limit, both in prison capacity and in the numbers of suspects it can monitor. The police and intelligence agencies are described as working constantly to track   jihadists. The antiterrorism directorate of the judicial police and of the internal security department of the Interior Ministry have detained 100 people this year over their suspected ties to terrorism, Mr. Cazeneuve, the interior minister, said Tuesday. He added that the terrorism threat in France was “very high. ” In testimony before members of the French Parliament on May 10, Patrick Calvar, head of domestic intelligence, said about 2, 000 French citizens or residents were of concern to the security forces. He testified that at least 645 French citizens or residents of France were in Syria and that about 400 of those were fighting with militant groups. In addition, Mr. Calvar said, 244 French citizens have returned to France from Syria or Iraq, and the French intelligence services say they have identified an additional 818 people who they believe want to join extremists. The French authorities have repeatedly said it is impossible to monitor all of them at all times.'"}, "time": 1742628603.2422187}