{"duration": 0.057882070541381836, "input_args": {"text": "'Elections 2016 \\nVice Presidential nominee Tim Kaine is taking aim at the NRA, saying he’s done what he can about “common sense” gun laws in his home state of Virginia, but has watched Congress falter in the face of the gun lobby. “We have to make a decision about what matters to us,” said Kaine in an opinion piece published by Time magazine Tuesday. “We have to treat this like the public health crisis it is.” Kaine notes that he is a gun owner and that he supports the Second Amendment. \\n“It needs to be said that sugarcoating this sort of thing isn’t going to make it better,” Kaine also argued during his subsequent interview. “Neither Hillary Clinton nor I can stand Donald Trump, that’s common knowledge, but there is one thing about his ridiculous rhetoric I have to agree with, and that’s that political correctness in this country has long ceased to be useful. Today’s approach revolves around directness and no-beating-around-the-bush kind of mentality when it comes to communication.” \\nHe continued, “That’s precisely the reason why we need to tackle the gun safety issue head on and without pardon. It’s a burning problem that is affecting millions of Americans every single day, and as such, it represents an emergency. At the end of the day, public health is not something that should be neglected for the obvious reasons, and whether we’d like to admit it or not, the public health of America today is becoming increasingly gangrenous.” \\n“Guns have found their way to every single layer of society and have become the preferred method of resolving disputes and mere disagreements,” Kaine said. “We must put a stop to that and I’m happy to announce that Hillary Clinton has come up with the perfect solution for this problem. She is going to modify Obamacare from its existing state into a comprehensive healthcare program that’s going to include both voluntary, but also mandatory gun-addiction therapy.” \\nHe also said, “That way, Republicans who just want to talk and have their side of the story heard will be listened to instead of ignored and left to their own inner demons, which tend to come up to the surface via a weapon of some sort. On the other hand, Republicans who own more than one firearm and/or shoot it regularly either at a firing range or somewhere else will be summoned to a mandatory conversation with a licensed gun-addiction psychotherapist who will make sure to explain to them that it’s perfectly okay to be a liberal and own a gun. The two aren’t mutually exclusive.” \\n“And the best part? They won’t have to pay a cent for it – it will all be covered by the federal budget. So, even if you happen to be a recurring Republican and gun owner, don’t worry, we can fix you. The Hillary Clinton administration will make sure to give back to its citizens just as much as it takes from them. And when you take a Republican’s gun, you’re basically de-Americanizing him. We are going to change that. Obamacare will become a symbol for fewer weapons in the country, which could ultimately result in a Nobel peace prize for Hillary Clinton. Only this time, naturally, it won’t be just a fictional recognition. Unlike Obama, President Clinton will actually be given a plaque,” Kaine concluded. Tim Kaine: “Hillary Will Modify Obamacare To Include Gun-Addiction Therapy” Share this: '"}, "time": 1742628414.942029}