{"duration": 0.04842066764831543, "input_args": {"text": "\"Judge warns Trump campaign on voter intimidation in Ohio By Press TV on November 4, 2016 \\nA US federal judge has issued an order, warning Republican presidential nominee Donald Trump’s campaign against harassing or intimidating Ohio voters. \\nUS District Judge James Gwin ruled on Friday that anyone who hinders or delays a prospective voter from reaching the polling place and casting a ballot inside or near Ohio polling places would face contempt-of-court charges. \\nGwin also ruled that pro-Trump operative Roger Stone cannot question voters “under the guise of the purported ‘exit polling’ or ‘citizen journalist’ operations organized and encouraged” by Stone and a group called Stop the Steal. \\nThe ruling comes after Ohio Democrats have lodged a complaint that Stone was seeking to engage in his own version of exit polling, which they claimed was aimed at hassling voters. \\n“We think Democrats and Republicans have every right to hand out leaflets at polls and everything else but what we don’t want is harassment or intimidation and the judge is obviously trying to balance that,” said Ohio Democratic Party Chairman David Pepper. \\nMeanwhile, the Trump campaign has denied it was participating in any illegal activity. \\n“Intimidating voters is illegal, and the campaign does not remotely condone such conduct,” Trump campaign lawyer Chad A. Readler of Jones Day wrote in a legal filing in Ohio earlier this week. \\n“This case is one of four coordinated attacks across the country that are clearly long-planned efforts to sow chaos in the Defendants’ political efforts, while garnering maximum publicity for Plaintiff’s unsubstantiated, inflammatory claims on the eve of the Presidential Election,” Readler added. \\nAccording to the Reuters/Ipsos States of the Nation project released on Friday, Trump’s support has increased in 24 states and decreased in 11 over the past week. In comparison, support for his Democratic rival Hillary Clinton has grown in 13 states and lessened in 22. Related Posts: Afraid of What? The Woman Who Accused Trump of Raping Her at 13 Just Dropped Her Lawsuit The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Press TV on November 4, 2016, With 27 Reads Filed under Politics . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742628410.4602463}