{"duration": 0.0652611255645752, "input_args": {"text": "'Dispatches from STEPHEN LENDMAN H ad Comey recommended Hillary be held criminally responsible for mishandling classified State Department documents last July, along with perjury for lying to the FBI and Congress, a firestorm of criticism wouldn’t have followed his Friday announcement. \\n1. THE COMEY IMBROGLIO \\nSenate Minority Leader Harry Reid (D. NV) accused him of “tarring Secretary Clinton with thin innuendo,” saying his action “appears to be a clear intent to aid one political party over another” – claiming he “may have broken the law,” citing the 1939 Hatch Act (An Act to Prevent Pernicious Political Activities). It prohibits federal executive branch employees from engaging in certain forms of political activity – exempting the president, vice president and designated high-level administration officials. Proof of intent is required to hold someone culpable under the law. .. According to the Wall Street Journal , within the FBI, there was “ sharp internal disagreement over matters related to the Clintons, and how to handle those matters fairly and carefully in the middle of a national election campaign.” .. In a prominently featured NYT op-ed , Law Professor Richard Painter said “(w)e cannot allow FBI or Justice Department officials to unnecessarily publicize pending investigations concerning candidates of either party while an election is underway. That is an abuse of power.” .. Not according to former federal prosecutor Daniel Richman, saying “Comey’s critics cannot show his letter violated the Hatch Act unless they can prove that the FBI director was intending to influence the election rather than inform Congress, which was (his) stated aim.” .. A Sunday released ABC News/Washington Post poll indicated about a third of likely voters are less likely to support Hillary following Comey’s October surprise. .. The Washington Post said the Justice Department’s public integrity unit blocked the FBI from investigating the Clinton Foundation, claiming inadequate “evidence to move forward.” The department is run by longtime Bill and Hillary ally, Attorney General Loretta Lynch. Last June, she met privately with the former president at Phoenix’s Sky Harbor airport while Hillary was under FBI investigation – a clear conflict of interest despite her disingenuously claiming “no discussion of any matter pending for the department or any matter pending for any other body” took place. .. In a Washington Post op-ed , former attorney general Eric Holder expressed concern about Comey’s “vague letter to Congress about emails potentially connected to a matter of public, and political, interest” – claiming he “violated long-standing Justice Department policies and tradition.” .. Holder disgraced the office he held. Law Professor Francis Boyle called him “a total disaster for the United States Constitution, the Bill of Rights, Human Rights and the Rule of Law.” Speaking in Florida on Sunday, Hillary changed the subject, saying “ there’s a lot of noise and distraction, but it really comes down to what kind of future we want, and what kind of president can help us get there. We won’t be distracted no matter what our opponents throw at us.” .. Clearly, Comey’s bombshell changed the dynamic of the race, whether enough to derail her White House bid we’ll know in days. Reports indicate the FBI will examine an astonishing 650,000 emails from former Congressman Anthony Weiner’s laptop – estranged husband of top Hillary aide Huma Abedin. .. \\nIt could take months to review volume this immense, likely extending well beyond November 8 and January’s inauguration, to determine if any evidence warrants prosecuting Hillary, Abedin, Weiner or anyone else for mishandling classified government documents, perhaps compromising national security. \\n2. INTELLECTUAL LAZINESS & SELF-INFLICTED POLITICAL IDIOCY \\nHarvard Undergrads for Hillary \\nOVERWHELMING SYSTEMIC PROPAGANDA ALLIED WITH A PERVASIVE INTELLECTUAL LAZINESS CONSPIRE TO KEEP MINDS THAT SHOULD KNOW BETTER FROM SEEING THE MOST ELEMENTARY TRUTHS. BEING OFFICIALLY “SMART” IS NO VACCINE AGAINST THE BRAINWASH. A ccording to the student newspaper Harvard Crimson’s October survey , 87% of undergrads support Hillary. A scant 6% back Trump, 5.8% for Libertarian Gary (“what’s Aleppo”) Johnson, and less than 1% for Harvard College and Medical School graduate Jill Stein – the only people’s candidate running. .. Around one-third of undergrads responded (2,128 out of a total 6,645 student body) – so the views of nonrespondents aren’t known. About 91% are eligible to vote in November. Eligibility begins at age 18. A surprising 96% of respondents intend voting, they said. .. The national average is far lower. Whether this year’s contentious election encourages a larger than usual turnout remains to be seen. The Crimson poll was conducted from October 10 – 20 – before FBI Director Comey’s October surprise. Whether it would have changed the results is unknown. Two-thirds of respondents said they support Democrat party candidates, 12% calling themselves Republicans, 19% saying they’re independents. .. Trump and Hillary are the most widely reviled presidential aspirants in US history. Yet 70% of Crimson respondents view her favorably – showing little knowledge of her deplorable public record since the 1990s unless they support her war crimes, racketeering and perjury. What to make of it? Undergrads enter Harvard (and other colleges) as teenagers, young and naive as I was when entering the college long ago. .. After graduation, I discovered the meaning of the term “commencement.” Institutions like Harvard teach students to be good citizens, omitting the ugly stuff about US imperialism, officials advancing it, waging endless wars of aggression. .. The so-called Korean War was ongoing when I was there, an incentive to maintain good grades, stay in school, avoid being drafted and sent to North Korea’s frozen Chosin, an expression used by members of my class. .. The Paper Chase Hollywood film (1973) featured John Houseman as stern Harvard Law School Professor Charles Kingsfield. His most memorable line on day one for first year students was saying “(y)ou teach yourselves the law, but I train your minds. You come here with a skull full of mush. You leave thinking like a lawyer.” .. I began my freshman year “with a skull full of mush,” gradually extracting it. College and graduate school taught me to think. Learning and comprehension mostly came later. The older I get, the greater my understanding of world and national issues. .. I’m long removed from campus life. Back then, students had none of the advantages available today – no computers, no Internet. Daily writing I dearly love now was a dreaded chore back then – requiring research by rolodex cards and library stacks, a time-consuming process. Except for the type primary research I did for my master’s thesis, most everything needed today for compositions or articles like mine is available on our desktops. .. It’s understandable why young minds haven’t achieved the wisdom of the ages. Still it’s disturbing to find Harvard undergrads uninformed and out-of-touch on Hillary’s deplorable public record – when it’s so easy to research it and know what she and husband Bill are all about. .. Why hasn’t the Harvard student body done its homework for perhaps the most important election in our lifetime. The stakes are huge – possible war on Russia with Hillary empowered or improved bilateral relations under Trump. Nothing matters more than saving humanity from the scourge of catastrophic thermonuclear war able to kill us all. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS ABOUT THE AUTHOR STEPHEN LENDMAN lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net . His new book as editor and contributor is titled “Flashpoint in Ukraine: US Drive for Hegemony Risks WW III.” ( http://www.claritypress.com/LendmanIII.html ) Visit his blog site at sjlendman.blogspot.com . =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742628601.4168675}