{"duration": 0.06360530853271484, "input_args": {"text": "'Fast food \\'combo meals\\' tied to kids\\' over-consumption of high-calorie drinks \\nSaturday, October 29, 2016 by: Isabelle Z. Tags: fast food , obesity , children (NaturalNews) Fast food chains know how to squeeze every last dollar out of their customers. From decorating their establishments with appetite-stimulating colors, to pricing their meals to encourage people to get bigger sizes, their every move is perfectly calculated to maximize profits. Unfortunately, these practices are hurting a lot more than just your wallet – they are also affecting the health of your children.A study led by researchers from the NYU Langone Medical Center found that children who ate at any of five fast food chains consumed an average of 179 more calories when their meals came with soda, juice, sweetened tea or flavored milk, when compared to those who drank unsweetened beverages with their meals.The researchers also discovered that the children consumed an average of 82 more drink calories when the drinks were part of bundled meals than when the drinks were bought separately. Moreover, parents who bought a combo meal were 24 percent more likely to buy a high-calorie drink sweetened with sugar.The study looked at almost 500 children aged 18 and younger who ate food from McDonald\\'s, KFC, Burger King, Subway or Wendy\\'s in New York and New Jersey between January 2013 and June 2014. Seventy-four percent of the combo meals purchased were kids\\' meals. Half of the drinks were sodas , and 38 percent of them were juice, with flavored milk making up 5 percent. A further 5 percent was made up of lemonade, sweetened tea and hot chocolate. Non-sugary drinks proved to be quite unpopular, with regular milk accounting for just 2 percent and water a measly 1 percent.Dr. Brian Elbel of NYU Langone, the study\\'s senior investigator, said: \"Our study strongly suggests that uncoupling sugary drinks from combo meal deals might reduce high-calorie beverage consumption and help to curb childhood obesity rates fueled by these kinds of liquid calories.\" Parents need to take responsibility Combo meals tend to appeal to big families, which can find their bills quickly adding up at fast food restaurants. Well-meaning parents who might not normally allow their children to drink sugary beverages sometimes find themselves giving in when the drink is included.Although the practice on the part of fast food chains of bundling unhealthy foods together to create perceived value encourage unhealthy habits, it is ultimately up to the parents to decide which meals to buy for their children. Parents have the final say, and just because that super-sized Coke comes with your child\\'s meal does not mean that you should let them drink it. Fast track to diabetes Fast food meals are already high in calories, which means that the last thing you should be doing is pairing them with high-calorie beverages. Research published in the journal Diabetes Care showed that drinking even just one sugary beverage each day raised a person\\'s risk of developing type 2 diabetes by as much as 25 percent. It also upped the risk of developing metabolic syndrome by 20 percent.With around 17 percent of our nation\\'s youth believed to be obese, there is an urgent need for poor eating habits to be curbed. Until people start giving up the convenience of the local drive-through and start making a concerted effort to feed their children clean food , the situation is only likely to get worse, and more and more children will end up obese or diabetic.So, the next time you\\'re thinking of ordering that combo meal, keep in mind that any money that you might save on a meal deal is likely to end up costing far more in medical bills down the road. Sources include:'"}, "time": 1742563377.9931533}