{"duration": 0.09335947036743164, "input_args": {"text": "'Desgranamos los perfiles de los posibles nuevos Ministros RAJOY REJUVENECE EL GOBIERNO PONIENDO DE MINISTRAS A LA YENNI Y A LA DÉBORA \\nAunque el Presidente del Gobierno, Mariano Rajoy, no hará públicos los nombres que conformarán el Consejo de Ministros de esta legislatura, las quinielas apuntan a que habrá una profunda remodelación. \\nA continuación, ofrecemos un breve resumen de los Ministros que más suenan para formar parte del Ejecutivo. Presidencia – Mariano Rajoy \\nDespués de casi un año sabático recorriendo Europa como mochilero a fin de encontrarse consigo mismo, Rajoy retoma su labor como Presidente del Gobierno. Deberá afrontar temas decisivos para el país, como el reajuste de las pensiones, los nuevos recortes impuestos por Europa, y la renovación de memes de Internet. \\nVicepresidencia – La Yenni \\nCon el objetivo de rejuvenecer el gobierno, la Yenni (22 años) aparcará su trabajo de gogó en la discoteca Sensaciones para asumir todas aquellas tareas a las que el Presidente no se vea capacitado, por ejemplo: todas. \\nMinisterio de Justicia – La Débora \\nOtro perfil joven en un puesto de alta responsabilidad. Debo asume la cartera de Justicia, una tarea que no se le presenta fácil, pues deberá compaginarlo con acabar la ESO, requisito indispensable si quiere que le compren una moto. \\nMinisterio de Defensa – Mario’John Cobra’ Vaquero \\nAficionado al Tae Kwondo y al Jiu Jitsu, Mario ‘John Cobra’ Vaquero tendrá el cometido de aplicar serios recortes a Defensa mediante la implantación de la lucha cuerpo a cuerpo y la sustitución de los tanques por españoles o sudamericanos nacionalizados al alistarse al ejército. Será uno de los miembros más dialogantes del equipo de Rajoy. \\nMinisterio de Agricultura – John Deere 3036E Compacto \\nLa serie 3E le ofrece más potencia y características que cualquier otro tractor estándar de su categoría, y resulta sumamente sencillo de manejar. Destacan su potente motor diésel de 3 cilindros, la transmisión hidrostática y tracción delantera mecánica, el enganche de tres puntos trasero Categoría 1 y la TDF independiente que aseguran flexibilidad para todo tipo de tareas. Consume menos carburante que su predecesor en el cargo. \\nCuanto más trabaje, más apreciará el sistema Twin Touch™ controlando el avance del tractor por pedales, el respaldo alto ergonómico y la columna de dirección ajustable que hacen al 3E tan cómodo y productivo. \\nMinisterio de Interior – Ángel Marcelo \\nEs un ser incorpóreo de luz con sobrada experiencia al frente de Interior, pues ha sido la mano derecha de su predecesor en el cargo, Jorge Fernández Díaz, desde que se conocieron en Las Vegas. Los que le conocen destacan su capacidad de diálogo. Dirigirá el ministerio a través de Fernández Díaz, pues es la única persona que puede verle y hablar con él. \\nMinisterio de Sanidad – Virus del ébola \\nEs uno de los nombres que más ha sonado en el Ministerio de Sanidad por lo que a pocos sorprendería que le fuera otorgada una cartera microscópica. \\nMinisterio de Asuntos Exteriores – Pedro Duque \\nEl Presidente Rajoy pretende dar un golpe de autoridad con este nombramiento, pues nadie ha estado más al Exterior que el astronauta. \\nMinisterio de Educación, Cultura y Deportes – Rubén Doblas Gundersen \\nEl proceso de rejuvenecimiento del Gobierno está encabezado por Doblas Gundersen. Entre sus propuestas más interesantes está la posible supresión del sistema educativo por videotutoriales de Youtube. Gran defensor de la idea de que aprender no debe ser aburrido, sino más bien un gameplay. \\nMinisterio de Medio Ambiente- Xavier Garcia Albiol \\nEl ex alcalde de Badalona se hizo popular con su eslogan “Limpiemos Badalona”, un alegato a favor de la ecología y el cuidado de la naturaleza. Sus propuestas, de sobras conocidas, incluyen la reducción de emisiones de co2, de musulmanes y de contaminación acústica. \\nMinisterio de Industria, Energía y Turismo – Señor X. \\nLa gran incógnita del futuro Consejo de Ministros. De él solo se sabe que tiene acento andaluz, que es un apasionado de los bonsais y que tiene una excelente relación con las grandes empresas energéticas. Según fuentes del gobierno, el hecho de no conocer su aspecto no es impedimento, pues lleva tiempo gobernando desde la sombra. \\nMinisterio de Cataluña – Señor Pantumáquez \\nEl nuevo gobierno tiene muy claro que tiene un frente abierto en Cataluña. Por ello, ha creado el Ministerio de Lo de Cataluña, y ha colocado al frente a una persona consciente de la realidad catalana, y que confían en que será bien recibida entre los independentistas. \\nMinisterio de lo que quiera – Rita Barberà \\nLa otrora Alcaldesa de Valencia, Rita Barberá, ve correspondida su labor en el partido y recibirá la cartera que ella misma escoja a fin de “poder sacar el mayor partido posible de sus aptitudes”. De este modo, Barberá podrá ejercer un cargo a medida, en un Ministerio donde podrá hacer lo que le venga en gana, sin tener que dar explicaciones. La sustituirán en el Senado seis personas de complexión normal. \\nMinisterio de Soyjefamandomucho – Angela Merkel \\nPor último, el gran poder de decisión de Merkel se ve oficializado con este Ministerio, que podrá imponer sus decisiones por encima de cualquier ley o decreto aprobados por el resto de carteras. \\n\\nEste ministerio queda desierto hasta que el presidente electo averigüe lo que es “Fomento” Etiquetas'"}, "time": 1742563102.8435779}