{"duration": 0.15898513793945312, "input_args": {"text": "'  Disturbing Body Cam Shows Cop Execute Native American Woman for Holding Haircut Scissors Disturbing Body Cam Shows Cop Execute Native American Woman for Holding Haircut Scissors Matt Agorist July 28, 2016 56 Comments \\nWinslow, AZ — In March, police officer Austin Shipley responded to a call about a woman acting irregularly in a store. Within minutes of his arrival, he would kill 27-year-old Native American woman Loreal Tsingine. \\nLast week, conveniently before they released the body camera footage, Maricopa County Attorney Bill Montgomery issued a statement excusing Officer Shipley and said he would not pursue criminal charges against him because he was protecting himself and another officer who felt “threatened” by the 100 lb woman. \\n“After a careful review of the facts surrounding the case, including available video evidence and witness statements from all involved, my office found no evidence of criminal conduct on the part of Officer Shipley,” Montgomery’s statement said. \\nLate Wednesday night, officials finally released the body camera footage from that fateful day. It confirms witness testimonies. \\nShipley claims that Tsingine brandished a pair of scissors which caused him to fear for his life and put five bullets into the 5-foot tall, 100 lb woman. However, witnesses saw a different version of events. \\nAccording to Tsingine’s cousin, David Villaescusa, he watched a video of the incident which he says did not show her threaten the officer with the scissors. “She had a pair of scissors that she used to cut her hair split ends,” Villaescusa said. “She stood only five feet tall and weighed less than 100 lbs. Shipley, on the other hand, is over six feet tall and weighs over 200 pounds. I don’t think he had to shoot her.” \\n“I watched the video,” explains Villaescusa. “She never raised those scissors towards the officer.” \\nAccording to bystanders, Shipley showed up after another officer had Tsingine completely under control and had both hands behind her back — yet he continued to yell “stop resisting” as if he wanted the situation to escalate. Moments later, a troubled woman in need of mental help was lying on the ground twitching in a pool of her own blood. \\nThe cowardly and outright abusive behavior in the video below is hard to watch. \\nOfficer Austin Shipley is no stranger to hurting women, and, in fact, according to his fellow officers — he should have never been a cop. \\nAccording to records obtained by the Associated Press , at least two officers who trained Shipley had serious concerns about his work, including that he was too quick to go for his service weapon, ignored directives from superiors and falsified reports. \\nIt gets worse. \\nBefore he was even hired as a police officer out of training in 2013, a police corporal recommended that the Winslow Police Department not hire him. \\nBefore Shipley finished the academy, Cpl. Ron Chisholm wrote to Lt. Ken Arend and police Chief Steve Garnett and said, “I do not believe that this officer should be retained by the Winslow Police Department” and outlined a list of reasons. He cited integrity issues, failing to control suspects, not communicating with other officers, not accurately reporting facts and repeatedly questioning his training officers’ directives, according to the report. \\nBut Chisholm wasn’t the only cop who saw trouble in hiring Shipley. Cpl. Jason Thermen also went on record to voice his concerns about Shipley in July of 2013. According to the AP, Thermen said Shipley wrongly believed his badge gave him license to harass the public and ridicule citizens of the small northeastern Arizona city. Thermen also said Shipley was “pouting” because he didn’t allow the trainee to get into fights with a drunken person and with someone during a welfare check. “Shipley advised me the next day he went home and ‘pouted’ because I took the fight away from him again,” Thermen wrote. In their reports, Chisholm and Thermen both noted that Shipley was a danger to society, yet somehow, this man was still given a badge and a gun. “If this behavior continues, it is going to get someone hurt,” Chisholm wrote, noting Shipley’s tendency to continue to go for his gun in situations where it was entirely uncalled for. Even after he was hired, Shipley continued to build his rap sheet. Twice in only three years, Shipley was written up for abusing girls. The first time was for making inappropriate comments to a teenage girl. But the next time he’d be written up, it was for unnecessarily tasering a different girl. As all of this information comes to light, the Native American community is being vindicated in their original claims of injustice. Their friend and daughter, who was undoubtedly troubled, did not deserve to die that night. However, her killer was irresponsibly given authority to initiate violence against citizens by a police department, and for their incompetence, a community now grieves and a killer cop remains on the streets. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist Share Google + Sgt. Killgood \\nThe person who hired this murder should be held accountable and brought up on conspiracy charges . Too much corruption in our D.O.J . Time to start thinning it out . Gerry Addley \\nIt would only make sense that all the Dexter’s’ of the world would migrate to this profession. kiljoy616 \\nA lot of them do actually. Plenty of stories over the years about the KKK all over the police forces and even Feds. I mean that is where the power to do anything is. Harder to harass if you don’t have the power of a corrupt system behind you. There is an article came out 2 years ago about how police department only hire 100 IQ or so people. People with higher IQ are not hired. But the best part is the court system upheld they could do this. ROFL. Kris Weibel \\nWhen good cops call out the bad ones – publicly – then I will believe in the cops. rick \\nHe should be killed for killing an innocent person. elropo \\nBe very careful saying this on a social page, DA;s love to prosecute for this kind of comments. Tho many agree with you. anna miller \\nThis follows along the lines of the ex-cop on his channel Downtown White Cop, who states that bad cops are given protection, and the good cops who speak out are punished or fired. Lt. Ken Arend and police Chief Steve Garnett should be held accountable, and also their higher ups as well. This is a systemic problem. The bad cops are under the controls of their higher ups. kiljoy616 \\nThe system is to corrupt even up to the judges to fix. So no one is going to get fired and no one is going to be held responsible. If your still spouting the we need to fix the police then you are the problem. The police is a symptom of a bigger issue. anna miller \\nexactly, we have been usurped, and they are going in for the big moves now. They deliberately hire psychopaths. Many police officials are now being trained in Israel. Oh and they have such upstanding police over there. Stuart H \\nI know of who you speak, he is a retired cop and seems to be a stand up guy. There are more and more of these bad types out there now, and it is putting the public at risk and creating anymosity and mistrust between the people and police. Marilyn5632 \\nI basically get paid in the range of $6k-$8k monthly doing an online job. For anyone prepared to work basic freelance work for 2h-5h /a day at your house and get good payment in the same time… Then this opportunity is for you… http://ow.ly/bAic302l4rr \\nfghfgh Lydia Mpls \\nIn MINNEAPOLIS we’re working to get a REFERENDUM on the Nov. Ballot to REQUIRE cops to have individual MALPRACTICE insurance that can be recinded for compalints & settlements. NO insurance, NO JOB as a Minneapolis cop. Would get rid of SOME of the legal thugs. Find out more: http://www.insurethepolice.org Ruth8564 \\nsadgasdg Joseph White \\nThe city should be sued for hiring an emotionally unstable bully. If the trainer, and other officers urged for him not to be hired and he was hired, then the city is culpable. Alberto \\nThis imbecile officer should’ve been arrested and fired for unnecessary use force. If I was a family member I would be hiring an attorney to sue the Department, the City, and pressure the DA to relook at this case. John Chabak \\nThey should also fire the people who hired him knowing he is as mentally unstable as any other psychopath with badge and gun. The Supreme Gentleman'"}, "time": 1742563872.572867}