{"duration": 0.10666441917419434, "input_args": {"text": "'In the Wall Street dogfight between two billionaire investors, William A. Ackman won a moral victory but Carl C. Icahn won the war over the future of Herbalife, the nutritional supplements company. On Friday, federal regulators imposed stiff sanctions on Herbalife for deceiving buyers and sellers of its products but stopped short of shutting down the company. Mr. Ackman had wagered big on Herbalife’s demise, while Mr. Icahn had been betting on its ultimate survival. In a settlement with the Federal Trade Commission, Herbalife will pay $200 million in consumer relief, hire an outside monitor and make substantial changes to its business practices in the United States that could affect its bottom line, but the company will continue to operate. For nearly four years, Mr. Ackman argued loudly and often that Herbalife was a pyramid scheme that took advantage of customers  —   at one point staking $1 billion on a decline in Herbalife’s shares in a characteristically brash move to prove his point. He gave numerous public presentations using hundreds of slides and videos to make his case that Herbalife was predatory. He even invoked members of Congress to pressure regulators to take action against the company. In response, Mr. Icahn invested in Herbalife, placing an even bigger bet that it would weather the regulatory scrutiny. Other big Wall Street investors including Daniel S. Loeb and George Soros also piled on against Mr. Ackman. But Mr. Icahn seemed to particularly relish going    with Mr. Ackman, famously calling the hedge fund manager a “crybaby in the schoolyard” when the two men squared off with each other during a live CNBC broadcast in January 2013. To win his bet, Mr. Ackman needed regulators at the F. T. C. to either shut down Herbalife or take some action that would cause shares of Herbalife to crash. Mr. Ackman, founder of the $12 billion Pershing Square Capital Management hedge fund, had said on a number of occasions he expected shares of Herbalife to go to zero. He even appeared in a documentary earlier this year about the tussle, called “Betting on Zero. ” Instead, shares of Herbalife shot up more than 10 percent on Friday on the news of the settlement and most recently were trading at $65 a share. “This settlement will require Herbalife to fundamentally restructure its business so that participants are rewarded for what they sell, not how many people they recruit,” Edith Ramirez, the F. T. C. chairwoman, said in a news release announcing the settlement and the filing of a complaint in federal court seeking a permanent injunction and other relief against the company. In a conference call with reporters, Ms. Ramirez said Herbalife had been “deceiving hundreds of thousands of hopeful people” with the belief they could get rich. But she would not say whether or not the company was a pyramid scheme as Mr. Ackman has claimed. The commission’s “focus wasn’t on a particular label,” Ms. Ramirez added. The complaint filed on Friday by the F. T. C. against Herbalife in federal court in Los Angeles does call into question some of the company’s longstanding distribution practices and ways it generates revenue by relying on customers to sell products to friends and relatives. The complaint says, “the overwhelming majority of Herbalife distributors who pursue the business opportunity make little or no money and a substantial percentage lose money. ” The agreement with the F. T. C. will require Herbalife to overhaul its system for compensating its customers and recording sales of its supplement drinks and other food products. Over time, the structural changes mandated by the F. T. C. in the settlement and civil complaint could have a   impact on Herbalife’s profitability. The settlement with the F. T. C. “does not change our   business model and will set new standards for the industry,” a spokesman for Herbalife said in a statement. “We agreed to the terms and to pay $200 million because we simply wanted to move forward with our mission. ” The company also took a swipe at Mr. Ackman in its statement, saying it had been “under attack by an intransigent   hellbent on a misinformation campaign designed to destroy our company. ” Mr. Ackman was noticeably   after the announcement of the settlement. His firm released a statement in which it insisted that Herbalife’s business model would fail once the company instituted the structural changes required by the settlement. “We expect that once Herbalife’s business restructuring is fully implemented, these fundamental structural changes will cause the pyramid to collapse,” the statement said. Mr. Ackman’s contention that Herbalife is an unlawful pyramid scheme has focused on the company’s sales practices. Herbalife relies on independent resellers who are rewarded for recruiting new members, and Mr. Ackman argued that these recruitment efforts were more lucrative than the sale of its products. In the near term, the settlement will be bad news for investors in Mr. Ackman’s hedge fund who have lost money investing in his fund over the last year and a half. While Mr. Ackman has restructured the bet against Herbalife  —   known as a short  —   reducing it by more than 60 percent, he still has exposure. And he has spent more than $50 million on research and legal fees for his campaign against the company So far this year, Mr. Ackman’s Herbalife bet has lost him 11 percent, according to his most recent investor update. His Pershing Square Holdings fund is down 19. 1 percent. In a separate note to investors on Friday, Pershing Square said Herbalife was trying “to spin the settlement remarkably as somehow an endorsement of their business model” and that over the long haul the outcome would be “materially positive for our short position. ” Herbalife said on Friday that it would let Mr. Icahn increase his ownership stake to as much as 35 percent from the 18 percent of the company’s outstanding shares he currently holds. The move could set the stage for Mr. Icahn and others to take Herbalife private, an action that would make it difficult to determine the economic impact of the changes in business practices on Herbalife’s bottom line. In a statement, Mr. Icahn said he would ”consider a range of strategic opportunities, including potential   involving competitors, as well as other strategic transactions. ” Mr. Icahn also wasted no time in gloating over his victory. “Unlike many of those that ‘shorted’ Herbalife, we did not rely on one or two research papers prepared by nonexperts,” he said in his statement Friday morning. “While Bill Ackman and I are on friendly terms, we have agreed to disagree (vehemently) on this subject,” Mr. Icahn said, adding that the F. T. C. ’s settlement “vindicates our research and conviction. ” It was almost two years ago to the day that Mr. Icahn and Mr. Ackman hugged and made up publicly on stage at an investor conference in Manhattan. “It’s not about winning,” Mr. Ackman said at that conference on July 16, 2014. But, he added, “I would love to get Carl out of this stock. ” After Friday’s settlement that possibility looks less likely than ever.'"}, "time": 1742562165.9863212}