{"duration": 0.0410618782043457, "input_args": {"text": "'Home › POLITICS › HUMA IS JUST ‘ONE OF MY STAFFERS’ AFTER CLOSE AIDE GETS LEFT BEHIND ON OHIO CAMPAIGN TRIP HUMA IS JUST ‘ONE OF MY STAFFERS’ AFTER CLOSE AIDE GETS LEFT BEHIND ON OHIO CAMPAIGN TRIP 1 SHARES \\n[10/31/16] Democratic presidential candidate Hillary Clinton blasted the FBI again Monday – and this time brought up the bureau’s probe into emails maintained by longtime aide Huma Abedin – dismissing the idea she did anything wrong while minimizing the close role of her staffer. ‘Now they apparently want to look at emails of one of my staffers – and by all means they should look at them,’ Clinton said, bring up the FBI attack at the start of a rally before a room packed with students at Kent State University. ‘And I am sure they will reach the same conclusion they did when they looked at my emails for the last year. There is no case here. And they said it wasn’t even a close call,’ Clinton said. The staffer Clinton failed to name was Abedin, who has been at her side since Clinton was first lady. Clinton considers her like a surrogate daughter as well as longtime confidant. Abedin has been known for years to be Clinton’s gatekeeper, and has been revealed in State Department emails as someone constantly consulted on matters relating to Bill Clinton, top donors, close friends, celebrities, who gets face time with the first lady, and paid speeches that pose potential conflicts. ‘I’m sure a lot of you may be asking what this new email story is about and why it he world the FBI would decide to jump into an election with no evidence of any wrongdoing with just days to go,’ Clinton asked early in her remarks, before adding, ‘That’s a good question.’ Clinton hammered the FBI over the weekend, after news broke Friday about the investigation. Since then, senior Democrats have taken up the cause. Senate Minority Leader Harry Reid released a blistering letter where he wrote that FBI Director James Comey violating Hatch Act provisions on government employees interfering in an election. As she unloaded on the agency this time, Clinton also offered up words of contrition. ‘For those of you who are concerned about using personal email, I understand,’ she said. ‘And as I’ve said, I’m not making excuses. And I’ve said it was a mistake and I regret’ it, Clinton said. Then she turned to attack Donald Trump for having a ‘hair-trigger temper’ that could imperil the entire world. Post navigation'"}, "time": 1742562730.5787141}