{"duration": 0.02807450294494629, "input_args": {"text": "'The United States military is “not in a position” at the moment to “collaborate” with their Russian counterparts, U. S. Secretary of Defense James Mattis told reporters at the NATO headquarters in Brussels, Belgium. [During the press conference Thursday, a reporter asked the secretary, “What does Russia need to stop doing in order for the U. S. to work with it?”  President Donald Trump’s Pentagon chief responded: We are not in a position right now to collaborate on a military level, but our political leaders will engage and try to find common ground or a way forward where Russia, living up to its commitments, will return to a partnership of sorts here with NATO. But Russia is going to have to prove itself first and live up the commitments they have made in the   agreement. Secretary Mattis also noted that “there’s very little doubt” that Russia has “either interfered or they have attempted to interfere in a number of elections” in the United States and other democracies. During his confirmation hearing held by the Senate Armed Services Committee in January, retired Gen. Mattis described Russia as one of the “principal threats” facing the United States. Nevertheless, he indicated that he supports U. S. engagement with the Kremlin. Mattis told lawmakers: When we identify other areas where we cannot cooperate, we must confront Russia’s behavior and defend ourselves if Russia chooses to act contrary to our interests. Challenges posed by Russia include alarming messages from Moscow regarding the use of nuclear weapons, treaty violations, the use of hybrid warfare tactics to destabilize other countries, and involvement in hacking and information warfare. Buttressing NATO will be fundamental to meeting these challenges, and we will need an integrated strategy that strengthens the North Atlantic Alliance and ensures that the Department of Defense is prepared to counter both traditional and emerging threats. During the press conference in Brussels, the secretary emphasized the need to negotiate with Russia “from a position of strength. ” He also accused Russia of violating international law with its “aggressive” and “destabilizing” actions. “The point about Russia is they have to live by international law just like we expect all mature nations on this planet to do,” Mattis told reporters. “We thoroughly discussed the increased threats facing our alliance,” added the U. S. secretary of defense, referring to America’s NATO partners. “And unified by the threats to our democracies, I found strong alliance resolve to address these growing threats.  Russia’s aggressive actions have violated international law and are destabilizing. ” Before the press conference at the NATO headquarters in Brussels Thursday, Russian President Vladimir Putin urged the United States to restore communications between their respective intelligence services, adding that ”all relevantgovernments and international groups should work together. ” Echoing comments made during his confirmation hearing, Secretary Mattis described NATO on Thursday as a “fundamental bedrock for the US and all the transatlantic community,” but stressed that member states must share the fiscal burden of common defense.'"}, "time": 1742628517.185631}