{"duration": 0.019373178482055664, "input_args": {"text": "'In response to a lack of communication from both the publisher and developer about For Honor‘s most pressing issues, members of the game’s community are planning a boycott of the game on April 3, 2017. [Organized by Reddit community member “jbaayoun,” the For Honor gameplay blackout will begin at 5 AM and last for a minimum of 24 hours. Players are protesting the game’s ongoing balance issues, some so grievous that tournament organizers have been forced to ban at least one class from competitive play.  The participants are seeking greater transparency from the game’s developer and publisher around issues that have plagued the title since release. First, they want clearer communication between Ubisoft and For Honor fans. This should include a more informative version of the ongoing “Warrior’s Den” livestreams that the developers have been promoting. Second, they want a clearly defined roadmap for the game’s future. If players are going to stick around for the literal years needed to fully unlock the game’s content, they want a plan of future content that will give them a good reason to do so. Third, boycotters want a solution to the aforementioned glacial pace of earning the game’s “Steel” currency to make the grind for unlocking content a bit less punishing. Finally, players want to see a solution for the game’s ongoing matchmaking woes. Of note, Ubisoft has recently posted patch notes in the official forums that address a few of the game’s issues, including a sizeable boost to Steel income. It’s a welcome first step to addressing one problem among many in a game that is robbed of its potential for greatness by clumsy execution. Will a community boycott draw the publishing giant’s attention to make a difference? We’ll find out on April 3rd, unless either the publisher or development team deign to respond sooner. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742628588.1181846}