{"duration": 0.11111187934875488, "input_args": {"text": "'MANAUS, Brazil  —   Our tale takes metaphorical root in the early 1880s and the fevered imaginings of rubber barons. Sitting by the vast Amazon River, bewitched by pink river dolphins and torrential downpours, surrounded by rain forest, these men hungered for a legacy worthy of kings. So they imported an Italian architect, the mellifluously named Celestial Sacardim, to build an opera house. He conceived a heaven: columns of Carrara marble chandeliers of Murano glass 36, 000   roof tiles from Alsace parquet floors of walnut, oak and Norwegian maple tapestries from the looms of Flanders. Liverpool foundries provided the steel. The Teatro Amazonas was beautiful and insanely expensive and as ephemeral as everything else in this sweltering land. The rubber barons, legend has it, persuaded Enrico Caruso to journey here and sing Verdi. Then the rubber economy collapsed, and the opera house, which still stands in the colonial quarter, fell into decade upon decade of damp disuse. All of which brings us to a new hallucination: the Arena da Amazônia in Manaus, a city whose name comes from a local tribe and means Mother of the Gods. When Brazil embarked on an orgy of arena construction for the World Cup in 2014, Manaus city leaders decided to build the grandest arena of all. Years in the making, at a cost of $220 million, it was crafted to resemble a giant white basket of a type common in the region, atop a   concrete plaza. The arena seats 44, 351 people. Save for the rarest of occasions, such as when Olympic women’s soccer teams played here recently, this arena sits empty. Manaus is surrounded by a rain forest the size of France, Spain, Sweden, Greece and Italy combined, and it is reachable only by airplane or boat. Most in this   city of two million have more on their mind than sports. The debt for this ziggurat has piled high and requires siphoning off of money intended for schools and hospitals.   of Manauarans are extremely poor many lack running water. I wandered into the   marble cafe of that opera house, which has been reincarnated as a tourist attraction and for music and dance events. Erica Damasceno, 20, sipped coffee as I asked about the stadium. She wagged her hand. “I never go there,” she said. Never? She shook her head. “Never. So much money was put into it, and we have such great needs: schools, hospitals. Every big public project is an excuse to steal money. ” I stepped outside into an equatorial sun that felt like a fat hand pressed down on my skull. I found Maciel De Souza sitting in the shade of a tree with his   Natalia Vilacio, tourist guides without tourists. Do you go to the stadium? “Yes,” De Souza replied. How often? “Once. ” He shook his head. “It’s a white elephant, a big one,” he said in Portuguese through an interpreter. “Sometimes tourists like to see it. No one is ever inside. ” Arena dreams tend toward the ridiculous, from Milwaukee to Minneapolis to Manaus. Promises of economic benefits are as illusory as lost civilizations. FIFA, the world soccer federation, required that World Cup host nations build at least eight stadiums. Brazil, in a fit of prideful excess, insisted on building 10, at a cost of nearly $2 billion. Those stadiums have become aspiring archaeological digs. Brasília spent $550 million to build its stadium it doubles as a municipal bus depot. The stadium in Cuiabá cost $230 million, and homeless men sleep in the locker rooms. Managers at Recife’s grand Arena Pernambuco are at such wits’ end that they rented it out for a    boy’s birthday. The magazine Americas Quarterly found that Brazil’s expenses for the World Cup greatly outran its revenue. Brazil repeated its wasteful act for the Olympics. There are corruption inquiries in a   states, with construction companies and hapless officials under the magnifying glass. That brings us back to Manaus and its   excess. (Fitzcarraldo was the dreamer in a Werner Herzog movie who had the unhinged ambition to haul a steamship over a mountain in the Peruvian Amazon.) As was true for the opera house, no expense was spared in the construction of the Arena da Amazônia. Steel was poured in Europe and loaded at the port of Aveiro in Portugal. Workers filled three giant freighters to the gills with steel, and a fourth ferried the membrane that serves as the roof. It took this fleet 20 days to trundle across the Atlantic and many more to edge up the Amazon. Construction was a dank nightmare. Three workers died. Foundations were poured, and repoured. Steel joints buckled in the humidity. Project managers discovered that “an unwelcome tributary of the French River” ran under the site. From December to March, Manaus receives about 45 inches of rain, so there was the Noah problem, too. No roads run to Manaus other than dangerous dirt tracks impassable in wet weather. As the project manager said at the time, “This was a huge, huge, huge challenge. ” Those challenges later turned to red ink. The local soccer teams here are the equivalent of the Rookie League Kingsport Mets and draw 1, 000 fans on the best nights. They could not afford the rent. A few big league teams, those from São Paulo and Rio de Janeiro, sometimes played here, but only if the state containing Manaus provided a subsidy of one sort or another. It is a   flight from Rio to this capital of the Amazon. At the time of the construction, Manaus’s mayor, Arthur Virgilio Neto, offered enthusiasm that would sound familiar to those rubber lords of centuries past. “It will be very good for international shows,” Neto told NPR. “I’ve heard that many pop stars have dreamed of singing for a low price in the Amazon jungle. ” I imagine that Bono and Beyoncé and Kendrick Lamar might dream of singing beneath a canopy of giant kapok trees. So far, none have journeyed here to do so. Fabricio Lima, Manaus’s secretary of state for youth, sports and leisure, sat for an interview last week with my colleague Tania Franco. He faces daunting numbers. From January to April, the Arena da Amazônia generated $180, 000 in revenue. Its expenses in that period totaled $560, 000. That was its   performance in a while. So far, Lima’s best customers are the Amazon’s many evangelical ministers. Each night he dreams grandly each morning he acts modestly. What is his latest idea for the arena? He smiled and replied, “Weddings and birthday parties. ” Later that day, I walked through the old   market down by the banks of the Amazon. A hot wind eddied and swirled, and I listened as Marcio Morais, an herb merchant, explained how his grandfather, who was raised in the jungle, taught him to harvest herbs. Liver inflammation, kidney problems, asthma, erectile dysfunction: He has an herb for nearly every ailment. Our talk turned to the arena. He frowned. “Olympic Games are nice, but why are we spending money on this?” he said. “It could have been a university. It could have been a school. Do you know we have an opera house? Such big dreams. ” I allowed that I knew of those dreams. “Sometimes you have to wake up,” he replied. With that, we shook hands, and I stepped out into the   heat.'"}, "time": 1742564029.928961}