{"duration": 2.207531690597534, "input_args": {"text": "'Politics Russia as It Actually Exists Couldn\\'t Be More Different From the One Imagined in the West \\nReal Russia -- a country nobody knows anything about because they\\'re busy dreaming up a brutal \\'Putin\\'s Russia\\' in its place Originally appeared at Consortium News \\nIn February, the Obama administration announced that it was quadrupling funding for a major increase in NATO troops and weaponry in the countries of Eastern Europe on the border with Russia. Diplomatic relations have faltered between the two countries over Syria. \\nAnd the corporate media in the U.S. and U.K. have again stepped up their demonization of all things Vladimir Putin – he’s corrupt, he personally orders hits on people, is facilitating war crimes in Aleppo, and wants to invade Europe. The media also pushes the idea that Russia is an uncivilized and backwards cesspit. \\nConsidering that Russia is a nuclear superpower, the largest country geographically in the world, and is the sixth largest economy in terms of purchasing power parity (and projected to be number six in 2021 in terms of GDP), the U.S. relationship with Russia is one of the most important and delicate. \\nIn order to have any chance of conducting this relationship in a rational manner, an accurate and nuanced understanding of the country itself and the history of post-Soviet U.S.-Russia relations is essential. This requires cutting through the misinformation and distortion that saturates much of our mainstream news and political discourse. \\nIt’s important to keep in mind that Russia has a 1,000-year history of authoritarian rule and only started its climb out in the late 1980s. It is a transitional society, with elements of both authoritarianism and democracy. Putin, along with Dmitri Medvedev and Mikhail Gorbachev, is the least authoritarian leader that Russia has ever had. \\nConsidering that the U.S. has supposedly been an established democracy for over 200 years, we Americans should consider a few significant problems we still have in order to gain some perspective. Only 55 years ago, African-Americans could not vote and could even be murdered with impunity in many parts of the country. \\nToday, we have an epidemic of militarized police officers who are shooting first and asking questions later; more and more people on death row are turning out to be innocent; rising inequality threatens our stability; and, a system of deep corruption in terms of campaign financing has compromised our democracy – corruption that is so profound that two political science academics have recently quantified the ways in which we are now officially an oligarchy. \\nIs this any better than Russia’s corruption because it has been folded into our legal system? We certainly have our own “oligarchs” in the form of the Koch brothers, Bill Gates, and the Walton family. Perhaps we can concede that it’s not very useful to beat on Russia for not being Switzerland after only 25 years. \\nRussian Sentiment \\nA recent poll by the independent Levada Center revealed that 66 percent of Russians feel free and 68 percent don’t believe it is likely that Russia will revert back to dictatorship. To understand why Russians may see themselves as fairly free, it is important to understand not only their history of authoritarian rule but also some facts and observations about Russia that run counter to the narrative often presented in our mainstream corporate media, which is owned by those same oligarchs that have captured our political system. \\n\\nWhen I visited Russia last autumn, one of the first things I observed was that the police in both Moscow and St. Petersburg did not carry guns, only batons. I asked some Russians about this and was told that if an officer had a special assignment, he/she might carry a gun but that generally they did not. This is not consistent with the characterization that most Americans have about Russia being a police state or autocracy. \\nSpeaking of guns, Russian citizens have to abide by much stricter gun control laws than in the U.S. These include the requirement for gun owners to obtain a five-year renewable license. Before the first license is issued, attendance in a firearms safety class and the passing of a federal safety exam is required as well as a background check. \\nOne example of how the Russian gun control laws have helped to prevent the deadly types of mass shootings seen in the U.S. is the hate crime against patrons of a gay club in Yekaterinburg that occurred shortly after the Orlando massacre. Due to the fact that Russians don’t easily have access to (illegal) assault weapons, no deaths occurred as a consequence of the violence perpetrated against the patrons by a group of Russian hoodlums who only had small, pneumatic weapons. \\nRussia has also had a moratorium on the death penalty since 1999 and its high court has upheld it, while Putin has publicly supported it, even in the face of popular sentiment for bringing back executions for certain crimes. Russia’s murder rate is still higher than the U.S., but it is important to understand that there is a pattern of major improvement since the Wild West days of the 1990s when journalists who covered Russia, like Angus Roxburgh, acknowledged that people being gunned down in the streets of Moscow was reminiscent of an episode of The Untouchables and was a fairly regular occurrence. \\nIn my visit last year, another woman and I traveled together and encountered no problems or threats, even when we walked from the Metro station to our hotel after dark in Moscow. I felt no less safe than I feel walking around after dark near where I work in San Francisco. \\nAlthough the visa application to travel to Russia is more stringent than for other European countries, I traveled freely when I was there, took photos wherever I wanted, and went through a similar airport security procedure as in the U.S. The vast majority of people I encountered in Russia were friendly, curious or neutral. \\nRecession and Resilience \\nWhile Russia has suffered from a recession since 2014 and has seen economic gains for its population suspended since the combination of low oil prices and sanctions, there was plenty of food in the markets and people said that the main hardship was inflation, though that has been coming down and is now at an annualized rate of 6.9 percent. The import substitution policies have shown success in theagricultural sector and are just starting to show promise in the industrial sector. \\n\\nThe sense I got from the Russians whom I spoke with was that they’d weather this storm and come out stronger and wiser for it – as they’d had to do in far worse conditions in their history. In spite of the recession, people generally looked healthy, were dressed in Western attire, and young people had their smartphones. In many ways, these people looked indistinguishable from those you’d see in any American city or suburb. \\nPrior to this economic downturn, Russia had enjoyed consistent increases in quality of life after “the lost weekend” of massive poverty, crime and exploding mortality rates that the Russian people had suffered during the Yeltsin years – giving Boris Yeltsin the distinction of being the least popular leader among Russians of the last 100 years. \\nAs Victor Kramarenko, an engineer and foreign trade relations specialist during the Soviet period and, more recently, a years-long executive with a major American corporation in Moscow, summed up the Yeltsin era: “The Russian economy was devastated. We went from being an industrial power that defeated the Nazis, showed resilience, rebuilt quickly, and had great achievements in aviation and space to a place where morale collapsed and a lack of trust and a pirate mentality emerged.” \\nWhy Is Putin Popular? \\nThe devastation of the Yeltsin era was the state of the nation when Vladimir Putin took the helm in 2000. Having to navigate among ruthless oligarchic clans that Yeltsin had left behind, with no political party to support him and a very real possibility of overthrow or assassination if he wasn’t careful, Putin began to surround himself with people he’d trusted throughout his career. This included, among others, some people from the security services. \\nAs for the epithet that “once a KGB man, always a KGB man,” Putin was actually not some James Bond-style assassin during his time with the spy agency. He served as a mid-level analyst in Dresden for the bulk of his career. Upon his return to Moscow from East Germany in 1990, he turned down a promotion to the agency’s foreign intelligence operations division, opting to re-settle his family in St. Petersburg instead. His increasing dissatisfaction eventually led him to resign from the KGB. \\nPutin then went to work as a foreign affairs adviser to Anatoly Sobchack in May of 1990. Sobchak, a professor of economic law at Leningrad State University, had emerged in the Gorbachev era as a popular democratic reformer and major critic of the KGB’s abuses. He had just been elected Chairman of the Leningrad City Council. \\nThe following year Sobchak became mayor and appointed Putin as his deputy. According to Allen C. Lynch in his scholarly 2011 political biography, Vladimir Putin and Russian Statecraft, in this position, Putin coordinated relations with the military, police, district attorney, customs officials and NGO’s and handled diplomatic matters. \\nIn the six years he served in this capacity, Putin had many impressive achievements, including attracting several Western corporations to the city, signing thousands of joint ventures with foreign companies, establishing a substantial foreign banking presence, legalizing the sale of land, allowing for free privatization of residential property, opening an international trade center, and strengthening municipal banks – which contributed to their remaining solvent in the face of the 1998 financial meltdown. \\nDuring the 1991 attempted coup against Soviet President Mikhail Gorbachev, Putin found out that the Leningrad KGB, which supported the coup, planned to arrest Sobchak when he returned to the airport from out of town. Putin quickly gathered a group of trusted men and rode straight up to the plane to protect his boss, a challenge the local KGB chose not to press. \\nThe Corruption Claims \\nDespite Western assertions of Putin’s corruption, with questionable evidence to support these charges, there is evidence pointing in a very different direction about Putin’s honesty. Sharon Tennison – author, program developer and my travel companion in the country – personally interacted with Putin when he reviewed a program proposal for her at Marienskii City Hall in 1992. Although, it was impossible to know who he would go on to become, Putin made an impression on her at the time as the only Soviet/Russian official in her experience who had not asked for a bribe or favor. \\n\\nTennison also developed extensive contacts with young entrepreneurs throughout the country, including in the St. Petersburg area. Several of these entrepreneurs stated that Putin was the only local bureaucrat who had never charged a bribe for registering their businesses. \\nThis general picture of Putin’s honesty is buttressed by biographer Lynch as he addresses Putin’s time as deputy mayor of St. Petersburg, stating: \\n“For much of this time, given Sobchak’s frequent and protracted absences and his preoccupation with national affairs, Putin assumed the functions of acting mayor. He supervised the drafting and implementation of countless international business deals and policy reforms. These transactions did not always go according to plan, and no doubt many profited handsomely from Putin’s admitted inexperience in these matters. \\n“During his attempt to establish municipal oversight over a series of casinos, for example, the city was cheated. In another case, the city was fleeced for $120 million for two shipments of cooking oil. Although during this period his mother bought a choice apartment at an exceptionally low price at a city auction, Putin didn’t seem to enrich himself personally. In the one specific public charge of corruption that was brought against him, Putin sued in court for slander and won.” \\nLynch sums up Putin’s character as follows: \\n“Putin was not corrupt, at least in the conventional, venal sense. His modest and frankly unfashionable attire bespoke a seeming indifference to personal luxury.…Putin was honest, certainly by Russian standards. He lived simply and worked diligently.” (Lynch, pp. 32-33) \\nRichard Sakwa, a British scholar specializing in Russia, has written perhaps the most comprehensive political biography of Putin, covering all three of his presidential terms and how the Russian political system has evolved under his watch, both the positive and the negative. Sakwa interviewed numerous people who have worked with Putin throughout his career, including many who vouched for his honesty and relative sense of decency when handling political reassignments and other delicate internal matters. \\nUnder Putin’s leadership as either president or prime minister from 2000 to 2012, Russian citizens saw incomes increase five-fold, the poverty rate cut in half, consistent economic growth, and a safer country. Moreover, Russians enjoy universal health care, one of the highest rates of education in the world (54 percent of Russians have a college degree), and 140 days of paid maternity leave for women. And despite the misinformation regularly put out by Washington, including by President Barack Obama himself, Russia’s average life expectancy is now 71 and has been increasing consistently for several years, rebounding from a stunning decline during the Yeltsin years. \\nGradual Improvement \\nTennison, who lives part-time in St. Petersburg, has been traveling throughout Russia since 1983, when it was still part of the Soviet Union, and has established a wide network of relationships and connections over three decades. He made the following observations in 2014 on the changes she has seen in Russia since 2000: \\n\\n\"During this time, I’ve traveled throughout Russia several times every year, and have watched the country slowly change under Putin’s watch. Taxes were lowered, inflation lessened, and laws slowly put into place. Schools and hospitals began improving. Small businesses were growing, agriculture was showing improvement, and stores were becoming stocked with food. \\n“Highways were being laid across the country, new rails and modern trains appeared even in far out places, and the banking industry was becoming dependable. Russia was beginning to look like a decent country — certainly not where Russians hoped it to be long term, but improving incrementally for the first time in their memories.” \\nShe goes on to describe similar developments further out from the major cities, including in the Urals, Yekaterinburg, Chelyabinsk and Perm. New museums, municipal buildings and supermarkets, well-maintained streets, modern street lights and regular snow plowing in the winter were all observed. \\nDuring this period, Russia also became a creditor nation with relatively low foreign debt, substantial foreign and gold reserves, and a rainy day fund built up during the prosperous years. These are some of the reasons why Putin has consistently had approval ratings between 60 percent and his high of 89 percent in late 2015. \\nThe vast majority of Russians credit Putin with taking a nation that was on the verge of being a failed state, turning it around and creating concrete improvements in their lives. In my many conversations, Russians described him as a leader possessing patience, organization and determination. Overall, they believe his good qualities outweigh his flaws. \\nRussians also expressed support for his handling of foreign affairs. More specifically, they see him as standing up to numerous provocations from the U.S. and its NATO club. \\nRussian Interests \\nPutin is first and foremost a Russian patriot and pragmatist whose priorities, in addition to raising Russians’ living standards, are the security and stability of the country. \\nRussia has a long history of invasions from all directions due to its lack of natural barriers like oceans and mountain ranges. In the Twentieth Century, it was invaded twice within a 25-year period by Germany. Some 27 million Soviet citizens, including 19 million civilians,perished in fighting off the Nazi Wehrmacht, leaving one-third of their country destroyed. By comparison, the U.S. lost approximately 405,000 and suffered no fighting or damage on its homeland. With this background, Soviet leader Gorbachev was understandably hesitant to allow a reunified Germany into NATO at the close of the Cold War. \\nBy the time of the Malta meeting between Gorbachev and George H.W. Bush in December of 1989, the Berlin Wall had fallen and Washington had promised it would not “take advantage” of Gorbachev’s decision to eschew using force to maintain control of Central/Eastern Europe. Two months later, Bush’s Secretary of State, James Baker, negotiated a gentleman’s agreement with Gorbachev that, in exchange for allowing a reunified Germany as a NATO member, NATO would not expand “one inch to the east.” \\nBaker’s argument was that NATO membership would have a restraining influence on a unified Germany as opposed to a militarily independent state. According to Viktor Kuvaldin, an adviser to Gorbachev at the time, the Soviet leader did not press for the agreement in writing because he trusted Washington to abide by its promise. \\nResearch by academic Mary Sarotte, published in the Diplomatic History Journal in 2010, which included interviews with participants and review of notes and other documentation from the meetings, indicates that American politicians’ subsequent denials that such an agreement was made are disingenuous. A November 2009 investigation by the German newsmagazine Der Spiegel came to the same conclusion. \\nAfter the Cold War, France and Germany believed that the best way to bring Russia into the Western fold and encourage its evolution as a democracy was through cooperation and gradual integration. But the U.S., which saw an intense lobbying campaign by the military-industrial complex and political pandering to certain constituencies, soon began pushing for NATO expansion as well as imposing neoliberal economic reforms, i.e., privatization of the economy and shrinking of the social safety net. Both policies were carried out under the pretext of spreading democracy and both have elicited strong resentment in Russia. \\nOvertures to the West \\nDuring Putin’s first two terms as president, he made overtures to the U.S. and NATO in the hopes of some reciprocity and acknowledgment of Russia’s interests. For example, after the 9/11 attacks, Putin was the first world leader to call President George W. Bush to offer his condolences and support. His reasoning was two-fold: one, he saw the U.S. and Russia as having a mutual interest in fighting Islamist terrorism; second, he knew that he had a tall order in successfully addressing the many profound problems facing Russia at the time. \\n\\nHe would need to put as much time, energy and resources as he could muster into the project of rehabilitating his country, which meant not wasting them on unnecessary conflict with the world’s lone superpower. Going against the advice of most of his security team, he provided logistical and intelligence support as well as access to military bases on behalf of the U.S. operation in Afghanistan. \\nIn return for this assistance, Putin received the equivalent of a swift kick in the shins from the neoconservative Bush administration in the form of a unilateral withdrawal from the Anti-Ballistic Missile Treaty to pursue a “missile defense shield” in 2002 and the accession of seven more nations of Eastern Europe into NATO in 2004. (Three others — Poland, Hungary and the Czech Republic — had joined in 1999) \\nSeemingly undeterred, in 2008, Putin ordered the Russian Foreign Ministry to draft a proposal that Dmitry Medvedev took to Brussels, outlining a security plan that would cover all of the Euro-Atlantic community and Russia, obviating the need for NATO’s continued existence, much less its expansion. \\nThe preamble stated that: “the use of force or the threat of force against the territorial integrity or political independence of any state, or in any other way inconsistent with the goals and principles of the Charter of the United Nations is inadmissible in their mutual relations, as well as international relations in general.” \\nIt also reiterated the intent to cooperatively address any security concerns that may arise among members. The body of the document contains mechanisms for how concerns or breaches of security could be handled. This proposal was sent to the leaders of relevant nations as well as the heads of European Union, NATO and Organization for Security and Cooperation in Europe, emphasizing that Russia was open to suggestions and negotiation on the plan. \\nPutin and Medvedev heard crickets in response to their proposal. \\nRatcheting Up Tensions \\nNot long afterward, Georgian leader Mikheil Saakashvili, egged on by elements in Washington, staged a military incursion into South Ossetia, killing Russian peacekeepers and prompting a strong military response by Russia. The 2009 E.U. fact-finding report on the war between Georgia and Russia does not support the insistence by Washington and the corporate media that Russia started the war. \\n\\nFive years later, Ukraine, a country where the southeastern area had historically been part of the Russian Empire and the central and western areas part of the Austro-Hungarian Empire, became the flashpoint. The E.U., led by Germany, recklessly tried to pressure Ukrainian President Viktor Yanukovich to sign an Association Agreement that contained terms that would be unwise for the leader of an already poor and divided nation on Russia’s border to agree to. These included requirements that would result in major economic losses and a security clause that implied integration with NATO. \\nAgain, elements from Washington engaged in provocations. A leaked phone call between Assistant Secretary of State for European and Eurasian Affairs Victoria Nuland (a neoconservative from the Bush years whose rise at the State Department was facilitated by Secretary of State Hillary Clinton) and U.S. Ambassador Geoffrey Pyatt revealed them discussing who would take over Ukraine’s leadership several weeks before Yanukovich was illegally overthrown in a violent putsch on Feb. 22, 2014. Footage of Nuland handing out pastries to the protesters also surfaced. \\nContrary to repeated claims by the West that the violence on the Maidan, especially sniper fire that killed both police and protesters on Feb. 20, 2014, was the result of Yanukovich’s forces or even Russian provocateurs, several credible sources indicate that neo-fascist forces, such as Svoboda and Right Sector, had hijacked the Maidan movement and were the responsible parties. \\nThe first source is Estonian Foreign Minister Urmas Paet during an intercepted phone conversation dated Feb. 26, 2014 in which hereports to then-E.U. High Commissioner Catherine Ashton that his on-the-ground sources told him: \\n“What was quite disturbing, the same oligarch told that well, all the evidence shows that the people who were killed by snipers from both sides, among policemen and people from the streets that they were the same snipers, killing people from both sides. … So that and then she [Dr. Olga Bolgomets] also showed me some photos, she said that as medical doctor, she can, you know, say that it’s the same handwriting, the same type of bullets, and it’s really disturbing that now the new coalition they don’t want to investigate what exactly happened, so that now there is stronger and stronger understanding that behind the snipers, it was not Yanukovich, but it was somebody from the new coalition.” \\nThis assessment was later supported by an April 2014 investigation by Germany’s ARD TV. An even more in-depth forensic investigationundertaken by Dr. Ivan Katchanovksi, a Canadian academic whose family originally hails from western Ukraine, also concluded that neo-fascist elements of the Maidan movement were culpable. \\nThese extremists had refused to abide by a Feb. 21, 2014 agreement hammered out by Poland, France, Germany and the Yanukovich government in which the latter had agreed to reduced powers and early elections. Interestingly, these European countries have never publicly explained why they abandoned their role as guarantors of the agreement as the violence of Maidan escalated when the putsch occurred the following day. \\nConsidering that none of these three sources can plausibly be accused of being Putin apologists, it casts the West’s whole narrative of “Putin aggression” in a very different light, including the subsequent referendum in Crimea in which 96 percent of the voters favored seceding from Ukraine and rejoining Russia in spring 2014. \\nView from Crimea \\nWhen I visited the three Crimean cities of Simferopol, Yalta and Sevastopol, I had conversations with a cross-section of people, from cab drivers and bus riders to small business owners and participants in what is variously referred to by the locals as “The Crimean Spring” and “The Third Defense of Sevastopol.” I came away with three conclusions. \\n\\nThe first is that Crimeans, who are mostly ethnic Russians who speak Russian, were genuinely alarmed by the ultra-nationalist rhetoric and violence coming out of Kiev, which resulted in what they viewed as an illegal coup by extremist elements of the Maidan movement, supported by Washington. \\nAs Tatyana, a professional tour guide in Yalta told me: “No one asked us if we wanted to go along with Maidan. There are Russians as well as people who are a mix of Russian and Ukrainian here. We are not against Ukraine as many of us have relatives there, but Maidan was not simply a spontaneous protest. We are aware of the phone call with Victoria Nuland and Geoffrey Pyatt, we saw the photos of her with Yatsenyuk, Tiagnibok [leader of Svoboda, the neo-fascist group that was condemned by the E.U. in 2012], and Klitschko on television. We saw the images of her handing out cookies to the protesters.” \\nThese extremists had attacked ethnic Russians from Crimea who had participated in anti-Maidan protests and the attackers were reportedly on their way into the Crimean peninsula. As a result, Crimeans began to organize self-defense units to protect their communities. \\nSecondly, Crimeans did not necessarily think Russia would accept their requests for help. Crimea had been part of Russia from the time of Catherine the Great’s reign in the Eighteenth Century. But during the Soviet era, Premier Nikita Khrushchev gifted Crimea to Ukraine. \\nSince both Russia and Ukraine were part of the Soviet Union at the time, this was not a problem. However, when the Soviet Union dissolved in 1991, Crimea remained in Ukraine as an autonomous region, while the naval base at Sevastopol was retained by Russia via a lease with the Kiev government. Between 1991 and 2013, Crimeans had voted several times to be reunited with Russia, only to have their requests ignored. \\nPutin, as any Russian leader would have, viewed the events of February 2014 as a threat to Russia’s naval base and only warm water port. Knowing that the Crimean population had repeatedly expressed its desire to be part of Russia, Putin decided on an operation to assist the native Crimeans in blocking both marauding ultra-nationalists and representatives of the coup government from interfering in activities that would facilitate Crimea’s quick reintegration into Russia. \\nSupport for Reunification \\nCrimeans told me that they knew the so-called “little green men” were Russian soldiers legally stationed at the naval base who had donned unmarked uniforms. They also told me that they viewed them as protectors who allowed them to peacefully conduct their referendum, not as invaders. Suggestions that these Russian soldiers had pressured them to vote at gunpoint were dismissed as ridiculous. \\n\\nThird, Crimeans were very happy to be part of Russia. Though they acknowledged that there was still a lot of work to be done, they viewed the future with hope. Thesesentiments have been borne out in several Western opinion polls (Gallup, Pew, GfK, and Levada-Open Democracy) over the past two years. \\nWhen the topic of sanctions came up during a meeting with small business professionals in Simferopol, one of them stated, “We are suffering under the sanctions, but the sanctions will not make us go back to where we don’t want to be. There are still many Crimeans willing to fight if it were to become necessary.” \\nIn a similar vein, one participant in the self-defense forces of Sevastopol, Nicolai Kachin, told me: “Sevastopol was the first city to rise up in Crimea. If residents hadn’t stood up to defend themselves, war would be raging in Crimea worse than in the Donbass.” \\nThe Donbass is a region of southeastern Ukraine where Russian speakers had similar concerns. The West has typically characterized the Donbass rebels as puppets of Russia with no legitimate grievances or indigenous support. However, American Russia scholar Nicolai Petro, who spent a year in Ukraine and was in country when the upheaval occurred, has cited sociological surveys of Donbass residents from March, April and May of 2014 in which the results show that majorities considered the Right Sector to be dangerous and influential and the Maidan protests to be illegal and representing “an armed overthrow of the government, organized by the opposition, with the assistance of the West.” \\nKiev’s subsequent decision to start an “anti-terrorist operation” against the Donbass region, instead of negotiating a resolution, has only hardened the view of Crimeans that their reunification with Russia was correct and saved them from a similar fate. \\nAlternative Approaches \\nOne is left to wonder if this could have all been avoided if the West had engaged Russia in good faith on its proposal for a pan-western security architecture in 2008, instead of pushing what amounts to a very dangerous zero-sum game in Russia’s backyard. Attempts to press for the eventual inclusion of Ukraine (and Georgia) into NATO have been ongoing since at least the George W. Bush administration when Condoleezza Rice had a heated discussion with Putin about it during a meeting in 2006. \\n\\nWhen Rice tried to assert that each country had the right to decide for itself which alliances to join, Putin explained that Ukraine had many ethnic and political divisions and that such a move could create instability in the country. Polling had reflected that the majority of Ukrainians at the time did not favor joining NATO. This, of course, was in addition to the fact that having a hostile military alliance right on its Western border was understandably perceived as a national security threat to Russia. \\nThese points were reiterated in a conversation between Russian Foreign Minister Sergei Lavrov and then-Ambassador to Russia William Burns as reflected in a confidential cable to Washington from February 2008 titled “Nyet Means Nyet: Russia’s NATO Enlargement Red Lines.” \\nIn the cable, Burns states that Russia warned that pushing Ukraine into NATO could provoke a civil war and that Russia would consequently have to decide whether to intervene or not – a decision Lavrov emphasized Russia did not want to be faced with. \\nAt a minimum, Washington needs to recognize what America’s preeminent Russia expert, Stephen F. Cohen, has noted. That is that we need a pragmatic partnership with Russia if we are to have any hope of addressing the most pressing challenges facing humanity: nuclear disarmament, catastrophic climate change, terrorism and global inequalities that have become destabilizing. \\nIf one studies Putin’s speeches, along with major interviews, which are available in good English translations on the Kremlin website, one can deduce that Putin is an intelligent and rational actor who could be a partner to Washington in areas of mutual interest – as he has indeed demonstrated with respect to eliminating the Syrian government’s chemical weapons and assisting in the Iran nuclear deal. \\nPutin has been clear and consistent for years that he requires Russia’s interests to be taken into account, including its security. And this is as it should be. He was elected to represent and pursue Russia’s interests, not to serve Washington if he gets nothing in return. Unfortunately, Western corporate media routinely quotes Putin out of context or pretends that it is impossible to understand him because of their cartoonish characterization of him as a “thug.” \\nChallenges for Russia \\nCorruption \\nCorruption has been an intractable problem for centuries in Russia since the administrative state and its attendant tribute paying and harsh bureaucracy were established by the Mongols in the Thirteen Century. \\n\\nIndeed, it is one of the major issues Putin has publicly admitted he has failed so far to adequately resolve. Although there has been some progress as is reflected in Russia’s rapid rise in the World Bank’s Ease of Doing Business scores and the Coopers Waterhouse findings for 2016 that Russia has reduced economic crime by 12 percent in the last two years, it is recognized by both Putin and the Russian public that substantially more needs to be done. \\nPolitical and Civil Rights \\nRussians can travel freely as long as they can afford it. Orthodox Christians, Muslims, Jews and Buddhists are generally free to worship as they please. There is little overt censorship and all the Russians I spoke to said they had access to Western media through both satellite and the Internet, although they all found it to be very distorted and inaccurate in its portrayal of their country and their leader. There is a variety of opinion represented in print media, and even on pro-government Russian TV it is not unusual for a pro-Western viewpoint to be included on political talk shows. \\nThere is still considerable room for improvement for journalists in Russia. However, according to the Committee to Protect Journalists, deaths of journalists have actually gone down in the Putin era of governance compared to the Yeltsin era. One would be hard-pressed to know that judging by the way Western politicians and media have undertaken an over-the-top vilification campaign against Putin but gushed that Yeltsin was a “democrat.” \\nAs for the fate of Anna Politkovskaya, the idea that Putin was behind her murder has been promiscuously bandied about in the West, but no evidence has ever been presented. Moreover, her employers at Novaya Gazeta believe the Chechen leadership was behind her death, not the Russian government. Those who carried out the murder have been convicted in Russian court and are now in prison, but it is troubling that whoever ordered it remains at large. \\nCivil society development has had a setback with the foreign agents law. While some civil society activists whom I spoke to acknowledged that Western provocateurs were a problem, there were many authentic NGO’s that were being caught in the dragnet and the law is consequently viewed among them as a mistake that needs to be rectified. The Russian population in general is divided on this legislation. In response to some of the criticism, in May of this year, the Duma amended the law to exclude charities and cultural organizations. \\nThere have still been some openings for modest civil society development. For example, an independent organization of citizens called the Public Council has developed since 2014 in the city of Krasnodar. It has successfully worked to get the local authorities to start taking the needs and desires of citizens into account when making decisions and enacting policies. \\nAmong other things, they have stopped the destruction of old trees, buildings and parks as well as networked with youth groups and infrastructure specialists, including foreign experts in urban planning, public arts, transportation and city marketing. They have organized periodic cleanup and renovation days sponsored by local businesses that donate equipment, and are working to connect the city’s hiking trails and protect its 16 lakes. \\nNot only have they received no opposition from Russian authorities, they have begun to gain positive recognition as well as interest from other Russian cities looking to replicate their model. \\nAnother example is a civic education program to teach democracy skills to Russians designed by an independent American named Charles Heberle. The program has been under implementation in a province near St. Petersburg and has had the quiet backing of the Putin government since the early 2000’s. \\nAs the French and Germans wisely recognized at the end of the Cold War, it would serve the goal of encouraging Russia’s evolution toward more openness and democracy if their deep and historical fears of hostility, invasion and exploitation are not provoked. If given the time and space, without U.S. meddling, Russia will address its own internal problems and evolve into a system that will reflect its unique geography, culture and political history.  '"}, "time": 1742564142.4205656}