{"duration": 0.08356809616088867, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Donald Trump met with Mexico’s  president, Enrique Peña Nieto, declaring him “a friend” and praising   as “beyond reproach” in a showstopper of a trip to Mexico City. Mr. Trump said that he and Mr. Peña Nieto of Mexico discussed a border wall when they met, but not who would pay. But Mr. Peña Nieto said on Twitter later that, “I made it clear that Mexico will not pay for the wall. ” Many Mexicans expressed anger over the meeting. Mr. Trump’s campaign officials said his speech on immigration this evening in Phoenix would clarify his immigration policies. _____ 2. Hillary Clinton took a swipe at Mr. Trump, saying in a speech at the American Legion’s national convention, “It certainly takes more than trying to make up for a year of insults and insinuations by dropping in on our neighbors for a few hours and then flying home again. ” She also countered his “American first” approach, stressing the country’s “unique and unparalleled ability to be a force for peace and progress, a champion for freedom and opportunity. ” _____ 3. In other political news, Harry Reid, the    Senate minority leader, offered fellow Democrats a possible recourse if they win the White House and Senate this fall only to find the Republicans thwarting them. It’s a drastic move: curtailing the filibuster, the minority party’s   tool. “What choice would Democrats have?” he said. “The country can’t be run this way, where nothing gets done. ” _____ 4. Geologists say these fossils, found in Greenland, are 3. 7 billion years old. If so, they are by far the oldest direct evidence of microbial activity ever found, challenging the time frame of evolution and theories of the origins of life. The finding “will be hotly debated,” an Earth scientist at M. I. T. said. _____ 5. Brazil’s Senate removed President Dilma Rousseff from office for manipulating the federal budget to try to hide the country’s mounting economic problems. The move upended her leftist Workers’ Party, one of South America’s most powerful political organizations, but leaves Brazil under the rule of the equally tainted Brazilian Democratic Movement Party. _____ 6. A Times review of WikiLeaks’ activities during the four years its founder, Julian Assange, has been holed up in the Ecuadorean Embassy in London shows that the group’s document releases have often benefited Russia, frequently at the expense of the West. In an interview, Mr. Assange called Russia a “bit player on the world stage” and said that scrutinizing superpowers like the United States was more relevant. _____ 7. Being famous for being famous, à la the Kardashians, appears to be a thing of the past. Instagram, YouTube and gossip sites and podcasts, and now legacy media companies, are feeding on a new celebrity underclass, people who hover on the edges of fame. “It’s easy to hate us, actually, because we are not doing something, we’re not really doing anything,” said the girl above, the de facto leader of the “Gucci Gang,” four stylish      Parisians making their name on Instagram. _____ 8. A JetBlue plane from Fort Lauderdale, Fla. landed in Santa Clara, Cuba, the first scheduled U. S. service to the island nation in more than 50 years. It was the latest step toward normalizing relations between two former Cold War foes. “To the people who say these flights don’t help: Yes, it does help,” said a teary   passenger. “It opens Cuba to the world. ” _____ 9. A   teacher in Denver got more insight than she bargained for when she asked her students to finish the sentence, “I wish my teacher knew. .. ” Some answers, recounted in a new book that has inspired many teachers to try the same approach: “that my mom might get diagnosed with cancer this week and I’ve been without a home 3 different times this year alone” “how much I miss my dad because he got deported to Mexico” “that my family and I live in a shelter. ” _____ 10. Beet and carrot juice pulp,   meat substitutes, grains, lentils, beans potato starch   …     Chefs around the country are reaching for new combinations to create veggie burgers that can take a place of honor on even the most ambitious menus. “We’re trying to use everything in our arsenal to make this mix that’s superdelicious,” said Brooks Headley of New York’s acclaimed Superiority Burger. _____ 11. Finally, one of our   articles today is a lyrical meditation on domesticity by a novelist who carefully renovated her family’s apartment and then, for a while, flinched over every scratch and spill. She takes a lesson from a friend’s chaotic, boisterous household, in which rooms might be neglected but people aren’t, and happiness is “the easiest of all things to find. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742564267.888768}