{"duration": 0.1106414794921875, "input_args": {"text": "'The principal of a Christian school in Hagerstown, Maryland says that after “countless hours in prayer and discussion,” his board’s decision to bar a pregnant teen from walking at her graduation ceremony is holding her “accountable for her immorality” and is “the best way to love her. ”[The case of Maddi Runkles, an 18   senior at Heritage Academy, has taken the nation by storm over the past week. Runkles was interviewed Wednesday on CBS This Morning, and her story has been featured at media outlets such as the New York Times, the New York Post, and Cosmopolitan.  The school’s principal, David Hobbs, released a statement regarding the situation of the teen, who has a 4. 0 gradepoit average and was president of the Student Council when she discovered she was pregnant in January. “Maddi is being disciplined, not because she’s pregnant, but because she was immoral,” Hobbs said in a statement posted on the school’s website, explaining that students at the school sign a   pledge that states they will protect their bodies “by abstaining from sexual immorality and from the use of alcohol, tobacco, and illegal drugs. ” “Heritage is also pleased that she has chosen to not abort her son,” he continued. “However, her immorality is the original choice she made that began this situation. ” In an interview with Breitbart News, Runkles said that while other students at Heritage Academy have broken some of the other rules of the pledge, “They’ve never suffered a punishment as severe as mine. ” Hobbs, she said, initially decided he would tell the entire school that she had broken the rule about   sex. She was also stripped of her leadership positions and informed she would not be permitted to complete her senior year at school, but would finish her classes at home. Runkles said she decided, however, that she wanted to publicly confess to the school herself about her pregnancy. She made her confession with her father at her side. “I decided I wanted to confess what I did and ask for forgiveness from my school,” she continued, “but the other kids who had broken other rules  —   even when they were caught  —   they still lied about what they had done. It just seems unfair. I tried to make it right, but was still shot down. ” Subsequently, Runkles’ parents and about 25 classmates and other parents appealed to Hobbs, asking that she be permitted to remain in school and graduate with her classmates. Ultimately  —   after several days of suspension  —   she was told she could return to school to complete her classes, but would still be prohibited from graduating with her class. “A wise man told me that discipline is not the absence of love, but the application of love,” Hobbs says in his statement. “We love Maddi Runkles. The best way to love her right now is to hold her accountable for her immorality that began this situation. ” Runkles’s situation was brought to light by   organization Students for Life of America (SFLA) which asserts the teen is being unfairly punished, since she already admitted her mistake, confessed it before the school, and accepted relinquishing her leadership roles. SFLA says Christians who claim to be   should offer support to a teen who admits her error and accepts the consequences of going through with her pregnancy instead of having an abortion. “Disciplining Maddi is not the issue,” states SFLA president Kristan Hawkins. “Her discipline was decided, communicated, and executed. For the most part, this was done so with care for the family’s privacy and with fair response to the pledge broken (i. e. ‘abstaining from sexual immorality and from the use of alcohol, tobacco, and illegal drugs’). ” Hawkins continues: However, my primary and continued complaint is that the disciplinary actions of the administration has extended far beyond accountability for the broken pledge regarding premarital sex. That accountability was served justly and humbly in Maddi’s confession, her suspension, and her removal from leadership positions. What was initially a punitive and learning moment has transformed into a public lesson (before this even was announced to the media). By banning Maddi from walking at graduation, the administration and board collectively decided on a disciplinary measure of an obviously public nature. From what we’ve learned thus far, no other student in the school’s history has been banned from walking at graduation for failing to abstain “from sexual immorality and from the use of alcohol, tobacco, and illegal drugs. ” Maddi is the only student, past or present, banned from walking at graduation. In a class of only 15 students, her absence will be obvious and can only be explained in that her immorality is visible (unlike the errs of past and present students). In his statement, Hobbs does not address how the board handles the violations of other students, but states, “Each Heritage family deserves confidentiality. ” He indicates that the Runkles family chose “to make her behavior a public matter,” and that he would have preferred to handle Maddi’s “disciplinary situation” privately. Neither Heritage Academy nor Hobbs returned Breitbart News’s request for an interview or comment. Runkles’s story has launched a debate about how   Christian churches handle the situation of unplanned pregnancies among single women. A study posted in November of 2015 at   found that more than 40 percent of women who had an abortion regularly attended church. Vice president of LifeWay Research Scott McConnell said the results suggest a church culture that is lacking grace. Among those women who have had an abortion:   (65 percent) say church members judge single women who are pregnant. A majority (54 percent) thinks churches oversimplify decisions about pregnancy options. Fewer than half (41 percent) believe churches are prepared to help with decisions about unwanted pregnancies. “Women are perceiving judgment from the church, and that’s probably partly because there are clear teachings in the Bible including about how and why we make judgments,” McConnell said. “However, if they don’t start experiencing something different than what they’ve seen in the past, these numbers aren’t going to change. ” The Susan B. Anthony List (SBA List)  —   a national   organization  —   states Runkles’s decision to have her baby “deserves compassion and support. ” “The decision to choose life is not always easy, and certainly not always popular with a culture that promotes convenience over personal responsibility,” the group says. “Maddi made a courageous choice to love and protect her unborn son and she deserves compassion and support, especially from fellow Christians. ” “We urge Heritage Academy to reconsider their decision not to allow Maddi, a 4. 0 student, to walk with her peers at graduation,” SBA List continues. “This extended punishment  —   doled out months after Maddi told her school she was pregnant and asked for compassion  —   sends a terrible message about the Christian community’s response to teen pregnancy and unexpected pregnancy. ”'"}, "time": 1742562103.1155136}