{"duration": 0.07262396812438965, "input_args": {"text": "'MONTPELIER, Vt.  —   First came Colorado and Washington. Then Alaska, Oregon and Washington, D. C. Now advocates for legal marijuana are looking to New England, hoping this part of the country will open a new front in their efforts to expand legalization nationwide. But this largely liberal region is struggling with the devastating effect of opiate abuse, which is disrupting families, taxing law enforcement agencies and taking lives. And many lawmakers and public officials are balking at the idea of legalizing a banned substance, citing potential social costs. “The shadow of the heroin epidemic is something that people think about when they think about the legalization, and they ask themselves, ‘Are we sending the right message about legalization?’ ” said Shap Smith, the speaker of the House in Vermont, who is open to legalizing marijuana. “I think in the public’s mind, it’s making passage of this bill more difficult. ” A Vermont bill supported by Gov. Peter Shumlin, a Democrat, and approved by the State Senate in February would create a regulated market for recreational marijuana in this deeply progressive state  —   the cradle of Phish and New England’s proud hippie haven. But the bill is hobbling through the House, where it was stripped this month of the parts that would allow legalization. As of Friday, it contains only a cautious provision to allow   and legalized possession of small amounts of marijuana  —   well short of the regulated market that Mr. Shumlin has called for. Lawmakers’ largest concerns are those that have emerged in state after state as the legalization movement has taken off: use and abuse by young people, impaired driving and commercialization. But the opiate crisis, in which heroin, fentanyl and other drugs have killed more than 2, 000 people in New England in the last year, is a substantial stumbling block, complicating efforts throughout the region and figuring into   political alliances. “At a time when we are trying and working so desperately hard to get help to those who need it, telling young people to not do drugs, trying to eliminate some of the barriers to treatment and to promote recovery, this effort at legalization seems to be directly at odds with those efforts,” said Maura Healey, the attorney general in Massachusetts and a Democrat, who opposes an initiative that is expected to land on the ballot in November. It would allow adults to possess up to 10 ounces of marijuana at home, permit edibles and create a regulated market. Advocates are using the heroin crisis as an argument in favor of legalization, saying that it would move the substance out of the hands of traffickers and that it “would reduce the amount of interaction with hard drug dealers, period,” said Matt Simon, the New England political director of the Marijuana Policy Project, a national organization working on legalization. National advocates of legalization hope that with New England, they can find success in a new part of the country. “One part of it is demonstrating quite powerfully that marijuana reform is not just a West Coast phenomenon it’s also an East Coast one,” said Ethan Nadelmann, the executive director of the Drug Policy Alliance. But the future of the Vermont bill is unclear. A bid to place a proposal on the ballot in Massachusetts is opposed by the state’s most powerful politicians a ballot question in Maine was held up by the secretary of state (although it may have new life) and officials in Rhode Island are moving slowly, partly to see what happens with their fellow New Englanders. “I think if there was any motion in any state in the Northeast, Rhode Island would take it up very quickly,” said State Senator Joshua Miller, a sponsor of a bill there that would legalize marijuana. The heroin epidemic was at the center of debate in Massachusetts last week, when a coalition of state leaders  —   including Gov. Charlie Baker, a Republican, and Speaker Robert A. DeLeo of the House, a Democrat  —   announced a campaign against the initiative. An analysis last month by WBUR, a public radio station in Boston, noted that all 85   ballot questions in Massachusetts’s history had passed, and public opinion could well favor legalization this time around, too. But in a statement, Mr. Baker argued that legalization would “threaten to reverse progress combating the growing opioid epidemic so this industry can rake in millions in profits. ” The coalition also has the support of Mayor Martin J. Walsh of Boston, a recovering alcoholic who is widely admired for his outspokenness about substance abuse. “It’s definitely a personal issue,” Mr. Walsh said in an interview. “I have too many people that I know that started their addiction road by smoking marijuana. ” The Campaign to Regulate Marijuana Like Alcohol responded on Friday by highlighting Mr. Baker’s and Mr. Walsh’s support of policies that would loosen liquor regulations  —   although a graphic of the men with a speech bubble saying “Drink More Alcohol” was criticized as insensitive to Mr. Walsh. The groups said opponents of legalization were unfairly conflating heroin and marijuana. “There is no more evidence that using marijuana leads to heroin than there is that riding a tricycle leads to joining the Hells Angels,” Jim Borghesani, the campaign’s communications director, said in a statement. In states that have legalized marijuana, voters, not lawmakers, made the decision. That could become the case in Maine, which has a libertarian streak and began decriminalizing marijuana decades ago. A proposed ballot initiative there was halted when the secretary of state invalidated thousands of signatures, but it was recently granted a new review. If that initiative makes the ballot, “I think they’ve probably got a relatively good chance of passage,” said Mark Brewer, a political scientist at the University of Maine. Health officials in that state are considering whether to make opiate addiction a qualifying condition for the use of medical marijuana. On Tuesday, Maine’s Department of Health and Human Services heard testimony from advocates who said marijuana could help treat opiate withdrawal, and from experts who disagreed. Vermont does not have a referendum process, and that has made the state a test case for legislative approval. Mr. Shumlin, who is in his final term, said a carefully constructed bill legalizing marijuana could raise tax dollars that could be used to combat substance abuse and improve public safety. “If Vermont really is the first state that writes a cautious, sensible bill that’s adopted through a legislative process and signed by a governor, that would be a big deal,” Mr. Shumlin said in an interview. “It would be a big step forward for legalization. ” Many law enforcement officials are opposed. “All assets  —   whether it be rehabilitation, medical, law enforcement  —   we should be focusing our assets on opiate addiction,” said George Merkel, the police chief in Vergennes and the president of the Vermont Police Association. “That’s a reason not to legalize marijuana, because it’s going to make things even worse. ” The bill advanced on Friday by the House Ways and Means Committee in Vermont would create permits for residents to grow marijuana for personal use, but it would not legalize the sale of the drug. In a statement, Mr. Shumlin welcomed the development. “The committee’s action today takes a step towards addressing the nonsensical system that asks the one in eight Vermonters who admit to using marijuana on a monthly basis to buy it from a drug dealer,” he said.'"}, "time": 1742628449.1417048}