{"duration": 0.0348660945892334, "input_args": {"text": "'TV3 \\nDía extraordinario el de ayer en la parrilla televisiva. Por primera vez desde que hay registros, La 2 de Televisión Española consiguió ser la cadena más vista. Aprovechando el tirón de “Operación Triunfo: el Reencuentro”, emitió el documental de National Geographic titulado “La Cobra” . Gracias a esto, #ChenoaDiosa fue Trending Topic mundial. \\nTelecinco ocupó el segundo puesto en el ránking catódico con la emisión de un especial Sálvame Deluxe , donde Susana Díaz se sometía al polígrafo. El minuto de oro fue el momento en que la andaluza negó haber conspirado contra Pedro Sánchez y el polígrafo explotó. \\nEl estreno del nuevo reality de Cuatro alcanzó unas cifras aceptables, constatando que el mundo del sadomasoquismo está en auge. La cadena de Mediaset ya ha confirmado que habrá segunda temporada de Sadomaso busca esposas . \\nNo tuvo tanta suerte Antena 3, que también estrenaba un nuevo formato: Tu tara me suena . Diferentes famosos se caracterizan de gente con diferentes defectos físicos. La estrella de la noche fue Arévalo, que sacó del baúl de los recuerdos su fantástica interpretación de un gangoso. \\nLa Sexta vivió una de sus peores jornadas desde su nacimiento. Una afonía de Ferreras dejó en cuadros a la cadena, obligándola a suspender sus emisiones y a poner en bucle el mítico desmayo de Lopetegui. \\nLa cadena estatal menos vista ayer fue La 1 de Televisión Española. No logró convencer a la audiencia con su capítulo especial de El Ministerio del Tiempo . La trama situaba a los protagonistas en un pasado reciente, cuando Bárcenas entró de tesorero en el Partido Popular. Sin embargo, los discos duros donde se guardó el capítulo fueron formateados misteriosamente, precipitando el final del capítulo tan solo 15 minutos después de empezar. \\nEn clave autonómica, la catalana TV3 obtuvo un espectacular 93% de “share” con el programa “Tapetes de ganchillo para tu butaca” , evidenciando el considerable envejecimiento de su audiencia. \\nEn Euskadi, ETB tuvo unos resultados discretos con el documental “Searching for Pintxo Man” , la biografía de un vasco que, sin saberlo, es una celebridad en Sudáfrica gracias a sus pintxos de txistorra. \\nLa Televisión de Galicia pinchó con la final de su reality “Operación Munheira” . El público debía votar al mejor concursante del programa. Como siempre que se vota, ganó el PP.'"}, "time": 1742564487.8819532}