{"duration": 0.05921053886413574, "input_args": {"text": "'Sociedad Los coches que quieran circular por el centro de Madrid tendrán que ir en autobús \"SI QUIEREN IR EN COCHE, QUE VAYAN EN COCHE, PERO EL COCHE TENDRÁ QUE IR EN AUTOBÚS\", INSISTE MANUELA CARMENA transporte público \\nCoincidiendo con el fin del primer episodio de alta contaminación del otoño, el Ayuntamiento de Madrid ha presentado este miércoles el borrador de su Plan de Calidad del Aire y Cambio Climático. La propuesta más ambiciosa del plan es la de crear una gran Área de Prioridad Residencial (APR) que obligará a los coches que quieran circular por el centro de Madrid a hacerlo montados en autobuses públicos. \\n“Los ciudadanos que insisten en coger el coche pese a las recomendaciones oficiales tendrán que coger también el autobús. Irán en coche si es lo que quieren, pero el coche tendrá que usar el transporte público”, ha explicado hoy la alcaldesa de la capital, Manuela Carmena. \\nLas primeras pruebas han sido un poco caóticas, aunque el consistorio achaca las dificultades a la falta de costumbre. “¿Te puedes creer que había dos Smarts sentados al lado de la puerta del bus y han mirado hacia otro lado para no dejar que me sentara yo, que conduzco un Seiscientos viejo que apenas se tiene en pie?”, protestaba uno de los conductores, molesto por la falta de civismo de algunos ciudadanos. \\nOtros conductores se han negado a bajar el volúmen de la música, motivando las protestas del resto del pasaje. “Por culpa del hortera ese del BMW no se oía nada cuando se anunciaban las paradas. Suerte que se ha bajado enseguida”, relata otro viajero, que se queja también de que muchos “ponen las ruedas encima de los asientos, sin reparo alguno”. \\nEl Ayuntamiento recuerda que las normas de uso del transporte público valen también para los coches que vayan en autobús. “No pueden solicitar la rampa de minusválidos a no ser que el conductor sea minusválido y las conductoras embarazadas tienen prioridad al sentar sus coches, pero no sobre las peatonas embarazadas, que ni siquiera tienen el asiento del coche para sentarse”, aclaraba Carmena esta mañana.'"}, "time": 1742562767.4519804}