{"duration": 0.05529499053955078, "input_args": {"text": "'#PodestaEmails20: WikiLeaks releases another batch from Clinton campaign chair #PodestaEmails20: WikiLeaks releases another batch from Clinton campaign chair By 0 47 \\nWikiLeaks has released a 20th batch of emails from the account of John Podesta, Hillary Clinton’s campaign chair. \\nThe whistleblowing site has promised to release 50,000 messages from Podesta in the lead up to the US presidential election on November 8. A total of 34,197 communications have been released to date. \\nREAD MORE: ‘There’s no good answer’: Podesta leaks show Clinton campaign stumped by email server debacle Preparing for Bill \\nBill Clinton’s controversial past was evidently of concern to his wife’s campaign team, which discussed how to handle questions on allegations of sexual assault against him. \\nPreparation for what the media might throw at her included the questions: “Will you apologize to the women who were wrongly smeared by your husband and his allies?” and “How is what Bill Clinton did different from what Bill Cosby did?” \\nThe mail was sent by Ron Klain, a member of Clinton’s debate preparation team, on January 12, 2016. Several days previous Paula Jones, one of Bill Clinton’s accusers, gave an interview calling Hillary Clinton a “liar” and “two-faced” for trying to discredit her husband’s accusers. Let’s hope the Democratic party is not suicidal \\nA July 2015 email from Clinton adviser Neera Tanden to Podesta discusses a CNN poll which she guesses will show, “Bernie doing pretty well w Hillary and doing as well against Jeb or close to it.” \\n“Can you imagine what Republicans would do with him if he were the nominee?” Podesta replies, referring to Sanders. \\n“Well, let’s see what the poll actually says. Let’s hope the Democratic party is not suicidal,” Tanden says. \\n“Do we actually know who told Hillary she could use a private email?” she asks. “And has that person been drawn and quartered?” \\n“Like whole thing is f*cking insane,” she adds. Extraterrestrial disclosure \\nFormer astronaut Edgar Mitchell, known for his correspondence with Podesta regarding extraterrestrials, emails Podesta regarding the “Phoenix Lights” incident in 1997, in which thousands of people reported sightings of hovering lights in the sky. \\nMitchell “was on the phone just as they were happening over Phoenix with an eyewitness describing on March 13, 1997. This incentives about disclosure, while other reports like Roswell disincentives,” according to the mail from April 2015. \\nThe subject of extraterrestrial disclosure is “now more important than ever” according to another mail sent on Mitchell’s behalf a month later. \\n“It is also imperative that after your talk with Edgar, he then speak directly with President Obama via Skype for historical purposes, about the same issue, while the President is still in office,” Podesta is told. \\nThe subject of the meeting is described as “the difference between our contiguous universe nonviolent ETI and the celestials in our own universe.” \\nDETAILS TO FOLLOW.'"}, "time": 1742561957.6177728}