{"duration": 0.08470463752746582, "input_args": {"text": "\"Hillary Clinton and the President’s ' Longer Game .' At home and abroad, a nation less affluent, less free, and far less secure. October 31, 2016 Lloyd Billingsley \\nThe President of the United States, the most powerful man in the world, used a pseudonym to communicate with Secretary of State Hillary Clinton on her private, unsecured email server. As Andrew McCarthy contended , that was the reason the FBI declined to prosecute Clinton, because the president would have been part of the same action, and that wouldn’t be politically correct. \\nThe current president of the United States is also on record that, contrary to custom, he will linger in Washington DC for a few years. Wherever he chooses to live, the email intrigue suggests continuing back-channel communications with Hillary Clinton, should she become president. That invites a look at what the man the New York Times dubbed “Obama’s narrator,” the White House adviser who sat closest to the president and signed off on his every word, had to say about the president’s vision of the future. \\n“Few of the decisions he had made would satisfy the politics of the moment,” David Axelrod explained in his massive 2015 Believer . “But at home and abroad, Obama was playing a longer game.” As he explained in Columbia, Missouri, on October 30, 2008, “We are five days away from fundamentally transforming the United States of America.” \\nIf this man was a liberal, as Barry Rubin wondered in Silent Revolution: How the Left Rose to Political Power and Cultural Dominance , why did he see a need fundamentally to transform a nation shaped by liberals such as Franklin Roosevelt with his New Deal and Lyndon Johnson with his Great Society? He saw the need because he was not a liberal but a lifelong leftist radical. \\nAs David Horowitz explained in Volume 7 of the Black Book of the American Left , the president was “born, bred and trained in the progressive movement.” His mentors were “Communists and their progressive successors,” so no wonder he presided over “the institutionalizing of the policies of the left in government” for eight years. What that means in practical terms is becoming painfully evident. \\nThe economy remains sluggish and under Obamacare, the president’s signature plan, premiums are skyrocketing . This suggests that, as many believe, Obamacare was simply a demolition plan. In the “longer game,” designated successor Hillary Clinton will impose government monopoly healthcare, what some candidates erroneously call “socialized medicine.” \\nAs Rubin noted, the goal of the left is “to convince Americans the exact opposite of what their experience proved: that the country had fundamentally failed and the old leftist solutions were the answer.” The result “may be a very long-term and even permanent change of the United States into something else, a nation far less affluent and far less free.” And far less secure, as David Axelrod also indicates. \\nVladimir Putin makes an appearance in Believer but Obama’s narrator does not outline Putin’s background in the KGB. The believer includes nothing about Putin’s role in East Germany, a Stalinist police state that walled in its subjects and shot those attempting to escape. The narrator avoids Putin’s belief that the breakup of the Soviet Union was “the greatest geopolitical catastrophe of the century.” \\nIn Believer , Putin tells the president, “You are a highly educated man. I come from the security sector.” The believer then asks the president for his assessment of Putin. \\n“He’s smart, tough, clear about his interests and without a trace of sentimentality,” the president says. That is not very strong language for a KGB veteran and expansionist autocrat. \\nIn his narrator’s account, the president uses the word “motherf\""}, "time": 1742562834.9900908}