{"duration": 0.09256768226623535, "input_args": {"text": "'representing the most choice or select; best: an elite group of authors. \\nThe first definition found at the embedded link states that: ‘the choice or best of anything considered collectively, as of a group or class of persons’. \\nWhat is ‘the choice or best of’ referring to in the context of humanity? In our current age of information and consciousness expansion, we’ve reached a beautiful balance where we know both scientifically and philosophically that we are all an individual expression of the one thing. This means that no one is inherently ‘better’ than anyone else, however it is also true that we are all developed in different ways and to various degrees. \\nTherefore, even though no one is fundamentally better than anyone else, we may be more advanced than another person in specific ways, such as compassion, but they might for example be more refined in communication than we are. \\nThis is where the authentic person comes in. If we aim to connect with both our strengths and weaknesses, and are ‘real’ to ourselves in response, we are a genuine person who recognizes that we are not better than others, we are simply on our own journey of empowerment and awakening, just like everyone else is. \\nSimply, the ‘best of’ humanity are those individuals who not just face themselves for who they really are, but create with it too, instead of looking down on others for whatever reason they feel justified to make themselves feel better about themselves. \\nThe result? Unity and community, not disconnection and degradation. \\nThe second definition is ‘persons of the highest class’. \\nNow of course class is not referring to material wealth, for as we all should know by now the monetary system is a scam, people consistently inherit blood money and there are many sickos who hoard wealth and use it to obtain power and resources in unhealthy and undeveloped ways. \\nTherefore, class in this context should refer to the definition ‘of high quality, integrity, status, or style’. When we consider high quality human traits, this translates into a person or group of persons who don’t just apply respect and honor towards themselves, but also their fellow-man and the environment they live in. \\nAnd that obviously reflects the authentic person. \\nThe third and final definition which is relevant to this discussion is ‘a group of persons exercising the major share of authority or influence within a larger group’. \\nThis one can be better understood by beginning with the concept that real power isn’t power over others, it’s self-empowerment. Simply, real authority is honoring our self-determining power, which then transforms into respecting it in others. \\nIn addition, most people in the truth movement understand that law does not necessarily equal ethics, which means that anybody who makes or enforces law is not guaranteed automatic respect, like they somewhat used to be. That’s not to say they don’t deserve respect, because many who work for our sick system are just ignorant to what they truly stand for and are doing their best with the understanding they have to provide a genuine community service. \\nRegardless, the so-called authority in our society is not really authority at all. \\nUltimately, those individuals who are authentically connecting with and representing the expansion of our collective consciousness are the real power brokers, the real influence, in our society. This elite level of authority may be subtle, instead of explicit, but make no mistake: it is the most powerful and influential form of authority in our current age. Final Thoughts \\nHumanity is moving towards an unprecedented stage of it’s collective consciousness, where truth and individual sovereignty will inevitably reign supreme. This expansion has not just been decades, but centuries in the making. \\nGiven the opposite is also true, where a new dark age of deception is upon us, it takes a highly empowered individual to rise above the lies of the official narratives to genuinely connect with not just the greater truths of the external world, but the internal realm too. \\nThese individuals are the genuine group of elite humans who we should all look to for not leadership, but guidance in becoming our own more authentic self. \\nMoreover, no one is fully awake to the realities and ongoing creation of our world. The authentic man or woman may be an example for us to aspire to, but no one is or ever will be without an opportunity to further enrich their state of awareness, including how it’s translated into their actions. \\nIn this sense, we’re all the same. We’re all imperfectly perfect. About the Author \\nPhillip J. Watt lives in Australia. His written work deals with topics from ideology to society, as well as self-development. Follow him on Facebook or visit his website . This article ( The Real ‘Elite’ are the Authentic Men and Women   by Phillip J. Watt and is re-posted here with permission.  '"}, "time": 1742561950.7257097}