{"duration": 0.14269042015075684, "input_args": {"text": "'Street scene near Temple University, 2016(image by Linh Dinh) License DMCA Over three days last week, at least 150 blacks attacked whites at random around Temple University. Victims were surrounded, punched and kicked. Wallets and phones were stolen. Rocks were thrown at passing cars. When cops showed up, one was knocked from her bike and a police horse was even punched twice in the muzzle. Most of the assaults took place on Friday. On Saturday, Joe Lauletta, a father of one victim, reported on FaceBook : I spent last night in the ER at St. Mary\\'s HospitaI. I received a call from my daughter Christina after my sons football game. She was crying, I couldn\\'t understand her, my heart dropped, I became scared, I said what is the matter? Dad, I was jumped, I\\'m beat up pretty bad. Where r u? Temple, they stole my phone. We\\'re heading to the police station. I do not hear from her until she gets to her apartment. Rage is running through my mind the whole time. She said she is getting a ride home and wants to go to St. Mary\\'s. I find out that her and her 2 male friends where badly beaten by a group of 30-40 black teenagers on their way home from the Temple football game. This happened after they got off the subway at Broad and Cecil B Moore. These sick animals held her down and kicked and stomped on her repeatedly. Thank god, the people from the pizza place intervened. They arrested 2 people at the scene. I have not let Christina out of my sight, she is resting. Every part of her body is badly bruised, it makes me cry just thinking about it. No broken bones. If you have children at Temple, tell them to be careful. Please keep Christina Lauletta in your thoughts. CBS Philadelphia describes another victim\\'s ordeal: He says around 9:30 Friday night he was leaving work when he saw what looked to be at least 200 juveniles walking in large groups. He said he overheard police saying the kids were playing the knockout game. He says a juvenile around 10 years old started shouting obscenities at him and grabbed his phone out of his hand. The student says the juvenile then came back and threw the phone at him, striking him in the face. - Advertisement - Around 15 minutes later, the student says he was walking with his girlfriend when they were approached by at least seven juveniles. The student says he went to hit the Temple Police alert button when his girlfriend was struck by one of the juveniles. As the student was chasing them away, he says he was struck in the face by a someone he estimates to be eight years old. This is not new. In 2014, five black girls, aged 17, 15, 15, 15 and 14, committed three separate attacks on random white people at Temple University. Struck across the face with a brick, a 19-year-old white student suffered a fractured jaw and nearly had her teeth knocked out. Her 15-year-old assailant, Zaria Estes , was given a 2 -6 year sentence. Across America, gangs of blacks have beaten random people for decades, just for the sport of it. This cathartic recreation has been dubbed wilding, catch and wreck , knock out game or flash mob, and it can happen at parks, shopping malls, state fairs or even your living room. In 2012, a mentally-handicapped woman was relaxing on her stoop in Chester, just outside Philadelphia, when she was attacked by six black teenaged girls. When the terrified woman tried to flee inside, they rushed into her living room to continue the savage beating . Had these girls not posted their exhilarating workout on FaceBook, they might never have been caught. - Advertisement - A white bartender at my neighborhood dive was attacked, just outside her front door, by a group of black kids around 12 years old. After throwing a rock at her head and knocking her down, they kicked her a few times as she curled up on the ground, then they scattered. \"Just like that, it was over. All I could do was go inside and cry.\" Not surprisingly, the latest incident at Temple University has received scant media attention. Though AP did cover it, it never pointed out that these were racial crimes. As usual, only \"teens\" are fingered, with their race not mentioned. Had mobs of whites attacked random blacks, the entire world would have known about it by now. Locally, a black writer editorializes in the Philadelphia Inquirer that gentrification is ultimately responsible. In \"Behind Temple attacks, rage often comes with exclusion,\" Solomon Jones explains : In a city where poverty is concentrated outside the universities, we can\\'t truly expect the poor to watch jobs and wealth and excess pass them by without any reaction at all.'"}, "time": 1742562244.2270882}