{"duration": 0.1400916576385498, "input_args": {"text": "'A new year brings new movies, of course, but their promotion has already begun. With a full slate of films headed to the big screen in the next few months, here’s a look at notable trailers. Feb. 10 THE MOVIE In the sequel to the   smash “Fifty Shades of Grey,” Anastasia Steele (Dakota Johnson) and Christian Grey (Jamie Dornan) try to reconnect after she left him when his    tastes proved too extreme for her. WHY THE TRAILER IS INTRIGUING Well, it’s at least one shade darker. Ana seems to have a stalker. Or maybe she’s a hallucination? This woman appears a few times, creepily hovering like the girl from “The Ring,” but that’s all we get. Her presence is never explained, even though it’s one of the few things that suggest this film is different from the last one. Otherwise, “Fifty Shades Darker” seems to take everything people liked and loathed about “Fifty Shades of Grey” and double it. Meaningful glances are everywhere. Some scenes in the trailer are a little more suggestive, though there might be a public indecency law broken in one of them. Even the wooden dialogue is back. (Although perhaps more   the first line of the trailer, “I want you back,” feels like a plea from the producers.) Even the music is the same. The trailer for “Fifty Shades of Grey” was set to a slower, spookier remix of Beyoncé’s “Crazy in Love. ” Not to be outdone, this trailer brings in the RB star Miguel for a breathy, hauntingly sexy cover that’s just distinct enough to merit notice. And hey, why not? The music worked last time.  March 3 THE MOVIE After playing Wolverine for close to two decades, Hugh Jackman is set to hang up his adamantium claws in the latest chapter of the   saga, which takes its name from the character’s civilian identity. WHY THE TRAILER IS INTRIGUING The previews for   movies tend to draw on the familiar: iconic costumes and spectacular C. G. I. set pieces while   superheroes. Innocent bystanders are in peril. Something explodes. Not the trailer for “Logan,” released in October, which sweeps all mentions of   or Wolverine under the rug. Instead, it suggests a   western. Johnny Cash’s cover of “Hurt,” a song about pain, provides the through line, connecting all the shots of a weary, older Mr. Jackman. The   Logan is shown alone, backed by dusty deserts and rusting equipment. He’s battered, bloodied and wizened. It’s Wolverine, by way of Clint Eastwood. The trailer positions Logan as a Wild West outlaw, making a break from the superhero genre. When antagonists appear, they arrive in a caravan of police cars. One character even wears a cowboy hat and poncho. So by the time Logan finally unsheathes his claws, toward the trailer’s end, it’s a jarring tonal break from what seems like a quieter, smaller film. April 28 THE MOVIE Based on Dave Eggers’s novel, “The Circle” follows Mae (Emma Watson) an eager   with a job at the Circle, a Silicon Valley tech behemoth that Mr. Eggers has said is definitely not Google, Apple or Facebook. WHY THE TRAILER IS INTRIGUING It totally makes the movie seem like it’s about Google, Apple or Facebook, at a moment when that couldn’t be more relevant. The film’s first trailer, released in early December, opens with Mae describing the Circle as “the chaos of the web made elegant. ” In the midst of the postelection   over social media and fake news, that characterization certainly stands out. After that, Mae attends a keynote address delivered by a Circle leader, played by Tom Hanks, who stands in front of the company logo and wears a dark sweater that looks like the love child of Mark Zuckerberg’s hoodies and Steve Jobs’s classic turtlenecks. He speaks about the power of technology, luring us in with his “America’s Dad” voice, while Mae and her colleagues attend meetings and take selfies. “Sharing is caring,” they chant emphatically. It’s a sharp contrast from a   discussion about whether that’s actually true. (Oh, hey, don’t forget to share this column on Facebook!) The dark turn is inevitable, even without our current conversation about technology in 2016. So the trailer adds to the drama with a   and   cover of the Hall  Oates song “Private Eyes. ” A voice chants over piano, “They’re watching you,” drawing audiences further in with a foreboding warning about both the story onscreen and what might be happening off. May 12 THE MOVIE Amy Schumer and Goldie Hawn are a   pair who go on vacation in South America and get, uh, snatched. It’s Ms. Schumer’s   to her successful 2015   “Trainwreck,” and Ms. Hawn’s first film appearance in 15 years. WHY THE TRAILER IS INTRIGUING Comedy trailers can be a tough sell. They have to keep us laughing for two minutes while promising there’s enough to keep us laughing for two hours. That requires shoehorning exposition and plot into a tight comedic structure without shortchanging the humor. The “Snatched” trailer, released in December, finds the right balance. It’s certainly  . From the start, it establishes Ms. Schumer’s character in an embarrassing breakup scene that brings her comedy chops to the forefront. Then it zips along to her mother’s home, where Ms. Hawn awkwardly comforts Ms. Schumer with a hug that immediately establishes the uneasiness in their relationship. The trailer ushers them to South America with a quick conversation that further explains who they are: a young woman trying to find herself and a mother mired in routine. As the trailer introduces more plot elements  —   a man, the titular snatching, the escape  —   it keeps the jokes coming with a remarkable narrative economy. Plus, it gives equal time to Ms. Schumer and Ms. Hawn, suggesting both women will be making memorable returns to the big screen.'"}, "time": 1742563606.6175103}