{"duration": 0.0723717212677002, "input_args": {"text": "'Far too often, artificial sweeteners replace one addictive substance with another. Recently, The Pepsi Corporation announced that it is pledging to cut sugar from its products, raising the percentage of its single-serving beverages with 100 or fewer calories to 66 percent by 2025. Currently, that percentage is less than 40.\\nHow are they planning to do this while still manufacturing and marketing a profitable addictive drink? Artificial sweeteners. Last year, responding to changing tastes, Pepsi pledged to reduce the number of their products with the artificial sweetener Aspartame in them. However, in September they actually re-introduced Aspartame into several products. Because the market craves that sweet taste and so long as that is the case profitable flavor companies will figure out how to meet that demand.\\nThe huge problem for people trying to lose weight is that artificial sweeteners undermine that goal. I find they are more dangerous than sugary drinks because it is easy for people to think they are getting a freebie—something sweet that will not impact their weight. How many chronically overweight people do you know who live on diet beverages?\\nWhat is happening? …Well, a few things.\\nFirst, when the sweet taste hits the tongue the body cues up the insulin response system, same as for sugar. Only, within minutes, the body is flooded with insulin, but there are no calories for that insulin to process. This breaks the body’s feedback mechanism and contributes to insulin resistance and Type-II diabetes.\\nThe added danger of anything that elevates the body’s insulin level is that we now know insulin blocks the hormone leptin in the brain. Leptin is critical for weight loss. It is the hormone that signals the body that it is full and needs to get moving. When leptin is blocked, the body feels relentlessly hungry and lethargic—and there is no amount of caffeinated diet cola that will fix that. Artificial sweeteners also put the body through the same high and insulin crash, making the body crave more sugar or caffeine to wake back up. Anything that sets you up to leave you feeling wanting is ultimately going to sabotage your weight goals.\\nSecond, drinking artificial sweeteners keeps cravings alive. Cravings are a function of a brain that has been overstimulated by sugar to the point that it has taken some pleasure receptors offline to cope. This is a neurological process called downregulation and you only have to eat the average amount of sugar Americans consume, 22 teaspoons daily, for three weeks for it to happen. The remaining receptors in the brain’s nucleus accumbens then demand more sugar just to stimulate them back to baseline functioning and now you have a sugar addiction. Artificial sweeteners do not heal that cycle. The sweet flavor jacks the brain the same way and triggers the same neurological response: MORE. The brain demands more.\\nTherefore, the final result of eating artificial sweeteners should come as no surprise. Studies show that people who eat artificial sweeteners will eat more sugar later when it is offered, AND more total calories. Which makes sense. The body received a message that calories were coming, but none came. The next time calories are on offer the body is going to consume as many possible—and try to hold onto them. Because it is now nervous about your food source.\\nRemember, we may live in a land of plenty, but for the majority of our species’ existence food was scarce. Our bodies operate from that place. In addition, when leptin is blocked by elevated insulin we are primed to be looking to consume calories anyway.\\nUltimately, I do not advocate the consumption of artificially sweetened beverages for my Bright Line Eating boot camp members because they keep the brain oriented around and expecting that fix. In order for the brain to heal from sugar addiction, the cycle has to be broken.\\nThe good news is if allowed to heal, receptors do replenish. Cravings diminish. Baseline insulin levels drop, and leptin gets back on board to make us feel full and eager to be active.\\nI try to encourage people to think of Aspartame, NutraSweet, and Saccharine, not as free treats, but as methadone. They are simply an additive substitute that fully keeps the addiction alive and prevents you from living how I want all of my Bright Line Eaters to live—Happy, Thin and, most of all, Free.\\nWritten by Susan Peirce Thompson, Ph.D.\\n(Edited by Cherese Jackson)\\nSources:\\nBright Line Eating: The Science of Living Happy, Thin and Free\\nFortune: PepsiCo Sets a Global Target to Reduce Sugar in Its Soft Drinks\\nSusan Peirce Thompson, Ph.D. is a psychology professor, a brain and cognitive scientist, and an expert in the psychology of eating. She is President of the Institute for Sustainable Weight Loss and CEO of Bright Line Eating Solutions, a company dedicated to sharing the psychology and neurology of sustainable weight loss and helping people achieve it. Bright Line Eating: The Science of Living Happy, Thin and Free (Hay House, March 2017).\\nPhoto Credits:\\nTop Image Courtesy of Susan Peirce Thompson\\nFeatured Image Courtesy of Mike Mozart – Flickr License artificial sweetner , Pepsi , sugar'"}, "time": 1742628375.9778888}