{"duration": 0.38030242919921875, "input_args": {"text": "'by Augustina Ursino \\nMatthew Gage Downing-Powers passed away on October 9, 2013. He was 5 ½ months old and died less than 2 days after receiving 8 vaccines. After Matthew’s lifeless body was taken to the hospital, his parents were kept from seeing him, to say their good-byes. A month and a half later, he was returned cremated. Then Matthew’s parents were denied a copy of his autopsy report. \\nMatthew’s mother, Crystal Downing-Powers, found a vaccine injury attorney to help her file a vaccine injury claim. This vaccine injury attorney was handling this case for six months and then one day, he sent Crystal a letter in the mail saying he didn’t have enough evidence regarding the death of Matthew, so he was dropping them. That was it. There was no further correspondence from him. \\nWith no progression on their case, Matthew’s parents were further shattered. They were unsure of what to do next, because the deadline to file a vaccine injury claim is two years after a parent loses their baby to vaccines. This left them with barely any time to find another vaccine injury attorney to help them. \\nCrystal was distraught and in tears, feeling more helpless than ever at this point. The VacTruth team immediately helped her find another vaccine injury attorney. It is very difficult for any vaccine injury attorney to win a vaccine injury case, involving a child who died after being vaccinated. Nearly seventy percent of vaccine injury claims get denied. It takes a lot of time to fight these cases and some attorneys just aren’t willing to put in the time or effort. Others just don’t have the experience. \\nThankfully, this new attorney has been fully supportive and understanding of the situation and is willing to fight for Matthew’s family. Crystal was thankful that her new attorney filed their claim in September 2015, less than one month before the deadline. He also submitted a request to receive Matthew’s autopsy report, being denied to his parents. Weeks continued to pass after the request was put in. \\nIn January 2016, Matthew’s autopsy report was finally provided in full to the lawyer, detailing the vaccines Matthew received prior to his death, the time he was vaccinated and the time he passed away. \\nMatthew’s death was ruled UNDETERMINED. \\nCrystal was thankful the autopsy report was finally available but had no words to describe the pain this has caused them and the frustration of having to wait more than two years and three months to get a copy of their son’s autopsy report. \\nWhen her lawyer viewed the report, he mentioned of the many autopsy reports he has reviewed, viewing Matthew’s was one of the most difficult to look at. Even he felt it would be too much for Crystal to look at, or for anyone to look at. The images of her son in that report remain unseen by Crystal to this day. \\nAfter losing her son, Crystal wants us to know she is optimistic they will win their case. Once they do win, she wants to go as far as she can go, to open people’s eyes! She has seen 13 babies die in the past year from vaccines, even though the vaccines are denied as the cause of death, parents know the truth. This breaks her heart to see this and makes her relive the worst nightmare in her own life. \\nCrystal wants people to know that these innocent children dying from vaccines needs to stop and if she has to be that person to stop this, then she will be. \\nCrystal has since given birth to their rainbow baby Wyatt. This term represents a baby born after a baby lost. Wyatt is an extremely healthy child. She has witnessed first-hand, like many parents before her, how he is the healthiest child of hers, because he is unvaccinated. \\nCrystal reminds us that none of their children will ever receive any further vaccines and she has filed vaccine exemptions for them in California. She is also disgusted that SB277 passed, after what happened to her son. It became clearer to her that these politicians don’t care about people’s health, because when the vaccines harm, the injured get ignored. \\nMatthew’s parents always feel a part of them missing. Their precious gift of life is dead now because of poisonous injections that didn’t protect him from any disease. \\nWe are outraged at what is happening to families and at those who are in a position to do something, to change things, but continue to do nothing to help the vaccine-injured community and to prevent these tragedies from continuing. \\nWe are incredibly sorry for Matthew’s loss. His parents live each day with so much pain, knowing the vaccines took the life of their fourth son. Matthew’s brothers suffer each day too, they miss their brother tremendously. \\nMatthew would be turning 3 years old today. \\nWe hope you never forget him and what his short life has taught us. \\nOriginal Publication: February 26, 2015 \\nParents in California are distraught after losing their infant son after being vaccinated. He died in his sleep and was taken to the hospital already deceased. Hospital staff ruled his death as sudden infant death syndrome. The couple was told an autopsy was required to be performed on their son. \\nAfter returning home, waiting to get an update, they never received one. Numerous phone calls were made to get answers. Weeks went by. Finally, they received verbal confirmation and told their son was best not to be seen prior to being cremated, because of the condition he was in. Once cremated, they could pick up the remains of their child from the crematory. They were not given the chance to say their goodbyes. \\nMore than one year and four months have passed and the family has yet to receive his autopsy report. It turns out their son was given a vaccine not approved for his age and an extra dose of the hepatitis B vaccine that he shouldn’t have received until later on. \\nThis harrowing story is a reminder that vaccines can be lethal. Parents shall maintain the rights to choose what medical interventions they feel are safe for their child. After all, they are the ones who have to live with the consequences. \\nCrystal Downing shares with us what happened to her son Matthew, in hopes to remind parents to research vaccines before offering their child to be injected with whatever the doctor says. \\nOne Less Baby Boy \\n“Our sweet little fussy bear Matthew Gage Downing-Powers was born healthy on April 26, 2013. In the hospital, he was given the Hepatitis B vaccine after birth. That’s what they do here in the United States and what the CDC recommends newborns receive, following the current schedule. His reactions to the shot were deemed normal and I have older children that have been fully vaccinated, so I was aware of what to expect. \\nI took Matthew in for his 2 month well baby checkup on July 2, 2013. During this appointment, he was given 8 vaccines for DTaP (3 in 1), Polio, Hib, Hep B, Pneumococcal PCV and the oral Rotavirus vaccine. Then I was late getting him to his 4 month checkup. I brought him as soon as I was able. \\nOn Monday October 7, 2013, when Matthew was 5 ½ month’s old, I brought him in for his 4 month delayed visit. The doctor said they could get him caught up on his shots. I thought ok, you can do that. Matthew received 8 vaccines, DTaP, Polio, Hib, Pneumococcal, Hep B and Hep A. These would be the last vaccines he would ever receive. \\nAfter the shots, he didn’t have a fever or a low grade one. We didn’t give him Tylenol. He was just grumpy and crying some. We checked him every hour. His temperature stayed normal but he wasn’t his happy go lucky self. All my kids got grumpy after their shots. \\nI didn’t call the doctor on Tuesday. I knew these were typical behaviors after the kids received the vaccines. He is my 4th son. We had our other 3 vaccinated and knew what to expect. \\nI thought I would give it another day to see if he was still grumpy but we didn’t get to the next day. Matthew was gone by then. He was found lifeless. He went to bed that Tuesday night and my husband found him Wednesday morning. \\nMy husband Zack and I both performed CPR on our son and so did my dad and step mom. He had some light pinkish-brown tinged mucous coming from his nose and mouth. I wasn’t willing to believe he was gone. None of us were willing to give up on him. \\nMy husband called 911 but they were taking so long. I ran my baby to the hospital that was 2 blocks away. I took him to Needles hospital which is called Colorado River Medical Center in Needles, CA. The hospital also did CPR on him and said he died of SIDS, soon after I brought him in. He had been gone for hours they said. They told me he passed sometime between 11 PM (after he was put to bed) and 7 AM Wednesday morning (shortly before he was found). \\nMy life has been full of heartache since we lost our baby. That was the worst day of my life, seeing my son that way but still believing he would come back to me. \\nHospital staff said I would be under investigation and it was California law when a baby passes, to undergo an autopsy. From the hospital in Needles, Matthew was transferred from that hospital to the coroner’s office, in San Bernardino, CA. We had chosen to have Matthew cremated at a funeral home in San Bernardino. \\nAfter leaving Matthew at the hospital, we were told to go home and wait for an update when the autopsy would be done. We planned to see him at the funeral home we picked out, after deciding we would have him cremated. I was told I’d be informed when the autopsy was to be done and when it would be completed and that I could view him before being cremated. \\nI didn’t write down the names of the staff members I left my son with. I didn’t think of that when it happened. But I should have. No one called me to inform me what was going on. I called numerous times and kept getting the runaround. Absolutely no one would give me answers. \\nWeeks went by before I received a call back. By this time, I was informed Matthew was not in a condition I’d want to remember him in. I felt helpless and convinced I should sign a paper letting them cremate him. Prior to this, the funeral home confirmed the remains were Matthew’s. They asked me what urn I would like and then confirmed it was him. I also sent a picture of him, to make sure. \\nMatthew didn’t get brought back to our home in Needles, California until November 20, 2013. A month and a half after he passed away. \\nI don’t think they cremated him before telling me but part of me feels they did, to cover up his death. I will never know but my instincts tell me something was being hidden. I think the funeral home did a nice job, they were very patient with me, they understood why I kept calling them so many times, to see if somebody there could tell me what happened to my son’s body. \\nI didn’t know where my sons body was. I didn’t know what was going on at the coroner’s office. I was never notified whatsoever and to be honest, I was really flipping out. I wanted to know what was going on with my baby and what answers did they have for me so far. \\nThe coroner was informed of the vaccines Matthew had just received. I had even asked the coroner if it was possible the vaccines killed my son. The coroner straight lied to my face, or more, over the phone, saying that no, it was not the vaccinations that killed him. \\nThere was only one time they contacted me and that was over how many people had done CPR on him. And that was the last time I heard from them. \\nI did contact him after we had received his death certificate saying pending investigation still and I asked if they had finished with his autopsy report. They told me no. I called once more and they told me that they couldn’t give me anymore information and that I would have to call the coroner’s office here in Needles, California. I have done that and still no answer, no nothing. \\nThe coroner said it wasn’t my fault and sometimes this just happens. I couldn’t believe what I was just told. \\nIt took me a long time to speak up and share my story because of this pain. I decided to come forward because I don’t want Matthew to die in vain because of vaccine manufacturers not doing a better job making safer vaccines, before pushing them onto unsuspecting parents and their innocent babies they view as profitable beings. \\nWhy are infants getting so many at one time? Has it been proven it’s safe to give these kids all the vaccines they are shooting them up with during these well baby checkups? From what I’ve learned since all of this, the answer is no. \\nLater, I learned two of the vaccines given at his last appointment, should not have been given to him. Babies are not supposed to be given the Hepatitis A vaccine until at least 1 year of age and this was given to Matthew at 5 1/2 months old. \\nI also learned he was given the third dose of Hepatitis B too soon. Matthew wasn’t supposed to get that until his next visit during the 6 month checkup which would’ve also been delayed to space out the shots, because we were late getting him the 4 month vaccines. \\nI think it was right after the funeral I learned that they had given him the Hep A vaccine too soon. When I had learned this, it killed me. I started blaming my self and still do because I never took the time to know what vaccines were supposed be given to a child, at what month, how many doses, etc. \\nI felt because I didn’t do the research until after Matthew died, I was foolish and this was somehow my fault. I felt in some way this was my fault because I was late on his vaccinations. My thoughts were if I would’ve followed the CDC’s schedule and not been late to that 4 month check up, he probably would not have gotten the wrong vaccines. Now he’s gone. \\nI do understand he could’ve been taken sooner even if the correct vaccines were given on the schedule. It’s just something I live with. \\nIt’s been over a year and four months since Matthew passed on October 9, 2013 and I still haven’t gotten the autopsy report that I told them I wanted a copy of. I keep getting the run around! \\nI went to the doctor’s office recently and found out the nurse that injected Matthew is no longer working there. I was told she got fired because she didn’t know what she was doing when giving vaccines. \\nI said to the office if it turns out his death was because of her ignorance, I will be going after them all. My son shouldn’t have died because you guys were too lazy to train her to give vaccines properly. They didn’t even apologize to me. I’m just beyond angry at this point. I can’t wait to get my answers. \\nThey said my baby is the only one who had passed away since she started working, until the end of her working. Who knows if that is true? There could’ve been more lives taken and they wouldn’t admit it. \\nI want to tell other parents, they say vaccinations are safe, but in reality, they aren’t. \\nAsk questions and know which vaccines they plan to give to your baby. Know the risks associated with all of the vaccines they plan to give during the checkup. And remember, it’s your choice. It’s your child. And whatever you do, don’t let them mix the vaccines into one needle or give them so many at once because if you don’t think this won’t harm your child, then look at the child I lost. It is possible. \\nMatthew was given DTaP, IPV, Hib, PCV, Hep B and Hep A in 3 shots, one in his right arm and two in his left leg. \\nNow I’m pregnant with my 5th child. I have to stay strong. I have too. I have to remain less stressed for my family and during my pregnancy. I have 3 boys, a hubby and soon my rainbow baby, all counting on me, to hold this family together. \\nIn all honesty though, sometimes I feel so overwhelmed because I miss Matthew so much and people are so unaware how often vaccines take the lives of infants. I’m beyond angry that this has happened to my baby. And scared it can happen again with the kids I do have. And that I’ll be forced to vaccinate this unborn baby. \\nA bill was currently put forth by our California state politicians to take away my right to exempt my children from further vaccines due to personal beliefs. If this passes, this would take my parental right away, to choose vaccinating my children in the future. What they should do is create a new exemption for parents to file that took one for the team! We should be able to opt out for that reason alone. \\nWas it not enough Matthew was taken? He should be honored by these people but instead, they deny his existence by pushing bills that slap parents in the face that have lost their child to vaccines or to those parents with vaccine injured children. Maybe if they would make safer vaccines, more would want to get them. \\nMy son was injected with 8 vaccines, if you don’t know what is in them, learn! When I did, I was shocked and mad at myself for not questioning this before. Matthew is the reason I opened my eyes, to see what vaccines can really do to a baby, let alone anyone. I’m not the only one who believes vaccines are not what they claim they are. I really hope this opens parent’s eyes who do vaccinate their children. \\nMy older son is having a hard time, my second son said he is afraid of the shots now and my third son is 3 years old, he just knows his baby brother is gone. As for my hubby, he keeps it in, so it’s kind of hard to know what he is feeling. \\nTo this day, I still haven’t received his autopsy report. They keep giving me the run around. So the investigation is still pending. I have filed a report with the Vaccine Adverse Events Reporting System (VAERS). I’ve learned they sometimes don’t follow up with parents, which prevents them from reporting a reaction. Until I receive an autopsy report, it makes it difficult to file a claim with the National Vaccine Injury Compensation Program (NVICP). I feel they are stalling us because the time frame to file when you lose a child to vaccines is 2 years, it’s going on a 1 ½ years for us. We won’t give up. My son should still be here. \\nHis shot records don’t lie! They shouldn’t cover up these reactions to vaccines these kids suffer from. They should not stifle parents from pursuing the already time consuming and deterring recourse they’ve set up, talking about the vaccine injury compensation program. \\nSince I looked into this more, I’ve learned how common it is for babies to die right after getting vaccinated. I just want it to be known that this can happen and I hope mothers ask questions first, before handing their child over to get shot up. How many of us moms helped hold our own child down, to keep them restrained while being vaccinated, knowing we helped them hurt our own? \\nMatthew’s death was a high price to pay in the name of preventing any of these diseases my kid would’ve been fine dealing with. \\nI didn’t believe a few people who told me this can happen, but it did. And now I have to live with that for the rest of my life, knowing I should have asked questions and researched first, before blindly agreeing to them injecting or giving him anything. I didn’t research. I didn’t question what vaccines were given to all of my children. I had no reason to distrust doctors, until now. Since this happened to Matthew, my eyes are wide open now. Now I’m not afraid to question everything that is done to my children. \\nIt’s a parent’s decision to make, to vaccinate their child or not. Parents need to research both sides, for and against. Then make their decision on the matter. My dad told me I didn’t get sick till after I started school and had to have those required vaccines. After that, my dad never vaccinated me again. My dad said it a few times before all of this happened, but I didn’t pay attention. I wish I had listened to him. \\nI just let the doctors and nurses do what they said was needed. No questions asked. I thought they would tell me if there were severe risks involved. Nobody told me anything like that. I trusted them with my child’s life and would’ve liked to have known that death from vaccination is an associated risk. Why didn’t the doctors or nurse tell me this? I really wished I researched and asked questions instead of just trusting the system and doctors. And now because I didn’t, my child is gone. \\nThere are a lot more parents out there like me. Some don’t come forward due to fact they are afraid of what people would say. Sometimes people can be really cruel and not understand what parents like me go through. \\nI just want his story to be told. My hubby and I say thank you to everyone lending their support. We are so blessed to have the short time we had with our little fussy bear. I hope sharing this will help mothers know it can happen. \\nI want it well known I’m not telling parents not to vaccinate their child. I’m simply saying to research before you vaccinate. Learn if you choose to vaccinate, then that is your choice, not someone else’s to make because you will be stuck with the consequences. \\nDon’t disrespect parents like me, who have lost their child to vaccines. And don’t disrespect parents of living vaccine injured children. Our rights to choose these medical interventions need to be preserved. It is beyond disturbing that bought politicians think they can choose what gets injected into our children. They don’t care about your child’s health. Clearly many are dying and getting injured from these vaccines and they turn a blind eye. That should tell you something. \\nI miss my baby so much. A huge part of me was taken when he was. I cannot let this happen again. I cannot put my other children at risk of being vaccine injured any longer. \\nMatthew took one for the team and his life didn’t matter to those wanting to strip my rights to opt out of further vaccinating. Why does he not matter? Why do mild cases involving the measles get reported all over the news, but not babies dying after getting the MMR shot or other vaccinations? Why don’t the vaccine injured children matter? \\nWe miss and love you so much Matthew. You are always thought of every day. You are always in my heart and I will never stop loving you. \\nLove Your Momma,'"}, "time": 1742562474.0919695}