{"duration": 0.050679922103881836, "input_args": {"text": "'President Trump’s deregulation of the Federal Communications Commission (FCC) went into overdrive this week, with Sinclair Broadcasting launching the first of what will be many television industry consolidations, and the Ninth Circuit granting a   rehearing of its August ATT Mobility decision. [The Federal Communications Commission (FCC) now under Trump Administration control, made a late April move to relax regulatory restrictions on how many television stations an owner may control. That kicked off an immediate bidding industrywide bidding war to achieve greater competitive efficiencies through consolidation.  Sinclair Broadcasting, America’s largest broadcast group, bid $240 million on May 1 to buy 14 more New   stations. According to the Deal Book blog, a bidding war is breaking out for Tribune Media, owner of Chicago’s WGN America and New York’s PIX 11. Commenting on the March 9 willingness of the full Appeals Court to reconsider an August 29 decision that held that the Federal Trade Commission (FTC) could no longer could control Internet activity, Republican FCC Chairman Ajit Pai issued a statement: “Today’s action by the Ninth Circuit is a big win for American consumers. Now that the court’s prior decision is no longer effective, it will be easier for the FTC to protect consumers’ online privacy. ” The Appeals Court opinion last year relied on the Obama   FCC’sissuing of a massive   regulatory grab in March 2015, referred to “Net Neutrality. ” The order reclassified the treatment of broadband Internet from a growing competitive industry to “common carrier” monopolies, like the old American Telephone and Telegraph. The original appeals court decision last year dramatically altered the regulatory boundaries between the FTC’s and FCC’s authority over phone companies and other common carriers. It dismissed the FTC’s unfair act or practice suit against ATT for not disclosing it was “throttling” data transfer speeds for customers that paid for unlimited wireless data plans. Breitbart News noted that Republican FCC member Ajit Pai tweeted in 2015that President Barack Obama’s Net Neutrality scheme was aimed at the federal government   the Internet to extract billions of dollars in new consumer taxes, and rigidly to enforce progressives’ idea of honest, equitable, and balanced content fairness.'"}, "time": 1742564110.610595}