{"duration": 0.04690217971801758, "input_args": {"text": "'Fake Company, Facebook, to Battle Fake News? By Daily Bell Staff - November 19, 2016 \\nZuckerberg: Facebook will develop tools to fight fake news … Fake news sites designed to trick you … Mark Zuckerberg has outlined a series of measures that should help prevent fake news from being shared on Facebook. The planned controls, which were announced in a late night Facebook post, follow accusations that a flood of fake news stories influenced the U.S. presidential election. -CNN \\nFacebook is taking steps to counteract “fake news” but in many ways Facebook is a fake company. \\nWe wrote about it here, quoting an article entitled, “Behind Facebook—A New World Order Agenda?” \\nFacebook’s first round of venture capital funding ($US500,000) came from former Paypal CEO Peter Thiel. Author of anti-multicultural tome ‘The Diversity Myth’, he is also on the board of radical conservative group VanguardPAC. \\nThe second round of funding into Facebook ($US12.7 million) came from venture capital firm Accel Partners. Its manager James Breyer was formerly chairman of the National Venture Capital Association, and served on the board with Gilman Louie, CEO of In-Q-Tel, a venture capital firm established by the Central Intelligence Agency in 1999. One of the company’s key areas of expertise are in “data mining technologies”. \\nBreyer also served on the board of R&D firm BBN Technologies, which was one of those companies responsible for the rise of the internet. Dr Anita Jones joined the firm, which included Gilman Louie. She had also served on the In-Q-Tel’s board, and had been director of Defence Research and Engineering for the US Department of Defence. \\nShe was also an adviser to the Secretary of Defence and overseeing the Defence Advanced Research Projects Agency (DARPA), which is responsible for high-tech, high-end development. \\nWe can see that Facebook’s initial funding came from individuals affiliated with US government/intel facilities: the CIA and DARPA. There is no doubt the US government has promoted Facebook around the world. It is an affiliate of the Deep State far more than it is a “private company.” \\nAnd what about CNN, excerpted above? \\nCNN is in a sense a fake news organization just as Facebook is a fake social media facility. CNN reportedly receives payments to promote stories that governments want publicized. \\nFor instance, former CNN reporter Amber Lyon, a three-time Emmy award winner exposed CNN in 2015 for receiving payments from the US government and foreign governments to pick and choose news items, see here . \\nMore from CNN: \\n“The bottom line is: we take misinformation seriously,” wrote Zuckerberg. “We take this responsibility seriously. We’ve made significant progress, but there is more work to be done.” \\nThe CEO said that Facebook (FB, Tech30) is working to develop stronger fake news detection, a warning system, easier reporting and technical ways to classify misinformation. \\n… Zuckerberg did not say how quickly the measures would be in place. But they should make it much easier for users to flag misleading content — similar to the way cyberbullying can be reported with a single click on some social media. \\nThe idea that users can flag “fake” news content would be more credible if the US government along with other governments had not already created squads of Internet monitors, see this article entitled, “US Government Using Trolls To Attack Conspiracy Theorists, here. \\nThese monitors will surely be able to click articles that are in some sense inimical to various vested globalist interests. \\nThe entire fake news controversy is suspect, starting with the idea that fake news “helped” Donald Trump get elected president of the US. As we recall, there was a good deal of fake news, but most of it seemed to emanate from the mainstream media. \\nThis mainstream resolutely would not investigate or report on the worst of the Clintons’ apparent criminality – including potential rape, mishandling of classified data and “pay-to-play” donations to the Clinton Foundation. \\nAdditionally, the mainstream reported a steady stream of polls favorable to Hillary by using tactics that exaggerated her voter endorsements. \\nWe arrive at the justifiable conclusion that the “fake news” controversy is itself a fake one, that outfits such as CNN that are reporting on it are fake and that Internet facilities charged with identifying fake news items like Facebook are also fake. \\nThose behind this gambit obviously intend to use it to attack the alternative media, which has been very effective in puncturing the propaganda of the Deep State. The very largest irony is that this fake news meme is aimed at truth-telling in the alternative media. \\nConclusion: Whether or not this will work is a separate question, as we wrote here . But the idea is to create such a large lie that people will believe it. This has happened before.'"}, "time": 1742628602.655722}