{"duration": 0.095428466796875, "input_args": {"text": "'DALLAS  —   In the final seconds on Sunday, Dawn Staley gave a group hug to her assistant coaches. As confetti showered South Carolina’s first women’s basketball title winners, she put on a championship cap she had waited a career to wear. Later, she wore a net like a necklace. The   win over Mississippi State, a fellow member of the Southeastern Conference, was a victory that represented a diversity of opportunity, both for coaches and for teams playing for a championship. Staley became the second   coach to win a title since the N. C. A. A. began sponsoring a women’s basketball tournament in 1982. (Carolyn Peck coached Purdue to the 1999 championship.) And for the first time in five years, a program not named Connecticut won a national title. After Peck won her championship, she gave Staley a piece of the net that Purdue cut down in celebration that night, telling her to return it when she won her own title. For years, Staley kept the strand of net in her wallet. “I’m going to have to pass a piece of my net on to somebody else, so they can share it and hopefully accomplish something as big as this,” Staley said. Staley was a fierce point guard from Philadelphia and one of the most renowned players in the history of women’s basketball as a collegian, professional and Olympian. She became a coach only reluctantly. But now, as an N. C. A. A. champion and the recently named Olympic coach for the 2020 Tokyo Games, Staley has a chance to become a   for women’s basketball as Geno Auriemma of UConn and Tara VanDerveer of Stanford move closer to retirement. “Basketball is an incredible gift that keeps on giving,” Staley, 46, said Sunday. Earlier, at the Final Four, she said, “I’m one that thinks basketball is a place of utopia and fairness. ” For the third time this season, the Gamecocks beat the Bulldogs. Mississippi State ( ) appeared to be somewhat tired, or anxious, after Friday night’s epic overtime upset of UConn. South Carolina attacked from the opening tip, then sputtered after building a   lead in the third quarter. But the Gamecocks were settled by their    post player A’ja Wilson (23 points, 10 rebounds) and guard Allisha Gray (18 points, 10 rebounds).   of South Carolina’s points were scored in the lane. Three times, Staley had reached the Final Four as a player at Virginia. And this was her second appearance in the past three seasons as South Carolina’s coach. She had not won until Sunday, but a championship that had remained elusive finally became inexorable. “She was the best leader I ever coached,” said Nell Fortner, who led Staley and the United States to an Olympic gold medal at the 2000 Sydney Olympics. “It isn’t overbearing, just a natural aura she has about her. Players follow her. ” Yet opportunities for minority women to become head coaches at the top levels of women’s college basketball have been rare. Excluding historically black colleges and universities, among 320 Division I women’s teams, only 35 (10. 9 percent) have   women as head coaches, while 45 percent of the players are black, according to a report to be released this week by the Institute for Diversity and Ethics in Sport at the University of Central Florida. (Nineteen   men also coach women’s teams.) After John Thompson became the first black men’s coach to win an N. C. A. A. basketball title at Georgetown in 1984, “more athletic directors were open to putting an   in charge,” said Richard Lapchick, the director of the diversity institute. “Hopefully, that will be the case here” after Staley’s triumph, Lapchick added. Staley said: “I don’t know what athletic directors will think about. I’m not one that looks at race. Basketball has been faceless and colorless and genderless when I approached it. I think athletic directors need to hire what’s best for them. ” She added: “If it’s an   male or female, then that’s who they should hire. If it’s somebody else who they feel can take their program to the next level, it has to be the best fit for them, and not necessarily  . ” The daughter of parents who moved from South Carolina, Staley grew up in public housing in Philadelphia. She played baseball, football and basketball with her three brothers and other boys and sometimes shot baskets until 2 a. m. She developed a robustness that allowed her to win three Olympic gold medals as a player and be named one of the top 15 players in the formative years of the W. N. B. A. “She’s basically a gym rat, and definitely ball is life for her,” said Gray, the guard. With Sunday’s title, Staley joined Pat Summitt of Tennessee, Kim Mulkey of Baylor and Marianne Stanley of Old Dominion as former star women’s college players who went into coaching and won N. C. A. A. championships. “I have always respected Dawn’s competitiveness, her work ethic, her absolute passion for the game of basketball,” said VanDerveer, who coached Staley to a gold medal at the 1996 Atlanta Olympics. “But if she tells you she beat me in chess, she’s a liar. ” While still playing in the W. N. B. A. Staley was somehow persuaded in 2000 by Dave O’Brien, then Temple University’s athletic director, to coach the university’s women’s basketball team. Perhaps more out of hometown devotion than enthusiasm, Staley agreed, though she has said, “Not one ounce of me wanted to coach. ” In eight seasons at Temple, Staley guided the Owls to six appearances in the N. C. A. A. tournament. But she grew weary of a sobering realization: She could not recruit the caliber of players needed to get Temple beyond the second round of the tournament. “At tournament time, we always got ” Staley said. “We outplayed people, but they   us. ” In 2008, she left for South Carolina, a team that was underachieving but seemed to have great possibility, with the financial resources available to a school in a major football conference. Staley expected the same kind of dedication that she played with, and some of her players transferred early on. But the Gamecocks soon grew into a national power and, as of Sunday, into a national champion. Referring to her fellow semifinalists Auriemma (11 N. C. A. A. titles) and VanDerveer (two) Staley said, “I want to be among greatness. ” With Sunday’s championship, she moved into rarefied company. “It means I can check off one of the things that has been a void in my career,” she said.'"}, "time": 1742564247.3775067}