{"duration": 0.04913640022277832, "input_args": {"text": "'RT crew comes under fire as Aleppo militants launch massive new assault (VIDEO) 11/03/2016 \\nRUSSIA TODAY RT’s Murad Gazdiev and his crew came under fire in Aleppo as militant groups holding the eastern part of the city launched a new assault on government-held western areas, trying to break the blockade, after rejecting an offer to leave the city with their arms. \\nThe neighborhood “ has been relatively quiet for the past two days and we wanted to see what was happening there ,” RT’s Gazdiev reported from Aleppo. “ There are still dozens of civilians there, not everyone managed to leave. ” \\nThe rebels apparently launched a major new offensive against the government-held part of the city, radio communications intercepted by the Syrian military indicate. \\n“ There were apparently two or three suicide car bombs blown up very close to us. We hid. We saw many shells landing meters away from us, ” Gazdiev said. \\nThe Syrian Army helped the RT crew along with civilians being evacuated from the area. \\nEarlier on Wednesday, the Russian military said that last week’s attempts by the militants to break through the blockade around the city had failed, and suggested that they leave Aleppo through one of two corridors opened for that purpose. \\nRussia and Syria halted airstrikes on eastern Aleppo two weeks ago amid a flurry of criticism from the West over civilian casualties in the city. Moscow said civilians were being held by the militants as human shields, but agreed to keep warplanes away from the city. \\nThe offer to leave Aleppo by Friday night was rejected by some groups controlling the eastern part of the city. \\nRussia’s earlier attempts to allow militants to leave and civilians to be evacuated from eastern Aleppo were thwarted by the more belligerent groups, which opened fire at anyone trying to use the corridors – both those meant for armed people and unarmed civilians.'"}, "time": 1742562013.0013883}