{"duration": 0.11998581886291504, "input_args": {"text": "'United Airlines barred two teenage girls from boarding a flight on Sunday morning and required a child to change into a dress after a gate agent decided the leggings they were wearing were inappropriate. That set off waves of anger on social media, with users criticizing what they called an intrusive, sexist policy, but the airline maintained its support for the gate agent’s decision. The girls, who were about to board a flight to Minneapolis, were turned away at the gate at Denver International Airport, the company said on Sunday. United doubled down on that decision, defending it in a series of tweets on Sunday. The incident was first reported on Twitter by Shannon Watts, a passenger at the airport who was waiting to board a flight to Mexico. In a telephone interview from Mexico on Sunday afternoon, Ms. Watts said she noticed two visibly upset teenage girls leaving the gate next to hers. Both were wearing leggings. Ms. Watts went over to the neighboring gate and saw a “frantic” family with two young girls, one of whom was also wearing leggings, engaged in a tense exchange with a gate agent who told them, “I don’t make the rules, I just enforce them. ” Ms. Watts said the girl’s mother told her the two teenagers had just been turned away because the gate agent said their pants were not appropriate travel attire. The woman had a dress in her   bag that the child was able to pull on over her pants, and the family boarded the flight. “The girl pulled a dress on,” Ms. Watts said. “But please keep in mind that the dad had on shorts that did not hit his knee  —   they stopped maybe two or three inches above his knee  —   and there was no issue with that. ” Ms. Watts judged that the two girls who were barred from boarding were in their “young teens” and the girl who changed into a dress was 10 or 11. Ms. Watts described the situation in a series of tweets before her flight to Mexico took off. By the time she landed her tweets had been shared widely, often accompanied by sharp criticism directed at the airline. Jonathan Guerin, a spokesman for United, confirmed that two teenage girls were told they could not board a flight from Denver to Minneapolis because their leggings violated the company’s dress code policy for “pass travelers,” a company benefit that allows United employees and their dependents to travel for free on a standby basis. Mr. Guerin said pass travelers are “representing” the company and as such are not allowed to wear Lycra and spandex leggings, tattered or ripped jeans, midriff shirts,   or any article of clothing that shows their undergarments. “It’s not that we want our standby travelers to come in wearing a suit and tie or that sort of thing,” he said. “We want people to be comfortable when they travel as long as it’s neat and in good taste for that environment. ” He said both teenage girls stayed behind in Denver, “made an adjustment” to their outfits and waited for the next flight to Minneapolis. Mr. Guerin did not know if they had successfully boarded or not, and also had no information about the girl Ms. Watts said she saw change into a dress at the gate. The company largely confirmed Ms. Watts’s account earlier in the day in a response to her on Twitter that did little to mollify the concerns of its critics. In a series of dozens of tweets, the company said the incident was not simply the result of an overzealous gate agent. Instead, it said United Airlines reserved the right to deny service to anyone its employees deemed to be inappropriately dressed. It also referred to the dress code applied to pass travelers. “In our Contract of Carriage, Rule 21, we do have the right to refuse transport for passengers who are barefoot or not properly clothed,” the company tweeted. It added, “There is a dress code for pass travelers as they are representing UA when they fly. ” Few critics appeared to be satisfied by that explanation, which also did little to   a perilous public relations situation for the company. United was the target of scores of angry and mocking tweets on Sunday, including from social   celebrities like the model Chrissy Teigen and the actor LeVar Burton. By Sunday afternoon, the company’s Twitter account was engaged in a tense back and forth with the Academy   actress Patricia Arquette, who posted dozens of angry tweets about the situation. Employees running United’s Twitter account spent the day walking a public relations tightrope: explaining to angry social media users why the company was not wrong to bar the young women from boarding, while reassuring potential customers that they would not also be barred if they showed up in leggings. People like to be comfortable when they fly, Ms. Watts said, and leggings and yoga pants have become standard casual attire for women. “I’m pretty sure yoga pants are a thing,” Ms. Watts said. “They’re part of modern America. They’re a staple, a   clothing item. ” Mr. Guerin said the company was aware of the criticism leveled at its social media team, but said they were “working as hard as they can. ” “We could have stopped to immediately ask the right questions,” he said. “We are always engaging with our customers as quickly as possible. Now we are going back. All day we’ve been going back since that earlier tweet. Now we’re going back and telling people what is actually going on. ”'"}, "time": 1742563121.4169974}