{"duration": 0.07875633239746094, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Hillary Clinton’s diagnosis of pneumonia has grounded her for a few days and shifted the focus of the presidential race to the candidates’ health. Mrs. Clinton, 68, and Donald Trump, 70, have promised to release more detailed information from their doctors. The issue isn’t just their state of vigor but whether they operate with more insularity than transparency. Mr. Trump also demanded that Mrs. Clinton apologize for calling some of his supporters “deplorables” and released an ad showcasing the remarks on national cable and in four battleground states. _____ 2. President Obama will veto a bill that would allow the families of victims of the Sept. 11, 2001, attacks to sue Saudi Arabia for any role in the plot, the White House said. Since both the House and Senate passed the legislation with majorities, the president could face the first veto override of his presidency. He also met with congressional leaders, above, to discuss measures needed to finance the government after the fiscal year ends on Sept. 30, since lawmakers have not agreed on a budget. _____ 3. The U. N. secretary general, Ban   is racing to get the Paris climate agreement into effect  —   possibly even before the U. S. election. The pact goes into force when 55 countries representing at least 55 percent of global emissions formally sign on, conditions that are more than halfway met. The world’s three largest emitters  —   the U. S. China, above and Brazil  —   are on board. This year is shaping up to be the third consecutive hottest on record, and some scientists warn that the oceans’ ability to absorb excess heat has masked the scale of the problem. These graphics lay out the issues. _____ 4. The N. C. A. A. made a surprise announcement: All its championships are being moved from North Carolina for this academic year because the state passed laws the group said violated the civil rights of lesbian, gay, bisexual and transgender people. The N. B. A. already moved next February’s   Game from Charlotte, and stars like Bruce Springsteen and Itzhak Perlman have canceled concerts in the state. _____ 5. Florida’s offer of free Zika testing for pregnant women has increased rather than decreased their anxieties. That’s because so many responded that state labs are overwhelmed, and the wait for results can stretch to six weeks, complicating already difficult decisions about possibly terminating pregnancies. Above, workers went door to door to take blood samples. _____ 6. Colin Kaepernick, above right, and his teammate Eric Reid knelt during the national anthem before the San Francisco 49ers played their first game of the season against the Los Angeles Rams (10:20 p. m. Eastern, ESPN). Kaepernick’s refusal to stand for the anthem to protest racial injustice has emboldened players on other teams  —   and in other sports  —   to make their own symbolic gestures of dissent. Such moves have been rare, in part because athletes are often preoccupied with team morale and financial and branding issues. _____ 7. If you’re forever playing   our television experts can speed you along. Their list of the best shows that emerged over the summer includes some of contenders for Emmys on Sunday, including the documentary series “O. J.: Made in America” (ESPN). There’s also “Stranger Things,” above, an oddly straightforward horror story set in 1983. Our experts also suggest a few newbies, like Amazon’s promising pilots “I Love Dick” and the reboot of “The Tick. ” _____ 8. Feel whipsawed by the shift in the last few years from demonizing fat for health problems to blaming sugar? Historical documents discovered by a researcher show that the sugar industry paid several Harvard scientists in the 1960s to play down the link between sugar and heart disease and promote saturated fat as the culprit instead. “They were able to derail the discussion about sugar for decades,” said a medical professor who helped bring the case to light. _____ 9. The Syrian   called for in an agreement by the U. S. and Russia had an uneven start. Violations were reported in the north and south of the country shortly after it went into effect. The timing coincided with Eid   the Muslim Feast of the Sacrifice, which commemorates a story central to Judaism, Christianity and Islam: Abraham’s willingness to sacrifice his son at God’s behest. One Syrian activist, pessimistic that the   would make any difference in the conflict, posted on Facebook: “and they gathered like sheep in front of the guillotine. ” _____ 10. Millions of people are flowing over   paths in Saudi Arabia for the annual hajj. One of them is our Mideast reporter Diaa Hadid, and she’s sending dispatches, videos and photos to help demystify the pilgrimage for  . There are little prayer counters, like spiritual Fitbits shopping sprees ritual haircuts and moments of great kindness, like being sprayed under a sweltering sun with the last ounces of water from strangers’ bottles. _____ 11. Finally, this may hearten many Medicare beneficiaries: Claims for skilled nursing, home health care or outpatient therapy are not supposed to be rejected just because a patient has ceased to improve. In fact, a federal judge has ordered supervisors to do a better job of making that clear to health care providers and claims adjudicators. The actual rule is that Medicare must approve such services when they are “necessary to maintain the patient’s current condition or prevent or slow further deterioration. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s the Weekend Briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562046.4644241}