{"duration": 0.16886568069458008, "input_args": {"text": "'  Donald J. Trump said on Tuesday that he had no intention of pressing for an investigation into Hillary Clinton’s use of a private email server or the financial operations of her family’s foundation, dropping the “lock her up” pledge that became a rallying cry for his campaign for the White House. Mr. Trump, who branded his rival “Crooked Hillary” and said she would go to jail if he were president, said in an interview with reporters and editors at The New York Times that he was no longer interested in pursuing Mrs. Clinton, in part because he wanted to heal the wounds of a divisive campaign. “I don’t want to hurt the Clintons, I really don’t,” Mr. Trump said during the interview. “She went through a lot and suffered greatly in many different ways, and I am not looking to hurt them at all. The campaign was vicious. ” His reversal on prosecuting Mrs. Clinton was particularly striking given the outsize role the issue played during the presidential campaign, in which her use of a private email server as secretary of state became a prominent theme, and one she has blamed for her loss to Mr. Trump. Mr. Trump said he wanted to “move forward” from the subject. Without elaborating, he said that “we’ll have people that do things,” perhaps a reference to the F. B. I. or Republicans who might continue to press for prosecutions in the email or foundation cases. But the   made clear that he would not seek to pursue an investigation himself nor make it a priority after he assumes office. The decision angered some of his most fervent supporters, who immediately criticized his seeming change of heart. “Broken Promise,” blared the headline on Breitbart News, a conservative news site that has strongly backed Mr. Trump. “It’s not something that I feel very strongly about,” Mr. Trump said at The Times, unlike health care or immigration. “This has been a very painful period of time. ” Clinton aides did not respond to a request for comment about Mr. Trump’s remarks. During their second debate, Mr. Trump turned to Mrs. Clinton and vowed, “If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation, because there’s never been so many lies, so much deception. ” After Mr. Trump’s turnaround on Tuesday, the conservative commentator Ann Coulter, one of his staunchest supporters during the campaign, suggested on Twitter that Mr. Trump was overstepping his role. “Whoa! I thought we elected @realDonaldTrump president,” she wrote. “Did we make him the FBI,  DOJ? His job is to pick those guys, not do their jobs. ” Tom Fitton, president of Judicial Watch, a conservative advocacy group that has been a relentless critic of Mrs. Clinton, said on Tuesday that it would be a mistake for Mr. Trump to drop the threat of appointing a special counsel to look into her email use. Mr. Fitton said that although the F. B. I. had already investigated the matter twice, that inquiry was flawed. His group has gained access to thousands of pages of Mrs. Clinton’s State Department emails through lawsuits and is pressing its case in court even after her defeat. Representative Jason Chaffetz, a Utah Republican who leads the House Oversight and Government Reform Committee, said last week on Fox News that his committee would continue to investigate the matter as well because “we’ve got to get to the truth. ” Mr. Chaffetz’s office said on Tuesday he was unavailable for comment about Mr. Trump’s statements. Although the F. B. I. ’s email investigation is closed, the agency still has an open inquiry into the Clinton Foundation. That inquiry began after the 2015 publication of “Clinton Cash,” a book by Peter Schweizer that asserted that some foreign entities had given money to the foundation in return for State Department favors when Mrs. Clinton was there. The Clintons have denied the assertions. The F. B. I. and Justice Department conduct their criminal investigations largely independently from the White House, so Mr. Trump cannot tell agents to close their cases. A president ordering the F. B. I. to stop a politically sensitive case would be a major scandal. “It does seem like an extraordinary breach of protocol for him to get involved in that decision,” Glen A. Kopp, a former federal prosecutor in New York, said of the  . “I know of no recent circumstances when the president ordered an attorney general not to pursue a criminal matter. ” If, as president, Mr. Trump were to order the F. B. I. director, James B. Comey, to close the foundation inquiry, Mr. Comey could choose to rebuff him. F. B. I. directors are given   terms to insulate them from political pressure, but the president still has the power to fire a director, as President Bill Clinton did with William S. Sessions in 1993 after a Justice Department investigation uncovered ethical abuses by Mr. Sessions. In an interview last week with CBS News’s “60 Minutes,” Mr. Trump said he had not yet decided whether to dismiss Mr. Comey over his handling of the Clinton email investigation, saying the director “may have had very good reasons for doing what he did. ” As a practical matter, though, Mr. Trump’s remarks will probably have little impact. The investigation into Mrs. Clinton’s emails is already closed and, while the one into her family’s foundation remains open, senior F. B. I. officials and career Justice Department officials have said there is little evidence justifying moving forward with a case. When the case comes up for review, senior agents and prosecutors may decide to shut it down, but it will not be because of Mr. Trump’s remarks. While the  ’s decision is likely to frustrate investigators at the F. B. I. who are fiercely protective of their independence to follow the facts they uncover, some legal experts applauded Mr. Trump’s decision to not pursue investigations into Mrs. Clinton’s emails or her family foundation. Rory K. Little, a professor at the University of California Hastings College of the Law, said he was inclined to support both moves by Mr. Trump. A decision to shut down an investigation, he said, “is not out of step with constitutional constraints,” as the Constitution gives the president the power to issue pardons for federal crimes.'"}, "time": 1742564262.0892265}