{"duration": 0.0595700740814209, "input_args": {"text": "'Videos 1,000 Children Face Uncertain Future In Destroyed Calais Jungle Volunteer refugee aid organizations report that children being housed in a shipping container park have inadequate access to food and water. | November 1, 2016 Be Sociable, Share! A migrant stands next to his tent burnt in the makeshift migrant camp known as “the jungle” near Calais, northern France, Wednesday, Oct. 26, 2016. As French authorities finished demolishing Monday the embattled Calais refugee camp, known as the “Jungle,” the fate of over 1,000 children reportedly living in dismal conditions in shipping containers in the cleared camp remained unclear, while thousands of others have been forced into precarious living in the streets of Paris. \\nFrench officials have said that the camp will be completely razed by Monday evening, according to AFP. The infamously-nicknamed “Jungle” previously housed some 6,000 refugees and migrants from Syria, Iraq, Afghanistan, Somalia and other war-ravaged countries. \\nBut while authorities tear down the remaining make-shift shelters, it remains unclear what will happen to the more than 1,000 children that volunteer aid organizations claim are still living in the camp in shipping containers without access to proper food and water. \\n“Once again it seems there were only volunteers on hand to look after the 1,500 residents of the shipping container camp most of whom are minors,” the organization Help Refugees wrote on Facebook Sunday. “Water and food seem not to have been provided by the state. Children have no idea what is happening to them and volunteers equally don’t know what to say and themselves are not allowed into the containers.” \\nFrench authorities have also begun to crack down on other settlements where displaced refugees and migrants have flocked in the face of no formal options. Workers began evicting people Monday by clearing tents and mattresses from Paris’ Stalingrad district, where some 2,000 migrants had been seeking refuge under an overhead transit route, AFP reported. Police in riot gear guarded the area. \\nParis Mayor Anne Hidalgo has urged federal authorities to take concrete steps to address the “dramatic humanitarian and sanitary situation” surging in parts of the city, especially the northeast, the extremity of the city closest to Calais. \\nMeanwhile, President Francois Hollande has said that France will “no longer tolerate” make-shift refugee camps like the Calais Jungle, saying they are “unbecoming of what a French welcome should be.” \\nThe children housed in the shipping container park are reportedly awaiting relocation — the details of which remain unclear. Authorities say they will not demolish a church and mosque in the cleared camp as long as children remain housed in the area. \\nHundreds of refugees and migrants are still hoping to be transferred to the United Kingdom. Advocates have called on the U.K. government to restart and speed up the processes of transferring unaccompanied asylum seeking children from the Jungle in particular. \\nU.K. authorities claim they are addressing the situation, but refugee advocated fear children are being lied to and placed on buses to be shipping elsewhere in France to uncertain conditions.'"}, "time": 1742562223.5197394}