{"duration": 0.2216353416442871, "input_args": {"text": "'United States By ORIENTAL REVIEW \\nThe outcome of the 2016 presidential election will show that the American political system – as we have known it – will apparently cease to exist. Trump is nothing like those Republican pawns who, along with the puppets of the Democratic party, have spent the last 40 years erecting the facade of American democracy. It really looks like he is ready to make good on the threat he made even prior to the Republican National Convention – to send millions of his supporters into the streets. \\nToday Trump represents an entirely new party made up of half of the American electorate, and they are ready for action. And whatever the eventual political structure of this new model, this is what is shaping America’s present reality. Moreover, this does not seem like such a unique situation. It rather appears to be the final chapter of some ancient story, in which the convoluted plotlines finally take shape and find resolution. \\nThe circumstances are increasingly reminiscent of 1860, when Lincoln’s election so enraged the South that those states began agitating for secession. Trump is today symbolic of a very real American tradition that during the Civil War (1860-1865) ran headlong into American revolutionary liberalism for the first time. \\nRight up until World War I traditional American conservatism wore the guise of “isolationism.” Prior to WWII it was known as “non-interventionism.” Afterward, that movement attempted to use Sen. Joseph McCarthy to battle the left-liberal stranglehold. And in the 1960s it became the primary target of the “counter-cultural revolution.” Richard Nixon \\nIts last bastion was Richard Nixon , whose fall was the result of an unprecedented attack from the left-liberal press in 1974. And this is perhaps the example against which we should compare the present-day Trump and his current fight. \\nAnd by the way, the crimes of Hillary Clinton, who has failed to protect state secrets and has repeatedly been caught lying under oath, clearly outweigh the notorious Watergate scandal that led to Nixon’s forced resignation under threat of impeachment. But the liberal American media remains silent, as if nothing has happened. \\nBy all indications it is clear that we are standing before a truly epochal moment. But before turning to the future that might await us, let’s take a quick glance at the history of conflict between revolutionary liberalism and traditional white conservatism in the US. *** \\nImmediately after WWII, an attack on two fronts was launched by the party of “expansionism” (we’ll call it that). The Soviet Union and Communism were designated the number one enemy. Enemy number two (with less hype) was traditional American conservatism. The war against traditional “Americanism” was waged by several intellectual fringe groups simultaneously. \\nThe country’s cultural and intellectual life was under the absolute control of a group known as the “ New York Intellectuals .” Literary criticism as well as all other aspects of the nation’s literary life was in the hands of this small group of literary curators who had emerged from the milieu of a Trotskyist-communist magazine known as the Partisan Review ( PR ). No one could become a professional writer in the America of the 1950s and 1960s without being carefully screened by this sect. \\nThe foundational tenets of American political philosophy and sociology were composed by militants from the Frankfurt School , which had been established during the interwar period in Weimar Germany and which moved to the US after the National Socialists took power. Here, retraining their sights from communist to liberal, they set out to design a “theory of totalitarianism” in addition to their concept of an “authoritarian personality” – both hostile to “democracy.” Max Shachtman \\nThe “New York Intellectuals” and representatives of the Frankfurt School became friends, and Hannah Arendt , for example, was an authoritative representative of both sects. This is where future neocons (Norman Podhoretz, Eliot A. Cohen, and Irving Kristol) gained their experience. The former leader of the Trotskyist Fourth International and godfather of the neocons, Max Shachtman , held a place of honor in the “family of intellectuals.” \\nThe anthropological school of Franz Boas and Freudianism reigned over the worlds of psychology and sociology at that time. The Boasian approach in psychology argued that genetic, national, and racial differences between individuals were of no importance (thus the concepts of “national culture” and “national community” were meaningless). \\nPsychoanalysis also became fashionable, which primarily aimed to supplant traditional church institutions and become a type of quasi-religion for the middle class. \\nThe common denominator linking all these movements was anti-fascism . Did something look fishy in this? But the problem was that the traditional values of the nation, state, and family were all labeled “fascist.” From this standpoint, any white Christian man aware of his cultural and national identity was potentially a “fascist.” \\nKevin MacDonald, a professor of psychology at California State University, analyzed in detail the seizure of America’s cultural, political, and mental landscape by these “liberal sects” in his brilliant book The Culture of Critique , writing: \\n“The New York Intellectuals, for example, developed ties with elite universities, particularly Harvard, Columbia, the University of Chicago, and the University of California-Berkeley, while psychoanalysis and anthropology became well entrenched throughout academia. \\n“The moral and intellectual elite established by these movements dominated intellectual discourse during a critical period after World War II and leading into the countercultural revolution of the 1960s.” \\nIt was precisely this intellectual milieu that spawned the countercultural revolution of the 1960s. \\nRiding the wave of these sentiments, the new Immigration and Nationality Act was passed in 1965, encouraging this phenomenon and facilitating the integration of immigrants into US society. The architects of the law wanted to use the celebrated melting pot to “dilute” the “potentially fascist” descendants of European immigrants by making use of new ethno-cultural elements. \\nThe 60s revolution opened the door to the American political establishment to representatives from both wings of the expansionist “party” – the neo-liberals and the neo-conservatives. \\nBesieged by the left-liberal press in 1974, Richard Nixon resigned under threat of impeachment. In the same year the US Congress passed the Jackson-Vanik Amendment (drafted by Richard Perle ), which emerged as a symbol of the country’s “new political agenda” – economic war against the Soviet Union using sanctions and boycotts. \\nAt that same time the “hippie generation” was joining the Democratic Party on the coattails of Senator George McGovern’s campaign . And that was when Bill Clinton’s smiling countenance first emerged on the US political horizon. \\nAnd the future neo-conservatives (at that time still disciples of the Democratic hawk Henry “Scoop” Jackson) began to slowly edge in the direction of the Republicans. «If there is any doubt about the power of your ideas, just look at the number of members of the Center that have been appointed to posts in this administration -especially in the Department of Defense- to dispel that doubt». Donald Rumsfeld, Secretary of Defense, September 5, 2002 \\nIn 1976, Mr. Rumsfeld and his fellow neo-conservatives resurrected the Committee on the Present Danger , an inter-party club for political hawks whose goal became the launch of an all-out propaganda war against the USSR. \\nFormer Trotskyists and followers of Max Shachtman (Kristol, Podhoretz, and Jeane Kirkpatrick) and advisers to Sen. Henry Jackson (Paul Wolfowitz, Perle, Elliott Abrams, Charles Horner, and Douglas Feith) joined Donald Rumsfeld, Dick Cheney, and other “Christian” politicians with the intention of launching a “campaign to transform the world.” \\nThis is where the neocons’ “nonpartisan ideology” originated. And eventually today’s “inalterable US government” hatched from this egg. \\nAmerican politics began to acquire its current shape during the Reagan era. In economics this was seen in the policy of neoliberalism (politics waged in the interests of big financial capital) and in foreign policy – in a strategy consisting of “holy war against the forces of evil.” The Nixon-Kissinger tradition of foreign policy (which viewed the Soviet Union and China as a normal countries with which is essential to find common ground) was entirely abandoned. \\nThe collapse of the USSR was a sign of the onset of the final phase of the “neocon revolution.” At that point their protégé, Francis Fukuyama, announced the “end of history.” *** \\nAs the years passed, the influence of the neo-conservatives (in politics) and neoliberals (in economics) only expanded. Through all manner of committees, foundations, “think tanks,” etc., the students of Milton Friedman and Leo Strauss (from the departments of economics and political science at the University of Chicago) penetrated ever more deeply into the inner workings of the Washington power machine. The apotheosis of this expansion was the presidency of George W. Bush, during which the neocons, having seized the primary instruments of power in the White House, were able to plunge the country into the folly of a war in the Middle East. \\nBy the end of the Bush presidency this clique was the object of universal hatred throughout the US. That’s why the middle-ground, innocuous figure of Barack Obama, a Democrat, was able to move into the White House for the next eight years. The neocons stepped down from their central rostrums of power and returned to their “influential committees.” It is likely that this election was intended to facilitate the triumphant return of the neoconservative-neoliberal paradigm all wrapped up in “new packaging.” For various reasons, the decision was made to assign this role to Hillary Clinton. But it seems that at the most critical moment the flimsy packaging ripped open … \\nWhat happened? Why is this clique’s triumphant return to power erupting in massive scandal this time around? Probably because we are living in an era during which much that was mysterious is suddenly becoming clear. Probably because Trump’s “silent majority” suddenly saw before them someone they had been waiting for for a long time – a man ready to defend their interests. \\nPerhaps also it is because the middle class is choking on its growing exasperation with the “elite caste” occupying its native country. And it finally became clear to the sober-minded American patriots in law enforcement that the return to power of the people responsible for the current global chaos could be a big threat to the US and rest of the world. Because, in the end, everyone has children and no one wants a new world war. \\nHow will this new conservative revolt against the elite end? Will Trump manage to “drain the swamp of Washington, DC” as he has promised, or he will end up as the system’s next victim? Very soon we can finally get an answer to these questions. RELATED POSTS'"}, "time": 1742561658.2145972}