{"duration": 0.09413385391235352, "input_args": {"text": "'Merkel says Facebook, Google ‘distort perception,’ demands they ‘reveal algorithms’ Published time: 26 Oct, 2016 20:53 Get short URL Germany\\'s Chancellor Angela Merkel © Francois Lenoir / Reuters German Chancellor Angela Merkel launched a broadside at internet media giants, accusing them of “narrowing perspective,” and demanding they disclose their privately-developed algorithms. Merkel previously blamed social media for anti-immigrant sentiment and the rise of the far right. \\n“The algorithms must be made public, so that one can inform oneself as an interested citizen on questions like: what influences my behavior on the internet and that of others?\" said Merkel during a media conference in Berlin on Tuesday. \\n“These algorithms, when they are not transparent, can lead to a distortion of our perception, they narrow our breadth of information.” \\nGoogle uses an algorithm to decide which search results are first shown to a user, while Facebook arranges the order of the news feed, and decides to include certain posts from a user’s liked pages and friends, at the expense of others. Both sites also promote links to news articles, often based on a user’s own media interests. Read more Germany orders Facebook to stop collecting data on WhatsApp users \\nThese algorithms are at the core of the intellectual property of any social media or search website, and comprise some of the most highly-protected trade secrets in the world, potentially worth billions. No internet giant has ever revealed its inner workings. \\nMerkel did not specifically name Facebook, Google or Twitter, but implied that the large platforms are creating “bubbles” of self-reinforcing views, and squeezing out smaller news providers. \\n\"The big internet platforms, via their algorithms, have become an eye of a needle which diverse media must pass through to reach users,” warned Merkel. “This is a development that we need to pay careful attention to.” \\nThe internet giants themselves have argued that the so-called social media bubble is largely a myth, and that online users have a wider access to differing views than under a pre-internet model, where most news would be acquired from just a handful of newspapers and one or two TV channels. German establishment raises ‘Sword of Damocles’ over social media \\nThis is not the first attack on social media by Merkel and her Grand Coalition government, and while the German politician advocates diversity of views, she has previously accused it of perpetrating opinions that are most at odds with those of the establishment and traditional media. Read more AfD vows to become 3rd largest force in Germany as Merkel admits refugee crisis was ‘out of control’ \\nLast month, Merkel accused AfD, the recently-established anti-immigrant and anti-Muslim party, which receives overwhelmingly negative coverage in most newspapers, of “spreading their lies” through social media, as it achieves breakthroughs in regional elections around the country. \\nA year ago, at the height of the refugee influx into the country, Merkel, who was first elected in 2005, was caught on a hot mic personally pressing Facebook CEO Mark Zuckerberg to clamp down on anti-migrant posts during a UN session in New York. \\nA fortnight ago, the leader of Merkel’s parliamentary CDU faction, Volker Kauder, said that social media should be fined €50,000 for failing to remove “hate speech,” saying that a “Sword of Damocles” has to hang over social media. Kauder also called for warnings, similar to those on cigarette packs or before entering pornographic websites, to be given to those about to go on social media. FILE PHOTO: German Chancellor Angela Merkel speaks with Facebook founder and Chief Executive Officer Mark Zuckerberg (C) and Google CEO Eric Schmidt (R) at the G8 Summit in Deauville May 26, 2011 © Philippe Wojazer / Reuters \\nJustice Minister Heiko Maas – who said that there had been a 77 percent increase in hate crimes following the arrival of 900,000 asylum seekers – has given internet media companies until February next year to comply with EU directives on xenophobia and racism, or face legal action.'"}, "time": 1742561745.4264557}