{"duration": 0.12063384056091309, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nAs the Iraqi army advanced further into east Mosul today, Isis fighters responded by firing mortar shells into the Gogjali district that had been freed earlier in the week. We met the families fleeing the mortar barrage crammed into their battered cars and pick-ups at an army checkpoint at Bartella a dozen miles down the road. We had been told we could not go any further because it was too dangerous and Isis fighters were firing at the road not far ahead between Bartella and Mosul. \\n“We thought we had got rid of Daesh [Isis] and then they started firing mortars at us,” said one middle-aged woman in black robes. She added that a rocket had landed on her neighbour’s house in the morning and killed him and three women. She expressed hatred for Isis and said that when Iraqi soldiers had knocked at her door and asked for information about Isis positions, her small son Yusuf, who looked about eight, had gone to show them the nearest Isis headquarters. \\nThe people escaping from the eastern side of Mosul give a convincing picture of what is happening there as the army moves forward. Mehdi, a former metal worker but jobless since Isis captured Mosul in June 2014, said that the shelling had started at 8am and had gone on for an hour. He had put his wife and seven children into their car and driven out of the city without much idea of where they were going, so long as it was safe. \\nMehdi confirmed reports that Isis were withdrawing from the eastern side of Mosul, which is separated from the western side by the Tigris River. “They are leaving some two or three fighting positions behind in every district and the fighters there are being killed,” he said. All the local Iraqi fighters were leaving and those who stayed behind were foreign members of Isis. Asked about their nationality, Mehdi said he did not know because he never went near them. He pointed to a cigarette packet in his shirt pocket and said: “We cannot talk to the foreigners because as soon as they smell cigarette smoke from you, they send you off to be whipped.” \\nThere is no doubt that the great majority of people in Mosul will be glad to get rid of Isis with its cruelty, violence, subjugation of women and religious bigotry. But it is not at all clear what comes next. Isis is likely to lose Mosul, but it will not go wholly out of business in Iraq or anywhere else. It is already resorting to guerrilla raids such as one today when a group of Isis fighters took over a mosque and part of the town of Shirqat, 60 miles south of Mosul, and were resisting counter-attack. They did the same in Kirkuk last month when 100 Isis fighters mysteriously invaded the centre of the oil city. \\nBut the effect of the recapture of Mosul, the second largest city in Iraq, on the morale and war-making capacity of Isis should be great. Isis will no longer have the human and financial resources of the self-declared Caliphate, at its peak a powerful administrative machine, to support its campaign of slaughter at home and abroad. The very fact of defeat is likely to be damaging for a movement that claimed its victories were divinely inspired. \\nAnother point seldom noticed will make it difficult for Isis to revert to guerrilla warfare of the type that it has waged in the past. The secret network of supporters and helpers that once sustained al-Qaeda in Iraq, and Isis in its early days, no longer exists. When Isis became the ruler of the area where it had previously had a hidden presence, its local activists came out of hiding and became the new rulers. But with Isis on the retreat and losing its territory, its old guerrilla networks are paying a price for becoming too visible during their day of triumph. \\nIsis may be weaker, but this does not mean that it is no longer to be feared. Security may be greater for the minorities living in the Nineveh Plain, the flat land east of Mosul city that was once home to half a million people who might be Christians, Sunni Arabs, Shabak (who speak their own language and mostly Shia), Yazidis or Kakai. The security for these people has improved, but only by comparison with what went before when they were persecuted and driven out by Isis. \\nThe television pictures since the anti-Isis offensive began on 17 October are deceptively similar to newsreel of French villagers greeting allied armies in France in 1944. “The media is full of talk of the ‘liberation’ of Mosul and the surrounding Nineveh villages,” comments one expert on the area. “I will not speak about ‘liberation’ until the displaced civilians, and especially the powerless minorities, are able to go back to their homes and live in peace and dignity, with a credible guarantee of security.” \\nThere were no signs of any such guarantee being given anywhere on the Nineveh Plain today. People who wanted to go back to Bartella, for the first time in two years, were being held back at army checkpoints and those who were hoping to welcome relatives trapped in Mosul for two years were left staring at an empty road. There were only a few vehicles with frightened drivers and poles bearing ragged white flags sticking out of the windows. \\nNot far from Bartella, there is the empty Syrian Catholic town of Qaraqosh which once had a population of 44,000 who fled in 2014. Yohanna Towara, a local community leader, explains that when they come back they will find that their homes have been destroyed. He says that “my brother’s house was destroyed by an airstrike [by the US-led coalition] and my house was damaged. Daesh [Isis] burned the other houses before they left and they have all been looted a long time ago.” Even where houses are still standing, there is no water or electricity or likelihood of it being restored any time soon. Many of the former residents have already migrated to Australia, France and other parts of the world. \\nThe chances of restoring any form of security to the Nineveh Plain depends on first of all capturing Mosul from which Isis has destabilised the whole of northern Iraq. It will take time to discover if Mosul is going to be destroyed as well as “liberated”, as has already happened to the Syrian Kurdish city of Kobani in Syria and the Sunni Arab city of Ramadi in Iraq. It is also unclear if Isis will be able to revert to guerrilla warfare, to which its tactics of using suicide bombers alongside well-trained and fanatical infantry, are well-suited. \\nIt was difficult not to wonder today how soon the Sunni Arabs, who were fleeing Mosul because of a mortar barrage, would be able to go back. It may be that the conflict in Iraq is not going to end with any form of power-sharing, as so often recommended by foreign powers, but because the war has finally produced winners and losers – and the people of Mosul will be among the latter. (Reprinted from The Independent by permission of author or representative)\""}, "time": 1742562222.61211}