{"duration": 0.0715024471282959, "input_args": {"text": "'WASHINGTON  —   A Democrat on the Federal Election Commission is quitting her term early because of the gridlock that has gripped the panel, offering President Trump an unexpected chance to shape political spending rules. The commissioner, Ann M. Ravel, said during an interview that she would send Mr. Trump her letter of resignation this week. She pointed to a series of deadlocked votes between the panel’s three Democrats and three Republicans that she said left her little hope the group would ever be able to rein in campaign finance abuses. “The ability of the commission to perform its role has deteriorated significantly,” said Ms. Ravel, who has sparred bitterly with the Republican election commissioners during her three years on the panel. She added, “I think I can be more effective on the outside. ” Her departure will probably set off an intense political fight over how a new commissioner should be picked. By tradition, Senate Democrats would be allowed to select the replacement, but, by law, the choice belongs to the president, and Mr. Trump has shown little interest in Washington customs. The outcome could have a major impact on a commission long derided for inaction, even as record amounts of money have poured into campaigns. Spending during last year’s presidential and congressional races exceeded $6. 9 billion, according to data from the Center for Responsive Politics, as “super PACs” and other outside groups spent freely as a result of the Supreme Court’s 2010 Citizens United decision. Mr. Trump can pick a nominee himself so long as he does not choose a registered Republican, said Richard L. Hasen, an election law scholar at the University of California, Irvine. The panel, which already has three Republicans, cannot have more than three members from any political party. Mr. Hasen said he would not be surprised if Mr. Trump made the pick himself, especially because his White House counsel, Donald F. McGahn II, was an election commissioner himself and has pushed fiercely for deregulating campaign finance. “It would be transformative,” Mr. Hasen said, if the president nominated someone more aligned with the panel’s Republican members to push for even further deregulation. Mr. Trump has promised to “drain the swamp” of special interest money in Washington, but his record so far has been mixed. While he claimed repeatedly during the campaign that he was “ ” his run, Mr. Trump and organizations supporting him took in nearly $600 million, and he put in far less than the $100 million of his own money that he had pledged. Since taking office, the president has strengthened some rules on lobbying by former members of the executive branch, but ethics experts have also criticized him for failing to fully disentangle himself from his vast financial interests. Ms. Ravel acknowledged she was concerned that Mr. Trump might seek to name her replacement himself. “But I’m hoping that he will understand the need to appoint people who actually believe in the mission of the agency and will carry out the mandates of the law,” she said, but added, “I don’t know what will happen. ” Her claims that Republican commissioners have been unwilling to rein in obvious violations and abuses have drawn wide attention  —   as well as angry rebukes from those Republicans, who have accused her of grandstanding and of exaggerating the problem. The publicity even earned Ms. Ravel an appearance on “The Daily Show,” where her interviewer suggested the commission had become as irrelevant as male nipples. Ms. Ravel said she would return to California, where she had served as a state regulator in identifying millions of dollars in “dark money” that flooded California elections. She considered leaving the commission last year, she said, but decided to stay through the election after President Barack Obama had asked her to do so. While Ms. Ravel will be leaving only two months shy of the end of her term, commissioners have routinely remained well past the end of their terms because of the difficulty in agreeing on replacements. All the other current members are serving well beyond the end of their terms, with one Democrat, Ellen L. Weintraub, now nearly a decade past her term’s 2007 end date. Ms. Ravel plans to release an analysis her office has prepared on what she says is the worsening gridlock at the commission. The title sums up her feelings: “Dysfunction and Deadlock: The Enforcement Crisis at the Federal Election Commission Reveals the Unlikelihood of Draining the Swamp. ” By her analysis, the rate of deadlocked votes blocking “substantive” enforcement actions against possible campaign violations has reached a new high of 37. 5 percent. And, in such cases, she said, financial penalties against campaigns have dropped significantly over the last decade. But, as with many issues at the election commission, Ms. Ravel and her Republican counterparts are sharply at odds over the panel’s performance. Lee E. Goodman, a Republican commissioner, called her analysis “nonsensical and arbitrary,” saying that deadlocked votes were actually far more unusual. Ms. Ravel has continued to push “the tired meme of dysfunction” simply to make her political case, he said. His own data, he added, indicates that campaigns are complying with finance laws far more than before. Mr. Goodman suggested that “contrary to the spin” from Democrats, “the situation has indeed changed, but for the better. ”'"}, "time": 1742562549.6713955}