{"duration": 1.7383978366851807, "input_args": {"text": "'CLEVELAND  —   President Obama on Friday implored voters here to “reject a dark and pessimistic vision” offered by Donald J. Trump and urged a robust turnout on behalf of Hillary Clinton in a state where the presidential candidates are locked in a   contest. Following by a day Michelle Obama’s deeply personal denunciation of Mr. Trump, the president also assailed the Republican nominee as a morally compromised and intellectually inferior person who fakes his concern for the working class in America. “The guy spent 70 years on this earth showing no regard for working people,” Mr. Obama said, describing Mr. Trump as a wealthy opportunist who is pretending to be something he has never been. “And then suddenly, he’s going to be the champion of working people? Come on. Come on, man. ” Mr. Obama cited a litany of statements from Mr. Trump as evidence that the Republican nominee is unfit to be president, and said people do not have to be “a husband or a father” to know that Mr. Trump’s comments about women were unacceptable. “You just have to be a decent human being,” Mr. Obama told a crowd of Democrats at a rally on the banks of Lake Erie, with Cleveland skyscrapers as a backdrop. The president’s searing critique of Mr. Trump is an indication of the Clinton campaign’s hope that it can emerge victorious in Ohio despite recent polling that suggests a very close race in the Buckeye State. Just weeks ago, Ohio  —   with its many economically struggling communities of mostly white,   voters  —   seemed to be trending toward Mr. Trump, with several polls indicating a small lead for the Republican nominee. Mrs. Clinton went several weeks this fall without visiting the state. But the avalanche of news since the publication of a lewd recording in which Mr. Trump demeans women appears to have benefited Mrs. Clinton’s chances here. An NBC   Street   poll released Friday showed the race in Ohio between Mr. Trump and Mrs. Clinton essentially tied among likely voters, with Gary Johnson, the libertarian candidate, getting almost 10 percent of the vote. For Mrs. Clinton to win Ohio’s 18 electoral votes, she will need overwhelming support in   centers like Cleveland, where slightly more than half of the residents are black. Early voting began this week, and Mr. Obama on Friday repeatedly urged the crowd and those watching on television to take nothing for granted. “Ohio is always close,” Mr. Obama told the crowd. “You can go vote early right now. Early voting started on Wednesday. This is an opportunity for you to exercise your right to vote, your civic responsibility. ” The president’s stump speech has evolved over the last several weeks, with Mr. Obama testifying to Mrs. Clinton’s qualifications, but also lashing out at Mr. Trump in increasingly blunt terms. As Mrs. Obama was in her assault on Mr. Trump in New Hampshire on Thursday, the president has become unleashed in his criticism of the Republican nominee. In a speech Thursday night to Democrats in Columbus, Ohio, Mr. Obama assailed what he called “the swamp of crazy” that Republicans have allowed to fester in recent years. He said Mr. Trump was merely the outgrowth of a political worldview that Republicans have increasingly embraced in Washington and around the country. “You claim the mantle of the party of family values, and this is the guy you nominate?” Mr. Obama told the crowd in Columbus. “You’re the party that is tough on foreign policy and opposes Russia, and then you nominate this guy, whose role model is Vladimir Putin, the former head of the K. G. B.? I’m sorry, what happened?” Mr. Obama repeated that criticism of Republicans on Friday morning, blaming the party’s elected officials for failing to stand up to Mr. Trump’s brand of politics until polls showed that it might damage their own fortunes. “Republicans who knew better stood by silently and even during the course of this campaign didn’t say anything,” Mr. Obama said. He acknowledged that a number of Republicans have denounced Mr. Trump in the wake of the lewd recording, but added, “What, you weren’t appalled earlier when he was saying degrading things about women?” During much of his speech, Mr. Obama seemed almost bemused by the turn the campaign has taken, with Mr. Trump becoming an easy target for the president’s criticism on domestic policy, foreign affairs and personal temperament. But the president clearly understands that Mrs. Clinton needs help in establishing the kind of passionate connection with voters that he had in 2008. Several times during his remarks, Mr. Obama described Mrs. Clinton as tough and qualified and urged voters to embrace her. During the campaign, he said, Mrs. Clinton has not been “complaining or whining or fighting. ” “She was just doing the work,” he said. “And that’s what you want from a president: someone who is going to sit there and do the work for you. ” As he has in the past, Mr. Obama described his   secretary of state as the most qualified person ever to seek the presidency. He said “she’s going to be great at it,” and he urged those who supported Bernie Sanders, the Vermont senator who challenged Mrs. Clinton in the primaries, to back her now. “If you ‘felt the Bern’ in the primaries, you need to vote,” he said to big cheers from the crowd. But in the end, the case Mr. Obama made Friday morning was to reject Mr. Trump. His voice rising in a singsong cadence, the president said that courtesy, equality, honesty and kindness were all on the ballot. “Democracy itself is on the ballot right now,” the president bellowed above a roar from the crowd. “Send a message of progress. Send a message of hope. ”'"}, "time": 1742562480.518631}