{"duration": 0.05171084403991699, "input_args": {"text": "'Radio Aryan October 27, 2016 \\nSven Longshanks joins Matthew Heimbach to discuss the ongoing fall out from President Hollandeâ\\x80\\x99s treacherous solution to the Calais jungle problem. Instead of rounding all the invaders up with extreme prejudice and sending them back to Libya, he has decided to make every town in France a gift of 50 jungle monkeys each. He must love what they have done to Calais so much, that he wants the same for every town in the country. Diversity really does mean destroying every White community in the world by filling then all up with a quota of hostile invasive species. \\nSven brings us the shocking news that five â\\x80\\x98Syrian migrant childrenâ\\x80\\x99 have already gang raped a child at the British childrenâ\\x80\\x99s home they were placed in this week. These â\\x80\\x98unaccompanied minorsâ\\x80\\x99 were supposed to only be coming to Britain if they had family in the country, but thanks to an amendment added to the law by a Jew called Dubs, any brown person claiming to be under 18 whose life would be better in Britain than where they are now, has to be let in. This stupid law means that every juvenile in the third world could lay claim to a right to be allowed into Britain. This Jew is directly responsible for that child being raped and Matt reminds us of the fact that it is traitors in our own governments everywhere who are doing this to us. \\nGeorge Soros and other global players have been funding the criminals at Calais while they lie in wait to ambush a lorry and break into Britain and we see similar patterns emerging there that we see among the other groups that he funds. Black Lies Matter burned down Ferguson and the squatters at Calais burned down the Jungle last night too, but not before first taking some time out for another gang rape. Sven points out that this goes on regularly in Africa where it costs little to replace a burned down straw hut or dung shelter, but in the developed world it costs a fortune to repair the damage these Blacks cause. \\nAfter bringing up the subject of how much it costs to care for those who hate us, Matt brings us some good news on the British economy, which we had been told by the lying media was bound to plunge into recession if there was a vote to leave the EU. It has actually increased by a percentage and Sven finishes the podcast by giving us a quick rundown of the state of play with Brexit, the Conservative Party and UKIP, who it is hoped will soon be led by Paul Nuttall. \\nPresented by Matthew Heimbach and Sven Longshanks \\nThe Daily Traditionalist: The Calais Cancer Metastasizes â\\x80\\x93 DT 102716'"}, "time": 1742563294.9143739}