{"duration": 0.06409525871276855, "input_args": {"text": "'Stomach upset Sleep problems Evaluate the stresses in your life and work on the one or two items over which you have some control. For example, if the clutter in your home is driving you nuts, take an hour a day for the next week to de-clutter your living space. When that it done, tackle the next item. The idea is to set aside and forget about those items you cannot control – you will only frustrate yourself and set yourself up for failure. It always surprises me how great a difference even the smallest change can make to one’s well-being. 4. Embrace herbal remedies and essential oils as an alternative to traditional expensive and potentially toxic pharmaceuticals and over-the-counter drugs. You will be amazed at how effective Melaleuca (tea tree), Lavender, Peppermint, Oregano and other essential oils can be in solving most minor health concerns. (Read the article A Big Fat List of Essential Oils for Preppers .) Likewise, tinctures and teas made from herbs (try Ginger tea) along with some honey can be used to heal a variety of maladies from the inside out. Just keep in mind that learning to use herbals and essential oils takes practice so, like growing a garden, you need to learn what works and what doesn’t. Once you do, you will be amazed at the results. Without being overly simplistic, working on these four aspects of health preparedness will go a long way toward seeing us through a disaster, a personal or economic crises or even SHTF. But there is more to it than simply good health. Medical Preparedness – An Open Letter to Preppers A while back, Contributing Author Joe Alton provided me with an “Open Letter to Preppers” regarding the importance of medical preparedness. Let me share it with out. Hey Prepper Nation, After gathering food and building a shelter, many people in the preparedness community consider personal and home defense to be the next priority in the event of a societal collapse. Certainly, defending oneself is important, but have you thought about defending your health? In a situation where power might be down and normal methods of filtering water and cleaning food don’t exist, your health is as much under attack as the survivors in the latest zombie apocalypse movie. Infectious diseases will be rampant in a situation where it will be a challenge to maintain sanitary conditions. Simple chores, such as chopping wood, commonly lead to cuts that could get infected. These minor issues, so easily treated by modern medical science, can easily become life-threatening if left untreated in a collapse scenario. Don’t you owe it to yourself and your family to devote some time and effort to obtain medical knowledge and supplies? The difficulties involved in a grid-down situation will surely put you at risk for sickness or injury. It’s important to seek education so that you can treat infectious disease and the other ailments that we’ll see. There will likely be a lot more diarrheal disease than gunfights at the OK corral. History teaches us that, in the Civil War, there were a lot more deaths from dysentery than there were from bullets. Some say “Beans, Bullets and Band-Aids”, but I say “ Beans and Band-Aids, then Bullets ”. I suppose, as a physician, that’s not too surprising. If you make the commitment to learn how to treat medical issues and to store medical supplies, you’re taking a genuine first step towards assuring your family’s survival in dark times. The medical supplies will always be there if the unforeseen happens, and the knowledge you gain will be there for the rest of your life. Many medical supplies have long shelf lives; Their longevity will one of the factors that will give you confidence when moving forward. It’s important to know some illnesses will be difficult to treat if modern medical facilities aren’t available. It will be hard to do much about those clogged coronary arteries; there won’t be many cardiac bypasses performed. However, by eating healthily and getting good nutrition, you will give yourself the best chance to minimize some major medical issues. In a collapse situation, an ounce of prevention is worth, not a pound, but a ton of cure. Start off healthy and you’ll have the best chance to stay healthy. When I say to obtain medical knowledge, I am also encouraging you to learn about natural remedies and alternative therapies that may have some benefit for your particular medical problem. Essential oils , herbal remedies, and other time-honored methods of healing should not be overlooked as you put together your medical supplies. I cannot vouch for the effectiveness of every claim that one thing or another will cure what ails you; suffice it to say, that our family has an extensive medicinal garden and that it might be a good idea for your family to have one, also. Many herbs that have medicinal properties grow like weeds, so a green thumb is not required to grow them. Many of them do not even require full sun to thrive. Even the White House garden has a collection of these beneficial plants. I’m not asking you to do anything that your great-grandparents didn’t do as part of their strategy to succeed in life. In a collapse situation we’ll be thrown back, in a way, to that era. We should learn some lessons from the methods they used to stay healthy. Those homespun skills will give you a head start to being an effective medic for your family. The non-prepper members of my family wonder why I spend all my time trying to prepare people medically for a collapse situation. They tell me that I can’t turn everyone into doctors, so why I should try? Am I trying to turn you all into doctors? No, there’s too much to learn in one lifetime; even as a physician, I often come across things I’m not sure about. That’s what medical books are for, so make sure that you put together a library. You can refer to them when you need to, just as I do. I AM trying to turn you into something, however: I’m trying to make you a better medical asset to your family and/or survival community than you were before. If you can learn how to treat common illnesses and injuries in times of trouble, I will have succeeded in my mission. Dr. Bones —– This is good advice and a reminder to all of us that our work is never done. We must continue to educate ourselves and continue to acquire skills so that we can truly be an asset rather than a burden to our survival community. The Final Word Surviving the unthinkable is something I hope we will never have to do. But if the worst happens, I want to be in top shape both mentally and physically. This is not rocket science. It is simply a common sense solution to some universal problems we Americans have when it comes to taking care of ourselves. Enjoy your next adventure through common sense and thoughtful preparation! Submit your review'"}, "time": 1742628471.0555804}