{"duration": 0.038251399993896484, "input_args": {"text": "'Hollywood celebrities took to Twitter Thursday to weigh in on the airstrikes in Syria authorized by U. S. President Donald Trump in retaliation for an earlier chemical weapon attack by Syrian president Bashar  . [While many of those celebrities who reacted to the strikes condemned the president and called him a “hypocrite,” a number of stars reacted with both shock and sadness.  Actress Kerry Washington wrote simply that she was “heartbroken,” while actress Lena Dunham turned to prayer. Below is a sampling of Hollywood’s reaction to the American airstrikes in Syria. 🚽Bombing Syria Will,🙏🏻 Stop Assad Gassing His Ppl, BUT🚽Has NO Strategy, Or, Diplomacy‼️ TURKEY  RUSSIA WINNERS‼️🚽IN HORNETS NEST, OVER HIS👨  —   Cher (@cher) April 7, 2017,  Wait. What?! Heart breaking. #Syria,  —   kerry washington (@kerrywashington) April 7, 2017,  These two damaged creeps are committing mass murder and they shouldn’t even be allowed to own fish as pets. pic. twitter.   —   Patton Oswalt (@pattonoswalt) April 7, 2017,  Hadnt seen the news. The only thing to tweet right now is a prayer for peace and safety.  —   Lena Dunham (@lenadunham) April 7, 2017,  If you support bombing Syria because they were attacked with Chemical Weapons, but u supported banning Syrian refugees ur a fuckin hypocrite,  —   DL Hughley (@RealDLHughley) April 7, 2017,  It’s sad that politicians can’t find money for education, clean water or healthcare but they can spend millions to ”send a message to Syria”  —   Trevor Noah (@Trevornoah) April 7, 2017,  Trump on Syria: ”No child of God should suffer such horror.” BUT NO WAY, NOPE. THEY CAN’T COME HERE.  —   George Takei (@GeorgeTakei) April 7, 2017,  What’s that? pic. twitter.   —   Margaret Cho (@margaretcho) April 7, 2017,  Moved enough by innocent casualties to excuse bombing them, but not enough to accept refugees. War is a game of hypocrisy  greed #Syria,  —   Lauren Jauregui (@LaurenJauregui) April 7, 2017,  I just wish I could trust that this  President is competent,  —   Mia Farrow (@MiaFarrow) April 7, 2017,  he thinks he is on the apprentice  —   with his fake set in florida  —   like qvc  —   like palin had in alaska  —   a taped message   audio  —   WTHF,  —   ROSIE (@Rosie) April 7, 2017,    Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564290.031473}