{"duration": 0.24093055725097656, "input_args": {"text": "'This year’s holiday advertising campaign for the United States Postal Service featured a little girl’s stunningly infectious musical plea: “I Want a Hippopotamus for Christmas. ” (And, as she explains, “Only a hippopotamus will do. ”) The ditty was, perhaps, unfamiliar to many listeners, but it penetrated the mind space of the unwary at warp speed  —   and stayed there. Resistance was futile. Unexpectedly, the song has also upended the quiet retirement of Gayla Peevey, 73, a former child star who recorded the novelty hit in 1953. At the time, the song landed her on the Ed Sullivan show “Toast of the Town. ” Since November, television viewers have been able to enjoy (and enjoy) that same recording in the omnipresent post office commercial. “The song could drive you crazy,” Ms. Peevey conceded. But it doesn’t drive her crazy  —   not at all. “I love hearing it, and I can’t hear it too much,” she said recently by telephone. Before all the recent hippo hoopla, Ms. Peevey, the former owner of a boutique advertising agency in El Cajon, Calif. had spent her days immersed in good works:   for nonprofits and serving on the board of one of them singing in her church choir leading a Bible study group for women. She and her husband of 53 years, Cliff Henderson, a retired elementary school teacher, frequently drive to Los Angeles from their home in La Mesa to visit their daughter,    and three grandchildren. There are   trips to Hawaii with three other couples, weekly taco nights with those travel companions and “date day” every Friday with Cliff. A full and active life, yes. But a few years ago, Ms. Peevey  —   generally a sunny soul  —   was starting to feel a little down. “I saw other people retiring from these big careers, and I started to wonder, ‘What have I really accomplished in life? ’” she said. “I really prayed about it. And I think God decided to throw some blessings on me. ” Ms. Peevey was aware, of course, that the Lord works in mysterious ways, so she’s not at all certain how her childhood recording was rediscovered. Satellite radio, she speculated, or perhaps the internet. But here’s what she knows for sure: “I Want a Hippopotamus for Christmas”  —   which peaked 63 years ago at No. 24 on the Billboard chart  —   has become a viral sensation. (A    video of Ms. Peevey’s “Toast of the Town” appearance  —   she’s in a party frock and hair ribbon and halts a game of jacks with her playmates to belt out her singular wish  —   has had more than four million views on YouTube recent comments include, “This song is stuck in my head. ”) But the people at the Postal Service were not the first to harness the power of the song. In 2008, Hallmark came out with a   tree ornament that plays the earworm of a tune, written by the songwriter John Rox. (His other hit was “It’s a Big, Wide Wonderful World,” recorded in 1949 by Buddy Clark.) Hallmark has brought the ornament back four more times, including during the 2016 holiday season. Look for it again next year. Gretchen Wilson, a country music singer, recorded the song on a Christmas album that was released in 2009. LeAnn Rimes, another country singer, followed suit in 2014, but said she could never hope to equal Ms. Peevey’s inimitable sound. Thanks to the resurgence in the song’s popularity, Ms. Peevey  —   who goes by the surname Henderson except for   matters  —   has been deluged with calls and emails from newspapers, television stations and fans all over the world. Royalty checks in amounts ranging from a few hundred dollars to $1, 000 have been rolling in  —   more about this in a minute. “It’s like a whole new world,” she said. Actually, it’s something of a return to the world Ms. Peevey inhabited as a cute, blond    from Oklahoma City. After her record took off, going out in public became an impossibility. “It was crazy,” she remembered. “People were looking and pointing. I got mobbed everywhere I went. ” Ms. Peevey said she started singing “practically out of the womb. ” “I can’t remember when I didn’t sing,” she continued. “I really can’t. ” From an early age, she was a mainstay of the church choir in Ponca City, Okla. where her family moved in 1948. There she put on backyard shows for the neighbors and sang at community events. Her robust voice with its country sheen was a force of nature. An uncle who played fiddle on a radio show broadcast from Oklahoma City arranged a guest spot for Gayla when she was 8 it led first to a   gig on   (now KFOR) the local NBC affiliate, then to a regular spot on “Saturday Night Revue,” an NBC variety show that was a summer replacement for “Your Show of Shows. ” Hoagy Carmichael was the host. “I sang duets with him,” Ms. Peevey recalled. “There was one of his songs, ‘Two Sleepy People,’ and I sang harmony  —   it was very fun. ” Guest stars included Jimmy Durante and Dean Martin, with whom Ms. Peevey performed during her first appearance on the program. And every week the show booked a different big orchestra, “so I got to sing with Les Brown and Jerry Fielding and David Rose,” she said. “Plucked out of local television  —   it was a big jump. But they were so nice to me because I was a kid. ” Then came the contract from Columbia Records. The very first song that Mitch Miller, then a Columbia executive, brought to Ms. Peevey was “I Want a Hippopotamus for Christmas. ” She recorded it in New York with Mr. Miller playing the oboe and leading the orchestra. “I didn’t have to sing it that many times,” she recalled. “I would say the third time was the take. ” She introduced the song on “Toast of the Town,” though not without considerable drama beforehand: Her manager canceled an exclusive contract with NBC so that she could appear on the rival network CBS, home of Mr. Sullivan’s show  —   “and I didn’t get another NBC contract after that,” Ms. Peevey said. “I don’t know if the manager made the best decision, but everybody watched Ed Sullivan,” she said. “The record took off and was a big hit. ” In a   media event at the end of 1953, a real, live hippopotamus from the Central Park Zoo was shipped to Oklahoma City as a Christmas present for young Gayla she donated it to her local zoo. At the time, Ms. Peevey said, “there was talk that my career was going to be huge. ” But things didn’t turn out that way, and the producers at Columbia Records may have been part of the problem. “After the hippo song, they thought, ‘Well, that was a big hit,’ so every song they gave me after that was an animal song and they were not good songs, let me tell you,” Ms. Peevey said. She was occasionally teamed with a fellow child star, Jimmy Boyd, singer of the   “I Saw Mommy Kissing Santa Claus. ” “My parents didn’t know that they could speak up and say, ‘Is this really the best song? ’” she continued. “In Oklahoma, I was used to singing ‘Your Cheatin’ Heart’ and ‘Walkin’ My Baby Back Home’ and all of those adult songs that I could really sink my teeth into. ” Ms. Peevey’s father, Lewin, a tax collector, and her mother, Irene, a homemaker, were the antithesis of stage parents, not particularly keen on show business and uncertain about how to deal with Gayla’s sudden fame. “They decided that they wanted to take me out of show business so I could have a normal life,” she said. “They pulled the plug, and I was a kid so I didn’t have any say. ” But Ms. Peevey said she was “kind of happy” to get away from all the hubbub. Part of pulling the plug involved a move to Southern California, where she was just another student at the local junior high school. “What a shock it was,” Ms. Peevey remembered. “Nobody knew who I was, and I realized I was lacking some basic social skills that I hadn’t had to develop. ” “I was so used to everybody clamoring for me and coming to me,” she explained. “I didn’t have a lot of experience in reaching out and being a friend. I had a big learning curve in that regard. ” But that was not the only adjustment. To retire as a child star packs a particularly unpleasant wallop. “You have this sort of feeling that you’re a   at 12,” Ms. Peevey said. “That was the thing I had to deal with  —   that I had already peaked. ” She had a bit of a comeback at 16 when “My Little Marine,” a song she wrote and recorded under the name Jamie Horton, made it into the top 100 on Billboard. Another tune, “Robot Man,” “did pretty well, but nothing took off as it did when I was a child,” Ms. Peevey said. “I can see where child stars get into trouble as far as not being able to negotiate the transition to adult performer, and it can be very devastating if you’re not grounded. ” After getting a degree in elementary education, she briefly taught school in San Diego. “But it wasn’t for me,” Ms. Peevey said. Instead, she opened a small advertising business while raising her daughter, Sydney, who inherited Mom’s musical chops. It was Sydney who did a little research three years ago and learned that Ms. Peevey had an account at Sony Music, now the parent company of Columbia. “They were holding funds of just under a hundred grand that had been adding up since 2008,” Ms. Peevey said. “I couldn’t believe it. It’s pretty fun. ” She also has royalties coming in from sales of “I Want a Hippopotamus” on iTunes. “I thought my life as a    was going to be all about playing with my grandchildren,” Ms. Peevey said. “But for people to have all this interest in me has opened things up for me  —   I’ve retired, but my song hasn’t. ”'"}, "time": 1742563350.354898}