{"duration": 1.3105344772338867, "input_args": {"text": "'Anna Kendrick is the kind of actor who likes to cut to the chase. “If I’m working with a director who wants to be   or whatever, that’s fine,” said Ms. Kendrick, who since March has promoted six films while amusing her nearly 5. 8 million Twitter followers. “But I am happy as a clam when we’re just focused and prepared and ready to shoot. ” In “The Accountant,” opening Friday, Oct. 14, she plays a financial type at a robotics corporation who spots a discrepancy requiring the expertise of an enigmatic mathematics savant, played by Ben Affleck. What she doesn’t know is that he crunches numbers for international criminal organizations out of a strip mall. And has    firearm skills. Ms. Kendrick found a kindred spirit in Mr. Affleck, whose filmmaker’s sensibility and straightforward approach helped turn the set of Gavin O’Connor’s thriller  —   a sort of “A Beautiful Mind” for the C. P. A. crowd  —   into a model of efficiency. “When it came down to it, he was very practical about how we were going to basically get our scenes in the can,” she said. In a recent interview from Los Angeles, where she was scrambling to catch a flight to London, Ms. Kendrick, 31, pondered her very busy year, including DreamWorks’ “Trolls” and a memoir, “Scrappy Little Nobody,” both out next month. These are edited excerpts from the conversation. You’ve been all over the place recently. I made a lot of movies in the last couple of years, and they’re all coming out right now. I’m sorry that I’m oversaturating my own market. But by next year, there will be at least a year of not, like, constantly my face in everybody’s business. Was this your first introduction to Ben? We had met years ago, and he was seated next to me and had not brought his glasses or worn his contacts and was asking me who everybody was. And then I pointed out the Jonas Brothers and had to explain to him who the Jonas Brothers were. You spent the last year writing a book. How did you land that gig? An editor approached me because they thought I was funny on Twitter, and then I wrote this piece in Vogue about the Oscars, and somebody went, “Well, I guess if she wrote one article, she can write a book. ” Apparently people are allowed to make decisions like that. And these are essays? “Essays” is giving me too much credit. That makes it sound like I’m Alexander Hamilton or something. Basically the idea was all the funny stories I wanted to put on Twitter but couldn’t reduce to 140 characters. I’m definitely amazed that writers can create things on a continual basis because I feel like my brain will never been the same. I feel like it drained my life power. Where did the title come from? From a conversation I had with my brother, wondering if I’m still the same person that I was when I moved to Los Angeles and the worry that I was becoming complacent in my life. He assured me that I was still scrappy and still had a little   person inside of me.  ? I’m very small, so I’ve spent my life trying to talk louder and be stronger to overcome that. That’s a quality that some people might think is objectionable, but I’m kind of proud of it, so that’s a quality that I’d like to retain. In “Mike and Dave Need Wedding Dates,” you played a crazy party gal opposite your BFF Aubrey Plaza. Was that a stretch? There are aspects of my personality that are a little persnickety, I guess one could say. But I do think that I play   characters more than it makes sense in my brain. Like, it’s a surprise that people keep asking me to play professional women, because I’m like, are you looking at the same person? This person is the person you want to play really professional and driven? I’m falling apart. You’re falling apart? Oh, yeah.'"}, "time": 1742564519.839844}