{"duration": 0.28696513175964355, "input_args": {"text": "'None of the men in the Man Book Club had a problem with the   scene in “The Power of the Dog,” a 1967 novel by Thomas Savage. But more than one member of this   reading group in Marin County, Calif. got squeamish when the host announced that the taco appetizers he had prepared that night were filled with   Rocky Mountain oysters  —   that is, animal testicles. “The fun part was looking at the expressions,” said the club’s founder, Andrew McCullough, 53. “Some guys had real difficulty swallowing. I kept eating. I have standards I need to adhere to, as secretary and founder. ” The Man Book Club is going into its ninth year. It has 16 members, a number of whom are lawyers and engineers in their  . Each month, the host must prepare a meal appropriate to the book under discussion. There was an   French supper to accompany Henry Miller’s “Tropic of Cancer” and a meal of refined comfort food presented on TV trays for Bill Bryson’s   memoir, “The Life and Times of the Thunderbolt Kid. ” “I was always a little jealous of my wife’s book clubs,” Mr. McCullough said. “Now our wives are jealous of us. We’ve created something that is more durable. The book club my wife belongs to  —   there’s a lot of changeover. ” Women, it seems, can afford to drop in and out of reading groups. In its 2011 survey of voluntary organizations, the Pew Research Center found that 11 percent of Americans were active in “literary, discussion or study groups such as book clubs” and that women were more than twice as likely to take part in such gatherings as men were. Perhaps because participation in reading groups is perceived as a female activity, some   book clubs have an outsize need to proclaim the endeavor’s masculinity. In addition to going by the name the Man Book Club, for instance, Mr. McCullough’s group expresses its notion of manliness through the works it chooses to read. “We do not read   chick lit,” he said. “The main character cannot be a woman. ” This is detailed in the Man Book Club’s criteria, on the group’s website: “No books by women about women (our cardinal rule)”. The members of the club rate books on a scale of 1 to 10. The leader, with a score of 8. 8, is “Nobody’s Fool” by Richard Russo the   book, at 3. 3, is “Oscar and Lucinda” by Peter Carey. Another   reading group, this one with a name even more insistently macho than that of the Man Book Club, is the International Ultra Manly Book Club, of Kansas City, Kan. It was started by a group of college friends, and its website hammers home its   identity through prominent images of Chuck Norris, Dwayne Johnson (better known as the Rock) and Oprah Winfrey, standing before an Oprah’s Book Club logo beneath the legend “Not Your Mother’s Book Club. ” Unlike the Marin County group, the International Ultra Manly Book Club is not big on the   element. When one of its members does bring food to one of the monthly   it tends to be “manly  —   like, spicy,” said John Creagar, 32, one of the regulars. In explaining the club’s purpose, the International Ultra Manly Book Club website makes explicit the notion that men take literature as seriously as women. The “About Us” section says it was founded, in part, on the vision that “one day we could step out of the shadow of our mothers’ book clubs and proclaim that yes, we too, are intellectuals. ” If that mission statement seems a tad defensive, there are indeed women who treat book clubs as entities that lie beyond the masculine sphere. Two years ago, Edward Nawotka, 44, a writer and editor in Houston, was out for drinks with the guys from his reading group, the Houston Men’s Book Club, when a woman started hitting on its president. “She asked how we knew each other, and when we said, ‘book club,’ she was like, ‘Wait, are you gay? ’” Mr. Nawotka said. (He added that he and the woman ended up dating.) He said he understood her reaction. “Fiction is designed to examine empathy,” Mr. Nawotka said. “Men aren’t encouraged to talk about their feelings or emotions in public. When your friend gets divorced, you don’t sit around with the guys wondering, ‘How do you think Jon feels about getting divorced? ’” But over discussions of José Saramago, Haruki Murakami and Anthony Doerr, the 15 members of his group have formed a bond. “We’ve seen each other through family tragedies,” Mr. Nawotka said. “When I needed a divorce attorney, I turned to these guys. ” And when the founding member’s wife died from cancer, all the club members attended the funeral. Jon Tomlinson is the founder of the NYC Gay Guys’ Book Club, which meets at the Jefferson Market Library in New York City and has 1, 200 members in its Meetup. com group. Anywhere from 10 to 60 men show up at the monthly meetings. “People come to connect, to find their place in a new city, to fall in love,” Mr. Tomlinson said. Especially popular NYC Gay Guys’ Book Club novels have included “Giovanni’s Room” by James Baldwin, “A Single Man” by Christopher Isherwood and “The Goldfinch” by Donna Tartt, Mr. Tomlinson said. The selection process, he added, is largely democratic, but at times he feels obligated to vet suggestions. “Some guy wanted to read a   book on lesbians who were persecuted in Russia,” he said. “I’m not going to get people to read that book. ” For the International Ultra Manly Book Club, in Kansas City, the monthly meetings provide a space to explore literary depictions of what it means to be a man. The regulars have considered the issue while discussing everything from “Abraham Lincoln: Vampire Hunter” by Seth   to “Rabbit, Run” by John Updike. “Manliness means something different for all of us,” Mr. Creagar said. But all the members share a love of books. “There’s this idea that if guys read, we don’t think that deeply about it,” Mr. Creagar said. The club rates the books it reads on a   system for overall quality, and on a    system for “manliness. ” “Gilead,” by Marilynne Robinson, for instance, earned four and a half stars and three hand grenades. Mr. Creagar suspects there are many male readers who would love to join a book club. “But they don’t get asked,” he said, “or they worry that, if they do join, they’ll be seen as intruding on a female activity or stigmatized as being the only guy. ” For this reason, the International Ultra Manly Book Club sees itself as a resource for men seeking a literary community. In addition to listing its reading schedule, its site includes “best of” lists, including the “Top 100 Books for Every Man. ” Though it includes rough stuff like “Fear and Loathing in Las Vegas” by Hunter Thompson and “Blood Meridian” by Cormac McCarthy, the list has room for gentler works, like “The Chronicles of Narnia” by C. S. Lewis and the Harry Potter series. And yet the group has standards. “We are not allowed to suggest books that our mothers have suggested,” Mr. Creagar said. “We had an accident one time. We read ‘Water for Elephants.’ It was a huge mistake. ”'"}, "time": 1742564596.9191868}