{"duration": 0.08819723129272461, "input_args": {"text": "'Changes in Rainfall Threaten Food Production Posted on Oct 31, 2016 \\nBy Jan Rocha / Climate News Network Cattle farming and roads are major causes of deforestation in Brazil’s Amazon region. (Kate Evans/CIFOR via Flickr) \\nSÃO PAULO—The UN’s latest State of Food and Agriculture (SOFA) report warns that rainfall patterns will have changed so drastically by the end of this century that agriculture, forestry and fishing will all be seriously affected. \\n“It will become more and more difficult to harvest crops, rear animals and manage forests and fisheries in the same places and in the same way as before,” says the report by the UN’s Food and Agriculture Organisation (FAO). \\nAnd that is a major concern for regions such as Latin America that are economically dependent on agriculture, and the Caribbean, which is heavily reliant on fisheries. \\nIn Brazil’s northeast, for example, rainfall is expected to decrease by 22%, while in the southeast of South America, which covers parts of Chile and Argentina, it could increase by 25%. Rainfall changes \\nAdvertisement Square, Site wide \\nThe report says these changes in rainfall mean “that the capacity to face shortages or excesses of water will be fundamental in the efforts to improve productivity in a sustainable way”. \\nA separate study carried out earlier by the FAO, the Economic Commission for Latin America and the Caribbean (ECLAC), and the Latin American Integration Associatio n (ALADI) shows that agriculture accounts for 23% of regional exports, employs 16% of the economically active population, and contributes 5% to regional GDP. \\nThe SOFA 2016 report predicts that climate change will bring more drought and increases in temperature that will reduce productivity in tropical and sub-tropical regions. It foresees more salinisation and desertification in the arid areas of Chile and Brazil, while along the Pacific coastline some fish species will move further south. “The capacity to face shortages or excesses of water will be fundamental in the efforts to improve productivity in a sustainable way” \\nIn the Caribbean, the greater frequency of storms, tornadoes and cyclones will harm aquaculture (the farming of aquatic organisms such as crustaceans, molluscs, and aquatic plants) and fisheries, and temperature changes could alter the physiology of freshwater fish species and cause the sinking of coral reef systems. \\nForested areas could be transformed into savannas, while Amazonia will face the risk of frequent fires. In Central America, climate change could lead to 40% of mangrove species being at risk of extinction. \\nThe report notes that although governments in the region see a reduction in deforestation as the main method of combating climate change, forests continue to be converted for farming and cattle breeding, which are the main sources of greenhouse gas emissions in the region. Causes of emissions \\nThese emissions have three main causes. In 2014, they were: enteric fermentation—the product of the digestive systems of ruminants (58%); manure deposited in areas of pasture (23%); and artificial fertilisers (6%). \\nThe FAO warns that climate change would affect food production, reducing not only the amount available but the variety of foodstuffs. Extreme events in areas of large-scale production will have severe implications for trade, affecting the international supply of food. \\nThe report concludes that the climate changes it foresees would affect food and nutritional security in the region, causing abrupt variations in the incomes of families who depend on agriculture, or, where there is a fall in demand for paid rural labour, a reduction in their capacity to buy food. \\nThe effects could also include big changes to the diet of the population, with a fall in food variety and in healthy foods, leading to poorer nutrition. \\nAll in all, the FAO report offers a fairly bleak perspective if countries continue on their present path of sleepwalking into the future, with many governments unaware of or unwilling to face up to the challenges of climate change. \\nJan Rocha is a freelance journalist living in Brazil and is a former correspondent there for the BBC World Service and The Guardian. TAGS:'"}, "time": 1742563287.1258779}