{"duration": 0.21786022186279297, "input_args": {"text": "'SAN FRANCISCO  —   Apple unveiled new iPhones at an event on Wednesday, as it has done every September for the last few years. The event, held in San Francisco’s Bill Graham Civic Auditorium, was the company’s most important outing of the year. Even as the iPhone remains the outsize producer of Apple’s revenue and profit, sales of the smartphone have recently been declining. So more than ever, the onus is on Apple to keep up excitement for the gadget. What was different this time was that people were focused on something that the new iPhones lack, rather than a flashy new feature. The item that disappeared is the traditional headphone jack, with Apple turning people toward wireless headphones instead. Brian X. Chen, Farhad Manjoo and Katie Benner were at the event to provide live analysis of what you need to know about the announcements, not what you don’t. Here’s what Apple  announced: ■ New iPhones, called the iPhone 7 and 7 Plus. ■ The new iPhones lack a headphone jack. ■ The new iPhones have a revised home button with force sensitivity, which will vibrate to give feedback. ■ The iPhones are  . ■ The Plus model of the new iPhone includes a   camera to take   photos. ■ A new Apple Watch, called Apple Watch Series 2, which includes GPS. ■ Pokémon Go is available for Apple Watch. ■ An update on how Apple Music is performing. ■ Tweaks to its iWork suite of productivity apps. Farhad: This was a tricky event because there wasn’t much new to the products. The iPhone has the same design as last year’s (and the one the year before) and the major new thing is   …     a missing headphone jack. So what I was watching for was Apple’s reality distortion field: How will Apple’s C. E. O. Tim Cook, and friends convince us that taking away a feature is really an advance for the iPhone? Brian: As Farhad said, the new iPhones  —   and also the Watches  —   look largely the same as their predecessors. The takeaway for me was that Apple focused on making the most significant changes to the tiniest components: camera sensors, upgraded chips, a revised home button and the addition of GPS to the watch. I get the impression that they are saving the big changes for the 10th anniversary of the iPhone next year. So if consumers can hold off a year for the next iPhone, I’d encourage them to wait. But for owners of iPhones that are at least two years old, these are going to be major upgrades  —   if you find a way to cope with the lack of a headphone jack. Katie: Apple didn’t offer a new killer product or a drastic update to any of the products in its lineup. Instead, Apple piled on new features  —   like   stereo speakers, wireless headphones and camera features  —   to appeal to specific niche buyers. Frank Gillett at Forrester Research called this strategy an accumulation of compelling new features that Apple hopes will “motivate the trend followers to buy new iPhones, and expose other buyers to the benefits they’ve built into iPhone 7 and Apple Watch Series 2. ” Perhaps more important, Apple was trying to cobble together a credible story for the future from these incremental moves  —   that a wireless world is coming and that it will be the leader in that world. Farhad: Apple likes road maps. That’s what you saw today. The company clearly has deep,   plans for the iPhone  —   it wants to improve wireless functioning, it wants to keep pushing on the camera, and it will keep improving performance without sacrificing battery life. The problem for Apple is that the steps along the way to achieving its goals aren’t always that exciting. This is one of those years: There are lots of incremental improvements, but nothing stands out as a  . Someday, Apple is telling us, all these increments will add up to something unimaginably amazing. Right now, though, the moves look puzzling  —   we really did not get a good defense for removing the headphone jack  —   and we may just have to live with the confusion. Katie: For the past few quarters, Apple has emphasized that services and software will drive growth as iPhone revenue ebbs. At Wednesday’s event, Mr. Cook underlined that. He kicked off the morning with updates on two of the company’s most important software and services divisions  —   Apple Music and the App Store. “We’ve always had a deep love for music,” Mr. Cook said. “It inspires us, and it’s a key part of our product experience. ” Mr. Cook said the company had 17 million subscribers after about a year for Apple Music and added that the music service would be the “premier destination for exclusive music,” nodding to the idea that the company will use its huge war chest to lock up deals with artists. Brian: In another nod to software, Mr. Cook said Super Mario is coming to the App Store. Nintendo, the struggling video game company, long refused to offer its games and franchise characters on mobile devices, but the company recently did a 180, with Pokémon Go as a recent example. The change seems more beneficial to Nintendo than to Apple. Pokémon Go was a huge success, at least initially, proving that app stores are a viable revenue stream for Nintendo beyond its consoles. Apple also announced a new version of iWork, its suite of productivity apps that rival Microsoft Office and Google’s productivity apps. The tweaked version of iWork will include   collaboration, meaning multiple people can work on documents and presentation slides at the same time. It’s good that these changes are coming to iWork, but Microsoft and Google have been offering   collaboration tools for years already. Farhad: The education market has been important to Apple for decades, and for the last few years it has pushed the iPad as the perfect school computer. It did so again today, with those tweaks to its iWork software aimed at schools. But Apple has lately faced more competition from rivals, especially Google, whose cheap and simple Chromebook has become one of the   machines at schools. For both companies  —   and lately for other tech rivals, including Amazon  —   the education market functions as a gateway. Get them early, win them for life. Brian: The new Apple Watch is called Apple Watch Series 2. It emphasizes fitness and health, with Apple showing a video of runners, gymnasts and swimmers using the watch. One major criticism of Apple Watch was that it did a bit of everything and did not have any strengths. Apple is trying to beef up the fitness capabilities, similar to Fitbit. The new version is   up to 50 meters (164 feet). It also includes GPS for tracking runs. The watch is faster than the previous version. Katie: Whether Apple Watch has been successful or not has largely been a mystery. Apple doesn’t break out Watch revenue in its earnings. But Mr. Cook pulled back the curtain a little when he revealed that Apple is now the No. 2 global watch brand, measured by revenue, behind Rolex. The Apple Watch is also the   smartwatch, even though a killer app has yet to emerge for the watch. The company is hoping to change that with the introduction of a Pokémon Go app for the watch. Brian: It’s important to note that Apple Watch sales don’t appear to be growing much. IDC, the research firm, estimates that Apple Watch market share in the wearables market shrank 56. 7 percent last quarter compared to the same period last year. That’s largely because consumers have probably been waiting for a new version to come out before deciding whether to buy a watch. It’s definitely still a nascent device. Farhad: This is the first Apple event in a few years that didn’t feature any redesigned hardware. But there is a new ceramic finish for the Watch that comes closest to some new design. The gleaming white finish is in some ways a return to the past for Apple. (Remember all those white computers from the early 2000s?) But beyond that, it’s always interesting when Apple discovers a new material for use in its devices. You usually notice some new process or material start in one product and then wend its way throughout the company’s lineup over a few years’ time. In other words, three years from now, we may have   ceramic phones. A man can dream, anyway. Brian: For now, my advice to consumers: I see no compelling reason for people with Version One of the device to upgrade unless they are fitness buffs. The addition of GPS gives the Apple Watch a slight edge against Fitbit’s Blaze, a comparable smartwatch that lacks GPS. But until we get to try the software, it’s tough to tell how the new Apple Watch’s fitness capabilities will compare to accessories from Fitbit. Fitbit’s products are popular partly because the apps are so well designed for monitoring health statistics, including footsteps, calories and weight. So GPS isn’t necessarily the magic bullet. Katie: Leading up to the event, the most ballyhooed update was Apple’s decision to eliminate the headphone jack. On Wednesday, Phil Schiller, Apple’s marketing chief, saved that announcement for last. Removing the port for standard headphones means users now have to connect their headphones to the iPhone through the charging port. “From the start we designed Lightning to be a great digital audio connector,” Mr. Schiller said. The update may have its detractors in the days after the announcement, but Apple has a long history of making hardware changes that the industry eventually follows, including the decision to change floppy disk sizes in the old Mac days and, more recently, the decision to take away laptop ports. Apple will include new Lightning earbuds, and an adapter, in the box. Why remove the headphone jack, a technology that people seem to like? Mr. Schiller summed it up in one word: “Courage. ” Farhad: Apple said the most important reason it’s removing the headphone jack is because it believes in a “wireless future” for audio. It’s making that future a reality with a new set of wireless headphones, called AirPods. They look like Apple’s wired earbuds, without the wires they apparently just slip in your ears. Perhaps more important than the earbuds themselves is the wireless technology Apple is using to power them. The company is using Bluetooth, and Apple says its chips improve the technology by connecting faster and using less power. If Apple has perfected a new, proprietary way of doing this, it could prove an important innovation for lots of future wireless products, including home devices, cars and wearables. Brian: Jony Ive, Apple’s design chief, said in a video at the event that we are “just at the beginning of a truly wireless future. ” But wireless earphones have been around for years, and Bluetooth wireless technology has become excellent. This is another example of Apple’s being a latecomer to a market and saying it will make a better product than earlier ones. Farhad: The reality distortion was in force in other ways. In true Apple fashion, we got a   video into the development process for the iPhone 7, with not even a nod to the fact that the phone looks nearly identical to the one Apple released last year and the one the year before. Because it has a new color and a new Apple logo, Apple insists it’s “a beautiful new design. ” I’m sure there are minor differences  —   the antenna band is different  —   but it seems too rich to call it a new design. Too rich, except for Apple. One area where I do give Apple points on the iPhone is the focus on the camera. Apple made a strategic decision a few years ago to plow a lot of development resources into the iPhone camera. That has paid off: The iPhone’s camera has long surpassed most other smartphone cameras, and for many people, it’s better than most   cameras. The iPhone 7 and 7 Plus continue that trend. The Plus model features two cameras, which allows for  . Even the smaller phone’s camera includes features to improve your snapshots. If the pictures Apple showed off are any guide, the iPhone’s camera is fast closing in on all but the most   of cameras. Look forward to more of those “Shot on iPhone” billboards.'"}, "time": 1742562607.7044525}