{"duration": 0.05620217323303223, "input_args": {"text": "'Illinois Senator Draws Fire for Racially Charged Attack on Opponent’s Family Alexandra Jaffe and Traci G. Lee, NBC News, October 28, 2016 \\nIllinois Sen. Mark Kirk is again under fire for making racially-charged comments, this time for questioning the military service of his Democratic opponent’s family. \\nDuring Thursday night’s debate between Kirk and challenger Rep. Tammy Duckworth, Duckworth spoke about her desire to be in the Senate as a voice of reason and referenced her family’s history of service, saying, “My family has served this nation in uniform, going back to the Revolution. I’m a daughter of the American Revolution. I’ve bled for this nation. But I still want to be there in the Senate when the drums of war sound. Because people are quick to sound the drums of war, and I want to be there to say this is what it costs, this is what you’re asking us to do. . . . Families like mine are the ones that bleed first.” \\nKirk responded: “I had forgotten that your parents came all the way from Thailand to serve George Washington.” Tammy Duckworth is a vet who lost both legs in Iraq. Her family has served since the Revolutionary War. And yet… pic.twitter.com/DHd3kWrUsN \\n— Anthony Breznican (@Breznican) October 28, 2016 \\nThough Duckworth, who was born in Thailand to a Thai mother of Chinese descent and an American father, did not respond on the stage, she tweeted a photo after the debate of herself with her parents–her father displaying medals of service on his coat. “My mom is an immigrant and my dad and his family have served this nation in uniform since the Revolution,” Duckworth wrote. \\nDuckworth’s late father, Franklin, served in World War II and has “traced his lineage back to an ancestor who fought in the American Revolution,” according to a 2012 Mother Jones profile on Duckworth’s run for Congress. \\n{snip} \\nOn Friday, Kirk tried to tamp down the backlash and tweeted “sincere apologies to an American hero.” \\nIt’s not the first time the Illinois senator has courted controversy with racially-charged comments–he previously said President Obama was “acting like the drug dealer in chief” for the administration’s cash payment to Iran in exchange for the release of American prisoners, and talked about fostering opportunities for African-American entrepreneurs so “that the black community is not the one we drive faster through.” \\n{snip}'"}, "time": 1742562904.308624}