{"duration": 0.07960653305053711, "input_args": {"text": "'Pinterest \\nC.E. Dyer reports that President Obama claimed back in March of 2015 that he found out about former Secretary of State Hillary Clinton’s private, unsecured email server the same way other Americans found out —“ through news reports .” But WikiLeaks has released emails hacked from the account of Hillary Clinton’s campaign chairman, John Podesta, that proved otherwise and may point to a big reason why the FBI let Clinton off the hook. \\n“They know POTUS and HRC emailed,” Jennifer Palmieri, Clinton’s communications director, wrote in a March 2015 email approximately a month before Clinton announced her presidential run. \\n“Josh has been asked about that,” Palmieri continued, in reference to Josh Earnest, the White House press secretary. \\n“Standard practice is not to confirm anything about his email, so his answer to press was that he would not comment/confirm,” Palmieri wrote. “I recollect that Josh was also asked if POTUS ever noticed her personal email account and he said something like POTUS likely had better things to do than focus on his Cabinet’s email addresses.” \\nBetter things to do, like golfing? Drawing red lines in the sand? Even if Obama had “better things to do,” someone should have been concerned about cyber security and the fact that the secretary of state was using a private server. \\nIn the email exchange, Palmieri was discussing Obama’s CBS statement with Clinton aide Phillippe Reines who suggested that they should warn the White House about the likelihood that Obama’s statement to CBS would fall apart under scrutiny. \\n“One of us should connect with the WH just so they know that the email will show his statement to not make sense,” Reines wrote. “I’m happy to do so to Josh Earnest since Jen is in a weird position, unless Cheryl or John you want to (or already have) with someone else. But it’s not unreasonable to assume that Josh is going to get asked how this was possible, and he should have the factset.” \\n“Especially if it’s some weird technical thing with the President’s email setup that he doesn’t see addresses,” Reines wrote. \\nSome “weird technical thing?” Must have been the Russians’ fault, eh? The FBI found out, during their investigation of Clinton’s use of private servers run out of her New York home, that Obama used a pseudonym to email Clinton on her home brew server. That’s a big fat lie as part of a massive coverup, not some “weird technical thing.” \\nIn another March 2015 email released by WikiLeaks, Podesta asked Clinton lawyer Cheryl Mills about emails between POTUS and Clinton: “Think we should hold emails to and from potus?” \\n“That’s the heart of his exec privilege. We could get them to ask for that. They may not care, but I seems like they will,” Podesta wrote. \\nWell, this revelation may have been a big reason why the Obama administration let Clinton off the hook — Obama himself was in on it.'"}, "time": 1742562023.9475546}