{"duration": 0.0630488395690918, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump and congressional Republicans appear to have accomplished a feat that President Obama, with all the power at his disposal, could not in the past seven years: They have galvanized outspoken support for the Affordable Care Act. People who benefit from the law are flooding Congress with testimonials. Angry consumers are confronting Republican lawmakers. And Democrats who saw the law as a political liability in recent elections have suddenly found their voice, proudly defending the law now that it is in trouble. Thousands of people across the country held rallies over the weekend to save the health care law, which Republicans moved last week to repeal with a first but crucial legislative step. A widely circulated video showed Representative Mike Coffman, Republican of Colorado, eluding constituents who had wanted to meet with him to express their concerns on Saturday at a community event in Aurora, Colo. Rallies on Sunday to save the health law drew robust crowds around the country. “We are here today  —   thousands strong in Boston, and at more rallies all across this country  —   because we will make our voices heard,” Senator Elizabeth Warren, Democrat of Massachusetts, told a crowd outside Faneuil Hall in Boston. “If Republicans try to rip health care out of the hands of millions of Americans, we will fight them every step of the way. ” And progressive groups are planning a     bus tour to fight the repeal effort, starting Tuesday. With their quick strike on the law in the first days of the new Congress, Republicans had hoped to begin the repeal process before a backlash could develop or opposition could be organized. But congressional Republicans are at risk of losing the message war, especially since they are fighting on two fronts. On one side, the   has repeatedly lobbed disruptive demands at them, such as his insistence that they prepare a replacement health bill almost immediately. To that, he added a new promise over the weekend: that the Republican version would provide “insurance for everybody. ” On the other front, Democratic lawmakers have taken to quoting grateful constituents to personalize what can be an arcane legislative fight: Bryce in Seattle Randy in Rhinelander, Wis. Nicole in Hockessin, Del. and many more. The focus of public attention appears to be shifting from the   defects of the health care law to the plaintive pleas of people terrified of losing insurance if the law is repealed. “I want to thank President Obama from the bottom of my heart because I would be dead if it weren’t for him,” Jeff Jeans, a   man from Sedona, Ariz. who described himself as a lifelong Republican, told Speaker Paul D. Ryan on Thursday at a    meeting televised on CNN. Republicans acknowledge their constituents’ concerns, but they say supporters of the health law are manufacturing them. Representative Rob Woodall, Republican of Georgia, blamed Democrats for “amping up anxiety” with “fear mongering. ” “The anxiety is real,” Mr. Woodall said, “but it’s real based on the failures of the president’s health care law. ” Republicans will soon face a new challenge: maintaining anger at “Obamacare” without Mr. Obama in the White House to stir their passions. Regardless of its provenance, the law’s support has until now received less attention. Appearing on the NBC News program “Meet the Press” five days after Mr. Obama signed the Affordable Care Act in 2010, Senator Chuck Schumer, Democrat of New York, predicted that as people learned about the law, “it’s going to become more and more popular. ” Around 20 million Americans have gained coverage through the Affordable Care Act’s online insurance marketplaces or through its expansion of Medicaid, and enrollment has continued to grow. About 11. 5 million people have signed up for marketplace plans or had their coverage automatically renewed for this year, nearly 300, 000 more than at this time last year, the Obama administration said this month. But the popularity bounce never came. Public opinion remains deeply divided, with the law no more popular today than when it was passed. In December, according to a monthly tracking poll by the Kaiser Family Foundation, 46 percent of Americans had unfavorable views of the law, up from 40 percent in April 2010. The share with favorable views slipped to 43 percent, from 46 percent in April 2010. “In the short term, the A. C. A. has been a political disaster for President Obama and the Democrats,” Dr. Ezekiel J. Emanuel, a health policy adviser in the Obama White House from 2009 to 2011, said in a 2014 book. As Congress took a first step last week toward rolling back Mr. Obama’s signature domestic achievement, Mr. Trump celebrated. “The ‘Unaffordable’ Care Act will soon be history!” he said on Twitter. Some Democrats distanced themselves from the Obama administration after HealthCare. gov crashed on its debut in 2013. More recently, with premiums soaring and insurers defecting from the Affordable Care Act marketplace in many states, Democrats were hard put to defend the law, which was passed without any Republican votes. But as Mr. Trump and congressional Republicans race to repeal the law, Democrats are taking a more aggressive stance. Senator Debbie Stabenow, Democrat of Michigan, told the story of Sonja L. Podjan, a    blueberry farmer in Watervliet, Mich. who was in pain for several years until she got insurance under the Affordable Care Act, which covered the cost of surgery to repair a severe tear in the meniscus of her right knee. In an interview, Ms. Podjan said she “started freaking out” after the election and sent an email to Ms. Stabenow. She said she was “flabbergasted” when she heard back from the senator’s office. Ms. Podjan said that the premium for an insurance policy covering her and her husband was about $1, 000 a month, but that they paid just $62 after receiving government subsidies provided under the law. “I am scared to death we will lose our insurance, and what happens then?” said Ms. Podjan, who reported that she and her husband had medical expenses totaling $41, 000 in the past two years. Senator Tom Udall, Democrat of New Mexico, told the story of a constituent, Kevin Kargacin, whose daughter Amber takes drugs costing more than $60, 000 a year for multiple sclerosis. “Kevin is scared because the cost of treating Amber’s disease is so high,” Mr. Udall said. In an interview, Mr. Kargacin said he wrote to Mr. Udall because “we are terrified that without the Affordable Care Act, Amber could be denied insurance or run into lifetime caps on expenditures for her treatment. ” Senator Amy Klobuchar, Democrat of Minnesota, said: “Many Minnesotans have contacted me in the last few months, frightened about the future of their health care coverage. I heard from a man in Orono. His wife was diagnosed with cancer this year. On top of everything his family is now dealing with, he is terrified that his family will lose coverage if there is a repeal. ” Whether such concerns reflect a change in public opinion is difficult to say. Over the past six years, Republicans have collected stories from hundreds of constituents complaining that their insurance policies were canceled, their premiums have shot up and their deductibles are so high that the insurance is nearly worthless. “Scott from Hickory has had his health insurance canceled three times now, disrupting his continuity of care,” said Representative Virginia Foxx, Republican of North Carolina. “Patricia from Kernersville now has a whopping $6, 550 deductible. ” Representative Pat Tiberi, Republican of Ohio, reported that a constituent named Kimberly had difficulty obtaining treatment for a brain tumor because, she said, “virtually no doctors take the marketplace insurance. ” The differing accounts are not necessarily in contradiction. Some people have benefited from the law while others have seen their coverage disrupted. Republicans said the Obama administration had been slow to recognize and acknowledge problems with the Affordable Care Act. Administration officials said insurance rate increases of 25 percent or more were not a significant problem because   people could get subsidies to help defray the cost  —   even though millions of people buying insurance on their own do not receive subsidies. The administration insisted that insurance markets were “stable and vibrant” even as large insurers pulled out of Affordable Care Act exchanges where they were losing hundreds of millions of dollars. In 2015, the administration said that “claims data show healthier consumers” in the exchanges, but some insurers disputed that assessment, saying they had not seen an influx of healthy people to help cover the costs of sick people.'"}, "time": 1742628594.730117}