{"duration": 0.7027273178100586, "input_args": {"text": "'2375 Views November 18, 2016 8 Comments Guest Posts The Saker \\nby Larchmonter445 \\nEveryone in the Deep State is threatened by the Trump Presidency. The Deep State understands that power, funding, ideological stratagems and domination of government, media, academia, think tanks and NGOs are in the ‘field of fight’, to use the book title by a prime target the Deep State intends to destroy in order to save itself from Trump. Lt. General (ret.) Michael T. Flynn \\nLt. General (ret.) Michael T. Flynn, three-star expert in Military Intelligence, former director of the Defense Intelligence Agency (DIA), counselor to Trump for the last fifteen months, is a vital Trump ally the Deep State is attempting to discredit. \\nWe have seen the one-week ferocious political and media attack on Stephen Bannon, begun the instant that Bannon was named Trump’s number one strategist-advisor. Bannon is the theologian of Drain the Swamp, the Trump policy to rid the system of corruption and catastrophically disastrous policies and bureaucrat enablers. \\nTo understand Steve Bannon, take the time to read this transcription or listen to the audio Q&A from a 2014 event in the Vatican. He lays out his philosophical agenda, and used the 2016 campaign to advance his war on the Elites. \\nDrain the Swamp pertains to more than getting the corruption out of the system. Steve Bannon \\nBannon now has Trump’s full backing to destroy the UniParty, defeat the Globalists, banish the warmongers of the MIC and help the legal prosecution of the corrupt. This is the Revolution to end the domestic Tyranny and the global Hegemon. \\nThe usual weapons of personal destruction have been launched at Bannon to destroy him and to deprive Trump of his most effective counselor and field marshall. Bannon has been branded a racist, an anti-semite, a white supremacist, an Islamophobe and a misogynist. In every forum and media outlet, the meme of Bannon being the worst human on the planet played as intensively as how the Dems attacked Trump during the campaign. \\nRelentless lies, chorused by every host, talking head, and hater of every value Trump and Bannon had campaigned for were spewed on Bannon’s name. All fabricated, most based on a few headlines written by Milo Yiannopoulos in Breitbart.com, alt right agitprop pieces constructed to collect reader clicks, revenues for Breitbart and fame for Milo. Bannon as chief of Breitbart was then scourged for those headlines. Mockery by Milo used against Steve Bannon. \\nIt was all the Media needed. But the Deep State directed it for good reason. Bannon is the Pale Rider coming to destroy them. \\nSteve Bannon is dedicated to cleansing government and the financial system controlled by all those who have reigned over the foreign regime changes, the transfer of middle class wealth and income to Wall Street, paper wealth from derivatives to hedge fund and corporate global leaders, trillions to the 0.01% elites, all of whom populate the Ultra Wealthy Class, a new feudalism of billionaires and millionaires. \\nBannon’s life long credentials and work with Jews, Blacks, females and Muslims eventually helped stifle the Media excesses. But the vicious branding may stick long after the inauguration. \\nThe fear and loathing of the Deep State is focused on another nemesis and threat in the person of General Flynn. Flynn challenges the Deep State’s incompetence, particularly its lack of results in the fight against terrorism. Flynn dealt with this in the wars in Iraq and Afghanistan. He wrote a white paper on the state of US military Intelligence and the need to fix it. \\nFlynn also is sickened with the 2012 Benghazi event and coverup, the lies of Clinton and the abandonment by the command structure of CIA, Pentagon, State and NSC. The Syrian war, the attempted coup of Erdogan, and the carnage wrought by bad policies, sheepish leadership and less-than-best methods of Intelligence gathering and usage motivated the General to join Trump. \\nFlynn is now Trump’s guide into the Presidential raw data Intel reports and briefings. General Flynn is Trump’s personal analyst for interpretation of the data. Flynn has attended every briefing Trump has received. He is in place and the Deep State is out. So, they have mounted their counter-attack as soon as it was clear he would head the reform of the Intelligence community, and serve the newly elected President. \\nFlynn has recruited over two hundred generals and admirals and twenty-two Medal of Honor recipients to the successful Trump campaign. Now some of the generals are possible cabinet or undersecretary department nominees or agency appointees. \\nThe Deep State is in deep trouble. General Flynn will probably be NSC head and I think he will have real power over fifteen other Intelligence agencies. Flynn may have great power over huge swaths of the MIC. He certainly will assist in the cleaning out of neocons and feckless employees, managers, supervisors and directors. \\nAgainst Flynn, the Deep State is using a more traditional model of career attack and personal destruction than it did with Bannon. Multiple articles written to show that Flynn and Putin , Flynn and Russia, Flynn and RT media are part of the Trump gang of pro-Russian contacts connected to the Kremlin . \\nBelow is General Flynn at dinner with President Putin in Moscow. He explains in an interview . \\nOther Trump-Putin supposed contacts are Carter Page and Paul Manafort, both of whom were attacked by the Media for the Deep State months ago. They resigned under political pressure applied through the media. \\nIn a payback, the Deep State lost some of their own sent to the Trump campaign who were unable to survive first inspection. They were dropped from the Trump campaign transition team. \\nBut, once Trump is sworn in, Carter Page will be back, most likely. He has connections to Gazprom, is well-liked in Moscow, and will be a link for American energy companies and perhaps some joint ventures in the gas field development and pipeline industry. Several friends of Trump are from the gas and oil industry, and the world is a small world when energy is the issue. The Arctic, the eastern Mediterranean, the South China Sea and other large development zones have enormous new fields to be tapped and exploited. Even the Black Sea zone around Crimea has yet-to-be-tapped energy stores. \\nThe primary interest of the Trump foreign policy will be to make America wealthy again. The Eurasian development has already attracted Trump to the OBOR of China and the AIIB infrastructure bank. Probably the entire New Silk Road of China and EAEU of Russia is not going to be without major US participation. The difference now is facilitation, participation, investment and benefits instead of obstruction, destabilization and terrorism used to thwart it all. \\nTo destroy Flynn and weaken Trump with the Intelligence and Military communities, the classic Washington technique of long articles with many negative anonymous sourced comments was used, carefully crafted headlines and paragraph headers, all designed for very negative Google Search feeds. \\nThe latest is about Flynn and Turkish “operatives” . Sounds like they met in dark alleys or underground passageways. Maybe in some Ankara safehouse, eh? \\nIt turns out quite differently. Hilal Mutlu (left) and Ibrahim Kurtulus (center) with Retired Lt. Gen. Michael Flynn at Oct. 10, 2016 event. (Youtube screen grab) \\nBut Flynn is obviously being watched closely by CIA/State Dept. They know he is doing the bidding of Trump. And for good reason, Trump needs to know which way Turkey is leaning post-coup? And how sensitive is the Kurd issue in Syria? What are the ramifications of the US and Russia working in tandem against ISIS in Syria? Will Turkey help with safe zones for refugees? Will Turkey leave Syria after the war or does it plan to resist Russia and Assad? What about NATO? What about the Uyghurs Turkey protects, and is China being forced to come with military to put down the Uyghurs inside ISIS? Will the issue of demanding Fethullah Gulen’s extradition continue? Will there be mass death penalties for the imprisoned coup participants and Gulen’s followers? \\nFlynn had a panoply of possible questions to be answered by the operatives from Erdogan. And the Turks would have questions they wanted answered with some hint of Trump’s positions. \\nThe Deep State are tracking Flynn and the Turks and are now exposing his links as a professional consultant. Nothing illegal. Nothing suspicious. Nothing out of the ordinary. But it was General Flynn, Trump’s guy. Smear him. \\nHow else would this information surface in the Washington Post except from the Deep State? And if you know the history of the Deep State, the WaPo is their first choice for all leaks, briefings in depth, exposes used to undermine officials who cross them or who point to the Deep States’ misdeeds or failures. You won’t find Sy Hersh’s articles in WaPo. \\nThe point of the articles about General Flynn was to shame him, to put down his personality, his lack of obedience to the Obama regime. He was investigated for giving Intel to foreign nations, we are told. He shared Intelligence with the Pakistanis, we are told. Read how his fellow generals talk about him . \\nImagine if the Deep State decided that Intelligence should never be shared. Well, the U.S. would have no allies. No nation joins a war effort without Intelligence for their military. Flynn, whose entire thirty-plus year career has been in Intelligence understands that. And he did it. Proudly, he related to the investigators, and it all was dropped except the record and the reporting of it now. \\nThe investigation was actually to cast a black mark on Flynn to be found later, by the uninformed, at the most sensitive of times. In this case, it is to weaken Flynn, to weaken Trump. \\n“Mike Flynn shares Intel. Mike Flynn acts without checking with what the Deep State wants.” It turns out that Flynn did get approval for all he did. But he simply did the professional thing. He acted in behalf of his specialty, his profession, his oath of duty and the American people who paid him to protect America. \\nThere is something to be gained by studying this meeting with Turkey’s operatives. Flynn’s meeting signals that Trump will not likely arm the Kurds with heavy weapons. That would drive Turkey into the Russian-Iranian embrace fully. A practical solution to defeating ISIS and AQ and ending the Syrian war has to avoid losing Turkey. Trump is not going to be trying to coup anyone. His policy is no regime changes. He also does not like these secret wars of the CIA. If there is to be war, he wants it fought by the military, with a plan for victory. Principally, Trump’s wars will be like President Eisenhower’s. There were none for eight years. \\nThe warmongers and neocons of the Deep State and surface government will try to work over all the Trump nominees in the security and policy arena. Trump has refused to listen to any of them, though a few have been invited in to the goings on. However, we don’t know who is talking to Trump and who is talking to the various panels of experts that will advise who they think he should select. So a few neocons and warmongers like John Bolton and General Keane have made it into Trump Tower. But he eschewed them all these years and throughout the campaign. I doubt they will have any role in policy. He considers them failures. \\nExpect very deep shakeouts at CIA and State. I think Flynn will use fellow military he knows and trusts as deputies and undersecretaries. General Keith Kellogg and General Ronald Burgess are likely for important positions. \\nThere has to be this cleaning out of the subterranean world of the Deep State. If President Carter got rid of 800 officers when Stansfield Turner tried cleaning out the CIA, I’m betting there are 1500 officers in the CIA who need retirement now. \\nAs for the State Department and the Clinton corruption of pay for play, that is only half the problem. The eighty years of Khazarian dominance of the State Department has created the need that whole thing ought to be shut down except for visas at embassies and consulates. (I’d use the Commerce Department in the interim. Send everyone else from State home. Board up Foggy Bottom for ten years.) \\nAddendum: General Flynn early in the primary campaign consulted as advisor to five candidates. Carly Fiorina, Scott Walker, Ben Carson, Ted Cruz, and Donald Trump. He chose Trump as the one who wanted to be President in order to fix the country and make America great again. Now, Trump, Bannon and Flynn are going to drain the swamp, if they can survive. \\n(Flynn has been named NSC Advisor and will command a staff of 400 from all the other Intel agencies, it has been reported by Fox and AP.) \\nLarchmonter445'"}, "time": 1742563276.8714833}