{"duration": 0.09269428253173828, "input_args": {"text": "'Email \\nWith the FBI reopening the investigation of Hillary Clinton for crimes related to sending and receiving classified information over her unsecured private e-mail server, her campaign is looking at a rough last few days of the race. Now, there appears to be evidence that — even though the Justice Department had previously scuttled an investigation into the possibility that the Clintons were blurring the lines between their own personal finances and those of the Clinton Foundation — the Justice Department may finally be forced into a position to conduct a real investigation. If that happens, the wheels may come off of the Clinton cart. \\nWhen an investigation into whether Anthony Weiner sent sexually explicit messages to a teenage girl led investigators to seize and examine his laptop, they made an unexpected discovery. That laptop contained about 650,000 e-mails and some of those — according to an analysis of the metadata — came from Hillary Clinton’s personal server and may have contained classified data. Investigators brought FBI Director James Comey into the loop last week and he immediately contacted Congress to say that he was reopening the investigation . While there are multiple possible reasons for Comey’s decision , it is clear that the new investigation — announced so close to the election — will hurt Clinton’s bid for the White House. \\nAnd — whether it comes out as part of this investigation or not — the fact that there were no clear lines of demarcation between the Clintons\\' personal finances and those of the Clinton Foundation will hound Hillary Clinton into the future. That reality exists and will continue to exist regardless of the outcome of next Tuesday’s election. \\nThe Wall Street Journal reported Sunday that The latest development began in early October when New York-based FBI officials notified Andrew McCabe, the bureau’s second-in-command, that while investigating Mr. [Anthony] Weiner for possibly sending sexually charged messages to a teenage minor, they had recovered a laptop. Many of the 650,000 emails on the computer, they said, were from the accounts of Ms. Abedin [Weiner\\'s estranged wife and vice-chair of Hillary Clinton\\'s 2016 presidential campaign], according to people familiar with the matter. Those emails stretched back years, these people said, and were on a laptop that hadn’t previously come up in the Clinton email probe. Ms. Abedin said in late August that the couple were separating. The FBI had searched the computer while looking for child pornography, people familiar with the matter said, but the warrant they used didn’t give them authority to search for matters related to Mrs. Clinton’s email arrangement at the State Department. Mr. Weiner has denied sending explicit or indecent messages to the minor. \\nAlso, the Justice Department seems to have made a conscious decision in recent months to ignore the evidence that the Clinton Foundation is a money-making scheme for the Clintons. That may now be changing. The Wall Street Journal reported: New details show that senior law-enforcement officials repeatedly voiced skepticism of the strength of the evidence in a bureau investigation of the Clinton Foundation, sought to condense what was at times a sprawling cross-country effort, and, according to some people familiar with the matter, told agents to limit their pursuit of the case. The probe of the foundation began more than a year ago to determine whether financial crimes or influence peddling occurred related to the charity. Some investigators grew frustrated, viewing FBI leadership as uninterested in probing the charity, these people said. Others involved disagreed sharply, defending FBI bosses and saying Mr. McCabe in particular was caught between an increasingly acrimonious fight for control between the Justice Department and FBI agents pursuing the Clinton Foundation case. \\nGiven that there is ample evidence of the chicanery of the Clinton Foundation as well as evidence that the Clintons were using the foundation to grow their vast wealth, it staggers the mind that investigators “voiced skepticism of the strength of the evidence.” For instance, U.S. News and World Report recently wrote of a memo from 2011 about “Background on Teneo and Foundation Activities.” The leaked memo, which was recently published by WikiLeaks, was written by Doug Band — a top aide to Bill Clinton — and includes some damning stuff. In one part of the memo, Band writes about all the money he has raised for both Bill Clinton and the foundation — which he refers to collectively as \"Bill Clinton, Inc.” \\nBand wrote: Throughout the past almost 11 years since President Clinton left office, I have sought to leverage my activities, including my partner role at Teneo, to support and to raise funds for the Foundation. This memorandum strives to set forth how I have endeavored to support the Clinton Foundation and President Clinton personally. \\nAs U.S. News put it, \"The memo demonstrated the kinds of commingling that the Clintons\\' critics — and even some allies — have said create at least the appearance of inappropriate mixing of public and charitable activities for personal gain.\" \\nThat conclusion seems — if anything — conservative, since Band goes even further in his memo: Independent of our fundraising and decision-making activities on behalf of the Foundation, we have dedicated ourselves to helping the President secure and engage in for-profit activities — including speeches, books, and advisory service engagements. In that context, we have in effect served as agents, lawyers, managers and implementers to secure speaking, business and advisory service deals. In support of the President’s for-profit activity, we also have solicited and obtained, as appropriate, in-kind services for the President and his family — for personal travel, hospitality, vacation and the like. Neither Justin nor I are separately compensated for these activities (e.g., we do not receive a fee for, or percentage of, the more than $50 million in for-profit activity we have personally helped to secure for President Clinton to date or the $66 million in future contracts, should he choose to continue with those engagements). \\nIt appears that the Clintons learned nothing during the 1990s. If elected (which looks increasingly unlikely), Hillary Clinton will begin her presidency mired in a myriad of scandals. And — like her husband’s legacy — it will be difficult to say from one week to the next which of them should carry the most weight. At any rate, the Clinton Foundation money scandal deserves its place in the spotlight, even if it has to compete with the e-mail scandal, the Podesta e-mails, Benghazi, and whatever other infamous acts may not have come to light yet. Photo: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562102.152544}