{"duration": 0.04737257957458496, "input_args": {"text": "'HAVANA  —   Cuba is preparing for Fidel Castro’s final public appearance: a   memorial offering Cubans a chance to pay their respects. Details of Mr. Castro’s death on Friday night, at the age of 90, have yet to be made public. But as if performing a play that had been rehearsed for a decade, the government continued to roll out plans for what official statements have called a   period of “Duelo Nacional,” or national mourning. Government employees have begun setting up speakers and yellow   gates at the Plaza de la Revolución, where the memorial will begin on Monday. Granma, the main government newspaper, published a special edition on Mr. Castro’s life and achievements. Statements and articles in government news outlets have also been lionizing Mr. Castro’s life and achievements  —   “All of Cuba With Fidel,” said one headline  —   while warning that liquor sales would be limited nationwide until next Sunday, when the mourning period is scheduled to end at noon. “Public activities and events will be suspended, and national flags will fly at   in public buildings and military installations,” Granma reported. “Radio and television will continue with programming that is informative, patriotic and historical. ” All across Havana on Saturday night and Sunday morning, Cubans seemed quieter, more cautious, less certain of what the future might hold. Several nightclubs stayed closed on Saturday night. Traffic lessened, and the usual weekend music and revelry seemed dialed back. Many predicted that the somber mood  —   both sincere and enforced by the state  —   would hold until Mr. Castro’s ashes were interred in Santiago de Cuba next Sunday after a procession along the country’s central highway. Elian Gonzalez, the center of an international custody battle waged by Fidel Castro nearly two decades ago, returned to the public eye on Sunday to praise the leader who fought to return him to Cuba. Echoing the    adulation on state media, Mr. Gonzalez said on   television that the Cuban leader’s legacy will long outlive him. It’s “not right to talk about Fidel in the past tense . .. but rather that Fidel will be,” Mr. Gonzalez said. “Today more than ever, make him omnipresent. ” At one of Havana’s most popular   hot spots  —   behind the imposing Capitolio building, which is being restored to hold the country’s national legislature  —   the crowds were smaller than usual after dark on Saturday. Several young Cubans could be seen scrolling through Facebook and pointing out what relatives and friends around the world were sharing about Mr. Castro’s death. Only a handful were talking to those relatives by video chat, which is usually the most popular activity in the hot spots spread across Havana. Tourists in the group said they were surprised but pleased to have been on the island during such a historic moment. “I’m definitely going tomorrow to see everyone saying goodbye to Fidel,” said Miguel Castillo, 52, a visitor from Costa Rica. “He was a symbol of resistance. The people of Latin America had long been listening to his voice, to his call for autonomy. ” Marini Danilo, 30, a tourist from Italy, said he couldn’t believe his vacation had turned into a chance “to live in such a big story. ” “For me, he was just another dictator,” Mr. Danilo said. “He was not my dictator, he was Cuba’s, but it feels crazy to be here. ” At least on Sunday, the scale of the goodbye for Mr. Castro was hard to gauge. Cubans have long known that when the world is watching, so are the state authorities: During international conferences, during President Obama’s visit in March and, now, after Mr. Castro’s death, the presence of state security becomes more intense, both in the streets and behind the scenes. Even without such clear warnings, Cubans  —   after decades of living under Mr. Castro and his brother Raúl  —   know that in such moments they are expected to behave and to say very little, especially to visiting reporters. So far, grief and memorialization have been dominated by the state. There have been only occasional public expressions or gatherings of any kind: a few students from a young Communist group getting together to grieve publicly on Saturday a small group of Cubans waving flags on the Malecón, the city’s seaside boulevard. At the Plaza de la Revolución on Saturday night, the wide expanse of concrete was empty except for the police, some soldiers  —   and exactly four visitors snapping photos. But starting on Monday, Cubans expect to see thousands of others, for the final spectacle of the Fidel Castro era.'"}, "time": 1742628593.5143187}