{"duration": 0.11079668998718262, "input_args": {"text": "'We recently moved from NYC to Portland, Oregon, and I have to say the biggest change (besides all of the trees and so much more living space!) is the cycling culture. Portland is one of the most bike-friendly cities in the country. There are bikes everywhere you look (I just bought this one and I love it). Not only are there safe bike lanes leading everywhere—including all the way to the airport—there’s also a bike shop on every corner and even a bike assembly area within the airport terminal itself. The bike culture also flourishes in Portland because cyclists and drivers both follow the rules (and, let me tell you, that’s a HUGE change from NYC as well).\\nCycling is great for your body and great for the environment. People who ride their bicycles regularly have better cardiovascular fitness, less body fat, increased energy, and they experience less depression. These are all ideal characteristics for being conditioned in a SHTF situation. Cycling to work instead of driving saves close to 10% of your household emissions and biking combats noise pollution, traffic, and uses far less rubber than what is needed for car tires. It makes sense that anyone who is interested in having a sustainable lifestyle would also be interested in traveling by bicycle as much as they can.\\nWhy Cycling Matters in a SHTF Situation \\nIn addition to health benefits, knowing how to cycle and having the necessary gear can come in handy in a dire SHTF situation. I recently read an article about how traveling by bike is your best bet for surviving the zombie apocalypse—the article was a bit of a joke, but it got me thinking seriously about bugging out and how to travel safely in a potentially dangerous situation.\\nRiding a Bicycle Lets You Avoid Traffic : First of all, anytime there is an emergency, from a severe weather event to a terrorist threat to a fire, traffic becomes an immense and literal roadblock . You won’t be limited to roads at all if you have a bicycle. Being able to take alternate routes means getting the heck out of Dodge faster—of course, you’ll have issues with covering long distances, but people stuck in hours of traffic will too.\\nRiding a Bicycle Does Not Require Fuel : There’s also the issue of getting gas and maintaining your energy source for your car. Sure, if you’re prepared, you’ll have a few extra tanks on hand, but what happens when that dries up? In a national or worldwide SHTF situation, gasoline will be among the first resources to go scarce. When the gas is gone, even if drivers are able to power through traffic and use their preps, it’s only a matter of time before they have to abandon their cars and continue their travels on foot.\\nBikes are Easy to Repair : A bicycle is a straightforward machine that requires only a slight bit of research to repair. You don’t want to be worrying about your engine or oil changes when you’re on the run.\\nYou Can Still Carry Cargo : If you’ve traveled to Indonesian countries you’ve seen how much gear (or how many people!) can be packed onto a single bicycle. Having a basket or rack is an easy and affordable way to make your bike more emergency friendly. Even just having a simple set up for your bug-out bag and some of your preps will make a huge difference.\\nYou Can Accommodate Children on a Bicycle : If forced to abandon your car, having smaller children means that they slow you down, and if they aren’t willing to walk you will find yourself in a terrible situation indeed. Carriers or trailers like this one mean your child can be sleeping soundly while you travel.\\nRiding a Bike is Better for Your OPSEC Situation : Bicycles are stealth and silent when you are riding them and are reliable in an off-grid situation . They are small and easy to camouflage–they can even be pulled up into a tree or stashed behind some bushes at a moment’s notice.\\nAt the very least, understand that you cannot rely on your vehicle in a true SHTF situation if you have to flee your home. Loading up your trunk with preps could potentially be a waste of time—instead, you might do well to learn how to ride a bike and be sure one is packed in that trunk of yours.\\n  \\nPamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 12th, 2016 Off-Grid Travel: The DIY Survival Bike Cycling and Walking to Work Increases the Feeling of… 3 Uses a Stationary Bike Has When the Grid Goes Down Could the Survival Bike be your Bug Out Vehicle of Choice? SHTF Planning: 7 Ways to Use The Items Around You To Adapt… '"}, "time": 1742563666.3507307}