{"duration": 0.12737345695495605, "input_args": {"text": "'FBI Director James Comey hit back Wednesday against Democratic criticism of his decision to announce the reopening of the investigation into Hillary Clinton’s emails 11 days before the 2016 election. [He also revealed the investigation found thousands of Clinton’s emails on the seized laptop of Anthony Weiner, top Clinton aide Huma Abedin’s husband, including classified emails.  Comey said it made him “mildly nauseous” to think he could have had some impact on the election, but that he believes he did the right thing and to this day, would not change his mind. “It makes me mildly nauseous to think that we might have had some impact on the election. But honestly, it wouldn’t change the decision,” he told the Senate Judiciary Committee at a hearing. He explained that investigators found metadata on Weiner’s laptop that showed there were thousands of Clinton’s emails on the device, and that they believed the emails could include those missing from her first three months as secretary of state. Comey said after repeatedly telling members of Congress that the FBI had concluded its investigation into Clinton, the only right thing to do was to let Congress know the case was reopened. “I could see two doors and they were both actions. One was labeled ‘speak,’ the other was labeled ‘conceal,’” he said. “Having repeatedly told this Congress, we are done and there’s nothing there, there’s no case there, there’s no case there, to restart in a hugely significant way, potentially finding the   that would reflect on her intent from the beginning and not speak about it would require an active concealment, in my view,” he said. He said “speak would be really bad,” but “concealing in my view would be catastrophic. ” He said he was asked by a junior lawyer whether he thought his decision would help   Donald Trump, but said he did not “for a moment. ” “Not for a moment because down that path lies the death of the FBI as an independent institution in America. I can’t consider for a second whose political fortunes will be affected in what way,” he said. Comey said the investigation into Weiner’s laptop showed that Abedin had regularly forwarded emails to her husband, likely for him to print out for her. He said Abedin forwarded “hundreds of thousands” of emails to Weiner, 40, 000 of which they reviewed. Three thousand of those were   and 12 of them contained classified information, he said. But he said Abedin and Weiner were not charged with any wrongdoing since investigators did not find a general sense of criminal intent  —   a decision that Sens. Lindsey Graham ( ) and Ted Cruz ( ) scoffed at. “On its face, anyone dealing with classified information should know that that conduct is impermissible,” Cruz said. Graham said someone should be prosecuted for allowing Weiner to have access to classified information. Weiner is a former New York congressman who resigned after he was caught sending a sexually explicit photo of himself to a woman. He later was involved in several more similar scandals, and after an article claimed he had engaged in “sexting” with a    girl, investigators seized his laptop. Despite Comey’s impassioned defense of why he announced the investigation, Democrats on the committee continued to criticize him. The FBI director has come under fire from Democrats since Clinton’s loss in November to Trump. Clinton herself on Tuesday said she was “on the way to winning” until Comey’s announcement. “I was on the way to winning until a combination of Jim Comey’s letter on October 28 and Russian WikiLeaks raised doubts in the minds of people who were inclined to vote for me but were scared off,” she said at an international women’s conference. “If the election were on October 27, I’d be your president,” she added. Sen. John Cornyn ( ) during the hearing apologized to Comey for Clinton’s remarks, and said she was blaming “everyone but herself. ”'"}, "time": 1742562630.6258776}