{"duration": 0.0556178092956543, "input_args": {"text": "'Email \\nDemocratic presidential nominee Hillary Clinton responded to the latest bombshell about her emails by demanding FBI director James Comey immediately release everything the FBI has discovered. \\nShe also falsely accused Comey of only sending the letters to Republicans, suggesting he was causing a political firestorm by doing so. Clinton held a brief four-minute press conference with reporters in Iowa Friday, where she has been campaigning. \\n“I have now seen Director Comey’s letter to Congress,” Clinton said to open her remarks. “We are 11 days out from perhaps the most important national election in our lifetimes … so the American people deserve to get the full and complete facts immediately.” https://twitter.com/NBCNightlyNews/status/792142514471907329 \\n“The director himself has said he doesn’t know whether the emails referenced in his letter are significant or not,” she continued. “I’m confident whatever they are will not change the conclusion reached in July. Therefore it’s imperative that the Bureau explain this issue and question, whatever it is, without any delay.” \\nClinton said the recent announcement from Comey came as a complete surprise to her and her staff, and that she only learned about it thanks to “this letter sent to Republican members of the House.” \\nWhile Clinton’s rhetoric implies that Comey only contacted Republicans, that’s not the case. While only Republicans are listed at the top of Comey’s letter (because they hold all House committee chairmanships) Comey’s letter was also copied to the Democratic ranking members of each committee. \\nClinton also dismissed as a “rumor” reports that the email investigation was reopened due to discoveries made during a separate investigation of former Democratic representative Anthony Weiner. Weiner is the husband of top Clinton aide Huma Abedin, though she announced her separation from him following revelations last month that Weiner sexted with an underage girl. That sexting triggered an FBI investigation of its own, which has now circled all the way back to Clinton. \\n“We’ve heard these rumors,” Clinton said. “We don’t know what to believe. That’s why it is incumbent upon the FBI to tell us what they’re talking about, because right now your guess is as good as mine, and I don’t think that’s good enough.” \\nShe then wrapped her conference by once again slamming Comey for supposedly only contacting Republicans. “If they’re going to be sending this kind of letter that is only going originally to Republican members of the House, they need to share whatever facts they have with the American people.” \\n  The Daily Caller Foundation  '"}, "time": 1742562014.4620347}