{"duration": 0.03737306594848633, "input_args": {"text": "'Posted on October 31, 2016 by Baxter Dmitry in News , World // 0 Comments \\nIceland kicked the FBI out of the country after learning the United States authorities lied to them about the purpose of their visit and were only there to gather information about WikiLeaks. \\nOgmundur Jonasson, Iceland’s former minister of the interior, says he received an urgent message from the authorities in the United States saying that “ there was an imminent attack on Icelandic government databases ” by hackers, and that they would send FBI agents to investigate. RELATED CONTENT WikiLeaks: New Evidence Shows DNC Forced Bernie Out \\nHowever upon their arrival it became apparent that there was no imminent attack and the FBI agents were only there to secretly gather intelligence on WikiLeaks and Julian Assange. “Eight or nine” FBI agents were then ordered to leave the country. \\nWikiLeaks has many members in Iceland, a nation of activists that has swept the anti-establishment Pirate Party to the verge of forming government with similar non-mainstream parties this weekend. \\nBirgitta Jonsdottir, the Pirate’s nominal leader, is a former WikiLeaks member who worked with Assange on the release of Collateral Murder in 2010. \\nThe FBI has form when it comes to investigating WikiLeaks via Iceland. In December 2010, the US attorney for the Eastern District of Virginia requested Twitter account information for Jonsdottir. The subpoena cited a specific conspiracy provision that may have been aimed at those thought to have assisted Private Manning. Birgitta Jónsdóttir, Member of Parliament and former WikiLeaks associate. \\nHerbert Snorrason, a former WikiLeaks member once close to Assange, wrote on his website that he had been provided orders, unsealed on May 2, including a search warrant served on Google for “ all e-mail associated with my GMail account, every shred of information they had on my identity, and anything I’d uploaded to a Google service .” \\nSnorrason says the reason for the search warrant was “ because I had a conversation or a few with a white-haired Australian guy . These kinds of orders have been served on more of the people I know than I really care to think about. “ \\nAnother young activist, Sigurdur Ingi Thordarson, told a closed session of Iceland’s Parliament in 2013 that he had been cooperating with United States agents investigating WikiLeaks. Sigurdur Ingi Thordarson (known as Siggi) with Julian Assange in London. \\n“ He was at the time going back and forwards going to meet Julian. They were trying to get him to go there wearing a wire ,” Jonsdottir said in an interview. \\nOrdering the FBI agents to leave proves the self-sufficient island nation does more than pay lip service to ideals of transparency and freedom. It is also a powerful display of sovereignty that suggests they will be true to their word regarding plans to grant citizenship to Edward Snowden. \\nWhen asked by reporters if they are worried that granting a haven to the NSA whistleblower might rile their NATO ally, the United States, Jonsdottir said, “ Well, we have done things that don’t make other nations happy before. Sometimes it’s a case of doing what is right versus what is easy. ”'"}, "time": 1742563262.833697}