{"duration": 0.019231557846069336, "input_args": {"text": "'Kurds Worried Turkey Will Stab Them in the Back as They Fight ISIS Turkey publicly opposes ISIS while supporting them behind the scenes Image Credits: Kurdish YPG fighters: Kurdishstruggle . \\nTwo months after being purged from the border town of Jarablus in northern Syria by a Turkish-led force — and just days after being targeted by Turkish airstrikes near al-Bab — Syrian Kurds now fear a “stab in the back” from Turkey’s military as plans for a U.S.-led push to clear ISIS fighters from Raqqa are carried out. \\n“It is very important Raqqa is liberated,” a chief political leader of the main Syrian Kurdish party, the PYD, told Reuters . “But one point which is bothering us is that, if we go toward Raqqa, we will be stabbed from the back.” \\nAt the end of August, Turkish forces took part in a U.S.-led operation to eject ISIS from the northern border of Syria. Once inside Syria, however, Turkish forces — leading Free Syrian Army (FSA) rebels — took aim at Kurdish fighters in the town of Jarablus, which sent them scurrying across the Euphrates River in retreat. \\nThe issue here is that the U.S. claims to find the Kurds useful in the fight against ISIS. The Kurds, in fact, make up a significant portion of one of the primary U.S.-supplied rebel forces in the region. As Reuters explains : \\n“Kurdish militia have played a big role in the past year in the Syrian Democratic Forces (SDF), a U.S.-backed umbrella group, as it has seized large areas of territory from Islamic State, laying the ground for an assault on Raqqa. \\n“However, Turkey’s intervention in Syria in August in support of rebel groups fighting under the Free Syrian Army (FSA) banner has complicated that equation, leading to clashes between them and Kurdish groups allied to the SDF.” \\nThe problem is one of trust. Turkey believes the Kurdish militants are aligned with the Kurdish PYD party, which the Turks believe is allied with Kurds within Turkey who’ve been waging a religious insurgency for over three decades. \\nSo regardless of whether the U.S. finds the Kurds useful, Turkey has made it clear it intends to sleep with one eye open for the foreseeable future. In fact, it’s taking a much more proactive stance than that. \\nLast Thursday, in a campaign of airstrikes that were “the heaviest against the YPG since Turkey launched a military incursion into Syria,” Turkey targeted three Kurdish-controlled villages along the northern Syrian border. The Turkish military later confirmed it had carried out “26 strikes on areas recently taken by the Kurdish YPG militia” and “had killed between 160 and 200 combatants.” \\nTurkey’s major concern is that Kurdish-controlled enclaves will physically unite, “thereby creating a de facto Kurdish mini-state along the Turkish border.” As such, Turkey has warned Kurds to keep out of towns like Manjib, which is just northeast of the heaviest fighting in Aleppo. \\nThis tangled web of strained alliances and old feuds will likely only grow more confusing as the U.S.-led operation to purge ISIS from Raqqa draws nearer. In any case, Turkish President Erdogan seems to have discovered a newfound independence , and the days of him obediently — even if somewhat grudgingly — bending to the U.S. will appear to be fading, as well. \\n“From now on we will now wait for problems to come knocking on our door, we will not wait until the blade is against our bone and skin, we will not wait for terrorist organizations to come and attack us,” Erdogan said from his palace last week. “Let them go wherever until we find and destroy them. I am saying this very clearly: they will not have a single place to find peace abroad.” NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742628549.450239}