{"duration": 0.05901050567626953, "input_args": {"text": "\"Share on Twitter IJR Opinion is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nI had my life threatened, and I didn’t ask for it. \\nMaybe it had something to do with the fact that a deranged moron woke up on the wrong side of the bed on a Monday morning, or maybe it’s because I’m in a leadership position for my local Republican Party in a bellwether county. Maybe both. Either way, it was chilling. \\nI got the email when I woke up at 7 a.m. on a Monday morning, right as I was getting ready for a busy week. As someone who works in public relations and media, I’m bound at the hip to my email inbox. \\nNeedless to say, the email with the subject line “BOMB” instantly caught my eye. I opened it. “This has to be a joke,” I thought. Another political fundraising email? After all, desperate times do call for desperate measures. \\n“You Nazi f***ing Republicans are going to blow up to pieces,” it began: \\n“You won't live to see the election day, and when your friends talk about how great you and your family WERE, other motherf***ing Republican a**holes would know how dangerous it is to insult the U.S. soon-to-be president Hillary Clinton.” \\nSwell. The election hasn’t even happened yet, and I’m already about to get droned by President Hillary Clinton. Alex Jones was right. Well, at least I’ll go down in a blaze of glory. \\nIt continued: \\n“You have no idea what a liar your gun-loving daughter-molesting pig of a candidate is, but don't worry, I'm gonna show you who he is and how much he really cares about you f***ers who are about to die for him. Sit tight, it'll be over soon.” \\nAnd that was it. My immediate reaction was to send a quick reply, a snarky “Nice to meet you too” or “Do you even know me?” But I didn’t. \\nFor the record, I’ve meticulously tiptoed around expressing public sentiments for or against Donald Trump. Anyone involved in a GOP leadership role is obligated to support whomever the GOP nominates. And if you refuse to back the candidate, you shouldn’t publicly oppose or speak out against said candidate. Plus, there are curtains on the voting booth for a reason. \\nBut as far as the Republican Party is concerned, I have never been a fan of Donald Trump. Heck, I spent months of my life campaigning against Donald Trump in the GOP primaries. And while I am most definitely disgusted by Donald Trump’s comments about women and social issues - and I think I can speak for many lifelong conservatives in my shoes - we should all be completely repulsed by this kind of attempt to threaten or undermine our democratic system through threat of physical harm. \\nAnyone who threatens someone else’s life because of alleged support for Donald Trump (or any other candidate) is threatening a pillar of freedom that makes our republic great. The threat I received this past week is hardly an isolated case, either. It is merely one example of many acts of violence taking place against people of differing viewpoints. David French of National Review wrote a particularly jarring account. \\nYou can bet that no matter the outcome on November 8th, there will be textbooks of postmortems about what happened this year. But it goes without saying that in the most contentious presidential election in recent memory, we seem to have forgotten who we are. \\nWe’ve all “unfollowed” Facebook friends of opposing viewpoints, sent regrettably nasty in-the-moment texts to people with whom we disagreed, and engaged in shameless schadenfreude at the demise of both political parties. \\nBut despite our differences, I think Americans can all agree on one thing: we have a right to vote for whoever we think will be the best leader for our country. As Thomas Paine once said: \\n“The right of voting for representatives is the primary right by which other rights are protected. To take away this right is to reduce a man to slavery, for slavery consists in being subject to the will of another.” \\nAnyone who threatens the life of a fellow citizen because of his or her support for a candidate is attempting to attach a price tag of fear and risk to a vote. \\nDespite intimidation, violence, despair, and bomb threats - go vote. Volunteer. In the meantime, you’ll be silently laughing in the face of those who want to destroy our democracy. \""}, "time": 1742562193.5753326}