{"duration": 0.07449650764465332, "input_args": {"text": "'NTEB Ads Privacy Policy Donald Trump, Bible Prophecy, And The Coming Global Shaking That Will Shock The World Listen to me, America, the time is growing ever shorter. Get your eyes off of red vs. blue and conservative vs. liberal, you will never see the truth that way. The God of Abraham, Isaac and Jacob is getting ready to insert Himself into our world in a very visible and tangible way. These are the days of prophecy. by Geoffrey Grider October 30, 2016 Join us as we apply Paul’s command found in 2 Timothy 2:15 to ‘rightly divide’ our Bible and put everything in it’s proper perspective and place. \\n“And I will shake all nations, and the desire of all nations shall come: and I will fill this house with glory, saith the LORD of hosts.” Haggai 2:7 (KJV) \\nCLICK HERE TO LISTEN LIVE when the show starts Sunday night at 9:00PM EST! \\nListen to me, America, the time is growing ever shorter. Get your eyes off of red vs. blue and conservative vs. liberal, you will never see the truth that way. The God of Abraham, Isaac and Jacob is getting ready to insert Himself into our world in a very visible and tangible way. These are the days of prophecy. CLICK IMAGE SUNDAY NIGHT AT 9:00 PM EST TO LISTEN LIVE TO THIS BIBLE STUDY \\nOn this episode of Rightly Dividing , we look at the 2016 presidential election, just a little over one week away, and the coming implications it will have on the fulfillment of Bible prophecy right here and right now. We are living in exciting times, and they are about to go into end times overdrive. \\nCLICK HERE TO LISTEN LIVE when the show starts Sunday night at 9:00PM EST! SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742562058.2641518}