{"duration": 0.18897008895874023, "input_args": {"text": "\"By Lambert Strether of Corrente . \\n2016 \\nDays until: 4. Now you can count the days on the fingers of one hand! \\nCorruption \\n“Hillary Clinton Economic Team Planned Secret Meeting With Wall Street Mogul Pushing To Shift Retiree Savings To Financial Firms” [David Sirota, International Business Times ]. And Sirota is a busy lad– \\n“How Donald Trump Used Fine Print To Make It Harder To Sue Wall Street For Fraud” [David Sirota, International Business Times ]. In Links this morning, but amplifying: \\nAccording to hundreds of pages of court documents reviewed by International Business Times, Trump notched a victory for himself and the financial industry by convincing judges that his own fine print warnings meant he had not deceived investors when he lured them to bet — and ultimately lose — hundreds of millions of dollars on one of his riskiest development projects. The real estate mogul known for his litigiousness helped Corporate America secure a ruling making it harder for investors to file lawsuits. Unlike his other past business moves that appeared to affect only Trump’s business partners, vendors and customers, this Trump case helped set a court precedent that was soon codified into law. \\nTrump, in essence, argued “it’s my nature”: \\nTrump did not explicitly challenge the plaintiffs’ allegations that his prospectus contained misleading or inaccurate information. Instead, his lawyer argued that “the cautionary language in this prospectus was so complete, so repetitive, so obvious and so well designed” that it could not have misled investors. The court concurred. \\n“Let’s set aside Hillary Clinton as an individual and consider her as the perfection of a corrupt political system. As I noted yesterday, Politics As Usual Is Dead, and Hillary Clinton is the ultimate product of the political system that is disintegrating before our eyes” [ Of Two Minds ]. “All the Clintons did is assemble the parts more effectively than anyone else. Now that the machine has scooped up hundreds of millions of dollars in ‘contributions’ and other loot, vested interests and corrupted loyalists within the federal government will do anything to protect the machine and its vast flow of funds.” Which is why Clinton’s public promises on policy are meaningless; we don’t know who her silent partners are. And that ties rather neatly into her incrementalism, which she frames as “I don’t want to promise what I can’t deliver” (but to whom were the promises really made?) More: “Cobble together a multi-million dollar private foundation, millions of dollars in speaking fees from big-money contributors, conflicts of interest, the secrecy of private email servers, pay-to-play schemes and corrupted loyalists planted in the Department of Justice, and the inevitable result is a politics as usual money-harvesting machine that lays waste to the nation, supporters and critics alike.” \\nThe Voters \\n“The Daily 202: College-educated white women are Hillary Clinton’s firewall” [ WaPo ]. “If the Republican nominee was anywhere close to Romney’s 52 percent support level among this traditionally Republican-leaning constituency, he would likely win the election.” From what I read on the Twitter — admittedly an idiosyncratic sample — Clinton’s previous firewall feels like she used and abandoned them. So… \\n“The End of Black-Checking for Hillary” [ Progressive Army ]. “Michelle Alexander [author of The New Jim Crow went on MSNBC with Chris Hayes to discuss her concerns about the Clintons. She spoke her truth, our truth. Many in America turned on her. They lined up to tell her she was wrong about the very same things we applauded just a year ago.” Predictably, the Democrat nomenklatura went nuts. One Kossack: And now Michelle Alexander comes to lecture other black folks abt voting for Hillary. Ugh what an awful show from Hayes tonight. Just awful. \\n&mdash; Armando (@armandodkos) April 2, 2016 \\n(I think “black folks” is a particularly nice touch.) The writer concludes: “Throwing Michelle Alexander to the wolves to defend the Clintons, of all couples, was far too much for me.” \\n“Black voters sue North Carolina over last-minute purges” [ Bloomberg ]. In a last-minute lawsuit. As I keep saying, if the Democrats saw voter registration as a core party function, we wouldn’t be seeing shenanigains like this in the first place. \\n“Identity and the Election: How Groups of Voters Have Changed Their Minds” [ Bloomberg ]. Here is a breakdown of Clinton’s margin before and after the Comey bombshell: \\nClinton support among white college voters increased the most . I suppose they actually bought the idea that Comey, like Trump, is a Russian agent of influence? Who are the “stupid” voters now, pray tell? \\nPolicy \\n“Memo to the Next President: Avoid the ‘Vision Thing’ in the Mideast” [ Foreign Policy ]. Internal disagreements in The Blob! And “old-fashioned GOP realism” looks pretty good compared to crazypants neo-con adventurism (or Clinton’s debacle in Libya). \\n“Marijuana ballot initiatives 2016: Five more states may make pot legal” [ Yahoo News ]. “The vote to watch is in California, where polls suggest the “Adult Use of Marijuana” referendum has a substantial lead.” I just hope marijuana doesn’t go corporate… \\n“Younger voters overwhelmingly favor marijuana measure, which is likely to pass, poll finds” [ Los Angeles Times ]. \\nDownballot \\n“Democrats have a good chance to take control of the Senate just two years after losing it. A friendly map with seven Republican-held seats in states President Obama won has opened the door, and now Republicans are hoping Donald Trump doesn’t drag them down in the many tough states they have to defend” [ WaPo ]. Thing is, if you look at the chart, “50” is smack dab in middle of “toss-up.” RCP agrees , with 46 Democrats, 46 Republicans, and 8 toss-ups. These are RCP’s toss-ups: PA: Toomey (R), IN: Open (R), WI: Johnson (R), NV: Open (D), MO: Blunt (R), NH: Ayotte (R), FL: Rubio (R), NC: Burr (R). Note that WI, NH, FL, and NC are swing states, too! \\nThe Trail \\n“‘We’ve got to be nice and cool, nice and calm. All right, stay on point Donald, stay on point,’ Trump said in Pensacola, Fla” [ CNN ]. “‘No sidetracks, Donald. Nice and easy,’ Trump said.” So Conway is doing her job. \\n“Put another way, as Clinton has focused her time and money primarily on swing and Republican-leaning states, the question looming over her campaign is whether she has left herself open to a flanking maneuver from Trump in any of the seemingly safe Democratic states that he is now targeting—key among them Colorado, Michigan, and Wisconsin” [Ron Brownstein, The Atlantic ]. “Clinton and her allies are responding with a new wave of advertising and more surrogate appearances in those blue-leaning states, and most dramatically, a visit by Clinton herself to Detroit on Friday. But overall they see Trump’s late push into these Democratic-leaning places as a sign of weakness, not strength—an admission that at this late date he needs new options for reaching an Electoral College majority because he cannot feel secure of capturing enough of the states both sides consider true battlegrounds.” \\n“A tightening race nationally has also translated into tightening at the state level. States that were trending Trump’s way in September started to slip away from him in early October. Now, with the focus more on Clinton’s emails than on Trump’s debate performances or his Twitter spats, states like Iowa and Ohio are moving back in Trump’s direction” [ Cook Political Report ]. Republicans “coming home.” \\n“Two things to look for in the exits: First, how is Mr. Trump doing among white voters? His strategy requires grabbing a higher percentage of whites than Mitt Romney’s 59% and boosting their share of the turnout above 2012’s 72%. College-educated whites traditionally vote Republican, but Mr. Trump has struggled with them. Will he match Mr. Romney’s 51% among all college grads?” [Karl Rove, Wall Street Journal , “What to Watch for on Election Night”]. “Second, how is Mrs. Clinton doing among minorities and millennials? Her strategy calls for replicating President Obama’s 2012 coalition. That year African-Americans were 13% of turnout, and 93% went for Mr. Obama; Hispanics were 10% of turnout, and 71% voted for him; and millennials were 19% of turnout, 60% of whom supported the president.” \\n“Only voters in six states: Connecticut, Michigan, Minnesota, Mississippi, New York, Pennsylvania and Wisconsin are allowed to void their early or absentee ballots and cast a new vote” [ Daily Dot ]. \\nDemocrat Email Hairball \\n“Here’s the updated list of all Podesta docs published by @WikiLeaks that have been proven, or claimed, to be fake” [ Glenn Greenwald ]. \\nStats Watch \\nBig stats day today! Incidentally, I quote Econoday first, but — and this is one Maine bear’s purely subjective opinion — the tone of the Econoday blurbs is noticeably happier than other commentary. I wouldn’t go so far as to say “happy talk,” but… \\nProductivity and Costs, Q3 2016: “Productivity has burst out of its slump, rising at a better-than-expected annualized pace of 3.1 percent in the third quarter” [ Econoday ]. “The third-quarter breakdown shows a surge in output, more than doubling to a 3.4 percent growth rate at the same time that growth in hours worked slowed sharply, to a 0.3 percent rate vs the second-quarter’s 1.7 percent. Greater efficiency between output and hours worked holds down labor costs which rose only 0.3 percent which is much better than expectations.” And: “The driving force for third-quarter productivity was a surge in output coupled by the lower labor cost gain” [ 247 Wall Street ]. But: “Although many times the data is significantly revised between releases – it did not happen in this release. But IF I believed this data, costs are rising significantly whilst productivity is in the toilet (as I only look at year-over-year data – the headline compounding distorts the view)” [ Econintersect ]. “If data is analyzed in year-over-year fashion, non-farm business productivity was unchanged year-over-year, and unit labor costs were up 2.3 % year-over-year. Bottom line: the year-over-year data is saying that costs are rising faster than productivity.” And but: “[T]he broader trend remains consistent with a decade-long decline” [ Wall Street Journal , “U.S. Productivity Jumps in Third Quarter, Trend Remains Soft”]. \\nJobless Claims, week of October 29, 2016: “[H]olding at or near record lows” [ Econoday ]. “[S]trength in the labor market and suggest that employers are holding tightly onto their employees.” Or jobless claims are hard to file and/or people are terrified of leaving. But: “The trend of the 4 week moving average is continuing to marginally worsened – and catch up to the rolling averages of a year ago – and this trend historically indicates a weakening GDP” [ Econintersect ]. \\nChallenger Job-Cut Report, October 2016: “Challenger’s October layoff count is low,” and lower than the third quarter average [ Econoday ]. “[A] positive signal for tomorrow’s employment report.” \\nFactory Orders, September 2016: “Good news is hard to find in the September factory orders report which is best described as flat” [ Econoday ]. And: “[T]he data in this series is noisy so I would rely on the unadjusted 3 month rolling averages which say there was a moderate improvement this month – but this series remains in contraction year-over-year” [ Econintersect ]. \\nGallup Good Jobs Rate, October 2016: Up, in a typical seasonal pattern, and “higher than any GGJ rate recorded for the month of October since Gallup began tracking this measure in 2010” [ Econoday ]. “The percentage of U.S. adults who participated in the workforce in October in any capacity — by working full time, working part time or not working but actively seeking and being available for work — was 68.4 percent, up almost a full percentage point from 67.5 percent in September.” \\nISM Non-Manufacturing Index, October 2016: “Much of the ISM non-manufacturing report, at a composite of 54.8, is strong with employment, however, an exception,” [ Econoday ]. “Employment growth may be down, but this report, like the services PMI earlier this morning, is pointing to a solid fourth-quarter start for the bulk of the economy.” But: ” This was below the consensus forecast of 56.1, and suggests slower expansion in October than in September” [ Calculated Risk ]. And but: “New orders were solid at 57.7 in October, but while they were above the net reading they were still down from September’s 60.6 reading” [ 247 Wall Street ]. “Business activity was the same reading at a strong 57.7. But like the new orders component, the net business activity was slower growth than what was seen in September.” \\nPurchasing Managers’ Index Service Index, October 2016 (final): “Growth in the nation’s service sector accelerated sharply in October based on Markit Economics’ U.S. sample” [ Econoday ]. “Strength in consumer spending is what respondents reported as well as a rise in both input costs and selling prices. New orders are at an 11-month high as is business activity while year-ahead expectations are at their best level in a year-and-a-half. Backlogs are also piling up. This report points to a very solid fourth-quarter start for the bulk of the economy.” \\nBloomberg Consumer Comfort Index, October 20, 2016: “The sharp gain in the prior week was no fluke for the consumer comfort index which, unlike other readings on confidence, has been picking up steam going into next week’s presidential election” [ Econoday ]. \\nChain Store Sales, October 2016: “Chain stores are reporting mixed sales in October, results that offer little guidance for monthly change in core retail sales (ex-food ex-gas)” [ Econoday ]. \\nShipping: “Top North America TEU negative performance worsened through September” [James Sands, Seeking Alpha ]. “The marginal decline was impacted by top ten North America seaport laden imports, while laden exports improved. The Hanjin bankruptcy impacted seaports broadly, most notably the Port of Long Beach. Class I rail container traffic has continued to mirror these trends with mixed results.” \\nShipping: “[Freignt forwarder] Panalpina has reported signs of an earlier-than-normal start to the end-of-year peak season in air freight partly as a result of the disruption to supply chains caused by the collapse of Korean container carrier Hanjin Shipping [ Lloyd’s Loading List ]. “‘Obviously, not all of the Hanjin ships have arrived at port and there is cargo meant to reach stores for Christmas is still ‘floating’,’ said CEO Stefan Karlen. ‘So some customers are getting concerned and because of that switching containers to air freight, and that’s where the pick-up (in demand) is coming from.'” \\nShipping: “With the ocean cargo sector effectively going from 4 alliances to 3, when the Ocean Alliance takes effect in April 2017, the further concentration should enable the alliances, within themselves, to better control capacity as a means to improving revenue” [ Logistics Management ]. One thing cartels are for… \\nShipping: “We will behave ourselves, say Ocean Alliance members” [ Lloyd’s List ]. “Ocean Alliance members have vowed to be more disciplined in the area of new tonnage in an effort to tackle the overcapacity that has depressed the container shipping market.” \\nShipping: “Dire safety conditions revealed in wake of Gadani fire as death toll feared to surpass 100” [ Splash 247 ]. “A fire, which has now killed at least 21 people, is still raging at Pakistan’s Gadani ship recycling area with fears the eventual death toll could hit triple figures. An explosion occurred on Tuesday as a welder worked on a gas cylinder in a beached oil tanker. The explosion rapidly became an inferno with many workers trapped in the ship.” That is like a war, isn’t it? From John Keegan’s description, in The Price of Admiralty , of the battle of Jutland (“the last major battle fought primarily by battleships in world history”): \\nAlthough not a war between states: \\nNasir Mansoor, deputy-general secretary of the National Trade Union Federation (NTUF), hit out at the absence of safety procedures at Gadani yesterday, saying the Indonesian ship’s tanks had not been cleaned ahead of the scrapping starting. Moreover, Mansoor alleged the yard had just one ambulance, which was being actually used for transporting the officials’ children to and from school. Mansoor said a total of 250 workers were working on the tanker when the explosion occurred. \\n“We demand that a murder case be registered right away against the Ship Breakers’ Association,” he said, calling for Rs3m compensation for each of the dead victims’ families. \\nOf course, given the givens, the explosion and the deaths follow from over-capacity as the night the day. And it’s not as if the conditions at Gadani weren’t common knowledge among elites. I remember reading this article in The Atlantic in 2014, and here’s an image from it: \\nSo, in the beached tanker, ka-boom! Whenever you hear the word “accident,” think to yourself: “What do you mean, ‘accident’?” Oh, and there’s this little detail: \\nThe floating oil production tanker, ACES (IMO # 8021830), was sold to the Gadani shipbreaker by Jakarta-based PT Sinar Mentari Prima and was used in the Jabung Batanghari terminal owned by the Indonesian government company BPMIGAS and operated by PetroChina. The change of flag and name of the ship happened just weeks before it reached the beach of Gadani, which strongly point towards the use of a cash buyer for the sale of the end-of-life vessel. \\nHmm. An unnamed “cash buyer.” Seems like Richard Smith territory… \\nRail: “U.S. rail traffic slump continued in October” [ Progressive Railroading ]. “U.S. railroads logged a 3.2 percent decrease in carload and intermodal traffic last month compared with October 2015, the Association of American Railroads (AAR) reported yesterday… Excluding coal, carloads fell 3.8 percent last month compared with a year ago.” \\nCommodities: “Cobalt is the element found within lithium-ion batteries that allows them to generate more power over a longer time-period than normal batteries and it has already powered a consumer tech revolution over the last decade. It is the catalyst for the imminent commercialisation of electric cars, the reason your smartphone doesn’t need charging every half hour, and the reason you can read your kindle cable free during that long plane journey” [ FCPA Blog ]. “But cobalt raises several compliance challenges. it is overwhelmingly found in one country — the Democratic Republic of Congo (DRC). Around 60% of global supply of cobalt comes from the DRC. Cobalt doesn’t currently fall under the SEC’s Dodd-Frank section 1502 covering conflict minerals and there is no specific compliance regulations attached to the sourcing of the mineral. But the lack of scrutiny by regulators seems likely to change in the near future as demand for cobalt and understanding of its sourcing increases.” \\nETFs: “This Year’s Most Innovative New ETFs” [ETFs.com]. “Innovative”? Uh-oh…. “Some of this year’s most innovative exchange-traded funds are ones that look at gender diversity as a way to boost corporate performance, generic drugs and even using crowdsourcing to make bets on which stocks will outperform from month to month.” Seems frothy. \\nToday’s Fear & Greed Index: 17 Fear (previous close: 18, Fear) [ CNN ]. One week ago: 46 (Neutral). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Nov 3 at 11:31am. Still waiting for single digits. \\nGaia \\n“Michael Pollan Explains Why Psychedelic Drugs Are the Ultimate Meal for Your Mind” [ Mother Jones ]. News you can use! \\nImperial Collapse Watch \\n“Today’s understanding of the British Empire has been shaped by state secrecy and the destruction of historical records” [ Jacobin ]. “There was no moment of reckoning — unless you dig a little deeper, it appears if Britain simply handed official control over the governance of its colonies to locals. As a result, not only does British imperialism receive exaltation and eulogy, but the postcolonial melancholia that afflicts public political culture is premised on the idea it was built on virtue and the diligence, strength, and courage of British people.” \\nClass Warfare \\n“‘I WANT MY COUNTRY BACK'” [ Pandaemonium ]. Here’s the British variant of the Acela-rider’s “Trump voters are stupid” meme: \\nShortly after the referendum, a meme began to trend. Following the Leave vote there had been a spike in people googling ‘What is the EU?’. Many Remainers took this to be proof of the ignorance of those voting Leave. In fact fewer than 1000 people googled ‘What is the EU?’ and there was no evidence that that a single person who had googled the question had voted Leave. Yet supporters of the EU continued to propagate this as evidence of the ignorance of Leave voters. If it was evidence of anything it was, perhaps, that an education is no insurance against cognitive bias, no protection against a willingness to be swayed by one’s prejudices, no shield against a tendency to jump to conclusions not warranted by the facts. \\nWell worth a read.\""}, "time": 1742628575.0679817}