{"duration": 0.019498109817504883, "input_args": {"text": "'  Carol Adl in News , World // 0 Comments \\nAustralia is to allow individuals and business’s to cultivate medicinal cannabis crops under strict government license and guidelines in an effort to substitute imports with a domestic supply. \\nThe recreational use of marijuana will however remains a criminal activity. \\nRT reports: \\nThe commencement of the Narcotic Drugs Amendment Act 2016 on October 30, 2016, marks a milestone for Australia’s medicinal cannabis prospects. The new regulations allow for the licensing of cannabis cultivation and the production of cannabis and cannabis resins for medicinal and scientific purposes. RELATED CONTENT British Government Admits Marijuana Has ‘Medicinal Value’ \\nUntil now, it has been difficult for patients to access medicinal cannabis products from overseas sources,” Federal Health Minister Sussan Ley said in a statement released on Sunday. \\n“These new laws change that situation by providing for a domestic supply of medicinal cannabis products that are not readily available for import.” \\nHowever, while pharmaceuticals will gain an advantage from the new law, recreational pot smokers are left disappointed, as consuming marijuana still remains a criminal activity. \\n“I want to emphasize that the changes to the Narcotic Drugs Act do not decriminalize cannabis for recreational use,” Ley said. \\nUnder the act, those companies ready to grow their weed plants must comply with state and territory drug legislations which would allow companies to classify their harvest in accordance with the Therapeutic Goods Administration. \\nTo hold a license for cannabis production, business will need to pass “strict fit and proper persons requirements and other legislative tests relating to security.” It is left up to individual states and territories to award licenses and outline the types of cannabis plants that can be cultivated and the quantities that can be produced.'"}, "time": 1742563894.5206277}