{"duration": 0.0476834774017334, "input_args": {"text": "\"\\nWhat the White House is Talking About: \\nMichelle Obama joins Hillary Clinton this afternoon in North Carolina for their first pairing on the campaign trail. \\nOf note: A quick search of Getty reveals there hasn't been a photo of the two women together since May 2014, when both accompanied their husbands on a brief tour of the National 9/11 Memorial in New York City. \\nWhat the White House Press Corps is Talking About: \\nWith a November 1st open-enrollment date looming, and a week of bad PR, Obama today has a conference call with Affordable Care Act “advocates and stakeholders,” according to the White House. \\nObama Going Full-Frontal: \\nFresh off his comedic spin on “Jimmy Kimmel Live,” and other recent late-night appearances on Colbert and Fallon, Samantha Bee, host of “Full Frontal,” gets her turn with the president. The show announced Obama will be Bee's guest Monday night. \\nOffice Space: \\nEven though the offices of powerful Washington types look pretty much as you would expect in this New York Times feature out today, it's sort of refreshing to see Valerie Jarrett also keeps a pile of shoes on hand, like me and most working women I know in this town. \\nImage Credit: Gabriella Demczuk for The New York Times \\nThe story includes the offices of several Cabinet members—Sally Jewel's looks cool—and Obama Chief of Staff Denis McDonough. Also, just sayin . \\n12 Days to Go, Eat Your Feelings: Part II: \\nOn November 1st you can literally taste the sweet victory of having survived this election cycle with a doughnut from Astro , inspired by the flavors of either candidate. Hillary's is a Spicy Hot Chocolate doughnut with a Chipotle glaze, because she eats hot peppers or whatever, for $2.85. And Trump's is a Vanilla Cherry Coke doughnut, a pillow doughnut filled with cherry compote (gag? a little?), for $3.10. \\nImage Credit: Rachel Lyn Photography \\nOur Daily Melania: \\nThis was Melania Trump's face when Donald Trump told George Stephanopoulos on “Good Morning America” this morning that she would be making more speeches on the campaign trail: \\nImage Credit: Screenshot/ABC News \\nApparently, news to her. \\nThe couple were spotted having lunch à deux at BLT Prime inside the new hotel, prepared for them by chef David Burke. Then they went upstairs to a suite for the GMA interview. \\nOn the fashion front, she and Ivanka Trump both wore Roland Mouret dresses to the Trump International Hotel ribbon cutting; hers was this icy blue for $2,215 , and Ivanka's a white with bell-sleeve cuff for $2,570 . \\nWhat The Beltway is Talking About: \\nBill Clinton Inc. New leaked emails show how money was raised for the Foundation and how Chelsea Clinton expressed concerns over the process. \\nWhat America is Talking About: \\nDonald Trump's star on the Hollywood Walk of Fame, which was vandalized with a sledgehammer yesterday. \\nHere it is being repaired: \\nImage Credit: Kevork Djansezian / Getty Images \\nTrump's Plan B: \\nBloomberg Businessweek's cover story, “ Inside The Trump Bunker With 12 Days To Go, ” goes inside the campaign's data operation (their email list is worth up to $112 million and they have a three-pronged voter suppression plan targeting idealistic white liberals, young women, and African Americans) as well as their post-election possibilities (“Win or lose, Trump’s future may well lie in capitalizing on the intense, if limited, political support he has cultivated over the past year.”) \\nRomney Doesn't Endorse: \\nThe 2012 Republican nominee tweeted yesterday for voters to vote for Republican down-ballot candidates, but made no mention of the presidential race (sorry, Evan McMullin): \\nTwitter: @ MittRomney \\nRomney also spoke in D.C. yesterday at the U.S. Chamber of Commerce headquarters and said he watched the presidential debates but neither candidate offered solutions to problems like the national debt and entitlements. \\nMeanwhile, in an Alternative Universe...: \\nPollster Frank Luntz said if Hillary Clinton was facing a different Repub , the race would be much different. Her vs. Ted Cruz would be tied, vs. Marco Rubio she'd be down eight points, and vs. John Kasich she'd be down 12 points. \\nSpooky: \\nThis Tenleytown anti-Trump Halloween display was sent in by Sharon Gang. “Buried in a Landslide” and “Hear Lies ... and Lies ... and Lies ... and Lies Donald Trump.” \\nImage credit: Sharon Gang \\nThrowback Thursday: That Time Ivanka Posted a Fireplace on Instagram While Her Father's Campaign Burned: \\nI'm endlessly fascinated by Ivanka Trump's Instagram account, a calming feed of inspirational quotes and family photos amidst the hurricane of the campaign. It's often bizarre to see what she posts while her father's campaign is facing a major controversy, so I went back through her account to see what she posted during major moments. You can read my full story here , but below are my three favs: \\nDecember 7, 2015: \\nDonald Trump calls for a “total and complete shutdown of Muslims entering the United States.” \\nIvanka posts five black-and-white photos to promote her Ivanka Trump Jewelry campaign. \""}, "time": 1742628524.8640542}