{"duration": 0.031736135482788086, "input_args": {"text": "'From the first piece headlined James Comey is damaging our democracy : \\nFirst, the FBI director, James B. Comey, put himself enthusiastically forward as the arbiter of not only whether to prosecute a criminal case — which is not the job of the FBI — but also best practices in the handling of email and other matters. Now, he has chosen personally to restrike the balance between transparency and fairness , departing from the department’s traditions. \\nFrom the second piece by notorious mud-slinger Dana Milbank: \\nI’ve long believed in Comey’s integrity. But if he doesn’t step forward and explain his October Surprise, he may inadvertently wind up interfering in the political process — perhaps even reversing the outcome of a presidential election — in a way that would have made J. Edgar Hoover gape. \\nAnd the third strike : \\nFBI Director James B. Comey’s stunning announcement that he has directed investigators to begin reviewing new evidence in the Clinton email investigation was yet another troubling violation of long-standing Justice Department rules or precedent, conduct that raises serious questions about his judgment and ability to serve as the nation’s chief investigative official . \\nBack to the July 7 editorial: \\n“It appears damage is being done to the rule of law,” Mr. Ryan said. He’s right, but the FBI director isn’t doing the damage. The wreckers are those who cast baseless aspersions on U.S. law enforcement in the service of their partisan goals . \\nI for one believe that Comey was wrong in July and is right today. He should have pressed for charges against Clinton early on. Using a “secret” private email server for confidential state business is not legal and would have been out of bounds for anyone else. Now possible new evidence was found and must be investigated. It is not Comey’s job to ask if the timing of a renewed investigation is convenient for the potential culprit. He also had to inform Congress because he had reasonably promised to do so. (He also needed to save his ass before anyone else in his department talked to the media.) \\nThe so called “election” of a U.S. president is always a sorry show. But this season’s version has at least some amusing moments. Seeing the hypocrites at Fred Hyatt’s Funny Pages™ squirm is one of them. It makes me smirk.'"}, "time": 1742562242.6240427}