{"duration": 0.14027023315429688, "input_args": {"text": "'LEWES, England  —   Though it is never flattering to be burned in effigy, Donald J. Trump was in good company on Saturday when his image went up in flames not far from those of the British prime minister, Theresa May, and of a   pope. In the streets, firecrackers exploded, blazing crosses were carried and the air filled with smoke as the people of Lewes, in southeast England, paraded in a dazzling array of costumes on Nov. 5, the anniversary of a failed plot to blow up Parliament in London in 1605. More than four centuries later, many throughout Britain still commemorate the event  —   known as Bonfire Night, or Guy Fawkes Night (after one of the plotters)  —   though its distinctiveness is being usurped as it sometimes merges with Halloween, a relatively recent import here, or the Hindu festival of Diwali. But not in Lewes. “It is the only thing in the whole year which marks us out from everyone else,” said Graham Mayhew, the mayor and a historian. “People are very proud of it and determined to protect it,” he said, adding that residents “love the fact that nobody else does this. ” On a field on the outskirts of the town, giant bonfires burned and fireworks exploded from the head of one of at least two effigies of Mr. Trump  —   this one suspended below a model of a wall adorned with Mexican flags. The spectacles are organized by the town’s seven bonfire societies, some of them more than 160 years old. Mr. Mayhew, interviewed before the event, said the subjects should not take their immolation personally. “You are not to take it seriously. It’s a statement of people’s reaction to the news,” he said. “It is not meant as an incitement. It’s like a political cartoon  —   it is exposing certain things to ridicule. ” Lewes (pronounced  ) has several claims to historical fame, being at one time the home of Thomas Paine, the radical American author of “Common Sense,” who is memorialized with a plaque on the town’s White Hart Hotel marking the place where he “expounded his revolutionary politics. ” But it is best known now as the unofficial center of Britain’s Bonfire Night tradition, commemorating a moment of deliverance for Protestant England: the discovery of the Gunpowder Plot, a plan by Roman Catholics to blow up Westminster Palace and everyone in it, including King James I. Guido, or Guy, Fawkes and his fellow conspirators were captured and suffered gruesome executions. Four centuries later, Lewes celebrates the event in a night carnival with strange, sometimes sectarian, undertones. Through the streets pass those dressed as smugglers, Zulu warriors, Native Americans, Vikings and regimental English soldiers, carrying flags with symbols such as the skull and crossbones. Then there is the effigy of Pope Paul V (the pontiff in 1605) alongside banners reading “no popery” and flaming crosses. Lewes also commemorates the killing of 17 Protestant martyrs who met their horrific deaths in the town well before the Gunpowder Plot. They were victims of the   Marian Persecutions of the 16th century, which took place when Queen Mary (or “Bloody Mary”) sought to stamp out Protestantism. There is also an act of remembrance for those who died in the major wars of the 20th century. Mr. Mayhew conceded that there was “a bit of a hangover from the strong religious feeling of the 19th century,” when   was rife, though he added that “most people would be horrified by the idea that they would have religious prejudice. ” Local Roman Catholics “tolerate it,” he said. “Sometimes feathers get ruffled. Some of the local priests have taken it more to heart. But everybody recognizes it is part of tradition. ” “It’s not right wing. It’s not left wing. It is a great celebration of ” he added. The town has a long history of Nonconformism, a form of Protestantism that dissents from the established Church of England, but   Lewes seems more attached to the trappings of sectarianism than its reality. In the book “Burn Holy Fire,” Jeremy Goring recounts an episode in 1981 when Ian Paisley, a   Protestant lawmaker from Northern Ireland, came to Lewes on Bonfire Night “and tried to fan the flames of conflict by distributing   leaflets. ” “His intervention backfired badly, for the following year he himself was burned in effigy,” Mr. Goring wrote. The giant crosses ignited to remember the Lewes martyrs appear to be a   innovation. According to Jim Etherington, a local historian and the author of “Lewes Bonfire Night,” their prominence increased in recent decades mainly because the police objected on safety grounds to fireworks in the parade, but seemed more relaxed about fiery crosses. The first recorded reference to November celebrations in Lewes dates from 1697, and over the next century and a half the “Bonfire boys” became increasingly unruly. In 1806, 18 were arrested, and there was a Bonfire Night riot in 1829. By the   there was pressure for more orderly celebrations, leading to the creation of the first bonfire societies, which developed in idiosyncratic ways. Members of the Commercial Square Bonfire Society, for example, adopted American Indian costumes because a handful had spent time in America building railroads in the West. “During their time there, they observed the dreadful treatment of the Native American population,” the Lewes Bonfire Council  website says. Though not exactly secretive, the bonfire societies are not very communicative, either, and the choice of effigies is known only by a handful of people before the unveiling in November. Brian Pugh, another local author, ties the strength of the Bonfire Night tradition to an innate rebelliousness. It is captured by a local saying, “We don’t be druv,” which translates as “We won’t be pushed around and are a bit rebellious,” he said. Perhaps a bigger puzzle is the fact that the Gunpowder Plot  —   and the accompanying rhyme “Remember, remember the fifth of November”  —   is still commemorated in Britain more than four centuries after it failed. What is so strange about that, wrote James Shapiro in “1606: William Shakespeare and the Year of Lear,” is that “the fifth of November recalls a collective experience, a day of communal deliverance on which nothing actually happened. ” He added: “Nobody has fully explained the deep hold that ‘Remember, remember the fifth of November’ continues to have on the British psyche (though its grip seems to be slackening and the image of Guy Fawkes may soon be associated more with the visages on the masks worn by Anonymous protesters). ” It will, however, be some time before Lewes forgets, even if a lot of people here may be hazy about some of the things they are remembering, and perhaps have simpler motives. “What other opportunities do you have,” asked Mr. Etherington, “to dress up in weird and wonderful costumes, when the town has been cleared of traffic?”'"}, "time": 1742562045.5109155}