{"duration": 0.23423314094543457, "input_args": {"text": "'A Thanksgiving Tribute & Meditation For Standing Rock Nov 24, 2016 0 0 \\nOn Thursday, November 24th, we come together with friends, family, and loved ones in gratitude, as is tradition, on this day in the United States. On this day, we are reminded of our gratefulness to our native people for their hospitality to new settlers, who arrived in the Americas during the European discovery of the land. \\nAre we today, truly, still grateful to our native brothers and sisters? \\nIn this day and age, during times of deep trauma for our native family at Standing Rock, in North Dakota, how can we truly give back and offer a hand of support and thanks, while celebrating this tradition in our homes? \\nTo begin with, giving thanks on Thanksgiving is not limited to the physical borders of the US, nor is it limited to the people of this country. As we the people of the world, as one humanity, come together to increase awareness of our Earth’s challenges, we are reminded that what happens in one corner of our world, happens too in the most far and remote corner. We are one big family. Thus, we celebrate traditions together, as we also come together to stand up for the rights of one another. We share in love and joy, as we too share in pain and despair. \\n“Injustice anywhere is a threat to justice everywhere.” -Dr. Martin Luther King, Jr. \\nHow many of us have watched, read, and heard of the human rights violations going on with water protectors at Standing Rock, and have wished for peace and justice for all? The United Nations has very clearly defined the rights of indigenous people in their “Declaration on the Rights of Indigenous Peoples” . It is 15 pages long, and it has 46 articles. The following article very clearly articulates the rights of the indigenous peoples in this particular circumstance: \\n“Article 32 \\n1. Indigenous peoples have the right to determine and develop priorities and strategies for the development or use of their lands or territories and other resources. \\n2. States shall consult and cooperate in good faith with the indigenous peoples concerned through their own representative institutions in order to obtain their free and informed consent prior to the approval of any project affecting their lands or territories and other resources, particularly in connection with the development, utilization or exploitation of mineral, water or other resources. \\n3. States shall provide effective mechanisms for just and fair redress for any such activities, and appropriate measures shall be taken to mitigate adverse environmental, economic, social, cultural or spiritual impact.” \\nOn September 20th, the chairman of the Standing Rock Sioux Tribe, Dave Archambault II, traveled to Geneva, Switzerland to appeal to the United Nations Human Rights Council for support. There were more than a dozen of other tribal leaders there, who were also testifying to the destruction of their lands and water, due to private corporations (largely oil companies) and governments, who have unlawfully, and in an inhuman manner, taken over private native lands for their own gain. This is being reported in both mainstream as well as alternative news outlets. \\n“The oil companies and the government of the United States have failed to respect our sovereign rights,” as testified by Archambault to the UN. “I am here because oil companies are causing the deliberate destruction of our sacred places and burials,” said Archambault. “Dakota Access Pipeline wants to build an oil pipeline under the river that is the source of our nation’s drinking water. Thousands have gathered peacefully in Standing Rock in solidarity against the pipeline. We stand in peace, but have been met with violence ,” Archambault said to the Council. \\nThanks to the determination of Dave Archambault II, tribal members, and all water protectors, the United Nations is now investigating the treatment of people at Standing Rock by North Dakota law enforcement. \\n“When you look at what the international standards are for the treatment of people, and you are in a place like the United States, it’s really astounding to hear some of this testimony.” A lot of it was just very shocking.”said Roberto Borrero, a representative of the UN International Indian Treaty Council, of his time spent interviewing tribal members and water protectors from all over who have gathered peacefully at Standing Rock. He was deeply shocked by what he and other observers witnessed and heard during their visit there. \\nWe live in a time, where the United States of America, is being asked to not invade other countries, but instead to look right into the heartland of the USA, and choose to do what is right by her own people. Why do we choose to get involved in one human rights abuse, but not another? How can we invade countries, even at times going against the will of other nations and the United Nations (e.g. Iraq, which was declared illegal by the UN ) to “go it alone” at war over claimed human rights abuses. Tell me, USA, why are you turning a blind eye here at home? Are you more interested in Oil, money and corporate support? Are you really here for your people? What do we have to truly celebrate this Thanksgiving? \\nThe whole world is watching. We, the citizens of the USA, are watching. \\nShow us what you stand for USA. \\nLet’s pray for the Standing Rock Sioux Tribe, for all water protectors at their camp, and for all forms of light and justice to emanate into a ball of light so powerful, that all acts of darkness are completely turned into love. May the North Dakota law enforcement and all private militarized forces surrounding Standing Rock, completely drop their weapons against all. Let’s pray for a complete stop to all activities that are not in alignment with our sacred Earth and the human rights of ALL. \\nLet’s protect our Earth, and Mother Nature’s bounty. Let’s protect our native people. Let’s protect one another. \\nWe all need water. We are water. Without water, we do not survive. If we are to be the masters of our own ship, we must be the master of our human right to accessible and clean water rightfully available to us through our Mother Earth. \\nPlease, let’s all come together on Thanksgiving, and everyday there after, and practice a 3 minute meditation called, “The Golden Thread” . There are different versions of this meditation. The one being referred to here is from the Swiss spiritual leader, Annette Kaiser , who “sees the 21st Century as a call for humanity to recognize itself as inseparably One, co-creating a new culture in collective wisdom and love of One Heart”. \\nThe project “The Golden Thread” has been initiated by a group of world citizens based in Austria, Germany an Switzerland, “bound by a deep love for the Earth”. This meditation “invites you to pause once a day for three minutes for ONE WORLD, our living space”. This is an excellent way to address any global imbalances while contributing towards a peaceful world for all. \\n“It is our idea to practice the following meditation daily for one year as a voluntarily chosen contribution for ONE WORLD.” \\nThe Golden Thread Meditation: Look for a quiet place See in front of your inner eye the globe in all its beauty Now turn towards a geographic region that you feel drawn to or that is afflicted with hardship. Let yourself be guided by your heart in this Now pause for three minutes and connect in love and compassion with this region, letting the light of your heart flow there without wanting a specific outcome Let yourself be touched and filled with your meditation \\nWhen we all apply this meditation as a peaceful force of love at Standing Rock, we can truly add to the process of restoring peace and healing there. We can support our water protectors, and Mother Earth. A helpful reminder to practice this meditation daily, is to wear a simple golden thread on your wrist or on another area of your body. Will you commit to this 3 minute daily meditation for up to a month, 3 months, or one year? Once the pipeline construction is stopped, it is still beneficial to send healing to the area that is Standing Rock. \\n“Being many, we change the world.”– The Golden Thread \\nLet’s come together as one people, on this day, and everyday thereafter, to give thanks to our native people, who have taught and given us so much. \\nIt is so much easier to look away from injustice. To turn a blind eye, so-to-say. For what we see, hear, and feel, truly does affect us. At the same time, where there is injustice, we must look, and we must find a way to help. Awareness is the first step. \\n“I recognize that awareness is the first step in healing or changing. I become more aware with each passing day.” – Louise Hay \\nPlease join us in the “Golden Thread” meditation today, at your own time, and in your own way. Commit to this 3 minute meditation everyday thereafter, as a call to peace for Standing Rock, and for all. Also, please take part in the globally synchronized prayer for Standing Rock on Saturday, November 26th, at 3pm central standard time (9pm GMT). Here is a link with more information to the event. \\nLet’s all unite in love, and be a powerful force of light that shines light into the darkest corners of our world. Let’s fall in love with ourselves, with our lovers, with our brothers and sisters, with our family, with our friends, with our neighbors, with animals, with plants, with the sky, with the Earth, with the moon, and with the stars again. Let’s love, and let’s dream the biggest and most beautiful dream of our new reality. Visualize it, feel it, live it. We create it. We are love. We are one. \\nHappy day of Thanks and of Giving to all, and blessings and gratitude to our indigenous family at Standing Rock. Peace, love, support and gratitude to all. Thanksgiving Blessings! \\nUlonda Faye is a certified wellness practitioner, holistic esthetician, and Rejuv Miracles Practitioner. She holds a B.A. in Political Science and International Studies, and has taken part in Peace and Conflict Research in Germany. She offers online and in-person education in holistic skincare, self-love, beauty rituals, and life coaching.'"}, "time": 1742563421.5590749}