{"duration": 0.1042027473449707, "input_args": {"text": "'You are here: Home / political cartoon / The DESPICABLE Treatment of Our Troops Summed Up By One Cartoon The DESPICABLE Treatment of Our Troops Summed Up By One Cartoon October 26, 2016 Pinterest \\nRobert Gehl reports that in a perfect sign of how little respect Barack Obama has for America’s men and women in uniform, he just offered our soldiers a pay raise that effectively leaves them with less money . \\nBack in April, the House Armed Services Committee approved a 2.1 percent pay raise for all military personnel – just above the increased cost of living. \\nBut that was just too much for Barack Obama. He countered with a 1.6 percent pay raise, below even what it takes to cover the cost of living. \\nThis will be the fourth straight year that Obama’s pay raises for the military doesn’t even keep up with average wage growth in the private sector. @Militarydotcom the 1.6% raise subtract the BAH cuts and healthcare \"reform\" means military members & veterans will loose $ this year \\n— Doc Bennett (@DocBennett1ID) June 14, 2016 \\nThis is all going on while the Obama Administration is spending untold millions bringing in improperly vetted Syrian refugees. @RMConservative @JBaker31826004 Obama spends $millions on admission of Syrian refugees & just cut the military pay raise from 2.1% to 1.6%. \\n— CDL (@TXCOL7) September 5, 2016 \\nWhen you add in rising health costs and the reduction in the housing allowance (BAH), it’s a pretty significant cut in pay. \\nThe Independent Journal Review interviewed several veterans who are on disability and asked them how such a meager pay raise affects them: \\nChris receives 70% disability resulting from internal injuries and traumatic brain injury (TBI). His raise at 1.6%? Just $27 per month: \\n“The small increases [of living expenses] have affected our family of five. Not only do we have a cost increase of daily expenses and from adding a new baby, but living expenses have outpaced the raises dramatically. \\nIn the last year, our mortgage payment has gone up twice, totaling over $200 a month, just to keep up with our escrow. We are both working hard, more than we would like with three small kids, to survive and maintain our standard of living.” \\nZach’s disability rating is 50%: \\n“A 1.6% increase would add $18.18 to my monthly award. So this year I could add less than a meal per month to the table. \\nI try to maintain a humble heart and mind; remembering the fact that the money I receive is a gift from God. So I do what I am able to with the gift given. But my cost of living continues to increase so my ‘increase’ basically just reduces the actual ‘decrease’ in salary.” \\nIn addition to these cuts, the military is considering privatizing military commissaries, which most experts predict will result in higher food prices on base. \\nThis is a perfect example of what little regard Barack Obama has for America’s fighting forces.'"}, "time": 1742563619.8985748}