{"duration": 0.029955148696899414, "input_args": {"text": "'geoengineeringwatch.org \\nDefections from the ranks of the power structure continue to build. A group of CDC (Center for Disease Control) whistleblowers is now putting pressure on CDC management to start telling the truth about the systemic corruption and public deception that this government organization represents. Yet more truth-tellers will likely come forward as the CDC ship goes down. A Harvard University publication states this about climate engineering: \"it can help us combat the worst effects of climate change.\" How blatant can the betrayal from academia become? Massive geoengineering aerosol spraying operations around the globe continue decimate Eath\\'s climate and life support systems. A former NASA engineer (now working with Geoengineering Watch) gives an extremely alarming report on our disintegrating ozone layer (primarily caused by climate engineering). Madagascar is starving due to geoengineering induced record droughts. Rapidly rising sea levels are chewing away at Africa\\'s coastlines. Sea ice at both poles is at record low levels, and US generals say they can win WWlll with Russia. Where does this road lead? The latest installment of Global Alert News is below. \\nCredibility is absolutely essential in the fight to expose and halt climate engineering , as well as the fight for the greater good. We must all abandon preconceptions and ideology in exchange for verifiable front-line facts. Anything short of this is completely counterproductive to the causes we claim to be fighting for. We must all stand on a foundation of facts, and make our voices heard . DW Very dedicated activists help to sound the alarm at yet another event. This one took place at the Sonoma County Fairgrounds on October 21st, 22nd, and 23rd. My most sincere gratitude to Brian Schuler, Jamie Lee and Melanie Moran for their efforts at this event. Leave a Reply Your email address will not be published. Required fields are marked * Name * Website Comment You may use these HTML tags and attributes: <a href=\"\" title=\"\"><abbr title=\"\"><acronym title=\"\"><b><blockquote cite=\"\"><cite><code><del datetime=\"\"><em><i><q cite=\"\"><strike><strong> VISITORS'"}, "time": 1742628406.3690238}