{"duration": 0.06309890747070312, "input_args": {"text": "'Leave a reply \\nWASHINGTON (Sputnik) — Charles Ortel is a veteran Wall Street investment analyst who has carried out major studies into the operation of the Clinton Foundation and its legal status, and runs a blog monitoring its activities. Ortel was the whistleblower that blew the lid off the General Electric financial discrepancies in 2008. “The Clinton Foundation has been a gigantic slush fund,” Ortel said. “People can donate relatively small sums to the Clinton regime and get gigantic concessions worth hundreds of millions or even billions of dollars back.” \\nDuring the four years that Hillary Clinton was secretary of state, hundreds of millions of dollars flowed into the Clinton Foundation from governments around the world, many of which then enjoyed favored treatment from the US State Department, Ortel noted. “To the world at large, the Clintons are open for business,” he stated. \\nThe US corporate media always refused to subject the Clinton Foundation to any kind of serious or skeptical coverage, in part because of fear of alienating the Clintons, Ortel explained. \\n“This is such a big story that the US press is not doing its job. What we have in ‘Clinton Incorporated,’ is Tammany Hall on steroids,” he said. \\nTammany Hall was the corrupt Democratic political organization that ran New York City for most of a century after the 1861-65 Civil War. “If you are in the US press, you have got to have access to the president of the United States and the federal government… I have little confidence that the US media would do the work necessary in investigating the workings of the Clinton Foundation as our media is in thrall to the Clintons,” Ortel added. \\nOrtel maintained that the operations of the Clinton Foundation and the actions of Hillary Clinton as Obama’s first secretary of state from 2009 to 2013 needed to be understood as part of a long-term master plan to regain and exercise political power by the Clinton family. “The Clintons put together a long-term plan decades ago. They were already planning when Bill Clinton stepped down at the end of his second term that Hillary would run for president and eventually Chelsea will too,” he said. \\nOrtel welcomed the decision of FBI Director James Comey to reopen the federal probe into Hillary Clinton’s use of private server for official business while secretary of state, and said the manner in which it had been done suggested the federal investigators believed they would find important revelations. \\n“To reopen an investigation is a massive decision so there must be a massive set of reasons for doing so. If it were a small matter, they would have waited until after the presidential election. It is also significant that this decision was announced publicly,” Ortel noted. An FBI investigation proceeds very carefully and methodically, and is thorough and sweeping. Therefore, Comey’s decision to reopen the emails probe was a very serious decision, Ortel pointed out. “To then reopen an investigation 11 days before a presidential election involving a major candidate and their family is virtually unprecedented,” he said.'"}, "time": 1742562168.6979458}