{"duration": 0.11118841171264648, "input_args": {"text": "'In a year that brought its political and cultural troubles, it’s heartening to note how diverse kinds of dance made culture itself seem bright. Take Odissi (from the state of Odisha, on India’s east coast) which, though one of the world’s oldest dance genres, came close to extinction in the   century. Now, however, it often seems astoundingly vital: No dance idiom is more overwhelmingly sensuous. Even in a year that was remarkable for premieres and revivals in ballet and modern dance, the beauties of Odissi were, again, a revelation, in late October in New York. Thanks to Mark Morris’s “Sounds of India,” part of the White Light Festival, the   troupe Nrityagram Dance Ensemble (led by Surupa Sen and Bijayini Satpathy Ms. Sen is also the choreographer) danced at the Gerald W. Lynch Theater. (The live music was played by men.) In Odissi, a woman’s hourglass figure becomes the source of glory and profundity. Shoulders and pelvis can tilt in subtle opposition to the waist, and to each other, with sculptural tensions that flood the theater. The arc of an arm, moving in alignment with neck and spine, opens up infinity. The Nrityagram program included the world premiere of the duet “Lalita Lavanga” and the North American premiere of the solo “Aali. ” The Nrityagram artists have been visiting New York for over a decade, but the impact of their dancing still comes as the best kind of shock. So, too, does Alexei Ratmansky’s “Serenade After Plato’s Symposium,” to the Leonard Bernstein score of that name. This had its premiere with American Ballet Theater in May (at the Metropolitan Opera House) and returned in October (to the David H. Koch Theater). Mr. Ratmansky has already made the finest ballets of this century: notably “Concerto DSCH,” for New York City Ballet in 2008, and “Pictures at an Exhibition,” for that company in 2014. Here he surpassed even those works. This “Symposium” explores several of the finest levels of civilization  —   philosophical discussion about love, the beauties of a violin concerto, the human variety of classical dancing. The major revivals of 2016 cast even more light than the year’s premieres. Here, too, Mr. Ratmansky led the way. The production he presented in Zurich of the 1895 Mariinsky “Swan Lake,” as choreographed by Marius Petipa and Lev Ivanov, was the staging the world needs of this often coarsened central classic. (The opera house in Zurich, seating about 1, 000, stands behind Lake Zurich, on which swans swim in view of Alpine mountains: a more perfect location for this classic is hard to imagine. The house’s intimate acoustics did wonders for Tchaikovsky’s score.) Every act brought fresh revelations, from Petipa’s Act I   ensemble waltz, lost for decades, to the amazing touches of pathos with which Odette’s energies vacillated in Act IV. And no Black Swan! Odile, as always intended by the ballet’s makers, wore a tutu of many colors. And in November, the illustrious Sara Mearns danced the New York premiere of Mr. Ratmansky’s ballerina solo “Fandango” (created for Wendy Whelan in 2010 at the Vail International Dance Festival, to Boccherini music). Ms. Mearns blazed her musicality electrified. If I had to choose one 2016 performance by one dancer, this would be the one.  —   ALASTAIR MACAULAY The Oscar Wilde quote on Indiana Woodward’s Instagram account could be about her dancing: “Be yourself everyone else is already taken. ” Ms. Woodward, who turns 23 this month, isn’t just another rising member of New York City Ballet but also a dancer with the kind of freedom of expression that causes your breath to catch in your throat. Her performances over the past year, most memorably as the winged sprite in “La Sylphide” and as the female protagonist in Lauren Lovette’s “For Clara,” demonstrate things you just can’t teach: spirit, generosity, the meeting of artistry and artlessness. A member of the corps de ballet since 2012, Ms. Woodward was born in Paris. She has a look and verve similar to those of Violette Verdy, the beloved   City Ballet principal who died this year, but Ms. Woodward is also a ballerina of her time. As the Sylph, Ms. Woodward radiated a mischievous warmth with jumps that hovered in the air. In the effervescent “For Clara,” she was more herself, epitomizing strength, independence and joy. She flies through choreography with glee, as if she were running barefoot through a forest. Many blocks downtown, there was another original at work this year: Eiko, the   dance artist and subject of Danspace Project’s Platform 2016: “A Body in Places. ” For part of it, Eiko, 64, performed a series of intimate solos, in East Village locations, that braided together painstakingly slow movement and stillness with spurts of abandon. During one performance at Middle Collegiate Church on Second Avenue, a thrashing Eiko darted through the sanctuary’s front doors and landed on the sidewalk. It had been raining, and like an East Village Mary Poppins, she pounced into a puddle. The combination of such vulnerability and daring as strangers  —   some truly mystified  —   stared had the effect of transforming her seemingly frail body into something otherworldly. Eiko and Ms. Woodward may be generations apart and practicing vastly different dance forms, but each moves as if there were no tomorrow.  —   GIA KOURLAS Some dances have a way of pulling you into their present, letting you lose track of time, or giving you no other choice. In Beth Gill’s “Catacomb,” performed at the Chocolate Factory in May, that pull was inexorable. I remember less about the details of the work itself than I do about the moment it ended  —   a startling return to reality. What had just happened? Where had I gone? It was in the same small, unadorned space in Long Island City, Queens, that Ms. Gill first presented her Bessie   “Electric Midwife” in 2012. Like the inverse of that luminous, orderly piece, “Catacomb” was dark, tangled, subterranean, yet still pristine in its structure. Ms. Gill has worked for years with many of the same collaborators, and the depth of those connections showed, in the seamless meeting of Jon Moniaci’s macabre score, Thomas Dunn’s otherworldly lighting and the dancers’ careful manipulation of tension and weight. Also playing tricks with the passage of time, calling up spirits from the past, the choreographers Ishmael   and Miguel Gutierrez brought us “Variations on Themes From Lost and Found: Scenes From a Life and Other Works by John Bernd. ” Part of Danspace Project’s essential “Platform 2016: Lost and Found,” a   meditation on dance artists lost to AIDS, “Variations” reimagined the work of the   choreographer (and occasional composer) John Bernd, who died in 1988, at 35, of complications from the illness. Mr. Bernd’s exuberant movement and harmonious songs  —   along with his simple, expressive line drawings, projected over the altar of the sanctuary at St. Mark’s Church  —   came surging back to life through seven audacious dancers, many of whom weren’t yet born when he died. Even while confronting themes of absence and loss, the evening felt like a celebration and, to those of us who didn’t know Mr. Bernd, an introduction long overdue.  —  SIOBHAN BURKE Before this year, I would not have suspected Lar Lubovitch of harboring radical tendencies. But for two weeks in September and October, this     choreographer purged the Joyce Theater of its sometimes stifling air of safety. And he did it generously, by creating a platform for the work of other dancemakers, a series called “NY Quadrille. ” The platform was more than metaphorical  —   a new stage with seating on multiple sides  —   but the crucial change seemed less a matter of perspective than of permission: a license to take risks. RoseAnne Spradlin’s “X” went the farthest many audience members impatient with its endurance test (and missing its humor) left early. I’ve found other pieces by this bold artist more compelling, and I could say the same about the “Quadrille” contributions by Pam Tanowitz and Tere O’Connor. (Loni Landon seemed out of place.) But all three offered highly intelligent, questioning,   choreography of a variety particular to New York. Good for the Joyce. For me, the most moving dance show of the year  —   one of the most moving I’ve ever seen  —   was at the Jacob’s Pillow Dance Festival in the Berkshires in July. I had been looking forward to “And Still You Must Swing,” as a collaboration among Dormeshia   Derick K. Grant and Jason Samuels Smith: three of the world’s greatest tap dancers. They were joined by the contemporary choreographer Camille A. Brown and a jazz trio. As a tap show, it was more than I hoped for: a return to tap’s deepest and richest rhythmic roots, entirely up to date, pushing the art forward. But the week of its premiere was also the week of more killings of black men by police officers, and the show  —   unintentionally but unavoidably in honest improvisation  —   reflected the feelings of its dancers, all  . There was shared pain and also shared delight in one another’s company and gifts. The power of dance as a channel of expression  —   as a method of survival  —   has seldom been clearer.  —   BRIAN SEIBERT More highlights from the year, as chosen by our critics: Movies, Television, Pop Albums, Pop Songs, Classical Music, Theater, Art, Podcasts and Performances'"}, "time": 1742628444.484242}