{"duration": 0.21294260025024414, "input_args": {"text": "'\\nThis article was written by Michael Krieger and originally published at his Liberty Blitzkrieg site . \\nEditor’s Comment: At the heart of things, Americans are fed up with the economic state of affairs, and with the political/financial corruption that brought us to that point. Though political philosophies differ greatly, there was a huge populist movement behind Bernie Sanders and Donald Trump both. There are millions and millions of people who want nothing more than to clean house in Washington, stop the people who are shafting them, and be left alone to enjoy their lives. \\nPeople feel so strongly about this that they have been overwhelmingly willing to support completely unknown and fresh faces (like Obama was in 2008), politically inexperienced (like Trump) and politically ostracized figures in the margins of the existing government (like Bernie or Ron Paul). Donald Trump has the opportunity to embody this sentiment of the people and be a great president. As Michael notes in this article, Obama had that same opportunity, but proved to be a tool of the elite, and a puppet for Wall Street, et al. \\nWill Trump prove to be a tool of the elites as well? It is simply too early to say. In the best case scenario, he could break ties with the controllers for the sake of his own legacy and the American people and actually take an honest shot at downsizing the mess of Washington’s mismanaged control over our lives… Its a Herculean task, but if he attracts some/any of the right people, it may be possible. Let’s hope so… \\nAmericans Roll the Dice With President Donald Trump \\nby Michael Krieger\\nThe forgotten men and roomen of our country will be forgotten no longer. \\n– President elect Donald Trump in his victory speech \\nThey said it couldn’t happen, but those of us who have been intimately studying what’s been going on since the financial crisis knew he could win. So here we are, in the midst of a historical populist revolt that brought a man who has never held public office to the Presidency.\\nI have so many thoughts to share, putting them down in a coherent manner within a single post is going to be a real challenge. As such, I’ve decided to separate this piece into sections. Let’s start with the following.\\nWhat Happened? \\nThis one’s pretty easy. In Monday’s post, Final Thoughts on the U.S. Presidential Election , I wrote:\\nThe bigger question is, who do I think will win? On that question, I don’t have a strong opinion at the moment. Ultimately, it depends on whether Americans go into the voting booth and see status quo vs. blowing up the status quo, or if they see Donald Trump vs. Hillary Clinton. If they see the former, odds are in Trump’s favor. If they see the latter, it’s a matter of which personality Americans find least repulsive. \\nIt turns out enough Americans saw the election as a referendum on the status quo to propel him to victory. We know it wasn’t because people liked him personally, they just wanted to (understandably) blow up the establishment. So why am I so confident of this?\\nLet’s take a look at some of the following reported by the AP :\\nThere were grim strains woven into voter sentiments as they cast their ballots. \\nNearly 7 in 10 voters said they were unhappy with the way the government is working, including a quarter who were outright angry. \\nSix in 10 voters said the country is seriously on the wrong track and about the same number said the economy was either not good or poor. \\nTwo-thirds saw their personal financial situation as either worse or the same as it was four years ago. One in three voters said they expect life to be worse for the next generation. \\nAmericans held their noses as they picked between the candidates: More than half of voters cast their ballots with reservations about their candidate or because they disliked the others running. \\nThat was true both for those backing Trump and those supporting Clinton, the exit polls showed. \\nAfter a long, hard-fought campaign, just 4 out of 10 voters strongly favored their candidate. \\nMoreover, how about this from Reuters :\\nAmericans who had cast their votes for the next president early on Tuesday appeared to be worried about the direction of the country, and were looking for a “strong leader who can take the country back from the rich and powerful,” according to an early reading from the Reuters/Ipsos national Election Day poll. \\nAgain, none of this is surprising to those of us who are aware of the ever increasing levels of theft, corruption and fraud now endemic to the U.S. economy. Indeed, the man who should have been the Democratic nominee for President laid it out perfectly all the way back in July 2015 when he tweeted:\\nI think the discontent of the American people is far, far greater than the pundits understand.\\n— Bernie Sanders (@BernieSanders) July 8, 2015 \\n\\nThe driving force behind Trump’s victory wasn’t racism, homophobia or sexism. This is a country that elected a black man President twice in a row. The driving force was desperation, economic angst, hopelessness, and more than anything else, a deep hatred for the U.S. status quo. As Trump accurately described the voters who put him over the top, they are “ the forgotten men and women.” \\nA Historic Opportunity \\nDonald Trump has a historic opportunity to be a great President. Barack Obama was presented with a similar opportunity eight years ago and he immediately squandered it by surrounding himself with miserable, status quo economic and foreign policy insiders. He ditched the people who believed in him and voted for him, and in doing so cemented his legacy as that of a man who coddled oligarchs, kept banking criminals out of jail and further incinerated the Middle East. He’ll also be seen as the man whose tremendous disappointments as commander-in-chief led to the emergence and elevation of Donald Trump.\\nPeople wanted major change in 2008 and they didn’t get it. They still want it. The only big question now is whether or not Trump will deliver, and whether it will be unifying change as opposed to more surveillance, militarization of police, torture, attacks on civil liberties, etc. Since Trump has a clear authoritarian streak, he runs the risk of going down the wrong path. However, that path will lead to only one thing; an even more broken America and another failed Presidency.\\nI was never able to personally get behind Trump, in large part due to the above concerns, as well as the fact that he’s a big government, centralization type of guy, and that’s not the kind of government I support. That said, I want this country to thrive and I want Trump to succeed. Indeed, we need him to succeed.\\nAs such, I’m going to take advantage of the opportunity he presented to his critics during his victory speech in order to outline what I think he needs to do to make America great.\\nLet’s start with the facts and a simple admission: Hillary Clinton won the popular vote. This is a clear signal that at least half the country doesn’t like him, and a large number of them, are in fact, terrified of him. Unless you’re an aspiring mob boss, you don’t want half the population to feel this way about you. So what should Trump do?\\nI think he needs to focus on creating a consensus amongst the American people around issues at least 80% of us can agree on. In my Final Thoughts piece, I outlined five of them:\\nRather than dwelling on the differences between these two populist movements (Sanders and Trump), let’s consider some of the areas where they overlap. \\n1. Trade — Opposition to NAFTA and current “trade” deals such as TPP, TTIP, and TISA have been central to both the Sanders and Trump campaigns. \\n2. War and militarism — Whether you believe Trump is sincere or not, opposition to Obama/Clinton interventionist overseas wars were key talking points for both Trump and Sanders. \\n3. The system is rigged — The painful acknowledgment that the U.S. economic system is a rigged scam that fails to reward hard work, and is more akin to a parasitic, predatory oligarchy with very limited social mobility, has been a key campaign theme for both Trump and Sanders. The economy is increasingly dominated by near-monoploy giants who relentlessly push for more power and more profits irrespective of the cost to society, whether that cost be war, poverty or social unrest. \\n4. Money in politics — The rigged economic system described above aggregates wealth into an increasingly small number of hands. Those hands then buy off politicians and rig the political process. A rigged economy and rigged political system perpetually feeds itself and endlessly grows at the expense of the public like a terminal cancer. Both Trump and Sanders emphasized this problem. \\n5. Rule of law is dead — Sanders focused on Wall Street bankers, while Trump focused on Hillary and her inner circle of cronies, but the overall point is the same. Rich and powerful oligarchs are above the law. We all know this, but Washington D.C. refuses to do anything about it. \\nThe Democratic Party as we know it is now dead. This means tens of millions of Sanders supporters are out there, pissed off at Hillary, and the Democratic establishment in general. These engaged citizens can be brought into the fold if Trump focuses on unifying issues such as the ones listed above, and leaves his authoritarian anti-civil liberties tendencies behind. I really hope he does this, but I have my doubts.\\nIf he doesn’t focus on unifying issues, he’ll be as divisive as Obama and the country will flail endlessly from one failed President to another like the sad, nuclear armed Banana Republic it has become.\\nPeople = Policy \\nTrump will be a failure unless he brings the right people into his inner circle. This is of the utmost importance. Indeed, I knew for certain Obama was a total fraud the moment he appointed Larry Summers and Timothy Geithner to key positions within his administration. This is the area I think Trump is most vulnerable to making some very big mistakes. Indeed, I was very bothered by the effusive compliments he showered upon one of the nation’s worst political figures, Chris Christie, during this victory speech. Nevertheless, since this post is about being as productive possible, I will name someone I’d like to see close to President Trump: Scott Adams.\\nLike many of you, I’ve been following Scott closely this entire election. I’ve listened to many of his periscopes and heard enough to appreciate his intellect, deep understanding of human nature, judgement, and desire to get the nation on the right track. Of all the high profile Trump supporters, he is the one I’d want to be closest to the ear of Trump. I don’t know if Scott would accept a position if it were offered to him, but I hope he would.\\nFurthermore, there are others who would be beneficial for a President Trump to have around who are already throwing their hats in the ring. For example, take Eric Scott Hundsader of HFT-fighting fame:\\nDear @realDonaldTrump \\nI’d like to throw my hat in the ring for a position at the SEC/CFTC.\\n— Eric Scott Hunsader (@nanexllc) November 9, 2016 \\n\\nIf Trump really wants to shake things up, he needs to think outside of the box and look far beyond the Chris Christies of the world, and consider some very sharp people he’s never heard of. If he surrounds himself with the old, tired political characters we already know, I fear very little will change for the better.\\nA Warning \\nSince Trump has repeatedly commented on the precarious and vulnerable state of financial markets, I assume he has a somewhat decent grasp of what he’s about to face. That said, no one can truly prepare for what’s coming. If I’m correct, and a nearly forty year sovereign bond bubble is in the early stages of bursting, this represents a potential financial extinction level event. I don’t care who you are, being President during a time like this will be replete with challenges and extreme danger. He better not take this financial super cycle lightly, and he should also prepare for a cyclical economic downturn. It won’t be Trump’s fault when it arrives, but it’ll be his to deal with.\\nIrrespective of my serious concerns, I desperately want Trump to succeed. America needs him to succeed. I’m confident that Trump will never read a single word of this, but it’s also possible someone with access to him will. If so, please consider my observations. The Republic depends on him unifying the people and helping to foster an environment in which every American has a opportunity for life, liberty and the pursuit of happiness. \\nIn Liberty,\\nMichael Krieger\\nThis article was written by Michael Krieger and originally published at his Liberty Blitzkrieg site . \\n'"}, "time": 1742563977.136263}