{"duration": 0.08308720588684082, "input_args": {"text": "'Should you embrace new age practices you deny Me Saturday Dec 06, 2014 at 02:20 pm My dearly beloved daughter, how is it that those who do not accept My Existence, or the Divinity of My Eternal Father, are so willing to embrace false gods all of their own making?When My Presence is felt by souls who reject My Existence, they feel a need to retaliate without compunction. They will scoff, ridicule, mock My Presence, whether this be in My Church, in books; in the Word or when I Am Present in other souls. The Presence of God is Omnipotent and it is felt in the most painful way by those souls who are in darkness. This is why they react with such venom to any mention of Me. These people have a deep ingrained hatred of Me and they fail to see how they can hate someone Who, in their eyes, does not exist.I warn those who embrace false spirituality and who idolize or obsess about anything that does not come from Me. If you open your souls to any spiritual realm, not of My Making, you will open the door to demons, who will cunningly entice you into their dark world. Whatever peace you believe you receive from new age practices will be short-lived. And as you seek more, you will then enter into a state where your conscience will be taken over by those enemies of God, until you are unable to release yourself from their domain. You will never find peace when you idolize false gods.The world is infiltrated with false doctrines, gods and religions. There is only one True God and you can only come to Him by recognising the Great Sacrifice He made when He sent Me, His only Begotten Son, to bring you salvation from the snares of the evil one.To those who do know Me, but who dabble in other doctrines, know this. Should you embrace new age practices, you deny Me. Should My Church acknowledge other creeds, that are not of Me, then they betray Me.The time when My birth is celebrated, by showing allegiance to other religions, that are not of Me, will be one of the greatest betrayals of the Truth.'"}, "time": 1742562808.0458503}