{"duration": 0.12101984024047852, "input_args": {"text": "'shorty THE DUOPOLY WATCH | Steven Jonas, MD, MPH Special to The Greanville Post | Commentary No. 63: “The Cometization of the 2016 Elections: The Role of the Ruling Class ” O n July 5, 2016, The Director of the U.S. Federal Bureau of Investigation, James Comey, shooting like a comet over Washington, D.C., announced that after an extensive investigation, no criminal charges relating to the improper use/protection/transmission of classified documents would be brought against former Secretary of State Hillary Clinton. At the same time, he launched into an extensive negative analysis of what had been done with emails, sensitive or not, on State Department or private servers, by Mrs. Clinton and members of her staff. That statement, very unusual for an FBI Director to make, had a transitory effect on Clinton’s poll numbers. But at the same time, the Director, in a highly unusual action, little noticed at the time, told leading Republican on the House Intelligence Committee that it would keep them informed of any further developments. As is well-known, just now there have been further developments. Mr. Comey announced publicly that there would be a further investigation of (possible) Clinton emails. He made this announcement before any investigation had begun, much less concluded and before his agents had obtained even so much as a warrant for seizing a lap-top belonging to the estranged husband, Anthony Weiner, of one of Mrs. Clinton’s closest aides, Huma Abedin. This action by Comey was considered to be highly unusual, to say the least, by a variety of sources/authorities, including, for example, The New York Times editorial page . It was even unclear as to whether, after some kind of preliminary evaluation, the previous formal inquiry would be reopened. The U.S. Justice Department strongly discouraged Comey from making such an speculative announcement (as in “their might be a further investigation after we’ve had a look at Mr. Weiner server which — who knows — might simply be filled with photos of Mr. Weiner’s private parts taken from a wide variety of angles”). It appeared as if Mr. Comey himself might be violating the law, that is the 1939 Hatch Act , which prohibits government employees from taking actions close to elections which might influence their outcomes. A Republican, Richard Painter, who worked as the Chief Ethics Officer in the Bush White House (and a Clinton supporter this time around), went so far as to file a formal ethics complaint against Comey, for apparent violation of the Hatch Act (which would be a criminal offense). There have been a variety of political outcomes from the Comey action, ranging from no change in the Clinton/Trump poll numbers to significant changes in them, from no change in the generally predicted Clinton lock on the Electoral College vote to possibly enough of a Trump swing in the swing states to give the election to him. Most observers are not attributing ulterior motives to Mr. Comey. “He made a simple mistake.” “He was trying to be open about what is going on, but he was premature in making such an announcement — poor judgement.” “He was under pressure from Congressional Republicans. Suppose that he had not announced the further investigation [of a bunch of emails that might not even be Clinton’s] in advance of its being undertaken, and then something had come of it after the election? Boy, would they be mad [or worse].” Well, folks, I don’t buy any of it. I think that what Comey did, from the July “even though we have nothing criminal on you you’re a bad girl” speech to the present “we are announcing that an investigation will be starting [once we get a warrant], without any idea that anything further that might be incriminating might be found” is all part of a plan. (And yes, this is a conspiracy hypothesis, but not quite the kind that Alex Jones would come up with.) In 2013 Mr. Comey was given the customary ten-year term appointment as FBI Director by President Barack Obama. (Wonder why in all of this bruhaha from the Democrats Obama gave him a vote of confidence?) A career Federal prosecutor and occasional corporate lawyer who eventually became Deputy Attorney General under Bush , he is a Republican. He has had a reputation for highly ethical behavior. He does not live in a bubble, however. He had to have known that what he was doing when he gave his totally unnecessary speech when he announced “no criminal findings” in the original Clinton emails/server case. While it did not seem to have any long-term political effects, it did stir the political pot at the time. This announcement has the pot boiling. It could swing the election to Trump. Although the conventional wisdom as of Nov. 1, when this column is being written, is that it won’t, because of Clinton’s heavy advantage in the Electoral College, Glenn Beck, an arch-reactionary who happens to be anti-Trump, thinks that Comey’s announcement is “one of the most irresponsible things to ever happen” and could swing the election to Trump. And although unlikely, it could. So how did this happen? Well, Comet Comey has a phone (you can sure that the doesn’t do political stuff by email), and it is as secure a one as can be found. As I have pointed out previously, there is an increasingly large sector of the ruling class, led by some very wealthy hedge fund managers like the one who came to the Trump campaign along with Steve Bannon (from the Cruz campaign). They REALLY want Trump to win: further huge tax cuts for the wealthy and the end of regulation as we know it. My guess is that they got to Comey. What they offered or promised him, if anything at all, is impossible to know. But I do believe that that is what happened. Comey is a long-time Federal lawyer. He is now the Director of the FBI. He had to know about the Hatch Act, and that he would be violating it. He also knows that regardless of the outcome of the election he is never going to be prosecuted for doing so. Until last Friday, Trump was sinking and a number of down-ticket Republicans were going with him. Now, as the result of the “announcement” of something that might or might not happen, Trump is making huge hay of it and could win, and even more importantly the Republicans have a much better chance of holding on to the Senate. This did not happen by accident. An unprecedented announcement in October goes back to an unprecedented speech in July. Unprecedented once? Well, maybe by happenstance. Unprecedented twice? Well, not so much. Postscript: According to the FBI, there is no direct connection between Donald Trump and the Russian Government/business sector. According to a long-time counter-intelligence operative of another country, there are numerous documents showing just such relationships and he gave them to the FBI . Here’s one excerpt: “ Mother Jones has reviewed that report and other memos this former spy wrote. The first memo, based on the former intelligence officer’s conversations with Russian sources, noted, ‘Russian regime has been cultivating, supporting and assisting TRUMP for at least 5 years. Aim, endorsed by PUTIN, has been to encourage splits and divisions in western alliance.’ It maintained that Trump ‘and his inner circle have accepted a regular flow of intelligence from the Kremlin, including on his Democratic and other political rivals.’ It claimed that Russian intelligence had ‘compromised’ Trump during his visits to Moscow and could ‘blackmail him.’ ” This is stuff for an actual investigation. Is there any evidence that one is underway? Well, it would be improper for the FBI to comment on investigations that are still in process (only on those that have not yet begun). But the media are not letting go on this one . Do stay tuned (and remember, I wrote this on November 1). ABOUT THE AUTHOR Senior Editor, Politics , Steven Jonas, MD, MPH is a Professor Emeritus of Preventive Medicine at Stony Brook University (NY) and author/co-author/editor/co-editor of over 30 books. In addition to being Senior Editor, Politics, for The Greanville Post , he is: a Contributor for American Politics to The Planetary Movement ;a“Trusted Author” for Op-Ed News.com ; a contributor to the “ Writing for Godot ” section of Reader Supported News; and a contributor to From The G-Man . He is the Editorial Director and a Contributing Author for TPJmagazine .us . Further, he is an occasional Contributor to TheHarderStuff newslette r , BuzzFlash Commentary , and Dandelion Salad . Dr. Jonas’ latest book is Ending the ‘Drug War’; Solving the Drug Problem: The Public Health Approach, Brewster, NY: Punto Press, available on Kindle from Amazon at http://www.amazon.com/Ending-Drug-War-Solving-Problem-ebook/dp/B01EO9RGKO/ref=sr_1_4?s=books&ie=UTF8&qid=1461783388&sr=1-4&keywords=Ending+the+Drug+War His most recent book on US politics is The 15% Solution: How the Republican Religious Right Took Control of the U.S., 1981-2022: A Futuristic Novel ( Trepper & Katz Impact Books, Punto Press Publishing, 2013 , Brewster, NY), and available on Amazon.'"}, "time": 1742562630.3733516}