{"duration": 0.14557099342346191, "input_args": {"text": "'Saker Message: No current Saker messages. What’s goes around comes around, or How Russia and the US are trading punches, by Scott Humor \\nThis article was first published by the Duran \\nThree years ago someone’s video parody of a “ Russian guy’s reaction ” to a meteor falling over Chelyabinsk went viral. “Russia Today” even included it into its reportage of how the Russian dashcam videos become internet sensations [2:24]. \\nThis 10 sec video had done more to project the toughness of Russians than all the fireworks of Vitaly Churkin’s diplomatic rhetoric. Hands down, Churkin is brilliant and his speeches should be included into high school curriculum, however, due to peculiarities of the Western supranational media, his oratorical talent remains largely unrecognized by a wider audience. Yet, everyone remembers a video of a guy in a knitted cap, who just lowered a sun visor driving directly onto a collision path with a rapidly approaching celestial body. \\nReaders and commentators of The Saker blog often express their frustration with the “lack of immediate” response to the Western provocations from the Russian government and society . “Why don’t Russia’s government respond by hitting them back hard and in kind?” ask out readers. Whereat we, Russians, consider this to be our national character trait. Rather than jumping nervously every time the West says “Boo!” we keep steadfastly and resolutely moving forward despite of adversities. \\nThere is also a well calculated geopolitical dimension to this “wait and observe” stance chosen by the Russia’s government every time Washington comes up with a newly staged provocation. Which is every Monday, Wednesday and Friday, if I am not mistaken. “Washington” here is being a working term to include Pentagon, CIA and also a slew of companies like: \\nValbin Corporation – Bethesda, MD \\nCACI International Inc – Suitland, MD \\nLeidos – Vienna, VA \\nVaren Technologies – Fort Meade, MD \\nSagent Partners – Linthicum, MD \\nPluribus International – Fort Meade, MD \\nAssured Information Security, Inc – Fort Meade, MD \\nAECOM – Chantilly, VA \\nRazor Technology LLC – Washington, DC \\nEngility Corporation — Fort Meade, MD \\nGoldbelt Inc – Herndon, VA \\nCWU, Inc. – Hunter Army Airfield, GA \\nBelay Technologies, Inc — Annapolis Junction, MD \\nApplied Technology Group – Annapolis Junction, MD \\nBooz Allen Hamilton – McLean, VA \\nPluribus International – Fort Meade, MD \\nAdvantage SCI – United States \\nThis is just a short snippet of a long list of willing participants in a division of a US military budget pie, which is now turned into a thriving and mushrooming industry of private constructors specializing in recognizance, intelligence gathering, intelligence analysis of SIGINT & FININT in support of operations CONUS or OCONUS. \\nWe, of course, are mostly interested in “operations” that are being conducted OCONUS, which is outside of the continental US, also known as the rest of the world. In case you are wondering about the location of your country in relation to the US intelligence community. Take the US military, plus the entirety of NATO, some crafty old spy masters from Britain, France, and Germany, add to it hundreds of private and public enterprises, and you will understand where the plethora of false flag attacks, provocations, terror acts, civilian sabotage on the media, sports, kidnapping of Russian citizens and other violations of the human rights of Russians are coming from. \\nIn the last two weeks of October we watched a Ukrainian civil airline dispatcher threaten to take down a civil aircraft from Belarus. Russia got pushed out of the UN Human Rights Council, after the generally proven-to-be-fake campaign of the White Helmets , which are another of these private intelligence companies financed by NATO members. \\nWe also were presented with the gruesome murder of one of the originators of so called “ Russian Spring ” in Ukraine, known to the Western audience as “Motorola.” Keeping in mind, of course, that the “Russian Spring” starting with the Bolotnaya Square protests, just like its predecessor the “ Arab Spring ,” was engineered by Western intelligence and military complexes. Let’s give credit where credit is due. \\nAll of these provocations, from big to small, from violent to ridiculous, all of them have one common goal, to draw the reaction of the Russian government, to take its precious time, resources, and to disrupt its work. \\nHere comes the catch: the more willing participants are being involved in designing and staging this torrid stream of provocations against Russia, the less professional, less coordinated, and less convincing they are becoming. It’s exactly like with the famed musical “Cats” which was perfectly choreographed on Broadway, but watching it on a community theater stage would hurt your eyes in shame for the production crew and actors. \\nBy the fall of 2016, the saturation of provocative actions against Russia has reached it’s critical stage. In other words, we had ceased reacting emotionally to them and have started analyzing them rationally. \\nThis explains the Russian government’s reaction to the multitude of recent provocative actions. A reaction that can be generally described as “muted,”“low-key,”“hushed,” and at least in one instance “absent.” \\nKnowing who or what is behind a provocation should warrant a type of response, if any. \\nLet’s say, the Justice Department backtracks it’s perfidious demands for billions of dollars in fines arbitrarily imposed on Deutsche Bank, only after Germany agrees to deploy its troops and tanks to the Russian border. Understandably, their move puts an adult population of Russian into a sentimental mood summarized in “let’s finish the job our grandfather died doing.” Russia’s Foreign Ministry issues a warming statement, and the Defense Ministry moves a few troops closer to the Western border, mirroring NATO moves. The Pentagon and CIA issue memos to the all Western media outlets stating the “Russian aggression.” The Western press copies these memos verbatim and propagates them in every nook and cranny of the “free” world. \\nAfter that, the Russian Defense Ministry releases information on successful testing of a new “Sarmat” missile with some of its technical characteristics. Youtube hosts several videos with detailed explanations of how it takes only two Sarmats to destroy the East and West coasts of the US. They also specifically explain why Sarmat is invincible to the Western anti-missile systems. If you wonder how we got to this point, see the aforementioned information. \\nEveryone, privy to the latest Russian military upgrades, which includes every YouTube viewer, can see the Russian government response to the attacks of the US banking system and Wall Street and the DOJ. \\nWe are witnessing a situation when hundreds of companies employing well over a million people who are trying to make themselves relevant in a crowded industry of war making, by producing torrents of “events” around the globe. They are the Americans with “gas cans” setting fires around the globe, according to the memorable comparison made by Rostislav Ishchenko in his April 2015 article “ What does Putin want?” \\nHe wrote: “ One can only guess who will be more effective – the Americans with their gas can or the Russians with their fire extinguisher? ” \\nFire, however, dies quickly in the absence of oxygen. Most of the anti-Russian actions go unnoticed and just turn into white noise, but some manage to stand out in the news for a day or longer. In essence, they all vie for the Russian government attention. Maybe that gets them a yearend bonus and an annual contract renewal? \\nThank you for your time, \\nScott'"}, "time": 1742563387.9506564}