{"duration": 0.10721635818481445, "input_args": {"text": "'Editors’ note: Here’s one of our favorite stories from the archives, now being featured in our Smarter Living collection. Confidence, at least in the American workplace, means never having to say you’re sorry. I know that now, but early in my career I found myself apologizing over and over as my confidence and   were tested on every level  —   from my job function to performance reviews, from networking to winning clients. I grew up in a family with strong Confucian values my parents had emigrated to the United States from China. My father was a principled man who sought to preserve and enforce Chinese cultural values over Western ones. I think he was frightened by American pop culture in the 1960s: he was sure that without his vigilance, my sister and I would grow up to be brash,   hippies. So he wanted us to demonstrate humility, one of the most cherished Confucian ideals. “Don’t ever talk about yourself,” he would mandate. “Let your teacher say good things about you. It’s not for you to say. ” Even when others complimented me, I learned to play down and even be the first to criticize my accomplishments. And I gradually started thinking that I didn’t have worth unless someone in authority said I did. It just wasn’t my place to question that. I would often start and end my conversations with the word “sorry”  —   sorry for bothering you, sorry for the bad news, sorry this issue came up, sorry for asking questions. As the youngest girl in the family, I felt that I didn’t have as much to offer as my elders, and that what I had to say wasn’t worth a whole lot. Blame and shame usually trickled down the hierarchy in my family, and usually landed at my feet. A broken vase? Spilled milk? Mistakes? All eyes were on me. So from early on, I started apologizing first, just to get it out of the way. I found that it often mitigated heated situations. But that approach didn’t work as well when I entered the workplace, especially in my job at a   company where I had to interact with many teams and senior managers. I remember skulking around corners on the way to my boss’s door and then knocking sheepishly: “Very sorry to interrupt you. Can I ask a question about this project? Sorry. ” “Sure come in. No need to apologize. ” “O. K. Sorry. ” I heard similar reassurances from a product manager, who told me that I should stand up for myself and stop apologizing. And, finally, I heard this exclamation from an executive: “Stop saying ‘sorry’! You don’t need to unless you really did do something wrong, O. K.? The team and customers will think that you aren’t confident when you always apologize!” Change didn’t happen right away. It took a long time to internalize their message. Much of one’s worth is equated to compensation and promotions in the workplace. And for years, bringing up these topics and taking credit for my own work were still uncomfortable and even embarrassing. But I realized I had to stretch myself to succeed in an environment that was so different from my cultural upbringing. Confidence was expected. And I knew it wouldn’t just spring up from a      brand of puffery, but from a deeper understanding of worth and how it could be communicated in the workplace. As I examined my background and core values, I discovered that having a perpetually apologetic stance didn’t necessarily represent true humility. I found that I could offer an honest   without being arrogant, so others would see how I could make a difference. This was a style of confidence that felt congruent and authentic to me. The process of   gave me a framework that has allowed me to go outside my comfort zone and to work in an increasingly diverse workplace. Throughout my career, I’ve met many other professionals who have struggled to find their worth on the job. Women and members of minority groups, especially, are often raised with one set of values and expectations, and then suddenly need to excel in a new environment where the path to success is much different. My journey has allowed me to help such professionals understand and voice their worth to others while remaining true to themselves. I have to acknowledge that, to this day, I still find myself needing to suppress the urge to be  . But I did learn this: how to give myself permission to claim my own worth. “No,” I said definitively one day, as I was gunning for a new role with a better salary. “I think I’m going to have to stick with this number. ” I had done my research and knew my proposed valuation was in line with others who were equally qualified. “That’s fine,” my future boss responded. “You’re the right fit  —   I look forward to getting started. ” Just like that. And I realized I had proved my worth without once saying I was sorry.'"}, "time": 1742563952.0985668}