{"duration": 0.06679773330688477, "input_args": {"text": "'NTEB Ads Privacy Policy LET THE HEATHEN RAGE: Anti-Trump Protesters Reveal Their Hatred Towards America And Liberty Anti-Trump Demonstrators with signs reading \"Not my president!\" clogged streets in New York City on Saturday during a fourth day of anti-Trump protests nationwide, a day after a person was shot during a protest in Portland, Oregon. by Geoffrey Grider November 13, 2016 These anti-Trump protesters that are clogging city streets at this very moment hate America, hate what this nation stands for, and seek to destroy it and us \\n“Why do the heathen rage, and the people imagine a vain thing?” Psalm 2:1 (KJV) \\nAfter being denied victory on Election Night , the anti-Trump liberal Democrats, in cities across America, have decided that they best way they can show their “love” for Americans and freedom is by working to destroy both them and it. In so doing, they have revealed their true nature. They are not just upset over losing, they have decided that if they cannot rule no one will. That is the spirit of Antichrist. \\nDemonstrators with signs reading “Not my president!” clogged streets in New York City on Saturday during a fourth day of anti-Trump protests nationwide, a day after a person was shot during a protest in Portland, Oregon. Can You IDME? Riot Vandalism & Assault Suspect https://t.co/QJ4kiAHyzd #CanYouIDME pic.twitter.com/zBQBkuxzxW \\n— Portland Police (@PortlandPolice) November 12, 2016 \\nTwo 18-year-old men detained early Saturday were arrested later in the day in connection to the shooting on Portland’s Morrison Bridge, which occurred after 1 a.m. local time (4 a.m. ET) Saturday, police said. It was unclear whether the shooting was politically motivated. \\n“Preliminary information indicates that a suspect was in a vehicle on the bridge and there was a confrontation with someone in the protest,” Portland police said in a statement. “The suspect got out of the vehicle and fired multiple shots injuring the victim.” The victim is expected to survive, police said. “We are the popular vote” chant protesters. @msnbc pic.twitter.com/AmDyCTIfCz \\n— Morgan Radford (@MorganRadford) November 12, 2016 \\nNow, in the interest of full disclosure , when the Kenyan-born and Muslim-raised Barack Hussein Obama was elected, I declared he would “never be my president”. And for the entire time of his presidency I wrote over 1,300 articles exposing him and his Marxist plan for America. Let this website be my witness to that. This is how I exercised my Constitutional right to free speech. But at no time did I ever protest in the streets, ever threaten another human being, and I never used the global platform of NTEB to ever call for physical violence of any kind ever. \\nWhy not? \\nBecause though I despised the anti-American president Obama, I still loved America and the ideals she stood for. I saw myself as a patriot in exile, but still teared up every time I heard the National Anthem or read about a soldier’s heroic sacrifice on a foreign battlefield. These anti-Trump protesters that are clogging city streets at this very moment hate America, hate what this nation stands for, and seek to destroy it and us. They preach “love” while they shoot innocent people in the streets, they demand “tolerance” while offering none. They accuse Trump of having a “dark vision” for America while carrying out despotic deeds of darkness no Trump supporter would ever even dream of. Whitney Houston – Star Spangled Banner \\nThe United States Constitution allows you to burn the flag if that is how you choose to express yourself, and I accept that. But if that is how you choose to express yourself, you reveal your true nature and spirit. You who are now rioting in the street by permission of the very country you hold in contempt are depraved in both mind and spirit. You are not “protesting Donald Trump”, you are seeking to hurt, to maim and to destroy. That’s satanic. You are nothing more than a herpes blister on the beautiful mouth of Lady Liberty . \\nNow please, before someone gets killed , get in an orderly line and move north to Canada like you promised you would. \\nIt’s time to make America great again , and we don’t need you to do it. \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742562957.944347}