{"duration": 0.05273008346557617, "input_args": {"text": "'By Daily News Bin | October 30, 2016 | 16 6626 SHARES \\nNow that FBI Director James Comey is under legal fire for criminal election tampering, all bets are suddenly off. His decision on Friday to inform Congress of an investigation into Anthony Weiner’s emails, which he misleadingly framed as being an investigation into Hillary Clinton, has elicited pushback from all sides. Senator Harry Reid, who serves on the Senate Select Committee on Intelligence and is in a position to know such things, has now confirmed that the FBI has been secretly investigating Donald Trump’s ties to the Russian government for months. \\nReid is making this information public in order to expose the double standard by which James Comey decided to hype a non-investigation of Hillary Clinton just eleven days before election day, while keeping quiet about a very real investigation into criminal activity on the part of her opponent. Reid says that he has been privately demanding an update on the FBI’s investigation of Donald Trump for months, and that Comey has been stonewalling him. This comes even after Comey made a point of publicly berating Clinton this summer during a press conference, in an attempt to obscure the fact that he was fully exonerating her in the process. \\nIt’s not immediately clear what will happen to Director Comey, is rather unambiguously in violation of the Hatch Act. He can be immediately removed from his position by President Barack Obama, but that seems unlikely before the election. Even as it becomes increasingly clear that Comey has been willing to politicize his own job in a criminal fashion in order to influence the outcome of an election, President Obama is unlikely to be willing to create the appearance of doing the same by immediately firing Comey. However, Reid may be able to force the details of the FBI’s investigation into Trump to become public before election day, thus making things fair. If you enjoy Daily News Bin, consider making a contribution: Contributed by Daily News Bin staff 6626 SHARES '"}, "time": 1742563581.7590837}