{"duration": 0.04757952690124512, "input_args": {"text": "'By Hrafnkell Haraldsson   5:12 pm Trump sat on the stage, \"looking for all the world like an honored donor to the cause,\" and then got up and left without leaving a donation   \\nNot only is Donald Trump a liar and a thin-skinned crybaby, but he is selfish, never spending his own money when he can spend somebody else’s. This behavior was never more in evidence than The Washington Post ‘s David Fahrenthold’s account of a 1996 a ribbon-cutting held by the Association to Benefit Children for a nursery school, when Donald Trump showed up, sat down to appear to be a great supporter, and then left without leaving a donation: \\nAs Sopan Deb tweeted , \\n— Sopan Deb (@SopanDeb) October 29, 2016 \\nFrank and Kathie Lee Gifford were big donors and it is no wonder Gifford was so shocked by Trump’s presence. What had been exposed is that Trump’s life is a sham, a gigantic show put on by him in which he parades through life pretending to be something he is not. \\nAs Fahrenthold explains , \\nFor as long as he has been rich and famous, Donald Trump has also wanted people to believe he is generous. He spent years constructing an image as a philanthropist by appearing at charity events and by making very public — even nationally televised — promises to give his own money away. It was, in large part, a facade. A months-long investigation by The Washington Post has not been able to verify many of Trump’s boasts about his philanthropy. \\nThat philanthropist isn’t the real Trump. The only person Trump visibly cares about is Donald Trump. He uses his Foundation to buy himself nice things, spending other peoples’ money for luxury items and collectibles. When he does make donations, it is again, because he gives no money to his own Foundation, with other peoples’ money. \\nFahrenthold says that the only donation of Trump’s own money the paper could find from the period of 2008 to today, is a $10,000 “gift to the Police Athletic League of New York City, in 2009.” \\nFor a man as rich as Trump claims to be, $10,000 in eight years is nothing to brag about. Not that this stops the monumental, deadbeat hypocrite that is Donald Trump from bragging anyway.'"}, "time": 1742563535.3197339}