{"duration": 0.023836135864257812, "input_args": {"text": "\"Fearing Election Day Trouble, Some US Schools Cancel Classes Newsmax, October 26, 2016 \\nRigged elections. Vigilante observers. Angry voters. The claims, threats and passions surrounding the presidential race have led communities around the U.S. to move polling places out of schools or cancel classes on Election Day. \\nThe fear is that the ugly rhetoric of the campaign could escalate into confrontations and even violence in school hallways, endangering students. \\n“If anybody can sit there and say they don’t think this is a contentious election, then they aren’t paying much attention,” said Ed Tolan, police chief in Falmouth, Maine, which decided to call off classes on Election Day and put additional officers on duty Nov. 8. \\n{snip} \\nSchools are popular polling places because they have plenty of parking and are usually centrally located. It’s difficult to say how many school-based polling places have been moved this year, given how decentralized the voting process is across the country. \\nBut state and local officials say voting has been removed or classes have been canceled on Election Day at schools in Illinois, Maine, Nebraska, New Hampshire, Ohio, Pennsylvania, Wisconsin and elsewhere. \\n“There is a concern, just like at a concert, sporting event or other public gathering, that we didn’t have 15 or 20 years ago. What if someone walks in a polling location with a backpack bomb or something?” said Georgia Secretary of State Brian Kemp, co-chairman of the National Association of Secretaries of State election committee. “If that happens at a school, then that’s certainly concerning.” \\n{snip} \\nEaston Superintendent John Reinhart wanted to get voting out of schools altogether but was rebuffed by county election officials. So the school board canceled classes on Election Day. \\n“If you take the personalities away and cast the emotion with the election aside, one has to ask the question: ‘Are our schools the best places for that activity to take place?'” he said. “I just think we’ve reached the point where we need to look at other locations.” \\n{snip}\""}, "time": 1742628452.8855054}