{"duration": 0.09650421142578125, "input_args": {"text": "'Since it started 11 years ago, The Huffington Post has been synonymous with the personality and the interests of its   Arianna Huffington. The pioneering web publication, known for its aggressive use of aggregation and an unapologetically liberal worldview, would go on to win a Pulitzer Prize and expand globally during a challenging time for all media organizations. But over the last year, The Huffington Post has found itself an increasingly small part of an increasingly large media and tech conglomerate. When Verizon, which announced it had purchased The Huffington Post’s parent company, AOL, in May 2015, bought Yahoo’s internet business last month, Ms. Huffington’s perch at the company seemed increasingly precarious. With her abrupt announcement on Thursday that she was stepping down as editor in chief of The Huffington Post and leaving the company to focus on her new venture, a health and wellness   called Thrive Global, she leaves the publication in an unfamiliar position. For the first time since its founding in 2005, The Huffington Post will be without Ms. Huffington. No successor was named. In an interview, Ms. Huffington, 66, said she had originally intended to run The Huffington Post while working to start Thrive Global. But that plan soon reached its limits. “The original idea was that I could do both,” she said. “But it very quickly turned out to be an illusion. ” Along with her success, Ms. Huffington has been a polarizing figure in the media world, and her presence in the newsroom has not always been constant. But since Verizon bought AOL, her interests seemed to increasingly move beyond running The Huffington Post. After the sale, there was speculation that she would leave the company, concerns allayed when she signed a   contract in June 2015. Other moves have generated misgivings in the newsroom. The publication’s decision last summer to put articles about Donald J. Trump’s presidential campaign in its entertainment section and a later decision to add an editor’s note calling Mr. Trump a “serial liar” and a “racist” to any article about him raised questions about whether Ms. Huffington was unduly influencing coverage to suit her political agenda. In April, the announcement that she was joining Uber’s board rankled employees who feared inherent conflicts of interest in coverage. (She said she would recuse herself from being involved with any coverage of the company.) The publication has also been criticized for what some see as excessive coverage of sleep and wellness, topics on which Ms. Huffington has written books. At the same time, staff attrition, evidenced by a flurry of goodbye emails over the last year, has taken a toll on morale. In that context, Ms. Huffington’s decision to leave surprised an already anxious newsroom. At a staff meeting Thursday morning in The Huffington Post’s Manhattan headquarters, Ms. Huffington stressed her confidence in the organization. “Great companies always succeed beyond their founder,” she said, according to an article by Michael Calderone, the publication’s media reporter. “Even though HuffPost bears my name, it is absolutely about all of you and about this amazing team we’ve been for over 11 years. ” Tim Armstrong, the chief executive of AOL, was not present. But in a statement, he called Ms. Huffington a “visionary who built The Huffington Post into a truly transformative news platform. ” “Today, The Huffington Post is a firmly established and celebrated news source, and AOL and Verizon are committed to continuing its growth and the groundbreaking work Arianna pioneered,” he added. When The Huffington Post was founded, there was no Twitter, and Facebook was still a relatively fledgling online platform primarily used by college students. Initially, the idea was to create an aggregation site that would be a liberal counterpart to the Drudge Report. Ms. Huffington, who had recently run for governor of California, said at the time that she had signed up more than 250 of “the most creative minds” in the country, including Walter Cronkite, Nora Ephron and Norman Mailer, to write a group blog on topics including politics and entertainment. The Huffington Post did not just take the internet seriously it ruthlessly embraced as opportunities trends that established media companies perceived as threats. The company demonstrated early and continued mastery over Google, capturing audiences through search with carefully engineered headlines and fast aggregation. The publication consistently outranked its competitors in search, often with blog posts based on its competitors’ work. But while the strategy proved successful, the site’s ability to package articles from other publications also prompted criticism, and many in the media world accused it of aggregation excesses that bordered on intellectual theft. Over the years, however, it has pushed aggressively to produce more original content. The site also published articles by   who often contributed without being paid. AOL purchased the publication for $315 million in 2011 and Ms. Huffington assumed control of AOL’s editorial content. The Huffington Post won a Pulitzer Prize in 2012 for a series on wounded veterans. Ms. Huffington’s relationship with Mr. Armstrong was rocky almost from the start, several current and former employees said, and some said her outside interests kept her out of the newsroom for extended periods. When AOL sold itself to Verizon for $4. 4 billion, there was speculation that Ms. Huffington might leave. She had become an increasingly powerful force in her own right: She has published several books on health and wellness, including “Thrive” and “The Sleep Revolution,” and she has become a champion of the benefits of a good night’s sleep. Though Ms. Huffington’s departure came as a shock, it was in some ways inevitable, particularly after she announced the formation of Thrive Global in June. In the interview, Ms. Huffington said she had thought about leaving The Huffington Post for “a while,” and the closing of a funding round for Thrive Global last week ultimately drove her move. “It was my decision” to leave, she said, adding that the contract she signed last year had a   clause that allowed her to start a new venture. Ms. Huffington said she would stay on at the publication until early September. “I’m going to be very much around for the rest of the month, helping in every way I can, including having Greek sweets in my office,” she said, a nod to her home country and her distinctive accent. Mr. Armstrong said in a note to staff that the company had formed an interim editorial committee that would act in Ms. Huffington’s place. The committee will also be involved in what Mr. Armstrong described as “an ongoing search” for a new editor in chief. In a separate note to employees, Jared Grusd, the chief executive of The Huffington Post, called Thursday a “day of change. ” “Today,” he wrote, “is the first day of the next chapter in HuffPost’s history. ”'"}, "time": 1742564580.4569805}