{"duration": 0.04979228973388672, "input_args": {"text": "'LOS ANGELES  —   Marvel Entertainment hates to be called a machine  —   the   studio thinks that term sells its filmmakers short  —   but a machine it truly is: With the arrival of “Doctor Strange” over the weekend, Marvel has delivered an uninterrupted string of 13 critical and commercial hits in only eight years. No film company, not even Pixar, can claim a track record like that. “Doctor Strange,” starring Benedict Cumberbatch as one of Marvel’s lesser comic book heroes, collected an estimated $85 million at theaters in the United States and Canada, according to comScore, which compiles box office data. The movie, which received  strong reviews, cost at least $275 million to make and market worldwide. Disney said that “Doctor Strange” took in an additional $240. 4 million overseas Imax results in China were especially robust. With ticket sales of about $45. 6 million, “Trolls” took second place at the domestic box office it was produced by DreamWorks Animation at a cost of $125 million and distributed by 20th Century Fox. Turnout for “Trolls,” based on a line of   Danish toys and featuring songs by Justin Timberlake, was on par with efforts like “The Croods” and “How to Train Your Dragon,” both of which spawned sequels. Third place went to Mel Gibson’s “Hacksaw Ridge” (Lionsgate) which arrived to about $14. 8 million in ticket sales, a solid total for a   movie from a director with a lot of personal baggage that relied heavily on   marketing. It was independently financed for about $40 million and played mostly to older moviegoers Lionsgate said that 68 percent of the weekend audience was over the age of 35. Perhaps most notably, Mr. Gibson  —   assisted by savvy Lionsgate and Rogers  Cowan publicists  —   has   himself as a player in Hollywood after a decade when his offscreen behavior made him a movie industry pariah. “Hacksaw Ridge” received mostly positive reviews and has been generating awards buzz.'"}, "time": 1742562387.2692466}