{"duration": 0.1381072998046875, "input_args": {"text": "'Right Now: Here’s how we analyzed in real time the only   debate between Senator Tim Kaine of Virginia and Gov. Mike Pence of Indiana. Plus, check out our fact checks and our email exchanges with Walter F. Mondale, the 42nd vice president of the United States. Mr. Kaine challenged Mr. Pence repeatedly to defend statements or proposals made by Donald J. Trump during his chaotic and improvisational presidential campaign, forcing Mr. Pence to filibuster and dodge for minutes on end. It was not quite a defensive crouch: Mr. Pence’s tone and his calm delivery never wavered, and he continued to deflect and deny questions about Mr. Trump’s ideas while turning back to the Obama administration’s foreign policy record. Yet it opened the door for Mr. Kaine  —   who often interrupted Mr. Pence  —   to hammer away at Mr. Trump’s business ties to Russian banks, his campaign team’s lobbying work for a Ukrainian strongman and Mr. Trump’s   praise for Vladimir Putin. When Mr. Pence broached the idea that the Obama administration had let Russia dominate the response to Syrian policy, Mr. Kaine wore an expression that looked vaguely sad, as though he couldn’t believe Mr. Pence had gone there. What followed was a thumping: Mr. Kaine reeled off chapter and verse on Mr. Trump’s musings on the Russian autocrat and Mr. Putin’s own record as president, from Russia’s struggling economy to his persecution of gay people and journalists. Mr. Pence tried repeatedly to argue that Mr. Trump hadn’t said the things Mr. Kaine had claimed. When that failed, he tried to suggest that merely quoting Mr. Trump was to engage in insults. That set Mr. Kaine up for a revealing summation. “Six times tonight I have said to Governor Pence I can’t imagine how you can defend your running mate’s position,” Mr. Kaine said. “He is asking everybody to vote for somebody that he cannot defend. ” • Mr. Pence criticized Hillary Clinton for using a private email server as secretary of state. After Mr. Kaine said that Mrs. Clinton had been cleared by “a Republican F. B. I. director,” Mr. Pence fired back. “If your son or my son handled classified information the way Hillary Clinton did, they’d be ” he said. • Mr. Kaine, noting that he and his wife were the parents of a Marine, said that “the thought of Donald Trump as    scares us to death. ” Mr. Pence replied that President Obama’s tenure had weakened the country’s standing in the world. • After Mr. Kaine said that Mr. Trump had “pursued the discredited and really outrageous lie that President Obama wasn’t born in the United States,” Mr. Pence accused the   ticket of trafficking in “an avalanche of insults. ” When Mr. Pence mentioned Russia, Mr. Kaine cut in. “You guys love Russia!” he said. Mr. Pence, appearing taken back by the interruption, said, “I must have hit a nerve. ” • Deflecting a question about Mr. Trump’s suggestion that he was savvy to avoid paying taxes, Mr. Pence said that his running mate was “a businessman, not a career politician. ” Mr. Kaine interjected: “Why won’t he release his tax returns?” Mr. Pence shot back, “We’re answering the question about the business thing. ” • Responding to a question about gun violence and the police, Mr. Kaine spoke of the mass shooting at Virginia Tech, which occurred when he was governor, and called for increased background checks and strengthening the ties between officers and the areas they patrol. Mr. Pence, who said his uncle was a police officer in Chicago, said, “at risk of agreeing with you, community policing is a great idea. ” But he accused Democrats of “ ” officers in the wake of shootings by the police. • Mr. Kaine unleashed a blistering attack on Mr. Trump’s trail of contentious comments during the campaign, ticking off his remarks about Mexicans, women,   an   judge with Mexican heritage and Senator John McCain of Arizona. “I just want to talk about the tone that’s set from the top,” Mr. Kaine said. Mr. Pence said his running mate’s statements were “small potatoes” compared to Mrs. Clinton’s remark last month that half of Mr. Trump’s supporters fit into a “basket of deplorables. ” Mr. Kaine replied that Mrs. Clinton had apologized for her remark  —   though, as Mr. Pence pointed out, her apology focused on the “half,” not the descriptor. Mr. Trump, Mr. Kaine said, has refused to apologize for any of his comments. • Mr. Kaine condemned Mr. Trump’s foreign policy credentials, saying that the Republican nominee “can’t start a Twitter war with Miss Universe without shooting himself in the foot. ” Mr. Pence suggested that Mr. Kaine sounded rehearsed. “Did you work on that one a long time?” he asked. Mr. Pence said that America was “less safe today” than it was when Mr. Obama took office. • Sparring over refugee policies, Mr. Pence and Mr. Kaine fiercely defended their running mates’ approaches, with Mr. Pence arguing that Mrs. Clinton would expose the country to heightened risks. Mr. Kaine framed it another way: “We want to keep people out if they’re dangerous,” he said. “Donald Trump said, ‘keep them out if they’re Muslim. ’” • Mr. Pence, seizing on recent comments from Bill Clinton that appeared to be critical of the Affordable Care Act, said that “even former President Bill Clinton calls Obamacare a crazy plan. ” (Mrs. Clinton’s team has moved this week to clarify his remarks, with her husband saying that he always supported the measure and still does.) Mr. Kaine did not immediately respond to the remark, setting off on an answer about Mrs. Clinton’s own economic plans. • After Mr. Kaine mentioned Mr. Trump’s frequent praise of Vladimir Putin and the Trump campaign’s “shadowy connections with   forces,” Mr. Pence blamed the Obama administration’s “weak and feckless foreign policy” for Russian aggression. “There’s an old proverb,” Mr. Pence said, “that says the Russian bear never dies, it just hibernates. ” • Mr. Kaine, turning repeatedly to Mr. Trump’s tax avoidance, sought to frame the issue as a matter of national security importance. After the attacks of Sept. 11, 2001, Mr. Kaine said, “young men and women signed up to serve in the military to fight terrorism” and Mrs. Clinton fought for constituents as a New York senator. “Donald Trump was fighting a very different fight,” he said: skirting tax payments that might have boosted American defenses. • Mr. Kaine accused Mr. Pence of declining to forcefully defend Mr. Trump during the debate, pointing to his frequent deflections when confronted with Mr. Trump’s past comments. “He is asking everybody to vote for somebody that he cannot defend,” Mr. Kaine said. Mr. Pence said he was happy to defend Mr. Trump and accused Mr. Kaine of both misrepresenting Mr. Trump and putting words in his mouth. • Mr. Pence said that Mrs. Clinton had engaged in “   politics” as secretary of state, citing potential conflicts of interest with the Clinton Foundation. “I am glad to talk about the foundation,” Mr. Kaine said. “The Clinton Foundation is one of the   charities in the world. ” He turned the focus on Mr. Trump’s foundation, which he suggested  —   alluding to several newspaper investigations  —   had often veered far from traditional philanthropy. • Asked about the tension between faith and a public life, Mr. Kaine recalled grappling with his opposition (and the Catholic Church’s) to the death penalty as governor of Virginia, where the law called for it in some cases. “It was very, very difficult to allow executions to go forward,” he said, adding that he promised voters he would carry out the duties of his office. Mr. Pence said he had “a great deal of respect for Senator Kaine’s sincere faith. ” “That’s shared,” Mr. Kaine said. • After Mr. Pence spoke about his opposition to abortion, Mr. Kaine sought to paint the   ticket as extreme on the issue, noting that Mr. Trump had once suggested that women should be punished for having abortions if the practice were outlawed. (Mr. Trump later walked back the remark.) “He’s not a polished politician like you and Hillary Clinton,” Mr. Pence said.'"}, "time": 1742563876.542011}