{"duration": 0.12381148338317871, "input_args": {"text": "\"Written by Gareth Porter   Post-election comments on Middle East policy last week by President-elect Donald Trump and one his campaign advisers have provoked speculation about whether Trump will upend two main foreign policy lines of the Obama administration in the Middle East.But the more decisive question about the future of US policy toward the region is whom Trump will pick for his national security team – and especially whether he will nominate John Bolton to become Secretary of State. Bolton, one of the most notorious members of Dick Cheney’s team plotting wars in the George W. Bush administration, would certainly push for the effective nullification of the main political barrier to US confrontation with Iran: the 2015 multilateral nuclear deal. Personnel is Policy Trump created a minor stir by giving an interview to the last Thursday in which he reiterated his criticism of the Obama administration’s involvement in the war against Syria's Assad and supported cooperation with Russia against the Islamic State group. And a Trump campaign foreign policy adviser once connected with an extremist sectarian Christian militia in Lebanon named Walid Phares suggested in an interview with BBC radio that Trump would demand that Iran “change [a] few issues” in the agreement and that “the agreement as it is right now...is not going to be accepted by a Trump administration”.The significance of that interview, however, is very unclear. Trump himself had avoided threatening such a move during the campaign, denouncing the nuclear agreement as “disastrous” but avoiding any pledge to renounce it as his Republican rivals Ted Cruz and Marco Rubio had done. In his speech to AIPAC, Trump thundered against the agreement but promised only to enforce it strictly and hold Iran “accountable”.Trump has consistently embraced the long-standing official US animosity toward Iran, but thus far he has given no indication that he intends to provoke an unnecessary crisis with Iran. In any case, Trump’s own views will only be the starting point for policymaking on Syria and Iran. His national security team will have the power to initiate policy proposals as well as effective veto power over Trump’s foreign policy preferences. That is why Trump’s choices of nominations for the top positions on national security will certainly be the crucial factor in determining what policy lines ultimately emerge on those issues – and why the real possibility of Bolton’s nomination as Secretary of State now represents the greatest threat to international peace and security. Obama's Afghanistan Problem Barack Obama became president with a firm intention to get US combat forces out of Iraqwithin 16 months as he had promised during the campaign. But in his very first meeting with CENTCOM Commander Gen. David Petraeus, Secretary of Defense Robert M. Gates and Chairman of the Joint Chiefs of Staff Admiral Mike Mullen in late January 2009, Petraeus and his two allies pressed Obama to back down on his pledge, arguing that it wasn’t realistic. In the end, Obama accepted a scheme devised by the military and Pentagon officials under which combat brigades remained in Iraq long after the August 2010 Obama deadline for their withdrawal with no reduction in combat capability. They were simply given additional tasks of advising and assisting Iraqi military units and renamed “advisory and assistance brigades.”Later in 2009, Obama’s national security team, including Secretary of State Hillary Clinton, pushed for a major US military escalation in Afghanistan in 2009-2010. Obama didn’t buy the arguments by Petraeus, Gates and Mullen for a huge increase in US troops in Afghanistan. He and Vice-President Joe Biden argued that the implosion of Pakistan was a much bigger problem than Afghanistan and that there was no evidence of a threat that al-Qaeda would return to Afghanistan. But the war coalition leaked a story to the press that the White House was ignoring a new intelligence assessment that the Afghan Taliban would invite al-Qaeda back into the country if they won the war. In fact, the intelligence community had produced no such assessment, but the proponents of a big counterinsurgency effort in Afghanistan were demonstrating their power to use the media to raise the political cost to Obama of resisting their demand. Obama gave in on the additional troops, again imposing a deadline for their withdrawal, and the US is still engaged in a losing war in Afghanistan seven years later. Bombing Iran Those largely unknown episodes underline just how vulnerable Donald Trump will be as president to pressures from his national security team to support policies with which he may disagree – unless he chooses people who agree with his policy preferences. But Trump has a peculiar problem in that regard. Because he has already alienated virtually the entire Republican Party national security elite by attacking sacred cows such as NATO, and he has been boycotted by the corps of senior officials from the George W. Bush administration – except for Bolton. Although he is best known as US Ambassador the United Nations in the George. W. Bush administration, it was in his previous role as Undersecretary of State for Arms Control and International Security from 2001 through 2004 that he played his most important role in US foreign policy. Although the story was never covered in the corporate news media, I have recounted in my history of the Iran nuclear issue how Bolton, with the full approval of Vice-President Dick Cheney and in coordination with Israel, began in 2003 to implement a strategy aimed ultimately at maneuvering the US into a military confrontation with Iran. The strategy relied on the accusation that the Islamic Republic was carrying out a covert nuclear weapons programme. Bolton and Cheney failed to get their war with Iran, and Bolton was moved to the United Nations in the second Bush term. But Bolton has never stopped talking about the need for the United States to bomb Iran. In a New York Post op-ed on 14 November , he called on Trump to “abrogate” the nuclear agreement on his first day in office. He wants to be Secretary of State in order to pursue just such a policy, and he is under serious consideration, according to news reports last week. Threat of War If he were nominated as Secretary of State it would be an open invitation for more plotting of schemes within the Trump administration for the war against Iran that Bolton still craves. Bolton would not necessarily prevail in pushing for a direct military confrontation with Iran over the nuclear issue, because the US military would probably exercise its veto over any policy that risks war with Iran. But he could nevertheless provoke a crisis with Iran by subverting the agreement itself. He would begin by trying to get Trump to stop using his presidential waiver power to carry out its provisions on lifting sanctions against Iran. Under normal circumstances, Bolton would never have a chance to reprise his role as war provocateur, but the political circumstances today are anything but normal. There is a very real danger that the Trump transition team will turn to him because it sees no alternative among the usual suspects. The only alternative is to turn to a seasoned diplomat who has not served in senior national security positions in a Republican administration. And if the choices for other top positions are not determined to avoid the kind of confrontation that Bolton would try to provoke, he could conceivably succeed.So the disintegration of the political order controlled by the old Democratic and Republican party elites could spawn new threats of war unless Trump and his advisers are clever enough to see the need to avoid them in their choices of national security officials in the coming days. - Gareth Porter is an independent investigative journalist and winner of the 2012 Gellhorn Prize for journalism. He is the author of the newly published Manufactured Crisis: The Untold Story of the Iran Nuclear Scare. Reprinted with author's permission from MiddleEastEye . Related\""}, "time": 1742563462.6266236}