{"duration": 0.11198568344116211, "input_args": {"text": "'« Reply #528 on: April 07, 2015, 07:16:45 PM » Fukushima disaster caused at least 1,232 fatalities last year as radiation death rate accelerates 7 April 2015 , by David Gutierrez (Natural News)According to the most recent report, deaths in Japan attributable to the 2011 Fukushima nuclear disaster have continued to increase. Last year, the number of deaths increased by 18% over the year before.A March 2011 earthquake and tsunami triggered multiple meltdowns at the Fukushima Daiichi nuclear power plant on Japan\\'s northeast coast, in what has become the worst nuclear disaster in history. A massive radioactive plume was released by the meltdowns, and the crippled plant has continued to leak radiation into the surrounding environment, including into the Pacific Ocean.A total of about 160,000 people were evacuated as a result of the Fukushima disaster. More fatalities on the horizon? According to data collected by the Fukushima Prefecture, 2014 saw 1,232 nuclear-related deaths. The two towns with the greatest number of deaths were both near the Fukushima plant: Namie, with 359 dead; and Tomioka, with 291 dead.The term \"nuclear-related\" means a death that does not result directly from radiation exposure but is caused by a disease later caused by that exposure. Indeed, it is radiation-related diseases -- including cancer, tumors and genetic damage -- that often cause the bulk of health problems and fatalities in cases of radiation exposure.One of the diseases particularly expected to show an uptick after the Fukushima disaster is thyroid cancer, because radioactive iodine from nuclear disasters tends to concentrate in the thyroid gland. An estimated 6,000 children contracted thyroid cancer following the Chernobyl nuclear disaster. It typically takes four to five years for most nuclear-related thyroid cancers to manifest, and as that window approaches many Fukushima parents believe that their children are already showing symptoms. Fukushima officials have tested approximately 300,000 children and have turned up 100 cases of the disease, in contrast to the pre-disaster rate of one or two per million children.One parent concerned about her child\\'s thyroid cancer risk is Megumi Muto. Muto\\'s daughter, Nana, has been diagnosed with lumps in her thyroid gland, and the lumps are growing. Muto is certain that the tumors were caused by Nana\\'s exposure to Fukushima radiation.\"I feel angry,\" Muto said. \"I think the authorities hide the real dangers and now many more children are being diagnosed.\"The health of both of Muto\\'s children has deteriorated after being exposed to the radioactive fallout, she said.\"They had rashes on their bodies then nose bleeds. My son\\'s white cells have decreased and they both have incredible fatigue,\" she said. \"They may not have cancer now but they both have multiple nodules around their thyroids. I\\'m really worried.\" Residents suing government Muto and about 100 other Fukushima residents are currently suing the local and national governments, alleging that the governments failed to protect their children during the nuclear disaster.This sentiment was echoed in a recent report, released by a parliamentary panel, which said that the Fukushima incident was, in part, a \"man-made disaster\" caused by \"government, regulatory authorities and Tokyo Electric Power Company,\" which were all lacking in \"a sense of responsibility to protect people\\'s lives and society.\"Because they do not trust the government\\'s number, Muto and her fellow plaintiffs have conducted their own tests of the radiation levels in their neighborhoods. One test, conducted near a school in Fukushima city, registered radiation levels nearly 100 times that found in Tokyo.Those levels are high enough to warrant investigation, said plaintiff Sumio Konno, who has been a nuclear engineer for 29 years.\"I have to investigate and inform the public of the facts, that is why I have become one of the plaintiffs of the court cases,\" Konno said. \"They\\'re still not decontaminating areas where children live or near schools, even after four years.\" Sources:'"}, "time": 1742563258.1574237}