{"duration": 0.03550219535827637, "input_args": {"text": "'Another powerful earthquake strikes central Italy Please scroll down for video \\nInitial reports on the magnitude of the tremors varied – while USGS and Italian media first talked of a 7.1 earthquake, the European-Mediterranean Seismological Center (EMSC) said the tremor was magnitude 6.5 or 6.6. \\nItaly Civil Protection reports buildings collapsing in a number of locations following Sunday\\'s tremors. They did not provide any information regarding casualties. \\nLocal RAI TV reports that the tremor was powerful enough to wake the residents of the capital Rome, who reported walls of buildings shaking. \\nWhile according to RAI Radio, at least two buildings collapsed in Norcia - the Basilica di San Benedetto and the Cathedral of Santa Maria Argentea. BEFORE AFTER \\nLocal media also reported destruction at the Church of Saint Augustine in Amatrice, which lost its bell tower . \\nAccording to the mayor of Ussita, a commune in the Marche district with around 450 inhabitants, 90 percent of the buildings in the area were brought down by the quake. \\nEmergency services across the region are currently checking the destroyed buildings for casualties, civil protection authorities said. \\nAftershocks with magnitudes of up to 4.5 still reportedly rock the area. \\nThe USGS says the quake was centered 6 km (3.7 miles) north of Norcia, a town in the province of Perugia. The epicenter lay some 10 kilometers deep. Norcia is home to some 5,000 people. \\nItalians who live in the areas affected by the quake rushed to the web, posting videos of shaking furniture inside their homes. \\nItaly\\'s National Commission for the Forecast and Prevention of Major Risks (CGR) cautioned Friday that more powerful earthquakes could hit the region in the nearest future, identifying at least three areas at risk for further seismic activity. \\n\"There is no current evidence that the (seismic) sequence underway is coming to an end,\" the commission warned. \\nThis week\\'s quakes come mere two months after almost 300 people were killed in the region by a quake that levelled several small towns ( via rt.com ). Related Articles'"}, "time": 1742561660.8167157}