{"duration": 0.05455732345581055, "input_args": {"text": "'Senate Majority Leader Mitch McConnell’s ( ) former chief of staff, Josh Holmes, said on Sunday he believes his former boss would support the nomination of federal judge Merrick Garland as FBI director. [BREAKING NEWS: @HolmesJosh: @SenateMajLdr to suggest Merrick Garland as next Director of the FBI. pic. twitter.   —   Fox News (@FoxNews) May 14, 2017,   “I think the Senate majority leader thinks that’s a fantastic idea,” Holmes said in a panel discussion on “Fox News Sunday,” and reported by the Washington Examiner. Last week, Sen. Mike Lee ( ) suggested that instead of appointing a special prosecutor to look into   candidate Donald Trump’s Russian ties and his recent firing of James Comey as FBI director, the president should pick Garland to replace Comey. Garland, chief judge on the United States Court of Appeals for the District of Columbia Circuit, was nominated by former President Barack Obama to replace the late Supreme Court Justice Antonin Scalia, but Republicans refused to take up the nomination because of the impending presidential election. Instead of a special prosecutor, @realDonaldTrump should nominate Merrick Garland to replace James Comey.  —   Mike Lee (@SenMikeLee) May 11, 2017,  “I would imagine that this might be a post that might interest [Garland] and it might be a post that he could serve in very effectively,” Lee told Fox’s “America’s Newsroom” on Thursday. “The idea of Garland ascending to the FBI post was also floated Wednesday by the Daily Caller, which speculated Garland’s confirmation would clear a coveted seat on the influential D. C. Court of Appeals, allowing Trump to appoint a   judge,” Fox News reported, noting that  Conn Carroll, Lee’s spokesperson, dismissed the idea. “Garland is an experienced federal prosecutor who oversaw the [Oklahoma City] bombing investigation,” Carroll wrote in an email to Fox News. “He has the reputation necessary to restore trust in the FBI. “This is not about the D. C. Circuit,” Carroll said. “[McConnell] certainly thinks he will be qualified and he certainly thinks he would be somebody that he could support,” Holmes said. The Trump administration is already interviewing candidates for the top job at the FBI, with officials saying a decision could be made as early as next week.'"}, "time": 1742561781.1192138}