{"duration": 0.17787885665893555, "input_args": {"text": "'Archives Michael On Television No Matter What Happens, We Won’t Know Who The Next President Will Be Until December 19th   8th, 2016 \\nMost Americans assume that their votes decide who the next president will be, but that is actually not the case. It is   that will elect the next president, and they don’t meet until December 19th. And the truth is that all of the members of   never meet in one place. Rather, electors gather together in all 50 state capitals on the second Wednesday in December, and it is at that time that the next president and vice president are officially elected. Of course members of   have voted according to the will of the people about 99 percent of the time throughout our history, but with how crazy this election has turned out to be you never know what might happen. For example, later on in this article you will see that one elector in Washington state has already publicly stated that he will not cast his vote for Hillary Clinton. If other “faithless electors” emerge, that could potentially change the entire   \\nIf you are not familiar with the basics of how   works, here is a pretty good summary from Wikipedia … \\nEven though the aggregate national popular vote is calculated by state officials, media organizations, and the Federal Election Commission , the people only indirectly elect the president, as the national popular vote is not the basis for electing the president or vice president. The President and Vice President of the United States are elected by  , which consists of 538 presidential electors from the fifty states and Washington, D.C. . Presidential electors are selected on a state-by-state basis, as determined by the laws of each state. Since the election of 1824 , [35] most states have appointed their electors on a winner-take-all basis, based on the statewide popular vote on Election Day . Maine and Nebraska are the only two current exceptions, as both states use the congressional district method. Although ballots list the names of the presidential and vice presidential candidates (who run on a ticket ), voters actually choose electors when they vote for president and vice president. These presidential electors in turn cast electoral votes for those two offices. Electors usually pledge to vote for their party’s nominee, but some “ faithless electors ” have voted for other candidates. \\nA candidate must receive an absolute majority of electoral votes (currently 270) to win the presidency or the vice presidency. If no candidate receives a majority in the election for president or vice president, that election is determined via a contingency procedure established by the Twelfth Amendment . In such a situation, the House chooses one of the top three presidential electoral vote-winners as the president, while the Senate chooses one of the top two vice presidential electoral vote-winners as vice president. \\nIn an attempt to make sure that their electors vote according to the will of the people, 29 states have passed laws that impose penalties on “faithless electors”. In many cases the punishment consists of a fine, but that may not be enough to keep some electors in line this time around. According to ABC News , one elector that was supposed to be committed to Hillary Clinton has already announced that he is refusing to vote for her despite the fact that he will get hit by a $1,000 fine… \\nOne elector has already said he won’t vote for Clinton, despite a fine. Robert Satiacum, a member of Washington’s Puyallup Tribe, says he believes Clinton is a “criminal” who doesn’t care enough about American Indians and “she’s done nothing but flip back and forth.” \\nSatiacum faces a $1,000 fine in Washington if he doesn’t vote for Clinton, but he said he doesn’t care. \\n“She will not get my vote, period,” he told The Associated Press. \\nAnd there are 21 states that do not impose penalties on “faithless electors” at all. \\nSo while it is true that over 99 percent of all Electors throughout our history have voted the way that they were supposed to, that may not happen in 2016. \\nThere is also the possibility that the winning candidate could die or become incapacitated between Election Day and December 19th. If that happens, the electors that are supposed to be committed to the winning candidate would be free to vote for someone else.   archives.gov … \\nIf a candidate dies or becomes incapacitated between the general election and the meeting of electors, under federal law, the electors pledged to the deceased candidate may vote for the candidate of their choice at the meeting of electors. Individual states may pass laws on the subject, but no federal law proscribes how electors must vote when a candidate dies or becomes incapacitated. In 1872, when Horace Greeley passed away between election day and the meeting of electors, the electors who were slated to vote for Greeley voted for various candidates, including Greeley. The votes cast for Greeley were not counted due to a House resolution passed regarding the matter. See the full Electoral College vote counts for President and Vice President in the 1872 election. \\nAs to a candidate who dies or becomes incapacitated between the meeting of electors and the counting of electoral votes in Congress, the Constitution is silent on whether this candidate meets the definition of “President elect” or “Vice President elect.” If the candidate with a majority of the electoral votes is considered “President elect,” even before the counting of electoral votes in Congress, Section 3 of the 20th Amendment applies. Section 3 of the 20th Amendment states that the Vice President elect will become President if the President elect dies or becomes incapacitated. \\nIf a winning Presidential candidate dies or becomes incapacitated between the counting of electoral votes in Congress and the inauguration, the Vice President elect will become President, according to Section 3 of the 20th Amendment . \\nOur Constitution really should be amended to deal with a situation where a winning candidate dies between Election Day and   vote, but up until now that has not happened. \\nSo the cold, hard reality of the matter is that we will enter a period of great uncertainty between November 8th and December 19th. Even though the American people will have spoken, we will not have a “President-elect” yet, and if something happens to the winning candidate that could throw us into an unprecedented constitutional crisis. \\nAnd of course if the election results are very tight and a few “faithless electors” throw the election in the opposite direction on December 19th, that could create an enormous constitutional crisis as well. \\nFollowing the vote of   on December 19th, a joint session of Congress takes place on January 6th of the following year to formally declare the winner … \\nThe Twelfth Amendment mandates that the Congress assemble in joint session to count the electoral votes and declare the winners of the election. [53] The session is ordinarily required to take place on January 6 in the calendar year immediately following the meetings of the presidential electors. [54] Since the Twentieth Amendment , the newly elected House declares the winner of the election; all elections before 1936 were determined by the outgoing House. \\nTwo weeks later, the winning candidate will be inaugurated on January 20th, and at that point the next president will begin to serve. \\nIt would be a whole lot simpler and more rational to just allow the American people to directly elect the president, and it would probably take a major crisis in order to get the kind of constitutional amendment that is needed to do that. \\nBut for now the system is what it is, and that means that the election is not over until it is over. \\nSo November 8th is definitely not the end of the story, and the craziest chapters of this election season may still be yet to come.'"}, "time": 1742563113.2432413}