{"duration": 0.03229355812072754, "input_args": {"text": "'posted by Eddie The nuclear disaster has contaminated the world’s largest ocean in only five years and it’s still leaking 300 tons of radioactive waste every day. What was the most dangerous nuclear disaster in world history? Most people would say the Chernobyl nuclear disaster in Ukraine, but they’d be wrong. In 2011, an earthquake, believed to be an aftershock of the 2010 earthquake in Chile, created a tsunami that caused a meltdown at the TEPCO nuclear power plant in Fukushima, Japan. Three nuclear reactors melted down and what happened next was the largest release of radiation into the water in the history of the world. Over the next three months, radioactive chemicals, some in even greater quantities than Chernobyl , leaked into the Pacific Ocean. However, the numbers may actually be much higher as Japanese official estimates have been proven by several scientists to be flawed in recent years. If that weren’t bad enough, Fukushima continues to leak an astounding 300 tons of radioactive waste into the Pacific Ocean every day . It will continue do so indefinitely as the source of the leak cannot be sealed as it is inaccessible to both humans and robots due to extremely high temperatures. It should come as no surprise, then, that Fukushima has contaminated the entire Pacific Ocean in just five years. This could easily be the worst environmental disaster in human history and it is almost never talked about by politicians, establishment scientists, or the news. It is interesting to note that TEPCO is a subsidiary of General Electric (also known as GE), one of the largest companies in the world, which has considerable control over numerous news corporations and politicians alike. Could this possibly explain the lack of news coverage Fukushima has received in the last five years? There is also evidence that GE knew about the poor condition of the Fukushima reactors for decades and did nothing. This led 1,400 Japanese citizens to sue GE for their role in the Fukushima nuclear disaster. Even if we can’t see the radiation itself, some parts of North America’s western coast have been feeling the effects for years. Not long after Fukushima, fish in Canada began bleeding from their gills, mouths, and eyeballs. This “disease” has been ignored by the government and has decimated native fish populations, including the North Pacific herring. Elsewhere in Western Canada, independent scientists have measured a 300% increase in the level of radiation. According to them, the amount of radiation in the Pacific Ocean is increasing every year. Why is this being ignored by the mainstream media? It might have something to do with the fact that the US and Canadian governments have banned their citizens from talking about Fukushima so “people don’t panic.” \\nFurther south in Oregon, USA, starfish began losing legs and then disintegrating entirely when Fukushima radiation arrived there in 2013. Now, they are dying in record amounts, putting the entire oceanic ecosystem in that area at risk. However, government officials say Fukushima is not to blame even though radiation in Oregon tuna tripled after Fukushima . In 2014, radiation on California beaches increased by 500 percent. In response, government officials said that the radiation was coming from a mysterious “unknown” source and was nothing to worry about. \\nHowever, Fukushima is having a bigger impact than just the West coast of North America. Scientists are now saying that the Pacific Ocean is already radioactive and is currently at least 5-10 times more radioactive than when the US government dropped numerous nuclear bombs in the Pacific during and after World War II. If we don’t start talking about Fukushima soon, we could all be in for a very unpleasant surprise. \\nWhat are your thoughts on this news? Please share, like, and comment on this article! \\nsource:'"}, "time": 1742628406.8614295}