{"duration": 0.24774765968322754, "input_args": {"text": "'NEW ORLEANS  —   A typical evening for Ella Brennan begins with cocktails. They are delivered from Commander’s Palace, her family’s restaurant next door to her mansion in this city’s historic Garden District. Drinks are often followed by dinner, also from Commander’s, and wine. Ms. Brennan favors Champagne and distinguished whites from the Côte de Beaune because, as she puts it, “I’m too damn old to drink cheap wine” and “because I can. ” In New Orleans, there is little question that Miss Ella, as Ms. Brennan is widely known here, has earned her sense of entitlement. Her hometown’s civic pride is tightly linked to its reputation for culinary excellence Ms. Brennan helped create that reputation, and has made maintaining it a personal responsibility for more than 60 years. At 91, she is the matriarch of an extended family of restaurateurs that employs nearly 1, 400 people, both full and part time, and she has mentored countless talents, including the celebrity chefs Paul Prudhomme and Emeril Lagasse. “She was there to embrace and elevate, not just me but the entire staff,” said Mr. Lagasse, whom Ms. Brennan plucked from obscurity and installed, at age 23, as Commander’s chef in the early 1980s. “The list of people she has impacted in the hospitality industry in America is endless. ” Ms. Brennan’s family has recently set out to ensure that her legacy is appreciated beyond New Orleans. Those efforts culminated last year with the release of a memoir, “Miss Ella of Commander’s Palace,” written with Ti Martin, her daughter. It was followed by the documentary “Ella Brennan: Commanding the Table,” directed by Leslie Iwerks. The film, which has been screening at festivals, will be available on Netflix in May. The book and film tell the story of a     businesswoman  —   her other nickname is Hurricane Ella  —   who excelled in a   profession decades before gender imbalance in the restaurant industry became a hot issue. “When I first started, you would hardly ever see another woman in the kitchen, much less running the show,” said Sue Zemanick, the former chef at Gautreau’s, a “Top Chef Masters” contestant and a line cook at Commander’s early in her career. “Working at a restaurant with such strong women in charge gave me hope that I could make it. ” While Ms. Brennan is, as Ms. Martin put it, “as retired as Mom is capable of being,” her New Orleans restaurants, which include Café Adelaide and SoBou, remain an obsession for her they are managed by Ms. Martin and Lally Brennan, a niece of Ms. Brennan. On a recent afternoon, Ms. Brennan sat next to the unlit fireplace in her living room. As she moved a sore leg back and forth between an ottoman and the floor, she suggested that her impulse to empower employees was a rejection of restaurant industry norms she confronted as a young woman. “In those days, no one was paying attention to developing people,” she said. “A restaurateur has to be part of a team to make something everyone can be proud of. ” Her decision to tap Mr. Prudhomme, a Cajun, to run Commander’s kitchen in the 1970s loosened the grip that   chefs had on American fine dining. Alongside Ms. Brennan, and later on his own, the   Mr. Prudhomme helped set the table for a renaissance in American regional cooking that has yet to abate. “New Orleans was really the centerpiece of the whole American food movement,” the New York restaurateur Drew Nieporent said. “And Ella put New Orleans on the map. ” Ms. Brennan entered the hospitality business as a teenager working at the Old Absinthe House, a Bourbon Street bar owned by her brother Owen, 15 years her senior. She had dropped out of a local business school after deciding, as she wrote in her book, that “I wasn’t going to type for any man. ” In 1946, Mr. Brennan bought Vieux Carré, a French Quarter restaurant that Ms. Brennan described recently, with typical candor, as “terrible. ” Mr. Brennan hired her to manage the business, looking to prove that an Irish family could operate a restaurant superior to established   restaurants like Arnaud’s, Antoine’s and Galatoire’s. “I didn’t know anything,” Ms. Brennan recalled. “But Owen was a raconteur. He slept till noon. He got me to do all of the things he didn’t like. So I learned. ” A voracious reader, she pored over books recommended by the restaurant’s two chefs, Jack Eames and Paul Blangé, whose respect she sought and whom she frequently praised. “I was amazed at their talent,” she said. “They were like surgeons. ” The gregarious Brennan family  —   the other siblings were Dick, Adelaide, Dottie and John  —   cultivated a clientele of influential locals and visitors, including celebrities. All the while, Ms. Brennan worked with the chefs to elevate Vieux Carré’s food. For inspiration, she traveled frequently to New York City, where she became a regular at the “21” Club. Culinary pioneers like James Beard and Helen McCully, the food editor of McCall’s magazine, took the young visitor under their wings. “You had to go to New York in those days,” Ms. Brennan said. “I was trying to get New Orleans to that level. ” In 1955, the Brennans were preparing to relocate Vieux Carré to a larger space on Royal Street when Owen died of a heart attack at 45. It fell to Ms. Brennan to carry out her brother’s vision for the new restaurant, which would be called Brennan’s. By all accounts, Brennan’s ushered in a new age for fine dining in the South. It became a grand showcase for New Orleans joie de vivre, replete with a wine cellar, antiques and food that stretched the boundaries of traditional   cuisine. The national press took notice, especially of its boozy, multicourse breakfasts. “America was coming to appreciate dining as entertainment,” Ms. Brennan wrote, “and all of the newspapers were just beginning to have columns about food. ” Ms. Brennan helped develop new dishes, including bananas Foster. She pushed to expand the family’s restaurant properties, with spotty success, aggravating a rift between Owen’s heirs and what came to be known as “Ella’s side” of the family. In 1973, Ms. Brennan was dismissed from Brennan’s, initiating a bitter, litigious family split that has never fully healed. “It was a tragedy,” Ms. Brennan said. “Family is everything to us. ” (Owen Brennan’s sons continued to run Brennan’s until 2013, when a group that includes Ralph Brennan, a son of John Brennan, purchased the   property at a sheriff’s auction. Brennan’s of Houston, overseen by Ms. Brennan’s son Alex, is part of her restaurant group.) Commander’s Palace, which Ms. Brennan acquired in 1969, was a sprawling property in need of repair. In partnership with her sisters and brothers, she set about turning it into a restaurant that would eclipse Brennan’s. Early reviews weren’t favorable. But over time, Commander’s became renowned for its sophisticated blending of south Louisiana and nouvelle cuisines  —   Ms. Brennan christened the style haute Creole  —   and its warm, celebratory approach to fine dining. “We want people who eat here to feel important, and we want them to have fun,” Ms. Brennan said. Ms. Brennan never presumed that her management responsibilities ended at the kitchen door. Alex McCrery, a Commander’s line cook in the early 2000s, recalled that Ms. Brennan admonished another cook for proposing that the kitchen make mustard ice cream. “She was the type who was like your mom is when she is disappointed in you,” Mr. McCrery said. “She was stern, and you’d feel like you really messed up. ” Ms. Brennan said she “gave up men for Lent” after her divorce in 1970 from Paul Martin. She also never learned to cook (“I don’t think she can boil water,” Mr. Lagasse said) but that doesn’t prevent her from giving lavish dinner parties in the home she shares with Dottie. “We don’t carry on like we once did,” she said before a recent meal. “But I do like to take advantage of living next door to my restaurant. ” A waiter carried Ms. Brennan’s drink as she moved, with the aid of a walker, from her   parlor to her   dining room. She sat at the head of the table as Commander’s waiters delivered a series of courses from the restaurant’s kitchen. As she sank her spoon into a steaming sea urchin and stone crab soufflé, Ms. Brennan explained that entertaining gives her an opportunity to weigh in on new ideas from Tory McPhail, Commander’s current and   chef. It also allows her to partake in the kind of pleasure she has provided others for so long. “What we’re doing here tonight is letting him experiment on us,” she said, referring to Mr. McPhail, who had just introduced a course of lamb osso buco. Ms. Brennan was as engaged and vivacious as when the evening began. As Mr. McPhail turned to leave, she called after him, “Bring back a bottle of Champagne, will you?” Recipe: Bananas Foster'"}, "time": 1742561631.212894}