{"duration": 0.1056373119354248, "input_args": {"text": "'CHARLESTON, S. C.  —   The trial of Michael T. Slager, the police officer whose videotaped killing of an unarmed black man staggered a nation already embroiled in a debate about police misconduct and racial bias in law enforcement, ended in a mistrial on Monday. Judge Clifton B. Newman’s decision to halt the proceedings came three days after jurors signaled that they were within one vote of returning a guilty verdict against Mr. Slager, who could have been convicted of murder or voluntary manslaughter in the fatal shooting of Walter L. Scott. But on Monday, in a final note to Judge Newman, jurors said that “despite the best efforts of all members, we are unable to come to a unanimous decision. ” The outcome was disappointingly familiar to critics of police practices and conduct, and demonstrated the steep hurdles associated with prosecuting a police officer for a shooting while on duty. Although other cases involving claims of police misconduct have ended in mistrials and acquittals, few resonated as widely as this case in North Charleston, where Mr. Slager fired eight shots as Mr. Scott ran away. “The fight isn’t over, that was Round 1,” said L. Chris Stewart, a lawyer for Mr. Scott’s family. “We all saw what he did. We all saw what happened. ” In a statement, Gov. Nikki R. Haley said: “Justice is not always immediate, but we must all have faith that it will be served  —   I certainly do. ” Prosecutors said they would seek a new trial for Mr. Slager, who was fired after the shooting, and the Scott family expressed confidence that he would ultimately be convicted. Mr. Slager’s lawyer, Andrew J. Savage III, did not comment as he left the courtroom, where jurors had heard testimony for about four weeks. No piece of evidence was more central than a cellphone video, which a   Feidin Santana, recorded as he walked to work on April 4, 2015. The video began only after Mr. Scott fled on foot from a traffic stop for a broken taillight, but it was shocking and vivid. In the recording, the men engage in a struggle, and then, as Mr. Scott runs away, Mr. Slager raises his Glock handgun and fires. Mr. Scott falls to the ground. He was at least 17 feet away when Mr. Slager began to shoot. It was a sequence that jurors saw over and over, and the sound of the gunshots repeatedly pierced the courtroom. On Monday, the existence of the video, and its inability to lead to a conviction, fueled much of the furor and frustration about the trial’s resolution, incomplete as it was. “It saddens me, but I am not shocked,” said Howard Friedman, a civil rights lawyer and the former president of the National Police Accountability Project. “The fact that out of 12 people you would find one person so prejudiced in favor of police is saddening, not shocking, because I know that kind of prejudice in favor of police is out there. ” In Missouri, where an August 2014 police killing in Ferguson spurred both peaceful protests and unrest, State Senator Maria   said the outcome in Charleston had left her “hopeless. ” “When you have the video that shows that Walter Scott is running away and still you have a mistrial?” Ms.   said. Here in Charleston County, investigators at first believed Mr. Slager when he said he had been attacked. But Mr. Santana’s video, which emerged within days of the shooting and provoked international outrage, made Mr. Slager a pariah to many in law enforcement, an anomaly of policing who strayed far from his duties and oath when he opened fire and, prosecutors contended, tried to stage the scene to make the shooting appear justified. “Our whole criminal justice system rides on the back of law enforcement,” the chief prosecutor for Charleston County, Scarlett A. Wilson, said during her closing argument. “They have to be held accountable when they mess up. It is very, very rare, but it does happen. ” Ms. Wilson acknowledged from the beginning of the trial that she thought Mr. Scott had contributed to his own death by running away. “If Walter Scott had stayed in that car, he wouldn’t have been shot,” Ms. Wilson said. “He paid the extreme consequence for his conduct. He lost his life for his foolishness. ” Ms. Wilson’s concession, which she made during her opening statement, was something of an effort to immunize the prosecution from a theory that the defense advanced throughout the trial: that Mr. Scott had acted in ways that made Mr. Slager fear for his life. In his closing argument, Mr. Savage said Mr. Scott had left the officer with little choice after he “made decisions to attack a police officer. ” “Should he have assumed that an unarmed man would have attacked a police officer?” Mr. Savage said of Mr. Slager, who he complained had been made a “poster boy” of police misconduct claims because of disputed killings elsewhere in the country. Mr. Slager pressed a similar argument when he testified that he had felt “total fear” and “fired until the threat was stopped, like I’m trained to do. ” The jury here had three options, besides deadlocking: a conviction for murder, a conviction for voluntary manslaughter or an acquittal. In South Carolina, a murder conviction can lead to a life sentence, and manslaughter carries a term of two to 30 years. Mr. Slager’s case and its outcome were virtually certain to revive the storm that surrounded North Charleston, a city of about 108, 000 people, after Mr. Scott’s death. City officials, who agreed to a $6. 5 million settlement with Mr. Scott’s family, have long insisted that Mr. Slager was an outlier. But critics argued last year and again on Monday that the shooting was a tragic result of an aggressive law enforcement strategy carried out by a largely white police force. Drivers and pedestrians faced frequent stops for minor violations, and the police increased their presence, especially in   areas that happened to be predominantly black neighborhoods. The approach, community leaders said, eroded trust, and North Charleston’s Police Department is now the subject of a Justice Department review as part of a “collaborative reform process. ” Another arm of the Justice Department is involved in a different legal battle against Mr. Slager, who has been accused in a federal indictment of violating Mr. Scott’s civil rights. But Mr. Slager will now also face a second trial in state court, and lawyers will undoubtedly consider the feedback that emerged from a jury that appeared bitterly divided during deliberations, which began on Wednesday. In a letter to Judge Newman on Friday, a single juror said he could not “in good conscience consider a guilty verdict. ” The jury’s foreman, the panel’s only black member, said in a separate note that the group was mostly in agreement that Mr. Slager should be convicted: “It’s just one juror that has the issues. ” The foreman also said: “That juror needs to leave. He is having issues. ” But on Monday morning, the jury said in another note that a majority of its members were “still undecided. ” Later, standing outside the courthouse on an overcast day, members of Mr. Scott’s family said they were not dwelling on a trial they had hoped would end with Mr. Slager bound for prison. “God is my strength, and I know without a doubt that he is a just God,” said Mr. Scott’s mother, Judy Scott. “Injustice will not prevail. ”'"}, "time": 1742564569.6698651}