{"duration": 0.30521464347839355, "input_args": {"text": "'\"Era muy buena gente\": enfermera, acusada de asesinar a 8 pacientes en Canadá  52 GMT \\nLas muertes tuvieron lugar entre los años 2007 y 2014 en residencias para personas de edad avanzada. Geoff Robins Reuters   \\nElizabeth Tracy Mae Wettlaufer, una enfermera de 49 años, ha sido acusada de haber asesinado a ocho pacientes de edad avanzada en la provincia canadiense de Ontario, según ha declarado en una rueda de prensa este martes la Policía, citada por CBC News . \\nLas muertes tuvieron lugar entre los años 2007 y 2014 en residencias para personas mayores en las localidades de Woodstock y Londres. Según los datos disponibles, las víctimas tenían entre 75 y 96 años. Siete pacientes fallecieron debido a una dosis letal de un medicamento, mientras que la causa del deceso de la otra víctima no ha sido revelada. \\nWettlaufer fue registrada como enfermera en la provincia en 1995 y renunció al Colegio de Enfermería de Ontario a finales del pasado mes de septiembre, después de que la Policía iniciase una investigación acerca de la muerte de ocho pacientes. \\nLos amigos y vecinos de Wettlaufer quedaron en estado de \\'shock\\' tras conocer la noticia. Según la vecina Karen Price, la enfermera \" era muy buena gente , y era fácil hablar con ella\". El enfermero que \"se aburría\" en Alemania y otro caso en Japón \\nEl pasado mes de junio fue abierta una investigación por la muerte de 33 personas en un hospital de Delmenhorst (Baja Sajonia, Alemania). Niels H., un antiguo enfermero que en el 2015 fue condenado a cadena perpetua por asesinar a dos de sus pacientes, podría haber estado involucrado en esas muertes. \\nDurante el juicio, el acusado expresó sus condolencias a las familias de las víctimas y declaró que, \"por aburrimiento\" , inyectaba sobredosis de medicamentos a algunos enfermos para disminuir su presión sanguínea, con el objetivo de llevarlos al borde de la muerte y demostrar su capacidad para reanimarlos. \\nEl pasado mes de septiembre la Policía japonesa emprendió la búsqueda de un \\'ángel de la muerte\\' que habría matado hasta a 48 pacientes de un hospital de Yokohama envenenando sus sueros intravenosos. Todas las muertes se registraron entre julio y septiembre, y todas las víctimas estaban internadas en la misma planta del centro médico.'"}, "time": 1742628537.7051125}