{"duration": 0.09821462631225586, "input_args": {"text": "'Hans Rosling, a Swedish doctor who transformed himself into a   statistician by converting dry numbers into dynamic graphics that challenged preconceptions about global health and gloomy prospects for population growth, died on Tuesday in Uppsala, Sweden. He was 68. The cause was pancreatic cancer, according to Gapminder, a foundation he established to generate and disseminate demystified data using images. Even before “ ” entered the lexicon, Dr. Rosling was echoing former Senator Daniel Patrick Moynihan’s maxim that everyone is entitled to his own opinions but not to his own facts. “He challenged the whole world’s view of development with his amazing teaching skills,” Isabella Lovin, Sweden’s deputy prime minister, said in a statement. On Twitter, Bill Gates remembered Dr. Rosling as a “great friend, educator and true inspiration. ” A   “edutainer,” Dr. Rosling captivated vast audiences in TED Talks  —   beginning a decade ago in front of live audiences and later viewed online by millions  —   and on television documentaries like the BBC’s “The Joy of Stats” in 2010. Inviting animated visualizations and prosaic props (like apples and colorful Lego plastic blocks) defined him as a funky philosopher rather than a geeky professor. “I produce a road map for the modern world,” he told The Economist in 2010. “Where people want to drive is up to them. But I have the idea that if they have a proper road map and know what the global realities are, they’ll make better decisions. ” In Dr. Rosling’s version of those realities, the traditional divide between   and industrialized nations had become anachronistic, since so many countries were undergoing development, with some in Asia improving faster than some in Europe. He considered that five billion people continued to head toward healthier lives while one billion remained mired in poverty and disease that progress toward health and wealth had contributed to climate change and that the world was so poorly governed that possibilities to improve it abounded. “I’m not an optimist,” Dr. Rosling once said. “I’m a very serious possibilist. ” He predicted that the United Nations’ goal of eradicating extreme poverty by 2030 was attainable because the tools to do so had been identified and the share of people living in that condition had already declined by more than half in 25 years. He also argued vigorously that overpopulation would no longer be problematic as the world grew wealthier and fertility rates declined. “There are so many who think that death keeps control of population growth,” he said in an interview with The Guardian in 2013. “That’s just wrong!” He told The Economist: “The only way to reach sustainable population levels is to improve public health. Child survival is the new green. ” As a medical doctor, epidemiologist and academic, but with the flair of a seasoned performer (he once demonstrated his expertise as a sword swallower) he delivered counterintuitive factoids, accused advocates of tweaking statistics to advance their own causes, and debunked misapprehensions about the third world  —   although not every expert concurred. He pointed out that Sweden had more children per woman than Iran, that Shanghai was just as wealthy and healthy as the Netherlands, and that the world’s average life expectancy of 71 years was now closer to the highest (84 in Japan) than to the lowest (49 in Swaziland). “They just make it about us and them the West and the rest,” Dr. Rosling told the journal Nature in December. “How could anyone hope to solve problems if they didn’t understand the different challenges faced, for example, by Congolese subsistence farmers far from paved roads and Brazilian street vendors in urban favelas?” Hans Gosta Rosling was born in Uppsala on July 27, 1948. His father was a coffee roaster. He studied statistics and medicine at Uppsala University and public health at St. John’s Medical College in Bangalore, India, where he received his medical degree in 1976. In 1979, he and his wife, the former Agneta Thordeman, whom he met while she was studying to be a nurse, moved to Mozambique with their two young children. He was delivering on a pledge he had made years earlier to Eduardo Mondlane, the founder of the Mozambican Liberation Front, to help provide health services when the country became independent. Mr. Mondlane was killed in 1969, six years before independence was granted by Portugal. Dr. Rosling served as district medical officer in a northern province. He was the sole doctor for a population of 300, 000. His investigation of a paralytic disease called konzo in the Democratic Republic of Congo, which was determined to be caused by ingesting naturally occurring cyanide in cassava roots, earned him a doctorate from Uppsala University. In addition to his wife, a pediatrician and researcher, he is survived by two sons, Ola and Magnus a daughter, Anna and a brother, Mats. With his son Ola and his    Anna Rosling Ronnlund, Dr. Rosling established Gapminder in 2006 while he was a professor of global health at the Karolinska Institute, the medical university outside Stockholm. The foundation aims to chart trends and fight what it calls “devastating ignorance with   worldviews everyone can understand. ” It derived its name from the London Underground’s recorded warnings to passengers to “mind the gap” between a subway car and the platform. Gapminder’s data images are designed to evoke the divide between statistics and the misleading ways in which they are sometimes interpreted. “It’s like the emperor’s new clothes, and I’m the little child saying: ‘He’s nude! He’s nude! ’” Dr. Rosling told The Guardian. Brandishing his bubble chart graphics during TED (Technology, Entertainment and Design) Talks, Dr. Rosling often capsulized the macroeconomics of energy and the environment in a favorite anecdote about the day a washing machine was delivered to his family’s   flat. “My mother explained the magic with this machine the very, very first day,” he recalled. “She said: ‘Now Hans, we have loaded the laundry. The machine will make the work. And now we can go to the library.’ Because this is the magic: You load the laundry, and what do you get out of the machine? You get books out of the machines, children’s books. And Mother got time to read to me. ” “Thank you, industrialization,” Dr. Rosling said. “Thank you, steel mill. And thank you, chemical processing industry that gave us time to read books. ”'"}, "time": 1742563025.1830342}