{"duration": 0.9161479473114014, "input_args": {"text": "'George Soros Is Preparing For Economic Collapse – Does He Know Something That You Don’t?   June 9th, 2016 \\nWhy is George Soros selling stocks, buying gold and making “a series of big, bearish investments”? If things stay relatively stable like they are right now, these moves will likely cost George Soros a tremendous amount of money. But if a major financial crisis is imminent, he stands to make obscene returns. So does George Soros know something that the rest of us do not? Could it be possible that he has spent too much time reading websites such as The Economic Collapse Blog ? What are we to make of all of this? \\nThe recent trading moves that Soros has made are so big and so bearish that they have even gotten the attention of the Wall Street Journal … \\nWorried about the outlook for the global economy and concerned that large market shifts may be at hand, the billionaire hedge-fund founder and philanthropist recently directed a series of big, bearish investments , according to people close to the matter. \\nSoros Fund Management LLC, which manages $30 billion for Mr. Soros and his family, sold stocks and bought gold and shares of gold miners, anticipating weakness in various markets . Investors often view gold as a haven during times of turmoil. \\nHmmm – it sounds suspiciously like George Soros and Michael Snyder are on the exact same page as far as what is about to happen to the global economy. \\nYou know that it is very late in the game when that starts happening… \\nOne thing that George Soros is particularly concerned about that I haven’t been talking a lot about yet is the upcoming Brexit vote. If the United Kingdom leaves the EU (and hopefully they will), the short-term consequences for the European economy could potentially be absolutely catastrophic … \\nMr. Soros also argues that there remains a good chance the European Union will collapse under the weight of the migration crisis , continuing challenges in Greece and a potential exit by the United Kingdom from the EU. \\n“ If Britain leaves, it could unleash a general exodus, and the disintegration of the European Union will become practically unavoidable ,” he said. \\nThe Brexit vote will be held two weeks from today on June 23rd, and we shall be watching to see what happens. \\nBut Soros is not just concerned about a potential Brexit. The economic slowdown in China also has him very worried, and so he has directed his firm to make extremely bearish wagers. \\nAccording to the Wall Street Journal, the last time Soros made these kinds of bearish moves was back in 2007, and it resulted in more than a billion dollars of gains for his company. \\nOf course Soros is not alone in his bearish outlook. In fact, Goldman Sachs has just warned that “there may be significant risk to the downside for the market” … \\nGoldman Sachs is getting nervous about stocks . \\nIn a note to clients, equity strategist Christian Mueller-Glissmann outlined the firm’s fears that there may be significant risk to the downside for the market. \\nUltimately, George Soros and Goldman Sachs are looking at the same economic data that I share with my readers on a daily basis. \\nAs I have been documenting for months, almost every single economic indicator that you can possibly think of says that we are heading into a recession . \\nFor instance, just today I was sent a piece by Mike Shedlock that showed that federal and state tax receipts are really slowing down just like they did just prior to the last two recessions… \\nUS federal personal tax receipts receipts are falling fast. So is the Evercore ISI State Tax Survey . \\nThe last two times the survey plunged this much, the US was already in recession. \\nIs it different this time? \\nAnd online job postings on LinkedIn have now been falling precipitously since February after 73 months in a row of growth … \\nAfter 73 consecutive months of year-over-year growth, online jobs postings have been in decline since February. May was by far the worst month since January 2009, down 285k from April and down 552k from a year ago . \\nLast week, the government issued the worst jobs report in nearly six years , and the energy industry continues to bleed good paying middle class jobs at a staggering rate. The following comes from oilprice.com … \\nThat may seem counterintuitive in an industry that has been rapidly shedding workers, with more than 350,000 people laid off in the oil and gas industry worldwide. \\nTexas is one place feeling the pain. Around 99,000 direct and indirect jobs in the Lone Star state have been eliminated since prices collapsed two years ago, or about one third of the entire industry. In April alone there were about 6,300 people in oil and gas and supporting services that were handed pink slips. Employment in Texas’ oil sector is close to levels not seen since the aftermath of the financial crisis in 2009. “ We’re still losing big chunks of jobs with each passing month ,” Karr Ingham, an Amarillo-based economist, told The Houston Chronicle . \\nAt this point it is so obvious that we have entered a new economic downturn that I don’t know how anyone can possibly deny it any longer. \\nUnfortunately, the reality of what is happening has not sunk in with the general population yet. \\nJust like 2008, people are feverishly racking up huge credit card balances even though we stand on the precipice of a major financial crisis… \\nAmerican taxpayers are quick to criticize the federal government for its ever-increasing national debt, but a new study released Wednesday found taxpayers are also saddled with debt, and are likely to end 2016 with a record high $1 trillion in outstanding balances. \\nWallethub, a site that recommends credit cards based on consumers’ needs, said that will be the highest amount of credit card debt on record, surpassing even the years during and before the Great Recession. The site said the record high was in 2008, when people owed $984.2 billion on their credit cards. \\nWill we ever learn? \\nThis has got to be one of the worst possible times to be going into credit card debt. \\nSadly, the “dumb money” will continue to act dumb and the “smart money” (such as George Soros) will continue to quietly position themselves to take advantage of the crisis that is already starting to unfold. \\nWe can’t change what is happening to the economy, but we do have control over the choices that we make. \\nSo I urge you to please make your choices wisely. \\n*About the author: Michael Snyder is the founder and publisher of The Economic Collapse Blog. Michael’s controversial new book about Bible prophecy entitled “The Rapture Verdict” is available in paperback and for the Kindle on Amazon.com.* EBT Card Outage?: It Is 8 Days Into June And Many Americans Are STILL Waiting For Food Stamp Money » Jim Clark \\nMarket watch had a story on Soros and his bearish predictions the last six years. Each time he’s made his bearish predictions, the market has gone up. Returns the last 5 months have been good ever since that bearish hysteria in January. Shedlock has been saying we are in a recession every week since 2011. \\nBear markets do happen every few years do these guys may be right this time. Broken clocks are sometimes right too. But consider the whole track record of these prognosticators Tim \\nA few months ago a wealthy coworker told me that he had about $50k in the stock market, and he asked me if I thought that was a good idea. I told him that I wouldn’t have any money in stocks because I believe that a major correction is coming. He later told me that he had gotten out of stocks, and I told him that he was wise to do so. However, the correction that I spoke of still hasn’t started, and my coworker seems to have taken a different attitude toward me. \\nI no longer talk about what I believe is coming because everything is so manipulated, and it makes me look like foolish when I’m wrong. I believe I’ll eventually be proven right. It’s just a matter of time. I just wonder how much longer they can keep this going. This is insane. ali \\nCapital should always be diversify in a way so as to reduce exposure to a particular asset or risk. I think one should maintain a portfolio in gold as well as stocks and so on Since last 2 years I have missed some good opportunities to invest and get good returns in stock market, just thinking that the market collapse can be any moment. abc \\n1. There was a guy always bring an umbrella with him when goes outside, but no rain. One day, he decides not to bring an umbrella with him, and it rain. \\n2. Some people needs to learn the hard way. Priszilla \\nThat’s me. Nowadays I don’t care about the rain and leave the umbrella home most of the time. I have a dehumidifier at home that dries the home when I bring home wet clothes. JC Teecher \\nYou are not alone. \\nI tried to get my Dad, now 80, to sell off most of his stock last year before the August/September, “possible” market collapse. he didn’t, good thing, and after the short drop for a couple months, most of his stock investment has now hit decade highs. With some hitting record highs. \\nBut, he has no other investments, and little savings, except some junk silver. In late ’08 I tried to get him to buy into a major stock that had dropped to less than 7 bucks a share. The average for the stock over the past twenty years had been about 17 to 20 bucks. I told him that he could easily double his money in less than two years. He didn’t listen because his broker talked him out of it. \\nThat stock doubled in the first year, and two weeks ago hit an all time high of 70 bucks a share. \\nI believe a big sell off will happen this Fall. A lot of stocks are way over valued. Liberty First \\nI encouraged my wife to put all of her retirements into cash at present. What have we got to lose? A small potential gain short term, perhaps. But in 3-4 years there will be major bottom feeding opportunities. Meanwhile, I have a ton of money in gold stocks and silver (SLV). Be patient. And also, spiritual. We know that in the long term we will be right. It takes patience to sit through it, and enjoying family and other things of permanent value make it easyier. michael malachi \\npretty good idea with the silver, but maybe we should – as a nation – forget about money for a bit and begin to focus on being a better friend, neighbor, father, mother, sister, brother etc. You cant take it with you when you die. You will be remembered and judged by your relationships and actions (works). It is time to help those in need and love others. Don’t forget the golden rule. Liberty First \\nVery nice. JC Teecher \\nFor some of us, we have been doing just that for years and years, and some even decades and decades. We realize that the only thing you take with you from this life, is what you give away. \\nHowever; there is nothing wrong with making money and becoming comfortably wealthy, as long as it doesn’t become one’s main agenda for everything. When greed takes precedence over charity, then it is time to unload it all and take up the cross. \\nI have never looked down on poor or disabled people that are doing the best that they can with the hand they have been dealt. \\nI look down on rich people that have the attitude, and especially those that “act” like they are rich, and act snooty towards others. sistersoldier \\nAmen and amen again JC. Christ came that we might have life more abundantly. Believers are to love God and grow in wisdom as these things are first and foremost and are more important than money. Just as you have stated we cannot take anything with us as only what we do for Christ will last. Money is a transient possession that is used for this brief life but no longer. Proverbs teaches us that it is better to have a little money but be right with God than a lot of money you obtained unjustly. JC Teecher \\nAmen to your thoughts as well. \\nMost people don’t realize that we can be blessed with much more than we need, as a test, to see how we handle those blessings. \\nThe strings of prosperity sometimes ensnare us to the world. Our Father wants to know if our heart remains pure through the prosperous times as well as the lean. \\nI have found myself, in times past, forgetting that all the prosperity can vanish in a day. Believe me, when I say I have been tested many times. \\nThe key is to not make the terrible mistake of blaming God when all the prosperity vanishes. ITSNOTWhatchaThink \\nthere is no god JC Teecher \\nI wish that you could have the out of body experience that I had back in 2003. It literally shook me to the core, and before it was over I was completely aware of being in the spirit realm, and in my spirit body. so were the thousands that were with me. \\nIt ‘s up to you, if you want to see it and feel it bad enough. Maybe i can help if at some point you have the desire to believe. Otherwise just accept that you have been blinded for your own protection, until the beginning of the Millennium, or until you give up the ghost/spirit. \\nBest wishes. sistersoldier \\nAnd that which you have so profoundly laid out — is wisdom. “The fear of the Lord is the beginning of wisdom and the knowledge of the Holy One is understanding.” ITSNOTWhatchaThink \\nthere isn’t a god Ken \\nJust a thought. I’m a fan of silver, but not necessarily of the SLV. Like the GLD, there are likely more contracts per ounce than ounces in the vault to back it. Paper silver is like other paper “assets.” The SLV is being manipulated by the big banks as was admitted to last month by Deutsche Bank. It is entirely possible that your SLV goes higher, but you may not be able to sell it for currency. Check out Bix Weir’s YouTube videos to get a deeper understanding of what I’m talking about. My suggestion would be to convert your SLV to SLW or convert to physical silver you can hold in your hand. Gay Veteran \\nOne day, SOON< that co-worker would have wished he took your advice! Tim \\nHe did take my advice by getting out of stocks. But he may have put his money back into stocks. I don’t know. Since the “correction” that I warned him about hasn’t materialized he doesn’t talk to me much anymore. Frankie \\nI would not waste any more time worrying about this person Tim. You gave advice that you thought was correct. We are all adults, this person CHOSE to listen to your advice, and probably got further information from other sources as well. YOU didn’t FORCE him to sell his stocks, he CHOSE to do it and instead of ignoring you and now not speaking he should “OWN” his own decision to do what he did. I am of the same ilk as you, I have been preparing for some time for a MAJOR collapse. We think 2008 was bad??? Wait for it!! People have no idea, do not think it is remotely possible that the entire world could collapse with everything that is happening across the globe. I once wanted to help everyone but I realised a long time ago people have to want to help themselves. So now I am concentrating on myself and my family. I truly believe really bad times are coming. People need to learn to be RESILIENT. Those who you thought were friends will become enemies in their desperation, you will need to learn how to defend yourselves and how to “economise” and I am not talking “money” here, I am talking the basic necessities for life. ALWAYSTOMORROW \\nHow SOON? TrumpGodzillaRising \\nIt’s wise to stay silent and simply observe, prepare your own sphere of influence as best you can and that’s about it as collapse accelerates. You’ll find that people become more insane as collapse accelerates. Jews never believed they were being sent off to be gassed even as they were herded onto the trains. Today we know different. Ignore the race hating a sec, focus on events as they are, reality as it is. \\nI think Soros recognises it’s the global political dimension finally coming to a head, in other words, the people have finally had enough, you can see this globally in so many nations with so many problems converging to create this perfect storm that will feed off itself. \\nWe all know that none of the problems were solved post 2008, they were made infinitely worse. Here we are as predicted, 2015-2020 the collapse would accelerate and war would be the likely outcome when politics and diplomacy fails. In fact war is simply a continuation of politics. \\nIslamic State \\nThe world order is collapsing. michael malachi \\nWhen you have truth to offer – that truth must be brought out into light by sharing it with all who would listen. That is the job of a watchman. The problem is that too many see themselves as watchmen and most are just giving their opinions. A true watchman will have a true word of God that can not be refuted, but will likely be ignored. Opinionists tend to know it all and will make every effort to convince others that they are right. jox \\nA watchman that ‘have a true word of God that can not be refuted’ doesn’t exist. michael malachi \\nAnyone can disagree with and make attempts to discredit a true watchman (scoffers), but truth will be realized at some point by all. Ye shall know them by their fruit. A good tree can not produce bad fruit and a bad tree can not produce good fruit. GSOB \\nRomans 8:1, 14, 16, 19 hut hut hike Scriptures speak otherwise. TrumpGodzillaRising \\nHence keeping opinions to yourself. The world is not ready for what’s coming, the world will not thank you for what’s coming. You can’t change anything anyway now, it’s too late. \\nRide with the chaos and simply try to survive as best you can, for as long as you can. \\nGood luck \\nI am sorry that you say that, may God show you his truth. GSOB \\nGod the Creator became a God-Man \\nHis death redeems those for His glorious plan. \\nNow in resurrection, the Spirit’s released. \\nProducing the Church, …. this is God’s Masterpiece. GSOB \\nGenesis 6:13 – Noah’s day. \\nWhat happened in his day, set in rough 1600 years since Adam and Eve? well, the population increased and so did evil. \\nGod is the still observing and been patient and kind by allowing us/them long enough to live and hear the Gospel. \\nHe has called believers in Him to become fishers of men the salty influence in a society engorged in decadence. He sees and knows all, is what they preach, for His own word testifies and verifies the disciples experience. The Spirit sanctifies them. \\nHis Sovereignty is unquestionable, beyond ours to fully appreciate, yet become a man like us. \\nDifferent men use different bait but the message the true message is Peace with God through our Lord and Savior, Jesus Christ. The fire of Gods wrath has been satisfied in Him and He was raised for their justification and new life, eternal life in Jesus. \\nWhere is He now? \\nHow naïve men are to think He don’t exist, \\nenslaved to god of this age, in their sin. \\nWe see it in our children. In all men. \\nOnly His blood can cleanse the heart from sin. \\nThe Christians see verses like these and understands, \\nbelieves, that a Holy Trinity is their One God, that glorious praise of the redeemed. \\n2 Corinthians 13:14 \\nJesus Christ. \\nThe Spirit and the Bride say come. \\nCollectively their message to the world is to endure in His grace, the ministry of reconciliation…. “Be reconciled to God.” \\nIn view of the Day of Christ, they are empowered by His grace to endure in their place the life, worth of the Gospel \\nPhilippians 1:27-29“Whatever happens, conduct yourselves in a manner worthy of the gospel of Christ. Then, whether I come and see you or only hear about you in my absence, I will know that you stand firm in the one Spirit, striving together as one for the faith of the gospel without being frightened in any way by those who oppose you. This is a sign to them that they will be destroyed, but that you will be saved and that by God. For it has been granted to you on behalf of Christ not only to believe in Him, but also to suffer for him,…. Yet, God causes all these things to work for their good. TrumpGodzillaRising \\nYou’re gonna need a lot of faith soon, in fact those that survive this will survive because of their iron faith amidst the chaos. Weaker minds will not survive. Gay Veteran \\nfind that gay gene yet? Alana Gale-Perry \\nI would tell him about this site, and ask him to use his own discernment, and tell him to visit this site often. The best manner, in which to talk about these things, is in terms of exactly what you just stated. That you know that something is coming, and it will be some time in the near future, but things are being manipulated, and it could come tomorrow, or it could be a little more time yet. Tell him that it’s a good thing that it is being held off, so it gives people time to pray and prepare. Ask him if he is preparing, both physically and spiritually. Tell him that’s the next step, and one that should be taken now, if he hasn’t already done so. Take care, and God bless! sistersoldier \\nIf it is any comfort the people of Noah’s day laughed at him as well and disbelieving asked, “Why are you building a boat on dry land?” Gay Veteran \\ngreat fiction Heinrich van Rooi \\nThere are only two things to take in consideration and that is Time and Patience …. These two are keys. The Smart has all these two to there arsenal. It is not a question of will it happen or not,,but all about timing. I’ll say September to December range… Jim Clark \\nHe is a fool for listening to you. Markets go down occasionally. 25% of years have double digit declines. But it always recovers and market timing is very difficult. Have a diversified portfolio and ignore the chicken little brigade. DigitalThumb \\nYeap, I have learned to keep such information to myself, co-workers just don’t get it at all. Sheep to the slaughter they all think the economy is fine; buying news cars loading up with more debt. The youngsters are the worst totally blindsided. Mondobeyondo \\nTaking a blind eye on the whole matter…. (i.e. don’t know who Soros is, blah blah etc) \\nI would say yes. Perhaps (key word) he doesn’t know what the rest of us know. Or he does know and he is positioning us for…. well… Mike Smithy \\nSoros is one of the most evil SOB’s on the planet and a lifelong member of the inside track club. Diggin the Dirt \\nThis is all an orchestrated ruse, to keep the average joe out of the markets. All the while, these guys are BUYING while you just sit back and watch the markets go UP. The last two weeks I’ve seen sharp reversals higher with the markets on every dip. Today was no exception. df NJ \\nPump and dump, dump and pump, and the beat goes on… Dave \\nYou have quotesd soros stuff before. You have used lots.of other experts. Same old same just months and months later. Its so rigged it WULL GO OM FOREVER! GSOB \\nOn Dec 20, 1998, on 60 Minutes did Steve Kroft interview George \\nSoros where Soros, a Hungarian Jew, admitted collaborating with the Nazi’s \\nas a teenager and stated: “…I had no sense of guilt.” GSOB Robert \\nJust got a warning email from Wells Fargo two days ago. \\nStocks way overpriced. Fed has no clue. Wall Street bankers liars. Anyone really believes their stories? \\nLook around your own towns and cities. I see more closed stores than ever. Real estate is clogged with for sale houses. Car lots are full with few buyers. Restaurants are not that busy during their busy times. Theaters have a handful of people in them. Walmart grocery section busy but other areas almost no one shopping. Childcare fees are horrendous. Food prices are rising. People laid off from work. I do not need Soros to know the economy is in bad shape. People who say they are doing well may in fact be truthful but millions of people are already enduring collapse. JC Teecher \\nWe ain’t seen nuthin’ yet. Wait until oil goes back to 100 petro dollars a bbl. \\nLast time oil went up high they raised the price/cost of everything. When it came down, those prices/costs stayed put. It will happen again, and the poor and lower middle class will suffer greatly…unless the great providers of the nwo, increase ebt. goldminer \\nSorros still has lots and lots of money invested in the stock market. He simply took some out and moved it around to invest in PMs where the real money is at right now. He is all about making money. The PM market is exploding! For the miners, Gold funds, and ETFs. All I can say it thanks George! your 250 million investment into ABX. Helped triple the investment I made last winter when their stock was at rock bottom. If you dont own some PM based investments or physical. Its not too late. The fuse is lit. Silver is still real cheap. Get prepared. JC Teecher \\nIt’s easy to take big gambles with investments when you are sitting on a net worth of 25 billion. \\nWhat’s a few billion here and a few billion there. Liberty First \\nYes, I got out of gld myself for ABX and some other miners. messtime \\nI know nothing about the precious metals market, but it seems there are a lot of people buying into it in some form or fashion. What i wonder about is that PM do not seem to be supported very much in the world: Meaning what are there? A small amount of buyers & sellers? What does a person do who wants to buy gold? Go to their local stamp & coin collectors store, pawn shop, or maybe order from some business online? It seems to me that if the banks and other financial institutions bought and sold gold coins & bullion, it would be part of the monetary system – i am talking about over-the-counter purchases & sales, or exchanges for paper money. Theoretically if the two businesses in some town went out of business you would have to find another broker in some other town to liquidate your gold coins or whatever you have in the form of gold. Nobody wants gold – just specialty buyers & sellers and that is during relatively stable times. In a large worldwide financial collapse with maybe PM merchants out of business then who is going to buy your PM? I do not think that PM are given the respect that they need in order to be a viable source of security. When i was in Vietnam the people there were always converting cash into gold & it probably worked for them well – but i do not think it was to make a profit but to protect their savings in case they were unable to trade their currency or if the north vietnamese over-ran the country they would be able to buy the new national currency. It is just something i wonder about. Not trying to start an argument. moulesnfrites \\nThe Greeks who held physical gold and silver and FIAT currency outside of the banking system are doing much better than those Greeks who can only access sixty euros a day, for the past two years. I am sure the same applies to the Venezuelans and Argentinians currently. \\nOnly a fool trusts government and banks. Take responsibility and choose the red pill. \\nA lot of the Jews who escaped Europe in the late 1930s only got past the border guards because of gold and silver. Thousands of years of history with gold and silver compared with about fifty years maximum for any FIAT currency. All FIAT currencies in history have failed. Diggin the Dirt \\n1 TRILLION in credit card debt in this country now, as reported today. Incredible. The bankers are cleaning up everywhere. df NJ \\nPeople are addicted to consumerism like heroin. It’s not all the bank’s fault. I think people are equally responsible for their misery. Although, having any government at all enforce banking laws would be a huge plus for the zeitgeist of our union. Priszilla \\nYou get rich be selling things other people consume. Perishable and single use goods are best. Festival Tickets, cut flowers, toner, ammo and the like. Frankie \\nYes, I have to agree. People ARE responsible for their own misery. Thes people who have borrowed beyond their means ABSOLUTELY KNOW IT yet they continue to do it. I have no sympathy for that mindset!! They will suffer the greatest. Bob332 \\nWait until that bubble burst’s . They’ll be eating their credit cards. Frankie \\nToo true. Frankie \\nThey think they are, but sooner or later they will fall over. Nothing has “no end” This will come to an end, reality dictates that they will NEVER recover this debt, they have let it become too big due to their avarice and yes they will be “eating their own credit cards” You can not get blood out of a stone, just as you can not get money out of people if they simply do not have it. Sweet T \\nWho better to time the market collapse than the interim antichrist. fuallofyou \\nI am sure Soros is reading your blog you dumb @ss. You made my day, doom and gloom preacher. By the way check expiry dates on your cellar prep food xoxoxoxoxox. df NJ \\nI knew this guy in 1990 who had a cellar full of freezed dried food, 200 gallons of diesel, etc. I ask him how long the food would last in the packages before it would expire. He said 20 years. I’ve always wondered if he was eating a couple of years worth of freezed dried food leading up to 2010. Fubeatdown \\nYawn. Gfy. We’re gonna smash you frickin teeth into dust, jack@ss. Can’t wait. fuallofyou \\nI went incognito just to make this name to respond to your name. I did think your comment was funny. Sincerely A.T. Steeve Girard \\nWhat is catastrophic is not the state of Europe before and after Brexit… it’s the process and uncertainty between the two, that is when the damage is done. Preacher62 \\n“We can’t change what is happening to the economy, but we do have control over the choices that we make. So I urge you to please make your choices wisely.” Deut. 30:19 I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live: Repent and believe the Gospel and you will no longer need to fear the destruction that is ordained for this world and all who belong to it. df NJ \\nWe must have faith God will continue to provide us a life full of blessings. Faith in God’s love is all we need. GSOB \\nThere are distinctions of a believer of Christ and a disciple of Christ. James 2:19 Orac4Prez \\nAll you nasty people loosing jobs! Get back out there and due you patriotic duty and earn some more taxes. Isn’t that why you voted for Pres Obama! (/sarcasm) df NJ \\nIt’s too bad President Chimp did such a bad job when he was in office. The economy was losing 800,000 jobs per month leading up to the 2008 election. If Chimp-boy did not screw the pooch the black guy would never have been president in the first place! ALWAYSTOMORROW \\n“President Chimp” Nice job df NJ. Some racist remarks should draw us closer. df NJ \\nPresident Chimp was a reference to the George W “the boy wonder” Bush. Not the black guy. ALWAYSTOMORROW \\nSorry. I’ll remove my comment. df NJ \\nLeave it. Whether are you are on the right or the left, nothing will change as long as the corporations control our government. I hope Trump get’s elected. Then maybe America can finally get the fascism-corporatism out of the way and we can return to public policies more favorable to labor and restore sanity. \\nI sure wish Obama never got elected. Priszilla \\nThe state is the power organ of the ruling class. They need the state to solidify their rule. \\nYou can’t go against either of them. Not as citizens and not as president. You can only deny them influence by removing yourself from their reach. Guest \\nWho says he was “elected”? Orac4Prez \\nI cant deny that. I still say that the government has no idea about the economy. Too many economists who have never made anything! And the new high tech companies only use other peoples talents and produce very few jobs compared to their capitalisation (Facebook and twitter etc) don’t have many employees compared to say GE or Microsoft) Plus the older companies providing good jobs providing services to them. Plent of services now but now one can afford them. jaxon64 \\nGoiter-faced, slurping neo-con McCain never had a chance to win the 2008/2009 election. America was sick of war mongers like him regardless of what the economy was doing. No, the true powers that run the country had already decided for either Obama or Hillary to be the next ruse in line. Ultimately they told Hitlery that she would have to wait her turn–now they are incensed because someone is running who is not part of their machine and they didn’t give him permission to run for president. JC Teecher \\nole sidearms is pure nwo establishment, just like Lindsay Graham. They are pro war, pro industrialized war complex…aka anti conservative and anti God. JC Teecher \\nLatest article: \\nU.S. Senator Lindsey Graham attends Bilderberg conference in Germany likely in violation of the Logan Act ALWAYSTOMORROW \\nMichael, I was glad to read your comment that “We can’t change what is happening to the economy, but we do have control over the choices that we make.” \\nI agree with you 100%. df NJ \\nThe corporations control our government. There will be no public policies improving conditions for labor. The corporations will not allow it. Bill G Wilminton NC \\nVote Trump he will bring the manufacturing base back to The USA…….we have lost millions and millions of manufacturing jobs…and we lost all the support businesses that locate by the factories, these are typically machine shops, fab shops etc etc etc. Robert \\nNot going to happen. Too late to bring jobs back in manufacturing. The future is robotics. Rotten situation. Trump cannot change things in regard to jobs. Corporations have no reason to come back to American shores. How would he do it? Talk nice to them? Joltin Joe \\nDrop corporate tax rate to 0 df NJ \\nIt’s already zero with all the tax breaks in the law. Bill G Wilminton NC \\nStart with section 8 Factories in special manufacturing zones !….Forget section 8 houses….then the people work and pay their own rent or buy a house. \\nJoltin Joe says 0 corporate tax rate… \\nImport tariffs……… \\nCreate so much manufacturing that there is always a HELP WANTED sign on every building…..that automatically will raise the payscale. someonewhogrewupinsnow \\nonly way corporations return is a half way decent tax rate like other countries at around 15%. and rob is right ….here come the robots!! algol2000 \\nCompanies will not return because of all the nonsense diversity laws. Companies succeed by hiring the best, not through quotas. K2 \\nWhat are those pl elaborate algol2000 \\nDiversity= spend hard earned resources looking for and hiring women, negros, homosexuals even though they were not the best-in-class. It sends a message to the population that meritocracy is dead, and all they have to do is look pretty. Don’t get me wrong, I am negro. K2 \\nThose laws have already been passed? gardeauxandrew \\nThe lowering of standards to pacify sure dumbs down Everyone in America and the world! mtntrek3 \\nI wish decent paying jobs would return, but…… . How to get past corporate greed. Push our wage scales down equal to cheap slave labor costs? Ha,that’s the ticket. This crap going on is sheer greed and power plays. Neither side politically has any real interest in reversing this trend. Trump……… well the day he puts his money where his mouth is and quits indulging in cheap overseas labor to make his clothing line among other things ( which won’t happen because he’s a part of the problem) is the day I would start believing him. He’s a corporate weasel like so many others. He panders to the working class to get votes. Then he’ll start his “utopia” as the full fledged dictator he is. I don’t like many if any of the jerks in politics. He’s a jerk of another kind. He wins the grand prize. Bill G Wilminton NC \\nanti TPP (Trans Pacific Partnership) will propose Conserv to replace Scalia will rework Trade Deals Gatt Nafta Cafta will stop Muslim Immigration will send all Illegals Back will Build The Wall will try to bring manufacturing jobs back will have the boys shower with the boys will have the girls shower with the girls will have the men pee in the mens room will have the girls pee in the ladies room \\nYUP TRUMP WINS THE GRAND PRIZE Gay Veteran \\nyou mean Scalia who gave us Citizens United and an oligarchy gardeauxandrew \\nHow do you know what Trump can do as President? You moron Americans were duped by the medias and Obama and look what he is doing making America the laughing stock of the world, weakening the military ,making America easy for terrorist attacks and making them untouchable like him because of the moron American who are coward to the race ,gay and now transgender cards and afraid to be offended, Americans stop Washington d.c. corruption and the medias and blind patriotism to a now more than ever corrupt Washington d.c. and the false mindset thant anything is too big to fail or fight . there are more taxpayers than corrupt politicians! Gay Veteran \\nwell we sure are paying a LOT for the bloated Pentagon Bill G Wilminton NC \\nRobert… Trump can do anything with the HELP of God…… \\nHad a guy like you once on my high school football team, he spoke just like you, rotten situation, other team too big, we cannot beat them, we will never win…..we locked him in one of the lockers and went out and WON. \\nYou need to see the inside of a locker and WE NEED TO PRAY…. \\nShalom df NJ \\nI agree. If Trump brings back manufacturing he will become one of the most successful presidents in our history. I will vote for Trump over Hillary. I can’t stand her Nixon Republican policies and her graft to the Clinton foundation. Frankie \\nShe be THE most dangerous woman on the planet. I URGE all Americans to vote Donald Trump. ITSNOTWhatchaThink Bill G Wilminton NC \\nHillary The Benghazi Murderer !. \\n“What difference does it make now” says it all !. Hillary statement at Benghazi hearing about the 4 dead marines and ambassador Stevens. \\nScum like this should be in a cell…. \\nHillary belongs in one house “The Jail House” Frankie \\nVOTE TRUMP, DUMP THE HUMP HILLARY! ITSNOTWhatchaThink \\nDUMP TRUMP YOU CHUMP!! Mr. Jameson \\nYou’re a CHUMP if you think Hitlery will do ANYTHING other than screw our country up worse. I am SO sick and tired of you libtard idiots who think Killary is great. You deserve the oven in your future if you vote for her. FOOL. BIG TEXAN \\nFlower dude—-If you love your country your vote for Hildabeast will end the USA and you and yours will be hauled off to be murdered in a FEMA camp Bill G Wilminton NC \\nYUP vote Trump put the BENGHAZI MURDERER in Jail. ITSNOTWhatchaThink \\n“House Republicans asserted the State Department knew immediately that the Benghazi attack was linked to a terrorist group and said there were 600 requests for additional security at the Benghazi compound. Mrs. Clinton said some of those requests were fulfilled, though most of those messages didn’t rise to her level and were handled by the department’s security professionals.” Hillary didn’t murder anyone. She could only know as much as she was informed. Bill G Wilminton NC \\nThere were special forces in Sicily and they could have been in Benghazi in 4 hours….the buck stops at the Secretary of State……Hillary might as well have shot that mortar on the Marines on that roof….. \\nHillary is The Benghazi Murderer…. \\nVOTE TRUMP put Hillary in the Jail House not the White House. Gay Veteran \\nvote for Killary and vote for more war, possible with Russia Bill G Wilminton NC \\nWell said……it is duly noted that we are pushing in on Russia from all sides… NATO foremost…..but Russia is pecking back as in Jet fighters close flyovers of our naval ships. \\nIts like the Russians are saying to us ” are you people nuts are you gonna force us to strike first ” but the american people are numb to reality. \\nVOTE TRUMP he is a natural leader !!. ITSNOTWhatchaThink \\nHillary will win! Yeah! 😀 ITSNOTWhatchaThink \\nYou’re ridiculous. All Donald knows how to do is flip property, bankrupt businesses & spout his mouth. Frankie \\nlmao Frankie \\nAnd all your Hillary knows how to do is lie, cheat, scam the American people, illegally use private email for Government work, support terrorist groups, fund wars, supply arms, take $$$millions from large Corporations for “favours”, assist your President to engage in illegal wars with dubious allies, not to mention the very questionable Clinton Foundation. Oh and let’s not forget the Benghazi Murderer tag. Bahahahaaa yep, I’M the ridiculous one alright. Frankie \\nAnd all Killer Clunton knows is how to keep America at war. Duh ITSNOTWhatchaThink \\nHillary will win.. Hillary 2016! 😀 Bill G Wilminton NC \\nVote Trump he will put the BENGHAZI MURDERER in Jail. ITSNOTWhatchaThink \\nOldManBill, you just don’t take a hint Bill G Wilminton NC \\nTry using your credit card maybe you could buy some upvotes……you just don’t take a hint. ITSNOTWhatchaThink \\nI know I’m on the board of foolish lil boys. I don’t expect much. Bill G Wilminton NC \\nLike I have already said you are supporting a woman who wont even say the words ISLAMIC TERRORIST and she is running for president she should be told to step down . She is a disgrace. \\nThere are 50 sets of parents who would like to talk to hillary after the mothers of the 3 marines are finished with her…. \\nAfter Trumps speech tomorrow nite maybe you ( Snotnose ) will be elected FOOL OF THE YEAR on this blog site…. ITSNOTWhatchaThink \\nMedia/politicians don’t blurt things the way you want them. They wait until they have facts before they run their mouth. You want BIGMOUTH Trump? You’ll be sorry. Bill G Wilminton NC \\nTrump is the only one stating facts…..he has been telling everyone STOP the MUSLIMS from coming into OUR COUNTRY…. He has been saying this for months and months…… \\nHillary and the other scumbag obama cant even say ISLAMIC TERRORIST and obama calls ISIS ISIL…. The democratic party should demand that obama step down from the Presidency and Hillary should be replaced as the dem candidate. \\nVOTE TRUMP the only one stating the facts !. CASTIEL \\nIf she wins better prepare your bunker Trump could have defects but she is the devil….how she will solve the situation in Ukraine and Syria and South China without starting a ww3? Because things are escalating to the worse.. ITSNOTWhatchaThink \\nStay with your foreign politics, foreigner. Bill G Wilminton NC \\nEven the Foreigners Know that Hillary Belongs in Jail…… ITSNOTWhatchaThink \\nForeign minorities here will vote Hillary. Bill G Wilminton NC \\nLegal immigrants are tired of losing their jobs to ILLEGALS….so they are also voting for TRUMP. \\nVOTE TRUMP put the HAG in JAIL ! ITSNOTWhatchaThink \\nForget it Bill. You’re a sexist old chauvinist, but don’t condemn the country to a bombastic fool who has never governed. Bill G Wilminton NC \\nHillary is THE FOOL… she and the other scumbag “obama” wont even say ISLAMIC TERRORIST….well Omar ” the Muslim ” the Orlando shooter claims ISIS connections. Omar knows he was a Muslim Terrorist the only one who doesnt know is HILLARY. \\nThe bombastic fool is Hillary and the mothers of those 3 marines would sure like to talk to hillary ” The Big Fat As*ed Fool” with the $15,000 jacket to cover that fat butt. \\nTomorro nite Trump has scheduled a speech and after that speech I wouldnt be surprised if You and Hillary and all you Hillary Fools arn’t run out of town on the brooms you flew in on…..whoosh cackle cackle cackle….good riddance ! CASTIEL \\nWhen ww3 begins no one will be foreigner…….tell your politics OBAMA and that slut Hillary if she wins to stay to the politics of their country instead of causing chaos around the world……idiot ITSNOTWhatchaThink \\nAsshole, Trump would be the soonest one to start ww3 CASTIEL \\nFrom what i read in the news….Trump is against the sanctions to Russia and want better relations with that country and Hillary said once that Iran should be nuked….nuked????So idiot you are going to do the same mistake when you voted OBAMA? a wolf dressed as a sheep. ITSNOTWhatchaThink \\nTrump is a political NOBODY. He has never done a political thing in his life other than run for president. You’re EFFIN STUPID CASTIEL \\nPolitical things? society dont need politicals but real leaders…..so you want someone who have experience in steal and lie to the people? you are really dumb….Like those German idiots who voted Merkel that defend the invasion of these muslims….you are going to vote for hillary because she is the first women with chances for the Presidency …like you voted in Obama because he was the first black in the white house….thinking that will cause any change….your stupidity have no limits. ITSNOTWhatchaThink \\nYou and the lil boys don’t like her, but she’s a proven effective leader w/realms of knowledge on political workings far beyond Trump. Stop being a moron. CASTIEL \\nShe is a warmonger…she will start a ww3…politicians dont know nothing about war…they think its just a game to gain some money until the day they encounter a strongh opponent..political knowledge is irrelevant….JFK was a great President not because of his political experience but yes by his beliefs thats why he was killed…Nowadays they are all pupets and corrupt…dont you understand? its irrelevant….. Bill G Wilminton NC \\nHILLARY the MURDERER needs to be in a JAIL HOUSE not the White House !. \\n“What difference does it make now” says Hillary about the three dead Marines and Ambassador Stevens at BENGHAZI. \\nHILLARY FOR JAILHOUSE 2016 !. ITSNOTWhatchaThink \\n“House Republicans assert the State Department knew immediately that the Benghazi attack was linked to a terrorist group and said there were 600 requests for additional security at the Benghazi compound. Mrs. Clinton said some of those requests were fulfilled, though most of those messages didn’t rise to her level and were handled by the department’s security professionals.” Hillary didn’t murder anyone. She could only know as much as she was informed. Bill G Wilminton NC \\nBENGHAZI MURDERER belongs in Jail House not White House. BIG TEXAN \\nYour vote for Hildabeast will result in you and your family dead in a FEMA camp!!!! If your side wins you will end at the hand of the Gov you voted for —poetic justice ITSNOTWhatchaThink \\nTrump has no government experience. He succeeded by bankrupting companies. Bill G Wilminton NC \\nVOTE TRUMP he has NO GOVERNMENT experience !. sistersoldier \\nYou know who else has no previous government experience? Governor Bruce Rauner of Illinois. That is working out great! (facetious). However I do not support Hillary either I think America needs a leader and not a repeater. ITSNOTWhatchaThink \\nHillary will win! 😀 She may not be popular on this board, but the type that habitates this board is happily a minority. Bill G Wilminton NC \\nYUP she is not popular on this board and not popular with the mothers of the three Marines she left to DIE on that roof. \\nPUT THE BENGHAZI MURDERER IN JAIL !. ITSNOTWhatchaThink \\n“House Republicans asserted the State Department knew immediately that the Benghazi attack was linked to a terrorist group and said there were 600 requests for additional security at the Benghazi compound. Mrs. Clinton said some of those requests were fulfilled, though most of those messages didn’t rise to her level and were handled by the department’s security professionals.” Hillary didn’t murder anyone. She could only know as much as she was informed. Frankie \\nShe’s far from popular outside of America…MURDERESS!!! ITSNOTWhatchaThink \\nHow much prior political experience does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! He talks the talk, but never walked the walk. But hey.. it’s only THE PRESIDENCY! Maybe next we’ll grab people off the street w/no medical training to do surgery! \\nNeither did Ulysses Grant or Dwight Eisenhower have a prior politcal position, though both had a strong military background. Dwight being ” The Supreme Commander of Allied Forces in World War II” and Grant “Commanding General of the United States Army” How much military background does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! \\n“no major U.S. company has filed for Chapter 11 more than Trump’s casino empire in the last 30 years.” He has filed four business bankruptcies. Maybe he thinks it’s just as easy to file bankruptcy w/the entire government and walk away. Bill G Wilminton NC \\nVOTE TRUMP….He is not a TRAITOR POLITICIAN !. \\nPOLITICIANS put us 20 trillion in DEBT !. gfmucci \\nAnd “political experience” is good how? WeRThrough \\nPlease tell us what “experience” the current monkey in power had? Oh and while you are at it, please list his accomplishments besides the implosion of this country. RedSky \\nJust one thing, how can you bring manufacturing back when the demand globally has fallen off the charts? This is not just a problem here, it is everywhere on the planet. Trump does have a better handle on what is going on for sure but I doubt he will be able to fix it but anything is better than “Billary” where we will see more war on innocent people. autofixer \\nJust a note. Manufacturing IS returning to the U.S., it has been. The problem is that it is returning to automated (robotic) factories. It turns out Mexicans and Chinese are cheaper than North Americans, yet robots are even cheaper than Mexicans or Chinese. Bill G Wilminton NC \\nAutofixer Good point…. but there are still manufacturing operations with water fountains for people…..take Carrier Airconditioner who employed 1400 people…. they just recently up and moved to Mexico along with Nabisco and Ford…. \\nTrump as a kick butt leader will figure a way to claw them back plus thousands more…….that is what ya get as a businessman as President vs some corrupt Polititical hack loser like Hillary. \\nVote Trump ITSNOTWhatchaThink \\nTo show you what a DIMWIT NAIVE LIL RICH BOY Trump is.. “Donald Trump says Orlando victims could have saved themselves if they were armed” Omar was armed with AR-15 type assault gun which fires 30 rounds a minute. Could you imagine being close enough in a crowded chaotic dance bar to take him out within 2 minutes? That’s your IDIOT BOY talking!!! Bill G Wilminton NC \\nTrump is the only candidate who spoke about stopping the Muslim immigration !. Hillary wants a 500 % increase in Muslim immigration. \\nAnd being armed is becoming a NECESSITY… going to a drinking/dancing establishment is not !. Niteclubs are just bars and it is not permissible to bring a weapon so the muslim freak goes to a GUN FREE ZONE. \\nHillary for the first time today used the words “Islamic Terrorism”….obama still has not used this term. Hillary and obama blame the attack on GUNS. \\nVOTE TRUMP and keep your guns oiled, loaded and ready and remember Hillary wants your guns and wants Muslim immigration increased. gfmucci'"}, "time": 1742562134.9713075}