{"duration": 0.03890252113342285, "input_args": {"text": "'Fox News executive chairman Rupert Murdoch will host a   meeting Wednesday amid internal turmoil at the network and threats to its ratings dominance from MSNBC. [According to Deadline, Murdoch is set to host two meetings at the network’s new studio, Studio F, where he will discuss both the company’s plans for a new newsroom and its overall direction and future. The meetings will reportedly be held in two shifts to accommodate all staff.  The meetings come as the network has been rocked by a series of sexual harassment and racial discrimination lawsuits in recent months, culminating in last month’s departure of star anchor and   cable news ratings king Bill O’Reilly. Following O’Reilly’s departure, the network’s primetime schedule underwent perhaps its most significant reshuffling  in years, with Tucker Carlson taking over O’Reilly’s 8 p. m. time slot and the panel show The Five moving to 9 p. m. But the network faces an early test of its new lineup from MSNBC, which has benefitted greatly from star anchor Rachel Maddow and its lineup’s breathless coverage of the Trump administration. Last week, MSNBC won the key demo ( ) during weeknights for the first time in seven years, with The Rachel Maddow Show, The Last Word with Lawrence O’Donnell and The 11th Hour with Brian Williams all finishing first in their respective time slots, according to Adweek. Fox News finished first in total viewership, with an average 2. 6 million viewers, but MSNBC was right on its heels with 2. 4 million. CNN lagged far behind with 1. 3 million. It was the 19th straight week that Fox News led all competitors in total viewers. But the network’s hold on total viewership could soon be in jeopardy as well. On Monday, MSNBC came within two thousand viewers of surpassing Fox News in that category, and Fox slipped to third in the news demo with 499, 000 viewers to CNN’s 608, 000 and MSNBC’s 662, 000. Murdoch’s Wednesdays meetings are reportedly meant to “rally the troops” in the face of the challenges. Meanwhile, the network’s former talent is moving on. On Monday, Bill O’Reilly announced he would be a guest on radio host and the Blaze founder Glenn Beck’s program on Fridays. Update: Fox News was the   cable network in total day viewership for the 19th consecutive week, according to Nielsen data. “In primetime, FNC also ranked #1 in all of basic cable with P2+ including NBA   TNT, with 2. 3 million viewers,” the network noted in a Tuesday email to reporters.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562634.4458501}