{"duration": 0.07356429100036621, "input_args": {"text": "'Americans preparing for strong possibility of violence on Election Day Are you worried about violence on Election Day? By Vic Bishop - October 28, 2016 \\nWith the U.S. presidential elections just around the corner, concerns about violence on Election Day seem to be escalating. Several schools have announced that they will not hold classes when the polls are open due to fears of potential violence. According to a recent survey of voters, “A 51% majority of likely voters express at least some concern about the possibility of violence on Election Day; one in five are ‘very concerned.’” \\nVoters have been very obsessive in what’s been an emotional presidential election year. It is possible that supporters of the winning party make a public display showing off their victory to emphasize the painful fact that the other candidate has lost. Will they become easy targets? Whoever has lost may question the validity of the election and accuse of opposing side of manipulating the results. If it comes to this, should we expect civil unrest? It may be smart to stock up on a few days of extra food and water , so you can just hole up at home if need be. \\nMore details from the aforementioned survey can be found here . Election Year Has Been Filled With Political Hostilities \\nIt’s no surprise people are apprehensive about Election Day. Voters in the U.S. have been passionately divided when it comes to the candidates. Many are fervent to keep the worse of two evils out of office. Decisions seem to be driven more by animosity towards one candidate, rather than by inspiration or vision offered by the other. \\nRegardless if the voter survey offers an accurate representation of how Americans truly feel, we cannot deny that political discord has already incited violence in communities across the States. A summary here offers just a glimpse at the various incidents that have occurred during the year. Take a look below at the reception a man wearing a Trump hat received when attending a Clinton rally. \\nViolence isn’t exclusive to Clinton supporters. Two videos below show how Trump supporters respond to unwelcome demonstration by their opposition. \\nWith so much hatred and hostility surrounding the election, one can reasonably expect a violent, or at least unpleasant, conclusion. And any aggression will likely be exacerbated by the news media, which will make matters worse. Confidence In The Election Process Falters \\nIn addition to the looming question of who will be named president, another big unknown is how will U.S. citizens react? Will they accept the results of the election ? As per the previous mentioned voter survey, it seems that the confidence Americans once had in their election process is definitely floundering. Three of four say they have confidence that the United States will have the peaceful transfer of power that has marked American democracy for more than 200 years, but just 40% say they are “very confident” about that. More than four in 10 of Trump supporters say they won’t recognize the legitimacy of Clinton as president, if she prevails, because they say she wouldn’t have won fair and square. More than two-thirds of Trump voters say they worry the election returns could be manipulated. In contrast, eight in 10 of Clinton voters say the returns can be trusted to be fair and accurate. ( source ) Best Course is to Stay Prepared \\nThe drama of the election year will likely continue after November 8. It is reasonable to expect that some communities will experience civil unrest, particularly where divisions are strong. It only makes sense to prepare, at least at the basic level, with a week’s worth of storable food and water available in your home. It might also be smart to stock up your bug-out bag . Of course, some may feel the need to be a bit more aggressive with their preparedness plans: “Since the polls are starting to shift quite a bit towards Hillary Clinton, I’ve been buying a lot more ammunition,” says Rick Darling, 69, an engineer from Harrison Township, in Michigan’s Detroit suburbs. In a follow-up phone interview after being surveyed, the Trump supporter said he fears progressives will want to “declare martial law and take our guns away” after the election. ( source ) \\nAre you worried about violence on Election Day? Do you have a preparedness plan in place in case of civil unrest? Please share your views in the comments section below. Via Activist Post Featured Image: Jamelle Bouie/Flickr'"}, "time": 1742562345.6638143}