{"duration": 0.04751276969909668, "input_args": {"text": "'SCRANTON, Pa.  —   Scranton is Hillary Clinton country, where she spent childhood summers. And Scranton is Joseph R. Biden Jr. country, the city of his birth and boyhood. Now Donald J. Trump wants to make Scranton his country, too. He is hoping to make deep inroads in a Democratic stronghold with an   trade,   message, which across the Rust Belt has energized the   voters who represent his best prospect of taking up residence in the White House. Hours before Mr. Biden addressed the Democratic National Convention in Philadelphia, Mr. Trump pulled a bit of campaign mischief on Wednesday by swooping into Scranton and dismissing Mrs. Clinton’s chances of winning Pennsylvania. “I can’t believe she has many fans here,” he said of Mrs. Clinton in the city where her father was born and where she spent summers in a family cottage on Lake Winola. Echoing his promises to bring back Appalachian coal mining, Mr. Trump told a large audience in a college gym in northeastern Pennsylvania, where coal peaked in 1917 and largely died out in the 1950s, “Hang in there, we’re going to put you back to work. ” His larger promise to restore   jobs by tearing up the North American Free Trade Agreement and other trade deals drew cheers. “We haven’t gotten a new job in this city for the last 20 years,” said Fred Joseph, 66, a retired sales manager at a cardboard plant, who was among those who heard Mr. Trump on Wednesday. “If he gets these renegotiations with these Naftas, we can start bringing back industries and make televisions, we can make refrigerators. I saw them leave. Why won’t they come back?” Mr. Trump’s visit came a day after a former Democratic governor of Pennsylvania, Edward G. Rendell, said the Republican nominee’s trade message “resonates” with the state’s voters. “I think Trump has a very good chance here,” said Mike Fedorka, 60, a former Democratic City Council member in Dickson City, just north of Scranton. Unlike 2012, when President Obama and Mitt Romney all but ignored Pennsylvania in the expectation that it would vote Democratic, this year it is a   battleground, with the Clinton campaign and its allies building a robust field staff and saturating the television airwaves with ads. Mrs. Clinton and her running mate, Senator Tim Kaine of Virginia, will hit the Pennsylvania Turnpike for a bus trip on Friday, the day after the Democratic convention concludes. They plan to visit Scranton on Aug. 15. To win the 20 electoral votes of Pennsylvania, among the richest of the swing states in the   and upper Midwest, Mr. Trump must assemble the pieces of a complex puzzle. Democrats have won six straight victories in Pennsylvania in presidential elections. To reverse that trend, Mr. Trump must win white   voters in rural counties and small cities like Scranton, hope for low   turnout in Philadelphia and Pittsburgh, and hold Mrs. Clinton to a rough parity in the increasingly diverse Philadelphia suburbs. With polls showing Mr. Trump underperforming among   white voters, especially women, he has to improve on Mr. Romney’s 2012 performance among the white working class, which he won by 14 percentage points in Pennsylvania. There is plenty of room for growth: Mr. Romney won these voters nationally by an even larger margin, 22 percentage points. G. Terry Madonna, a pollster and political scientist at Franklin  Marshall College, estimated that to win Pennsylvania, Mr. Trump would need a boost of six percentage points over Mr. Romney’s total among white   voters. Scranton and surrounding Lackawanna County is a good place to measure his progress, because of voters’ long history as loyal Democrats. It was Mr. Obama’s best county in the state in 2012 after Philadelphia  —   in part because of the Biden and Clinton connections. With the   work force eroding  —   plants making vinyl records, televisions and body armor have closed, some of them before the enactment of trade deals  —   Scranton’s population has declined 25 percent since 1970. “People who’ve lived here their entire lives think things aren’t as good as they used to be, so there’s a significant number of people Trump can tap into based on ‘make America great again,’ ” said Michael Allison, a political scientist at the University of Scranton. One of those voters, George Colburn, 74, runs a business making machine parts in the Scranton borough of Old Forge. “The thing I like about Trump is he wants to go out there and bring this country back to a   country,” said Mr. Colburn, who was having dinner on Tuesday night at the bar at Arcaro  Genell, one of a   locally celebrated restaurants in Old Forge that make square pizza sold by the “cut. ” Local lore has it that while campaigning here in 2008, Mrs. Clinton was turned away by the restaurant’s conservative owners and ended up in a booth at Revello’s, a place across the street. Two retired math teachers at the Arcaro  Genell bar, Arthur Clark and Len Pesotini, said they would vote for Mrs. Clinton. “I still have my two main organs, my brain and my heart, so I’m a Democrat,” Mr. Clark said. Mrs. Clinton cannot afford to take the area for granted. Republicans point to the 3, 000 Democrats in Lackawanna County who switched their voter registrations to Republican, compared with about 500 Republicans who went the other way. And Mrs. Clinton won 47 percent fewer votes in the county in the April primary than she did in 2008. Still, Mrs. Clinton won more votes in Lackawanna County’s primary this year than Mr. Trump. “Donald Trump can say his path to victory runs through Pennsylvania, but we’re going to fight him tooth and nail,” said Preston Maddock, the state Democratic Party spokesman. “Maybe he’s drawing more white   votes, but his hateful message is also bringing out a lot of the same coalition that elected Obama. ” Delegates waved “Scranton” signs on Wednesday night in Philadelphia as Mr. Biden spoke dismissively of Mr. Trump. “He’s trying to tell us he cares about the middle class?” Mr. Biden asked. “Give me a break. ” In Scranton, Mr. Trump at times seemed to belittle his audience. Defending his call for NATO countries to pay more of the cost of the alliance, he said, “We’re protecting countries that most of the people in this room have never heard of, and we’ll end up in World War III. ” One of those in the audience, George Boyce, 70, said he was glad to have several more months to make up his mind. A retired Teamster, he said the book warehouse where he had worked left for Indiana because it could pay nonunion wages. But he was not convinced that the Democratic ticket would be better for union workers. “I don’t believe that,” he said. Mr. Joseph, the retired sales manager, said his son graduated from college with a chemical engineering degree but still faced difficulty finding work. “He didn’t have one place to apply for a job around here,” he said. “That broke my heart. ”'"}, "time": 1742628550.0151315}