{"duration": 0.0500946044921875, "input_args": {"text": "'BEIJING  —   When President Xi Jinping of China meets foreign leaders, he tends to recite talking points in a dutiful monotone, diplomats say. But when challenges to China’s sovereignty come up  —   like protests in Hong Kong  —   he roars to life. “He read flatly from the script,” one Western official said of such a meeting. “But when it got to China’s core interests, these disputes, he put down his notes and spoke passionately. ” For anyone puzzling over why China reacted so swiftly and severely to block two   politicians from taking their seats in Hong Kong’s legislature, Mr. Xi’s expansive idea of sovereignty is a good place to start. “He lets you know that this is what really matters,” said the Western official, who spoke on the condition of anonymity to describe a   meeting with Mr. Xi. China’s Communist   National People’s Congress stepped in on Monday and effectively barred the two from taking office, saying they had slurred Beijing in their oath of office. The politicians, Sixtus Leung and Yau   were elected to the Hong Kong Legislative Council in September on a   platform. In taking their oaths last month, they substituted a word for China that is widely seen as derogatory, and Ms. Yau added a common obscenity. There were other, less draconian ways to resolve the impasse. Mr. Leung, known as Baggio, and Ms. Yau, for instance, agreed to retake their oaths properly. The president of the council said it should decide its own affairs. Even Hong Kong’s chief executive, a loyal supporter of Beijing, was willing to leave the decision to Hong Kong’s judiciary. But that was not to be. “What could have been handled in a moderate fashion,” said Michael C. Davis, a former law professor in Hong Kong who is now a researcher in Washington, “became a constitutional crisis, affording Beijing an opportunity to advance its sovereignty agenda. ” Or as Richard C. Bush, a senior fellow at the Brookings Institution, put it, “Instead of ignoring independence and localist sentiment, which Chinese leaders should have done, they shone a spotlight on” it. Beijing decided it had to respond strongly and to make an example of the wayward politicians. “Some people think there was no need to worry, that they could never win independence and their forces are too puny,” Zou Pingxue, a professor of law in Shenzhen, China, said by telephone. “But there was the dangerous tendency that the Hong Kong independence phenomenon could grow larger and spin out of control. ” A punitive response was in character for Mr. Xi, who has waged a blistering campaign against corruption that has jailed thousands of officials. Moreover, a tight grip on Hong Kong comports with his   job as the leader of national rejuvenation, which he sees as a   mission. Even before this   a string of actions since last year showed how Mr. Xi is willing to recast, override or ignore laws and conventions that stood in the way of what he sees as China’s powers over its territory and citizens, wherever they may be. Hong Kong booksellers peddling garish tales about China’s elite were snatched into the mainland. Chinese dissidents on the run were spirited back to their homeland from Thailand, despite United Nations protection as refugees. Beijing has not recognized an international tribunal’s rejection of its claims over much of the South China Sea, although it signed the treaty behind the decision. Covert squads abroad have induced absconding officials to return to China from the United States and other states that have no extradition agreements with Beijing. Beijing has a stronger legal argument for its intervention in Hong Kong, over which it has sovereignty. But under the agreement that returned Hong Kong to China from Britain in 1997, Beijing agreed to allow Hong Kong to maintain its separate system for 50 years. Beijing has long treated Hong Kong as a worrisome bridgehead that allows politically toxic ideas, books and people to seep into the adjoining mainland. But until Mr. Xi took office, China’s leaders were less inclined to intervene in the city, which has its legal autonomy and freedoms enshrined in a   known as the Basic Law. That reluctance has evaporated over the last two years. In 2014, Mr. Xi’s government issued a policy paper on Hong Kong that rattled many in the city who saw it as watering down their legal protections. Then an election plan for the city fell far short of competitive elections that many Hong Kong residents demanded, and protests erupted  that occupied streets in the city center for nearly three months. Those failed protests kindled Hong Kong’s small, youthful   movement. Most residents view their demands as unrealistic or undesirable. But in elections in September, activists gained a foothold in the Legislative Council, which skewed voting rules ensure is dominated by politicians loyal to Beijing. Lawyers disagree over whether Chinese legislators had the power to interpret the Basic Law that is supposed to guard the city’s legal autonomy. Even so, the move has unnerved many in Hong Kong, because it occurred before the city’s courts, with a tradition of independence rooted in common law, decided a case over whether the politicians could take their seats. “It intrudes upon an ongoing case before the courts in Hong Kong,” said Mr. Davis, the former law professor. “There is no doubt that it raises concern over both the integrity of the Hong Kong judicial system and Hong Kong’s high degree of autonomy. ” Now the Hong Kong courts must rule on the case in light of China’s interpretation, which says that even city lawmakers who take their oath of office correctly will “bear legal responsibility” if their sincerity is found lacking. Already, the decision has ignited street protests in Hong Kong, recalling the demonstrations of 2014. But defenders of China’s position said its leaders would not back down as they have done before. “Some people have said the People’s Congress should exercise   that we shouldn’t use powers to their utmost,” Li Fei, a deputy secretary general of the National People’s Congress Standing Committee, told reporters on Monday. “We say that the powers must be used. ”'"}, "time": 1742628427.1871095}