{"duration": 0.04555797576904297, "input_args": {"text": "'Mainstream media outlets in Britain such as the BBC and the Observer have falsely implied that   populist firebrand Geert Wilders made an attack on all Moroccan migrants in the Netherlands when he blasted foreign criminals, in headlines on their websites. [“There is a lot of Moroccan scum in Holland who make the streets unsafe” said Mr Wilders, who leads in the polls ahead of the March 15 parliamentary vote, to kick off his campaign on Saturday.  “And that should change” the Party for Freedom (PVV) figurehead said, emphasising that “not all are scum” as he attempted to take a stroll through a market. But despite Wilders making clear his remarks referred only to Moroccans who “make the streets unsafe” both the headline and first paragraph of the Observer’s report of the exchange make the claim that the   Prime Minister called all migrants from the North African country “scum”. Entitled “  leader Geert Wilders calls Moroccan migrants ‘scum’” the Observer article begins: ‘The Dutch populist leader Geert Wilders sparked outrage on Saturday when he launched his election campaign with a stinging attack on the country’s Moroccan population. The   MP called them “scum” and said he wanted to make the Netherlands “ours again’ It’s not revealed until the third paragraph, in which the   newspaper quotes the populist politician in full, that Mr Wilders specifically singled out criminal migrants in his speech. Sky’s coverage of Wilders’ remarks is similarly misleading. Under a headline which declares that “  Dutch MP Geert Wilders attacks ‘Moroccan scum’” Sky News uses the piece’s lede to tell readers: “The MP begins his election campaign by blaming the “Moroccan scum” for “making the streets of Holland unsafe. “Dutch MP Geert Wilders has launched his campaign for Holland’s top job with an attack on the country’s Moroccans” begins the article in a clear implication that the PVV figure attacked everyone living in Holland who hails from the North African nation. Britain’s public service broadcaster makes the same inference, its headline blaring: “Dutch populist Geert Wilders talks of Moroccan ‘scum’”. The populist politician, who has promised to shut mosques and bring an end to mass immigration from Muslim countries if elected, was speaking in his party’s   stronghold of Spijkenisse, just south of Rotterdam. “If you want to regain your country, if you want to make the Netherlands for the people of the Netherlands, your own home again, than you can only vote [for the PVV],” Wilders told supporters and the press. “Please, make the Netherlands ours again. ” De Volkskrant reported in 2013 that Moroccan criminals were convicted four times more than Dutch suspects. According to the country’s 2011 census, there were more than 167, 000   people in Holland, a figure that does not take into account second or   Moroccans. A report commissioned by the Dutch Ministry of Interior found that most of the Moroccan youth involved in criminal activities were born in Holland. According to the Gatestone Institute, 65 per cent all Moroccan male youths between the ages of and 12 and 23 have been detained by police at least once, with one third of this group having been detained five or more times. Mr. Wilder’s comments come as he rides high in the polls at the Netherlands approaches election day. Although other Dutch political parties have vowed to not enter into a coalition with Mr. Wilders’ Freedom Party, present polling suggests he should lead the largest party on March 16th, which may force others to soften their stance.'"}, "time": 1742562455.7219234}