{"duration": 0.07210922241210938, "input_args": {"text": "'MOSCOW  —   Russia on Friday denied that it had operated a   doping program at the Winter Olympics in Sochi in 2014, calling the allegations raised by a former lab chief “groundless. ” The accusations were made by Grigory Rodchenkov, the former director of the country’s antidoping laboratory, and were the subject of an article in The New York Times on Thursday. Dr. Rodchenkov, who said he had fled Russia out of fear for his life, controlled the laboratory that tested thousands of Olympians. He said he had created a special cocktail for Russian athletes and described an elaborate scheme by Russia’s intelligence agency, the F. S. B. to tamper with urine samples in the dead of night in Sochi to avoid detection. Dmitry S. Peskov, the spokesman for President Vladimir V. Putin, told reporters that the account was not supported by any evidence. “These allegations look absolutely groundless,” Mr. Peskov told Russian news agencies in a conference call. “They are not substantiated by any trustworthy data, they are not backed by any sort of documents. All this simply looks like slander by a turncoat. ” Dr. Rodchenkov said the doping involved some of Russia’s most famous winter Olympians and medal winners, including 14 members of its   ski team and two veteran bobsledders who won gold medals. Two of the athletes named, Alexander Zubkov, a bobsledder who at age 39 was one of the oldest Olympians ever to win gold, and Alexander Legkov, a   skier who won gold and silver, held a hastily convened news conference on Friday to deny the allegations. “I have always been absolutely clean,” Mr. Zubkov said at the hourlong session, broadcast live on state television. “I consider these allegations absolutely groundless. ” Mr. Legkov suggested that the charges were politically motivated. Based on previous allegations of doping in track and field, there have already been calls to bar Russian athletes from the Olympics in Rio de Janeiro this summer. Dr. Rodchenkov’s claims also promise to further complicate Russia’s efforts to refute other accusations of   doping made by a commission of the independent World   Agency. Mr. Legkov, one of the most famous athletes in Russia, said Dr. Rodchenkov’s allegation that the drugs were served up in alcohol to mask their presence was especially incredible, since Olympic athletes swore off drinking during their training. “That just sounds ridiculous,” he said, adding that perhaps Dr. Rodchenkov had been drinking too many of his own cocktails. Yuri Nagornykh, the deputy sports minister, who also appeared at the news conference, denied that Russia had ever had a   doping program. All state resources were concentrated on getting the Olympic athletes the best trainers and equipment possible, he said. “There’s no doping program in Russian sport, in the Russian Federation there was none and will be none,” he said. Mr. Nagornykh said that if there was any evidence to base an investigation on, Russia would certainly conduct one. But he said that Russia and the athletes named were weighing filing a defamation lawsuit against Mr. Rodchenkov and The Times. Since the report by the World   Agency, two colleagues of Dr. Rodchenkov’s, both former   officials of the state antidoping agency, have died under mysterious circumstances.'"}, "time": 1742563968.8394587}