{"duration": 0.1442551612854004, "input_args": {"text": "'WASHINGTON  —   Speaker Paul D. Ryan, the nation’s   Republican, on Tuesday called Donald J. Trump’s remarks about a Latino judge “racist,” an extraordinary indictment that generated a fresh wave of criticism and panic from other Republicans. By the end of the day, Mr. Trump was forced into a rare moment of damage control and said that his words had been “misconstrued. ” Mr. Trump, who said last week that a   judge in a case involving Trump University was biased against him because of his heritage, issued a statement Tuesday saying, “I do not feel that one’s heritage makes them incapable of being impartial. ” He added that he was simply questioning whether he was receiving a fair trial, but he did not apologize for his remarks, something many Republicans had urged him to do. Mr. Ryan said Mr. Trump’s criticism of the judge, Gonzalo P. Curiel of United States District Court, was “the textbook definition of a racist comment. ” But Mr. Ryan also reiterated his support for Mr. Trump, the presumptive Republican presidential nominee. “I disavow these comments  —   I regret those comments that he made,” Mr. Ryan said. “I think that should be absolutely disavowed. It’s absolutely unacceptable. But do I believe that Hillary Clinton is the answer? No, I do not. ” He added: “I believe that we have more common ground on the policy issues of the day and we have more likelihood of getting our policies enacted with him than with her. ” Republicans on Capitol Hill faced an increasingly difficult task  —   giving Mr. Trump their support while still keeping their distance from his inflammatory language. While many Republicans, like Mr. Ryan, continued to affirm their support for Mr. Trump, others appeared ready to abandon him, throwing the once stolid party further into disarray. “I cannot and will not support my party’s nominee for president,” said Senator Mark S. Kirk, Republican of Illinois, becoming the first Republican senator running for   to break with Mr. Trump. “After much consideration, I have concluded that Donald Trump has not demonstrated the temperament necessary to assume the greatest office in the world” or to control the nation’s nuclear arsenal. Mr. Kirk is perhaps the most vulnerable incumbent Republican, in a state where Mr. Trump is likely to be a drag on the ticket. Mr. Kirk, who still speaks with difficulty from a stroke in 2012, also noted that Mr. Trump has mocked a disabled reporter. Others were close to following Mr. Kirk. “If Donald remains Donald, I will not vote for him,” declared Senator Jeff Flake, Republican of Arizona, who echoed Mr. Ryan’s denunciation of Mr. Trump’s comments. In a victory speech in Westchester County on Tuesday night, Mr. Trump struck a measured tone, saying he understood the responsibility of carrying the mantle of the Republican Party. “I will never, ever let you down,” he said. But Mr. Trump’s more incendiary remarks in other arenas have left many congressional Republicans facing a painful dilemma. Those who are on the ballot defending the party’s majorities this year need Mr. Trump’s voters to win, and risk angering them with any full disavowal of the nominee. But to continue to embrace him as he openly injects race into the campaign poses its own dangers. Even Republicans who have praised his candidacy warned on Tuesday that the party may have to separate itself from its  . Senator Bob Corker, a Tennessee Republican who has met privately with Mr. Trump and been mentioned as a   choice, said “there could be” a line that the presumptive nominee crosses that would make him withdraw his support. “This is a crucial   or   period,” Mr. Corker said. “If at the end of June, moving into a convention and still not having pivoted toward being more of a general election candidate would prove to be very problematic. ” In private, the senators redirected their anger toward Senator Jeff Sessions, the Alabama Republican who is Mr. Trump’s most outspoken supporter in the Senate. Senator Kelly Ayotte, a New Hampshire Republican who is also in a difficult   fight, used a   luncheon to complain that Mr. Trump’s comments were obscuring the party’s economic message and urged Mr. Sessions to tell Mr. Trump to drop his jeremiad against the judge, according to two senators present who requested anonymity to reveal private conversations. Many Republicans hewed to a carefully scripted text in which the prospect of Hillary Clinton in the White House is presented as a larger threat than the risk their party may be taking with Mr. Trump. “What we have here is a country in crisis,” said Senator David Perdue, Republican of Georgia, adding that Mrs. Clinton was not the person to govern in troubled times. But even that defense showed it cracks. Asked which of Mr. Trump’s policy statements he preferred over Mrs. Clinton’s, Senator Dan Coats, Republican of Indiana, paused for 11 seconds before saying, “I don’t know that I want to deal with that. ” Ms. Ayotte said Mr. Trump’s comments “were wrong and offensive,” adding, “He should retract those comments. ” Among others in a perilous trap are Senators Mitch McConnell, the majority leader, whose new book boasts of his commitment to civil rights Tim Scott, the Senate’s only   Republican and Marco Rubio and Ted Cruz, sons of Cuban immigrants. Their choice now appears one between their biographies and their principles. Beyond Washington, other Republicans were also not satisfied with Mr. Trump’s response. “Donald Trump should retract his comments, not defend them. There is no place for racism in the G. O. P. or this country,” former Gov. Jeb Bush of Florida said on Twitter. For the moment, Republicans are more focused on limiting the damage they incur as a result of Mr. Trump’s candidacy than they are getting him elected. Mr. Scott, who has called Mr. Trump’s comments “racially toxic,” portrayed his own party’s nominee as a temporary affliction on conservatism. “For the next several months, he will have the loudest voice, but the fact of the matter is there will be other voices speaking as well,” he said, not even suggesting Mr. Trump could have the party’s loudest voice for four years. On Tuesday, Mr. McConnell deflected numerous questions about Mr. Trump before saying, “ It’s time to quit attacking various people that you competed with or various minority groups in the country and get on message. ” Even Republicans who shied from talk of abandoning the nominee shifted their tone. Moving from alarmed to angry, the party’s leaders sent Mr. Trump an unmistakable message: He is hurting the party and must stop. Senator Richard Burr, a North Carolina Republican who has also embraced Mr. Trump, acknowledged that the party may have to disavow Mr. Trump, employing the   maxim from former Justice Potter Stewart about how one can detect pornography. “This is one of those things you’ll know it when you see it,” said Mr. Burr, adding, hopefully, that he did not think the party “will get there. ” Dashing into a   luncheon of senators, Senator Shelley Moore Capito, Republican of West Virginia, called over her shoulder, “His comments are not helping. ” But Ms. Capito also said in an interview that in her economically depressed state, “there is a huge degree of pessimism. ” “People are looking for a message of hope,” she added, underscoring the attractiveness of Mr. Trump’s economic messages for many Republican voters. Mr. Trump has told his supporters that they should respond by suggesting that reporters who raise questions about his statements are racists, and to carry the message in various forms. One early supporter, Representative Lee Zeldin, Republican of New York, gave the technique a whirl in an interview with CNN on Tuesday. “You can easily argue that the president of the United States is a racist with his policies and his rhetoric. ” The conflagration over Mr. Trump’s remarks has detracted from Mr. Ryan’s desperate efforts to change the conversation on the Hill to focus on policy. But most Republicans agreed they had no real recourse at this point. “There is no easy answer,” Mr. Flake said. “You can write someone in. ” Mr. Trump tried to provide an answer to mitigate the damage. In his statement, he said it was “unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. ” “I am friends with and employ thousands of people of Mexican and Hispanic descent,” he added. “The American justice system relies on fair and impartial judges. All judges should be held to that standard. “I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. ”'"}, "time": 1742564171.5196846}