{"duration": 0.056818246841430664, "input_args": {"text": "'Some of the people that Andrew Caspersen bilked out of millions of dollars are asking a federal judge to show mercy on the   scion of a   Wall Street family. In letters to the judge, Mr. Caspersen’s mother, friends and former colleagues on Wall Street paint a picture of a modest man who had a “firm grasp of the ‘right’ thing to do. ” Even his wedding photographer and the doorman in the Upper East Side apartment building where Mr. Caspersen lives wrote in support. Their depictions are at odds with the government’s, which has detailed how Mr. Caspersen ran a   scheme to steal nearly $40 million, only to lose it all in   bets on the stock market. He pleaded guilty to one charge of security fraud and one charge of wire fraud in July. The most important letter of all, however, may be one from Dr. Marc N. Potenza, a professor of psychiatry at Yale University School of Medicine, who called Mr. Caspersen’s “severe gambling” a mental illness. The lawyer for Mr. Caspersen contends that it was an extreme compulsion to trade stock options that drove his client with an Ivy League pedigree to lie and steal from his friends, family and a hedge fund foundation. In an unusual departure from the typical   sentencing, Judge Jed S. Rakoff has agreed to hear testimony from Dr. Potenza on what constitutes a gambling addiction before imposing a sentence on the    Mr. Caspersen. Judge Rakoff is set to sentence Mr. Caspersen at the Federal District Court in Manhattan on Friday. It is not known whether federal prosecutors in Manhattan will call any witnesses of their own or simply look to   Dr. Potenza. The testimony could be critical to Mr. Caspersen’s attempt to persuade Judge Rakoff to impose a more lenient sentence than the more than 15 years in prison that federal prosecutors have said is appropriate. Mr. Caspersen was arrested in March at La Guardia Airport in New York as he was returning from a family vacation to Florida. He pleaded guilty in July, telling Judge Rakoff he was “ashamed for my crimes” and for causing harm to people close to him. Shortly before the arrest, Mr. Caspersen drafted a suicide note to his wife and a “letter to his ‘creditors,’” in which he said he was “deeply ashamed” and said he had “engaged in an ‘outright fraud,’” his lawyer said in a court filing. The suicide note was an eerie reminder of his father, Finn M. W. Caspersen, who killed himself in 2009 while battling cancer. The elder Mr. Caspersen made his fortune running what used to be known as Beneficial Finance and later gave a good deal of money to Harvard Law School. The elder Mr. Caspersen and all of his sons, including Andrew Caspersen, attended Harvard Law. Andrew Caspersen’s lawyer, Paul Shechtman, has likened his client’s urges to trade tens of millions of dollars worth of stock options as an addiction no less gripping than one to alcohol or drugs. Although such addictive behavior does not excuse Mr. Caspersen’s conduct, he said, it is a mitigating circumstance that Judge Rakoff should take into consideration. “He never intended for them to lose, yet he could not stop,” Mr. Shechtman said in a filing accompanying the letters from Dr. Potenza and other associates of Mr. Caspersen. Mr. Shechtman has said that his client has undergone treatment since his arrest. The lawyer’s call for leniency has not moved prosecutors working for Preet Bharara, the United States attorney for Manhattan. They are asking Judge Rakoff to impose a stiff sentence that is within the range established by federal sentencing guidelines. Prosecutors, in their own court filing, are taking a tougher position than the probation department for the federal courts, which has recommended a sentence of seven years. Some federal judges have expressed frustration with the guidelines because they potentially hamstring jurists and do not take into account mitigating circumstances. One such critic has been Judge Rakoff, who called the guidelines “irrational” in July, when Mr. Caspersen pleaded guilty. But not all of Mr. Caspersen’s more than a dozen victims have submitted letters of support. Notably, Mr. Shechtman’s filing did not include a letter from Louis Bacon, the billionaire hedge fund manager, whose foundation had given nearly $25 million to Mr. Caspersen. Mr. Caspersen’s tale has confounded Wall Street, where he was known and liked, blending in with many of his associates who came from   backgrounds. In many ways, his privileged background (he attended Groton and Princeton before Harvard) helped him to keep up a scheme for years before anyone noticed. The stock trading addiction began at Princeton, Mr. Shechtman said, but was amplified by a $2. 7 million distribution that Mr. Caspersen received from a family trust in 1999, when he was at Harvard. Over the following years Mr. Caspersen received another distribution, which he lost as well. Soon, he turned to friends and family for investments, getting a million dollars here, several million dollars there. Money came easily from his network, and for years, he papered over the losses by bringing in new money. As recently as February, Mr. Caspersen  —   who was at that point a successful executive working at the Park Hill Group, a division of PJT Partners  —   made so much money trading stock options that he could have paid back everyone and still had as much as $60 million left for himself. Instead, he continued to trade, losing it all. Mr. Caspersen kept his compulsive stock trading from friends and families. He even persuaded his wife that they should file separate tax returns, largely to keep his frequent trading a secret, according to court filings. But Mr. Caspersen’s facade began to unravel this year. A former Wall Street options trader who reviewed Mr. Caspersen’s trading records at Mr. Shechtman’s request said the option trading “lacked rationality. ” “If the definition of insanity is doing the same thing over and over again and expecting different results,” said Bruce Rosen, a former managing director at Tiger Ventures Capital, “then Mr. Caspersen’s options trading was not that of a sane person. ” Still, Mr. Caspersen has his defenders. “Andrew has always treated me with respect,” wrote John Colby, a doorman at the Manhattan apartment building where Mr. Caspersen lives with his wife and their two children. Mr. Colby described how during a shift on Thanksgiving several years ago, Mr. Caspersen and his wife brought Mr. Colby Thanksgiving dinner “on a real plate, with a real glass and napkin and silverware,” adding that the gesture was “very touching to me. ”'"}, "time": 1742628584.217046}