{"duration": 0.1450188159942627, "input_args": {"text": "'War on Saturated Fats Has Harmed People in Poor Countries Who Shunned Traditional Fats Like Coconut Oil Making traditional coconut oil in Liberia. \\nby Paul Fassa Health Impact News \\nOne of the most pervasive dangerous food myths has been the lipid hypothesis or theory of heart disease. It proclaims that eating foods containing saturated fats are the root cause of obesity and heart disease. It has prevailed for over a half-century and is only now beginning to deteriorate. \\nIt was originally created by University of Minnesota researcher Ancel Keys with his “ Seven Countries Study” that spawned the lipid theory of heart disease. This theory claims that saturated fats create cholesterol and cholesterol clogs arteries and induces heart disease and heart attacks. \\nWhat followed was recommendations by the USDA to condemn saturated fats like the tropical oils, and recommend instead the new expeller-pressed polyunsatured seed oils developed after World War II from US cash crops like soy and corn, which are heavily subsidized by taxpayers to keep prices artificially low and dominate the world market in edible oils. \\nIn the pharmaceutical world, the lipid theory of heart disease spawned the most profitable drugs of all time, statin drugs, designed to artificially lower cholesterol, a substance needed in our body and without which life would be impossible. \\nThe new lipid theory of heart disease got Ancel Keys on the 1961 cover of Time Magazine. Yet in 2014 Time issued their mea culpa for falling for Ancel’s bogus report and claims with a featured titled “ Eat Butter: Scientists labeled fat the enemy. Why they were wrong .” Many doctors and nutritionists echoed Ancel in condemning saturated fats, but “new science” has demonstrated the lipid theory is wrong and unscientific. \\nBut this proclaimed “new science” has been here all along, before Ancel Keys report and the subsequent McGovern led Senate Committee, the Select Committee on Nutrition and Human Needs final 1977 report that contained a few valid dietary points, but vilified saturated fats and salt. \\nThe USDA and FDA followed the Committees’ dietary advice and made the lipid theory official and more popular – an “everybody knows” type of common knowledge that really wasn’t true. It is simply a case of politics and money over real science. \\nOnly after a half-century of low and no fat food like substances had created more obesity and did nothing to rein in heart disease control in the marketplace that the saturated fat cholesterol myth began to erode, thanks to internet sites that publish real dietary science like Health Impact News and their website CoconutOil.com . \\n“It’s Easier to Fool People than Tell Them They’ve Been Fooled” – Mark Twain \\nVery few want to hear that his or her time and energy was invested in a bogus claim, even claims detrimental to one’s health. Better to think that the “authorities” have their backs and they’re doing the right thing. This is a major reason falsehoods all too slowly surrender to truth. \\nThe effort to reduce cholesterol with dangerous statin drugs has made a lot of money, maybe more than any other type of drug on the market. But its successful function is actually harmful in addition to its “side effects.” A plethora of new and old science supports cholesterol as a very vital substance for creating hormones, producing vitamin D from sunlight, cell walls, and brain and nervous system tissue. \\nThe high cholesterol count fears persist along with the notion that consuming saturated fats is behind it all. The officially supported no or low fat food propaganda supports a processed food industry that delivers foods and beverages with high amounts of added sugars or high fructose corn syrup (HFCS) added to processed grain carbohydrates stripped of their natural nutrients. \\nUnpopular but real science points to those added sugars and HFCS as the primary source of obesity, metabolic dysfunction leading to diabetes, and arterial inflammation leading to heart disease. \\nThe trans-fats of cheap processed hydrogenated vegetable oils replacing healthy saturated fats contained in butter and coconut oil adversely affect cellular function and structure. Folks do get fatter and unhealthier with these cheaper substitute fats that are ubiquitous in the standard American diet (SAD). \\nThese oils are peddled for their lower prices and longer shelf lives. But their longer shelf lives are meaningless. They do not preclude processed vegetable oils’ inherent toxicity. (Source) \\nProcessed foods containing these partially hydrogenated oils have contributed more to obesity, diabetes, and declining heart health than pure saturated fats, which if untainted promote health in all those areas. But the misinformation is still official thanks to key decision makers’ vested interests within the USDA and FDA. (Source) A Study Explaining Fat Disinformation’s Worldwide Worsening Health and Economic Woe \\nThe most obvious harm done by the false propaganda against saturated fats in traditional foods are with regions that relied heavily on saturated fats for centuries, especially edible tropical oils such as coconut oil prior to the lipid hypothesis or theory’s dogma that permeated and replaced their traditional diets. \\nA recent paper, “Coconut oil and palm oil’s role in nutrition, health and national development: A review,” was published in the September 2016 Ghana Medical Journal (GMJ). \\nThis report points out the obvious, among those wary of government and medical propaganda, without reservation: \\n… anti-tropical oil campaigns in the United States were conducted more for economic gains than for genuine concerns of the health of the Americans [Emphasis added]. Sadly, this adverse publicity of tropical oil in the United States, has spread worldwide, even to countries in the developing world, with heart disease prevalence far lower [prior to the lipid theory] than that of the United States. \\nFurthermore, in the developing world, this adverse publicity is characterized by pressure from all fronts including governmental agencies and health professionals (including nutritionists) to reduce consumption of oils such as palm and coconut oils. (Source) \\nThe paper goes on to detail the nutritional benefits of saturated fats, called saturated because they are saturated with hydrogen, and the different types of saturated fats according to the lengths of their carbon atoms. \\nWhile considering that long chain fatty acids could be a triglyceride storage issue for those with digestive issues, the paper mentions how long chain fatty acids’ slow conversion to energy enhances their nutrient absorption. \\nThen the paper explains short and medium chain fatty acids’ ability to be rapidly converted to energy, focusing on coconut oil’s medium chain fatty acids’ health benefits and rapid conversion to usable energy within a body’s cells, especially restoring proper brain cell metabolism. \\nThis attribute has been a boon for those suffering from Alzheimer’s disease and other neurological diseases, as explained in Health Impact News . (Source) \\nSo what have we induced by going along with the lipid theory embraced by the USDA, FDA, mainstream nutritionists, and the medical profession’s acceptance of blockbuster (high sales revenue) pharmaceutical statin drugs? \\nThe real answer has been more obesity, diabetes, and heart disease with an epidemic surge of neurological diseases, especially those related to dementia. \\nThis study explains a similar impact among those third world or developing nations in West Africa, Southeast Asia, and elsewhere that had embraced consuming and cooking with saturated fats as a staple in their diets for centuries. Regional Economics Also Adversely Affected \\nPrior to “Westernizing” their diets somewhat, their low levels of obesity, heart disease, and neurological disorders were areas of curiosity and envy. Now those populations are catching up to American and European non-infectious disease rates. \\nAlso, the fact that most of developing or third world regions used their own edible oils for centuries were now more dependent on importing American and European processed edible oils has destabilized their local food and agricultural economies. \\nMedium chain triglyceride (MCT) fatty acids that are unheated or chemically untainted, such as virgin palm and coconut oils. \\nEven the so called “French paradox,” the fact that France’s heart morbidity and obesity was low despite diets rich in saturated fats, was explained away by Western medical media’s assertion that their drinking wine with small traces of heart healthy resveratrol allowed the French to imbibe high fat diets with impunity. \\nThis was mainstream media national news a very few years ago. Never mind that the truth could be too shocking for our food and medical industries to handle. Resveratrol levels from wine are actually insufficient for protecting the heart against any imagined damage from saturated fats, unless one wants to pass out drunk with every meal. \\nIgnoring the lipid theory despite authority supported dogma will lead to better health for those who wish to cancel their subscription to it. Read and listen to the few medical practitioners who have countered that dogma instead. (Source) \\nComment on this article at CoconutOil.com. \\nSee Also:'"}, "time": 1742561721.3507094}