{"duration": 0.16823697090148926, "input_args": {"text": "'We Are Change \\n\\nOn October 28, Tesla unveiled its new solar roof tiles. Few of us in attendance, if any, realized the solar roofing tiles were actual functional solar panels until Elon Musk said so. Sure, it’s a neat trick, but what’s the big deal?\\nWhy does it matter that Tesla is making a fashion statement when the point is green power and a future where we aren’t so dependent on fossil fuels?\\nI’ve heard from some people suggesting that this is nothing new, because of other similar previous projects, including Dow Chemical’s canned solar shingle project , for example. Others are wary of Tesla’s ability to sway consumers with a solar solution that sounds like it’ll still be quite expensive in terms of up-front (or, with payment plans, deferred but net) installation costs. Still others aren’t clear on Tesla’s goals with this product, or how it fits into the company’s overall strategy relative to its electric vehicles.\\nLooks matter It’s easy to dismiss the aesthetic import of how Tesla’s tiles look, but it’s actually important, and a real consideration for homeowners looking to build new homes or revamp their existing ones. The appearance of the tiles, which come in four distinct flavors (Textured Glass, Slate Glass, Tuscan Glass and Smooth Glass) is going to be a core consideration for prospective buyers, especially those at the top end of the addressable market with the disposable income available to do everything they can to ensure their home looks as good as it possibly can.\\nAs with other kinds of technologies that are looking to make the leap from outlier oddity to mainstream mainstay, solar has a hurdle to leap in terms of customer perception. Existing solar designs, and even so-called attempts to make them more consistent with traditional offerings like the above-mentioned Dow Chemical project, leave a lot to be desired in terms of creating something that can be broadly described as good-looking.\\n\\nIt’s like the VR headset — Oculus and Google can make claims about their use of fabric making their headsets more approachable, but both are still just options somewhere along the curve of things with niche appeal. Neither is very likely to strike a truly broad audience of users as acceptable, and neither are solar panels that don’t succeed in completely disguising themselves as such.\\nHalo effects Tesla has been referred to as the Apple of the automotive world by more than a few analysts and members of the media, and if there’s one thing Apple does well, it’s capitalize on the so-called “halo effect.” This is the phenomenon whereby customers of one of its lines of business are likely to become customers of some of the others; iPhone buyers tend to often go on to own a Mac, for instance.\\nFor Tesla, this represents an opportunity to jump-start its home solar business (which it’ll take on in earnest provided its planned acquisition of SolarCity goes through) through the knock-on effects of its brisk Tesla EV sales, including the tremendous pre-order interest for the Model 3. It’s strange to think of halo effects with big-ticket items, including vehicles and home energy systems, but Tesla’s fan base shares a lot of characteristics with Apple’s, and because they’re already purchasing at the level of an entire automobile, the frame of reference for what constitutes a valid halo purchase is actually appropriate.\\n\\nTesla, like Apple, scores well with customer satisfaction and brand commitment, and that’s something that no one trying to sell a solar home energy system at scale can match. As strange as it sounds, “buying a roof because you like your car” might be the new “buying a computer because you like your phone.”\\nBenefits beyond basic solar Tesla’s solar tiles claim to be able to power a standard home, and provide spare power via the new Powerwall 2 battery in case of inclement weather or other outages. Musk says that the overall cost will still be less than installing a regular old roof and paying the electric company for power from conventional sources. But Musk’s claims about the new benefits of the new solutions don’t end there.\\nTesla’s tiles will actually be more resilient than traditional roofing materials, including terra-cotta, clay and slate tiles. That’s because of the toughness of the glass used in their construction, according to Musk, who demonstrated the results of heavy impact from above, using a kettlebell as you can see in the video below.\\nThis should make them theoretically more resistant to potential damage from elements like hail, or even debris like fallen tree branches. In fact, Musk also said at the event that the roofs should far outlast the standard 20-year life cycle common for roofing materials used today — by as much as two or even three times. Fewer roof tile replacements means more value, provided that’s not already factored into his estimates of the up-front cost.\\nThere’s also the possibility that the new tiles could become more efficient than existing solar panel options. Though in their current form, Musk says they achieve 98 percent of the efficiency of regular panels. He said that the company is working with 3M on coatings that could help light enter the panel and then refract within, letting it capture even more of the potential energy it carries to translate that into consumable power.\\nA new kind of ecosystem The announcement of Tesla’s solar tiles does not guarantee a sweeping solar power revolution; far from it, since Tesla says it won’t start installing the product in any consumer homes until next year, and a lot can happen between now and then. But Musk also said with full confidence that he ultimately expects the Powerwall to outsell Tesla cars, and easily so.\\nSolar roofing, Powerwall and Tesla cars taken together represent a new kind of ecosystem in consumer tech, one that carries a promise of self-sufficiency in addition to ecological benefits. Tesla has already tipped its hand with respect to how it intends to make vehicle ownership a revenue generator for its drivers, rather than a cost center. You can see how it might eventually do the same for solar power using solar tile roofs combined with Powerwalls installed in series, giving homeowners surplus power generation and storage with a few different potential options for monetizing the excess (including, say, acting as a supercharger station for other Teslas, or selling back to the grid).\\nIt’s tempting to look at Tesla’s unveiling last week and think that it’s more of an incremental development in the home solar industry. But it’s more likely a step toward a future where individuals have more direct control over power generation, leading to a big difference in how we think about renewable energy.\\nSource; https://techcrunch.com/2016/10/31/why-teslas-new-solar-roof-tiles-and-home-battery-are-such-a-big-deal/# \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post Why Tesla’s new solar tiles and home battery are a big deal appeared first on We Are Change .\\n'"}, "time": 1742563039.4778278}