{"duration": 0.07169342041015625, "input_args": {"text": "'UC Berkeley are investigating Ian Dabney Miller, who is allegedly an employee at the university, after he was caught bragging about and celebrating the assault of a MILO fan during the Breitbart senior editor’s event on Wednesday. [Miller, who attended the    on Wednesday, uploaded several pictures to his   Twitter account, including one of an injured attendee lying on the floor with the caption “hey come get your boy, he got ROCKED #miloatcal. ”   “WE REP THE BAY,” declared Miller in another uploaded picture. “BICKIN BACK IN BERKELEY,” read another. “Bickin back” is a slang term created by the Bloods gang, and means kicking or fighting back. Miller also uploaded pictures celebrating “the traditional burning of the MAGA hat,” and showing off the   bullets that police fired at violent rioters. In other tweets, which can only be found in   online, Miller can also be seen boasting about and taking credit for the assault, which allegedly included “a couple of weak shots to the face,” before pushing the attendee over a bike wheel. @AnaKasparian @UCBerkeley I was asleep while all this was going on. Woke up to it, heard what this guy had done  decided to   pic. twitter.   —   Pave Darker☻☹☻ (@PaveDarker) February 3, 2017,  UC Berkeley told Breitbart News that they “are aware of the allegations” made against Miller, and investigating the situation, however they did not confirm whether Miller was an employee at the college. “Our campus police department is working in close concert with the FBI on an ongoing investigation into this matter,” they responded. Miller’s real identity was discovered online after Twitter user “Pave Darker” went digging online, and discovered Miller’s anonymous username “teen_archer” linked to his real Facebook account. @AnaKasparian @UCBerkeley  A quick search of facebook under his twitter handle leads you hear giving both his location and much   pic. twitter.   —   Pave Darker☻☹☻ (@PaveDarker) February 3, 2017,  Following further investigation made by the Twitter user, Miller’s name was revealed to be listed on UC Berkeley’s 2013 college employee records, where the alleged employee is reported to be making at least nearly $70, 000 a year. @AnaKasparian @UCBerkeley If you then do a simple google search of his name and the word berkeley you get to this   pic. twitter.   —   Pave Darker☻☹☻ (@PaveDarker) February 3, 2017,  @AnaKasparian @UCBerkeley  On this page you will find this information. Kinda looks like he’s employed by the university to me  …      pic. twitter.   —   Pave Darker☻☹☻ (@PaveDarker) February 3, 2017,  Miller has since deleted and privatized nearly all of his online accounts and profiles.   “ ” rioters assaulted numerous attendees, started fires, smashed up shops and ATMs, and attacked people’s cars during the riot on Wednesday night in protest of MILO’s UC Berkeley show, forcing the event to be cancelled. Several celebrities and news outlets expressed support for the riot, including Hollywood director Judd Apatow, who deleted his tweet shortly after, and Fusion, who smeared MILO as a “Nazi,” before praising rioters. On Thursday, MILO’s tour bus was tracked down by “ ” and vandalized, forcing both him and his team to evacuate the premises after his location was leaked online.   Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561862.5130572}