{"duration": 0.11371159553527832, "input_args": {"text": "'When Alexa Chung, the    model, television host, design collaborator and    announced last summer that she would introduce a fashion line this spring, she refused to reveal the name of her backer. In fact, she told news outlets that she had been explicitly instructed not to do so. But in fashion, nothing stays secret for long. The man behind the brand is Peter Dubens, 50, the   and managing partner of Oakley Capital Private Equity, a midmarket company based in London that oversees assets of more than $1. 7 billion. He is considered one of Britain’s most successful investors and entrepreneurs, and has his hand in such buzzy properties as KX gym in Sloane Square, where Madonna and Daniel Craig are rumored to be clients, and the   Mark’s Club in Mayfair. But he is rarely mentioned by the media. In fact, he claims to employ a public relations firm to get him out of interviews. In photographs, he almost invariably appears in a white or blue   shirt and suit jacket,   and   with a thick head of dark, graying hair. Friends and associates describe him as “a big character” and “a family man” who is “obsessed with his boat,” “always on a diet” and “mad about tennis. ” He is not, in other words, your typical fashion investor. So how did a man more known for telecommunications than style trends end up backing the namesake label of one of Britain’s most   women? Mr. Dubens is evasive about his background when reached by phone, offering, when pressed, that he grew up in the London neighborhood of Chelsea, where he still lives, and that he attended a “Jewish school. ” (The Jewish Free School in north London, it turns out.) Mr. Dubens skipped college, instead taking a job driving a British billionaire, Joseph C. Lewis, around London and the Bahamas, and then, “with no experience at all,” going into business with Jonathan Sieff, a Marks  Spencer’s heir, selling novelty   that changed color when exposed to heat. Five years later, when Mr. Dubens was just 25, they sold the company for 8 million pounds (nearly $10 million at current exchange rates) to Coats Viyella, the clothing, furnishing and threads group. A string of successes followed, spanning online gambling (he took in £7. 5 million on the sale of 365 Media in 2006) to telecoms (Oakley Capital was involved in Pipex Communications, which sold for £330 million in 2007). “As you can tell from my background, I’m a bit unorthodox, and I’m passionate about backing young and new entrepreneurs,” he said, noting that the draw was not about investing in “luxury or glamorous brands. ” Still, in addition to Ms. Chung’s fledging business, he has invested personally and through his venture capital fund, Pembroke VCT, in Bella Freud’s fashion label, known for its graphic cashmere sweaters as well as the genealogy of its founder (she is the daughter of the artist Lucian Freud and   of Sigmund Freud). The hidden link tying Mr. Dubens, Ms. Freud and Ms. Chung? That would be Laura Bailey, a model and British Vogue contributor. While vacationing in St.  several years ago, Mr. Dubens met Ms. Bailey and they developed what she describes as a “formalized friendship” she introduced him first to Ms. Freud and later to Ms. Chung. “He’s got a very big feel for talent and marketing and potential,” she said, adding that he gives the designers “real freedom” in letting them run their businesses. “That’s a plus. I think the danger in these kinds of relationships is too many cooks. ” Ms. Freud said: “He’s not one of those vanity people who want to be the big cheese. He is a big cheese, but he just seems to have quite a lot of fun sailing his yacht around and stuff. “A lot of those kind of people who are money people, they are quite controlling and bullying,” she continued. “He doesn’t say, ‘Flares are coming back in, why don’t you do those?’ ” Edwin Bodson, the head of atelier at Haider Ackermann, who moved to London to become managing director of Alexa Chung in April, said: “What I have learned from Peter is that time has to be treated with discipline. No real problem needs more than 15 minutes of attention if it is well analyzed. ” This May, Ms. Chung’s first collection will arrive at stores, including Bergdorf Goodman in New York and MatchesFashion in London. It will be priced according to what Mr. Bodson described as the “high contemporary” category, from $100 to $120 for a   and $800 to $1, 500 for a sequined dress or jacket. The pieces will be, he said, “close to what people expect”  —   that is, garments in line with Ms. Chung’s signature style. So anticipate a tea dress or two, some constructed jackets and a helping of skinny denim. To coincide with the introduction, Ms. Chung will host an event that Mr. Bodson described as a kind of fashion show, but not restricted to industry members and media. Before other young fashion designers get too excited, however, Mr. Dubens said he had no plans to invest in more apparel brands. “I don’t personally make investments in smaller companies any more,” he said. “Alexa is my last one. ”'"}, "time": 1742563963.0646055}