{"duration": 0.047638654708862305, "input_args": {"text": "'09:01 EST, 12 November 2016 | Updated: 18:54 EST, 12 November 2016 A flotilla of Russian warships is now in the eastern Mediterranean off the Syrian coast after being sent to back up a bombing campaign in support of President Bashar al-Assad. The commander of Russia’s flagship Admiral Kuznetsov aircraft carrier, Sergei Artamonov, said via videolink that the ships are now in the ‘designated zone… in the eastern Mediterranean’ and ‘are now jointly carrying out tasks, manoeuvering to the west of the Syrian coast’. The battle group has travelled to Syria from the North Sea through the English Channel in the biggest such naval deployment in recent years as part of Russia’s military intervention in Syria. Russian aircraft carrier Admiral Kuznetsov pictured in international waters off the coast of northern Norway last month Russian aircraft carrier Admiral Kuznetsov, pictured in the Englist Channel, is part of the Russian Task Group, which includes the sole the nuclear powered Kirov Class Battlecruiser, Pyotr Velikiy and two Udaloy Class Destroyers, Vice Admiral Kulakov and Severomorsk Russia has been flying a bombing campaign in Syria for the past year in support of President Bashar al-Assad and has deployed a naval contingent to back up its operation. The naval task force has been monitored closely by NATO, whose chief Jens Stoltenberg voiced concern the ships would be used to support the Russian military operation in Syria and ‘increase human and civilian suffering.’ The ship’s commander was speaking to a presenter on Russia-1 television from inside the defence ministry for a news show that will air this evening in Moscow. The Russian warship ‘Mirage’ passes the Bosphorus strait in Istanbul on its way to Syria He confirmed that aircraft are already taking off from the ship’s deck to view the conflict zone. ‘Flights are being carried out from the deck… they are working on coordination with the shore port,’ he said. ‘The flights have been going on practically every day for the last four days,’ he added. HMS Richmond observing aircraft carrier Admiral Kuznetsov, which is part of a Russian task group, during transit through the North Sea Russia’s Interfax news agency on Friday had cited a Russian military and diplomatic source as saying that Russian MiG and Sukhoi jets have been regularly flying into Syrian airspace from the Kuznetsov to ‘determine combat missions.’ The Russian television channel also spoke to the commander of the Pyotr Veliky nuclear-powered battle cruiser, which is part of the same flotilla. Asked whether foreign aircraft were flying over the ships, the commander, Vladislav Malakhovsky, said ‘they are afraid to come closer than 50 kilometres away, realising very well how powerful the nuclear cruiser is.’ – Seeks UN assurances on truces – Russia says it has ceased strikes on rebel-held east Aleppo since October 18 and has also held brief unilateral ceasefires on the ground it calls ‘humanitarian pauses.’ It has accused the United States-led coalition of failing to persuade rebels to cooperate to allow civilians to leave, as only a few have done so. The Russian defence ministry on Saturday said that it will introduce further ‘humanitarian pauses’ only on condition that the United Nations humanitarian mission guarantees it is ready and able to organise aid supplies and evacuations. The UN has warned that east Aleppo is now down to its final food supplies and has urged Russia to extend future truces to allow supplies through. Russia said Saturday it is ready to act ‘at any time’ as long as the UN ‘officially confirms its readiness and ability to supply humanitarian aid to Aleppo and evacuate wounded and sick peaceful residents.’ It complained that previous assurances from the UN had turned out to be ‘just words.’ Vehicles carrying humanitarian aid that try to enter the designated humanitarian passages into the city have ‘every time’ faced ‘shooting from the rebel fighters’ and have been unable to drive through because of mined roads, the ministry said. Related '"}, "time": 1742628608.0197318}