{"duration": 0.06926202774047852, "input_args": {"text": "'The  ’s Office (AGO) will not request a prison sentence for a “child migrant” who raped a 5   boy in late 2015, Breitbart London has established. [The migrant, who told the boy he would “break him into pieces” if he told anyone about the attack, was handed a     rehabilitation order by Judge Jonathan Bennett. Defence lawyer Alwyn Jones welcomed the ruling, saying he hoped it would “address the underlying issues this young man has. ”  Any member of the public can request that the Law Officers of England and Wales appeal sentences of this nature under the Unduly Lenient Sentence scheme. Breitbart London reported last November that at least one unknown member of the public had done so in this case. However, the AGO has since told Breitbart London that Tory MP Robert Buckland, the   has “carefully reviewed the papers” and “concluded that if the sentence imposed on the offender was referred to the Court of Appeal, the Court would not increase the sentence”. It was on this basis that Buckland “decided not the refer the case”. The AGO gave Breitbart London no indication as to its own assessment of the sentence’s suitability. The original sentence was just one of a series of rulings which have encouraged accusations that the judiciary are “out of touch” with the ordinary public, with some calling for judges to be subject to retention elections, as in Japan and several American states. In one such case, last August, judges as Basildon Crown Court ruled that Alexander Bassey would serve just four years in custody after horrifically scarring and partially blinding five white teenagers in a random acid attack before calmly walking back to his laughing,   gang at an Essex railway station. Criticism of the judiciary reached fever pitch following a controversial ruling in the High Court which deemed that MPs should have the final say over whether or not the UK leaves the European Union (EU) a move which saw senior judges branded “enemies of the people”. Furthermore, the courts have proven keener to resort to imprisonment for offences which are seemingly much less serious but judged to be “racially or  ” in character. 35   Kevin Crehan was imprisoned for leaving bacon sandwiches on the doorstep of a mosque. He was found dead in his cell shortly after Christmas in an incident which is currently subject to an ongoing investigation. The courts have also appeared to be relatively harsh when dealing with members of the British Armed Forces, as in the case of Sergeant Alexander Blackman  —   better known as ‘Marine A’. Sergeant Blackman was handed a ten year sentence for shooting dead an already   terrorist in Afghanistan. Critics of the sentence, which the courts reduced by just two years on appeal, have described the shot as a coup de grâce, or “shot of mercy”. Deficiencies in Sergeant Blackman’s defence mean that the original sentence may ultimately be deemed unsafe.'"}, "time": 1742562105.3682826}