{"duration": 0.1798996925354004, "input_args": {"text": "'Wed, 26 Oct 2016 15:47 UTC © Getty A total of 800 troops, drones and tanks are moving to Estonia as part of the biggest military build up on Russia\\'s borders since the Cold War. Britain is sending hundreds of soldiers and hardware to Russia\\'s borders as part of a huge military deployment. A total of 800 troops, drones and tanks are moving to Estonia next spring, Defence Secretary Michael Fallon said. The move is part of the biggest military build up of NATO troops on Russia\\'s borders since the Cold War . © REX Mr Fallon said the deployment of the battalion, supported by French and Danish troops, will start from May 2017. \"Although we are leaving the European Union, we will be doing more to help secure the eastern and southern flanks of NATO,\" Mr Fallon said. London is also sending Typhoon fighter aircraft to Romania to patrol around the Black Sea, partly in support of Turkey. It comes after an increase in tensions between the West and Russia in recent months. Earlier this month, 40 million Russians reportedly carried out nuclear evacuation tests after officials warned that the West wanted to launch strikes on the country. NATO is now pressing allies including the US and Britain to contribute to the military presence as the alliance prepares for a long quarrel with Moscow. Last week, a Russian aircraft carrier passed through the English Channel as it traveled to Syria in a show of force along Europe\\'s shores. Alliance defense ministers aim to make good on a July promise by NATO leaders to send forces to the Baltic states and eastern Poland from early next year. The United States hopes for binding commitments from Europe to fill four battle groups of some 4,000 troops, part of NATO\\'s response to Russia\\'s 2014 annexation of Crimea and concern it could try a similar tactic in Europe\\'s ex-Soviet states. Comment: This propaganda still lives despite Russia showing no interest invading any country. France, Denmark, Italy and other allies are expected to join the four battle groups led by the United States, Germany, Britain and Canada to go to Poland, Lithuania, Estonia and Latvia, with forces ranging from armored infantry to drones. NATO Secretary-General Jens Stoltenberg said the commitments would be \"a clear demonstration of our transatlantic bond.\" Diplomats said it would also send a message to Republican presidential nominee Donald Trump, who has complained that European allies do not pay their way in the alliance. The battle groups will be backed by NATO\\'s 40,000-strong rapid-reaction force, and if need be, further follow-on forces, for any potential conflict, which could move into Baltic states and Poland on rotation. The strategy is part of an emerging new deterrent that could eventually be combined with missile defenses, air patrols and defenses against cyber attacks. However, the alliance is still struggling for a similar strategy in the Black Sea region, which Turkish President Tayyip Erdogan has said is becoming a \"Russian lake\" because of Moscow\\'s military presence there. Romania, Bulgaria and Turkey are expected to soon come forward with a plan to increase naval and air patrols in the area, as well as a multinational NATO brigade in Romania. For the Kremlin, the U.S.-led alliance\\'s plans are already too much given Russia\\'s grievances at NATO\\'s expansion eastwards. Stoltenberg denied going too far. \"This is a credible deterrence, not to provoke a conflict but to prevent conflict.\" Comment: Stoltenberg\\'s thinking is flawed since moving troops to a country\\'s border based on no threats is an act of aggression that promotes conflict. Next year\\'s deployments have taken on greater symbolism since Russia pulled out of several nuclear disarmament agreements in the past two months while moving nuclear-capable missiles into its Baltic exclave in Kaliningrad. The so-called Iskander-M cruise missiles can hit targets across Poland and the Baltics, although NATO officials declined to say if Russia had moved nuclear warheads to Kaliningrad. \"This deployment, if it becomes permanent, if the presence of nuclear weapons were confirmed, would be a change in (Russia\\'s) security posture,\" the United States\\' envoy to NATO, Douglas Lute, said. Tensions have been building since Crimea and the West\\'s decision to impose retaliatory sanctions, but the breakdown of a U.S-Russia brokered ceasefire in Syria on October 3, followed by U.S. accusations that Russia has used cyber attacks to disrupt the presidential election, have signaled a sharp worsening of East-West relations. EU leaders met last week to consider fresh sanctions over Russian bombing of civilian areas in Aleppo and NATO\\'s Stoltenberg said he fears the Russian warships heading to the Mediterranean could launch new attacks on the Syrian city. Even before the break down of the Syrian ceasefire, Russian President Vladimir Putin suspended a treaty with Washington on cleaning up weapons-grade plutonium, signalling he was willing to use nuclear disarmament as a new bargaining chip in disputes with the United States over Ukraine and Syria.'"}, "time": 1742561653.9080713}