{"duration": 0.02440190315246582, "input_args": {"text": "'A pollster who is in the field in two swing states is reporting that he is seeing no early impact from the FBI reviewing new emails in the Hillary Clinton investigation in two swing states. \\nGeoff Garin of Hart Research tweeted from the field: Still early, but I was in the field in two states last night and saw absolutely no impact from the reporting on the Comey letter. \\n— Geoff Garin (@geoffgarin) October 29, 2016 \\nIt is still early, but if this were the election shifting news that Republicans were hoping for the impact would have been immediate. The reality is that if the public opinion polls tighten in the final days of the campaign, it will be because Republicans are coming back to Trump. \\nThere are few undecided voters in this election, and even if all the Republican base come home to Trump, it won’t be enough for Trump to win, because he is losing where the presidential election is really held. Trump is getting crushed at the state level. \\nRepublicans have been trying to build Hillary Clinton’s emails into a story for years, and they have failed at every turn. \\nHillary Clinton led the election while under Congressional investigation. Hillary Clinton led the election while under FBI investigation. Hillary Clinton is leading the election today. The message that Republicans and the media don’t want to hear is that voters are sick of the emails, and they don’t care. \\nVoters are smarter than Republicans and the press give them credit for. The Hillary Clinton email scandal has never broken out of the right wing bubble because there is no evidence that Clinton did anything wrong. \\nIf the polls tighten a little, this will be the best news in the world for Hillary Clinton and Democrats, because it will destroy any potential for Democratic complacency and get their voters out and to the polls. \\nWhat Geoff Garin witnessed is probably going to end up being very accurate. James Comey’s letter to Congress is unlikely to move swing states and change the outcome of the presidential election.'"}, "time": 1742563533.8962767}