{"duration": 0.03505349159240723, "input_args": {"text": "\"The Trump campaign is having a collective nervous breakdown after the James Comey letter about new Hillary Clinton emails failed to swing the election in his direction. \\nRobert Costa of The Washington Post tweeted a view from inside the Trump campaign: My read of Trumpland tonight: They know the path is very narrow. They see the polls, pub and priv. But they're scrambling map post-Comey… \\n— Robert Costa (@costareports) October 30, 2016 Many of them describe the way to 270 not as a direct shot but a series of upsets and bank shots, of strong R showing + depressed D turnout \\n— Robert Costa (@costareports) October 30, 2016 But list of hurdles goes on and on. HRC and Dems highly organized. Early vote. Top Ds hitting trail. FBI news also enthusing D voters… \\n— Robert Costa (@costareports) October 30, 2016 What you're seeing is a small group of aides who truly believe Trump's populism/non-trad pitch can put new things in play, in spite of data. \\n— Robert Costa (@costareports) October 31, 2016 \\nThe Trump campaign is now that reality detached place where a few true believers are running the show. This is why Trump is going to spend the last week of his presidential campaign in blue states that he has no chance of winning. Trump still thinks that he can win Michigan, Wisconsin, and New Mexico. Wisconsin might be the most laughable of three delusions because Trump was routed in the Republican primary there, and GOP support from Wisconsin Republicans like Paul Ryan and Scott Walker has been lukewarm at best. \\nThese are the final days that all losing campaigns go through when the nominee refuses to accept the likelihood of their defeat. The Comey letter didn’t move the needle for Trump. It didn’t give him a surge of national momentum or make the majority of voters rethink their support for Hillary Clinton. \\nThe Clinton emails didn’t save Trump, so now he is going to waste his time campaigning in states that he will lose in search of a miracle as his poorly managed presidential bid stumbles to the finish line.\""}, "time": 1742562286.153733}