{"duration": 0.179152250289917, "input_args": {"text": "'BERNARDS TOWNSHIP, N. J.  —   Mohammad Ali Chaudry, a retired financial officer, has lived in this prosperous town for 40 years. It is where he raised his three children and where he served as mayor, and before that, as a member of the school board. It was also where Mr. Chaudry, an observant Muslim, always wanted to pray. But Mr. Chaudry and some 70 fellow Muslims have been stymied for years in their quest to build a mosque on a   plot of land in Basking Ridge, a genteel community here that is as proud of its old oak trees as its old homes. A year ago, after 39 public hearings in which local officials and residents picked apart every aspect of the proposed mosque, the planning board rejected the proposal, citing issues like storm water management and pedestrian safety in the parking lot. Now, the federal Justice Department has filed a lawsuit against Bernards Township, arguing that its decision violated federal law and discriminated against the applicants purely because of their Muslim faith. The complaint, filed last month, follows a lawsuit brought by Mr. Chaudry’s Islamic Society of Basking Ridge, which has been subjected to   fliers and social media posts and even vandalism. During the protracted application process, someone stomped on the group’s mailbox and later superimposed “ISIS” over the society’s initials on the mailbox. “This was unprecedented,” said Mr. Chaudry, the society’s president, who holds a Ph. D. in economics from Tufts University and teaches a course at Rutgers University on Islam. “No other house of worship in the township’s history had ever been treated the way we were. ” Across the country, more and more towns have used local zoning laws as barriers to new mosques and Islamic schools, underscoring what civil rights advocates say is a growing wave of intolerance that has been amplified by the victory of   Donald J. Trump. In response, the federal government has been increasingly turning to the courts, using a law passed unanimously by Congress in 2000 that prohibits municipalities from discriminating against religions in   decisions or treating religious groups differently than secular ones. While the law, with the arcane name Religious Land Use and Institutionalized Persons Act, was intended to protect all religious faiths, 11 of the last 13 cases brought by the Justice Department  —   including three in the last month  —   have involved Muslims. “The law, by its very nature, deals with particularly vulnerable populations,” said Mark Goldfeder, a senior lecturer at Emory University’s School of Law and a senior fellow at the university’s Center for the Study of Law and Religion. “It’s so easy for towns to hide discrimination behind layers of   procedure. ” But Muslim advocates and experts on religious freedom worry that Mr. Trump’s impending inauguration leaves the future of the powerful religious freedom law in doubt. The man the   has nominated to lead the Justice Department, Senator Jeff Sessions, Republican of Alabama, has endorsed Mr. Trump’s call for a temporary ban on immigration from Muslim countries. As the nation’s chief law enforcement officer, Mr. Sessions might be less sympathetic to pursuing investigations involving the rights of Muslims. There are now 13 open   investigations under the law, though a spokesman for the department declined to say how many of those involved mosques. Ross K. Baker, a distinguished professor of political science at Rutgers who has studied the federal law, said it was “entirely possible” Mr. Sessions could choose to dial back on the investigations. “It is within the province of the attorney   to decide whether to proceed with a lawsuit,” he said. Another recent case brought by the department involved a proposed mosque in Virginia. The lawsuit argued that Culpeper County violated the religious   law in denying a sewage permit application. The complaint noted that since 1992, the county had considered 26 applications and never before denied such a permit to either a commercial or religious group. In a speech this month at a Virginia mosque, Loretta E. Lynch, United States the attorney general, talked about the department’s response to a surge in hate crimes, highlighting enforcement of the   law. “Members of the Civil Rights Division have heard repeatedly about more overt discrimination in both the tone and framing of objections to planned religious institutions, especially mosques and Islamic centers,” said Ms. Lynch, who sent a letter to state and local officials on Thursday reminding them of the law and their obligation to respect religious freedom. In the case of Bernards Township, the Islamic Society bought land that was in a zone that permitted a house of worship. Raising money from various sources, Mr. Chaudry oversaw the purchase of four acres, aware that the zoning code required at least three acres for a house of worship. The society hired an architect who took pains to design a mosque that would blend in with the neighborhood, where a fire station stands across the street from the site. The    mosque, the size of a large house, would forgo the traditional dome and would include minarets that mimic the chimneys on neighboring houses. “The mosque proposal met with vociferous public opposition,” the Justice Department wrote in its recent complaint. “Fliers, social media and websites denounced the mosque and were filled with   bigotry and references to terrorism and the   attacks. ” The federal lawsuit concluded that the planning board had used different requirements in denying the society’s application than it “had in evaluating previous applications. ” The language in the society’s own lawsuit was more blunt: “What should have been a simple board approval for a permitted use devolved into a Kafkaesque process that spanned an unprecedented four years. ” Nearly three dozen religious, legal and civil rights groups have supported the society’s lawsuit by signing amicus briefs, said the society’s lawyer, Adeel A. Mangi, of the firm Patterson Belknap Webb  Tyler. Bernards Township officials deny that the applicants’ faith played any role in their decision. The mayor, Carol Bianchi, declined to respond to the allegations. But a statement by the township after the Justice Department filed its lawsuit asserted that the planning board’s denial was based on “legitimate   and safety concerns which plaintiffs refused, and to this day, refuse to address. ” The township’s most forceful response was reserved for the Justice Department, which it accused of a conflict of interest because one of its investigators served on the same board at Drew University’s Center for Religious and Cultural Conflicts as Mr. Chaudry. The township also claimed that the department’s communication with the Islamic Society before bringing the federal complaint suggested an “inappropriate collusion. ” The United States attorney for New Jersey, Paul J. Fishman, a Democrat, looked into the township’s allegations and declared them baseless. In July, the Justice Department released a report on its enforcement of the federal law since 2010, which detailed the growing proportion of cases involving mosques. It also found that while 84 percent of   investigations were resolved without a lawsuit, only a fifth of cases involving Islamic institutions were similarly resolved. In Bernards Township, much of the initial resistance to the proposed mosque centered on parking. According to the federal complaint, the local ordinance required 50 parking spaces for houses of worship based on a    standard ratio, or an average of three people arriving in one car. But a traffic engineer enlisted by opponents of the mosque recommended 107 spaces. The planning board insisted the mosque meet that goal, which, in turn, raised new issues, like visual impacts and storm water runoff. The society’s complaint stated that applicants “dutifully revised their site plan and brought back professionals to testify time and again, only to find that the board had generated yet more requirements. ” Mr. Fishman said the township “kept moving the goal posts. ” For Mr. Chaudry and other members of the society, the lack of a mosque has made worshiping difficult. The nearest mosque is 25 minutes away. Members have rented a local community center for Friday prayers, lugging in prayer rugs and audio equipment. But the center is unavailable in the summer so they pray in a public park. And the absence of a mosque has prevented the society from attracting a   imam. During public hearings, some residents made   remarks, but town officials mostly restricted their comments to   questions. But in a trove of emails unearthed by the Justice Department investigation, and recently shown to the Islamic Society, the same officials shared their personal views of Muslims. In one email, a member of the township committee, John Malay, wrote, “As a religion, Islam owes its source of influence to a tradition from Day 1 of forced conversion through violent means. ” In an email chain, members of the committee and planning board discussed ways to exclude Mr. Chaudry from a Sept. 11 memorial ceremony in honor of town residents who died in the terrorist attack. “Let’s make it happen without that fool,” John Carpenter, a township committee member, said. Mr. Chaudry is active in local groups like the Rotary Club and statewide committees promoting interfaith understanding. In 2013, Gov. Chris Christie, a Republican, appointed him to the New Jersey Commission on National and Community Service. He also serves on the state attorney general’s Outreach Committee for the Muslim Community and the Interfaith Advisory Council of the New Jersey Office of Homeland Security and Preparedness. Outside the Dutch colonial on Church Street that serves as the society’s offices and where, members hope, a new mosque will one day stand, signs of patriotism abound. A sign amid American flags of various sizes proclaims, “Proud to Be an American. ” “We feel everybody should know that we are American,” Mr. Chaudry said.'"}, "time": 1742564612.6223323}