{"duration": 0.0479123592376709, "input_args": {"text": "'Computer seized in Weiner probe prompts FBI to take new steps in Clinton email inquiry Washington Post \\nRead the letter Comey sent to FBI employees explaining his controversial decision on the Clinton email investigation Washington Post. Consistent with my pet theory that Comey was force to get out in front of this development due to the odds of staff insurrection in the form of leaks. From Lambert via e-mail: \\nBy Comey’s own words under oath in July, there must have been “new and substantial information.” So unless Comey is committing perjury, which the Clinton campaign has not, so far, claimed, this is not a nothingburger, by definition. \\nSo that must have been quite some “briefing.” \\nAlso: “Yesterday, the investigative team briefed me on their recommendation with respect to seeking access to emails that have recently been found in an unrelated case. Because those emails appear to be pertinent to our investigation, I agreed that we should take appropriate steps to obtain and review them.” \\nSo there’s a process, it doubtless takes more than a week, and therefore the Clinton campaign’s talking point of “We don’t know what’s there, so release it all for the sake of the American people” is bullshit, even if you leave out that the emails can’t be released without vetting them for classified information. \\nAlso, if it’s really nasty, do the people the Democrats encouraged to vote early get a Mulligan? \\nClinton urges FBI to explain renewed email inquiry ‘without delay’ Washington Post. As if the FBI has to explain itself to her? \\nDemocrats turn on Comey after he reopens Clinton email wound Politico. How fickle of them. He was their statesman just a few weeks ago…My guess is that Comey told Congress because so many agents in the FBI were unhappy about how the earlier probe had been handled and the the news of the latest batch of e-mails was already all over the FIB (a Freudian typo). Thus Comey felt he had to go public, since it would otherwise be leaked and he judged that to be worse (imagine the wrath of the Republican Congresscritters) \\n2016'"}, "time": 1742562280.7464666}