{"duration": 0.15915608406066895, "input_args": {"text": "'by Outis Philalithopoulos At the beginning of this series , Outis’ ghost embarked on a quest to explore possibly uncomfortable ideas about his identity as a progressive. In the previous episode , the Spirit of Liberalism Past abruptly vanished, and Outis found himself face to face with someone else. “What a cute bunny,” I thought to myself. “But why is she wearing a police uniform?” She stared at me with her big blue eyes and confidently held out her paw. Bemused, I took it. She softly shook my hand. “Hopps, Judy Hopps,” she announced. “Outis Philalithopoulos,” I responded slowly. “And you are?” “I am the Spirit of Liberalism Present!” “I see,” I replied. “Have you seen my movie?” “I’m afraid I’m dead,” I confessed. “So?” she responded undeterred. “So I haven’t seen it.” Her face fell. “Oh,” she said. Then she brightened again. “You just have to see it. The New York Times said it was ‘irresistible.’ And ‘delightful.’ And ‘thought-provoking.’ Not to mention ‘full of savvy jokes.’ Rolling Stone said that it might be ‘the most subversive movie of the year.’” “That sounds nice,” I said. “ And it’s on track to become the second highest grossing movie of the year,” she noted proudly. Hesitantly, I said, “I don’t mean this the wrong way, but are you sure you’re the right Spirit? Or that you weren’t sent to the wrong person?” She stared at me sternly. “Maybe you think that because I’m a bunny I can’t be a real Spirit?” “No, no!” I protested. “I just wondered what you were going to show me.” “Oh! Yes. Yes! My movie. Let’s go!” She grabbed my wrist and in a whirl, I was whisked away. I found myself in a movie theater, where an animated movie called Zootopia was playing, with Judy in the starring role. Watching the movie The city of Zootopia was a beautiful place to live. It was populated by animals who had evolved so they were all vegetarians. Their economy seemed mostly like our own, with buying and selling and corporations and advertising – but no poor people. There was, however, one problem in Zootopia, which was that some animals believed hurtful and wrong things about other animals. In particular, some animals thought that predators still had different DNA from non-predators and so were inherently violent. Also, animals often assumed that bunnies were cute, dumb, fluffy things who couldn’t do anything serious. This was annoying to Judy, but the first two thirds of the movie show her convincing even animals who underestimate her that she is exceptional. She wants to become a police officer, even though the conventional wisdom is that bunnies can’t become cops. She ignores this and becomes valedictorian of the police academy. When she starts work, the police chief doesn’t recognize her ability immediately and puts her on parking duty. Although she is understandably offended at having to do this sort of work, she resolves to show he was wrong about her, and so instead of handing out 100 tickets like she was told to do, she gives out 200 , all before her lunch break. She starts fighting back. She goes over the police chief’s head and gets herself an assignment more reflective of her true abilities. One time, a fox named Nick had tricked her about something and then laughed at her for being liberal and naive. Now she evens the score – she threatens to have Nick thrown in jail for tax violations, and using this leverage, gets him to follow her all over town. She makes him illegally enter private property and go places where he feels threatened. “What a strong, intrepid character,” I thought to myself. As time passes, Nick starts to appreciate how awesome Judy is, and they become friends. She exposes a scandal and everyone realizes that she’s a great cop. Right in that moment, though, she comes face to face with a second adversary: her unconscious mind. In the midst of a press conference, Judy gets asked an awkward question about why the animals involved in a series of incidents were all predators. She doesn’t think about what the right thing to say is, and the first thing that pops into her head is that maybe it’s because predators have different DNA than non-predators. It’s just what the anti-predator animals wanted her to say, and it makes Nick feel terrible. Anti-predator prejudice explodes, although thankfully pop stars speak out against it. Judy tries to get Nick to help her fix things, but Nick is still furious with her. Judy pleads with him: Wait, listen… I-I know you’ll never forgive me, and I don’t blame you. I wouldn’t forgive me either. I was ignorant and irresponsible and small-minded. But predators shouldn’t suffer because of my mistakes. I have to fix this. But I can’t do it without you. And after we’re done, you can hate me, [begins to cry] and… and that’ll be fine, because I was a horrible friend, and I hurt you, and you… and you can walk away knowing that you were right all along – I really am just a dumb bunny. Nick forgives her then, and things work out. They expose a plot by the anti-predator animals, and send the leader, an evil sheep, to jail. All conflict melts away as the animals dance together to the pop singer’s finale. After the movie “What did you think?” the Spirit Judy asked me excitedly. “I’m just so impressed,” I told her. She grinned. “Who would have thought that a billion-dollar corporation like Disney would have the courage to make such a strong statement in support of progressive values?” I went on. “I know!” she said. “It did a great job showing how little things that we don’t think of as bad can be hurtful to others. For example, while you were in the big city, you were carrying around a thing like a can of mace that was made to drive away foxes. And it sort of helped you to feel safe…” She blushed, ashamed. “But it made Nick feel bad, because it implied I thought foxes were dangerous.” “It showed how our attitudes can really affect people’s lives. For example, Nick was making his living as a crook, and you might have thought that it was because times were hard and he had difficulty finding a job…” Judy nodded soberly. “But actually,” she said, “it was all because when he was very young, he had wanted to be nice and good. But then some of the other young animals just assumed that since he was a fox, he had to be untrustworthy, and so he was like, ‘well, then I might as well be untrustworthy.’ “ “In general, your movie didn’t play it safe,” I said. “For example, you’re an open-minded bunny and you always try to treat others with respect. But still, one time you carelessly said something that was really not good. And then, the only way you could return to being a good bunny was to convince yourself that you were truly a bad bunny, and say so publicly.” “Oh, yeah,” Judy said. “Even though I’m really embarrassed that I said those horrible things, at least this way I could model for the children watching the movie how they ought to act when they say something wrong.” “The movie definitely delved into difficult issues,” I agreed. “At the same time, it had plenty of humor. Like there was that time you go to the DMV, and the employees there, the sloths, just operate in a lower gear than the rest of us. Which was hilarious for anyone who’s had to deal with real life public employees.” Judy shook her head. “I was in a hurry and it was just so frustrating. But I know I shouldn’t let it bother me – they can’t help it.” “The movie often combined humor and teaching moments. Like there was the really, really fat police dispatcher, so I just assumed he eats doughnuts all the time. And then he calls you a cute bunny, and you’re very patient with him, and are like, ‘Ooh, uh, you probably didn’t know, but a bunny can call another bunny cute, but when other animals do it, it’s a little…’ And so you deftly addressed the theme of political correctness, but it didn’t feel preachy because then there was a light-hearted moment…” “Right,” Judy laughed, “because he really did have a doughnut stuck in the fat folds of his neck.” “Or when they put the evil sheep in jail at the end,” I went on, “and the other inmates touch her wool ‘cause it’s soft and fluffy, which makes her really mad, because as you explained earlier in the movie…” “… touching a sheep’s wool is a microaggression and it’s not okay,” Judy supplied helpfully. “But she was xenophobic and hurt a lot of people, so when her wool gets touched, technically it’s wrong…” “But it’s also kind of funny,” I concluded. “Another way the movie used humor was to show how it isn’t smart to be prejudiced. For example, your parents sometimes said prejudiced things, but that didn’t make us want to be like them, because after all – I mean, not to be critical or anything – they’re rural, they have a really big family, they’re always saying ‘gosh’ and ‘amen to that,’ they don’t really have ambitions…” Judy fought back a smile. “Yeah, I love them to death, but they’re kind of old-fashioned.” “And so the movie shows,” I went on, “how when you have wrong ideas, your kids just won’t listen to you. Like when you were little, they would try to give you advice, and you would just wander off and they wouldn’t even notice you were gone. Or there was that scene where they tried to get you to bring fox repellent with you to the big city – because a fox had beaten you up one time, and they were worried it would happen again. And you knew that carrying fox repellent was prejudiced, but finally you just said, ‘I will take this – to make you stop talking.’“ Judy laughed. “They mean well, they really do – it’s just that there are some things they don’t really understand.” “On a side note,” I added, “I think it’s really awesome how even though you’re a bunny, you really have the mannerisms of white Millennial upper-middle-class girls down cold.” “Thanks!” she said. “And it just goes to show,” I continued excitedly, “that the right-wingers are totally wrong about us when they say we want to stamp out gender roles and make women exactly like men!” “What… do… you… mean?” she said, her voice full of warning notes. I went on obliviously. “I just mean, you do lots of things in the movie that they wouldn’t have guys do. Like for example, you force Nick to follow you around and do whatever you tell him, and that’s awesome ‘cause it showcases how you’re a strong female character, but if he had forced you to follow himaround…” “That would be controlling and creepy and horrible!” she exclaimed. “Obviously. But Nick wouldn’t do that. So what’s your point?” I wasn’t sure if this conversation was going in a good direction. Instead, I said, “Actually, I’m worried – maybe your time is short. In case we get cut off, what is the most important thing you want me to learn from your visit?” She looked at her watch. “Oh, yes. Yes. I do have to go,” she said. Then she smiled at me warmly. “My final message is, if anyone ever tells you you can’t do anything, or you can’t be anything, don’t believe them. You can .” I looked at her, stricken. “But Judy, I’m dead.” She looked quizzically at me. “So? Look, I know a lot of people assume that dead people can’t do certain things, just because they’re dead. But don’t listen to them. Follow your dreams!” And with a peal of thunder, she was gone, and I was back in the livid marshes. * * * The series will take a break for the weekend and resume Monday, at which point Outis will succeed at putting it all together – sort of. Sources: Uncritical praise of Zootopia from major press outlets: the New York Times , Rolling Stone , the Atlantic , the Guardian , the Washington Post . The Atlantic said Zootopia was “subversive,” while the Times said it “subverted clichés.” Rolling Stone declares “ Zootopia takes chances and doesn’t play it safe. Is it too soon to talk about next year’s Oscars?” The Guardian says that in the movie, “the themes of cultural sensitivity and political correctness are handled with real wit,” while the Post says that the movie is about “the hard work of becoming the best, most open-minded bunny you can be.” The sloth scene is singled out for praise by the Times, the Post, Rolling Stone, and the Atlantic. 0 0 0 0 0 0'"}, "time": 1742628469.3500128}