{"duration": 0.0691075325012207, "input_args": {"text": "'By Thamiel Rosenkreuz Election 2016 , Politicians Behaving Badly , Politics October 30, 2016 Literally Election Fraud: Trump Tells Followers To Vote ‘Four Or Five Times’ To Ensure Race Isn’t ‘Rigged’ Against Him   \\nThe Republicans’ fear of voter fraud may yet come true — mostly because it looks like the Republicans are going to be the ones instigating it, thanks to Donald Trump, who basically told his followers on Sunday to go out and steal the election. “Four or five times” \\nThere’s been a lot of digital ink spilled this election on the delusional claims of voter fraud, but what I think is interesting is that this highlights just how ready the right-wing is to divorce itself from the electoral process entirely . They’ve lost the popular vote five of the last six elections, and if things go the way they’re going and American liberals get out to vote, it’s going to be six of the last seven on the morning of November 9. \\nTrump and the Republican Party would like their followers to believe that this isn’t because their ideology is painfully out of step with the country in modern times. Instead, Trump claims the election will be stolen from him – whether by “Mexicans,” or the media, or a “cabal of international bankers.” \\nBut see, here’s the thing: there is a self-proclaimed billionaire who’s working to undermine the election, and it’s not Carlos Slim — it’s Donald J. Trump and his paranoid loony bin followers, which include a disturbing number of white supremacists, KKK, neo-Nazis, and John Birch dropouts. \\nWhile speaking to a crowd at a rally in Greeley, Colorado late Sunday, Trump once again cast doubts on the mail-in ballots , encouraging people to get another ballot and mail that one in , too. Over and over: \\n“Who has sent their ballots in? And do you think those ballots are properly counted?” Trump asked the audience, to which they replied “No!” \\nTrump continued by expressing his skepticism and telling supporters to go get new ballots to ensure their vote is counted. \\n“ If you go to university center, they’ll give you a new ballot, they’ll void your old ballot, in some places they do that four or five times, so by tomorrow, almost everyone will have their new ballots in. ” \\nCNN said the comment was “stoking skepticism” because they don’t have the wherewithal to call this what it really is: encouraging voter fraud. \\n“Liberal media” my ass. \\nAnd it appears to be having an effect. Some of Trump’s followers have already taken this message to heart, and at least one has already been arrested for it . \\nBetween these clowns and the clowns that are going to “make sure there isn’t any illegal voting at the booths”— i.e, instigate voter intimidation against Hispanics, Arabs, African-Americans and anyone else who doesn’t look like a white Trump supporter — one gets the feeling that election night is going to be a chaotic one. \\nPhoto by Win McNamee/Getty Images Share this Article!'"}, "time": 1742562549.887239}