{"duration": 0.19189167022705078, "input_args": {"text": "'Peak Energy – by Dr. Thomas Levy \\nFor many years, truth be known, cardiologists have just believed that getting a heart attack was bad luck, blaming it on a bad family history, a poor diet, being overweight, or saying “I guess it was just your time, because you haven’t been doing anything wrong.” \\nFor the past century, scientific articles have continued to pour in showing that there are very many risk factors for heart disease, like elevated cholesterol, high blood pressure, diabetes, and so on. There is no question that such risk factors are clearly associated with heart disease, and, when uncontrolled, appear to accelerate its development. But, there IS a missing link that we must discuss right now. ‘Preventative cardiology’ is becoming the new medicine for heart patients \\nIn recent years, cardiology now appears to have collectively realized and accepted that coronary atherosclerosis (arterial narrowing and blockages) never develop in the absence of inflammation in the coronary arterial wall, initially in the endothelium, its innermost layer. As doctors despise treating anything they feel they do not understand, this revelation has helped many of my cardiologist colleagues to feel comfortable that they are no longer treating just ‘unlucky’ individuals, and that they are no longer limited to just taking care of their patients after the heart attack has already occurred. \\nInstead, the thought process is akin to: “Your coronary arteries are chronically inflamed, and we need to minimize that inflammation as best we can.” \\nYet, while the focus has now shifted to coronary artery inflammation, the conclusion is still that a heart attack victim is more unfortunate than anything else, but that there is now a name for that ‘misfortune’: inflammation. Nobody, it seems, is yet ready to ask why the elephant named inflammation is in the room to begin with. Focal coronary arterial scurvy causes the inflammation \\nMost people, including healthcare practitioners, think of scurvy only as a severe vitamin C deficiency throughout the body that rarely occurs any longer in the modern world. And this is correct. However, scurvy also occurs when vitamin C is severely depleted in one tissue or organ while the rest of the body has ample amounts. \\nThis is known as focal scurvy – which often exists in individuals who appear to be otherwise completely healthy. And where there is focal scurvy, there is focal inflammation, as discussed below. \\nNormally, vitamin C is present literally everywhere in the body, both inside and outside the cells. All organs contain it and need it to function correctly and optimally. A point that continues to be missed by many clinicians and even basic researchers is the following: \\nInflammation cannot exist where there is no vitamin C deficiency. Pathophysiologically, inflammation and vitamin C deficiency are the same. \\nThis is because inflammation results in nothing more than increased oxidative stress (prooxidation), and such increased oxidative stress cannot exist where enough vitamin C (antioxidant) is present at the same time. So, any factor that increases oxidative stress consumes a proportionate amount of vitamin C, and any decrease in the ongoing supply of vitamin C to an area of the body allows oxidative stress to go unquenched, and this allows the clinical and laboratory evidence of vitamin C deficiency (aka focal scurvy) to appear. This means that… \\nFocal inflammation is a synonym for focal scurvy. \\nAnd since all disease pathologies feature increased oxidative stress in the affected tissues and cells, it can be further stated that: \\nAll chronic diseases are states of focal scurvy in the affected tissues and organs. \\nSo, in the case of coronary atherosclerosis – we must ask an important question. Why is there always inflammation and a state of focal scurvy in the coronary arterial walls? \\nThe only common way for the coronary artery to become severely deficient in vitamin C is to have pathogenic microorganisms take root there and metabolically consume (oxidize) all, or nearly all, of the vitamin C normally present. When this is occurring chronically, the result is chronic inflammation. \\nIf there is a short-lived infection elsewhere in the body and only transiently releasing pathogens into the bloodstream, inflammation can come and go, and vitamin C levels can be restored. But when the pathogen supply in the blood is continuous, the inflammation remains and even vigorous vitamin C supplementation will typically not resolve that inflammation. That inflammation then becomes the disease, as the macrophages and other immune system agents enter the inflamed area of the coronary artery and try to chronically “cure” the incessant seeding of pathogens. \\nThe increased oxidative stress due to the release of reactive oxygen species from the white blood cells resulting from the chronic inflammation in the absence of the vitamin C is the initiator and primary propagator of the atherosclerotic process. Every cardiologist needs to understand the significance of gum disease \\nFor some years now, the cardiology and dental literature has shown that chronic periodontal disease (infected gums) is clearly “associated” with increased coronary artery disease. While this is true, it is finally becoming clear that this “association” is really cause-and-effect. That is to say, the oral pathogens directly cause the atherosclerosis. \\nMultiple studies now reveal that the blood vessel walls and the atherosclerotic plaques contain the same array of pathogens that are found in the infected gums. In addition, a much higher concentration of these pathogens has been found to be present in the blood clots that acutely and completely block off the coronary artery and cause the heart attack. Yet the literature continues to assert only an “association” between these pathogens and coronary artery pathology. \\nSometimes simple logic just gets tossed out the window. \\nHow could a heart attack-causing blood clot accumulate a high concentration of organisms from blood that is supposed to be completely sterile when cultured? Of course, no researcher is going to resolve gum disease, document the disappearance of coronary inflammation, and then re-infect the gums to show the return of the inflammation. \\nWithout the use of clear-headed logic, the oral pathogen-coronary inflammation connection remains forever a mere “link or association,” and clinicians need not feel compelled to make oral examination and treatment a mandatory part of the treatment of any patient with suspected or documented coronary heart disease. \\nThe chronic infection of root canal-treated teeth is the source of the coronary inflammation for most heart attack patients, probably 70% of the time or so. Chronic gum disease probably accounts for another 20 to 25% of cases. The remainder comes from other unidentified sources chronically seeding pathogens into the blood, like infected tonsils or perhaps even a chronically constipated and pathogen-proliferating gut. A ‘take home’ message for every heart disease patient \\nThe point is that all coronary heart disease patients are not being correctly and completely treated if their mouths have not even been examined or considered in the evaluation and treatment of their condition. \\nIn point of fact, such patients are having the most important reasons for their heart disease being ignored or otherwise neglected. Oral pathogens are the reason for well over 90% of heart attacks, and probably less than 5% of cardiologists and other physicians even know to look for this causative factor. \\nA heart attack patient is NOT just unlucky. Rather, the heart attack patient has an overwhelming likelihood of having a steady supply of oral pathogens and toxins coming from root canal-treated teeth and/or chronically infected gums. \\nBottom line, while nobody likes to get in the dental chair, avoiding the proper dental care and intervention can result in a much sicker and a much shorter life. \\nReferences: Haraszthy et al. (2000) Identification of periodontal pathogens in atheromatous plaques. Journal of Periodontology 71:1554-1560. PMID: 11063387 Mattila et al. (2005) Dental infections and cardiovascular disease: a review. Journal of Periodontology 76:2085-2088. PMID: 16277580 Caplan et al. (2006) Lesions of endodontic origin and risk of coronary artery disease. Journal of Dental Research 85:996-1000. PMID: 17062738 Caplan et al. (2009) The relationship between self-reported history of endodontic therapy and coronary artery disease in the Atherosclerosis Risk in Communities Study. Journal of the American Dental Association 140:1004-1012. PMID: 19654253 Willershausen et al. (2014) Association between chronic periodontal and apical inflammation and acute myocardial infarction. Odontology 102:297-302. PMID: 23604464 Ott et al. (2006) Detection of diverse bacterial signatures in atherosclerotic lesions of patients with coronary artery disease. Circulation 113:929-937. PMID: 16490835 Pessi et al. (2013) Bacterial signatures in thrombus aspirates of patients with myocardial infarction. Circulation 127:1219-1228. PMID: 23418311'"}, "time": 1742564319.161509}