{"duration": 0.09743690490722656, "input_args": {"text": "\"Share on Facebook Edward Snowden believed that the government fundamentally “had noble intents,” as did the American people. However, admitting he was naive, Snowden discusses the upper echelons of government and how they are pervaded with corruption, giving him the understanding that led him to do what he did – whistleblow on mass surveillance programs. Snowden insists that the importance of the citizen in having the right to know and understand the policies that govern us – namely, one in particular, surveillance – and that this right is vital to our democratic functioning. It's important to revisit this notion and ask the question ‘why?’ Why did Edward Snowden whistleblow on the government's surveillance program? Did he have an axe to grind? No. He simply saw a fundamentally flawed system, vitally wrong governing, and asked why haven't the citizens been told? As Snowden points out in a talk he gives, the vast majority of Congress knew nothing about the programs maintained and instituted, nor was the Senate and House fully briefed on covert actions. He points out the political unwillingness, post 9/11 , to confront difficult questions about what was right and wrong, in this regard. Why didn't the public have the opportunity to participate in debate about their security and wellbeing? Why were top officials unaware of this? Only a small handful of officials knew of these ongoing policies. The creation of mass surveillance programs behind closed doors “illustrates” an “institutional momentum” that is “changing the boundaries of the rights that we enjoy as free people in a free society,” Snowden says. Mass surveillance is a critical issue. It still continues to violate civil and political rights. Snowden, however, is arguably only a glitch on the top of the echelon's radar. He can only report on what he knew, not current behind the doors policy, which most government and legal bodies still know nothing about – or are only fed scraps. The system of government has essentially degraded our society. Our democratic processes have eroded away, not allowing us to know about the issues , let alone policy that is still being engaged in. Snowden doesn't claim to have all the answers., but he is able to assist in the steps along the way, ensuring that his efforts aren't in vain and that we don't forget. Snowden eloquently puts it “We have lost the freedom to associate with our judgement.” And that in itself, is where the real danger rests. Related:\""}, "time": 1742562066.967124}