{"duration": 0.06043815612792969, "input_args": {"text": "'Hillary Clinton’s latest narrative of blaming the Democratic National Committee and its “poor” data operation for her election loss has not been greeted kindly by those who worked for the DNC in 2016  —   with a former data director calling her claims “fucking bullshit. ”[Speaking at the annual Code Conference in California Wednesday, Clinton said that when she won the Democratic nomination, she “inherited nothing” from the DNC.  “I mean it was bankrupt, it was on the verge of insolvency, its data was mediocre to poor, nonexistent, wrong. I had to inject money into it,” Clinton said. She then compared it to the Republican National Committee operation, which under   Chair Reince Priebus had bumped up its tech operation after its 2012 defeat. “So Trump becomes the nominee and he is basically handed this tried and true, effective foundation,” she added. Her remarks add the DNC to a seemingly endless set of people and groups she blames for her defeat, including Russia, the FBI, misogynists and the New York Times. But some Democrats are pushing back. Former DNC Data Director Andrew Therriault tweeted that Clinton’s accusations are “fucking bullshit. ” “DNC data folks: today’s accusations are fucking bullshit, and I hope you understand the good you did despite that nonsense,” he tweeted. “Private mode be damned, this is too important,” he added. “I’m not willing to let my people be thrown under the bus without a fight. ” Therriault apparently deleted his tweets, but they were published by The Washington Examiner. However, he left up his retweets of tweets by Democratic strategist Tom Bonier  —   who also criticized Clinton’s remarks. One more: Clinton literally inherited some of the most   staffers I’ve seen, who moved from the DNC to Brooklyn after June.  —   Tom Bonier (@tbonier) June 1, 2017,  Therriault and Bonier aren’t the only Democrats upset with Clinton’s remarks. NBC host Andrea Mitchell accused Clinton Wednesday of “drawing a conspiracy theory” over her claims. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742561936.1715338}