{"duration": 0.16115546226501465, "input_args": {"text": "'De e-mails van Hillary Clinton en de Moslimbroederschap door Thierry Meyssan De FBI enquête betreffende de privé e-mails van Hillary Clinton gaat niet over een nalatigheid ten opzichte van de veiligheidsregels, maar over een complot met het doel elk spoor af te leiden van haar correspondenties die gearchiveerd hadden moeten zijn op de servers van de Federale Staat. Deze kunnen de uitwisselingen omvatten over illegale financieringen of corruptie, andere over de banden tussen de eega’s Clinton en de Moslimbroederschap en de jihadisten.\\nVoltaire Netwerk | Damascus (Syrië) | 6 november 2016 ελληνικά English Español français Türkçe русский Deutsch Português italiano norsk عربي Hillary Clinton en haar kabinetschef Huma Abedin. De heractivering van de FBI enquête in de privé e-mails van Hillary Clinton betreffen niet meer de veiligheidsregels, maar de manipulaties die kunnen gaan tot hoogverraad.\\nTechnisch, in plaats de beveiligde server van de Federale Staat te gebruiken, had de Staatssecretaresse in haar woning een privé server laten installeren, om op die manier het internet te kunnen gebruiken zonder sporen op een machine van de Federale Staat achter te laten. De privé technicus van Mevr Clinton had haar server uitgewist vòòr de aankomst van de FBI, zodat het onmogelijk was te weten waarom zij dit dispositief had ingericht.\\nIn het begin heeft de FBI geobserveerd dat de server niet de beveiliging van het State Department had. Mevr Clinton had dus slechts een veiligheidsfout begaan. Later heeft de FBI de computer van het vroegere congreslid Anthony Weiner in beslag genomen. Deze is de vroegere echtgenoot van Huma Abedin, kabinetschef van Hillary. Daarin zijn E-mails afkomstig van de Staatssecretaresse teruggevonden.\\nAnthony Weiner is een Joods politicus, heel intiem bevriend met de Clintons, die ambieerde burgemeester van New York te worden. Hij moest ontslag nemen als gevolg van een zeer puriteinse schandaal: hij had per SMS erotische berichten naar een andere jonge vrouw dan zijn echtgenote gestuurd. Huma Abedin scheidde officieel van hem tijdens deze agitatie, maar verliet hem in werkelijkheid niet.\\nHuma Abedin is een Amerikaanse opgevoed in Saoedi-Arabië. Haar vader dirigeert een academische revue —waar ze gedurende jaren redactiesecretaresse van was— die regelmatig de mening van de Moslimbroederschap reproduceert. Haar moeder presideert de Saoedische vereniging van de vrouwelijke leden van de Moslimbroederschap en werkte samen met de vrouw van de Egyptische president Mohamed Morsi. Haar broer Hassan werkt voor de sjeik Yusuf al-Qaradawi, prediker van de Broederschap en geestelijke adviseur van Al-Jazeera.\\nTer gelegenheid van een officiële reis naar Saoedi-Arabië bezoekt de Staatssecretaresse het college Dar al-Hekma in het bijzijn van Salehan Abedin (moeder van haar kabinetschef), presidente van de vereniging van de Zusters leden van de Broederschap. Huma Abedin is heden een centraal personage van Clinton’s verkiezingscampagne, naast John Podesta, vroegere secretaris-generaal van het Witte-Huis tijdens het presidentschap van Bill Clinton. Daarnaast is Podesta de vaste lobbyist van het Saoedische koninkrijk in het Amerikaanse Congres voor de bescheiden som van 200.000 dollar maandelijks. Op 12 juni 2016 had Petra, het officiële persbureau van Jordanië, een interview gepubliceerd van de Arabische prins Ben Salmane, die pochte over de moderniteit van zijn familie die illegaal 20% van de presidentscampagne van Hillary Clinton had gefinancierd, hoewel dat een vrouw is. De dag na de publicatie annuleerde het agentschap dit bericht, verzekerend dat zijn site gepirateerd was.\\nVolgens het officiële Jordaanse persbureau Petra van 12 juni 2016 heeft de Saoedische koninklijke familie illegaal 20% van de verkiezingscampagne van Hillary Clinton gefinancierd. Mevr Abedin is niet het enige lid van de Obama administratie die aan de Broederschap verbonden is. De half-broer van de president, Abon’go Malik Obama, is de schatmeester van het Missiewerk van de Broeders in Soedan en president van de Stichting Barack H. Obama. Hij staat rechtstreeks onder bevel van de Soedanese president Omar el-Béchir. Een Moslimbroeder is lid van de Nationale Veiligheidsraad —de hoogste uitvoerende instantie van de Verenigde Staten—. Van 2009 tot 2012 was dit het geval van Mehdi K. Alhassani. Men weet niet wie hem heeft opgevolgd maar het Witte-Huis ontkende dat een Broeder lid was van de Raad tot er een bewijs van opdook. Het is ook een Broeder die ambassadeur van de Verenigde Staten is bij de Islamitische conferentie, Rashad Hussain. De andere geïdentificeerde Broeders bezetten minder belangrijke posten. HLouay M. Safi moet echter worden genoemd, huidig lid van de Nationale Syrische Coalitie en vorig adviseur van het Pentagon.\\nPresident Obama en zijn half-broer Abon’go Malik Obama in het Ovaal Bureau. Abon’go Malik is de schatmeester van het Missiewerk van de Moslimbroeders in Soedan. In April 2009, twee maanden voor zijn redevoering in Caïro, had president Obama in het geheim een delegatie van de Broederschap ontvangen in het Ovaal Bureau. Hij had, voor zijn inhuldiging Ingrid Mattson, presidente van de vereniging van de Moslim Broeders en Zusters in de Verenigde Staten, al uitgenodigd.\\nVan zijn kant heeft de Stichting Clinton voor zijn project « klimaat » als verantwoordelijke Gehad el-Haddadin in dienst genomen, één van de wereldleiders van de Broederschap, die tot dan toe verantwoordelijke was van een televisie uitzending over de Koran. Zijn vader was één van de mede-oprichters van de Broederschap, in 1951; tijdens de her-oprichting door de CIA en de MI6 heeft Gehad de Stichting in 2012 verlaten, op welke datum hij in Caïro de woordvoerder van kandidaat Mohammed Morsi is geworden, en vervolgens die van de Moslimbroeders, op mondiaal niveau.\\nEr van uitgaande dat de totaliteit van de jihadisten-leiders in de wereld voortkomen uit hetzij de Broederschap, hetzij uit de orde van de Soefi’s van de Naqshbandîs —de twee componenten van de Islamitische liga, de Arabisch-Saoedische anti-nationalistische organisatie— zou men wel meer willen weten over de relaties tussen Mevr Clinton en Saoedi-Arabië en de Broeders.\\nHet is trouwens zo dat in het team van haar tegenstander Donald Trump zich generaal T. Flynn bevindt, die poogde zich tegen de creatie van het Kalifaat door het Witte-Huis te verzetten en ontslag nam van de directie van de Defense Intelligence Agency (Militaire Inlichtingendienst) om zijn afwijzing te markeren. Hij gaat hier om met Frank Gaffney, een vroegere « Koude oorlog strijder »,voortaan bestempeld als een « complottist » voor de aanwezigheid van Broeders in de Verenigde Staten te hebben aangeklaagd.\\nHet spreekt vanzelf dat, vanuit het standpunt van de FBI steun aan jihadistische organisaties een misdaad is, wat ook de politiek van de CIA mag zijn. In 1991 had de politie —en senator Kelly— het failliet van de Pakistaanse (hoewel in de Caymaneilanden geregistreerde) bank BCCI geprovoceerd, welke de CIA voor allerlei geheime operaties met zowel de Moslimbroeders als met de latino-amerikaanse drugskartels gebruikte.\\nThierry Meyssan Vertaling\\nBart Ero'"}, "time": 1742564583.0178466}