{"duration": 0.03641390800476074, "input_args": {"text": "'Did a Dakota Access Pipeline Guard Carry an AR-15 Into Peaceful Protests?   \\nLast week, a series of peaceful protests against the Dakota Access Pipeline ended in the arrests of over 140 demonstrators . North Dakota law enforcement used rubber bullets, pepper spray, sound cannons and rubber bullets on the self-named “water protectors,” causing Amnesty International to send in a delegation of “human rights observers” to keep an eye on the tense situation. \\nEvidence of the mistreatment of the peaceful demonstrators continues to emerge in the days since Thursday’s intense confrontation. Shocking new video footage shows what appears to be a private security contractor wielding an AR-15 rifle, and members of the Standing Rock Sioux tribe have since stated that the man attempted to enter one of the main encampments. \\nAmy Goodman from Democracy Now! spoke with Dallas Goldtooth , an organizer with the Indigenous Environmental Network , to discuss the video footage and the escalating aggression by North Dakota law enforcement. \\n“It was a very terrifying moment for a lot of us watching, I mean, to see this man pulling an assault rifle at our water protectors,” Gooldtooth explains. “I think that he’s a security contractor that has been hired by Dakota Access to guard its equipment, from what I believe, or at least to protect, you know, the workers or whatever it may be.” \\nGoodman asks Goldtooth about the security contractor’s intentions. “There’s a variety of accounts, but it was—from what I understood, that was told to me, that he was tasked with also identifying and being within the crowd, watching internally with the crowd, and that there was some suggestion that he might—he might have been tasked with instigating some sort of violence from within the crowd and to garner a reaction from law enforcement,” Goldtooth says. \\nAdvertisement Square, Site wide \\nWatch the full discussion below: \\nIn addition to the possible infiltration by a private security guard, a brush fire began on Saturday night near the main encampment. The water protectors allege that the fire was intentionally set by Dakota Access Pipeline forces. Goodman asked Goldtooth about the mysterious fire and the broader forces of repression working against the peaceful demonstrators. \\n“[I]t was very, very clear that that brush fire that happened was an act of arson by unknown individuals,” Goldtooth says. “But given the recent events with the Dakota Access worker, given the escalation of law enforcement, that, you know, a lot of fingers are pointing towards Dakota Access that—as being a culprit behind this late fire.” \\nWatch the interview below:'"}, "time": 1742562982.8142273}