{"duration": 0.03960275650024414, "input_args": {"text": "\"IT’S OVER: Hillary Clinton Wakes To Devastating News Posted on October 30, 2016 by Prissy Holly in Politics Share This \\nOn Friday, the FBI dropped an unbelievable bomb on Hillary Clinton, announcing they were reopening the investigation into her private server. While Hillary’s previous scandals have had little effect to deter her presidential bid,Â that doesn’t appear to be the case this time. In aÂ stunning turn of events, newÂ evidence is revealing that Democrats are now turning on Hillary by the droves. \\nImmediately after the news hit of the FBI’s new investigation, Hillary held a press conference where she urged Americans to “get out and vote early,” apparently realizing her supporters would change their minds once whatever’s in those emails leaks to the public. But unfortunately for Hillary, her evil scheming is not going to get her off so easy this time around. These same “early voters” she was targeting in her speech have now begun to jump ship, as a devastating new poll reveals. \\nVoting is indeed underway. But in several states, not only has the FBI announcement changed their mind or persuaded them not to vote for Clinton, there are many going to the polls to change their votes,Â The Independent Journal revealed.Â \\nStates allowing voters to change their early votes include many key battlegroundÂ states such as Minnesota, Wisconsin, and Pennsylvania. Reports are revealing that many earlyÂ voters are flocking to the polling offices to switch their votes, proving that the fallout from the reopened investigation is devastating Hillary’s presidential bid. Here's a list of States that will allow early voters to change their early vote following the reopening of the FBI probe. #HillarysEmails pic.twitter.com/ggPZDmgBNw \\n— Jared Wyand đ\\x9f\\x87şđ\\x9f\\x87¸ (@JaredWyand) October 29, 2016 \\nEven liberal-biased polls are revealingÂ a shatteringÂ impact on Hillary’s previous lead. The sameÂ ABC/WaPo poll that had Hillary Clinton up four points Â over Trump early last week now shows them in almost a dead heat.Â As of Saturday, only two points separate the candidates now. \\nSo just how many voters are switching their ballots to Trump? According to one poll conducted byÂ NJ.com, 24% of theÂ 18,029 people polledÂ said they would be ditching Hillary in the light of recent events.Â While some might argue that the online poll is unscientific, even if half that percentage switches sides, it would guarantee a landslide win for Trump. \\nFor months, we’ve been patiently waitingÂ for WikiLeaks to drop a bombshell that would end Hillary. How ironic would it be that in the end, a slime-ball fromÂ Hilary’s own party in the form of Anthony Weiner would be the one to destroy herÂ chance of becoming president? It’s poetic justice if you ask me.\""}, "time": 1742562730.2738614}