{"duration": 0.08028602600097656, "input_args": {"text": "\"‘Terrifying’: AT&T spying on Americans for profit, new documents reveal 'If companies are allowed to operate in this manner without repercussions, our democracy has no future' By Nadia Prupis - October 27, 2016 \\nTelecommunications giant AT&T is spying on Americans for profit and helped   investigate everything from the so-called war on drugs to Medicaid fraud—all at taxpayers’ expense, according to new reporting by The Daily Beast . \\nThe program, known as Project Hemisphere, allowed state and local agencies to conduct warrantless searches of trillions of call records and other cellular data—such as “where a target is located, with whom he speaks, and potentially why”—for a massive range of investigations, the Beast ‘s Kenneth Lipp reports. In one case examined by the news outlet, a sheriff’s office in Victorville, California used Hemisphere to track down a homicide suspect. \\nHemisphere was first revealed by the New York Times in 2013, but was described at the time as a “partnership” between AT&T and drug enforcement agencies used in counter-narcotics operations. \\nNeither, it turns out, is entirely true. \\nLipp writes: AT&T’s own documentation—reported here by The Daily Beast for the first time—shows Hemisphere was used far beyond the war on drugs to include everything from investigations of homicide to Medicaid fraud. Hemisphere isn’t a “partnership” but rather a product AT&T developed, marketed, and sold at a cost of millions of dollars per year to taxpayers. No warrant is required to make use of the company’s massive trove of data, according to AT&T documents, only a promise from law enforcement to not disclose Hemisphere if an investigation using it becomes public. \\nThe details were revealed as AT&T seeks to buy out Time Warner in a mega-merger that media watchdogs are warning would create “dangerous concentrations of political and economic power.” \\nEvan Greer, campaign director at the digital rights group Fight for the Future, said Tuesday , “The for-profit spying program that these documents detail is more terrifying than the illegal [National Security Agency] surveillance programs that Edward Snowden exposed. Far beyond the NSA and FBI, these tools are accessible to a wide range of law enforcement officers including local police, without a warrant, as long as they pay up.” \\n“It makes me sick to my stomach thinking about it,” Greer said. \\nWhile the government can request that private companies hand over user data, the documents show that AT&T went above and beyond to make the operation profitable, Lipp writes. ACLU technology policy analyst Christopher Soghoian told the Beast , “Companies have to give this data to law enforcement upon request, if they have it. AT&T doesn’t have to data-mine its database to help police come up with new numbers to investigate.” \\nAnd because the contract between the telecom company and the U.S. government stipulates only that agents not speak about Hemisphere if a probe using it becomes public, investigators may be left with no choice but to create a false narrative to explain how they obtained certain evidence, according to Electronic Frontier Foundation (EFF) attorney Adam Schwartz. \\n“This document here is striking,” Schwartz told Beast . “I’ve seen documents produced by the government regarding Hemisphere, but this is the first time I’ve seen an AT&T document which requires parallel construction in a service to government. It’s very troubling and not the way law enforcement should work in this country.” \\n“At a minimum there is a very serious question whether they should be doing it without a warrant. A benefit to the parallel construction is they never have to face that crucible. Then the judge, the defendant, the general public, the media, and elected officials never know that AT&T and police across America funded by the White House are using the world’s largest metadata database to surveil people,” he said. \\nGreer added: “Customers trusted AT&T with some of their most private information, and the company turned around and literally built a product to sell that information to as many government agencies and police departments as they could. Not only did they fail to have any safeguards to prevent unauthorized use of the data, they actually required law enforcement to keep the program secret and dig up or fabricate other evidence, to hide the fact that they’d received information from AT&T.” \\nFight for the Future called on AT&T to shut down the program and on the U.S. Department of Justice to investigate Hemisphere and reveal all the cases in which it was used. \\n“If companies are allowed to operate in this manner without repercussions, our democracy has no future,” Greer said.\""}, "time": 1742563713.252705}