{"duration": 0.04546689987182617, "input_args": {"text": "'This article is part of a series aimed at helping you navigate life’s opportunities and challenges. What else should we write about? Contact us: smarterliving@nytimes. com. Acne can be an embarrassing problem that seemingly no amount of expensive creams and ointments can resolve. But research suggests that in some cases, what you put in your mouth may be as important as what you put on your skin. “I’ve had a lot of patients who get their acne under control just by changing their diet,” said Dr. Daniel J. Aires, a researcher and dermatologist at the University of Kansas Hospital in Kansas City. Dr. Aires said that over the years there have been many studies on the link between various foods and acne, and the strongest evidence can be summarized in three takeaways: ■ Avoid sugary and starchy foods that have a high glycemic index, meaning they cause blood sugar levels to rise rapidly. ■ If you eat dairy products, avoid   dairy varieties. ■ Eat plenty of very colorful plants and produce. Some of the most compelling evidence comes from research looking at the relationship between acne and high glycemic foods like sugar, white bread, white rice, pasta and other simple carbohydrates. Highly processed and refined carbohydrates tend to have little or no fiber and generally cause blood sugar levels to spike. (Related: How to form healthy habits in your 20s) Dr. Aires pointed to a study published in July in the Journal of the American Academy of Dermatology that found that diets containing a lot of high glycemic foods were strongly linked to acne. Some small clinical trials have found that cutting back on these foods can help to reduce acne lesions in teenagers and young adults. Scientists aren’t sure why, but one reason may be that high glycemic foods not only cause blood sugar levels to rise but also prompt the release of various hormones, such as insulin,   and growth hormone, which can exacerbate acne. Other research has pointed to a link between dairy products and acne development. But multiple studies have found that it is   dairy in particular that causes problems. Dr. Aires said the underlying reason might also be hormones. “Milk has a lot of growth factors in it which, in general, may be promoting acne,” he said. “My guess is that those get more concentrated when you take out the fat. ” He tells his patients who eat dairy products to avoid the   options. “If you’re going to eat cheese, eat the regular cheese,” he said. Finally, Dr. Aires, who is also the director of the dermatology division at the University of Kansas Medical Center, also recommends that people eat foods with high levels of polyphenols, which are plant compounds that help to lower inflammation. Polyphenols tend to be found in deeply colored foods like berries, green tea,   olive oil, herbs, dark chocolate, green vegetables and red wine. So in summary, eat a diet full of real, whole foods without too much sugar or refined carbohydrates  —   and eat plenty of plants and vegetables, Dr. Aires said. “Lots and lots of vegetables,” he added. Want more? You might also like: • Ask Well: A cure for rosacea? • The 8 health habits experts say you need in your 20s • Are you ready for mask bingeing?'"}, "time": 1742561768.4700887}