{"duration": 0.08554530143737793, "input_args": {"text": "'  \\nTrump spent five years spreading racist lies meant to convince people Barack Obama wasn’t born in the United States. He spent the 2016 election calling him the worst president of all time. And upon finally meeting President Obama face-to-face… he now says he likes him? \\nIn one of the oddest tweets Trump has ever sent, the president-elect said he had a “really good meeting” and “great chemistry” (what?) with Obama. He added that his wife really liked Michelle Obama, as well. A fantastic day in D.C. Met with President Obama for first time. Really good meeting, great chemistry. Melania liked Mrs. O a lot! \\n— Donald J. Trump (@realDonaldTrump) November 11, 2016 \\n“Chemistry?” Really? What a creep. \\nThe feeling did not appear to be mutual. After the meeting, Press Secretary Josh Earnest said that the two men had views that were so radically different from one another that neither man even tried to discuss them during their first meeting. Obama also reiterated that he stood by calling Trump “ unfit ” for office. \\nAsked whether the President still considers Trump “temperamentally unfit” and “uniquely unqualified” after the pair met for the first time Thursday morning, Earnest said that Obama stood by those remarks. \\n“Look, the president’s views haven’t changed,” Earnest said. “He stands by what he said on the campaign trail. He had an opportunity to make his argument. He made that argument vigorously. He made that argument in states all across the country. But the American people decided.” \\nIt was also reported that the Obamas decided to cancel a photo op with Donald and Melania Trump scheduled for after the meeting. (The White House denied that anything was meant by the cancellation, naturally.) \\nTrump’s sudden aboutface on Obama only reinforces what many had suspected all along. His nasty remarks, his damaging rhetoric, his vicious smears on the president were all lies he used as a blunt force instrument to convince his base to vote for him. He knew they were lies when he said them, he simply didn’t care if they were being used to destroy Obama’s reputation to get what he wanted. Now that he’s won the election, those lies have outgrown their usefulness. \\nBut lest one think this represents a “pivot” to maturity, just eight minutes later, he promptly descended into a temper tantrum unbecoming of a president. Just had a very open and successful presidential election. Now professional protesters, incited by the media, are protesting. Very unfair! \\n— Donald J. Trump (@realDonaldTrump) November 11, 2016 \\nThe man who up until the day of the election was screaming about rigged voting machines and illegal voters suddenly thinks protesting his election is “very unfair.” He also tapped into his favorite few scapegoats –“professional protesters” (i.e. Democrats) and the media. In one tweet, we get a glimpse at just how ugly Trump’s administration will be. People who criticize him will be publicly attacked by the president himself. The media who covers him will be demonized. And Trump will spend more time whining than governing. \\nPathetic. \\nFeatured image via Justin Sullivan/Getty Images Share this Article!'"}, "time": 1742563595.223357}