{"duration": 0.12596607208251953, "input_args": {"text": "'WASHINGTON  —   Thirty years as a union boss in Indiana have given Chuck Jones a thick skin. But even threats to shoot him or burn his house down did not quite prepare him for becoming the target of a verbal takedown by the next president of the United States. In what one Republican strategist described as “cyberbullying,”   Donald J. Trump derided Mr. Jones on Twitter, accusing him of doing “a terrible job representing workers” and blaming him for the decisions by companies that ship American jobs overseas. The Twitter message from the   at 7:41 Wednesday night, and a second one urging Mr. Jones to “spend more time working  —   less time talking,” continued Mr. Trump’s pattern of digital assaults, most of them aimed at his political rivals, reporters, Hollywood celebrities or female accusers. On Tuesday morning, Mr. Trump used Twitter to assail Boeing for escalating costs on the development of a new Air Force One. But rarely has Mr. Trump used Twitter to express his ire at people like Mr. Jones, the president of United Steelworkers Local 1999, who described himself on Thursday as “just a regular working guy. ” With the full power of the presidency just weeks away, Mr. Trump’s decision to single out Mr. Jones for ridicule has drawn condemnation from historians and White House veterans. “When you attack a man for living an ordinary life in an ordinary job, it is bullying,” said Nicolle Wallace, who was communications director for President George W. Bush and a top strategist to other Republicans. “It is cyberbullying. This is a strategy to bully somebody who dissents. That’s what is dark and disturbing. ” Robert Dallek, a presidential historian, called the verbal attack unprecedented and added: “It’s beneath the dignity of the office. He doesn’t seem to understand that. ” Frank Sesno, a former CNN Washington bureau chief and now the director of the School of Media and Public Affairs at George Washington University, said Mr. Trump’s willingness to weaponize his Twitter feed, especially against people who are not political rivals, could produce a chilling effect on people willing to publicly criticize the president. “Anybody who goes on air or goes public and calls out the president has to then live in fear that he is going to seek retribution in the public sphere,” Mr. Sesno said. “That could discourage people from speaking out. ” Wednesday night’s Twitter message from Mr. Trump came after Mr. Jones, on the CNN program “Erin Burnett OutFront,” challenged the  ’s claims. Mr. Jones challenged Mr. Trump’s claim to have saved 1, 100 jobs in Indiana at Carrier Corporation from being shipped overseas and said that 350 of those jobs were already staying in the United States. As Mr. Jones spoke, a graphic flashed across CNN’s screens at 7:20 p. m. referring to something Mr. Jones said earlier in the week: “Carrier Union Boss: Trump Lied His A** Off. ” Less than 20 minutes after Mr. Jones’s interview ended, Mr. Trump’s Twitter message appeared. Mr. Jones said he had just walked back into his house and hung up his coat when he got a call from a friend. “Trump’s hammering you on a tweet,” the friend said, prompting a laugh from Mr. Jones. In the control room at CNN, a planned story on immigration was scrapped, and a booker went scrambling to get Mr. Jones back on the air to respond. Mr. Trump’s message to his 17 million Twitter followers set off threats and other harassing calls to Mr. Jones. One caller left five   messages, and two secretaries answering phones at the local’s headquarters have been similarly swamped. “It’s riled the people up,” Mr. Jones said. “A lot of the people who have called and been not very nice to me, they have been quite clear that they are Trump supporters and I’m an ungrateful   . ” Mr. Jones refused on Thursday to back down from his criticism of Mr. Trump. And he shrugged off Mr. Trump’s claim that he had not done enough to help the workers his union represents. “Hell, I know what I did for the last 30 years,” Mr. Jones said, noting his work on behalf of pensions and salaries that average $23 per hour. But Mr. Jones also said that he and the   have been on the same side when it comes to trying to protect the livelihoods of   workers. He said he would happily collaborate with Mr. Trump to try to save the 550 Carrier jobs still scheduled to be moved to Mexico. “If he in fact called today, and said, ‘Let’s get together to save the 500 jobs,’ I’d be glad to do anything I possibly could to work with him in any fashion,” Mr. Jones said. “I don’t foresee that happening. ” Veterans of the White House say they do not know what to expect from Mr. Trump, whose actions since the election have broken with many presidential norms. David Axelrod, who was a senior adviser to President Obama, said he always advised the current occupant of the Oval Office to be mindful of the extra power that his words carried once they were amplified by the most powerful megaphone in the world. “What you may think is a light tap is a howitzer,” Mr. Axelrod said. “When you have the man in the most powerful office, for whom there is no target too small, that is a chilling prospect. He has the ability to destroy people in 140 characters. ” Throughout the campaign, Mr. Trump dashed off Twitter messages in response to what he saw on television, sometimes calling out specific television personalities like Megyn Kelly or Joe Scarborough by name. Mr. Trump has not stopped since he won the election. When he abruptly took to Twitter on Nov. 29 to attack those who burn the American flag, it happened shortly after a “Fox  Friends” segment about a   incident. In recent weeks, Mr. Trump retweeted several people who were bashing the CNN reporter Jeff Zeleny, and he has been critical of “Saturday Night Live” and the show’s Trump impersonator, Alec Baldwin. Whether Mr. Trump will continue to use Twitter as president is unclear, though few people inside or outside Mr. Trump’s orbit believe he will give up his digital connection to millions of followers. Two spokesmen for Mr. Trump did not respond to emails seeking comment on his Twitter message about Mr. Jones. If he continues to tweet, Mr. Trump may discover that his words carry new weight and are given new meaning when they come from the White House. Ms. Wallace said he may end up having meetings with world leaders that do not go well, and be tempted to tweet his disapproval. “It’s irrevocable what you put out in a tweet. It’s not like you can take it back,” Ms. Wallace said. But she added that she does not expect Mr. Trump to change his behavior once he is inaugurated. “There can be a transformation when you get into the office, but it’s usually on policy, not behavior,” she said. “I’m not sure that the office will change his nature. ”'"}, "time": 1742563492.4625516}