{"duration": 0.28803038597106934, "input_args": {"text": "'Washington War Party Urges Obama to Go to War Against Assad & the Russians \\nClinton fans call on Obama to “save Aleppo” as NATO-GCC-backed ‘rebels’ prepare new offensive Originally appeared at Newsbud \\nOn October 21, The Washington Post published a noteworthy op-ed titled “Bring Syria’s Assad and his backers to account now,” written by retired U.S. Marine General John Allen and self-proclaimed Syria expert Charles Lister. Allen is a senior fellow at the Brookings Institution and serves on the board of advisors of The Washington Institute for Near East Policy (WINEP), an American Israel Public Affairs Committee (AIPAC) cutout. The retired four-star general attracted a lot of attention earlier this year when he delivered a forceful endorsement of Democratic presidential nominee Hillary Clinton at the Democratic National Convention. \\nLister was formerly a visiting fellow at the Brookings Doha Center in Qatar and is now a senior fellow at the Washington, D.C.-based Middle East Institute, which describes itself as “an unbiased source of information and analysis” on the Middle East and partners with corporations such as Northrop Grumman, Raytheon, Chevron, ExxonMobil and Saudi Aramco. Lister has dismissed conflict of interest allegations by saying his contact with the Syrian opposition “had absolutely nothing to do with Qatar” and stressing that his “work on this is 100% funded by Western govts.”[1] \\nAllen and Lister harshly criticize U.S. “inaction” in Syria in their October 21 op-ed, emphasizing that “the Assad clique and its backers must be brought to account before it is too late.” \\nThe authors’ case rests on the premise that U.S. policy in Syria has been characterized by inaction and “has never sought to decisively influence the tactical situation on the ground.”[2] \\nSince the beginning of the conflict, advocates of greater U.S. military involvement have tried to promote the myth of “U.S. inaction in Syria.” \\nEven after U.S. media disclosed the existence of a CIA weapons supply and training program in summer 2012, efforts to promote this myth continued unabated. \\nIn early 2013, about eight months after The Washington Post first reported that the United States is coordinating the flow of weapons to the so-called “Syrian rebels,”[3] the editorial board of The Washington Post warned of the “consequences of U.S. inaction in Syria,” accusing the Obama administration of not doing enough to support the “rebels.”[4] \\nNeither The Washington Post nor any other major media outlet in the United States has been willing to publicize the true extent of U.S. covert operations in Syria, which started as early as April-May 2011.[5] \\nFrom the very beginning, U.S. policy sought to decisively influence the tactical situation on the ground in favor of the foreign-backed anti-Assad opposition. But instead of exposing the U.S.-led war on Syria, the media has been feeding into the false narrative of “U.S. inaction in Syria.” \\nReferring to this narrative, Allen and Lister call for accelerating and broadening the provision of lethal and nonlethal assistance to “vetted moderate opposition groups.”[6] \\nThe United States’ vetting process of militias plays a central role in all of Lister’s policy proposals.[7] What Lister fails to mention is that this vetting process consists of nothing more than trace searches in old databases and half-hearted interviews. U.S. Special Forces soldiers on the ground in Turkey and Jordan told SOFREP that many “rebels” had sympathies with terrorist groups but knew exactly how to sell themselves during such interviews.[8] \\nAs U.S. Special Forces soldiers on the ground voice their indignation over a mission that nobody believes in because they are just training the next generation of jihadis, Allen and Lister want to increase U.S. assistance to “vetted” groups in order to “save Aleppo,” which has become the focal point of the Syrian conflict: \\n“For a start, the United States must save Aleppo. Damascus, Moscow and Tehran are razing the city to prepare for an eventual ground assault. As both the CIA and Pentagon have concluded, an opposition loss in Aleppo would severely undermine the United States’ counterterrorism objectives in Syria. The city’s symbolism and strategic value are unmatched, and allowing it to fall would dramatically empower extremist narratives. Groups linked to al-Qaeda would reap the rewards of our shortcomings.”[9] \\nAt the beginning of October, just hours after the U.S. suspended talks with Russia over Syria, The Washington Post reported that the CIA and the Joint Chiefs of Staff are pressuring President Obama to approve “kinetic actions” against Syrian government forces, arguing that an opposition loss in Aleppo “would undermine America’s counterterrorism goals in Syria.”[10] \\nGiven the fact that the opposition in “rebel-held” eastern Aleppo is led by Jabhat al-Nusra, this argument seems rather dubious.[11] Despite rebranding itself as “Jabhat Fatah al-Sham” and supposedly cutting its ties with al-Qaeda, the group is still considered a terrorist organization by the United States and the United Nations. Another group present in eastern Aleppo, Ahrar al-Sham, is also closely tied to al-Qaeda.[12] \\nIt is not exactly clear why “groups linked to al-Qaeda would reap the rewards” if groups linked to al-Qaeda are defeated in eastern Aleppo or why their defeat “would severely undermine the United States’ counterterrorism objectives in Syria.” \\nIf Allen and Lister want to stop empowering extremist narratives, they could start by revising their portrayal of the battle of Aleppo and the Syrian conflict in general. \\nNusra and its allies are not defending civilians in eastern Aleppo, as frequently claimed, but holding them hostage in order to maintain a foothold in the strategic city, which was invaded by “rebels” in summer 2012 after refusing to join the uprising. \\nAs soon as Syrian government forces and their allies first managed to encircle the “rebel-held” areas of Aleppo in July of this year, they announced the opening of humanitarian passages for civilians and surrendering fighters. According to the pro-opposition Syrian Observatory for Human Rights (SOHR), only “around 12 people managed to use the Bustan al-Qasr corridor before rebel groups reinforced security measures and prevented families from approaching the corridors.”[13] \\nInstead of telling the “rebel groups” in eastern Aleppo to stop holding civilians hostage, the United States and its allies supported a major offensive led and organized by al-Nusra to break the siege and “put some pressure back on Russia and Iran.” \\nOne Western diplomat tried to play down the outside support, saying: \\n“The rebels’ problem has never been a lack of weapons. This was internally planned, and it succeeded not because of outside support but because Fatah al-Sham and the other jihadi groups are incredibly disciplined, with plenty of guys willing to blow themselves up at the front.”[14] \\nNusra, Ahrar al-Sham and other involved groups referred to the Aleppo offensive as the “Ibrahim al-Youssef battle,” a reference to the Syrian army officer who led the Aleppo Artillery School Massacre in the late 1970s. \\nIn June 1979, Ibrahim al-Youssef and members of a Muslim Brotherhood splinter group killed dozens of Alawite cadets after separating them from their Sunni colleagues. During the July-August Aleppo offensive, a spokesman for the Nusra-led forces said they would continue what Ibrahim al-Youssef had started and kill the Alawites.[15] \\nIbrahim al-Youssef’s son Yasser is a political representative for the U.S.-vetted “rebel group” Harakat Nour al-Din al-Zinki, which participates in the battle of Aleppo and lately joined the Nusra-led military alliance Jaish al-Fatah. Zinki is probably best known for beheading a child captive on camera. The group reportedly lost U.S. backing in August or September of last year and was in talks with the U.S. over the restoration of its support when the incriminating footage emerged.[16] \\nYasser al-Youssef has become the media’s go-to-guy for information about the “rebels” in and around Aleppo. After the Syrian government and its Russian allies recently announced a unilateral cease-fire to allow civilians and surrendering fighters once again to leave eastern Aleppo, Agence France-Presse (AFP) quoted Yasser al-Youssef as saying that opposition fighters wanted “nothing to do” with the Russian initiative and asking: “Who are they to decide to displace the Syrian people who rebelled against the dictator Assad?”[17] \\nMeanwhile, the Associated Press (AP) quoted Zinki’s al-Youssef as saying that the opposition had agreed to the initiative to evacuate wounded and allow in aid. According to al-Youssef, the evacuations didn’t materialize because the Syrian government and Russia gave no assurances the wounded would not face arrest.[18] \\nAs both sides were blaming each other for the breakdown, Western journalists on the ground confirmed that “rebels” were firing on the checkpoints and exit corridors, making it extremely dangerous for anyone to leave eastern Aleppo.[19] \\nWhen Allen and Lister say “the United States must save Aleppo,” they are not referring to the civilians in eastern Aleppo who are being held hostage by the “rebels” or to the civilians in western Aleppo who are being killed by indiscriminate “rebel” shelling. They are referring to al-Nusra, Ahrar al-Sham, Zinki and other “rebel groups” in eastern Aleppo. \\nOn the same day the Allen-Lister op-ed was published, Lister gleefully announced on Twitter that Ahrar al-Sham, Zinki and allied militias are preparing another offensive to break the siege of Aleppo. Nusra will of course join the fight, but “the impetus and most of the planning for this offensive largely excluded” the terrorist group, as the PR disaster during the July-August offensive is still fresh on everyone’s mind. “Regional states have provided substantial support to buttress the offensive,” according to Lister.[20] \\nU.S. allies Turkey, Saudi Arabia and Qatar already provided substantial support to buttress the July-August Aleppo offensive – with the full blessing of the United States.[21] Washington’s primary objective was to put some pressure back on Russia and Iran, not to save civilians. As before, the new offensive is going to prompt an adequate response from Russia and its allies, thereby prolonging the suffering of civilians in Aleppo. \\nWith current U.S. policy leading nowhere, the Obama administration is divided over Syria. Whereas the hawks around CIA director John Brennan and Defense Secretary Ashton Carter want to escalate the conflict, President Obama and Secretary of State John Kerry are increasingly skeptical of such plans. \\nObama is reportedly not willing to approve plans to supply CIA-vetted militias with more powerful weapons. \\nOne senior U.S. official told The Washington Post that CIA-backed units are “not doing any better on the battlefield, they’re up against a more formidable adversary, and they’re increasingly dominated by extremists,” raising the question of whether the program can accomplish anything beyond adding to the carnage in Syria.[22] \\nThe Lister-approved vetting process is apparently not working. \\nMoreover, the sceptics in the administration fear that the new weaponry could end up killing Russian military personnel and they want to avoid risking a confrontation with Russia. \\nBut not everyone shares this opinion. \\nDue to his reluctance to escalate the conflict in Syria, Obama has alienated Washington’s foreign policy establishment, which favors more U.S. military action, including cruise missile strikes on Syrian government forces.[23] \\nThat is also a key point of the Allen-Lister plan. \\nWhen The Washington Post first reported on U.S. plans to target Syrian government forces, Russian Defense Ministry spokesman Major-General Igor Konashenkov stressed that Russian troops were now widely deployed across Syria, implying that any such attack would run the risk of killing Russian soldiers.[24] \\nAllen and Lister are of course aware of this risk. Explaining how to punish cease-fire violations by Syrian government forces with U.S. military action, they note in passing: \\n“We should expect the possible intentional co-mingling of Syrian and Russian forces and assets as a deterrent. While this may complicate targeting strategies, we should not miss the opportunity to hit offending Syrian elements and units, while sustaining counter-Islamic State operations elsewhere.”[25] \\nNeither Allen and Lister nor Washington’s foreign policy elite seem to mind risking a direct military confrontation with Russia. But President Obama and other sceptics in the administration don’t want to start World War III over Syria, as one senior administration official who is involved in Middle East policy emphasized: \\n“You can’t pretend you can go to war against Assad and not go to war against the Russians.”[26] \\nWhile the war party in Washington is waiting for Obama to leave office, Russia is preparing for a showdown in Syria with the largest surface deployment since the end of the Cold War.[27] \\nAs Allen and Lister point out, the war party “cannot wait for a new administration in Washington” because “events are moving too quickly.”[28] They may have lost Aleppo by the time Hillary Clinton takes office.[28] \\nSo Obama might have to deal with more “accidents,” such as the September 17 Deir Ezzor attack, during his last months as President of the United States. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742561927.0969589}