{"duration": 0.10314679145812988, "input_args": {"text": "'by Tanaaz \\nThe October 30th New Moon falls in the dreamy and introspective sign of Scorpio. Even though Scorpio energy can be deep and dark, there is a way to channel this energy into something productive and even, magical. \\nThe energy of the October New Moon is going to guide us away from the material and external world and into a deeper, more intuitive realm. Here we will be able to receive new ideas, new inspirations and new creative visions. \\nIn fact, the energy of this New Moon has a high creative and supernatural charge to it and we will all be guided to go deep within, so we can remind ourselves about who we really are. \\nThere has been a lot of cleansing and releasing energy in the Universe this year, and while October’s New Moon will be asking us to go deep, it will be asking us to venture deeper than our problems and deeper than our fears, all the way into the heart of our soul. \\nThis New Moon is about reconnecting with who you are, celebrating yourself and learning how to love and accept yourself exactly as you are. \\nThere is also a transformative energy to this New Moon, which will be allowing us to emerge reborn. \\nThis transformative energy is gentle, supportive and calming. It will be reminding us to nurture and care for ourselves. It will also be reminding us that sometimes the greatest healing we can offer ourselves is our own true love. \\nScorpio energy supports us to dive deep into our imagination and intuition. Use the force of this New Moon to travel within and get lost in the fairytales of your mind. Use the energy to inspire your creative visions and to expand your intuition. \\nThe New Moon also falls just one day before All Hallows Eve , making the Scorpio New Moon even more magical. \\nHalloween is a time when the veil between dimensions is thinnest and this New Moon will definitely be amplifying this energy. \\nSpirit energy will be high around this New Moon, so it is important to protect yourself energetically and stay open to any Divine messages or inspiration you may receive. \\nIn fact, if there is something that you have been looking to receive guidance on, this New Moon will allow you to take the journey within so you can hear the answer radiating from your own soul. \\nThe Scorpio New Moon will also allow us to take a journey into the underworld. \\nThe underworld is our subconscious and the deeper, darker, more intuitive side of who we are. It is when we are in this place that we can truly understand the power and magnificence of our own light. \\nBy losing our attachment to the external and going deep into the energy of the night, we will be able to realize and feel our potential shining through. \\nFor those who already experienced a New Moon on October 1st, this second New Moon will be a Black Moon. \\nWhile the energy of the Black Moon is the same, there is a heightened energy when two New Moon’s fall in the same month. Those experiencing the Black Moon are going to feel the effects even stronger and will be encouraged to dig that little bit deeper. \\nThis digging process is not about assessing, reviewing or analyzing, instead this digging process is about feeling. It is about feeling the soil and the earth around you, it is about feeling who you really are and allowing yourself to get lost in You. \\nWe are not our bodies and we are not our thoughts. We are soul energy and when we can travel within to feel this soul energy, we intuitively gain an understanding about who we are and where we are heading. \\nIf you allow the energy of the Scorpio New Moon in, you are going to be able to feel your soul; you are going to be able to feel your energy on a powerful level and you are going to be able to transform yourself with the power of your own love. \\nThe October New Moon is beautiful, magical and supportive, so allow its energy to guide you. Allow yourself to be taken by the energy and see where you travel to. Share:'"}, "time": 1742561901.1050422}