{"duration": 0.19792938232421875, "input_args": {"text": "'By Smoking Mirrors on October 29, 2016 Smoking Mirrors — Oct 29, 2016 Dog Poet Transmitting……. Chances are better than not that Trump might win this election. Of course, with the Soros voting machines and the collective hatred of the privileged toward those being ground to dust beneath their hobnailed boots, it’s a no brainer that the election will be hijacked no matter what. The biggest enemy of humanities liberation from the cesspools of manufactured darkness has been human ignorance. For whatever the reason, in this apocalypse, people are waking up and becoming angry. They are seeing Clinton for the international mass murderer and criminal that she is. It turns out to be less a vote for Trump than it is a vote against Hillary. The key evidence to support this particular argument is that few people are showing up for Hillary rallies and speeches and large crowds are attending Trumps. The degree of anti-Trump bias in the media is beyond anything previously seen and the polls, as we know, are bullshit. I haven’t spoken to a single person here, on our aborted trip, or anywhere that was not for Trump and… I have spoken to a lot of people. It’s pretty good crowd sampling as it covers several states and pedestrian locations in those states. An associate of mine named Bill Juhas tells me that as he sees it, Obama plans on pardoning Hillary for all of her crimes and in return, Hillary will appoint him to the Supreme Court. That makes a strange kind of sense. I do not doubt the possibility of anything these fiends might attempt to throw at us. What Obama has done to American culture is about as obscene as it gets. He should be locked in a very small gender neutral bathroom with a bipolar tranny for all eternity. My only hesitation in passing this on to the authorities who control these placement duties is that he might like it. Our trip was aborted because the psychic and ethereal, material ethers were vibrating with a type of manic panic, the like of which I have not previously encountered. Turning around and heading back the way we came had an immediate salutary effect on all of our senses of well being and the potential lack thereof. Your friendly author has not always exercised the common sense and native judgment that was available to him. We’re trying transform that tendency into something useful out of the shards of former stupidities. There have been a few dustups in these environs of late and some amount of crazy email spamming as well (these are not connected). We didn’t bother to read the emails and we tried to exercise detachment in respect of the former. Now we will turn to the point of this exercise which is only tangentially associated with the garbage time antics of a handful of dysfunctional psychopaths, or what they may be planning to do to screw things up for the rest of us; not the least of which is to generate an economic disaster of Godzilla like proportions, to render us terrified and malleable. Economic disasters do not come about on their own. They are manufactured by Satanists and as we have said here on more than one occasion, one does not have to be an initiated Satanist to be a Satanist. Anyone who behaves like one is one. What we would like to talk about, here, in the waning moments of same old same old, is a most subjective thing. It has to do with my own intuition. It has to do with what I am feeling, as I scan what I am able to see of the world around me; close at hand and at a further remove. It has to do with the way information feeds into my consciousness and then reassembles itself into projections for the future. As we know, there really is no such thing as the future but… for the sake of argument… I feel no apprehension whatsoever. I feel as if it is all in the process of working itself out in a most wonderful and serendipitous way. This does not mean that millions will not die, due to this possible schematic or that possible schematic. We live in a collected universe in which we are all a universe unto ourselves and the possibilities of what might and might not happen are endless, as is the pointlessness of speculation. We live in a time of experts who can’t find their ass with both hands. Let us consider that hundreds of millions, billions will die whether anything happens or not because that is the nature of mortal terms of being. That is the nature of each of our individual leases on life. A catastrophe can sweep the planet. A ruinous war can escalate to the point of no return, by which few or none return from it. Anything might and might not happen in this unpredictable world but what I do know is that it is all under control and in the hands of the most far seeing and benevolent power; the most absolute and unassailable power that there is or ever was. I had been told this a long time ago; a long time ago in relative terms and a tiny blip of time otherwise. I heard it but I did not hear it because I did not understand it but now I do. I have come to understand the meaning of it. The experience of comfort that I take from this is immense. Everything is under control!!! Surely we all remember the scripture that says; “Are not two sparrows sold for a farthing? and one of them shall not fall on the ground without your Father’s consent.” Nothing takes place here that is not permitted or engineered by the master of all things. It is a peculiar disconnect in this life that we can hear and not hear. We can understand the intellectual meaning of a statement but the force of it escapes our awareness. Of course, an atheistic would dismiss the validity of this. They believe that there is nothing beyond our presence here and once we are gone we are gone forever. They believe that life is an accident of some form of evolution of consciousness and form. There is not a great deal that I know but… I know that this is not true. I have direct experience otherwise and that has occurred more times than I can remember. I know that God is real. My perception of God is most certainly flawed but the existence of God is beyond any doubt in my heart and in my mind. I feel a terrible sense of loss when I consider the fate of an atheist, as I do when I think of all the wasted lives that pass like drunken marionettes before my eyes. I am powerless to effect a change in their destinies since in the majority of cases our paths will never cross. You and I and anyone can only affect those that fortune has put in our way. Usually we influence others through the operation of our desires and appetites, or through the various traumas that we visit on one another. Occasionally we might inspire another, if we ourselves are inspired and therein lies the heart of the matter. It is up to us who and what we seek out for inspiration. If we are dedicated and determined we will attract the attention of an angel of light, who is employed by the origin of light and we will be influenced by that light and we will transmit that light into the lives of others. I can think of no greater and more meaningful employment of our energies in this life. Nothing else seems to contain anything of value. It is just the rotating wheel of endless futility. It is the dance of Sisyphus. I look at all the alternatives in life and these options fill me with horror. To me, Hell is a consciousness devoid of the almighty. Hell is the absence of God. I do not intend to define what God is. That is beyond the capacity of any human mind and it is the source of never ending contention as well as immeasurable cruelties that take place each day because so many of us have made presumptions upon the nature of the ineffable. It is not our job to delineate the composition of the divine. It is our job to ‘host’ the divine and the result of that hosting is that we are filled with the spirit and presence of the divine and thereby the divine is inclined to express through us to the degree that we permit this to occur. The divine is present, after a fashion in every one of us because we could not be alive otherwise but… we preempt this with the shadow of the false self and it is thicker or thinner depending on the individual involved and what they get up to. This shadow is made denser and less dense according to the manner in which it is employed. Some activities are dark indeed. I believe that nothing positive is served by worry and fear. Fear displaces Love and without Love one has no guidance and no protection. Love not only casts out fear but it arrests the potential of all of the events that fear exists in the apprehension of. We each have some understanding of the meaning of love but the meaning of Love it far too deep for us to comprehend more than a fragment. If Love is housed in our being and allowed to guide and direct us, it will drive everything that is not Love far away from it. You will walk and live and breathe in confidence and every moment you will come closer to Love and Love will come closer to you. Let us turn our minds away from every specter that this world generates in order to confound and distress us. Focus on the great and unassailable power of the ineffable and let the rest of it go its way according to the people and situations it applies to. These other phantasms are of no concern to us, unless we make them so. End Transmission…….'"}, "time": 1742563662.7048748}