{"duration": 0.159529447555542, "input_args": {"text": "'Donald J. Trump and Hillary Clinton collided in an almost unremittingly hostile debate on Sunday night, a   spectacle of character attacks, tawdry allegations, and Mr. Trump’s startling accusation that Mrs. Clinton had “tremendous hate in her heart. ” In a remarkable political maneuver, Mr. Trump said Mrs. Clinton had smeared women who accused her husband, Bill Clinton, of sexually assaulting or harassing them, seeking to salvage his presidential candidacy after explosive reports about his past lewd comments about women. Tense at first, and then increasingly angry as he grew more comfortable on the attack, Mr. Trump noted that three of Mr. Clinton’s accusers were sitting in the audience. It was one of several moments when Mr. Trump aimed to energize his most conservative supporters and drive a wedge between them and the elected Republican officials who have been abandoning him. He even threatened that if it were up to him, Mrs. Clinton would “be in jail” for her use of a private email server as secretary of state. Both candidates were visibly uneasy throughout the debate, even refusing to shake hands at the beginning, as the town hall event unfolded on a small stage in a highly charged atmosphere. It was a deeply ugly moment in American politics, featuring the sort of personal invective rarely displayed by those who aspire to lead the nation. “Bill Clinton was abusive to women. Hillary Clinton attacked those same women  —   attacked them viciously,” Mr. Trump said, arguing that the accusations against Mr. Clinton were “far worse” than Mr. Trump’s own remarks in 2005 that he could grope women because he was “a star. ” Mr. Trump apologized for those comments but also repeatedly minimized them as “  talk,” and even tried to blame Mrs. Clinton for raising them in light of Mr. Clinton’s behavior. “She brings up words that I said 11 years ago  —   I think it’s disgraceful, and she should be ashamed of herself, to tell you the truth,” Mr. Trump said to scattered applause. Mrs. Clinton did not specifically rebut his charges about her husband, saying only, “So much of what he just said is not right. ” Instead, she broadened her indictment of Mr. Trump beyond the 2005 recording, assailing him for refusing to show contrition for his many inflammatory statements. “He never apologizes to anybody for anything,” Mrs. Clinton said. She unfurled a litany of his provocations, including his mocking a Gold Star family, accusing a Hispanic judge of being biased by virtue of his ethnicity, ridiculing a reporter who has a disability, and falsely claiming that President Obama was not born in America. “Yes, this is who Donald Trump is,” Mrs. Clinton said about his 2005 remarks. “The question for us, the question our country must answer, is that this is not who we are. ” After a tumultuous political weekend, the debate was watched extremely closely by Republican members of Congress, who are deciding whether to join dozens of elected officials who have broken away from the party’s nominee. Mr. Trump’s performance was   enough that no more Republican officials disavowed him in the immediate aftermath of the debate, and it prompted his running mate, Gov. Mike Pence of Indiana, to assure him via Twitter he would remain on the ticket after Mr. Trump’s “big debate win. ” Mr. Trump’s attacks on the Clintons  —   including a promise that, as president, he would appoint a special prosecutor to investigate Mrs. Clinton’s email practices  —   were striking even in a presidential campaign that has often seemed like a race to the bottom because of Mr. Trump’s    assaults on his rivals. But no single answer by Mr. Trump seemed sufficient to put to rest the controversy over his 2005 remarks. As much as he apologized, he did not confess or reveal anything new about his treatment of women over the years. Instead, Mr. Trump alternated between sounding chastened or defensive and trying to energize his base, which remains deeply hostile to Mrs. Clinton. He did so by blasting Mrs. Clinton relentlessly over her State Department email and repeatedly interrupting her, barely concealing his contempt. He said again that Mrs. Clinton should be “ashamed” of herself for deleting some of the personal emails she sent as secretary of state. “Oh, you didn’t delete them?” he said sarcastically. Mrs. Clinton, plainly exasperated, shot back: “O. K. Donald. I know you’re into big diversion tonight  —   anything to avoid talking about your campaign and the way it’s exploding and the way Republicans are leaving you. ” At several points, Mr. Trump expressed his frustration with the moderators, Anderson Cooper of CNN and Martha Raddatz of ABC, demanding that Mr. Cooper focus more on one of Mrs. Clinton’s biggest vulnerabilities, her email. “Why aren’t you bringing up the emails?” he asked, before flatly accusing the moderators of conspiring against him. “It’s nice, one on three,” he said. Mr. Trump appeared more confident and aggressive than he had in the first debate, often dismissing Mrs. Clinton’s arguments out of hand and painting her as a politician “for 30 years” who had no record of accomplishment. “It’s just words, folks it’s just words,” he said about Mrs. Clinton’s policy proposals.   minutes later, he added, “It’s all talk and no action. ” Mr. Trump made little, if any, effort to appeal to moderate voters, instead hurling a series of insults at Mrs. Clinton. At one point, an audience member pressed him about whether he could be a “devoted president” for all Americans, and he said emphatically that he could be, without acknowledging that his comments over the past year had been extraordinarily divisive. Instead, he attacked Mrs. Clinton. “She calls our people ‘deplorable,’ a large group, and irredeemable,” Mr. Trump said, invoking a comment that Mrs. Clinton made last month disparaging what she said was half of Mr. Trump’s supporters. Mrs. Clinton’s response reflected a strategy of hers throughout the town   debate: trying to engage directly with the undecided voters in the audience who asked some of the questions, and showing her empathetic side. “Mr. Carter,” she said, naming the man who asked the question, “I have tried my entire life to do what I can to support children and families. You know, right out of law school, I went to work for the Children’s Defense Fund. And Donald talks a lot about, you know, the 30 years I’ve been in public service. I’m proud of that. ” Mr. Trump, however, was far less concerned with connecting with the voters seated in front of him than with attacking Mrs. Clinton in ways that would rally his voters behind him, and against the Republican officials who have been coming out against him. “She’s lied about a lot of things,” Mr. Trump said, contending that Mrs. Clinton’s shift to opposing the   Partnership trade deal was a falsehood. Moments later, he painted her in some of his most vicious language of the campaign. “She has tremendous hate in her heart,” Mr. Trump said. “She has tremendous hatred. ” In that moment and several others, Mr. Trump sought to bait Mrs. Clinton into lashing out, just as she did to great effect during their first debate. But she kept her composure, while Mr. Trump often seemed disgusted and running at a high boil. He even swiped at the Republicans now disavowing him, saying they should have done a better job holding Mrs. Clinton accountable over her emails. “I am so disappointed in congressmen, including Republicans, for allowing this to happen,” he said. He also used a question about Mr. Pence’s   rhetoric on Russia at last week’s   debate to breezily dismiss his running mate. “He and I haven’t spoken, and I disagree,” Mr. Trump said. Mrs. Clinton found herself on the defensive more than in the first debate, as Mr. Trump showed himself capable of some agility. When the moderators challenged her over revelations that in one of her paid speeches, she had asserted that politicians needed a “public and a private position” in making deals, she gave a meandering answer about how her remarks related to the plot of the Steven Spielberg film “Lincoln. ” Mr. Trump pounced. “She got caught in a total lie,” he said. “Now she’s blaming the lie on the late, great Abraham Lincoln. ” As some audience members laughed, he added, “Honest Abe never lied. ” Mrs. Clinton also had several strong moments, especially early in the debate, when she reminded voters of Mr. Trump’s recent attacks on a former Miss Universe for gaining weight. At one point, Mr. Trump dissembled when he was pressed by a moderator about why he had posted on Twitter before dawn to accuse the beauty queen, Alicia Machado, of recording a sex tape. “It wasn’t ‘check out a sex tape,’” he said at the debate. Mr. Trump had in fact tweeted, “Check out sex tape. ” The night unfolded in dramatic fashion. Shortly before the debate, Mr. Trump held a brief news conference in St. Louis with three women  —   Paula Jones, Juanita Broaddrick and Kathleen Willey  —   who allege that Mr. Clinton sexually assaulted or harassed them during his years in office in Arkansas or as president. They were joined by a fourth woman, Kathy Shelton, who was 12 when she was raped by a    in Arkansas Mrs. Clinton represented the man, who ultimately pleaded guilty to a reduced charge. Only in the final minutes was there a brief cessation in the warfare. One audience member asked the candidates to cite something positive about each other, and Mrs. Clinton reached for a common answer to such questions. “Look, I respect his children,” she said. “His children are incredibly able and devoted, and I think that says a lot about Donald. ” Mr. Trump thanked her for the “very nice compliment,” and then offered his own. “I will say this about Hillary: She doesn’t quit, she doesn’t give up,” he said. “She’s a fighter. ” A moment later, after the moderators concluded the debate, Mr. Trump reached out his hand, and Mrs. Clinton shook it.'"}, "time": 1742562782.8114533}