{"duration": 0.15882587432861328, "input_args": {"text": "'\\nThe most interesting books of the Bible for those who aren’t believers in God are the wisdom books of Job and Ecclesiastes. Written from a philosophical point of view, they attempt to help people live with suffering and pain while putting existence into context.\\nBook of Job \\nJob is a devout believer in God who follows all of His rules. He has been blessed with incredible wealth and numerous children. Satan then challenges God by arguing that Job is only faithful because of what he has gained, and that he would immediately curse God if everything was taken away from him. God allows Satan to destroy him, taking his wealth and killing all of his children.\\nOnce the misfortune befalls Job, his wife implores him to curse God, but Job refuses. Instead, he openly laments at why God is allowing him to suffer. He even asks God to allow him to die.\\nI would rather be strangled—\\nrather die than suffer like this.\\nI hate my life and don’t want to go on living\\nOh, leave me alone for my few remaining days. (Job 7:15-16)\\nWhy make me your target?\\nAm I a burden to you?\\nWhy not just forgive my sin\\nand take away my guilt?\\nFor soon I will lie down in the dust and die.\\nWhen you look for me, I will be gone. (Job 7:20-21)\\nWhat do you gain by oppressing me?\\nWhy do you reject me, the work of your own hands,\\nwhile smiling on the schemes of the wicked? (Job 10:3)\\nHe then has a series of poetic dialogues with priestly men in an attempt to explain God’s justice. Job asks some pointed questions, implying that those who are eager to sin seem to experience more prosperity than those who closely follow God’s words.\\nThe godless seem like a lush plant growing in the sunshine,\\nits branches spreading across the garden.\\nIts roots grow down through a pile of stones;\\nit takes hold on a bed of rocks.\\nBut when it is uprooted,\\nit’s as though it never existed! (Job 8:16-18)\\nWhen a plague sweeps through,\\nhe laughs at the death of the innocent.\\nThe whole earth is in the hands of the wicked,\\nand God blinds the eyes of the judges.\\nIf he’s not the one who does it, who is? (Job 9:23-24)\\nJust like how there are so many laws in the legal code that you are always on the hook for something illegal, there are also so many possible sins that it may be impossible to live a clean life.\\nWhatever happens, I will be found guilty.\\nSo what’s the use of trying?\\nEven if I were to wash myself with soap\\nand clean my hands with lye,\\nyou would plunge me into a muddy ditch,\\nand my own filthy clothing would hate me. (Job 9:29-31)\\nThe men that Job spills his guts to state that he’s sinning in some way and knows nothing about how God works, and that he must grin and bear it instead of questioning God’s actions.\\nPay attention to this, Job.\\nStop and consider the wonderful miracles of God!\\nDo you know how God controls the storm\\nand causes the lightning to flash from his clouds?\\nDo you understand how he moves the clouds\\nwith wonderful perfection and skill?\\nWhen you are sweltering in your clothes\\nand the south wind dies down and everything is still,\\nhe makes the skies reflect the heat like a bronze mirror.\\nCan you do that? (Job 37:14-18)\\nGod appears and asks Job how dare he question His actions, even though those actions amounted to an agreement with Satan.\\nWho is this that questions my wisdom\\nwith such ignorant words?\\nBrace yourself like a man,\\nbecause I have some questions for you,\\nand you must answer them.\\nWhere were you when I laid the foundations of the earth?\\nTell me, if you know so much.\\nWho determined its dimensions\\nand stretched out the surveying line?\\nWhat supports its foundations,\\nand who laid its cornerstone\\nas the morning stars sang together\\nand all the angels shouted for joy? (Job 38:2-7)\\nGod goes on to describe his powers and then serves a “How dare you?” argument to Job, who then accepts his utter impotence.\\nThen the LORD said to Job,\\n“Do you still want to argue with the Almighty?\\nYou are God’s critic, but do you have the answers?”\\nThen Job replied to the LORD,\\n“I am nothing—how could I ever find the answers?\\nI will cover my mouth with my hand.\\nI have said too much already.\\nI have nothing more to say.” (Job 40:2-5)\\nYou asked, ‘Who is this that questions my wisdom with such ignorance?’\\nIt is I—and I was talking about things I knew nothing about,\\nthings far too wonderful for me.\\nYou said, ‘Listen and I will speak!\\nI have some questions for you,\\nand you must answer them.’\\nI had only heard about you before,\\nbut now I have seen you with my own eyes.\\nI take back everything I said,\\nand I sit in dust and ashes to show my repentance.” (Job 42:3-6)\\nOther parts of the Bible channel Job by asking why bad on Earth is allowed to continue:\\nWake up, O Lord! Why do you sleep?\\nGet up! Do not reject us forever.\\nWhy do you look the other way?\\nWhy do you ignore our suffering and oppression?\\nWe collapse in the dust,\\nlying face down in the dirt.\\nRise up! Help us!\\nRansom us because of your unfailing love. (Psalm 44:23-26)\\nAnd the usual response is to not question God:\\nWhat sorrow awaits those who argue with their Creator.\\nDoes a clay pot argue with its maker?\\nDoes the clay dispute with the one who shapes it, saying,\\n‘Stop, you’re doing it wrong!’\\nDoes the pot exclaim,\\n‘How clumsy can you be?’\\nHow terrible it would be if a newborn baby said to its father,\\n‘Why was I born?’\\nor if it said to its mother,\\n‘Why did you make me this way?’ (Isaiah 5:9-10)\\nAfter Job stopped questioning God, he was rewarded with even greater prosperity than before:\\nSo the LORD blessed Job in the second half of his life even more than in the beginning. For now he had 14,000 sheep, 6,000 camels, 1,000 teams of oxen, and 1,000 female donkeys. He also gave Job seven more sons and three more daughters. He named his first daughter Jemimah, the second Keziah, and the third Keren-happuch. In all the land no women were as lovely as the daughters of Job. And their father put them into his will along with their brothers. Job lived 140 years after that, living to see four generations of his children and grandchildren. Then he died, an old man who had lived a long, full life. (Job 42:12-17)\\nYou have to be patient with God:\\nThose who plant in tears will harvest with shouts of joy. They weep as they go to plant their seed, but they sing as they return with the harvest. (Psalm 126:5-6)\\nThe lesson of this story seems to be one of stoicism: accept your fate, don’t question it, and understand that what you have now can be taken from you at a moment’s notice if God wants to, no matter how cleanly you have lived in his honor. Ironically, this book did more to make me question God’s wisdom than any other.\\nBook Of Ecclesiastes \\nThe next wisdom book is Ecclesiastes, purportedly written by King’s David son, Solomon, who amassed one-thousand wives during his reign as King of Israel. His wife collection led to him serving other gods, and he was punished for it when God broke up the Kingdom of Israel. Ecclesiastes is the book that Solomon wrote at the end of his life, sharing all that he learned.\\n“Everything is meaningless,” says the Teacher, “completely meaningless!” What do people get for all their hard work under the sun? Generations come and generations go, but the earth never changes. The sun rises and the sun sets, then hurries around to rise again. The wind blows south, and then turns north. Around and around it goes, blowing in circles. Rivers run into the sea, but the sea is never full. Then the water returns again to the rivers and flows out again to the sea. Everything is wearisome beyond description. No matter how much we see, we are never satisfied. No matter how much we hear, we are not content. History merely repeats itself. It has all been done before. Nothing under the sun is truly new. (Ecclesiastes 1:2-11)\\nWhat is the point of accumulating wisdom in life? Why work hard?\\nFor in much wisdom is much grief: and he that increaseth knowledge increaseth sorrow. (Ecclesiastes 1:18)\\nI thought, “Wisdom is better than foolishness, just as light is better than darkness. For the wise can see where they are going, but fools walk in the dark.” Yet I saw that the wise and the foolish share the same fate. Both will die. So I said to myself, “Since I will end up the same as the fool, what’s the value of all my wisdom? This is all so meaningless!” For the wise and the foolish both die. (Ecclesiastes 2:13-16)\\nSo what do people get in this life for all their hard work and anxiety? Their days of labor are filled with pain and grief; even at night their minds cannot rest. It is all meaningless. (Ecclesiastes 2:22-23)\\nAll is vanity:\\nFor that which befalleth the sons of men befalleth beasts; even one thing befalleth them: as the one dieth, so dieth the other; yea, they have all one breath; so that a man hath no preeminence above a beast: for all is vanity. All go unto one place; all are of the dust, and all turn to dust again. (Ecclesiastes 3:19-20)\\nPromiscuous and bad women are sent forth as a punishment from God:\\nI discovered that a seductive woman is a trap more bitter than death. Her passion is a snare, and her soft hands are chains. Those who are pleasing to God will escape her, but sinners will be caught in her snare. (Ecclesiastes 7:26)\\nSolomon tries to convince himself that evil will not prosper, but he can’t help coming back to the fact that it does:\\nWhen a crime is not punished quickly, people feel it is safe to do wrong. But even though a person sins a hundred times and still lives a long time, I know that those who fear God will be better off. The wicked will not prosper, for they do not fear God. Their days will never grow long like the evening shadows. And this is not all that is meaningless in our world. In this life, good people are often treated as though they were wicked, and wicked people are often treated as though they were good. This is so meaningless! (Ecclesiastes 8:11-16)\\nAt this moment, it seems that Solomon goes off the rails by seemingly promoting a life of debauchery:\\nSo I recommend having fun, because there is nothing better for people in this world than to eat, drink, and enjoy life. That way they will experience some happiness along with all the hard work God gives them under the sun. (Ecclesiastes 8:15)\\nOne interpretation of this is that if you live in sin like Solomon, you will eventually come to the conclusion that life is meaningless, all is for naught, and the only purpose is to have fun. The book may have been included in the Bible to serve as an example of what will happen to you if behave as Solomon and come to the end of your life thinking that it wasn’t worth it. I hope this was the intended result because otherwise it would cause you to lose faith in God’s own wisdom in justice, just like with Job.\\nThe wisdom books of the Bible raise questions of God’s justice and plans for his human subjects. Why do people suffer or prosper? Why does life feel like it’s not being guided by God? These questions vexed the Jews enough that they honored other Gods to get more immediate results. And then Jesus Christ came along to say that it will all be worth it—not necessarily now, but in the eternal afterlife, as long as you accept him as your savior.\\nRead More: The Old Testament’s “Sexist” Views On Female Behavior \\n'"}, "time": 1742628419.8007686}