{"duration": 0.19733977317810059, "input_args": {"text": "'War on cash goes into full effect – Citibank stops accepting cash at multiple branches Governments loathe cash transactions because they’re private and hard to tax By Jack Burns - Thursday, November 17, 2016 1:36 PM EST \\nIn 2015, as a guest on Ron Paul’s Liberty Report, Economics Professor Joseph Salerno warned of a coming war on cash. Apparently, now, that time has come. Governments loathe cash transactions because they’re private and hard to tax. As a result, some countries are taking drastic measures to reclaim their bank notes. Salerno said, “The French premier last year (2014) drew a parallel between the war on terror and the war on cash,” and warned the world’s economic elite are now “using the war on terror as a cover to get at cash.” The Mises Institute professor and VP predicted to Paul, “I think this could come in the next couple of years. If they have to bail out the financial system again…they’ll block the cash in the banks to prevent it from escaping and destabilizing these fractional reserve banks,” Salerno said. \\nAt the time of the interview, 2015, Salerno said the war on cash has already begun in the U.S. and pointed to Citibank’s new policy which disallows patrons to use cash to pay their mortgages and credit cards with cash. He also pointed to Louisiana’s new law forcing “second hand dealers defined as Goodwill Stores, Flea Markets, Garage Sales, to report any cash transactions in which they were receiving or paying cash, and they had to report them on a daily basis to the local police authorities.” He said, “they (secondhand stores) had to get the sellers’ names and license plate number and a number of other of private details.” \\n“This is only a first step,” even though it was only on a state level. “It would be awful if it was on a federal level,” Salerno declared. \\nWhile it hasn’t happened yet on a federal level in the United States, cash reclamation is occurring today in India. But before we get to what’s taking place in India, we must first examine the reasons frequently given by government to resort to controlling the public’s access to cash. Salerno stated the government offers phony reasons why it must control cash. It’s to prohibit terrorists, tax evaders, money launderers, and profiteering by drug cartels. If one hears the government making such claims, get ready, a cash grab is about to happen. \\nSalerno pointed to Greece’s implementing a “cash point charge” for withdrawing Euros from their bank accounts, allowing government to charge citizens for withdrawing their own funds. He says mainstream economists have been promoting the war on cash for some time in order to prop up fledgling banks. \\n“I assure you other governments are watching this experiment (in Greece),” he said. Salerno also stated the real war on cash seeks to “force the public to make payments to the financial system” in order to “enable governments to expand their ability to spy on and keep track of their citizens’ most private financial dealings in order to milk their citizens out of every last dollar of tax payments that they claim are due.” He stated another reason to destabilize cash is to “prop up the unstable fractional reserve banking system which is in a state of collapse all over the world.” \\nKeep in mind, Salerno made his comments a year ago. \\nFast forward to 2016, and the world is now witnessing the first major bank to announce it will no longer accept cash deposits or deal in cash. Citibank Australia’s head of retail bank Janine Copelin offered an explanation saying, “We have seen a steady decline in the demand for cash services in our branches — in fact, less than 4% of Citi customers have used this service in the last 12 months.” The company stated it will no longer handle currency as a result. \\n“This move to cashless branches reflects Citi’s commitment to digital banking and we are investing in the channels our customers prefer to use…While the number of customers visiting our branches to access cash handling services has fallen, the branch network remains an important component of how we serve our high-net-worth customers,” said Copelin. \\nMaybe no one’s eyebrows are raising after Citibank made its declaration because some advanced societies have quite naturally moved away from hard cash transactions, preferring the ease of pay by phone, debit cards, or credit card purchases. After all, someone in the United States could very easily live without cash. Many do already. \\nAccording to the Guardian , Sweden leads the world when it comes to not using cash. “Cards are now the main form of payment: according to Visa, Swedes use them more than three times as often as the average European, making an average of 207 payments per card in 2015.” But in some parts of the world, cash is still king. \\nJust this week, India made a major move to control its citizens’ access to their cash by banning the 500 and 1000 rupee notes. According to the LA Times , “An exasperating cash crunch has gripped India in the week since Prime Minister Narendra Modi took the unprecedented step of withdrawing the country’s large currency notes from circulation. Modi surprised the nation by announcing an instant ban on the 500-rupee and 1,000-rupee notes, worth about $7.50 and $15, respectively, and which account for 86% of the cash in the market.” \\nAnd just as Salerno predicted governments would do, the Indian government claimed the move was meant to serve as a ”sweeping move against corruption that would force Indians who hold large amounts of undeclared wealth to deposit the money at banks and make their assets official.” In other words, just as Salerno declared, rich Indians, whose private business dealings were done in cash, will now be forced to deposit their banned bank notes — or risk losing all of their wealth. \\nThe value of the currency, if deposited, will then be able to be tracked by the Indian government, a move Salerno stated would lead to higher taxes on its wealthy citizens, and greater returns for the banking system. And the Indian government has already admitted that’s precisely what they’re trying to do. \\nAlso, as Paul and Salerno predicted, the move has had devastating effects on the poor, many of whom have now reverted to bartering for their needs, according to the Times. The financial decision “stunned hundreds of millions of poor and working-class Indians who live an almost entirely cash-based existence, paying in bills for everything from rent to groceries to cellphone credit.” And they never saw it coming. \\n“The plan was shrouded in such secrecy that even India’s financial institutions were ill prepared, creating long, sometimes unruly lines outside banks, ATMs and chronically understaffed post offices that are authorized to exchange the now-worthless notes and dispense new ones,” writes the Times. \\nExacerbating the financial crisis is the fact the government issued a smaller-sized currency which no longer works with current ATMs, forcing many customers not to be able to make any purchases at all, and thereby creating a loss of revenue for businesses hit hard by fewer customers, and chaos for everyone else. The best way to describe the upheaval in India is by imagining all Americans attempting to pay all of their purchases with one dollar bills. \\nIn India, according to the Times, two-thirds of all transactions are done in cash, an economy the government has labeled “black money.” Modi’s administration aims to tax that money. “Much of the wealth that India has accumulated since economic reforms began in the 1990s has never been taxed or accounted for, parked instead in real estate, gold, foreign investments and, in some cases, bundles of cash sitting at home. It is those stacks of bills that Modi, who took office 2½ years ago on promises to curb corruption, aimed to bring into the open. Supporters of the prime minister’s plan said those holding cash stockpiles would have to deposit them at banks, where huge amounts would draw the scrutiny of tax authorities, or allow their value to evaporate.” \\nSounding, as some would say, like Donald Trump, Modi said over the weekend, “I promise you I will give you the India of your dreams.” But right now, India is living a nightmare. \\nIndia’s decision to reclaim its currency has some questioning whether the United States would attempt to follow suit and reclaim its own currency. \\nFor free thinkers everywhere, it may be time to take those 100 dollar bills and swap them out for one dollar denominations, or even begin to purchase gold and silver as many preppers have done already. If the proverbial shit hits the fan, taking notice of what’s happening in the world may prove to be a wise decision. With Australia’s Citibank declaration it will no longer deal in cash, with Sweden’s cashless society as a model of the future, and with India’s reclamation of bank notes, it’s anyone’s guess what the American economic crisis may look like. But it probably won’t involve cash.'"}, "time": 1742562921.7938716}