{"duration": 0.15774893760681152, "input_args": {"text": "'Welcome to Our Picks, a guide to the best stuff to read, watch and listen to from around the internet. Check this space for the     article, the next great podcast for your commute, the   tweetstorm. And yes, we’re also tooting our own horn here. We’ll share can’  Times stories from the week and surface some gems you might have overlooked. We want to hear from you! Send us feedback about our selections to ourpicks@nytimes. com. • If you have 10 minutes, read this story about a Wikipedia editor who turned  abuse from online trolls into something a lot more productive. [Backchannel] _______ • In Denver in the 1920s, a secret society of black intellectuals managed to infiltrate the Ku Klux Klan and thwart many of its plans. A short, local history that will make you feel good about the impact ordinary people can have on their communities. [Denverite] _______ • Some travel guides are more useful than others. We’re not sure you’ll need this comprehensive guide to imbibing at Disney World every time you visit the theme park, but it surely can’t hurt to brush up on some of the hot spots. [Roads  Kingdoms] _______ • These were four Super Bowl heroes this year: Tom Brady and Lady Gaga, Adam and J. B. If you haven’t heard of the latter pair, that’s O. K. They’re just now telling the story of how they sneaked into the biggest sporting event of the year. [Vocativ] _______ • “It was light killed the beasts, they say. ” It’s haunting lines like these that make one reporter’s journey to the darkest town in America  —   Gerlach, Nev.  —   a  . [Five Thirty Eight] _______ • Sometimes you need a little distance to fully appreciate the impact of a cultural figure. That is perhaps why, 10 years after Anna Nicole Smith’s death, this substantial and insightful chronicle of the icon’s rise and fall is so satisfying to read. [BuzzFeed] _______ • Now that football season is over, it’s time we shifted our focus to baseball. If you’re a fan of the sport, you’ll want to acquaint yourself with Shohei Otani of Japan. He’s the country’s best hitter, best pitcher and, according to those who make these types of comparisons, the world’s next Babe Ruth. [SportsNet] _______ • You’ve probably heard of the “lone wolf” terrorist. Someone who, with no direct ties to a terrorist group,   and carries out violent acts alone. But as this piece by Rukmini Callimachi shows, some of the plots we thought were the work of lone wolves were in fact “remote control attacks” by the Islamic State. The terrorist group used messaging apps to provide virtual coaching and guidance in attacks across the globe. _______ • A crack in an Antarctic ice shelf grew 17 miles in the last two months. Scientists are concerned that it is getting close to a full break. Here’s a visual explainer. _______ • This week, the White House issued a list of 78 terrorist attacks, saying most were underreported. Here is that list, along with our references to news coverage of the attacks. _______ • If you’re itching to listen to something today, may we humbly recommend our new podcast, “The Daily,” covering the day’s most important news in a quick 15 minutes. _______ • We asked readers to tell us if they or someone they knew was affected by President Trump’s executive order on immigration. Our social media editor Sona Patel noticed a number of stories about relationships and marriages thrown into turmoil. Here are a few of them. (If you have a story about the immigration order, you can email us at immigration@nytimes. com.) _______ • In today’s Hollywood, the best way for actresses who have reached the “unfortunate” age of 40 to land interesting roles, or to ensure that complicated stories about adult women get to the screen, is to take creative and business control. So that’s what Nicole Kidman did. _______ • Now for something controversial: Our new baking columnist, the British chef and author Yotam Ottolenghi, makes his debut with a piece called “Eat Your Sugar. ” “I rarely go a day without a slice or bite or square of something sweet. ” (Don’t tell our Opinion columnist David Leonhardt.) _______ • “Ever wanted to feel nervous for 16 minutes straight? If so, watch this. ” Readers had lots of feelings about “Ten Meter Tower,” a short film from  . _______ • The New York Times Magazine was awarded three National Magazine Awards this week: Jennifer Percy for feature writing (“‘I Have No Choice but to Keep Looking’”) Nikole   for public interest (“Choosing a School for My Daughter in a Segregated City”) and Sam Anderson for   (“David’s Ankles: How Imperfections Could Bring Down the World’s Most Perfect Statue”). Enjoy them for the first time (or revisit them) when you have some time to tune out the rest of the internet. _______ • If you can’t catch Jake Gyllenhaal in his coming performance of “Sunday in the Park With George,” you can at least enjoy his vocal talents online. Filmed in a single take, this video of Gyllenhaal singing Sondheim during rehearsals for the play is a great excuse to take a   break from your day. [Facebook, via Vulture] _______ • On Feb. 15, 2014, the fitness legend and motivational figure Richard Simmons disappeared. On Feb. 15, 2017, a podcast looking to find out what happened to this    character will launch. Listen to this preview and gear up for the next cult audio obsession. [Missing Richard Simmons] _______ • The best magazine cover of the year is one you’ve probably seen. The readers’ choice selection is one you probably haven’t. [ASME] _______ • Admit it: You don’t read terms and conditions agreements before you sign them. One cartoonist is looking to change that bad habit with this delightful graphic novel that illustrates the iTunes legal jargon we all skip. [iTunestandc Tumblr, via A. V. Club] _______ • If you have an   you’d like to needle next week for Valentine’s Day, may we recommend sending one of these Victorian “Vinegar Valentine” cards? With titles like “You Waste Labor on Your Waist” and “A Fright,” there’s no chance your message will be misunderstood. [Abe Books, via Paris Review'"}, "time": 1742562008.876039}