{"duration": 0.2081623077392578, "input_args": {"text": "'Mikhail Saakashvili quits as Odessa governor   Source: REX The Governor of the Odessa region, Mikhail Saakashvili , who is best known for eating his tie on TV while serving as President of Georgia, announced his resignation on Monday, November 7. \"I have decided to resign and start a new stage of the struggle. I am not going to give up. I am a soldier who walks as much as he can and then continues walking as much as he must,\" Mikhail Saakashvili, former president of Georgia said at a press briefing. According to him, it is difficult to improve the state of affairs in one region, while corruption continues prospering in the rest of Ukraine \"capitalizing on the blood of soldiers, victims of the Maidan and betraying the idea of \\u200b\\u200bthe Ukrainian revolution.\" Saakashvili has repeatedly accused the Ukrainian authorities of corruption. On September 13, he called Petro Poroshenko\\'s Bloc a criminal group. In December 2015, at a meeting of Ukraine\\'s National Board of Reforms, an open conflict sparked between Saakashvili and Ukrainian Minister of Internal Affairs Arsen Avakov. The Interior Minister asked Saakashvili a question about the privatization of the Odessa Portside Plant. In response, the former president of Georgia stated that he was not going to discuss anything on the subject. Instead, Saakashvili added, he was going to prove that \"you [Avakov] are a thief.\" Avakov splashed water from his glass at Saakashvili during the scandal. President of Ukraine called the incident shameful. Saakashvili was appointed the head of the Odessa region on May 30, 2015. Prior to the appointment, he received Ukrainian citizenship in accordance with the decree signed by President Petro Poroshenko. From 2004 to 2013, Saakashvili served as the President of Georgia. He has rarely visited Georgia since then, where there are four criminal cases pending against him. One of them was filed on charges of embezzlement of public funds for personal needs. Pravda.Ru Circus from Georgia moves to Ukraine'"}, "time": 1742562505.6179798}