{"duration": 0.09732198715209961, "input_args": {"text": "'Trump’s Opponents See Normal Americans as Deplorables\\nPaul Craig Roberts\\nI guess we have all noticed that the holier-than-thou groups who whined that Trump wasn’t going to accept the outcome of the election refuse to accept it themselves.\\nBecause I was critical of the George W. Bush regime, the liberal-progressive-leftwing and homosexual/transgendered rights groups have me on their mailing lists. \\nAnd it is unbelievable. The entirety of “the other America” refuses to accept the people’s decision. They think that their concerns are more important than the concerns of the American people, who they regard as nothing but a collection of racist homophobic rednecks. \\nUnless they provoke him beyond reason, Trump is not going to bother any of these people.\\nTrump wants to bring middle class jobs back to Americans, including for all those paid to protest him.\\nIn order to avoide nuclear war, Trump wants to restore normal relations between the major nuclear powers. \\nWhen there are no jobs for Americans that pay enough to support an independent existence, Trump doesn’t see the point of massive legal and illegal immigration.\\nThis is only common sense.\\nYet “the threatened people” see it as fascism.\\nWho are “the threatened people?” As always, the most powerful.\\nTell me, what lobby is more powerful than the Israel Lobby? You can’t. But the Jewish Lobby, J Street, has sent me a hysterical email at 5:11pm on 14 November. Unless “we all come together and oppose Trump’s appointment of Breitbart editor Stephan Bannon as chief strategist and senior counselor” a “wave of hate will sweep across the land,” consuming “Jews, Muslims, African-Americans, LGBT peoople (lesbian, gay, bisexual and transgendered), immigrants, Hispanics, women and other groups.”\\nReally now! So is Trump’s chief strategist, whatever position that is, going to attack the Jews and those with unusual sexual impulses with drones and cluster bombs, like the zionist neoconservatives who controlled the Clinton, George W. Bush, and Obama regimes did to millions of slaughtered and displaced peoples in 7 countries, and like Israel does to Palestinians? Or is the former Breitbart editor going to round them all up and torture them in Abu Ghraib and Guantanamo like Bush and Obama did. And like Netanyahu does in Israel?\\nOr will Trump simply shoot them down in the streets like Netanyahu does to the Palestinian women and children. \\nHow come J Street and the Oligarchy-funded fronts are only concerned with nonexistent threats and ignore all of the real threats?\\nAccording to J Street, the main concern is that Trump has appointed an “Alt-Right” person to advise him. Dangerous tensions between nuclear powers? A collapsing American middle class?\\nThese concerns, if present, are in the peripheral vision of the “threatened people.” \\nAccording to the front group known as the Southern Poverty Law Center, Trump’s election by fly-over America has resulted in “over 250 reports of hate crimes around the country.” Is the Southern Poverty Law Center including the brutal beating of a white man by a gang of blacks? How many innocents has Trump slaughtered and put into concentration camps? How many countries has he invaded? The corrupt American media and oligarchic front groups have created “the new Hitler” before he is even inaugerated.\\nThe Klingon Clintons and neoconed Bush/Cheney and Obama killing regimes have murdered more people and invaded more countries than Hitler, and the holier-than-thou group doesn’t care. Yet, the all-powerful Israeli Lobby thinks a Breibart editor is going to target the Jews, immigrants, the transgendered and homosexuals, women, Muslims, Hispanics, “and other groups.” What a change this will be. Only non-immigrant, white, heterosexual males will be in the protected group known as the “preferred minority.”\\nWe must hope that Donald Trump understands the state of moral, cultural, legal, and political collapse that America is in. Two years ago at the Valdai International Discussion Club, Russian President Vladimir Putin said:\\n“Many of the Euro-Atlantic countries are actually rejecting their roots, including the Christian values that constitute the basis of Western civilization. They are denying moral principles and all traditional identities, national, cultural, religious, and even secular. They are implementing policies that equate families with same-sex partnerships, worship of God with worship of Satan. I am convinced that this opens a direct path to degradation and primitivism, resulting in a profound demographic and moral crisis.”\\nOrdinary Americans know what he means. They are forced to accept blasphemous films about Jesus Christ and shameless newspaper caricatures of the Virgin Mary, but if one of them calls a homosexual a pervert, he has committed a hate crime.\\nAmerica is a country without an honest media. A country wihout an honest judiciary. Without an honest government. Without an honest legislature. Without honest schools and universities. A country whose morals are confused by propaganda. A country whose elites believe that they are entitled to all the income and wealth and that normal American people are the “deplorables,” to use Hillary’s term for ordinary Americans.\\nThe post Trump’s Opponents See Normal Americans as Deplorables — Paul Craig Roberts appeared first on PaulCraigRoberts.org .'"}, "time": 1742564621.102573}