{"duration": 0.05988883972167969, "input_args": {"text": "'A white nationalist group called White Lives Matter, which calls itself an opponent of the Black Lives Matter movement, has been declared a hate group by the Southern Poverty Law Center, an organization that tracks extremist groups in the United States. “The White Lives Matter website says their movement is dedicated to the preservation of the white race. That tells you all you need to know,” said Heidi Beirich, the director of the Intelligence Project at the Southern Poverty Law Center in Montgomery, Ala. “They’re against integration, immigration. This is standard white supremacist stuff. ” The group, which grew out of a social media meme, argues that white Americans are victims of a genocide caused by factors like the immigration of nonwhite people and marriage between white Christians and nonwhites or Jews, Ms. Beirich said. The law center’s designation is meant to draw attention to and increase scrutiny of the group’s activities. Last week, its members held a protest outside the Houston office of the National Association for the Advancement of Colored People to demand that it denounce Black Lives Matter, according to video posted online by the group. The Houston Chronicle reported that some of the protesters carried assault rifles and Confederate flags. Researchers with the law center said White Lives Matter had been promoted by the Aryan Renaissance Society, a group in Texas that is a member of the United Aryan Front, a white nationalist coalition. Ms. Beirich said the center’s designation focused on one chapter of the group based in Nashville that is led by Rebecca Barnette, a leader of the Aryan Strikeforce, a skinhead group, and the National Socialist Movement, America’s largest   group. Ms. Barnette did not respond to an email seeking comment on Monday, but White Lives Matter posted several videos criticizing the Southern Poverty Law Center to its YouTube channel in the past two days. One video described White Lives Matter’s members as “just the guy next door. ” Ms. Beirich said the number of white supremacist groups in the United States had grown in the past year and attributed that to the racially charged rhetoric of the presidential campaign. There are 892 active hate groups in the country, the law center said. “Certainly we’ve got people who are much more energized in a way that didn’t exist before, and that’s all because of the presidential campaign,” Ms. Beirich said before specifying Donald J. Trump, the Republican nominee “Trump has given these people hope they didn’t have before that they could influence politics or that they would at least be listened to. ” Ms. Barnette described herself as White Lives Matter’s   in her profile on Vk. com, a Russian social networking site preferred by white nationalists for its lenient approach to posts that contain racist content. She said the group’s name had “been picked up by several other groups who are doing their own things with it. ” Mark Pitcavage, a researcher at the   League, agreed that the phrase had spread beyond the group. “White Lives Matter is a concept around which you can organize an event without necessarily being a formal organization,” he said. “It is essentially the sum of the number of people who have done actions in the name of White Lives Matter. ” “For white supremacists, ‘White Lives Matter’ is an obvious meme, so they will use it,” he said. On Vk. com, Ms. Barnette defended the group, writing that its members were unfairly labeled ”domestic terrorists. ” In other posts she argued that white women represent “the elite of the human species. ” She also shared Nazi memes and frequently used racist,   and homophobic slurs. “We do not live by the code of the nonwhites,” she wrote in one post calling for her followers to take action against the federal government, Jews and  . “Our forefathers built the nation that is being allowed to be destroyed. ” Later she added, “I wish Hitler were here alive and well today. ”'"}, "time": 1742562409.2958093}