{"duration": 0.03357386589050293, "input_args": {"text": "\"What Exactly Are Poll Watchers? Here’s The Cliff Notes Version (VIDEO) By Natalie Dailey on October 29, 2016 Subscribe \\nFor months, Republican presidential nominee Donald Trump has been whining that the election is rigged against him. \\nHe urges people to go to the polls and look out for voter fraud. Watching for fraud is not illegal by itself. If you actually try to force someone to vote a certain way, that is illegal. Sending out false information about the election is also illegal in Ohio. In most states, intimidating voters like that is illegal. According to 18 U.S. Code § 594 : “Whoever intimidates, threatens, coerces, or attempts to intimidate, threaten, or coerce, any other person for the purpose of interfering with the right of such other person to vote or to vote as he may choose.” \\nThe states are allowed to regulate election procedures, so the rules vary widely. Some states allow poll watchers to help out by simply being in the room. They watch for any specific suspicious behavior. What Are Poll Watchers? \\nFor example, in Florida, each candidate is allowed to have one poll watcher at each polling place. They have to be approved by the state beforehand. \\nThe poll watcher’s job is to make sure that the votes are counted correctly and to make sure there aren’t any weird voting schemes going on. \\nAlso in Florida, the poll watchers are allowed to challenge someone’s identity if they find a problem with the person’s identification or if the voter doesn’t show up on local voter rolls. If the issue isn’t resolved on-site, then the person can fill out a “provisional” ballot. \\nThis ballot won’t get counted until the problem with the voter’s identity is cleared up, and only if the vote numbers are close enough for provisional ballots to make a difference. Unfortunately, they often don’t get counted at all and if they do, not until after the vote would’ve been useful. Who Are The Poll Workers? \\nThe poll workers are usually a combination of state employees, temporary contractors, or volunteers. They are trained to answer your questions, and they handle disputes with the poll watchers. \\nYou are allowed to ask who poll workers are and who they represent. If you have a problem while voting, you’ll report it to the poll workers. \\nPoll watchers and poll workers are not allowed to intimidate voters or suppress voting based on race, gender, national origin, or religion. They also can’t question you, and they can’t film you without your approval. \\nStay safe on election day, November 8! \\nDonald Trump has gotten himself in some hot water for calling for poll watchers: \\nFeatured image via YouTube screenshot . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect \""}, "time": 1742562458.4726064}