{"duration": 0.0551149845123291, "input_args": {"text": "'Tweet \\nBACKGROUND: The superiority of Lactated Ringer’s solution (LR) or normal saline (NS) in fluid resuscitation in a variety of medical and surgical scenarios remains the most hotly debated irrelevant topic in modern medicine. For this reason and because advancement in our academic medicine careers requires us to have a certain number of publications, we have designed this study to finally determine which of the two is the ULTIMATE FLUID! \\nMETHODS: The medical and surgical departments at Miskatonic Medical Center in Maine were made to compete in a no-holds-barred water balloon battle. The teams were randomized to either NS or LR-filled water balloons. Participants were blinded as to which fluid they were using and the data analysis teams were blinded as well. Finally, everyone involved was physically blindfolded by two different blindfolds, thus creating the first ever QUADRUPLE -BLIND clinical study. \\nNephrologists were excluded from participating, because they can unfailingly identify and manipulate all fluids with their psychic powers. \\nRESULTS: The surgical department pulled into an early lead thanks in no small part to the orthopedics team. Led by Dr. Brock Hammersley and assisted by a platoon of Stryker reps who refilled water balloons and acted as spotters, the ortho team’s throws were powerful enough to send the medical department’s participants to the ER with broken bones . \\nDr. Hammersley almost won the day for the surgical department by turfing all the new admissions straight back to medicine. However, in a surprise twist, the medicine department pulled out their ace in the hole: legendary hospitalist and goalkeeper Tim Howard . Howard, who has managed to keep his hospitalist team admission-free for two straight years, was able to easily deflect every admission. \\nDespite Dr. Howard’s assistance, the surgical team captured more flags, scored more touchdowns, shot more hoops, and generally looked cooler doing it all. Nevertheless, medicine ultimately won on points after the medical student on the Heme/Onc service managed to quote the JNC 9 Water Balloon Battle guidelines as pertaining to left-handed African-American male patients with preeclampsia on a night when five virgins are sacrificed to the blood moon. \\nCONCLUSION: Lactated Ringer’s solution (ironically randomized to medicine) is the ULTIMATE FLUID! Further work needs to be done so we can continue getting NIH funding. 2K Shares '"}, "time": 1742562167.092105}