{"duration": 0.04730367660522461, "input_args": {"text": "'SEOUL, South Korea  —   A South Korean court on Thursday blocked a prosecutor’s attempt to arrest Jay Y. Lee, the leader of Samsung, saying there was not enough evidence that Mr. Lee had bribed President Park   in a scandal that led to her impeachment. A justice on the Central District Court in Seoul, Cho   rejected the prosecutor’s request to issue an arrest warrant, saying said it was “difficult to recognize the need” to incarcerate Mr. Lee. Mr. Lee, a   scion and vice chairman of Samsung, one of the world’s biggest conglomerates, was immediately released from a detention center outside Seoul, where he had been waiting for the court to decide whether he should be formally arrested. South Koreans have paid keen attention to the fate of Mr. Lee. Some analysts said his case was a test of whether the country’s relatively youthful democracy and judicial system are ready to crack down on the   crimes of   conglomerates. No Samsung leader has ever been jailed, though the company has been investigated many times for corruption. The court’s decision is likely to anger many South Koreans who have held weekend rallies calling for Ms. Park’s ouster and the arrest of business tycoons on corruption charges. The special prosecutor called the court decision “very regrettable. ” But he has yet to announce whether he will offer more evidence in a renewed effort to have Mr. Lee arrested. He can also indict Mr. Lee on bribery or lesser charges without arresting him. “We will take necessary steps and persist in our investigation without wavering,” said Lee   a spokesman for the special prosecutor, without elaborating. Samsung welcomed the court’s decision. For now, the ruling allows Mr. Lee to continue to lead Samsung. It dealt a blow to the special prosecutor who had tried to build a bribery case against Mr. Lee and Ms. Park. Mr. Lee’s father has twice been convicted of bribery and tax evasion but has never spent a day in prison. Each time, he received a presidential pardon and returned to management. Mr. Lee, 48, was accused of paying $36 million to Ms. Park’s secretive confidante, Choi  . The special prosecutor and Mr. Lee’s lawyers have been arguing over how to characterize the money. In November, state prosecutors indicted Ms. Choi on extortion charges, saying she leveraged her connections with Ms. Park to coerce Samsung and scores of other big businesses to contribute tens of millions of dollars to two foundations Ms. Choi controlled or to companies run by her or her associates. They identified Ms. Park as an accomplice, but they brought no charges against the businesses, which they saw as victims of extortion. But the special prosecutor, Park   who took over the investigation from state prosecutors last month, has called Samsung’s contributions bribes that were exchanged for political favors from Ms. Park. That includes government support for a merger of two Samsung affiliates in 2015, which helped Mr. Lee inherit corporate control from his incapacitated father, the chairman, Lee   according to the prosecutor.   groups accused the prosecutor of overreaching in an attempt to find a   scapegoat to soothe a public infuriated over Ms. Park’s corruption scandal and fed up with decades of collusive ties between the government and the chaebol. Mr. Lee was the most prominent businessman to be ensnared in the special prosecutor’s broadening investigation into the corruption scandal that led to Ms. Park’s impeachment by Parliament last month. Ms. Park’s presidential powers remained suspended, while the Constitutional Court is expected to rule in coming weeks whether she should be reinstated or formally removed from office. “We have been too lenient toward chaebol corruption,” said Moon   an opposition politician who leads in polls on contenders to replace Ms. Park if she is removed. Speaking to a group of foreign reporters hours before the court’s decision, Mr. Moon said Samsung was typical of a chaebol whose top boss wielded “imperial powers” over his sprawling business group but was ”seldom held accountable” for corruption or managerial failures. Ms. Park denies any wrongdoing. Mr. Lee and Samsung have also denied bribery they argued that the “donations” Samsung paid out to Ms. Choi were coerced, not meant as a quid pro quo for political favors from Ms. Park.'"}, "time": 1742563280.0532615}