{"duration": 0.08679962158203125, "input_args": {"text": "\"Alt-Right Architect Glenn Beck Opens Fire On Alt-Right: ‘Grave Threat To The Republic’ (AUDIO, TWEET) By Darrell Lucus   \\nGlenn Beck was, by all accounts, the primary architect of the tea party. Yet, he has become an unrelenting critic of one of its loudest descendants, the alt-right. He issued his sharpest critique to date on Friday’s edition of “The Glenn Beck Program,” saying that this white supremacist and Islamophobic movement represents a clear and present danger to this country’s very existence. \\nDuring the first hour of Friday’s show, Beck, a charter member of the “NeverTrump” movement, declared that the alt-right represented nothing less than a “grave threat to the republic.” The alt-right, as many of you know, has rallied behind Donald Trump, and effectively took control of the Trump campaign when Breitbart chairman Stephen Bannon became campaign CEO. \\nBreitbart is widely reckoned as the main mouthpiece of the alt-right, and Bannon is the main architect of the effort to give the alt-right a place at the table on the wingnut fringe. has a very clear design for where he wants to take the alt-right after the campaign. Apparently it includes building closer ties between the alt-right and the rest of the wingnut fringe. He plans to speak at David Horowitz’“Restoration Weekend” two days after the election. This gathering is a known hotspot for right-wing bile of the worst type. \\nHowever, Beck claimed, the alt-right would have likely blossomed without Trump. . @glennbeck : This has nothing to do with @realDonaldTrump or @HillaryClinton … it would be happening with someone like @tedcruz in as well. \\n— TheBlaze Radio (@TheBlazeRadio) October 28, 2016 \\nHow’s that, you ask? Well, Beck argued, the American alt-right seems to be taking its cue from the European far right. Listen here. \\nBeck said that Bannon and the rest of the American alt-right think along the same lines as the far right in Europe–“burn the entire thing down, and out of the chaos, we will rise.” He’s apparently referring to an email exchange between Bannon and Breitbart reporter Matt Doyle from 2014, in which they discussed plans to “turn on the hate” in order to make it easier to “burn this bitch down.” He claimed that neither Trump nor even his most ardent supporters know this. \\nBeck was actually building on a Facebook post from Thursday night, in which he shared an article in the New York Observer–ironically, owned by Trump’s son-in-law, Jared Kushner–detailing the links between Russia and far-right elements in Europe. In a lengthy commentary on Facebook, Beck claimed that there are disturbing parallels between far-right tactics in Europe and the alt-right’s tactics here in this country. Just like the European far right, the alt-right in this country is extremely fixated on “cultural preservation and homogenity.” \\nHe also argued that the Kremlin may already be funding “dangerous people” in the United States. For that reason, Beck claimed, the alt-right is “a great danger to the republic,” and must be rooted out by true conservatives. He promised to do chalkboards on these links after the election, but was reluctant to do so now because “right now it would be viewed as pro or anti C or T.” \\nI never thought I’d see the day that I would find myself agreeing with Beck. After all, as we’ve seen already, Trump has more or less twiddled his thumbs while alt-right trolls acting on his behalf have brutally attacked and threatened anyone who dares speak out against him. Moreover, the alt-right has made no secret of its vicious anti-Semitism; they were the bottom-feeders behind “ echoes ,” an attempt to flag Jewish-sounding names online. \\nBut if these people are “a great danger to the republic,” Glenn, why wait until after the election to tell us more? I suspect that Beck is afraid that he’ll have to admit that he was the architect of most of the bile we saw from the tea party–including its resistance to any form of compromise. That mentality seems to have passed on to the alt-right. Perhaps Beck himself hasn’t seen it yet–or doesn’t want to see it. \\nStill, when the architect of the tea party sounds like a voice of sanity, there can no longer any doubt–the GOP civil war is well under way. \\n( featured image courtesy Gage Skidmore, available under a Creative Commons BY-SA license) About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742561653.2018635}