{"duration": 0.12926316261291504, "input_args": {"text": "'That is a great video. I’m glad I watched that again. plant_this_thought \\nlemonhead: Thanks for the video link. The comments for that video also included this link: ( https://www.youtube.com/watch?v=nkFJZUIUeEA ), which strongly recommends unground grains over bread products. It may also be the case, that the higher heat of baking is more destructive to the plant chemistry than boiling or pressure cooking. plant_this_thought \\nOther thoughts: \\nIt may be the case, that the higher heat of baking is more destructive to the plant chemistry than boiling or pressure cooking. \\nA particle of freshly ground flour is still enormous compared to a bacterium, but grinding probably increases the surface area accessible to the bugs somewhat, and the seed coat probably slows down penetration, which may be a good thing. Jack Hall \\nThe other factor to consider is that the increase in surface area increases exposure to digestive enzymes and degradation by HCL which would increase absorption of nutrients in the small intestine rendering it less useful to bacteria once it has reached the colon. Stewart \\nI would be interested in the the nature of the whole wheat rolls that were used in this study. Very often the difference in white rolls and whole wheat is minimal at best. They also tend to have added oils and frequently milk or whey. A real multi grain bread with higher fiber would likely do much better. \\nI’m looking for a good whole grain bread recipe if anyone can share one. lemonhead \\nI used to bake bread, but gave it up a while ago. I’ve been thinking about taking it up again and trying sprouted grains. Unfortunately, I don’t remember the recipe(s), just that I had to add extra gluten to 100% whole grain dough (and that my current oven sucks). Peter Reinhart’s books are great, you might find them at your local library. lemonhead \\nJust remembered something – I’ve noticed more than one of the centenarians (7th Day Adventists) I’ve seen interviewed make their own whole grain bread using freshly ground flour. Maybe there’s something to freshly ground flour or homemade whole grain bread, or maybe it’s the fact that they have a task to do every morning that gets them out of bed and keeps them active. Thea \\nlemonhead: One of my pet theories (nothing to back up that it makes a significant difference) is that home-made freshly ground flour a) will not have had as much time to lose as much nutrients and b) is not likely to be ground up quite as finely as what comes out of professional mills — and for these reasons is healthier. Even if true, I don’t know if it is healthier enough to make any kind of significant difference in health outcomes. It’s just a pet theory of mine. But I like it… Nick Presidente \\nMost whole wheat rolls are about 60% whole wheat, the rest refined.. they need to keep it soft and fluffy for that selling feature. Unfortunately multigrain buns are worse, with the majority of grain being refined. \\nI’ve been attempting a 100% whole grain, no oil or sugar bread. I add ground flax and molasses, with very little salt. The salt makes the rising and over proofing a major concern. Very hard to find a good recipe. Also using a bread machine is limiting, and I don’t have the tools right now to mix and bake by hand David J \\nGood point – if the studies did not use intact whole grains, then that alone could be the reason no benefit was found. Also I’m wondering if the whole wheat rolls or whatever else was used had emulsifiers in them. Some research on mice has shown that emulsfiers negatively impact gut bacteria. plant_this_thought \\nNick: My understanding is that the sugar (or molasses or honey) is only there as food for the yeast (which, of course, makes the bread rise). I wonder if the sugar content could be titrated to an amount that will be completely consumed by the yeast. Blair Rollin \\n1 cup whole grain spelt flour 1 1/4 cups whole wheat flour 1 1/4 cup whole grain rye flour 1/4 cup 7-10 grain cereal 1 tbsp ground flaxseed meal 2 1/4 tsp yeast 2 tsp salt (or whatever you like) 1 tbsp molasses 6 tbsp gluten 1 2/3 – 1 3/4 cups water \\nI use a bread maker. Knead for 15 minutes then let sit for 20 (turn the machine off and restart it). Then follow the machine cycle for whole wheat bread. \\nYou can substitute any other whole grain flour for the rye and it will be excellent, but possibly not as high a loaf. Bob’s Red Mill has a big selection of whole grain flours you can try. No preservatives so it’s only good for a day or so but it freezes perfectly.I have been baking these whole grain breads for over a decade and will not willingly eat any other except whole grain Wasa bread. Once you start eating these fabulous whole grain breads you begin to believe that people can indeed live on bread and water. \\nThe refined ingredient is the gluten. You can reduce the amount of gluten but it’s going to get a lot flatter. (This is one of the very few refined products that I eat, so I’m okay with it for the time being.) Thea \\nBlair Rollin: Thanks for taking the time to share a tried and true recipe with us! I’m not usually one for making bread, but you have me tempted with this recipe. Blair Rollin \\nI assure you, I’m very much in the camp of “whole grains are better than whole grain flours”. (I guess bread is just another hangover I have from my previous SAD diet.) But I only eat one slice of bread a day usually. The stuff is very handy for making a calorie rich meal (sandwich) that you can eat while you’re driving. And it’s good for sopping up the pot liquor from my red beans and collards. plant_this_thought \\nNo oil in this recipe. Is oil included in standard bread recipes just as a pan lubricant? Is it not required if one uses a non-stick pan? Thea \\nplant_this_thought: I don’t make enough bread to answer your question about what is standard. I can guess that non-stick pans would be one way to avoid oil. Another way is to just shape the bread in big round pillow and bake it in an oven instead of a bread machine. When you bake it in an oven, you can put it on a silicon mat or parchment paper and I imagine that no oil would be needed in that case either. (though I don’t know) . Stepping back a second. My philosophy: While I typically avoid oils in the food I cook, I’m not opposed to occasionally greasing a pan for a special recipe. I think that is a reasonable way to use oils in one’s life if I don’t have heart disease or diabetes. That’s just my approach which I’m sharing in case you would find it helpful. Ruth \\nSpelt is an old fashion wheat flower that hasn’t been messed with like the regular bread wheat. Its own gluton content is much lower because of not messing with it. Your bread will be lighter using the gluton flower with it. It is the gluton stretching that helps the bread to rise. AnnieVanCookie \\nYou made me laugh with the “until know” thing xD!! I wonder why there’s people with sad diet and aren´t obese. I have been all my life struggling to loose weight even though I always ate “healthy”. I see people eating crap everyday and they just wont get fat. TofuAnnie \\nI liked this pop-up as well! Your voice kept on as you’re mini-me pointed to the ‘until now’. It’s your signature, so why not?! I need to go back and re-watch the mircobiome videos. Thanks for your work, doc. David J \\nSorry but although I found it ok, it will keep me from sending it to skeptical people I am trying to convince to take this kind of work seriously. Nancy Altman \\nIt humor. Just humor. Come on, people, lighten up! It’s good for your health! Thea \\nAnnieVanCookie: Why do some people get fat and some stay thin when eating pretty much the same type of SAD diet? Why do some people get or stay fat even when they try to eat healthy? It’s a great question. Dr. Lisle, one of the experts from Forks Over Knives, does a good job of answering that question at the beginning of his talk, How To Lose Weight Without Losing Your Mind: https://www.youtube.com/watch?v=xAdqLB6bTuQ AZ DONALD \\nhi thea, \\ni searched and searched last night but couldn’t find the video i was looking for and am hoping you can direct me to it. \\nrecently, dr G changed his recommendation from methyl cobalomin to cyano cobalomin because a small percentage of people don’t absorb the methyl. \\nare you able to direct me to that one? \\nthanks, donald. Thea \\nAZ DONALD: From my memory, Dr. Greger has always recommended the cyanocobalamin form. Here are a couple pages where you see that recommendation: An Ask the Doctor page from 2012: http://nutritionfacts.org/questions/which-type-of-b12-is-best/ General nutrition recommendations from 2011: http://nutritionfacts.org/2011/09/12/dr-gregers-2011-optimum-nutrition-recommendations/ In the new book (How Not To Die), Dr. Greger talks about recommending the cyano… form because that’s the one that is tested in studies showing that it works. We don’t have the body of evidence showing that the other forms work. . If there is a page where Dr. Greger talks about changing his recommendation on B12, I’m sorry but I’m not aware of it. kari228 \\nGreat Share, I had never seen this before. Erica \\nWould you add an even greater benefit to the mixed whole grains by chilling them before eating? I’m curious whether we would get the benefits of resistant starches with chilled whole grains. The studies we had seen previously showed a benefit when processed or refined (white) grains where cooled/chilled and then consumed. \\nYes, that works if they’re chilled AFTER they’ve been cooked. They can be reheated and the resistant starches will remain. Mike Quinoa \\nWhat about whole grain pasta that’s not even cooked in the first place? I sometimes “cold-cook” pasta by just leaving it in cold water for a few hours, and then using it in a bean / pasta salad. David Hochstettler \\nI tried making bread without flour sugar and oil for over a year and finally let it go. Now I eat a slice of ezekial bread every day to satisfy my cravings for bread and 300 grams of cooked whole wheat ,barley and brown rice in their whole form. To cook it I boil 3 quarts of water and add 3 cups of wheat berries and a 1/2 a cup each of pearl barley and brown rice and simmer for an hour. Quick cool it by running cold water through it in a strainer and bag it up in 300 gram fold top sandwich bags. Richard \\nYou bring out a good point: bread is addictive! I can’t find where I read it before, but wheat has some kind of morphine-like substance it it. Bread is also an SOS (salt, oil, sugar) food. In fact, the average American gets more salt from bread than any other food. Bread has a high glycemic index, higher than intact grains. Trouble is, when I’m hungry, it’s the most convenient and appealing thing in the house. That is, it was. From now on, I’m going to keep bread out of my house and have some baked potatoes or yams in the fridge. Ben \\nThe ezekial breads and the silver hills breads are both healthy. Vege-tater \\nI often microwave a large sweet potato, then slice it and make thin “toast” for a quick “bread”. Steve Billig \\nI did not see in the study descriptions whether the whole grain variety that makes a difference in microbial richness (great term) is required over the course of a day, or perhaps over the course of a week. Did anyone pick that up? susan \\ngood question Steve, and its an interesting answer ! the transcript says they used whole grain barley, or whole grain brown rice and the combination of the two worked better than either alone . hmm might be able to make a cold chopped vegie salad using both grains that wouldnt be bad ! hope that answers your question steve. susan \\nsorry steve, I may have missed your question.. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3744518/figure/F1/ this page details showing the number of grams per day over the course of how many weeks . Steve Billig \\nVariety, to me, is one of foundations of healthy eating. Research shows that variety even trumps volume (more types of healthy foods yields better health than more volume of healthy foods). My understanding is that the way to achieve variety is to eat all the plant-based food groups (fruit, veg, grains, legumes, nuts/seeds) over the course of a day, and a variety within each food group over the course of a week (variety of nuts, or veg (crucifers/onion family/starchy family/leafy green family, etc.). Since the research only tested daily variety and not weekly variety, we do not know for sure, so in order to go with what we know, eat a variety of grains daily. susan \\nMakes total sense to me steve. They achieved a better result mixing two varieties, so I would think it would be very beneficial to mix it up over the course of the week. I plan on mixing up grains in salads more often.. throwing in some lentils too, and trying new combinations. thanks Steve ! Wegan \\nNo, you said the t word. Ed \\nGlad to see you more animated in your videos, but this one needs fireworks and music. I recently tried a newer probiotic with 115 interdependent strains, as I eat more veggies, beans,and lentils than most the changes were profound.This information can still kick my biome into another gear. Thanks. Previous Video'"}, "time": 1742628588.0963352}