{"duration": 0.09223532676696777, "input_args": {"text": "'For decades, it seemed as though Eileen Myles and her unflinching depictions of New York misfits and creatives would forever be relegated to the margins of the American canon. And then last year happened. ON A RECENT SUNDAY afternoon,  Eileen Myles came to meet me in the East Village on a white bicycle with brown leather handlebars. We chose as our destination Saint Mark’s     a historic portal of downtown Manhattan a few blocks from the   apartment where she has lived for nearly 40 years. Since 1966, the church has housed the Poetry Project, which began as a   funded attempt to address the teenage hippie runaway problem by offering free creative writing workshops, and which Myles discovered when she made her way to New York from Boston in 1974, then in her   and not yet out as a lesbian. There, she found the poets drinking and smoking cigarettes around long tables in the church’s back rooms, at seminars run by Alice Notley and Ted Berrigan. Allen Ginsberg came to readings, the group’s leaders were heroes and the East Village felt, to Myles, like the center of   American poetry. “The romance was that you had to be poor, you had to live in this neighborhood, you had to hang out and read all the books that everybody was reading, stay up all night, have an amazing life and write poetry,” said Myles, who had just returned from a visit to her second home in Marfa, Tex. with a tan. Her look is L. L. Bean meets the South Shore, a grandfatherly assortment of cotton   shirts, wool sweaters, a canvas coat and transition lenses in blond tortoiseshell frames, complemented by a Massachusetts accent that’s most pronounced when she’s reading poems or cracking wise. At the age of 66, Myles has published 19 books of poetry, prose and criticism, but until last year, when Ecco   released her 1994 novel, “Chelsea Girls,” many readers didn’t know who she was. That’s not to say she wasn’t famous in her own way  —   if you were a contemporary poet, if you were gay or if you had an interest in the cultural feminism of the 1990s, you probably read her. Each of these communities had its canon, and in their canons Myles figured. But 2015 was the year that the culture machine picked up Myles and transmitted her to a larger audience. The gritty, idealistic outsiders of New York’s creative scenes in the late ’70s  —   their era’s music, art and general sense of freedom  —   provided an antidote to the homogeneity of today’s pop culture, and few writers captured that romantic rawness quite like Myles. She published poems in The New Yorker and The New York Review of Books for the first time. Young women were reading her work in the coffee shops of Brooklyn. On television, on the Amazon show “Transparent,” the poems of a character named Leslie Mackinaw, played by Cherry Jones, are actually hers, and the fictional feminist professor is based on Myles, too. (Myles and the show’s creator, Jill Soloway, have dated.) This new generation of public feminists, including Beth Ditto, Lena Dunham and Tavi Gevinson, cite her as an inspiration, finding in her writing a ribald and ponderous succession to the New York School. Earlier in her career, she explained, publishers seemed only to accommodate so much difference, so that “if you were going to publish gay work, you were going to publish sentimental gay work, you were going to publish conventional gay work. ” Now, she said, ‘’I think what social media has done is made us relish variables. You know? We’re just living in these floating fragmentations. ” And with that came a realization that “everybody’s queer  —   everybody’s wrongly shaped for a culture that requires conformity. ” For many readers discovering Myles’s work for the first time, the experience was accompanied by a sense of confusion: Why hadn’t we read her sooner? Sitting under the   window at Saint Mark’s, Myles suggested that perhaps the distance of time has made her writing more palatable to the public. “To be too queer,” she said, “to be talking too graphically, closer to the present, is more frightening. ” In “Chelsea Girls,” Myles describes a world of penny loafers and   jean shorts, the World’s Fair, highway “comfort stations,” Filene’s Basement, teenagers hanging out in the parking lot of Butterick’s ice cream, “teevee”  —   all familiar baby boomer territory, but without nostalgia, and with a frankness about sexuality that opens a direct channel of connection from then to now. The novel also captures what it was like to be Eileen Myles in Manhattan in the ’70s and ’80s, when people planned their book parties according to the astrological calendar and went out afterward to a “glitter ball tall     Italian Lesbian disco environment. ” Her narrator gets her amphetamines from a corrupt diet doctor in Flushing, Queens, and redistributes them at the Strand. She subsists on garlic knots, hot dogs, Campbell’s tomato soup, Budweiser and cigarettes. She has lovers of different temperaments and physical forms. One of them convenes an “elite junkie salon. ” Another throws herself into the East River. Of a stint working a factory job in Maine: “The men were all men, and we were all lesbians, and everyone loved to get smashed. ” Despite having written the book 20 years ago, Myles’s literary style feels as contemporary as the essayistic autobiographical fiction of Sheila Heti, Ben Lerner and Tao Lin, who might be considered her literary offspring. Her work functions as a bridge between many of the discussions of the present  —   about sexual violence, class, “  culture”  —   and a past from which those narratives were often secret or hidden. And even though her writing is now being transmitted on that most mainstream of venues, the “teevee,” it seems to resist assimilation, in part by maintaining its sense of defiance. “I keep getting called a punk poet in the press, because they can’t say dyke,” she said dryly. Myles has been many things, but punk is not one of them. In her early years in New York she worked as a librarian on Wall Street. She sold subway slugs. She was employed by the Department of Corrections, where she would type up Dodgems, the poetry magazine she was publishing, which, at the time, was as common as starting a band. For half a year she was an assistant to the poet James Schuyler who, said Myles, had “a career as a mental patient,” supported by   friends who admired his writing. He lived at the Chelsea Hotel, and every morning Myles would bring him his newspapers and keep him company for the day. Schuyler was one of  Myles’s literary influences, of which there were many: Lucille Clifton, Susie Timmons, John Wieners and, of course, Ginsberg, “a poet who actually got heard. ” After sitting in Saint Mark’s for a while, we decided to get lunch at the   Ukrainian diner Veselka, the site of many late evenings for Myles and her friends. She scanned the room as if to surface the memories. “In the ’70s it was cool to be a poet,” she said. “In the ’80s it was a joke. ” And yet, in 1993, when she finished her novel after working on it for 14 years, it proved as resistant to the market as anything else she’d done. Finally getting it published by Black Sparrow Press  —   “they were indie but they were top of the indie,” she said  —   was a breakthrough. The head of the company, John Martin, saw in Myles a kind of female Bukowski, also a house author, although her own idea of “Chelsea Girls” was that it would be “’u2009‘On the Road’ for girls,” she said. Its release was followed by a series of unlucky coincidences: Bukowski died the same year it came out and the promotional energy turned to his legacy someone bought the rights to translate the book into French, but the translator died before its completion and although the movie rights to one of its essays, “1969,” were optioned, the film was never made. But maybe the book’s obscurity wasn’t just bad luck: Maybe the culture just wasn’t ready for it. Myles has a theory about her resurgent popularity  —   you might call it the Theory of the Bad Copy, which posits that most people who are breaking with the past do so by presenting initially as bad copies of an accepted person. Which is to say that Myles got published by Black Sparrow as a bad copy of Charles Bukowski. And that Leslie Mackinaw, on “Transparent,” is a bad copy of Myles. And that Hillary Clinton  —   who Myles recently endorsed  —   is a bad copy of the male presidential figure, but one who Myles insists will be different because of her gender. People get published or elected or onto television shows because they’re bad copies painted in broad strokes  —   that’s how difference slips by, and then the bad copies break with the past and make something new. This seems to have been Myles’s plan all along. “If a fool will persist in their folly, he will be wise, right?” she said, smiling, because she knew she already was.'"}, "time": 1742628433.61495}