{"duration": 0.16031932830810547, "input_args": {"text": "'Written by Justin Raimondo   As Donald Trump takes the reins and we all prepare for the next four years, the need to translate rhetoric into reality comes to the fore. Trump spent the campaign repeating a phrase that horrified the elites – especially the foreign policy Establishment – even adopting it as his official campaign theme: “America first.” The elites were aghast because the phrase evokes the legacy of the biggest anti-interventionist movement in American history: the America First Committee , a coalition of conservative businessmen and progressive activists (including the socialist Norman Thomas) who not only opposed US entry into World War II, but also pointed to the authoritarian tendencies of the Franklin Roosevelt administration, which they feared would be exacerbated in wartime – as indeed they were . Smeared by pro-war liberals and their Communist party allies as “Nazi sympathizers” — in the same way antiwar activists were later accused of being pro-Communist, pro-Saddam Hussein, pro-terrorist, etc. – the AFC has not fared well with historians, who, for the most part, are Roosevelt partisans, and globalists in any case. The America Firsters are the original “isolationists” the War Party warns us about, “dangerous” subversives who saw that in the quest for a “world order,” Americans would lose their old republic. Which is precisely what happened . Whether consciously or not, Trump has revived this long-disdained trend in American politics, and, what’s more, he has won. So how does –or should – he translate this kind of rhetoric into reality? What follows is the first of a series of columns on what a foreign policy that puts “America first” would look like. Today we deal with US-Russian relations. Stop the new cold war – Hillary Clinton’s unhinged accusation that Trump is a “Russian puppet” gave us a scary preview of what Russo-American relations would be like if she had won. These crazed charges were in response to Trump’s polar opposite view, exemplified when he repeatedly said “ Wouldn’t it be nice if we could get along with Russia? ” Given a clear choice between a new cold war and rapprochement, voters clearly preferred the latter. Now it’s time to translate rhetoric into reality. Trump should immediately meet with Russian President Vladimir Putin and begin negotiating a comprehensive accord to settle all outstanding issues, including: Unilaterally lifting US sanctions against Russia – This is the prerequisite for productive negotiations, a signal that we don’t consider the Russians our enemies, and that the vindictive policies pursued by the previous administration are a thing of the past. Renewing arms limitations – Several arms reduction treaties have been allowed to lapse , or have been nullified , increasing the danger of open conflict that could end in disaster. Of particular importance is reviving the joint anti-proliferation efforts designed to locate and secure “loose nukes” floating around the post-Soviet regions. Pulling back US troops from provocative “military exercises” – This is another prerequisite for mutually advantageous relations. The Russians rationally perceive a threat to their security as long as NATO troops are mobilizing at the gates of Moscow . Removing this provocation is essential to normalizing relations. Abjuring a “missile shield” in Eastern Europe – The rationale for a “missile shield” has always been the alleged threat of an attack on Eastern Europe by … Iran . Aside from being a lie, this is not a very convincing lie: indeed, it is nonsensical. The reality is that a) the real target is Russia, and b) Russia’s military budget – now undergoing reductions – is dwarfed by Europe’s: Russia’s GDP is the equivalent of Spain’s . The idea that they’re going to invade and conquer Europe is pure fiction. Recognizing the referendum that overwhelmingly voted to reunite Crimea with Russia – The regime change operation that overthrew the democratically elected government of President Viktor Yanukovich and plunged that country into chaos was sponsored and succored by the US , acting in concert with Germany and other European powers. And it was a mistake, one that could have just as far reaching consequences as our disastrous policy in Iraq. Crimea was handed to Ukraine before the fall of the Berlin Wall by then Soviet leader Nikita Khrushchev in 1954 : it had been an integral part of Russia since the days of Catherine the Great. This thorn in the side of US-Russian relations must be pulled. Setting up a US-Russian working group, also involving regional stakeholders, to resolve the “frozen conflicts” in South Ossetia, Transnistria, Abhazia, and Nagorno-Karabakh - These are all tripwires that, due to our membership in NATO, and other commitments,could result in open conflict between the US and Russia. Do we really want to go to war with a nuclear-armed country in order to defend Moldova’s claims to rebellious Transnistria ? Neutralizing Ukraine – Ukraine, formerly part of the old Soviet Union, is now an independent nation, and a sore point between the US and Russia. The current regime is unstable, corrupt, and dependent on US aid. We have no legitimate national interests in propping it up: we do have an interest in reducing tensions in the region. Ukraine should be “neutralized,” i.e. kept out of NATO. Furthermore, US troops currently on “training” missions there should be withdrawn in exchange for a pledge guaranteeing Ukraine’s territorial integrity. Resolving the Syrian conflict – The cries of the War Party to “solve” the Syrian civil war in favor of Islamist rebels have drowned out all sensible realistic solutions to the horrific conflict that has torn that nation apart. It’s time for a fresh approach. First on the agenda is abandoning the bankrupt policy of regime-change that has led to tragic consequences in Libya, Iraq, and now Syria. Funding for the rebels must be ended: as Trump has said “ We have no idea who these people are ,” and he is absolutely right. All too often we have wound up swelling the ranks of al-Qaeda and its sympathizers by trying to micro-manage the future of that country. Russian intervention on behalf of the government of Bashar al-Assad has complicated the conflict and risks involving US “advisors” in direct confrontation with both Russian and Syrian government forces. We should immediately reestablish diplomatic relations with the Syrian government, appoint an Ambassador, and begin trilateral negotiations with Russia and the Assad government about how to deal with ISIS. While the Iraq and Afghan conflicts have eaten up most of the energy and attention of US policymakers, relations with Russia have suffered — and have been allowed to dangerously degenerate under President Obama. The famous “Russian reset” consisted of a series of demands made by Washington – e.g. overflight of Russian territory to resupply US troops in Afghanistan – without any corresponding concessions except on the margins. The main issue – NATO’s relentless eastward march and the continuing US regime change campaign in Syria – were ignored in spite of Russian entreaties. The core of contention is the undefined role of NATO in the post-Soviet world. As President-elect Trump said during the campaign, the alliance is “ obsolete ” – and a financial burden on the US. An “America first” foreign policy worthy of the name must reevaluate NATO, and be prepared to abandon it if it cannot or will not be fundamentally transformed. NATO’s original mission was to protect Western Europe from a Soviet invasion that never came – and now that the Soviet Union is no more, and the nations of the former Warsaw Pact are out of the Russian orbit, it’s high time Europe began to stand on its own. We have to ask ourselves: Is defending the “territorial integrity” of, say, Estonia, really worth risking World War III with nuclear-armed Russia? Poland’s borders have changed many times over the previous decades, as have the borders of most of the states in the region. Are we committed to going to war to ensure that they remain forever immutable? This is one of the most volatile regions on earth, with obscure ethnic conflicts that go back centuries: while we have an interest in peace, we cannot guarantee the security of its governments and peoples. That’s their job. The job of our policymakers and military leaders is to put distinctly American interests first – and that cannot mean policing the world. Reprinted with permission from Antiwar.com . Related'"}, "time": 1742563439.5756443}