{"duration": 0.06391596794128418, "input_args": {"text": "'By John V. Walsh October 31, 2016 \\nEvery presidential vote, like every other vote, demands that one set priorities, for it is a rare voter indeed who will agree 100% with a given candidate. And surely in the coming presidential election survival must top the list of priorities. What can be more important than the survival of human civilization and perhaps humanity itself? \\nHere is a brief primer on the subject – suitable for printing out for liberal friends. \\nNo Fly Zone over Syria \\n“I personally would be advocating now for a no-fly zone (inside Syria)….” \\nHillary Clinton interview , October 1, 2015, the day after Russia began air operations over Syria. Clinton has held this position since 2013 at least when she admitted it would “ kill a lot of Syrians .” She has maintained it right up to the final presidential debate when she went “all-in on Syria no-fly zone ” as the pro-Clinton Huffington Post headlined it. \\n“Right now, Senator, for us to control all the airspace in Syria would require us to go to war – against Syria and Russia. That’s a pretty fundamental decision that certainly I’m not going to make.” \\nChairman of the Joint Chiefs of Staff, General Joseph Dunford in Congressional testimony on September 22, 2016. Dunford’s alarm is shared by other “national security” experts and those previously involved in implementing such zones. \\n“What we should do is focus on ISIS. We should not be focusing on Syria. You’re going to end up in World War Three over Syria if we listen to Hillary Clinton . …You’re not fighting Syria anymore, you’re fighting Syria, Russia, and Iran, all right? Russia is a nuclear country, but a country where the nukes work as opposed to other countries that talk.” (Emphasis, JW.) \\nDonald Trump in Reuters interview on October 25, 2016, headlined “Exclusive – Trump says Clinton policy on Syria would lead to World War Three.” \\nSo there you are. It is not complicated. We have seen Clinton’s actions over 26 and more years. She has not hesitated to kill hundreds of thousands and destroy entire countries. Libya and now Syria are but the latest examples. There is no doubt what she will do once in office. As Ralph Nader has said, she has never seen a war she did not love. Or as Trump has said, she is “trigger happy.” \\nBroader U.S. Russia Relations \\n“Now if this sounds familiar (Putin’s actions in Crimea, jw), it’s what Hitler did back in the 30s…..All the Germans that were … the ethnic Germans, the Germans by ancestry who were in places like Czechoslovakia and Romania and other places, Hitler kept saying they’re not being treated right. I must go and protect my people….” \\nHillary Clinton comments comparing Putin’s actions to Hitler’s at a private gathering, March, 2014 \\n“Mrs. Clinton has chosen to take up a very aggressive stance against our country, against Russia. \\n“Mr. Trump, on the other hand, calls for cooperation – at least when it comes to the international fight against terrorism. \\n“Naturally we welcome those who would like to cooperate with us. And we consider it wrong, that we always have to be in conflict with one another, creating existential threats for each other and for the whole world. \\n“If somebody out there wants confrontation, this is not our choice but this means that there will be problems.” \\nPresident Vladimir Putin addressing a group of journalists in Russia, October, 2016. \\n“Wouldn’t it be nice if we actually got along with Russia and China and all these countries? Wouldn’t it be nice?” \\nDonald Trump at a rally in Clinton, Iowa, January, 2016, stating a position that he has often voiced. \\nMy progressive friends dismiss this and many other statements of Trump’s with the easy rejoinder that Trump is inconsistent and opportunistic, that one cannot believe what he says. But his statements on Russia are quite consistent. And they are quite the opposite of opportunistic; they do not gain him votes, they have cost him votes. He stated his Russia-friendly position from the beginning in the Republican primaries, as for example in the statement above which was made in Iowa before the caucuses. That was no advantage to him. The Republican Party at that time was dominated by the neocons, and its Establishment remains hawkish to the present as John McCain, Mitt Romney, and many others demonstrate on a near daily basis. Trump has stuck with his position right up through the final presidential debate, even though his own vice presidential candidate has tried to pull him away from it and even though Hillary has used it as a club with which to beat him. There has been no inconsistency and it has been costly for him. That means you can take it to the bank as a matter of principle for him. \\nIn fact, Trump has been as determined and consistent in seeking peace with Russia and Syria as Clinton has been in demonizing Putin and seeking a no-fly zone in Syria. That is a clear and striking difference between them. \\nA testimony of great value to progressives \\n“On the issue of war and nuclear weapons, it is actually Hillary’s policies which are much scarier than Donald Trump (sic) who does not want to go to war with Russia. He wants to seek modes of working together, which is the route that we need to follow not to go into confrontation and nuclear war with Russia.” \\nJill Stein, Green Party candidate for president, interview on October 12, 2016. \\nIf, dear reader, you do not believe that Hillary will put us in a war situation with Russia to advance the power of the Indispensable Nation and the Exceptionals, then please read again the first three quotes at the beginning of this essay. In the absence of Hillary from his Cabinet, Obama has been wary about plunging into a misadventure in Syria. But Hillary does not hesitate when it comes to such bloody undertakings; she revels in them. \\nAnd if you have priorities that outstrip the question of survival, then this essay will mean little to you. But I submit that most other questions pale into insignificance next to this one – if not for you, then for your loved ones and for your fellow human beings. The Best of John V. Walsh Tags: John Walsh [ ] is a frequent contributor to CounterPunch.com, Antiwar.com, LewRockwell.com and DissidentVoice.org. He is a founding member of “Come Home America.” Until recently he was Professor of Physiology and Neuroscience at the University of Massachusetts Medical School. Copyright © 2016 John V. Walsh'"}, "time": 1742628436.5208092}