{"duration": 0.03633594512939453, "input_args": {"text": "'Prison Planet.com October 26, 2016 \\nOne of Norway’s nuclear reactors was discovered to be leaking radioactive iodine Monday morning, according to the Norwegian Radiation Protection Authority (NRPA). [1] \\nIn a statement released today, the NRPA said: \\n“The radioactive leak was due to a technical failure during treatment of the fuel in the reactor hall. Emissions are low.” \\nExperts say contamination levels around the Institute for Energy Technology, in the southern town of Halden, were well within legal limits and posed no risk to the public. \\nSaid Per Strand, deputy director-general at the NRPA, a government regulator: \\n“Of course it’s an unfortunate situation but there is a low environmental risk. This is not the sort of leak we want.” [2] \\nThe radioactive iodine was a byproduct of the uranium which powers the facility. \\nStaff were evacuated from the institute, but later returned, donning protective gear, to assess the cause and extent of the leak, and halt it. \\nA senior NRPA official said the incident would “maybe” be rated a 1 on the International Nuclear Event Scale, which rates nuclear incidents from 1 to 7. By comparison, the incidents at Fukishima and Chernobyl were ranked 7. [3] Source: The Government of the Hong Kong Special Administrative Region \\nRegulatory officials were frustrated that they were not notified about the leak until today . Atle Valseth, a research director at the Institute for Energy Technology, agreed. He said: \\n“I don’t sit so close to those decisions but I think we should have informed the authority yesterday. We will have to go through why it wasn’t reported — it wasn’t good enough that we didn’t report it yesterday.” [2] \\nStrand, the head of safety, preparedness and environment at the NRPA, expressed the regulator’s frustration. \\n“We need to gather more information … But we are not happy with the situation, that we were not warned immediately. We will investigate further.” [3] \\nThe Swiss Radiation Safety Authority (SRSA) said i t has not detected any radiation emanating from the facility, which sits close to the Swiss border. \\nMark Foreman, a nuclear expert at the Chalmers University of Technology in Sweden, stressed that the vast majority of the radioactive iodine is trapped inside the fuel, which is contained within a ceramic material. The ceramic-wrapped material is stored inside a metal tube that is welded shut. The tube is inside the reactor. \\nThe iodine would have to leak out of the reactor to enter the reactor hall. \\nSources:'"}, "time": 1742628303.8447134}