{"duration": 0.022138595581054688, "input_args": {"text": "'On Thursday, Fresno State University canceled lecturer Lars Maischak’s scheduled classes for the next week. The cancellation comes amid a Secret Service investigation that followed a Breitbart News report on Maischak’s “Trump must hang” tweet. [On April 8, Breitbart News reported that the tweet, which has since been pulled, said:  To save American democracy, Trump must hang. The sooner and the higher, the better. #TheResistance#DeathToFascismhttps:  .   —   Lars Maischak (@LarsMaischak) February 18, 2017, Later that same day, the Fresno Bee quoted Maischak dismissing the Breitbart report, saying, “The function of articles like the one produced by Breitbart and affiliates is to whip up a digital   of people sending threats and insults to my email and Twitter accounts, with the ultimate goal of silencing dissenters. ” On April 10, Maischak emailed the Bee to say that university president Joseph Castro was “allowing himself to be instrumentalized for a   smear campaign” if he took the Breitbart News report to heart. On Wednesday, Maischak closed his Twitter account. He also apologized to the university, and president Castro said the apology was a “good first step. ” But Castro indicated an investigation into Maischak’s tweets was ongoing. On April 12, the Bee reported that the FBI and Secret Service were “probing” Maischak’s tweets. And Castro said he had “been in frequent contact with the FBI, Secret Service and Homeland Security since last Saturday. ” On April 13, the Bee reported that Fresno State officials cancelled Maischak’s Monday and Tuesday classes for next week. Maischak teaches history, specializing in the 19th century United States. He also teaches a course on intellectual history, called “Marx and Hegel for Historians. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628501.7180018}