{"duration": 0.029530763626098633, "input_args": {"text": "'Cómo sería Estados Unidos con Donald Trump de presidente Un alto rango iraquí ha previsto el colapso de Estados Unidos después de Donald Trump. Date: 2016/11/13 Time: 12:06 View: 63 VONpress, EEUU _En un comunicado emitido el jueves, el líder del poderoso Movimiento Sadr de Irak, Muqtada al-Sadr, criticó al magnate inmobiliario por no distinguir entre el radicalismo del Islam y los musulmanes moderados, al tiempo que le advirtió de que “no se meta en nuevas apuestas en política, cuyos resultados no serían nada más que pérdidas, sangre y más guerras”.Según Al-Sadr, incluso con el cambio de mandatario, “las políticas hostiles de EE.UU. hacia el mundo no cambiarán”. El clérigo chií, de 43 años, lamentó que el enfoque de Washington hacia Oriente Medio e Irak siga intacto sin importar quién sea el presidente o qué partido político dirija la Administración.Asimismo, advirtió de que la prolongación del conflicto en Oriente Medio solo agudizará los problemas en EE.UU., justo cuando el país norteamericano se ve agobiado por la crisis financiera.Además, urgió a los estadounidenses a resistir ante la retórica de intolerancia, antislámica y de odio, del nuevo presidente electo del país norteamericano.\"Aconsejamos al pueblo estadounidense que no se deje influenciar por el radicalismo de su presidente y que no le permita imponer su voluntad\", de lo contrario, sufrirá un aislamiento internacional, recogió la agencia estadounidense AP.Por último, Al-Sadr deseó que “la paz esté con el pueblo estadounidense” y aclaró que, para su movimiento, el principal enemigo sigue siendo el régimen de Israel.El miércoles, Trump desafió todos los pronósticos y sorprendió al mundo convirtiéndose en el sucesor del presidente saliente de EE.UU., Barack Obama, en la Casa Blanca. No hay comentarios para esta noticia Nombre : '"}, "time": 1742564138.60596}