{"duration": 0.03128361701965332, "input_args": {"text": "'  \\nTrump’s chances of winning Tuesday’s election are pretty close to zero. Nearly everyone both inside and outside his campaign understands that, except him. Trump is a type A personality taken to extremes and he cannot accept failure. When faced with an actual loss (and in this case a humiliating national one), his mind creates a counter narrative that he can accept. Things are rigged. The race was stolen. Everyone is against him. \\nI’m not just saying this because he looks crazy on TV. Plenty of people have come forward with some pretty horrific tales of what happens when Trump feels like he’s lost something. Even the littlest loss will set him into a tale spin of self-deception. Take Vanity Fair editor Graydon Carter , who made an off-hand comment in Spy Magazine about Trump’s small hands. For the last 30 years he’s been receiving odd notes: \\nTo this day, I receive the occasional envelope from Trump. There is always a photo of him—generally a tear sheet from a magazine. On all of them he has circled his hand in gold Sharpie in a valiant effort to highlight the length of his fingers. I almost feel sorry for the poor fellow because, to me, the fingers still look abnormally stubby. \\nThen there’s Selina Scott who also claims to have received weird little love notes from Trump calling her “sleazy” and suggesting she’s not a very good journalist. This after Trump tried and failed to seduce her. \\nTrump also tried a similar tact with Selma Hayek; first he asked her out and then once she refused, he attacked. She says that he leaked a story to the National Enquirer that he turned her down because she was too short. (Later, he attempted to turn that smear into a positive by suggesting she go out with him to prove the story wrong. Classy.) \\nThat’s exactly what seems to be going on inside the Trump campaign right now. There’s a lot of anger and a lot of bizarre story-telling an anonymous Trump staffer told New York Magazine . He compares the atmosphere to what being in the bunker with Hitler must have been like just before he killed himself. People are all smiling at meetings and then returning to their offices to desperately search for work elsewhere. Kellyanne Conway, Trump’s newest campaign manager, is increasingly upset with him over his lack of strategy. Supposedly, before Paul Manafort left the Trump campaign he suggested that they try to keep Trump completely out of the public eye: \\nThe best thing we can do is to have you move into a cave for the next four months. If you’re not on the campaign trail, the focus is on her, and we win. \\nIn just over a week, Trump will have another loss to rationalize away. It’s likely to get pretty ugly and someone no doubt will receive some creepy news clippings in the mail. But just remember that not long ago this guy was actually neck and neck with Hillary Clinton. This bizarre sex-crazed business baby could have actually wound up being our next president. So congratulations America; but also, get your shit together. \\nFeatured Image via Spencer Platt/Getty Share this Article!'"}, "time": 1742628435.7679157}