{"duration": 0.07809209823608398, "input_args": {"text": "\"NTEB Ads Privacy Policy As Hillary Unfavorables Hit New High, WikiLeaks Warns It’s Launching ‘Phase Three’ Of Election Emails Wikileaks supporters, now including a number of disgruntled GOP nominee Donald Trump and Bernie Sanders supporters, promptly replied with tweets expressing hope that phase three would ultimately damage Democratic presidential nominee Hillary Clinton's campaign. User “CorruptMedia” responded with a Photoshopped estimating what CNN coverage of Clinton being escorted to jail would look like. by Geoffrey Grider October 31, 2016 Sixty percent of voters view Hillary Clinton unfavorably, according to a ABC News/Washington Post poll released Monday morning, the highest level of unpopularity yet for the Democratic presidential nominee. \\nOn Sunday night , Wikileaks enigmatically tweeted that it would launch “ phase 3 of [its] US election coverage” in the coming week. The site put politicians on notice Sunday evening in a tweet that also included a plea for donations. \\nUsing the last two nights’ results , after FBI Director James Comey revealed a further Clinton-related email investigation , 47% of the Democratic nominee’s supporters said they were very enthusiastic about her, compared with 51% across the previous six nights. Trey Gowdy on FBI Finding 650,000 Clinton Emails \\nAs the Hill noted , Wiki did not provide information about what the third phase entails or if there are still more revelations to come. As a reminder, Wikileaks’ founder Julian Assange currently finds himself in the Ecuador embassy where his internet access has been revoked for the duration of the presidential campaign to avoid the appearance of intervention. \\nWikileaks supporters , now including a number of disgruntled GOP nominee Donald Trump and Bernie Sanders supporters, promptly replied with tweets expressing hope that phase three would ultimately damage Democratic presidential nominee Hillary Clinton’s campaign. User “CorruptMedia” responded with a Photoshopped estimating what CNN coverage of Clinton being escorted to jail would look like. We commence phase 3 of our US election coverage next week. You can contribute: https://t.co/MsNZhrTzTL @WLTaskForce pic.twitter.com/XferJnMGux \\n— WikiLeaks (@wikileaks) October 30, 2016 A new archive of Clinton-related documents would further irk a campaign still reeling from FBI director James Comey’s announcement on Friday that new emails related to the Clinton server probe had been discovered. \\nWikileaks has already posted hacked emails from the Democratic National Committee and Clinton campaign chief John Podesta: the former led to the resignation of former DNC chair Debbie Wasserman-Schultz after it was revealed that the DNC was actively scheming to prevent Bernie Sanders’ nomination; the former has led to a series of dramatic revelations into the strategic operations of the Clinton campaign, with the most damaging emails exposing the Clinton Foundation and WJC’s consulting outfit Teneo as an “influence-peddling” pay-to-play organization as noted most recently in “ Doug Band To John Podesta: “If This Story Gets Out, We Are Screwed” “ SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING\""}, "time": 1742562952.4315891}