{"duration": 0.1557319164276123, "input_args": {"text": "'ReadyNutrition Guys and Gals, as you know we’re down to the wire just before the U.S. presidential election: an election that will shape the face of the country for a long time. But will we make it there? And if so, will we make it through it, and the transition period? With the contrived “Russian Cyber threat,” along with the very real threat of nuclear war, an EMP (Electromagnetic Pulse) attack, a true Cyberattack, an economic and societal collapse, or a grid down scenario, we have enough things to look out for. When things of this nature make the mainstream news media, it may be time to start preparing if you have not done so.\\nIt’s time to prepare for the worst-case scenario with this best-selling preparedness manual People are Planning for Unrest Following the Election Emergency food sales and preparedness related supplies have soared due to the upcoming election. Here are excerpts from this article:\\n“What’s feeding this new urgency? Survivalist consumers say they’re preparing for post-election unrest that could involve everything from massive riots, to power grid outages, to the total collapse of the financial system where a can of food becomes currency. \\nNor is it limited to just rural areas. Frederick Reddie, a 41-year-old ‘urban prepper’ from Pittsburgh, Pennsylvania is stocking upon staples like rice and peanut butter and working on expanding his 6-month supply of emergency food to two years. He has to use a pseudonym to protect his supply from any future hungry neighbors, he told NBC News.” \\nWell, it seems as if “Freddie Reddie” may have read my article about neighbors and “The Shelter” episode of the Twilight Zone. In any event, he has the right idea. Certainly, if you can afford it and wish to invest, then by all means (and by your choice), indulge as best fits into your budget and storage plans. The aforementioned article reported that several companies that sell freeze-dried and dehydrated foods in Mylar that are packed in buckets are being bought akin to a wildfire. Telephone orders are through the roof, and the companies reported they have needed extra staff to take care of the purchases.\\nWhy Canned Goods are a Good SHTF Investment I personally like the canned goods. They’re within my budget (no, JJ is not a millionaire or even close), and they are the basis for my logistical needs. I don’t normally eat a lot of canned goods, and for a survival situation, I’m not overly concerned with the food being organic, or any “ leaching ” that may occur out of the can liners. My focus is on complete nutrition : protein, carbohydrates, fats, and vitamins. Canned foods have been time-tested with me: I have had cans of vegetables and meats that I had in New Orleans during Katrina that (after ten years) were still just fine when tested.\\nIndeed, they found canned meat from Arctic and Antarctic missions such as Scott’s and Amundsen’s that had been almost a hundred years old with the contents still edible. Canned goods can take tremendous changes in temperature and still be perfectly edible. Canned goods are also pretty affordable and can even be found at dollar stores . Everyone has undoubtedly concentrated on the basics, as follows:\\nSoups, prepared dinners (pasta dishes, chili), stews, canned meat (chicken and fish), canned beans and vegetables.\\nBe Careful of Tricky Manufacturers You have to watch out: they’re starting to shrink not only portion size but portion content. I just picked up the last case of ready-made mini beef ravioli with meatballs. My sneaky grocers kept the same label on the cans but removed the “with meatballs” from the label…and (as you may have guessed) the meatballs, as well. The can with the meatballs has a protein content of 22 grams (g), or 11 g per serving. The one without the meatballs only has 16 g per can (8 g per serving), and they “phased” out the ones with the meatballs, but left the same price…79 cents per can.\\nDoesn’t sound as if it’s much, but when you buy 20 cans, that’s 120 grams of protein less in the variety sans meatballs. Same for peanut butter, where they conveniently shrank the portion size but kept the same sized jar. In addition to the canned goods, you can still find some case lot sales on dry goods, such as pasta, rice, peanut butter, crackers, and so forth. With canned goods, don’t write off canned mackerel or sardines from your preps. They’re high in protein and Omega-3 fatty acids.\\nWe’re getting close to “crunch time” with all of these things happening. Now is the time for you to stretch your dollars and prepare according to the many tips and articles you’ve read and researched here on ReadyNutrition. Use those Gatorade and 2-liter soda bottles to build up as much of a bottled water supply as you can. For your canned goods, if you can put them in bins, all the better. If not, try out some cardboard boxes, and be sure to label them or mark them on the outside with a magic marker for what the general contents are.\\nStaying Organized Inventory sheets (as I’ve mentioned in articles past) go a long way in rotating your supplies and also for keeping track of their contents. For canned vegetables, concentrate on the ones you can get the most for your money with. Examples would be canned, whole potatoes, spinach, kale, beans (such as baked or black…not the green beans that are almost devoid of nutrition), sauerkraut (excellent vitamin C source), canned fruit high in vitamin C (grapefruit, mandarin oranges, etc.). Other prepared foods in cans are macaroni and cheese that you can add meat to if you wish.\\nThey last a long time, come precooked (therefore can be eaten right out of the can), and they can take a beating. Let’s not also forget canned juices, such as fruit juices and vegetable juices (tomato, V-8, etc.) Stick with the non-carbonated stuff, as it’s better for you and will be less prone to burst on a fall or impact. Here is a good list to follow .\\nIn a nutshell, these canned goods and dry goods can help you boost up your supplies, or provide you with a base if you have not been preparing. All of the advice in the world will not help you unless you put it to use with actions. As things occur both in the U.S. and the world, now is the time to take advantage and do all that you can, and the canned goods can be found within your budget that fulfills your basic needs. Keep in that good fight, and fight it all the way! JJ out!\\n \\n \\nRelated Material: 11 Emergency Foods That Last Forever \\nThe Prepper’s Cookbook \\nHow to Stock a Prepper’s Pantry \\nFive Family Friendly Food Pantry Organizing Tips Anyone Can Do \\nPrepping With Wheat Allergies \\n5 Ways to Stretch Your Meals SHTF Style \\nFood Pantry: Take Care of Your Basic Needs \\n72 Hours Without This Will Kill You: Survival Water Fundamentals \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 7th, 2016 Ask Tess: Do I need to rotate my canned vegetables and… 15 Items to Start Your Food Prep Off Right Frugal Prepping: 30 Survival Items You Can Get at the Dollar Oven Canning for Long Term Storage How to Stock a Prepper Pantry '"}, "time": 1742561822.1546998}