{"duration": 0.19653606414794922, "input_args": {"text": "'ROME  —   When Stephen K. Bannon was still heading Breitbart News, he went to the Vatican to cover the canonization of John Paul II and make some friends. High on his list of people to meet was an archconservative American cardinal, Raymond Burke, who had openly clashed with Pope Francis. In one of the cardinal’s antechambers, amid religious statues and   walls, Cardinal Burke and Mr. Bannon  —   who is now President Trump’s   eminence  —   bonded over their shared worldview. They saw Islam as threatening to overrun a prostrate West weakened by the erosion of traditional Christian values, and viewed themselves as unjustly ostracized by    political elites. “When you recognize someone who has sacrificed in order to remain true to his principles and who is fighting the same kind of battles in the cultural arena, in a different section of the battlefield, I’m not surprised there is a meeting of hearts,” said Benjamin Harnwell, a confidant of Cardinal Burke who arranged the 2014 meeting. While Mr. Trump, a   president who has boasted of groping women, may seem an unlikely ally of traditionalists in the Vatican, many of them regard his election and the ascendance of Mr. Bannon as potentially   breakthroughs. Just as Mr. Bannon has connected with   parties threatening to topple governments throughout Western Europe, he has also made common cause with elements in the Roman Catholic Church who oppose the direction Francis is taking them. Many share Mr. Bannon’s suspicion of Pope Francis as a dangerously misguided, and probably socialist, pontiff. Until now, Francis has marginalized or demoted the traditionalists, notably Cardinal Burke, carrying out an inclusive agenda on migration, climate change and poverty that has made the pope a figure of unmatched global popularity, especially among liberals. Yet in a newly turbulent world, Francis is suddenly a lonelier figure. Where once Francis had a powerful ally in the White House in Barack Obama, now there is Mr. Trump and Mr. Bannon, this new president’s ideological guru. For many of the pope’s ideological opponents in and around the Vatican, who are fearful of a pontiff they consider outwardly avuncular but internally a ruthless wielder of absolute political power, this angry moment in history is an opportunity to derail what they see as a disastrous papal agenda. And in Mr. Trump, and more directly in Mr. Bannon, some   “Rad Trads”  —   or radical traditionalists  —   see an alternate leader who will stand up for traditional Christian values and against Muslim interlopers. “There are huge areas where we and the pope do overlap, and as a loyal Catholic, I don’t want to spend my life fighting against the pope on issues where I won’t change his mind,” Mr. Harnwell said over a lunch of cannelloni. “Far more valuable for me would be spend time working constructively with Steve Bannon. ” He made it clear he was speaking for himself, not for the Institute for Human Dignity, a conservative Catholic group that he founded, and insisted that he shared the pope’s goals of ensuring peace and ending poverty, just not his ideas on how to achieve it. Mr. Bannon publicly articulated his worldview in remarks a few months after his meeting with Cardinal Burke, at a Vatican conference organized by Mr. Harnwell’s institute. Speaking via video feed from Los Angeles, Mr. Bannon, a Catholic, held forth against rampant secularization, the existential threat of Islam, and a capitalism that had drifted from the moral foundations of Christianity. That talk has garnered much attention, and approval by conservatives, for its explicit expression of Mr. Bannon’s vision. Less widely known are his efforts to cultivate strategic alliances with those in Rome who share his interpretation of a   “church militant” theology. Mr. Bannon’s visage, speeches and endorsement of Mr. Harnwell as “the smartest guy in Rome” are featured heavily on the website of Mr. Harnwell’s foundation. Mr. Trump’s senior adviser has maintained email contact with Cardinal Burke, according to Mr. Harnwell, who dropped by the cardinal’s residence after lunch. And another person with knowledge of Mr. Bannon’s current outreach said the White House official is personally calling his contacts in Rome for thoughts on who should be the Trump administration’s ambassador to the Holy See. During Mr. Bannon’s April 2014 trip he courted Edward Pentin, a leading conservative Vatican reporter, as a potential correspondent in Rome for Breitbart, the website that is popular with the   a   movement that has attracted white supremacists. “He really seemed to get the battles the church needs to fight,” said Mr. Pentin, the author of “The Rigging of a Vatican Synod?” a book asserting that Pope Francis and his supporters railroaded opponents. Chief among those battles, Mr. Pentin said, was Mr. Bannon’s focus on countering a “cultural Marxism” that had seeped into the church. Since that visit and the meeting with Cardinal Burke  —   an experience that Daniel Fluette, the head of production for Breitbart, described as “incredibly powerful” for Mr. Bannon  —   Mr. Trump’s ideological strategist has maintained a focus on Rome. Mr. Bannon returned to direct the documentary “Torchbearer,” in which the “Duck Dynasty” star Phil Robertson contemplates the apocalyptic consequences of an eroding Christendom. Mr. Bannon also reunited with old friends, including Breitbart’s eventual Rome correspondent, Thomas Williams. A former priest, Mr. Williams said that he used to have arguments with Mr. Bannon about whether the pope subscribed to a   brand of liberation theology, with Mr. Bannon calling the pope a “ . ” Mr. Williams said he usually defended the pope, but that recent statements by Francis convinced him “Steve turned out to be right. That happens more often than not. ” Mr. Bannon’s private thoughts about the pope have at times surfaced in public. On May 23, Mr. Bannon and Mr. Williams spoke about Pope Francis on the radio program Breitbart News Daily. Discussing a Breitbart article about the new mayor of London titled “Pope Hails Election of Sadiq Khan, Celebrates Mass Muslim Migration Into Europe,” Mr. Bannon suggested that the pope “seems almost to be putting the responsibility on the working men and women of Italy and Europe et cetera, that they have to go out of their way to accommodate” migration. Was the pope a global elitist, Mr. Bannon asked, “two or three steps removed from this?” Many critics of Francis express similar views, but they are often scared to express it for fear of retribution from the pope, who, they say, has eyes and ears all over the Vatican. Instead, the pope’s critics anonymously papered Rome over the weekend with posters of a   Francis above complaints about his removing and ignoring clerics and cardinals. “Where’s your mercy?” it asked. Conservatives and traditionalists in the Vatican secretly pass around phony   of the Vatican’s official paper, L’Osservatore Romano, making fun of the pope. Or they spread a YouTube video critiquing the pope and his exhortation on love in the family, “Amoris Laetitia,” which many traditionalists consider Francis’ opening salvo against the doctrine of the church. Set to the music of “That’s Amore,” an aggrieved crooner sings, “When will we all be freed from this cruel tyranny, that’s Amoris” and “It’s the climate of fear engineered for four years, that’s Amoris. ” Cardinal Burke  —   who has said that the pope’s exhortation, which opened the door for divorced Catholics remarried outside the church to receive communion, might require “a formal act of correction”  —   has been unusually outspoken in his criticism of Francis. Cardinal Burke and Mr. Bannon declined to comment for this article. Just weeks ago, the pope stripped Cardinal Burke of his remaining institutional influence after a scandal exploded at the Knights of Malta, a nearly    chivalrous order where he had been exiled as a liaison to the Vatican. The pope had removed the order’s grand master after he showed disobedience to the pope. There was a sense in the order that the grand master followed the lead of Cardinal Burke because he projected authority, a power that stemmed in part from his support by the Trump administration, one influential knight said. Cardinal Burke has become a champion to conservatives in the United States. Under Mr. Bannon, Breitbart News urged its Rome correspondent to write sympathetically about him. And at a meeting before last month’s   March for Life rally in Washington, Cardinal Burke received the Law of Life Achievement, or Nail award, a framed replica of the nail used to hold the feet of Christ to the cross. According to   Westen, the editor of Life Site News, who announced the award, the prize is awarded to Christians “who have received a stab in the back. ” Despite Mr. Bannon’s inroads in Rome, Mr. Burke and other traditionalists are not ascendant in the Vatican. The Rev. Antonio Spadaro, a Jesuit priest who edits the   journal La Civilta Cattolica and who is close to the pope, dismissed their criticism as the stuff of a noisy but small “echo chamber. ” He also played down the effect of Mr. Trump’s ascent on the standing of Francis’ opponents in the Vatican, saying it was only on a “level of image” and “propaganda. ” The pope will maintain his direction and not be distracted by fights against those trying to undercut him, Father Spadaro said. “He moves forward, and he moves ahead very fast. ” He added that Mr. Trump’s ban on immigrants from certain Muslim countries was “opposite” to the pontiff’s vision for how to foster unity and peace. The pope, Father Spadaro said, is doing everything he can to avoid the clash of civilizations that both fundamentalist Muslims and Christians want. Indeed, the pope does not seem to be slowing down. Days after the election of Mr. Trump, in St. Peter’s Basilica, the Vatican officially elevated new cardinals selected by Pope Francis who reflected the pope’s emphasis on an inclusive church  —   far from the worldview of Mr. Bannon and Mr. Burke. “It’s not that he is just bringing new people in that think maybe like him,” Cardinal Blase Cupich, the influential new cardinal of Chicago, said after the ceremony. “He is transforming the church in making us rethink how we have done things before. ” That transformation was evident later in the evening, when the old conservative guard came to pay their respects to the new cardinals. João Braz de Aviz, a powerful cardinal close to the pope, walked around in simple cleric clothes, the equivalent of civilian dress among all the flowing cassocks. Asked whether the ascent of Mr. Trump would embolden Mr. Bannon’s allies in the Vatican to intensify their opposition and force the pope to take a more orthodox line, he shrugged. “The doctrine is secure,” he said, adding that the mission of the church was more to safeguard the poor. It was also, he reminded his traditionalist colleagues, to serve St. Peter, whose authority is passed down through the popes. “And today, Francis is Peter. ”'"}, "time": 1742563359.7676654}