{"duration": 0.04675436019897461, "input_args": {"text": "'Controversial Proposal for Nurses Could Expand Access to Care for Veterans ‹ › Yanira is the Operations Editor for the Veterans Today Network. She has been on the job since 2008. New Veterans Affordable Housing Complex Complete in Minneapolis Suburb By Yanira Farray on October 27, 2016 WNC provided approximately $1.97 million in LIHTC equity to fund construction of Linden Grove Veteran Apartments MINNEAPOLIS, Oct. 27, 2016 (GLOBE NEWSWIRE) — WNC, a national investor in real estate and community development initiatives, announced today the completion of Linden Grove Veteran Apartments, a 37-unit affordable housing complex exclusively constructed for homeless veterans of the United States Armed Forces in the Minneapolis suburb of St. Cloud, Minnesota. WNC provided approximately $1.97 million in low-income housing tax credit (LIHTC) equity to fund the new development. As part of the St. Cloud VA Health Care System, and located adjacent to the St. Cloud VA Medical Center, Linden Grove Veteran Apartments is designated as permanent housing for low-income veterans who are homeless or at risk of homelessness. Completed in approximately 11 months, Linden Grove Veteran Apartments is a three-story building situated on six acres of land located at 4804 Veterans Drive. Community amenities include an activity/community room, computer lab, exercise facility, central laundry, picnic area, elevators, media room, library and a playground. “WNC is pleased to help deliver these permanent affordable housing units to veterans in need,” said WNC Executive Vice President and Chief Operating Officer Michael Gaber. “This new community features a number of amenities for residents to enjoy. We couldn’t be happier to give back to those who have served our country, and thank our investment partners for their commitment to this important project.” Linden Grove Veteran Apartments was developed by St. Michael Development Group LLC, a subsidiary of The Sand Companies, Inc. Affordable Housing Initiatives LLC served as the managing general partner of the project and Jamie Thelen served as its developer. About WNC WNC, founded in 1971 and headquartered in Irvine, Calif., is a national investor in real estate and community development initiatives, as well as a leading investor in low-income housing tax credits (LIHTC). WNC has acquired more than $7.7 billion of assets totaling in excess of 1,300 properties in 45 states, Washington D.C., and the U.S. Virgin Islands. Since 2000, WNC has been awarded four New Markets Tax Credit (NMTC) allocations, totaling $178 million, and has facilitated development of 17 low-income community projects. WNC’s investor base exceeds 19,500 institutional and retail clients, including Fortune 500 companies, multinational banks, and insurance companies. Additional information is available at www.wncinc.com . Related Posts:'"}, "time": 1742562242.670797}