{"duration": 0.12222576141357422, "input_args": {"text": "'If ever there was a moment for Donald J. Trump to share the spotlight, his formal announcement of his running mate on Saturday was it. Instead, his introduction of Gov. Mike Pence of Indiana was a remarkable reminder that ultimately, the Trump campaign is about one person. He called Mr. Pence his “partner,” but before the governor took the stage, Mr. Trump stood there alone and talked for 28 minutes, delivering a long and improvised riff that emulated his rallies instead of a traditional   debut. Looking away from his notes, he talked about Hillary Clinton, terrorism, his primary victories, his crushing of a “Stop Trump” movement. Donald Trump, Mr. Trump said, understands infrastructure and how to build a border wall. He even got in a plug for his new hotel in Washington. After roughly 20 minutes, Mr. Trump reached for his notes. “Back to Mike Pence!” he declared, turning to Mr. Pence’s record of job creation in Indiana. Then he used the reference to the Hoosier State to remind the 150 people in attendance that he had trounced Mr. Pence’s endorsed candidate, Senator Ted Cruz, in the primary there. When Mr. Trump ultimately ceded the microphone to Mr. Pence, rather than stand beside him while he delivered his remarks, Mr. Trump patted him twice on the left shoulder and walked off the stage.   rollouts are usually a carefully orchestrated high point of a presidential campaign, but Mr. Trump’s has been unusual and chaotic from the start. Typically, the   candidate is given a moment to shine. But Mr. Trump spoke for more than twice as long as Mr. Pence, whose speech clocked in at roughly 12 minutes. Indeed, the event, in a ballroom at a Midtown Manhattan Hilton, had the feel of    news conferences lacking a recurring theme. Mr. Trump referred to the two men as “the    candidates,” adding that “we’re the    party. ” He said that Mr. Pence “looks good,” and that “to be honest,” part of the reason for Mr. Pence’s selection was to unify the party. Then Mr. Trump proceeded to mock those Republicans who had opposed him. Mr. Trump, who eschewed a teleprompter despite aides’ attempts to impose discipline on his speeches, also unveiled a new attack against Mrs. Clinton, the presumptive Democratic presidential nominee. He described her as something of a foreign policy puppeteer who had led President Obama down unfortunate paths across the globe. Mr. Trump conspicuously tried to tamp down reports that he had vacillated about Mr. Pence as his choice as late as Thursday night, saying he was his “first choice” all along. Mr. Pence, a relative stranger to Mr. Trump, also said he had received a call on Wednesday about serving on the ticket. Mr. Pence left most of the   role that is typical of a running mate to Mr. Trump. Instead, he spoke softly and with humility about a   upbringing and his spirituality. He also seemed more mindful than Mr. Trump of the need to present a united front, a particular challenge given the fractured state of the Republican Party and the two candidates’ own considerable differences. He sought to glide over his previous criticism of Mr. Trump’s proposed ban on Muslim immigrants, choosing instead to criticize Mrs. Clinton’s call to take in more Syrian refugees. He did not speak with any depth about trade pacts, which he has supported in the past and which are a target of Mr. Trump’s criticism. While Mr. Trump was freewheeling, Mr. Pence was smooth and polished, bringing the guests to their feet when he said he was joining the ticket “because Hillary Clinton can never become president of the United States. ” He cast the 2016 election in familiar terms that could soothe Republicans anxious about their unusual nominee. Mr. Pence called himself “a Christian, a conservative and a Republican, in that order,” a phrase that has become his trademark, and he described Mr. Trump as a “patriotic American. ” “Donald Trump is a good man, and he will make a great president of the United States,” Mr. Pence said, adding, “I know what all of America will soon know: These are good people. ” Afterward, the Pence family and the Trump family came onstage, save for Mr. Trump’s wife, Melania, who was said to be at their golf club in Bedminster, N. J. with their young son, Barron. The two men then worked a rope line with attendees. The oversize ballroom felt cavernous the event was originally scheduled for a smaller space on Friday, but Mr. Trump postponed the announcement, saying it was out of respect for the tragedy in Nice, France. Few local Republican leaders were in attendance most had already decamped for the convention in Cleveland. The entire production was over in less than an hour. The candidates did not take questions, but they sat together Saturday for their first joint interview, with Lesley Stahl of CBS’s “60 Minutes,” set to air Sunday night. Ms. Stahl asked Mr. Pence, who publicly swore off negative campaigning years ago, how he could run with a candidate so reflexively given to  . Mr. Pence evaded the question, saying the campaign had been about “issues the American people care about,” but Mr. Trump eventually gave him an assist. “We’re different people,” Mr. Trump said. “I understand that. I’ll give you an example: Hillary Clinton is a liar. ” Mr. Pence, after stopping to eat at a Chili’s, flew back to Indiana  —   without Mr. Trump  —   for what was billed as a “Welcome Home” rally at an airport hangar in Zionsville. Mr. Pence, joined by his wife, Karen, and daughter Charlotte, offered just eight minutes of remarks as humble as the tableau that awaited him. “The last few days have been truly overwhelming, but this is the best part,” Mr. Pence said, gazing upon the crowd of roughly 500. “Karen and I will cherish this Hoosier homecoming for the rest of our lives. ” Afterward, he beckoned to a close friend in the crowd and embraced him tightly over the metal barricades. “Buckle up,” Mr. Pence said with a smile.'"}, "time": 1742563839.6351862}