{"duration": 0.02147054672241211, "input_args": {"text": "\"Republican presidential nominee Donald Trump has turned this election season into a complete circus. One of his advisors, former Republican Speaker of the House Newt Gingrich, said that we may have to deal with his orange face again in 2020. \\nIn an interview with POLITICO, Gingrich said : “The challenge for everybody’s going to be, ‘What if he gets 48 or 49 percent?’ And what if he says: ‘You know, I like this campaign and stuff. I ain’t leaving’? There will then be a Trump Party.” \\nIt looks like the Republicans are already planning to obstruct Democratic presidential nominee Hillary Clinton if she gets elected. Gingrich said : “I think it’ll be very difficult for the country … I think their message to the Republican leadership will be, ‘You had better prepare to fight her every single day.’” \\nTrump broached the subject at a rally in Sanford, Florida. He said that this election is the party’s “last chance.” \\nThe Trumpkin proclaimed : “Republicans have to finally get smart and come together. This is our last chance. This is bigger than me or any of us. It’s about our country. This is about ending Obamacare. This is about the Supreme Court. This is about rebuilding our military and taking care of our vets, strengthening our borders and keeping our companies and jobs from leaving our beloved country. This is about restoring the rule of law, saving our Constitution and keeping radical Islamic terrorists the hell out of our country.” \\nIt’s funny that he’s talking about party unity when he spreads divisive, hateful rhetoric, and has for the last year-and-a-half that has split the Republican Party. It became especially bad after the infamous Access Hollywood audio leaked. He has done his best to alienate just about every group out there over the course of his campaign. Hopefully, he will lose to a Hillary Clinton landslide on November 8. Vote Blue! \\nHere is a news clip about the Newt Gingrich interview : \\nFeatured image via YouTube screenshot . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect\""}, "time": 1742628575.9804335}