{"duration": 0.06575298309326172, "input_args": {"text": "'\\nBy Nick Bernabe\\nThe struggle to stop the Dakota Access Pipeline has been mired in police brutality and militarization. In fact, many have likened the atmosphere in Standing Rock, North Dakota, to a war zone.\\nThe corporate media initially refused to cover the Dakota Access Pipeline protests, though the ongoing story’s virality on social media eventually forced it into the mainstream. Even now that the #NoDAPL movement has developed into a national political narrative, the media continues to whitewash the severity of the crackdown against the Native American protesters, who call themselves “water protectors.”\\nBelow are 10 images I have come across (while closely following the Dakota Access Pipeline protests for Anti-Media ) that narrate the struggle at Standing Rock:\\n\\n85 years old elder wheeled travelled miles just to support and stand against pipeline. Bless are ones #NoDAPL pic.twitter.com/0sHpGAHSNw \\n— ❌ making a stand (@61_alvin) October 15, 2016 \\n\\nLive from #StandingRock #NoDAPL prayer ceremony/drum circle on road blocked by police for DAPL workers- making clear who they serve&protect pic.twitter.com/tD3iUzcm3g \\n— NYC Revolution Club (@NYCRevClub) October 29, 2016 \\n\\nA young Native American girl has a message for President Obama \\n. @POTUS Your silence is deafening. #NoDAPL pic.twitter.com/eypYJvfHmc \\n— People For Bernie (@People4Bernie) October 27, 2016 \\n\\nThis initial crackdown at the Standing Rock camp shortly after the activation of the North Dakota National Guard. \\n\\nBattle lines are drawn. \\n\\nA tribal elder conducts a water ceremony in front of the police line. \\n#NoDAPL \\nPicture speaks volumes! pic.twitter.com/dQF2xVEVMU \\n— Native Life ☄#NoDAPL (@_Native_Life) October 27, 2016 \\n\\ntweet\\n\\nA woman is violently arrested by militarized law enforcement \\nFive police officers beat one elderly woman as 117 water protectors arrested yesterday. Terrible scenes coming out of North Dakota. #NoDAPL pic.twitter.com/xFjvdBEuNB \\n— Stephen George Rae (@StephenGeoRae) October 28, 2016 \\n\\nAs frustration mounts, two National Guards trucks are set on fire. \\n\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Anti-Media of theantimedia.org . \\nThe “Anti” in our name does not mean we are against the media, we are simply against the current mainstream paradigm. The current media, influenced by the industrial complex, is a top-down authoritarian system of distribution—the opposite of what Anti-Media aims to be. At Anti-Media, we want to offer a new paradigm—a bottom-up approach for real and diverse reporting. We seek to establish a space where the people are the journalists and a venue where independent journalism moves forward on a larger and more truthful scale. '"}, "time": 1742561634.3521812}