{"duration": 0.12775301933288574, "input_args": {"text": "' NATO Announces Largest Troop Deployments Against Russia Since Cold War By Alex Lantier\\nNovember 09, 2016 \" Information Clearing House \" - \" WSWS \" - NATO will place hundreds of thousands of troops on alert for military action against Russia in the coming months, top NATO officials told the Times of London on Monday.\\nThe US-led military alliance is planning to speed up the mobilization of forces numbering in the tens of thousands and, ultimately, hundreds of thousands and millions that are to be mobilized against Russia. Beyond its existing 5,000-strong emergency response force, NATO is tripling its \\x93incumbent response force\\x94 to 40,000 and putting hundreds of thousands of troops on higher alert levels.\\nThe Times wrote, \\x93Sir Adam West, Britain\\x92s outgoing permanent representative to NATO, said he thought that the goal was to speed up the response time of up to 300,000 military personnel to about two months. At present a force of this size could take up to 180 days to deploy.\\x94\\nNATO Secretary-General Jens Stoltenberg said, \\x93We are addressing what we call the follow-on forces. There are a large number of people in the armed forces of NATO allies. We are looking into how more of them can be ready on a shorter notice.\\x94 According to the Times , Stoltenberg explained that NATO is looking broadly at methods for \\x93improving the readiness of many of the alliance\\'s three million soldiers, sailors, airmen and Marines.\\x94\\nThe target of these deployments, the largest since the dissolution of the Soviet Union by the Stalinist bureaucracy and the end of the Cold War a quarter century ago, is Russia.\\n\\x93We have seen a more assertive Russia implementing a substantial military build-up of many years, tripling defence spending since 2000 in real terms; developing new military capabilities; exercising their forces and using military force against neighbours,\\x94 Stoltenberg said. \\x93We have also seen Russia using propaganda in Europe among NATO allies and that is exactly the reason why NATO is responding. We are responding with the biggest reinforcement of our collective defence since the end of the Cold War.\\x94\\nThese statements show how NATO planning for a horrific war against Russia has continued behind the backs of the people throughout the US presidential election campaign. Military deployments and war preparations by the Pentagon and the general staffs of the various European countries are set to go ahead, moreover, whatever the outcome of the election in the United States and those slated for 2017 in the European NATO countries.\\nStoltenberg\\'s vague attack on Russian \\x93propaganda\\x94 in Europe is an allusion to the instinctive opposition to war that exists in the European and international working class and popular distrust of the anti-Russian propaganda promoted by NATO officials like Stoltenberg and West.\\nLast year, a Pew poll found broad international opposition to NATO participation in a conventional war against Russia in Eastern Europe, even in a scenario that assumes Russia started the conflict. Under these hypothetical conditions, 58 percent of Germans, 53 percent of French people, and 51 percent of Italians opposed any military action against Russia. Opposition to war in the poll would doubtless have been higher had pollsters mentioned that NATO\\'s decision to attack Russian forces in Eastern Europe could lead to nuclear war.\\nThis opposition is rooted in deep disaffection with the imperialist Middle East wars of the post-Soviet period and the memory of two world wars in Europe in the 20th century. The arguments Stoltenberg presented against it are politically fraudulent.\\nThe primary threat of military aggression and war in Europe comes not from Russia, but from the NATO countries. Over the past 25 years, the imperialist powers of NATO have bombed and invaded countries in Central Asia, the Middle East and Africa. Within Europe, they bombed Serbia and Kosovo in the Balkan Wars of the 1990s, pushed NATO\\x92s borders hundreds of miles to the East, and backed a violent, fascist-led putsch to topple a pro-Russian government in Ukraine in 2014.\\nThe aggressive character of NATO policy emerged once again last Friday, when NBC News reported that US cyber warfare units had hacked key Russian electricity, Internet and military networks. These are now \\x93vulnerable to attack by secret American cyber weapons should the US deem it necessary,\\x94 NBC stated.\\nRussian officials denounced the activities highlighted in the report and the Obama White House\\'s silence on the matter. Russian Foreign Ministry spokeswoman Maria Zakharova said, \\x93If no official reaction from the American administration follows, it would mean state cyber terrorism exists in the US. If the threats of the attack, which were published by the US media, are carried out, Moscow would be justified in charging Washington.\\x94\\nThe geo-strategically disastrous consequences of the Stalinist bureaucracy\\'s dissolution of the Soviet Union and restoration of capitalism in Eastern Europe are ever more apparent. With NATO troops or proxy forces stationed in a geographic belt extending from the Baltic republics to Poland, Ukraine and Romania\\x97either a short distance from or on Russia\\'s borders\\x97NATO is now poised for a major war against Russia that could escalate into a nuclear conflagration.\\nAn examination of Stoltenberg\\x92s remarks shows that NATO\\x92s plans are not defensive preparations to counter a sudden conventional invasion of Europe by the Russian army. In such a scenario, Russian tank columns would overrun the few thousand or tens of thousands of troops in NATO\\x92s various emergency response forces, depriving the broader ranks of NATO \\x93follow-up\\x94 forces the 60 to 180 days they need to mobilize.\\nRather, the plan for mobilizing successive layers of \\x93follow-on forces\\x94 is intended to allow NATO to threaten Russia in a crisis situation by gradually bringing to bear more and more of its collective military strength, which, although split between 28 member states, outweighs that of Russia. Russia\\'s population of 145 million is far smaller than that of the NATO countries, at 906 million.\\nThe aggressive character of NATO\\x92s agenda is illustrated by a report issued last month by the CIA-linked Rand Corporation think tank on the military situation in the Baltic republics of Lithuania, Latvia and Estonia. The small military forces NATO has posted in the Baltic republics, Rand wrote, are \\x93inviting a devastating war, rather than deterring it.\\x94 They calculated that Russian forces, if they actually invaded, could overrun these countries in approximately 60 hours.\\nOn this basis, the think tank called for launching a vast NATO military build-up in the Baltic republics, virtually at the gates of St. Petersburg. It wrote that it would take \\x93a force of about seven brigades, including three heavy armored brigades\\x97adequately supported by air power, land-based fires, and other enablers on the ground and ready to fight at the onset of hostilities to prevent the rapid overrun of the Baltic states.\\x94 This would cost the NATO countries $2.7 billion each year.\\nAs the NATO countries intensify their threats against Russia, there are increasingly bitter conflicts among the NATO imperialist powers themselves. Italian Prime Minister Matteo Renzi bluntly opposed new sanctions on Russia as called for by Washington at last month\\'s European Union summit in Brussels, and there are deepening tensions between Germany and the United States as officials in Berlin and Paris call for an independent EU military.\\nProspects of increased US-led military provocations against Russia are sharpening tensions within Europe. In an article titled \\x93Whether Clinton or Trump wins, for Germany things will get uncomfortable,\\x94 German news magazine Der Spiegel warned of the long-term implications of an aggressive US-led policy against Russia, which it assumed would continue regardless which of the two candidates secured the White House.\\nThe magazine wrote, \\x93The motto will be: If you want (nuclear) US protection from Putin, you must either pay us more money or re-arm yourself.\\x94\\nCopyright Š 1998-2016 World Socialist Web Site - All rights reserved'"}, "time": 1742564197.7889438}