{"duration": 0.17229890823364258, "input_args": {"text": "'Posted on October 30, 2016 by DCG | 1 Comment \\nFrom Daily Mail : The BBC has been accused of acting recklessly after targeting children as young as six with a programme about a schoolboy who takes sex-change drugs. \\nParents are angry that the show, available on the CBBC website, features a transgender storyline inappropriate for their children. \\nAnd concerned campaigners said it could ‘sow the seeds of confusion’ in young minds. The programme, Just A Girl, depicts an 11-year-old’s struggle to get hormones that stunt puberty, making it easier to have sex-change surgery in the future . \\nOne mother, writing on the Mumsnet website, said her daughter had become worried after seeing the video . She said her girl, who likes wearing boys’ clothes and playing football, had ‘asked me, anxiously, if that means she was a boy’. \\nTory MP Peter Bone said: ‘It beggars belief that the BBC is making this programme freely available to children as young as six. I entirely share the anger of parents who just want to let children be children. \\n‘It is completely inappropriate for such material to be on the CBBC website and I shall be writing to BBC bosses to demand they take it down as soon as possible.’ \\nFormer Culture Secretary Maria Miller voiced her concerns over the BBC tackling the subject in ‘an age-appropriate way’, saying such issues should be raised ‘where children can have support from parents’. \\nAnd Tory MP Julian Brazier said: ‘This programme is very disappointing and inappropriate. Children are very impressionable and this is going to confuse and worry them. ’ \\nFamily campaigner Norman Wells said: ‘It is irresponsible of the BBC to introduce impressionable children as young as six to the idea that they can choose to be something other than their biological sex.’ \\nJust A Girl is the fictional video diary of a child who calls herself ‘Amy’ and dresses as a girl. It is hosted on the CBBC website, aimed at children aged between six and 12 . \\nIn the half-hour programme, Amy – played by an actress – reveals she was born a boy called Ben but has already started using puberty-halting drugs. \\nSuch hypothalamic blockers provoked a furore two years ago when The Mail on Sunday revealed an NHS clinic was willing to give them to children as young as nine. \\nCritics cited research claiming that most teenagers confused about their gender never go through with surgery, with many realising they are gay. The BBC row comes amid growing controversy over gender issues, fuelled by a number of high-profile cases. \\nIn one, a Christian couple were threatened with having their 14-year-old daughter taken away because they oppose her plans to become a boy. In another, a seven-year-old boy was ordered to be removed from his mother’s care as ‘she was raising him as female’, causing him ‘a great deal of emotional harm’. \\nIn Just A Girl, Amy says: ‘When I was born, Mum said Dad was so pleased that he had a boy to take to the football. But Mum knew I was different. She realised early on that I was born in the wrong body.’ \\nShe adds: ‘My Mum supported me when I did a PowerPoint presentation to my class about transitioning and that I wasn’t going to come to school in boys’ clothes any more, but girls’ clothes. I wasn’t Ben, I was Amy.’ \\nLater Amy is shown telling a friend, Josh – a boy who wants to be recognised as a girl – that she is on hormone blockers, saying it took ‘ages’ to get them after ‘loads of tests and talks at the clinic’. ‘Once they realised I was trans for real, [I] got them,’ she says. In another entry, Amy tells viewers she has developed a crush on a boy called Liam, but confides: ‘Liam thinks I’m just a girl, but I’m not. I’m trans. And what’s he going to say if he finds out? Stop being my friend? Why? I’m still me, aren’t I?’ \\nChild psychotherapist Dr. Dilys Daws said the programme could confuse children. She said that, while it was natural for youngsters to wonder what it would be like to be the opposite sex, the BBC was irresponsible to feature the ‘extreme’ step of gender change for six-year-olds because they were too young to grapple with such issues . \\nThe programme generated hundreds of comments on Mumsnet. One mother, who said her seven-year-old had watched the show, asked: ‘Am I being unreasonable to think this is an inappropriate topic for a young age group?’ \\nAnother replied: ‘Don’t think this is remotely suitable for a seven-year-old. To start suggesting that children can be transgender when they’re far too young to actually have a gender is reckless and damaging. A small boy who is told that he can become a girl may take this as meaning that sex changes are possible, that sometime in the future he’ll wake up with a girl’s body.’ \\nAnother user added: ‘I don’t think hormone therapy should be normalised any more than 12-year-olds drinking or doing recreational drugs should be normalised.’ \\nOther critics slammed the BBC. Mr Wells, director of the Family Education Trust, said: ‘The more we promote the idea that a boy can be born into a girl’s body and a girl can be born into a boy’s body, and that drugs and surgery can put things right, the more children will become utterly confused. Respecting and preserving a child’s birth sex should be seen as a child protection issue. ’ \\nBut some parents on Mumsnet were more positive. One wrote: ‘I don’t believe there is “too young” for stuff like this. The earlier you teach your children that everyone is different and that nobody is “normal” the better.’ \\nDr .Polly Carmichael, a clinical psychologist specialising in transgender children, said: ‘Raising awareness of these issues is the best way to challenge stigma and discrimination associated with identity issues. Programmes like Just A Girl can contribute to a healthy and informed public discussion. ’ \\nThe BBC said: ‘Just A Girl is about a fictional transgender character trying to make sense of the world, deal with bullying and work out how to keep her friends, which are universal themes that many children relate to, and which has had a positive response from our audience. CBBC aims to reflect true life, providing content that mirrors the lives of as many UK children as possible. ’ \\nDCG'"}, "time": 1742562016.6018584}