{"duration": 0.014129638671875, "input_args": {"text": "'By wmw_admin on September 5, 2006 \\nExtracts from a talk given by Lee Brown at the 1986 Continental Indigenous Council, Tanana Valley, Fairbanks, Alaska. Six Million Jews 1915-1938 By wmw_admin on March 4, 2013 \\nYears before Hitler and WWII the iconic figure of six million Jews was being widely promulgated. Here are a few examples The Man Who Would Be King By Rixon Stewart on April 15, 2008 \\nSome say that Prince Michael of Albany has a more legitimate claim to the throne of England than the Windsors. Are they right? And why are the Windsors and the mainstream media delberately ignoring him? Affidavit of Richard Tomlinson By wmw_admin on February 14, 2008 \\n“I firmly believe that there exist documents held by the British Secret Intelligence Service (MI6) that would yield important new evidence into the cause and circumstances leading to the death of the Princess of Wales.” Bilderberg Meeting – Media Should Be Ashamed By wmw_admin on July 12, 2003 \\nWhy do the Bilderberg meetings receive so little coverage. Victor Thorn examines why, and how, real news is suppressed by the mainstream media Caught but not about to be arrested: Craft International Trained Men at Boston Bombing Location Before Attack By wmw_admin on April 19, 2013 \\nWhat are privately owned military teams doing at the Boston Marathon? Photographic evidence of who was behind the blasts Soros/CIA Plan to Destabilize Europe By Wayne Madsen on September 28, 2015 \\nThe same forces that orchestrated the various ‘colour revolutions’ and the ‘Arab Spring’ are behind Europe’s migrant crisis. Wayne Madsen explains The Essene Gospel of Peace II By wmw_admin on April 26, 2007 \\nTranslated by Purcell Weaver and Edmond Szekely from its original Aramiac, a language that today few know but 2000 years ago was the language that Christ spoke and taught with The Life of an American Jew in Racist Marxist Israel Part I By wmw_admin on July 2, 2007 \\nJack Bernstein was a rarity, an American Zionist who ‘returned’ to Israel, not for a holiday but to live and die in Israel building a Jewish nation. What makes him almost one of a kind, however, was his ability to see through the sham of Zionism'"}, "time": 1742628544.7622387}