{"duration": 0.11561989784240723, "input_args": {"text": "'posted by Eddie Diamond miners working off the coast of Africa stumbled across a 500-year-old shipwreck loaded with £9 million of gold and coins. The Bom Jesus – or Good Jesus – was first discovered along the Namibian coast near Oranjemund by geologists from the mining company De Beers in April 2008. It was a Portuguese ship which set sail from Lisbon in 1533 captained by Sir Francisco de Noronha, and vanished, along with its entire crew, while on a voyage to India. The Bom Jesus – or Good Jesus – and its treasure trove contents were first discovered along the Namibian coast near Oranjemund by geologists from the mining company De Beers in April 2008 (Pictured: Some of the Spanish coins) A selection of items from the ship with a trowel below them for scale. The best preserved astrolabe is in the middle, a frying pan on the right, some pottery on left, a pewter plate above and a section of a pewter bowl It was found by the miners as they drained a man-made salt water lake along the Skeleton Coast, and while plenty of shipwrecks have been discovered along the stretch, this was the oldest and the first to be loaded down with coin and ivory tusks. They did not immediately find the treasure it contained – first, they discovered strange pieces of wood and metal along the beach, before discovering the shipwreck buried under the sand. It was not until the sixth day that they found a treasure chest full of gold. It has been named as one of the most significant shipwreck finds of all time and the discovery led to the site being placed under the UNESCO Convention on the Protection of Underwater Cultural Heritage. Some rosary beads and a silver Portuguese coin that were found among the haul of the Bom Jesus Archaeologist Dr Dieter Noli demonstrating the use of an astrolabe found among the ship’s wreckage The Bom Jesus cargo contained German copper ingots, West African ivory, Portuguese, Spanish, Florentine and Venetian gold and silver currency, weapons, including swords an knives, clothing, and, of course, skeletons. The miners also discovered bronze bowls, and long metal poles which were used in the ship’s canona, as well as a musket compasses and astrological tools. Archaeologist Dr Dieter Noli told FoxNews.com that the Namibian government will keep the gold. He said: ‘That is the normal procedure when a ship is found on a beach. ‘The only exception is when it is a ship of state – then the country under whose flag the ship was sailing gets it and all its contents. ‘And in this case the ship belonged to the King of Portugal, making it a ship of state – with the ship and its entire contents belonging to Portugal. ‘The Portuguese government, however, very generously waived that right, allowing Namibia to keep the lot.’ How the ship would have looked. It was a Portuguese ship which set sail from Lisbon in 1533 captained by Sir Francisco de Noronha, and vanished, along with its entire crew, while on a voyage to India Source:'"}, "time": 1742563884.699426}