{"duration": 0.16521310806274414, "input_args": {"text": "'Bias bashers Ukraine Stunned as Vast Cash Reserves of Political Elite Are Made Public \\nUkraine is the latest country to discover that cronyism and corruption in politics pays - a lot - and is very unhappy about it. Originally appeared at Zero Hedge \\nAs a result of an anti-corruption reform requiring senior Ukrainian officials to declare their wealth online, the local population has been been exposed to the vast difference between the fortunes of politicians and those they represent. \\nAs Reuters reports , some declared millions of dollars in cash. Others said they owned fleets of luxury cars, expensive Swiss watches, diamond jewelry and large tracts of land - revelations that will crush public confidence in the authorities in Ukraine, where the average salary is just over $200 per month. Officials had until Sunday to upload details of their assets and income in 2015 to a publicly searchable database, part of an International Monetary Fund-backed drive to boost transparency and modernise Ukraine\\'s recession-hit economy. \\nAs in the US, the corruption starts (and ends) at the top, and the value of Ukrainian President Petro Poroshenko\\'s assets soared despite economic crisis and conflict while those of other tycoons shrank in an annual wealth list published Friday. The 50-year-old Western-backed president \\'s business empire ranges from chocolates to media holdings still under his control. Poroshenko - a prominent fixture of the Panama Papers - retains control of a top TV channel and has failed to follow through on his promise to sell off his Roshen chocolate empire due to a lack of foreign interest and a dearth of rich-enough investors in Ukraine itself. \\nThe Novoye Vremya weekly showed the Ukrainian leader, often criticised for failing to curb the political powers of fellow tycoons, ranked as the country\\'s sixth-richest man. Perhaps Poroshenko should be more criticized for focusing mostly on his own net worth at the expense of the general population: his reported assets rose by 20% to $979 million, only just supporting his claim he is no longer a billionaire. \\nThe president\\'s official spokesman did not pick up his phone when contacted repeatedly by AFP. \\nHow did Poroshenko\\'s wealth grow by hundreds of millions? Chocolate. \\n\"Poroshenko\\'s (wealth) rose thanks to the rise in value of his candy business that- even in the midst of the deepest of crises - is developing quickly, building new capacities and conquering new markets,\" the weekly said. \\nPoroshenko promotes himself as a Western-style businessman who built his empire from the ground up and kept to transparency standards that most others simply ignored. Many of Ukraine\\'s other mega-rich scooped up their holdings at cut-price rates in pre-arranged privatisation deals in which which they rewarded the government by funding its parliamentary parties and campaigning for them in the media. \\nNow, the people finally are starting to see right through it: \"This will not benefit the president\\'s ratings or help improve Ukraine\\'s image as a nation run by oligarchs,\" Vadym Karasyov of Kiev\\'s Institute of Global Strategies told AFP. \\nPoroshenko is not the only oligarch to take advantage of the \"crony capitalist chaos\" unleash in Ukraine with the US-backed 2014 presidential coup. Prime Minister Voldymyr Groysman, who last week likened the declarations process to jumping out of an airplane, revealed that he and his wife had a total of $1.2 million and 460,000 euros in cash and a collection of luxury watches. \\nThe database also shows that Groysman, a former businessman and provincial mayor, is not alone in preferring to keep much of his money out of Ukraine\\'s banking system. Reuters calculations based on the declarations show that the 24 members of the Ukrainian cabinet together have nearly $7 million, just in cash . \\nThe declarations of two brothers in President Petro Poroshenko\\'s faction, Bohdan and Yaroslav Dubnevych, show holdings of over $26 million, also in cash only . \\n\"When the Economy Ministry says that in some areas around 60 percent of the economy is in the shadows, then this is accounted for by the volume of cash registered by civil servants, officials and lawmakers,\" said Taras Kachka, deputy executive director at George Soros\\'s International Renaissance Foundation. \"This is a reflection on the state of our society.\" \\nJustice Minister Pavlo Petrenko, who declared $1 million in a bank account and a further $500,000 in cash, said officials\\' decision to hold cash pointed to a mistrust in the banks that many Ukrainians could relate to. It also points to a burning desire not to have one\\'s wealth easily confiscatable when another political regime emerges. \\n\"Of course to EU countries it seems uncivilised that people hold cash,\" he said. \"But it is linked to the fact that the banking system could, let\\'s say, be doing better. This is a problem for many Ukrainians who lost their savings in the bank.\" \\n* * * \\nNot everyone\\'s wealth is soaring, however. The wealth list is topped by 49-year-old metals magnate Rinat Akhmetov, a controversial figure accused by some local media of impeding Poroshenko\\'s efforts to halt the 18-month war in the pro-Russian east. Novoye Vremya said Akhmetov\\'s fortunes had plunged by 56 percent to $4.5 billion due in part to the sharp recent fall in global commodity prices. \\nPoroshenko\\'s sworn political foe and banking giant Igor Kolomoyskiy came in third with an estimated fortune of $1.9 billion. The 52-year-old grey-bearded and fiercely outspoken figure finds himself in the peculiar position of being at odds with both Kiev and Moscow. Russia\\'s state media accuse him of funding Ukrainian neo-Nazi combat units that commit grave crimes in the separatist east. \\nPoroshenko\\'s fight against Kolomoyskiy began with efforts to strip him of his indirect control of a state-owned oil company and culminated in the businessman losing his seat as governor of the industrially important Dnipropetrovsk region in March. Kolomoyskiy\\'s wealth reportedly slipped by 17 percent due to the country\\'s financial woes. \\n* * * \\nWhile the online declaration system has been intended to represent a show of good faith that officials are willing to open their finances up to public scrutiny, to be held accountable, and to move away from a culture that tacitly allowed bureaucrats to amass wealth through cronyism and graft, the public reaction has been one of shocked dismay at the extravagant lifestyles conjured up by many of the disclosures according to Reuters . \\n\"We did not expect that this would be such a widespread phenomenon among state officials. I can\\'t imagine there is a European politician who invests money in a wine collection where one bottle costs over $10,000,\" said Vitaliy Shabunin, the head of the non-governmental Anti-Corruption Action Center. \\nSomething tells us Vitaliy would be surprised, although considering that some European politicans are \"allegedly\" even more corrupt than their Ukrainian peers, a similar exercise in transparency would never take place in Brussels as it would lead to revelations that put the Panama Papers to shame. \\nAmong the disclosures, it emerged that opposition bloc lawmaker Mikhail Dobkin\\'s declaration included 1,780 bottles of wine and an antique copy of Russian novel Anna Karenina worth at least $5,500. Roman Nasirov, the head of the State Fiscal Service, disclosed that he and his wife owned Swiss watches, diamond jewellery, fur coats, fine porcelain and crystal glassware, an assault rifle and cash in euros and dollars worth $2.2 million. \\nThe declaration of Oleh Lyashko, the head of the populist Radical party who has styled himself as a representative of the common man, showed he rented a house and land in Kiev\\'s most exclusive district and his household had cash worth the equivalent of over $1 million. \\n* * * \\nOther forms give an insight into particular hobbies and interests of Ukraine\\'s elite. Ihor Hryniv, the head of Poroshenko\\'s faction, has a collection of icons dating from the 14th century and several works by Ukrainian impressionist masters. Lawmaker Ihor Mosiychuk declared an array of antique weapons, including a 16th century Turkish scimitar, an English broadsword and a Nazi SS dagger . \\nMany senior politicians filed their forms in the last two days before the deadline, resulting in a crescendo of surprise and anger on social media over the weekend. \\nSome of the angriest responses came from members of the army. \\n\"I personally feel unwell. Or rather, like someone who has been beaten and is therefore unwell. I had no illusions about our political and official elite. But all the same, what\\'s come out is beyond the pale ,\" Roman Donik, a volunteer to Ukraine\\'s frontline troops, said on Facebook. \\nNeedless to say, Ukraine\\'s corrupt politicians better watch out: the last group they want to anger with their show of wealth is the army, which will have no problem in \"redistributing\" it once . \\nActually, they should probably avoid any public contact for a while: the average Ukrainian citizen has been hit hard by the economic crisis that unfolded in the wake of the 2014 pro-European \\'Maidan\\' uprising and subsequent pro-Russian separatist conflict. The national hryvnia currency has plummeted to 25 to the dollar from 8 in 2013 and energy tariffs have soared under the IMF-backed economic reform programme. \\nAs Reuters concludes, the latest revelations will likely add to public dissatisfaction with the current leadership\\'s progress on reforms. A September poll showed that only 12.6 percent would now vote for Poroshenko\\'s faction, down from 21.8 in the last election. Meanwhile support for populist and opposition parties has risen. The anti-corruption agency says it will now start verifying the declarations, but with over 100,000 forms submitted, it is unclear how thorough the process can be. \\n* * * \\nUkraine\\'s economy is on track to shrink by about 12 percent this year and only return to marginal growth should the eastern campaign end in 2016. \\nSo what\\'s next: a presidential coup that brings back the ousted President Yanukovych under whom most were just as poor, but at least equally so? While purely hypothetical, it would be a fitting end to yet another disastrous US intervention in a foreign state\\'s internal affairs.'"}, "time": 1742563402.6073608}