{"duration": 0.2677600383758545, "input_args": {"text": "'When Constance Wu landed the part of Jessica Huang, the   matriarch on the ABC sitcom “Fresh Off the Boat,” she didn’t realize just how significant the role would turn out to be. As she developed her part, Ms. Wu heard the same dismal fact repeated over and over again: It had been 20 years since a show featuring a predominantly   cast had aired on television. ABC’s previous offering, the 1994 Margaret Cho vehicle “  Girl,” was canceled after one season. “I wasn’t really conscious of it until I booked the role,” Ms. Wu said. “I was focused on the task at hand, which was paying my rent. ” The show, which was just renewed for a third season, has granted Ms. Wu a steady job and a new perspective. “It changed me,” Ms. Wu said. After doing a lot of research, she shifted her focus “from   to   interests. ” In the past year, Ms. Wu and a number of other   actors have emerged as fierce advocates for their own visibility  —   and frank critics of their industry. The issue has crystallized in a word  —   “whitewashing”  —   that calls out Hollywood for taking Asian roles and stories and filling them with white actors. On Facebook, Ms. Wu ticked off a list of recent films guilty of the practice and said, “I could go on, and that’s a crying shame, y’all. ” On Twitter, she bit back against Hollywood producers who believe their “lead must be white” and advised the creators of   content to “CARE MORE. ” Another tip: “An easy way to avoid tokenism? Have more than one” character of color, she tweeted in March. “Not so hard. ” [ Read reader responses to this article ] It’s never been easy for an   actor to get work in Hollywood, let alone take a stand against the people who run the place. But the recent expansion of   roles on television has paradoxically ushered in a new generation of actors with just enough star power and job security to speak more freely about Hollywood’s larger failures. And their heightened profile, along with an imaginative,    social media army, has managed to push the issue of   representation  —   long relegated to the back burner  —   into the current heated debate about Hollywood’s monotone vision of the world. “The harsh reality of being an actor is that it’s hard to make a living, and that puts actors of color in a very difficult position,” said Daniel Dae Kim, who stars in “Hawaii  ” on CBS and is currently appearing in “The King and I” on Broadway. Mr. Kim has wielded his Twitter account to point to dire statistics and boost   creators. Last year, he posted a cheeky tribute to “the only Asian face” he could find in the entire “Lord of the Rings” series, a woman who “appears for a glorious three seconds. ” Other actors lending their voices include Kumail Nanjiani of “Silicon Valley,”   Wen of “Agents of S. H. I. E. L. D. ” and Aziz Ansari, who in his show, “Master of None,” plays an   actor trying to make his mark. They join longtime actors and activists like BD Wong of “Gotham” Margaret Cho, who has taken her tart comedic commentary to Twitter and George Takei, who has leveraged his “Star Trek” fame into a social media juggernaut. “There’s an   stereotypical notion that   people don’t speak up,” Mr. Wong said. But “we’re really getting into people’s faces about it. ” This past year has proved to be a particularly fraught period for   representation in movies. Last May, Sony released “Aloha,” a film set in Hawaii that was packed with white actors, including the     Emma Stone as a     Hawaiian fighter pilot named Allison Ng. In September, it was revealed that in the planned adaptation of the Japanese manga series Death Note, the hero, a boy with dark powers named Light Yagami, would be renamed simply Light and played by the white actor Nat Wolff. In “The Martian,” released in October, the white actress Mackenzie Davis stepped into the role of the NASA employee Mindy Park, who was conceived in the novel as  . The list goes on. In December, set photographs from the coming “Absolutely Fabulous” film showed the Scottish actress Janette Tough dressed as an    Asian character. Last month, Marvel Studios released a trailer for “Doctor Strange,” in which a character that had originated in comic books as a Tibetan monk was reimagined as a Celtic mystic played by Tilda Swinton. And in the   American film adaptation of the manga series Ghost in the Shell, scheduled for next year, the lead character, Major Motoko Kusanagi, will be called Major and played by Scarlett Johansson in a black bob. Studios say that their films are diverse. “Like other Marvel films, several characters in ‘Doctor Strange’ are significant departures from the source material, not limited by race, gender or ethnicity,” the Marvel Studios president Kevin Feige said in a statement. Ms. Swinton will play a character that was originally male, and Chiwetel Ejiofor a character that was originally white. Paramount and DreamWorks, the studios behind “Ghost in the Shell,” said that the film reflects “a diverse array of cultures and countries. ” But many   actors aren’t convinced. “It’s all so plainly outlandish,” Mr. Takei said. “It’s getting to the point where it’s almost laughable. ” The Academy Awards telecast in February added insult to injury. The show dwelled on the diversity complaints aired through #OscarsSoWhite, yet blithely mocked   with punch lines that banked on Asian stereotypes. The host, Chris Rock, brought three   children onstage to serve as a sight gag in a joke made at their expense. “I have never seen the   community get so organized so quickly,” said Janet Yang, a producer who serves as a liaison between Hollywood and Chinese studios. She added, “It was the final straw. ” Within days, Ms. Yang and 24 other Academy members, including the actress Sandra Oh, the director Ang Lee and Mr. Takei, signed a letter to the academy taking it to task for the telecast’s offensive jokes. The academy’s terse reply only stoked the flames. Mr. Takei called it “a bland, corporate response. ” Online, even more   actors and activists have spoken out with raw, unapologetic anger. Ms. Wen castigated “Ghost in the Shell,” tweeting about “whitewashing” and throwing in a dismissive emoji. Mr. Takei went off on “Doctor Strange” on his Facebook page: “Hollywood has been casting white actors in Asian roles for decades now, and we can’t keep pretending there isn’t something deeper at work here. ” Mr. Nanjiani jumped on Twitter to call out the red carpet photographer who told him, “Smile, you’re in America now. ” (“I know when someone is racist, the fault is theirs and not yours,” he wrote. “But, in the moment, it makes you feel flattened, reduced and bullied. ”) And Ms. Cho helped start a hashtag campaign, #whitewashedOUT. “It’s intense,” Ms. Cho posted at the height of the action. “It’s that we have been invisible for so long we don’t even know what we can do. ” Meanwhile, television shows  —   competing for fresh content and audiences as the number of scripted series has increased dramatically in recent years  —   have helped expand the boundaries of what was once thought possible.   increasingly play leads and love interests and star in multiple family sitcoms. Following “Fresh Off the Boat,” ABC debuted the sitcom “Dr. Ken,” featuring an   family led by the show’s creator, Ken Jeong, plus the drama “Quantico” starring the Bollywood actress Priyanka Chopra. On CW’s “Crazy ” Rachel Bloom, as the title character, pines after the hunky Vincent Rodriguez III, who is  . They join such   as Mindy Kaling, creator and star of “The Mindy Project,” and Lucy Liu, who plays a reimagined Dr. Watson in “Elementary. ” These shows help, but the issue is pervasive, including on TV. “The mainstream Hollywood thinking still seems to be that movies and stories about straight white people are universal, and that anyone else is more niche,” Mr. Ansari wrote in an email. “It’s just not true. I’ve been watching characters with     problems since I was a small Indian boy. ” In films, a few roles have transcended stereotypes: Mr. Takei in the first “Star Trek” installments, Ms. Liu in the “Charlie’s Angels” features, and John Cho and Kal Penn in the stoner hit “Harold  Kumar Go to White Castle” and its sequels. And more are in development: a film adaptation of Kevin Kwan’s novel “Crazy Rich Asians” is underway, and the   actress Kelly Marie Tran will play a major role in the next “Star Wars” installment. But mostly,   are invisible. Though they make up 5. 4 percent of the United States population, more than half of film, television and streaming properties feature zero named or speaking Asian characters, a February report from the Annenberg School for Communication and Journalism at the University of Southern California found. Only 1. 4 percent of lead characters in a sample of studio films released in 2014 were Asian. For   actors, the dearth of opportunities compounds itself. “An Asian person who is competing against white people, for an audience of white people, has to train for that opportunity like it’s the Olympics,” Ms. Wu said. “An incredibly talented Asian actor might be considered for a leading role maybe once or twice in a lifetime. That’s a highly pressured situation. ” So some are stepping behind the camera. In addition to actors creating their own shows, like Ms. Kaling, Mr. Jeong and Mr. Ansari, Mr. Kim of “Hawaii  ” has started his own production company, 3AD, “to help tell the stories of the underrepresented,” he said.   and other minority actors, he added, are “tired of waiting to be hired for the roles Hollywood creates for us. ” Audiences, too, are catching up. “There was a time when this conversation was completely foreign to people,” Mr. Wong said. Now young participants “are already fully versed in the issues and able to discuss them with great passion. ” Ellen Oh, a writer for young adults who devised the #whitewashedOUT hashtag, credited a generational shift. “For a long time, Asians have been defined by the immigrant experience, but now   and     are finding their own voices,” Ms. Oh said. They’re also employing a new vocabulary. “The term ‘whitewashing’ is new, and it’s extremely useful,” Mr. Wong said. In contrast to “yellowface,” which protested the practice of white actors using makeup and prosthetics to play Asians, “whitewashing” gives voice to the   of prominent roles. And the Internet has allowed people to imagine a parallel universe where   dominate the screen. Earlier this month, disappointed fans of the “Ghost in the Shell” franchise took a publicity still of Ms. Johansson in the lead role and Photoshopped in the face of Rinko Kikuchi, the Japanese star of “Pacific Rim. ” Recently the hashtag #StarringJohnCho went viral, reimagining the   star as the lead of   and action flicks. Though Mr. Cho has followed up the “Harold and Kumar” films with a role in the “Star Trek” franchise, he hasn’t been afforded the luminous leads offered to white actors with similar starts, like Seth Rogen after “Knocked Up” or Chris Pratt  “Guardians of the Galaxy. ” “As I was Photoshopping John Cho’s face on top of Tom Cruise’s in the ‘Mission Impossible’ poster, my friends and I started chuckling a little bit, like, ‘How crazy would that be? ’” said William Yu, the    who created the hashtag. “Then I caught myself. Why should it be crazy?” The campaign was followed by #StarringConstanceWu, which Photoshopped the actress into posters for films starring Emily Blunt, Drew Barrymore and, ahem, Emma Stone. The activist outpouring is “a tidal wave,” said Keith Chow, the founder of The Nerds of Color, a website of geek culture criticism that has served as home base for several online campaigns. It has swept up some members of white Hollywood in its wake. Ms. Stone has acknowledged that her “Aloha” role made her the “butt of many jokes. ” And this month, the director of “Doctor Strange,” Scott Derrickson, tweeted, “Raw   from   over Hollywood whitewashing, stereotyping  erasure of Asians in cinema. I am listening and learning. ” Whether that translates into change onscreen is an open question. “Everyone seems to be becoming slowly aware of how overwhelmingly white everything is,” Mr. Ansari said. “It’s almost like the whole system is slowly being shamed into diversity, but it’s moving at a snail’s pace. ” He added: “Just look at the movie posters you see. It’s all white people. ”'"}, "time": 1742561738.8084705}