{"duration": 0.1419358253479004, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nThe Iraqi armed forces are becoming bogged down in the battle for Mosul. Its elite special forces and an armoured division are fighting to hold districts in the eastern outskirts of the city against counter-attacks by Isis fighters using networks of tunnels to move about unseen. \\n“In one day we lost 37 dead and 70 wounded,” said a former senior Iraqi official, adding that the Iraqi forces had been caught by surprise by the extent of the tunnel system built by Isis, said to be 45 miles long. \\nThe Iraqi Counter-Terrorism Service (CTS) and the Ninth Armoured Division have been trying for two weeks to fight their way into that part of Mosul city, east of the Tigris River. \\nIsis is sending waves of suicide bombers either as individuals who blow themselves up or in vehicles packed with explosives, snipers and mortar teams, to restart the fighting in a dozen districts that the Iraqi Army had said were already captured. \\n“At first I was optimistic that we might capture Mosul in two or three weeks, but I now believe it will take months,” said Khasro Goran, a senior Kurdish leader familiar with conditions in Mosul, in an exclusive interview with The Independent . \\nHe said he had changed his mind about the likely length of the siege when he witnessed the ferocity of the fighting in the outer defences of Mosul. He added that “if they [Isis] continue fighting like this then a lot of Mosul will be destroyed. I hope it will not be like Aleppo.” \\nA prolonged siege of Mosul with heavy civilian casualties and the possibility of Turkish military intervention is likely to be the first international crisis to be faced by the incoming administration of President-elect Donald Trump. The slow and heavily-contested advance of the Iraqi armed forces into the city means that the attack will still be going on when he is inaugurated in Washington on 20 January. \\nMr Trump would have to decide if he is willing to sanction an escalation in US-led airstrikes to destroy Isis defences, though this would inevitably lead to heavy loss of life among the estimated 1.5 million civilians in Mosul. \\nA threatened military intervention by Turkey will also become more likely if the best Iraqi combat units suffer heavy losses and look for reinforcements from the Shia paramilitary Hashd al-Shaabi (Popular Mobilisation) forces and the Kurdish Peshmerga. \\nUnder an American-brokered agreement, these are being kept out of the city of Mosul itself to avoid sectarian and ethnic tensions between them and its Sunni Arab population. \\nTurkey has sent tanks to the Turkish-Iraqi border and said it may invade if the Hashd or Peshmerga fight inside Mosul. \\nThe problem for the Iraqi armed forces is that they have previously relied heavily on US-led airstrikes to destroy Isis fighters in fixed positions. There have been 10,300 such airstrikes in Iraq since 2014. \\nIn the battle for Ramadi in 2015 some 70 per cent of the city was destroyed, but almost all of the 350,000 population had fled and Isis did not fight to the last man. The same was true of the outer ring of towns around Mosul like Bartella and Qaraqosh a dozen more miles from the city, which were empty of their largely Christian inhabitants, making it easier to target and destroy from the air buildings held by Isis. \\nThe same tactics cannot be used in Mosul because its people are still there and the city is very big. The Baghdad government offensive that began on 17 October went well until it reached Mosul’s outskirts two weeks ago. \\nSince then the fighting has swung backwards and forwards with districts being captured or recaptured three or four times. \\nIn al-Qadisiyah al-Thaniya district, which the CTS had entered on Friday, the elite soldiers later retreated and Isis fighters returned. A local resident told a news agency that “they came back to us again, and this is what we feared. At night there were fierce clashes and we heard powerful explosions.” \\nIn Intisar, another embattled east Mosul district, the Iraqi army’s Ninth Armoured Division has found that its tanks are vulnerable in street fighting for which its soldiers have neither experience nor training. Last Tuesday it lost two T-72 tanks. \\nThere were some signs of Isis disarray at the start of the siege. Hoshyar Zebari, the former Iraqi Finance and Foreign Minister, says that by far “the biggest surprise for Isis was some months back when the Iraqi government and the leaders of the Kurdistan Regional Government (KRG) agreed on a joint offensive against Isis in Mosul.” Isis did not expect this – Baghdad and the KRG had previously been barely on speaking terms because of economic and territorial disputes. \\nWhen Iraqi forces first attacked east Mosul, there were reports of wavering morale among some Isis fighters, but the Isis leadership has mercilessly enforced its control. \\nThe UN says that it has executed some 70 civilians in Mosul accused of collaboration with Iraqi forces over the last week. Last Tuesday alone 40 people were dressed in orange jumpsuits and shot for “treason and collaboration” before being hanged from electricity poles. \\nAnother 20 civilians have been shot for using mobile phones to leak information to the Iraqi army and their bodies were hanged at traffic lights. \\nThe real level of support for Isis in Mosul is unclear. The 54,000 people who have fled the city and sought refuge behind Peshmerga or Iraqi army lands all express their hatred of movement and deplore its atrocities. \\nBut local Christians and Kurds view the displaced civilians from Isis with suspicion as possible covert Isis supporters. “I see that Isis are getting their families to safety,” said one Christian driving past a camp of white tents occupied by Internally Displaced People (IDPs) at Khazar, east of Mosul. \\nMr Goran is an expert on the internal politics of Mosul where he was deputy governor between 2003 and 2009, and leader of the Kurdistan Democratic Party (KDP) in the city until 2011. Speaking of the political sympathies of its people, he said that “a third of the population supports Isis, much of the rest is passive and only a small percentage actively resisted them.” \\nHe believes that reports of extensive anti-Isis armed resistance inside the city was largely propaganda designed for the media. He pointed out that there might be a lot of foreign fighters in Mosul, but “the majority of fighters are Iraqis”. \\nDuring the almost two-and-a-half years in which Isis has ruled Mosul since it captured it in June 2014 it has concentrated on recruiting young adolescents and teenagers to its cause. These are given extensive ideological and technical training to turn them into fanatical fighters or suicide bombers. \\nIsis is holding out effectively in east Mosul and may be able to withstand a siege for many months, but it is likely to lose the battle for the city in the long term. Iraqi army units are approaching Mosul from the south and the Hashd are closing off the escape routes to the west. A last stand by Isis in the city, however, could lead to its destruction. (Reprinted from The Independent  \""}, "time": 1742562232.5839872}