{"duration": 0.04733538627624512, "input_args": {"text": "'Eric Zuesse BACKGROUND A Reuters report, November 4th, contains the available information regarding the million-dollar payment, which was made in 2011, when the active effort began to overthrow Bashar al-Assad in Syria. This previously unreported payment, which was intended to go through the Clinton Foundation, was made by Qatar , which, along with Saudi Arabia , are the main sources of funding to the jihadists who are trying to overthrow and replace Assad, the man who is blocking those two countries from building oil and gas pipelines through Syria into Europe. Both Qatar and Saudi Arabia are owned by their country’s royal family, who also own the world’s largest oil and gas reserves, and those royals want to pipeline their oil and gas into Europe and displace the other oil-and-gas giant, Russia, in the world’s largest energy-market: the EU. This previously unreported payment was made to his and his wife Hillary’s, and his daughter Chelsea’s, Clinton Foundation, but neither Qatar nor any of the Clintons, nor the Obama Administration, is answering any questions about it, as a consequence of which a reasonable assumption is that it was an outright bribe — especially because in the Haiti hurricane matter and many others, moneys that were paid into the Clinton Foundation did not, in fact, go to benefit the alleged charitable beneficiaries, in that case Haitians. (Haitians therefore especially detest the Clintons.) In all of the Clinton Foundation’s operations, the firms that are controlled by the world’s top aristocrats — not only in Saudi Arabia and Qatar but elsewhere , receive the funding. Whether those recipients actually spend the money as advertised is generally not tracked. The stated purpose of this particular million-dollar payment was to achieve a private meeting with Bill Clinton. The stated reason for the payment was to honor him on his 65th birthday. Bill Clinton is the person whom international aristocrats most seek to have private meetings with in order to discuss U.S. foreign policies, because there is no record kept of what is being said at those confidential meetings, and because his representations of Hillary Clinton are known to be the most trustworthy, the most “bankable” — it’s considered to be as good as if they were meeting with her in private. Neither the Clintons nor Qatar are answering questions about this matter, not even whether the requested private meeting with the Secretary of State’s husband ever, in fact, occurred. THE PAYMENT Here are highlights from the original Reuters report on this matter: On Friday, November 4th, Reuters headlined “Clinton’s charity confirms Qatar’s $1 million gift while she was at State Dept” , and reported: Clinton Foundation officials last month declined to confirm the Qatar donation. In response to additional questions, a foundation spokesman, Brian Cookstra, this week said that it accepted the $1 million gift from Qatar, but this did not amount to a “material increase” in the Gulf country’s support for the charity [that’s the phrase in the law that requires it to be made public] . Cookstra declined to say whether Qatari officials received their requested meeting with Bill Clinton. Officials at Qatar’s embassy in Washington and in its Council of Ministers in the capital, Doha, declined to discuss the donation. The State Department has said it has no record of the foundation submitting the Qatar gift for review, and that it was incumbent on the foundation to notify the department about donations that needed attention. A department spokeswoman did not respond to additional questions about the donation. According to the foundation’s website, which lists donors in broad categories by cumulative amounts donated, Qatar’s government has directly given a total of between $1 million and $5 million over the years. … Foundation officials told Reuters last year that they did not always comply with central provisions of the agreement with President Barack Obama’s administration. … The foundation has declined to describe what sort of increase in funding by a foreign government would have triggered notification of the State Department for review. ,,, The State Department said it has no record of being asked by the foundation to review any increases in support by a foreign government. Spokesmen for Hillary Clinton’s campaign and Bill Clinton did not respond to emailed questions about the donation. Here is the passage from the wikileaked email , dated in 2012, in which Amitabh Desai, the Clinton Foundation’s director of foreign policy, writes to other senior Clinton Foundation officials, requesting a private meeting of Qatar’s U.S. Ambassador with “wjc” William Jefferson Clinton: – Would like to see WJC “for five minutes” in NYC, to present $1 million check that Qatar promised for WJC’s birthday in 2011. – Qatar would welcome our suggestions for investments in Haiti – particularly on education and health. They have allocated most of their $20 million but are happy to consider projects we suggest. I’m collecting input from CF Haiti team.'"}, "time": 1742628440.0878701}