{"duration": 0.07943201065063477, "input_args": {"text": "'At first glance, the sideline of a United London F. C. home game features exactly what one would expect from an   soccer match on a rented field in England’s capital. Water bottles. A collection of balls. Substitutes warming up. A crowd that United London’s chairman, Mark North, describes as “one man and his dog. ” What is missing is more notable: a manager. At United London F. C. the position of a traditional coach is unnecessary. Instead, the lineup is selected by the team’s fans each week. Formed this year and currently playing in the Essex Alliance Premier League  —   the 12th tier of England’s competitive soccer pyramid  —   United London F. C. claims to be the world’s only managerless club. In place of a traditional coach, the team’s business model brings together elements of reality TV voting and player analytics similar to those used in video games and by scouts. It employs a fantasy   system that awards points to or deducts points from the team’s fans (acting individually as managers) based on whether their selections make the starting 11, score or record an assist, or play a role in posting a shutout. “In nonleague football, there’s not much in the way of eyeballs, because the Premier League just takes over everything,” North, 38, said. “That’s where we want to be different, in that we are building an online fan base, rather than a localized one. ” To date, more than 2, 000 people have signed up with the club, which played its first competitive match in early September. The team claims support from fans in Australia, Argentina, Brazil, Canada, Sweden and the United States. Each week, those fans vote on United London’s starting lineup by reviewing player statistics, scouting reports and videos of previous weeks’ matches posted online by the club. After voting closes each Friday, the squad for Saturday’s match is announced. “I think it’s cool because it keeps the club’s supporters involved,” said John Frusciante, a    from Aberdeen, N. J. who recently signed up. “The fans have more input than, say, at Real Madrid. Zidane isn’t going to ask you if Ronaldo should be starting or not”  —   as in Coach Zinedine Zidane and striker Cristiano Ronaldo. North said the idea behind the team came to him last year while he and his wife were watching TV on a Saturday night. Tired of ballroom dancing shows and singing contests, North, who worked in financial recruitment at the time, began devising ways to apply the reality TV voting model to soccer. Like the contestants on such shows, players for United London have something at stake in each week’s voting. While researching how to find players for a   team, North realized he might be able to mine the large number of academy prospects that are released by English professional clubs each season. After this highly competitive annual cull, many players abandon their hopes of professional soccer, around age 18. United London has positioned itself as a second chance for such players the club’s badge depicts a phoenix rising from flames. “A lot of players, by the time they get to 18, 19, 20, they haven’t got a résumé,” said Jon Willis, the head of recruitment at the Football Careers Centre, an organization that helps place former academy players with new clubs. He helped organize United London F. C.’s summer trials. Willis said United London allowed players to reset their career path, or try to attract the attention of a new club. “This program is interesting,” Willis said, “because they record every game. It’s going to put people in the shop window. ” Already, United London F. C. has created a diverse squad of     and even   among them a Turkish youth international a player who, the club claims, was the   soccer player in Britain last year and the nephew of an England international striker. “Right now, I don’t really think about it,” Georges Ketoka, who once played in the third tier of Belgian soccer, said of fans’ having the power to pick, or cut, players. At 26, Ketoka is one of the team’s oldest members. “If you play,” he said, “you know it’s because people like you, the way you play and what you bring to the team. ” For now, United London supporters can influence the team’s lineup only before matches. On a   website  —   North admitted that it had had some growing pains  —   fans are met with a formation empty of players that they can fill by selecting names from   menus beneath each position. Clicking on a star above a player selects him as the captain, earning the manager double points for that player’s performance. As technology improves, North said, the club would like to allow fans to make   decisions on substitutions and other questions. For now, those decisions, and practice sessions, are handled by United London staff members. North would not reveal how many of those     are active users. The reason, he said, is that knowing such information could allow him and his staff to manipulate voting for the players they prefer. However, North did joke that results so far had shown that he was perhaps not the best person to be making such decisions anyway. His role at the club includes   tasks like putting up the nets before matches, but he also sits down every Sunday to count every pass, tackle and shot from the previous day’s match, so that fans have the information they need to vote during the week ahead. That has not lent him much of an insider advantage, though, when he picks his own lineup. Last week, he said: “I was only ranked seventh  —   some guy from Sweden was top of the leaderboard. And I should know everyone!”'"}, "time": 1742628323.3532867}