{"duration": 0.03160429000854492, "input_args": {"text": "'Explorers accidentally find a graveyard of more than 40 perfectly preserved ancient shipwrecks at the bottom of the Black Sea By Shivali Best Daily Mail October 27, 2016 In the depths of the Black Sea lies a landscape of complete darkness, where there is no light and no oxygen. Archaeologists have long believed this ‘dead zone’ holds of a perfectly preserved graveyard of shipwrecks. Now, a mapping expedition has proved them right, after accidentally uncovering more than 40 ancient shipwrecks from the Ottoman and Byzantine periods. More than 40 shipwrecks have been discovered from the Ottoman and Byzantine periods, many of which provide the first views of ship types known from historical sources. Pictured is a shipwreck from the Ottoman period The expedition has been scouring the waters 5,900ft (1,800 metres) below the surface of the Black Sea using an off-shore vessel equipped with some of the most advanced underwater equipment in the world. The vessel is on an expedition mapping submerged ancient landscapes which were inundated with water following the last Ice Age. The project, known Black Sea Maritime Archaeology Project (Black Sea MAP), involves an international team led by the University of Southampton’s Centre for Maritime Archaeology. Professor Jon Adams, the principle investigator on the project, said: ‘We’re endeavouring to answer some hotly-debated questions about when the water level rose, how rapidly it did so and what effects it had on human populations living along this stretch of the Bulgarian coast of the Black Sea. ‘The primary focus of this project is to carry out geophysical surveys to detect former land surfaces buried below the current seabed, take core samples and characterise and date them, and create a palaeoenvironmental reconstruction of Black Sea prehistory.’ The vessel is based on board the Stril Explorer and carries some of the most advanced underwater survey systems in the world. The researchers are using two Remotely Operated Vehicles (ROVs) to survey the seabed. One is optimised for high-resolution 3D photography, while the other, called Surveyor Interceptor, ‘flies’ at four times the speed of conventional ROVs and carries an entire suite of geophysical instrumentation, as well as lights, high-definition cameras and a laser scanner.'"}, "time": 1742628514.3984485}