{"duration": 0.0466771125793457, "input_args": {"text": "'VIDEOS I just lost all faith in our deeply corrupt legal system and in the Rule Of Law in the United States If the law does not apply equally to all persons at all times and in all circumstances, we might as well not even have a legal system By Michael Snyder - November 7, 2016 \\nThe FBI just gave Hillary Clinton the biggest gift in the history of presidential politics. Two days before the election the FBI has announced that they are ending their investigation into Hillary Clinton’s mishandling of classified information. After reviewing the emails that were found on electronic devices owned by Huma Abedin and Anthony Weiner, FBI Director James Comey sent a letter to Congress telling them that “we have not changed our conclusions that we expressed in July with respect to Secretary Clinton.” That means that there will be no indictment, and the path is now clear for Hillary Clinton to become the next president of the United States on Tuesday unless an election miracle happens. \\nThese days it is unusual for a news story to hit me on a deeply emotional level, but this one sure did. When the FBI originally announced that they were renewing this investigation, it gave me a glimmer of hope that there may be a little bit of integrity left in our legal system. \\nBut after today’s announcement I have lost all faith in our deeply corrupt system of justice. America has become a lawless nation, and the rule of law is completely dead in this country. \\nYes, it is true that those of us in the general public do not know what was contained in those emails, and Director Comey says that nothing significant was found in them … In a letter to lawmakers, Comey said the FBI is standing by its original findings, made in July, that Clinton should not be prosecuted for her handling of classified information over email as secretary of State. “The FBI investigative team has been working around the clock to process and review a large volume of emails from a device obtained in connection with an unrelated criminal investigation,” Comey said in the letter. “During that process we reviewed all of the communications that were to or from Hillary Clinton while she was secretary of State,” Comey wrote. “Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton.” \\nBut of course the truth is that the FBI already had more than enough to go after Clinton based on what they discovered the first time around. \\nIn the world of national security, if you transmit a single classified document via a channel that is unsecured, you will lose your security clearance in a heartbeat and it is quite likely that you will be prosecuted and sent to prison for mishandling classified information. \\nIn fact, two different members of the U.S. military were recently convicted for doing precisely that … Just last month, Bryan Nishimura, a California Naval reservist, was sentenced to two years’ probation and a $7,500 fine after he pleaded guilty to removing classified material and downloading it to a personal electronic device. The FBI found no evidence he planned to distribute the material . Last year, Bronze Star recipient and combat veteran Chief Petty Officer Lyle White pleaded guilty to storing classified documents on a nonsecure hard drive in Virginia. He received a suspended 60-day sentence and a suspended $10,000 fine in return for the plea. White said the information was for training purposes to study and that he had no intent to communicate with anyone . \\nNeither of those individuals intended to mishandle classified information, and they certainly never intended to share it. \\nBut they were both convicted anyway. \\nSo what makes Hillary Clinton any different? \\nDuring the initial investigation, the FBI found 113 emails that contained classified information … Clinton had repeatedly said she did not have any classified emails on her server, but the results of the FBI investigation show that claim was incorrect . Of the tens of thousands of emails investigators reviewed, 113 contained classified information, and three of those had classification markers. FBI Director James Comey has said Clinton should have known that some of the 113 were classified, but others she might have understandably missed. \\nAnd I would be willing to bet that the FBI found some more classified emails that they had not seen previously among the 650,000 or so that they reviewed for this renewed investigation. \\nBut it doesn’t matter now. Hillary Clinton is free as a bird even though she mishandled 113 classified emails, and it looks like she is going to become the next president of the United States on Tuesday. \\nAs a law student and then later as an attorney working in Washington D.C., I got to see just how deeply corrupt our legal system has become. \\nBut after today, I don’t see how any American can ever have faith in the rule of law again. \\nIf the law does not apply equally to all persons at all times and in all circumstances, we might as well not even have a legal system. \\nAt this point, there is only one way that some sort of justice can be achieved in this case. And that is if the American people go to the polls on Tuesday and vote to keep her out of the White House. \\nIt won’t be perfect justice of course, but at least it would keep Hillary Clinton from getting what she wants more than anything else in life. \\nThe choice before the American people is very simple. Hillary Clinton is the most corrupt politician to ever run for the presidency, and the extremely long laundry list of Clinton scandals and crimes has been well documented over the past three decades. \\nThe voters know exactly what they are getting with her. And if they choose her anyway despite all of the things that have been revealed, that means that America is willingly choosing lawlessness. \\nTo most conservatives, this election is all about Trump, but I believe that it is far more about Hillary Clinton. \\nI am convinced that we are at a pivotal moment in American history, and if the American people willingly choose Hillary Clinton it will be an indication that there is zero hope for the future of this nation. \\nSo let us pray for an election miracle, because right now Donald Trump is behind in most national polls and time is running out.'"}, "time": 1742628481.2821505}