{"duration": 0.16622161865234375, "input_args": {"text": "'  filmmaker Michael Moore has launched a new secure website where whistleblowers can leak and share information from inside President Donald Trump’s administration. [Moore’s website “Trumpileaks” allows   whistleblowers to post leaked information via encrypted messaging apps, like Single, Whatsapp and Peerio, and even gives detailed instructions on how to send digital communications.  In an open letter on the site, the    director says leaking administration documents and information may be “dangerous” and “may get us in trouble” but “it’s our patriotic duty” to “blow the whistle in the name of protecting the United States of America from tyranny. ” “Today, I’m launching TrumpiLeaks, a site that will enable courageous whistleblowers to privately communicate with me and my team,” the   wrote, citing the historical significance of the 1778 whistleblower protection law. “Patriotic Americans in government, law enforcement or the private sector with knowledge of crimes, breaches of public trust and misconduct committed by Donald J. Trump and his associates are needed to blow the whistle in the name of protecting the United States of America from tyranny. ” “We’ve put together several tools you can use to securely send information and documents as well as photographs, video   audio recordings” Moore’s message says. “While no form of digital communication is 100 percent secure, the tools we’re using at TrumpiLeaks provide the most secure technology possible to protect your anonymity (and if you don’t require anonymity, you can just email me here). ” The launch of Trumpileaks comes amid reports that the Justice Department has charged      contractor Reality Leigh Winner for allegedly leaking a National Security Agency report on Russian Election hacking to   news site The Intercept. In March, Moore called on Democratic lawmakers to declare a “national emergency” until the FBI could complete its probe into alleged connections between President Trump, his campaign staff. and the Russian government. “The Democratic Party needs to declare a National Emergency,” Moore wrote on his Instagram. “For the first time in our history, the President of the United States and his staff are under investigation for espionage. This announcement, by the head of the   FBI, is a shock to our democracy. ” Last month, the Marley and Me director announced plans to bring an original     play to Broadway. Michael Moore (@MMFlint) unveils   Broadway play, including   excursions to Trump Tower https:  .  pic. twitter.   —   Ashley Lee (@cashleelee) May 1, 2017,  The new whistleblower website and his satirical Trump Broadway show are all part of Moore’s “  strategy” to remove Trump from office, which include: “1. Mass Citizen Action 2. Take Him To Court Nonstop 3. YOU Run for Office 4. An Army of Satire. ” 1. Mass Citizen Action.  2. Take Him to Court Nonstop.  3. You Run for Office in 2018.  4. An Army of Satire Will Defeat Them All. #ourplan,  —   Michael Moore (@MMFlint) May 21, 2017,    Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563717.4085388}