{"duration": 0.17154788970947266, "input_args": {"text": "'Comments \\nAs election day draws closer and closer, it becomes even harder to understand or tolerate Donald Trump supporters. It is conceptually difficult for many of us to understand how anyone could support Trump knowing all we know about him. But many people don’t know what we know, so here’s a viral list that every Trump supporter needs to read before they vote on Tuesday, courtesy of some anonymous Facebook poster. \\nSo You Want Someone To ‘Tell It Like It Is’? OK, Here You Go. 1. You join a lying machine and call Hillary crooked. But you support a man who refuses to release his tax returns. You support a greedy, self serving, manipulative proven tax cheat. You support a crooked narcissistic psychopath who is worried his tax returns would reveal evidence of financial ties to Russian oligarchs and other dictators of the world. Just like we now know Putin’s puppets illegally paid millions to his crooked former campaign manager, maybe he has been getting paid too. A corrupt little man whose daughter vacations with Putin’s girlfriend. Making Russia great again? A con man who funneled millions of campaign money to his own companies and used campaign money to pay his family handsomely. Using his own words, a disgusting and corrupt man who surrounds himself with a disgusting corrupt people. 2. You say you love our veterans but support a man who believes POWs are not heroes because they were captured? A man who has shown he lacks emotional intelligence when he attacked families of a fallen war hero. A man whose company fired a veteran for being deployed to Afghanistan. A man who insults and derides our generals. 3. You think a soulless, heartless small man who mocked a disabled reporter will make a good president. A man whose first instinct after a tragedy is always self-aggrandizement, like after Orlando mass shooting & when Dwyane Wade’s cousin Nykea Aldridge was killed. As 3,000 people were dying, this man bragged about how 9/11 attacks were good for him & bragged about how his building is now the tallest in Manhattan just hours after the attack. When the pound fell to a 30-year low following the vote to exit EU, he boasted about making money off British economic uncertainty. When the housing market collapsed in 2008 and millions of Americans lost their homes, he said “ I ‘sort of hope’ real estate market tanks.” Trump is always looking out for Trump. How do you believe a greedy, narcissistic man who fundamentally lacks empathy and compassion will be a good president? He is not even a good person. 4. You say you’re patriotic & love this country but you support a man who has so little understanding of the basic parameters of our constitution’s limits & has zero respect for it, except the part he uses to incite violence. A careless small man who asked Russia to spy on our former Secretary of State. A man who trash talks our NATO allies and our president but lavishly praises brutal dictators like Saddam Hussein, Kim Jong Un, Muammar Gaddafi, Vladimir Putin…etc 5. You support a small man who has been married three times and has admitted to infidelity in the past. A man who was accused of raping his wife & has a federal lawsuit accusing him of raping a 13-year-old girl during a party hosted by convicted pedophile billionaire Jeffrey Epstein. A man who comments about his daughters breasts and body. Then you turn around and bring up Bill Clinton’s history with women? I agree with you 100% Bill has a disgraceful history with women but no comparison to Trump who has said cringeworthy, disturbing things about women his whole life. May I remind you Bill is NOT running to be the next president. If you are saying oh, candidates spouses are fair game then you can’t ignore that he is married to a woman whose naked pictures are all over the internet. 6. You support a man whose business career is a very long list of bankruptcies, defaults and deceptions because he is good for our economy? A man who was born into wealth and built that wealth by scamming, stiffing and bullying ordinary working citizens of this great country. 7. Yes, Hillary is not perfect, then again no one is. You call her dishonest but support a narcissistic pathological liar? Every time Trump opens his mouth every other word that comes out is a lie. Fact checkers have proven it over and over again. We are talking about a man who makes things up to spew hate and fear, like when he lied about seeing an Iran ransom video and a video of muslims celebrating in New Jersey on 9/11. The man is incapable of telling the truth and he is delusional. \\n8. You support a hypocritical man who hired undocumented immigrants for his real estate projects & exploited our visa program. He is a man capable of solving our immigration problem? 9. I agree 100% if she’s elected Hillary and her whole family must distance themselves from the Clinton foundation. Let other people continue the great work the foundation is doing. With that said, you support a man whose foundation is found guilty of a pay-to-play scam and false claims of giving on its tax forms and then turn around and try to push fabricated scandals about the Clinton foundation. The IRS found the con man used funds from his charitable foundation to make a campaign donation to Florida Attorney General Pam Bondi. Just after 4 days of the bribe payment Pam dropped Trump U case. He also held $150K fundraiser for Pam after she dropped a criminal case against his university. His foundation claimed on its tax return forms that it gave $10,000.00 to The Giving Back Fund, but the organization says that donation does not exist. A man who completely retooled his charity to spend other people’s money. A man with deep ties to global financiers, foreign politicians and criminals. 10. You claim the con man whose line of clothing and accessories are made in Bangladesh, China, Honduras and other low-wage countries is the man to fix our labor laws? You claim the man who outsources everything is the answer to creating jobs here at home? 11. You claim the unfit, unstable Putin’s little puppet whose campaign is fully embracing alt-right’s anti-Muslim and anti-Immigrant ideologies with all their conspiracy theories is the one to unite the country? 12. You support a bottom feeder who put racial discrimination in housing at the heart of his real estate developments, started the birther movement, said “Obama would look perfect on food stamps, he has the right face for it,” and has shown he is prejudice with his actions & words over and over again. Then he pretends he cares about the black communities. He brings up Hillary’s reference to a group of violent repeat criminals as “super-predators” in 1996? I don’t agree with her choice of words all those years ago but she has apologized since. Something Trump refuses to do. Of course you can use all kind of deflection tactics & tell yourself whatever makes you feel better but the reality is if you are supporting a racist, misogynistic, xenophobic, bigoted, unfit, unqualified, disgusting con man, you really should admit to yourself you don’t care what he says or does. You are using your hatred to cloud your judgement.'"}, "time": 1742561641.5703485}