{"duration": 0.2156379222869873, "input_args": {"text": "'“You’ve got lovely beds. Good beds,” the actress Patti LuPone said. She was referring not to furniture, but fingernails: the unvarnished ones on the hands of her current   Christine Ebersole. They contrasted markedly with Ms. LuPone’s nails, which she herself had lacquered in shiny maroon, after years observing professional manicurists. “I watch how they depress the fluid,” Ms. LuPone said, pantomiming bottle and brush. “The problem is, when I put nail polish on it really weakens my nails,” Ms. Ebersole said in a sisterly way. “They just flake off. ” The talons were out, in other words, but this was not a catfight. More a chat ’n’ chew between Tony   actresses getting the chance to share a Broadway stage for the first time in “War Paint,” one of a   new musicals debuting in a mad cram before the season ends. Dressed in a confusion of stretchy black clothing and scarves, the two women were sharing a sofa in the upper half of a sleek duplex at 663 Fifth Avenue, where the flagship of Elizabeth Arden’s signature spa, the Red Door, moved five years ago from the florid former Aeolian Building two blocks north. They had refused treatments and were instead efficiently slurping vegetarian soups. In “War Paint,” which is now in previews and opens at the Nederlander Theater on April 6, Ms. Ebersole, 64, plays Miss Arden, née Florence Nightingale Graham: the entrepreneur who made cosmetics, long associated with prostitutes, acceptable and desirable to the American middle and upper classes starting in the 1910s. Ms. LuPone, 67, plays Arden’s   but equally esteemed competitor, Helena Rubinstein, who imparted both artistic and clinical prestige to the pursuit of beauty, and who is credited with the phrase “there are no ugly women, only lazy ones. ” Bette Davis vs. Joan Crawford Alexis Colby vs. Krystle Carrington: Female rivalries have long meant boffo box office and Nielsen ratings points. But theatergoers hoping for Ms. Ebersole and Ms. LuPone to whack each other with pocketbooks or hurl drinks like Anne Bancroft and Shirley MacLaine in “The Turning Point” are due for disappointment. Rather, their characters fight by issuing new products, raiding staff and investing in premium real estate: penthouses and country spreads for Rubinstein, who donated millions of dollars to arts education and other causes through her foundation an Irish castle and Lexington, Ky. breeding stable for Arden, who was passionately devoted to horses and marched with suffragists. “We should really look at them as role models,” Ms. LuPone said of the two tycoons. “They were really inspiring,” Ms. Ebersole said. “My God,” Ms LuPone said. “Regardless of what their personal flaws were, or what drove them  —   nothing that they achieved for themselves and then in the name of woman has ever been matched!” Ms. Ebersole, more gently: “They paved the way, and started before women had the vote. ” Ms. LuPone was incensed by news reports about the departing C. E. O. of Yahoo, Marissa Mayer. “Her male replacement is getting twice as much as she is,” she said. “Twice as much!” The gender pay inequity common in the film industry is not an issue for “War Paint,” which is capitalized at $11 million and carried by its leading ladies, one or both of whom appear in all but four of the show’s numbers. But the fact that its principal creators are all men might arch an eyebrow. The musical takes its title and basic premise from a dual biography by Lindy Woodhead published in 2004 that a few years later inspired a documentary, “The Powder  the Glory,” to which David Stone, a producer, was introduced by the director James Lapine. Mr. Stone has had tremendous success with “Wicked,” another musical centered on female foes, and, among other projects, worked on “The Vagina Monologues” by Eve Ensler. He called her for advice before proceeding. “Eve said, ‘This can’t be about makeup.’ And it’s not,” Mr. Stone said. “It’s about women and beauty and power and how women treat each other. ” Mr. Stone and Ms. LuPone both wrinkle their noses at the word “diva,” a description cribbed from Italian opera that is now often applied to any commanding female presence in the entertainment industry, inevitably also suggesting an excess of temperament. “I just can’t stand it,” Mr. Stone said. “Diva implies difficult. ” At a talk about the show a few months ago, Ms. LuPone proposed “dame” as an alternative, to approving whoops from the audience. After securing rights to the material, Mr. Stone hired Michael Greif, with whom he had worked on “Next to Normal” and “” to direct. They brought in the composer Scott Frankel, the lyricist Michael Korie and the book writer Doug Wright, Mr. Greif’s collaborators on the musical “Grey Gardens,” inspired by the Maysles brothers’ cult documentary about the eccentric aristocrats “Big Edie” Beale and her daughter, “Little Edie. ” Some early workshops of “War Paint” featured Donna Murphy in the Arden role but she withdrew for family reasons, and Ms. Ebersole, who had won a 2007 Tony for portraying both Beales at different stages of their lives, assumed the part. She and Ms. LuPone, for whom this is the first musical since the   “Women on the Verge of a Nervous Breakdown” (2010) were not shy about participating in the creative process. “Both of them were very excited to play against the obvious  —   feuding,    stars and that kind of energy  —   and actually find ways where the competition between them was nourishing,” Mr. Frankel said a few hours before curtain on a recent evening. “These women were enormously sophisticated and tasteful and   in corporate weaponry,” Mr. Wright said. “They didn’t have to reduce things to an insult they could actually wage business warfare against one another and did so very effectively for 50 years. ” Anything “that felt cheap or easy,” he said, the actresses “instantly rejected. ” Criticism of an    tryout in Chicago last summer focused on relentless   between its two subjects, who supposedly never met in real life. About a third of the show has been revised, the creators said, both to fortify the solo appearances and to find novel ways of bringing the characters together onstage. “There was some tightening,” Mr. Frankel said, slipping into   patois. “Because it’s the two of them, there’s a little bit of inherent    that’s intrinsic in the proposition of the evening, but I think we tried to find ways to mix that up in more unexpected ways. ” He and his colleagues were adamant that “War Paint” is not purely ladies’ entertainment, though the Broadway audience is disproportionately female, a demographic that has helped make shows like “Waitress” into hits. “There are metaphors inherent in the idea of makeup that I think transcend gender,” Mr. Wright said. “It offers a potential mask where you can pretend to be someone you aren’t it offers a disguise if you don’t wish to be recognized it offers an avenue toward a certain kind of perceived   it is a kind of lure to attract someone else. ” But with its   costume changes designed by Catherine Zuber, including   hats and piles of glittering jewelry, and makeup by Angelina Avallone, “War Paint” has been an occasion for the two stars to reflect on how cosmetics and other trappings have been integral to their long careers. “Once I put on the wig it’s like ‘O. K. badda bing, badda boom,’” Ms. LuPone said. “I’m not the type of actress that goes into a corner and meditates for 20 minutes on the bones of Helena Rubinstein. Do you know what I mean?” Ms. Ebersole said that for performers backstage as well as for many people in real life, “putting on makeup is a really great centering device. It’s a way of having you focus on what you’re doing. As you put on the mask, then the other things come through. ” She recalled her work in the 2001 revival of “42nd Street,” for which she won her first Tony with the help of 1930s regalia by Roger Kirk: “The costumes just informed everything. ” This inspired Ms. LuPone to reminisce about “Evita,” for which she got her first Tony, at 31. “The amount of  —   for lack of a better word  —   gack that we’re putting on!” she said. “I also harken back to that time in ‘Anything Goes’ when I was in those   gowns. Oy, I can’t wear a   gown now to save my life, unless I’m strapped in. ” The two actresses were “babies in the city together,” as Ms. LuPone put it. She arrived in 1968 to attend Juilliard, where she studied with Marian Seldes, having known she wanted to perform since she was 4, standing downstage right in a tap recital. Ms. Ebersole, who had gone to MacMurray College in Jacksonville, Ill. before enrolling at the American Academy of Dramatic Arts in 1973, had had other plans. “I was going to be a nurse,” she said. “Of course you were,” Ms. LuPone said. “Look at her!” Instead Ms. Ebersole served customers at the Lion’s Rock, a restaurant on the Upper East Side with water splashing down a   slab of red granite. “It’s condominiums now, I think,” she said. Ms. LuPone, meanwhile, worked at a “wannabe mobster” hangout run by a man who imported cages for dancing girls in nightclubs. “My roommate was one of the dancers, and I wasn’t pretty enough, tall enough or thin enough to be a dancer, so I was a waitress in a   lace ” she said. Both women bemoaned a lost era when actors (and stagehands) were recognized and welcomed in the theater district at places like Jimmy Ray’s and Charlie O. ’s, and spent time after the show socializing rather than cultivating followings on Twitter and YouTube. “I think we have fewer showmen,” Ms. LuPone said. “Like the Irving Thalbergs and the Alex Cohens and the Robert Whiteheads and the people that loved the theater or loved making movies. It’s such a cliché, but it’s all bean counters. It’s statistics. Polling. ” This was a reminder that the unexpected foil in the   showdown was Charles Revson, the founder of Revlon, rendered in “War Paint” by Erik Liberman as “a   carnival barker in an Italian suit. ” It’s a line that for some involved with the production took on new resonance after Donald J. Trump defeated Hillary Clinton. Overnight, in their view, the musical went from celebration to cautionary tale. After Rubinstein died in 1965, Revson bought her Park Avenue triplex. But that wasn’t the final indignity. Last year, the company he founded, which had brought sex back into the midcentury cosmetics marketplace with suggestive ad copy and flashy layouts, took over Elizabeth Arden. “Everybody’s rolling over in their grave!” Ms. LuPone said. Not that any of these brands make her particularly nostalgic. “I used to be a Georgette Klinger girl. For years,” she said, after the two women packed up a gift of exfoliating face pads and descended nine floors to the lobby. “Oh my gosh, Georgette Klinger, I completely forgot that name,” Ms. Ebersole said, blinking her blue eyes on the sunny sidewalk. “That was a salon,” Ms. LuPone said. “You’d go in, and close the door, and they were all about getting into your face. They don’t get into your face anymore. ”'"}, "time": 1742562763.8170624}