{"duration": 0.053376197814941406, "input_args": {"text": "'Valentine’s Day is upon us again. It’s a time of candlelit dinners,   candy boxes from the drugstore and (depending on your relationship status) watching old romantic comedies while you drink wine by yourself. It’s a great celebration. But where did it come from? And why do we care about it so much? People have been trying to answer those questions for a long time. The New York Times pondered the day’s origin in 1853 but called it “one of those mysterious historical or antiquarian problems which are doomed never to be solved. ” Well, it’s 2017 so we’re going to try again. Here is a brief guide to some of the major Valentine’s Day theories, from ancient Rome to the present. The most common explanation for how Valentine’s Day came to be is the ancient festival of Lupercalia, a raucous,   fertility rite in which Roman men and women paired off. This theory has appeared in news articles for decades. Lupercalia was celebrated for centuries in the middle of February and eventually, as the Roman Empire became less pagan and more Christian, was transformed into a celebration honoring St. Valentine. Noel Lenski, a Yale historian, told National Public Radio in 2011 that the festival was known for its debauchery and nudity until Pope Gelasius I made it a Christian holiday in the fifth century. “It was a little more of a drunken revel, but the Christians put clothes back on it,” Lenski said. “That didn’t stop it from being a day of fertility and love. ” There is little reliable information about the life of St. Valentine. The Times reported in 1923 that the day may in fact celebrate two different saints named Valentine who were made into a composite character. (Neither one of them sounded particularly romantic.) According to one popular tale, printed in The Boston Globe in 1965, St. Valentine was arrested after he defied an order by Emperor Claudius that forbade Roman soldiers from getting married. St. Valentine was later beheaded for his religious zeal, a death that Roman men decided to celebrate by pulling the names of eligible young ladies out of an urn. “This custom persisted for many years and eventually found its way into Germany and England,” The Globe reported. Not everyone is convinced of that version of events. Jack B. Oruch, an English professor at the University of Kansas who died in 2013, studied Valentine’s Day as part of his research into the poet Geoffrey Chaucer. He was convinced that Chaucer was the source of our modern ideas about St. Valentine. In a 1981 academic article, “St. Valentine, Chaucer, and Spring in February,” Mr. Oruch argued there was no documented evidence of a romantic tradition linked to St. Valentine before Chaucer wrote the poems “Parlement of Foules” and “The Complaint of Mars” in the late 14th century. Chaucer may have connected St. Valentine to romance because it was convenient: His saint’s day, on Feb. 14, took place at a time when Britons in the 14th century thought spring began, with birds starting to mate and plants beginning to bloom, Mr. Oruch wrote. From Chaucer’s perspective, an added perk was that Europeans at the time thought “Valentine” was a   name. Other saints who were celebrated in   had names with less poetic appeal: St. Scholastica, St. Austrebertha, St. Eulalia and St. Eormenhild. It’s a compelling theory, but Mr. Oruch knew it was tough to compete with popular stories about romantic Romans. “The article made no difference,” he said in a 2011 interview, in reference to his research. “All the articles about Valentine’s Day each year repeat the same myths. ” Whatever its origins, Valentine’s Day is now a big deal. It can be stressful for some people because “it’s a night with very profound extra meaning that hits primitive parts of the brain linked with wanting,” said Helen Fisher, a Rutgers University physical anthropologist who studies the evolution of human sexuality. She said the need for love was “a basic brain system that evolved millions of years ago,” long before Lupercalia. “It’s a time of   and appraisal of your situation,” she said, especially if you’re single. “This is a day when one reflects on what you’ve got and what you don’t have. ” It’s also a day to spend money. The National Retail Federation said Americans were projected to spend $18. 2 billion, or an average $136. 57 per person, on things like candy, flowers, cards and fancy dinners for Valentine’s Day this year. Most of that will go toward romantic partners, but a sizable chunk will be spent on friends,   classmates and even pets. That reflects a change in the holiday from a celebration of romantic partners to “an    romp” that celebrates different kinds of affection and attachment, Dr. Fisher said. So, what if your only Valentine happens to be your cat? Dr. Fisher, whose work involves using scanners to study the brains of both the romantically committed and the recently dumped, said there is someone out there for everyone. “This brain system is like a sleeping cat,” she said. “It can awaken at any time at all. You just have to get out there. ”'"}, "time": 1742628558.5854497}