{"duration": 0.04982590675354004, "input_args": {"text": "'Following news of FBI Director James Comey’s decision to reopen the investigation into Hillary Clinton’s use of a private email server during her tenure at the State Department, federal law enforcement officials have come forward with new details on recently discovered evidence in the case.\\nMore on this: DEVELOPING: FBI Reopens Investigation into Clinton Emails After New ‘Pertinent’ Evidence Discovered \\nWhile Director Comey declined to provide specific details on what the newly discovered Clinton emails contained, federal law enforcements officials speaking under anonymity have explained that the emails were found on the personal devices of Clinton aide Huma Abedin and disgraced former Congressman Anthony Weiner.\\nThe discovery came as part of investigation into yet another Weiner ‘sexting’ scandal, this time after he was alleged to have been engaging in sexually explicit conversations with an underage female.\\nMore on the latest Weiner scandal: ‘Carlos Danger’ Strikes Again: New Reports Allege Anthony Weiner Knowingly Engaged in Sexually Explicit Conversations with 15 Year Old Female Online \\nAs reported by the New York Times, authorities discovered ‘pertinent’ emails related to the Clinton investigation on personal electronic devices belonging to Abedin and Weiner that had been seized by investigators as part of the investigation in Weiner’s alleged inappropriate conversations with a child.\\nVia NYT \\nFederal law enforcement officials said Friday that the new emails uncovered in the closed investigation into Hillary Clinton ’s use of a private email server were discovered after the F.B.I. seized electronic devices belonging to Huma Abedin, an aide to Mrs. Clinton, and her husband, Anthony Weiner.\\nThe F.B.I. told Congress that it had uncovered new emails related to the closed investigation into whether Mrs. Clinton or her aides had mishandled classified information, potentially reigniting an issue that has weighed on the presidential campaign and offering a lifeline to Donald J. Trump less than two weeks before the election.\\nMore via FoxNews \\nWatch the latest video at video.foxnews.com \\nWe will continue to update as new details surface.\\n'"}, "time": 1742564168.2433245}