{"duration": 0.11618185043334961, "input_args": {"text": "'SNAPCHAT: 100,000,000 people worldwide , with an estimated 8 billion daily views. YOUTUBE: 1,325,000 people worldwide , who watch 3,250,000,000 hours of videos per month. INTERNET: 3,200,000,000 people worldwide , or just under half the world’s population are surfing the web. \\nAs you can see , Internet usage is huge with tons of room left to grow, and social media accounts is how all those billions of people communicate with each other. NTEB regularly gets emails from South Africa, New Zealand, All of the United States, Israel, Asia, you name it. The prophesied “global community” is not coming…it is, obviously, already here. And if you are reading this right now, either via email or on a website, you are a part of said global community. Now let me start to tie it together for you. \\nHow often does one of your Facebook friends just “disappear”, and then 3 days, a week, 3 weeks later they pop back up and tell you that they were in “ Facebook Jail “? I see it happening a lot, and am sure that you do as well. Many people, when deprived of the ability to post and interact with their global community, get anxious, depressed and experience genuine psychological trauma. Over the last 10 years, we have been retrained to think differently, act differently, and experience life through the filter of the cyber-world. There are gatekeepers who control that world, and when you violate one of their silly rules, you are locked out. This is, in essence, exactly how life will unfold under the Mark of the Beast system. \\nHow many of your social media friends who are frequent visitors of social media jail ever close thier accounts and stop the insanity? Almost none. They want the system, they need the system, and cannot live apart from the system. They rant, rave and rail against Facebook, and yet there they are. Addicted. No matter how often Facebook jails them, they come back. \\n“The spider taketh hold with her hands, and is in kings’ palaces.” Proverbs 30:28 (KJV) \\nWhat happens to things caught in a web? They stay caught until the spider shows up. Social media is the web, and the Spider is on the way. Want to play a fun game? Close your social media accounts, all of them for a month, and see what happens. The results will shock you. How It Works: Internet of Things \\nUnder the rule of Antichrist , in order to be included in the global community, you are required to take the Mark. If you refuse, swift, severe and fatal judgment will be issued and you will cease to exist. The Bible says that people refusing the Mark will be decapitated. There is no forgiveness from God for taking the Mark, but if you don’t take the Mark you can’t feed your babies, pay your bills, or interact with the global community. \\n“And I saw thrones, and they sat upon them, and judgment was given unto them: and I saw the souls of them that were beheaded for the witness of Jesus, and for the word of God, and which had not worshipped the beast, neither his image, neither had received his mark upon their foreheads, or in their hands; and they lived and reigned with Christ a thousand years.” Revelation 20:4 (KJV) \\nSocial media is training you to accept global rules in order to maintain membership in a global community. More people now connect to the web via hand-held devices than through desktop or laptop computers. Those devices control more and more of our daily lives. There are apps to regulate the air conditioning and heating in your home, open your garage door , deposit money to to your bank account , monitor your vital signs , or meet a date for Saturday night . We literally could not function in our society without these things. So will it really be a big leap from having your device on your belt to having your device under your skin? Nope, not at all. People will jump at the chance to do it. \\n“And with all deceivableness of unrighteousness in them that perish; because they received not the love of the truth, that they might be saved. And for this cause God shall send them strong delusion, that they should believe a lie: That they all might be damned who believed not the truth, but had pleasure in unrighteousness.” 2 Thessalonians 2:10-12 (KJV) \\nSo the next time you try to login to one of your social media accounts, only to receive the dreaded warning of “Your account has been suspended for __ days for violation of our policies”, and you get first angry and then depressed, remember you’re part of the new global community. You have to live and play by global rules set to control the masses. The “secret government file” of yesteryear we all worried the FBI had on us cannot hold a candle to the interactive file that you created on yourself to be spied on with. \\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV) \\nThe Mark of the Beast system ? It’s already here and you’re already in it. It will “activate” when the Beast shows up. If you would like to “check out” of here in the Rapture before the Antichrist comes to power, click here for the one thing you need to do. \\n '"}, "time": 1742562409.5789485}