{"duration": 0.03856205940246582, "input_args": {"text": "'Next Prev Swipe left/right Unbrexit! Parliament must vote on triggering article 50: the 9 funniest, most ironic reactions \\nBritain has exploded today the news that the Government must offer Parliament a vote on invoking Article 50. \\nHere’s the BEST 9 tweets, the ones most gleefully relishing the change in fortune. \\n1 So, next steps for #Brexit and #Article50 could be a UK Government appeal to the European Court of Justice. How hilarious would that be. \\n— James Doman-Pipe (@james_mdp) November 3, 2016 \\n2 With this Article 50 ruling, I can see a real path back to our previous position as the graceless arrogant begrudging arseholes of the EU \\n— Jon Blyth (@disappointment) November 3, 2016 \\n3 Glad to hear the Brexit saga has been resolved comprehensively to the satisfaction of all parties, and we won\\'t be hearing any more about it \\n— Dai Lama (@WelshDalaiLama) November 3, 2016 \\n4 The High Court has upheld Parliamentary sovereignty over Brexit vote, in a move so ironic it threatens to destroy the fabric of spacetime. \\n— Unnamed Insider (@Unnamedinsider) November 3, 2016 \\n5 Brexit means Brexit but also not Brexit but kind of Brexit but that Brexit maybe this Brexit but with a hint of Brexit \\n— TechnicallyRon (@TechnicallyRon) November 3, 2016 \\n6 Someone please publish an article explaining today\\'s Article 50 decision that just says \"Article 50 decision is Article 50 decision\". \\n— reluctant ex baby (@mutablejoe) November 3, 2016 \\n7 If there is a civil war do the remainers get to have the rest of europe on our side? \\n— Richard K Herring (@Herring1967) November 3, 2016 \\n8 \\n— James Herring (@itsjamesherring) November 3, 2016 \\n9 Sneak peek at tomorrow\\'s Daily Mail front page. They don\\'t seem to be taking #unbrexit very well. pic.twitter.com/nQbDf1iNbZ \\n— The Poke (@ThePoke) November 3, 2016 \\nAnd our favourite was UKIP party spokesperson Suzanne Evans frothing with, “How dare these activist judges attempt to overturn our will? It’s a power grab & undermines democracy. Time we had the right to sack them.” \\nActivist judges? Amazing. Those activist judges occupying democracy with their hippy laws.'"}, "time": 1742563758.2794592}