{"duration": 0.08870410919189453, "input_args": {"text": "'\\nWikiLeaks has released a 20th batch of emails from the account of John Podesta, Hillary Clinton’s campaign chair. The issues discussed include Bill Clinton’s past, Benghazi, the email server scandal and even alien life.\\nThe whistleblowing site has promised to release 50,000 messages from Podesta in the lead up to the US presidential election on November 8. A total of 34,197 communications have been released to date.\\nBill’s past \\nBill Clinton’s controversial past was evidently of concern to his wife’s campaign team, which discussed how to handle questions on allegations of sexual assault against him.\\nPreparation for what the media might throw at her included the questions: “Will you apologize to the women who were wrongly smeared by your husband and his allies?” and “How is what Bill Clinton did different from what Bill Cosby did?” \\nThe mail was sent by Ron Klain, a member of Clinton’s debate preparation team, on January 12, 2016. Several days previous Paula Jones, one of Bill Clinton’s accusers, gave an interview calling Hillary Clinton a “liar” and “two-faced” for trying to discredit her husband’s accusers.\\nLet’s hope the Democratic party is not suicidal \\nA July 2015 email from Clinton adviser Neera Tanden to Podesta discusses a CNN poll which she guesses will show, “Bernie doing pretty well w Hillary and doing as well against Jeb or close to it.” \\n“Can you imagine what Republicans would do with him if he were the nominee?” Podesta replies, referring to Sanders.\\n“Well, let’s see what the poll actually says. Let’s hope the Democratic party is not suicidal,” Tanden says.\\n“Do we actually know who told Hillary she could use a private email?” she asks. “And has that person been drawn and quartered?” \\n“Like whole thing is f*cking insane,” she adds.\\nAn October 2015 email chain between staffers discusses upcoming paid media ads about Benghazi and Clinton’s email scandal.\\nThe group debates whether the ads should target Iowa and New Hampshire or be a national buy. “I know the boss wants a national cable buy to reach the inside the beltway types, press and donors,” Jennifer Palmieri says. “But press will hate this.” \\nOren Shur replies, “If the objective is purely to undermine the Benghazi hearings, I think these spots will certainly help do that. But if the objective is to connect emails-Benghazi and conflate the two in voters’ minds (which consultants feel is an imperative here), I’m not sure we know whether we can credibly do that.” \\nThe campaign appears to have decided to do a national ad on the subject.\\n\\nSmall tweaks A March 2016 email chain discussing Clinton’s inaccurate statement about the late Nancy Reagan starting a national conversation about AIDS, when she did the opposite, reveals Clinton’s unwillingness to admit mistakes, even when she is proven to be wrong.\\nThe subject of the meeting is described as “the difference between our contiguous universe nonviolent ETI and the celestials in our own universe.” \\nThe team go back on forth on Clinton’s statement about the issue. “YESTERDAY I MADE A MISTAKE IN SPEAKING ABOUT NANCY REAGAN’S record on HIV AND AIDS,” it begins.\\n“I think the chances of her OK-ing this statement with that top are slim,” Megan Rooney says.\\n“Here is a revised draft of a statement. It does include the words ‘I made a mistake’ in the first line,” Rooney says. “We need a strategy for getting her to approve this. I don’t know if that means someone who is traveling with her (Maya?) making the case… or something else.” \\nA later draft was then sent, changing it to, “I said something inaccurate when speaking about the Reagan’s’ record on HIV and AIDS.” \\n“The Secretary approved the statement, with small tweaks,” Rooney says.\\nExtraterrestrial disclosure \\nFormer astronaut Edgar Mitchell, known for his correspondence with Podesta regarding extraterrestrials, emails Podesta regarding the “Phoenix Lights” incident in 1997, in which thousands of people reported sightings of hovering lights in the sky.\\nMitchell “was on the phone just as they were happening over Phoenix with an eyewitness describing on March 13, 1997. This incentives about disclosure, while other reports like Roswell disincentives,” according to the mail from April 2015.\\nThe subject of extraterrestrial disclosure is “now more important than ever” according to another mail sent on Mitchell’s behalf a month later.\\n“It is also imperative that after your talk with Edgar, he then speak directly with President Obama via Skype for historical purposes, about the same issue, while the President is still in office,” Podesta is told. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by RT.com of RT.com . '"}, "time": 1742628510.1990726}