{"duration": 0.06315946578979492, "input_args": {"text": "'TULSA, Okla.  —   On a particularly windy day in the Crutchfield neighborhood here, the writer S. E. Hinton was touring the renovations of the future Outsiders House museum. The rundown Craftsman bungalow was where the Curtis brothers  —   Darry, Sodapop and Ponyboy  —   lived in the 1983 Francis Ford Coppola movie based on Ms. Hinton’s book “The Outsiders. ” The book, which celebrates its 50th anniversary this month, was arguably one of the most influential young adult books of its time, and leading this tour was the   fanboy Danny O’Connor, 48, who made his own contribution to   history as a member of the 1990s   group House of Pain. Mr. O’Connor, who lives in Beverly Hills, Calif. bought the Outsiders House for $15, 000 in 2016, determined to turn it into a museum. During the recent tour, Mr. O’Connor was showing Ms. Hinton a   hard cover of “The Outsiders,” pointing out a wide paper sash wrapped around the jacket that read in bright orange, “A remarkable novel about teenagers, for teenagers, by a teenager. ” Mr. O’Connor has been on a quest to find artifacts to include in the museum, amassing a collection of memorabilia from the movie, vintage photographs and    editions of the book. Next on his search list, he told Ms. Hinton, 68, was a   tub like the one    Rob Lowe (Sodapop Curtis in the movie) stepped out of with just a towel wrapped around his waist. “All the girls love that scene,” Mr. O’Connor said. No matter that the book is 50 years old, or that the movie was filmed in this part of town more than three decades ago. Once you’re a fan of “The Outsiders,” you’re always a fan of “The Outsiders,” which is why when Mr. O’Connor posted about the tub on Facebook, it was shared over 220 times. Soon there will be a tub. Since “The Outsiders” was first published in 1967, over 15 million copies have been sold. It is a constant on   and   reading lists and has been translated into 30 languages. Fanfiction. net counts 8, 100 stories based on the book. The hashtag #staygold, which is inspired by a Robert Frost poem that appears in the book, is attached to more than 300, 000 Instagram posts. Search the internet for “stay gold” and you’ll find both the name of a cafe on the Jersey Shore and a Swedish rock band’s debut album. Ms. Hinton fields daily questions on Twitter from fans who ask, “What do you think when people say ‘Stay golden’ instead of ‘Stay gold’?” (Answer: It makes her cringe.) That “The Outsiders” has permeated the culture so deeply is still somewhat surreal to even Ms. Hinton. “The rest of my books I wrote, but ‘The Outsiders’ was meant to be written. I got chosen to write it,” she said. “That’s the only way I can deal with it. ” Ms. Hinton, who still lives in Tulsa, goes by Susie. In 1966, Ms. Hinton’s editor, Velma Varner, suggested she use her   initials out of concern that her given name, Susan Hinton, would “throw some of the boy readers off. ” She continued to use the initials, even in more recent publications. When Ms. Hinton was 16, after failing creative writing in her junior year of high school, she wrote “The Outsiders. ” The teacher who failed her was not happy that Ms. Hinton liked to mention this in every interview. She sold the book when she was 17. It was published when she turned 18. It has, quite literally, always been part of her life. For Ms. Hinton, the book is something of a time capsule of her own emotionally driven teenage angst. “I think that’s why it still resonates with teens, because they feel like that,” she said. “Your feelings are over the top. You’re feeling and seeing injustice, and you’re standing up against it. ” In “The Outsiders,” justice comes by way of class warfare between the greasers, a gang of poor teenage boys, and the Socs, the rich kids from the other side of town. What may be most remarkable about the greasers is their ability to show great affection and emotion despite the   cultural norm of the 1960s. In almost every chapter, someone is crying or on the verge of tears. “You’d be   to find a book where boys are this emotional,” said Daniel Kraus, books for youth editor at Booklist, a review magazine published by the American Library Association. “They’re crying, they’re embracing, they’re holding each other in bed. ” This adds to the greaser mythology, Mr. Kraus said. Jennifer Buehler, an English education professor at St. Louis University, believes that the greasers’ experience, and their need to be seen as human, is similar to what many marginalized groups today are also trying to claim. “The fact that the character development is so strong in this book plays a crucial part in its power and its enduring relevance,” she said. While Professor Buehler believes other factors contribute to the book’s endurance  —   the universal title and the seemingly genderless author  —   she credits librarians and teachers for supporting the book from the start. In 1988, an influential award further cemented the canonical status of the book, she said, when it received the first Margaret A. Edwards Award for lifetime achievement in writing for young adults. “So even though ‘The Outsiders’ was 21 years old, and the movie had some life, there’s something about that literary award from the world of librarians and library service that helped teachers along their way. ” For fans, it seems, the book’s longevity is based on its relationships. Recently, the connection between Johnny Cade and Dallas Winston spawned a subset of fan fiction called slash, in which two male (or two female) characters are involved romantically. Some fans on Twitter in October became confrontational when Ms. Hinton disagreed with their interpretation that the relationship between Johnny and Dallas was a romantic one. “I have no problem with anyone interpreting my books anyway they want,” Ms. Hinton said. “But I’m getting these letters that are, ‘Just say you wrote it gay and I’ll be satisfied.’ Well, your satisfaction isn’t at the top of my priorities. Fifteen years old in Tulsa, Okla? The word was not even in common use. So, no. ” It’s possible that this new shift is simply an additional sign that “The Outsiders” continues to influence young readers. That after five decades, it shows no indication of becoming dated. “I’m as amazed as anybody else that it’s lasted as long,” Ms. Hinton said. “So many people say to me after reading it, ‘I’m looking at people differently now than I used to,’” she said. “Let’s all quit judging each other. ”'"}, "time": 1742628533.902561}