{"duration": 0.16557002067565918, "input_args": {"text": "'In the winding hallways and stuffy rooms of an old factory in Brooklyn, under bulbs flickering as if in a horror movie, an elite new police unit prepares, over and over again, for the attack it knows is coming. Day after day, the officers comb the highest floor of the building, looking for witnesses to point them to the right door and listening for gunshots like those that have echoed all over the world in recent months. They are conducting exercises to help them hunt down an “active shooter. ” “It’s going to happen,” said Chief James R. Waters, who leads the New York Police Department’s Counterterrorism Bureau. “Something like Orlando’s going to happen. ” Last year, the police announced the creation of a heavily armed and armored regiment called the Critical Response Command. Teams of officers work all over the city and are trained to respond to many locations in three to five minutes. They represent a new response to a new threat. Gone are the days when the first officers on a scene set up a perimeter and waited for backup or a   team. The perpetrators of the most recent wave of mass shootings around the world  —   Paris San Bernardino, Calif. Orlando, Fla.  —   were not interested in taking hostages and negotiating. They came to kill for the sake of killing. And these officers are trained to find and stop them. On Thursday, Chief Waters allowed journalists from The New York Times to watch the Critical Response Command train. “This is seven months of work,” he said, standing before a team of officers in bulletproof vests who were cradling Colt M4 semiautomatic rifles. “It’s incredible progress. ” The officers were practicing in a former pharmaceutical factory on Flushing Avenue in the Fort Greene neighborhood. The Police Department is not listed among the building’s tenants, but it has worked there since before the command’s creation. The journalists were allowed to observe the exercises under restrictions. A photographer and videographer were forbidden to document the command as it moved in drills, and a reporter was asked to describe the tactics only in broad strokes. Department leaders believe terrorists study descriptions of police training in preparation for attacks. “The perpetrators in France demonstrated a familiarity with the French response,” Deputy Chief Scott Shanley said, referring to the coordinated attacks in Paris that killed more than 130 people in November. The officers, who also played the roles of gunmen and bystanders, conducted two exercises. The first began with a dispatcher’s call: shots fired in the building. Officers in a patrol car would typically be the first to respond in this situation, and that was the case in the drill. Two officers, clutching pistols, entered the hallway, crouching, one in front and the other behind him with a hand on the first officer’s back. Officers in the command do not know the details of an exercise beforehand. Suddenly, a man ran toward them, screaming for help. The officers ordered him to his knees and asked about the gunman the man pointed down the hall. The officers hurried around a corner. Gunfire rang out. “Shots fired!” the rear officer shouted into his radio, and the pair ran to the sound. A masked gunman, wearing green fatigues in a room with cubicles, opened fire. The officers fired back. Rounds with a chalklike substance, similar to paintballs, struck the gunman. He fell to the floor. The rear officer shouted “Loading! Loading! Loading!” and ejected a spent magazine from his pistol, sliding in a new one. The other officer bent and took the gunman’s pulse. Dead. They called for backup and waited. What followed was an extraordinary show of paramilitary precision and force. New Yorkers have grown accustomed to seeing heavily armed officers standing in subway stations and at city landmarks. They have not seen what journalists were allowed to see on Thursday  —   a response to an   scene from within the scene itself. The door through which the first responding officers had entered crept open again, and a head popped out. Then the entire team emerged, six officers in this case, moving fast in single file, each touching the back of the man before him. They seemed to move as a single organism, like a long black snake darting across the hall to the closest door. There was no hesitation at the door, no peeking inside. The officers burst through and moved in different directions. “A dynamic entry,” Capt. Eugene McCarthy said, watching. “The perpetrator’s processing is disrupted by dynamic entry,” Deputy Chief John O’Connell said, standing beside him. To demonstrate, the command later allowed journalists to stand in an empty room and wait for the team to enter. The silence was startling, unnerving. The officers did not speak as they snaked toward the room. They communicated in pats on the back and hand signals. There was no warning of their arrival. One moment, the room was empty. A heartbeat later, it was filled with the six men and their guns. Traditionally, when officers stormed a room, the first one was known as the “rabbit,” likely drawing the fire of the gunman inside while the second officer took aim at him. With this team, it was as if there were no rabbit  —   the entire team seemed to swarm the room at once. In the exercise, the team joined the first two officers near the dead gunman, until they all heard more gunfire down the hall. The team regrouped into its line and raced toward the shots. The officer in front fired at a gunman, and others behind him stepped out of the line and did the same, and in what seemed like a second, that gunman was down and the drill over. The officers pulled off their helmets, sweating after minutes of intense action. Captain McCarthy stepped forward and ran through a quick review. The officer who played the second gunman praised the speed and accuracy of the officers who shot him. “No    issues,” he said. “Good job. ” An officer who played a victim, with fake blood on his leg, said: “No shots on me. Good job. ” The officers switched roles and prepared to do it again, the details of the drill different this time. The strategy, though, was constant. “Move to the shooter,” Chief Waters said. “You’ll hear it 50 times. Move to the shooter. It’s got to be ingrained. Like muscle memory. ” The Critical Response Command is made up of 525 handpicked officers and superiors who applied and were chosen after a screening process that included   interviews with Chief Waters and others. Their training must override lifelong human instinct. “It goes against all their upbringing,” Chief Waters said. “They have to walk past and run past victims on the ground. Kids crying. They’re grabbing at your legs. ” The training is always evolving with world events. The command recently introduced suicide belts into exercises. Chief Waters declined to elaborate. The visit on Thursday concluded with directions through more hallways to the elevator. There, waiting, one could hear, from behind, more gunfire.'"}, "time": 1742561689.1506653}