{"duration": 0.18567156791687012, "input_args": {"text": "\"Email \\nThis exceptionally enervating election is almost over but its political and social implications will last into the future, even if, as expected, Donald Trump loses to Hillary Clinton. \\nThe conditions that created this shocking national event will continue regardless. “Trumpism,” if not the disgraceful Trump himself, will remain part of the Republican party — and, of course, he still has a slight chance of winning. Clinton, for her part, has some dangerous goals in the Middle East and toward Russia and China \\nBoth the successful uprising in the far right Republican party and the failed but nearly successful liberal uprising in the center-right Democratic party shocked the ruling establishments of both organizations. Who guessed the American people were so upset with the status quo? The government had mentioned nothing about it beforehand. The two parties had said and evidently knew nothing. The corporate mass media was silent. \\nThose to the left of the Democratic party were surprised as well but they had long been publicly critical of the conditions that finally drove much of the predominantly white working class and sectors of the poor, middle class and millennials to demand a new deal from their respective two political associations. \\nThe biggest cause is a capitalist economic system that privileges the top 10% at the expense of the bottom 90%, particularly those in the lower 70%. A lesser but real factor is America’s continual warfare. Why else does the white working class behind Trump tolerate his call for peace with Russia as Clinton becomes ever more threatening to Moscow? Another cause is the extreme dislike of Clinton by Republicans that allows misogynist Trump to treat so outrageously the first woman presidential candidate of a major party. \\nFor 40 years the U.S. working class has increasingly experienced lower wages and benefits as well as fewer jobs at all due to the free trade and neoliberal policies of the ruling class and its business component. Hardest hit are workers without a college education or worst of all those who did not graduate from high school. This writer is old enough to remember when white students who left high school at 16 without a diploma were employed fairly quickly, and when they were fired got another job I also know young college graduates today (with large student debts) in low paying retail or other jobs no matter how energetically they seek more remunerative positions. \\nWhite Anger \\nVarious studies indicate that the white working class is especially disturbed by the lack of jobs and better pay. An article titled “The Great White Nope” by Jefferson Cowie in the (November-December) issue of Foreign Affairs notes: \\n“…. According to a recent analysis published by the Brookings Institution, poor Hispanics are almost a third more likely than their white counterparts to imagine a better future. And poor African Americans — who face far higher rates of incarceration and unemployment and who fall victim far more frequently to both violent crime and police brutality — are nearly three times as optimistic as poor whites. Carol Graham, the economist who oversaw the analysis, concluded that poor whites suffer less from direct material deprivation than from the intangible but profound problems of ‘unhappiness, stress, and lack of hope….’ \\n“A stunning U-turn in the fortunes of poor and working-class whites began in the 1970s, as deindustrialization, automation, globalization, and the growth of the high-technology and service sectors transformed the U.S. economy. In the decades since, many blue-collar jobs have vanished, wages have stagnated for less educated Americans, wealth has accumulated at the top of the economic food chain, and social mobility has become vastly harder to achieve. \\n“Technological and financial innovations have fostered economic and social vitality in urban centers on the coasts. But those changes have brought far fewer benefits to the formerly industrial South and Midwest. As economic decline has hollowed out civic life and the national political conversation has focused on other issues, many people in ‘flyover country’ have sought solace in opioids and methamphetamine; some have lashed out by embracing white nationalist rage. As whites come closer to becoming a plurality in the United States (or a “white minority,” in more paranoid terms), many have become receptive to nativist or bigoted appeals and thinly veiled promises to protect their endangered racial privilege: think of Trump’s promise to build a wall on the U.S.-Mexican border and his invocation of an unspecified bygone era when the United States was ‘great,’ which many white Trump supporters seem to understand as a reference to a time when they felt themselves to be more firmly at the center of civic and economic life.” \\nTrump And Russia \\nTrump has said he wants to create a better relationship between the U.S. and Russia, and that as president he would engage President Vladimir Putin about this matter. He has also remarked that there is no proof yet that that the Russian government is responsible for hacking a Democratic party computer and that of John Podesta, Clinton’s campaign chairman. Both included some embarrassing Emails from Clinton that were distributed by WikiLeaks, including the contents of her “secret” speeches to Wall Street and other venues. \\nI agree with Trump on the matter of improving relations with Russia (although there is no telling what a Trump presidency would actually do — and a reversal is hardly impossible for such a an individual) and the lack of proof that the Russian government hacked the Emails. \\nAnti-Russia Clinton \\nThe Clinton campaign has turned Trump’s comments on Russia into its main target. On Oct.20, the day after the third and last debate, the New York Times reported that if she wins the election “she will enter the White House with the most contentious relationship with Russia of any president in more than three decades, and with a visceral, personal animus toward Vladimir V. Putin, its leader…. In a reversal of political roles, Mrs. Clinton, the Democratic candidate, is the one portraying Mr. Putin as America’s newest archenemy…. \\n“Much of the Democratic foreign policy establishment has become as hawkish as Mrs. Clinton on the subject of Russia, a view that seems almost certain to outlast the campaign. Privately, some of her longtime advisers are already thinking about what mix of sanctions, diplomatic isolation and international condemnation they might put together if they take office to deal with Mr. Putin and the fragile economic state he runs, an update of the ‘containment’ strategy that George F. Kennan formulated for President Harry S. Truman in 1947.” \\nThat strategy was the basis of the Cold War. Who wants a new Cold War — this time between two capitalist countries with massive arsenals of nuclear weapons? And we suspect that Clinton’s real goal is regime change in Moscow. \\nIn general Clinton is recognized as a war hawk. As secretary of state she argued with President Obama about taking greater military action against the government of Syria and conviced him to bomb and invade Libya. She plans to be tougher on both Russia and China. \\nRegarding the allegations of Russian hacking, Nation contributing editor Stephen F. Cohen, a longtime Russia expert, said Oct. 18: “In fact no actual evidence for this allegation has been produced, only suppositions or, as Glenn Greenwald has argued, ‘unproven assertions.'” \\nHe noted that MIT expert, Professor Theodore Postol, has written that there is “no technical way that the U.S. intelligence community could know who did the hacking if it was done by sophisticated nation-state actors.” \\nCohen suggested, “the charges, leveled daily by the Clinton campaign as part of its ‘McCarthyite Kremlin-baiting’ of Donald Trump, are mostly political.” He also pointed out it is far from clear that the Kremlin actually favors Trump, despite Clinton’s campaign claims.” \\nTrump’s Disgraceful Campaign \\nTrump’s campaign has been the most disgraceful in U.S. history, replete with climate change denial, outrageous conspiracy theories, allegations against Muslims and Mexicans, frequent lies, outright racism, America-first nationalism, distrust of immigrants, false accusations of ballot rigging and extreme contempt toward his opponent, among other failings. It finally took a video of Trump bragging about his of sexual harassment of women to do him in. \\nIf Clinton wins, it will be an advance for the United States to finally elect a woman president. She remains a powerful part of the anti-liberal Democratic center right wing and a servant of Wall Street but has pledged to fight for some of the liberal policies advocated by her primary rival Sen. Bernie Sanders. She did so to defeat him, of course, and her efforts in this case will be superficial. \\nA Clinton presidency will be haunted by the Republican party and by defeated Trump and his constituency of millions of fanatics who think “crooked Hillary” belongs in prison. \\nMuch depends on the composition of the post-election Congress. It’s doubtful the Democrats can win the House given the large number of gerrymandered GOP seats — a product of Republican control of so many state legislatures. . But there is a possibility Democrats will gain a majority in the Senate. This will make a difference in terms of the Supreme Court and other matters that do not require House approval. If both houses of Congress remain in the hands of the right wing very little can be done \\nAssuming Trump is defeated, the temporarily displaced Republican leadership will largely return to power after making concessions to his devoted followers. After that it’s probably going to be total war against the Clinton government for the next four years, even worse than the GOP’s sabotage during the nearly eight years of gridlocked Obama’s leadership.\""}, "time": 1742563890.6324997}