{"duration": 0.029529809951782227, "input_args": {"text": "'According the Democratic vice-presidential nominee, white people need to experience the kind “oppression” that black people have experienced before Americans can truly be equal. The cat is out of the bag. \\nVia TruthAndAction \\n\\nMany who believed that all of these movements and protests started by Black Lives Matter, the New Black Panthers and their supporters aren’t about equality at all, they’re about racial superiority, specifically over white people. In fact, if you look up “racism” in the dictionary, it’s basically defined as one race seeking racial superiority.\\nVideo Evidence Below. While speaking to a group of baptists in New Orleans, Tim Kaine suggested that in order to achieve equality between races, white people must willingly submit themselves to a state of repression. What exactly is he talking about exactly? Nobody will deny that slavery and the acts that followed were atrocious, but like it’s been asked many times, what right does anybody have to claim offense at acts they weren’t alive to be offended by?\\nWhy can’t anybody see that this kind of policy isn’t going to bridge the racial divide, it’s only going to make it bigger. It’s this type of thinking, created by the Obama Administration, that got us here in the first place. Not to mention that these types of policies are bad even for white democrats.\\nThese are the types of politics being put into place by democrats and the left as a whole. The sad thing about it is that what black people don’t realize is that these policies only sound good to them because it puts down white people. However, it doesn’t really do anything for them except make them dependent on the government. We’re all hamsters to them, looking for pellets.\\nThe ever-increasing rate at which good-paying, blue-collar jobs are being off-shored by bad trade deals — something to which the modern Democratic Party appears committed fully — will continue to have a devastating effect on working-class white communities. The disproportionately negative effect globalization has had on blue-collar whites was a large factor in GOP nominee Donald Trump’s success in the GOP primaries.\\nMoreover, this destruction of the middle American economy is having very real, very negative effects on white Americans. “Something startling is happening to middle-aged white Americans,” The New York Times reported in 2015. “Unlike every other age group, unlike every other racial and ethnic group, unlike their counterparts in other rich countries, death rates in this group have been rising, not falling.”\\nSome of the Democratic Party’s favorite progressive policies — like affirmative action — are directly and openly discriminatory against white Americans. Moreover, the Supreme Court’s decision this summer in Fisher v. University of Texas gave legal sanction to this obvious form of anti-white discrimination.\\nThen there’s the Democratic Party’s stringent support for open borders and mass non-white migration, which is quite literally turning white Americans into a minority in the country their own ancestors built. White Americans are already a minority among school-aged children, and will be a nationwide minority by 2050, according to predictions by the Census Bureau.\\nAccording to democrats, resistance to their cause is rooted in racism and a desire to protect “white-privilege”. If anybody really took the time to think about it, they’d know that that’s racism in itself, trying to breathe life into a myth. The left wants that racist curtain to continue to divide Americans down the middle by making one race look like monsters, mainly white people. This is a toxic form of politics, and will lead to America’s downfall, should it be allowed to continue. This will be Hillary’s America.\\n'"}, "time": 1742628484.1360517}