{"duration": 0.1892073154449463, "input_args": {"text": "'| October 28, 2016 Be Sociable, Share! Police arrest an elder in ceremonial garb who was praying near Cannon Ball, N.D. (Photo: Unicorn Riot/Creative Commons) \\nSTANDING ROCK SIOUX RESERVATION, North Dakota — Law enforcement commenced a violent crackdown on Native American activists blocking construction on the Dakota Access pipeline on Thursday, resulting in over 100 arrests and multiple injuries. \\nAt least 107 people were arrested and both Native American “water protectors” and members of the media were harmed when hundreds of militarized riot police, accompanied by armored vehicles and the National Guard, stormed a blockade on North Dakota Highway 1806 and an accompanying encampment. \\nAmong the injured was Derrick Broze , an independent journalist reporting for MintPress News from the Standing Rock Sioux reservation this week. He was shot with pepper spray and shocked with a “less-lethal” taser. Police also took his smartphone, which he had been using to document the day’s events via Facebook Live. \\n“Today was filled with tense moments as the Morton County Sheriff’s Department and other law enforcement moved to destroy the frontline camp in a militarized fashion,” Broze told MintPress News, using a borrowed smartphone. He continued: “The water protectors chose to set fire to several barricades on [county road] 134 and [North Dakota Highway] 1806 in an attempt to hold their line. Despite identifying as press several times, the police tasered and pepper sprayed myself and several others.” http://www.mintpressnews.com/wp-content/uploads/2016/10/Broze-Standing-Rock-2.mp4 \\nTwo members of Unicorn Riot, an independent media collective, were also attacked by police, and Native American livestreamers reported being hit by rubber bullets. Report from the frontlines of the police suppression of #NoDAPL water protectors. @HennepinSheriff \\'s beating & macing ppl (incl our journos) pic.twitter.com/mop4pZQQwO \\n— Unicorn Riot (@UR_Ninja) October 27, 2016 \\nPolice claim that one of the arrests came after a woman fired a gun at police , but the water protectors continue to insist that they’ve remained nonviolent and unarmed throughout their months of activism. UPDATE: Police confirm \"one woman has been arrested for firing a weapon at the police line near Highway 1806.\" #DAPL https://t.co/10gbqmvS0e pic.twitter.com/YZvlwsUj0Y \\n— RT America (@RT_America) October 28, 2016 \\nIn addition to pepper spray and stun guns, law enforcement used rubber bullets and an LRAD “sound cannon” on the assembled activists, which can cause permanent hearing damage at close range. An activist posted a picture of severe facial bruising reportedly caused by a rubber bullet. Other injuries of varying severity were reported via social media and confirmed by sources at the scene. Broken ribs head injures broken arms wrists leg injuries shrapnel wounds many youths brutalized as well as elders \\n— Thunder Walks About (@notaxiwarrior) October 27, 2016 \\nLaw enforcement agencies at the scene included representatives of the Morton County Sheriff’s Department, as well as reinforcements from the Hennepin County Sheriff’s Department, a Minneapolis-area force which continues to assist in North Dakota despite a rally at Minneapolis City Hall on Tuesday demanding their withdrawal from the state. #nodapl protest at Minneapolis city hall pic.twitter.com/gdrL5YjUeY \\n— Fibonacci Blue (@FibonacciBlue) October 25, 2016 \\nConstruction on the pipeline continued throughout the day, and is reportedly rapidly nearing completion. As police move-in w LRAD & hyper-militarized forces, #DakotaAccessPipeline construction continues unabated, nears sacred sites. #NoDAPL pic.twitter.com/egKhilg4NE \\n— Unicorn Riot (@UR_Ninja) October 27, 2016 \\n“This is modern-day genocide against my people,” Wiyaka Eagleman, a Native American citizen journalist, said while broadcasting the events on Facebook live . Live feeds of the police raid frequently cut out, and on-the-ground sources reported that cellular phone signals appeared to be jammed. Often reported by journalists and activists at protests, cell-jamming by police is technically possible but remains unproven . \"This is modern day genocide to my people,\" declares Native livestreamer as #police attack water protectors. https://t.co/Tlfp20uZnI #NoDAPL \\n— Kit O\\'Connell (@KitOConnell) October 27, 2016 \\nBroze reported that a group of buffalo, herded by Native riders, stampeded toward police. Police fired on the horses and their riders, reportedly injuring some of each. Cops assaulting water protectors @ Standing Rock boy shot off horse and Atsa E\\'sha Hoferer himself shot | #NoDAPL https://t.co/e0aT0NoSUX \\nOver the weekend and throughout the beginning of the week, Native activists had expanded their encampments from Standing Rock Sioux territory onto land claimed by the company behind the Dakota Access pipeline, Energy Transfer Partners . The water protectors, however, claim that the land belongs to the Sioux under the terms of an 1851 treaty . The new encampments also bordered on a sacred burial ground where Dakota Access pipeline security personnel used attack dogs on activists on Labor Day. \\nBy Thursday evening, police, security and National Guard had completely overrun the region, pushing water protectors back onto the reservation and onto land claimed by the U.S. Army Corps of Engineers. \\nIn one of the most disturbing reports, confirmed by Broze and social media reports, a Dakota Access pipeline security guard reportedly drove his truck onto tribal lands, threatening to run down protesters, then brandished what appeared to be an AR-15 assault rifle in the Oceti Sakowin camp. A source in the camp told MintPress that the situation was eventually de-escalated by police under the Bureau of Indian Affairs. My friends on scene say this is the civilian who almost ran down at least 30 Natives with a car. It\\'s open season on our people. #NoDAPL pic.twitter.com/W2lWyZlYAn \\n— Kelly Hayes (@MsKellyMHayes) October 27, 2016 \\nTeepees, a sweat lodge, and other sacred items were also destroyed by police. \\n“Police showed no respect for the native people or their culture,” Broze said. http://www.mintpressnews.com/wp-content/uploads/2016/10/Broze-Standing-Rock.mp4 \\nAs night set in, the situation appeared to be escalating further. Broze reported : “Riot police have raided resistance camps and are still firing tear gas at protesters north of Red Warrior camp on 1806. Protesters have set an SUV on fire as a barricade on the bridge there. They are also setting the bridge on fire.” Be Sociable, Share!'"}, "time": 1742563708.3271549}