{"duration": 0.21072101593017578, "input_args": {"text": "\". A Government of Scoundrels, Spies, Thieves, Ruffians, Rapists and Killers “There is nothing more dangerous than a government of the many controlled by the few.”— Lawrence Le... Print Email http://humansarefree.com/2016/11/a-government-of-scoundrels-spies.html “There is nothing more dangerous than a government of the many controlled by the few.”— Lawrence Lessig, Harvard law professor The U.S. government remains the greatest threat to our freedoms. The systemic violence being perpetrated by agents of the government has done more collective harm to the American people and our liberties than any single act of terror. More than terrorism, more than domestic extremism, more than gun violence and organized crime, the U.S. government has become a greater menace to the life, liberty and property of its citizens than any of the so-called dangers from which the government claims to protect us. Image: They Live film This is how tyranny rises and freedom falls. As I explain in my book Battlefield America: The War on the American People , when the government views itself as superior to the citizenry, when it no longer operates for the benefit of the people, when the people are no longer able to peacefully reform their government, when government officials cease to act like public servants, when elected officials no longer represent the will of the people, when the government routinely violates the rights of the people and perpetrates more violence against the citizenry than the criminal class, when government spending is unaccountable and unaccounted for, when the judiciary act as courts of order rather than justice, and when the government is no longer bound by the laws of the Constitution, then you no longer have a government “of the people, by the people and for the people.” What we have is a government of wolves . Worse than that, we are now being ruled by a government of scoundrels, spies, thugs, thieves, gangsters, ruffians, rapists, extortionists, bounty hunters, battle-ready warriors and cold-blooded killers who communicate using a language of force and oppression. Does the government pose a danger to you and your loved ones? The facts speak for themselves. We’re being held at gunpoint by a government of soldiers — a standing army. While Americans are being made to jump through an increasing number of hoops in order to exercise their Second Amendment right to own a gun, the government is arming its own civilian employees to the hilt with guns, ammunition and military-style equipment, authorizing them to make arrests, and training them in military tactics. Among the agencies being supplied with night-vision equipment, body armor, hollow-point bullets, shotguns, drones, assault rifles and LP gas cannons are the Smithsonian, U.S. Mint, Health and Human Services, IRS , FDA, Small Business Administration, Social Security Administration, National Oceanic and Atmospheric Administration, Education Department, Energy Department, Bureau of Engraving and Printing and an assortment of public universities. There are now reportedly more bureaucratic (non-military) government civilians armed with high-tech, deadly weapons than U.S. Marines. That doesn’t even begin to touch on the government’s arsenal, the transformation of local police into extensions of the military, and the speed with which the nation could be locked down under martial law depending on the circumstances. Clearly, the government is preparing for war — and a civil war, at that — but who is the enemy? We’re being robbed blind by a government of thieves . Americans no longer have any real protection against government agents empowered to seize private property at will. For instance, police agencies under the guise of asset forfeiture laws are taking property based on little more than a suspicion of criminal activity. In one case, police seized $53,000 from the manager of a Christian rock band that was touring and raising money for an orphanage in Thailand. Despite finding no evidence of wrongdoing, police kept the money. Homeowners are losing their homes over nonpayment of taxes ( for as little as $400 owed ) and municipal bills such as water or sewer fees that amount to a fraction of what they have invested in their homes. And then there’s the Drug Enforcement Agency, which has been searching train and airline passengers and pocketing their cash , without ever charging them with a crime. We’re being taken advantage of by a government of scoundrels, idiots and cowards. American satirist H.L. Mencken calculated that “Congress consists of one-third, more or less, scoundrels; two-thirds, more or less, idiots; and three-thirds, more or less, poltroons.” By and large, Americans seem to agree . When you’ve got government representatives who spend a large chunk of their work hours fundraising , being feted by lobbyists, shuffling through a lucrative revolving door between public service and lobbying, and making themselves available to anyone with enough money to secure access to a congressional office , you’re in the clutches of a corrupt oligarchy . Mind you, these same elected officials rarely read the legislation they’re enacting, nor do they seem capable of enacting much legislation that actually helps rather than hinders the plight of the American citizen. We’re being locked up by a government of greedy jailers . We have become a carceral state , spending three times more on our prisons than on our schools and imprisoning close to a quarter of the world’s prisoners , despite the fact that crime is at an all-time low and the U.S. makes up only 5% of the world’s population. The Prison Industry in the United States: Big Business or a New Form of Slavery? Which is in contrast with... Netherlands is Closing 19 Prisons Because of Criminal Shortage . The rise of overcriminalization and profit-driven private prisons provides even greater incentives for locking up American citizens for such non-violent “crimes” as having an overgrown lawn . As the Boston Review points out, “America’s contemporary system of policing, courts, imprisonment, and parole … makes money through asset forfeiture, lucrative public contracts from private service providers, and by directly extracting revenue and unpaid labor from populations of color and the poor. In states and municipalities throughout the country, the criminal justice system defrays costs by forcing prisoners and their families to pay for punishment. It also allows private service providers to charge outrageous fees for everyday needs such as telephone calls. As a result people facing even minor criminal charges can easily find themselves trapped in a self-perpetuating cycle of debt, criminalization, and incarceration.” We’re being spied on by a government of Peeping Toms . The government is watching everything you do, reading everything you write, listening to everything you say, and monitoring everything you spend. This is George Orwell's 1984 on steroids. Omnipresent surveillance is paving the way for government programs that profile citizens, document their behavior and attempt to predict what they might do in the future, whether it’s what they might buy, what politician they might support, or what kinds of crimes they might commit . The impact of this far-reaching surveillance, according to Psychology Today, is “ reduced trust, increased conformity, and even diminished civic participation .” As technology analyst Jillian C. York concludes, “Mass surveillance without due process — whether undertaken by the government of Bahrain, Russia, the US, or anywhere in between — threatens to stifle and smother that dissent, leaving in its wake a populace cowed by fear .” We’re being ravaged by a government of ruffians, rapists and killers . It’s not just the police shootings of unarmed citizens that are worrisome. It’s the SWAT team raids gone wrong that are leaving innocent citizens wounded, children terrorized and family pets killed. For trying to run from the principal’s office . For, at the age of 12, getting into a fight with another girl . We’re being forced to surrender our freedoms — and those of our children — to a government of extortionists, money launderers and professional pirates . The American people have been repeatedly sold a bill of goods about how the government needs more money, more expansive powers, and more secrecy (secret courts, secret budgets , secret military campaigns, secret surveillance) in order to keep us safe. Under the guise of fighting its wars on terror, drugs and now domestic extremism, the government has spent billions in taxpayer dollars on endless wars that have not ended terrorism but merely sown the seeds of blowback, surveillance programs that have caught few terrorists while subjecting all Americans to a surveillance society, and militarized police that have done little to decrease crime while turning communities into warzones. Not surprisingly, the primary ones to benefit from these government exercises in legal money laundering have been the corporations, lobbyists and politicians who inflict them on a trusting public. Whatever else it may be — a danger, a menace, a threat — the U.S. government is certainly no friend to freedom. To our detriment, the criminal class that Mark Twain mockingly referred to as Congress has since expanded to include every government agency that feeds off the carcass of our once-constitutional republic. In fact, there’s a very good reason you don’t hear much in the way of specifics about the government’s tyranny from politicians: it’s because they can’t afford to upset the apple cart (i.e., jeopardize their posh lifestyles). So no matter which party wins the White House, controls Congress or appoints future Supreme Court justices, rest assured that the menace of the shadow government — the permanent, unelected bureaucracy that operates beyond the reach of the Constitution, the courts and the citizenry — will continue uninterrupted. Our backs are against the proverbial wall. The government and its cohorts have conspired to ensure that the only real recourse the American people have to express their displeasure with the government is through voting, which is no real recourse at all. The penalties for civil disobedience, whistleblowing and rebellion are severe. If you refuse to pay taxes for government programs you believe to be immoral or illegal, you will go to jail. If you attempt to overthrow the government — or any agency thereof — because you believe it has overstepped its reach, you will go to jail. If you attempt to blow the whistle on government misconduct, there’s a pretty good chance you will go to jail. For too long, the American people have been made to act like puppets dancing to a tyrant’s tune. We have obeyed the government’s dictates, no matter now extreme. We have paid its taxes, penalties and fines, no matter how outrageous. We have tolerated its indignities, insults and abuses, no matter how egregious. We have turned a blind eye to its indiscretions and incompetence, no matter how imprudent. We have held our silence in the face of its lawlessness, licentiousness and corruption, no matter how illicit. We have suffered. How long we will continue to suffer depends on how much we’re willing to give up for the sake of freedom. America’s founders provided us with a very specific explanation about the purpose of government and a roadmap for what to do when the government abuses its authority, ignores our objections, and establishes itself as a tyrant. We must choose between peaceful slavery (in other words, maintaining the status quo in servitude to the police state) and dangerous freedom . That will mean carving out a path in which we begin to take ownership of our government, starting at the local level, challenging the status quo, and raising hell whenever a government official steps out of line. By John W. Whitehead — Constitutional attorney and author John W. Whitehead is founder and president of The Rutherford Institute. His new book Battlefield America: The War on the American People . Whitehead can be contacted at johnw@rutherford.org. / Cover image: They Live . Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742562818.5308645}