{"duration": 0.1910114288330078, "input_args": {"text": "'You are here: Home / political cartoon / Most Devastating Man-Made Disasters in Human History [CARTOON] Most Devastating Man-Made Disasters in Human History [CARTOON] October 27, 2016 Pinterest \\nRegan Pifer writes that the problems with utopian leftist policies–err, visions–is that they are just that: utopian policies. \\nOnce they dismount their unicorn and stop eating their calorie-free cupcakes and talking to their centaur friends, they will realize their grand, utopian visions simply do not work. \\nThe most recent abysmal failure of the utopian Left, Obamacare, received another significant blow this past week. \\nAccording to International Business Times : \\nAt least 1.4 million people from 32 states could lose their health insurance under the Affordable Care Act, commonly known as Obamacare, as their plans are set to disappear from the program next year. They will have to find new coverage in a market that will likely have fewer options and higher prices, Bloomberg reported Friday. \\nThe coverage losses come after Aetna and UnitedHealth Group, as well as some regional insurers, announced they plan to leave Obamacare’s markets in 2017 and instead offer individual coverage outside of the program’s exchanges.That means there will be fewer, but more expensive, plans, and the same doctors and hospitals people used before may not be included under the Affordable Care Act, regulators and insurance customers told Bloomberg. \\nUtopian vision: healthcare for all. \\nReality: Americans are fined if they don’t have health insurance. If they do have health insurance through Obamacare, they could lose it. And, it wasn’t that good to begin with. \\nSee, that’s the problem. Liberals always think the plans will work. \\nThere will be no bumps, no issues. Where did my unicorn go? \\nBut as Aetna CEO Mark Bertolini explains, “providing affordable, high-quality health care options to consumers is not possible without a balanced risk pool” and many insurers agree–they’re “having trouble competing in Obamacare marketplaces and making money.” \\nIt is predicted that for the first time in three years, Obamacare enrollment will shrink in 2017. The potential 1.4 million that will lose their health care next year will have fewer and costlier options. \\nMichael F. Cannon, a health policy expert at the Cato Institute, summed it up nicely: “the ongoing and nationwide exodus of insurers is just the latest piece of evidence that Obamacare is a failed law built on false promises.” \\nI couldn’t have said it better myself.'"}, "time": 1742628416.2531123}