{"duration": 0.06008768081665039, "input_args": {"text": "'on October 27, 2016 2:53 am · \\nConservatives claim that voter ID is necessary to catch illegal voters, but it turns out they’re the only ones creating fake IDs to use on Election Day. \\nTrump supporters are taking Trump’s call to monitor polling places so seriously that they are creating fake ID badges in order to infiltrate polling locations across the country and intimidate voters by interrogating them, confusing them, and filming them — all of which are illegal. \\nBut, Trump’s deplorables are doing this in droves with the help of a right-wing group known as “Vote Protectors.” \\nThe group, which is affiliated with top Trump ally Roger Stone, is giving people the ability to intimidate voters on Election Day. They are literally teaching them to create their own fake badge, which is designed to give them access to voters both inside and outside the polling places where citizens cast their votes. \\nAccording to the Huffington Post , \\nStone’s group created an official-looking ID badge for its volunteers to wear, and its volunteers planned to videotape voters and conduct fake “exit polls,” efforts that election experts say risks intimidating and confusing voters. Or at least that’s what the group was planning to do before The Huffington Post asked Stone about it on Tuesday. The controversial Trump ally, long known for his bare-knuckled political tactics, said that key proposals on his group’s websites were there without his knowledge, and assured HuffPost that he would operate within the confines of election law. \\nIn fact, after HuffPo confronted Stone with evidence that these kinds of tactics were being pursued by the website, he acknowledged that Vote Protectors had a “bad idea” and “ordered them taken down.” \\nCampaign Legal Center deputy director Danielle Lang called the tactics a clear voter intimidation scheme. \\n“It’s inherently intimidating and an invasion of privacy,” she told HuffPo in reference to the videotaping. “When that’s being live streamed to the internet, it amplifies the potentially intimidating aspect of it, and violates a sense of security and privacy people have a right to enjoy at the polls. Objectively, intimidating voters is unlawful, no matter where you do it.” \\nIndeed, but that’s exactly what Donald Trump has been calling upon his supporters to do because he has repeatedly claimed that the election is rigged against him. \\nAs it turns out, he’s right about the election being rigged, only it’s conservatives who are trying to rig it in favor of Trump. \\nEarlier this week, a Wisconsin city clerk in Green Bay got caught trying to intentionally prevent college students from voting by arguing in an email to the Wisconsin Ethics Commission that an extra polling place should not be opened near the University of Wisconsin-Green Bay because she has merely heard that students lean Democrat. \\n“I was reading the statutes and read: No site may be designated that affords an advantage to any political party,” Republican appointed clerk Kris Teske wrote. \\n“UWGB is a polling location for students and residents on Election Day but I feel by asking for this to be the site for early voting is encouraging the students to vote more than benefiting the city as a whole. I have heard it said that students lean more toward the democrats and he is a democrat. I have spoken with our Chief of Staff and others at City Hall and they agree that budget wise this isn’t going to happen. I would like to know your thoughts on this. Do I have an argument about it being more of a benefit to the democrats.” \\nSo not only are Trump supporters trying to rig the election with voter intimidation tactics using hypocritical methods, they are using voter suppression tactics as well. \\nAnd that is likely going to cause a lot of Election Day chaos. Voters should be prepared to stand up for their right to vote no matter what Trump’s deplorables try to do to keep them from exercising it. \\nFeatured Image: Drew Angerer/Getty Images Share this Article! '"}, "time": 1742563378.4781253}