{"duration": 0.1609055995941162, "input_args": {"text": "'KIEV, Ukraine  —   On a leafy side street off Independence Square in Kiev is an office used for years by Donald J. Trump’s campaign chairman, Paul Manafort, when he consulted for Ukraine’s ruling political party. His furniture and personal items were still there as recently as May. And Mr. Manafort’s presence remains elsewhere here in the capital, where government investigators examining secret records have found his name, as well as companies he sought business with, as they try to untangle a corrupt network they say was used to loot Ukrainian assets and influence elections during the administration of Mr. Manafort’s main client, former President Viktor F. Yanukovych. Handwritten ledgers show $12. 7 million in undisclosed cash payments designated for Mr. Manafort from Mr. Yanukovych’s   political party from 2007 to 2012, according to Ukraine’s newly formed National   Bureau. Investigators assert that the disbursements were part of an illegal    system whose recipients also included election officials. In addition, criminal prosecutors are investigating a group of offshore shell companies that helped members of Mr. Yanukovych’s inner circle finance their lavish lifestyles, including a palatial presidential residence with a private zoo, golf course and tennis court. Among the hundreds of murky transactions these companies engaged in was an $18 million deal to sell Ukrainian cable television assets to a partnership put together by Mr. Manafort and a Russian oligarch, Oleg Deripaska, a close ally of President Vladimir V. Putin. Mr. Manafort’s involvement with moneyed interests in Russia and Ukraine had previously come to light. But as American relationships there become a rising issue in the presidential campaign  —   from Mr. Trump’s favorable statements about Mr. Putin and his annexation of Crimea to the suspected Russian hacking of Democrats’ emails  —   an examination of Mr. Manafort’s activities offers new details of how he mixed politics and business out of public view and benefited from powerful interests now under scrutiny by the new government in Kiev.   officials there say the payments earmarked for Mr. Manafort, previously unreported, are a focus of their investigation, though they have yet to determine if he actually received the cash. While Mr. Manafort is not a target in the separate inquiry of offshore activities, prosecutors say he must have realized the implications of his financial dealings. “He understood what was happening in Ukraine,” said Vitaliy Kasko, a former senior official with the general prosecutor’s office in Kiev. “It would have to be clear to any reasonable person that the Yanukovych clan, when it came to power, was engaged in corruption. ” Mr. Kasko added, “It’s impossible to imagine a person would look at this and think, ‘Everything is all right. ’” Mr. Manafort did not respond to interview requests or written questions from The New York Times. But his lawyer, Richard A. Hibey, said Mr. Manafort had not received “any such cash payments” described by the   officials. Mr. Hibey also disputed Mr. Kasko’s suggestion that Mr. Manafort might have countenanced corruption or been involved with people who took part in illegal activities. “These are suspicions, and probably heavily politically tinged ones,” said Mr. Hibey, a member of the Washington law firm Miller  Chevalier. “It is difficult to respect any kind of allegation of the sort being made here to smear someone when there is no proof and we deny there ever could be such proof. ” The developments in Ukraine underscore the risky nature of the international consulting that has been a staple of Mr. Manafort’s business since the 1980s, when he went to work for the Philippine dictator Ferdinand Marcos. Before joining Mr. Trump’s campaign this spring, Mr. Manafort’s most prominent recent client was Mr. Yanukovych, who  —   like Mr. Marcos  —   was deposed in a popular uprising. Before he fled to Russia two years ago, Mr. Yanukovych and his Party of Regions relied heavily on the advice of Mr. Manafort and his firm, who helped them win several elections. During that period, Mr. Manafort never registered as a foreign agent with the United States Justice Department  —   as required of those seeking to influence American policy on behalf of foreign clients  —   although one of his subcontractors did. It is unclear if Mr. Manafort’s activities necessitated registering. If they were limited to advising the Party of Regions in Ukraine, he probably would not have had to. But he also worked to burnish his client’s image in the West and helped Mr. Yanukovych’s administration draft a report defending its prosecution of his chief rival, Yulia V. Tymoshenko, in 2012. Whatever the case, absent a registration  —   which requires disclosure of how much the registrant is being paid and by whom  —   Mr. Manafort’s compensation has remained a mystery. However, a cache of documents discovered after the fall of Mr. Yanukovych’s government may provide some answers. The papers, known in Ukraine as the “black ledger,” are a   of Cyrillic covering about 400 pages taken from books once kept in a   room in the former Party of Regions headquarters on Lipskaya Street in Kiev. The room held two safes stuffed with $100 bills, said Taras V. Chornovil, a former party leader who was also a recipient of the money at times. He said in an interview that he had once received $10, 000 in a “wad of cash” for a trip to Europe. “This was our cash,” he said, adding that he had left the party in part over concerns about    activity. “They had it on the table, stacks of money, and they had lists of who to pay. ” The National   Bureau, which obtained the ledger, said in a statement that Mr. Manafort’s name appeared 22 times in the documents over five years, with payments totaling $12. 7 million. The purpose of the payments is not clear. Nor is the outcome, since the handwritten entries cannot be   against banking records, and the signatures for receipt have not yet been verified. “Paul Manafort is among those names on the list of   ‘black accounts of the Party of Regions,’ which the detectives of the National   Bureau of Ukraine are investigating,” the statement said. “We emphasize that the presence of P. Manafort’s name in the list does not mean that he actually got the money, because the signatures that appear in the column of recipients could belong to other people. ” The accounting records surfaced this year, when Serhiy A. Leshchenko, a member of Parliament who said he had received a partial copy from a source he did not identify, published line items covering six months of outlays in 2012 totaling $66 million. In an interview, Mr. Leshchenko said another source had provided the entire multiyear ledger to Viktor M. Trepak, a former deputy director of the domestic intelligence agency of Ukraine, the S. B. U. who passed it to the National   Bureau. The bureau, whose government funding is mandated under American and European Union aid programs and which has an   agreement with the F. B. I. has investigatory powers but cannot indict suspects. Only if it passes its findings to prosecutors  —   which has not happened with Mr. Manafort  —   does a subject of its inquiry become part of a criminal case. Individual disbursements reflected in the ledgers ranged from a few hundred dollars to millions of dollars. Of the records released from 2012, one shows a payment of $67, 000 for a watch and another of $8. 4 million to the owner of an advertising agency for campaign work for the party before elections that year. “It’s a very vivid example of how political parties are financed in Ukraine,” said Daria N. Kaleniuk, the executive director of the   Action Center in Kiev. “It represents the very dirty cash economy in Ukraine. ” While working in Ukraine, Mr. Manafort had also positioned himself to profit from business deals that benefited from connections he had gained through his political consulting. One of them, according to court filings, involved a network of offshore companies that government investigators and independent journalists in Ukraine have said was used to launder public money and assets purportedly stolen by cronies of the government. The network comprised shell companies whose ultimate owners were shielded by the secrecy laws of the offshore jurisdictions where they were registered, including the British Virgin Islands, Belize and the Seychelles. In a recent interview, Serhiy V. Gorbatyuk, Ukraine’s special prosecutor for   corruption cases, pointed to an open file on his desk containing paperwork for one of the shell companies, Milltown Corporate Services Ltd. which played a central role in the state’s purchase of two oil derricks for $785 million, or about double what they were said to be worth. “This,” he said, “was an offshore used often by Mr. Yanukovych’s entourage. ” The role of the offshore companies in business dealings involving Mr. Manafort came to light because of court filings in the Cayman Islands and in a federal court in Virginia related to an investment fund, Pericles Emerging Markets. Mr. Manafort and several partners started the fund in 2007, and its major backer was Mr. Deripaska, the Russian mogul, to whom the State Department has refused to issue a visa, apparently because of allegations linking him to Russian organized crime, a charge he has denied. Mr. Deripaska agreed to commit as much as $100 million to Pericles so it could buy assets in Ukraine and Eastern Europe, including a regional cable television and communications company called Black Sea Cable. But corporate records and court filings show that it was hardly a straightforward transaction. The Black Sea Cable assets were controlled by a rotating cast of offshore companies that led back to the Yanukovych network, including, at various times, Milltown Corporate Services and two other companies well known to law enforcement officials, Monohold A. G. and Intrahold A. G. Those two companies won inflated contracts with a   agricultural company, and also acquired a business center in Kiev with a helicopter pad on the roof that would ease Mr. Yanukovych’s commute from his country estate to the presidential offices. Mr. Deripaska would later say he invested $18. 9 million in Pericles in 2008 to complete the acquisition of Black Sea Cable. But the planned purchase  —   including the question of who ended up with the Black Sea assets  —   has since become the subject of a dispute between Mr. Deripaska and Mr. Manafort. In 2014, Mr. Deripaska filed a legal action in a Cayman Islands court seeking to recover his investment in Pericles, which is now defunct. He also said he had paid about $7. 3 million in management fees to the fund over two years. Mr. Deripaska did not respond to requests for comment. Mr. Manafort’s lawyer, Mr. Hibey, disputed the account of the Black Sea Cable deal contained in Mr. Deripaska’s Cayman filings, and said the Russian oligarch had overseen details of the final transaction involving the acquisition. He denied that Mr. Manafort had received management fees from Pericles during its operation, but said that one of Mr. Manafort’s partners, Rick Gates, who is also working on the Trump campaign, had received a “nominal” sum. Court papers indicate that Pericles’ only deal involved Black Sea Cable. Mr. Manafort continued working in Ukraine after the demise of Mr. Yanukovych’s government, helping allies of the ousted president and others form a political bloc that opposed the new   administration. Some of his aides were in Ukraine as recently as this year, and Ukrainian company records give no indication that Mr. Manafort has formally dissolved the local branch of his company, Davis Manafort International, directed by a longtime assistant, Konstantin V. Kilimnik. At Mr. Manafort’s old office on Sofiivska Street, new tenants said they had discovered several curiosities apparently left behind, including a knee   signed by Mr. Yanukovych, possibly referring to tennis matches played between Mr. Manafort and Mr. Yanukovych, who had spoken publicly of a knee ailment affecting his game. There was another item with Mr. Yanukovych’s autograph: a piece of white paper bearing a rough sketch of Independence Square, the site of the 2014 uprising that drove him from power.'"}, "time": 1742563321.8045552}