{"duration": 0.1589951515197754, "input_args": {"text": "'CARACAS, Venezuela  —   Hundreds of thousands of Venezuelans dressed in white and chanting “This government will fall!” poured onto the streets of Caracas and other cities on Wednesday to demand a referendum to oust President Nicolás Maduro. Opposition leaders, addressing protesters massed along the capital’s broad main highway, promised to increase the pressure on Mr. Maduro’s   government with a   general strike on Friday. “This government has lost the most important thing, and that is what we have today: the people,” said Henrique Capriles, a   presidential candidate and leader of the Primera Justicia Party. “Gentlemen of the government, we are giving you a deadline. ” Thousands of demonstrators rallied in many other Venezuelan cities. In Mérida, 73 people were injured during a clash between protesters and the police, Mérida’s mayor, Carlos García, said. Armed groups created to protect the government were also involved in the fighting. A police officer was shot and killed during a protest in the state of Miranda, the interior minister, Néstor Reverol, said Wednesday night. If the government does not allow the referendum to go forward, the opposition parties said they would lead a march to the presidential palace next Thursday. The protest was a powerful display of unity from the opposition, which has responded with fury to the decision last week by Venezuela’s Electoral Council to suspend the process for organizing a recall referendum. The council’s ruling, which halted the collection of voters’ signatures needed to initiate the referendum, was a sharp break with the government’s commitment until now to holding elections. “This is a dangerous new phase,” said David Smilde, a scholar of Venezuela at Tulane University and a senior fellow at the Washington Office on Latin America. “I think the government last week really changed the game. ” “Apparently they see this as a safer line of resistance than going forward with the referendum,” he added. On Tuesday, the   National Assembly voted to begin a political trial against Mr. Maduro, accusing him of carrying out a coup against the Constitution. Mr. Maduro has described the referendum drive as a coup against his elected government. Polls show that an overwhelming majority of Venezuelans, scrambling to find food and medicine in a collapsing economy, would vote to remove Mr. Maduro. “The right does not want dialogue because they want a coup and foreign intervention,” Mr. Maduro said before a small crowd of   supporters gathered outside the presidential palace on Wednesday. “But here there will be no coup nor intervention. ” Mr. Maduro has responded to the opposition’s activism with calls for dialogue, which opposition leaders believe is a bid to wait them out. Mr. Maduro met on Wednesday with leaders of the different branches of government, which are all firmly under his party’s control, with the exception of the National Assembly. Photos in a Twitter message by Mr. Maduro’s spokesman highlighted the empty chair reserved for Henry Ramos Allup, the opposition president of the National Assembly, who was at the protest instead of at Mr. Maduro’s meeting. “I am not going to attend this theater, this farce,” Mr. Ramos said. The Vatican has stepped in to mediate, but it is unclear which opposition leaders, if any, will attend the first round of the discussions scheduled for Sunday on Margarita Island. The opposition has instead unified around street protests. The challenge will be to “take this outpouring and channel it into a sustained movement on the streets,” Mr. Smilde said. In the past, rivalries among opposition leaders have made it difficult for them to come together on a strategy. “They are underperforming given the level of discontent,” he said. That discontent was on full display as people streamed to the protest on Wednesday morning. “Enough of this regime, which puts obstacles to everything,” said Vanessa Furtado, 45, a schoolteacher from the poor neighborhood of Las Minas de Baruta. “There is no security, no economic or work stability. Maduro is scared. The solution here is electoral, it’s all we have. ” Elliot Manuel Pérez Medina, a college student, was disappointed that the opposition put off marching to the presidential palace on Wednesday. As he spoke, a group of armed government supporters began to surround his group of protesters. “Why are we going to talk with people who always put a gun to our head and always repress us?” he asked. But not everybody who wanted to attend the protest could do so. Miurka Castillo, 47, said she suffered from seizures this year the shortages were so severe that she cannot find the medicine she needs she spent the morning bartering flour for three pills. “Nobody wants to go more than me,” she said. “I need this government to leave. I think that would change things. ”'"}, "time": 1742564064.160173}