{"duration": 0.023559093475341797, "input_args": {"text": "'Montag, 31. Oktober 2016 Rufschädigung: Brauerei verbietet EU-Kommissar, den Namen Oettinger zu verwenden Oettingen (dpo) - Die Brauerei Oettinger aus Bayern sieht ihren guten Ruf durch den deutschen EU-Kommissar Günther Oettinger beschmutzt. Nun ging der Bierhersteller juristisch gegen den Politiker vor und untersagt ihm, öffentlich den Namen \"Oettinger\" zu verwenden. Das Fass zum Überlaufen brachten jüngst bekannt gewordene Äußerungen des CDU-Politikers auf einer Tagung in Hamburg. Günther Oettinger bezeichnete dort unter anderem Chinesen als \"Schlitzaugen\", Wallonen als \"Kommunisten\" und warnte eindringlich vor einer \"Pflicht-Homo-Ehe\". \"Jahrelang haben wir dem Treiben dieses Mannes zugesehen und uns geärgert, dass er unseren guten Namen in den Dreck zieht\", sagte ein Unternehmenssprecher. \"Jetzt hat es uns endgültig gereicht. Auch eine preisgünstige Biermarke wie Oettinger hat ihren Stolz!\" Wegen Günther Oettinger hat dieses edle Bier nun einen faden Beigeschmack. Immerhin werde das Bier der Brauerei international und von allen Bevölkerungsgruppen gleichermaßen getrunken, so der Sprecher. \"Selbst mit sechs Oettinger intus merkt noch jeder, dass dieser Politiker sich selbst und damit unseren Namen europaweit der Lächerlichkeit preisgibt. Die Grässlichkeit von Oettinger ist inzwischen schon fast sprichwörtlich. Also von dem Politiker Oettinger jetzt.\" Inzwischen konnte die Brauerei beim Amtsgericht Nördlichen eine einstweilige Verfügung erwirken, die dem Politiker verbietet, den Namen Oettinger weiterhin zu führen, öffentlich zu verwenden und damit zu unterschreiben. Dabei schloss sich der Richter der Argumentation der Brauerei an, dass das Ansehen des seit 1731 bestehenden Betriebes durch die erst wenige Jahrzehnte dauernden politischen Aktivitäten eines Einzelnen dauerhaft beschädigt wird. Der derzeitige Digital- und künftige Haushaltskommissar der EU darf nun öffentlich nur noch seinen Vornamen Günther benutzen. \"Wenn er möchte, kann er sich ja gerne in Günther Warsteiner, Günther Hacker-Pschorr oder meinetwegen Günther Pflugbier Hörvelsingen nennen\", so der Sprecher, der den juristischen Sieg vor dem nördlinger Amtsgericht zusammen mit der Chefetage mit mehreren Flaschen Beck\\'s feierte.'"}, "time": 1742628548.7817261}