{"duration": 0.09064674377441406, "input_args": {"text": "'2 Replies \\nJennifer Hoffman – Whenever I hear the word selfish, I can hear my mother’s voice saying ‘Don’t be selfish’ when I didn’t want to share something. As the oldest child and the oldest of my cousins, I was always expected to share my things with everyone, whether I wanted to or not. Selfishness was defined as not being willing to let everyone have whatever belonged to me anytime they wanted it, a belief I highly disagreed with. But there is a big difference between being selfish, taking everything so no one else can have any, and being self-ish, as in making your needs a priority, and this needs to be our focus now. Our joy is fully available when we ask ‘What makes me happy’ and ‘What works best for me’ and this happens when we are willing to be self-ish and putting ‘me-ing into our be-ing’. \\nIt is not possible for us to be comfortable within the collective if we are not self-ish because without selfishness, or having an awareness of our self and out needs, we can’t have any boundaries. And boundaries are how we manage the energy flows into and out of our realities. They ensure our energetic stability and set the foundation for the joy and other energies we want in our life. Without boundaries we risk scattering our energy and giving our power away. The key is to find the balance that maintains our individual joy-based energies as we share with and participate in the collective energy. \\nBeing self-ish is a delicate balance that is both in-clusive and ex-clusive, and the fulcrum or midpoint is the point of our optimal energetic frequency and vibration, which determines who approaches our boundaries and feels the need to be included and who excludes themselves because they can’t feel or do the connection. Anyone is welcome to be with us if they can pay the energetic price of admission, which could be to ‘love, honor, and respect me’. As long as we maintain a strong ‘me’ focus, we can be inclusively self-ish in a way that allows us to be confident in our insistence on the joy or other energies we want to be part of our reality. \\nIf we use another word for self-ish, like self-aware, self-focused, self-caring, and self-sourced, we don’t associate it with the negative meaning our mothers used, which also led to us believing that we needed to share our energy and power with everyone who looked like they needed it. Being self-ish simply means that in every choice and interaction, we are aware of our needs and we give them consideration first, without doubting our worthiness. \\nOur spiritual path is both self-ish and unselfish, where we are inclusive in all things but exclusive in the energies we choose to participate in. This perspective also liberates us from the Martyred Healer paradigm, where we feel the need to heal everyone’s wounds, while denying ourselves access to the joy we try so hard to create for others. Putting ‘me-ing in your be-ing’ feeds your soul with the joy it craves, while empowering you to expand your reality to explore the fullness of your potential and possibilities. And when we are at the frequency of joy we become an example of empowered, joyful energy for everyone, as well as creating a portal for that energy to be experienced in the collective. \\nAt a time when the energies feel so chaotic and scattered, focusing on our joy, peace of mind and heart, love, and highest frequencies and outcomes allows us to ground those energies firmly into our realities. We can no longer adjust our reality to meet others’ needs, it feels too bad now. Nor can we wait for them to figure out what they want, they will have to do that for themselves. So much of what we are doing now is challenging us to be more self-ish, but that simply means to put ourselves in a state of joy so our light can shine brightly, and in the way that we and the world needs right now. \\nAnd putting the ‘me-ing in our be-ing’ reminds us that when we give our needs the attention they deserve, we are allowing our heaven on earth to become possible and that is a good thing for everyone. Copyright (c) 2016 by Jennifer Hoffman. All rights reserved. Share this:'"}, "time": 1742564587.9568388}