{"duration": 0.18706965446472168, "input_args": {"text": "'“Hey Rhona!” Donald J. Trump screamed from behind his desk on the 26th floor of Trump Tower one day last summer, before he won the presidency. Moments later, Rhona Graff, Mr. Trump’s longtime executive assistant, popped in from her adjacent corner office. “How long have you worked for me, Rhona?” Mr. Trump asked. “A couple of dozen years  —   I was 10 years old at the time  —   I was a child prodigy,” Ms. Graff joked. “Mr. Trump discovered me. ” “Many of the people who are with me have been with me for a long time,” Mr. Trump explained. In business, as a candidate and now as president, Mr. Trump has valued loyalty as the defining attribute in family, aides or Republicans in Congress. He does not always get it, as the defection of the Freedom Caucus last week on the health bill he was trying to pass made abundantly clear. But Mr. Trump can always count on Ms. Graff’s allegiance, and that has made Ms. Graff, from her office in Trump Tower, a major figure in the operations of the White House for a simple reason: She is believed to have a direct line to the president. With her deep Queens accent and unerring deference to her boss (she has always referred to him as Mr. Trump or, usually, as Mr. T) Ms. Graff, 64, is a familiar voice to New York’s business leaders, the nation’s political reporters and now old associates hoping to circumvent the normal channels of communication to reach Mr. Trump. Ms. Graff is a senior vice president of the Trump Organization, and her unofficial role as a back channel to the president raises questions about whether Mr. Trump is skirting the Federal Records Act, which governs the preservation of schedules and correspondence from the president, something the White House denied in response to questions about her role from Politico. Reached on Sunday, Ms. Graff declined to comment. “I like staying behind the scenes,” she said in a conversation last year in which she rejected a reporter’s proposal to shadow her for a day because so much private campaign, business and personal information crossed her desk. “We’re so intertwined when he’s here,” she said. Or, as she once put it to Real Estate Weekly, “Everybody knows in order to get through to him they have to go through me. ” Ms. Graff, a Queens College graduate with a master’s degree in psychology, left a sports marketing job after college to spend more time at home with her ailing mother. Eventually in search of another job, she heard about an opening in Mr. Trump’s office, and in 1987 called cold. They hit it off. Since entering the Trump Organization’s secretarial pool, Ms. Graff has acted as Mr. Trump’s media liaison, scheduler, sometimes spokeswoman,   planner, “Apprentice”   and Miss Teen USA judge. And regardless of who is taking Mr. Trump’s calls in Washington, it is Ms. Graff who occupies a more central space in the Trump orbit. In 1991, during Mr. Trump’s brush with going broke, it was Ms. Graff, “my very loyal secretary,” as he put it in “The Art of the Comeback,” who came into his office to tell him that his estranged wife, Ivana, was on the phone with the message, as he put it in the book, “I vant my money now. ” In 1993, Mayor David N. Dinkins presided at the wedding of Ms. Graff to Lucius Joseph Riccio, the city’s transportation commissioner, and later nicknamed Professor Pothole by The New Yorker for pioneering the field of pothole analytics at Columbia University. For decades, Ms. Graff worked under the tutelage of Mr. Trump’s longtime personal assistant, Norma Infante Foerderer, who died in 2013 from a heart attack after a difficult eye surgery. “She’d still be here if she didn’t have that problem,” Ms. Graff lamented in Mr. Trump’s office last year. “A disaster,” Mr. Trump agreed. But by 2005, the year Ms. Foerderer retired, Ms. Graff was already ascendant in an office that loomed large among the nation’s secretaries. (A poll of secretaries by a staple company showed that Mr. Trump trailed only President George W. Bush when it came to the country’s imagined toughest bosses.) In 2004, Ms. Graff became a recurring character on “The Apprentice,” and in 2008, she was briefly listed as the secretary for a luxury golf course in Scotland before a Trump confidant, George Sorial, replaced her. In 2013, she attained boldfaced name status in Page Six of The New York Post as “Donald Trump’s right hand. ” Since Mr. Trump has technically stopped running the Trump Organization, Ms. Graff now forwards messages to Mr. Trump’s personal assistant in the White House, Madeleine Westerhout, whom Ms. Graff helped train. Sometimes she forwards messages to Katie Walsh, one of the deputy chiefs of staff a White House spokeswoman maintained that messages are routinely sent to an official point of contact, instead of directly to the president. Mr. Trump’s dedication to his secretary and hers to him is much like the relationship Fred C. Trump, his father, had with his secretary, Amy Luerssen, treating her like family. He once had workers carry her up 12 flights of stairs when her elevator stopped working, lent her nephew his wife’s pink Cadillac when his car was stolen and would see her off at the airport when she went on a trip. When Ms. Luerssen’s niece, Kathy Quigley, tried to bring her aging aunt down to Florida, she said Donald Trump and his brother, Robert, insisted that Ms. Luerssen stay until she was senile. “It was a little bit of a battle because I was thinking, ‘Gee, I’d really like her to be down here with me,’” Ms. Quigley said. “But she was very happy. ” When her aunt died in 2006, a death notice appeared in The New York Times that read, “The Trump family mourns the passing of our beloved Amy, a trusted and loyal friend and employee for over 65 years. ” Mr. Trump compared his father’s dedication to Ms. Luerssen to his own loyalty to Ms. Graff. “My father was very loyal to people,” he said last summer. “I think I am too. ” Ms. Graff was clearly touched. “Well thank you boss,” she said. “Well it works both ways obviously. I’d never leave him. ”'"}, "time": 1742563174.0682356}