{"duration": 0.03691720962524414, "input_args": {"text": "'The growing number of Muslims in Germany represents not a threat but a learning opportunity, said Finance Minister Wolfgang Schäuble, discussing Islam in the wake of the Manchester attack. [“It is fanaticism, not only in Islam, that leads to terrible crimes,” he said, speaking on German public radio station Deutschlandfunk Wednesday evening, when asked about the Islamist attack in which 22 mostly young people, including an    girl, lost their lives.  “It is certainly a misunderstanding of religion when belief slips into fanaticism or, at worst, violence. “The world’s great religions all preach the message that one must look upon others as their sisters and brothers, and that one must live with the other because man cannot live alone,” Schäuble told presenter Christiane Florin. “‘Islam is part of Germany’ is a sober, factual statement,” the minister remarked, commenting on sentiments voiced by Chancellor Angela Merkel on more than one occasion  —   which are not shared by the majority of Germans. “Anyone who denies this denies reality and is therefore not suited to being a politician, because politics begins with the confrontation of reality,” he added. The country’s rapidly growing Muslim demographic presents an “opportunity” for “Christians, and all who live in Germany” Schäuble stated, adding: “We can learn from them. “Many human values are very strongly realised in Islam. Think of hospitality, and other things like, what is there  …     And also tolerance, I believe, for example. ” Discussing his recently published book, Protestantism and Politics, the Christian Democratic Union (CDU) minister said the church has no monopoly on truth and criticised voices within who “argue too much in secular matters from a point of religious conviction”. Commenting on how the “star” at the biennial congress of the German Protestant Church on Thursday was to be Barack Obama rather than any   figure, Schäuble lavished praise on the former U. S. president, describing him as “a man who can truly inspire people, like few others”. The minister expressed frustration with Obama’s successor Donald Trump, lashing out at the president’s ‘America First’ platform, and asserting that “if Germans could choose between President Obama and his successor, a large majority of them would vote for President Obama”.'"}, "time": 1742563787.6333435}