{"duration": 0.09224653244018555, "input_args": {"text": "'Writing at the Guardian newspaper, global warming advocate Bill McKibben claimed that President Donald Trump and White House Chief Strategist Steve Bannon are “counting on” a terrorist “massacre” on American soil to “tilt things their way. ”[McKibben, who has contributed numerous opinion pieces to the Guardian, wrote a column titled “Donald Trump and Steve Bannon have turned the White House against America. ”  In the piece, McKibben claimed the White House, which he argued was acting more like a “Black Tower,” was “sending out its Breitbartian orcs and   winged harpies to poison the politics of a nation. ” He referred to Trump’s temporary halt on refugees while the U. S. revamps its flawed screening process as an “immigration ban,” which McKibben claimed was actually a “calculated assault” on Muslims, morality, and “on simple kindness. ” “It was a probe to find out if Americans would come to the defense of a minority that we’d been told to fear and hate,” he claimed.  “And it failed  —   not because a federal judge struck down the ban, but because Americans in their millions poured into airport baggage terminals and city squares. ” McKibben went on to charge that Trump and Bannon may be “counting on a   Bowling Green massacre to tilt things their way. ” He wrote: The outpouring was not a show of Muslim strength  —   there really isn’t much Muslim strength in America. It was a demonstration that, for the moment, our moral commitment to the underdog still holds. But there are no guarantees: morality can bend pretty easily in the face of fear, and you know that Bannon and Trump are counting on a   Bowling Green massacre to tilt things their way. And in any event, morality is the not the only pillar they’re after. Next on the list is reason: the attack on climate science is, in fact, an attack on science itself, on the enterprise that undergirds modernity. McKibben’s charge about a “Bowling Green massacre” referred to an error made by Trump adviser Kellyanne Conway, who mistakenly said that “President Obama had a   ban on the Iraqi refugee program after two Iraqis came here to this country, were radicalized and were the masterminds behind the Bowling Green massacre. ” In actuality, Obama’s State Department in 2011 reportedly imposed a six month freeze on the processing of Iraqi refugees. The halt was the result of the discovery of two   members admitted as refugees from Iraq who were living in Bowling Green, Kentucky and admitted to targeting U. S. troops in Iraq. McKibben is founder of 350. org, which bills itself as a grassroots group building a “global climate movement. ”  The group is funded by the George   Tides Foundation and a slew of   philanthropies. In a 2010 review of one of his books, Time magazine opined that McKibben “may be the world’s best green journalist. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742561688.0280497}