{"duration": 0.031531333923339844, "input_args": {"text": "'US launches cyber attack on Russia’s power grid, telco networks and Kremlin command systems November 5, 2016 Google + Russia expects Washington to provide an explanation after a report claimed that Pentagon cyber-offensive specialists have hacked into Russia’s power grids, telecommunications networks, and the Kremlin’s command systems for a possible sabotage. \\n“ If no official reaction from the American administration follows, it would mean state cyberterrorism exists in the US. If the threats of the attack, which were published by the US media, are carried out, Moscow would be justified in charging Washington ,” Russian Foreign Ministry spokesperson Maria Zakharova said, according to the ministry’s website . \\nNBC News said earlier in an exclusive report that US military hackers have penetrated crucial infrastructure in Russia, “ making them vulnerable to attack by secret American cyber weapons should the US deem it necessary. ” \\nThe report was based on the account of a senior US intelligence official and top-secret documents. NBC said the hack was carried out in preparation for waging a full-scale cyberwar with Russia. \\nKremlin spokesman Dmitry Peskov also commented on the report, saying Russia had “ cybersecurity measures taken at the level proper for the current situation, and the threats voiced against us by officials of other nations .” \\nUS officials earlier alleged that countries like Russia and China could use hackers to disrupt American power grids and other crucial infrastructure. \\nMoreover, US presidential candidate Hillary Clinton’s allegations that Moscow engaged in hacking to damage her bid for the White house have become a major issue in the ongoing US election campaign. Though she provided no proof, the Democrat candidate accused the Kremlin of hacking into the Democrats’ computer networks and publishing sensitive information in order to swing the election in favor of her GOP rival, Donald Trump. In particular, she claimed that Russia had supplied the whistleblower website WikiLeaks with emails hacked from the account of her campaign chair, John Podesta. \\nRussia has repeatedly denied the accusations, asserting that it has no interest in influencing the election and questioning whether such publications would even have a major impact on how Americans would vote. No hard evidence of the alleged Russian hack has ever been made public, despite media reports claiming that US intelligence communities are “convinced” of the Kremlin’s guilt. \\nSo far, the only country with a record of conducting cyber-attacks on other nations is the US itself. An operation called ‘Olympic Games,’ which was reportedly conducted by the US in corroboration with Israel, involved infecting the computer networks of Iranian uranium enrichment facilities with a computer virus that affected industrial controllers of centrifuges in order to destroy them. \\nThe operation is said to have significantly damaged Iran’s production of nuclear fuel at the Natanz site. Washington apparently decided to go public about it after the virus, dubbed Stuxnet by the IT community, escaped and was identified by major cybersecurity companies.'"}, "time": 1742628486.9702523}