{"duration": 0.10121774673461914, "input_args": {"text": "'This woman has literally done it all to secure funding for her 172 children. Credit: Maria Cristina Foundation \\nMaria Conceicao is astonishingly dedicated to her 172 children living in Dhaka, Bangladesh and has gone to great lengths to provide them with the funding they need to get an education and reach their full potential. \\nIt all started in 2005, when Conceicao was working as a flight attendant with Emirates Airlines. She had a 24-hour break in Dhaka, Bangladesh and wound up visiting a hospital where a 16-year-old orphan had just given birth to twins. She was sickened by what she saw and told Arabian Business, \\n“After going to the hospital in Bangladesh, I just wanted to throw up. It was filthy, dirty, lacking hygiene. There’s no beds like we have here, they stay on the floor and they have to fight and compete for floor space. I thought it was so inhumane…. I couldn’t understand how someone who is really sick and goes to a hospital and a doctor to get better, could get better [at that hospital]. Going to that hospital was like meeting suicide, their situation would have been worse.” \\nMaria found herself incapable of going back to her normal life after witnessing the atrocities occurring just 4 hours from where was living. She made a vow to help these children and their families, first by asking for donations from family and friends and then by starting a foundation called the Maria Cristina Foundation to make a bigger difference in their lives. Credit: Maria Cristina Foundation \\nThough funding was abundant when she first started out, the 2008 recession hit charities very hard, and Maria said the funding disappeared overnight. The school her foundation had set up was closed and the children and their families had to go back to being day laborers and begging for money. \\nIn an effort to get their lives back on the right track, Maria secured the children’s spots at a nearby private school but she agreed to pay their tuitions. With no funding, Maria had to get creative with how she would raise awareness and $250,000 annually to pay the tuition and improve the lives of these children. Credit: Maria Cristina Foundation \\nThat’s where her amazing journey began: she knew she would have to gain attention by doing something shocking, so she set her sights on some of the most dangerous treks in the world to become known internationally. Though she had no athletic inclination prior to these highly athletic feats, she began training diligently to quickly accomplish what many others have spent decades working to achieve. \\nHere are just a few things she’s accomplished since she started her endeavor in 2010: Last Degree to North Pole Expedition, first Portuguese woman to climb Mount Everest, 7 full marathons in 7 days across 7 Emirates, UAE, 7 ultra marathons in 7 days in December, and 6 time Guinness World Record Holder. Credit: Maria Cristina Foundation \\nAs time has gone on and people have become impressed with her accelerated progress in training, people have lost interest just as fast as they’ve gained it. That’s why she jumped from treks and climbing to extreme running and, now, to swimming. \\nSwimming the English channel is extremely difficult and dangerous; by comparison, fewer people have successfully completed the English Channel swim than have reached the summit of Mount Everest. What makes it so challenging is the extremely cold water, which makes hypothermia very likely, and its constant flow of ship traffic that creates currents and obstacles. One year prior to her August 27th attempt, Maria didn’t even know how to swim. Credit: Maria Cristina Foundation \\nHer attempt at the swim was going well, but she was stopped 7 hours into the swim by an official boat pilot because strong tidal currents prevented her from picking up pace. She said this several days after her attempt: \\n“I am disappointed with the outcome. I know I still had so much more to give, but unfortunately allowed myself to be persuaded to stop by the official boat pilot 7 hours into the swim. I wasn’t struggling, I wasn’t cold, I was just slow. However, I have been overwhelmed and overjoyed by the support that I have received. I have never receive d such strong support for previous challenges.” \\nMaria’s struggle to provide for her children, who also call her their mother, continues and she will certainly be making another attempt to reach her target fundraising goal. If you would like to donate to her current campaign, you can do so here. Her foundation has already helped so many families and some of her children are even on their way to top universities, something that would have been unfathomable without her dedication and supporters. \\n  Humanitarian Attempted Dangerous English Channel Swim To Save 172 Children  '"}, "time": 1742563742.6126385}