{"duration": 0.05384564399719238, "input_args": {"text": "'\\nA copblocker in southern California was visited by two FBI agents at his home after conducting a first amendment audit at a US Postal Central Distribution Center, where he filmed inside and outside of the building as an effort to verify that the right to film was respected in that location.\\n\\nFelipe Hernandez and fellow auditors began to film one of the controlled entry points at the facility, and almost immediately two US Postal Service Police park their cruisers in front of them, one blockading the sidewalk. They asked questions and paced back and forth, but they eventually left without incident.\\nAfter a few minutes, Hernandez walked to another gate to film only to find another individual in an unmarked car following surveilling their activities. However, no further police contact was made and the auditors left.\\nNearly two weeks later on October 19, Hernandez filmed two plain clothes agents from the FBI’s Joint Terrorism Task Force, one with a clipboard, asking him questions pertaining to his filming of a US mail distribution facility. The agent declares that filming “critical infrastructure” can be considered “suspicious activity,” and that is why he is investigating Hernandez.\\n\\nHernandez tells them that he was instructed by his lawyer, who was on the phone at that moment, to not answer any questions. After a few minutes, Hernandez hands one of the agents the cell phone and they speak directly with his lawyer.\\nThe agent tells the attorney that the filming of a US\\nAfter a few minutes on the phone with the attorney, the officer is heard saying:\\nSo, we’re done here. If you’re saying that he was videotaping whatever in Los Angeles for whatever reason, and it’s not a terrorism-related activity, then we’re good. They don’t look like terrorists to me, I’ll tell you that.\\nThe agent hands back the phone, and Hernandez says, “You guys be safe,” as they walk away. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Ryan Banister of The Daily Sheeple . '"}, "time": 1742561724.1315107}