{"duration": 0.10123252868652344, "input_args": {"text": "'(AFP) UNITED NATIONS, United States  —   US Ambassador to the UN Samantha Power on Friday warned that cutting US funding to the United Nations would be “extremely detrimental” to American interests, one week before Donald Trump’s administration takes office. [Addressing her final news conference, Power told reporters that “countries like Russia and China” would benefit from Washington’s reduced standing at the United Nations if funding were withdrawn.  “We lead the world, in part, by leading at the UN,” said Power, who is stepping down next week after four years as President Barack Obama’s ambassador to the United Nations. “If we were to tie our hands behind our back or strip this organization of programming” to support peace mediation or humanitarian work, “this would be extremely detrimental to US interests,” she said. Power spoke after a bill was introduced in the US Senate that would slash all US funding to the United Nations until a Security Council resolution demanding an end to Israeli settlements is repealed. The United States refrained from using its veto to block the resolution and instead abstained, allowing the measure to pass by a vote of   in the council, triggering a furious response from Israel. Power said Israel would not benefit if there is “less US leadership” at the UN as a result of a funding cut, citing a string of   changes the Obama administration has supported. Much of Power’s parting words were in defense of US engagement at the United Nations, saying that while the “UN system is flawed” with a bloated bureaucracy, there is a need for a global body to pool common efforts. “The United States needs the UN,” Power said. “The UN goes to places that the US will not go,” she added, pointing to peace missions in Mali and South Sudan, where African troops are taking the lead. “If there’s less US leadership at the UN, it will be other countries that step in to fill the void,” many of which do not share the US view on fighting terrorism or advancing human rights, she noted. Power also warned the incoming Trump administration that it would be “very wise” to preserve the Iran nuclear deal that the   has vowed to scrap. The United States is by far the UN’s biggest financial contributor, providing 22 percent of its operating budget and funding 28% of peacekeeping missions, which currently cost $8 billion annually. Trump, who will take office on January 20, has dismissed the United Nations as “just a club for people to get together and have a good time. ” After the council voted to demand an end to Israeli settlements in the West Bank, Trump warned on Twitter: “As to the UN, things will be different after Jan. 20th. ” Congressional Democrats and Republicans alike fumed over the UN’s reprimand of Israel. The   US House of Representatives voted overwhelmingly last week to condemn the resolution, noting that the Obama administration’s refusal to use its veto power “undermined” Washington’s   position of shielding its closest Middle East ally at the United Nations. The Safeguard Israel Act of 2017  —   introduced by Senate Republicans Ted Cruz and Lindsey Graham  —   aims to push back against the UN by threatening to pull billions of dollars in funding. It was not immediately clear whether the bill would garner major support.'"}, "time": 1742563246.5092106}