{"duration": 0.123443603515625, "input_args": {"text": "'Forty years later, a moment in the annals of presidential debates remains a classic, worth recalling as Hillary Clinton and Donald J. Trump prepare to go head to head on Monday. “There is no Soviet domination of Eastern Europe,” President Gerald R. Ford declared when he went up against Jimmy Carter in 1976, “and there never will be under a Ford administration. ” Reality could not have been more starkly different, and it was reflected in the startled reaction of a debate panelist who had brought up the issue: Max Frankel, a senior editor at The New York Times, who then became the newspaper’s editorial page editor and later executive editor. “I’m sorry,” Mr. Frankel said. He continued: “Did I understand you to say, sir, that the Russians are not using Eastern Europe as their own sphere of influence and occupying most of the countries there and making sure with their troops that it’s a Communist zone?” Undeterred, Ford went on to say that several Eastern European nations he named did not think of themselves as   and that “the United States does not concede” any domination exists. His misstep and the panelist’s instant response are recalled in an examination of presidential debates by Retro Report, a series of documentaries that explore important news stories of the past and their lasting impact. How deeply the debaters should be scrutinized is a question with special resonance this year, given that Mr. Trump, in particular, has earned enough “Pinocchios” from fact checkers to fill many Geppetto workshops. Then, too, the scheduled moderator for a third   debate, Chris Wallace of Fox News, has shrugged off suggestions that it is his duty to hold the candidates accountable if they leave critical facts in the dust. “I don’t view my role as ” he said, a comment that has drawn considerable fire. “” even if it was not called that, became the most enduring memory from that 1976 debate. Actually, Mr. Frankel thought he was tossing the president a lifeline, not a gotcha line. “My giving Ford a chance to clarify was instinctive,” born of journalistic tradition, he said in a recent email exchange. “We do not trap a president with trick questions or acquiesce in confusion. We aim to explain policy, and should follow up if he has left his meaning unclear. ” Across the years, presidential debates have tended to be remembered less for their intellectual heft than for their gaffes and   be it Ford’s stumble, or Ronald Reagan’s “there you go again” riposte in 1980, or Michael Dukakis’s bloodless answer in 1988 on how he would react if his wife were raped and murdered, or George Bush’s impatient glance at his wristwatch in 1992, or Al Gore’s exasperated exhaling in 2000  —   proof that Herman Hupfeld didn’t get it quite right in his   song, “As Time Goes By,” of “Casablanca” fame. Sometimes, a sigh is not just a sigh. But whether bloopers and snappy retorts are game changers is a question that has dogged presidential election debates since the first one, held on another Sept. 26, in 1960, between John F. Kennedy and Richard Nixon. Their encounter is Retro Report’s main focus, notably the story line that swiftly took root. It held that Kennedy won on good looks alone, that against a light backdrop he appeared crisp and commanding in his dark suit while Nixon, recovering from an injury, looked pale and sweaty, his bearing hardly improved by an   gray suit. Those who saw none of that and only listened on radio  —   a far more common situation in 1960 America than today  —   believed Nixon had triumphed. So the story went. Many scholars have debunked that narrative, among them David Greenberg, a professor of history, journalism and media studies at Rutgers University. In the Retro Report video, Professor Greenberg contends that Kennedy’s overall performance, not just his looks, won the day. He showed, as a senator, that he could hold his own again a sitting vice president. As for Nixon’s supposedly prevailing on radio, the evidence for that is skimpy because, Professor Greenberg noted, no scientifically rigorous surveys were done at the time. (Whatever the reality, Nixon felt burned by the experience and came to view television warily  —   until he ran again for president in 1968, this time successfully, tutored in the art of the camera by a young producer named Roger Ailes. Mr. Ailes, ousted in July as chairman of Fox News, is once again a media mentor, for Mr. Trump.) When it comes to substance, and not just a stumble here or a clever line there, can a debate make or break a candidacy? Experts have long been divided. Some consider the debates decisive. That view was offered last month by Gary May, a University of Delaware historian, who wrote on the Daily Beast website, “For good or ill, television’s laserlike eye reveals the candidates’ fitness for the presidency. ” Well, maybe not, suggests another academician, John Sides, an associate professor of political science at George Washington University. Writing in Washington Monthly in 2012, Professor Sides said, “Scholars who have looked most carefully at the data have found that, when it comes to shifting enough votes to decide the outcome of the election, presidential debates have rarely, if ever, mattered. ” Even blunders may not be   right away. Mr. Frankel acknowledged that he himself had not immediately recognized the damaging potential of Ford’s “no Soviet domination” remarks. Many other Americans also failed to see it until newspaper and television analyses shaped their consensus that a serious presidential slip had occurred. These days, voters no longer need to wait for received wisdom to form. They can get it, or at least what passes for wisdom, in real time by watching squiggly lines on their television screens that represent focus group impressions of the candidates, or by following an avalanche of opinions put forth by the commentariat on Twitter and other social media. As a share of the United States population, the television audience for debates has declined. The number of viewers in 2012, about 67 million, was pretty much what it was in 1960. But there were an estimated 314 million Americans in 2012 and only 180 million in 1960. Of course, millions of people these days, both in this country and overseas, may be tuning in via online streaming services. In decline or not, “debates are important,” Mr. Frankel said, “because we normally get so few opportunities to meet the candidates and confront them with difficult questions. ” For Professor Greenberg, the merits of what the candidates say onstage may not be as important as the mere fact that they stand there, subjecting themselves to a grilling before millions of eyes and ears. “Debates draw strength from their status as important rituals,” he wrote in the journal Daedalus in 2009. The experience, he said, “serves, in some quiet way, to thicken our commitments to political life. ”'"}, "time": 1742563759.5765085}