{"duration": 1.6430821418762207, "input_args": {"text": "'  3 Hollywood Films For Blue-Pill Men That Reinforce SJW Values And Concepts 3 Hollywood Films For Blue-Pill Men That Reinforce SJW Values And Concepts Bob Smith \\nBob Smith is a man in search of the truth. His favorite quotes are, \"We\\'re all fools on this earth, and I can be no different\"; \"I know it\\'s true, I read it at the LIE-brary\"; and \"The truth is not misogynistic, it\\'s just the truth\". November 16, 2016 Culture \\nYour old Uncle Bob is mixing things up here—and I think you will see where I’m going with this new angle of mine pretty quickly. I have selected three SJW films to review: one from the 1960s, one from the 1980s, and one of much more recent vintage, from 2015. And what might all three of these insidious Hollywood movies have in common? Why, they outwardly or subliminally program viewers to blindly adopt blue-pill beliefs and behaviors, that’s what… \\nI feel unsettlingly dirty just writing about these films, but somebody’s gotta do it. So let’s get busy here and expose these three, flat-out, unintentional farces for what they really are. Seize the day. Onward and upward. (Or is that downward…in this case, in terms of these three horrendously blatant SJW films, most definitely downward.) 1. To Kill A Mockingbird (1962 – Gregory Peck, Robert Duvall, Brock Peters, Mary Badham) \\nThis multiple-Oscar-winning film is based on the Pulitzer-Prize-winning novel of the same name, which was written by Harper Lee and published in 1960—and it is that Pulitzer Prize, and those multiple Oscars, that should be your first major clues that the Hollywood elitists were up to no good while crafting this brilliantly clever piece of SJW brainwashing. \\nThis wickedly hypnotic movie cleverly reinforces the statistically bankrupt notion that most white males in the American Deep South are vicious, stupid, ignorantly racist crackers who spend most of their time ruining the lives of innocent blacks—that is, when they aren’t shooting them down like dogs or lynching them outright. The plot centers around a hard-working, stand-up, straight-arrow black man, Tom Robinson (Brock Peters), who is falsely accused of rape by a conniving, white-trash slut named Mayella Ewell (Collin Wilcox), whose alcoholic father, Bob Ewell (James Anderson), is a racist pig of unfathomably low character. \\nThe town’s SJW lawyer, Atticus Finch (Gregory Peck), plays white knight and comes rushing to Tom Robinson’s defense—much to the dismay of the local good ole boys—but despite his best efforts to free the poor, wrongly accused black man, Finch cannot hold back the powerful tide of racist anger, which ultimately results in the backwater town’s killer cops shooting poor Tom down in cold blood (a familiar theme, which can be abundantly found in today’s world of dindu-nothin’ black folk, who are perennially and viciously gunned down by racist white cops, on an ever-increasing and frightening basis…yawn, “Gee, never heard this one before.”). \\nI’m not even going to get into the rest of this mind-numbing film’s plot and story line, because it’s a waste of both my time and yours. But I will mention a few correlative facts here, which you might find just a little bit interesting… The SJW-controlled civil rights movement exploded with a vengeance not long after this film was released. And here’s the red-pill truth of the matter: according to the 1994 annual report on murder by the Federal Bureau of Investigation, most interracial murders in the USA involved black assailants and white victims, with blacks murdering whites at 18 times the rate that whites murder blacks. \\nThese stunning disparities began to emerge in the mid-1960s, when there was a sharp increase in black crime against white people, an upsurge which, not so coincidentally enough, corresponds exactly with the beginning of the modern SJW-crafted civil rights movement. Blacks thus committed 7.5 times more violent interracial crimes than whites, even though the black population was only one-seventh the size of the white population at the time. This is according to the survey, Highlights from 20 Years of Surveying Crime Victims , published in 1993. You’ll have to buy the book if you want to find out the real truth. \\nThese days, Washington’s SJW data-gatherers no longer keep track of such “ bigoted ” statistics…probably because they care about our safety so very, very deeply. Over the years, the cumulative effects have been staggering. Justice Department and FBI statistics indicate that between 1964 and 1994 more than 25 million violent interracial crimes were committed in the USA, overwhelmingly involving black offenders and white victims, and more than 45,000 people were killed in interracial murders—the vast majority of them being black-on-white killings. By comparison, 58,000 Americans died in the Vietnam War, and 34,000 were killed in the Korean War. \\nI wonder how many additional people have been killed in America, during the escalation of these deliberately inflamed race wars, since 1995? Unfortunately, we can’t get a look at those statistics, as previously mentioned, because the Puppet Masters no longer keep such records, so far as I can tell—and if they do, they definitely don’t want us to see them. \\nBe that as it may, the notions set forth in To Kill A Mockingbird are repulsively twisted, morally insidious and patently false. And if that offends anybody out there who might be reading this review, that makes my entire freaking day. Because in the end, all that should matter to any critically thinking person is the truth. And what Hollywood dishes out on a regular basis, is anything but… 2. Gandhi (1982 – Sir Ben Kingsley, Martin Sheen, Candice Bergen, Sir John Gielgud) \\nSupposedly, as the crafters of history have quite ingeniously led us to believe, Mohandas K. Gandhi (played by Sir Ben Kingsley, in this multiple-Oscar-winning film) utilized the greatest weapon of all in his epic fight against British tyranny on behalf of the Indian people—the incredibly effective method of non-violent resistance. \\nAnd in the movie, Gandhi , there is a sequence in the film featuring a large group of non-compliant protesters, as it faces down a group of security forces armed with sticks, outside of a salt factory, the end result being that the protesters get the holy crap beaten out of them. \\nIn reality, that was basically all that happened. There was a public dog-and-pony show, shortly after this supposedly real-life event, which was choreographed by the elitist-owned media. And indeed, in this cleverly constructed movie, actor Martin Sheen can be seen describing the bloody mayhem at the factory over the telephone to his cohorts back in the USA (Sheen plays American Journalist Vince Walker in the film). \\nAnd what Sheen’s character witnessed, and put into words, and then passed along to his editor over the phone, was summarily put into print in vast numbers of elitist-owned newspapers, as well as on film, in elitist-owned news reels, and marketed all over the world…which resulted in bringing worldwide focus on the “terrorist acts” of the security workers at the salt factory. This entire episode was allegedly a key element of India’s signature accomplishment of gaining her independence from the British. \\nDespite the fact that every single major worldwide event that finds its way into the mainstream media’s propaganda conduits, is either a completely staged event (like the Indian protesters getting beaten outside the salt mine, IMHO), or something that meshes well with the elite’s overall master plan, or they will not even put it into print or on film to begin with (90% of the world’s major media companies are owned by just six major players), we are supposed to believe that the elitist-produced film, Gandhi , depicts real-life events that occurred as the direct result of one brave man in a loincloth, who stood up to the ferocious might of the British Empire and brought the entire house down, single-handedly? \\nPlease. You’d have a better chance of talking me into using Tinder. \\nThere is another infamous sequence in the film, wherein a group of Hindi demonstrators is peacefully assembling in protest, within an enclosed, park-like area of the Indian city of Amritsar. The demonstrators are consequently assaulted by British soldiers, who open fire, brutally and randomly, on the assembled sitting ducks, and proceed to gun down hundreds of protesters (this incident allegedly occurred on April 13, 1919, and some estimates put the actual number of demonstrators killed at well over 1000). \\nAnd in this single, crucial, very revealing sequence of the film, the sobering truth is once again put on display for all to see—assembling peacefully, going against the grain of the established order, by utilizing peaceful protest and non-compliance within a group setting, is exactly what the elite want the people to do. Because it makes it a whole lot easier to identify them and kill them. \\nIn the film, after the mass slaughter, the soldiers’ commander is dressed down by his higher-ups for taking the law into his own hands, and gunning down the peaceful demonstrators. But that was all done strictly for show. And this is most obviously a case of cinematic cover here, as anyone who can think for themselves can easily infer (who do you think produced Gandhi …uh, that would be an elitist-owned film company, Columbia Pictures—do you really think the elite are going to pass along the bona fide solution to wiping them out…uh, no way; last time I checked, rattlesnakes don’t commit suicide). \\nThe British Empire has a long and bloody history of usurping lands. And the notion that the string-pullers at the very top of the greasy flagpole would be aghast at the actions of the British commander who ordered the slaughter at Amritsar, is comical at best. \\nWhat the slaughter at Amritsar actually accomplished (in addition to the mass-murder of a huge swath of ardent protesters) was the following: \\nWith the complicit assistance of the elitist-owned press, the British commander’s actions that day reinforced the suicidal notion that peaceful protest and non-violent resistance were the keys to bringing about significant social change. And throughout history, other choreographed events like the slaughter at Amritsar and the subsequent explosion of moral outrage, fueled by the reports in the elite-owned media, have continued to give rise to the suicidal notion that non-violent resistance actually works. \\nWhich of course it does, but only in isolated, high-profile, choreographed incidents, where the outcome has already been decided beforehand, whenever the Puppet Masters want it to appear that way to the sleeping sheep…the rest of the time, it only results in mass-incarceration, physical assault, political harassment or murder. On a more subtle note, you might have noticed that two of the leading actors in this Oscar-winning film were eventually knighted by the British Empire—namely, Sir Ben Kingsley (knighted in 2001) and Sir John Gielgud (knighted in 1953)…to which I can only say, “I rest my case, Your Honor.” 3) The Gift (2015 – Jason Bateman, Rebecca Hall, Joel Edgerton, Allison Tolman) \\nI don’t typically watch modern Hollywood films these days. Mostly because I know what Hollywood is up to, so I normally avoid them in the exact same way that I avoid single mothers with tramp stamps, or chicks with green hair. But I went ahead and checked out this absolute mindfuck of a movie on Showtime the other night, knowing it would probably throw me a wicked, SJW curveball—and sure enough, it didn’t disappoint. \\nAs an aside, I threw this film into the mix, juxtaposed with the previous two Oscar-winners, partly to demonstrate how far the bar has fallen in the Hollywood filmmaking industry, in terms of the standard of quality. They don’t even try to hide the SJW brainwashing madness in their films any longer. At least back in the day, they could mindfuck the sheep in an entertaining and captivating way, while keeping their overall intentions under the radar…but today, as this next film proves? Not so much. \\nSimon Callem (Jason Bateman) has a “horrifying” secret buried in his “twisted” past, and his wife, Robyn (Rebecca Hall), is clueless about the whole thing (innocent white female vs. evil white male, the usual bullshit here). The couple relocates from Chicago to a suburb of Los Angeles, where they run into Gordon “Gordo” Moseley (Joel Edgerton), a creepy, awkward, socially inept former high school classmate of Simon’s. Gordo starts dropping by the couple’s new house, uninvited and unannounced, and he does so on far too many occasions. Simon thinks Gordon’s behavior is weird (which it is), but his SJW wife thinks Gordo is sweet, shy, and simply misunderstood. \\nGordo’s weirdness escalates in typical bore-me-to-death fashion (Hollywood is really great at this audience-wowing technique lately), until Robyn finally discovers her husband’s long-held secret: he bullied poor Gordo back in high school, by inventing a story about him, which centered around a homosexual relationship that Gordo never had. The horrendously unfair story got back to Gordo’s father, and Gordo’s father nearly killed him! \\nOf course, Simon’s liberal, SJW, brainwashed wife eventually wants her bully-boy husband out of her life forever, shortly after discovering this unforgivable transgression (even though she’s pregnant with their first child, and they were very much in love up to this point; yeah, like that would ever happen in real life). \\nThe SJW bullshit meter spikes so hard in this film, that you’ll be left slack-jawed, stunned and eye-rollingly incredulous, and if you are unfortunate enough to have to sit through this absolutely putrid piece of garbage, be sure to keep a barf-bucket handy (especially for the ending)—because you are definitely going to need it. \\nHopefully, it’s getting a whole lot easier for you to spot the bullshit that is being sold, not only in today’s SJW Hollywood films, but in Hollywood films of days gone by (most especially Oscar winners). \\nThe elite are always using the magic of Hollywood for nefarious purposes—namely, to “magically” instill behaviors in its audience members that will get them into trouble, or instill beliefs in them that are totally divorced from reality. \\nDoing this makes it much easier to divide the movie-going sheep, and thereby conquer them, typically by race, or by historical beliefs, or by sociopolitical beliefs. \\nSo do yourself, and the world, a huge favor, and avoid SJW Hollywood films wherever and whenever you can. The rule is simple: if it’s being made in Hollywood today, it’s a BPO film (blue pill only). And unfortunately, as it pertains to movies that were made all the way back in the early 1960s (if not even further), well, as we have just seen, the same rule applies, in many cases. \\nBy boycotting Hollywood films, you are lessening the degree of brainwashing to which you subject yourself, simply by being alive in the world at the present time. And in this particular case, less is most definitely more .'"}, "time": 1742562361.5781946}