{"duration": 0.14301609992980957, "input_args": {"text": "'  Kris Kobach of the Presidential Advisory Commission on Election Integrity, who is also Secretary of State for Kansas, joined SiriusXM host Alex Marlow on Monday’s Breitbart News Daily to discuss voter fraud and border security. [“The commission is going to be about a dozen people, bipartisan, five of them current or former Secretaries of State,” Kobach said. “What it’s going to do is take a nationwide look at the problem of voter fraud. There’s a lot of debate around the subject of voter fraud, and as someone who has been Secretary of State in a state where we introduced photo ID as well as proof of citizenship, and security for   ballots  —   which is oftentimes a source of fraud or a type of fraud that occurs  —   we’re going to look at it from a nationwide perspective. ”   “I’ve amassed a lot of data at the state level in Kansas, but there really hasn’t ever been an effort by a federal entity to measure the statistics and the facts nationwide and see what the numbers look like,” he noted. Kobach recalled that Kansas and other states asked the Obama administration to provide lists of aliens on legal visas to check against voter rolls, so they could weed out ineligible voters.  “The federal government has consistently said no, under the Obama administration. Well, this commission will have the authority to maybe look at a couple of states and say, ‘okay, let’s check how many people who are registered voters in those states are also known aliens,   according to the federal government,” he said. “That’s going to be exciting, something never done before, and it will give us some sense of what the real numbers are of this problem. ” “The Social Security Administration has what’s called the ‘master death file.’ It sounds like some sort of starship from Star Wars, but the master death file is a list of people who have died. The Social Security Administration wants to track that, and of course keep Social Security Numbers rotating to people who are living. That’s a database that can be used to bump against some of the voter rolls,” he added. “Things like that, where we can just take some hard statistics and gather some numbers  —   and we’ll also be looking at anecdotal things and    prosecutions for voter fraud. It’s a big job,” Kobach said. Marlow anticipated that Kobach would encounter obstructionism from Democrats despite the bipartisan nature of his commission, because as he starkly put it, “We know that the Democrats would like to have lax voter laws and voter rules, because that allows them to cheat. ” Kobach said that after the commission was announced last week, “we did have people like Chuck Schumer coming out immediately and criticize me, and say that the commission is a waste of time. ” “My response is, ‘Senator, what are you afraid of? What are you afraid the commission is going to find, that you would attack the   of the commission ad hominem, and that you don’t want the commission to look at the evidence? ’” he said. “Look, if he’s right and voter fraud is virtually   in America, then the commission will find virtually nothing, and we will make his case for him,” Kobach argued. “I think it’s kind of curious how some of the leadership of the Democrat Party  —   and that includes Tom Perez  —   have criticized the commission, when I would think if they really are interested in the facts, they would say ‘Hey, great the commission will prove to us that voter fraud doesn’t exist.’ So yeah, it’s been interesting. ” Kobach said the Trump administration is “doing well” on immigration and border security so far, in his estimation. “I think the executive orders are what needed to be done. The vetting of people coming from parts of the world where terrorism is rampant, where ISIS or   control territory, is very problematic. I give them high marks for that,” he said. “The other thing is, they’ve sent a very clear message to the ICE agents that hey, we’re taking the rope off your hands, we’re untying your hands and letting you do your job,” he continued. “Just by doing that, just by seeing ICE agents more active and out on the field, back doing what they were supposed to do, that has sent a message to the smugglers and to the illegal aliens coming in that there is a new sheriff in town. ”  “That’s why you’re seeing the border crossing numbers plummeting,” Kobach stated. “I think that’s great. It does show what those of us who have studied and worked in the immigration field know, and that is that if you make a slight change of policy in Washington, you’ll get an immediate reaction on the border. ”  “For example, whenever the   crowd starts talking about an amnesty  —   and under President Obama, they had a president who was welcoming an amnesty  —   then immediately border crossings surged,” he recalled. “The word gets down south of the border very quickly, and people surge in, because they want to be in the country so that they can claim they were eligible for the amnesty when it happens. Similarly, the opposite is true too. If a more aggressive enforcement begins, word gets across that hey, this is going to be tougher. The price of a coyote smuggling you in is going to double or triple. That affects behavior. ”  “Those are some good marks for the administration. I think there is more they could be doing, and hopefully they will be doing it in the near future,” he said. Marlow cited some of the more vicious attacks on Kobach’s character, and asked what it was like to endure such calumny merely because he insists on border security and clean elections. “It’s not good at all,” Kobach replied. “They’ve been dragging my name through the mud for years now. I’ve become calloused to it, and it doesn’t bother me that much. But you know, it bothers my wife, my family. You don’t want your kids to read that. ” “It’s so false,” he continued. “When someone is in a debate, and they don’t have any arguments left, oftentimes on the Left they resort to ad hominem remarks. They just attack you as a person. They call you a racist, they call you a vote suppressor. They just come up with these stupid names. That’s because they don’t have any actual arguments left. I’m not surprised any more by it. It doesn’t bother me, but it’s rather tedious, and I certainly don’t like my family seeing it. ” Kobach anticipated his commission completing its work within a year, and said he would continue to work on ballot integrity and border security in the meantime. “We should see some interesting data, whatever it is, that the commission is able to present to the country. I continue to work in the area of illegal immigration as a litigator, so I’ll be working there. I think you’re going to see a lot of things happening, especially on sanctuary cities,” he said. “California has got this bill that has passed one house, it’s in the other house, to create a sanctuary state, which is just extraordinary. I think you could potentially see litigation on that. You could see litigation on a whole bunch of things,” he anticipated.  “I’ll keep fighting to keep our voter rolls clean, and to help this commission find whatever there is to find on the subject nationally. The fight to secure our borders is something that has to be done both within the administration and without. States need to help. States like Texas made a great effort to enlist state and local law enforcement, just like Arizona did a few years ago. I’ll be continuing to push for that,” Kobach promised. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742562232.1301022}