{"duration": 0.13876748085021973, "input_args": {"text": "'This summer, I thumbed past an Instagram photo of a   young man with silken brown skin and an enviable   fade dressed up in an azure suit. I lingered for a moment, slightly verklempt. I knew him, or, at least, I felt as if I did, and I couldn’t believe he was already going to prom. The teenager was an    from New Jersey known as Jay Versace, who has appeared in my life in   increments for the last two years on Vine, the video app. I’ve seen him confess that he’s wet himself, channel Drake and Beyoncé and balance an impressive number of items on his head. Most of Versace’s Vines are shot in his bedroom, and watching his videos is as intimate as finding your younger brother’s notebook of secret doodles or poems  —   you’re stumbling into his ( ) secret world. The kinship I felt reminded me of the bond I imagine my mother has when she talks about “Tracee” (Ellis Ross) or “Chris” (Rock) as if they could walk through our door at any moment and fix themselves something to eat. Jay Versace’s work gives me the same feeling that, say, “Everybody Hates Chris” gave my mom  —   comfort, stability, familiarity and warmth, a sense of identity and belonging. Versace’s Vines are a particular product of black culture  —   on the surface, they’re funny to anyone lucky enough to bear witness, but there’s a secondary layer that’s meant for black people, predicated on our shared culture, experiences and understandings. If Facebook has become a destination for moms who are increasingly technologically literate, and Twitter has grown into a place for journalists who spread information (and snark) in   missives, Vine, the mobile video app that Twitter announced late last week will be discontinued in the coming months, has become a home for young black people, who dominated the service and established its visual language early  —   quick cuts, referential jokes, deep allusions. (Jay Versace, for example, has three million followers.) Quickly consumed visuals have the potential to go viral online in ways that words do not, and Vines spread far and fast while also allowing its users to arbitrate their outcomes. While Facebook supplies recognition  —   first and last name, hometown, face  —   and Twitter can provide anonymity, Vine offered something in between: a place for people to see you, even people who didn’t necessarily know who you were. Visual platforms like Snapchat are similar canvases for creativity, but make it difficult to attract an audience outside of one’s social circles. Vine didn’t privilege traditional celebrities  —   its stars grew organically without the benefit of expensive equipment or   connections  —   though after its official release in 2013, it seemed like everybody wanted to be there. Drake premiered the first clip of his album “Views,” on it dance crazes like “The Running Man Challenge” were born there   slang like “on fleek,” “WHAT ARE THOOOSE” and “Why you always lyin’?” debuted and spread on Vine. Like much of pop culture, these bits of virality were rooted in the black community, then sucked into the mainstream where businesses benefit from them financially. Vine incubated black ingenuity and creativity, allowing makers to play with structure, form, insertion, pacing and interpolation, and letting users employ the videos as punch lines, shorthand and punctuation. The service became its own ecosystem of black culture, both by relying on familiar figures, experiences and jokes, and by creating the next batch of them. Jay Versace mirrors black experience in a Vine about a relationship breakup, set to the 3LW song “No More (Baby I’ma Do Right). ” He plays two characters: a befuddled male and his clearly angry girlfriend. It’s funny because of the large, exaggerated emotions spreading across his baby face, the way he overemphasizes the singer Kiely Williams’s lisp as he   the word “promises. ” Everyone can see that. But what’s funnier is that he’s making fun of the way we  —   black people, the main audience who bought the 3LW records, and memorized their songs and dances  —   all made fun of the song when we first heard it. Versace is sharing an inside joke. As the writer Kasai Richardson posted on Twitter, “black youth did more with six seconds than Hollywood has done with six decades. ” Most popular Vines were truly entertaining, even cinematic. But they also began conversations  —   however small  —   about the dynamics of comedy and culture created by black people. Chiefly, Vine was an exercise in how many black people talk among ourselves  —   in code and allusion  —   and how we telegraph blackness to white people, who may not know any black people besides the ones who live in their phone. Blackness is inherently political, but a number of black comedic Vines weren’t, perhaps making it easier for white kids to latch onto  —   there weren’t murky politics to consider. Many black Vine stars relied on familiar tropes to appeal to black people but, in turn, may have reinforced stereotypes for white people, who received the content without the tacit understanding that everyone else is in on the joke. Still, that didn’t stop Vine from functioning as a de facto FUBU  —   for us, by us  —   space for black people, where we could reinsert ourselves into a mainstream that excluded us, skewer our own culture (however safely) and create something new, a phenomenon that is relatively rare. There are few spaces to provide the public with black ingenuity Vine, in its own small way, was a digital exposition of black achievement. It was fitting, then, that Twitter announced the discontinuation of Vine the same day the “ ” scandal hit the internet. In an article about the film “Moonlight,” the film critic for The Toronto Star misheard the term “” a practice of alternating language or behavior based on the environment and atmosphere, and giddily included the eggcorn in promoting the article. It was a perfect example of how the experiences of minorities are often misconstrued. Vine was a place where you were either on the joke or you weren’t, and so help you if you weren’t. Vines were six rapid seconds of fun, a flash of candy down a throat. My favorite Vine wasn’t a lifesaver or a masterwork it just cheered me up more quickly than any other emotional fix in my arsenal. It’s called “Black people only need 3 claps to turnnn up!”  —   the premise is uncomplicated, and it manages to be cheeky, tender, nostalgic, surprising, hilarious, painfully true and      all in the span of six seconds. Vine was never that deep: it wasn’t designed to spark a national conversation on race, culture, appropriation, ownership and identity. Its effect and utility, though, as a venue for black art to be created disseminated and understood, will be its legacy. Nobody ever tried to change the world with a Vine. But it served as the best place to get away from the world for a while.'"}, "time": 1742564136.6526976}