{"duration": 0.24785804748535156, "input_args": {"text": "'Why Trump: A quick primer for the world\\'s elite Donald Trump’s election victory was unprecedented, but it should not have been surprising. His popularity was the result of socio-economic trends that had been gathering force over the past 20 years Donald Trump’s election victory was unprecedented, but it should not have been surprising. His popularity was the result of socio-economic trends that had been gathering force over the past 20 years. \\n\\nPresident Barack Obama and President-elect Donald Trump shake hands following their meeting in the Oval Office of the White House in Washington, Nov. 10. Photo: AP \\nElites across the U.S. and the world are puzzled by the election victory of Donald Trump. They should not be – it is no more surprising than the fall of one more domino in a line that has already toppled half a dozen others.\\nTrump’s victory follows the victory of the Brexit vote, and the rise and popularity of anti-liberal, nationalist leaders in the Philippines, Turkey, Hungary, and of course, Russia. Around the world, the rising polarization of wealth, the anger of those being left behind and trapped in the decline of social mobility have resulted in people venting their anger at what they perceive as selfish elites.\\nThe data make clear that there was no huge outpouring of support for Donald Trump. He received 59.9 million votes overall; slightly less than Mitt Romney received in 2012 (60.9 million) and a hair more than John McCain received in 2008 (59.6). Trump defeated Clinton because she failed to generate as much enthusiasm as President Obama, who received 65.9 million votes in 2012 and a whopping 69.3 million votes in his first election in 2008. Large numbers of people who voted for Obama in earlier elections either stayed home (as with many of the Bernie Sanders voters) or voted for Trump.\\nIn the Electoral College, the results were a surprise only because of overconfidence by Democrats and the biased judgements of urban-based elite media and commentators (plus polls that skewed toward urban voters). But a quick glance at the state and county maps of Republican and Democratic voting makes the outcome very clear. In the major cities where global finance and high technology has enriched the economies, and large numbers of the highly educated and higher-income households are located, voting went Democratic; in the rural areas dependent on the domestic economy, and particularly those hurt by the financial downturn since the Great Recession and by stagnant incomes, voting was overwhelmingly Republican.\\nRecommended: \" Will Trump\\'s presidency change the way America views Russia? \" Overall, the Electoral College results were clear: as has usually been the case, the Northeast and West Coast states went Democratic, while the southern and mountain states went Republican. The crucial swing states were those in the upper Midwest – from western Pennsylvania and Ohio through Iowa, Wisconsin and Michigan. All of these were states that had voted for Obama in the previous two elections, but all of them went to Trump in 2016, giving him a large victory in the Electoral College.\\nThe key swing voters in these swing states were the “white working class” - whites who had not attended college. These were the groups who felt the most pain in the late 2000s as their savings and homes crashed in value, while the high-paying union jobs that had been the foundation of their communities and their prosperity continued to fade away. In 2012, they voted strongly against Mitt Romney, who was seen as exactly the kind of predatory elite private equity investor who had enriched himself by closing factories and shipping jobs abroad.\\nBut in 2016, they voted strongly against Hillary Clinton, who was also seen as representative of the Wall Street elites who had engineered bailouts for bankers and gotten rich themselves, while the white working class struggled to survive. Trump, in comparison, was seen as a self-made man who had no patience for political correctness, who would not give special favors to minorities and immigrants, and who would “make America (meaning their America, of small-town Midwestern communities) great again.” ;\\nThis group of voters are now neither Democrats nor Republicans; rather they are supporters of anyone who promises to pay attention to their needs and shake up the system that they feel has neglected and scorned them. They supported Bernie Sanders in the Democratic primaries, and Donald Trump in the Republican primaries.\\nThe real question we should be asking thus is not why Trump won the election; it is why so many voters rejected mainstream politicians from BOTH the Democratic and Republican parties, and voted for insurgents who aimed to overthrow the establishment of their parties and the nation . In short, why were so many voters willing to support what amounted to a revolution against politics-as-usual, a revolution aimed at blowing up the status quo?\\nThe answer to that question is easily revealed in the graph shown below.\\n\\nIn this graph, from the St. Louis Federal Reserve Bank, the upper blue line shows the growth in America’s economy. To be more specific, it shows the real (adjusted for inflation) level of GDP per person. This grew rapidly from 1993 to 2000, suffered a brief pause in the recession of 2001-2002 (the dot.com bust), and then continued to rise strongly to 2007. It again paused and dipped for the Great Recession of 2007-2009, but then rose again, reaching an all-time high in 2014.\\nOne would expect that in a fair and open free market society there would be a strong relationship between rising national income and rising household income. ; Certainly there would be some increase in inequality as the benefits of growth would not be spread fully equally, but on average, one would expect that as a society as a whole grew richer, the people of that society would grow richer as well.\\nThis was the case from the end of World War II all the way to the 1990s. But as shown by the bottom red line in the figure – which tracks the real median household income in the U.S. – for the last 15 years that expected relationship has failed. Over this period, the median household income has dropped; household income stopped rising in tandem with national economic growth from 1999 to 2007, first remaining flat even as the economic grew, then dropping by ten percent after 2007, even as the overall economy returned to steady growth.\\nThere are a number of words to describe this state of affairs, but the obvious ones that leap to mind are “unfair,” “unjust,” and “intolerable.” ; No doubt most of the U.S. population has not been poring over graphs like this one – they don’t know the data or the trends. But what they do clearly see and resent is that highly visible pockets of the economy are enjoying strong economic growth; it is visible in New York, San Francisco, Seattle, Denver, Los Angeles, Houston, Miami and Chicago. These and other centers of design, finance, and professional life are thriving and driving a growing economy. ;\\nBut the median households across the country – especially in rural areas and former manufacturing centers – are being left out of this growth; instead their incomes are falling. Some people blame immigrants; others blame globalization or sending jobs abroad. Economists and media pundits often blame technological advances for leaving uneducated workers behind. But for many households with stagnant or falling incomes watching the rising wealth of the bankers, executives, and urban professionals, the result that matters is a hatred of the elites who have manipulated the rules of the game to favor themselves and capture (if not steal) all the fruits of national economic growth.\\nThe result is not all that different from what happened in East Germany for households that received TV images of the quality of life in West Germany, and increasingly realized that they were being left behind. The East Germans felt that their leaders had betrayed them; those leaders lost all legitimacy, and they were abandoned in what became a revolutionary movement that quietly toppled the Communist regime.\\nAmerica has always had high inequality; that is not the issue. In the past, high inequality was combined with two elements that comprised the “American dream.” First, while some attained enormous wealth, average incomes rose as well. Not everyone would become a Rockefeller or Ford, but everyone could expect a rising income over their lifetimes if they worked hard.\\nAlso read: \" Why Russia has no reason to celebrate a Trump presidency ye t \" Second, the path for mobility was open to all – anyone with the luck, brains, or business talent could strike it rich and move to the top of the income hierarchy. That opportunity was fueled by an open frontier in the 19 th and early 20 th century, and by a huge increase in public education and professional and white collar jobs from the 1960s to the 1990s. In those years, those with the ability and effort could put themselves through a good public college and get a professional or government job with excellent income and solid benefits. Parents from the lower and working classes whose children could be encouraged to be disciplined and hard-working could count on their children being able to get an outstanding education and achieve high levels of professional success.\\nIn the last twenty years, both these elements of the American Dream have been stripped away. Average incomes have stagnated, then declined, even though the overall economy has grown. In addition, avenues to social mobility have dried up. Funding for public universities has plummeted, and costs have skyrocketed compared to working-class incomes. The number of professional and white collar jobs has grown only slowly, and those positions are increasingly taken by the children of well-to-do parents who can provide superior pre-school, private, and college educations, connections that lead to valuable internships, and pathways to top jobs. A 2015 Pew study of social mobility in the U.S. states that “the United States is very immobile. The persistence of advantage is especially large among those raised in the middle to upper reaches of the income distribution.”\\nAs the American Dream is what legitimized the high level of inequality and the position of elites in the eyes of the average working family, the erosion of that dream has undermined the legitimacy of today’s elites. Instead, a substantial number of Americans want to “take down” the selfish and privileged elites that they see running Washington D.C. and betraying them. These people responded with wild enthusiasm to Donald Trump’s promise to “drain the swamp.”\\nIn sum, the income patterns in America over the last 15 years made it inevitable that sooner or later an uprising would occur against the ruling establishment . Whether it drew from the left (Bernie Sanders’ supporters) or the right (Trump’s supporters) or both, an anti-elite movement was going to gain traction. Yes, there are bigots, racists, sexual aggressors and xenophobes among Trump supporters, given that Trump himself has shown these characteristics in his speeches and actions. But these are not the groups that pushed Trump to the Presidency. If not Trump, it would have been another populist who, sooner or later, would have overcome an opponent from the hated elites.\\nThroughout history, whenever selfish elites monopolize economic growth and produce a polarization of incomes, the result is a loss of legitimacy and the rise of insurgent movements to overturn the social order that is no longer providing expected routine benefits. Since the 1990s, the U.S. has been repeating these conditions. The surprise should not be that Donald Trump (or someone like him) was elected president. The surprise should be: Why did it take so long?\\nThe ;opinion ;of the author may not necessarily reflect the position of Russia Direct or its staff. '"}, "time": 1742562774.6279488}