{"duration": 0.10072755813598633, "input_args": {"text": "\"Print Email http://humansarefree.com/2016/11/report-eating-raw-weed-prevents-bowel.html Cannabis is taken in different forms all over the world, while being primarily smoked, being eaten raw has been proven to provide incredible heath benefits, whilst also being non-psychoactive, therefore more appealing to a wider of range of people. Marijuana can be described as of of the new range of superfoods, it contains over 400 chemical compounds containing beneficial vitamins, essential oils, and acids. Experts such as Dr. William Courtney have come to call weed a 'dietary essential' Marijuana contains extremely high concentrations of cannabinoid acids which it has been discovered are essential for cell function. Cannabinoid Acids The two main cannabinoid acids that have been studies so far are THCa and CBDa. If these acids are heated, through smoking, vaping, or cooking cannabis then they begin to break down into different chemicals, they become degraded into psychoactive THC and cannabinoid CBD . This process is called decarboxylation, or “decarbing.” and it describes breaking down the acids into the form in which they become active. While active THC and CBD have their own health benefits, a downside is that the human body can only cope with a certain amount of these activated cannabinoids. Dr. Courtney explains : “We have a series of cannabis strains called ACDC. ‘AC’ stands for alternative cannabinoid, which is the CBD acid molecule, which has come into focus lately as being very important as an anti-inflammatory. “And ‘DC’ stands for dietary cannabis. […] If you do heat it, then your dose is around 10mg. And if you don’t heat it, if it’s raw, then your dose is around one to 1-2,000mg.” When eaten raw, the body is able to process much larger amounts of THCa and CBDa, and it can then convert these acids into essential nutrients through its metabolism. Cannabinoid acids have been linked to the prevention of chronic diseases. Endocannabinoid deficiencies thought to be linked to illnesses such as: Migraine Glaucoma Fibromyalgia Dr. Courtney has suggested that large doses of raw CBDa and THCa are much more effective in their raw form to the effect of: Anti-inflammatory properties Anti-ischemic properties (restricted blood flow in the body) Amino Acids Cannabis contains a large amount of essential amino acids, like other essential fatty acids our bodies don't produce essential amino acids of their own accord, so we need to introduce them through our diet. Amino acids are essential in that they help cells to function properly, to repair damaged tissue, to maintain structure and to transport nutrients around the body. Marijuana as a Nutritional Powerhouse Antioxidant In 2003, CBD was patented by the US. government after discovering the cannabinoid had amazing antioxidant and neuroprotective properties. These antioxidants are beneficial in preventing cell damage, thus reducing illness and disease. In the research leading up to the patent, the found that CBD was a more powerful antioxidant than both vitamins C and E. As you can take in large quantities of CBD via raw cannabis, you can introduce a vast amount of antioxidants to your body very easily. Dr. Courntney has suggested consuming raw via juicing or blending, making a marijuana smoothing with other vegetables such as parsley or cilantro. Here are some other recipes to try if you want to enjoy the benefits of raw cannabis: Reference: http://organicandhealthy.org Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742563031.1643856}