{"duration": 0.01607489585876465, "input_args": {"text": "'CNN has terminated its relationship with Kathy Griffin after the comedian posed for a photograph while holding a fake, bloodied decapitated head meant to resemble the head of President Donald Trump. [“CNN has terminated our agreement with Kathy Griffin to appear on our New Year’s Eve program,” the network’s communications department tweeted Wednesday morning.  CNN has terminated our agreement with Kathy Griffin to appear on our New Year’s Eve program.  —   CNN Communications (@CNNPR) May 31, 2017,  Griffin had   CNN’s New Year’s Eve Live broadcast each January since 2007 alongside the network’s lead anchor, Anderson Cooper. Cooper took to Twitter late Tuesday night to say he was “appalled” by his  ’s photo. “For the record, I am appalled by the photo shoot Kathy Griffin took part in,” the Anderson Cooper 360 host wrote. “It is clearly disgusting and completely inappropriate. ” The shocking photograph, first published by TMZ Tuesday morning, was taken during a photo shoot conducted by the    My Life on the   comedian and Los   artist and photographer Tyler Shields, who is reportedly known for his provocative work. The photo caused a firestorm online, where it quickly circulated and led to calls for a boycott of Griffin’s work, including her current   comedy tour. The comedian apologized in a brief video posted to her Twitter account Tuesday, saying she had “crossed the line” and that the image had gone “too far. ” CNN’s termination of its relationship with Griffin is the latest in the continuing fallout over the image. On Wednesday, ADT  —   the largest home security company in North America  —   announced it would pull its advertising from CNN over the photo, while the Route 66 Casino in Albuquerque, New Mexico announced it had cancelled Griffin’s upcoming performance, which had been scheduled for June 16. The U. S. Secret Service is also reportedly investigating the circumstances surrounding the photo shoot. President Trump and First Lady Melania Trump responded to the image Wednesday, with the president saying in a message on his Twitter account that the photograph and its resultant coverage has been particularly hard on his    son, Barron. The First Lady called the photograph “very disturbing” and “simply wrong” in a separate statement.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628568.7378051}