{"duration": 0.10164380073547363, "input_args": {"text": "'Maybelline has made makeup model Manny Gutierrez the American brand’s first male makeup ambassador. [Gutierrez announced the news to his three million Instagram followers earlier this week: “Honestly I couldn’t be more honored [or] thrilled! ,” Gutierrez said. “Thank you to Maybelline for taking a chance on me!”   2017 you are off to an AMAZING START OMG! So excited to finally announce that I am part of the @maybelline #bigshotmascara campaign! Honestly I couldn’t be more honored thrilled! Thank you to Maybelline for taking a chance on me! I look forward to working together so much more 😍😍😍 #Maybellinepartner #IworkedwithMaybellineOMG #pinchme #notthathardthough, A video posted by 🌙Manny Gutierrez (@mannymua733) on Jan 3, 2017 at 6:01pm PST,  Gutierrez, a social media star   on YouTube as “MannyMua,” will be starring in Maybelline’s “That Boss Life” campaign promoting Big Shot Mascara alongside fellow beauty blogger Shayla Mitchell and contest winner Jackie Flowers. The      says “I believe makeup is GenderLESS and has no rules” and “boys deserve just as much cosmetic recognition. ” Mua was raised by “liberal Mormons,” according to Marie Claire, and came out publicly in a YouTube video in August that’s since drawn more than a million views.  Wearing the new @kyliecosmetics @kyliejenner Burgundy Palette   …     filmed a review and demo too 😏 Who wants to see it?! 😍 Ps lashes  —   @lillylashes Miami use code Mannymua to save some coin! #kyliecosmetics #kyliejenner #lillylashes, A photo posted by 🌙Manny Gutierrez (@mannymua733) on Oct 21, 2016 at 5:59pm PDT,   Today’s been a longggg and hectic shoot day! Can’t wait for you guys to see the action next year! 😍 Thank you @ijosephzee for killing it and helping me vamp up my style 😏 Which outfit do you guys like better? Left or right? Soft glam or sporty spice lmfao 🌙Left🌙 Top, jacket, pants all from @hm Shoes  —   @nike 🌙Right🌙 Pants  —   #hm  Top  —   @kenzo Shoes #Nike, A photo posted by 🌙Manny Gutierrez (@mannymua733) on Dec 16, 2016 at 7:16pm PST,  Maybelline’s hiring of Gutierrez comes on the heels of fellow cosmetic giant CoverGirl’s decision to name James Charles its first CoverBoy.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562628.1883957}