{"duration": 0.05495929718017578, "input_args": {"text": "'Both butter and ghee contain almost 100% of calories from fat. \\n\\nGhee is more concentrated than butter. Gram for gram, it provides slightly more butyric acid and other short-chain saturated fats. Studies suggest that these fats can reduce inflammation, promote gut health, and inhibit cancer growth. \\n\\nGhee is also higher in conjugated linoleic acid, a polyunsaturated fat that may help increase fat loss. \\n\\nGhee is completely free of the milk sugar lactose and the milk protein casein, whereas butter contains small amounts of each. Ghee is a great alternative for those who have allergies or sensitivities to these dairy components. \\n\\nHeating ghee produces a lot less of the toxic compound acrylamide than heating vegetable and seed oils. Ghee also has a very high smoke point. At 485 F, its smoke point is much higher than that of butter’s which is 350 F. \\n\\nHeart Health \\n\\nA number of studies suggest that consuming ghee can lead to favorable changes in heart health . \\n\\nIn one study , ghee was revealed to increase good cholesterol (HDL) and reduce the formation of fatty deposits in the arteries. It also increased fasting blood sugar levels. \\n\\nA controlled study found that ghee was the fat source responsible for the greatest increase in ApoA, a protein in HDL particles that is linked to a reduced risk of heart disease. \\n\\nIt is important to distinguish between ghee made from dairy and ghee made from vegetable oil. \\n\\nVegetable ghee contains 14-40% trans fats, and the rising consumption of vegetable ghee may be contributing to rising heart disease rates among Indians and Pakistanis. \\n\\nCancer \\n\\nSeveral studies comparing ghee to soybean oil suggest that ghee may reduce the risk of certain cancers, including breast cancer. \\n\\nPotential Health Issues? \\n\\nResults of controlled studies show that ghee doesn’t seem to affect bad cholesterol (LDL) levels, yet people’s responses to saturated fat intake are highly variable. \\n\\nPeople whose LDL cholesterol levels tend to increase in response to high saturated fat intake may want to limit their ghee or butter intake to one or two tablespoons per day. \\n\\nAnother concern about ghee is that during production at high heat, its cholesterol may become oxidized. Oxidized cholesterol is linked to an increased risk of several diseases, including heart disease. \\n\\nAs more research is done, we will begin to learn more about the various health benefits and side effects of ghee. \\n\\n '"}, "time": 1742561978.563248}