{"duration": 0.14675354957580566, "input_args": {"text": "'GREENVILLE, Del.  —   The state beverage of Delaware is milk, and as Angelina Squillace was stocking it in a grocery store here, she paused, in response to a question, to think about what else defined this state. “It’s like, tax free,” said Ms. Squillace, 17, referring to her home state’s zero percent sales tax, “and it’s Joe Biden. That’s really what it is. ” The handover of presidential power in Washington, 110 miles away, has brought joy to many in the country and thoroughly unsettled others. But here in Delaware, it foretold an especially bittersweet adjustment. The end of the vice presidency of Joseph R. Biden Jr. has dimmed an   spotlight on a state that, even its own residents admit, can sometimes get lost in the shuffle. “There’s this big joke, people say, ‘ ? ’” Karen Friday, 48, a   mother in Hockessin, Del. said as she waited recently at the Wilmington train station  —   which is named after Mr. Biden  —   for a friend to disembark. “He’s contributed so much to letting people know who we are. ” “I think,” said Bob Jones, 72, a shoe shiner at the station, “he’s the   person we ever had. ” Mr. Biden was born in Scranton, Pa. (and he speaks of it often) but he moved to Delaware as a young teenager and has considered it home, more or less, since. Over some 36 years of commuting from here to his job in the United States Senate, and after eight years as the No. 2 man in the Obama administration, Mr. Biden has kept his indelible link, forged by family and framed by tragedy, to the nation’s   state. He owns a home here in Greenville, close to Wilmington, and is expected to keep spending weekends here even though he also plans to have a house in Washington. For decades, he has been Delaware’s biggest cheerleader, and the state has loved him right back. “One of the historians who specialized in Delaware history pointed out that he probably ranks in Delaware history at the same level as the Delaware leader during the Revolution who rode to Philadelphia to sign the Declaration of Independence,” said Joseph Pika, an emeritus professor of political science at the University of Delaware, referring to Caesar Rodney, who was a lawyer, a member of the Continental Congress and the president (governor in modern political view) of Delaware during most of the Revolutionary War. “There are people who if he put his foot in his mouth would say, ‘Oh that’s typical of Biden,’” Mr. Pika said. “That’s about the harshest criticism you would hear. ” The University of Delaware is Mr. Biden’s alma mater and he is planning some kind of partnership as he   civilian life, although the details are still hazy. “This is a time we could make history,” said Dennis Assanis, the president of the university. “He’s one of our most prominent alumni. ” Mr. Biden, who is 74, is also planning to have a center at the University of Pennsylvania, and to work on a cancer initiative. Mr. Biden had been a lawyer and a councilor for New Castle County  —   one of Delaware’s three  —   when he won his upstart bid for Senate in 1972, at the age of 29. His first wife and their daughter were killed in a car crash that injured his two sons. Mr. Biden took his oath of office at the bedsides of his sons and decided to come home every night, binding the state to his grieving family. “Everyone could relate to the tragedy that he experienced,” Mr. Pika said. He became a ubiquitous presence on the Amtrak train, commuting between Washington and Wilmington as he climbed the ranks in the Senate, and mounted his own failed bids for the presidency before he became the vice president in 2009 as Barack Obama’s running mate. “We’re not a big state that’s produced a lot of presidents or vice presidents  —   or any presidents or vice presidents,” said Mike Castle, the former Republican governor and congressman for Delaware who described himself as a friend of Mr. Biden’s, “and all of a sudden, one of our residents is plucked out to be the vice president of the United States. ” “It’s a real honor for us,” Mr. Castle added. Mr. Biden’s family remained closely linked to the state. His second wife, Jill, was a longtime community college teacher here (she now teaches in Virginia) and their daughter, Ashley, now runs a nonprofit organization in the state. But no one was more prominent than his son, Beau Biden, who became the state’s attorney general and was widely expected to become the state’s governor, before he died of a brain tumor in 2015. “Joe Biden stood for eight hours one day as mourners visited to give their condolences,” Mr. Pika said. “It was felt by the entire state. ” Other American statesmen have, of course, become closely associated with their home states. Everyone knows Abraham Lincoln is from Illinois, that the Bushes call Texas home, and that Ronald Reagan lived in California. But this is a state with a population the size of a large city, and one that so many Americans have simply driven through without stopping. So Mr. Biden, who knows everyone and always came back, looms large. “We really haven’t had national figures,” said Bill Gee, a commercial and real estate lawyer who sometimes sees Mr. Biden at the Wilmington Country Club, and had voted for him for Senate despite being a Republican. “It was kind of nice for little Delaware. ” Mr. Gee, like others here, pointed out that Delaware “punches above its weight,” like with the tax laws that have drawn scores of businesses to incorporate here. It is close to Washington, Baltimore and Philadelphia. And there are nice beaches. “If you said name something in Delaware, a lot of people would know DuPont,” Mr. Gee said, referring to the chemical company. “After that, hm, people know that we’re one of the large   states. ” While the state’s corporate clout is significant, it has, like much of the rest of country, shed manufacturing jobs, and even DuPont has had layoffs in recent years. Mr. Biden has “outlasted the DuPont reputation,” said Nancy Karibjanian, a former reporter who has covered Mr. Biden, and the director of the University of Delaware’s Center for Political Communication. “The sales tax is nice, but I think Joe Biden is in a category of his own. ” It helps that, in a state so small, it is easy to get to know the power players  —   and just about everyone else, too. Indeed, nearly every single person approached at random by a reporter on a recent day at Wilmington’s train station claimed to have personally met the man. “The very first year he ran for Senate, he was out campaigning in a strip shopping center, all by himself,” Margo Johnson, a retiree, recalled. “He just chatted it up with my mother. She just thought he was wonderful. ” Tyrone Young, 63, a denture maker, said he had waited in line for an hour and a half to pay his respects to the Biden family after Beau died. “That’s honor, dignity, respect,” Mr. Young said, adding that the Bidens “showed you the same thing. ” Mr. Biden speaks often of his love for the state. When he arrived at the train station here on Friday, after President Trump’s inauguration, he made a characteristic Joycean reference: “When I die, Delaware will be written on my heart. ” He sounded a similar note eight years ago, during a speech days before he and Mr. Obama were inaugurated. “Delaware,” Mr. Biden said, “I’d not be taking this journey were it not for you. ”'"}, "time": 1742562041.319148}