{"duration": 0.10851383209228516, "input_args": {"text": "'A photo of Philomena Kwao elicits a guttural “oof,” as in she’s so pretty it kind of hurts. Her eyes are serene but lively, her cheekbones and forehead elevated and her round chin narrow. Her look is distinctive, but not so much so that it distracts. In other words, Ms. Kwao has a face made for makeup  —   to show off its transformative power and the skill of its artists. But she and other “ ” models like her are largely ignored by the beauty industry. “Beauty brand work is nonexistent,” said Ms. Kwao, who is originally from London. “I’ve been lucky enough to do a few editorials in the U. K. but I’ve never even been on a casting for mainstream commercial work. When I try to understand it, I think people are scared to try something new. It’s like, ‘I have a formula, why change it? ’” There’s no size requirement to fit a lipstick, so why are there no curvy models in beauty? One view says the commodification of beauty is to blame. “Beauty is about imagining where you may be in the future,” said Brooke Erin Duffy, an assistant professor at Cornell University who specializes in feminist media studies and consumer culture. “Imagining yourself looking like a celebrity or model. That promise of future reward creates need. ” Dr. Duffy points out that this idealized, aspirational woman will usually look one way  —   patrician features, tall, typically white and thin. This fashionable ideal was born out of the classism and racism of the 1920s, she says, when American consumer culture and the modeling industry burgeoned simultaneously. While some elements of that ideal shifted over time, the body standard remains. “People often cite the 1950s as a time when curviness was in, but that’s not entirely true,” said Elizabeth Wissinger, author of “This Year’s Model” and a professor of fashion studies at the City University of New York’s Graduate Center. “Yes, curvy bodies were popular, but the people had those achievable, accessible physiques, represented by movie stars like Marilyn Monroe. Fashion was still very separate and models were thin. ” Practical and business forces are at work, too. “  models are obviously needed in fashion because there are   clothing lines,” said Jennie Runk, a curvy model who gained popularity after a 2013 HM swimwear campaign. “But when you’re thinking about images where bodies aren’t involved, there’s not much discussion of size diversity yet. ” Fashion companies may garner publicity and good will when they feature curvy models. Ostensibly, beauty companies would not get that same   boost, because bodies aren’t involved in their advertising imagery. “Also, people just don’t think to go to plus agencies or boards,” Ms. Runk said. On an agency site, the first faces you’ll see are those of “ ” models. If an agency does have a curve board, it’s a few clicks away, leaving casting directors unlikely to see (and subsequently book) a curve model unless they’re actually looking for one. There have been some exceptions. In the 1990s, the   model and TV personality Emme Aronson became a spokesmodel for Revlon cosmetics. Queen Latifah has been the face of CoverGirl’s Queen Collection, a makeup line for dark skin tones, for more than a decade. In a partnership with the television drama “Empire,” CoverGirl featured Gabourey Sidibe, one of the show’s actresses. And four years ago, MAC did a collection with the musician Beth Ditto. “There is no formula,” said James Gager, creative director and senior vice president, of MAC Cosmetics, speaking of how the company picks its collaborators. “If a model has confidence in who she is and how she carries herself, size is irrelevant. ” Even so, he added: “People are accustomed to seeing beauty in a singular way, and it takes time to open up. I see MAC as part of this change. ” Gary Dakin, who ran Ford Model’s plus board until 2012 and then opened his own agency, JAG Models, also acknowledged this: “I know the casting directors are pushing for size diversity, and agents are pushing for it,” he said. “What’s the disconnect here?” The problem, as he sees it, is that the industry is celebrity driven. “Companies want that name, but that doesn’t necessarily sell,” he said. “That’s hurt this cause more than anything. ” Beauty contracts are modeling’s holy grail  —   highly visible and lucrative. So they are reserved for a small pool of top actresses, pop stars and   models. Because the   category is still niche in the American market, it’s harder for those models to reach household name status. But that is all beginning to change. “Instagram has given the girls a voice,” said Becca Thorpe, a former model who is now agent to Muse NYC’s curvy models. “I can push them in a new way. Companies get to know what a model is about and whether or not that persona aligns with their brand. If they’re looking for different, bold and street, they’re going to start looking at Instagram. ” The   Paloma Elsesser’s unpretentious,   vibe is skillfully articulated through her Instagram account, which caught the attention of the makeup artist Pat McGrath. Last fall she chose Ms. Elsesser as a face for her makeup brand Pat McGrath Labs. “There is something exquisite in the mix of eccentricity and beauty,” Ms. McGrath said. “Paloma is an outspoken voice for body positivity and diversity within the beauty and fashion industry. Beauty brands are slowly starting to embrace diversity, but there is still much progress to be made before women of all colors, sizes and gender and sexual identities are equally represented. I am able to do this is because I am doing this [line] on my own terms. ” The model and lifestyle blogger Clémentine Desseaux also jostled the industry late last year when she posted an Instagram video of herself wearing Christian Louboutin red lipstick, looking windblown and unassuming in Paris. The video went viral, and though the relationship between brand and model was unofficial, the public saw possibility. “Everyone was going crazy to see a bare face wearing red lipstick. It was unusual  —   kind of a clash between this posh brand and something raw and natural,” Ms. Desseaux said. Perhaps most promising is the growing mainstream appeal of curvy models. Ashley Graham, a model on the cover of this year’s Sports Illustrated swimsuit issue, introduced a nail polish collection in May with Sephora’s Formula X. That month, she also Instagrammed some   photos with Revlon product (though no formal relationship exists at this point). Iskra Lawrence, known for her unretouched lingerie and swimwear campaigns with the lingerie retailer Aerie, is amassing a large following. Her fierce, sometimes cheeky   advocacy frequently goes viral, like a     selfie posted in May and captioned: “I do this so I can eat what I want (in moderation). I haven’t dieted, calorie counted or in 6 years weighed myself. ” That candor and relatability may yet land her a beauty contract. “I’m always working to increase my platform,” Ms. Lawrence said. “I think when curvy models do that, beauty brands will start to work with us, too. I’m not afraid of showing my skin  —   my dream is to do an unretouched beauty campaign. We can make change happen if we make enough noise. ”'"}, "time": 1742563212.970069}