{"duration": 0.02236151695251465, "input_args": {"text": "'WASHINGTON, DC  —   The Director of National Intelligence (DNI) has warned that deliberate leaks of “sensitive or classified” U. S. government information by “trusted insiders” will “remain a significant threat” during President Donald Trump’s tenure. [DNI Daniel Coats’ warning can be found in the latest World Wide Threat Assessment unveiled during a Senate Intelligence Committee hearing last week.  “Trusted insiders who disclose sensitive or classified US Government information without authorization will remain a significant threat in 2017 and beyond,” notes the assessment, authored by the U. S. intelligence community. “The sophistication and availability of information technology that increases the scope and impact of unauthorized disclosures exacerbate this threat. ” What Coats describes sounds similar to what has come to be known as the “deep state,” which refers to entities within and outside the federal government colluding to prevent a democratically elected leader from implementing his agenda. Breitbart News reported: The term “deep state” has been used to refer to deliberate leaks designed to undermine the president, but also to the willing collusion of elements of the mainstream media, the latent distrust and suspected opposition of elements of the intelligence services, but also the willing resistance of certain career civil servants in the agencies charged with carrying President Trump’s directions to fruition. Specifically, the primary purpose of the “deep state is to undermine a democratically elected leader’s agenda and ultimately overthrow that leader. A “deep state” is primarily powered by a steady drip of classified information, much like what has been taking place under the Trump administration. Nevertheless, various mainstream media outlets have dismissed the existence of an American “deep state” working against the Trump administration as a conspiracy theory. The “deep state” involves an intricate network comprised of government insiders, often made up of individuals from the military and intelligence communities. Many media outlets described concerns voiced by President Trump and his supporters about the intelligence community and other components of the government leaking classified information as paranoia. Through the threat assessment, the intelligence community itself is warning that the disclosure of classified information by “trusted” government insiders is not only real but also poses a “significant threat. ” The Worldwide Threat Assessment also warns against foreign actors, including some from Latin America, seeking to infiltrate the U. S. government. It reports: The United States will face a complex global foreign Intelligence threat environment in 2017. We assess that the leading state intelligence threats to US interests will continue to be Russia and China, based on their services’ capabilities, intent, and broad operational scope. Other states in South Asia, the Near East, East Asia, and Latin America will pose local and regional Intelligence threats to US interests. For example, Iranian and Cuban intelligence and security services continue to view the United States as a primary threat. Penetrating the US national decision making apparatus and the Intelligence Community will remain primary objectives for numerous foreign intelligence entities. Additionally, the targeting of national security information and proprietary information from US companies and research institutions involved with defense, energy, finance,   technology, and other areas will remain a persistent threat to US interests. Besides foreign governments like Russia and China,   criminals will also seek to undermine America’s intelligence community by recruiting American government insiders to obtain information and conduct surveillance. “  entities, including international terrorists and transnational organized crime groups, are likely to continue to employ and improve their intelligence capabilities including by human, technical, and cyber means. As with state intelligence services, these   entities recruit sources and perform physical and technical surveillance to facilitate their illicit activities and avoid detection and capture,” points out the threat assessment. In 2016, the threat assessment also warned that “insiders who disclose sensitive US Government information without authorization will remain a significant threat in 2016. ”'"}, "time": 1742628581.918111}