{"duration": 2.0113954544067383, "input_args": {"text": "'Contact Us Woman Facing Jail For Giving Water To Thirsty Pigs Pigs have been known to courageously jump into water to rescue drowning children., but this woman is facing jail for giving water to pigs that were in \"sever distress\"   , World // 0 Comments \\nGiving water to thirsty pigs on a hot day can now lead to jail time, as has been proven by a Toronto woman who is on trial and facing sentencing for doing just that. \\nAnita Kranjc tells her story : \\nOn a scorching hot day in June 2015, I gave water to thirsty pigs on board a transport truck headed for the slaughterhouse. As the (now famous) video of the incident shows, the driver jumped out of the cab, telling me to stop. I replied with a reference to the Bible: “Jesus said, ‘If [they] are thirsty, give them water.’” \\nThe driver shouted back, “These are not humans, you dumb frickin’ broad!” \\nHe called the police, and now I’m on trial in a Canadian court for criminal mischief. \\nWhen someone is suffering, I believe it is wrong to look the other away. It doesn’t matter if the sufferer has two legs or four or asks for help in words we can understand or with body language that is just as easy to comprehend. Leo Tolstoy, an ethical vegetarian and one of my inspirations, wrote, “[W]e should take pity on animals in the same way as we do on each other. And we all know this, if we do not deaden the voice of our conscience inside us.” \\nThe pigs I was trying to help on that fateful day were undoubtedly suffering. Crammed into a transport truck on a sweltering day, these helpless animals – covered with their own excrement, being crushed together and slowly suffocating from heat – stared at me through the trailer’s metal slats with their pleading eyes. As Dr Armaiti May, a veterinary expert, testified during my trial, some of the pigs were foaming at the mouth and in “severe distress”, appearing to breathe as quickly as 180 breaths per minute. \\nI think we have not only a right but also a duty to help suffering animals. Toronto Pig Save , the group that I helped start with my dog Mr Bean in 2010, has continued to give water to thirsty pigs to this day. Our approach is to collectively bear witness to ill-fated animals at the end of their miserable lives and hold weekly vigils outside slaughterhouses. \\nA slaughterhouse might seem like the last place that animal lovers would want to be, but for us – as for the Quakers, Greenpeace and similar groups – bearing witness is about being present at sites of great injustice. Our personal contact puts a face on the nameless numbers, to borrow from Charles Dickens, and helps people see animal victims as unique individuals who want to live. \\nThere’s little doubt in my mind that if those were dogs in distress in that truck instead of pigs, my actions would be applauded and it would be the driver facing charges instead. This double standard should have everyone questioning the ethics of the meat, dairy and egg industry, our legal system and our food choices. Like dogs, pigs are friendly, loyal and sensitive animals who have a strong sense of self and intelligence. They are playful and affectionate: they love to snuggle. They feel love and joy, but also pain and fear. They possess protective feelings for their families and friends. Pigs have been known to courageously jump into water to rescue drowning children. \\nIn Esther the Wonder Pig, a New York Times bestseller , Esther’s human dads attest to the porcine internet star’s big personality, her keen intelligence and her sense of humor. Our laws need to be changed to reflect this: all animals should be treated as thinking, feeling individuals under the law, because that is what they are. They are not property, nor cogs in the machine, with numbered tags slapped on their ears. \\nHumans need to recognize that we are also animals and that we are all interconnected. We are like animals in all the ways that matter – we feel pain, we suffer, we grieve, we are afraid of being killed and we get thirsty on a hot day. By showing people this, we hope we will reach their hearts so they will feel what animals feel. Then finally we will be able to end the horrific suffering at farms and slaughterhouses and shift towards a nonviolent plant-based economy. \\nWe are all in this together, humans and pigs. I am, quite literally, because I am facing jail time for giving pigs some small comfort in their final moments. My trial resumes 1 November. The cruelty inflicted on pigs at animal farms and slaughterhouses touches all of us, by harming animals, by polluting the environment, by harming our health and our conscience when we consume the products of this suffering. By bearing witness to animals in distress, we discover the unity of life.'"}, "time": 1742563008.5823607}