{"duration": 0.0651237964630127, "input_args": {"text": "'Louisiana Election Officials Seize Voting Machine Illegally Placed In Private Room For ‘VIP Voters’ (VIDEO) By Stephanie Kuklish   \\nElection officials in Louisiana seized a voting machine on Wednesday that’s purpose was to serve “VIP” voters so that they could skip voting lines, an illegal and suspicious tactic by the longtime Jeffrey Parish Registrar Of Voters, Dennis DiMarco. \\nThe unique voter machine was kept in a conference room and only allowed “special” citizens to use it. Allegedly it was meant for the purpose of allowing citizens such as police officers, fireman, emergency physicians, and anyone else with a job that may keep them from being available during voting hours. \\nMeg Casper, a spokeswoman for Louisiana Secretary of State Tom Schedler’s office, told the Huffington Post that the machine was seized immediately and the user’s names have been retrieved. Schedler wrote a letter to DiMarco stating : “I feel this action is necessary to preserve the transparency and integrity of early voting and to promote confidence within the general public regarding the voting process.” \\nLouisiana state law says that : “Each voting machine shall be placed inside the polling place and shall be in full view of the public from the time the election begins until the last elector has voted. The commissioners and watchers shall be stationed near the voting machines, and the commissioners shall regulate the admission of the voters thereto, and each shall always be in full view of the other election commissioners and watchers and, as far as possible, of the public.” \\nApparently the Registrar of Voters, DiMarco, wasn’t aware of his own laws and replied with a statement saying: \\n“There was no fraudulent votes; they’re no allegations about that. No allegations of anyone voting who was not entitled to vote. Now, we’ve turned down everybody. So no one gets preferential treatment. But again, that means that those firemen, those policemen, are standing up rather than maybe doing their duty on the streets.” \\nIf Louisiana requires every police officer, firemen, and other emergency personnel to work every day all day long then maybe we should be taking a look at that instead of refusing to acknowledge the law. \\nOr maybe the Republican party should stop pushing so hard for limited early voting hours after fanning the flames of Republican presidential nominee’s unfounded claims that the election is rigged. Featured Image Via Gambit About Stephanie Kuklish \\nI am a 30 something writer passionate about politics, the environment, human rights and pretty much everything that effects our everyday life. To stay on top of the topics I discuss, like and follow me at https://www.facebook.com/keeponwriting and https://facebook.com/progressivenomad . Connect'"}, "time": 1742563767.425573}