{"duration": 0.19252252578735352, "input_args": {"text": "\"Looks like that slippery little scut Marco Rubio dodged a bullet! Well done, DSCC! \\nCorruption \\n“Clinton Foundation: Inurement” [ Amy Sterling Cassill ]. Word of the day: “The concept of “inurement” is one that most nonprofit organization board members should be familiar with. In common language, “inurement” is a concept that means a board member, donor, or employee can’t benefit excessively from the organization’s funds.” \\n“Donald Trump’s Companies Destroyed Emails in Defiance of Court Orders” [Kurt Eichenwald, Newsweek ]. Oppo garbage truck unloads…. \\nWar Drums \\n“Harry Reid’s incendiary claim about ‘coordination’ between Donald Trump and Russia” [ WaPo ]. \\nBut there is no public evidence to support Reid’s claim of actual “coordination” between the Trump campaign and the Russian government. And were that to be the case, it would be a scandal of epic proportions. Asked what evidence exists of such a connection, Reid spokesman Adam Jentleson cited classified briefings. “There have been classified briefings on this topic,” Jentleson said. “That is all I can say.” \\nNudge nudge wink wink. Say no more! Say no more! \\nThe Voters \\n“Signs Grow of Another Third-Party Fizzle” [ Wall Street Journal ]. “But it appears increasingly likely that no outside candidate will take a meaningful chunk of the national vote, as seemed plausible in the early summer. The combined clout of Mr. Johnson and Ms. Stein fell from 17% of registered voters in July to 9% in the most recent Wall Street Journal/NBC News poll. The running RealClearPolitics polling average of all four candidates is even less generous, showing Mr. Johnson and Ms. Stein dropping from around 12% at various times this summer to just 7% now.” \\nRealignment \\n“Would Trump “Make a Deal” With The Left?” [ Michael Tracey ]. I doubt it. And would the Left make a deal with Trump? Still, if the deal were to prevent a war… \\nThe Trail \\n“FT endorsement: For all her weaknesses, Clinton is the best hope” [ Financial Times ]. \\n“Donald Trump has a path to victory again thanks to Florida” [ WaPo ]. “Remember that winning Florida isn’t a luxury for Trump — it’s a necessity. If Clinton wins the 18 states (plus D.C.) that every Democratic presidential nominee has carried between 1992 and 2012, she has 242 electoral votes. Add Florida’s 29 to that total and Clinton is at 271 and the election is over.” \\nDemocrat Email Hairball \\n“How Clinton plans to deal with Comey’s October surprise” [ Politico ]. “Projecting confidence” and “galvanizing supporters.” Those are the talking points? Really? Seems a little meta. \\nStats Watch \\nPersonal Income and Outlays, September 2016: “Personal income rose a solid but slightly lower-than-expected 0.3 percent” [ Econoday ]. “Inflation data are mixed to soft. … Yet the core rate, which excludes food & energy, failed to show much lift…. The consumer wasn’t putting September’s increase in income into savings as the savings rate edged 1 tenth lower to what is a still respectable 5.7 percent.” But: “Personal consumption has been the major driver of GDP since the end of the Great Recession. Last Friday’s 3Q2016 GDP showed this was no longer true – and this month’s consumption (last month of 3Q2016) does show some life in consumption – but the 3 month rolling average did decline – and year-over-year growth was unchanged from last month” [ Econintersect ]. \\nChicago Purchasing Managers Index, October 2016: “The Chicago PMI has been bumpy all year and is once again for the October report, down 3.6 points at 50.6 to indicate abrupt month-to-month slowing in composite activity” [ Econoday ]. “New orders are part of the slowing as is production. Signs of strength come from employment, which is back into the expansion column, and from prices paid.” \\nDallas Fed Manufacturing Survey, October 2016: “The month’s advance indications on factory conditions have shown isolated strength as does the October report from the Dallas Fed where production, though slowing, expanded for a fourth straight month” [ Econoday ]. “The general activity index did improve but still remains negative… [C]apital expenditures, at plus 8.7, are at a two-year high. Hours worked, however, are negative.” And: “This survey remained in positive territory but new orders and unfilled orders remain in contraction. This really is not that positive of a report” [ Econintersect ]. \\nThe Bezzle: “EINHORN SLAMS TESLA: ‘Years of over-promising and under-delivering from a promotional CEO'” [ Business Insider ]. \\nThe Bezzle: “U.S. authorities are investigating whether middlemen in the $5 trillion-a-day foreign exchange market posted fake bids, rigged auctions and gave confidential information to others who then profited from it, according to people familiar with the situation” [ Bloomberg ]. \\nHoney for the Bears: “We are forecasting marginal slowing of the economy – with the economy frozen in a condition of snails pace growth. The majority of sectors are not changing their rate of economic expansion” [ Econintersect ]. “One of our litmus test recession indicators is trucking employment – which is continuing in recession territory. Consider that rail movements, industrial production, and wholesale trade are all in contraction. Prior to the Great Recession, this would have been a 100% guarantee that a recession is underway.” \\nHoney for the Bears: “Where the Next Crisis Will Come From” [ Bloomberg ]. “Next year ends in a 7. If you’re superstitious or a little loose with statistics, that makes us due for another financial crisis. The biggest one-day stock drop in Wall Street history happened in 1987. The Asian crisis was in 1997. And the worst global meltdown since the Great Depression got rolling in 2007 with the failure of mortgage lenders Northern Rock in the U.K. and New Century Financial in the U.S…. Keep an eye on depressed lenders, shadow banks, and China.” \\nPolitical Risk: “A Little-Noticed Fact About Trade: It’s No Longer Rising” [ New York Times ]. “[The Hanjin bankruptcy] was a moment that made literal the stagnation of globalization…. The United States is no exception to the broader trend. The total value of American imports and exports fell by more than $200 billion last year. Through the first nine months of 2016, trade fell by an additional $470 billion. It is the first time since World War II that trade with other nations has declined during a period of economic growth…. But there are also signs that the slowdown is becoming structural. Developed nations appear to be backing away from globalization.” \\nPolitical Risk: “How do I protect myself if Trump is elected?” [ Calculated Risk ]. “Quite a few readers have asked me this question. My usual answer is that I expect Ms. Clinton to be elected President, and that the expansion will continue…. The general rule is don’t invest based on your political views. However policy does matter for investing and the economy. As an example, it was obvious to invest in oil when George W. Bush became President. And insurance companies like United Healthcare and Aetna seemed like good bets with a President Obama.” So, Halliburton with Clinton? Raytheon? General Dynamics? Lockheed Martin does a lot of IT, so I guess that would be a two-fer… \\nRapture Index: Unchanged [ Rapture Ready ]. Close: 189. Record High: 189. \\nToday’s Fear & Greed Index: 31 Neutral (previous close: 34, Fear) [ CNN ]. One week ago: 53 (Neutral). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Oct 31 at 1:09pm. Nice work, Huma. \\nBlack Injustice Tipping Point \\n“Facebook advertisers can exclude racial groups in housing ads” [ USA Today ]. Well, that’s appalling. And another Silicon Valley company above the law! \\n“The KKK was originally a giant, lucrative pyramid scheme” [ Quartz ]. The KKK made its members pay for their own sheets from a monopoly supplier! (The Nazi Party made its members pay for their uniforms, too.) \\nCorruption \\n“A $72-million apartment project. Top politicians. Unlikely donors.” [ Los Angeles Times ]. “No one is registered to vote at the run-down house on 223rd Street. The living room window has been broken for months. A grit-covered pickup sits in the dirt front yard with a flat tire. Yet dozens of donations to local politicians — totaling more than $40,000 — have come from four of the people who have lived there over the last eight years.” That’s so dumb. If you want to launder money, you set up a family foundation. What’s wrong with these people? \\n“When CIA and NSA Workers Blow the Whistle, Congress Plays Deaf” [ The Intercept ]. \\nNews of the Wired \\nOh dear: Leave it to @twitter to demonstrate in its own survey that it has no idea why people use Twitter. pic.twitter.com/AFc8njltNf \\n&mdash; Thomorrow Wong (@7homwon6) December 11, 2015 \\nPersonally, I use Twitter to curate a network of news sources and personal contacts, a task for which Facebook is miserably unsuited. It’s really unfortunate that Twitter is controlled by stupid money, and that Twitter’s management hates its users. Where’s the damn edit button? \\n“Facebook’s Free Basics Is an African Dictator’s Dream” [ Foreign Policy ]. “But there’s a dark side to Free Basics that has the potential to do more harm than good — a side that suggests that Zuckerberg doesn’t get Africa after all. The app is essentially a cheap version of the internet, a fact that by itself implies that some people aren’t good enough to merit the whole thing. Even worse, it’s a version of the internet that gives Facebook — and by extension the corporations and governments that partner with Facebook — total control over what its users can access.” \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (AM): \\nAM writes: “From Rehoboth, MA courtesy of my mother in law.” I have these flowers too. Since I want them, they aren’t weeds! \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate 0 0 0 0 0 0 This entry was posted in Water Cooler on by Lambert Strether . About Lambert Strether \\nLambert Strether has been blogging, managing online communities, and doing system administration 24/7 since 2003, in Drupal and WordPress. Besides political economy and the political scene, he blogs about rhetoric, software engineering, permaculture, history, literature, local politics, international travel, food, and fixing stuff around the house. The nom de plume “Lambert Strether” comes from Henry James’s The Ambassadors: “Live all you can. It’s a mistake not to.” You can follow him on Twitter at @lambertstrether. http://www.correntewire.com\""}, "time": 1742564072.918993}