{"duration": 0.04702472686767578, "input_args": {"text": "'0 Add Comment \\nA $250 million Hollywood blockbuster detailing Ireland’s heroic victory over New Zealand has been greenlit. \\nA joint production between Disney and RTÉ, the national broadcaster is set to sell off the Fair City set for scrap in a bid to raise the necessary funding to recreate the 40-29 victory for an epic 9 hour film, with several sequels already rumoured. \\nTipped to win ‘all the Oscars’ by Irish rugby fans who have just learned of the movie’s existence, tickets to the movie’s premier in the Aviva stadium have sold out, with some tickets selling online for 6-figure sums. \\n“This project really appealed me right after learning of the final whistle, and I couldn’t pass up the chance to play the entire Irish squad myself,” actor Daniel Day Lewis explained at the press launch announcing the beginning of production. \\nHowever, it is unclear when the movie will make its way to cinemas as Day Lewis is famed for his extensive preparation for roles. \\n“Daniel is expected to join Blackrock’s junior cup team this year before progressing with his junior cert studies, then he will be captaining the senior cup side. So it may be several years before he feels he can boss a game like Sexton and Murray,” explained joint directors of the movie Steven Spielberg and Martin Scorsese. \\nSuch is the unconfined joy created by the 40-29 victory many of the fans in attendance in Chicago are cashing in on the famous win. \\n“My mate Dave is doing a one man show called ‘I Was There’, he’s sold out 40 dates in Vicar Street,” explained Dublin woman Andrea Hooley, “I’ve had 8 proposals of marriage from old boyfriends after I posted a picture of myself at the game on Facebook, I won’t take any of them up on the offer but I could probably get a holiday out of one of them”. \\nWe Beat Them, We Actually Fucking Beat Them is slated for release sometime in the next few years.'"}, "time": 1742561997.5225847}