{"duration": 0.033238887786865234, "input_args": {"text": "'Chris Rock’s return to   Saturday night in New Orleans after a   hiatus was crashed by none other than fellow comedian Dave Chappelle. [According to the   a   Chappelle took the stage at the Saenger Theatre and treated the audience to an unscheduled 30 minutes of material. “Tonight, you are all part of a social experiment. Stranger things have happened in New Orleans,” he said.  Chappelle reportedly riffed on Rock’s rough divorce, Bill Cosby, and the controversy over the LGBTQ jokes he had made during his   Netflix special. Rock, the night’s headliner, later joined his longtime friend onstage and the pair spent the next hour cracking jokes   . During their banter, the New Orleans Advocate reports, Rock asked, “Did Trump do anything today?” “No, he’s still languishing in that failure of a health care bill,” Chappelle reportedly responded, adding “I think Donald Trump is gonna save America by accident. ” Cellphones were reportedly confiscated at the door, so fans couldn’t comment on the evening’s events on social media. “Oh, you wish you had your phones, right?” Rock joked. As their shared set came to a close, Chappelle reportedly turned to the crowd and said “I just realized this might be one of the flyest things I’ve ever been a part of. “The only thing better would be if Eddie Murphy lowered from the rafters,” he added. The    Chappelle’s Show star made headlines in November when he appeared to defend Trump and blast former Democratic presidential candidate Hillary Clinton during a secret   set in New York, saying that the media had “twisted” Trump’s words on an Access Hollywood tape and adding that Clinton was “not right” for the presidency. Ball so hard . Best show ever pic. twitter.   —   Chris Rock (@chrisrock) March 26, 2017,  Saturday night’s show in New Orleans kicked off Rock’s Total Blackout Tour, which was set to continue Sunday and Monday night at the Saenger Theatre. Chappelle, meanwhile, has a string of shows in Austin, Texas beginning Sunday,   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628593.1463592}