{"duration": 0.0677495002746582, "input_args": {"text": "'Political leaders on both sides of the debate in Britain over whether to leave the European Union are now saying distinctly different things about some central issues than what they said before the referendum. Here are some examples. BEFORE Prime Minister David Cameron, who led the “Remain” campaign, said that if the country voted to leave, he would begin the formal process of leaving the union immediately by sending what is called an Article 50 notification to Brussels. He also said he would try to remain as prime minister. AFTER The morning after the referendum, Mr. Cameron said he would resign once a successor could be chosen and would leave it to his successor to issue the notification. BEFORE The “Leave” campaign promised that Britain would be  able to save 350 million pounds a week, or about $462 million as of Monday, that could be spent on the National Health Service, schools and housing. A slogan on the Leave campaign bus went further, promising explicitly to use that money to “fund our N. H. S. instead. ” (The savings figure was widely disputed by economists, Remain campaigners and the Office for National Statistics.) AFTER Leave leaders, including Nigel Farage of the U. K. Independence Party, and Boris Johnson and Iain Duncan Smith of the Conservative Party, maintained that they had never promised that £350 million a week would be given to the N. H. S. Mr. Duncan Smith called the figure “an extrapolation. ” Mr. Farage said that the £350 million claim was “one of the mistakes that, I think, the Leave campaign has made” and that anyone who voted to leave because of the promise “made a mistake doing that. ” BEFORE George Osborne, the chancellor of the Exchequer, warned that a vote to leave would touch off an economic crisis that would require the government to adopt an emergency budget with spending cuts and tax increases. AFTER In an effort to calm the financial markets, which plunged after the referendum, Mr. Osborne said on Monday that Britain had the resources to weather the immediate crisis and that an emergency budget could wait until Mr. Cameron’s successor had taken office and assembled a new cabinet. BEFORE Leave campaigners promised to swiftly reduce the number of immigrants coming to Britain from other parts of Europe, which Mr. Johnson said could not happen while Britain remained in the union. Michael Gove, the justice secretary and an ally of Mr. Johnson’s, said a vote to leave would “bring down the numbers” by 2020. AFTER “Frankly, if people watching think that they have voted and there is now going to be zero immigration from the E. U. they are going to be disappointed,” said Daniel Hannan, a prominent Leave advocate and member of the European Parliament. To keep vital access to the European single market after leaving the union, Mr. Hannan acknowledged to the BBC, Britain would have to accept free movement of workers, as Norway and other nonmember states have.'"}, "time": 1742563293.5170598}