{"duration": 0.09713435173034668, "input_args": {"text": "'ORLANDO, Fla.  —   Amid the massacre at a gay nightclub here, while the gunman held dozens of people hostage, the police got word from multiple sources that the killer had   himself, hostages and the building with explosives, Orlando’s mayor said on Wednesday. Holed up in Pulse nightclub early Sunday, the gunman, Omar Mateen, told the police by phone that he would strap explosives to four hostages and place them strategically in the corners of the building, Mayor Buddy Dyer told reporters. People trapped inside made panicked calls and text messages to 911 operators, friends and family members, also warning that Mr. Mateen was talking about bombs, he said. “We had a lot of information from the inside and they independently were saying yes, the bomber is about to put on an explosive vest,” Mr. Dyer said. So far, investigators have not found any evidence that Mr. Mateen, 29, had explosives, senior law enforcement officials said Wednesday. His rampage with an assault rifle and a handgun left 49 people dead and 53 wounded, the worst mass shooting in United States history, and he died in a shootout with law enforcement officers. Investigators continued looking into whether his wife, Noor Zahi Salman, knew what he had planned, but at a news conference, officials deflected questions about possible criminal charges against her. “I’m not going to speculate with respect to any charges that might be brought,” said A. Lee Bentley III, the United States attorney for the Middle District of Florida. “We’re not sure what charges will be brought, or if charges will be brought. ” Ms. Salman has told F. B. I. investigators that she had tried to talk her husband out of some kind of attack, according to senior law enforcement officials. But she also told them that she had gone with him to buy ammunition, and that she had once driven him to Pulse, they said. Ronald Hopper, an assistant agent in charge of the F. B. I. ’s Tampa office, urged patience with investigators, who he noted were still analyzing a complex crime scene. He also appealed for the public’s help in retracing Mr. Mateen’s movements, as investigators scour his past for motives or possible accomplices. Efforts to parse Mr. Mateen’s motivation have revealed strands of Islamist radicalism, bigotry, mental illness and even    —   one possibility being investigated was that he was gay. Mr. Mateen had expressed hatred of gays and made contradictory claims of links to terrorist groups. His former wife has said he abused her. In talking with the police on Sunday, he pledged allegiance to the Islamic State. News 13, a local cable news channel, reported that the gunman also called the station during the siege and declared his allegiance to the group. Mr. Dyer confirmed reports that Mr. Mateen had been driving around the night of the slaughter, visiting locations, possibly casing potential targets for an attack. But Mr. Hopper said investigators believed that Pulse was the gunman’s intended target. One woman who escaped the nightclub unharmed said Wednesday that she was angry that, after an initial exchange of gunfire with Mr. Mateen, police officers pulled back and settled into a standoff, rather than quickly forcing a confrontation. “By the time I came out and came around I told the officers that he’s already shot at least a hundred rounds, and I told the officers on my way out that there was already at least 20 people that were dead,” said the woman, Jeannette McCoy, 37, of Orlando. “I wanted this guy dead,” she said, but instead, “they gave him so much time. And I’m yelling at the officers like, ‘This is what my tax dollars go to? You’re supposed to be there to protect and serve.’ You can’t tell me this occurred at 2 o’clock in the morning and finally at 5 o’clock in the morning is when you finally decide to go ahead and shoot him?” On Wednesday, signs, flowers, balloons, candles and beaded necklaces dotted the area, some with inscriptions for loved ones lost. In front of the Fire Department’s Engine No. 5 firehouse, less than 150 feet from Pulse on Orange Avenue, dozens of American flags were planted in the grass. Law enforcement agencies shrank the cordon around the nightclub, allowing access to several blocks most businesses in the area remained closed Wednesday, although a Chipotle restaurant reopened. Across the street, an Ace Hardware store was open this week, supplying water and   fans to officers, but traffic has been sparse. “We usually get about 450 to 600 customers per day, but we’ve only pulled in about 300 over the last three days,” said Mike Williams, an assistant manager. The immediate area around the club remained   with mobile command posts parked nearby and F. B. I. agents combing through the crime scene. Several cars that were abandoned in Pulse’s parking lot on Sunday still had not been removed. The possibility that Mr. Mateen might have had bombs sheds some light on the decision by police commanders to storm the building Sunday morning, breaching an outer wall with explosives and an armored vehicle. John Mina, Orlando’s police chief, has said that they had reason to believe they were facing an “imminent loss of life,” but he did not offer details. Survivors of the siege said they were searched by the police when they escaped the club or were rescued, to make sure they did not have explosives or guns on them. The threat of explosives also accounts for the delay of several hours before the building was cleared and bodies removed, “because all indications were that it was ” Mr. Dyer said. “When the shooter was killed, you could see a battery pack right next to him, which would indicate to us that there’s a detonator of some sort,” he said. “There was also a bag near his body, so you would logically lead to the conclusion that the bag contained explosives and he had some type of detonator that could have been a pressure detonator that was under the body. ” Officials in Florida have been reluctant to discuss Mr. Mateen’s academic career, including his stint at an alternative school. But on Wednesday, TCPalm. com, a local news site, published excerpts from his elementary and middle school records that depicted him as a troubled student. “The main factor prohibiting Omar from success in school is not that the work is too hard, but rather his difficulties in conforming to   rules,” one document, addressed to Mr. Mateen’s father, said. According to the website, which did not say how it had obtained the documents, Mr. Mateen “talked frequently of violence and obscenities” as a child and was the subject of 31 disciplinary actions from 1992 to 1999.'"}, "time": 1742563397.1818335}