{"duration": 0.042096614837646484, "input_args": {"text": "'Hotel CEO Caught Celebrating Using Government to Make Airbnb Illegal So They Can Price Gouge Home / Badge Abuse / Enraged Cop Flips Out When Her Car is Towed for Illegal Parking — Pulls Gun on Tow Truck Driver Enraged Cop Flips Out When Her Car is Towed for Illegal Parking — Pulls Gun on Tow Truck Driver Matt Agorist May 2, 2016 29 Comments \\nOrange County, FL — Deputy Tracy Weiss was off-duty last month when she noticed that her illegally parked truck was being towed. The way she acted next could have landed a normal person in jail. However, because Weiss is a deputy with the Orange County Sheriff’s department, that will likely not happen. \\nWhen Weiss noticed that her truck was being towed, she jumped into another vehicle and then drove the wrong way down a one-way street to block the driver in who had towed her car. \\nWhen she exits the vehicle, according to the tow truck driver, she had her gun drawn. When he saw the gun, the driver pulled out his camera phone and began to record. \\n“I’m a cop. Drop my truck,” yelled Weiss. \\n“You need to put your gun away,” replied the driver. \\n“You see a gun?” Weiss asked, acting as if she didn’t have one once she saw the camera. \\n“Yes. It’s in your pocket,” the driver said. \\n“I am a cop,” she yelled. “You’re going to f**king jail for stealing my car.” \\n“I’m not going to jail,” the driver responded. \\n“Whatever,” Weiss said before storming off to wait for backup. \\nWhen deputies arrived on scene, they confirmed that Weiss did, in fact, have a gun. \\n“She had a gun in her hand pointed at me,” said the driver. \\nIn a small victory for the driver, the deputies refused to back up Weiss and allowed him to tow the truck as he was well within the law to do so. Also, instead of the normal impound fee of $62.50, Weiss had to pay double as she held the driver up for more than 15 minutes. \\nAfraid that deputies may single him out later, the tow truck driver chose to remain anonymous. But he did say that had Weiss approached him calmly he would have gladly given her the truck back free of charge. \\n“That’s when I was even more shocked that I was seeing that kind of behavior from a deputy. That would be the last person I would expect to be behaving that way,” the driver said. “I expected a little bit different from a professional. (They’re someone) that’s supposed to be trained to handle situations like this.” \\nAccording to a report obtained by WFTV, Weiss is no angel. Weiss’ disciplinary record revealed she was suspended in 2008 for violating OCSO’s use of authority policy. \\nWeiss was suspended for 21 hours without pay after she was accused of acting inappropriately regarding a business arrangement, the Sheriff’s Office’s said. \\nAccording to the Sheriff’s Office, the incident is now under an internal investigation, but there will not be a full report until the investigation is complete. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist Share'"}, "time": 1742628408.6468313}