{"duration": 0.015637636184692383, "input_args": {"text": "'Twitter   Biz Stone has rejoined the company to “guide the culture” of the platform. [In a post published to Medium yesterday under the title “What’s Happening With Me,” Stone announced his return to the company that he helped create. “I worked at Twitter for about six years. In that time, the service grew from zero people to hundreds of millions of people. Jack was the original CEO and when he returned I was very happy. ” wrote Stone, “There’s something about the personality of a company that comes from the folks who start it. There’s a special feeling they bring with them. Jack coming back was a big step forward. And now, it’s my turn —  I’m returning to   work at Twitter starting in a couple of weeks! How this came about is kind of a crazy story but, it’s happening. ”  Stone recounted a story of Twitter CEO Jack Dorsey asking Stone to return to the company during a company party, Stone initially was unsure that Dorsey was serious but after a short conversation following the party, agreed to come back to Twitter. “While we were on stage, Jack asked me to come back to work at Twitter. People cheered. But I wasn’t really sure if he meant it. After Tea Time, we spoke privately and Jack told me that he really did  —   he wanted me to come back and work at Twitter. The company I   the service I  . I was stunned, but I knew the answer. ” Stone stated that his new position at the company is to guide the company culture and feeling. “My top focus will be to guide the company culture, that energy, that feeling. This is where Jack, and Twitter’s inestimable CMO, Leslie Berland, feel I can have the most powerful impact. It’s important that everyone understands the whole story of Twitter and each of our roles in that story. I’ll shape the experience internally so it’s also felt outside the company. More soon. ” wrote Stone. Stone continued to say, “I’m not replacing anyone at Twitter. Somebody mentioned I’m just filling the “Biz shaped hole” I left. You might even say the job description includes being Biz Stone. Ev said it best when I told him about this turn of events, “Well, you’re among the best in the world at being Biz Stone. ” (I’ve worked with him for fifteen years so I recognize his compliments). ” Stone finished his post saying “Twitter has woven itself into the fabric of our global society. The world needs Twitter, and it’s here to stay. I’m so lucky that I get to step back in and help shape its future. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742628511.8828237}