{"duration": 0.11309099197387695, "input_args": {"text": "'Valentina Sampaio is one of those leggy, lush brunette models for which Brazil is famous. And it was her striking beauty and “sparkling personality,” the French Vogue editor Emmanuelle Alt said, that led her to feature the    on the magazine’s March cover. Ms. Alt wrote in her editor’s letter that transgender people are “the ultimate of a rejection of conformity”  —   the sort of “icons that Vogue supports and chooses to celebrate. ” French Vogue is not the first fashion magazine to feature a transgender model on its cover. Hari Nef appeared on Frische, a   fashion and art magazine, in 2014 Andreja Pejić was on Marie Claire Spain a year ago and Ms. Sampaio on Elle Brazil last October, to name a few. But the action was groundbreaking for the Vogue empire as well as the French fashion establishment, in part because of the cover line  —   “Transgender beauty: How it’s shaking up the world”  —   below Ms. Sampaio’s face. Ms. Alt wrote that being transgender “is a detail one would prefer not to have to mention,” adding that Ms. Sampaio was not on the cover only for her looks “but because despite herself she embodies an   arduous struggle to be recognized and not be perceived as something Other, a gender exile. ” French Vogue’s editorial choices have long pushed social limits. In the 1970s, it published sexually charged images by Guy Bourdin and Helmut Newton, most notably Mr. Newton’s 1979 picture of Gia Carangi, fashion’s first openly lesbian model, wearing an Yves Saint Laurent evening gown and being seduced by an androgynous woman in a Saint Laurent tuxedo. (It is worth noting that Ms. Sampaio greatly resembles Ms. Carangi.) In 2007, Carine Roitfeld, then the French Vogue editor, ran a Bruce   cover of the   blonde Carolyn Murphy horsing around with Andre J. a black, bearded androgynous model who was wearing a   mini trench. Still, the fact that the current issue reached newsstands the same week that President Trump reversed federal policy protecting some rights of transgender students  —   and during a French presidential campaign in which   populism looms  —   made Ms. Alt’s cover statement that much more pointed. Jonathan Newhouse, the chairman and chief executive of Condé Nast International, the parent company of French Vogue, called the cover a brilliant decision. “It reinforces the power of the Vogue brand as a bold, innovative and highly relevant voice in the worlds of journalism and fashion,” Mr. Newhouse said. “I am not aware of any commercial impact, either positive or negative. My impression is a lot of people liked it. ” Olivier Lalanne, the magazine’s deputy editor, said the public response had been “positive and encouraging” with “no backlash at all for the moment. ” Ms. Sampaio concurred. “I’ve only had supercool feedback,” she said last week. On her Instagram feed, @valentts, her following has shot up by several thousand to more than 53, 000, and the Vogue cover image has received laudatory comments such as “You are beautiful,” “History made” and “#finally. ” It helps that Mert Alas and Marcus Piggott, the photographers who shot the cover and its accompanying fashion story, were careful to avoid clichés or fetishizing Ms. Sampaio. The magazine published two cover versions: In one, Ms. Sampaio shimmers in a gold lamé Saint Laurent evening gown, her   eyes piercing a haunting violet light in the second, a   she is bathed in a flare of fuchsia. For the fashion spread, Ms. Alt dressed Ms. Sampaio in a series of sexy 1970s throwbacks, such as a Louis Vuitton   sheer black gown over a black cutout bodysuit a Balenciaga red poppy print blouse and skintight pants and a pair of slouchy Dolce  Gabbana leopard print sequined pants, her naked torso and modest breasts painted gold. “It’s not gratuitous,” Mr. Lalanne said. “It makes sense as a story, therefore it doesn’t shock. ” Ms. Sampaio, who grew up in Aquiraz, a fishing town in northern Brazil, said, “I always felt like a girl. ” She refused to reveal what her name was before she chose Valentina, or when she transitioned, but did allow that her father, a fisherman, and her mother, a schoolteacher, “were always supportive and are very proud” of her choice. Her schoolmates accepted her, too, “since they already saw me as a little girl. ” She was studying fashion when she was discovered by a makeup artist a few years ago and signed by a modeling agency based in São Paulo. At first, there were a few “incidents,” as she puts it  —   clients who refused to hire her because she was transgender  —   and she considered giving up her new career. But after other transgender models, like Ms. Pejić, Ms. Nef and Lea T, Riccardo Tisci’s muse, moved firmly into the fashion mainstream, Ms. Sampaio found herself working steadily for magazines and on the runways. Last year, L’Oréal produced a short film about Ms. Sampaio, which it released on International Women’s Day. She is now one of the brand’s ambassadors. It was Mr. Alas and Mr. Piggott who brought Ms. Sampaio to the attention of Ms. Alt and Mr. Lalanne. “They found her beautiful,” Mr. Lalanne said. “And we agreed. ” Ms. Sampaio traveled to London for the shoot in December and had no idea it included the cover until she was on the set. “For Vogue to shine a light on someone who changed her sex when it is such a hotly debated topic projects a calming image of tolerance,” Mr. Lalanne said. “Fashion is freer than other domains in the arts. It opens doors, and we are able to highlight people who are social antagonists. So we have. ” As for Ms. Alt, she said she longed for the day when a transgender person “poses on the front cover of a fashion magazine and it is no longer necessary to write an editorial on the subject. ” Only then, she said, “will we know that the battle is won. ”'"}, "time": 1742561650.7331219}