{"duration": 0.03759622573852539, "input_args": {"text": "'JPMorgan is, once again, paying money out to federal regulators for its chronic criminal activity. The latest payment of $264 million comes after it was discovered that the Too Big To Fail/Jail bank hired the relatives of Chinese government officials to win business in China—a clear violation of the Foreign Corrupt Practices Act (FCPA). \\nAccording to the Department of Justice, JPMorgan will pay a $72 million criminal penalty to the Department of Justice, a civil penalty of $61.9 million assessed by the Federal Reserve, and a $130.5 million disgorgement to the Securities and Exchange Commission (SEC), for a total of $264.4 million in fines. \\nIn its statement, the SEC claimed “investment bankers at JPMorgan’s subsidiary in Asia created a client referral hiring program that bypassed the firm’s normal hiring process and rewarded job candidates referred by client executives and influential government officials with well-paying, career-building JPMorgan employment. During a seven-year period, JPMorgan hired approximately 100 interns and full-time employees at the request of foreign government officials, enabling the firm to win or retain business resulting in more than $100 million in revenues to JPMorgan.”\\nAmazingly, the corrupt practices were so common at JPMorgan that company executives used “Referral Hires vs Revenue” spreadsheets to show how the bribes were paying off. Not a single referral was denied, even though many of the children, relatives, and friends of the Chinese elite were not qualified for the jobs they received.\\nIn fact, some of the hires were so incompetent they were referred to within JPMorgan as “photocopiers.” So much for meritocracy.\\nJPMorgan executives certainly knew they were violating FCPA, but the money was just too good. And, given the Justice Department’s track record of not prosecuting individual law breakers on Wall Street, what did they have to lose? JPMorgan’s criminality is pretty rational when analyzed fully.\\nWhile US regulators are happy to celebrate the fines, the Chinese government appears less-than-enthusiastic about diving into the scandal. The Financial Times speculates this may be because the Chinese anti-corruption authority, known as the Central Commission for Discipline Inspection (CCDI), has no idea where an investigation into the hiring program will take them. \\nGiven the large amount of Chinese government business steered JPMorgan’s way (over $100 million) it seems likely the Chinese officials involved are people of considerable influence. CCDI typically targets lower-level officials and, when it goes high, it has the support of the Communist Party, which is, after all, the ruling authority in China.\\nLike most countries, China does not have the ridiculous light touch for corruption that the US has. If cited for corruption in China, a government official or businessperson is likely to go to jail. JPMorgan has broken the law perpetually and has yet to face serious consequences, despite a new 2015 directive at the Justice Department to hold individual corporate executives accountable for wrongdoing. \\nThe post JPMorgan Pays $264 Million Fine For Bribing Chinese Officials appeared first on Shadowproof .\\n'"}, "time": 1742562836.1287184}