{"duration": 0.05405259132385254, "input_args": {"text": "'The nation’s largest abortion business is hoping to “turn the whole internet Planned Parenthood pink” on Wednesday so its supporters can “feel the groundswell of support from our movement. ”[Planned Parenthood Federation of America (PPFA) is asking its supporters to wear pink clothing, to #PinkOut their profile photos on Facebook and Twitter with a special image filter, to take a special “I Stand with Planned Parenthood” pledge, and to “join the Thunderclap” on social media.  “Now that we’ve stopped the immediate attack on patients’ access to care at Planned Parenthood health centers, it’s time to regroup and start building towards our vision for the future  —   one that truly invests in reproductive health,” PPFA says. The group is celebrating the failed GOP American Health Care Act (AHCA) which did not fully repeal Obamacare and which also contained a provision to defund the abortion giant for one year. Kentucky Rep. Thomas Massie (R) who changed his vote against the AHCA from “No” to “Hell No,” also emphasized the   nature of the provision to defund Planned Parenthood: I take it GOP leadership still hasn’t told Trump the PP provision was a 1yr bait and switch?  See page 23 of CBO https:  .  https:  .   —   Thomas Massie (@RepThomasMassie) March 26, 2017,  Planned Parenthood’s “#PinkOut” day comes as undercover journalists at the Center for Medical Progress (CMP) reveal a video allegedly showing Dr. DeShawn Taylor, a Planned Parenthood abortionist, complaining about having to transfer a   aborted baby with signs of life to the hospital in Arizona, a state she describes as “conservative. ” When journalists asked her if there is “any standard procedure for verifying signs of life?” Taylor responds by saying, “The key is you need to pay attention to who’s in the room, right?” In 2015, CMP began its series of videos that ultimately led to allegations that Planned Parenthood and its partners in the biotech field worked to sell the harvested body parts of aborted babies for a profit. “The only difference between Planned Parenthood’s barbaric abortion business, and that of the notorious Dr. Kermit Gosnell, is that Gosnell was not so careful as to ‘pay attention to who’s in the room,’” CMP project lead David Daleiden says. “Elected officials must stop forcing taxpayers to subsidize Planned Parenthood’s criminal abortion business, and the Department of Justice must immediately open a full investigation and prosecute Planned Parenthood to the fullest extent of the law. ”'"}, "time": 1742563552.2628012}