{"duration": 0.11643409729003906, "input_args": {"text": "'When Debbie Antonelli got the phone call from CBS Sports a month ago, asking her if she was interested in working this year’s N. C. A. A. men’s basketball tournament as an   analyst, she said, “Yes, of course. ” How could she not be? After 29 years as a sideline reporter and analyst at hundreds of games, after thousands of miles traveling and thousands of hours studying teams and plays and players, Antonelli, 52, was being asked  —   finally  —   to be a leading voice at what she considers basketball’s Super Bowl. Her husband, Frank, congratulated her. Her three sons were excited, too. “My sons said a few ‘wows’ and ‘Ooh, I hope you get this team and that team,’” Antonelli said Wednesday in a phone call from the   line at her youngest sons’ high school. “But my coolness factor lasted about three minutes. ” I like the way her sons think. In 2017, why must it be news that a woman like Antonelli, who has worked men’s games since the   was chosen as a broadcaster for two rounds of men’s N. C. A. A. tournament games? Women have broadcast   men’s games for years. Doris Burke, who calls N. B. A. games for ESPN and ABC, has been a staple of broadcast coverage for two decades, and Jessica Mendoza, the Olympic softball player, has had a leading role in ESPN’s baseball coverage since 2015. In 2015, Beth Mowins, who had called college football games for years, became the second woman to work as a    announcer for an N. F. L. game. What makes Antonelli’s recent hiring remarkable, though, is just how long it has been since the last woman, Ann Meyers Drysdale, worked on an N. C. A. A. men’s tournament broadcast. Meyers Drysdale helped call two rounds  —   in 1995. I asked Antonelli about that yawning gap, and she couldn’t explain it, saying, “I don’t have the answer for that. ” I asked Meyers Drysdale about it, too, and she was just as perplexed. “To me, gender is not that big a deal,” she said. “A    is a   . There are plenty of people qualified to call the game, and plenty of them are women. “You might want to ask who’s in charge of the hiring. ” So I called Sean McManus, the chairman of CBS Sports, and did just that. “I don’t really know the answer to that question,” he admitted, “except probably it was easy to keep assigning the cast of regulars to the tournament. It just wasn’t on our radar screen. ” The thing is, McManus said he had watched and admired Antonelli, who is under contract with ESPN, for so many years that he couldn’t pinpoint the date when he had first noticed her. And when, he said, someone at CBS brought up her name this year  —   along with the idea to use her broad expertise in an analyst’s role, rather than for infrequent hits as a sideline reporter  —   the group decided, “Boy, that’s a ” But if it was a   why did two decades go by without someone thinking of hiring her? It could be, McManus said, that Antonelli works for ESPN, and CBS Sports didn’t think it could hire her away for the tournament, which the network ended up doing quite easily this year. Or, he said, it was “probably just an oversight and a little bit of a lack of creativity, perhaps. ” McManus was clear that Antonelli had finally been hired because of her expertise, because of her reputation for preparation and good work  —   and not because she is a woman. Antonelli knows that her big chance will come with   pressure to succeed, in terms of her getting another shot, and for all women who want to be treated equally in roles that remain, to many, male domains. “There’s no margin for error if you hear a woman’s voice during a broadcast,” Antonelli acknowledged. “If you make a mistake, they’ll say, ‘It figures.’ And they will blame it on me being a woman. ” Antonelli tries not to think about that. Instead, she thinks about basketball. A North Carolina native and   starter on N. C. State’s team, she began her broadcasting career calling Ohio State women’s games. And from there, she never stopped. Dayton’s men. Missouri Valley Conference contests. Her Twitter bio reads like a bowl of alphabet soup: The W. N. B. A. CBS. ESPN. Raycom. She has called the Women’s Final Four on radio and worked the A. C. C. men’s tourney on television. One thing she has not done, though, is dwell on being a woman in sports. “I know this is a big issue for women, for me to work these games, and I think it’s a sad state of affairs that this is the case,” she said. “Just look at the generations of girls who have played this game and how far they have come. But this is still an issue? I don’t even think about the woman part of it. I think about being an athlete. ” Also on her mind: doing the job well. When CBS Sports announced that Antonelli would join its broadcasting team, she was in her car, trying to focus on the two games she would be working that night at the A. C. C. women’s tournament in Conway, S. C. Texts, phone calls and emails poured in, all offering congratulations. Antonelli marked the moment in a familiar way: She drove straight to a Waffle House and ordered her usual: a bacon, egg and cheese sandwich, with a cup of coffee. She will get her assignments after the bracket is filled on Sunday. Until then, Antonelli has no time to waste, no time to debate critics on Twitter, no time to pat herself on the back for breaking into a man’s realm. No time, because she has work to do.'"}, "time": 1742562067.3632677}