{"duration": 0.1530609130859375, "input_args": {"text": "'Andrew Cyrille opens one of his two new albums, “The Declaration of Musical Independence,” with a syncopated figure on a snare drum, as taut and riveting as a military cadence. Then he adds cymbals and kick drum, giving the phrase a sinuous curve just as the rest of the band enters. What they’re playing is “Coltrane Time,” an obscure piece by John Coltrane, and Mr. Cyrille shows the way forward with a regal, flowing  . He has been working this way more or less since the 1960s, reshaping jazz’s rhythmic syntax while engaging with its lineage. A tireless workhorse in the   Mr. Cyrille, 76, deserves substantial credit for helping to unlock a freer pulse and purpose in the music, slipping away from a metronomic framework while preserving a rigorous attention to form. “I used to spend time with older jazz drummers like Philly Joe Jones and Max Roach,” Mr. Cyrille said in a recent interview from his home in Montclair, N. J. “They would always say, ‘You’ve got to make your contribution.’ So that was always in my head. When you find yourself, you have to find your path. ” Mr. Cyrille’s entire body of work suggests a fulfillment of that conviction, carried out with little concern for outside approval. He still hasn’t been named a National Endowment for the Arts Jazz Master, the lifetime achievement honor bestowed on some of his former collaborators, like the pianists Cecil Taylor and Muhal Richard Abrams and the multireedist Anthony Braxton. But Mr. Cyrille has managed something just as meaningful, bringing his ideas into increasingly mainstream circulation without a hint of dilution. His work on fine recent albums by the pianist David Virelles and the bassist Eric Revis, and with the collective Trio 3, begin to make the case for a   renaissance. (Trio 3, with Oliver Lake on alto saxophone and Reggie Workman on bass, will be at Dizzy’s Club   on Oct. 27.) Both “The Declaration of Musical Independence” and “Proximity,” a duo recording with the saxophonist Bill McHenry, bolster that impression, if not close the case entirely. A pair of albums with divergent sonic features but a similar ethos of discovery, they highlight Mr. Cyrille’s insight, ingenuity and subtle mastery of touch. “There’s so much clarity in his playing,” said the guitarist Bill Frisell, who appears on “The Declaration of Musical Independence” alongside Richard Teitelbaum on synthesizers and piano and Ben Street on bass. “It doesn’t swallow you up. And he strikes this perfect balance between instigating something and also responding to what’s going on around him. That’s the most amazing feeling in music, and Andrew’s got that really strong. ” Mr. Cyrille is a gregarious conversationalist, quick to illustrate any point. Born in Brooklyn to Haitian immigrants, he recalls being a small child and accompanying his mother to community meetings, where the great hand drummer Alphonse Cimber would often be playing. He honed his skills in almost every conceivable setting, from high school orchestra to Brooklyn jazz bars. He studied at Juilliard even while holding a gig with the Nigerian drummer Babatunde Olatunji. By the   when he started working with Cecil Taylor, he had a wealth of experience to draw from. “I had been playing dances and parties, bar mitzvahs and polkas,” he said. “I had been in the drum and bugle corps. ” Mr. Cyrille had also provided musical accompaniment for classes associated with the June Taylor Dancers, improvising rhythmic cues for kinetic movement. “That’s, in a sense, how I learned to solo,” he said. “So when I got with Cecil, I was able to do all of that stuff. One time he asked me, ‘How do you hear rhythm?’ I said, ‘I hear it in relationship to dance. ’” During a more than   tenure with Mr. Taylor, who set a high bar for free improvisation, Mr. Cyrille refined new rhythmic strategies. His freedom of expression on the job was absolute, so it was up to him to establish a style that, in his words, “was concrete, and in acknowledgment of people like Kenny Clarke, Philly Joe Jones, Art Blakey and Max Roach. ” Mr. Cyrille also prioritized a kinship with his fellow   drummers. He learned “Coltrane Time” from Rashied Ali, Coltrane’s last drummer, who passed it along like a family heirloom. In 1974, Mr. Cyrille released the album “Dialogue of the Drums,” a collaboration with Milford Graves. “Pieces of Time,” released a decade later, features Mr. Cyrille and Mr. Graves alongside Mr. Clarke, a bebop progenitor, and Famoudou Don Moye, of the Art Ensemble of Chicago. One track from “Pieces of Time”  —   the jaunty “Drum Song for Leadbelly,” inspired by one of that bluesman’s old recordings  —   resurfaces on Mr. Cyrille’s new album with Mr. McHenry. “Proximity” otherwise features a balance of simmering idylls and   sparring sessions, with drums and saxophone always mutually engaged. The album is lean and dry but hardly austere: It feels dynamic and fully realized, a product of intense   exchange. “The Declaration of Musical Independence” has a more ethereal footprint, partly because of the instrumentation: Mr. Frisell is a guitarist who can evoke the flicker of sunlight and shadow, and Mr. Teitelbaum favors the abstraction of sculptural sound. At Mr. Cyrille’s behest, every musician on the album contributed a new tune, and they created a few others on the spot. “Begin,” by Mr. Frisell, is a brief dose of swinging mischief “Say,” by Mr. Street, is a gorgeous, watery ballad. The composition that Mr. Cyrille brought in was “Dazzling (Perchordially Yours),” a process piece in which each musician elaborated on an assigned set of chords, finding common purpose through trial and error. Playing the tune with brushes, Mr. Cyrille sketches a tempo with clear forward motion but no strict cadence. “One can define time as ‘the duration of that which changes,’” he said, briefly letting the phrase sink in. “We think of time as something like     or a clock that goes ‘ticktock, ticktock.’ But people who lived before clocks, they would look at the sun or the moon, see when the rooster started crowing. That meant ‘time’ for them. So it would change. ” He went on, “How you deal with it, from one moment to the next, depends on the culture that you come from. ” Then he laughed, but in a way that made it clear he was serious. Cecil Taylor, ‘Unit Structures’ (Blue Note, 1966) This album, deservedly a   landmark, presents Mr. Cyrille as the ideal improvisational partner, meeting every swarm and surge in Mr. Taylor’s pianism with his own rumbling poise. Leroy Jenkins, “Space Minds, New Worlds, Survival of America” (Tomato, 1978) The violinist Leroy Jenkins made this album in a contemporary classical vein, with Mr. Teitelbaum on synthesizer, George Lewis on electronics and Mr. Cyrille in alert and supple form. Andrew Cyrille  Maono, “Metamusicians’ Stomp” (Black Saint, 1978) Mr. Cyrille featured several of his compositions on this earthy and exploratory album, featuring a captivating young tenor saxophonist, David S. Ware, alongside the slashing trumpeter Ted Daniel. Milford Graves, Andrew Cyrille, Kenny Clarke, Famoudou Don Moye,  “Pieces of Time” (Soul Note, 1984) An intergenerational drummer’s summit featuring compositions by all four members (Mr. Cyrille has two) and a spirit of selfless camaraderie. Trio 3 + Vijay Iyer, “Wiring” (Intakt, 2014) The powerfully insightful collective Trio 3  —   Oliver Lake on alto saxophone, Mr. Workman on bass, Mr. Cyrille on drums  —   has made several fine recent albums with guest pianists. This one, featuring Mr. Iyer, is a knockout.'"}, "time": 1742563972.803893}