{"duration": 0.041500091552734375, "input_args": {"text": "'On the first day of confirmation hearings for Federal Appeals Court Judge Neil Gorsuch to be named as a Supreme Court Justice, Sen. Ted Cruz ( ) reminded the Democrats, who one after another criticized the nominee, that during his confirmation hearing a decade ago for the federal seat he holds now, not one Democrat  —   including Sens. Hillary Clinton and Barack Obama  —   voted against Gorsuch. [“A decade ago, Judge Gorsuch was confirmed by this committee for the Federal Court of Appeals by a voice vote,” Cruz said. “He was likewise confirmed by the entire United States Senate by a voice vote without a single Democrat speaking a word of opposition.  “Not a word of opposition from Minority Leader Chuck Schumer,” Cruz said. “Not from Harry Reid, or Ted Kennedy, or John Kerry. ” “Not from Senators Feinstein, Leahey, or Durbin, who still sit on this committee,” Cruz said. “Not even from Senators Barack Obama, Hillary Clinton, or Joe Biden. ” “Not a one of them spoke a word against Judge Gorsuch’s nomination a decade ago,” Cruz said. Cruz said that not only did President Donald Trump play an unprecedented role in the selection of a justice to replace the late Justice Antonin Scalia by telling the American people of the 21 people  —   including Gorsuch  —   who would be under consideration if he were elected president, but the voters weighed in. Thus, Gorsuch was “no ordinary nominee,” Cruz said. “His nomination carries with it a super legitimacy that is also unprecedented in our nation’s history,” Cruz said. “The American people played a very direct role in helping choose this nominee. ” Cruz also noted that since Democrats voted for Gorsuch’s federal judgeship 10 years ago, his outstanding record since then should make confirming him even easier. Notwithstanding its leftist political leanings, the American Bar Association (ABA) earlier this month gave Gorsuch a “well qualified” rating to serve as a justice on the U. S. Supreme Court. The ABA has three ratings for judicial nominees: not qualified, qualified, and well qualified. The ABA’s standing committee on the federal judiciary was unanimous in granting Gorsuch its highest rating.'"}, "time": 1742563129.9787405}