{"duration": 0.03139090538024902, "input_args": {"text": "'Getty - Josh Edelson \\nThe Yale Record, America’s “oldest college humor magazine,” taunted the IRS on Thursday by essentially endorsing Hillary Clinton for president by “not” endorsing her. \\nThe magazine is a tax-exempt 501(c)3 organization, meaning they are prohibited from engaging in political activities. \\nThe Yale Record is walking a tightrope as it relates to their non-profit status. Read the editorial board\\'s post below: \\nIn its 144-year history, The Yale Record has never endorsed a Democratic candidate for president. In fact, we have never endorsed any candidate for president. This is, in part, due to our strong commitment to being a tax-exempt 501(c)3 organization, which mandates that we are “absolutely prohibited from directly or indirectly participating in, or intervening in, any political campaign on behalf of (or in opposition to) any candidate for elective public office.” \\nThis year’s presidential election is highly unusual, but ultimately no different: The Yale Record believes both candidates to be equally un-endorsable, due to our faithful compliance with the tax code. \\nIn particular, we do not endorse Hillary Clinton’s exemplary leadership during her 30 years in the public eye. We do not support her impressive commitment to serving and improving this country—a commitment to which she has dedicated her entire professional career. Because of unambiguous tax law, we do not encourage you to support the most qualified presidential candidate in modern American history, nor do we encourage all citizens to shatter the glass ceiling once and for all by electing Secretary Clinton on November 8. \\nThe Yale Record has no opinion whatsoever on Dr. Jill Stein. \\n—The Editorial Board of The Yale Record \\nAny reasonable reader would infer that the editorial board is indeed supporting Clinton for president. The only question is whether the paper gave itself enough legal wiggle room before publishing what might as well be a full-throated endorsement. Image Credit: Jemal Countess/Getty Images \\nHere\\'s what the IRS has to say on the matter: \\n“...tax-exempt organizations described in section 501(c)(3) of the Internal Revenue Code are prohibited from participating or intervening in any political campaign on behalf of, or in opposition to, any candidate for public office. Charities, educational institutions and religious organizations, including churches, are among those that are covered under this code section.\" \\n[...] \\n“These organizations cannot endorse any candidates, make donations to their campaigns, engage in fund raising, distribute statements, or become involved in any other activities that may be beneficial or detrimental to any particular candidate. Even activities that encourage people to vote for or against a particular candidate on the basis of nonpartisan criteria violate the political campaign prohibition of section 501(c)(3).\" \\nThe Yale Daily News faced similar controversy when it openly endorsed Clinton. The paper wouldn\\'t confirm its non-profit status to The Daily Caller and called the matter a “misunderstanding.” '"}, "time": 1742628579.4421084}