{"duration": 0.08736991882324219, "input_args": {"text": "'Home / Be The Change / Flex Your rights / Google Search Results for ‘Pathological Lying’ Return Clinton Photo in Epic Act of Trolling Google Search Results for ‘Pathological Lying’ Return Clinton Photo in Epic Act of Trolling Claire Bernish October 31, 2016 Leave a comment \\nDespite a full month of revelations from Hillary Clinton campaign chair John Podesta’s emails published on a near daily basis by Wikileaks that, in a non-dystopian year, would utterly ruin an average candidate’s bid for the presidency, the corporate press has laughingly maintained its fealty to the former secretary of state. \\nSo, assumedly fed up with the farce, someone — or, rather, a group of someones — took matters into their own hands Sunday night to flatly prove the point by linking a Google search for the term “pathological lying” directly to an image of Ms. White House Hopeful and two-time FBI investigation subject, Hillary Clinton. \\nIn the “featured snippet block,” as Google terms it, Clinton’s image appeared next to the preview for and link to the Wikipedia entry for “Pathological lying,” along with the cursory definition, stating: \\n“It is a stand-alone disorder as well as a symptom of other disorders such as psychopathy and antisocial, narcissistic, and histrionic personality disorders, but people who are pathological liars may not possess characteristics of the other disorders. Excessive lying is a symptom of several mental disorders.” \\nClinton’s mendaciousness has proven itself time and again, whether during testimony concerning her use of a personal server for business during and after her tenure as secretary of state, to claiming she had no memory of sardonically joking about assassinating Wikileaks founder Julian Assange with a drone hit. \\nBut beginning on October 28, as can be seen in the Wikipedia edit history , someone decided they’d had enough with the corporate presstitutes’ continued excuses made for the benefit of Clinton’s continued campaign, and changed the pathological lying entry to reflect as much. \\n“Added the only person who has a proven track record for being a Pathlogical [sic] liar. References can be easily looked up on wikileaks, most media sites, and thru congressional hearings,” the bold editor noted of their new addition. \\nIt would seem someone alert enough caught the edit and reverted the entry — but then another editor decided to try again the following day. \\n“I added a picture of a Pathological Liar,” the second editor noted. \\nAt one point, as the Huffington Post reported , someone deleted the entire page introduction and replaced it with, simply, “Hillary Clinton.” \\nNone of these edits went over too well with the Wikipedia moderators, and despite repeated attempts by the pranksters turned truth-tellers, the entry was eventually locked from any further edits until November 3rd due to “vandalism.” \\nAs the Washington Times noted , these rogue editors assumed public familiarity with Clinton’s less-than-honest record — none cited specific examples of actual lies. \\nHad they done so, there would have been a plethora from which to choose — perhaps most notoriously the subject of a reopened investigation by the FBI. \\nClinton, in fact, lied under oath in Congressional testimony concerning her private server when she claimed “there was nothing marked classified” in emails, either “sent or received.” \\nNot only were classified documents both sent and received over the unsecured server, but a handful were determined later to be “secret.” \\nWhile examples of Clinton’s lies, corruption, and collusion could easily fill entire volumes of work, nonetheless, she continues to be shown in a favorable light by the very corporate media outlets found to have worked in concert with her campaign behind the scenes. \\nAlthough Wikipedia’s Pathological Lying entry can’t be touched for at least a few more days, the epic prank certainly made the point — Hillary Clinton might indeed be a pathological liar. Share'"}, "time": 1742562174.9534638}