{"duration": 0.039557456970214844, "input_args": {"text": "'Interviews US Democratic presidential nominee Hillary Clinton stands with President Barack Obama during an election eve rally on November 7, 2016 in Philadelphia, Pennsylvania. \\nThe American people have “repudiated the foreign policy” of President Barack Obama and former secretary of state Hillary Clinton which was “a complete disgrace” for the United States, according to James Fetzer, an American scholar and political analyst. \\nProfessor Fetzer made the remarks in a phone interview with Press TV on Monday, days after Republican presidential nominee Donald Trump stunned the world by defeating the heavily-favored Democratic candidate, Hillary Clinton, in the November 8 election. \\nDuring the election campaign, Trump repeatedly expressed his willingness to work with Russian President Vladimir Putin and other leaders in order to resolve global problems, including the issue of Daesh terrorism, which he has blamed on the policies of the Obama administration. \\nOn the other hand, Clinton has shown eagerness to confront Russia and continue the interventionist policies US administrations have practiced since 9/11. \\nProfessor Fetzer said that “Clinton was behind the massacre of Libya, the butchery of Benghazi, the transfer of weapons to ‘rebels’ in Syria.” \\nMore than five years after the overthrow of Muammar Gaddafi, Libya has become a failed state, with the central government holding no sway over the country, and Africa’s wealthiest nation has become a haven for terrorist organizations. \\nAnd since 2011, the United States and its allies have been sponsoring terrorists wreaking havoc in Syria. \\nProfessor Fetzer stated that Clinton was being advised by Israeli intelligence, telling her \"how to conduct American foreign policy. It was a complete disgrace.” \\n“The American people have repudiated the foreign policy of Barack Obama and Hillary Clinton,” the scholar said. \\n“Donald Trump is going to restore a measure of sanity. He is going to end the wars in the Middle East. He is going to restore the reputation of the United States for integrity, and dealing with the international community,” he noted. \\n“He respects Russia as should any president of the United States, where Barack Obama and Hillary Clinton fell miserably short,” the analyst pointed out. \\n“I believe we are already seeing signs that the situation for the world community is going to vastly, dramatically improve, that the United States is going to conduct itself in accordance with international law, and restrain from regime change, and hopefully we will no longer be the greatest aggressor nation in the world,” Fetzer said in his concluding remarks. Loading ... '"}, "time": 1742564100.4674306}