{"duration": 0.05742931365966797, "input_args": {"text": "'After weeks of reports of severe exhaustion and ensuing hospitalization, Kanye West walked into Trump Tower on Tuesday morning. Journalists who caught a glimpse of the musician entering the tightly guarded building in Manhattan took to Twitter to document the strange spectacle. Mr. West’s appearance occurred shortly before former Gov. Rick Perry of Texas was named as   Donald J. Trump’s pick to lead the Energy Department  —   the same agency that Mr. Perry said during the 2012 presidential race that he wanted to abolish. For Mr. Trump, the visit was another   stuffed into a series of more consequential events, including the possibility of a showdown with Republicans in Congress over intelligence reports that Russia may have interfered in the election. Once Mr. West returned to the lobby with Mr. Trump, he didn’t provide much information about the reasons for his visit. “We’ve been friends for a long time,” Mr. Trump told reporters. Asked what he and Mr. West talked about, he responded: “Life. We discussed life. ” Mr. West’s visit was probably a welcome one for the  . It came hours after Mr. Trump’s   announcement on Monday that he would refrain from any new business deals with his real estate company while in the Oval Office. In addition, the focus this past week has been on Mr. Trump’s potential conflicts of interest as president, which would include the growing cadre of billionaires and multimillionaires he wants to install in his cabinet. There is also substantial interest around his choice for secretary of state: Rex W. Tillerson, the chief executive of Exxon Mobil, who has friendly ties with the Russians. For his part, Mr. West dodged questions about the possibility of performing at Mr. Trump’s inauguration in January. The rapper only smiled at reporters and said, “I just want to take a picture right now. ” It is unclear why the musician and sometime fashion designer stepped out from a reported recovery and into the center of the media circus at Trump Tower, but Hope Hicks, Mr. Trump’s spokeswoman, said in an email that Mr. West had requested the meeting. “The meeting was requested by Kanye and we were delighted to host him,” Ms. Hicks wrote, adding, “They had a very positive and productive conversation. ” She did not elaborate, but later in the afternoon, Mr. West said on Twitter that he wanted to meet with Mr. Trump to discuss “multicultural issues” that included “bullying, supporting teachers, modernizing curriculums and violence in Chicago. ” He added: “I feel it is important to have a direct line of communication with our future President if we truly want change. ” Much about Mr. West’s public presence has been a mystery of late. He abruptly canceled his Saint Pablo tour in November after a series of unsettling concert appearances. He was hospitalized in what was characterized in   dispatches as a “psychiatric emergency. ” In one   rant a few weeks ago, Mr. West voiced his support for Mr. Trump and ended the performance, much to the shock and disappointment of his fans. “Yeah, I’m taking his lead,” Mr. West said of Mr. Trump, after spending some time railing against the news media and praising Mr. Trump’s policy against political correctness. His statements, some of which targeted his contemporaries in the music industry, including Jay Z and Beyoncé, came weeks after his wife, Kim Kardashian West, was robbed at gunpoint in a Paris apartment. Mr. West has expressed interest in politics before,  declaring in a rambling speech last year that he wanted to run for president in 2020. He has also been an outspoken critic of politicians. In 2005, he lashed out at a sitting president on live TV, declaring during a   for Hurricane Katrina victims, “George Bush doesn’t care about black people. ” Mr. Bush later called Mr. West’s criticism a “disgusting moment” for his presidency. On Tuesday, Mr. West’s relationship with the Trump administration seemed to be off to a rosier start. When the two said their goodbyes, Mr. Trump leaned in to say something to Mr. West, then headed back into the elevator with his daughter Ivanka.'"}, "time": 1742563010.959808}