{"duration": 0.09510517120361328, "input_args": {"text": "'TRUMP DEFEATS CLINTON IN ELECTION STUNNER November 09, 2016 TRUMP DEFEATS CLINTON IN ELECTION STUNNER \\nRepublican Donald Trump stunned the world by defeating heavily favored rival Hillary Clinton in Tuesday\\'s presidential election, ending eight years of Democratic rule and sending the United States on a new, uncertain path. \\nA wealthy real estate developer and former reality TV host, Trump rode a wave of anger toward Washington insiders to win the White House race against Clinton, the Democratic candidate whose gold-plated establishment resume included stints as a first lady, U.S. senator and secretary of state. \\nPresident Barack Obama, who campaigned hard against Trump, telephoned the Republican to congratulate him on his victory and invited him to the White House for a meeting on Thursday, the White House said in a statement. Obama is due to speak later on Wednesday about the election. \\n\"Ensuring a smooth transition of power is one of the top priorities the President identified at the beginning of the year and a meeting with the President-elect is the next step,\" the White House said. \\nWorried that a Trump victory could cause economic and global uncertainty, investors were in full flight from risky assets. \\nThe U.S. dollar, Mexican peso and world stocks fell on Wednesday but fears of the kind of shock that wiped trillions of dollars off global markets after Britain\\'s \"Brexit\" vote in June have failed to materialize so far. \\nTrump collected enough of the 270 state-by-state electoral votes needed to win a four-year term that starts on Jan. 20, taking battleground states where presidential elections are traditionally decided, U.S. television networks projected. \\nHe appeared with his family before cheering supporters in a New York hotel ballroom, saying it was time to heal the divisions caused by the campaign and find common ground after a campaign that exposed deep differences among Americans. \\n\"It is time for us to come together as one united people,\" Trump said. \"I will be president for all Americans.\" \\nHe said he had received a call from Clinton to congratulate him on the win and praised her for her service and for a hard-fought campaign. \\nHis comments were an abrupt departure from his campaign trail rhetoric in which he repeatedly slammed Clinton as \"crooked\" amid supporters\\' chants of \"lock her up.\" \\nRepublicans also kept control of the U.S. Congress. Television networks projected the party would retain majorities in both the 100-seat Senate and the House of Representatives, where all 435 seats were up for grabs. \\nDespite losing the state-by-state electoral battle that determines the U.S. presidency, Clinton narrowly led Trump in the nationwide popular vote, according to U.S. media tallies. It would mark the second time in 16 years that a Democratic candidate lost the presidency despite winning more votes than the victor. In 2000, Democrat Al Gore got more votes than Republican George W. Bush. \\nAt Clinton\\'s election event a mile away from Trump\\'s victory party, an electric atmosphere among supporters expecting to see her become America\\'s first woman president dissipated. \\nClinton did not immediately make a concession speech, instead sending campaign chairman John Podesta out to tell her supporters to go home. \"We\\'re not going to have anything more to say tonight,\" he said. Clinton was expected to speak on Wednesday morning, an aide said. \\nPrevailing in a cliffhanger race that opinion polls had clearly forecast as favoring a Clinton victory, Trump won avid support among a core base of white non-college educated workers with his promise to be the \"greatest jobs president that God ever created.\" He did well in \"Rust Belt\" states such as Pennsylvania and Ohio. \\n\"Such a beautiful and important evening! The forgotten man and woman will never be forgotten again. We will all come together as never before,\" Trump wrote on Twitter early on Wednesday. \\nIn his victory speech, he said he had a great economic plan, would embark on a project to rebuild American infrastructure and would double U.S. economic growth. \\nTrump, who at 70 will be the oldest first-term U.S. president, came out on top after a bitter and divisive campaign that focused largely on the character of the candidates and whether they could be trusted in the Oval Office. \\nThe presidency will be Trump\\'s first elected office, and it remains to be seen how he will work with Congress. During the campaign Trump was the target of sharp disapproval, not just from Democrats but from many in his own party. \\nSTUNNED WORLD \\nForeign leaders pledged to work with Trump but some officials expressed alarm that the vote could mark the end of an era in which Washington promoted democratic values and was seen by its allies as a guarantor of peace. \\nDuring the campaign, Trump expressed admiration for Russian President Vladimir Putin, questioned central tenets of the NATO military alliance and suggested that Japan and South Korea should develop nuclear weapons to shoulder their own defense burden. \\nTrump has promised to warm relations with Russia that have chilled under Obama over Russia\\'s intervention in the Syrian civil war and its seizure of Ukraine\\'s Crimea region. \\nGovernments in Britain, China, Germany, Israel, Japan and Turkey, as well as Russia, congratulated Trump and said they would work with him. \\n\"It is not an easy path but we are ready to do our part and do everything to return Russian and American relations to a stable path of development,\" Putin said. \\nIsrael\\'s Benjamin Netanyahu said he hoped to reach \"new heights\" in bilateral ties underTrump. Chinese President Xi Jinping said Beijing and Washington shared responsibility for promoting global development and prosperity. \\nOther officials, some of them with senior roles in government, took the unusual step of denouncing the outcome, calling it a worrying signal for liberal democracy and tolerance in the world. \\n\"Trump is the pioneer of a new authoritarian and chauvinist international movement. He is also a warning for us,\" German Vice Chancellor Sigmar Gabriel said in an interview with the Funke newspaper group. \\nU.S. neighbor Mexico was pitched into deep uncertainty by the victory for Trump, who has often accused it of stealing U.S. jobs and sending criminals across the border. \\nTrump wants to rewrite international trade deals to reduce trade deficits and has taken positions that raise the possibility of damaging relations with America\\'s most trusted allies in Europe, Asia and the Middle East. \\nThe Mexican peso plunged more than 13 percent before recovering some ground. The peso had become a touchstone for sentiment on the election as Trump threatened to rip up a free trade agreement with Mexico. \\nTrump\\'s win raises a host of questions for the United States at home and abroad. He campaigned on a pledge to take the country on a more isolationist, protectionist \"America First\" path. He has vowed to impose a 35 percent tariff on goods exported to the United States by U.S. companies that went abroad. \\nCLINTON\\'S WEAKNESSES \\nTrump survived a series of seemingly crippling blows on the campaign, many of them self-inflicted, including the emergence in October of a 2005 video in which he boasted about making unwanted sexual advances on women. He apologized but within days, several women emerged to say he had groped them, allegations he denied. He was judged the loser of all three presidential debates with Clinton. \\nA Reuters/Ipsos national Election Day poll offered some clues to the outcome. It found Clinton badly underperformed expectations with women, winning their vote by only about 2 percentage points. \\nAnd while she won Hispanics, black and young voters, Clinton did not win those groups by greater margins than Obama did in 2012. Younger blacks did not support Clinton like they did Obama, as she won eight of 10 black voters between the ages of 35 and 54. Obama won almost 100 percent of those voters in 2012. \\nDuring the campaign, Trump said he would \"make America great again\" through the force of his personality, negotiating skill and business acumen. He proposed refusing entry to the United States of people from war-torn Middle Eastern countries, a modified version of an earlier proposed ban on Muslims. \\nHis volatile nature, frequent insults and unorthodox proposals led to campaign feuds with a long list of people, including Muslims, the disabled, Republican U.S. Senator John McCain, Fox News anchor Megyn Kelly, the family of a slain Muslim-American soldier, a Miss Universe winner and a federal judge of Mexican heritage. \\nA largely anti-Trump crowd of about 400 to 500 people gathered outside the White House after his victory, many shocked or in tears. Some carried signs that read \"stand up to racism\" and \"love trumps hate.\" About a dozen Trump supporters began shouting \"U-S-A\" and the competing demonstrators briefly pushed each other. \\nThe election was unprecedented in the way it turned Americans against each other, according to dozens of interviews in rural United States and across some of the most politically charged battleground states. \\nThroughout his campaign - and especially in his acceptance speech at the Republican convention in July - Trump described a dark America that had been knocked to its knees by China, Mexico, Russia and Islamic State. The American dream was dead, he said, smothered by malevolent business interests and corrupt politicians, and he alone could revive it. \\nHe has vowed to win economic concessions from China and to build a wall on the southern U.S. border with Mexico to keep out undocumented immigrants. \\nHis triumph was a rebuke to Obama, a Democrat who spent weeks flying around the country to campaign against him, repeatedly casting doubt on his suitability for the White House. Obama will hand over the office to Trump after serving the maximum eight years allowed by law. \\nTrump promises to push Congress to repeal Obama\\'s troubled healthcare plan and to reverse his Clean Power Plan. He plans to create jobs by relying on U.S. fossil fuels such as oil and gas. \\nTrump\\'s victory marked a frustrating end to the presidential aspirations of Clinton, 69, who failed for the second time to be president. \\nIn a posting on Twitter during Tuesday evening, she acknowledged a battle that was unexpectedly tight given her edge in opinion polls going into Election Day. \\n\"This team has so much to be proud of. Whatever happens tonight, thank you for everything,\" she tweeted. \\nThe wife of former President Bill Clinton, she held a steady lead in many opinion polls for months. Voters perceived in her a cautious and calculating candidate and an inability to personally connect with them. \\nEven though the FBI found no grounds for criminal charges after a probe into her use of a private email server rather than a government system while she was secretary of state, the issue allowed critics to raise doubts about her integrity. Hacked emails also showed a cozy relationship between her State Department and donors to her family\\'s Clinton Foundation charity. \\nTrump seized on the emails to charge that Clinton represented a corrupt political system in Washington that had to be swept clean. \\nNews contribution by Reuters , Commentary by TRUNEWS  '"}, "time": 1742628482.4608746}