{"duration": 0.047667503356933594, "input_args": {"text": "'The Southern Poverty Law Center (SPLC) is developing a documentary series centered on “  extremism” and President Donald Trump. [The controversial nonprofit is teaming with Black Box Management to produce a   documentary series that will explore “the normalization of American   extremism in the age of Donald Trump,” according to a statement provided to the Hollywood Reporter.  Black Box   and producer Mike Dill told THR that his Los   company plans to start shopping the   project to potential cable and streaming outlets as early as June. The SPLC has come under intense scrutiny in recent years for what has been perceived as electioneering, which is illegal for the 501( c)(3)   organization. “To vindicate itself as a fair and balanced agency, the IRS must strip the SPLC of its privileged   status,” Dale Wilcox, the Immigration Law Reform Institute’s general counsel, told Breitbart News last month. “Their attacks on the President during his campaign were some of the most egregious I’ve ever seen,” he said, adding that “hoarding over $300 million in donor contributions, the group can afford to pay taxes anyway. ” Last year, the SPLC described the deadly assault on Orlando’s Pulse nightclub that left 49 people dead, and the Black Lives   murders of police officers in Baton Rouge and Dallas, as “  terrorist plots. ” Dill is also developing a series, along with WGN America, called Fast Boys, about the   War II rise of the American   industry. The drama series was   before WGN America’s recent announcement that the network’s potential buyout by Sinclair Broadcast Group could mean a major shift away from original series. “The ratings WGN America (delivers) doesn’t justify the type of spending they do on the original programming side,” Sinclair Broadcast Group CEO Chris Ripley told Wall Street investors Monday, Variety reports. “The channel could be run much more profitably on a fraction of what they spend on programming. ” However, a spokesperson for WGN told THR that the billion dollar deal between Sinclair and WGN America won’t affect Fast Boys. “Both Fast Boys and the SPLC project tell the stories of those who don’t accept the limitations that others try to place upon them,” Black Box   Lowell Shapiro said in a statement. “The subjects see an opportunity to create change and evolve beyond the status quo. ”     Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563360.535297}