{"duration": 0.10391664505004883, "input_args": {"text": "'A couple of weeks ago, people boycotted Nordstrom for one reason: The department store sold Ivanka Trump products. Now people are boycotting Nordstrom for another reason: The store said it would not sell her products. These days, a shirt is not always just a shirt, and a store is not always just a store. Handbags, dresses and other ordinary items  —   and where they are bought  —   have become politicized, turning shopping decisions into acts of protest for the millions of people in   and   Trump camps. Under Armour, L. L. Bean, T. J. Maxx and many other companies have already been pulled into a sort of ideological tug of war. But perhaps no retailer has been in the hot seat like Nordstrom. The “boycott Nordstrom” movement instantly changed political direction after the department store scrubbed Ms. Trump’s name from its site last week. Thousands of people lashed out at the retailer online. Even President Trump himself posted on Twitter that his daughter had been treated “unfairly. ” The sharp reaction before and after Nordstrom’s decision  —   made quietly, with no announcement  —   highlights the tightrope companies must walk in this   environment. “Companies are nervous,” said Andrew Gilman, chief executive of the crisis communications firm CommCore Consulting Group. “I know several companies that have war rooms set up. ” “They have playbooks on what to do if there is a product recall or if the C. E. O. has a heart attack,” he added. “Now they have a different chapter on how to deal with a tweet from the president. ” Many retailers and brands would clearly prefer to fly below the political radar and stay away from the outrage on Twitter and Facebook. Calls or emails sent to a   of the country’s largest department stores about how they are handling Ms. Trump’s products, for example, resulted in either no comment or carefully neutral statements. None of the stores agreed to discuss how they made decisions around Ms. Trump’s merchandise or details about sales of the products. But many of these companies  —   like L. L. Bean and Macy’s  —   still find themselves in the eye of a social media storm. So, too, does the Ivanka Trump brand. “In recent days, we’ve seen our brand swept into the political fray, becoming collateral damage in others’ efforts to advance agendas unrelated to what we do, which is produce accessible,   products for our loyal customers,” the brand said in a statement. The   maker Under Armour also encountered the perils this week, when its chief executive, Kevin Plank, called Mr. Trump a “real asset” for the country. Within hours, the hashtag #boycottunderarmour emerged on social media. Under Armour moved quickly to contain the damage, clarifying Mr. Plank’s remarks by saying he supported Mr. Trump’s business policies, not his social viewpoints. It is unclear how much the boycotts and activism are shaping businesses’ financial results, especially at big department stores, which are battling weak sales across the board. The Ivanka Trump brand said it had experienced “  growth” in revenue last year, and planned to continue expanding its offerings and distribution in 2017. Consumer companies, more broadly, have long faced campaigns against their products for political, social or environmental reasons. There have been boycotts over the use of sweatshop labor, dangerous chemicals and even microbeads. But now, companies are dealing with even more intense pressure, as they have become targets in a politically charged environment fueled by social media. After Nordstrom pulled Ms. Trump’s products, many people opposed to Mr. Trump cheered the decision. But Josh Cornett, a    Trump supporter in Cleveland, was quick to tell his 25, 000 followers not to shop at the department store. “All you have to do is write out a sentence, and you’re done,” he said. “Anything that helps him, I try to promote,” he said, referring to Mr. Trump. “And anyone who attacks him, I try to defend. ” Nordstrom said that Ms. Trump’s products were simply not selling well, and that remaining inventory would still be available in some physical stores. But that has not stopped people like Mr. Cornett from viewing the decision through a political lens, and asserting that the company took a stand. “Companies are now being swept up into this political consumer activism in a way that they have not been in the past,” said Maurice Schweitzer, a professor of operations, information and decisions at the Wharton School at the University of Pennsylvania. Nordstrom is one of more than a dozen other retailers that have found themselves in the cross hairs of Grab Your Wallet, an online campaign to boycott companies associated with the Trump brand. The movement has also protested brands that donated to Mr. Trump’s campaign or advertised on “The New Celebrity Apprentice,” on which he is credited as an executive producer. Some major companies, including Macy’s, the country’s largest department store, still sell Ms. Trump’s shoes, handbags and clothes. Those companies remain on Grab Your Wallet’s list. Macy’s did not respond to multiple requests for comment. But many companies that are on the   list argue they have not picked a side and should not be there. For instance, in the days before his inauguration, Mr. Trump tweeted his thanks for the support of an L. L. Bean heir and encouraged consumers to buy products from the merchandiser. Soon, the company, based in Maine, was the focus of the Grab Your Wallet campaign. In a statement also posted on social media and elsewhere, L. L. Bean urged the campaign to reverse its position, explaining that the Trump supporter, Linda Bean, was one of more than 50 family members involved in the business. It added that L. L. Bean did not endorse political candidates or take positions on political matters. “Simply put,” the statement read, “we stay out of politics. ” Still, other business leaders appear eager to dash into the political fray. After Mr. Trump signed an executive order in late January that suspended the country’s refugee program and barred individuals from certain countries from entering the United States, Howard Schultz, the chief executive of Starbucks, announced plans to hire 10, 000 refugees over the next five years. Like with Nordstrom, the response was largely split down the political divide. “There’s a real difference in styles emerging here. L. L. Bean wants to stay low, saying, ‘We’re not political. We don’t want to pick sides,’” said Professor Schweitzer, of the Wharton School. “But Howard Schultz is positioning Starbucks as a more   place,” Professor Schweitzer continued. “He’s aligning the company with the employees and most of the customers in taking that stance. ”'"}, "time": 1742563534.775982}