{"duration": 0.17463469505310059, "input_args": {"text": "'WASHINGTON  —   President Trump ignites a lot of fights, but his failure to repeal the Affordable Care Act, the biggest defeat in his short time in the White House, was the result of something else: a   Republican civil war that humbled a generation of party leaders before he ever came to Washington. A   president who believes that Washington’s usual rules do not apply to him, Mr. Trump now finds himself shackled by them. In stopping the repeal of President Barack Obama’s proudest legacy   —   the Republican Party’s professed priority for the last seven years  —   from even coming to a vote, the rebellious far right wing   Mr. Trump, taking on and defeating the party establishment with which it has long been at war and which he now leads. Like every one else who has tried to rule a fissured and fractious party, Mr. Trump now faces a wrenching choice: retrenchment or realignment. Does he cede power to the   wing of his party? Or does he seek other pathways to successful governing by throwing away the partisan playbook and courting a coalition with the Democrats, whom he has improbably blamed for his party’s shortcomings? “It’s really a problem in our own party, and that’s something he’ll need to deal with moving forward,” said Representative Tom Cole of Oklahoma, an ally of the   Tuesday Group, which stuck with Mr. Trump in the health care fight and earned the president’s praise in the hours after the bill’s defeat. “I think he did a lot  —   he met with dozens and dozens of members and made a lot of accommodations  —   but in the end, there’s a group of people in this party who just won’t say yes,” Mr. Cole said. “At some point, I think that means looking beyond our conference. The president is a deal maker, and Ronald Reagan cut some of his most important deals with Democrats. ” Mr. Trump is not there yet. Before becoming a presidential candidate, he seemed to have little fixed ideology. But as president, he has operated from the   Republican playbook, embracing many of the positions of Speaker Paul D. Ryan and the party establishment. While he is angry and thirsty for revenge, he seems determined to swallow the loss in hopes of marshaling enough Republican support to pass spending bills, an   unformed tax overhaul and a $1 trillion infrastructure package  —   legislation that could attract considerable Democratic support but has the potential to split the party. On Friday evening, a somewhat shellshocked president retreated to the White House residence to grieve and assign blame. In a search for scapegoats, he asked his advisers repeatedly: Whose fault was this? Increasingly, that blame has fallen on Reince Priebus, the White House chief of staff, who coordinated initial legislative strategy on the health care bill with Mr. Ryan, his close friend and a fellow Wisconsinite, according to three people briefed on the president’s recent discussions. Despite the public displays of unity with the speaker, Mr. Trump and his team now regret outsourcing so much of the early drafting to Mr. Ryan. One aide compared doing that to a developer’s staking everything on obtaining a property without conducting a thorough inspection. And they were stunned by his inability to master the politics of his own conference. Mr. Trump, an   developer with a lifelong indifference toward the mechanics of governance, made a game effort to negotiate with members of the   Freedom Caucus, even if it seemed to some members of that group, who spoke on the condition of anonymity, that he did not have the greatest grasp of health care policy or legislative procedure. He told one adviser late Friday that his loss  —   a legislative debacle foreshadowed by the intraparty fight that led to the 2013 government shutdown  —   was a minor bump in the road and that the White House would recover. In an interview with The New York Times on Friday, Mr. Trump asserted that the administration was “rocking. ” The problem, he suggested, was divisions among Republicans. There are “a lot of players, a lot of players with a very different ” Mr. Trump said. “You have liberals, even within the Republican Party. You have the conservative players. ” But his advisers were more realistic. Mr. Trump’s chief strategist, Stephen K. Bannon, according to people familiar with White House discussions, described the president’s decision to withdraw the health care bill in the face of its   defeat as a   failure that could inflict serious damage on this presidency  —   even if Mr. Bannon believes Congress, not Mr. Trump, deserves much of the blame. Mr. Bannon and the president’s more   legislative affairs director, Marc Short, pushed Mr. Trump hard to insist on a public vote, as a way to identify, shame and pressure “no” voters who were killing their best chance to unravel the health care law. One Republican congressional aide who was involved in the   negotiations said Mr. Bannon and Mr. Short were seeking to compile an enemies list. Mr. Ryan repeatedly counseled the president to avoid seeking vengeance  —   at least until he has passed spending bills and a   increase needed to keep the government running. In the end, the president decided to back down. But Mr. Trump’s advisers worry about the hard reality  —   the developer with the   veneer was steamrollered by factions in the Republican Congress. As the dust settled on the health care debacle, it was clear that Mr. Trump’s lieutenants in the Republican civil war had been divided on how they thought the health care fight should have been handled, which does not augur well for the political battles to come. Mutual disgust with the Freedom Caucus seems to be pulling Mr. Ryan and, despite his misgivings, Mr. Trump, together, at least for now  —   just as it briefly united President Barack Obama and John A. Boehner, Mr. Ryan’s   predecessor, during their doomed effort to reach a “grand bargain” on a tax overhaul in 2011. Until the very end, Mr. Trump’s team was deeply divided over whether he should fully commit to a hard sell on a bill they viewed as fundamentally flawed, with Vice President Mike Pence pointedly advising the president to label the effort “Ryancare,” not “Trumpcare,” according to aides. A Pence spokesman denied that the vice president tried to tie the bill to the speaker. Many on Mr. Trump’s team disengaged from the process even as he dug in. Gary D. Cohn, Mr. Trump’s top economic adviser, had originally been tasked with playing a large role in shepherding the legislation from the White House side. But Mr. Cohn had grown leery of the bill, and the White House recognized that Mr. Cohn, a former president of Goldman Sachs and a Democrat, was not a good messenger to deal with recalcitrant conservatives. Mr. Trump’s    Jared Kushner, a key adviser, had said for weeks that he thought supporting the bill was a mistake, according to two people who spoke with him. But he was on a family skiing trip in Aspen, Colo. last week, and did not return to Washington until Friday  —   much to the annoyance of Mr. Trump, who thought he should have been in Washington in the whole week, according to two Republicans close to the White House. But Mr. Trump brushed aside those concerns in the last few days and embraced the conventional role as leader of his party. He has one speed when he decides to shift to sales mode, aides said, and he had trouble modulating his tone, issuing   superlatives like “wonderful” to describe an ungainly bill his aides described as anything but. After it was all over, the president dutifully blamed the Democrats, a party out of power and largely leaderless, after turning his back on their offers to negotiate on a bipartisan package that would have addressed shortcomings in the Affordable Care Act while preserving its core protections for poor and   patients. Aides advised him the argument was nonsensical, according to a person with knowledge of the interaction. For Mr. Trump’s Republican opponents, here was revenge served cold. As a candidate in 2016, he initially scoffed at signing a Republican loyalty pledge, at times behaving more like an independent invading the Republican host organism than like a typical presidential candidate. As president, Mr. Trump has left dozens of critical administration jobs unfilled, rejecting stalwart Republican applicants deemed insufficiently loyal to him  —   and now he is decrying the disloyalty of the 20 to 30 conservative members who outmaneuvered and overpowered him on health care. “We all learned a lot  —   we learned a lot about loyalty,” a solemn Mr. Trump told reporters late Friday. The dynamic that led to his defeat is bigger than Mr. Trump, despite his tendency to personalize every win or loss. Republicans who gained power by savaging Washington are in full control and cannot agree on a path forward. “We were a   opposition party,” Mr. Ryan said in assessing the defeat late Friday. “Being against things was easy to do. ” Former Speaker Newt Gingrich, a Trump supporter, said after the health bill was pulled that he was “getting some déjà vu right now. ” “Do you think Donald J. Trump goes home tonight, shrugs and says, ‘This is what winning looks like’?” Mr. Gingrich added. “No! But this is where the Republican Party is right now, and it’s been this way for years. ” But Mr. Trump put on his best face on Saturday morning. “ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE,” he said on Twitter. “Do not worry!”'"}, "time": 1742563138.4904985}