{"duration": 0.15851902961730957, "input_args": {"text": "'  *Articles of the Bound* / Where are the Mass Media Firings and Resignations? Where are the Mass Media Firings and Resignations? November 12, 2016, 5:56 am by Cliff Kincaid Leave a Comment 0 \\nAccuracy in Media \\nI missed a few losers in my column on the big media losers of the 2016 campaign. One person told me, “Bret Stephens of The Wall Street Journal has totally lost all credibility with his anti-Trump rants in his weekly column right up to the very end. We used to be ardent fans of his, but no more!!!” \\nI agree that Stephens is a big loser. His attacks on Trump were relentless and he declared that he wanted to build a new political party to compete with Trump. Sounding like The Huffington Post, Stephens used his November 8 column to find Trump guilty of “unrelenting and apparently irrepressible bigotry, misogyny, bullying and conspiracy-mongering…” \\nAfter the election, his readers responded with comments like: YOU ARE FIRED! Deep breaths Bret. You’ll be ok. MSNBC has several openings on their Jobs page, Bret. Stephens, you have climbed out on a limb and sawed it off. Best way to handle Stephens is to NOT read his columns anymore. That’s my solution to George Will also. Eventually, they will be fired. \\nSpeaking of The Huffington Post, consider these post-election headlines from the online publication: “Why HuffPost’s Presidential Forecast Didn’t See A Donald Trump Win Coming. Here’s how we blew it and what we’re doing to prevent a repeat.” \\nBut no resignations or firings were announced, and Stephens will also apparently keep his job. \\nJournalists and columnists should not be fired for their opinions, but for their lack of objectivity. It’s fine to have anti-Trump opinions, but that should not have interfered with an analysis of why Trump was striking a chord with the American people. \\nMy own views of Trump changed as I saw how the people were responding to him. One good source was Right Side Broadcasting , which aired live coverage of Trump rallies. Their broadcasts captured the size of the crowds. I saw Trump’s appearance in the heavily-Democratic city of Toledo, Ohio, where he was greeted by enthusiasm. I also took trips to states like Pennsylvania and saw the dozens of “Trump for President” signs. My July 29 column, “ Democrats Abandon Workers to Trump ,” looked at how the Democratic Party had abandoned the working class. My column on the eve of the election examined how “people power” could guarantee a Trump victory. \\nThese Trump supporters were not serial liars, rampant xenophobes, racists, misogynists, etc. They were ordinary people who were sick and tired of the liberal establishment. \\nBy contrast, the elitist Bret Stephens wrote about the Trump rallies, “The fervor of his crowds recalls Nasser’s Egypt.” Stephens had nothing but contempt for the average American. \\nThe problem with people like Stephens and publications like The Huffington Post is that they let their anti-Trump orientation interfere with the need for a professional analysis of what was actually happening in America’s cities and towns. \\nOne Huffington Post writer with egg on his face is Ryan Grim, who was promoting the bogus story that Trump had raped a 13-year-old girl. Regarding the rape story, Grim informed his readers on November 2 that “a woman who says Trump raped her as a 13-year-old in the 1990s is planning a press conference at 6:00 EST today. I coincidentally was working on a piece explaining why this case has gotten so little coverage.” \\nIt got little coverage because it was false. \\nThe woman, who had a history of drug abuse, pulled out of the news conference. She was identified by name and dropped the lawsuit. The allegations were obviously fabricated. \\nGrim also promoted the publication’s inaccurate predictions, saying on November 8, “Our final forecast is that she’ll [Hillary will] win 323 electoral votes, far more than the 270 she needs to win. According to our model, she’ll win Florida, North Carolina and New Hampshire, and that’ll be that. Early night.” \\nThe story by Natalie Jackson of The Huffington Post about how the publication totally botched coverage of the campaign admits the magnitude of the mistake: “Our model predicted that Democrat Hillary Clinton had a 98 percent chance of being elected. That was more pro-Clinton than most other forecast models (although all of them predicted a Clinton win). Our model said five Senate seats would shift from Republican to Democratic, giving Democrats a likely majority.” \\nBut nobody in the media loses their jobs for getting the facts wrong and doing their work in an unprofessional manner. \\nWhat’s more, we see the same left-wing pundits and reporters on networks like CNN coming back for more, giving viewers more slanted coverage and commentary disguised as news. Consider “former” communist Van Jones using CNN to accuse Trump supporters of being white racists. The same old liberal talking heads are currently trying to dictate the make-up of Trump’s cabinet and staff by warning against certain people deemed too conservative or “controversial.” \\nJames O’Keefe of Project Veritas comments that millions overcame “the firewall that existed within the media.” That partly occurred because of his undercover videos that led to resignations by Democratic operatives. In a post-election video , he explained that the most stunning admission of election night was “the power shift in this country,” as citizens exercised their power, “despite the overwhelming forces working them against them.” \\nWe can see that, as a result of the media’s failure to clean house, those who opposed Trump will not give up their power. Since they have shown that they have no professional standards, the only answer is to further drain the media elite of viewers and readers, and build up the power of alternative sources of news and information. \\nAny ordinary business that got things so wrong and performed so incompetently would go out of business. Let’s help the liberal media bite the dust. Cliff Kincaid \\nCliff Kincaid is the Director of the AIM Center for Investigative Journalism and can be contacted at cliff.kincaid@aim.org. View the complete archives from Cliff Kincaid . 0'"}, "time": 1742564108.9963477}