{"duration": 0.10486602783203125, "input_args": {"text": "\"We Are Change \\nFormer Attorney General Janet Reno has died from complications of Parkinson’s disease. Reno was Attorney General during the Clinton administration. She was 78. (Nov. 7) \\nReno, a former Miami prosecutor, served nearly eight years as attorney general under President Bill Clinton.\\nReno died on Monday from complications of Parkinson’s disease, according to her granddaughter, Gabrielle D’Alemberte. Who informed the Associated Press that she died early Monday morning. She is best known in the alternative media community as serving as prosecutor and exonerating the officers involved in Ruby Ridge , Idaho, in 1992 and in Waco, Texas, in 1993. Reno was sworn in as the first female attorney general on March 12, 1993, under the administration of Bill Clinton where she served in the role until 2001.\\nAccording to Republican strategist Dick Morris, also a former adviser to President Bill Clinton. Clinton wanted to drop Reno after his first term in office but Reno threatened to tell the media that it was Clinton, not she, who ordered the raid on the compound in Waco that ended with 76 men, women, and children killed when the building was burned to the ground.\\n“Reno threatened the president with telling the truth about Waco, and that caused the president to back down,” he said. “Then he went into a meeting with her, and he told me that she begged and pleaded, saying that . . . she didn’t want to be fired because if she were fired it would look like he was firing her over Waco,” Morris said. ” And I knew that what that meant was that she would tell the truth about what happened in Waco. “Now, to be fair, that’s my supposition. I don’t know what went on in Waco, but that was the cause. But I do know that she told him that if you fire me, I’m going to talk about Waco.”\\nMorris said Clinton disliked Reno.\\n“That was after Clinton had told me, ‘Janet Reno was the worst mistake I ever made,'” Morris said. “He hated her.” ~ Source Follow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT  \\nThe post Former Attorney General Janet Reno has Died at 78 appeared first on We Are Change .\\n\""}, "time": 1742563866.2274601}