{"duration": 0.23849701881408691, "input_args": {"text": "'This post was originally published on this site \\nFirst, it appeared to be a fluke: this summer the Ukronazi regime sent a small terrorist unit into Crimea tasked with blowing up several targets in the Crimea (see here for details). They were arrested by the Russian security services. In November, another two saboteurs were caught by the FSB (see here ). And now something really remarkable happened. The Ukronazi security service kidnapped two Russian citizens in broad daylight and accused them of being “deserters”. Turns out that the two kidnapped men are Maksim Odintsov and Alexander Baranov and that both of them are junior servicemen in the Russian military (ensign and junior sergeant). Apparently, what happened is this: Odintsov and Baranov used to serve in the Ukrainian military (at least that is what the SBU claims), but when Crimea, where Odintsov and Baranov live, returned to Russia they did what tens of thousands of other Ukrainian servicemen did – they joined the Russian military. The two were lured to the neutral zone between Crimea and the Ukraine by men who promised them that they could give them diplomas proving that they had a higher education from Ukrainian institutions. You can watch this video to see what actually happened next (no translation needed): \\n[embedded content] \\nThe video also shows one of the two men, with a superb shiner on his face, admitting that he had served in the Ukrainian military and that he is guilty of treason. What is remarkable here is that the Ukronazis kidnapped these two men in broad daylight in an location which was clearly under video monitoring, and that they then showed one of the hostages with a clear sign of the beating he received. No matter how incompetent the SBU is, they are not so incompetent as to not realize the fantastically provocative nature of their actions. This was an absolutely deliberate provocation whose goal was to get some kind of Russian reaction, either in Crimea or somewhere else. \\nWhat were they really hoping for? \\nProbably for some kind of Russian reaction which would reach across the border: some kind of attack on the Ukrainian border post, or maybe an artillery strike. Maybe even an attempt to free the two men, or even a retaliatory counter-kidnapping. What they knew is that any Russian reaction across the border would have been met by a hysterical chorus of outrage from the western political leaders and their corporate media. \\nFor the time being, the (hideously slowly clumsy and poorly updated) website of the Ministry of Foreign Affairs had nothing to say. The (marginally better) website of the President of Russia offered this reaction : \\nQuestion : Mr President, I want to clarify the situation with the Russian military service personnel detained by the Ukrainians. What measures are you taking? \\nVladimir Putin : I cannot say anything about these measures yet and can say only what we know at present, which is that these military servicemen formerly served in the Ukrainian armed forces and, after Crimea’s reunification with Russia, decided to serve in the Russian armed forces. \\nIn this respect, let me say first of all that we have always had great respect for and trust in Ukrainian military service personnel, and therefore proposed that they continue their service in our ranks. \\nSecond, they wanted to obtain confirmation of education at one of Ukraine’s higher education establishments, and this was why they went to the border. They were lured a few metres further and detained. \\nI think this kind of treachery will ultimately turn against those who carry out such acts. This is the same kind of thing as switching off the power supply to Crimea in winter and just before New Year. If people in Ukraine think they can win Crimea residents’ sympathy this way, this amounts to an attack using inappropriate means, to use legal language. \\nIn other words: other than issuing a verbal condemnation, Russia will not react in any dramatic manner. This is, of course, the correct decision, especially now that Trump is hopefully going to replace the Neocons with some patriotically minded and mentally sane officials. But there is also an inherent risk in this Russian stance: it invites the Ukronazis to further escalate their provocations. \\nConsider this: while the junta in Kiev has been constantly shelling the Donbass, the Kremlin did nothing to stop it. When top Novorussian officials, such as Motorola, were murdered by somebody hired by the junta, the Russians again did nothing. Nor did the Moscow retaliate when the Ukronazis sent saboteurs into Crimea. What I fear is that next the Ukronazis will combine these two provocations into one and attack Crimea directly, either by lobbing a mortar shell directly across the border or even with an artillery attack upon a town in northern Crimea. \\nWhile from a military point of view a Russian response is a no-brainer, from the political point of view this might be much harder. Imagine this: \\nThe SBU hides one single artillery piece in a town just north of the Crimean-Ukrainian border and then begins to shell, at night, of course, Russian military positions or town, in northern Crimea. Several Russian soldiers or civilians are killed, more are wounded. The Russian counter-battery radars will immediately and easily detect the location from which these attacks came, but we all know since the MH-17 that Russian radar recordings are considered worthless by the western corporate media. And if the Russian counter-strike hits a town, this will be presented as yet another aggression against the “sovereign and free Ukraine”. The Russians all remember how on 08.08.08 it was Russia, not Georgia, which was declared the aggressor and how when months later the investigative committees of the EU declared that, well, no, it was actually the Georgians who attacked the Russian peacekeepers nobody in the West paid any attention to this. The reality is that the otherwise weak, militarily incompetent, Ukraine holds the “escalation dominance” over Russia, especially in Crimea. Yes, on every rung of the escalatory ladder Russia is vastly more capable and powerful than the Ukraine, but it is the Ukraine which can chose on which rung of the escalatory ladder it chooses to engage Russia. Sounds paradoxical? \\nORDER IT NOW \\nThat is because, as I have been repeating for years now, the purpose of the regime in Kiev is not to win an unwinnable conflict against Russia, but only to draw Russia into the Ukraine. Russia should have escalation dominance over the Ukraine, but in reality it is Ukraine which will get to chose at which rung of the escalation ladder Russia will be forced to react. This is a typical case where “ the action is in the reaction ”. \\nAnd let’s be honest, with the US Neocons out of power very soon, at least temporarily, the junta in Kiev has absolutely nothing to lose from a direct, blatant, attack on Russia. Think of it: the EU and NATO leaders in Europe are absolutely horrified by the Trump victory and they are desperate for a crisis, any crisis, which would give them a meaning, a sense of purpose, a justification before the European public opinion. As for the Americans, Trump will only become President on January 20 th , that leaves them enough time to react to any crisis, even an artificial one, in such a manner as to preempt any attempts by the new administration to improve relations with Russia. \\nSure looks to me like the Neocons, the EU/NATO comprador elites and the Ukronazis in Kiev all have exactly the same interests: trigger a crisis before Trump is sworn in. \\nIn the meantime, the Minister of Culture of the Ukraine has declared that the people of the Donbass a “genetically unfit” to accept the Ukrainian culture (does anybody still wonder why I call this regime “Ukronazi” and not “Ukrainian”?) while the European Parliament has declared that the EU is in a state of “informational war” with Russia and that the EU needs to “respond” to the Russian attack. \\nAs for Latvia , Lithuania and Estonia are all preparing for an imminent Russian invasion. As for the Poles, they are busy exhuming the body of Lech Kaczynski in the hope to prove that Russian shot down his aircraft in 2010. \\nThe next couple of months will be very dangerous indeed. Related '"}, "time": 1742563206.967116}