{"duration": 0.136277437210083, "input_args": {"text": "'Image Credits: flickr, 9731367@N02 . \\nThe following excerpt is adapted from Mendenhall’s review of Deirdre McCloskey’s book Bourgeois Equality; the original review, which appeared in the Quarterly Journal of Austrian Economics, is available here. \\nIf it’s true that Wayne Booth inspired Deirdre McCloskey’s interest in the study of rhetoric, then it’s also true — happily, in my view — that McCloskey has refused to mimic Booth’s programmatic, formulaic methods and boorish insistence on prosaic succinctness. Bourgeois Equality is McCloskey’s third volume in a monumental trilogy that began with The Bourgeois Virtues (2006) and Bourgeois Dignity (2010), each published by the University of Chicago Press. This latest volume is a Big Book, alike in kind but not in theme to Jacques Barzun’s From Dawn to Decadence (2000), Camille Paglia’s Sexual Personae (1990), or Herald Berman’s Law and Revolution (1983) and Law and Revolution II (2006). It’s meandering and personal, blending scholarship with an essayistic style that recalls Montaigne or Emerson. \\nMcCloskey’s elastic arguments are shaped by informal narrative and enlivened by her plain and playful voice. At times humorous, rambling, and deliberately erratic, she gives the distinct impression that she’s simply telling a story, one that happens to validate a thesis. She’s having fun. Imagine Phillip Lopate articulating economic history. McCloskey is, in this regard, a latter-day Edward Gibbon, adopting a mode and persona that’s currently unfashionable among mainstream historians, except that she’s more lighthearted than Gibbon, and unashamedly optimistic. \\nMcCloskey’s elastic arguments are shaped by informal narrative and enlivened by her plain and playful voice. At times humorous, rambling, and deliberately erratic, she gives the distinct impression that she’s simply telling a story, one that happens to validate a thesis. She’s having fun. Imagine Phillip Lopate articulating economic history. McCloskey is, in this regard, a latter-day Edward Gibbon, adopting a mode and persona that’s currently unfashionable among mainstream historians, except that she’s more lighthearted than Gibbon, and unashamedly optimistic. \\nWriting with an air of confidence, McCloskey submits, contra Thomas Piketty, that ideas and ideology — not capital accumulation or material resources — have caused widespread economic development. Since 1800, worldwide material wealth has increased and proliferated; the quality of life in poor countries has risen — even if it remains unequal to that of more prosperous countries —and the typical human being now enjoys access to the food, goods, services, medicine, and healthcare that, in earlier centuries, were available to only a select few in the richest parts of the globe. The transition from poverty to wealth was occasioned by shifting rhetoric that reflected an emerging ethical consensus. The rhetorical-ethical change involved people’s “attitudes toward other humans” (p. xxiii), namely, the recognition of shared experience and “sympathy,” as Adam Smith stated in The Theory of Moral Sentiments. Attributing human progress to ideas enables McCloskey to advocate the norms and principles that facilitated economic growth and social improvement (e.g., class mobility and fluidity) while generating extensive prosperity. Thus, her project is at once scholarly and tendentious: a study of the conditions and principles that, in turn, she promotes. \\nShe argues that commercialism flourished in the eighteenth century under the influence of ideas — such as “human equality of liberty in law and of dignity and esteem” (p. xxix) — that were packaged in memorable rhetoric and aesthetics. “Not matter, mainly, but ideas” caused the Great Enrichment (p. 643). In other words, “[t]he original and sustaining causes of the modern world […] were ethical, not material,” and they included “the new and liberal economic idea of liberty for ordinary people and the new and democratic social idea of dignity for them” (p. xxxi). This thesis about liberty and dignity is clear and unmistakable if only because it is repetitive. McCloskey has a habit of reminding readers—in case you missed her point the first, second, or fifty-seventh time around—that the causes of the Industrial Revolution and the Great Enrichment were ideas, not “narrowly economic or political or legal changes” (p. 470). She maintains, to this end, that the Scottish Enlightenment succeeded in combining the concepts of liberty and dignity into a desirable form of equality—not equality of outcomes, of course, but of opportunity and treatment under the law. And the Scottish model, to her mind, stands in contradistinction to the French example of centralized, top-down codification, command, planning, and design. \\nA perennial villain lurks in the pages of her history: the “clerisy,” which is an “appendage of the bourgeoisie” (p. 597) and often dubbed “the elite” in regular parlance. McCloskey calls the clerisy “the sons of bourgeois fathers” (p. xvii) and “neo-aristocratic” (p. 440). The clerisy includes those “artists, intellectuals, journalists, professionals, and bureaucrats” who resent “the commercial and bettering bourgeoisie” (p. xvi). The clerisy seeks, in different ways at different times, to extinguish unfettered competition with exclusive, illiberal, irrevocable grants and privileges that are odious to free society and offensive to the rights of average consumers. “Early on,” says McCloskey, referring to the period in Europe after the revolutionary year 1848, “the clerisy began to declare that ordinary people are misled in trading, and so require expert protection and supervision” (p. 609). The clerisy since then has been characterized by paternalism and a sense of superiority. \\nBecause the clerisy is shape-shifting, assuming various forms from time to time and place to place, it’s a tough concept to pin down. The word “clerisy” does not appear in the book’s index to permit further scrutiny. By contrast, McCloskey’s general arguments are easy to follow because the book is separated into parts with questions as their titles; subparts consisting of onesentence headings answer those questions. \\nIn a massive tour de force such as this, readers are bound to take issue with certain interpretive claims. Historians will find McCloskey’s summaries to be too breezy. Even libertarians will accuse her of overlooking manifest wrongs that occurred during the periods she surveys. My complaints are few but severe. For instance, McCloskey is, I believe, either careless or mistaken to announce that, during the nineteenth and early twentieth century, “under the influence of a version of science,” in a territory that’s never specifically identified, “the right seized upon social Darwinism and eugenics to devalue the liberty and dignity of ordinary people, and to elevate the nation’s mission above the mere individual person, recommending, for example, colonialism and compulsory sterilization and the cleansing power of war” (p. xviii). \\nLet’s hope that it’s innocent negligence rather than willful distortion that underlies this odd, unqualified, categorical assertion. Adam Cohen’s Imbeciles (2016) and Thomas C. Leonard’s Illiberal Reformers (2016) describe how, in the United States, social Darwinism and eugenics were adopted primarily, though not exclusively, by the Left, not the Right. These recent books come on the heels of several scholarly treatments of this subject: Thomas M. Shapiro’s Population Control Politics (1985), Philip R. Reilly’s The Surgical Solution (1991), Joel Braslow’s Mental Ills and Bodily Cures (1997), Wendy Kline’s Building a Better Race (2001), Stefan Kuhl’s The Nazi Connection (2002), Nancy Ordover’s American Eugenics (2003), Christine Rosen’s Preaching Eugenics (2004), Christina Cogdell’s Eugenic Design (2004), Gregory Michael Dorr’s Segregation’s Science (2008), Paul A. Lombardo’s edition A Century of Eugenics in America (2011), and Alexander Minna Stern’s Eugenic Nation (2016). These represent only a small sampling. \\nIs McCloskey unware of these texts? Probably not: she reviewed Leonard’s book for Reason, although she did so after her own book reached press. At any rate, would she have us believe that Emma Goldman, George Bernard Shaw, Eugene Debs, Marie Stopes, Margaret Sanger, John Maynard Keynes, Lester Ward, and W. E. B. Du Bois were eugenicist agitators for the political Right? If so, she should supply her definition of “Right,” since it would go against commonly accepted meanings. On the matter of colonialism and war, self-identified members of the Old Right such as Albert Jay Nock, John Flynn, and Senator Robert Taft advocated precisely the opposite of what McCloskey characterizes as “Right.” These men opposed, among other things, military interventionism and adventurism. The trouble is that McCloskey’s muddying of the signifiers “Left” and “Right” comes so early in the book—in the “Exordium”— that readers may lose trust in her, question her credibility, and begin to suspect the labels and arguments in her later chapters. \\nOther undefined terms only make matters worse, ensuring that McCloskey will alienate many academics, who, as a class, are already inclined to reject her libertarian premises. She throws around the term “Romanticism” as if its referent were eminently clear and uncontested: “a conservative and Romantic vision” (p. xviii); “science fiction and horror fiction [are] … offshoots of Romanticism” (p. 30); “[Jane Austen] is not a Romantic novelist … [because] [s]he does not take Art as a model for life, and does not elevate the Artist to a lonely pinnacle of heroism, or worship of the Middle Ages, or adopt any of the other, antibourgeois themes of Novalis, [Franz] Brentano, Sir Walter Scott, and later Romantics” (p. 170); “Romanticism around 1800 revived talk of hope and faith and a love for Art or Nature or the Revolution as a necessary transcendent in people’s lives” (p. 171); “Romantic candor” (p. 242); “the late eighteenth-century Romantic literary critics in England had no idea what John Milton was on about [sic], because they had set aside the rigorously Calvinist theology that structured his poetry” (p. 334); “the nationalist tradition of Romantic writing of history” (p. 353); “Romantic … hostilities to … democratic rhetoric” (p. 510); “[i]n the eighteenth century … the idea of autonomy triumphed, at any rate among the progressive clerisy, and then became a leading Romantic idea, á la Victor Hugo” (p. 636); and “the Romantic conservative Thomas Carlyle” (p. 643). \\nTo allege that the clerisy was “thrilled by the Romantic radicalism of books like Mein Kampf or What Is to Be Done” (p. xviii) is also recklessly to associate the philosophies of, say, Keats or Coleridge or Wordsworth with the exterminatory fantasies of Hitler and Lenin. McCloskey might have guarded against this misleading conflation by distinguishing German idealism or contextualizing Hegel or by being more vigilant with diction and definition. Her loose language will leave some experts (I do not profess to be one) scratching or shaking their heads and, more problematic, some non-experts with misconceptions and misplaced targets of enmity. One imagines the overeager and well-meaning undergraduate, having read Bourgeois Equality, setting out to demonize William Blake or destroy the reputation of Percy Shelly, about whom Paul Cantor has written judiciously.2 Wouldn’t originality, imagination, creativity, and individualism—widely accepted markers of Romanticism—appeal to McCloskey? Yet her unconditionally derogatory treatment of Romanticism—which she portrays as a fixed, monolithic, self-evident thing—undermines aspects of that fluctuating movement, period, style, culture, and attitude that are, or seem to be, consistent with her Weltanschauung. \\nBut I protest too much. These complaints should not diminish what McCloskey has accomplished. Would that we had more grand studies that mapped ideas and traced influences across cultures, communities, and eras. McCloskey takes the long view, as we all should. Her focus on rhetoric is crucial to the future of liberty if, given the technological advances we have made, the “work we do will be more and more about decisions and persuading others to agree, changing minds, and less and less about implementation by hand” (p. 498). Equally significant is her embrace of humanomics—defined as “the story [of] a complete human being, with her ethics and language and upbringing” (p. xx)—which materializes in casual references to Henrik Ibsen’s plays, challenges to the depiction of John Milton “as a lonely poet in a garret writing merely to the starry heavens” (p. 393), analyses of Jane Austen’s novels, and portrayals of Elizabethan England. Her historical and narrative arc enables us to contextualize our own moment, with all of its troubles and possibilities. \\nBest of all, her book is inspiring and exhilarating and brimming with rousing imperatives and moving calls to action. “Let us, then,” she says at one point, “not reject the blessings of economic growth on account of planning or pessimism, the busybody if wellintentioned rationalism of some voices of the French Enlightenment or the adolescent if charming doubts of some voices of the German Romantic movement, fashionable though both attitudes have long been among the clerisy. As rational optimists, let us celebrate the Great Enrichment, and the rhetorical changes in freer societies that caused it” (p. 146). At another point she encourages her audience to guard against “both cynicism and utopianism” (p. 540), and elsewhere to heed “trade-tested cooperation, competition, and conservation in the right mix” (p. 523). These little nudges lend her credibility insofar as they reveal her true colors, as it were, and demonstrate that she is not attempting—as is the academic wont—to hide her prejudices and conceal her beliefs behind pretended objectivities. \\nPoverty is relative and, hence, permanent and ineradicable, despite McCloskey’s claim that we can “end poverty” (p. 8). If, tomorrow, we woke up and the wealth of each living person were magically to multiply twentyfold—even fiftyfold—there would still be people at the bottom. The quality of life at the bottom, however, would be vastly improved. The current manifestation of global poverty shows how far we as a species have advanced in the last few centuries. McCloskey is right: We should pursue the ideas that accelerated and achieved human flourishing, that demonstrably brought people out of distress and destitution. Hard sciences and mathematical models are insufficient in themselves to convey the magnitude and splendor of these ideas and their accomplishments. Hence we should welcome and produce more books like McCloskey’s that undertake a “rhetorical-ethical Revaluation” to both examine and celebrate “a society of open inquiry,” one which not only “depends on rhetoric in its politics and in its science and in its economy,” but which also yields intellectual creativity and political freedom (p. 650). In McCloskey’s approach, economics and the humanities are not mutually exclusive; rather, they are mutually illuminating and, in fact, indispensably and inextricably tied. An economics that forsakes the dignity of the human person and his capacity for creativity and aesthetics does so at its own peril and to its own disgrace. All economics is, at its core, humanomics. We could do without the latter term if we understood the former. NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742628564.0190039}