{"duration": 0.09710192680358887, "input_args": {"text": "'War is like crack for presidents. It confers instant gravitas, catapulting them to respectability, bypassing all station stops. They get to make macho pronouncements on a topic where every utterance is seen as august. [On the other hand, Trump’s Syrian misadventure is immoral, violates every promise he ran on, and could sink his presidency.  Left to his own devices, uncontaminated by Washington   Trump gets it right. Back in 2013, when President Obama was being egged on to attack Syrian President Bashar   in response to an alleged chemical weapons attack far more sweeping than this latest one, Trump tweeted:  —   Aug. 29, 2013: “What will we get for bombing Syria besides more debt and a possible long term conflict? Obama needs Congressional approval. ”  —   Aug. 31, 2013: “Be prepared, there is a small chance that our horrendous leadership could unknowingly lead us into World War III. ”  —   Sept. 1, 2013: “If the U. S. attacks Syria and hits the wrong targets, killing civilians, there will be worldwide hell to pay. Stay away and fix broken U. S. ” On the campaign trail, Trump repeatedly stated that he had no interest in starting “World War III over Syria,” saying, “We have bigger problems than Assad. ” His policy position was: “Let Syria and ISIS fight. I look at Assad  —   and Assad looks better than the other side. ” Trump was right on every point. Assad is one of the least bad leaders in the entire Middle East. He’s not a murderous thug like Saddam, has no rape rooms, isn’t into jihad, protects Christians, and is fighting ISIS. He provided us with intelligence on   after  . He does not have crazy Islamic police slapping women around or throwing gays off buildings. (That would be our beloved ally, Saudi Arabia.) Trump was also correct about Assad’s opponents being far worse, containing large helpings of both ISIS and  . As awful as it was to see those dead children, Trump knew that America’s first duty is to our own children. We have never succeeded at turning a Third World dictatorship into a paradise. The history of these things is that removing a Middle Eastern strongman always makes things worse  —   for example, in Iran, Iraq, Libya, and Egypt. We leap in, thinking we’re helping the poor devils under the thumb of a dictator  —   and then the new tribe takes over and oppresses everyone else, usually much more brutally, while hating us even more than the old tribe did. If voters wanted more Middle Eastern wars, there were plenty of other candidates offering that: Marco Rubio, Lindsey Graham, Carly Fiorina, and Hillary Clinton, for example. And we must never forget Jeb! though it proved surprisingly easy to do so in 2016. But we picked Trump. While most of the left wailed about the return of Nazi Germany under Trump, savvier liberals saw his vulnerability: flattery. All we have to do is praise him! You’ll be shocked at how easy it is. And, boy, did they lay it on thick with the Syrian misadventure. No sucker’s bait was left on the floor. Cable news hosts gushed, “Trump became president of the United States tonight!” On MSNBC, Brian Williams called the bombing “beautiful” three times in less than a minute. Sen. Lindsey Graham (one of the “women of the Senate,” according to Justice Ruth Bader Ginsburg) compared Trump to Reagan. The New York Times headlined an article, “On Syria Attack, Trump’s Heart Came First. ” My nightmare scenario: Trump and Jared watching TV together and  : DID YOU SEE THE NEWS! THEY LOVE YOU! All Trump had to do was pointlessly bomb another country, and it was as if a genie had granted his every wish. Looking for some upside to this fiasco, desperate Trump supporters bleated that bombing Assad had sent a message to North Korea. Yes, the message is: The Washington establishment is determined to manipulate the president into launching counterproductive military strikes. Our enemies  —   both foreign and domestic  —   would be delighted to see our broken country further weaken itself with pointless wars. Was America strengthened by the Iraq War? The apparently   Afghanistan War? Vietnam? This is how great powers die, which is exactly what the left wants. Administration policy was heading in the wrong direction at 90 mph, but thank God, Trump seems to have grabbed the steering wheel and hit the brakes. Notwithstanding the hopes and dreams of Clausewitzian military strategist Nikki Haley, we will not be engaging in regime change in Syria or starting World War III with Russia today. We want the “president of America” back  —   not “the president of the world. ”'"}, "time": 1742563677.0415103}