{"duration": 0.024961471557617188, "input_args": {"text": "'Politicians encourage hate crimes by discussing Brexit, and formally triggering the process will bring   attacks to “another level” MPs have been told. [Polish community leaders claimed the aspects of Britain that migrants like best, its “culture of tolerance” and “diversity” have been shattered since the Brexit vote because people have been emboldened to carry out verbal and physical attacks against migrants.  “Every statement and every political activity around Brexit negotiations brings a spike in inquiries to our organisation. We expect when article 50 is triggered it will bring another level of discontent,” Barbara Drozdowicz, of the East European Resource Centre (EERC) told the Commons Home Affairs Committee. Ms. Drozdowicz fingered criticism of mass migration as a driver of ‘hate’ in response to a question by fierce Remain campaigner Chuka Umunna. The Labour MP pointed to “Leave. EU, UKIP obviously” when he asked the EERC director whether she believes the “Leave campaign” and   figures “bear a responsibility” for   attacks. “The campaign was built on controlling migration. ‘Controlling migration’ is not a neutral term,” she told MPs. When Conservative David Burrowes noted that most examples of ‘hate’ are expressed online, community leaders admitted they’ve neither seen nor had reports of content on the internet that’s abusive to migrants from Europe. Tadeusz Stenzel, the chair of trustees at the Federation of Poles in Great Britain, suggested there might be a language barrier which prevents European migrants from being able to understand abusive posts and report them. MPs heard that European migrants began reporting ‘hate crimes’ in around April of last year as the referendum campaign got into gear, but that only after Britons voted to leave the European Union (EU) was the resource centre inundated with an “explosion of calls”. Ms. Drozdowicz said migrants from Eastern Europe reported being told to “go home” and hearing ‘casual hate speech’ on public transport and that the centre heard about violent incidents including a Polish child being beaten up at school. Chairman of the committee, Yvette Cooper, said the details of incidents that were talked about in the session were “appalling”. “Hate crime is appalling,   and should have no place in our country,” she said. Heading the government’s inquiry into ‘hate crime’ in November, Ms. Cooper accused the campaigns of both Leave, during the EU referendum, and Donald Trump, in the U. S. presidential race, of having incited hatred.'"}, "time": 1742628593.6720161}