{"duration": 0.03286385536193848, "input_args": {"text": "'Deputies for   Donald Trump are pressing Hill Republicans to appropriate funds by April for a quick start to the construction of a border wall, according to CNN. [The quick spending for the wall would be legally authorized by a   2006 law, which allows the federal government to build 700 miles of   fencing on the border.   “It was not done in the Obama administration, so by funding the authorization that’s already happened a decade ago, we could start the process of meeting Mr. Trump’s campaign pledge to secure the border,” GOP Rep. Luke Messer told CNN. But the Hill appropriations would break a promise, CNN says:  The move would break a key campaign promise when Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border. In fact, Trump did not claim he would force Mexico to pay the initial costs of the wall, which likely will reduce the huge financial and civic costs imposed by illegal immigration on American communities. Trump’s demand for quick funding from Congress may help the administration overcome   opposition from Democratic and GOP legislators who may try to slow and delay Trump’s border enforcement priorities. So far, senior GOP leaders have promised they will support Trump’s demand for border security, but they have resisted growing public pressure  —   and his campaign promise  —   to reduce legal immigration and companies’ use of  .  “We want President Trump to have all the tools he needs to build the wall,” Rep. Steve Scalise of Louisiana, the    Republican in the House leadership, told CNN on Thursday.  We’re in talks with him on the details of it as they’re still putting together their team. We still got a few months before there’s another funding bill that’s going to move. We’re going to work with him to make sure we can get it done. We want to build a wall. He wants to build a wall. Once the wall’s construction is underway with U. S. funding, Trump will be better positioned to extract some form of payment from Mexico. Illegal immigration costs American taxpayers $113 billion a year, according to a 2010 estimate. The annual legal immigration of   workers also costs Americans many billions in welfare, and reduces salaries and wages.  The   drug trade also imposes huge costs on American communities. '"}, "time": 1742562180.793979}