{"duration": 0.12279796600341797, "input_args": {"text": "'America\\'s shrimp imports being injected with dangerous chemicals - just to add weight \\nSunday, October 30, 2016 by: J. D. Heyes Tags: shrimp imports , chemical injections , food fraud (NaturalNews) It seems that the more advanced human civilization becomes, the less we learn about what is and isn\\'t good for our bodies. That\\'s the only way to explain why many commercial food operations are so toxic and hazardous to our health.The UK\\'s Daily Mail is reporting on a commercial shrimp operation in Vietnam where workers have been videotaped injecting them with disgusting gel-like substances in order to make them appear bigger and fresher before they are sold and exported.The video shows factory workers injecting tiger prawns (shrimp) in the head, tail and midsection with a gel substance to make them heavier before they are sold.Vietnam is the largest source of imported shrimp for many countries.The video footage was shot by a Vietnamese television station earlier this year. Since surfacing, it has gone viral online on social media sites like Facebook, with many people expressing disgust and outrage.The substance is often used in food as a thickening agent, in particular for icing. But many people who have watched the video are labeling the Vietnamese factory and its workers as \"shameless\" and dishonest in their attempt to make the shrimp appear bigger and more meaty. In addition, the practice makes one wonder what else is being done to shrimp or other food products, not just in Vietnam, but throughout the region. \\'All local shrimp suppliers do this\\' Environmental protection organization Greenpeace recently released a report titled, \"Dodgy Prawns,\" as an aid for importers of shrimp to find sources that are harvested without using slave labor, methods that are destructive or harmful to ocean ecosystems, or that utilize toxic chemicals.The guide recommended shrimp harvested in and around Australia, but also \"ecologically certified\" black tiger prawns from Vietnam. The organization also warned against all imported vannamei, which very often is sourced from Vietnam, because of concern about mangrove destruction, pollution and the use of invasive species. Natural Blaze , in reporting on the story , noted that workers at the Vietnam shrimp preparation factory in question said they injected the shrimp there because \"all local shrimp suppliers do this.\"The site noted further that the largest suppliers of shrimp products in Vietnam import more than half of their raw materials for processing from other countries, including China, which has a well-deserved reputation for unclean, unsanitary food production.In the U.S., about 100 million pounds of shrimp – or about 8 percent of the amount of shrimp Americans consume annually – comes from Vietnam, which in turn gets most of its shrimp from China, where food regulation is a cruel joke. Added weight means additional profits Natural Blaze reported that after about $150 million worth of shrimp was imported into the U.S. from China between January and October 2015, the U.S. Food and Drug Administration issued an import alert in December of that year. The alert warned importers of the \"presence of new animals\\' drugs and/or unsafe food additives\" in seafood originating in China, and that included shrimp.The Daily Mail said that workers were injecting the shrimp with a substance known as carboxymethyl cellulose, or CMC. Many say it is not considered harmful because it dissolves in water and becomes a smooth liquid before it is then pumped into the shrimp.But obviously CMC is not a naturally-occurring element either, which means shrimp that it is injected into are no longer organic and natural . And the substance has been linked to diarrhea, abdominal cramps, eye pain and irritation, and lingering changes in vision, Natural Blaze noted.And yet its use in food continues. That\\'s because wholesalers and retailers see a bigger profit margin in artificially inflating the size of shrimp that is then sold by weight. And even if retailers aren\\'t doing the injecting, they are knowingly selling a product that has been injected at the source. Sources:'"}, "time": 1742562955.1415987}