{"duration": 0.05868053436279297, "input_args": {"text": "'Donald Trump, the Greatest Victim in the History of the World Posted on Nov 3, 2016 \\nBy Ann Jones / TomDispatch ( Gage Skidmore / (CC BY-SA 2.0) ) \\nDonald Trump grabbed a new lifeline. Speaking at a rally in Charlotte, North Carolina, on October 15th, he raised a hand as if to take an oath and declared : “I am a victim!” The great business tycoon, the one and only man who could fix America and make the place great again (trust me, folks), was laying claim to martyrdom—and spinning another news cycle. “I am a victim,” he declared, “of one of the great political smear campaigns in the history of our country. They are coming after me to try and destroy what is considered by even them the greatest movement in the history of our country.” \\n“I am a victim.” That pathetic line echoed in my head, which is why I’m writing this. In my long life, I had seen a large white man stand up in a public arena and proclaim those words—the shrill, self-pitying complaint of the remorseless perpetrator—only once before. That was in a courtroom in lower Manhattan in 1988. The man was Joel Steinberg , a New York lawyer who, over a 12-year period, had brainwashed and beaten into oblivion a woman named Hedda Nussbaum, once a successful young editor of children’s books. In the early years of their relationship, she had run away several times, seeking help, and every time a doctor or friend had called Steinberg to come and get her. At that point—time and again—Steinberg would administer “punishment,” breaking her bones and her spirit. She took on what police would later describe as “a zombie-like quality.” \\nSome years earlier, a teenage girl had hired Steinberg to arrange an adoptive home for her baby. Instead he kept the child, Lisa, until one evening when she was six years old and “stared” at him in a way he didn’t like. He responded by striking her repeatedly in the head. After which he went out to dinner with his cocaine dealer, leaving the child unconscious on the floor. Nussbaum, by then so traumatized, so absent from anything like life, thought vaguely of calling a doctor, but she was not allowed to use the phone in Steinberg’s absence. Instead, she sat on the floor and watched over the girl as she lay dying. \\nOn trial for the child’s murder, Steinberg blamed everyone but himself. “I’m the victim here,” he whined in court. He swore that he had “never hit anyone,” not anyone , even though he was known to have assaulted a business associate and three other women before he settled into the single-minded, single-handed demolition of Hedda Nussbaum. \\nAdvertisement Square, Site wide \\nJudge Harold Rothwax observed that Steinberg was “a man of extraordinary narcissism and self-involvement” who had “an extreme need to control everyone in his ambit” while he lived a “life of self-gratification.” Yet Steinberg could not see in himself the man Judge Rothwax described. He thought people should feel sorry for him. He had been disbarred and had lost a child (not to mention his Greenwich Village apartment). He railed at those who had conspired to bring him down: the police, the neighbors, the judge, the prosecutor, the expert medical witnesses, his defense attorney, the jurors, the press, and Hedda Nussbaum. “I’m the victim here,” he claimed. \\nAt the time, nearly 30 years ago, the public blamed Hedda Nussbaum. The district attorney, the police, the doctors and psychiatrists who treated her intensively for more than a year before the trial all agreed that, on the evening in question, she was too physically and mentally “incapacitated” either to cause the girl’s injuries or take action to save her. Nonetheless, she was tried and condemned by the press and public opinion, including women who called themselves “feminists.” In court, the jurors were merciless. When they began to deliberate, only four thought Steinberg guilty of murder as charged, five were “in the middle,” and three held out for lesser charges, feeling certain that Hedda Nussbaum had somehow been responsible for killing the child. \\nThey finally agreed upon a verdict of manslaughter. Even then, a woman juror assured the press that Nussbaum was “a very sick woman” who should have been charged and convicted of “some crime.” Another juror, also female, expressed popular opinion this way: “I just feel that she was to blame.” And a third woman juror, who claimed that “certain others” agreed with her, said, “Poor Joel. Joel’s a victim. We have to send a message to the system: ‘You don’t make victims out of nice men like Joel.’” \\nJudge Rothwax sentenced Steinberg to eight and a half to 25 years. Released after 17 years, Steinberg, now in his seventies, still claims to have done nothing hurtful to anyone. He has not paid a civil court-ordered settlement of $15 million to the birth mother of the dead child, nor has he ever been charged with any crime for what he did to Hedda Nussbaum. \\nTwo lessons lurk in this story, one old and one very up to date. First, it’s a reminder of how much women at that time, even after a great wave of feminism, still blamed women (including themselves) for whatever happened to them at the hands of men; second, a man with a character like Steinberg’s is not the kind of guy you want to choose for high office—or any office at all. \\nJoel Steinberg stalked a far tinier stage than Donald Trump and he did more deadly damage, but the two men seem to be brothers under the skin, sharing common character defects well described in psychiatric texts: extreme narcissism, a taste for sexual predation, and very similar views of the women on whom they prey. Like Steinberg, who was incapable of seeing himself as the judge accurately described him, Trump seems blind to the real nature of his own behavior. (His current wife describes him as a “boy.”) Neither man seems capable of taking responsibility for the harm he’s done, and when their own actions finally call down retribution, branding them as losers—ah, then come the conspiracy theories and the vindictive wail of the victim. \\nMen Who Use Women \\nLast June, I published a piece at TomDispatch venturing to explain why candidate Donald J. Trump was getting “rock-bottom ratings” in the polls from women voters. Nearly 70% of them reportedly couldn’t stand the guy. I pointed out what seemed to me to be the obvious: “Trump’s behavior perfectly fits the profile of an ordinary wife abuser.”'"}, "time": 1742628476.4685311}