{"duration": 0.034436702728271484, "input_args": {"text": "'The Democratic National Committee has seized the newly released federal budget plan to keep the government operating through September as a fundraising tool. [A mass email sent on Monday using DNC chairman Tom Perez’s name as the sender praised the appropriations bill as a win for Democrats.  “Late last night, Democratic leaders reached a deal to stop a   government shutdown, and it’s a major victory for all of us who are resisting the Trump agenda,” the email sent on Monday said. Those victories, the email claimed, include not cutting Planned Parenthood funding and not allowing “one red cent for Donald’s border wall. ” “And it only happened because you made sure Republicans knew there’d be hell to pay for backing Donald Trump’s agenda,” the email said, adding that the Republicans’ effort to do away with Obamacare and install “Trumpcare” is still in play. “We chalked up a big win yesterday, and that’s great,” the email said. “But we can’t afford to rest on our laurels,” the email concluded as it urged email recipients to make a donation to the Democratic Party. Meanwhile, House Speaker Paul Ryan ( ) said at a Capitol Hill press conference on Tuesday that there’s a lot of “conservative wins” in the budget, and that includes no funding for Planned Parenthood. “Planned Parenthood is not funded,” Ryan said, adding that the grants and reimbursements given to the nation’s largest abortion provider through the federal Title X Family Planning Program to the tune of millions of dollars annually will be up to Secretary of Health and Human Services Tom Price. “So we think there are some really good wins,” Ryan said. “I know there’s a PR machine that the Democrats are pushing. I’d say don’t look at the press releases look at the bill. ” “When you look at the bill, there’s a lot of good conservative wins here,” Ryan said. “But chief among them are the president’s two highest priorities: support the military and get a down payment on border security. ” Ryan said the “fight” for funding the border wall will come this summer.'"}, "time": 1742563812.2090178}