{"duration": 0.21123814582824707, "input_args": {"text": "'KINSHASA, Democratic Republic of Congo  —   In a mansion along the Congo River, with a collection of expensive watches, expensive motorcycles and a chimpanzee in a cage, Joseph Kabila, the president of this vast and troubled country, should be packing up. Instead, he is digging in. His second term is up in a few days, the Constitution forbids him to run for a third, millions of people are threatening to mobilize against him, and still Mr. Kabila shows no signs of leaving. The Democratic Republic of Congo is already one of the poorest, most volatile nations on earth. Countless young people are out of work, and the security forces are brutal and loosely controlled. Add to that dozens of armed groups operating in the hinterlands. Many people here are terrified that if Mr. Kabila clings to power at all costs, as some of his counterparts across Africa recently have, Congo could explode. But the paradox is that Mr. Kabila may not especially want to stay in power. Instead, former confidants say, he refuses to give up for a simple reason: He is afraid  —   for his family, for his safety and, not insignificant, for his wealth. “He doesn’t have an exit plan,” said Martin Fayulu, an opposition politician. It is an old problem with a new twist. According to forensic investigators, mining executives and officials in his own government, Mr. Kabila has looted millions of dollars in public assets. Recent troves of documents shared with The New York Times  —   whose authenticity has been verified by current and former Congolese officials  —   reveal a string of suspicious bank transfers totaling $95. 7 million, dubious mining rights sales that have generated millions more and possible   schemes involving a bank executive widely described as Mr. Kabila’s adopted brother. Authoritarian leaders used to be able to steal with impunity. But today, a   with an iPhone can be a dangerous foe. The   Papers, WikiLeaks world is an uncomfortable place for an autocrat. In a sense, Mr. Kabila is trapped. As Jason K. Stearns, the author of a   book on Congolese politics, said, “He’s in a labyrinth of his own making. ” And cornered, he has begun to lash out. Mr. Kabila’s forces and their supporters have arrested journalists, jailed opposition politicians, firebombed opposition headquarters and assassinated a Catholic priest who held workshops on the Constitution and its limit of a   presidency. Scores of   protesters have already been shot dead, turning more people against Mr. Kabila each day. Opposition leaders are now threatening to flood the streets with millions of protesters on Tuesday, the day Mr. Kabila is supposed to be out of office. Seeing chaos on the horizon, top Western officials have shuttled in and out of the capital, Kinshasa, trying to draw the reclusive Mr. Kabila out from his riverside residence, where he lives under heavy guard. This year, Secretary of State John Kerry and other   American officials have met with Mr. Kabila several times. But several people who know the president well said Mr. Kabila was increasingly isolated, moody and antisocial. They said he had been keeping irregular hours, becoming irritable with his staff members and staying up late to play Sony PlayStation 4 or race his fancy motorcycles up and down the dark boulevards of Kinshasa to blow off steam. As Mr. Kabila plays for time, the information on corruption keeps streaming in, from many directions. In September, an American hedge fund,   Capital Management Group, admitted in a federal plea agreement to participating in a bribery scheme involving mineral deals and   Congolese officials. The officials were not named in the plea agreement, but several analysts said the information published by the Justice Department made it obvious that one was an adviser who was extremely close to Mr. Kabila  —   possibly one of the only men Mr. Kabila really trusted  —   before he died in a plane crash in 2012. Other investigations are in the works, and the American government is trying to delicately warn Mr. Kabila that his chances of being prosecuted for corruption would be lower if he left now. “No one can guarantee no prosecution, but in the real world, there are priorities,” said Tom Malinowski, an assistant secretary of state. “I don’t think one of them would be going after the former president of Congo who did the right thing. ” Still, no one has come up with an exit plan. Even the Western diplomats tasked with appealing to Mr. Kabila, pleading with him not to drive his country off a cliff, admit they are at a loss for what to offer. Mr. Kabila is still relatively young, 45, and if he is worried about keeping his wealth and avoiding jail after he leaves office, how does one guarantee that? All he has to do is look at Charles Taylor, Liberia’s former president, who agreed to leave office under intense international pressure and was soon apprehended, prosecuted and sentenced to decades in prison. And what about his safety? Mr. Kabila has made many enemies in nearly 16 years as the leader of one of the world’s most violent states. As one mining executive who used to be close to Mr. Kabila argued, it is not as if the American government is going to assign SEAL Team 6 to guard him in perpetuity, even if he asks. Mr. Kabila is not your typical strongman. He was driving a taxicab in Tanzania not long before he was thrust into power. His father, a smuggler turned rebel leader turned president, was assassinated in 2001. The only person top advisers could agree on to lead the country, which was in the midst of a very confusing civil war, was the elder son, Joseph, at the time 29. Unlike Isaias Afwerki, the president of Eritrea for the past 23 years, or Yoweri Museveni of Uganda (30 years) or Robert Mugabe, who has ruled Zimbabwe since independence (36 years) Mr. Kabila has never tried to build a cult of personality. He is shy, mild and a careful listener. Confidants say he never wanted to be president and tried to turn down the job. But over the years, former aides and investigators say, he has amassed a fortune and developed a taste for the finer things. A former colleague said he sometimes wore two expensive watches at the same time  —   a Rolex and a Patek Philippe  —   one for each wrist. Mr. Kabila and his family own a network of homes and huge farms across Congo, sweeping up thousands of acres, analysts and former aides said. They also said Mr. Kabila was most at peace around animals. He is an avid breeder of cows, and he kept a menagerie of chimpanzees, a   (a small antelope) birds of prey and parrots at his house in urban Kinshasa. A recent visitor said at least one chimp still lived there, screeching hoots from a cage as guests arrive. But these days, the stress of the job seems to be eating at him. Mr. Kabila has put on weight. The few times he was spotted in public he had huge bags under his eyes. More   are coming forward, which may make him even less likely to quit if he believes that he can best protect himself and his assets by intimidating or neutralizing critics with his security forces. One Congolese government official said that on numerous occasions he had been instructed to take wheeled suitcases, stuffed with $100 bills totaling more than $7 million, to a minister’s office for “state’s use. ” The money came from a   company. The official, along with several others, said it would be too dangerous for anyone but Mr. Kabila or his family to steal that blatantly. The Panama Papers  —   leaked confidential documents from a law firm in Panama  —   revealed that Mr. Kabila’s twin sister, Jaynet, using a different name, owned an indirect share in the nation’s largest mobile phone operator and through a company registered in Niue, in the South Pacific. Current and former Congolese officials described very complicated and suspicious business dealings involving foreign partners, joint ventures and lucrative mining concessions. One such deal recently attracted the attention of Britain’s Serious Fraud Office, which is investigating Congo’s   sale of mining rights through an Israeli tycoon who is a friend of Mr. Kabila’s. Because of Mr. Kabila’s lack of transparency, the International Monetary Fund halted a loan program worth hundreds of millions of dollars that Congo desperately needed. “It’s clear that the Kabila family has personally profited from the exploitation of natural resources and the manipulation of banks and   companies,” said Sasha Lezhnev, a manager at the Enough Project, a nonprofit organization that recently reviewed thousands of pages of documents and conducted more than 100 interviews on corruption in Congo. In the past two decades, Congo’s wars over minerals, politics, ethnicity and land have killed millions, destabilizing a big chunk of the continent. But its history of   gains goes back much further. Mobutu Sese Seko, Congo’s strongman during the Cold War, was one of Africa’s most notorious thieves, though back then it was easier to get away with corruption. None of the documents to emerge recently have Mr. Kabila’s signature on them, though the names of top aides and companies of Mr. Kabila’s associates are all over them. Lambert Mende, the chief government spokesman, said Mr. Kabila was “not a robber, not at all. ” “He has no account in Europe or the U. S. A. ,” Mr. Mende said. “He doesn’t have a single apartment outside of Congo. This is all storytelling. ” The most suspicious documents to emerge recently include a string of bank transfers to different accounts at different banks with the notation that they were “advance tax payments” from Gécamines, a struggling   mining company, for Congo’s central bank. Starting late last year, the transfers reveal anomalies like instructions that $8 million be withdrawn from the teller  —   in cash  —   on behalf of the central bank. “That makes no sense,” said a former employee of Congo’s central bank who spoke on the condition of anonymity, saying he could be killed if he was identified. “We don’t get cash from a commercial bank. We import our own cash. We have a service in Switzerland that does that. ” Analysts at the Sentry, an investigative arm of the Enough Project, said that during the time of the supposed Gécamines transfer of $95. 7 million to the central bank, the central bank’s foreign reserves actually dropped  —   to $1. 17 billion from $1. 47 billion  —   pushing up inflation and causing issues for Congo’s economy. At the same time, Mr. Kabila’s government drastically cut spending on health care and the few services it provides. Sentry analysts said they were curious how Gécamines, a company with endless management problems, would have that much cash on hand for advance tax payments when thousands of employees had not been paid in months. Documents showed that Gécamines lost $82. 9 million in 2014. Mining executives said bigger, more profitable companies always paid much less in advance taxes. Some of the money apparently stolen in Congo may have moved through the American financial system, Sentry analysts say, and they are calling on the United States Treasury Department to take stronger measures to combat suspicious transactions from Congo. This past week, the Treasury Department sanctioned two Congolese officials close to Mr. Kabila, saying the officials were undermining democracy. Across Africa, term limits established years ago when democracy’s brand was stronger have been systematically dismantled, sometimes with disastrous consequences. Burundi exploded last year when its president plowed ahead with his plan to stay in office for a contentious third term. In October, Mr. Kabila’s aides struck a deal with a few   opposition groups to delay the next presidential election until 2018  —   the election was supposed to be held this year  —   but Congo’s major opposition groups, representing tens of millions of frustrated people, rejected that. Opposition leaders said they would never accept Mr. Kabila’s staying in office beyond Dec. 19. Congo’s political opposition, unlike Burundi’s, is not heavily armed. Most analysts say it would be difficult to overthrow Mr. Kabila. The security forces are still loyal to him, partly because he has made sure that soldiers and intelligence officers have been relatively well paid, no matter the dire straits of the national economy. In a recent meeting with delegates of the United Nations Security Council, Mr. Kabila remained characteristically cagey. According to a confidential United Nations report, he said that it was the “sovereign right of the Congolese people to decide in the next three or so years to amend the Constitution,” implying he may be considering another run. Mr. Stearns, one of the   Congo analysts, argues that Mr. Kabila does not know how to get out of the corner he has put himself into. “That’s what makes this so difficult and volatile,” Mr. Stearns said. “My best guess,” he added, “is we’re headed into turmoil for several years to come. ”'"}, "time": 1742562005.3348658}