{"duration": 0.056508779525756836, "input_args": {"text": "'Video: ‘Rude’ CNN Reporter Asks Trump Why He’s Taking Time Off To Open A Hotel Meanwhile Hillary Clinton is at home sleeping Steve Watson | Infowars.com   \\nGOP nominee Donald Trump took time out of a relentless campaign schedule Wednesday to spend around an hour opening a new hotel, prompting one CNN reporter to accuse Trump of “taking time out of swing states.” Meanwhile Hillary Clinton is again nowhere to be seen. \\nCNN’s Dana Bash suggested that Trump should be more concerned with campaigning in swing states, yet Trump had three campaign stops scheduled for the same day. Dana Bash: Is your DC hotel opening free advertising?Donald Trump: “No, not at all” https://t.co/6OZtrfIwim https://t.co/9HHqooom8r \\n— CNN Politics (@CNNPolitics) October 26, 2016 \\n“So to people who say you’re taking time out of swing states to go do this, you say?” Bash asked. \\n“I say the following: You have been covering me for the last — long time. I did yesterday eight stops and three major speeches, and I’ve been doing this for weeks straight,” Trump responded. \\n“For you to ask me that question is actually very insulting because Hillary Clinton does one stop and then she goes home and sleeps. And yet you’ll ask me that question. I think that’s a very rude question, to be honest with you.” Trump exclaimed. \\nTrump added that the opening of the hotel also served to prove a point that he can get things built under budget and ahead of schedule, suggesting that the country needs to be able to follow suit. \\nWhile CNN has continuously run defense for Hillary Clinton amid a myriad of scandals, and even rigged its own polls to suggest she won the debates, the network has been forced to admit that Hillary is running an extremely light campaign schedule. \\nLast month, for example, Hillary went six days without an event except for a short speech she gave in Orlando, Florida. \\nAnd in August, Hillary took seven of the first 14 days of the month off and even went four days without a single campaign appearance. \\n“Her speeches are so short – they don’t last long, they’re like 10 minutes and ‘let’s get out of here,’” Donald Trump said about her schedule. “Go back home and go to sleep.” NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742562661.1860387}