{"duration": 0.06323361396789551, "input_args": {"text": "'STOCKHOLM (AFP)  —   Stockholm’s usually vibrant city centre was eerily silent on Friday evening with restaurants, bars and cinemas shuttered and streets emptied hours after a truck ploughed into a crowd outside a department store, killing four people and injuring 15. [Stockholmers appeared to be following police advice to stay indoors and avoid crowded areas, with a number of   city streets deserted.  The attack occurred just before 3:00 pm (1300 GMT) when a beer truck slammed into the corner of the bustling Ahlens store and the popular pedestrian street Drottninggatan, above ground from Stockholm’s central subway station. The initial scene was chaotic. After emergency responders rushed to the scene, several bodies could be seen lying on the ground covered with orange blankets. Shattered glass was scattered on the ground near a large blood stain on the asphalt. Shaken passersby described their horror at witnessing what police and Prime Minister Stefan Lofven described as a “terror attack”. “A massive truck starts driving   …     and mangles everything and just drives over exactly everything,” eyewitness Rikard Gauffin told AFP. “It was so terrible and there were bodies lying everywhere  …     it was really terrifying,” he added.  —   Trapped  —   Police cars and ambulances rapidly flooded the scene, as central streets and squares were blocked off amid fears that another attack could be imminent. Helicopters hovered overhead across the city, sirens wailed, and police vans   the streets using loudspeakers to urge people to head straight home and avoid crowded places. But with the metro system and commuter trains shut down for several hours after the attack, other streets heading out of the city were packed with thousands of pedestrians trying to find a way home. Central Stockholm would on any other Friday be abuzz with locals queueing up outside glitzy bars and restaurants and upscale nightclubs. Haval, a    sales clerk who didn’t want to reveal his last name, was in the metro at the time of the attack. His train stopped immediately and he had to get out, along with all the other passengers. They walked along the street before being ushered inside a nearby hotel for safety. “We were suddenly trapped inside a hotel and there was the worst kind of horror in there,” he told AFP. “We were scared, we were scared something else would happen, he added.  —   ‘Suddenly it happens’  —   The attack was the latest in a string of similar assaults with vehicles in Europe that include the southern French city of Nice, Berlin and London. “I never thought that something would happen in Sweden, but then suddenly it happens,” Haval said. One witness identified only as Dimitris told the Aftonbladet daily the truck came “out of nowhere. ” “I couldn’t see if anyone was driving but it was out of control. I saw at least two people get run down. I ran as fast as I could away from there,” he said.  —   ‘You won’t break us’  —   Marko was in coffee shop near the scene with his girlfriend when he saw the truck ram into the store. “He hit a woman first, then he drove over a bunch of other people   …     We took care of everyone lying on the ground,” he told Swedish daily newspaper Aftonbladet. Hasan Sidi, another passerby, told Aftonbladet he saw two elderly women lying on the ground. He said people at the scene urged him to help one of the women who was “bleeding to death”. “One of them died  …    I don’t know if the other one made it,” Sidi said. “The police were shocked. Everyone was shocked. ” Despite that shock, Sweden was determined to not let the attackers create fear. “Terrorists want us to be afraid, want us to change our behaviour, want us to not live our lives normally, but that is what we’re going to do. So terrorists can never defeat Sweden, never,” Prime Minister Lofven said. Shortly afterwards, he placed a bouquet of flowers near the scene, visibly shaken and wiping away a tear. In an editorial, Sweden’s biggest broadsheet Dagens Nyheter wrote: “What we feared for a long time finally happened. ” “The fear and panic right after the incident was inevitable. The images from the attack were terrible,” the paper said. But Stockholm managed to stay “ ” even though the attacker struck “Sweden and Stockholm’s heart” it added. “Stockholm stands strong. You won’t break Stockholm. ”'"}, "time": 1742562259.5584617}