{"duration": 0.06491398811340332, "input_args": {"text": "'Compound found in onions has anti-ovarian cancer effects \\nSunday, October 30, 2016 by: David Gutierrez, staff writer Tags: cancer prevention , onions , quercetin (NaturalNews) A chemical naturally occurring in onions may be able to suppress the proliferation of ovarian cancer cells, and perhaps even initiate cancer cell death, according to a study conducted by researchers from Kumamoto University in Japan, and published in the journal Scientific Reports .These particular anticancer effects come from a chemical called onionin A (ONA). The study focused on the effects of ONA on the most common form of ovarian cancer, epithelial ovarian cancer (EOC). This type of cancer has a five-year survival rate of only 40 percent. It is the 10th most common female cancer in the United States, and the fifth most lethal form of cancer in women. As many as 80 percent of EOC patients relapse after their first course of chemotherapy. Kills cancer cells, suppresses tumor growth In a prior study, the researchers found that ONA suppressed the tumor-promoting activity of a type of white blood cells known as myeloid cells.In the new study, researchers further examined cell-based models of EOCs. Firstly, they found that the introduction of ONA caused EOC tumor growth to slow. Further examination showed that ONA was inhibiting the tumor-boosting activities of myeloid-derived suppressor cells (MDSCs), thereby confirming the findings of the prior study.Previous research has suggested that in the presence of cancer, MDSCs may function to suppress anti-tumor activity by the rest of the immune system.The researchers also found that when combined with anti-cancer drugs, ONA boosted the ability of the drugs to block cancer proliferation.\"We found that ONA reduced the extent of ovarian cancer cell proliferation induced by co-culture with human macrophages,\" the researchers wrote. \"In addition, we found that ONA directly suppressed cancer cell proliferation.\"The researchers then performed an additional experiment, giving mice with EOC oral treatment with ONA and comparing them with a control group. They found that the mice given ONA lived longer, and their tumors did not grow as aggressively. No side effects were observed from the treatment.The researchers concluded that with some additional testing, ONA could be used as an oral cancer treatment.\"ONA is considered useful for the additional treatment of patients with ovarian cancer owing to its suppression of the pro-tumor activation of [tumor-associated macrophages] and direct cytotoxicity against cancer cells,\" they wrote.Studies have also linked onions to a lower risk of stomach and colorectal cancers. The overlooked superfood Scientists continue to uncover remarkable health benefits of the humble onion, which is a staple food in every culture in which it is found.The benefits of onions start simply with their nutrient profile: These vegetables are highly nutrient dense, delivering high levels of vitamins, minerals and antioxidants, with relatively few calories. A single cup of chopped onions contains 10 percent or more of the daily recommended amount of vitamin B6, vitamin C and manganese, and also contains calcium, folate, iron, magnesium, phosphorus and potassium. In addition to vitamin C, onions are high in other antioxidants, particularly quercetin . Antioxidants help protect the body from free radicals that cause chronic diseases such as heart disease and cancer.Researchers attribute many of onions\\' health benefits to quercetin, including lower blood pressure and improved cardiovascular health. Quercetin is also a potent anti-inflammatory.Other benefits of onions may stem from some of the other nutrients it contains. Studies have shown that onions can help fight depression, an effect that may come in part from their high folate content. Folate helps prevent a buildup in the body of homocysteine, which in turn can suppress the production of mood-regulating neurotransmitters. Excess homocysteine can also interfere with sleep and appetite.Onions are a versatile food. The entire plant is edible (except for the small roots), and can be eaten in nearly any form. It can be cooked into recipes, added raw on top of salads or sandwiches, or used as an ingredient in dips and sauces. Sources for this article include:'"}, "time": 1742563460.7968447}