{"duration": 0.042981863021850586, "input_args": {"text": "'Comments \\nA new story about the cyber attack on Democratic National Committee headquarters is giving rise to new questions. We have to stress that as of right now, it’s a single source exclusive report from Mother Jones , which comes from unnamed DNC sources who are quoted on background only. MJ reports that the Democratic Party’s outside security company found signal intelligence indicating that a cellular interception device was being deployed to intercept DNC, and that that information and technical details were turned over to the FBI for investigation. \\nIn an episode reminiscent of Watergate, the Democratic Party recently informed the FBI that it had collected evidence suggesting its Washington headquarters had been bugged, according to two Democratic National Committee officials who asked not to be named by Mother Jones : \\nThe second sweep, according to the Democratic officials, found a radio signal near the chairman’s office that indicated there might be a listening device outside the office. “We were told that this was something that could pick up calls from cellphones,” a DNC official says. “The guys who did the sweep said it was a strong indication.” No device was recovered. No possible culprits were identified. \\nThe DNC sent a report with the technical details to the FBI, according to the DNC officials. “We believe it’s been given by the bureau to another agency with three letters to examine,” the DNC official says. “We’re not supposed to talk about it.” \\nThe FBI did not respond to a request for comment \\nOf course, would not the first time that Democratic National Committee headquarters have been targeted for bugging to intercept the information contained within those walls. \\nWe already know that the DNC’s emails have been compromised already, which itself IS a second Watergate incident not materially different than stealing memos from a filing cabinet. \\nHowever, we cannot stress enough that the Mother Jones report may be inaccurate because is not supported by a major disclosure of the underlying facts, named sources or other corroborating media reports. \\nYet.'"}, "time": 1742563840.7751245}