{"duration": 0.14156508445739746, "input_args": {"text": "'  The Clinton Crime Family. “Hillary is the Most Dangerous Presidential Aspirant in US History” By VNN on October 30, 2016 Hillary is the most recklessly dangerous presidential aspirant in US history, \\nby Stephen Lendman \\nThe Bill and Hillary crime family long ago should have been held accountable for high crimes against peace and numerous others. Hillary is the most recklessly dangerous presidential aspirant in US history, supporting endless imperial wars and state terror, once saying “(w)hat do we have NATO for if not to defend our way of life.” There was never a war Hillary did not support – Crimes against Humanity She endorses first-strike nuclear weapons use, calling them peacekeeping deterrents, mindless of their power to destroy life on earth. She’s militantly anti-Russia, earlier compared the nation to Nazi Germany, Putin to Hitler, claiming “he doesn’t have a soul,” has revanchist aims, wanting Russian greatness restored – all of the above a perversion of truth, not to mention a pretext to wage war on Russia. The so-called Clinton Foundation is a suspected criminal enterprise, masquerading as a charitable NGO. It promotes Big Lies about “improving global health, increasing opportunity for women and girls, reducing childhood obesity and preventable diseases, (as well as) creating economic opportunity and growth…” Film producer Frank Huguenard believes Hillary Clinton faces impending federal racketeering charges under the 1970 Racketeering Influence and Corrupt Organizations Act (RICO). Enacted to fight organized and white collar crime, racketeering is defined to include fraud, bribery, money laundering, embezzlement, drugs trafficking, murder, and various other offenses under the Federal criminal code (Title 18), even acts of terrorism. According to Huguenard, Obama-appointed FBI chief James Comey will recommend Attorney General Loretta Lynch treat “the Clinton Foundation (as) an ongoing criminal enterprise engaged in money laundering and soliciting bribes in exchange for political, policy and legislative favors to individuals, corporations and even governments both foreign and domestic.” Morning Joe Destroys Corrupt Clinton Foundation – “Total Corruption” Strong stuff if only partly true! Huguenard cites credible evidence, indicating the Clinton Foundation is largely a money laundering, influence peddling racket. Less than 10% of “tens of millions of dollars donated” went for charitable purposes, the rest for self-enrichment. “There is ample evidence already in the public record that the Clinton Foundation qualifies as a criminal enterprise and there’s no doubt that the FBI is privy to significantly more evidence than has already been made public,” said Huguenard. If Comey recommends Attorney General Lynch indict Hillary Clinton, it’s unlikely she’ll prosecute a woman she’s had close ties to for years. Bill Clinton appointed her US Attorney for the Eastern District of New York – serving from 1999 – 2001. From 2003 – 2005, she was a Wall Street controlled New York Federal Reserve Bank of New York board member – the mother bank most complicit with its member bank crooks. From 2002 – 2010, she was a Washington-headquartered Hogan & Hartson (H & H) law firm partner. Its New York-based partner Howard Topaz filed income tax returns for Bill and Hillary Clinton, beginning in 2004. In May 2004, H & H filed patent trademark documents for Denver-based MX Logic Inc., the computer software firm responsible for developing email encryption technology used to manage Hillary’s private email server, beginning in July 2013. Judicial Watch president Tom Fitton According to Judicial Watch president Tom Fitton, if H & H (now Hogan Lovells following a 2010 merger) “represented the Clintons on tax matters,” Lynch is responsible for disclosing any involvement she may have had, direct or indirect. In April 2008 during Hillary’s first presidential campaign, The American Lawyer called H & H one of her largest legal industry supporters. Loretta Elizabeth Lynch, Attorney General of the United States. Partner Christine Varney was chief counsel to the Clinton/Gore 1992 campaign. The ties between H & H, Lynch and the Clintons are longstanding. In November 2014, Obama announced her appointment as attorney general, succeeding Eric Holder, effective April 27, 2015 after Senate confirmation. It’s hard imagining her biting a hand contributing greatly to her career advancement. Key for Clinton is how much more of her dark side becomes public knowledge besides what’s already known. If enough despite Lynch declining to indict and supportive media scoundrels downplaying or whitewashing her offenses, the Democratic (sic) National Committee (DNC) might be forced to jettison her as damaged goods. She’d be red meat for Trump to take full advantage of in the fall campaign. Would Bernie Sanders party bosses don’t want become Democrat standard bearer in July? Or will Joe Biden or another high-profile party member perhaps be chosen as a late-stage establishment nominee, a brokered convention manipulating things? America’s political system is too debauched to fix. Duopoly power eliminates governance of, by and for everyone equitably. Republicans and Democrats are two sides of the same coin – special interests served exclusively, ordinary people betrayed, the same outcome every electoral cycle. Whoever succeeds Obama, likely worse than ever governance will follow. The greatest concern is preventing possible WW III. Clinton’s rage for endless wars, along with her Sino/Russian hostility makes the unthinkable possible. Stephen Lendman lives in Chicago. He can be reached at . His new book as editor and contributor is titled “Flashpoint in Ukraine: US Drive for Hegemony Risks WW III.” http://www.claritypress.com/LendmanIII.html . Visit his blog site at sjlendman.blogspot.com. \\nA historical milestone need not come at the expense of America.'"}, "time": 1742562337.364704}