{"duration": 0.0951235294342041, "input_args": {"text": "'  Iowa Berniecrat Chris Schwartz Claims That His House Was Vandalized By Christians Iowa Berniecrat Chris Schwartz Claims That His House Was Vandalized By Christians October 29, 2016, 8:38 am by Terresa Monroe-Hamilton Leave a Comment 0 \\nBy: Renee Nal | New Zeal Vandalized sign posted by Chris Schwartz on Facebook \\nIowan Chris Schwartz has alleged that vandalism found at his property on Thursday is the work of citizens influenced by “hateful rhetoric” of a Christian patriot group who vocally opposes his run for a seat on the Black Hawk County Board of Supervisors. \\nChris Schwartz is a socialist running as a democrat in Black Hawk County, Iowa. He is endorsed by Bernie Sanders’ organization “ Our Revolution ” and is the state director of Americans for Democratic Action (ADA), an organization revealed as being used by communists to influence Democratic policy by former communist Marvin Treiger in Trevor Loudon’s film, the “ Enemies Within .” \\nChris Schwartz was described at The Nation in 2007 as “a recent graduate of the University of Northern Iowa and one of CAN’s vocal leaders.” CAN is the Campus Antiwar Network , which is “widely perceived to have been dominated by students from the ISO.” \\nISO stands for the International Socialist Organization , a Trotskyist, communist group. ISO is notorious for supporting the Palestinian and Arab causes in the Middle East and led many militant protests against America’s war effort in Iraq. Additionally, virtually all leaders of the now-defunct CAN were members of ISO. In line with ISO policy, Schwartz was involved in anti-Israel activities and led an anti-Iraq war rally in support of Cindy Sheehan, who became a vocal critic of the Iraq war after her son was killed during his service in Iraq. \\nISO’s website, SocialistWorker.org has quoted Chris Schwartz here and here . \\nAn insight into Chris Schwartz’s anti-business, pro-government mentality is revealed in this 2011 blog post by Paul Deaton at the self-described “online information resource for Iowa’s progressive community:” \\n“To wrap up the speakers, Chris Schwartz of Working Families Win, Iowa spoke, with a list of grievances about the government. He touched on the South Korea, Columbia and Panama free trade agreements and on building an “infrastructure bank.” He opined that GMAC, a major employer in Waterloo, “is a corrupt company,” and that the electrical grid “can’t handle new technologies.” He asserted many opinions, the most evident of which was that “government should put people back to work.” Not once did he mention private companies in a favorable light. Some in the audience believe that government should not be the primary driver in putting people back to work. Schwartz had a different opinion.”'"}, "time": 1742563550.32726}