{"duration": 0.0965266227722168, "input_args": {"text": "'Colin Kaepernick, the San Francisco 49ers quarterback who touched off a national debate when he chose not to stand during the playing of the national anthem before games, has emboldened a handful of other players to follow suit. In a continuing protest against racial injustice, Kaepernick knelt before a game Monday night while other players took a knee or raised their fists. A day earlier, four Miami Dolphins players knelt during the anthem, and a member of the Kansas City Chiefs raised his fist before a separate game, saying later that he had been acting in solidarity with Kaepernick. Two players from the New England Patriots and three from the Tennessee Titans also raised their fists on Sunday. Those actions were considered radical because they happened amid a sports landscape where provocative stances by prominent athletes have been rare, even during surging and searing national discussions over race, justice and politics. According to current and former athletes and sports officials, professional athletes find themselves preoccupied with financial and branding concerns an        sports culture and fan bases that expect athletes to “shut up and play. ” “If you don’t know what you’re up against, you’re screwing yourself,” said Ricky Jean Francois, a defensive end for the Washington Redskins. “You may lose your job. You may lose your endorsement. You may lose your relationship with   people. Guys don’t want to lose what they worked so hard for throughout their whole career. ” Most athlete advocacy today tends to be in support of established causes. Many influential athletes, on social media or in the occasional forum, have made modest pleas against violence and for better race relations. Others have gone a step further. Miami Heat players posed for a picture wearing hoodies in 2012 after the shooting death of Trayvon Martin in Sanford, Fla. In 2014, basketball players from college to the pros warmed up in   that declared, “I Can’t Breathe”  —   a rallying cry for protesters after a New York police officer’s chokehold led to the death of Eric Garner on Staten Island. The University of Missouri football team last year refused to play until the university system president resigned over the university’s perceived handling of racial tensions. (He resigned two days after the boycott was announced.) In July, several W. N. B. A. players wore   during   in support of the Black Lives Matter movement and five police officers then recently killed in Dallas. They received fines, later rescinded. That same month, four of the N. B. A. ’s biggest stars  —   Carmelo Anthony, LeBron James, Chris Paul and Dwyane Wade  —   opened the ESPY Awards by urging fellow athletes to push for change on issues of race, policing and violence. Still, few recent athletes have stuck their necks out as far as Kaepernick has, let alone become firebrands like the ones remembered by previous generations. The brashness of Jack Johnson, a black boxer in the early 20th century, could have gotten him lynched  —   and, in fact, got him jailed, for having a romantic relationship with a white woman. Muhammad Ali missed some of his prime boxing years because he refused to fight in the Vietnam War. The Olympic sprinters Tommie Smith and John Carlos were suspended and sent home from the 1968 Summer Games after they thrust their fists into the air in a gesture of black solidarity. Smith and Carlos returned home to death threats, and their Olympic careers were effectively over. But Johnson and Ali competed in an individual sport and, because they were acting before professional sports were big business, did not risk losing the kind of huge endorsement deals that exist today. Denver Broncos linebacker Brandon Marshall is already feeling the financial impact of kneeling during the national anthem before his team’s opening game last week: He has lost two endorsement deals. But some believe that athletes should push the issue harder. “We are missing a Muhammad   athlete in this generation, especially on the men’s side,” said Layshia Clarendon, a guard for the Atlanta Dream of the W. N. B. A. Referring to the   protest of some of her fellow W. N. B. A. players, she added, “If LeBron and Wade and all those guys decided to stand up and be like, ‘We’re not going to go for this,’ if they do something like that, it would be tremendous. ” Team owners sometimes send subtle signals that players should avoid rocking the boat, to prevent a blizzard of political and social opinion. Josh Childress, who has played eight seasons in the N. B. A. and spent part of last season with the Texas Legends of the N. B. A. Development League, said there was “definitely a silent pressure” from teams and sponsors for athletes to censor themselves. “The less distractions for teams, the better,” Childress said. “I just think it’s in their best interests to keep you in the athlete box. Unless you just have some quirky personality thing that makes you more likable, or you’re really, really good, they want to just keep business as usual: Do your job on the court, and let’s keep the distractions to a minimum. ” Today’s athletes are “not disruptive enough,” said Brendon Ayanbadejo, a former N. F. L. player who began voicing support for   marriage rights in 2008, before they had been affirmed by most states. “I think if you want to be heard and you want to make a difference, you have to be disruptive. That’s the way your story is going to get picked up. ” But such a move can be difficult when athletes find themselves confronting unwritten rules against talking about race, religion and politics. After Ayanbadejo staked his position, some of his teammates made jokes, he said. Officials with his team, the Baltimore Ravens, did not grant some news media interview requests, he said. “Whether it’s an agent, family members or financial advisers, there’s a culture around every athlete that says, Maximize your endorsements, maximize your salary, and connect as best you can to your community,” said Robert Boland, the director of the sports administration program at Ohio University. But is it even fair to expect athletes  —   especially black ones  —   to take the lead in fighting social injustices? “Athletes are not trained to be political they’re not trained to be activists,” said Todd Boyd, who holds the Katherine and Frank Price endowed chair for the study of race and popular culture at the University of Southern California. “We don’t hold white athletes to these same standards. ” Nor is it fair, Boyd said, to compare today’s athletes with their predecessors. “What people seem to forget is that Muhammad Ali was going to be drafted and sent to fight in Vietnam  —   this is a very real thing,” Boyd said. “Ali wasn’t just protesting out of the goodness of his heart. He was trying to avoid going to fight in a war he didn’t agree with. ” Through the 1980s and ’90s, athlete activism seemed to simmer down as, perhaps not coincidentally, sports revenues and salaries rose and careful cultivation of brands became the norm. Perhaps no one embodied the spirit of carefully crafting an image more than Michael Jordan, the biggest sports star of his era. This year, after months of questions, he issued a statement objecting to a North Carolina law that curbed   protections for lesbian, gay, bisexual and transgender people  —   a law that led the N. B. A. to move its   Game out of the state. But Jordan had a longstanding aversion to taking political stances during his playing career, saying, in one telling, “Republicans buy shoes, too. ” Jordan has denied making that statement, attributed to him in the 1995 book “Second Coming: The Strange Odyssey of Michael Jordan,” by Sam Smith. But even if that quotation is false, Jordan has showed little willingness to engage in controversial politics. “I often wondered how that affected other players who thought that Michael was somehow of the view that he did not want to do anything to damage his brand,” said Michele A. Roberts, the executive director of the N. B. A. players’ union. “That is, If Michael can’t do it, I can’t. ” One of Jordan’s teammates with the Chicago Bulls, Craig Hodges, bucked that trend and, he said, paid a price. When the team visited the White House after winning its second straight title in 1992, Hodges handed President George H. W. Bush a letter asking him to do more to end injustices toward  . Neither the Bulls nor any other team in the league signed Hodges for the next season, ending his   N. B. A. career. Hodges sued the league, claiming it had blackballed him because of his outspokenness, but his lawsuit failed. Recent events, however  —   particularly the shootings of unarmed black men by the police  —   have wrought vigorous and often fiery debate over race relations and justice. With the United States’ major sports leagues in some cases dominated by   players, some have felt compelled to speak out. But Anthony, a star forward for the Knicks, has expressed frustration that the action often ends at those statements, or the occasional joining of a march. Over the summer, after the police shootings in Baton Rouge, La. and suburban Minneapolis and the killing of five police officers in Dallas, Anthony posted an impassioned plea on Instagram. He called on athletes to do more than march and send messages on Twitter and, instead, “to put the pressure on the people in charge” to get “justice. ” He later organized a    forum in Los Angeles, along with members of the men’s and women’s Olympic basketball teams, the Los Angeles Police Department and community leaders. Roberts, the basketball union president, credited Anthony for going beyond the usual expectation that athletes should just play their sport. “If you’re really worried about damaging your brand, you’ll do what a lot of people say: Play ball and shut the hell up, which is, sadly enough, a very popular belief among a significant part of our community,” she said, adding, “So while it was fairly neutral as far as statements go, it still crossed the line that a good number of people think players should never dare cross. ” But no athlete lately has caused more commotion than Kaepernick. Kaepernick first caused an uproar when he was spotted sitting during the national anthem before a 49ers preseason game last month and told NFL. com that he had done so because he was not going “to show pride in a flag for a country that oppresses black people and people of color. ” Kaepernick, who was born to a white mother and a black father and was adopted, met fierce criticism from people inside and outside the league who said he was disrespecting the military. But his protest has inspired other athletes to do the same and his team to contribute $1 million to a foundation to work toward “improving racial and economic inequality and fostering communication and collaboration between law enforcement and the communities they serve” in the Bay Area, according to a statement from the 49ers’ chief executive, Jed York. Before Monday night’s game between the 49ers and the Los Angeles Rams, Kaepernick continued his protest by kneeling with a teammate during the national anthem. Two of his teammates, along with two players on the Rams, raised their fists during the anthem. Although he had been relegated to a backup role entering the 49ers’ season opener Monday night, Kaepernick’s jersey has become the league’s top seller. He has vowed to donate his cut of the sales to organizations that further the cause of ending police brutality.'"}, "time": 1742628528.2997942}