{"duration": 0.03939986228942871, "input_args": {"text": "'Date: October 29, 2016 By: Wayne Thomas, Nation One News | In a White House invitation only event, “Science” conference. Barack Obama went off topic to discuss the Media. Specifically, what he called the “magazines you get at the grocery store”. He characterized this kind of media as a problem. His comments came following a lengthy conference with a room full of Obama’s scientific elite. So of course, his comments were well received by the audience. It is not hard to interpret what Obama is talking about. He is talking about papers like ours. We are not controlled by anyone except our own conscience. We use titles that encourage people to read our content. But, you won’t find us in the Grocery store. No, you will find us everywhere else. We check our facts and all too often they don’t agree with what the mainstream media wants you to believe! He begins by saying: “We are going to have to rebuild, within this wild, wild west of information flow; some sort of curating function” You will notice he explains how the media was once easy to control when he says: “It used to be there were three television stations, and Walter Cronkite was there” He goes on in an attempt to bundle everyone who disagrees with them into the same group as conspiracy theorists by saying: there were always those WHO didn’t agree, and [chuckle THEY] didn’t believe we landed on the moon or that Elvis is dead. He makes a striking admission when he says: It wasn’t always as democratic as it should have been. He closes his idea by saying: There has to be some for of way we can sort through information that passes some sort of truthyness test. I don’t need to remind you that Barrack Obama is speaking to a room full of hundreds of very influential people. These include teachers, scientists, and even politicians. Barack Obama just instructed that community to find a way to Censor Free Press without calling it “Censoring the FREE PRESS.” Within days of his statements, we see the Establishment Media targeting small sites and up and coming news sources such as Breitbart. We wrote a story about this earlier today. There have also been hundreds of reports of censorship by Facebook, which we will report on in the coming days. Barack Obama never mentioned Donald Trump, but one has to wonder why now? Why now, after forty years of the unmolested free press does the Establishment want to Censor it? The answer is right in front of you , after all, look at what you are reading, and who published it. We are not ABC, NBC, CBS, CNN, or FOX. We are nationwide Media organization not motived by money, and we run on a shoestring budget.We are the FREE PRESS! I mean I wrote this article, cut the video, fact checked it, published it and never left the folding table in my garage. Man! …the weather is nice this weekend! Who needs an AR-15 when you have a KEYBOARD! Here is the Video is you feel the need to check my facts. Submit your review'"}, "time": 1742628446.6672199}