{"duration": 0.057203054428100586, "input_args": {"text": "'An   teacher stands accused of using his knowledge of science to launch an illegal methamphetamine manufacturing business, echoing the popular TV show, “Breaking Bad. ”[Las Cruces police arrested John W. Gose, 56, who once taught school in Las Cruces and El Paso, New Mexico, and charged him after a traffic stop with manufacturing the illegal drug .  Gose was found with lab equipment thought to be part of his   operations. Testing later revealed traces of meth. At his home, investigators later discovered traces of meth and other supplies and chemicals to produce the drug. The former teacher pleaded guilty before District Judge Fernando R. Macias in 3rd Judicial District Court in Las Cruces, according to the Doña Ana District Attorney’s Office. Gose spent almost nine years reaching in the El Paso Independent School District, resigning in 2008 to become a vocational teacher at Oñate High School in Las Cruces. After spending only one semester at Oñate High School, Gose took a job teaching   science at Camino Real Middle School where he worked until February of 2016. “That the defendant, in this case, chose to plead guilty to all of the charges is a testament to the strength of the investigation,” District Attorney Mark D’Antonio said in statement according to the Las Cruces  . “Thanks to the hard work of the Las Cruces Police Department, the New Mexico State Police and the prosecutors in this office, we are able to close the books on this case of life imitating art while saving the taxpayers of New Mexico the cost of a jury trial. ” The   teacher’s story mirrors the plot of the AMC series “Breaking Bad,” the story of   Walter White who turns to illegal drug production to make enough money for his family after he dies of cancer. While Mr. Gose doesn’t have cancer, his actions are otherwise similar to the series. Gose Pleaded guilty to four counts and will undergo a   evaluation period before sentencing. He could face a maximum of 20 and   years in prison. Parents at Camino Real Middle School were shocked by the court’s revelations. “I’m still trying to wrap my head around it. I mean, you don’t expect a teacher to have that kind of stuff in his car,” parent Misty Ward told Fox 14. “It’s just conflicting what us parents are trying to teach our children,” parent Eileen Lujan added. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563113.8284876}