{"duration": 0.027208566665649414, "input_args": {"text": "'0 comments Hillary has been caught in a NEW scandal and this one has FOREIGN implications as it involves trying to FIX a Palestinian election. Listen to how casually Hillary recommends “determining” the winner in a Palestinian election when she thinks the conversation won’t get out… …then imagine what she’d do to win this one? Unearthed tape: ‘We should have made sure that we did something to determine who was going to win’ The Observer reports : The tape is 45 minutes and contains much that is no longer relevant, such as analysis of the re-election battle that Sen. Joe Lieberman was then facing in Connecticut. But a seemingly throwaway remark about elections in areas controlled by the Palestinian Authority has taken on new relevance amid persistent accusations in the presidential campaign by Clinton’s Republican opponent Donald Trump that the current election is “rigged”! Speaking to the Jewish Press about the January 25, 2006, election for the second Palestinian Legislative Council (the legislature of the Palestinian National Authority), Clinton weighed in about the result, which was a resounding victory for Hamas (74 seats) over the U.S.-preferred Fatah (45 seats). \\n“ I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake, ” said Sen. Clinton. “ And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win. ” Today The FBI has reopened their email investigation because Hillary keeps lying. Now this? All on the heels that WikiLeaks proved she is a drunk…HMMM I have this feeling that Hillary is somewhere drowning herself in a bottle of boos! She might want to go on a two week binge! This action is atrocious! To meddle in foreign elections is abominable and Hillary and Obama have both done so more than once. Insanity! I called Hillary for comment. She said, “What difference does it make?”'"}, "time": 1742628469.5680785}