{"duration": 0.061147451400756836, "input_args": {"text": "'Home › POLITICS | US NEWS › HUMA ABEDIN SWORE UNDER OATH SHE GAVE UP ‘ALL THE DEVICES’ WITH STATE DEPT. EMAILS HUMA ABEDIN SWORE UNDER OATH SHE GAVE UP ‘ALL THE DEVICES’ WITH STATE DEPT. EMAILS 0 SHARES [10/30/16] In a normal election year, a normal candidate’s close aide who caused even minor embarrassment to a campaign so near to Election Day would be whisked away as quickly as possible to avoid becoming a distraction. \\nBut Huma Abedin is not simply a close aide, she’s a critical member of Hillary Clinton’s tiny inner circle that protects and — at times — enables the deeply flawed and secretive Democratic nominee. \\nSo despite FBI Director James Comey’s announcement that the bureau is reviewing emails from Abedin’s time at the State Department reportedly found on a laptop she shared with her soon-to-be ex-husband Anthony Weiner (confiscated as a part of the FBI’s investigation into allegations he sexted with a 15-year-old North Carolina girl), the campaign made clear on Saturday that she’s not going anywhere. \\nJohn Podesta, the chairman of the Clinton campaign, told reporters on a conference call that Abedin had been nothing but cooperative with investigators and sat for hours of depositions last summer as part of the civil lawsuit filed by Judicial Watch. \\n“There’s nothing that she’s done that we think calls into question anything that she’s done with respect to this investigation… we fully stand behind her,” Podesta said. \\nBut the new information that the FBI found State Department-related email on her home laptop also calls into question whether Abedin in fact turned over all of the devices she used to send and receive email while working at State. \\nOn June 28, 2016, Abedin said under oath in a sworn deposition that she looked for all devices that she thought contained government work on them so the records could be given to the State Department. (These records were subsequently reviewed by the FBI.) \\n“How did you go about searching for what records you may have in your possession to be returned to the State Department?” Attorney Ramona Cotca for Judicial Watch asked her. \\n“I looked for all the devices that may have any of my State Department work on it and returned — returned — gave them to my attorneys for them to review for all relevant documents. And gave them devices and paper,” Abedin answered. Post navigation'"}, "time": 1742564621.8485773}