{"duration": 0.0838162899017334, "input_args": {"text": "'Tuesday’s special GOP primary election to fill the U. S. House seat of former Rep. Mick Mulvaney ( ) now Director of the Office of Management and Budget, turned nasty in its final days, with the campaigns of rivals Chad Connelly and Tom Mullikin accusing each other of disingenuous campaigning. [Accusations are flying between the two camps, with Connelly’s campaign calling Mullikin a “  Democratic lobbyist” and Mullikin’s supporters painting Connelly as a closet #NeverTrump GOP establishment insider.  If you want a career politician, I’m not your guy. But if you’re sick of business as usual, I’m an outsider who will fight for #SC5 values! pic. twitter.   —   Chad Connelly (@ChadConnelly) March 28, 2017,  Connelly’s website is loaded with   populist policy snippets like, “It’s simple: stop the bleeding before tackling the problem of those already here illegally  —   start by building the wall” and “It’s such a breath of fresh air to have a President willing to take the side of prosperity, and I look forward to working with him. ” Connelly’s credentials as an outsider, however, have been called into question over the last week. The Washington Times reported Thursday that Connelly was employed by the RNC as “director of faith management,” even as he launched his congressional bid. His 2016 RNC salary was reported as $120, 000, and he continued to receive payments from the RNC until over a month after he began to raise money for his campaign. From   Connelly served as Chairman of the South Carolina Republican Party. No evidence of impropriety has surfaced, but the overlap of Connelly’s employment and campaign fundraising, along with his connections to the state and national Republican apparatus, has raised eyebrows. “The bigger thing here is the appearance. It may be that it doesn’t look very good,” Michael Kang, an Emory University law professor, told the Washington Times. Beyond his strong connection with the RNC, often seen as the epitome of the “Republican Establishment,” supporters of Mullikin, are appalled at his presentation as a Trumpist. Karen Giorno, former Trump Southeast Regional Political Director and Senior Advisor to the Trump for President Campaign, spoke at a Mullikin event to express her misgivings, calling him a “poster child for the establishment:” In his TV ads, Chad is described as an outsider and an unwavering supporter of Donald Trump. Those claims are patently untrue. I personally observed Chad, in multiple states, leading efforts to defeat Trump Delegates at Republican conventions, despite you, the voters, pledging those delegates to Donald Trump. Chad worked tirelessly on behalf of his employer, the Republican National Committee, to deny Donald Trump the Convention victory he earned that you, the American people, demanded. In a press release issued after the event, Giorno added, “I know he worked against us behind the scenes. All this happened while he was taking $120, 000 a year of the Republican National Committee’s money. ” Donald Trump’s victory in the South Carolina Primary was pivotal in propelling him to the nomination. The “Trump Strike Team” organized out of Republicans from California and other states in the final days of that campaign tipped the balance in candidate Trump’s favor, much to the chagrin of leftist journalists. Members of the Strike Team joined Giorno at the Mullikin event to attest that Connelly had worked to stop Trump both before and after his victory in the South Carolina contest. Girono told Breitbart News that Connelly pushed his own slate of #NeverTrump delegates with the intention of nullifying Trump’s primary victory. Politico reported on these machinations in the aftermath of the primary, while Trump’s nomination was anything but assured. According to Giorno, Connelly also did not attend a “Unity Breakfast” designed to bring   primary voters into the fold before the general election and, at the South Carolina Republican Convention, he refused to sign a Trump banner with the other attendees. Mullikin’s campaign provided Breitbart News with photographs of the banner, which lacked Connelly’s signature. Connelly’s campaign denied Giorno and the Mullikin campaign’s accusations in the strongest terms, calling them “complete fabrications” and “last second desperation” from Mullikin’s camp. “They ought to be ashamed of themselves,” Connelly staffer Luke Byars told Breitbart news. “It’s disgusting that Tom Mullikin is sanctioning this and it shows you how desperate he is. ” The Connelly campaign points to his efforts during the general election as proof of his commitment to the President. “Last year, Chad Connelly spent 140 nights away from home working to get evangelical support for Donald Trump,” Byars told Breitbart news. As for the Primary season, Byars noted that, as an   he was prohibited from supporting any candidate. “He was not allowed to be involved in the primary process at all,” he said. “What proof do they have, other than [Giorno] who is making stuff up?” Byars asked. He called Connelly’s principle accuser “a disgruntled Trump campaign staffer who was fired,” referring to Giorno’s reassignment amid controversy from Trump’s field operations in Florida to an advisor’s position in New York City. Robert Cahaly, a strategist working with the Mullikin campaign, found that characterization “ridiculous. ” “She went from being in the field to being at Trump Tower, and that means she was fired? That’s the kind of spin only an RNC professional could come up with,” he told Breitbart News. Mullikin’s campaign pointed to Connelly’s retinue of supporters as indicating his #NeverTrump history. For example, prominent #NeverTrump voice Erick Erickson, formally of RedState and now the principal of   conservative site The Resurgent, glowingly endorsed Connelly last month. Cahaly called the continued posting of the endorsement on Connelly’s website a “loud and clear message to  . ” Connelly has, however, also been endorsed by a wide swath of the Republican   including Freedom Caucus chairman Rep. Mark Meadows ( ) and early   former Arkansas Governor Mike Huckabee. Tom Zawatowski, leader of an Ohio tea party group, endorsed Connelly in a Facebook post in which he recalls Connelly playing a pivotal role in getting Ohio’s evangelical community on Trump’s side, even as #NeverTrump Governor John Kasich refused to support Trump in the general election. Connelly’s campaign let fly its own accusations against Tom Mullikin, who has gone to great lengths to position himself on social media as “the   candidate. ” As a loyal #TeamTrump soldier I’m always proud to answer the call. Go vote May 2nd #SC05 #scpol #MAGA➡https:  .  pic. twitter.   —   Tom Mullikin (@TomMullikinSC) April 28, 2017,  Byars found this “ridiculous,” calling Mullikin a “  Democrat who has given to Democrats all over the country. ” “Tom Mullikin says he was a BIG Trump supporter, so why did he choose not to even cast a vote in the SC Presidential primary in 2016?” Byars asked, citing GOP voter data. He tried to contrast the two candidates’ roles in the 2016 campaign: I think it is offensive that a career lobbyist like Tom Mullikin who has aided liberal Democrats would criticize Chad Connelly now. Chad gave up 2 years traveling the country to recruit evangelical support for Donald Trump. Mullikin has made contributions to many political campaigns, including those of Democratic Senator Debbie Stabenow ( ) and former Sen. Kay Hagan ( ). In the 1980s, he worked with then Sen. Al Gore ( ) on his unsuccessful presidential run. He has also donated to many Republican campaigns and himself ran as a Republican candidate for state representative in the 1990s. Mullikin contributed to the Democratic Senatorial Campaign Committee and the DNC as recently as 2014. His record of GOP contributions might similarly alarm some populist voters, with recurring contributions to Sen. Lindsay ( ) a #NeverTrump stalwart, and Sen. John McCain ( ) who clashed with Trump on the campaign trail. Mullikin made his only contribution of the 2016 presidential campaign to early dropout Rick Santorum. Mullikin’s camp found these lines of attack unwarranted. “He’s never denied he made contributions to Democrats   …     he made a lot more to Republicans, including Mick Mulvany,” Cahaly told Breitbart News. “Just like the president, he was in business and he was trying to get things done in the state, and he’s not going to apologize for it. ” Cahaly also took issue with the characterization of his candidate as a lobbyist, especially a “democratic” one, noting Mullikin “hasn’t been registered to lobby in years and years. ” The Mullikin website characterizes his lobbying work on environmental issues as “His outspoken support for American manufacturing, farming and energy production placed him on the front lines of combating the radical left’s attempt to use environmental hysteria as an excuse to institute global socialism. ” As the campaigns continue to spar over these accusations, voters will go to the polls in South Carolina’s Fifth District Tuesday. If neither Connelly, Mullikin, nor any of the other three candidates in the GOP primary wins 50% of the vote, a runoff will be held May 16. Considered a safely Republican district, Democrats are rumored to continue their    efforts to derail the Trump administration’s momentum by vigorously contesting special elections.'"}, "time": 1742628439.5072381}