{"duration": 0.060904502868652344, "input_args": {"text": "'Rep. Louie Gohmert ( ) told Fox and Friends on Friday that Congress concluding business on Thursday and not being in session on the day after fired FBI Director James Comey told the Senate Intelligence Committee that he leaked information about his private conversations with President Donald Trump left the president to “dangle. ”[House Majority Leader Kevin McCarthy’s office on Tuesday sent out an email announcing the change.  “Members are advised that  —   pending timely completion of H. R. 10  —   votes are no longer expected in the House on Friday, June 9,” the email stated. “Last votes of the week are now expected at approximately 4:00 PM on Thursday, June 8. ” The Majority Leader’s office told Breitbart News that the decision was made because the Democrats withdrew all amendments from the Choice Act being considered by the House leading to business concluding a day early. But Gohmert said it sends the wrong message about Republicans support for Trump. “Tuesday, apparently, our leadership changed the week’s scheduling and said let’s go dark on Friday, which means the emphasis will not be on what we’re doing good in Washington,” Gohmert said. “We are basically leaving the president to dangle,” Gohmert said. “I’m very concerned we are not being supportive enough to get the message out and here President Trump is   …     as [Senator] Marco Rubio was pointing out   …     the only thing that didn’t leak was the truth  —   that [Trump] was not under investigation. ” Meanwhile, at his weekly press briefing on Thursday, Ryan said he didn’t have time to watch the Comey hearing but vaguely supported Trump by claiming he was “new” to the government and its modus operandi. “As far as the conversations and all that, I’m not going to speculate on any of this, I would just add that of course there needs to be a degree of independence between the DOJ, FBI and the White House and lines of communications established,” Ryan told reporters. “The president’s new at this, he’s new to government,” Ryan continued. “So he probably wasn’t steeped in the long running protocols that establish the relationships between DOJ, FBI and White Houses. “He’s new to this,” Ryan said. “We now know why [Trump] was frustrated when the FBI director told him three times there’s no investigation of him yet the speculation was allowed to continue,” Ryan said. “So obviously we know now why he was frustrated. ”'"}, "time": 1742562907.4531963}