{"duration": 0.1314830780029297, "input_args": {"text": "'You Could Be Unknowingly Killing the Hummingbirds! (Here’s How to Save Them) Oct 27, 2016 0 0 \\n( Real Farmacy ) Hummingbirds are beautiful, delightful little creatures to have around your garden. Not only are they great pollinators, but they also bring fun life into your yard. Many home gardeners will put feeders up to keep these summer personalities around. \\nIf you don’t take the necessary steps to provide healthy nectar and clean feeders, your favorite pollinators could catch deadly infections. \\nHummingbird feeders must be kept clean and free from mold and fungus, or your tiny friend could develop a serious and deadly fungus infection. This infection causes the tongue to swell, making it impossible for the bird to feed. Losing the ability to consume nectar, the cute little bird faces starvation. \\nA mother hummingbird can pass a fungal infection to her babies who, in turn, could also face the possibility of dying from starvation due to swelling tongues. \\nNot changing out the nectar enough could create fermentation within the nectar. Fermented nectar can cause liver damage, which usually will lead to death. The Basics of Hummingbird Care \\nWhen looking to purchase a feeder, find one that is easy to clean. \\nTo clean your feeder, flush it with hot tap water and use a bottle brush to scrub the sides of the glass jar. DO NOT use soap because it will leave residue behind. If you do use soap, use a bleach or vinegar and water solution to rinse and remove soap residue. \\nInspect the feeder carefully for black mold. If you see any mold growth, soak the feeder in a solution of 1/4 cup bleach to one gallon water for one hour. \\nTo make the nectar , mix one part ordinary white cane sugar to four parts water. Do not use store bought mixtures, or honey, or any other kind of sugar — just ordinary white cane sugar will work. Bring solution to a boil, stir to dissolve the sugar, then allow the mixture to come to room temperature before filling the feeder. \\nBoiling the water will help slow the fermentation process of the nectar, but as soon as a hummingbird beak dips and drinks, healthy microorganisms carried on the beak will be transferred into the nectar. \\nIf the nectar becomes cloudy, it has gone bad and needs to be replaced. A sugar solution can spoil in as little as two days. If your feeder is hanging in the sun or outside where the temperatures are high, the nectar may start to ferment in only one day. \\nTo avoid wasting nectar, only put out enough for the birds will consume in two or three days. If you mix up a large batch, you can keep it in the refrigerator for up to two weeks. \\nAriana Marisol is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She is currently finishing her last year at The Evergreen State College getting her undergraduate degree in Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742564223.23932}