{"duration": 0.1473245620727539, "input_args": {"text": "'On a recent morning over avocado toast and   New York City tap water, Grace Jeon expounded on the virtues of public drinking water. Considering that the company she runs makes its money selling bottled water, her enthusiasm might have seemed a little strange. And in fact, she follows a decidedly odd business model. Ms. Jeon held up one of her company’s bright blue opaque bottles, which are made mostly of paper, not plastic. “I would never advocate drinking this over tap,” Ms. Jeon said. But the reality is that more consumers are moving to bottled water as they cut down on drinking sugary beverages, she said. Her company has positioned its bottled water, called Just Water, as the next best thing to tap. Despite serious problems in places like Flint, Mich. and in the schools of Newark, N. J. and other cities, most tap water in the United States is safe to drink, according to environmental groups and the government. But many consumers prefer the convenience of bottled water, and are willing to pay for it. As Ms. Jeon sees it, she is making the best of a bad situation. The paper used for her bottles is sourced from trees that have been certified by the Forest Stewardship Council. The bottles, which are fully recyclable, are made of 53 percent paper the rest of the bottle is made of plastic and a small amount of aluminum. Last month, Just Water released a new bottle with the top portion made of   plastic derived from sugar cane. All told, she said, her product is less harmful to the environment and creates fewer carbon emissions than   plastic. In the process, she is also helping the struggling city of Glens Falls, N. Y. about 20 miles from Saratoga Springs. In 1944, Glens Falls was named “Hometown, U. S. A. ” by Look magazine, which featured photographs of the city’s bustling downtown. Like many once thriving industrial towns, though, Glens Falls has experienced a decline in population and manufacturing. A city that was once home to about 20, 000 people during the 1950s now has 14, 000 residents. Empty storefronts and houses dot the town. What the city does have is water  —   four reservoirs and over 5, 000 acres of watershed property. Just Water has an arrangement with the city to purchase water for at least six times the residential rate. Some of the money from the water purchase goes back to the community to address its aging water infrastructure, which is over 100 years old. Just Water does not obtain its water from that infrastructure rather, it uses a well on the city’s watershed property. It packages the water in a converted Catholic church that stood empty for years. The company employs 11 local residents. Tetra Pak, a food packaging and processing company, creates the Just Water packaging and ships the containers flat to Glens Falls, where they are shaped and filled. When Just Water first asked the mayor, Jack Diamond, about sourcing and bottling water in his city, he initially thought the offer was too good to be true. When he has been approached by companies in the past, in general, “it’s not so much what they’re going to do for us, but what can we do for them,” he said. “The roles were reversed with this company. ” Just Water might be a boon to Glens Falls, but if environmental groups like Ban the Bottle had their way, people would take reusable water bottles with them everywhere, and bottled water would be unnecessary in most situations. That fight, however, has remained a losing battle. In 2014, annual bottled water consumption in the United States reached a peak of 34 gallons a person, said a report from the Beverage Marketing Corporation. “It’s a completely ridiculous product, but it’s also a wildly popular product,” said Charles Fishman, a journalist and author of “The Big Thirst: The Secret Life and Turbulent Future of Water. ” “The reason is, and I think this is often overlooked, people aren’t buying water  —   they’re buying convenience. And with the branding, to some degree they’re also buying image. ” The reason for bottled water “has nothing to do with the availability of good, clean appealing water in the country. It has to do with how we live,” Mr. Fishman said. “It has to do with the disappearance of good water fountains  —   with the failure, frankly, of water fountain companies to innovate cool, interesting, appealing water fountains. ” Just Water went on sale last fall in Whole Foods stores across the country and Cibo Express airport markets. The company recently started selling bottles at Albertsons, Safeway, Kroger, Sprouts Farmers Markets and other stores. The bottles retail for 99 cents for 16. 9 fluid ounces. That compares with about $1. 50 for a comparable bottle of Fiji water. Ms. Jeon was previously Fiji’s senior vice president for business development. Fiji is positioned as a luxury product, referred to in company news releases as “a natural, artesian water bottled at the source in Viti Levu (Fiji islands)” and “known for its soft mouth feel and iconic square bottle loved by discerning consumers,   celebrities and   chefs. ” Does water from different areas taste different? Some consumers swear that it does. Others, like Mr. Fishman, are skeptical: “There is no distinction, no matter what the people at all these places will tell you. ” Ms. Jeon said she thought she had left the bottled water industry for good when Drew Fitzgerald, the founder of Just Water, approached her with his idea to make everyday packaged items more environmentally friendly, starting with bottled water. He has an eclectic résumé. He worked as the creative director for Universal Records, has worked with the Will and Jada Smith Family Foundation and is an adviser to Prime, an organization that helps foundations and wealthy families finance technologies that reduce greenhouse gas emissions. And as it turns out, Mr. Fitzgerald’s hometown is Glens Falls. It’s true that water from upstate New York may not be considered as glamorous as water from Fiji, but New York’s requires less transportation  —   another environmental selling point for Just Water. “There are bigger issues to bottled water than just what the package is made out of,” said Mae Wu, a staff lawyer for the Natural Resources Defense Council. These include the environmental costs of shipping water, the effects of removing water from communities and water bottle waste. Of course, water bottles can be recycled. “All bottled water containers are 100 percent recyclable and many bottled water companies are already using recycled plastic in their bottles,” said Chris Hogan, a spokesman for the International Bottled Water Association, in an email. Some are making 100 percent recycled bottles, he added. “As an industry, we are always looking for ways to strengthen existing programs and help to expand recycling efforts ever further,” he wrote. But although bottles and cartons may be made of recyclable packaging, this does not ensure that the product will be recycled. Recycling rates have risen recently, but in 2013, the most recent year for which data is available, just over 31 percent of plastic jars and water bottles were recycled, according to government data. Just Water isn’t the only company offering an alternative to traditional bottled water. Boxed Water packages its water in a   paper box, much like a milk carton. Fred Water delivers water in hard plastic flasks and encourages drinkers to reuse the bottles. Green Sheep offers consumers water in aluminum bottles, which is more readily recycled than plastic. Like Just Water, many of these companies say they are committed to improving the environment. “We recognized that although reusable bottles are the best choice from an environmental standpoint, the reality is that people keep buying bottled water,” Nicole Doucet, the   and chief executive of Green Sheep, said in an email. “There was already a perfect solution out there, but we needed a pragmatic one. ” Traditional beverage companies, such as Nestlé Waters North America, are offering alternatives, too. In 2007, Nestlé introduced its lightweight   bottle, which uses less plastic a few years later the company began incorporating recycled plastic into its bottles. Nestlé, which includes brands such as Arrowhead, Deer Park and Poland Springs, made up 23 percent of water bottle sales last year, according to Euromonitor International, a consumer research company. “Beverage trends have changed dramatically over the last 10 to 12 years,” Nelson A. Switzer, Nestlé Waters North America’s vice president and chief sustainability officer, wrote in an email. “Water  —   bottled and tap  —   has become the beverage of choice. ” Just Water and its competitors make up a much smaller percentage of the market. “I think that we will continue to see bottled water in more environmentally friendly packaging,” said Virginia Lee, senior beverages analyst at Euromonitor. “However, I see this for the next five years as still being very niche. ” She cites cost and consumers’ familiarity with traditional bottled water as factors. The alternatives may be able to succeed as the economy improves, she said: “As people have more money in their pocket it stands that they’d be more willing to pay a little extra for water or something else that claimed to have environmental or other benefits. ” But a better water bottle is still a water bottle, said Ms. Wu of the Natural Resources Defense Council. “I recognize that there is a role for bottled water,” especially in emergencies like the one occurring in Flint, she said, but most tap water in the United States is safe. Some consumers have switched to reusable water bottles, many of which have become status symbols, like the stainless steel insulated bottles made by S’well, and the glass bottles in colorful silicon sleeves sold by Bkr. Still, there are no signs that shoppers will be sipping less bottled water anytime soon. Sales have increased steadily over the last decade. The water bottle industry took in $19. 8 billion in retail sales last year in the United States, according to Euromonitor. Ms. Jeon claimed she would rather see the tide go in the opposite direction. “It’s not about getting more people to drink bottled water,” she said. But if you’re going to drink bottled water, she said, “consider a better option than the current choice. ”'"}, "time": 1742562634.1098988}