{"duration": 1.590789794921875, "input_args": {"text": "'The alleged driver of the van that killed one and injured ten people outside of a Finsbury mosque Sunday evening has been identified as    father of four Cardiff resident Darren Osborne. [Mr Osborne is said to have been positively identified as the man arrested last night by police by a former schoolmate who attended Broadoak Mathematics and Computing College with Osborne. The unidentified man said that he had known Osborne for over 35 years and was sure that the man arrested was the    father of four, the Daily Mail reports.  “I’ve known him for 35 years, I grew up with him. It’s 100% him. He lives in Wales, he has four kids and his partner,” the man said. Earlier today police raided a residence in Cardiff, now thought to be that of Mr Osborne. Neighbours of the    say they are “shocked” regarding the allegations.    neighbour Pauline Tibbs said, “The police have been back and forth here all day. It’s a terrible shock,” and added, “I’ve seen him walking in the street but never spoken to him. He seemed normal enough. He has lived here a couple of years and kept himself to himself. ” Osborne is said to have grown up in    Somerset but later moved to Wales. He is also said to have separated from his spouse around six months ago. The van used in the attack is allegedly said to have been rented from Pontyclun Van Hire for £   which is around 15 miles away from where Osborne lives. The company owners have expressed “shock and sadness” regarding the attack and called it “cowardly. ” Earlier Monday morning Osborne was arrested on terrorism and attempted murder charges. Witnesses say that after the attack he shouted, “I’m going to kill all Muslims  —   I did my bit. ” The UK domestic security service Mi5 have said that Osborne has never previously been on their radar, and has no known police record. Labour MP Jo Stevens, whose constituency Osborne resides in, commented on the case telling people with information to report it directly to police. She then added, “I am also appealing to everyone who uses social media, to please be aware that prejudicial tweets about the alleged attacker may constitute contempt of court, and could even lead to any prosecution or trial having to be abandoned. ”'"}, "time": 1742563653.7487645}