{"duration": 0.09543824195861816, "input_args": {"text": "'Can The American People Defeat The Oligarchy That Rules Them?\\nPaul Craig Roberts\\nI am surprised that Hillary and the presstitutes haven’t blamesd Putin for FBI director Comey’s reopening of the Hillary email case. But they have done the next best thing for Hillary. They have made Comey the issue, not Hillary.\\nAccording to US Senator Harry Reid and the presstitutes, we don’t need to worry about Hillary’s crimes. After all, she is only a political woman feathering her nest, like political men have been doing for ages. Why all this misogynist talk about Hillary? It is Comey’s alleged crime that is important. This woman-hating Republican violated the Hatch Act by telling Congress that the investigation he said was closed was reopened. A very strange interpretation of the Hatch Act. It is OK to tell that a candidate for president is cleared duing an election but not to say that a candidate is under investigation.\\nComey violated the Hatch Act when he, on orders from the corrupt Obama Attorney General, announced Hillary clean, and thereby used the prestige of federal clearance of Hillary’s violation of national security protocols to boost her standing in the election polls.\\nActually, Hillary’s standing in the polls is based on the pollsters over-weighting Hillary supporters in the polls. It is easy to produce a favorite if you overweight their supporters in the poll questions. If you look at the crowds attending the two candidate’s public appearances, it is clear that the American people prefer Donald Trump, who is opposed to war with Russia and China. The election settles no greater issue. \\nThis has the ruling American Oligarcy, for which Hillary is the total servant, concerned. What are they going to do about Trump? Will his fate be the same as John F. Kennedy, Robert Kennedy, Martin Luther King, George Wallace? Time will tell. Or will a hotal maid appear at the last minute in the way that the Oligarchy got rid of Dominic Strauss-Kahn? \\nAll of the American and Western feminists, progressives, and left-wing remnant fell for the obvious frame-up of Strauss-Kahn. After Strauss-Kahn was blocked from the Presidency of France and resigned as Director of the IMF, the New York authorities had to drop all charges against Strauss-Kahn. But Washington had succeeded in putting its French vassal in the presidency of France. \\nThis is how the American Oligarchy desroys those it suspects might not serve its interests. The corrupt self-sereving Oligarchy makes sure that it owns the government and the media, the think tanks and increasingly all of the major universities, and, of course, through the presstitutes, Amerians’ minds.\\nThe Oligarhs are now hard-pressed to rescue Hillary as US president, so let’s see if the Oligarchs can once again deceive the insouciant American people.\\nWhile we wait, let’s concern outselves with another important issue. The Clinton crime syndicate in the closing years of the 20th century allowed a small handful of mega-corporations to consolidate the US media in a few hands. This vast increase in the power of the Oligarchy was accomplished despite US anti-trust law and the American tradition of a dispersed and independent media. \\nBut really, what does federal law mean to the One Percent. Nothing whatsoever. They are immune to it. Hillary’s crimes might cost her the election, but she won’t go to jail.\\nNot content with 90% control of the US media, the Oligarchy wants more concentration and more control. Looks like they will be getting it, thanks to the totally corrupt US government.\\nThe Federal Trade Commission is supposed to enforce US anti-trust law. Instead, the corrupt federal agency routinely violates US anti-trust law by permitting monopoly concentrations of business interests. \\nBecause of the failure of the federal government to enforce federal law, we now have “banks too big to fail,” unregulated Internet monopoly, and the evisceration of a dispersed and independent media. \\nThere formerly was a field of economics known as anti-trust. Ph.D. candidates specialized in and wrote dissertations about public control of monopoly power. I assume that this field of\\neconomics, like the America of my youth, no longer exists. \\nhttp://www.veteransnewsnow.com/2016/10/22/just-what-the-hell-does-the-federal-trade-commission-antitrust-division-do-anymore/ \\nThe post Can The American People Defeat The Oligarchy That Rules Them? appeared first on PaulCraigRoberts.org .'"}, "time": 1742563314.9638617}