{"duration": 0.03729057312011719, "input_args": {"text": "'Camera Catches Hillary’s Sick Hidden Message To Christian Voters Posted on October 27, 2016 by Prissy Holly in Politics Share This \\nDemocrats are constantly attacking Christianity while makingÂ their disdain for anything holy abundantly clear. Evidence of their godless agenda was on full display during the Democratic National convention, when they removed all references to God. It should come as no surpriseÂ what Hillary was caught doing at a campaign event, which clearlyÂ solidifies the true evil nature of the Democratic Party. \\nLike it or not, our country was founded on Christian principles. “In God we trust” is not only printed on all of our currency, but references to God areÂ throughout the Constitution, as our Founding Fathers intertwined their faith with our founding documents. Liberals loathe this fact,Â and many have made it their life mission to erase God from everything in our country, as evidenced by their constant barrage on our faith. \\nAt a Democratic presidential rally in May, one of Hillary’s little evil minions took the stage to introduce Hillary to the crowd. But when the unnamed woman began using lines of ourÂ Pledge of Allegiance to weave withÂ her pro-Hillary rhetoric, she decided to omit two little words, as a blatant slap in the face to God. \\nâ\\x80\\x9cOnly Hillary can bring us together as one nationâ\\x80Ś Undâ\\x80Ś Indivisible, with liberty and justice for all,â\\x80\\x9d the woman said, while partially quoting the US Pledge of Allegiance. \\nThis demented woman intentionally removed “under God” from our nation’s pledge, but how Hillary reacted was even more disturbing, as she immediately begins to nod and smile inÂ agreement of this woman’s omission. Watch her choke on \"Under God\"&\"indivisible\" \\n— NEEDYđ\\x9f\\x92\\x97Latina4Trump (@tteegar) October 25, 2016 \\nHow sickening.Â Liberals will not be fully satisfied until they completely destroy our country with their vile agenda. If Hillary gets elected, we’ll soon have the most godless and corrupt person on the planet driving our country even further downÂ the path ofÂ darkness and destruction. \\nAt this point in our nation’s history, it’s imperative that we don’t just sit idly by and allow these things to go on. We have to get loud and aggressively fight back when we see darkness slipping in, whether that be at our children’s schools, in our government, orÂ in our presidential candidates.'"}, "time": 1742562643.1157002}