{"duration": 0.22518682479858398, "input_args": {"text": "'Phyllis Schlafly, whose   campaigns against Communism, abortion and the Equal Rights Amendment galvanized conservatives for almost two generations and helped reshape American politics, died on Monday. She was 92. Her death was confirmed by the Eagle Forum, the conservative organization she founded in 1975. In her time, Mrs. Schlafly was one of the most polarizing figures in American public life, a   housewife who displayed a moral ferocity reminiscent of the   prohibitionist Carry Nation. Richard Viguerie, who masterminded the use of direct mail to finance   causes, called her “the first lady of the conservative movement. ” On the left, Betty Friedan, the feminist leader and author, compared her to a religious heretic, telling her in a debate that she should burn at the stake for opposing the Equal Rights Amendment. Ms. Friedan called Mrs. Schlafly an “Aunt Tom. ” Mrs. Schlafly became a forceful conservative voice in the 1950s, when she joined the   crusade against international Communism. In the 1960s, with her popular   book “A Choice Not an Echo” (it sold more than three million copies) and a growing legion of followers, she gave critical support to the presidential ambitions of Senator Barry Goldwater, the   Arizonan who went on to lead the Republican Party to electoral disaster in 1964, but who planted the seeds of a conservative revival that would flower with the rise of Ronald Reagan. And in the 1970s, Mrs. Schlafly’s campaign against the Equal Rights Amendment played a large part in its undoing. The amendment would have expanded women’s rights by barring any   distinctions in federal and state laws, and it was within hailing distance of becoming the law of the land: Both houses of Congress had passed it by a vote of more than 90 percent, and 35 state legislatures  —   only three shy of the number required for adoption  —   had approved it. But the amendment lost steam in the late 1970s under pressure from Mrs. Schlafly’s volunteer brigades  —   mainly women, most of them churchgoing Christians (Mrs. Schlafly was Roman Catholic) and not a few of them lugging apple pies to cajole legislators. Despite an extension of the deadline, the amendment died, on June 30, 1982. Many saw her ability to mobilize that citizens’ army as her greatest accomplishment. Angered by the cultural transformations of the 1960s, beginning with the 1962 Supreme Court ruling prohibiting   prayer in public schools, her “little old ladies in tennis shoes,” as some called them, went from ringing doorbells for Goldwater to serving as foot soldiers for the “Reagan revolution. ” “Schlafly had discovered a genuine populist sentiment in a large female population that opposed the E. R. A. feminism and modern liberalism with the same intensity of emotion that feminists brought to their cause,” Donald T. Critchlow wrote in “Phyllis Schlafly and Grassroots Conservatism: A Woman’s Crusade” (2005). Without her and her followers, Mr. Critchlow said, the conservative intellectuals, research organizations and foundations that are often credited with reshaping the contours of American politics might have failed. The conservative theorist and organizer Paul Weyrich said that Mrs. Schlafly “dressed up the conservative movement for success at a time when absolutely no one thought we could win. ” Even liberals conceded her impact. “If political influence consists in transforming this huge and cantankerous country in one’s preferred direction,” the political scientist Alan Wolfe wrote in The New Republic in 2005, “Schlafly has to be regarded as one of the two or three most important Americans of the last half of the 20th century”  —   although he hastened to add that “every idea she ever had was scatterbrained, dangerous and hateful. ” For all her political heft, it was Phyllis Schlafly the person who often animated discussion. With her pearls, perfect posture and Daughters of the American Revolution pedigree, she basked in depictions of herself as the perfect wife and mother. She let it drop that she   all six of her babies and that she had taught all her children to read before they started school. Feminists said it was her husband’s wealth  —   he was a lawyer from a rich Illinois family  —   that had liberated her to politick. Her energy was formidable. She wrote or edited more than 20 books, published an influential monthly newsletter beginning in 1967, appeared daily on nearly 500 radio stations and delivered regular commentaries on CBS television in the 1970s and CNN in the ’80s. In 1972, she formed a volunteer organization called Stop ERA, which three years later became the Eagle Forum, to coordinate her campaigns. In 1975, when she was living in Alton, Ill. Mrs. Schlafly announced to her family at dinner that she was going to enter law school at Washington University in nearby St. Louis. Her husband, by her account, disapproved of the idea at first, and she abandoned it, only to resurrect it when he changed his mind. She received her law degree in 1978, ranked 27th in a class of 186, and passed the Illinois bar a few months later. Some opponents called Mrs. Schlafly a hypocrite for pursuing so energetic a career while championing traditional female roles. She replied by calling her political career “a hobby” and saying she would never offer an opinion on whether women should or should not work outside the home. Other detractors, like Karen DeCrow, a former president of the National Organization for Women, praised Mrs. Schlafly even as they castigated her politics. “She’s an extremely liberated woman,” Ms. DeCrow said in an interview with Carol Felsenthal for her book “The Sweetheart of the Silent Majority: The Biography of Phyllis Schlafly” (1981). “She sets out to do something and she does it. To me, that’s liberation. ” Still, Mrs. Schlafly’s pronouncements drove her antagonists to distraction, though they suspected that her biting language was calculated precisely to provoke their outrage. She said that “sexual harassment on the job is not a problem for virtuous women” and that “  classes are like   sales parties for abortions. ” She called the atom bomb “a marvelous gift that was given to our country by a wise God. ” In 1980, a protester threw an apple pie in her face at a Women’s National Republican Club reception in New York, painfully scratching an eye. But Mrs. Schlafly was never outwardly ruffled. When Ms. Friedan, during a debate at Indiana University in 1973, recommended that she burn at the stake, Mrs. Schlafly replied in an even voice that she was pleased Ms. Friedan had said that because, she said, the comment had made it plain to the audience just how intolerant “intemperate, agitating proponents of the E. R. A. ” were. She was born Phyllis McAlpin Stewart on Aug. 15, 1924, in St. Louis, the oldest of two daughters of the former Odile Dodge, a teacher with two college degrees, and John Bruce Stewart, a machinist and industrial equipment salesman who was 17 years his wife’s senior. Fired by Westinghouse at the onset of the Depression, Mr. Stewart was never quite able to put the family’s finances back together. In 1944, he won a patent for a rotary car engine, of the type the Japanese automaker Mazda later sold, but it went nowhere. Despite his hardships, Mr. Stewart remained a staunch Republican, fiercely opposed to the New Deal. Mrs. Stewart, who was ambitious for her daughters, supported the family with a series of jobs: department store saleswoman, elementary school teacher and librarian at the St. Louis Art Museum. In her spare time, she wrote a book on the history of St. Louis. Ms. Felsenthal suggested in her book that Mrs. Schlafly’s impatience with women who denigrated homemaking stemmed in part from her mother’s wish that she could have kept house and worked for good causes rather than report for work six days a week. Phyllis Stewart attended Maryville College of the Sacred Heart in St. Louis (now Maryville University) and transferred to Washington University. She had no time for friends, dates or sororities, she wrote instead, as a student, she worked nights at a munitions factory   guns. Even so, she managed to graduate Phi Beta Kappa in only three years, at 19. She won a scholarship to study political science at Radcliffe, and earned a master’s degree there in nine months. Her politics were middle of the road at first. In 1940, she supported the moderate Republican Wendell Willkie in his bid to deny President Franklin D. Roosevelt a third term, and in graduate school she wrote papers supporting an active United Nations. Her ambition was to work for the federal government in Washington. When no government jobs turned up, she found a spot at a conservative think tank, the American Enterprise Association, the forerunner of the American Enterprise Institute. Educating herself in conservative philosophy, she submitted articles against the New Deal to Redbook and other magazines, but they were rejected. In 1946, she returned to St. Louis to work on the successful congressional campaign of Claude I. Bakewell, a Republican. After that, she worked as a librarian and researcher at a bank and, at 24, met John Fred Schlafly Jr. a    lawyer and politically engaged conservative from an Alton family that had made its money in banking and industry. They were married on Oct. 20, 1949. At the ceremony, Mrs. Schlafly said, she did not promise to obey, only to cherish. But she delighted in portraying herself as a traditional wife, even as she kept to a hectic pace of travel, writing, speaking and campaigning after her oldest child turned 18 months. “I want to thank my husband, Fred, for letting me come here” was a favorite opening for speeches. (“I like to say that,” she said, “because I know it irritates women’s libbers more than anything else. ”) But the writer Gail Sheehy suggested that Mrs. Schlafly had used marriage to liberate herself from paying jobs. “Phyllis Schlafly’s formula for the better life, then, is based on marrying a rich professional, climbing the pedestal to lady of leisure and pulling up the rope ladder behind her,” Ms. Sheehy wrote in The New York Times in 1980. Mrs. Schlafly was introduced to electoral politics in 1952, after Republicans had asked her husband to run for Congress. When he turned them down, Mrs. Schlafly, who was 27, volunteered in his stead. She won the Republican primary but lost the general election. That experience, she said, helped her overcome her natural shyness, and she went on to make dozens of speeches in Illinois as an officer of the Daughters of the American Revolution and to start building a national network of conservative friends. She was the president of the Illinois Federation of Republican Women from 1956 to 1964. In 1958, she and her husband started the Cardinal Mindszenty Foundation  —   named for the Roman Catholic leader who was tortured and imprisoned by Hungarian Communists  —   to educate Catholics on the dangers of Communism. Beginning in 1962, she hosted a   radio show on national security called “America Wake Up. ” It was carried by 25 Illinois stations. The Schlaflys’ politics were concentrated on the external threat posed by Communism, not the crusade against domestic Communist infiltration led by Senator Joseph R. McCarthy of Wisconsin. They opposed summit meetings and limits on nuclear testing and favored a constitutional amendment to prevent the president from negotiating international treaties. Many members of the Mindszenty Foundation were also members of the ultraright John Birch Society, and its founder, Robert Welch, once called Mrs. Schlafly “one of our most loyal members. ” The Schlaflys denied they were members. In 1964, Mrs. Schlafly was an active supporter of Goldwater’s presidential campaign. In her     book promoting his candidacy, “A Choice Not an Echo,” she contended that Republican presidential nominations were rigged by “secret kingmakers. ” By some estimates, the book sold as many as 3. 5 million copies. Writing in The New Yorker in 2005, Elizabeth Kolbert said the book “mixed fact, sensational accusations, commonsensical truths, and elaborate conspiracy theories into a compelling but evidently bogus narrative. ” Mrs. Schlafly became closely identified with Goldwater’s landslide defeat in 1964, and in 1967 she lost a bitter campaign for the presidency of the National Federation of Republican Women. Another run for Congress, from another Illinois district, in 1970, also ended in defeat. During much of the 1960s and ’70s, Mrs. Schlafly wrote books about national defense issues, often working with Chester Ward, a retired Navy admiral. Their “Kissinger on the Couch” (1975) begins with a proposition: “Suppose that Henry Kissinger is, in the common parlance, ‘some kind of nut or something. ’” In more than 800 pages, they argued that he was. Mrs. Schlafly hardly noticed the Equal Rights Amendment when it was first debated in Congress. Her initial inclination was to support it, as “something between innocuous and mildly helpful,” she told Ms. Felsenthal. But when, in December 1971, a friend asked her to debate a feminist on the amendment, she read up on the issue and decided that the E. R. A. was dangerous and needed to be stopped. It had already passed the House. The next October, Mrs. Schlafly founded and appointed herself chairwoman of Stop ERA, the volunteer organization that became the Eagle Forum. The “stop” was an acronym for “stop taking our privileges,” effectively summarizing the position of the amendment’s opponents. They worried that earlier laws written to protect women  —   guaranteeing alimony and exempting women from combat, for instance  —   would be jettisoned. “I simply didn’t believe we needed a constitutional amendment to protect women’s rights,” Mrs. Schlafly told The Times in 2006. “I knew of only one law that was discriminatory toward women, a law in North Dakota stipulating that a wife had to have her husband’s permission to make wine. ” Proponents of the amendment have said that even though courts and legislatures have set aside statutes that discriminate based on sex, the amendment would still retain symbolic importance. Mrs. Schlafly’s followers only grew in number after the Supreme Court legalized abortion in 1973, an issue that social conservatives saw as a further erosion of the country’s moral values. After her husband died in 1993, Mrs. Schlafly moved from their limestone house on the bluffs of the Mississippi River in Alton to a brick   house in the suburbs of St. Louis, where the Eagle Forum has its headquarters. Mrs. Schlafly is survived by six children, 16 grandchildren and three  . Her son John gained attention in 1992 when a gay activist revealed that he was homosexual. Mrs. Schlafly said she considered the disclosure a deliberate attempt to embarrass her. The revelation did not alter her disapproval of gay marriage. In 2010, she said of gay couples: “Nobody’s stopping them from shacking up. The problem is that they are trying to make us respect them, and that’s an interference with what we believe. ” (John Schlafly defended his mother and refused to repudiate Republican politicians, like Pat Robertson, who had condemned homosexuality. “Family values people” are “not out to bash gays,” he said.) Mrs. Schlafly maintained an energetic pace into advanced age. In 2011, she spoke out for “shotgun marriages” as the solution to unwanted pregnancies. Even as supporters of the Equal Rights Amendment tried to revive it, Mrs. Schlafly strove to make sure it stayed dead. In March of this year, she endorsed Donald J. Trump for president, saying he had “the courage and the energy” to do “what the   want him to do. ” In her 2006 interview with The Times, she attributed the improvement in women’s lives in the 20th century not to feminism but to   devices like the indoor clothes dryer and paper diapers. “Feminism has changed the way women think, and it has changed the way men think,” she said, “but the trouble is, it hasn’t changed the attitudes of babies at all. ”'"}, "time": 1742562349.2349174}