{"duration": 0.11224961280822754, "input_args": {"text": "'George Ciccariello-Maher | November 9, 2016 \\nThe final election results are not in, but one thing is crystal clear: Hillary Clinton is a failure. And so is the neoliberal establishment. \\nEven if she narrowly manages to defeat Donald Trump, she has still lost. Her failure is not individual, however, but a failure of Clintonism, the Democratic Party, and decades of failed economic policies. According to some exit polls, Clinton is losing half of union households and getting routed in a rust belt abandoned by Clintonism: in Ohio, Michigan, and Wisconsin, a state that she took so much for granted that she didn’t make a single campaign stop there . \\nAll this against a racist misogynist with no ground game, hemorrhaging the support of his own party leadership, with far fewer resources and a thousand character flaws and weaknesses to be exploited. All polls show that even many Trump voters doubted his qualifications and character, but they voted for him anyway. \\nConfronted with this reality, Clintonite liberals have been willfully ignorant, managing to both write poor whites off as racist deplorables while simultaneously underestimating their potential to swing to the Right. Neglecting poor whites, Clintonism holds Black and Latino Americans hostage, offering no solution to police murder and promising more deportations to boot. \\nThe blame game is already in full swing: Democratic apparatchiks are already preparing to blame FBI director James Comey, third party candidates, and it wouldn’t be surprising to hear Vladimir Putin’s name come up—the Red Scare never gets old. But the ire of a wounded Clintonism will no doubt be directed above all at the Left. \\nBut the liberal establishment and its neoliberal economic policies have failed, and it’s time for liberals to own that. The pundits, the talking heads, the press, and the pollsters are admitting that they had no idea what they were talking about and flailing for explanations. Maybe if liberal and conservative elites alike don’t have answers, it’s time to build a fighting left that can offer real solutions. \\nThe left needs to directly confront the racism that Trump harnessed, but it also needs to better understand what caused the Trump phenomenon to begin with. For all of his flaws, Bernie Sanders did the second, and you don’t have to like Sanders to admit that there’s no way he would have fucked this up so bad. \\nBut Sanders’ failure to capture the Democratic Party was no accident. If Trump wins, the same Democratic Party has been calling him a fascist and would-be dictator will demand that we recognize his legitimacy. They will suddenly discover that, instead of fighting back, they can reach across the aisle and work with this eccentric leader. \\nBut the reality is this: if you really believe that Trump is a fascist, you’d better be prepared to do more than just vote. \\n\\nGeorge Ciccariello-Maher is an organizer, radical political theorist, and professor at Drexel University. Follow him on Twitter @ciccmaher . '"}, "time": 1742564379.3407278}