{"duration": 0.029299497604370117, "input_args": {"text": "'Syria A man receives treatment at a hospital following a Daesh chemical attack in the Sheikh Maqsood neighborhood of Syria’s Aleppo, April 7, 2016. (Photo by RT) \\nSyria has dismissed as baseless recent allegations brought against the Damascus government by Western countries in connection with chemical attacks in the war-torn Arab country. \\n“The Syrian Arab Republic has repeatedly denied all allegations circulated by some Western circles and their agents about the use of chemical poisonous materials by Syrian sides, like chlorine gas,” during military operations against terrorists, Syria’s Foreign Ministry said in a statement carried by the official SANA news agency on Wednesday. \\nThe statement came four days after an international inquiry blamed Syrian government forces for a toxic gas attack in Qminas in northwestern Idlib province on March 16, 2015. \\nThe accusation was made in the fourth report from the 13-month-long probe by the United Nations and the Organization for the Prohibition of Chemical Weapons. \\nHowever, the Syrian Foreign Ministry statement said that there was no \"tangible evidence\" for the inquiry\\'s findings. \\n“Syria has repeatedly warned against repercussions of politicizing this issue regarding the credibility of the work of international relevant sides,” the ministry added. \\nIt also stressed that the Syrian government remains committed to all its obligations under the Chemical Weapons Convention, a multilateral treaty that bans chemical weapons and requires their destruction. \\nDaesh has frequently used chemical weapons in both in Syria and Iraq, where the Takfiri terrorist group is mainly active. \\nA report by the Syrian-American Medical Society published back in March said that Daesh had carried out more than 160 attacks involving “poisonous or asphyxiating agents, such as sarin, chlorine, and mustard gas” since the beginning of the conflict in Syria. The report added that over 1,490 people had been killed in the chemical attacks. \\nSince March 2011, Syria has been hit by militancy it blames on some Western states and their regional allies. Loading ...'"}, "time": 1742564474.618863}