{"duration": 0.06824183464050293, "input_args": {"text": "\"Posted on October 27, 2016 by The Daily Sheeple \\nThere is no doubt about it. Hillary Clinton is after your guns. \\nBrian Fallon, national press secretary for the Clinton campaign, wrote in an email dated October 4, 2015 that Clinton intends to stop the “gun show loophole”, meaning all private gun sales, by executive order : \\nCircling back around on guns as a follow up to the Friday morning discussion: the Today show has indicated they definitely plan to ask bout guns, and so to have the discussion be more of a news event than her previous times discussing guns, we are going to background reporters tonight on a few of the specific proposals she would support as President – universal background checks of course, but also closing the gun show loophole by executive order and imposing manufacturer liability . \\nImposing manufacturer liability means that after Sandy Hook, Bushmaster and Remington Arms would have been prosecuted for having a hand in the murder of children and school staff members for firearms that were legally sold. When a lawsuit brought against these manufacturers was found to be frivolous, Clinton made a big fuss about it on Twitter: It's incomprehensible that our laws would protect gun makers over Sandy Hook families. We need to fix this. https://t.co/96uBe92wPi \\n— Hillary Clinton (@HillaryClinton) October 15, 2016 \\nIn September 1993 during a Senate Finance Committee hearing, Hillary Clinton was asked by Senator Bill Bradley if she supported a 25% sales tax on handguns and automatic weapons. She was very clear in her support of taxing guns: \\n“I’m all for that. I just don’t know what else we’re going to do to try to figure out how to get some handle on this violence,” said Clinton. “I’m speaking personally, but I feel very strongly about that.” \\nIn another email exchange dated January 14, 2016, Clinton wrote about using racial division to further her gun control agenda by selectively ignoring occurrences of gun violence that were not racially motivated. For this reason, according to the email, the Clinton campaign did not include the story of Jordan Davis in an essay on gun violence: \\nThis is great. My edits are attached. The only flag here is that Jordan Davis was killed by a white man, so arguably – this crime was racially motivated, which takes this outside the discussion of gun violence. Was there another mother in the Chicago meeting where the shooting was NOT racially motivated? If yes, we should use that story instead of Jordan Davis. \\nIn another email from March 17, we see an exchange about how to attack Donald Trump and a press call with Arizona locals about gun control. When asked about an anti-gun op-ed article by the Clinton Campaign, Chairman John Podesta wrote that he fears blowback from Clinton’s supporters: \\nInterestingly, I am worried about blowback from our supporters. Contributed by The Daily Sheeple of www.TheDailySheeple.com . Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742561740.9520357}