{"duration": 0.05203390121459961, "input_args": {"text": "'California Democrats made a surprise move late Friday to foil President Trump’s promise to repeal ObamaCare —  by introducing a     healthcare system in California. [The Mercury News reported that two California lawmakers Friday introduced legislation to replace private insurance with a   health care system covering all 38 million Californians —  including its undocumented residents.  “We’ve reached this pivotal moment,” Sen. Ricardo Lara (  Gardens) told the Mercury News in an interview Friday, “and I thought to myself: `Look, now more than ever is the time to talk about universal health care. ’” The article went on to report that the proposal dubbed the ‘Healthy California Act’ introduced by Lara and former Assembly Speaker, now State Senator Toni Atkins, (  Diego)  —   was submitted just before the deadline for new legislation —  and for such a sweeping proposal, it remarkably short on specifics. Atkins said in a prepared statement obtained by Mercury News, “In light of threats to the Affordable Care Act, it’s important that we are looking at all options to continue to expand and maintain access to health care. The Healthy California Act is an essential part of that conversation. ” After a week that has brought California’s crumbling infrastructure into focus —  as back to back storms threatened the nation’s tallest dam in Oroville, California, and forced Gov. Brown to request Federal Emergency Funds from President Trump —   Brown and Democrat legislators have come under scathing criticism for squandering money on benefits for illegal aliens and public sector unions at the expense of   infrastructure. Only California Democrats would launch a new social program with no specific details or any identifiable funding source in a state that is perpetually broke, and where ObamaCare is unpopular with over 46% of voters —  including a lot of Democrats. Calls for comment by Breitbart News were not returned. Tim Donnelly is a former California State Assemblyman. Author, Patriot Not Politician: Win or Go Homeless, FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742563526.9387624}