{"duration": 0.360867977142334, "input_args": {"text": "'Hawks vs. doves: Who will dominate in the Kremlin before the 2018 elections? Carnegie Moscow Center’s Andrei Kolesnikov discusses the links between the 2016 parliamentary and 2018 presidential elections, focusing on Russia’s political future and the rivalry between the “hawks” and “doves” within the Kremlin RD Interview: Carnegie Moscow Center’s Andrei Kolesnikov discusses the links between the 2016 parliamentary and 2018 presidential elections, focusing on Russia’s political future and the ongoing rivalry between the “hawks” and “doves” within the Kremlin’s inner circle. \\n\\nFrom right to left: Speaker of the Russian State Duma Vyacheslav Volodin, Defense Minister Sergei Shoigu, Director of the Federal Security Service Alexander Bortnikov and Director of the Foreign Intelligence Service Sergei Naryshkin. Photo: RIA Novosti \\nRussia’s recent parliamentary elections were, by and large, a dress rehearsal for the more important presidential elections coming up in 2018. Between now and then, members of the political establishment will be able to try on new roles, experiment with new campaign slogans, and determine who will play a starring role within the Kremlin’s inner circle. The central consideration is how to consolidate power in a way that balances the interests of the government and the population.\\nTo get an inside look at Russia’s current political landscape, Russia Direct sat down with Andrei Kolesnikov of the Carnegie Moscow Center. According to him, the 2016 parliamentary elections provide a preview of what to expect in 2018 and beyond.\\nRussia Direct: To what extent were the 2016 parliamentary elections fair and legitimate, in your view? Andrei Kolesnikov: In fact, they were juridically legitimate because they were conducted in accordance with Russian law. However, the degree of the political, not juridical legitimacy is a debatable question because of the low turnout: It means that the representation of Russian citizens in the parliament became even less than previously. About one-third of the Russian population voted at the elections. ;\\nEven though the United Russia ruling party garnered four million fewer votes than during the 2011 elections, it received more seats in the parliament. In addition, liberal politicians are not included in the parliament at all. Thus, politically, the legitimacy of the elections is a matter of question.\\nRegarding honesty, these elections were fair in the polling stations with observers, to a large extent. They were honest in the regions, in which the Central Election Commission controlled the electoral process in cooperation with observers. ;\\nTo a lesser extent, these elections were fair and transparent in the distant Russian regions or — in the words of prominent political expert Dmitry Oreshkin — “zones of peculiar electoral culture,” which saw an abnormally high electoral turnout. I mean, for instance, the republic of Tuva in southern Siberia, the North Caucasus, Kemerovo region etc. ;\\nThese regions were controlled by the Central Election Commission to a much lesser extent — no wonder that people were compelled to vote in accordance with the orders of local authorities. The violations in these regions were likely to be common. ;\\nAndrei Kolesnikov, ;Senior associate and Chair of the Russian Domestic Politics and Political Institutions Program at the Carnegie Moscow Center. Press Photo \\nRD: Does Russia’s Central Election Commission have any tools to influence voting in the distant regions? A.K.: There are some instruments, but local authorities limit and restrict them. I don’t think the administration of the Russian president hampered the work of the Central Election Commission Head, Ella Pamfilova. She tried to balance the interests of Russian President Vladimir Putin and the interests of the country’s civil society. ;\\nThis is the middle-of-the-road position and it is very difficult. She just tried to take into account all positions and signals that were coming from the regions during the electoral campaign and could not ignore them. There were so many of these signals that she objectively and physically could not control the &shy;elections throughout the country, especially, in the distant regions.  ;  ;  ;  ;\\nRD: What kinds of violations took place during the 2016 elections, if any? A.K.: Violations took place, even though they were not large-scale, like previously during the 2011 elections. These violations included the use of administrative resources for influence, rigged and fabricated voting, stuffing the ballot box, and dirty political techniques against the liberal and communist parties during the political campaign and before Election Day. ;\\nThere was also orchestrated voting, when cadets, students and governmental employees were ordered to vote. This also should be taken into account. All these violations took place not only in distant regions, but also in those under the steady control of the Central Election Commission.\\nRD: Why did the United Russia party win despite its declining popularity throughout Russia? ; A.K.: The fact the United Russia won the majority in the State Duma and the party’s popularity are basically different things. Its popularity has been decreasing indeed. It is one reality. But it doesn’t prevent the party from winning most of the seats. That is the other reality. ;\\nRussian citizens don’t see the party as a body that deals with the problems of the population . The credibility and approval rankings of almost all governmental bodies, except law enforcement agencies and the president himself, are dropping. And United Russia is not the exception, because people perceive it not as a party, but as a kind of a governmental body. Its rating will keep going down, but slowly, step by step.  ;  ;  ; ;\\nUsually, if you vote for United Russia, it means a mechanical, symbolic process, a sort of political law-abiding ritual. If you are law-abiding and go to the polling station, you are likely to vote for United Russia, because it is necessary. This is the very logic and motivation that drive average voters to elect United Russia.  ;\\nEven though some people preferred not to vote for the ruling party, they voted for the current authorities, because there were no real alternatives: They voted either for one of the three systemic parliamentary parties or the spoiler parties, which aimed at distracting the attention of voters and preventing the opposition from gaining parliamentary seats.  ;\\nRD: Why did the Russian opposition fail and what is its key problem? A.K.: The reason why they failed can be traced back to the personal ambitions of the opposition leaders. They couldn’t team up and compete with each other. In addition, they have different values, in fact. I mean right-leaning liberals and left-leaning liberals don’t always agree. This does matter, after all. Moreover, these leaders don’t have enough political heft. Most of them cannot be considered powerful and influential political figures.  ;\\nAnother problem is that the authoritarian regime in Russia will prevent the emergence of new powerful liberal forces in Russia. If such a party emerges and poses a serious challenge to the authorities like opposition leader Alexei Navalny did, it will be either destroyed or discredited and marginalized. So, in such a situation, it is very difficult to come up with a pragmatic solution. However, this year’s parliamentary elections proved that the only political democratic force  ;noticeable on a scale of a whole country is the Yabloko party and its leader Grigory Yavlinsky, no matter how you view them. ;\\nIndeed, it is losing popularity year after year, but this party remains firmly within the country’s political landscape and if the opposition is able to persuade voters that Yabloko brings together different representatives of liberal and democratic forces as well as well-educated intelligentsia, they might succeed in the future. But in reality it’s hardly probable. ;\\nRD: You said that the Kremlin would prevent the emergence of a new powerful liberal political force in Russia, because the existence of such a force contradicts the nature of the authoritarian regime. Yet why are the Russian authorities afraid of everything that is associated with liberals, if those within the Kremlin are pretty confident, if their approval rankings are high among the majority of Russians, if people don’t trust liberals and the idea of liberalism is totally discredited in the country? A.K.: Well, first, it is a matter of the logic of development of any authoritative regime. It adds up to total political control. Second, in fact, the authorities are not so confident that they are so popular among the people, as implied by the words of Russian President Vladimir Putin, who came to the United Russia headquarters after the elections and said that, despite economic challenges and the difficult situation, people voted for United Russia. If you read between the lines, you can detect the feeling of the lack of confidence. ;\\nIt means that the social contract — economic well-being in exchange for political freedoms (“we restrict your political freedoms, but feed you instead”) — doesn’t work anymore and might be not so relevant. That’s why the authorities find it necessary to feed people with imperial pride, wars, Crimea and increase political control and establish a political monopoly, which also means creating fake liberal parties such as the Party of Growth. After all, it is a good example of the spoiler artificial party created within the Kremlin’s test tube. And this control is likely to persist as long as this regime exists.  ;\\nRD: What will the 2016 parliamentary elections change in Russian politics? A.K.: Basically, there won’t be big changes. Tactically, these elections aimed at preparing the groundwork for the 2018 presidential elections and testing Russia’s current political system . And in this regard, this task was fulfilled. By 2018 Putin is going to look for new faces and figures to renew his team, but this is going to be a different political process, even though it is partly related to the parliamentary elections. ;\\nRD: You said the 2016 parliamentary elections were a proving ground for the 2018 presidential elections and tested Russia’s current political system. Could you be more specific? ; A.K.: These elections confirmed the legitimacy of the current Russian authorities. Once again, the Kremlin sees that it does have the mandate to rule the country. Putin himself does have this mandate, because the ruling party is associated with his name, and the country’s political unity is based on the Crimea narrative and the parliament itself. ;\\nThe system passed the test successfully. So, it can work for a certain period of time as long as everybody is satisfied with this model. Thus, the system is ready to live for another 18 months until the 2018 presidential elections, with the parliament organically embedded in this system and ready to fulfill blindly all orders from the president. ;\\nThe other question is how will these elections be conducted in terms of obvious predictability and the absolute absence of interest toward them given the fact that nobody can compete with Putin. In fact, he is the only candidate who will win. So, there is the lack of motivation for voters to come to the polling stations in 2018.  ;  ;\\nRD: Do you mean that the turnout at the presidential election will be low? ; A.K.: The turnout is going to be the key question. In fact, the 2018 election is a referendum that will test the credibility and approval of one person [Putin]. In this situation, the authorities have to create an artificial rivalry to Putin, but it is hardly likely to work. The real rival won’t be allowed to compete with Putin openly, if we are talking about Navalny. Thus, if Putin is once again elected president, there is no motivation to vote. ;\\nOn the other hand, as indicated by this year’s parliamentary election, those who came to the polling stations observed a sort of political ritual. It is a matter of carrying out a law-abiding commitment. And this might drive people to vote in many Russian regions and have an impact on the electoral turnout. However, I expect it to be lower than during the parliamentary elections, especially in Moscow and St. Petersburg. Importantly, the turnout will be low not because people do not trust Putin — it will be low because of the absolute predictability of the elections, because of the absence of competition.  ;  ;  ;  ;  ;  ; ;\\nRD: To what extent were this year’s parliamentary elections different from the ones in 2011 — and why didn’t they lead to protests ? ; A.K.: Well, the situations are totally different. In 2011, people were waiting for changes and the continuation of modernization, with urbanites frustrated by the rigged voting and obvious violations during the parliamentary elections. They were also disappointed with the presidential swap, when then President Dmitry Medvedev decided not to stand for the 2012 presidency and let Putin come to power once again, depriving them of the opportunity of a choice. Eventually, they took to the streets. ;\\nYet their protests failed to bring changes among the authorities. Moreover, these protests brought about a series of arrests, which had a chilling effect on the protesters. Afterwards, the authorities took very repressive legal measures — including “the Dima Yakovlev law” that bans foreign families from adopting Russian orphans, the laws that restrict the right to organize rallies, laws on foreign agents and undesirable organizations, and other restrictive measures. ;\\nThus, by the beginning of this year’s elections, people had been very discouraged. They didn’t believe that they could change something. They were not ready to take to the streets. They were totally apathetic and disappointed politically. On top of that, there was the incorporation of Crimea. This narrative played its role in bringing people together around the authorities.\\nAlso read Russia Direct\\'s report: \" Decoding Social Transformations in Russia \" RD: Remarkably, those who took to the streets in 2011 supported Crimea’s incorporation. ; A.K.: Statistically, it is difficult to make any conclusions, yet the correlation does exist. Indeed, Crimea helped to mobilize people, even part of the liberal-minded citizens. It became the key narrative that mobilized the nation. Those who didn’t support the incorporation of Crimea are seen as outcasts. They are considered to be outsiders. ;\\nRD: How long will the Crimea effect be able to unite people around the authorities? ; A.K.: It is difficult to say for sure. Probably, the abrupt worsening of living standards and drop in income might influence the behavior of the population. Yet this is just a hypothesis, because people are still very satisfied with Crimea’s return to Russia: They see themselves as being part of a great power. ;\\nAccording to the polls of the Levada Center, people are still supporting the Kremlin’s foreign policy, they don’t want the sanctions to be canceled, and they believe they are above these sanctions. They think that Russia should keep the counter-sanctions policy instead of trying to persuade the West to lift these sanctions. This mobilization — being in the state of quasi-war — helps them to deal with the economic crisis and adjust to it. Honestly, there are no signs of political indignation, which means that people won’t orchestrate large-scale political protests.  ;  ;\\nRD: Shortly after the parliamentary elections, Russian media reported about the Kremlin’s plans to create the Ministry of State Security (or MGB in the Russian abbreviation), which is expected to bring together all Russian law security agencies. So, it seems to be a reanimated version of the old KGB. What does it mean for Russia’s political future? A.K.: Russian law enforcement officers play today a significant role [in the country’s decision-making process]. So, if these plans come true, it means that the authorities are trying to hedge political risks: It is a matter of the system defending itself in advance. One of the goals [of the MGB] is to provide security for the President and this problem will be more relevant by the end of the State Duma’s tenure, by 2021, because it will be the time when the future of Putin will be determined. ;\\nAfter 2021, there will be the questions from people and political elites if Putin will remain at the helm after 2024 or not, if he will nominate his successor or not, if he will be a lame duck or not. All these questions need to be clarified. And to feel more confident and secure, he needs absolute control. And the creation of such a monstrosity like the MGB is quite logical in such a situation. But this leak about MGB was no more than proving public and elite’s opinions. Presumably, right now this body will not be created.  ;  ;  ;  ;  ;\\nRD: There is some speculation that Putin might be concerned with a plot prepared by some members of Russia’s political elite. Is it really the case? A.K.: In fact, today there are not any signs of a conspiracy against Putin. The stakeholders within the Russian political elites are not interested in it, given a great deal of solidarity and unity around the Crimea narrative. Even though Putin is autocratic in his nature, nevertheless he is very popular among the elites. He builds such a political machine that guarantees him security and prevents any possibility of a coup d’état.  ;  ;\\nRD: Yet recently Putin reshuffled his political deck and asked his chief of staff, Sergei Ivanov , a former KGB officer, to resign. Anton Vaino , who was seen by some experts as a political unknown and a neutral technocratic political figure, replaced Ivanov. Does this resignation mean that Putin hedges the risks and just wants to get rid of those who might compete with him? ; A.K.: Actually, this is the trend, which means the 2018 new team of the president will consist of docile, absolutely loyal bureaucrats, who will be distant from the leader and won’t have any claims for power. This is in contrast to Putin’s cronies — governmental oligarchs and his close friends. ;\\nThis team will also comprise the bureaucrats and average men from law enforcement agencies, including security guards and representatives of the special services. This is how Putin sees effective governance; this is how he is going to reform the governance system. This is part of his strategy to save his personal security during his next presidential term. These people will have to provide Putin with security when he either retires or hands over power to his successor.\\n\\n\"Putin is an observer. He is like a weighing-machine that takes into account all views and tries to balance them.\" ; Photo: RIA Novosti  ;  ;  ;  ;  ;  ; ;\\nRD: There is also speculation that Putin is trying to fuel an artificial rivalry between different law enforcement agencies to strengthen his positions in the Kremlin. Do you agree? A.K.: Partly, it is the case. The logic of the MGB is to control this rivalry, watch over it closely and make it more transparent within one big entity. After all, Putin is an observer. He is like a weighing-machine that takes into account all views and tries to balance them. He gives them room to compete with each other up to a point and makes certain conclusions. It is a matter of effective political management. ;\\nLook at Alexander Bastrykin, the chairman of the Russian Investigative Committee. He has been very influential until recently, but he started expressing political claims and got in trouble [In July 2016 the Federal Security Service (FSB) conducted a series of inspections in the Investigative Committee’s offices and arrested high-profile officials suspected of corruption and embezzlement — Editor’s note]. ;\\nToday, Putin doesn’t need independent and very corrupt figures. He is ready to put up with the riches of his governmental oligarchs, but as long as they can hide it and fulfill their commitments within their governmental corporations. ;\\nSumming up, Putin is creating the environment that can provide him with security and insurance and control the wars with the Kremlin’s inner circle . Russia’s political elites have already received a lot of signals from him: If somebody behaves in a wrong way, he will be either dismissed or accused of corruption.\\nRD: How do you see the role of Medvedev, given that he has acquired the reputation of a very weak and docile politician? To what extent does he fit into the system? ; A.K.: His weakness is his power. His purposefully technocratic nature is his competitive capability. He is convenient, docile. He is between the loyal systemic liberals and law enforcement officials. In addition, his informal agreement with Putin is still intact and relevant. Politically, it is not in Putin’s interest to replace Medvedev with a more powerful and independent politician. ;\\nIn this case Putin should choose between liberals and “hawks” — between [former Finance Minister] Alexei Kudrin and Igor Sechin [the head of Russia’s largest oil company Rosneft]. Yet Putin cannot do it right now. He has to choose a middle-of-the-road, technocratic and docile figure like Medvedev, who will become a very convenient way to shift responsibility for the economic crisis after 2018. ;\\nIn this regard, the ideal candidate to replace Medvedev is Anton Vaino, Putin’s current chief of staff, or his deputy Sergei Kiriyenko, who in the eyes of Russians was responsible for the 1998 economic default. However, Medvedev is a much more experienced politician.\\nAlso read: \" Inside the anti-corruption campaign against Russia\\'s liberals \" RD: You mentioned the “hawks” and liberals within the Kremlin’s inner circle. Who is more influential today? A.K.: You can look at this hierarchy both simplistically and from a more sophisticated point of view. If we tend to simplify, there are the “hawks” or conservatives and “doves” or liberals: While the former are responsible for politics and foreign policy, the latter deal with the economy, business, the budget and fiscal policy. ;\\nOn the other hand, all these players, especially, law enforcement officials [“hawks”] are involved in clan wars to a larger extent than the liberals, who, basically, have nothing to compete for (if we don’t take into account the debates between the Economy Ministry, Finance Ministry and the Central Banks about the nuances of Russia’s economic policy). ;\\nThe closer we look at the political groups within the Kremlin, the more obvious it becomes that all these players are included in Putin’s team: In fact, they have less differences than commonalities. After all, all of them support the Crimean consensus. They support Putin’s domestic and foreign policy, even though some of them [liberals] don’t approve it. They are just adjusting to the current political situation without openly expressing their disagreement.\\nRD: Sooner or later Putin will have to step down. To what extent will the transition of power be difficult in Russia? A.K.: This transition will be very difficult at any rate. After all, there hasn’t been a rotation of power for years. The nuance is Putin can accelerate the transition to democracy only if it brings benefits to him to save his personal security. If technocrats and liberals are able to persuade him that his security depends on democracy, he might chose this path, yet, again, not because he likes democracy. Today he is not ready for liberalization.\\nThe article was initially published ;in Russia Direct Report \" Russia\\'s political drama heading into 2018 .\" '"}, "time": 1742562085.930667}