{"duration": 0.03519082069396973, "input_args": {"text": "\"Politics Vintage cars are parked in the forecourt of Buckingham Palace in London, part of a display of 90 historic British-built motor vehicles to commemorate Queen Elizabeth II's 90th birthday. (Photo by AFP) \\nThousands of Britons have signed a petition to express their outrage over Queen Elizabeth’s use of £369 million in taxpayers' money to repair the Buckingham Palace. \\nMore than 94,000 people had signed the petition as of Sunday, two days after the government of Prime Minister Theresa May allowed the royal family to repair the palace with public funds. \\nThe UK Parliament should discuss the petition when it hits the 100,000 mark. \\nOn Friday, the Chancellor of the Exchequer Philip Hammond granted the 90-year-old Queen a 66-percent rise in funding required for the palace’s refurbishment over the next 10 years. \\nThe money would be used to replace cables, pipes and boilers installed 60 years ago to prevent a “catastrophic” event that might destroy the palace, according to Master of the Queen’s Household Tony Johnstone-Burt. \\nPetitioners argued that the royals should foot the massive bill themselves given the vast extent of their wealth. \\n“The Crown and its estates should be made to fund its own renovations,” wrote Mark Johnson, who posted the petition. \\nProtesters said the money could be used to mend the faltering National Health Service (NHS) or help families get more affordable homes amid a housing crisis. Britain's Queen Elizabeth II rides a carriage with Colombia's President Juan Manuel Santos after the ceremonial welcome at Horse Guards Parade in central London, November 1, 2016. (Photo by AFP) \\n“It is wholly unreasonable to cut the benefits of the sick and disabled, take away housing benefits from the poor, and then pay for this,” said one signatory of the petition. \\nThe anti-monarchy campaign group Republic also took issue with the announcement, denouncing it as a “disgrace.” \\n“What's worse is this appalling increase is only a small part of the annual cost of the Royal family, which we put at £334m,” said Graham Smith, a member of the group. \\nOver the past years, the UK government has been generous towards the royal family despite cutting billions in public money. \\nUnder former treasury minister George Osborne, the Queen’s sovereign grant for 2016 was increased by 7 percent, bringing the total to £42.9 million a year. Now the annual grant would be inflated by two-thirds, rising to £76 million in 2017. \\nThe grant is financed by the profit coming from the royal family’s 350,000 acres of land across the UK. Loading ... \""}, "time": 1742563787.3588705}