{"duration": 0.0948796272277832, "input_args": {"text": "'In recent years, the   has become, simultaneously, one of most beloved and most vilified rifles in the country. It is no surprise why the gun is so reviled by gun control advocates. Omar Mateen, the gunman in the attack this weekend on a gay nightclub in Orlando, Fla. used a spinoff of the rifle produced by SIG Sauer to kill nearly 50 people. The   weapon has also been the gun of choice in several other mass shootings: at an elementary school in Newtown, Conn. at a movie theater in Aurora, Colo. at a holiday party for county health workers in San Bernardino, Calif. and at the campus of Umpqua Community College in Oregon. But the National Rifle Association has taken to calling the   “America’s rifle. ” Though the federal government does not keep track of exactly how many   are in circulation, experts estimate that there are easily several million in the nation’s rifle racks and gun safes  —   a huge number, given that the gun, along with other   assault weapons, was banned under federal law from 1994 to 2004. The rifle’s extraordinary popularity can be traced to a number of factors, including the ease of its use, its embodiment of a certain military glamour, and the aggressive marketing of the gun industry. The weapon was first built in the late 1950s by Eugene M. Stoner, a former Marine and the lead gun designer at the ArmaLite Division of the Fairchild Engine and Airplane Corporation. It was an unusual rifle for the era, made of lightweight plastics and aluminum instead of traditional materials like wood and metals. It also fired a .  bullet, which was smaller and faster than the typical ammunition at the time. Partly for those reasons, the Pentagon, under Defense Secretary Robert S. McNamara, purchased the   in bulk in the 1960s and, after renaming it the   turned it into the standard issue for American ground troops in Vietnam. Around the same time, a civilian version of the rifle, which unlike its military counterpart could not shoot automatically, also went on sale. Today, dozens of companies produce their own version of the weapon. “Back in the day, people called it the ‘plastic rifle’ because it felt like a toy,” said Sam Andrews, the owner of Tier One Weapons Systems, a gun engineering company in Eureka, Mo. “But that’s evolved. Now people realize that light can be good. ” Because of its   system, Mr. Andrews said, the   has a fairly gentle recoil. The weapon is also fast and accurate, he added, able to fire, under capable hands, eight rounds in a second. “The reason it’s so popular,” Mr. Andrews said, “is that if you bring a handgun to a fight where there’s an   you’re going to lose. And it doesn’t matter if you’re a   man like me or a   girl. ” Gun owners say that the   is used for hunting, sport shooting and  . The rifle is also easily accessorized with custom   like flashlights, infrared scopes and a variety of grips, and is called the Lego set of the gun world. Its owners swap product reviews or share personal hacks on a wide variety of blogs and online bulletin boards. According to a 2010 survey by the National Shooting Sports Foundation,   owners tend on average to have three different versions of the rifle and spend more than $400 per weapon on accessories and special modifications. Though the   can be bought as cheaply as $600, the average retail price was slightly more than $1, 000, the survey found. This demand has been accompanied  —   some would say caused  —   by vigorous mass marketing campaigns by gun manufacturers, which often refer to the   not as an assault rifle, but as a modern sporting rifle. Groups like the Civilian Marksmanship Program run   target competitions each year that attract scores of military veterans, one of the gun’s chief sales demographics. “You’ve got lots of returning servicemen who knew the   very well  —   how to shoot it, clean it, take it apart,” said Jim Scoutten, the executive producer of Shooting USA, a shooting sports television channel. “And when they come back, in many cases they acquire the civilian version. ” The   is also heavily marketed to younger gun enthusiasts who are attracted to the highly militarized, Special Operations culture that has become increasingly prevalent in action movies and   video games like “Call of Duty. ” In 2014, the Violence Policy Center, which advocates gun control, did a study of the marketing efforts by the Freedom Group, one of the world’s largest gun manufacturers. It found that many of the company’s advertisements used martial images of men in tactical gear and slogans like “Built to Be as Tough as the Job” and “Bravery on Duty. ” The study quotes an article in Shooting Sports Retailer, a gun industry trade magazine, warning salesmen to be wary of certain   buyers. “Many of the new shooters attracted to tactical guns for their first firearms purchase will think that they know guns because they’ve played a lot of first‐person shooter video games,” the article says. “Gamers inspired by ‘Call of Duty’ to purchase their first gun will eventually discover that they have a lot to learn. ” But despite such admonitions, the gun industry has used the popularity of these games to sell its products to “a youthful, aggressive, technologically savvy generation,” said Josh Koskoff, a lawyer representing the families of Newtown, Conn. in a lawsuit against the industry. In researching his suit, Mr. Koskoff said that he found screen shots from “Call of Duty” of   that bear the names of   gun manufacturers. To Josh Sugarman, the founder of the Violence Policy Center, the manufacturers’ attempts to push the   among the younger set stem from a stark realization about the future of the industry. “The traditional   demographic  —   white males  —   is aging and slowly dying off,” Mr. Sugarman said. “So they’re marketing the   to the next generation as the new, shiny thing. ”'"}, "time": 1742562063.9748235}