{"duration": 0.07242512702941895, "input_args": {"text": "'at 11:29 am 2 Comments \\nElection 2016 has been extremely bittersweet for me. On the positive side, through both the Bernie Sanders and Donald Trump grassroots movements, we have seen clear proof that a huge number of Americans accurately understand that the current system is totally rigged and simply not working for them. These people didn’t migrate toward these two candidates for some tweaks to the system here and there, their supporters want full scale paradigm level change. \\nAs such, rather than dwelling on the differences between these two populist movements, let’s consider some of the areas where they overlap. \\n1. Trade — Opposition to NAFTA and current “trade” deals such as TPP, TTIP, and TISA have been central to both the Sanders and Trump campaigns. \\n2. War and militarism — Whether you believe Trump is sincere or not, opposition to Obama/Clinton interventionist overseas wars were key talking points for both Trump and Sanders. \\n3. The system is rigged — The painful acknowledgment that the U.S. economic system is a rigged scam that fails to reward hard work, and is more akin to a parasitic, predatory oligarchy with very limited social mobility, has been a key campaign theme for both Trump and Sanders. The economy is increasingly dominated by near-monoploy giants who relentlessly push for more power and more profits irrespective of the cost to society, whether that cost be war, poverty or social unrest. \\n4. Money in politics — The rigged economic system described above aggregates wealth into an increasingly small number of hands. Those hands then buy off politicians and rig the political process. A rigged economy and rigged political system perpetually feeds itself and endlessly grows at the expense of the public like a terminal cancer. Both Trump and Sanders emphasized this problem. \\n5. Rule of law is dead — Sanders focused on Wall Street bankers, while Trump focused on Hillary and her inner circle of cronies, but the overall point is the same. Rich and powerful oligarchs are above the law. We all know this, but Washington D.C. refuses to do anything about. \\nDespite all of the above, the ultimate status quo candidate, Hillary Clinton, has a very good chance of winning tomorrow’s election. Why? Primarily because Donald Trump is a very divisive figure who focused too much on polarizing issues such as building a wall, stop-and-frisk, supporting torture, advocating for internet censorship and libel laws, etc. While he got his act together toward the end of the campaign, he spent far too much of it marginalizing people like me who desperately want to vanquish the status quo, but couldn’t get comfortable with Trump. \\nThis is where the election took on a decidedly negative tone for me on a personal basis. I’ve dedicated the last six years of my life to fully exposing and combating status quo corruption, but when the populist revolt finally arrived, the only choice I was given for change was one I couldn’t embrace. For someone so passionately yearning for positive, paradigm-level change, that’s been a crushing letdown. Personally, I’ve passed the point where I’m willing to vote for someone I don’t believe in or trust. As such, I won’t be voting for either one. That said, my individual vote is irrelevant, and I don’t want to focus on that. The bigger question is, who do I think will win? \\nOn that question, I don’t have a strong opinion at the moment. Ultimately, it depends on whether Americans go into the voting booth and see status quo vs. blowing up the status quo, or if they see Donald Trump vs. Hillary Clinton. If they see the former, odds are in Trump’s favor. If they see the latter, it’s a matter of which personality Americans find least repulsive. \\nSo here we stand. Despite the fact that a huge percentage of Americans deem both Donald Trump and Hillary Clinton to be “unelectable,” one of them is about to be elected. As such, we really need to start thinking and strategizing about the future. In that regard, I propose we look at the five points of Sanders/Trump overlap I highlighted earlier. If we can stay focused on those existential issues after the election irrespective of who wins, “we the people” have a good chance of uniting a clear majority of the population and ultimately turning this national disaster around. \\nOr we can allow ourselves to be divided and conquered into oblivion. The choice is ours. \\nIn Liberty,'"}, "time": 1742563590.6578968}