{"duration": 0.046380043029785156, "input_args": {"text": "'  \\nMeet Melania Trump. America’s new First Lady. It would be completely pointless to try and compare her to the eloquent Michelle Obama or any other former First Lady for that matter. The best way to get to know the wife of President-elect Donald Trump is to, well, compare her to him. \\nTheir differences are glaring. She is an immigrant; he hates immigrants. She speaks five languages; he’s barely mastered one. But they do have a lot in common as well. Melania’s father was a Communist party member; and as Putin can attest, Donald likes Communists . \\nThey also both really love Donald. In her speech at the Republican rally in Berwyn, Philadelphia on November 3, 2016, Melania said about Donald, “He knows how to get things done. He certainly knows how to shake things up, doesn’t he?” \\nYou can watch her speech here: \\nMelania was apparently talking her husband’s approach to politics but was she really. In 1998, at the tender age of 28, the Yugoslav-born former model, Melania Knauss, met Donald Trump at a fashion party. He was still married to Marla Maples and was on a date with another woman. He sent his date to the washroom so he could get Melania’s phone number. Yep, he knows how to get ‘er done in a variety of areas. \\nBut Melania knows how to shake things up, too. Just ask Howard Stern. In 1999, Melania participated in an on-air radio conversation with the shock jock. \\n“Are you naked? Are you nude?” Howard asked Melania. \\n“Almost,” she said. \\n“Ahhh, I’ve got my pants off already,” replied Howard. \\nLike her husband, she apparently loves getting her picture taken as well. You can check out some of the most un-First Lady like pictures here when Melania was profiled in 2000 by GQ. The photos were posted online again in March 2016. Included in the spread, which took place on Trump’s customized Boeing 727, is Melania spread out naked on the bed. \\nAir Force One – here they come! \\nFeatured image via Win McNamee/Getty Images Share this Article!'"}, "time": 1742564494.9774575}