{"duration": 0.01587390899658203, "input_args": {"text": "'Tuesday, 15 November 2016 The great wall is going to be even greater now \\nPresident-elect Donald Trump announced today that not only is he still going to build the wall and make Mexico pay for it, but he is going to make the wall out of actual Mexicans. \\n\"We\\'re going to round up all the illegal immigrants and mash them together into a lumpy brown paste,\" said The Donald from his Ivory Trump Tower. \"Then we\\'ll lay them out on a huge rug across our Southern border and roll them up like a giant bigly burrito and let it bake in the sun until it hardens into a great wall of pain and suffering.\" \\nWhen asked what he would do to prevent animals such as donkeys from eating the Burrito Wall, Trump said he would dig a huge moat around the base and fill it with tequila. \\n\"It\\'ll be the best tequila money can buy. Mexico\\'s money, because I\\'m going to make them pay for that, too. So any donkeys that try to swim across and eat the wall, or any Mexicans, because let\\'s face it some of them are probably cannibals as well as rapists, will be too drunk to climb by the time they reach it. It\\'ll also stop any Muslims from trying to swim across because as everyone knows they\\'re not man enough to drink, let alone drink and drown.\" \\nTrump brushed off concerns about a potential health hazard should the Tequila Moat become choked with rotting bodies.\"We\\'ll just fill it with piranha fish,\" he said. \"They\\'ll be nothing left of the bodies except tiny scraps of flesh like those little yellow wormy things you find at the bottom of tequila bottles.\" \\nWhen asked if the piranhas would become too intoxicated to eat, or if they could even survive in alcohol, The Orange Overlord laughed in contempt. \\n\"Haven\\'t you people ever heard the expression drinks like a fish?\" Make James Cavahl\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742628472.5852787}