{"duration": 0.16891789436340332, "input_args": {"text": "'Nordic Genius and the Central Heat Theorem Adventures in Genetics Email This Page to Someone Your Name   \\nToday I will explain how civilization happened, to the extent that there has been any civilization to happen, or that it can be explained, and where stuff comes from, and who done what, and why. Afterward there will be no more to say on the subject. You will hear doors slamming across the nation as university departments shut down. \\nNow, history is littered knee-deep with literature, and art, and inventions, like gum on the underside of a theater seat. Inventions are pretty important for civilization. Where did these inventions come from? Well, there’s a group of people who clutter up the web and say that it was North Europeans. Yes. See, it’s genetic. These pale people invented everything. Nobody else did, especially Latins. It’s because northerners have creativity, and nobody else else can. The Chinese copy stuff pretty fair, and make little paper umbrellas for expensive drinks, but can’t invent. Latins can’t either. Only North Europeans. \\nThis seemed a bit smug since, curiously, most who believed this seemed to be North Europeans. A coincidence, doubtless. Anyway, being as I am a self-appointed defender of things Latin and tired of unending nonsense on the matter, I set out to investigate. Has anybody else, I asked, ever contributed to the dim world of the mind? Even, perish forbid, Latins? \\nNo. \\nAfter many months of arduous research, I had to concede: Damn! It was true! North Europeans really did own intellectual history. Nobody had ever approached their creativity. It was undeniable. The pattern went back a long, long way. To wit: \\nIn the mid-Fourth Millennium BC, North Europeans in Sumeria–widely believed to be Finns, but the evidence is inconclusive–invented writing. Yes. It was later invented independently by other North Europeans, notably the Chinese and Mesoamerican Indians. \\nLatin peoples in particular have no creativity. The evidence supports this: Four thousand years after the Finns in Sumeria, the Latin peoples of Denmark finally succeeded, sort of 750 AD, in writing down Beowulf (real name: Beowulf Gonzalez) though in crude language and using a script stolen from North European Phoenicians. Such are Latins. \\nNorthern Europeans of the Fifth Century BC in Athens produced Archimedes Jones and Aristotle Schwartz. This Nordic flowering continued. North Europeans of the Roman Empire invented engineering, or at least greatly improved on what the Finns of Sumeria had done. After this, Northern European Italians produced the Renaissance. Latin peoples could not have done it, because they lack creativity. \\nThere is no need here to recapitulate the intellectual achievements of Michelangelo Hofstedter, Da Vinci Frankfurter, or Benvenuto Cellini Thor. \\nPerseus, by Cellini Thor, a Florentine North European born 1500 and apparent misogynist. The Nordic genius is evident in the…in the…the derivation is left as an exercise for the reader. \\nNow we ask, why did North Europe produce Teutonic geniuses like Galileo Schwartz? What makes one civilization flourish while another remains covered in snow? After profound thought I concluded that to have a civilization one chiefly needs heat and moisture. This is true also of the more interesting tropical plants, such as orchids. \\nConsider: The Sumerians got a head start on everybody because they lived in a tremendously hot climate with two big two rivers, the Tigris and Euphrates. They didn’t have to spend all their time looking for firewood and shoveling snow. Compare this with, say, Norway. While the North Europeans of sweltering, rainy India were writing the Gita, the Norwegians huddled around fires and shivered. \\nIt can be shown that as you go north in Europe, the rise of intellectual achievement closely tracks the spread of central heating. This is the Central Heat Theorem. (Not to be confused with the Central Limit Theorem, which I thought says that if you throw enough coins enough times, the bar graph converges to a Gaussian. But it may say something else.) \\nAn article of faith among the North European claque is that peoples in colder climes are smarter than sun dwellers because. See, they had to evolve enough intelligence to remember that it got cold in the winter and they should put food somewhere. (I suspect that a cocker spaniel could do this, but never mind.) Anyway, the dumb ones froze because they couldn’t remember to come in where the fire was and it was warm. The rest bred hard because there was nothing else to do and evolved to be smart. \\nAnother way of looking at the question: anyone witless enough to live where it snows would start with a large IQ deficit to evolve against. \\nIn reality we see that human advance follows the Central Heat Theorem. The Esquimaux, good Asians all, have water, when they can melt it, but not heat, so they never contrived a civilization. Amerindians in places like Montana had water and some heat in the summers, but they froze in winter which discouraged them–it would me. Indians of the southern deserts had heat, heaven knows, but no water. No civilization to speak of. \\nBut the Indians of Mesoamerica, both warm and moist, built elaborate civilizations, invented writing, and number systems. See? It’s like orchid botany. \\nAfter the Nordic Renaissance in Italy, civilization of the European variety moved to France. (You can tell that France is a Northern European culture, not an inferior Latin one, because the French speak German.) \\nAt this point the North Europe of today, for practical purposes meaning Germany and England, kicked in. These two counties and the United States finally did produce a tremendous amount of civilization, including most math and literature and the singing commercial, though they can’t dance, and pretty much run the show today. Better late than never. Much is owed to such northern mathematicians as Fibonacci, Galois, Laplace, Lagrange, and Fermat. \\nI know that if I suggested that Latins had contributed anything to the arts and sciences, I would be called wrong-headed, racist, or a reverse-racist, or didn’t understand genetics, or something. Perish forbid. (From the Merriam-Fredster Dictionary: “racist”: observant, truthful, characterized by reason.) Yet, even though the evidence is against me–such monumental Germanic writers as Virgil, Dante, Machiavelli, Juvenal, and Cellini Thor himself cannot be denied–I stubbornly insist that Latins must have contributed something to civilization. The ablative absolute maybe, or tomato paste. \\nFred is reachable at jetpossum-readers@yahoo.com. Put “pdq” in the subject line of your email will be heartlessly autodeleted. Lack of response usually due to volume, not bad manners. (Reprinted from Fred on Everything by permission of author or representative)'"}, "time": 1742563175.93896}