{"duration": 0.060190677642822266, "input_args": {"text": "\"Email \\nBarack Obama and Hillary Clinton are standing on a street corner waiting for a bus. As the bus approaches, Obama grabs Hillary and tosses her out on to the street, where she is then run over by the oncoming bus. \\nOf course, this would never happen – literally. Neither Obama nor Clinton would ever be caught dead on a bus. Under it, yes - but not in one. \\nNaturally, I’m kidding about Barack tossing Hillary under the bus. He has not the strength to do so. Again – kidding. These are the jokes. I’m here all night. \\nBut seriously – it does appear that Obama has figuratively thrown her highness under the bus, again, for her ever-growing email scandal. I say again, for this isn’t the first time the president has done so. \\nIn 2015, when asked about Hillary’s private server, Obama stated , “The policy of my administration is to encourage transparency, which is why my emails, the Blackberry I carry around, all those records are available and archived.” Translation – I don’t know what she has been doing, but I follow the law. \\nMy buddy Tim Brown at Freedom Outpost reported that both Obama and Biden, prior to the 2012 election, threw Hillary under the bus over the Benghazi scandal. Both men claimed they had no knowledge that those in Benghazi requested more security prior to the attack. Biden stated during a Vice Presidential debate that year that, “We [Biden and Obama] weren’t told they wanted more security. We did not know they wanted more security there,” effectively hanging it on Hillary. \\nIt’s common knowledge of the disdain the Obamas have for the Clintons, and vice versa. As far out radical as Obama is, I don’t think he’s a crook – or if he is, he is better at hiding it. Obama doesn’t appear to have sold the White House to highest bidder the way Hillary did at State – or selling naked options on her potential to become president. \\nAt this point, it seems Barack is probably tiring of constantly having to defend a woman he really can’t stand, which is why, in my estimation, he is once again hanging her out to dry. \\nJust yesterday, White House spokes-punk Josh Earnest said that the White House stood by FBI Director James Comey on Monday as a man of 'integrity' and 'principle' in the face of a Democrat-led assault on his character and intentions. This is a major blow to Clinton – one I’m sure she is furious over. \\nThe Daily Mail reports Earnest stated at a daily briefing that, “The president’s assessment of his [Comey] integrity and his character has not changed. The president doesn’t believe he’s secretly strategizing to benefit one candidate or one political party.” This, despite attacks on Comey’s character by Clinton, her surrogates, and now “Dirty” Harry Reid. \\nIn a rather surprising turn, Earnest even defended President George W. Bush for his selection of Comey. This is highly unusual, as it is this White House’s historic M.O. to blame Bush for literally everything. \\nI don’t know why the White House seems to be separating itself from the Clinton camp. If I had to guess, beyond the hatred factor, I’d say that Obama has calculated that, at this point, his legacy is far more important than a president Hillary, and he does not wish to be forever connected to the scandal-ridden candidate. It’s probably a fair calculation. That, and maybe by favoring Comey in this war, he might himself purchase some good will to keep his involvement under wraps. Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742628414.8081582}