{"duration": 0.0729672908782959, "input_args": {"text": "\"Politics Iranian Parliament Speaker Ali Larijani (R) and Finnish President Sauli Niinistö shake hands in Tehran on October 26, 2016. (Photo by IRNA) \\nIranian Parliament Speaker Ali Larijani says the European Union can play a significant role in the settlement of the Syrian crisis and the campaign against terrorism. \\nLarijani made the remarks in a meeting with visiting Finnish President Sauli Niinistö in Tehran on Wednesday. \\nHe said that Iran supports political solutions to crises in the Middle East, including the conflict in Syria, while some extra-regional players as well as regional sponsors of terrorist groups sabotaged diplomatic solutions through adopting wrong approaches. \\nThe top Iranian parliamentarian also warned against the spillover of terrorism to other regions across the world. \\n“Unfortunately, military intervention by outsiders in regional issues and adopting a military approach and double standards on terrorism” have led to a rise in the number of terrorist groups and contributed to their activities, Larijani said. \\nHe also blamed the “extremist and deviated” ideology of Wahhabism for the spread of terrorism in the region, stressing that neither Sunnis nor Shias support terrorist or extremist acts. \\nElsewhere in his remarks, Larijani welcomed the expansion of ties between Tehran and Helsinki. \\nThe Finnish official, for his part, called for the further promotion of ties between his country and Iran. \\nHe also expressed regret about terrorist attacks in Afghanistan, Iraq and Syria and the lack of a political will to end the conflicts. \\n‘Terrorists pose threat to their own countries’ \\nAlso on Wednesday, the Finnish president met with Chairman of Iran's Expediency Council Ayatollah Akbar Hashemi Rafsanjani to discuss bilateral ties and regional developments. Chairman of Iran's Expediency Council Ayatollah Akbar Hashemi Rafsanjani (R) meets with Finnish President Sauli Niinistö (L) in Tehran on October 26, 2016. (Photo by IRNA) \\nIn the meeting, Rafsanjani warned about possible threats posed by foreign recruits when they return to their own countries and the subsequent rise of terrorism across the world, and called on the international community to take measures to address the issue. \\nThe senior Iranian official also raised the alarm over the issue of “state terrorism” pursued by the Zionists. \\nEarlier in the day, Finland’s president also met and held talks with Iranian Foreign Minister Mohammad Javad Zarif on the developments in the Middle East and the promotion of bilateral ties in different sectors, including economic and banking cooperation. \\nNiinistö arrived in Tehran on Tuesday to hold talks with Iranian officials on a range of issues. \\nHe also met with Iranian President Hassan Rouhani on Wednesday. Loading ...\""}, "time": 1742561637.5744557}