{"duration": 0.10327863693237305, "input_args": {"text": "\"By Shane Wright 11/05/2012 Voter fraud is a contentious issue of late; liberals swear it is a myth propagated by evil racist conservatives. We know better. Most on the right are aware of the voter fraud issue but many have little to no idea how to combat or report violations; consider this your crash course. First and foremost, step one in any instance where you see or suspect voter fraud is to alert the state officials who oversee the election process. For most states this is done by the Secretary of State, in other states, there is a State Board of Elections. Notifying these officials is paramount as they are the ones who ultimately certify and authenticate elections. Alert them before you call Fox News or blow up Twitter, though drawing as much media attention as possible is beneficial, you want to make sure you follow a process. I have included a contact list for each state at the bottom of this post. In many cases once you have alerted the state authorities they will direct you to the proper city or county officials where you will fill out paperwork. Bureaucracy at its finest. Go ahead and jump through their hoops, if you witnessed the fraud, chances are someone else did too. Make a good effort to get other witness' names and contact information as well. This will strengthen your case and increase the likelihood that state and county officials will step in and act on your complaint. If, as has happened before, state officials ignore you entirely your next step is to contact your state Attorney General and alert them of the situation. However, before you do this you need to arm yourself with knowledge of your specific states election laws. You will be more credible if you are able to cite the specific statutes which were violated. State laws are generally published online, however it may actually be quicker and easier for you to go to your local library or courthouse and utilize their search engines. In my experience relevant case law and updated statutes can be difficult to sort through on Google or other internet search sites. The Attorney General should conduct an investigation to determine whether or not there is enough evidence and/or information to take legal action. If state officials refuse to work with you, your next step is to alert both your State Representative and State Senator, they may intercede, and it is in the Secretary of State and Attorney General's best interest to respond professionally and quickly to these representatives. Should you continue to hit dead ends on the state level, it’s time to alert the Department of Justice. Before doing this, call your Congressman and Senator, in some cases they will be willing to write a letter on your behalf to the DOJ. This is what your goal is ultimately; for the DOJ is less likely to ignore these officials. If going through your elected officials is a poor option, as it may very well be depending on the circumstances, review federal election law and proceed anyways. Finally, you and I both know that the DOJ, nor liberal state officials are likely to do anything about a claim of election fraud, however, it is absolutely imperative that you go through these motions and document these steps to preserve any future legal options. Documenting instances of election fraud will continue to strengthen our case for voter ID. Furthermore it is important to press forward on these criminals, so that it's understood that we will not idly stand by and allow our elections to be manipulated. Last but not least, use your head. If you see or suspect voter manipulation, have the courage to record it, whip out your phone and start shooting video , and report it to the appropriate authorities first. Alabama 334-242-7210\""}, "time": 1742561730.7049906}