{"duration": 0.07835102081298828, "input_args": {"text": "'North Sentinel Island, located in the Bay of Bengal, between Myanmar and Indonesia, is home to an isolated tribe that has never been colonized or even made contact with. These people are one of the last Stone Age tribes on Earth whose culture has been completely untouched by modern civilization. \\nVia theusualroutine \\n\\nRead more: Man Arranges Leaves, Sticks, And Stones To Create Magical Land Artworks \\n\\nDespite the fact that the island formally belongs to India, no one dares to visit it and approach the Sentinelese tribe. The reason is their extreme violence and hostility – anyone who has ever tried to come ashore the island was attacked or even killed.\\nContacts with the Sentinelese tribe In 1896, a Hindu convict escaped from the prison but had a bad luck to ground on North Sentinel on a makeshift raft. As a result, his body was found a few days later on a beach, perforated by arrows and with the throat cut.\\nOn August 2, 1981, when the ship Primrose ran aground on the North Sentinel Island reef, the crew noticed men on the beach who were carrying arrows and spears. The captain tried to use radio communication to ask for help, but did not receive it. Fortunately, the crew was lucky enough to be kept away from the island by the troubled waters and rescued by helicopter a few days later.\\nThe Daily Mail: “Survival International reported late last year that it had received reports that fishermen are targeting the area, with seven men being apprehended by the Indian Coast Guard.\\nOne of the fishermen reportedly stepped foot on the island in close proximity to the tribe’s members, and he managed to leave unscathed.\\nSurvival International, which advocates for tribal peoples’ rights, describes the Sentinelese as ‘the most vulnerable society on the planet’ as they are likely to have no immunity to common diseases such as flu and measles.\\nDue to their complete isolation, the chances of them being wiped out by an epidemic are very high, according to the organization.”\\n\\nAfter the catastrophic Indian Ocean earthquake of 2004, the Indian government sent a helicopter to check on the Sentinelese tribe. It’s curious that the North Sentinel Island and its inhabitants were almost unaffected while some nearby islands suffered heavy damage.\\nWhen the helicopter hovered over a group of tribesmen, they were throwing stones and shooting arrows at it.\\n\\n\\n\\nOn January 26, 2006 , two men were killed when fishing illegally in the area. A coastguard helicopter tried to retrieve their bodies but was unable to land because of a shower of arrows from the locals.\\nWhat else is known about the Sentinelese tribe The Sentinelese are believed to have lived on the island for 60,000 years! After this unthinkable period of time in isolation, it’s no surprise that they are so hostile to outsiders, which may be due to past conflicts with the outside world. In order to protect the Tribe and prevent unnecessary violence, the Indian government has also made it illegal to approach it closer than three miles.\\nDue to the inability to study the tribe and the island, we don’t know much about them. It is estimated that the tribe counts between 50 and 400 members and lives exclusively by hunting and gathering. Though it is difficult to observe the island from the air because of the dense tree cover, it is established that the Sentinelese are not familiar with agriculture.\\nTheir drive to protect their culture from the outside world is probably the reason they have survived in isolation for so many years. Who knows how long they will manage to live in the middle of the ocean without having the slightest interest in the “civilized” rest of the world. And perhaps being without contact with us is a good thing.\\n'"}, "time": 1742562197.9809802}