{"duration": 0.06186795234680176, "input_args": {"text": "'Beyoncé has canceled her scheduled headlining appearance at the Coachella music festival this year after her doctor advised her to maintain a less strenuous schedule while she is pregnant with twins. [In a statement, festival organizer Goldenvoice said the    singer would not be able to perform in Indio on April 15 and April 22 as planned, but would instead headline Coachella in 2018.  “Following the advice of her doctors to keep a less rigorous schedule in the coming months, Beyoncé has made the decision to forgo performing at the 2017 Coachella Valley Music  Arts Festival,” the organizer said in a statement. “However, Goldenvoice and Parkwood are pleased to confirm that she will be a headliner at the 2018 festival. Thank you for your understanding. Stay tuned for more information. ” Coachella organizers had hoped that Beyoncé’s performance at the Grammy Awards this month was a sign that she would be able to take the stage at the   Southern California festival in April. The singer’s fans took to social media Thursday afternoon to express their disappointment, with many saying they would request refunds from the festival or else sell their tickets to interested buyers. I literally only bought a Coachella ticket for Beyoncé. This is stupid. Who wants my ticket?!  —   Amanda Castillo (@ACastillo121) February 23, 2017,  I was only gonna go to @coachella for @Beyonce so guess I’m not going anymore🙃  —   R O G Ξ L I O (@ItzMe_Roger) February 23, 2017,  If Beyoncé getting pregnant  not preforming at Coachella (I got my tix in May) isn’t the epitome of my luck this past year then idk what is,  —   Megan (@meganelizax) February 23, 2017,  Makes sense why so many people are selling their Coachella tickets now  …      —   ♔ shana (@lalashana) February 23, 2017,  Coachella will still go on as planned over two weekends in April. The festival’s other headliners include Kendrick Lamar and Radiohead, while other artists set to perform include Bon Iver, Lorde, Future, Justice, The xx and DJ Khaled. The festival did not immediately announce a replacement headliner.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562403.594943}