{"duration": 0.0719902515411377, "input_args": {"text": "'We all know by now that the Clinton campaign will stop at nothing to win. \\nEven if it means publishing embarrassing, demeaning photos of fellow Democrats, that’s just fine with them. \\nEvidenced a photo that was circulated showing Bernie Sanders in a swimming suit apparently attending a Democratic retreat. This was all while the Clinton team was hyping stories about Sanders attending fundraisers for wealthy benefactors (which, let’s be honest, pales in comparison to the “ wealthy benefactors” Hillary has in her back pocket). \\nBreitbart reported that Tina Flournoy, Bill Clinton’s Chief of staff emailed the photo of Sanders sunning himself by a pool to Brian Fallon and John Podesta, two Clinton lackeys: \\nFallon’s response? “OMG!” \\n“Can we tweet?” Podesta asked. \\nFallon responded “I think we shd give to NY post.” Flournoy added she’d send more juicy details about the event, including the people who attended. \\n“Thank you,” Fallon replied. “ We are on this .” \\nThe entire conversation was part of the ongoing WikiLeaks document hacks of John Podesta’s account. The New York Post apparently never ran with the story, but that didn’t stop the Clinton camp from sending it to other people. It was published by celebrity gossip dirtbag Perez Hilton the day after the Clinton team discussed releasing it. \\n“I wonder what Mike Bloomberg would think about this???” wrote Hilton on his blog. “Bernie Sanders lounges at elite Martha’s Vineyard pool, summer 2015 after helping raise money from Wall Street lobbyists.” \\nJust the next week, there were several stories in the media questioning Sanders for even attending the fundraiser for Harry Reid. \\n“For Sanders, campaign finance purity not always possible” wrote MSNBC’s Alex Seitz-Wald, citing “a guest list obtained by MSNBC” that included “previously unreported are details about who exactly attended those fundraisers.” \\n“Bernie Sanders: Prolific Democratic Party fundraiser,” wrote CNN’s Eric Bradner on Monday, February 8, announcing that “CNN has obtained invitations that listed Sanders as a host for at least one Majority Trust event in each year since 2011.” \\nThen both Bill and Hillary picked up on those same media stories, accusing Sanders of taking Wall Street money – the height of hypocrisy. \\n“Senator Sanders took about $200,000 from Wall Street firms,” Hillary Clinton said during a rally in New Hampshire on February 8. “Not directly but through the Democratic Senate Campaign Committee. There is nothing wrong with that. It didn’t change his view. Well, it didn’t change my view or my vote, either.” \\nBill Clinton attacked Sanders, referring directly to the CNN story and pointing out that he likely accepted money from Wall Street. \\nAnd that’s how Hillary Clinton wins. By Any Means Necessary.'"}, "time": 1742561943.841221}