{"duration": 0.058710575103759766, "input_args": {"text": "'The many men, women and children who spend their days glued to their smartphones and social media accounts might learn something from   Miranda, creator of the groundbreaking megahit “Hamilton. ” Asked in an interview with Delta Sky magazine when and where he finds time to be creative, Mr. Miranda, an avid reader of books and enthusiast for unfettered downtime, replied: “The good idea comes in the moment of rest. It comes in the shower. It comes when you’re doodling or playing trains with your son. ‘Hamilton’ forced me to double down on being awake to the inspirations of just living my life. ” Mr. Miranda’s observation bodes ill for the future, not just of creativity but also of healthy bodies, minds and relationships. No doubt you’ve seen the following scenarios, probably many times: • Young couples out to dinner pull out their smartphones to check messages, emails and social networks even before scanning the menu, and check their phones repeatedly throughout the meal. • Shoppers and commuters standing in line, people crossing busy streets, even cyclists and drivers whose eyes are on their phones instead of their surroundings. • Toddlers in strollers playing with a digital device  —   a parent’s or perhaps even their own  —   instead of observing and learning from the world around them. • People walking down the street with eyes on their phones, bumping into others, tripping over or crashing into obstacles. Observations like these have prompted a New York psychotherapist to ask, “What really matters?” in life. In her enlightening new book, “The Power of Off,” Nancy Colier observes that “we are spending far too much of our time doing things that don’t really matter to us. ” Both in and outside her practice, she has encountered many people who have become “disconnected from what really matters, from what makes us feel nourished and grounded as human beings. ” The   access to digital technology, starting at ever younger ages, is transforming modern society in ways that can have negative effects on physical and mental health, neurological development and personal relationships, not to mention safety on our roads and sidewalks. Don’t get me wrong. I’m no Luddite. I love technology. I love the convenience and assistance afforded by the myriad apps on my cellphone, a   information bank. I remember being amazed, as a Times reporter back in the early 1980s, when I started using word processing and realized how much faster I could write an article. Now computers save tons of time and effort and avert countless embarrassing errors because I can look up facts, figures, spelling, definitions and scholarly publications without leaving my ergonomic chair. But I also love putting my computer in sleep mode and going for a walk with my dog, meeting and chatting with friends, acquaintances and strangers, some of whom have become friends. As with so much else in life, moderation in our digital world should be the hallmark of a healthy relationship with technology. Too many of us have become slaves to the devices that were supposed to free us, giving us more time to experience life and the people we love. Instead, we’re constantly bombarded by bells, buzzes and chimes that alert us to messages we feel compelled to view and respond to immediately. “Most people now check their smartphones 150 times per day, or every six minutes,” Ms. Colier wrote. “And young adults are now sending an average of 110 texts per day. ” Furthermore, she added, “46 percent of smartphone users now say that their devices are something they ‘couldn’t live without. ’” In “The World Unplugged Project,” investigators at the University of Maryland reported that “a clear majority” of students in the 10 countries studied experienced distress when they tried to go without their devices for 24 hours. One in three people admitted they’d rather give up sex than their smartphones. I fear we are turning into digital robots. Will future generations know how to converse with one another face to face? Will they notice the birds, trees, sunrise and the people with whom they share the planet? Instead of visiting art galleries, attending concerts or walking on picturesque wooded paths, one woman I know who came to Woodstock, N. Y. last summer spent the weekend on her iPad communing with her many “friends” on Facebook. All I could think was “What a waste!” Why, you may ask, is it so important to limit our digital lives? “Without open spaces and downtime, the nervous system never shuts down  —   it’s in constant    mode,” Ms. Colier said in an interview. “We’re wired and tired all the time. Even computers reboot, but we’re not doing it. ” She continued, “It’s connections to other human beings  —     connections, not digital ones  —   that nourish us and make us feel like we count. Our presence, our full attention is the most important thing we can give each other. Digital communications don’t result in deeper connections, in feeling loved and supported. ” How often is your real work interrupted by signals from your smartphone that you find impossible to ignore? Have you ever avoided intimacy with your partner because you’re in the midst of iPhone Scrabble? Is endlessly snapping selfies and posting your every action and thought on social media creating an unhealthy  ? As for physical   every hour spent on a device is likely to be an indoor, sedentary one. Screens are stealing time that children and adolescents should be spending on physical activity and sports, reading, or creating and engaging directly with other children, all of which are critical to healthy physical and social development. “Children who overuse online media are at risk of problematic internet use, and heavy users of video games are at risk of internet gaming disorder” (translation: addiction) the American Academy of Pediatrics wrote in its latest policy statement on media use. Ms. Colier, a licensed clinical social worker, said, “The only difference between digital addiction and other addictions is that this is a socially condoned behavior. ” While her book contains a   digital detox program, in our interview she offered three steps to help curb one’s digital dependence. 1. Start by recognizing how much digital use is really needed, say, for work or navigation or letting family members know you’re O. K. and what is merely a habit of responding, posting and  . 2. Make little changes. Refrain from using your device while eating or spending time with friends, and add one thing a day that’s done without the phone. 3. Become very conscious of what is important to you, what really nourishes you, and devote more time and attention to it.'"}, "time": 1742628506.0092769}