{"duration": 0.037767648696899414, "input_args": {"text": "'By Jason Easley on Fri, Oct 28th, 2016 at 1:02 pm If Donald Trump wants to keep Arizona in the Republican column, he will have to spend some of his very limited time, money, and resources there, because Hillary Clinton is campaigning in the red state next week. Share on Twitter Print This Post \\nIf Donald Trump wants to keep Arizona in the Republican column, he will have to spend some of his very limited time, money, and resources there, because Hillary Clinton is campaigning in the red state next week. \\nThe Clinton announced that the Democratic nominee would be spending part of the last week of the campaign in Arizona, “On Wednesday, November 2, \\u200e Hillary Clinton will campaign in Phoenix, Arizona, days before Election Day. Clinton will lay out what is at stake in the election. With more people voting in this election than any in history, Clinton will urge Arizona voters to take advantage of in-person early voting. Voters can check their registration status and early vote location at iwillvote.com.” \\nThe fact that Clinton will be in usually reliably red Arizona in November during the final week of the presidential campaign tells voters all they need to know about the state of the presidential race. \\nHillary Clinton is in such a good position that she can afford to spend some time during the last week of the campaign trying to turn red states blue. \\nThe Trump campaign already deployed VP nominee Mike Pence to Utah in a bid to save that dark red state from falling, and it looks like they will have to devote resources to saving Arizona to prevent Clinton from winning a state that has been a given for Republicans in previous elections. \\nThe Trump campaign is broke. The nominee had to give his campaign $10 million so that they could afford to buy air time in battleground states for their ads. \\nThe Clinton campaign is trying to stretch Trump past his breaking point by making a serious play for Arizona. It is a brilliant move from a campaign that has outwitted its Republican opponent at every turn.'"}, "time": 1742564438.5828273}