{"duration": 0.056441307067871094, "input_args": {"text": "'Russia-US Plutonium Deal No Longer In Effect 11/02/2016 \\nRUSSIA TODAY President Vladimir Putin has signed an act suspending a 2000 agreement between the US and Russia on reprocessing weapons-grade plutonium extracted from decommissioned warheads. \\nThe bill has already been published on Russia’s official legal information website, meaning it’s now in force. \\nIt mentions that a decision to restore the agreement can only be made by Russia’s president. \\nThe deal between Moscow and Washington was ratified in 2000. As a means to safely utilize weapons-grade plutonium, it suggested a specific procedure to turn it into nuclear plant fuel. Starting from 2018, it was planned to reprocess 34 tons (68,000 pounds) of plutonium, which would have been enough to produce thousands of nuclear weapons, RIA Novosti reported. \\nYet, while Russia has prepared the infrastructure necessary for the process, the US said it found the procedure too costly and instead opted for mixing plutonium with special dilutants to store it indefinitely. \\nRussia suspended the deal “ due to drastic changes of circumstances, the rise of threat to strategic stability as a result of hostile actions of the US towards the Russian Federation and the inability of the US to provide for the accepted obligations to utilize the excess weapons-grade plutonium in accordance with the agreement ,” the new bill read. \\nFor the agreement to be resumed, Washington should reduce the US military presence on the territory of NATO members that joined the bloc after 2000, cancel its Magnitsky Act which bans entry to the US to a list of Russian citizens, as well as lift other anti-Russian sanctions and compensate the loss Moscow suffered as a result of such policy. \\nThe bill on suspension – which is a “ forced measure ,” according to Russian Foreign Minister Sergey Lavrov – was first submitted by the president’s office earlier this month and then approved by parliament. \\nCommenting on the suspension of the deal, Russian Deputy Foreign Minister Sergey Ryabkov has said that it would not affect any of Moscow’s other commitments related to international nuclear security and does not interfere with the Nuclear Non-Proliferation Treaty.'"}, "time": 1742563088.609019}