{"duration": 0.01387786865234375, "input_args": {"text": "'Home | World | Brexit Betrayal: Britain Must Prepare For Thirty Years of Civil Unrest and Riots Brexit Betrayal: Britain Must Prepare For Thirty Years of Civil Unrest and Riots By Dark Waters 04/11/2016 07:53:14 \\nLONDON – England – The consequence of diverting the result of a democratically held referendum vote which was given full support from parliament and won by 52% of voters for Brexit will be the undoing of Britain’s constitution. \\n\\nTo simply bypass the peoples vote will not be tolerated by many and there will be civil unrest in the future if Brexit is not delivered. \\nMass rioting and looting in all cities will be the norm, because if there is no rule of law in our democracy, why should the people adhere to any rule of law on the streets? \\nIn essence, civil unrest is the last bastion of justice, and to have the conclusive EU referendum vote stolen by crooked biased EU centric judges will be their final undoing. \\nThere will be no peace, as the rioting masses converge burning everything in their path, who is to say what will happen, but when the anger envelopes the populace there is no stopping the torrent. \\nIt is better to fight for justice than to be timid, civil unrest is a disruptive tool that when utilised correctly can bring forth real change. Change that crooked corrupt judges commandeered by rich business people cannot do. \\nOf course violence and looting is a terrible thing, but so is war, so is injustice, but these are necessary measures for survival, if nothing is done soon, Britain and its people will be no more. Already, we have been inundated, but if there is no Brexit, the numbers will increase tenfold, until the tiny island of Britain is nothing more than a holding prison, a junk filled morose, barren overpopulated garbage dump. \\nBritain fought two world wars and was on the winning side of both, this time, the Germans will take Britain without a single shot being fired, this is the central position of the EU. The European Union is an East German Soviet construct incorporating German Imperial fascist techniques to subjugate other nations through economic means. \\nBy bribing the corrupt judges who are linked to EU centric projects, the EU is seeking to halt Brexit. \\nNo More \\nAre you a fucking fool to take that? Are you going to stand by and let your nation be taken over? Or are you going to fucking stand up and fucking do something about it? \\nWe must do what is necessary. \\n“It is not enough that we do our best; sometimes we must do what is required .” ― Winston S. Churchill Share on :'"}, "time": 1742628519.785475}