{"duration": 0.1418931484222412, "input_args": {"text": "'Donald J. Trump won’t be sworn in until Friday but big business has already thrown him a veritable inaugural ball. A series of   companies, among them Ford, Lockheed Martin, Amazon and Sprint, have all announced plans in recent weeks to hire and invest in the United States. A who’s who of executives from boardrooms here and overseas have made the pilgrimage to Trump Tower and sought the  ’s blessing. The   drumbeat of announcements  —   on Tuesday it was the turn of General Motors and Walmart  —   is not just about winning good headlines or a favorable mention from the tweeter in chief, however. While the jobs and investments are real enough, all of these corporate behemoths will soon have business before the new administration, with    moves expected on mergers, trade policy, tax reform, defense contracts and regulation. Signaling to the   and his team that they are on board now also provides chief executives with more leverage down the line. “It might be an attempt to buy good will, but I don’t blame them for trying to do that,” said Tom C. Korologos, a longtime Republican strategist and an adviser at the law firm DLA Piper in Washington. “It’s a new administration, and companies are nervous and don’t know what to expect. ” Ultimately, the new administration’s decisions will be formulated far from the limelight in conference rooms at federal agencies in Washington or behind closed doors on Capitol Hill. The money riding on the outcome runs into the trillions. And on   issues, the companies will need to make a strong case. Detroit automakers, for example, are concerned that Washington will impose tariffs on cars made in Mexico, but they are eager for wiggle room on new   standards at home. Walmart is worried about rising trade tensions with China, where many of the products it sells are made. Lockheed Martin, whose chief executive, Marillyn A. Hewson, met with Mr. Trump on Friday and promised to create 1, 800 new jobs, depends on the government for more than 70 percent of its $46 billion in revenue. United Technologies, which agreed to preserve 850 jobs at its Carrier unit in Indianapolis after public pressure from Mr. Trump, gets about 10 percent of its sales from Washington. On a call with the news media on Tuesday, Mr. Trump’s press secretary, Sean Spicer, cited a new pledge by Bayer to invest $8 billion in the United States and create 3, 000 jobs. “The reason for this commitment and expansion is because of the  ’s focus on creating better business climate here in the United States,” he said. What Mr. Spicer didn’t mention is that Bayer, the German chemical giant, faces intense scrutiny from antitrust regulators in Washington and Europe over its plan to buy Monsanto, based in St. Louis, for $57 billion. If Bayer cannot win approval from the Justice Department and the Federal Trade Commission, it will be costly, with Bayer obligated to pay Monsanto $2 billion under the deal’s terms. Last week, the chief executives of the two companies met with   Trump and made their case for the merger, which some advisers to Mr. Trump have criticized. Mr. Korologos played down the idea that big business would get specific favors in exchange for hiring or investing. But he acknowledged that many of the announcements were choreographed for maximum political impact. “There’s too many hoops to jump through and too many institutions for it to be a simple quid pro quo,” he said. “But what Trump is doing is very unusual, and these decisions weren’t made 48 hours ago or after a tweet. They were in the works for a long time. ” Mr. Spicer did point out that Bayer’s decision to hire and invest more in the United States had not been disclosed previously  —   unlike some highly promoted announcements that were essentially recycled versions of previous news releases. In other cases, companies are talking up hiring plans now, after earlier decisions to quietly shed workers. Walmart, the nation’s largest private employer, said Tuesday it would create about 10, 000 jobs when it opens about 60 new stores, plans that had already been announced last year. The additions to the work force are largely in line with Walmart’s typical hiring practices for new stores, according to a company spokesman, Lorenzo Lopez. Months before it announced the new stores last year, Walmart said it could lose as many as 16, 000 workers by closing 154 of its American locations and 115 stores overseas. Mr. Lopez said on Tuesday that “a lot” of the workers who had been affected by the store closures were able to move to surrounding Walmart stores. In the case of the auto industry, Mr. Trump’s criticism of imports of   vehicles has prompted companies to defend their American manufacturing presence aggressively and announce new investments, some of which had long been in the planning stages. Last week, the chief executive of Fiat Chrysler, Sergio Marchionne, admitted that plans for 2, 000 new jobs in the United States had been under consideration long before Mr. Trump won the presidency in November. “The decision has been in the works for a long time, dating back to 2015,” Mr. Marchionne said during an appearance at the Detroit auto show. “It is just a continuation of the retooling of the U. S. manufacturing base. ” But Mr. Trump’s immediate  —   and positive  —   reaction to the announcement underscored how closely the   is following the automotive job picture, and how his keen interest in American manufacturing is influencing automakers. On Tuesday, General Motors, the largest American automaker, announced $1 billion in new investment in its American factories that would create or retain 1, 500 jobs. The automaker also said it was moving production of axles from Mexico to the United States and creating 450 American jobs, and would continue to add thousands of new technology jobs over the next few years. In a statement, G. M. said the plans had been “in the works for some time. ” Yet the timing of the announcement was no coincidence, given Mr. Trump’s interest. “There’s no question there is an emphasis on job creation in the U. S. right now,” said Patrick E. Morrissey, a G. M. spokesman. “This was good timing for us to share what we are doing. ” Indeed, on Tuesday, Mr. Trump publicly thanked G. M. and Walmart via Twitter within hours of their announcements. Companies are also closely attuned to where government policy is headed, and want to show they are getting with the program, said Bruce P. Mehlman, founder of Mehlman Castagnetti Rosen  Thomas, a lobbying firm whose clients include Fiat Chrysler, Procter  Gamble and Walmart. “In 2009 and 2010 under President Obama, it was sustainability, and in 2017 with Trump it’s domestic manufacturing,” Mr. Mehlman said. For automakers, that is an important issue as G. M. and many other companies make cars in Mexico for sale in the United States. The automaker has so far declined to stop importing cars from Mexico. But the entire auto industry is bracing for potential changes in the North American Free Trade Agreement that could disrupt their intricate production structure in the United States, Canada and Mexico. Industry analysts see the widely publicized announcements of new jobs as attempts by car companies to both blunt the  ’s criticism and curry favor with the incoming Trump administration. “Retaining and growing jobs in the U. S. is a political hot button right now,” said Michael Harley, an analyst with the auto research firm Kelley Blue Book. “The timing of the announcement shows General Motors is more than willing to play the new administration’s publicity game. ”'"}, "time": 1742562335.5386128}