{"duration": 0.047882080078125, "input_args": {"text": "'President Donald Trump honored former President Andrew Jackson, celebrating his 250th birthday by visiting Hermitage, Jackson’s home in Nashville, Tennessee. [“Look what he was able to do, look what he was able to build,” Trump marveled as he told the story of Jackson, who was orphaned as a young boy before fighting in the Revolutionary War.  “Andrew Jackson was a military hero and genius and a beloved president, but he was also a flawed and imperfect man, the product of his time,” Trump said. Trump told the story of Jackson being captured by the British during the Revolutionary War as a boy and being slashed with a saber when he refused to shine an officer’s boots. “It was during the revolution that Jackson first confronted and defied an arrogant elite,” Trump said. “Does that sound familiar to you?” “Oh, I know the feeling, Andrew,” Trump smiled as he shook his head. Trump explained that since the event, Jackson defied elites and authority figures throughout his life. “Jackson’s victories shook the establishment like an earthquake,” Trump said. He quoted Henry Clay calling Jackson’s victory as president “mortifying” and “sickening. ” “Oh boy, does this sound familiar,” Trump grinned, as the audience laughed loudly. Trump told the audience that Jackson removed ten percent of the federal workforce, expanded veterans benefits, rooted out corruption, imposed tariffs to protect American workers  —   something he was also committed to doing. “Wait till you see what’s happening pretty soon folks,” he said. The president reminded the spectators that he brought the Andrew Jackson portrait into the Oval Office, adding that he can see the Magnolia tree planted on the South Lawn by Jackson. “Now we must work in our time   …     to expand the blessings of America to every citizen in our land and when we do, watch us grow,” Trump said. “We will truly be one nation. ”'"}, "time": 1742563923.700698}