{"duration": 0.026657581329345703, "input_args": {"text": "'Rabid Clinton Hating Conservative Blogger Goes Rogue, Endorses Hillary. Here’s Why (VIDEO) By Karen Shiebler on October 29, 2016 Subscribe \\nAndrew Sullivan is a well known libertarian thinker. He is an author, a blogger and an outspoken conservative commentator. \\nSullivan used to cover the Clinton White House for the New Republic. From the earliest days, he had negative feelings about the Clintons. In describing the Clintons, he said: “They are very much the establishment. They are very much after money. They are very much after power.” Sullivan was born and raised in England, but attended and graduated from Harvard University, where he earned both Masters and Doctoral degrees in government. The writer ties his conservative beliefs to his Roman Catholic upbringing in a family or Irish descent. Andrew Sullivan has long been outspoken about his dislike for Hillary Clinton. During an appearance on Real Time With Bill Maher, he referred to the former Secretary of State as a “talentless hack.” He bashed her “disastrous” time as Secretary, citing the situations in Libya and Iraq as evidence of her lack of judgement. Maher accused Sullivan of hating Hillary, and he didn’t disagree. So it has come as a big surprise to many that Sullivan is now publicly and prominently saying, “I’m with her.” The sharp tongued Clinton critic is now planning to vote for her and he is clear about why. He told Brian Williams of MSNBC : “There is almost no scenario I could imagine in which I might actually support Hillary Clinton for president except this. Because I honestly believe that Donald J. Trump is not just a normal candidate in this election; that he is a threat to our entire democratic system, that his appearance to the top of the national ticket is probably the gravest crisis in this country’s modern history. And I think defeating him is not just something that we should take as a Democrat or Republican or even as a sort of a way of expressing ourselves. It is a way to say for the moment the very core principles of liberal democracy that he is attacking on a daily almost hourly basis.” When one of our most outspoken conservative decides that he has to vote for the Democrat out of love for the country, things are looking grim for the GOP. Donald Trump is in deep trouble when someone like Andrew Sullivan calls him the “gravest crisis” in our recent history. Oh, and one more thing. This will be the very first vote that Andrew Sullivan will be casting as a new American citizen. I hope all of his conservative fans follow in his footsteps. \\nFeatured image via MSNBC Video Screengrab . About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742628456.389424}