{"duration": 0.15276575088500977, "input_args": {"text": "'It’s all up to Elizabeth Holmes. Theranos, a   lab started and led by Ms. Holmes that promised to revolutionize the industry, is now under criminal investigation and faces increasing skepticism about whether its core technology works. Several federal agencies are looking into the company’s operations. Ms. Holmes herself may have to answer to federal regulators about what she told investors. Just last year, Theranos was a Silicon Valley favorite with a $9 billion valuation. Now, depending on the outcome of the investigations, including the threat of crippling sanctions by the Centers for Medicare and Medicaid Services, the company could be forced out of business and Ms. Holmes could lose her position as chief executive. The troubles have led to a cascade of questions about what changes Theranos might make to rebuild its reputation and business prospects. Some have even said that Ms. Holmes should step aside. After more than six months of intense questions, though, changes have been limited. And whatever future moves the company makes are up to Ms. Holmes. She  —   not the investors, and not even the board  —   controls the switches. Ms. Holmes, a    Stanford University dropout, owns a majority interest in Theranos, a privately held company she founded in 2003. She is also the company’s chairwoman and chief executive. What she wants done at her company, she can demand. Ms. Holmes declined to be interviewed. But in an extended interview, David Boies, a heavyweight lawyer who is one of three outside directors on the Theranos board, hinted that some management changes may be coming soon. “The board is right now in the process, and Elizabeth Holmes is in the process, of adding significant talent to the company,” he said. But an adviser to the company, Richard Kovacevich, a former chief executive at Wells Fargo, acknowledged the limited role played by anyone other than Ms. Holmes. “She doesn’t have to answer anything she doesn’t want to,” he said. The situation at Theranos offers a stark reminder of the perils of investing in Silicon Valley, where it is common for founders to control a company, leaving boards with little real power, including over who should be chief executive. The examples are legion, including huge success stories like Google and Facebook. The upside for venture capitalists is that betting on an individual and getting in early can lead to riches. But if trouble brews, it is nearly impossible for a board or anyone but the founder to make any changes  —   a risk that, for now at least, investors remain willing to make. “For every Theranos, there’s a Facebook,” said Bryan Roberts, a partner at Venrock, a leading venture capital firm. Even in a case like Zenefits, where its founder, Parker Conrad, stepped down as chief executive in February after regulatory problems emerged, the decision to resign was ultimately his. Theranos’s board, which in its early years included some of its large investors, was later composed of an array of diplomatic, military and political leaders, including former Secretaries of State George Shultz and Henry Kissinger and former Senator Bill Frist. Last year, the company divided the directors into advisers and an actual governing board, which includes Mr. Boies, whose law firm represents Theranos. While critics have pointed to the board’s lack of industry expertise and the advanced age of some advisers, Mr. Boies defended it as “extraordinarily qualified. ” But legal experts say that while the directors are responsible for representing the interests of all investors, Ms. Holmes does not have to listen. A founder with controlling interest can replace the board, so directors are ultimately left with the choice of being fired or resigning if they strongly disagree with the executive. Supervoting shares, another common practice among   grant founders like Ms. Holmes even more power. “You’re practically a paper tiger and have fiduciary responsibility,” said Charles Elson, a corporate governance expert at the University of Delaware. Mr. Boies says Ms. Holmes has the board’s backing. “I think the board has complete confidence in Elizabeth Holmes as a founder of the company, as a scientist and as an administrator,” he said. The board is represented by an independent law firm, Mr. Boies said, which is answering queries from the United States attorney’s office in San Francisco and the Securities and Exchange Commission, as well as conducting an independent investigation into whether Theranos made proper disclosures to investors. No formal accusations have been made. While Theranos is privately held, its investors still have protections, said Joseph Grundfest, a law professor at Stanford. “The federal securities laws have very strict   provisions, and they apply to sophisticated investors, not just unsophisticated ones. ” But Mr. Kovacevich, who is also an investor, emphasized that Theranos was not a publicly held company with the same responsibilities and that the shareholders understood this. “Not only is this a private company, but it has also been stated to the world, to the board and stockholders, that she has no intentions of ever going public,” he said of Ms. Holmes. “The intention, and a strong intention, is that this company is going to be private forever. ” The Medicare investigation is the most pressing threat, and Mr. Boies is largely mum about what Theranos is planning and how the board is reacting. Theranos has been the subject of scathing coverage in The Wall Street Journal, which has relentlessly questioned the reliability and safety of its blood tests, and it is under intense regulatory scrutiny. “The exact focus of what needs to be done keeps changing,” Mr. Boies said. Medicare, concerned about the company’s California operations, has said Theranos could face severe sanctions if the company does not adequately address the deficiencies uncovered last year. Theranos’s California lab certification could be revoked, and Ms. Holmes and the company’s chief operating officer could be barred from the industry for two years. The lab and its procedures have been overhauled, Mr. Boies said. Ms. Holmes has hired new management to run the lab, and because the people who ran it previously did not report directly to her, he said he hoped the agency would not take punitive action against her. The company’s other lab, in Arizona, which performs more traditional tests, continues to draw customers, he noted. But Theranos still faces extraordinary skepticism about whether its main technology works, especially given its history of secretiveness, and Mr. Boies said Theranos was taking steps to address the doubts. He pointed to plans to finally publish its results in   journals and the addition of some   individuals to its scientific advisory board. “We’ve got to reveal much more about the proprietary technology than is desirable,” given the risk of companies’ and countries’ copying what Theranos does, Mr. Boies said. The company’s intellectual property is essentially its main asset, and if the technology works, some observers say, the company could remain a viable business. “I don’t think they’re beyond salvage, beyond redemption,” said Lakshman Ramamurthy, an industry consultant with extensive regulatory experience. But while he did not rule out a sale, Mr. Boies dismissed the idea of handing Theranos over to the highest bidder. “This technology is not going to be sold to somebody who wants to just make more profits from it and charge what is charged today,” he said. And, as Mr. Kovacevich emphasized, Ms. Holmes will ultimately determine what happens next. “You have to ask Ms. Holmes what the steps are,” he said.'"}, "time": 1742628328.4744222}