{"duration": 0.19838261604309082, "input_args": {"text": "'Just before 9:30 p. m. on Sept. 13, the first Twitter post appeared, directing users to an obscure article about a remark Donald J. Trump had made last year that 50 percent of the country did not want to work. Over the next 48 hours, 1, 819 people, seemingly furious that the news media had paid more attention to Hillary Clinton’s assertion that half of Trump supporters fit into a “basket of deplorables,” lashed out at reporters and news outlets. “Dear Media: If you don’t cover this, you’re covering for him, #Trump50percent,” wrote one Twitter user. “@CNN @CNNPolitics have been in bed with #Trump for a year! They refuse to report #TrumpScandals #Trump50percent” wrote another. By the end of the week, the hashtag #Trump50percent had appeared in Twitter timelines more than 30, 000 times. Other liberal Twitter users, some of them with more than a million followers, linked to the article and spread the same complaint the Clinton campaign had made: that a shameful false equivalence was causing the media to   Mr. Trump’s many transgressions and overplay the few it could find on Mrs. Clinton. At first glance, the Clintonian grass roots seemed to have organically sprouted in anger. But closer inspection yielded traces of   that led to the sixth floor of a building in the Flatiron neighborhood of Manhattan. There, surrounded by   tech companies, “Star Wars” posters and   televisions fixed on cable news, Peter Daou sat with his team at a long wooden table last week, pushing the buttons that activate Mrs. Clinton’s outrage machine. Mr. Daou’s operation, called Shareblue, had published the article on Mr. Trump’s comment on its website and created the accompanying hashtag. “They will put that pressure right on the media outlets in a very intense way,” Mr. Daou, the chief executive of Shareblue, said of the Twitter army he had galvanized. “By the thousands. ” In the sprawling Clinton body politic, Shareblue is the finger that wags at the mainstream news media (“R. I. P. Political Journalism ( )”) or pokes at individual reporters. It is a minor appendage, but in an increasingly close race for the presidency, it plays its part. And it is already warming up for the biggest event of the general election so far: the first debate, on Monday night. It has already published a piece calling on moderators to   Mr. Trump on the spot, and will continue through debate night, whipping up support online with the hashtag #DemandFairDebates. Shareblue is owned by David Brock, the onetime Clinton critic who remade himself into a Clinton supporter and architect of a conglomerate of organizations designed, he said, to be the liberal answer to the conservative messaging of Fox News. The Brock network includes his Media Matters for America watchdog website two   “super PACs,” the opposition research outfit American Bridge and the     and   operation Correct the Record and Shareblue, which filled the need, Mr. Brock said, for a progressive outlet that spoke directly to the grass roots and which “was avidly and unabashedly  . ” Shareblue’s    content is exposing what it considers to be news coverage stacked against Mrs. Clinton. Mr. Daou was particularly excited about a project seeking to show that Mrs. Clinton’s email travails had been in the news every day since the story originally broke in March 2015. Often, their editorial direction seems in sync with the Clinton campaign, which has instructed its surrogates to blame news coverage for negative press. “Are they going to hold Hillary to a different standard again?” read one recent “talking points” memo sent by the campaign to its surrogates. That approach became clear this month. On Sept. 1, The Washington Post broke a story about the Donald J. Trump Foundation being fined for improperly donating $25, 000 to Pam Bondi, the attorney general of Florida, around the time that her office was deciding whether to investigate fraud allegations against Trump University. The next day, the Clinton campaign put out a statement contending that while the news media had an unhealthy obsession with the Clinton Foundation, Mr. Trump’s charity had been caught in an “actual    scandal. ” The Clinton campaign’s foreign policy spokesman, Jesse Lehrich, wrote on Twitter: “Awaiting outrage. ” He didn’t have to wait long. Mr. Daou and his website incessantly demanded coverage of the Trump Foundation story. “We just have to start the fire,” Mr. Daou said in an interview last week. Many liberal columnists, Democratic operatives and members of the Media Matters family reached the same conclusion, excoriating news outlets and individuals for grading Mr. Trump “on a curve. ” Whether it truly cleared the air about Mr. Trump’s foundation or merely muddied the water about Mrs. Clinton’s, Mr. Daou took credit for injecting the notion of false equivalence into the social media bloodstream and for forcing some news outlets to adjust their coverage. “  people are now talking about the double standard in coverage,” Mr. Daou said. “We feel we were way ahead of the curve. ” Mr. Brock recruited Mr. Daou to join what was then called Blue Nation Review (it relaunched as Shareblue this month) during a breakfast at the Regency Hotel in New York in November. Mr. Daou grew up in Lebanon and spent the ’90s working in dance music with his first wife as part of a group called The Daou, which put the words of his aunt, the novelist Erica Jong, to music. He then worked as a producer and keyboardist for Björk and other musicians. In the 2000s, Mr. Daou broke into progressive blogging and claimed to have helped found The Huffington Post. His suit accusing the company of denying him appropriate credit and compensation was settled in 2014. He also worked directly in politics, first for John Kerry in 2004 and then for Mrs. Clinton in 2008, leading her digital operation. Beyond creating a boisterous echo chamber, the real metric of success for Shareblue, which Mr. Brock said has a budget of $2 million supplied by his political donors, is getting Mrs. Clinton elected. Mr. Daou’s role is deploying a band of committed, outraged followers to harangue Mrs. Clinton’s opponents. “The pond scum of American politics,” is how Tad Devine, a senior strategist to Senator Bernie Sanders of Vermont, described the website in March for its frequent attacks on Mr. Sanders. Nick Merrill, a spokesman for Mrs. Clinton, viewed Shareblue more as a necessary voice in a world teeming with conservative radio, television and internet outlets that fire up the Republican base. “On the left, frankly, having more of that is not a bad thing,” Mr. Merrill said. Of Mr. Daou, he added, “He has a great sense of what’s moving around and where in the depths of the Twittersphere. ” Just how much Mr. Daou coordinates his efforts with the Clinton campaign is hard to pinpoint. The campaign said there was no formal coordination with Shareblue, and Mr. Daou said he did not take any direction from the campaign. “Now do I communicate with them regularly? I do,” Mr. Daou said, noting that because of his years working for Mrs. Clinton, “half the people on that campaign, if not more, are former colleagues and friends. ” He added that when one of their stories takes off, “I’ll let them know, ‘Hey check out what we just posted, it looks like a good angle. ’” Mr. Brock said his Correct the Record PAC talked to the Clinton campaign. But as for his Shareblue operation, he said: “There are people in the campaign who are aware of what we are doing and who have been encouraging about what we are doing. I wouldn’t go further than that. ” While Mr. Daou, the pianist, can accompany the larger Clinton ensemble, he can also step forward as a soloist when need be. When video of Mrs. Clinton falling ill on Sept. 11 exploded in the news media, the campaign, which had at first said she overheated, apologized for not revealing her diagnosis of pneumonia beforehand. Correct the Record went virtually dark. “It was waiting for guidance from the campaign,” Mr. Brock explained. But Mr. Daou quickly started defending Mrs. Clinton from critics on Twitter (“They should be ashamed”) and that evening posted an article on Shareblue about Mrs. Clinton’s grit, headlined “Hillary Clinton’s feat of strength obliterates months of health conspiracies. ” It was roundly mocked as a blatant example of   spin. But two days later, the Clinton campaign distributed another memo of talking points to its surrogates using her near collapse as an opportunity to talk about her stamina. “To anyone who knows Hillary,” read the first bullet point, “it does not come as much of a surprise that even when she’s under the weather, she would want to power through her normal schedule. ”'"}, "time": 1742563189.6649418}