{"duration": 0.06719541549682617, "input_args": {"text": "'Leave a reply \\nBill Still – Good morning, I’m still reporting on the Daybreak Poll. \\nDonald Trump has rocketed ahead to what the USC Daybreak poll’s creators define as an unstoppable lead of 5.4% this morning. Trump now leads Clinton 47.8% to 42.4% in this national tracking poll. And remember the methodology of this poll – it is a 7-day rolling average with over 3,004 participants. \\nTrump – in a single day – jumped up 9/10s of a percent, while Clinton fell 9/10ths of a percent – a huge one-day swing of 1.8% – and that’s on top of yesterday’s 1.7% swing. In fact, in the last 9 days, Trump has risen 4 full points, while Clinton has lost 2.7% – a 6.7% swing. \\nBoth candidates – Trump on the topside, and Clinton on the bottom side of this chart – are now well outside of the “95% confidence interval”. \\nAccording to the University of Southern California researchers running the ongoing Understanding America Study: “Figures lying outside the gray band mean that we are at least 95% confident that the candidate with the highest percentage will win the popular vote.” \\nBut in addition, the closer such a surge to election day, the more sure of that result we can be. There is now little doubt that Donald Trump will win the popular vote nationwide. \\nDigging down into the numbers shows where the biggest surge lies. Trump now leads in all 3 age categories. With millennials, Trump now leads by 2.6%. Among the middle aged, Trump now leads by a whopping 5.2%. But in the 65 and over group, Trump’s lead has now widened to 9.6%. \\nWhen sorted by education, Trump enjoys a huge 18.1% lead among those with a high school education or less. A landslide is defined as a 10-point lead. \\nAmong those with some college, Trump leads by 12.3%. \\nEven among those with advanced degrees, Trump is closing the once-huge gap. Clinton still leads here in this demographically small group by 13.1%. \\nWhen sorted by income, Clinton still leads among those making $35k or less by 17.8%. \\nHowever, among the middle class – those with household incomes of between $35k and 75k, Trump leads by 15.9%. \\nAmong those making $75k or more, Trump leads by 11.4%. When sorted by ethnicity, Trump’s lead among whites continues to increase, now at 25.9%. \\nThis poll’s one blind spot continues to be among blacks. Although Trump made a .9% gain yesterday, Clinton still dominates with an 82.1% lead. \\nIn the “other ethnicity” group, Trump now leads by 9.2%. \\nAmong Latinos, Clinton still leads by 18.2%, however, Trump did increase by .6% points yesterday, while Clinton fell by .9 percent; a one-and-a-half percent swing. Among the ever-critical female vote, Trump closed the gap yesterday by 1.5%. Clinton’s lead has been cut to 8.5%. \\nAmong men, Trump increased his lead yesterday by a full 2 percentage points. He now leads Crooked Hillary by 19.8% among men – more than double Clinton’s lead with women. \\nI’m still reporting from Washington. Good Day. SF Source Bill Still Nov. 2016 Share this:'"}, "time": 1742563037.8724174}