{"duration": 0.11060857772827148, "input_args": {"text": "'Waking Times \\nAs the U.S. government continues to fight its futile war on drugs , marijuana possession arrests have now become more common than all other crimes combined , according to a new report focused on showing the human toll of criminalizing drug use and published by Human Rights Watch ( HRW.org ). \\nThe war on drugs in the U.S. is a palpable failure. Drug-possession arrests more than doubled between 1979 and 2016. The prison population now includes more than half a million Americans jailed for drug offenses , in comparison to only 41,000 in 1980. Over the last four decades, the war on drugs has restricted individual rights and created an environment of violence and inequality, but it has done almost nothing to solve the problems associated with drug abuse. \\n“Evaluations of specific tactics, such as raids on crack houses and crackdowns, suggest that their effects on drug availability are minimal, decay rapidly, and may displace drug activity to other areas and increase drug-related violence.” ~ 2016 study published in by the National Center for Biotechnology Information, entitled War on Drugs Policing and Police Brutality Shocking Rise in Cannabis Possession Arrests \\nDespite the ongoing war, cannabis usage is becoming more acceptable and even legal, proving that opinion and policy vary wildly. In fact, a study conducted by the National Institute on Alcohol Abuse and Alcoholism found that the number of Americans who use marijuana has doubled from 2001-02 to 2012-13. The 2014 National Survey on Drug Use and Health estimates that over 22 million Americans use the plant either for medical purposes and/or recreationally. \\nAmericans have become accepting of cannabis, even though it is still illegal under federal U.S. law. Over the last decade, immense amount of research has shown the medical benefits of the cannabis plant . Legalization of the plant in several U.S. states has demonstrated that it is not a threat to public safety. It seems that the most dangerous aspect of cannabis use is the possibility of police confrontation, arrest and incarceration. \\nRegardless of the trends showing an increase in cannabis popularity, the report by HRW.org found that policing of marijuana-possession laws continues to be quite aggressive when compared to the enforcement of other laws. \\n“Despite shifting public opinion, in 2015, nearly half of all drug possession arrests (over 574,000) were for marijuana possession. By comparison, there were 505,681 arrests for violent crimes (which the FBI defines as murder, non-negligent manslaughter, rape, robbery, and aggravated assault). This means that police made more arrests for simple marijuana possession than for all violent crimes combined.” \\nThrough the evaluation of court data for the state of Texas, HRW discovered that many of those prosecuted “were prosecuted for small quantities of drugs—in some cases, fractions of a gram—that were clearly for personal use.” Other sources reveal that 8 in 10 drug arrests in 2013 were for drug possession rather than sale and manufacturing. Drug Crimes and Prisons \\nEvery 25 seconds, someone in the U.S. is arrested for drug use or possession. More than one of nine arrests by state law enforcement are for drug possession, amounting to more than 1.25 million arrests per year. \\nAs a result of this aggressive enforcement of drug laws, on any given day at least 137,000 people sit in local and state jails on drug possession charges awaiting their day in court. Drug possession offenders in general will soon make up 25% of the prison population. Because federal law mandates a sentence of life without parole for anyone whose third strike is a federal crime (such as drug possession and, in many states, marijuana possession), 10 times as many third-strikers are serving time for drug possession as a second-degree murder. \\nIt’s clear that people from all demographics wish to have safe access to cannabis , both for recreational purposes as well as for a growing list of medical benefits. While access opens up in U.S. states where legalization continues to gain steam, safe access to cannabis is still an issue for many, which is why people are creating businesses like Buy Weed Online Canada , and until the government fully decriminalizes cannabis, our prison system, court system and police forces will continue to be bogged down with the persecution and prosecution of non-violent offenders. Read more articles by Vic Bishop . About the Author \\nVic Bishop is a staff writer for WakingTimes.com and OffgridOutpost.com Survival Tips blog. He is an observer of people, animals, nature, and he loves to ponder the connection and relationship between them all. A believer in always striving to becoming self-sufficient and free from the matrix, please track him down on Facebook . Like Waking Times on Facebook . Follow Waking Times on Twitter . \\nThis article ( Arrests for Cannabis Possession Outnumber Arrests for All Violent Crimes Combined ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Vic Bishop and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. Please contact WakingTimes@gmail.com for more info. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742562044.0526347}