{"duration": 0.03278946876525879, "input_args": {"text": "'Videos Hillary Clinton Aide Advised: ‘Dump all those emails’ On Private Server “Not to sound like Lanny, but we are going to have to dump all those emails so better to do so sooner than later,” says the March 2015 message, labeled as from John Podesta to Cheryl Mills and apparently referencing longtime Clinton confidant Lanny Davis. | November 2, 2016 Be Sociable, Share! \\nHillary Clinton ‘s campaign chairman advised a longtime aide that they were “going to have to dump all those emails” on the day that a report revealed Clinton’s exclusive use of a private email server while secretary of State, according to stolen emails released Tuesday by WikiLeaks. \\n“Not to sound like Lanny, but we are going to have to dump all those emails so better to do so sooner than later,” says the March 2015 message, labeled as from John Podesta to Cheryl Mills and apparently referencing longtime Clinton confidant Lanny Davis. “Think you just got your new nick name,” Mills replied. \\nClinton campaign officials have refused to confirm the authenticity of the emails, which are believed to have been stolen from Podesta’s personal account by Russian government hackers. Previously released emails have revealed some advisers were frustrated that Clinton hadn’t made information about the server public sooner. “Why didn’t they get this stuff out like 18 months ago? So crazy,” policy adviser Neera Tanden wrote to Podesta that same evening, March 2, 2015. “Unbelievable,” Podesta replied. Other messages show the Clinton campaign caught unprepared for the New York Times story , published weeks before Clinton launched her bid for the White House. Also on March 2, Podesta asked future campaign manager Robby Mook if he had seen it coming . “Did you have any idea of the depth of this story?” Podesta asked Mook in an email late on the evening. “Nope,” Mook responded after 1 a.m. that night. “We brought up the existence of emails in reserach [sic] this summer but were told that everything was taken care of.” In other messages, Clinton’s aides spent hours debating language for Clinton to use defending and eventually apologizing for her actions. This article originally appeared on The Hill. Be Sociable, Share!'"}, "time": 1742564409.6026638}