{"duration": 0.03189444541931152, "input_args": {"text": "'Share This \\nAs Donald Trump continues his campaign, it seems that a few keen eyes picked up on something rather peculiar. Taking place as Trump arrived in Ohio, something downright “insane” was spotted in the crowd – and many are saying it proves that Hillary Clinton is done for good. \\nThe incident actually took place back in September but is most recently proving true on a daily basis now. According to reports, Trump showed up in Columbus, Ohio earlier in his campaign, and when he opened his limo door, something incredible was waiting for him . Donald Trump draws massive crowd in Columbus, Ohio (Source: Liberty Writers News ) \\nAs Liberty Writers News puts it, “the crowd went insane for America’s 45 th president.” It goes without saying that there is a huge enthusiasm difference between the two candidates for president and their supporters. Although this was proven true back in September, it’s being demonstrated even more so today. Donald Trump draws massive crowd in Columbus, Ohio (Source: Liberty Writers News ) Donald Trump draws massive crowd in Columbus, Ohio (Source: Liberty Writers News ) \\nIn fact, BizPac Review reports that Hillary’s running mate, Tim Kaine, can’t even muster up a crowd with triple digits – heck, even 50 people is hard to come by. Furthermore, Kaine is having to cancel events as only 30 people are showing up. Tim Kaine had 2 cancel another Florida rally because only about 30 people ( press & security included) showed up! #Priceless #Trump2016 \\n— Amy Mek (@AmyMek) October 27, 2016 Waiting for Vice Presidential candidate, Tim Kaine to speak at #Lorain Admiral King school. pic.twitter.com/A74ve1eKkF \\n— Mary Springowski (@maryspring) October 27, 2016 \\nOf course, his staff is blaming it on “scheduling issues,” but it’s happened more than once at this point, proving a pattern here. Mike Pence, on the other hand, is having the exact opposite problem as the venues he’s speaking at don’t have room for the thousands of people who are showing up. \\n— Linda Suhler, Ph.D. (@LindaSuhler) October 27, 2016 \\nBetween the FBI reopening her email investigation and WikiLeaks founder Julian Assange promising that his next leak will land her in prison , things aren’t looking good for Hillary. Put that in combination with the fact that Trump and Pence are bringing people in by the thousands, where Hillary and her running mate can’t seem to manage bringing in supporters by mere the hundreds – well, it’s safe to say that this goose is just about cooked. \\nHillary Clinton is done, and this nation is going to make that perfectly clear come Election Day. We the People are done with the politically corrupt government elites that have poisoned our country. I can’t wait to see the look on Hillary’s face when she realizes that she’s going to prison for a very long time, just like Trump promised.'"}, "time": 1742628591.7299018}