{"duration": 0.06347322463989258, "input_args": {"text": "\"Donald Trump & Hillary Clinton: Two Figures in a Derailed World What is the Way Out? By Dieter Duhm / terranovavoice.tamera.org \\nDonald Trump and Hillary Clinton – truly two representatives of a derailed world. Both hold up a mirror to our current society. One spoke for the establishment; the other for people's rage against the establishment. Rage prevailed, yet both represent the exact same system, just from two different angles. The fact that Trump won, taking into account all the outrageous things he said, shows what kind of turbulent revolt arises among large parts of the American population. It is the revolt of people who feel betrayed by an unfathomable system and who call for, as so often already, a strong leader. Thus the unrestrained demagogue gets on stage, calling for restoring the nation, for security and unity, and the common fight against all those who could disturb this unity. Sorry to say, w hat comes together here is something we have already once seen in the collective insanity under Hitler. But things will not go so far this time because there is neither a concept nor a political vision behind all these “tremendous” words. Through the grotesque victory of this megalomaniac player, a movement for freedom could arise in the United States, one which strives for new objectives beyond the existing parties. In addition, positive counter-powers rise up across the globe – these are the ones that will set the course of things on a new track. Both ways, the one of Trump and Clinton alike, aim toward a deeply inhumane world; both generate unspeakably many victims. The emotional substratum Donald Trump activates is directed against all those of another race, religion or sexual identity. This is self-protection by way of exterminating others. Hillary Clinton pursues the policies of the political class, of calculated globalization, in collaboration with the international dictatorship of financial power, generating victims in all parts of the planet that are subdued by this globalization. This is the self-protection of the dominating system through market strategies and military force. Donald Trump has alleviated the souls of his audience by granting them permission to think the thoughts they anyway do. It has been a fundamental feature throughout human history that people come to power who are able to mobilize the subliminal “mass psychology of fascism” as Wilhelm Reich called it – this hunger for unity under a powerful ruler. This story has been repeating for millennia and will continue repeating until we put an end to it. Humanity needs a new life order with a new vision of leadership and unity. What is meant is not external leadership, but leadership coming from within . It is not the unity proclaimed through banners and election slogans, but the inner unity of people who coexist in trust to assist fellow beings and serve the Earth. We refer to the unity in the natural connectedness with the great family of life – in the self-evident empathy, love and solidarity that immediately come into being when we reach the basis of trust, mutual acceptance and truth. This is the foundation for a life in love, power and health. Another kind of society will arise from this fundament, no longer based on power and capital, but on the truth within human relations. And if our estimate is right, this society will be compatible with the higher order of life, which we call the “Sacred Matrix.” This movement will give rise to many new centers, birthplaces of a new planetary community. We need to get there, otherwise we will content ourselves with substitutive solutions that regularly lead to catastrophes. As humanity we have long worked with these substitutions. We have set up ideological, political, religious and moral systems intending to secure a fulfilled existence for ourselves. Yet now we are collectively facing the edge of abyss. The era of these substitutions has come to an end. Fascism was a substitution; capitalism was a substitution; the ideas of power and obedience, of autocracy and democracy were a substitution; the Catholic Church was a substitution; the mystic paths all the way to Nirvana were a substitution. The Chosen People, all the smaller and bigger empires, all gods were a substitution; and renouncing all gods and teaching materialistic nihilism was a substitution too. Today, we need another solution on a different social, interpersonal, ethical and spiritual foundation. We need a solution based on truth among real people, above all between the genders, man and woman, because this is the realm that has been most terribly destroyed by the violence of patriarchal history. In other words, if we want to end the worldwide injustice and the unspeakable suffering of humanity and the animal kingdom, we need to base the entire civilization of this planet on another foundation. Neither Trump nor Clinton will assist us here; what is required is a fundamental correction of our civilization and a new vision for inhabiting our planet. I know this sounds out of touch with reality, but it is inevitable and can clearly be done. If there is the vision of a humane existence on Earth it can also be realized. All people are made of the same matter. It is not just fantasy when we see the ONE, which is the same in everyone, within ourselves and all fellow citizens of this planet. We all come from the same universe, are reached by the same sun and have all come to this world from between the enormous legs of our Great Mother. We all share the same longing for love and peace. We all are happy about the friendliness of our alleged opponents – and we all would be able to make this friendliness our guiding orientation, could we let go of old, negative forces. For example in Colombia –it is clear that there are the same souls, the same young people, the same hopes and goals in both conflicting parties. It is clear that there is a potential friendship behind this cruel hostility. Isn't it also clear that there is an original love even behind the fiercest relationship crises, that which has once brought the two together? Likewise, there is another possibility of existence behind the entire massacre of this world, which we recognize when we are not entangled in conflicts. We can understand what love is, how to follow its rules and what a global community of love could look like. We can also see the social, ecological and ethical preconditions needed to make it happen. These preconditions give rise to a new concept of coexistence among people, as well as between people and animals, people and nature. This is what we call the “ Global Healing Biotopes Project .” Slowly spreading, the project works to create a new global field stronger than all violence. We do not tolerate any cruelty on this planet. In the name of love for all that lives. Further Reading:\""}, "time": 1742628486.938721}