{"duration": 0.05767536163330078, "input_args": {"text": "'by Outis Philalithopoulos The following series is a work of fiction. Any resemblance of characters in the story to people in real life is entirely intentional, and their dialogue is typically cut, with only insignificant modifications, from books, articles, or interviews. When substantive remarks derive from a source not mentioned explicitly in the text, the source is described at the end of the episode in which they appear. By Outis Philalithopoulos, who met an untimely end five years ago, and now “wears the chains he forged in life” as an economist. I had imagined that this new existence would be like working for the NSA, with official clearance to watch over my loved ones and enemies. But I continue to see through a glass darkly – mostly only confused impressions, and recently a sense of impending doom lying heavily upon the United States. Once in a while, though, clearer images slip through the veil, like letters washing up on the woeful banks of the Acheron. So it was that I found myself perusing a February article by philosopher John Holbo in the influential blog Crooked Timber. He began with a question that got my attention: What is liberalism? What is conservatism? Then he noted: If you are interested in getting answers to these questions, you (probably) want the answers to do two things for you: 1) Give you the best possible version of this thing. What is the best liberalism/conservatism could be, as political philosophy? […] 2) Give you insight into what’s going on in real politics. What constructions of liberalism/conservatism, as philosophies, give me the best handle on what’s going on in the US election cycle, say? Holbo pointed out that #1 and #2 are not the same thing, and trying to do both at once creates confusion. For example: Suppose you think the best, most defensible philosophical conservatism would be G.A. Cohen’s conservatism . Intellectually, that might be rather fine, yet useless for getting a grip on real U.S. politics. You can’t make sense of the Republican candidate line-up by measuring relative degrees of departure from what [Cohen] thinks conservatism ought to be. True, I thought to myself, conservatives don’t measure up to their ideals. Fortunately, describing people like me – liberals, progressives, the Left, whatever you want to call us – is easier. Corey Robin gave a straightforward definition in his 2011 The Reactionary Mind , Since the modern era began, men and women in subordinate positions have marched against their superiors in the state, church, workplace, and other hierarchical institutions. They have gathered under different banners – the labor movement, feminism, abolition, socialism – and shouted different slogans: freedom, equality, rights, democracy, revolution. Then I had a disturbing thought. Isn’t Robin’s definition a textbook example of #1? It is “the best, most defensible” idea of what liberalism could be: a patchwork of causes throughout history that in retrospect I want to identify with, while leaving on the cutting floor everything else that has called itself “Left.” What would happen if someone were to define us progressives by #2? By our actions and our actual effects upon the world, and not by our language or our ideals? Was that where Holbo was going? I braced myself as I continued to read the article. But I reached the end, and after flipping through the 207 comments by what seemed to be mostly university faculty, I relaxed. While considerable effort had gone into attempts to define the unattractive, non-ideal reality of conservativism, the only new definition of liberalism offered was: To me being left wing means not killing (lots of brown) people, being critical of power and authority and trying not to be a (selfish) dick. Sounded good to me. Clearly most of these well-educated people agreed that Robin’s definition was basically correct, with real life only slightly messier than the ideal. Maybe for liberalism, #1 and #2 are more or less the same thing. Then again, I thought with a twinge of unease, they are mostly liberals like me. Maybe I should seek what might be painful truths. I had an idea about where to start looking, and I flitted up a shadowy hill, where there huddled a bespectacled spirit with hunched shoulders. “Allan,” I began. Allan Bloom squinted at me. “Do I have the pleasure of meeting a fellow elitist?” “What?” I asked, startled. “No, I was hoping you could tell me why liberalism is evil.” He chuckled. “Don’t hold back,” I implored him. “I can handle the truth.” “A corrosive ideology has taken over the American mind,” he began. “By now, almost everyone, especially in the universities, believes that truth is relative. They treat this relativity as a moral postulate, as the condition of a free society. To them, the real danger is people who think they are right, and the solution is not to correct mistakes and really become right – it is not to think you are right at all. The Left of today does not believe in itself or in what it does.” “Thank you, sir,” I said, bowing, and went to ponder his words. It was exciting to think of myself in Bloom’s terms. Was I one molecule of a transhistorical acid that was eating away at all truth in the world? I thought about myself and my Left-oriented friends. Did we believe that sexual repression, the Iraq War, overt and subtle racism, anti-immigrant bias, and gender stereotyping were absolutely wrong? Yes. Did we believe in ourselves? Of course. With relief but also a hint of disappointment, I concluded that even the brilliant Bloom had not succeeded in painting a convincing portrait of what, if anything, was evil about liberalism. Back to Robin’s definition, I thought to myself, and there things would have ended if not for… “OUTIS!” bellowed a voice. I whirled around. “Polyphemus,” I said uncomfortably. “I thought we had agreed that I had nothing to do with that burning stake…” “NO!” interrupted the Cyclops. “I come here for YOU, not the accursed son of Laertes. I have a QUESTION!” “Yes?” I asked. “You have thought a little about your identy, o No-Name, and what it means to be a liberal. But what if being a liberal means neither being the leaven of the world, nor yetbeing a dark agent of the Apocalypse?” “What do you mean?” I said quickly. “What if 21st century liberal culture is simply one society that happens to be influential in this time and place? A culture in which idealism and grandeur are mixed with wretchedness and compromises and contradiction? One that does not stand astride history but has been produced by history and has not escaped it? What if, in a word, it is a culture like other cultures?” “Ridiculous!” I burst out. “You’re saying there’s no difference between us and the ancient Greeks, who had slavery? Or the 19th century British Empire, whose missionaries laid waste to India? Or the Eskimos, who had rigidly defined sex roles that oppressed women?” “Console yourself with these facile mantras,” sneered Polyphemus. “ You are the only one of us to speak of sameness.” “Of course I understand that liberal culture of today has a history,” I muttered. “Of course I don’t think we are some sort of elect, better than all other cultures that have other lived, except of course…” I stopped. Polyphemus laughed. “You are a droll one, doughty Outis,” he remarked. “If Bloom had made a more persuasive case that progressivism were a monstrous contagion destroying all that is good, you could have accepted it. What you cannot accept is that it might be human.” “I can accept anything!” I snapped. “Really?” The Cyclops looked at me skeptically. I nodded. “Very well,” Polyphemus. “If you truly wish it, a path will be provided that you can tread, seeking whatever truth you may. You will be haunted tonight by three spirits.” * * * In the next episode, Outis meets a Spirit whom he fails to recognize, and travels back into the past of liberalism. Sources : The second Crooked Timber definition is from comment 71 to the Holbo article linked above. Allan Bloom’s long paragraph is made up of sentences from The Closing of the American Mind . 0 0 0 0 0 0'"}, "time": 1742628574.550757}