{"duration": 0.13677215576171875, "input_args": {"text": "'Here are the week’s top stories, and a look ahead. 1. Southern Florida is ramping up mosquito control measures, with health authorities on the alert for new areas of Zika transmission. Pregnant women are being warned to avoid two neighborhoods in the Miami area where the virus is spreading, including the tourist haven of South Beach. The virus can attack fetal brain cells, but appears to pose little risk to most adults. Here is what we know and don’t know about the cases in southern Florida. _____ 2. Southern Louisiana began the long recovery from vast floods set off by days of staggering rains. The stricken area is believed to encompass a population of some 280, 000 people and 110, 000 homes, more than a third of which have been damaged. Many may be uninsured. Here are before and after photographs of the flooding. President Obama, who returns from a family vacation on Martha’s Vineyard today, heads to the area on Tuesday. _____ 3. What an Olympics! At least 19 new world records, and odd, hilarious and unexpected moments beyond the competition, amplified by social media. Foremost: the swimmer Ryan Lochte’s discredited account of a fracas that witnesses and video revealed was actually a bout of drunken vandalism. There are only a few more competitions before the closing ceremony (8 p. m. Eastern, NBC, reflecting a   tape delay). The gymnast Simone Biles will carry the U. S. flag. Our full coverage is here. _____ 4. It’s a tumultuous time in the presidential race. A judge’s ruling ensured that questions about Hillary Clinton’s email while she was secretary of state will continue to shadow her. Bill Clinton announced that, if Mrs. Clinton wins in November, the Clinton Foundation will cease accepting the large foreign donations that have long powered its philanthropy  —   and raised questions about governmental favoritism. A series of celebrities appear with or hold   to help Mrs. Clinton’s bid this week, including Cher today, Leonardo DiCaprio on Tuesday and the Apple C. E. O. Tim Cook on Wednesday. _____ 5. Donald Trump’s campaign made a final break with efforts to mute his aggressive style, placing the reins in the hands of a firebrand from the “ ”  Breitbart News. That move, coming amid signs of weakening support from Mr. Trump’s base of   white men, added to Republican fears of a “death spiral” that could cost their party congressional control. A Times investigation found that the Trump Organization has more than $600 million in debt and depends on financial backers Mr. Trump has publicly attacked, like Goldman Sachs. _____ 6. Was the N. S. A. hacked? The publication of what appeared to be some of its secret computer code suggested that someone had access for a period that ended when the agency overhauled security in the wake of Edward Snowden’s revelations of its domestic surveillance. Mr. Snowden, pictured above on a video link from exile in Russia last year, offered his own best guess: The code might be a warning from Russia that a harsh U. S. response to the hacking of Democratic officials’ emails could unleash revelations of U. S. interventions in other countries’ elections. _____ 7. New light was shed on two major points of dispute. Officials at the State Department admitted that they delayed making a $400 million payment to Iran for several hours in January “to retain maximum leverage” during the release of three American prisoners. They continued to reject Republican assertions that the payment was ransom. And the United Nations acknowledged a role in Haiti’s cholera epidemic, ending years of official disregard for scientific findings that Nepalese peacekeepers allowed their infected feces to enter the country’s most important river system, above, in 2010. The U. N. is asking member nations to fund the recovery. _____ 8. The future, or at least one part of it, is closer than we thought. Uber will begin testing   cars in Pittsburgh within weeks. Reassuringly, the cars will have “backup drivers. ” But Ford announced that it would be   driverless cars  —   with no steering wheel, gas pedal or brake  —   for commercial operation in a   service by 2021. If someone had announced this five years ago, the chief executive said, “they would have been called crazy or nuts or both. ” _____ 9. Russia is escalating its military intervention in Syria again. Cruise missiles launched from Mediterranean warships and bombers supplied at an Iranian base joined Syrian government forces in trying to turn back insurgents near Aleppo. A screengrab of this boy, who was rescued from the wreckage of one bombing run, quickly became a symbol of civilian despair. _____ 10. Europe’s disquiet over a   influx of refugees, many of them Muslim, found new expression in battles over whether women’s head and body coverings represent the “enslavement of women” and a “cloth cage. ” A series of French mayors banned the   burkini swimsuit from beaches, and Germany’s governing bloc called for a ban on face veils while driving or in school. Some see the moves as efforts to police a narrow vision of national identity. _____ 11. Frank Ocean surprised the music world. The experimental RB singer released his   second album, the   “Blonde,” on Apple Music. And a “visual album. ” And, at   stores in New York, London, Los Angeles and Chicago, an ambitious art magazine, “Boys Don’t Cry. ” By the way, our critic writes that some music shoppers prefer Bandcamp, an online music site known for its underground and punk collections and equitable treatment of artists. Check out our music critics’ podcast: They discuss how some white rappers  —   think   Mike Stud, Lil Dicky and Post Malone  —   are reconfiguring race in  . _____ 12. Finally, happy 100th birthday, National Park Service. Events all week  —   including a huge gathering at Yellowstone on the official anniversary, Thursday  —   honor the government agency charged with preserving more than 84 million acres in 50 states “for the enjoyment of future generations. ” Just think how many species that applies to. Have a great week. _____ Your Weekend Briefing is published Sundays at 6 a. m. Eastern. And don’t miss Your Morning Briefing, weekdays at 6 a. m. Eastern, and Your Evening Briefing, weeknights at 6 p. m. Eastern. Want to look back? Here’s Friday’s Evening Briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561817.4150121}