{"duration": 0.15845036506652832, "input_args": {"text": "'In an interview broadcast Friday on Breitbart News Daily, author Ann Coulter talked about the violent demonstrations   have employed to shut down speech they dislike, notably Milo Yiannopoulos of Breitbart News at UC Berkeley this week. [SiriusXM host Alex Marlow contended that the mainstream media’s irresponsible use of terms like “fascist” and “white nationalist” for speakers who are not of the Left has laid the groundwork for violence against them.  “It is the rise of a genuinely violent fascist movement,” Coulter said of these   gangs. “It would be as if the Nazis went around complaining about how the Jews were attacking them and oppressing them. That’s basically what we have going on now. ” She recalled how violent protesters shut down a Trump rally in Chicago during the 2016 presidential campaign. “It was amazing to me how many families with kids, and wives, and daughters, they continued to go out to see Trump. It is like my college speeches, something I’ve been doing for a long time. You know, you’ll have 20 speeches that are fine, and then suddenly, BAM! the violent mobs show up. You never know when it’s going to happen, so you have to be prepared all the time,” she said. “But Americans still did come out. I think that was intended to reduce Trump’s crowds, and make it look like he was the one creating the violence. All of this, just for someone who says, ‘We have to take care of Americans first.’ That’s what they’re so upset about, Alex,” Coulter declared, returning to an earlier point about how the U. S. Congress is attempting to cut back on the cost of major programs for Americans, such as Social Security and Medicare, at the same time   advocates insist on importing even more dependents. “We can’t afford that. We can’t afford this. We have to raise the retirement age. No, stop! We gave at the office!” she exclaimed. Coulter agreed wholeheartedly with President Trump’s threat to “withdraw all federal funding from Berkeley” if the college administration refuses to deal with violence. “This is a genuine threat to democracy when people can’t engage in the first of the Bill of Rights, the very first one that’s mentioned: freedom of speech,” she warned. “This has been a burgeoning movement, particularly on our college campuses, for a long time. ”  “In a calm, reflective moment, I think he should do the same thing with any colleges that have speech codes or need special ‘free speech zones’ where students   professors are disciplined for engaging in First Amendment speech,” she advised.  “This has absolutely been done before,” she noted. “The IRS has been used to say, ‘Sorry. If you’re collecting student aid, you can’t attend these colleges. We’re not sending any student aid to these colleges who don’t abide by  …    ’  —   and those were often kind of silly ‘principles’ being enforced, like Bob Jones University, that’s sort of a very hardcore fundamentalist Christian college. I’m a Christian. It has some beliefs  —   or it used to I don’t know if they still do  —   but one was from the Tower of Babel. They wouldn’t allow interracial dating. ”  “They had blacks, they had whites, and it was mostly a    country back then  —   in fact, scholarships for black students  —   but whites couldn’t date black students. Blacks couldn’t date white students,” she explained. “And I ought to add, because I looked this up at the time, there was very little dating of any sort. If you went on a date at Bob Jones, you had to have a chaperone with you. Anyway, there was no racial animus to this it hit both races equally. ”  “But for that, the IRS came down like a ton of bricks on Bob Jones University. No federal aid through student scholarships, as I recall. A student who had student aid could not attend that college. And now, we have a genuine fascist, violent fascist, movement rising up, and there’s not only no punishment, but taxpayers are paying for this? Oh, no, no, no. Second to immigration, the next biggest problem in this country is the universities and public schools,” she said. Coulter said this climate of hatred and violent repression of dissent comes from the university administrations.  “These are not spontaneous movements,” she scoffed. “I described in my book Demonic on groupthink and mob behavior, that these are particularly lickspittle students that want to please the professor. And they know damned well their professors are opposed to everything Ann Coulter says and everything Milo says. It’s just like presenting a polished apple to the teacher. ‘Oh, teacher, here: I brought you a gift today! I went and protested Ann Coulter! ’” “At the risk of being snobbish, but telling you what the truth is, it doesn’t tend to happen at the Ivy League schools,” she observed. “Berkeley is weird.   …     The worst ones are the Jesuit colleges and the community colleges. I mean, at Harvard and Yale  —   and I’ve spoken at both places many times  —   Wellesley, Smith, my own alma mater Cornell, the kids are too  —   they want to challenge you intellectually. They’d be embarrassed to throw something. ”  “Though I do think there is a new movement kind of sweeping through here,” she added, “at some of these schools, we’d be organized. We’d be ready to go. I’d give the speech. They could stand up at the mics. I’d take questions until they had collapsed from exhaustion. And usually at the tougher schools to get into, that’s how they want to be. They want to ask you a question and outsmart you. It’s when it is a    who doesn’t have the power of speech or logic, and just throws food  —   so it would tend to be the lesser colleges. ”  “The other thing is, when we would be prepared and have college Republicans and large men prepared to throw out any hecklers, sometimes the members of the administration would stop people  —   our people, who had rented the room had paid for me to come speak. Someone comes to disrupt and start heckling, they try to remove the heckler, and an administrator  —   this happened at Syracuse University  —   some dean of students stepped forward and said, ‘You can’t remove the heckler because you’re interfering with his free speech rights! ’” Coulter said with astonishment. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562065.1997275}