{"duration": 0.054280757904052734, "input_args": {"text": "'Politics FBI Director James Comey (AFP file photo) \\nHillary Clinton’s top advisers blame FBI Director James Comey for the Democrat’s bruising loss to President-elect Donald Trump. \\nNavin Nayak, the head of the Clinton campaign’s opinion research division, sent an email to senior staffers Thursday, outlining “early signals” as to why the candidate lost the November 8 presidential election, POLITICO reported on Friday. \\n“We believe that we lost this election in the last week,” said Nayak’s email, which was published by POLITICO. “ Comey’s letter in the last 11 days of the election both helped depress our turnout and also drove away some of our critical support among college-educated white voters — particularly in the suburbs.” \\n“We also think Comey’s 2nd letter, which was intended to absolve Sec. Clinton, actually helped to bolster Trump’s turnout,” he continued. \\nThe letter also highlighted several other challenges the Clinton team faced throughout the campaign, including a desire for change after two terms by a Democratic president and the reluctance of some Americans to vote for a female candidate. Hillary Clinton makes a concession speech after being defeated by Donald Trump in New York on November 9, 2016. (Photo by AFP) \\nDespite those challenges, Nayak said, Clinton was on course to win until the last week, when “everything changed\" and the momentum began to shift in favor of Trump. \\n“Voters who decided in the last week broke for Trump by a larger margin (42-47). These numbers were even more exaggerated in the key battleground states,” he said. \\nThe FBI director angered Democrats late in October by announcing in a letter to Congress that the agency had uncovered new emails connected to the Clinton email investigation. \\nJust over a week later, Comey notified Congress that Clinton would not face charges over the newly discovered messages. \\nNayak said Comey’s letters encouraged Trump supporters and depressed the turnout for Clinton on Election Day. \\n“There is no question that a week from Election Day, Sec. Clinton was poised for a historic win. In the end, less than 110K votes out of tens of millions cast on Election Day made the difference in this race,” he wrote. \\n“In the end,” Nayak concluded, “late breaking developments in the race proved one hurdle too many for us to overcome.” \\nClinton had been leading Trump throughout the campaign in most of the polls except for the last week of the election when she lost ground to Trump.'"}, "time": 1742564303.1889868}