{"duration": 0.06491947174072266, "input_args": {"text": "'Thursday night, Democrats did what party people do in Brooklyn. They rented out a big space on the waterfront and held a rave. Along with a few rants. The CNN debate between Hillary Clinton and Bernie Sanders was not, substantively, much different from their previous showdowns. But man, was it louder. Mrs. Clinton and Mr. Sanders, heading into Tuesday’s   New York primary, went at each other hard, sniping, snapping and jockeying for attention like starving customers trying to order the pastrami at Katz’s. It was a   Midtown traffic jam of a debate. The charges were sharp  —   she questioned his command of facts, he condemned her “racist” use of the term “ ” in defense of a 1990s crime bill but the hectoring was sharper. At one point, Wolf Blitzer, one of the moderators, broke in to scold the pair: “If you’re both screaming at each other, the viewers won’t be able to hear either of you. ” Did the candidates realize they had microphones? Any undecided New York voters didn’t need cable to tune in they could probably just open a window. But credit where it’s due: The true cause of political junkies’ lingering headache Friday morning was the audience. Good lord, that audience. It sounded like someone told it the primary was going to be decided by   . From the   audience members made themselves a factor, or an obstacle. The crowd cheered, booed, kibitzed. Someone shouted “Free Palestine!” during an answer on Israel. Mr. Sanders’s section broke into “Bernie! Bernie!” repeatedly, like concert fans calling for an encore. In fairness, we’ve heard competitive hooting at plenty of Republican debates this cycle. And while Mrs. Clinton and Mr. Sanders were especially feisty Thursday, no one defended the proportions of any of their body parts. It would be reasonable if their campaigns had concluded that, if you want to be heard in 2016, you had better bring your own amplifier. Indeed, if this campaign’s debates in both parties have made one persuasive argument, it is this: We should ban debate audiences. They’re tent revivals of the converted, full of staffers and supporters whose huzzahs and boos may be heartfelt but are meaningless all the same. A debate audience’s only real purpose is as a prop. It reflects the candidates like a vanity mirror, howling at the applause lines and hissing at uncomfortable arguments, cueing us how to feel. For the networks, it pumps up the excitement and drama that keep viewers coming back. Debate audiences are the laugh tracks of politics. In the middle of the din, Mr. Blitzer, CNN’s Dana Bash and Errol Louis of the NY1 news channel did a good job following up and pointing out when candidates evaded answering. By this stage in the campaign, though, most of those questions and answers are familiar. Early on, Mr. Blitzer brought up Mr. Sanders’s attacks on Mrs. Clinton’s qualifications later, Ms. Bash raised Mrs. Clinton’s   questioning of Mr. Sanders’s bona fides as a Democrat. In between, it was sparring over banks, guns, the Middle East, once more and with feeling. It’s not as though there are no other topics to cover. Late in the debate (and during the debate from her Twitter account) Mrs. Clinton chided the panel for not asking “one question about a woman’s right to make her own decisions about reproductive health care. ” (Scoring points off the moderators is another tactic we’re more used to seeing at Republican debates.) Much had been made in advance of the location: not just New York City but Brooklyn, where Mr. Sanders was born and where the former New York senator Mrs. Clinton has campaign headquarters. In the end, though, the most New York thing about the debate was the noise. It was set on the same red, white and blue,   stage that you could have dropped in Atlanta or Indianapolis or Sacramento. There is only one place now: Debateland. We have been living there since last summer, and it feels as if we will never get out. But we will: If the blaring of the candidates and their   rooting sections said anything, it was that we’re approaching the finish of the primary and they know it. Did this debate move the needle? Absolutely. It moved the needle all the way into the red.'"}, "time": 1742562203.0848796}