{"duration": 0.06116032600402832, "input_args": {"text": "'When “Buffy the Vampire Slayer,” one of television’s most influential series, first turned up 20 years ago this month, it didn’t just attract viewers, it also unleashed an army of   writers creating their own adventures about Buffy Summers, her friends Willow and Xander, and the vampires Spike and Angel, to name a few. Fan fiction takes characters from an established book series, TV show, movie franchise or other cultural cornerstone and riffs on them. Some of it is highbrow stuff by highbrow authors  —   what is Tom Stoppard’s “Rosencranz and Guildenstern Are Dead” but Shakespeare fanfic? Mostly, though, the authors are amateurs with an overwhelming affection for the characters and a yearning to feel a stronger connection to them. For some, it’s a fun hobby for others, it’s therapeutic  —   they might write under pseudonyms and use their stories to explore issues and problems they are facing. Fan fiction existed before the internet in fanzines and other formats  —   the original “Star Trek” spawned lots of it  —   but giving practitioners the ability to communicate with one another via computer really changed the game. The “Buffy” universe was among the early adopters the show’s stars and writers (and its creator, Joss Whedon) would sometimes visit and post on the online forums that sprang up. The result was a rich, sometimes loopy body of work that included subgenres devoted to specific characters, crossover stories (there are dozens mixing “Buffy” and “Bones,” the Fox series that the “Buffy” actor David Boreanaz later starred in) and more. In commemoration of the 20th anniversary, we asked readers to share a piece of their fan fiction, and tell us why they write about “Buffy. ” Here are some of their edited responses. BY PHOENIX, 17 Read the full work here. When did you start watching “Buffy”? I started watching “Buffy” last May, which sounds ridiculous, since I’ve become such a big fan since. Why did you start writing fan fiction? My first ever was for “Harry Potter” it was sort of a Voldemort back story. Since I was 13, it was utterly terrible. Now I write fan fiction both out of a desire to expand on fictional worlds and out of a desire to correct fictional worlds, in a sense. For example, I didn’t like some parts of Seasons 6 and 7 of “Buffy,” so I wrote a few pieces where Seasons 6 and 7 went the way I wanted. What prompted you to write this piece? In Season 4 of “Buffy,” Willow, a character who has previously only demonstrated interest in boys, falls in love with a girl. I love that arc, but I wanted to explore whether Willow had been attracted to girls before then. In my mind, the way that this would be demonstrated would be through a high school crush on Buffy. I wanted to write about a young Willow discovering who she was. One of the best things about fan fiction is that, since a lot of writers are LGBT+ it can have really good representation of what it is to be LGBT+ that is hard to find in other places. This is part of my contribution to that. BY DAVID FROOM, 32 Mr. Froom writes about   in Sunnydale, Calif. the fictional setting of “Buffy. ” Read the blog here. When did you start watching “Buffy”? I started watching “Buffy” during its fifth season, after years of scoffing at it (I was 15) only to instantly become obsessed. In those Stone Age days, I had to buy   DVDs to catch up on the old seasons, and I gladly burned through entire paychecks from my   job to see everything I’d missed. Why did you start writing fan fiction? The Sunnydale Press is the only fan fiction I’ve ever written. I’d always been intrigued by the idea that Sunnydale successfully covered up supernatural  —   and deadly  —   goings on for decades the idea for the blog was born out of this curiosity. I try to keep with the mood of the show and the late ’90s, giving great weight to the fears of “the occult” and “gangs on PCP. ” It amuses me to no end that   events would get boiled down to blurbs, while common events might turn into     news. BY TERRI MEEKER, 56 Read the full work here. When did you start watching “Buffy”? I didn’t watch “Buffy” until 2008. We were hit hard in the economic crash and got rid of all the nonessentials, including cable TV. We had to keep the internet on so that my husband could look for work in the   software industry, so we signed up for a free Hulu account. I’d always heard about “Buffy,” but was busy raising my kids and didn’t really watch TV. When I saw a clever YouTube spoof poking at the lack of feminism in “Twilight,” called “Buffy vs Edward,” I was intrigued. At first, I wasn’t thrilled with “Buffy,” but I kept watching. By Season 3, I became obsessed. Why did you start writing fan fiction? I’d finished all the episodes of the show, but I needed more. Fan fiction was a way to do that. As an   teacher, I wanted to see more of Spike’s back story, so I began to write a story in which “Buffy”   to the 1880s. The Victorian era is a fascinating time period, and I knew some of their ideas about sexuality would make for some terrific situations. What prompted you to write this piece? I was very worried about the 2016 election. The “Buffy” community is all about empowering women, and I knew they were equally concerned. Since Buffy’s creator, Joss Whedon, had invested a million dollars into a     effort, I wanted to write a little reminder for fans on Election Day. BY SARAH   47 Ms.   writes fiction that retells   episodes via haiku. She calls them Spaiku. Read the full work here. When did you start watching “Buffy”? In 2008. Having seen the regrettable theatrical version when it was first released, I steered clear of the show for as long as possible. When I read that Susanna Clarke counts the writing team of “Buffy” among her top five favorite writers (along with slackers like, y’know, Dickens) I had to watch. And watch. And rewatch. Buffy’s is a hero’s journey for the ages, and it has been a wonderful show to watch again and again with my daughter as she navigates adolescence. What prompted you to write   narratives? My desire to interact with other people who love “Buffy” eventually led me to a very supportive online community at LiveJournal. I read (and commented on) tons of fan fiction, made fabulous new friends, and wished that I could contribute something as well. Alas, the plotting requirements of long fiction are completely beyond me. I thought, “Well, maybe if I made something very small . .. ”'"}, "time": 1742628585.5921922}