{"duration": 0.28069138526916504, "input_args": {"text": "'By Michael Shrimpton on October 30, 2016 Some Battleship Myths Busted \\nThe comments on last week’s column (Aberfan – Disaster Or Attack?) threw up some unexpected comments about battleships, and the causes of World War I. As you can tell, it was a wide-ranging discussion! It also showed that that a number of myths about battleships, not to mention the causes of World War I, are still prevalent. First however, some comments on the exciting presidential race. Trump or Clinton? \\nI’m still predicting a win for Trump. The polls have tightened, which is not good news for Hillary, and the first straws in the wind suggesting a landslide for Trump have appeared. Some polls are still showing a lead for the Democrat, but the most reliable ones seem to be showing Trumpy ahead by 1 or 2 points. \\nA delighted Washington Post predicted this week that Trumpy has “next to zero” chance of winning. I’m not sure that’s true even if you accept the polls as accurate. The polls are suggesting a tight race. However pollsters have a history of getting it wrong when it comes to races involving conservatives. The margin of error in favor of liberal positions differs from one pollster to another, but between 2.5 and 5% seems about right. \\nSince the last two Republican candidates were scarcely conservatives, the reasonably good performance of most polling organisations in 2008 and 2012 has to be viewed with reserve. Polling performance breaks down when you have serious conservative opposition. They can be still an indicator, however, of momentum. The FBI (Photo credit: Hurricane Bianca) \\nI have heard of October surprises , indeed the Democrats sprang one over Bimbogate, or at least gave it the good old college try. It might have been better choosing bimbos who had actually met the Republican candidate, or at least met him without witnesses present, but there it is. \\nHaving the FBI act with integrity when the suspect is the Democratic candidate for president and polling day is less than two weeks away wasn’t so much an October surprise as an October shock, no offense to the Fibbies intended. \\nAssuming – just assuming – that this wasn’t part of a deal between Mr O and Mr T, whereby Mr T agreed to keep quiet about Mr O’s Kenyan/Zanzibari origins in exchange for Mr O backing off the FBI, the timing of the FBI’s move was extraordinary. They are saying that it was due to fresh evidence coming into their possession, so it can’t have been that. \\nIt is just possible that the boys in the Hoover building (that’s Hoover as in J Edgar, BTW, not as in the vacuum cleaner) were not aware of the large sums of money slushing, sorry finding, its way to the wife of their Deputy Director from the Clintons. It’s a bit of a mystery, and I don’t pretend to know the answer. Astonishing as it may sound, with respect, it may even be that the FBI have finally started to act with integrity and good faith. If so, that would be a positive development, although don’t expect the CIA to follow suit! If they did, the world really will have turned upside down. The CIA and Wikipedia WWI \\nPeople sometimes ask me why I write for VeteransToday, given the lousy pay (!) The short answer is that they are good people and don’t interfere with my freedom of expression. VT is also something of an intelligence clearing house, however. I hope readers learn something from my weekly columns (that’s why I write ‘em), but I also learn things. \\nOne of the things I learnt this week via VT is that the CIA have a thing going with Wikipedia. I thought I was dealing with operatives – it was strange that so-called volunteer editors responded within minutes to any attempt by me to balance the Wikipedia attack piece on me. Turns out the CIA have an active interest in about 10% of Wiki sites, including mine. \\nGiven that Director Brennan is an enemy of mine, with Jesuit connections, I helped expose the role of the Jesuit Order in providing the pretext for World War I and the Agency are heavily penetrated by my bitter enemies the DVD, via the Correa/COREA Group in Frankfurt, that would make sense. \\nThe next installment in my WikiWar should be mediation. Goodness knows who they’ll suggest as a mediator – Angela Merkel probably, or the President of the European Commission. The mediator will definitely be driving a Volkswagen. The Naval Race Rear Admiral Sir Christoper Cradock \\nI’m inter alia an intelligence historian , so it’s nice to turn to an historical topic. It is incredibly important to get history right – otherwise we just repeat the same mistakes. \\nA number of commenters last week seemed to be laboring under the delusion, no offense intended, that World War I was started by the naval race between the British and German Empires. This nonsensical view, widely propagated since 1918 by German Intelligence and their allies, is still recycled on the BBC and by liberal faculty members, i.e. just about all of them. \\nWorld War I was not started by the British Admiralty, nor by accident. It was started by the Germans, who set up the assassination of the Archduke Franz Ferdinand and his lovely wife Sophie on June 28th 1914. The German army was already mobilising, implementing a war plan drawn up years before. \\nThe build-up of the Imperial German Navy had similarly been underway for years, for purely offensive purposes. The German Navy was not designed to protect German interests abroad – its capital ships lacked the range and the habitability for that. It was aimed at bringing the Royal Navy’s Atlantic and Channel Fleets to battle in the North Sea (the famous Grand Fleet was only formed on the outbreak of war). \\nThere is no way the German Navy could have matched the rapid, hemispheric deployment of a battlecruiser squadron to the farthest reaches of the South Atlantic in 1914, e.g., after the destruction of a weak British squadron under Rear-Admiral Sir Christopher Cradock at the Battle of Coronel. Vice-Admiral Sturdee’s great victory in the Battle of the Falkland Islands was of course made possible by the Naval Intelligence Department. \\nThe boys had spotted that the First Sea Lord, von Battenberg, was a German spy and had deliberately refused to reinforce Cradock’s squadron. Von Battenberg was left in place and fed false position reports – no wonder the sight of the fighting tops of a British battlecruiser squadron in Port Stanley harbor so rattled the Hun commander, Graf von Spee, who was the runner-up in the battle which followed. The true position was stated millennia ago by the Roman general Vegetius: si vis pacem, para bellum. If you wan’t peace, prepare for war. Great Britain did not encourage the First World War by taking the limited steps that she did to prepare for it. \\nWe needed more battleships and battlecruisers, not fewer. Sadly, the Liberal government decided to encourage German aggression by holding back spending on the Royal Navy. Had we been stronger, the Hun would not dare have invaded Belgium and Luxembourg in a flanking attack on the French army. Next Myth HMS Barham \\nThe next myth propagated last week was that battleships were vulnerable to U-Boats. The truth is that the only British battleships sunk by U-Boat in both world wars, HMS Barham and HMS Royal Oak, were betrayed. \\nRoyal Oak was sunk because the First Sea Lord Sir Dudley Pound was being blackmailed by Jerry and agreed to hold up the badly-needed block-ships requested for Scapa Flow by the C-in-C Home Fleet. \\nHad the block-ships been in place, as requested, Gunther Prien wouldn’t have got within five miles of Royal Oak. It is not even clear that the dear old Barham was actually sunk in November 1941 by U-331. It is more likely that her magazines were detonated by a radio-controlled IED set off by a German agent on the battleship ahead, which happened to have a cameraman ready to film the sinking. \\nAll battleships after the turbine-powered Dreadnought were too fast for submarines, which until the advent of the first true submarine, the German Type XXI, had limited underwater speed and endurance. Forget the headline figure for underwater speed – at top speed a U-Boat’s batteries would be drained quickly. This made achieving a firing solution difficult. Battleships were also usually too well screened by destroyers. \\nThey were such difficult targets that in practice only a U-Boat lying in wait could torpedo them. Then there was the difficulty in sinking them. Older battleships could indeed be sunk by a single submarine, even a single torpedo, ditto battleships whose design was held back by the absurd limitations in the Washington Treaty, designed to make the next world war winnable for the Bad Guys. \\nIt is, however, intellectually dishonest to compare the latest subs with older battleships, or battleships, like the King George V class, designed to artificial limits. In World War II modern battleships designed without reference to the Washington Treaty, such as the wonderful Iowa class, incorporated excellent anti-torpedo protection. A single Jap sub, e.g. would have had trouble hitting an Iowa class fast battleship with enough torpedoes to sink her. \\nThe King George V classic were a classic illustration of the dangers posed by the Washington Treaty. To save weight their outer prop-shafts weren’t armored, a weakness which proved fatal when HMS Prince of Wales was struck by a Japanese aerial torpedo in December 1941. In practice battleships were much less vulnerable to torpedo attack than any other type of warship. That is why all Japanese submarine attacks on American battleships in World War II failed, indeed the Japs only ever managed to sink American battleships in harbor in peacetime, and even then they only actually sank two. The other battleships damaged at Pearl Harbor were repaired, modernised and went on to avenge their sisters. Third Myth HMS Repulse \\nThe vulnerability of battleships to air attack in World War II has also been greatly overstated. They were of course invulnerable to air attack in World War I, as no aircraft could carry an armor-piercing bomb heavy enough to sink them. No German or Italian battleship was sunk at sea by airpower in the whole of the war. \\nNo American battleship was sunk at sea in either war, period. Only one British battleship, HMS Prince of Wales, was sunk by airpower in World War II, and she was betrayed. HMS Indomitable, the carrier designated as her escort, had been run aground, on Pound’s orders, whilst working up out of Kingston Harbour in Jamaica. \\nAttacking as they did outside fighter range, without combat equipment such self-sealing tanks, the Jap bombers would have been very vulnerable to Indomitable’s cannon-equipped fighters. \\nAs I explain in Spyhunter, Force Z’s course had been betrayed to the Japanese in Saigon, via radio, by the German spy Rear-Admiral Palliser. Had Palliser not betrayed the British squadron it’s unlikely that the Japs would have found them. They had poor air reconnaissance, limited fuel reserves and could not just stooge around the South China Sea trying to find them. \\nHMS Repulse was a battlecruiser, not a battleship. Unlike her sister Renown, she had not been modernised. In particular, she lacked Renown’s modern 4.5” Dual Purpose (DP) battery, much more effective in the AA role than Prince of Wales’s DP fit. Bismarck firing at HMS Hood \\nHMS Hood , blown-up during the course of the Battle of the Denmark Strait, was also a battlecruiser and, like Repulse, she had not been modernised. The Chamberlain government and the Treasury denied the Admiralty the funds for her much-needed modernisation, precisely in order to make her easier for Jerry to sink. \\nAs I explain in Spyhunter, it is very doubtful that Hood was actually sunk by KMS Bismarck and much more likely that she was blown up by an IED in either a 4” magazine, leading to secondary detonation of a main magazine, or a main magazine. \\nNone of the broadsides fired by either Bismarck or her accompanying heavy cruiser Prinz Eugen is a good candidate for the alleged fatal shot. Prinz Eugen’s main battery was only 8”/60 caliber – her 270 lb shells were too small to have penetrated Hood’s heavy belt armor. \\nFor decades, we have been favored with nonsense from pro-Germans about Hood’s main deck armor being much weaker than Bismarck’s (the true figures are 3” over the magazines for Hood and 4.7” for Bismarck) and Bismarck sinking her with plunging fire at long range. Bismarck, however, was photographed firing at Hood from the Prinz Eugen. As you can see from the photo, Bismarck’s main battery is nowhere near maximum elevation. \\nThe Hun-loving editors of Wikipedia, BTW, still cannot bring themselves to acknowledge that the Bismarck was sunk by the Royal Navy. She was in fact finished off by torpedoes from the heavy cruiser HMS Dorsetshire, sinking shortly after the last torpedo hit, which Wikipedia would have us believe was a strange coincidence. HMS King George V \\nAs I have mentioned, the King George V class , of which Prince of Wales was a member, suffered from design limitations imposed by the Washington Treaty. They also suffered from several design flaws, which would not have been repeated in later classes and partly flowed from the lack of cash given to the Admiralty in the 1930s. \\nThey sacrificed AA firepower for spotter aircraft. Whilst the planes were well-protected in an armored hangar, it would have been better to rely on more powerful spotter/recon aircraft flown from escorting carriers. \\nThe 5.25” DP secondary armament was an excellent anti-destroyer weapon, probably the best ever deployed on a battleship, but had too poor a rate of fire (around 12-16 rounds per minute) to be an effective weapon against aircraft. The dedicated AA gun, the multiple 2-pounder ‘pom-pom’, was the best in the world when it came into service in the late 1920s, but had been overtaken by the 40-mil Bofors. The mounts were not tri-axially stabilized and the class lacked tachymetric AA fire-control. These specific weaknesses however afford no grounds for saying that battleships generally were unduly vulnerable to aircraft. So far to the contrary, they were better able to stand up to bombs and torpedoes than carriers, were more stable gun platforms, had better firing arcs (this was particularly true of the US Navy – the Iowa class had superb firing arcs for their secondary and AA armament, e.g., whereas the firing arcs on the Essex-class carriers were limited) and better fire-control. Unsurprisingly, US fast carrier task forces in the Pacific used battleships to protect carriers against aircraft. HMS Inflexible \\nOf the five British capital ships sunk during World War II, two were unmodernised battlecruisers, two were probably sunk by IEDs and all five were betrayed in one way, shape or form. Without the assistance of the Abwehr, including interference by political assets in Number 10, the Cabinet Office and the Treasury with their design or modernisation, probably none of them would have been sunk at all. \\nThe US Navy had the right idea. What was needed was balanced all-arms task forces, combining battlewagons, carriers, cruisers and destroyers. Admiral Henderson of the Royal Navy had in fact come up with the idea of fast carrier task forces protected by capital ships in the Mediterranean in the 1930s, but the Royal Navy lacked enough fast battleships and carriers to really make it work until 1945, with the British Pacific Fleet \\nOh yes, we were in the Pacific alright , although the lack of defense expenditure and serious planning for war by pro-German weanies in Downing St before the war meant that it took three years for us to get there. Apart that is from our fine armored carrier HMS Victorious, which served briefly in the Pacific in 1943, flying USN squadrons, an episode which would make a fine war movie, if a movie-maker could be found with the guts to make it. \\nPresident Reagan also had the right idea in reactivating the Iowa class in the 80s. Had the Royal Navy not been forced to scrap HMS Vanguard, our last battleship, by the German asset Harold Macmillan, it is doubtful that General Galtieri would even have started the war. HMS Vanguard Falklands War \\nThe very thought of that elegant and powerful fast battleship , virtually immune from the Exocet sea-skimming missiles (her belt armor was too strong for an Exocet to penetrate) emerging from the gloom of the South Atlantic to pulverise the Argentine Fleet or smash up Argentine forces ashore, would have given the Argies the willies. Vanguard’s deck armor, BTW, would have been too strong for any bomb the Argentine Air Force could carry. \\nNo ship in the Argentine Navy could have remained operational after a single accurate broadside from HMS Vanguard, and she had fully-synthetic fire-control, i.e. could land her main battery guns on target whilst maneuvering. She was a formidable surface combatant. This Week’s Movie Review: Jack Reacher: Never Go Back (2016, dir. Edward Zwick) \\nThis movie is huge fun . The first Jack Reacher movie, also starring Tom Cruise, was also huge fun, with the Bad Guys getting whacked all over the place. It’s always nice to see dirty cops getting their come-uppance! We could do with Jack Reacher in Thames Valley. No jury would convict. \\nUnusually for a sequel, this movie is as good as the original. If anything, it’s even better. Tom Cruise is excellent as the lead, although it was a disappointment for me that Robert Duvall was not retained. He’s one of my all-time favorite actors. Robert Knepper, as General Harkness, provides strong support, however, as does Cobie Smulders, who I think we’ll be seeing again. \\nThe plot, based around bent military contractors, is more believable than most of the anti-military, anti-American rubbish emerging from liberal Hollywood, and the heroes come from the military. The movie moves at a cracking pace, and you are kept in suspense until the end about whether Jack is a father or not. I’m not going to spoil it for you by revealing the plot! It’s well worth going to see.'"}, "time": 1742564620.2989132}