{"duration": 0.047563791275024414, "input_args": {"text": "'At the MARS 2017 tech conference, Amazon CEO Jeff Bezos hopped into Hankook Mirae Technology’s massive mechanized suit. [@JeffBezos ”Why do I feel so much like #sigourneyweaver ?” @amazon #MARS2017 #openpodbaydoors 😬 pic. twitter.   —   Caleb Harper (@calebgrowsfood) March 20, 2017,   Bezos asked aloud why he “felt so much like Sigourney Weaver” in reference to Weaver’s character Ripley piloting a mechanized suit in Aliens as he manipulated the giant metal arms for an enthusiastic crowd on Sunday. I just got to pilot an awesome (and huge) robot thanks to Hankook Mirae Technology. Nice! #MARS2017 pic. twitter.   —   Jeff Bezos (@JeffBezos) March 20, 2017,  The “ ” mecha was created by South Korea’s Hankook Mirae Technology. It stands at a hulking 14 feet tall, and weighs 1. 6 tons at a minimum, according to their minimalist website. Visually, it most resembles the mechanized suits from James Cameron’s fluorescent blue cat lady epic, Avatar. The massive suit was designed in part by Vitaly Bulgarov, who worked with Boston Dynamics on their own bipedal robots. Bulgarov also signed on with Industrial Light  Magic to help with designs for Michael Bay’s Transformers reboot.    interface and arm motion test! ” ” large manned robot project for which I had a pleasure to make the design. Very fortunate to be part of the incredible Hankook Mirae Technology team. (previously posted as Korea Future Technology since ”Hankook” means ”South Korea” in Korean Language and ”Mirae” means ”Future”)team. More info at ” color:#c9c8cd  :   :14px  :17px  :0  :8px overflow:hidden padding:8px 0 7px  :center  :ellipsis  :nowrap”>A post shared by Vitaly Bulgarov (@vitalybulgarov) on Dec 15, 2016 at 3:12pm PST,  Hankook Mirae Chairman Yang   called the   “the world’s first manned bipedal robot,” saying that it was “built to work in extreme hazardous areas where humans cannot go [unprotected]. ” He added that they are taking “baby steps” to a point where they can allow the mech to “move freely. ” The   is expected to be commercially available by the end of 2017, and will only set you back a cool $8. 3 million. It might sound like a lot, but there is no cost too great in the inevitable lunar battle against   and the flying robot army pouring from his weird  . Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562300.2976346}