{"duration": 0.20148777961730957, "input_args": {"text": "'United Nations Finally Acknowledges US-Backed Rebels in Syria are Murdering Civilians Home / #Solutions / When Good People Share Bad Things — Here’s Why You Need to Fact Check Before You Click Share When Good People Share Bad Things — Here’s Why You Need to Fact Check Before You Click Share Claire Bernish November 3, 2016 2 Comments \\nDisinformation. Misinformation. Propaganda. Outright lies. Purposeful distractions. Misleading bias. All tools of the government and close ally, corporate media, to keep the public unwise to the depth and breadth of imperialistic actions taking place around the world — and ever-encroaching surveillance and police states inside the borders of the United States. \\nPerhaps you have been fortunate enough to begin pulling back the curtain on the inner workings of the government — the tandem dealings by politicians, regardless of party affiliation — to exploit the public in as many ways possible for the profits of elite politicians, corporations, industries, and banks. \\nAnd what frequently starts as a trickle of paradigm-shifting new information, quickly forces open the floodgates — as the realization things aren’t at all as they hammered into your psyche for years through State-sponsored indoctrination of public education. It can be overwhelming — and you likely want to ‘wake up’ others to this reality — but there are pitfalls in doing so, marked by the same tactics the State employed to fool you in the first place. \\nDisinformation. Misinformation. Propaganda. Outright lies. Purposeful distractions. Misleading bias. \\nSound familiar? \\nWith the sheer amplitude and magnitude of corruption exposed on a daily basis in the lead-up to the November 8th presidential election, alerting friends and family could seem more imperative than ever — but the aforementioned traps should and must be avoided at all costs — even when it comes from outlets posing as an answer to the mainstream. Let it be noted, that is not to decry credible, consistent independent and alternative media outlets — but it’s crucial to employ critical thinking and a bit of research to separate those with integrity from the mendacious and misleading. \\nSpreading misinformation, false reports, and surreptitious propaganda does nothing to further the cause of truth — and, in fact, serves more to harm the credibility of legitimate reports in opposition to the dominant State narrative. Social media, however, has provided plenty of dry tinder for faulty info to spread like wildfire — either by the haplessly unaware, or by those with motives to ensure it quickly disseminates to cast doubt in the public mind. \\nBut there are a number of ways to divine authentic, genuine information from that meant to distract, divide, discredit, and delegitimize. \\nMerriam-Webster’s Unabridged Dictionary defines ‘disinformation’ as “false information deliberately and often covertly spread (as by the planting of rumors) in order to influence public opinion or obscure the truth.” \\nSo common is disinformation, those familiar with it will destroy said item with facts before it gains traction in public forums — but rumors being rumors, sometimes take on a life of their own. Checking whether or not a new report has any basis is usually as easy as a web search for secondary reports from known credible sources parroting the same claim — indeed, one surefire clue a report might be false, or even satire, is a lack of hyperlinks to other sources. \\nMisinformation, on the other hand, can present a trickier issue in that it can have at least a kernel of truth at its core — but the packaging, which can include blatant lies or opinion misconstrued as fact, intends to mislead. \\nPolitical and elections polls tilt public opinion, and — when convincing — can even dissuade people from voting on candidates and issues they might otherwise deem critical. In fact, selectively cherry-picking a sampling pool — or crafting targeted questions — will dramatically and sometimes ridiculously fit results to glean a desired answer. Zero Hedge, for example, caught ABC News and the Washington Post in the act over the weekend, after their joint poll showed Hillary Clinton with a double-digit lead over Donald Trump — despite increasingly heated controversy from John Podesta’s leaked emails. \\nEvery government on the planet employs propaganda to garner favor for policy and legislation — and more subtly to inculcate the citizenry into hollow feelings of nationalism, which serves little purpose other than fueling separation and pride based on the arbitrary geopolitical happenstance of one’s birth. Although the most cunning propaganda is virtually imperceptible, this year’s narrative of Russian aggression couldn’t be more patently obvious if it tried. \\nHowever, that’s not to say the same idea of a Russian threat hasn’t also crept into reports from supposed ‘analysts,’ as well. A number of generally credible outlets, rather than presenting analysis with open-ended outcomes, have taken the government’s cue to warn of impending nuclear war at Pres. Vladimir Putin’s behest — despite a lack of evidence to back the claim. Fearmongering, it should be noted, is a common tool of propagandists worldwide. \\nOutright lies and deliberate distractions go hand-in-hand when it comes to parsing truth from fiction — and an unfortunately growing number of tabloid-esque outlets peddle absurd lies as truth in the interest of getting clicks. Notably, differentiating tabloid sites from credible alternative sources can be the most difficult to the newly ‘awakening’ truth-seeker. \\nA fine line exists between attention-grabbing headlines topping truthful articles and head-turning captions screaming wholescale lies. Indeed, considering the populace-at-large now champions an attention span less than that of a goldfish, convincing readers to venture past the first two sentences of a legitimate article can be the most frustrating facet of the job of independent media journalist. Scammers and profit-seekers capitalize on the fact most will share a link without ever bothering to view its contents — no matter if the work constitutes so much garbage. \\nAlthough it isn’t an absolute guarantee, a wise axiom to follow stands the test of time: If it sounds too good or too absurd to be true, it probably is. If you’re still uncertain, ask someone you trust, seek a second and third and fourth source, and, above all, do a little digging — after all, the Internet puts the world at everyone’s fingertips. \\nJournalism is not meant to be devoid of bias — on the contrary, good journalism persuades. However, bias can be employed in the extreme, easily bordering on misinformation. A topic proffered by FOX News and MSNBC will never be reported the same way — each has clear political bias and an agenda to push. Bias doesn’t have to be quite so flagrant to be effective. \\nSo-called political pundits are a common tool used by corporate media to subtly infuse bias by appealing to the public trust of a putative ‘expert’ in the particular topic of discussion — and pundits are usually just political or party insiders, ex-government employees, and others with a vested interest in ensuring public opinion sways in a certain direction. Also, pundits and experts nearly always receive compensation for their input. \\nA stellar recent example of a biased opinion presented as expert assessment came from former assistant FBI director James Kallstrom — a known devotee of presidential candidate Donald Trump — who castigated the Clintons for being a “crime family.” While that point is debatable, the fact Kallstrom appeared as a former official of the government connoted insider knowledge — an appeal to his ostensible authority — and his diatribe went viral nearly immediately for its incendiary nature. It isn’t so much that his opinion didn’t deserve to be shared, but that it needed to be considered in light of his political desires — his characterization of the Clintons directly feeds Kallstrom’s desire for Trump to win the White House. \\nWhile each of these topics could and have filled tomes, hopefully this provides a gentle reminder to be wary of believing everything you read. As any journalist worth their salt will say, if you don’t believe what’s written, research it on your own. Follow links provided. Seek new information. Open your mind to new ideas and be willing to part with indoctrinated thoughts that no longer serve you. \\nBut don’t be fooled — and it behooves all of us not to spread the sort of faulty information that discredits the general movement to expose the government’s innumerable lies. Share Google + The Kali Whrite Boi \\nWell, the evidence is substantial: The Clintons are a crime family. And in regard to bias: any degree of journalistic bias is a complete lack of journalistic integrity. imho Hawkeyerightsmart \\nThanks for the article. I try to do my best. I also ask that you make sure the pipeline protesters are legit. That looks suspiciously like the scenario that unfolded in Canada when protesters paid by interests in the US and elsewhere crippled our industry. Neil Young even whored himself and made an appearance, took a check and was never heard from again. Tides foundation funded by the Rockefellers for example. I think you may be backing the wrong side as the natives protesters up here have no honor. They are lying whores. Social Trending'"}, "time": 1742562063.3789883}