{"duration": 0.24609017372131348, "input_args": {"text": "'© Photo: AJ Schroetlin Indigenous Americans protest the Columbus Day celebration in Denver, Colorado, on October 9, 2007. \\nWhat myths have most of us been taught about Native Americans? In a new book, All the Real Indians Died Off And 20 Other Myths About Native Americans , Roxanne Dunbar-Ortiz and Dina Gilio-Whitaker show how generations of people in the United States have been misinformed about Indigenous Americans as part of a colonial agenda of erasure. \\nThe following is the Truthout interview with Roxanne Dunbar-Ortiz and Dina Gilio-Whitaker. \\nMark Karlin: I was profoundly enlightened when I interviewed you about your last book The Indigenous Peoples’ History of the United States . Your new book, written with Dina Gilio-Whitaker debunks 21 myths about Native Americans. Before we get to the book, I want to start and ask you a truly global question, how is the Indigenous rights movement becoming increasingly transnational? \\nRoxanne Dunbar-Ortiz: The international Indigenous movement is becoming increasingly visible, but it has been developing since the early 1920s, when the Haudenosaunee (six Nations of the Iroquois federation) sent a representative, Cayuga leader Deskaheh, to Geneva, Switzerland, in 1923 to address the League of Nations. From the 1930s onwards, Muskogee Creek, Cherokee and Hopi representatives built ties with Indigenous Peoples in Central Mexico, where their peoples had originated. \\nIn 1940, The Interamerican Indian Convention was signed by the governments of the hemisphere, and the Interamerican Indian Institute was founded, which still exists today. In the 1950s, the newly established National Congress of American Indians in the United States and other Native activists actively sought ties with Indigenous Peoples in other parts of the world. But it was in 1974, with the founding of the International Indian Treaty Council by the militant American Indian Movement, and of the World Council of Indigenous Peoples, that formal relations with the United Nations began. \\nThe United Nations Sub-Commission on Racism and Racial Discrimination had taken up a study of Indigenous Peoples globally in 1972 and in 1977, the first international Indigenous Peoples conference was held at the United Nations – the delegates of Indigenous representatives organized by the International Indian Treaty Council. After four years of arduous Indigenous lobbying, a UN Working Group on the Rights of Indigenous Peoples was established and met for the first time in 1982, and thereafter annually for 25 years, resulting in massive documentation and testimonies, as well as official reports, and in the 2007 UN General Assembly resolution, the Declaration on the Rights of Indigenous Peoples . \\nEarly in the new millennium, a UN Special Rapporteur on the Rights of Indigenous Peoples and the UN Permanent Forum on Indigenous Issues were established, the latter meeting for two weeks annually at UN headquarters in New York, bringing together thousands of Indigenous Peoples’ representatives. In addition to the institutional transnational relationships are the daily exchange of communications among Indigenous Peoples on local, regional and continental issues and emergencies, particularly effective during the past 20 years of increasing Internet capacity. \\nWhat are the roles of erasure and disappearance in creating settler colonialist myth about Native Americans that then justify suppression and theft of land? \\nDina Gilio-Whitaker: Disappearance of the Indigenous population was necessary for the settler project to inherit the land that they believed was rightfully theirs, by divine providence. Very early on, for example, when the Mayflower immigrants of the Plymouth colony were starving and trying to figure out how to feed themselves, we know from primary documents that some of them found villages that had been emptied out due to a disease epidemic a year or two earlier, or in some cases, were still inhabited. They raided food stores and even graves, and saw it as an expression of God’s favor on them, having gotten rid of the Indians so that they could now inhabit the land. \\nBy the 1840s this belief crystalized into the concept of manifest destiny. Then we begin to see the emergence of anthropology and what we now call scientific racism – a science-based ideology that all non-white people are inferior to white Europeans . This Social Darwinism finds its way into Supreme Court decisions about Native lands and nations, which then become the basis for laws and policies that systematically justify extermination, forced assimilation and endless other depredations – that all have at their root the goal of transferring Native lands into white ownership. This is why we say that settler colonialism is a structure that eliminates Natives so that settlers can replace them. And it is this structure that still frames the body of federal Indian law that governs what happens to Native nations and individuals today, all guided by the impulse to eliminate. \\nYou have a chapter on the myth that the US did not engage in a policy of genocide toward Native Americans. Given that’s a loaded term that denialists love to split hairs about, wouldn’t it just be easier to say the European conquerors maintained a policy of trying to make Native Americans vanish? \\nDunbar-Ortiz: The importance of the term “genocide” for many Indigenous Peoples is that it is more than a term or an accusation; it is a word created in the wake of the Shoah in Europe to describe what happens when a people are targeted by a government for extermination, as were the Jews of Europe, and which is the term used in the most important international law related to concerned Indigenous Peoples, as the only international human rights law that pertains specifically to collectivities of people rather than individuals. \\nWe have researched and studied only US policies and actions related to Indigenous peoples in North America, but think that the analysis of the US applies to several of the republics of the Americas, as well as Australia and New Zealand, that imposed settler-colonialism on the Indigenous Peoples, seeking to displace and disappear Indigenous communities and nations to replace them with European settlers. \\nAs the late Australian anthropologist Patrick Wolfe wrote, “The question of genocide is never far from discussions of settler colonialism.” The history of the United States is a history of settler colonialism. The objective of US authorities was to terminate their existence as peoples – not as random individuals. This is the very definition of modern genocide. The term “genocide” is often incorrectly assumed to mean extreme examples of mass murder associated with war, with the death of millions of individuals, as, for instance in Cambodia. Although clearly the Holocaust was the most extreme of all genocides, the bar set by the Nazis is not the bar required to be considered genocide. Most importantly, genocide does not have to be complete to be considered genocide. Cases of genocide carried out as policy may be found in historical documents as well as in the oral histories of Indigenous communities. An example from 1873 is typical, with General William T. Sherman writing, \\n“We must act with vindictive earnestness against the Sioux, even to their extermination, men, women and children … during an assault, the soldiers cannot pause to distinguish between male and female, or even discriminate as to age.” \\nWe talked about this in our last interview. Many historical accounts tried to make it appear that presidents and Congress viewed themselves as white saviors to Native Americans. Was that any different than the attitude of European colonialism that decimated vast populations in Africa, the Middle East and the Far East, for example? \\nDunbar-Ortiz: I think there’s a great deal of similarity in this respect among various European and Euroamerican colonialisms, with attempts to justify the capitalist plunder that drove and drives the past 500 years of European and United States imperialism. One of the myths we include in the present book is on the presumed benevolence of US presidents towards Native Americans (Myth 9). \\nWhat is different is the goal of elimination of the Native in the four sites of Anglo settler-colonialism in the United States, Canada, New Zealand and Australia. Whether it was an expression of the “laws of nature,” that is, the survival of the fittest as explicitly expressed by Andrew Jackson and the embrace of eugenics by Theodore Roosevelt during their presidencies, or in popular culture by Walt Whitman and other writers, or the disappearance through forced assimilation, such as the Indian boarding schools’ goal to “kill the Indian and save the man,” the stamping out and total disappearance of the Native was predominant. In the present, the way benevolence is expressed is in conceptualizing the Native as a historical relic; US people have to be constantly reminded that there are still existent Indigenous peoples and communities in North America, but whether left or right, recent immigrant or descendants of settlers, even descendants of enslaved Africans, the Native presence is not a consideration in the day to day life of individuals and municipal, state and national governments. \\nSince we are coming close to this holiday, can you expand on dispelling the myth that Thanksgiving proves the Indians welcomed the pilgrims? \\nGilio-Whitaker: The story, as it is commonly conveyed, is a feel-good tale of a deep friendship between Pilgrims and Indians, signified by a formal, ostensibly prearranged engagement where they all sit down together to give thanks for a bountiful harvest. \\nThere is not enough evidence to surmise anything of the sort; what there is suggests that it was a random, rather accidental occurrence in which the Wampanoag were investigating the sound of gunfire coming from the English settlement, and then were invited to stay for dinner. The actual relationship between the Wampanoag and the pilgrims can best be described as a political alliance based on desperation and the mutual need for survival. Both were extremely vulnerable. \\nThe pilgrims needed the Indians to teach them how to live on the land, and extreme population decline due to disease had weakened the Wampanoag militarily. A treaty had been negotiated in an atmosphere of mistrust and tension. Within two years, it had completely broken down but then, after about 40 years of relative peace, by 1675 full-scale war had broken out between them, becoming what we know now as King Philip’s War, what’s been called the bloodiest war ever fought on American soil. \\nThis is too recent for your book, but I think your opinion on the activism surrounding the Dakota Access pipeline and the expanding support for the Standing Rock Sioux Tribe should be explored. Do you think it is a threshold point for a new stage of defiant, stalwart activism on behalf of reclaiming sovereignty over Indigenous lands and water? \\nGilio-Whitaker: It remains to be seen, but at the moment it does seem that way. What we have to compare it to in this country is the Alcatraz occupation from 1969-1971, the Trail of Broken Treaties in 1972 and Wounded Knee in 1973. \\nThose movements, like this one, were youth-led (although women are much more out front these days). Those were also the days that gave birth to the ethnic studies disciplines, and growing numbers of Indians becoming lawyers. So what we have now is new generations of Natives with sophisticated educations, and savvy political and organizing skills. They understand their history, they understand they’re living with intergenerational trauma, but they still have enough of their cultures and traditions that have the power to heal them. And that makes them strong and relentless, like their ancestors before them. What’s different now is that there are greater levels of support coming from non-Natives, because it’s recognized now that Native struggles to protect land and water are everyone’s struggles. And let’s remember that this standoff at Standing Rock comes on the heels of years of climate justice activism, which is widely acknowledged to be led by Indigenous peoples. Standing Rock is only the most recent manifestation of that. \\nAbout the author \\nMark Karlin is the editor of BuzzFlash at Truthout. He served as editor and publisher of BuzzFlash for 10 years before joining Truthout in 2010. BuzzFlash has won four Project Censored Awards. Karlin writes a commentary five days a week for BuzzFlash, as well as articles (ranging from the failed “war on drugs” to reviews relating to political art) for Truthout. He also interviews authors and filmmakers whose works are featured in Truthout’s Progressive Picks of the Week. Before linking with Truthout, Karlin conducted interviews with cultural figures, political progressives and innovative advocates on a weekly basis for 10 years. He authored many columns about the lies propagated to launch the Iraq War. SOTT Comment: Read more from Roxanne Dunbar-Ortiz: The colonization of America was genocidal by plan: Yes, Native Americans were the victims of genocide \\nUS history, as well as inherited Indigenous trauma, cannot be understood without dealing with the genocide that the United States committed against Indigenous peoples. From the colonial period through the founding of the United States and continuing in the twentieth century, this has entailed torture, terror, sexual abuse, massacres, systematic military occupations, removals of Indigenous peoples from their ancestral territories, forced removal of Native American children to military-like boarding schools, allotment, and a policy of termination. \\nWithin the logic of settler-colonialism, genocide was the inherent overall policy of the United States from its founding, but there are also specific documented policies of genocide on the part of US administrations that can be identified in at least four distinct periods: the Jacksonian era of forced removal; the California gold rush in Northern California; during the Civil War and in the post Civil War era of the so-called Indian Wars in the Southwest and the Great Plains; and the 1950s termination period; additionally, there is the overlapping period of compulsory boarding schools, 1870s to 1960s. The Carlisle boarding school, founded by US Army officer Richard Henry Pratt in 1879, became a model for others established by the Bureau of Indian Affairs (BIA). Pratt said in a speech in 1892, \\n“A great general has said that the only good Indian is a dead one. In a sense, I agree with the sentiment, but only in this: that all the Indian there is in the race should be dead. Kill the Indian in him and save the man.” Share: '"}, "time": 1742563176.215231}