{"duration": 0.04458308219909668, "input_args": {"text": "\"— Bana Alabed (@AlabedBana) September 26, 2016 \\nShe's 7 years old and lives in Aleppo, Syria. As Vox reports, Aleppo has been one of the “most significant battlefield” in the country's continuous fight between Bashar al-Assad and government rebels since 2012. \\nBana recently created a Twitter account with her mother, Fatemah, to finally show the world what life is like for those in their war-torn city. \\nIn an interview with Independent Journal Review, Bana said the violence in her country is “all she knows.” \\nWhen asked to describe what happens when a bomb goes off, she said: \\n“The bombing is predictable. It always hits civilian places so there’s always fear — not just me, but thousands live in fear every day.” I am very afraid I will die tonight. This bombs will kill me now. - Bana #Aleppo pic.twitter.com/KqVHwqRClK — Bana Alabed (@AlabedBana) October 2, 2016 \\nUnlike many children, Bana doesn't go to school. She explained that a typical day doesn't even involve playing outside: \\n“[We just] keep strong & [have] hope.” This is what remains of our childhood memories. - Bana #Aleppo pic.twitter.com/O7NjuxnAzP — Bana Alabed (@AlabedBana) October 21, 2016 \\nHere she is in what used to be her family's garden, which is now just a pile of rubble: This is our bombed garden. I use to play on it, now nowhere to play. - Bana #Aleppo pic.twitter.com/drWnwflSOE — Bana Alabed (@AlabedBana) October 4, 2016 \\nAs you can see, life in Aleppo is a far cry from what many in the United States will ever experience. \\nBana hopes that her message for President Barack Obama will be heard loud and clear. Instead of a plea for her personal safety, her request shows tremendous understanding of the broader picture and concern for all involved: \\n“Stop [the] war and bring peace.” \\nPretty profound for a 7-year-old. \\nBana has amassed a Twitter following of more than 77,000 people. When asked about having such a huge platform to share Aleppo’s story, she gave the most humble and selfless response: \\n“[I'm] very happy and good. One day people will help us.” Hello world we are still alive. Wake up this morning alive. - Fatemah #Aleppo pic.twitter.com/EZz7xqbJ6E — Bana Alabed (@AlabedBana) October 3, 2016 \\nBana possesses an innate ability to have faith in a situation that should give her every reason to doubt God's existence. \\nThe 7-year-old admitted she believes in God, prays and said her faith has “increased” in light of her circumstances. \\nBut she doesn't just pray for herself. She also said she prays every day for “peace around the world.” This is me before the war. Tonight I'm praying for peace #Aleppo pic.twitter.com/vvMV6EtpVl — Bana Alabed (@AlabedBana) September 26, 2016 \\nWhen Bana grows up, she wants to be three professions she “loves most”: a teacher, author and actress. \\nShe says her faith will not falter in the face of violence, war and evil. Bana firmly believes better days are coming, but has a lasting message for not just President Obama, but the entire world: \\n“I want us saved.” \""}, "time": 1742562661.8563282}