{"duration": 0.028144121170043945, "input_args": {"text": "'During a January 14 report on Republican efforts to reduce restrictions on firearm suppressors, CNN said one of the GOP’s goals is to eliminate the “$200, 000 tax” on the devices. [CNN intimated that the GOP wants to get rid of the “lengthy background check” associated with suppressors as well.  In fact, the tax is $200 dollars —  not $200, 000 —  and the background check is one of the only current requirements that the GOP plans to keep in place for suppressors. What they want to get rid of is the bureaucracy of the purchase, whereby   citizens are required to be photographed, fingerprinted, and then to register their suppressor with the government. And yes, the GOP also wants to get rid of the $200 tax. CNN referenced the tax correctly later in the segment, but the mention of a “$200, 000 tax” was how they launched it. Representatives Jeff Duncan (  ) and John Carter (  ) introduced legislation on January 9 that will accomplish all these things. Their bill is the Hearing Protection Act and it is focused on the hearing benefits shooters and outdoorsmen receive from suppressed firearms. CNN’s Victor Blackwell addressed the Hearing Protection Act and said opponents of suppressors see any hearing benefits claims as a “facade. ” He then showed movie clips from Casino Royale and No Country for Old Men and a narrator said, “A gun silencer, shooting enthusiasts call it a suppressor. It’s an assassin’s must have in movies. ” The narrator says that opponents of the Hearing Protection Act say the real goal is “about militarizing weapons, not about hearing,” and that suppressor ownership “will allow mass shooters to kill stealthily. ” In reporting this way, CNN shows the Democrats’ hand —  as far as opposition to suppressors is concerned. They plan to fight against them the same way they fight against   stocks, flash hiders, and collapsible stocks via “assault weapons” bans. And they will try to shame   lawmakers into inaction by suggesting that suppressors make it possible to attack innocents without detection. Americans who are paying attention will quickly realize that the people making these arguments need to quit forming their opinions on suppressors from Hollywood films. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742564329.5057223}