{"duration": 0.05496978759765625, "input_args": {"text": "'Mittwoch, 23. November 2016 Lufthansa ersetzt streikende Piloten kurzfristig durch umgeschulte Busfahrer Frankfurt (dpo) - Gute Nachrichten für Flugreisende! Offenbar fällt trotz des Pilotenstreiks kein einziger Flug aus. Möglich wurde dies, weil die bestreikte Fluglinie Lufthansa nach eigenen Angaben kurzerhand 1172 Busfahrer in einem fünfstündigen Lehrgang zu Piloten umgeschult hat. Die Pilotenvereinigung Cockpit zeigt sich empört. Bei der Lufthansa dagegen sieht man die Entscheidung als notwendigen Schritt. \"Unsere Piloten halten sich offenbar für unersetzbar\", erklärt der Vorstandsvorsitzende Carsten Spohr. \"Das sind sie aber nicht. Busfahrer machen die gleiche Arbeit für deutlich weniger Lohn – und das ganz ohne dieses arrogante Pilotengehabe.\" Die eingesetzten Busfahrer, die bereits gestern in einem kurzen Crashkurs Start und Landung, das Verhalten bei Gewitter sowie den typischen beruhigenden Piloten-Singsang beigebracht bekommen haben, geben sich jedenfalls bescheiden. Über den Wolken: Grabowski mit über 400 Passagieren auf dem Weg nach Boston \"Airbus, Linienbus… Das ist doch alles das Gleiche, nur dass man eben fliegt statt zu fahren\", erklärt etwa Aushilfspilot Harry Grabowski und lehnt sich zufrieden zurück, nachdem er mit seinem 9.13-Uhr-Direktflug Frankfurt-Boston gerade die Reiseflughöhe über dem Atlantik erreicht hat. Die Umstellung auf einen Airbus 380-841 fiel dem 44-Jährigen, der sich nach zwölf Jahren Berufserfahrung als Busfahrer nun als Streikbrecher bei der Lufthansa etwas dazuverdient, nicht besonders schwer. \"Weniger Stopps auf der Strecke, keine Jugendlichen mit lauter Handymusik mehr und weniger Omas, die sich mit mir unterhalten wollen – ich habe eine wunderbare Zeit hier. Und diese Stewardessen, da träumen wir bei der Stadtbuslinie 34 von.\" Hier nickt Grabowskis Co-Busfahrer zustimmend. Sollte sich das Konzept bewähren, steht für die Lufthansa die Frage im Raum, ob man auch grundsätzlich weiterhin auf Piloten setzen will. Immerhin verlangen die Busfahrer nur rund 2400 Euro brutto und damit einen Bruchteil eines Pilotengehalts. ssi, dan; Idee: mle; Foto oben: Cray of CatPRO / Shutterstock.com , Foto rechts: von Wedelstaedt , GNU 1.2 ; Hinweis: Erstmals erschienen am 4.12.14 Artikel teilen:'"}, "time": 1742562382.684223}