{"duration": 0.0886223316192627, "input_args": {"text": "'This past Sunday, the latest ABC/ Washington Post poll showed a 12-point national polling in favor of Hillary Clinton over Donald Trump. This poll, along with various other recent polls from the Washington Post , Reuters, and ABC, has shown a 9-percentage point sampling bias toward registered Democrats , causing an uproar of speculation.\\nKeep in mind, we are neither Trump supports nor Hillary Supporters.\\nThe website Zero Hedge reported : “METHODOLOGY – This ABC News poll was conducted by landline and cellular telephone Oct. 20-22, 2016, in English and Spanish, among a random national sample of 874 likely voters. Results have a margin of sampling error of 3.5 points, including the design effect. Partisan divisions are 36-27-31 percent, Democrats – Republicans – Independents.”\\nThese small sampling details shouldn’t be taken so lightly, as they can change the results of the poll immensely, as well as shift people’s perceptions of their candidate’s likelihood of winning. This in turn can deter people from voting altogether. There may be a few more registered Democrats, but they certainly don’t have a 9-point registration average, which the latest sampling polls have shown.\\nFurthermore, the media organizations involved are pulling a certain demographic sampling to get the results they have.\\nZero Hedge put it into perspective by noting:\\nAs a quick example, the ABC / WaPo poll found that Hillary enjoys a 79-point advantage over Trump with black voters. Therefore, even a small “oversample” of black voters of 5% could swing the overall poll by 3 full points . Moreover, the pollsters don’t provide data on the demographic mix of their polls which makes it impossible to “fact check” the bias…convenient.\\nThe many recent WikiLeaks documents have exposed Hillary Clinton’s scandalous behaviour, including the release of the contents from her private e-mail server. One of them in particular revealed the close ties the Clinton campaign has had with polling organizations, creating speculation that the campaign is paying the organizations to push the polls in Clinton’s favor.\\nWith media organizations using specific demographic sampling details to rig the results of polling, more dismay, confusion, and anger over the possible, if not absolute, corruption that occurs in the U.S. presidential election can be the only result.\\nAnd to really expose just how rigged the polls are, the latest Podesta emails, which were just released by WikiLeaks , show in disturbing detail just how to “manufacture” the hoped-for results from a certain poll. The email correspondence exposes the request for recommendations regarding “oversamples for polling” in order to “maximize what we get out of our media polling.”\\nOne email said, “I also want to get your Atlas folks to recommend oversamples for our polling before we start in February. By market, regions, etc. I want to get this all compiled into one set of recommendations so we can maximize what we get out of our media polling.”\\nAnd among some of the most damaging materials was an attachment of a 37-page guide. One instance revealed that, in Arizona, the oversampling of Hispanics’ and Native Americans’ populations was highly recommended:\\n“Research, microtargeting & polling projects\\n– Over-sample Hispanics\\n– Use Spanish language interviewing. (Monolingual Spanish-speaking voters are among the lowest turnout Democratic targets)\\n– Over-sample the Native American population”\\nAnd in Florida, the report discusses “consistently monitoring” samples for ensuring they’re “not too old” and “has enough African American and Hispanic voters.” The report even acknowledges that national polls over sample “key districts/regions” and “ethnic” groups “as needed.”\\n“– General election benchmark, 800 sample, with potential over samples in key districts/regions\\n– Benchmark polling in targeted races, with ethnic over samples as needed\\n– Targeting tracking polls in key races, with ethnic over samples as needed”\\nMany of the Podesta emails give clear insight into why the mainstream media has refused to report on the most damning allegations against Clinton — with this latest revelation simply affirming the reality that the “consent of the governed” is, in reality, nothing more than manufactured consent by one group that holds total power.\\nUltimately, these elections are a mere distraction, and as John F. Hylan, among others, told us:\\nThe real menace of our Republic is the invisible government, which like a giant octopus sprawls its slimy legs over our cities, states and nation … The little coterie of powerful international bankers virtually run the United States government for their own selfish purposes. They practically control both parties … [and] control the majority of the newspapers and magazines in this country. They use the columns of these papers to club into submission or drive out of office public officials who refuse to do the bidding of the powerful corrupt cliques which compose the invisible government. It operates under cover of a self-created screen [and] seizes our executive officers, legislative bodies, schools, courts, newspapers and every agency created for the public protection. ( source )( source )\\nThese are the ones we should be focusing our attention on.\\n \\n \\n'"}, "time": 1742561844.9553094}