{"duration": 0.14173460006713867, "input_args": {"text": "'Trump: A people’s ‘new world order’ taking shape? By Eric Walberg   Eric Walberg \\nA populist wave that began with Brexit in June became a tsunami as Trump’s cyclone hit Washington Tuesday night, leaving the capital in a shambles. His is a story straight out of Grimm’s fairytales. the peasants rose up. The phony civility of the neoconservative nightmare that Americans (and the world) have endured for years is cracking. \\nTrump’s victory is pure protest by the masses. Exciting, but disturbing, as Trump is just another billionaire. He will be sure to look after his own, but then again, maybe he can stare them down. Fortunately, there is the Republican Congress and Senate to provide stability as the upstart get his feet on the ground. The weakened Democrats will have to fight extra hard after years of complacency under the nice, liberal Obama. \\nFor critics of media control by the Israel lobby in the US, and the sham elections where money rules, the victory shattered this paradigm. “Though the ‘Masters of Discourse’ control the entirety of world media, and they decide what people may think and say from Canada to Hong Kong, only you, American citizens, can defeat them. Trump has a great quality making him fit for the task: he is impervious to labels and libels. He had been called everything in the book: anti-Semite, racist, women hater, you name it. And he still survived that flak. Such people are very rare,” writes Israel Shamir. \\nAlmost all presidents since Jimmy Carter have campaigned as outsiders. Reagan, Bill Clinton, Bush jr, Obama. But they were all seasoned politicians and all disappointed. \\nPresident Trump—think: Governor Ventura \\nThere is a precedent of a boorish outsider, made famous and pilloried in the media, who catapulted into the political world. His name is Jesse Ventura, a former professional wrestler who served as the 38th Governor of Minnesota from 1999 to 2003. He was the first member of the Reform Party to win a major government position, now in the Independence Party of Minnesota. \\nHe surprised everyone with a sober, uncorrupt term in office, reforming taxation and constructing the METRO Blue Line light rail in Minneapolis–Saint Paul. He shattered the Republican-Democratic stranglehold and no one suffered. Trump has shattered it again. He makes a path open to a third party or independent candidate in the future. \\nTrump’s trump card \\nTrump’s final ad, a 2-minute masterpiece of populist rhetoric infuriated the ADL for hinting the obvious: the forces of international finance that have their own agenda for the US, behind our backs, and whose agent is/was Hillary Clinton. He depicted a “global power structure” that is “bleeding America dry” with horrible trade deals that enrich elites and open the gates to mass immigration. \\nThe people behind this globalist takeover include George Soros, Federal Reserve Chairman Janet Yellen and Goldman Sachs Chairman Lloyd Blankfein, with the implication that Clinton is their minion. “The Clinton machine is at the center of this power structure. We’ve seen this first hand in the WikiLeaks documents, in which Hillary Clinton meets in secret with international banks to plot the destruction of US sovereignty in order to enrich these global financial powers, her special interest friends and her donors,” charged Trump. \\nThat jab alone was worth more than all of Hillary’s millions spent on ads attacking him for peccadilloes. Now the intelligent Republicans are waking up. Trumps’ words are branded in their minds. That alone makes the election historic. \\nThe ADl’s slander of Trump—this ad touches on images and rhetoric that anti-Semites have used for age—merely alerted Americans to the emptiness of the ‘anti-Semitic’ slur. If something is true, pointing it out is not bigotry. \\nSenior House deputy whip Dennis Ross of Florida lauds Trump for his known ability as negotiator. “Sure, he might toss out statements like ‘build a wall,’ or ‘no Muslims,’ and say something sensational. But then he knows how to give in a bit and come up with a solution.” \\nHouse Speaker Paul Ryan publicly disowned Trump during the campaign, and now has to eating crow. The closest modern comparison of an outsider president and a speaker of the same political party may be the fractious relationship during the late 1970s between Democrats President Jimmy Carter and House Speaker Tip O’Neill. Carter’s team didn’t have an appreciation for how the system worked in Washington and struggled to advance his agenda. \\nNew American ball game \\nThe Republican win in the Congress and Senate, with a Republican president, offers a chance to produce meaningful change. Will Trump develop more concern for the environment and work to help the millions of poor Americans who put their trust in him? He has a huge responsibility to repay his voters and give hope for reconciliation with his opponents. There is much soul searching to be done now, on both sides of the divide in American political life. \\nThe election represents a call to action for people to fight hard to save the environment, rebuild a county falling apart, and demand a responsible US foreign policy. \\nDemocracy only works when we all take part. People are awakening from their Wall St induced sleep. Look for a new ‘Occupy Wall St’ and peace campaigning. \\nThat’s the bright side. Trump’s policies on the Middle East and Iran are confused and incoherent. Let’s hope that his friendship with Vladimir Putin portends realism, and the ability and intent to change the US imperial mindset that plagues the world. The French are just as furious with the same scenario there. Trump’s victory makes a victory for the Front National’ s Marine Le Pen more likely. “The American people—free!” Le Pen tweeted as Trump’s count reached the threshold of victory. \\nIt also gives energy to Britain’s vote to leave the European Union. Protest candidates throughout Europe have gained votes and seats in many countries, and entered government coalitions in 11 Western democracies, including in Austria, Italy and Switzerland. \\nThis wave of protest is gathering momentum. The American people have the chance now, and the responsibility, to help shape where Trump will take his ‘revolution.’ Whether he can work with his foreign counterparts to create a people’s ‘new world order’, not the one Bush Sr. promised in 1991 and that Bush Jr. failed to achieve. Foreign policy has too long been off limits, done by elites behind closed doors. \\nGovernment has to listen to the people now, after years of passivity and policies shaped by the elite. Trump made serious promises to revitalize American. People will now hold him to them. \\nCanadian Eric Walberg is known worldwide as a journalist specializing in the Middle East, Central Asia and Russia. A graduate of University of Toronto and Cambridge in economics, he has been writing on East-West relations since the 1980s. He is author of “ Postmodern Imperialism: Geopolitics and the Great Games ” and “ From Postmodernism to Postsecularism: Re-emerging Islamic Civilization .” You can reach him at ericwalberg.com .'"}, "time": 1742561765.8277307}