{"duration": 0.07763075828552246, "input_args": {"text": "'The U. S. Treasury announced on Monday that it is putting into place 271 new sanctions in Syria following a chemical weapons attack on April 4 that killed dozens of people, including many children. [Treasury said in a press release that the sanctions are “in response to the attack on innocent civilians in Khan Sheikhoun, Syria, by the regime of Syrian dictator Bashar ” calling the move one of the largest blocks of sanctions in the history of the Office of Foreign Assets Control (OFAC).  The sanctions are against 271 employees of Syria’s Scientific Studies and Research Center (SSRC) all of whom have expertise in chemistry and related “disciplines” and have been supporting Assad’s chemical weapons program since at least 2012, according to Treasury. “These sweeping sanctions target the scientific support center for Syrian dictator Bashar  ’s horrific chemical weapons attack on innocent civilian men, women, and children,” Treasury Secretary Steven T. Mnuchin said in announcing the sanctions. “The United States is sending a strong message with this action that we will hold the entire Assad regime accountable for these blatant human rights violations in order to deter the spread of these types of barbaric chemical weapons. ” “We take Syria’s disregard for innocent human life very seriously, and will relentlessly pursue and shut down the financial networks of all individuals involved with the production of chemical weapons used to commit these atrocities,” Mnuchin said. “Today’s action follows OFAC and the Department of State’s sanctions announced on January 12, 2017 against 18 senior regime officials and five branches of the Syrian military, along with entities associated with its chemical weapons program, in response to findings by the Organization for the Prohibition of Chemical Weapons  —   United Nations Joint Investigative Mechanism, that the Syrian regime was responsible for three chlorine gas attacks in 2014 and 2015,” the press release said. The press release noted that these sanctions come less than three weeks after the chemical weapons attack and “more than doubles in a single action the number of individuals and entities sanctioned by the United States pursuant to   Executive Orders, and that Assad’s actions are “blatant violations of the Chemical Weapons Convention and UN Security Council Resolution 2118. ” On February 28, just weeks ahead of the attack, Russia and China vetoed a United Nations resolution backed by the West that would have imposed sanctions on Syria over its chemical weapons program, AFP reported. “The measure drafted by Britain, France and the United States won nine votes in favor at the Security Council while three countries opposed it  —   China, Russia and Bolivia,” AFP reported. “Kazakhstan, Ethiopia and Egypt abstained. ” “It was the seventh time that Russia, Syria’s top military ally, has used its veto power to shield the Damascus regime,” AFP reported. Russian President Vladimir Putin had earlier warned that imposing sanctions on Syria during negotiations in Geneva over the more than    civil war was “completely inappropriate” and would undermine the progress of the peace talks. “This resolution is very appropriate,” US Ambassador Nikki Haley after the measure was defeated. “It is a sad day on the Security Council when members start making excuses for other member states killing their own people,” Haley said. The resolution would have put 11 Syrians, mostly military personnel, and 10 other entities linked to chemical attacks in 2014 and 2015, on a UN sanctions blacklist.'"}, "time": 1742563050.2185004}