{"duration": 0.21642327308654785, "input_args": {"text": "'Ahrar Mrimin with Mohammed Mrimin at the head Brigade. The army of mujahids. \\nDozens of civilians were injured as a result of chaotic bombardments from the side of Brigades of Free Syrian Army, which collaborate with Jabhad al Nusra and Ahrar al Sham. According to the last statistics the death toll among civilians as a result of indiscriminate bombardment of suburbs has reached 85 people by 06.04.16. 620 people were wounded, most of them were severely injured . Chemical weapons were used during the bombardment. The odor was smelt and puffs of yellow smoke were seen. 40 000 people live in this region now. 30 000 people more were resettled from other districts of Aleppo. \\nThe situation is complicated due to acute shortage of medical supplies. People perish because it is impossible to provide them with proper medical assistance. Shamiran Rasho, a representative of «Red Crescent» in the region of Sheikh Maqsood, stated: ” We are unable to save the lives of many people because of the catastrophic lack of medicinal products”. Mrs. Shamiran Rasho pointed out, that the region was still being gunned from the side of terrorist armed gangs. “We appealed to the international community to help people of Syria. But we got neither medical nor humanitarian assistance from the international organizations, which consider themselves the friends of people of Syria”. The region has been in siege since the 22 of September 2015. International community turns a blind eye to a human tragedy in the region of Sheikh Maqsood, which is close to a humanitarian catastrophe. \\nThis article is based on the facts and reports, given by mass media and organizations, which address the issue of human rights to life. \\n21.02.2016. \\nContract fighters of Jabhad al Nusra and Ahrar al Sham bombed out the environs of Sheikh Maqsood in Aleppo. As a result 6 people perished, among them 3 children from one family, 19 people were wounded. \\nAs a consequence of the bombardment 6 people perished, 4 of them were the members of one family: mother and 3 children. A rocket hit their house. According to the acquired information their names were: Isa Mohammed ( 11 y.o), kadija Mohammed Sultan, Ahmet Mohammad (14 y.o), Nazla Mohammed calif 30 (y. o), the body of the 6 th person was impossible to identify. \\nThere is a list of 19 wounded people: \\nLeman Mohammad, 35 years old – wounded in the belly with a frag. \\nMohammed Ali Mohammad, 8 years old – as a result of explosion got a fragmentation wound of the whole body. \\nMajid Ali Mohammad, 5 years old – fragmentation wound \\nMezha Mohammad hlefa, 35 years old – wounded in the belly and back \\nBervan horo, 89 years old – wounded in the hand \\nMohammad Ramadan, 38 years old – wounded in the throat \\nMakbula Bozan, 38 years old – wounded in the shoulder \\nAmud Jafad, 38 years old – wounded in the head \\nAbdalla Mohammad Abdalla, 30 years old – wounded in the head \\nArf Abdo, 54 years old – as a result of explosion got a fragmentation wound of the head and of the whole body. \\nAbdalla Amori, 61 years old – wounded in the leg \\nAbdahman, 15 years old – wounded in the leg \\nMohammad Piro, 26 years old – wounded in the back \\nHussein Piro, 50 years old –wounded in the backbone. \\n25.02.2016. \\n2 people perished: Bushla Mustafa, 16 years old, Abdalla Fatn, 43 years old. \\n15 people were wounded as a result of bombardment the region of Sheih Maqsood by heavy artillery, subartillery and homemade gas rockets. The identity of 10 people was established. \\nMohammad Ali Sheih, 27 years old – wounded in the head, was shot by the sharpshooter. \\nMustafa halil, 8 years old – wounded in the head \\nJmaa Zlha, 66 years old – wounded in the head \\nGafran Otil, 39 years old – a fragmentation wound of the head and the hand. \\nIdris Mustafa, 29 years old – wounded in the leg \\nZiad Sheh Ali – wounded in the eye \\nMohammad Sheh, 23 years old – wounded in the head \\nSidra Mustafa – a fragmentation wound of the body \\nAhmad Mussa – a fragmentation wound of the body \\n27.02.2016. \\nArmed groups, which stationed themselves in the region of Kastello and Jandul were gunning the region of Sheih Maqsood from 4 o. clock in the morning till 5 o, clock in the evening. As a result 4 people were badly wounded. Bandit groups, which participated in the bombardment were: 1.Islamist group Ahrara al Sham. 2. Nur al Din al Zanky Brigade . 3. Sultan Murad Brigade. 4. Branch of the 16-th group of Haled Hayany. 5. Jabhad al Nusra. 6. Fastakm Kama Amart Association . 7. Front of Al Shamiya. 8. Squadron of Caucasus with Salahaddin al Chichany at the head. 9. Sultan Fatih Brigade. 10. Sultan Murad Brigade. \\n28. 02.2016. \\nOne child perished and 4 people were badly wounded as a result of yet another bombardment of the region of Sheih Maqsood from the side of armed groups, which station themselves in the region of Kastello. At 3.15 p.m the same militant groups attacked the commanding points of YPG and YPJ, situated in the region of Ashrafie. Besides, at 4. 15. this region was cannonaded. As a result, 8 civilians were wounded. \\n02.03.2016. \\nEarly in the morning Syrian armed opposition groups, connected with the headquarter of operations of Aleppo, began brisk fire of Sheih Maqsood. These armed opposition groups stationed themselves in the regions of Jandol, Kastello, Afrie and on the place, where a bus factory was located. As a result of this bombardment 3 people perished and 46 were wounded. \\n06.03.2016. \\n12 civilians were wounded as a result of bombardment of the suburbs of Sheikh Maqsood by Jabhad al Nusra and Ahrar al Sham, which stationed themselves in the region of Bani Zed . Gas bombs were used during these bombardments. According to the information of news agency Havar, the rockets fell on the houses. It caused the destructions of buildings and took the life of 12 people. \\n07.03.2016 \\n16 civilians and 4 people from militia army have perished . \\nYPG made a public statement, where they pointed out that contract fighters of Jabhad al Nusra, Ahrar al Sham, Sultan Murad Brigade and other forces, connected with them, using heavy artillery, homemade gas bombs had launched a spate of strikes on the regions of Sheikh Maqsood in the night. «As a result, 16 civilians perished, 4 persons from the army of the population protection and dozens of civilians were wounded. The aim of this attack was to occupy the region of Sheikh Maqsood. But we stood against the attack and defeated their plans. But we did not find out what loses they suffered. On this day the gangs of mercenaries tried a shot of attack from the side of the regions of Maspakh, Kastello, region of Sekan Shababi. But they did not succeed again. 8 mercenaries were killed». \\n08.03. 2016. \\nThe armed opposition groups delivered yet another rocket attack on the region of Sheikh Maqsood. As a result 3 civilians, among whom was one child, got hurt: Shahod hadji Mohammad, 70 years old, Mahmud Murad, 14 years old, Abdul Kadir Atto, 27 years old. \\nArmed opposition groups launched a blow on the region of Sheikh Maqsood, using chemical weapon. \\nAn official representative of YPG Redor Halil reported that at 3 p.m . the Syrian opposition groups had conducted bombing strikes on the region. It is likely that chemical weapons were used. The groups, that participated in it are: Ahrar al Sham, Jabha al Shamia, Sultan Murad Brigade , Sultan Fatih Brigade, Fastakm Kama Amart Association, Nur ad Din al Zanky Brigade, the 13 th Brigade, the 1 st Regiment, Brigade 116, Brigade of Adu Amar. \\n09.03.2016. \\nAt 4 p.m. the armed groups, connected with the National Coalition, violated the cessation of hostilities and conducted an attack on the region of Sheikh Maqsood, using heavy artillery. \\n15.03.2016. \\nOn the 15 th of March the same opposition groups violated the cessation of hostilities and launched a rocket attack on the outskirts of Sheikh Maqsood, using Grad MLRS. It led to numerous destructions. A lot of civilians were wounded. \\n19.03.2016. \\nOn the 19th of March the armed groups, connected with the National Coalition, violated the cessation of hostilities and conducted bombing strikes on Sheikh Maqsood and its suburbs, using homemade gas bombs and heavy artillery. These attacks were launched from the regions which are under their control: Maspah halab, Ashrafiya, Sekan Shebabi, and the region of Jandol. The groups, that participated in it were: Sultan Murad Brigade , Sultan Fatih Brigade, Mujahaddin Brigade, Fastakm Kama Amart Association, Nuraddin al Zanky Brigade. As a result of bombardment 4 people perished, 7 civilians were wounded. \\n21.03.2016. \\nThe armed groups, connected with the National Coalition violated the cessation of hostilities and using the guns with gas balloons, missile launcher Grad , took the region under fire. A lot of civilians found themselves under the ruins of buildings. \\n25.03.2016. \\nOn this day the region of Sheikh Maqsood underwent intensive attack from the side of armed groups. Fire was launched from the regions of Sekan Shababi, Sekan Shkef and Ashrafiya. It happened at 2 p.m. The forces which took the credit for this bombardment were the following: Sultan Murad Brigade , Ahrar al Sham, the 16 th Brigade, Jash al Mujahaddin, Fastakm Kama Amart Association, Nuraddin al Zanky Brigade. As a result of bombardment 4 people perished, 7 civilians were wounded. As a result of this attack Saadu Mohammad Saadu perished and 6 people were wounded. \\n27. 03.2016. \\nOn this day at 4 p.m. the forces, connected with Syrian opposition, set a goal to capture Sheikh Maqsood and the points, controlled by YPG. They conducted an attack on these territories. The forces which took the credit for it were: Sultan Murad Brigade , Ahrar al Sham, the 16 th Brigade, Fatah Brigade, Fastakm Kama Amart Association, Nuraddin Zanky Brigade. As a result of these actions a serious damage to the region was inflicted. \\n05.04.2016. \\n18 people perished and 67 were wounded as a result of attack on Sheikh Maqsood on this day. \\nDay by day the death toll rises as a result of the attack of coalition forces on civilians. Women, children and a pregnant woman are among the victims. 67 people were critically injured. The names of victims are: Ahmed al Hassan, 12 years old, Sharif Ahmed, 40 years old, Baraa al hadi, 15 years old, Hadi al Haider, 25 years old, Manar Husein, 25 years old, Zakariya, 20 years old, Kadija Shehu, 15 years old. \\nThe names of the wounded people are: Saria Asu, 48 years old, Nureddin Saado, 15 years old, Azdihar Saado, 7 years old, Menar Saado, 9 years old, Zachariah Galib, 35 years old, Menarmuso Hussein, 25 years old, Vakfe Kabo, 20 years old, Ahmed Abdul Rahman 50 years old, Mohammed Abbas 85 years old, Huda Albiosh 26 years old, Rezgar Nury 6 years old, Ferashin Nury 2 years old, Jumah Zlha Zlha 47 years old, Asna Zlha 17 years old, Ahmed Zlha 45 years old, Isra Zlha 7 years old, Kadija Shehu 10 years old, Ahmed Mohammed 46 years old, Nury al Ibragim 49 years old, Hamza Mohammad 13 years old, Agit Agit 37 years old, Aisha Muhammeda 24 years old, Nauros Sleman 4 years old, Nariman Mahmud 27 years old, eba al Mery 6 years old, Merua Musa 5 years old. \\n07.04.2016. \\n7 people perished, 20 were wounded as a result of bombardment. \\n08.04.2016. \\nWithin 24 hours the region of Sheikh Maqsood was subjected to the chemical attack 3 times. Terrorist groups carried out an attack on the region using chemical weapon. 6 people with severe poisoning and symptoms of asphyxia were brought to the hospital of «Red Crescent». Aziz Amo Jmo, who got hurt as a result of this attack, said: «I was at home when gas attack began. When I went out, I felt giddiness and queasy. I began to gasp. Eccentric fragrance was smelt in the air. I moistened a kerchief and put it to the nose to breathe». According to the words of the locals, they saw the clouds of yellow smoke. The medical director of the hospital of «Red Crescent» Valat Mahmo told «Havar» agency: «After the complete examination of the injured people we found out that they got severe poisoning». Valat Mahmo addressed all the medical and social communities with an appeal to provide medical and humanitarian assistance to the people, who got hurt as a result of bombardment of the region of Sheikh Maqsood, because they «suffer a shortage of medical preparations to deliver medical care». Besides, Valat Mahmo emphasized that within 24 hours the region of Sheikh Maqsood had been subjected to the chemical attack with toxical gases 3 times. 6 people got hurt as a result of it. In the video message one of the members of terrorist group Jash al Islam told that they had used chemical weapons against the civilians. He added that their aim was to dehouse Sheikh Maqsood. In the main headquarters of terrorist organizations it was confirmed that it had been done without the knowledge of the executive staff and that person would be ensured accountability for it \\n09.04.2016. \\nA few people more, who got hurt as a result of chemical attack, were hospitalized. All of them had the similar symptoms of dizziness and queasiness. The names of these people are: 1. Mslm Mslm, 55 years old. He felt trouble breathing, when the rocket with poison gas fell near his house. 2. Gulistan Abdo, 4 years old. According to the words of her mother, she felt bad after the rocket with poison gas had fallen near their house. Sometime after that she began to lose hair. 3. Hasan Husein, 40 days old, was hospitalized because of the trouble breathing. \\nSince the 16 th of February up to now the military operations have not finished. During this period 85 people died, 620 people were wounded. On the 24 th of March the region of Sheikh Maqsood was subject to chemical attack. On the 7 th – 8 th April the terrorist groups dropped chemical bombs on the region of Sheikh Maqsood. \\n10.04.2016. \\nAs a result of bombardment 2 people perished, 8 people were wounded. The names of the died people are: Halil Osman, 60 years old, Farah Ibragim, 13 years old. The names of wounded people are: Tofik Hasan, 37 years old, Mahmad Sino, 62 years old, Bashar Hadji Ahmad, 16 years old. \\nIn conclusion we appeal to the world public, to the Human Rights Committee, to the countries which contribute to the cessation of hostilities in Syria. It is necessary to terminate the chaos which is in the region of Sheikh Maqsood now, to destroy the blockade in which people live. For our part we respect the principles and norms of international law, toe the line of agreements approved in Geneva in 1949 and the protocols, approved in 1977. We act according to the decrees, connected with the resolution of crisis in Syria, 2245 and 2268. The Essential Saker: from the trenches of the emerging multipolar world $27.95 '"}, "time": 1742562915.5847964}