{"duration": 0.041687965393066406, "input_args": {"text": "'Republican operative Roger Stone has made an entire career out of deplorable actions. He is a close friend and confidant of the Republican presidential hopeful Donald Trump. \\nIn fact, Stone is working with the Trump campaign to organize volunteers. Isn’t that special? \\nMost campaigns, of course, organize the volunteer brigade to knock on doors and chat with people about the candidate. Some gather willing folks to make calls, reminding people about when and where to vote. \\nThe Trump campaign, as the world knows, is definitely not your average campaign. Definitely. Roger Stone is not the typical campaign advisor either. \\nStone is reaching deep into the basket of deplorables to find each volunteer. His plan is not to have them get out the vote. In fact just the opposite is true. \\nApparently the Republican nasty man is running an anti-voter fraud group which ironically calls itself “ Vote Protectors .” In spite of the fact that there is absolutely no evidence of widespread or significant voter fraud, Donald Trump continues to insist that the whole election is “rigged.” \\nIn his effort to stop the “rigging” of the polls, Stone has asked every Vote Protectors volunteer to wear a specially designed identification badge. Each one is supposed to engage in a fake “exit poll,” asking people who they chose. Election officials believe that these actions would confuse and intimidate voters. \\nOf course they would confuse and intimidate voters. That’s why Roger Stone wanted those things done. \\nUnfortunately for Stone, however, the Huffington Post got wind of his plan and asked him about it. At first the head of the deplorables refused to explain how he intended to have the group reach its goals. \\nSo the Huffington Post went online to the site to volunteer. What it found was eye opening, to say the least. The “volunteer” who signed up on the site followed the instructions for generating a very official looking ID badge. It would surely fool many voters if worn by someone taking an “exit poll.” Trump Loyalists Planned Voter Intimidation Using Fake ID Badges, Fake Exit Polling https://t.co/8ojaEGZiD6 \\n— Cheri DelBrocco (@cdelbrocco) October 26, 2016 \\nThe Huffington Post reports that there was no limit to the number of badges they produced, as you can see above. \\nThe instructions on the site also told each volunteer that he or she must: “…commit to go out in November and post their YouTube and Periscope streams to the [Vote Protectors] website, organized by state and district, as well as enter actual exit poll survey response.” \\nThat’s right. Volunteers for Roger Stone’s “Vote Protectors” were supposed to videotape people at the polls and upload them. You can just imagine how this would impact Black or Latino voters. Or, Heaven forbid, voters from Arabic backgrounds. \\nWhen asked specifically about the ID badges, Stone emailed this to the Huffington Post: “I have ordered them taken down. Bad idea, as is video taping. First I have heard of it. I am only interested in a valid, scientifically conducted exit poll.” \\nOf course he is. On a “scientifically conducted” exit poll, done by a bunch of volunteer Trumpsters with no training and a profound bias. \\nFabulous. \\nThat basket of deplorables just keeps getting bigger by the day. \\nWatch this incredibly outrageous video of Roger Stone and the crazy pants Alex Jones talking about how Hillary is planning to steal the election. \\nFeatured image via YouTube screegrab . About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742628465.0761204}