{"duration": 0.23352813720703125, "input_args": {"text": "'Willy Wimmer, ex vicepresidente de la OSCE, aborda el tema sirio\\n«Nos empujan a la guerra» por Willy Wimmer El mundo vive hoy los momentos más peligrosos de la historia posterior al fin de la guerra fría. En entrevista concedida a Ilona Pfeffer para la agencia de prensa Sputnik, Willy Wimmer, ex secretario de Estado del ministerio de Defensa de Alemania, aborda la crisis siria y denuncia a los responsables de la grave situación creada alrededor de ese conflicto.\\nRed Voltaire | 31 de octubre de 2016 Sputnik : Señor Wimmer, los combates en Siria no se detienen y los ceses de hostilidades pactados se violan constantemente. La implicación de Estados Unidos y Rusia se comenta de forma sesgada en los medios de prensa occidentales. ¿Cómo ve usted la situación en Siria?\\nWilly Wimmer : Estamos ante una situación que venía incubándose desde hace tiempo y que trágicamente llegó, hace 5 años, a transformarse en guerra civil y conflicto en el preciso momento en que creíamos haber resuelto la situación conflictiva entre Siria e Israel vinculada a las alturas del Golán. Iba a concluirse un acuerdo que hubiera podido llevar paz a todo el Medio Oriente si no hubiese sido por la existencia de fuerzas desfavorables a un acuerdo de paz. Sabemos que, al inicio de la tragedia siria, fuerzas especiales del Reino Unido, Francia y Estados Unidos se hallaban en el terreno para crear esta situación de guerra civil y darle una dimensión internacional.\\nExistían por tanto antecedentes portadores de esperanza, si no se hubiese invertido ese movimiento. Desde entonces estamos asistiendo a una tragedia y el pueblo sirio parece exhausto. Ahora es importante poner fin a la tragedia y tratar de evitar por todos los medios que las chispas del enfrentamiento iniciado en Siria se extiendan a otros países, incluyendo los nuestros [en Occidente] porque eso significaría una gran guerra.\\nEn ese contexto, quiero referirme –con toda intención– al informe presentado en Holanda sobre la destrucción del avión de pasajeros de Malasia. Tenemos que preguntarnos si existe realmente algún interés en aclarar esa tragedia o si alguien está buscando un pretexto para desatar la guerra.\\nEsa es la situación que tenemos ante nosotros y es por eso que Siria no está muy lejos de ese tema. Tenemos que hacer todo lo posible por contribuir a una solución pacífica y eso quiere decir no enviar armas, dinero ni tropas a la región.\\nSputnik : Rusia está en el terreno desde hace un año. ¿Qué éxitos pueden verse? ¿Qué papel están desempeñando Estados Unidos y sus aliados?\\nWilly Wimmer : La implicación de Estados Unidos y de Europa occidental en Siria es una clara violación del derecho internacional. Es una intervención militar en territorio de otro Estado sin autorización de la ONU ni del derecho internacional. Son esas las fuerzas que han originado toda esta tragedia en Siria.\\nLa única posibilidad de poner fin al baño de sangre en Siria es la acción de la Federación Rusa, que intervino a favor del derecho internacional a nivel global para que evitar que fuese pisoteado. Eso es lo que Estados Unidos ha venido demostrando desde la guerra desatada contra Yugoslavia, también en flagrante violación del derecho internacional.\\nSe trata, por una parte, del combate en Siria misma. Pero también se trata por otra parte, desde 1999, de saber si el intento de Estados Unidos de llevar adelante su ofensiva global va a prosperar o si el mundo tiene aún una posibilidad de restablecer la cooperación pacífica entre los pueblos. Sin la implicación rusa en Siria, del lado del gobierno legítimo, el mundo ya no tendría ninguna posibilidad.\\nSputnik : En su opinión, ¿cuáles son los objetivos de Estados Unidos en Siria?\\nWilly Wimmer : Es evidente que Estados Unidos pretende rediseñar el mundo, al sur de Europa occidental y de la Federación Rusa. Es por eso que estamos viendo toda una sucesión de conflictos y guerras que van desde Afganistán, Irak y Siria hacia las costas del Mediterráneo y Mali. Estados Unidos está implicado en todas esas regiones, donde libra guerras y contribuye a empeorar la miseria de sus pueblos y la destrucción de sus civilizaciones, lo cual sigue haciendo pese a todo.\\nRusia entró en el conflicto sirio debido a su legítima alianza con la República Árabe Siria y el presidente Bachar al-Assad, lo cual es totalmente conforme con el derecho internacional. En eso reside la gran diferencia entre Estados Unidos y la Federación Rusa. Estados Unidos es responsable de sangrientos crímenes en nuestro entorno y es igualmente responsable de buena parte de los flujos migratorios que actualmente enfrentamos. La Federación Rusa se compromete a favor de un regreso a la negociación y a la razón y a una cooperación pacífica entre los pueblos.\\nLa tragedia en Siria es que quien está pagando los platos rotos es el pueblo sirio y por eso es absolutamente necesario encontrar la manera de reinstaurar la paz. Más allá de las rupturas, quizás sea posible despertar el resto de sentido común que aún pudiera quedar en Washington.\\nEl problema con Estados Unidos es que en este momento, antes de la elección presidencial, el mundo se halla en una situación extremadamente peligrosa. Las fuerzas que realmente dominan la política estadounidense quieren poder decidir todo lo que hará el futuro gobierno de Estados Unidos. Eso quiere decir que lo más probable es la guerra: una guerra que iría más allá de Siria.\\nSputnik : La cooperación entre las dos grandes potencias funciona hasta ahora bastante mal, aunque Rusia expresa a menudo su deseo de cooperación. ¿Cuáles son las causas de estos fracasos y qué posibilidades ve usted para la cooperación?\\nWilly Wimmer : A pesar de la falta de transparencia, yo soy optimista en cuanto a la posibilidad de un entendimiento entre ambas partes, porque lo que está en juego es enorme y las consecuencias serían mucho peores que las imágenes que actualmente nos llegan de Siria.\\nY eso podría afectarnos mañana, en una región mucho más extensa, ya que los intentos de Rusia por impedir ese escenario y contener el conflicto no corresponden a los intereses de Estados Unidos. No es la administración Obama quien define esos intereses sino las fuerzas que apuestan por la victoria de Hillary Clinton.\\nEs un esquema bastante conocido. Dada la dramática envergadura del conflicto, sólo puedo esperar que Washington acepte llegar a un acuerdo. Si eso no sucede, tendremos que vivir un desastre ampliamente superior al de Siria.\\nSputnik : Las informaciones de los medios occidentales dan la impresión de que Rusia es el principal responsable de la destrucción y las víctimas civiles en Siria. ¿Qué piensa usted de esa presentación de los hechos?\\nWilly Wimmer : En cuanto a esto, hay que establecer diferencias. Todo lo que tiene que ver con Rusia, corresponde a la misma Rusia dar respuesta y eso es lo que está haciendo.\\nEn lo que me concierne, como consumidor de los medios occidentales, lo que me parece indignante es la falsificación de los hechos que venimos viviendo desde hace años. Hubo una época en la que el pluralismo era parte integrante de nuestra cobertura mediática, pero eso ya no existe. Están empujándonos a la guerra. Eso es lo que ha podido observarse nuevamente este año. Jamie Shea, el vocero de la OTAN que nos forzó a desatar la guerra contra Yugoslavia en 1999, fue solemnemente homenajeado este año en Berlín por los servicios prestados. ¡Eso demuestra en qué estado se halla nuestro panorama mediático! La democracia en Europa está seriamente amenazada.\\nSputnik : ¿Quién defiende tales intereses y qué mensaje se quiere transmitir?\\nWilly Wimmer : El mensaje es este: estamos tocando los tambores de guerra, y también lo hacemos en relación con Rusia. Hace 2 años, en el momento del golpe de Estado de Maidan, en Kiev, evitamos por un pelo el conflicto con la Federación Rusa. Ese es el objetivo de la política estadounidense que observamos desde 1999 y es lo que puede acabar con nosotros.\\nSputnik : Usted se ha referido a los intereses de Estados Unidos pero ¿cuál es el papel de Alemania?\\nWilly Wimmer : Helmut Kohl et Gerhard Schroder todavía mantenían la fuerza de carácter necesaria para hacer valer los interereses de Alemania en el seno de la OTAN, para no involucrarse en los conflictos armados.\\nMire usted la situación actual: nuestra ministra de Defensa viaja a Irak para anunciar allí una nueva implicación militar de Alemania en ese país. Siento mucho tener que decir que Berlín no está a la altura de Bonn en lo que se refiere a salvaguardar los intereses de Alemania.\\nWilly Wimmer Fuente\\nSputnik'"}, "time": 1742562515.216683}