{"duration": 0.24080348014831543, "input_args": {"text": "' America\\x92s Rocky Road to Raqqa\\nThough the U.S. has no legal right to operate inside Syria, Official Washington is boasting about its plans to liberate Raqqa from ISIS. But another problem: the battle plan makes no sense, says Daniel Lazare. By Daniel Lazare\\n \" Consortium News \" - In her final debate with Donald Trump, Hillary Clinton promised that the United States and its allies would follow up the offensive against ISIS-occupied Mosul with an assault on ISIS headquarters in Raqqa in neighboring Syria. Last week, Secretary of Defense Ashton Carter assured the press that an offensive was on the way.\\n\\x93It starts in the next few weeks,\\x94 Carter said . \\x93That has long been our plan and we will be capable of resourcing both,\\x94 i.e. dual assaults on Mosul and Raqqa.\\n\\x93We think this is the right moment to begin pushing in Raqqa,\\x94 a Pentagon spokesman added on Monday. \\x93There is a plan in place to begin this.\\x94\\nExcept that the more the administration assures the public that an assault is just around the corner, the more distant it seems to become. In fact, it looks more and more like an assault on Raqqa won\\x92t occur at all. The reason is simple. The strategy is half-baked even by U.S. standards.\\nThe effort to take back Mosul is off to a dangerous enough start as it is. The problem is not the military campaign, which seems to be making good progress as Iraqi troops enter the city for the first time in two years . Rather, it is the larger political setting.\\nPowerful cross-currents are at work involving the Iraqi army, Turkey, Iranian-backed Shi\\x91ite militias known as Popular Mobilization Forces, or Al-Hashd al-Shaabi, and the Kurdish Peshmerga. Recep Tayyip Erdogan, Turkey\\x92s neo-Ottoman president, has unsettled the Iraqis by claiming that Mosul lies within his country\\x92s traditional sphere of influence and by vowing to protect the city\\x92s Sunni population against revenge by Al-Hashd for anti-Shi\\x91ite atrocities committed by ISIS (also known as ISIL, Islamic State, and Daesh).\\nUnfortunately, Erdogan\\x92s fears are not unfounded since Al-Hashd has already been accused of atrocities in Tikrit and Fallujah while at least one militia leader has sworn to take vengeance in Mosul as well. [See Consortiumnews.com\\x92s \\x93 Clinton\\x92s Slog Deeper into the Big Muddy .\\x94]\\nAlthough the Iraqi government has promised that the militias will confine their activities to the city\\x92s outskirts, the Iraqi army is seen as hardly less threatening since its Shi\\x91ite flags are now ubiquitous . Mosul residents also feel threatened by the Kurds since they remember all too well when the Peshmerga took over in the wake of the 2003 U.S. invasion, sparking a wave of looting that stripped the city clean .\\nShi\\x91ite militia members similarly remember when they clashed with the Kurds in the central Iraqi town of Tuz Khurma as recently as April and are leery of coming into contact with them as well.\\nLeery \\x91Allies\\x92\\nSo everyone is leery of everyone else, which means that the more such forces converge on Mosul, the greater the risk that years of accumulated fears and hatreds will reach a critical mass and explode.\\nErdogan is meanwhile refusing to abandon a military beachhead that he maintains in the small town of Bashiqa a few miles to the northeast, while Iraqi Prime Minister Haider al-Abadi is threatening that Turkey will be \\x93 dismantled \\x94 if it tries to mount a full-scale invasion.\\n\\x93We do not want war with Turkey,\\x94 Abadi said, \\x93and we do not want a confrontation with Turkey. But if a confrontation happens, we are ready for it. We will consider [Turkey] an enemy and we will deal with it as an enemy.\\x94\\nTurkey\\x92s reply has been to continue massing troops, tanks, and other military hardware on the Iraqi border just 90 miles to the north. On Wednesday, it piled on yet more abuse as Foreign Minister Mevlut Cavusoglu demanded of Abadi, \\x93If you have the strength, why did you surrender Mosul to terror organizations?\\x94\\nBut as dangerous as all this is, the situation some 280 miles to the west around Raqqa in Syria is even worse. As the U.S. tries to assemble a force capable of taking on ISIS, it finds itself picking its way through a list of contenders that is little short of dizzying.\\nIn addition to Syria, Russia and Turkey, the list includes the so-called Free Syrian Army; Kurdish People\\x92s Protection Units known as the YPG; Sunni Arabs who have joined with the YPG in an umbrella federation known as the Syrian Democratic Forces or SDF; plus the same Iranian-backed Shi\\x91ite militias in Iraq that have lately begun threatening to cross the border and join in the assault on Raqqa as well.\\nAlso dizzying are the local animosities. While Turkey gets along well with Masoud Barzani, leader of the Kurdish autonomous zone in northern Iraq, the story is very different in northern Syria, where the left-leaning YPG is dominant. Since the YPG\\x92s parent body, the Kurdish Democratic Union, is allied with the Kurdistan Workers\\x92 Party (PKK), which has been leading an insurgency inside Turkey since the 1980s, Erdogan sees the militia as no better than Islamic State and possibly even worse.\\nThe YPG feels the same way, describing Erdogan and ISIS as nothing less than brothers under the skin. The YPG is hostile to the Free Syrian Army since it took part in last summer\\x92s Turkish incursion into northern Syria, whose primary goal was to prevent Kurdish militia units in northeastern Syria from hooking up with fellow YPG fighters in the northwest. The FSA, meanwhile, is not only anti-YPG but anti-U.S. even though its Turkish sponsors are nominally pro.\\nThus, Free Syrian Army members erupted in anti-American chanting when a convoy of U.S. commandoes showed up in the Turkish-occupied town of Al-Rai in mid-September, forcing the Americans to flee .\\n\\x93Christians and Americans have no place among us,\\x94 one militant shouted . \\x93They want to wage a crusader war to occupy Syria.\\x94 Another called out: \\x93The collaborators of America are dogs and pigs. They wage a crusader war against Syria and Islam.\\x94\\nThis is one of the groups that Washington classifies as \\x93secular\\x94 and \\x93moderate.\\x94 Still, Washington\\x92s hope is that the various factions will put their differences aside long enough to \\x93liberate\\x94 Raqqa. The prospect seems unlikely especially since fighting between the Turkish-backed FSA and the YPG seems to be spreading.\\nTurkey Killing Kurds\\nOn Oct. 20, Turkish jets and artillery pounded YPG-SDF positions northeast of Aleppo, killing as many as 200 fighters. Since then, the two groups \\x96 Turkey and the Free Syrian Army on one side, the YPG and anti-Turkish Arabs of the SDF on the other \\x96 have been engaged in a struggle for control of ISIS-occupied Al-Bab, 20 miles or so south of the Turkish border and roughly the same distance northeast of Aleppo.\\nIf Turkish-FSA forces take Al-Bab, then Kurdish hopes of linking up their forces in northeastern and northwestern Syria will have been dashed. The FSA would then be in a position to push east to Raqqa, which would mean a clash with both the main body of the YPG and ISIS. Or, as the often perceptive Moon of Alabama website suggests , it could instead wheel about and attempt to relieve its fellow Salafists besieged in Aleppo.\\nThat would mean a head-on collision with Syrian government forces and exposure to Russian jets, a point that a Syrian government helicopter drove home last week by bombing Turkish-FSA forces engaged in combat with the YPG.\\nInternecine warfare like this can only benefit Islamic State, an undisputed expert at using its opponents\\x92 differences to its own advantage. This is why it was able to put down roots in Syria in the first place \\x96 because the U.S. was too busy trying to topple Bashar al-Assad to worry about an Al Qaeda offshoot that Obama famously dismissed as nothing more than \\x93 a JV team .\\x94\\nIt\\x92s also why Islamic State was able to establish bases and supply lines in Turkey \\x96 because Erdogan was more concerned with fighting Assad and the Kurds to concern himself with what his fellow Sunnis were up to. A northern Syrian and Iraqi landscape torn by infighting is perfect for a hyper-violent Sunni-Salafist group skilled at playing one group off against another.\\nThe White House dimly senses that it has gotten itself into a mess, which is why officials turn vague and inscrutable whenever reporters press for details concerning a reported assault on Raqqa. The problem, as the U.S. officials see it, is that Erdogan remains unalterably opposed to the YPG-SDF even though it is the only ground force capable of fighting Islamic State. Hence, it is impossible to take Raqqa without alienating a fellow member of NATO.\\n\\x93We do not need terrorist organizations like the PYD-YPG,\\x94 Erdogan says he told Obama in an Oct. 26 phone call , referring to the militia and Kurdish Democratic Union. \\x93I said, \\x91Come, let\\x92s remove [Islamic State] from Raqqa together. We will sort this out together with you.\\x92 We have the strength.\\x94\\nThe U.S. doubts that Erdogan does have that capability yet is unable to say no. The upshot is talks, negotiations, and growing delays. Jennifer Cafarella, a Syria expert at the neocon Institute for the Study of War, grouses that the administration is \\x93stalling\\x94 while, on the other side of the debate, foreign-policy \\x93realists\\x94 wonder why the administration is rushing ahead with a strategy that it knows won\\x92t work.\\nSkeptical Analysis\\nIn a hard-hitting analysis in the conservative but often skeptical National Interest, Daniel L. Davis, a retired army colonel and Afghan veteran, points out that whereas a national army, well-armed militias, U.S. ground and intelligence forces, and \\x93resupply lines through friendly territory\\x94 are all in place in northern Iraq, \\x93none of those things exist\\x94 with regard to Raqqa. The political problems, he adds, are even more daunting.\\nWhen Kurdish units liberated the ISIS-occupied town of Manbij in August, Davis notes, grateful residents told YPG members, \\x93You are our children, you are our heroes, you are the blood of our hearts.\\x94 Yet the YPG\\x92s reward was to be denounced as terrorists by Erdogan and instructed to leave by the U.S.\\n\\x93What possible assurances could the United States give to the Kurds,\\x94 Davis writes, \\x93that upon successful liberation of Raqqa, the Turkish army isn\\x92t going to turn on them? Why would the Turks bomb the Kurdish troops one day and then work with them the next, or allow the Kurds to maintain a presence after liberating Raqqa? There is no recognizable logic in these unsubstantiated hopes.\\x94\\nDavis is correct. But, then, there is no recognizable logic in the Obama administration\\x92s intervention in Syria in general. Why insist that Assad step down, for example, when the only effect will be to clear a path for Al Qaeda and Islamic State straight through to the presidential palace in Damascus?\\nWhy back a Turkish incursion into northern Syria when the only result is to infuriate Kurds who are the only effective anti-ISIS fighting force that the U.S. has on its side? Why insist that the U.S. wants a democratic solution to the Syrian civil war when the countries backing the anti-Assad forces, i.e. Saudi Arabia and the other Arab oil monarchies, are some of the most undemocratic societies on earth?\\nNone of it makes sense. But since the Israelis, Turks and Saudis all want Assad to go, the Obama administration feels that it has no choice but to comply. How else can it keep a fractious empire together if not by catering to its client states\\x92 whims and desires?\\nWhen empires are strong, they can afford to say no. But when they are weak and over-extended, they do as they are told. This is why the U.S. is frozen with regard to Raqqa. It can\\x92t disappoint its allies by calling an assault off, and it can\\x92t push ahead with a plan that doesn\\x92t add up. So it dawdles.\\nDaniel Lazare is the author of several books including The Frozen Republic: How the Constitution Is Paralyzing Democracy (Harcourt Brace).\\nSyria\\'s U.S.-backed SDF says no to Turkish role in Raqqa operation : \"The Syrian Democratic Forces are the only force that will take part in the operation to liberate Raqqa and we informed the (international U.S.-led) coalition forces that we reject any Turkish role in the Raqqa liberation operation,\"\\nSIL chief threatens Turkey : Abu Bakr al-Baghdadi, who is reportedly hiding out in the besieged city of Mosul, released his first message since 2015, urging followers to wage all-out war and take the fighting into Saudi Arabia and Turkey.'"}, "time": 1742564160.783642}