{"duration": 0.12813544273376465, "input_args": {"text": "'AT&T requires police to hide Hemisphere phone spying   EFF \\nAT&T built a powerful phone surveillance tool for police, called Hemisphere. Every day , AT&T adds four billion call records to Hemisphere, making it one of the largest known reservoirs of communications metadata that the government uses to spy on us. Law enforcement officials kept Hemisphere “ under the radar ” for many years—hidden from courts, legislators, and the general public—until the New York Times exposed the program in 2013. EFF sued federal and state law enforcement officials to obtain records about Hemisphere, in part to better understand how and why police kept such a massive spying database secret for so long. \\nNew documents published by The Daily Beast earlier this week reveal that AT&T required this corrosive secrecy. Specifically, the contract AT&T prepared for police seeking access to Hemisphere provides: \\n[T]he Government agency agrees not to use the data as evidence in any judicial or administrative proceedings unless there is no other available and admissible probative evidence. The Government Agency shall make every effort to insure that information provided by the Contractor is non-attributable to AT&T if the data is provided to a third-party. \\nIn other words, the first rule of Hemisphere is: you do not talk about Hemisphere. We knew this is the government’s rule. Now we know this is AT&T’s rule, too. \\nWhat do police do with the Hemisphere evidence that they cannot talk about? According to a Hemisphere training document , police must “wall off” that evidence, and then recreate it with a traditional subpoena. Police call this “ parallel construction .” EFF calls it “ evidence laundering .” \\nThe harms of secrecy \\nThis secrecy—imposed by AT&T—is highly disturbing for many reasons. Three deserve emphasis. \\nFirst, this secrecy hides Hemisphere from democratic oversight. Hemisphere enables police to map our intimate social relationships by data-mining massive amounts of our call records, usually without a warrant. Yet because of Hemisphere’s secrecy, judges cannot rule on whether the program violates the Fourth Amendment. Legislators cannot oversee the program and enact appropriate legislation. Voters cannot hold their elected officials accountable. Everyone is in the dark, except for a small number of law enforcement and corporate executives, who unilaterally decided to impose this highly intrusive program on the rest of us. \\nSecond, this secrecy deprives criminal defendants of their constitutional right to a fair trial. Under Brady v. Maryland , police must disclose favorable evidence to the defense. When police hide their sources of evidence, the accused cannot challenge the quality or veracity of the government’s investigation, or seek out favorable information still in the government’s possession. Moreover, hiding evidence from individuals who are prosecuted as a result of such surveillance is antithetical to our fundamental right to an open criminal justice system. \\nThird, the new revelation clarifies AT&T’s role in the Hemisphere program. AT&T suggests that all it is doing is passively responding to lawful government demands for information about its customers. In fact, AT&T actively imposes secrecy on police who wish to use AT&T’s Hemisphere program. AT&T’s motives for imposing this secrecy are not presently known. Perhaps AT&T is seeking to avoid public scrutiny of its Hemisphere business model , which earns millions of dollars from police officials in exchange for access to private phone records that AT&T retains for many years longer than its competitors do. \\nSadly, this isn’t the first time that police and corporations worked together to hide from the public their deployment of highly invasive spying tools. For example, corporate nondisclosure agreements contributed to years of secrecy about police use of cell site simulators, often called “Stingrays,” which masquerade as cell phone towers and thus force all phones in the area to disclose sensitive information to the police. \\nNext steps \\nWe must fully expose Hemisphere to the light of public scrutiny. EFF has used public records laws to uncover many Hemisphere records, and we will add any other documents we obtain to our public library of Hemisphere records. \\nLooking forward, we must stop the police and their corporate suppliers from unilaterally and secretly deploying new surveillance technologies in the first place. Rather, the decision whether to adopt these sensitive tools should be made by elected officials, at open meetings, following ample opportunity for the general public to study the matter and have their voices heard. EFF supports a national campaign to enact laws requiring this process. In many cases, an informed citizenry and their elected officials will say “no” to new spying tools. In other cases, elected officials will impose necessary privacy safeguards. \\nAT&T and the police tried to keep Hemisphere secret. They failed. The time has come to end the Hemisphere program. As a matter of constitutional law and basic privacy principles, the police should not be allowed, without case-by-case judicial oversight, to scrutinize our social relationships with a database of trillions of phone records. Related Cases:'"}, "time": 1742561789.339779}