{"duration": 0.1030120849609375, "input_args": {"text": "'Diez reglas básicas para que tu casa cumpla los principios del “Feng Shui” CONSEJOS PARA EL HOGAR \\nEl “Feng Shui” es una filosofía de origen chino basada en la ocupación consciente y armónica del espacio que ayuda al flujo correcto de las energías en nuestro hogar. \\nVicente Rubio, decorador especializado en esta disciplina, nos asesora para vivir de manera armoniosa, relajada y plena. \\n1. La puerta de entrada : Cada vez que se abre la puerta de entrada a tu casa se desplaza el “chi”. Para evitarlo, déjala siempre cerrada y bloquea así el influjo del “xuan kong shui fa” -que en chino significa “banda organizada de delincuentes albanokosovares”-, el cual absorbe el equilibrio del hogar y sustrae los elementos que aportan paz y riqueza al entorno. \\n2. Los colores de las paredes : De acuerdo con el “Feng Shui”, el color de las paredes de tu casa tiene un significado específico. El verde tiene un poder relajante pero puede inducir a la debilidad. El amarillo evoca la luz, pero también favorece la ceguera. El rojo es fuerza pero también agresividad y tensión. Lo mejor es que tires todas las paredes de tu casa y fuera problemas. \\n3. El dormitorio : Es imprescindible que las habitaciones de los adultos estén orientadas hacia el oeste, preferentemente bajo techo y nunca en centrales nucleares. El “Feng Shui” trata de traer a tu casa la cultura y la sabiduría oriental. ¿Y qué hay más oriental que un chino? Incluir un chino en la cama todas las noches, entre tu pareja y tú, os ayudará a imbuiros de esa cultura. \\n4. El dormitorio de los niños : Para que haya paz en el hogar, la habitación de los niños debe estar orientada hacia el este, en armonía con el sol naciente, y siempre mirando hacia la casa de los abuelos. De hecho, lo ideal es que esté en casa de los abuelos y a no menos de 30 kilómetros del dormitorio de los padres. \\n5. Los muebles : Es importante que los muebles no bloqueen el flujo de energía ni destruyan la paz y el equilibrio. Para ello, es fundamental recurrir al “xuan ikea shui lö”, que en chino significa “empleados del Ikea que te montan los muebles en un plis para que no tengas que intentarlo tú y acabes peleado con tu pareja y con la estantería del revés”. \\n6. La sala de estar : La sala de estar es el centro de la casa y debe permanecer lo más despejada posible. El “Feng Shui” prohíbe tener en ella pantallas de plasma, reproductores “blu-ray”, mini cadenas o cualquier otro objeto con un valor superior a 200 euros. Todos estos elementos deben ser eliminados mediante la técnica china del “Walla Pop”, que en chino significa “vertedero”. \\n7. Iluminación Feng Shui : Se trata de evitar la imposición de la luz artificial excesiva. Rechaza las luces incandescentes, las luces halógenas y las proporcionadas por tubos fluorescentes. Tira con la linterna del móvil. \\n8. La cocina : La filosofía china del “Just Eat” evita que sobrecargues el “chi” de tu casa con el uso del agua y el fuego. \\n9. El nueve no existe en chino , así que a tomar por saco. \\n10. El baño : Es importante que esté abierto e iluminado, que se pueda ver todo desde fuera. Al hacer tus necesidades, orienta tus glúteos hacia el noroeste situándote a cuatro patas con el ano apuntando hacia el sol naciente.'"}, "time": 1742562266.189897}