{"duration": 0.05040740966796875, "input_args": {"text": "'The Russian parliament has ordered an investigation into U. S. media organizations, including CNN and the Voice of America, “for compliance of their activities with Russian legislation,” according to a statement made on its website Friday. [The State Duma, or lower house in Russian parliament, ordered an “audit” of Radio Liberty, the Voice of America, CNN, and other U. S. media to see if they are breaking any of the nation’s laws, USA Today reported.  The decision was reportedly made in retaliation against a bill introduced by Sen. Jeanne Shaheen ( ) earlier this week that would allow the Department of Justice to use more tools to investigate   Russian media outlet RT America for potential violations of the Foreign Agents Registration Act (FARA). “We have good reason to believe that RT News is coordinating with the Russian government to spread misinformation and undermine our democratic process,” said Shaheen in a press release. “The American public has a right to know if this is the case. RT News has made public statements boasting that it can dodge our laws with shell corporations, and it’s time for the Department of Justice to investigate. ” Maria Zakharova, spokesperson for the the Russian Foreign Ministry, criticized Shaheen’s bill, saying that the senator should have also drawn up a list of books for burning, Reuters reports. Margarita Simonyan, RT’s    told the Russian newspaper Izvestia that the legislative action to investigate the   news outlet was akin to Sen. Joseph McCarthy’s campaign against communism in the 1950s. The Russian parliament’s decision came just two days after U. N. Ambassador Nikki Haley told NBC News that the Russian government cannot be trusted. “We cannot trust Russia,” Haley said on Wednesday. “We should never trust Russia. ” Haley made those comments shortly after the Department of Justice charged two Russian spies for allegedly hacking into and stealing data from more than 500 million Yahoo users.'"}, "time": 1742563901.9289758}