{"duration": 0.1228632926940918, "input_args": {"text": "'After the killings in Dallas, David O. Brown, the city’s police chief, became the face of the nation’s shock. At multiple news conferences, he sorted through a jumble of reports, some of them wrong, as he narrated the standoff between his officers and the gunman. But he also offered simple, emotional words: “We’re hurting,” he said on Friday morning, in a moment of shared public grief. His appearances may also have evoked a more personal grief. Just weeks after Chief Brown became the leader of the Dallas Police Department in 2010, his own son fatally shot a police officer and another man before being killed in a confrontation with the police. “My family has not only lost a son, but a fellow police officer and a private citizen lost their lives at the hands of our son,” he said in a statement at the time. “That hurts so deeply I cannot adequately express the sadness I feel inside my heart. ” Since taking over the Dallas department, one of the nation’s largest, Chief Brown, 55, has earned a national reputation as a progressive leader whose top priority is improving relations and reducing distrust between the police department and the city’s minority residents. His efforts began long before 2014, when the fatal police shooting of Michael Brown in Ferguson, Mo. and the chokehold death of Eric Garner in New York made such initiatives a necessity for many police chiefs. Chief Brown “has been doing this before he had to,” said Chuck Wexler, director of the Police Executive Research Forum, a law enforcement policy group. “He recognized what happened, what is going on in the country. ” Chief Brown, who is   and a   Dallas native, joined the city’s police force in 1983. In a panel discussion with Mr. Wexler’s group in 2014, he said that his 30 years on the force as well as stories told by his grandparents had taught him how, in some neighborhoods, police abuses are remembered for decades. In Dallas, he has invited public scrutiny as police chiefs in few other cities have. While other departments often try to delay the public identification of officers involved in shootings, his department often releases the names. Chief Brown’s main push has been geared toward reducing the use of force by officers in encounters with citizens. And he has had some success. Still, though the overall number of police shootings appears to have dropped substantially on his watch, the circumstances of some  —   including the fatal shooting of a   man holding a screwdriver last year  —   have continued to draw criticism. Chief Brown has drawn attention for his willingness to question even the most basic tenets of policing  —   like chasing bad guys under any circumstance. While some departments have put restrictions on car chases  —   which can end in fatal    —   Chief Brown began to question whether officers should even give chase on foot in certain instances, said Mr. Wexler, whose organization assisted in the city’s search for a police chief in 2010. Chief Brown’s concern, Mr. Wexler said, was whether such chases increased the risk of shootings by the police. “It’s ironic this madman would pick Dallas, one of the cities that is a leader in reducing   shootings,” Mr. Wexler said. A press representative for the City of Dallas said Chief Brown was declining interview requests. Yet Chief Brown’s efforts have left him as a somewhat embattled figure in Dallas. He has fought with the police union over his emphasis on   community policing  —   the use of   enforcement strategies  —   and his willingness to fire officers, dozens of them, often publicly. “Chief Brown thinks that we should clean our own house before we expect others to clean theirs,” said Don Stafford, a retired member of the department who was one of the first black police officers to rise high in the ranks. Chief Brown has been grappling with some grim statistics this year. Crime has ticked up, with the governor offering to send in state troopers. Criticism does not seem to easily faze him. “Chief Vindictive, yadda, yadda, yadda,” he said during an interview in February, dismissing his critics within the department. “I mean that’s the badge of honor right there. ” In the same interview, with the Dallas Observer, he said his goal of orienting the department toward community policing was “worth getting fired over. ” The Dallas department’s national reputation had long been shaped by the events of November 1963. After President Kennedy was assassinated, his killer was gunned down in the basement of Police Headquarters while in custody, under lax security. “This happened in their town and then the guy gets killed in their police station,” Thomas A. Reppetto, a police historian, said in an interview. “It just destroyed the reputation of the department. ” Chief Brown’s efforts have raised the department’s profile while putting it at the forefront of a national debate over how the police can regain the trust of citizens. In Thursday’s attack, the deadliest for law enforcement officers in America since Sept. 11, 2001, he saw further urgency in this debate. “All I know is that this must stop  —   this divisiveness between our police and our citizens,” he said on Friday.'"}, "time": 1742563247.2645576}