{"duration": 0.0933232307434082, "input_args": {"text": "'A federal judge has extended Florida’s voter registration deadline to Oct. 18, agreeing with voting rights advocates and the state Democratic Party that damage from Hurricane Matthew threatened to deprive some residents of their right to cast a ballot. The decision on Wednesday had major political implications in a swing state where, the party’s lawyers said, Democrats make up a disproportionate share of those who register in the final week. Florida and North Carolina, which also has a tight presidential race, were two of the five states battered last week as Hurricane Matthew moved up the coast, lashing northeastern Florida and causing severe flooding in North Carolina. North Carolina officials said on Tuesday that they would address any problems. “We are working with each county with damage or anticipated damage to ensure they have polling places available for early voting and Election Day,” the executive director of the State Board of Elections, Kim Westbrook Strach, said. But in parts of the state that were underwater, residents had other problems on their mind. “The focus now is on making sure people are safe,” Merwyn Smith, a pastor and a member of the Lenoir County Board of Education, said in Kinston, N. C. “A lot of voters are not going to be focused on voting right now. ” Mr. Smith knows that now is normally the time for a final registration push. But on Wednesday, he was delivering bottled water to a shelter, where 166 people were hunkering down ahead of dangerous flooding expected this week. Across the state, thousands have been rescued or evacuated as swollen inland rivers flood neighborhoods, destroy cars and shut down major roads. The chaos, Mr. Smith said, is likely to hinder early voting, which starts Oct. 20. Florida’s and North Carolina’s responses to the storm have received especially close scrutiny both because of the states’ significance in the presidential race and because of allegations of political bias. A federal appeals court struck down North Carolina’s   election law in August, saying it had been crafted to suppress voting by  . In Florida, the Republican state government has limited voter registration drives, shortened the   period and limited voting by   since Gov. Rick Scott took office in 2011. Critics say that all three actions disproportionately affect Democratic voters. Democrats sued Mr. Scott after he refused to extend the state’s Oct. 11 registration deadline, even though much of Florida’s east coast had been evacuated and all state offices had been closed before the hurricane hit. News accounts quoted the governor as saying, “Everybody’s had a lot of time to register,” and brushing off the potential impact on the election. “Look, this is, this is politics,” he said. Both the Democrats and the League of Women Voters, which sued Mr. Scott separately, disputed his analysis. They noted that as many as 181, 000 Florida residents had signed up to vote in the last nine days of registration in 2012. Lawyers for the state Democrats noted that   registrants tend to be young or minorities, two heavily Democratic groups, and that Mr. Scott heads a “super PAC,” Rebuilding America Now, that supports the Republican presidential nominee, Donald J. Trump. Mr. Scott had argued that he lacked the authority to extend the deadline, but Judge Mark Walker, of the United States District Court for the Northern District of Florida, said both federal law and the Constitution justified doing so to protect the right to vote. “No right is more precious,” Judge Walker said. In North Carolina, Gov. Pat McCrory, a Republican, said Monday that he had not decided whether to extend the state’s Friday registration deadline. “Let’s see how we get through this week and see what the status of the voting, early registration sites will be,” Mr. McCrory said. “I won’t close that option at this point in time. ” Unlike Florida, however, North Carolina allows voters to register and cast a ballot at the same time during an early voting period that begins next week, giving those who miss the deadline a second chance to sign up. Three other states  —   Georgia, South Carolina and Virginia  —   suffered less hurricane damage and little disruption to their election preparations, officials in each state said. Sekethia Baker, a behavior specialist who was talking with Mr. Smith in Kinston, said she expected storm damage to hamper the     efforts in which she typically participates. “Just getting people’s focus back on voting,” she said, “it’s going to be hard to get that motivation back. ”'"}, "time": 1742561937.2841039}