{"duration": 0.0459139347076416, "input_args": {"text": "'November 17, 2016 \"Fake News\" About Trump Continues Unabated \\nClinton makes some twenty different issues or person responsible for her loss - everyone and everything except the DNC, her staff or herself. But a campaign that did just enough to get the states it thought it needed and not one bit more was going to lose no matter how much money it would spend. Shunning progressives and implausibly blaming Russia for her own mistakes did not help either. She failed as a candidate and politician. It is just as simple as that. But now another culprit responsible for her loss is rolled out. \"Fake news\" that somehow wasn\\'t sorted out on social networks. \\nBut my personal impression was that there was more fake news about Trump than about Clinton. The NYT like most other mainstream media was so much off from reality that its publisher now wrote a letter to request that staff \"rededicate .. to the fundamental mission of .. journalism\". He thereby admits that the NYT had failed as a news organization. \\nBut there is no rededication, neither in the NYT nor elsewhere, that I can see. The fairy tales about and around Trump seem not to stop for a minute. It will be claimed in top headlines that Trump will make John Bolton or Rudy Giuliani Secretary of State, lunatic Frank Gaffney will be his advisor. Trump wants security clearances for his children! Of course hardly any the active promoters of such nonsense will put the official denials of these lies on top of their pages or mention them at all. Poltico today told me that Wall Street is celebrating the Trump win, implying that Clinton would have been much better. Trump received some $5 million in donations from the finance sector, Clinton received $105 million - guess why. \\nTrump wants to abandon a No-First-Strike policy for U.S. nuclear weapons is one current scare (650 retweets!). That is a policy the U.S. never-ever had. Obama, like Clinton, rejected a NFS policy. How could Trump abandon it? Trumps wants to register all Muslims? The National Security Entry-Exit Registration System was introduced in 2002 and only applied to visitors and residents from majority Muslim countries. (In 2011 the system was replaced with a new one that practically has the same purpose.) The no-fly-lists are largely lists of Muslim - even four years old ones. Obama waged drone war in seven countries and bombed five. All were majority Muslim. So what please could Trump actually do to Muslim people that would be worse than what Bush or Obama have done? \\nTrump is a racist and his voters are white supremacists is a fake news claim that is still rolled out on a daily base. The facts do not support it. If they were true why did he get more votes from blacks and hispanics than Romney or McCain? \\nWhy not take Trump for what he is? A fast talking salesman, born too rich, but politically a centrist who long supported Democrats and who will simply continue the political path Clinton, Bush and Obama created and walked before him. There is some hope that he will be less \"globalist\", neoconned and belligerent in his foreign policy but that still needs to be proven. On many of his announced policies there will likely be more Democrats in Congress supporting him than Republicans. \\nThe man should be attacked on his politics and policies whenever that is justified. There will plenty such opportunities, especially with his economic and tax plans. Instead we get a daily dose of fake news about Trump this or that and one scare story after the other. \\nIs it so difficult, or even impossible, for journalists and media to \"rededicate\" themselves from feverish pro-Clinton and anti-Trump advocates back to (semi-)serious reporting? \\nThat would be bad news for everyone. Posted by b on November 17, 2016 at 01:25 PM | Permalink'"}, "time": 1742564473.3412027}