{"duration": 0.03890633583068848, "input_args": {"text": "'“The true minimum wage rate is zero —  the amount an unemployed person receives from his   job,” Milton Friedman wrote in Newsweek 45 years ago. Two economists writing about the decision of St. Louis city fathers to boost its minimum wage come to a similar conclusion. [Dr. David Macpherson of Trinity University and Dr. William Even of Miami University posit in a study that St. Louis stands to lose more than 1, 000 jobs after its minimum wage skyrockets 43 percent to $11 an hour next year. Roughly 25, 000 workers in the city currently make minimum wage. The academics found women, teenagers, and those with a high school degree or less disproportionately constituting those at greatest risk for suffering (or benefitting) as a result of the law.  “It turns primarily on the fact that those are the workers that are most likely to be earning the minimum wage to begin with,” Dr. William Even told Breitbart News. “To a    college graduate, the minimum wage is irrelevant. ” A state law capped the Show Me State’s minimum wage at $7. 65 an hour. But St. Louis workers demanded that local government force businesses to “show me the money. ” A court challenge enabled the state’s most populous city to mandate a higher hourly rate for workers. “Some of those workers are going to get a pay raise,” Even explains. “They’re the ones who are better off. Other workers are going to lose their jobs. They’re the ones who are worse off. ” The employees affected, for good and ill, by the law disproportionately work in retail and food services. Automation, passing costs on to consumers, and simply doing more with fewer employees remain options for businesses. Most states impose a minimum wage on employers above what the feds demand. Dr. Even sees cities increasingly imposing higher minimum wages on their businesses, too. “If we look at the last twenty or so years, we’re seeing a lot more states, as well as local communities, raising the minimum wage above the federal level,” Even tells Breitbart News. “We’re seeing heterogeneity in the minimum wage levels in the states and cities across the country. San Francisco is going to $15. Seattle is going to $15. L. A. has gone up. St. Louis is going up. It’s a long list. ” The federal minimum wage remains at $7. 25, the amount mandated by a law passed during the first year of the Barack Obama administration.'"}, "time": 1742564172.1727087}