{"duration": 0.08414649963378906, "input_args": {"text": "'By Jay Syrmopoulos\\nThe goal of U.S. policy in Syria doesn’t get any more clear; the actual mission being supported by the United States in Syria is regime change, not fighting ISIS.\\nReports this week indicated that Islamic State militants were decimated by recent Russian airstrikes, and have lost “most” of their ammunition, heavy vehicles and equipment in the precision strikes, according to the Russian Defense Ministry.\\nAn array of Russian bombers and ground support aircrafts targeted Islamic State (IS, formerly ISIS/ISIL) sites in the provinces of Raqqah, Hama, Idlib, Latakia and Aleppo, according to the Russian Defense Ministry. The attacks reportedly destroyed command posts, heavy weapons, ammunition and armament depots, military vehicles, plants producing explosives, field camps and bases.\\nA report by RT stated :\\nAccording to intercepted communications, the militants suffer from shortages of ammunition, small arms and grenade guns. Several commanders allegedly say they will withdraw their units unless their ammunition needs are satisfied.\\n“Russian airstrikes resulted in the elimination of the majority of ISIS ammunition, heavy vehicles and equipment,” the Defense Ministry tweeted.\\nRussian anti-terror military operations in the Syrian theater were launched on September, 30, at the request of the Syrian government. The United States has since accused Russia of targeting moderate opposition in Syria, but Moscow says it is after terrorist groups such as IS and Al-Nusra Front.\\n#SYRIA Russian air strikes resulted in elimination of the most part of #ISIS ammunition, heavy vehicles and equipment\\n— Минобороны России (@mod_russia) October 13, 2015 \\n\\nTo understand the U.S. position, one has to understand the rapidly evolving U.S. strategy in Syria.\\nThe Obama Administration recently announced that its $500 million plan to train and equip vetted “moderate” rebels was a total failure. Incredibly, the U.S. came up with an even worse plan – remove the training and vetting requirement of the program , and start sending military equipment.\\nThe new protocol embraced by the U.S. would require only leaders of the rebel groups to be vetted. Once the leader of the group is vetted weapons would flow to the group, no questions asked.\\nMoving quickly to operationalize their new strategy, the U.S. airdropped 50 tons of weapons and ammunition to the newly branded “Syrian Arab Coalition” forces — a U.S. rebel group re-branded, but known for its unreliability and willingness to hand weapons over to al-Qaeda and ISIS.\\n“Probably 60 to 80 percent of the arms that America shoveled in have gone to al-Qaeda and its affiliates,” according to Joshua Landis, a Syria expert at the University of Oklahoma.\\nIt seems quite obvious that while the U.S. likely supplies al-Qaeda affiliate the al-Nusra front, Ahrar al Shams, and other jihadists in the Syrian combat theater, the idea that the U.S. is once again using the al-Qaeda terror network, similarly to how they were used to fight a proxy war against the Soviet Union in Afghanistan, should give pause to every American as a potential replaying of past U.S. foreign policy failures.\\nIn addition to the U.S. airdropping 50 tons of weapons to Syrian rebel groups, Saudi Arabia delivered 500 TOW anti-tank missiles to anti-Assad Syrian rebels.\\nHighlighting the actual motivation behind the U.S. and Saudis supply rebel groups heavy weaponry, TOW anti-tank missiles provided to the rebels by the US and its allies have not been used against ISIS, but to strike Russian-made tanks of the Syrian Arab Army as it fights against al-Qaeda and ISIS.\\nThe goal of U.S. policy in Syria doesn’t get any more clear; the actual mission being supported by the United States in Syria is regime change, not fighting ISIS.\\nAccording to a report by the Ron Paul Institute :\\nThe TOW missile program is a CIA program, separate from the failed Defense Department rebel training program. The CIA has been arming and training unvetted rebels — many if not most foreign mercenaries rather than Syrians — to overthrow the Assad government since 2011 or 2012. The shot in the arm it has received from new shipments is obvious, as one rebel commander describes a recent attack on Assad’s forces:\\n‘It was a tank massacre,’ said Capt. Mustafa Moarati, whose Tajamu al-Izza group says it destroyed seven tanks and armored vehicles Wednesday.\\nMore missiles are on the way, he said. New supplies arrived after the Russian deployments began, he said, and the rebels’ allies have promised further deliveries soon, bringing echoes of the role played by U.S.-supplied Stinger anti-aircraft missiles in forcing the Soviet Union to withdraw from Afghanistan in the 1980s.\\nThe current strategy being undertaken is a virtual instant replay of the 1980s US proxy war against the Soviet Union in Afghanistan. The U.S.’s arming of Afghan Islamist rebels to defeat the USSR, directly resulted in the attacks of 9/11 and the ongoing global war on terror. It would be a grave mistake for the U.S. to once again repeat the same mistakes of the past.\\nIt’s stunning how quickly American politicians disregard the clear and present dangers of arming Islamist extremists in an effort to spur regime change. The reality that the U.S. government is supplying weapons to the same extremist groups that attacked the twin towers should serve as a wake-up call to the corrupt nature of international power politics.\\nSource: Mint Press \\nVia: Global Research \\n'"}, "time": 1742562992.2276194}