{"duration": 0.4466516971588135, "input_args": {"text": "'Fall and Rise of the Forgotten ‘Deplorables’ November 22, 2016 \\nThe political gamble that will be the Trump presidency traces back to the desperation of Americans who lost out in the social experiment of neoliberalism — and the Democrats’ candidate who personified those economic inequities, says Greg Maybury. \\nBy Greg Maybury \\nIn horseracing parlance, when a particular horse wins unexpectedly the bookmakers’ call this a “turn-up for the books.” In more general usage, the phrase came to mean an unexpected piece of good fortune, a pleasant surprise, or something generally welcomed especially if not deemed likely. While conceding those who didn’t want nor expect it might think otherwise (not least the “defeated favorite”), if we confine its meaning to this usage, Donald Trump’s Oval Office win by any definition is a “turn-up for the books,” the best example — this side of Harry Truman in 1948 at least — the Grand American Narrative has to offer. President-elect Donald Trump \\nAs might be anticipated, in the wake of Trump’s historic victory — a win that for all sorts of reasons has shaken the Beltway establishment and beyond to its core, and one that political junkies will be fixating on for years — there’s been much handwringing about how so many folks got the outcome so wrong. All of this has been accompanied by the obligatory hyperventilating and existential angst about what Trump’s election portends for the future. \\nHis campaign both revealed — and “reanimate” — the tectonic forces that hold sway in the political equivalent of the San Andreas Fault , a long-neglected fault-line in American politics that has been waiting to let rip for decades. At the risk of overcooking the geological metaphors, we might imagine that if folks were presented two highly improbable scenarios before this election and had to bet their house on only one as the more likely outcome — the choice here being either a Trump win or California sliding into the Pacific Ocean after the actual San Andreas finally lets the “big one” rip — many might have picked the latter. Now, expect political aftershocks until further notice. \\nThe reality — to say little of the irony — of a political neophyte and ostensible outsider winning a U.S. presidential election (to say nothing of claiming the actual nomination whilst summarily seeing off 16 of his own party’s rivals in the primaries) without the support of said party, Wall Street or the mainstream media and with half the money of his opponents by breaking every rule in the electioneering field book then defeating the other party’s nominee, a seasoned campaigner and professional career politician whose own party (and the usual “suspects,” the MSM, Wall Street, Israel Lobby et. al.) all had earlier anointed as the presumptive nominee from the start and whom they all collectively backed to the hilt — from the still relatively popular incumbent on down — with the most effective, ruthless, formidable, sophisticated, cashed-up political machine ever assembled, must indeed be unprecedented. \\nWith Clinton herself winning the popular vote convincingly ( some suggest it could nudge 2 million), this of course is not a “landslide” in any conventional sense, and is not quite the conservative “revolution” some pundits are breathlessly celebrating. But as noted few if any election outcomes were as unexpected. To the extent it represented a “landslide” of sorts, in this case it was a “landslide” of the contemporary political imagination in; the substrata has shifted underneath people’s feet and moved to spaces that were hitherto unthinkable, and possibly about which few might lay claim to having much idea of what to expect. \\nAnd this is happening at both ends of the political spectrum and just about every key point in between, with the Bernie Sanders factor testament to that. Even if on the face of it with the Republicans winning, both parties will now have to reinvent themselves not just as a matter of course, but of survival, at least as major political forces. Such is the extraordinary nature and character of this election and its outcome! \\nWin or lose though, Trump’s impact was always going to necessitate a whole rethink about the way politics is conducted in Washington, a “rethink” both parties will avoid at their peril. That “rethink” should entail everything from how they function as political parties and how they manage themselves and how they position themselves with voters, to how they interact with each other at the Congressional cum legislative level so they begin managing national affairs more in the interests of their constituents than those of themselves and their families, their political cronies and/or corporate benefactors. More than that, they will need to be seen to be doing so. \\nLet there be no mistaking it. The Republicans are no less on the take than are the Democrats — albeit with in some cases different constituencies and for possibly different reasons. And they are no less so because of their windfall victory now than they were before the campaign even started. The GOP did win by default in some respects, with no shortage of people not unreasonably seeing the Democrats as losing more than the Republicans winning . \\nThat neither party comes up smelling like roses in the scheme of things then is a longstanding reality brought into much sharper relief by this election. There are still for example many unanswered questions about the degree to which both parties played fast and loose with fundamental democratic principles and electoral legalities , about which there was relativity little reporting in the MSM. \\nIn the aftermath, many will rightly question not only Hillary Clinton’s suitability as the party’s nominee; courtesy of the revelations about the manner in which the Democratic National Committee’s primary campaign was conducted, they will also be able to question her political legitimacy as the nominee and, especially, the integrity and credibility of the party machine mindset that plotted her ascension. Indeed, that should be a prerequisite going forward for party reform. \\nYet if the Republicans think Trump’s win — while retaining control of both the House and Senate — redeems them and their party in the eyes of voters or the citizenry in general, one expects they will be sorely disappointed as we move forward. And this is only partly attributable to the fact Trump was not their preferred choice of candidate; indeed, he was rejected by many, a point we should never forget. \\nThe seeds of discontent ushering in Trump then may have been planted some time back, but the current GOP fraternity and their forbears cleared the ground. Whether in opposition or in the White House, the GOP also has tended the neoliberal and globalization garden. Trump’s campaign rhetoric aside, it remains to be seen how much of an enthusiast he will be for more of the same. \\nSkin in the Game \\nThere can be little doubt the election outcome reflected considerable dissatisfaction with President Obama. Because he had so much skin in the game (his legacy for one thing), the President personally has to cop much of the rap for the rise of Trump (or even someone like him). The corollary to this is the President also accepting responsibility for the defeat of his own party when there was an obvious alternative in Bernie Sanders, someone who clearly tapped into much of the prevailing sentiment in working- and middle-class America that Trump did. President Barack Obama walks through the Rose Garden to the Oval Office following an all-appointees summer event on the South Lawn, June 13, 2016. (Official White House Photo by Pete Souza) \\nAfter noting that Clinton’s and the Democrats’ loss wasn’t a defeat by default, Walden Bello says in an article titled “How Obama’s Legacy Lost the Elections for Hillary” that instead of jobs and relief, Obama offered only half-measures to folks we call here in Australia “ battlers, ” in this case especially struggling people in the Rust Belt and beyond, the broad demographic that delivered victory for Trump. Bello says, “On the economic issues that motivate these voters, Trump had a message: The economic recovery was a mirage, people were hurt by the Democrats’ policies, and they had more pain to look forward to should the Democrats retain control of the White House.’ \\nThere was a telling report emanating from Obama’s European visit that gave us an insight into the incumbent President’s preoccupation with Trump and what — in his mind at least — to make of his victory. Quite apart from hinting at something of a personal struggle coming to terms with it, the President seemed also at pains defending his legacy from an all-out Trump onslaught next year. \\n“ Americans chose Donald Trump … because of a vague ‘change’ desire,” the President said, while insisting that voters “don’t always know what they’re looking for.” Obama added, they may opt for change, “even if they’re not entirely confident what that change will bring.” The President reportedly went further, saying he “could have precluded Trump’s populist uprising if only [the Republicans] hadn’t blocked so many of my economic proposals.” \\nAlthough it appeared to escape him when he made these remarks, the irony of the first part of Obama’s comments should not be lost on anyone else, given the considerable gap between the amount of vague change he promised and actual change he delivered (or for many, failed or declined to deliver). \\nIn short, this can and does apply to Obama himself. To the extent voters “don’t always know what they’re looking for,” we might now at least argue they are less equivocal about what sort of change they don’t want and aren’t looking for! And the subtext here might have been: Did they know exactly what they were looking for when they voted him into office, twice ? \\nAs for Obama’s not unreasonable comments about GOP obstructionism throughout his time in office (a reprehensible tactic on their part that notwithstanding their recent electoral success and now dominance of the Beltway, has come at great and possibly permanent cost to the party’s brand), we might ponder an alternative question for the incumbent: \\nCould Obama have “precluded” Trump’s rise or impact by ponying up on a few more of his core promises, spending his political capital more wisely and fairly, more dutifully avoiding the errors of judgment, arrogance and political shenanigans of his much-reviled predecessor, and showing Main Street America in general and America’s “battlers” in particular he was the real McCoy after all, a president truly in their corner and not just another Wall Street political front-man cum errand boy? \\nWe can’t answer that question of course with absolute confidence, suffice to say the “answer” is destined to become an enticing, enduring counterfactual. But there can be little doubt Trump’s appeal and subsequent success was driven by the lost promise — actual or perceived — of the Obama years, and the President must be acutely aware of this. \\nIn truth Number 44 has no one else to blame but himself if Trump dismantles all or even part of his legacy. With a backward nod then to the earlier horse-racing motif, the President backed the wrong “horse” — even betting the farm — when in Bernie Sanders he, the DNC and the party faithful had an eminently electable alternative to the “Queen of Chaos.” Given the way the DNC campaign was conducted – the Democratic leaders’ own appalling shenanigans showcased in all their “ugly glory” courtesy of the Podesta email “reveals” — that , we can now safely say, was never going to happen. \\nIn the Paradise of Opportunity \\nAbove and beyond Obama (or for that matter any previous president since Reagan at least), Trump’s win then has also been driven by a widespread, deep-seated lack of faith and trust — accumulated over the past few decades — in the integrity of the democratic system of government and contempt for those who purport to represent the people’s interests. The run-down PIX Theatre sign reads “Vote Trump” on Main Street in Sleepy Eye, Minnesota. July 15, 2016. (Photo by Tony Webster Flickr) \\nIn what must serve as the quintessential master class of prolonged, consistent, truly bi-partisan cooperation American politics has on offer, both parties have contributed enormously over the past three-plus decades to the dismantling if not effective destruction of the American Dream in its hitherto real and imagined dimensions. \\nWhether on broad economic, social, national security, or foreign policy issues, both parties have demonstrated a recidivistic, palpable indifference to the concerns and needs of average working- and middle-class Americans, with both repeatedly showing themselves prone to elitism, corruption, cronyism, manipulation, greed, deception, bribery, hypocrisy, opportunism, self-interest, contempt, cynicism and arrogance. \\nIn the process democracy’s once “proprietary” domains — equal justice, freedom, human rights, equality of opportunity, civil rights, liberty, and most everything from habeas corpus to the pursuit of happiness — have effectively been declared “no-fly-zones” for ordinary people, accessible only to those increasingly privileged, mostly unelected, and thoroughly unaccountable few. \\nMost significantly, both parties have undermined, possibly irreparably, the sense of pride and place folks had in their once beloved — but now maybe not so — United States of America. Along with that, they have all but conspired to “deep-six” that once famously enduring, optimistic mindset that by some accounts enabled the country to thrive and prosper as a “paradise of opportunity” (or even a reasonable facsimile thereof). \\nLet’s term that period The Era of Future Promise, or that time in history — from 1945 to say 1975 — where a whole generation or more of the majority of folks could not only envision a progressively better future for their kids and grandchildren, but anticipated it, and all things equal, if one was willing to strive for such, rightfully expected it. \\nThat is no longer the case for an increasing number of people, and it is this sentiment — one whose seismic impact we have just witnessed — that’s been neglected by both party majors. That this envisioned future is no longer realistic for many comes as a direct result of neoliberalism — the roll-out of which was overseen by both parties — and with it the globalization of economic and financial activity itself culminating from there via “casino capitalism” in the inexorable transfer and consolidation of historically unprecedented wealth, power, and income into the hands of fewer and fewer people — is inarguable. \\nNow the end of this earlier era might have been heralded by Reagan’s ascension in 1981 and the advent of neoliberalism. But its sustained demise was enthusiastically presided over by Bill Clinton, in cahoots of course with this year’s DNC candidate for president, his wife Hillary, and the then Party establishment. Some folks clearly haven’t forgotten that. In short, there was no clear sign from Clinton that things would be substantially different under her regime than under that of her husband’s administration. \\nThe Democrats will seek elsewhere to attribute blame for their loss — it was the FBI’s James Comey and his on-again/off-again investigation of Clinton’s email servers; it was voter suppression and racism; it was Bernie Sanders campaign and misogyny; it was third parties and independent candidates; it was the corporate media for giving Trump the platform, social media for being a bullhorn, and WikiLeaks and/or the Russians for airing the DNC dirty laundry. \\nNaomi Klein had this to say about the result: ‘But this leaves out the force most responsible for creating the nightmare in which we now find ourselves wide-awake: neoliberalism. That worldview — fully embodied by Hillary Clinton and her machine — is no match for Trump-style extremism. The decision to run one against the other is what sealed our fate. If we learn nothing else, can we please learn from that mistake? Here’s what we need to understand: a hell of a lot of people are in pain. Under neoliberal policies of deregulation, privatization, austerity and corporate trade, their living standards have declined precipitously. … They have lost jobs. They have lost pensions. They have lost much of the safety net that used to make these losses less frightening. They see a future for their kids even worse than their precarious present.” \\nThere can be little doubt that fundamental to Trump’s win — and it should be emphasized, no less so than with Sanders’s popularity and success — was a feeling the trickle-down of the Reagan years did not work for most. This can be seen as the first genuine, appreciable expression of that frustration. \\nIn his entreaties to voters to bring the jobs back for example, Trump promised them something that almost certainly he will struggle to deliver even if he is serious about making it a policy priority, but in doing so he clearly tapped into a rich vein of discontent. \\nCleaning the Stables \\nThis election has exposed a major chink in the armor of the hitherto impregnable, indomitable two-party-system, seen now by more as corrupt, decrepit, and bankrupt. The rise and impact of political outliers such as Trump and Bernie Sanders on largely opposite ends of the standard political spectrum is pro-forma evidence grassroots Americans — especially those not welded to that system and have legitimate grievances about the direction in which the established elite are taking them — are onto something. The Wall Street bull statue by Arturo Di Modica \\nThat the additional reality this situation is deteriorating even further across almost all strata of the “Main Street” political economy and permeating all aspects of life once synonymous with — and essential to claiming a stake in — the American Dream (even in its more modest imaginings), should be obvious to all but the most politically myopic or deluded. \\nBut while the ties that bind Uncle Sam and all he stands for to his long-suffering subjects are strong, it remains to be seen if Trump can do much more than just “drain the swamp.” Indeed, the bigger challenge will be to restore faith in the American Dream. With the former prerequisite task on its own akin to Hercules cleaning out the Augean Stables with a teaspoon and a toothbrush while its occupants are still in residence (given this is Washington we’re talking about, this metaphor may work on more than one level), it’s enough to say Trump will have his work cut out on both counts. \\nWith the record firmly in mind, we might define at this point three monumental errors of judgment made by the DNC hierarchy, all of which contributed to the Trump victory: their preferred choice of candidate when they had a highly credible, electorally appealing, and eminently electable alternative in Bernie Sanders; the manner in which it was revealed the Clinton primary campaign was conducted and the revulsion it engendered and damage it caused; and the fact that over the past 30 odd years the Democrats’ brand among its most historically important constituencies had lost much of its political allure. \\nIn sum, the Clinton campaign might have been better served by resuscitating that immortal mantra from Bill Clinton’s first White House tilt in 1992 — and here I am not talking about “two for the price of one’! I’m thinking here about legendary Clinton strategist James Carville ‘s “It’s the economy, stupid!” \\nUnderpinning the Trump debacle was sustained “group think” within the DNC camp, the key state of mind of which can be summed up in one word. Hubris. This “hubris” was in part fueled because it was “Hillary’s turn,” and partly fueled by a conviction someone like Trump could not possibly win. To be fair, this predisposition toward “hubris” is not proprietary to the Democrats; the GOP — many of whom also felt “someone like Trump could not possibly win”— can invariably be relied upon to provide stiff competition with their own unique manifestations when the need arises. Trump’s win is unlikely to temper that. \\nWhere to From Here? \\nWith both political parties increasingly and so obviously beholden to Wall Street and the global corporate oligarchy, the ever-widening disparities in income and wealth, and ”core principle” democracy now relegated to “poor cousin” status in the political economy then, it is also just as clear many Main Street Americans were pondering an altogether pessimistic outlook for their own and the next generation if the socio-economic scales continue to weigh in favor of the above power elites and against the interests of the middle- and working-class, and broader citizenry. President Bill Clinton, First Lady Hillary Clinton and daughter Chelsea parade down Pennsylvania Avenue on Inauguration Day, Jan. 20, 1997. (White House photo) \\nAlthough there was relatively little discussion in the MSM at least throughout the campaign of specific issues like economic inequality and income and wealth disparities, there can be little doubt Trump tapped into the sentiment that attends these matters. As Joe Lauria noted about Trump’s win, a “new political force” in America has been unleashed. \\nLauria added, “Millions of discontented Americans who have lost out to the computerization and the globalization of the economy — and who have been disproportionately called on to fight America’s ‘regime change’ wars — have made clear that they aren’t going to take it anymore.” \\nThe way Lauria sees it then, any party or politician going forward “better listen or they will be tossed out, too,” including Donald Trump if he doesn’t deliver the goods. \\nJordan Chariton, a political reporter for “The Young Turks” news show, said despite being a historically weak candidate, Hillary Clinton’s defeat wasn’t just about Hillary Clinton. The Rise of the Forgotten Deplorables has been a work in progress for some time. For him, “Clinton was the final lifeline to a neoliberal bubble built by the Clintons and many others — that finally popped on November 8th, 2016.” \\nHe cites some of the factors that might have had contributed to the disenfranchisement and disillusion: Bill Clinton, not Ronald Reagan, “pulled” down Glass-Steagall , the cornerstone of banking regulation for 60 years. Clinton, not Reagan, deregulated credit-default swaps (CDS), the “financial WMDs” that blew up the world’s economy in 2008. And it was Clinton, not Reagan, who signed NAFTA , the largest nail in the American middle class’ coffin. \\nThe additional reality is that the socio-economic “fabric of the republic” is fraying even further across all strata of the “Main Street” political economy and permeating all aspects of life once synonymous with — and essential to claiming a stake in — the American Dream (even in its more modest imaginings), should be obvious to all but the most politically myopic or deluded. \\nAnd for those who understood there being such a thing as a “class war” and viewed globalization and neoliberalism through such a prism — if we recognize that the upper class won that war a long time ago — we might posit the following: Why when after the vanquished have long since surrendered to distraction, disillusion or outright despondency are the victors still fighting the war? Before this election, the short answer we might have suggested is that it’s because they can! \\nIn a piece earlier this year in The Guardian ( “ Neoliberalism — the Ideology at the Root of all our Problems”) , Georges Monbiot places the blame for most of the parlous state of the global political economy on the blowback from neoliberalism, a social engineering experiment of sorts anchored by what became an inviolable economic ideology and which arose as a conscious attempt to “reshape human life and shift the locus of power,” a goal few objective observers would argue has long ago been achieved. It became in effect a Weapon of Mass Disenfranchisement, sold on the utterly — and knowingly — fraudulent notion that “every child player wins a prize,” with enticements of “trickle-down effects” and “rising tides.” \\nMonbiot also dutifully reminds us that neoliberalism’s central tenet proclaims competition as the “defining characteristic” of human relations, while redefining citizens as consumers or customers, whose “democratic” choices are best exercised by “buying and selling, a process that rewards merit and punishes inefficiency.” \\nMoreover, he warns: “Perhaps the most dangerous impact of neoliberalism is not the economic crises it has caused, but the political crisis. As the domain of the state is reduced, our ability to change the course of our lives through voting also contracts.” \\nIf the arrival then of Donald Trump doesn’t qualify as a “political crisis” of sorts for America, it will do until the real one gets here. For those who supported him, as to whether he will change the course of their lives (presumably for the better), that remains a big unknown. Expecting that a billionaire businessman — a man who symbolizes everything that is the very antithesis of their own lives — to change said lives appreciably is probably a big ask. Well might we say, “good luck with that!” \\nThroughout the campaign Trump demonstrated his mastery at keeping folks guessing as to what his next move would be, and continues do so in transition mode. It will be of great interest going forward then to see to what extent he continues to do this once he enters the White House, and especially to see what the ramifications might be for ordinary Americans in those areas that really matter for them. \\nAll of which is to say, we’re in for a few surprises, for better or worse. The Trump ego is legendary. of course, and the best we might hope for is that it doesn’t all go to the new President’s head! Now that would indeed be another “turn-up for the books.” \\nGreg Maybury is a freelance writer based in Perth, Western Australia.'"}, "time": 1742564581.1181378}