{"duration": 0.07624292373657227, "input_args": {"text": "'You know what Hillary Clinton absolutely despises? Can’t stand? Gives her migraines? \\nFree speech and freedom of the press. \\nAnd here’s why: people might just say what they think about her. And….it’s not good! \\n*gasp!* \\nDespite the team effort of the Clintons and CNN to censor any story line that cast Hillary in a negative light, well-known and informed individuals are standing up and speaking out. \\nMSNBC’s Chris Matthews is the latest to do so. \\nAccording to Breitbart : \\nThursday on MSNBC’s “Hardball,” host Chris Matthews said, it’s the Clintons’ “pattern” to raise money “hand over fist” using the White House like a “Motel 6” and that will not change if Democratic presidential nominee Hillary Clinton wins in November… \\n…“You know what I think? I’m going to be more judgmental than Beth who’s a straight reporter. I’ll make a judgment. Every time I watch a politician engage in a certain pattern of behavior before they go to the White House, they continue to engage in that pattern afterwards. People don’t change because we swear them into the White House. They become that person big-time. And the Clintons were raising money like this hand over hand, hand over fist, back in 1996, using—we called it Motel 6. They were hoarding them in, pulling them in by train loads of contributors and then letting them sit in the Lincoln bedroom for a while and charging them by the hour. You can still vote for Hillary Clinton, but remember, you’re getting this as part of the package, because that’s been their pattern.” \\n“People don’t change because we swear them into the White House.” \\nLet that sink in for just a moment. \\nThe Clintons will not shut down the Clinton Foundation; they will not stop using White House bedrooms as a Motel 6; they will not stop the horrific behavior they are best known for. \\nC, after all, stands for corruption, conspiracy, and Clinton. \\nThe Clintons have never been serving for the public good but for the Clinton good. \\nIf the Clintons have their way, C will stand for censorship soon.'"}, "time": 1742564360.5235298}