{"duration": 0.21910881996154785, "input_args": {"text": "'by Outis Philalithopoulos In yesterday’s episode of this series , Outis came up with an attractive synthesis about the trajectory of modern progressivism. He was then thrown into confusion by the arrival of a Phantom, and cryptic references to “neoliberalism’s intellectual and cultural border guard.” I felt like a snake, compelled to painfully tear away one skin after another. The outline of my conclusions was the same, but in the cold light of Reed’s words, things somehow appeared differently. Is it true that we have surpassed postmodernism? We still look negatively at right wingers and others who believe in non-trendy absolutes. We still pay lip service to the idea that other cultures are just as praiseworthy as upper middle class American liberal culture. But looking beneath the surface, it does seem like postmodernism has been consigned to the graveyard of history. But rather than post-postmodernists who have learned from the mistakes of postmodernism, we are neo-modernists who have successfully forgotten that postmodernism ever existed. Already in the 90s, parts of the left/liberal world were uncomfortable with postmodernism, and Wendy Brown argued that they had set up their own “reactionary foundationalism.” By that she meant that they had selected one aspect of their dogma, and then declared all attempts to interpret it critically to be subversive. Our newfound unity is based on two prongs. On the one hand, we have consolidated our alliance with key sectors of modern capitalism, and thereby cemented our branding as well-educated, intelligent people. It is working out wonderfully – but have we paid a price for it? Daniel Bell argued in 1976 ( The Cultural Contradictions of Capitalism ) that conservatives supporting capitalism were thereby supporting a cultural engine that undermined the social values central to their conservatism. Have we, by letting the cultural arm of the economy fight our battles for us, clouded our ability to radically critique that economy? In the complex relationship between modern progressivism and the cultural sector of capitalism, who is using whom? On the other hand, we have fixed certain instances of suffering as foundational texts, and can now blast anyone who seems to doubt their centrality in understanding the world. Earlier attempts to create a liberal culture based on a consensus about oppression tended to produce a hodgepodge of groups that centrifugal forces could easily pull apart. What was different now? Maybe, as I had suggested to Foucault, the Internet had played a role. But 9/11 seemed relevant as well. As Osama bin Laden had hoped, the image of the planes striking the towers appeared on television as a dramatic flash of absolute reality. In the new rhetorical world thus created, “squishy” postmodernism came off as inane and decadent; meanwhile, neocon Republicans happily twitted liberals over their lack of moral clarity. The Right surged from one apparent victory to another, while liberals seethed with humiliation. Maybe there was no epistemological breakthrough that enabled us to answer the postmodernists’ gnawing doubts about objectivity. Maybe we changed the nature of liberalism, absorbed the stubborn moral clarity of Rush Limbaugh’s conservatism, and went on to forge a rough-and-ready consensus between unruly interest groups, simply because we believed we had to. Morality As stylized images of suffering inject us with potent shots of certainty, we become addicted to empathy with suffering, as an antidote for existential disorientation. This leads to a natural desire to expand our attention to micro-aggressions and hurtful ways of thinking. But then, if we commit to being on the side of people who experience micro-aggressions, almost everyone might be able to find something in their life that could qualify. And in fact, many groups for whom we feel little sympathy are not unwilling to talk about their pain and humiliation. We have dodged this trap by finding a principle that will disqualify unintended groups from empathy – that way we can classify their pain as notreal. The simple rule that does the trick is: “If a group has suffered something historical that we agree is really, unmistakably horrible , then it is also allowed to claim micro-aggressions as real.” We dress it up in academic language about what counts as “structural” oppression, but in simple words, the rule is, “if a group suffered, and we have canonized their suffering as a source of moral clarity for us , then they should be allowed to freely discover further incitements to suffering.” So in Judy’s movie, mocking older people, or rural people, or government employees, or overweight people, is all entirely acceptable , while carrying around fox repellent, thinking a sheep’s fur is fluffy, calling a bunny cute, or not supporting a baby fox who wants to be an elephant are all entirely unacceptable. T he principle isn’t that prejudice is wrong. The principle is that the latter examples are code for liberal flash points. I thought about something Brown said: In its emergence as a protest against marginalization or subordination, politicized identity […] instills its pain over its unredeemed history in the very foundation of its political claim […] Politicized identity enunciates itself, makes claims for itself, only by entrenching, restating, dramatizing, and inscribing its pain in politics; it can hold out no future – for itself or others – that triumphs over this pain. By “instilling” pain at the center of our epistemological universe, we condemn ourselves to endless efforts to shuttle around, direct, and amplify that pain. Brown emphasized revenge as a key technique in dealing with pain: […] a will that makes not only a psychological but a political practice of revenge, […] an identity whose present past is one of insistently unredeemable injury. Zootopia offers plenty of examples of hurting people the way they hurt others, so they can see what it feels like, and learn. The response to Nick tricking Judy and telling her “it’s a hustle, sweetheart” is for her to trick him and then announce, “it’s a hustle, sweetheart.” The same line is then used on the evil female sheep at the end of the movie. The movie sees cultural insensitivity as not only the primary evil in the world, but also the most appropriate punishment – the final prison episode also came to mind, when I had laughed at the evil sheep’s anger at her wool getting touched. The culmination of Judy’s apology is announcing that she really is “just a dumb bunny” – her guilt is so great that she knows she deserves the pain of stereotyping. Brown worried about the insatiable dead end of “insistently irredeemable injury.” Here, though, modern liberal culture proposesa way out of the cycle of suffering and revenge – Judy models it for us in her apology to Nick. If the oppressor voluntarily decides to submit to the worst tortures the oppressed can inflict, and to bind herself as an instrument of his revenge, then he may choose to forgive her, making possible a triumph over pain. I had always thought that when people do something wrong, they should just stop caring about their own feelings and, like Judy, really, deeply apologize. In the movie, Nick had forgiven her. But in real life, if someone apologized like that, say in a professional context, and the other person chose to be unmerciful – what then? Imagining the Future Wendy Brown said that right wing fundamentalists were trying to “foreclose democratic conversation about our collective condition and future.” Are we doing the same thing? Adolph Reed maybe thought so. What did he mean when he said we had become “border guards of neoliberalism,” policing “the boundaries of the thinkable”? Of course we work hard to stigmatize certain sorts of prejudices. Do we thereby successfully repress them? Foucault, in his History of Sexuality , recalled that it is often supposed that the Victorian era’s rules of manners and taboos on sexuality were aimed at making sex “driven out, denied, and reduced to silence.” He argued instead that those restrictions had the effect, and maybe the purpose, of inciting and intensifying the power of sexuality: a “complex deployment for compelling sex to speak, for fastening our attention and concern upon” it. If Foucault was right about sexuality, are our attempts at “repressing” prejudice and trauma serving to amplify them as a force in society, by “compelling prejudice and trauma to speak,” “fastening our attention” upon them? Is the result then to drown out attempts to speak in other ways, and so to police “the boundaries of the thinkable”? Is the neoliberal order safeguarded by the fact that certain conversations just don’t happen in mainstream progressive circles? Well, it does seem that Star Trek is better at imagining an economic system without money than modern progressives Maybe we see a radical stance on the economy as a quick way to brand oneself as edgy, while privately assuming that there is no alternative to modern capitalism. If so, why continue to be so moralistic about it? Is our compulsive focus on mental sin a way we cover up despair at our inability to change the deep structure of the world? A lot of ordinary people are convinced not that capitalism is perfect, but that any alternative to it is will necessarily involve the collapse of technological civilization or severe restrictions on freedom. If this isn’t true, are there some progressives trying to explain why? I struggled with what I had perceived. Were we, despite our idealistic vision of ourselves, simply agents of the system, tentacles that it uses to smash some people, complete with the pretext of defending others? Was it a labyrinthine, twisted joke? Hope At that point, I rebelled at the implications of my thought. Maybe modern progressives are much less self-critical than we imagined ourselves to be. Maybe we do indulge in some prejudices while criticizing and often tokenizing others. Maybe we have acquiesced in a long series of accommodations with power. But Polyphemus had spoken not just of wretchedness, but of idealism and grandeur. Maybe I didn’t agree with the postmodernists after all. Maybe there is something good, or at least potentially good, in the way we have tried to turn back to sincerity and moral conviction, to humility and introspection. Brown said that in the postmodern world, individuals are buffeted and controlled by global configuations of […] power of extraordinary proportions, and are at the same time nakedly individuated, stripped of reprieve […] Since she wrote, the way the world makes many feel precarious and lost has only gotten worse. Maybe she was right that when we feel this way, we try to rebuild a sense of something we can really believe in. But was she right in assuming that this was mainly a bad thing? When Judy apologizes to Nick, she treats herself as utterly insignificant, and her victim as omnipotent, exactly mimicking the relationship between the sinner and God in traditional Christian confession. This was extreme, but could it also be seen as the sign of a great and widely-shared loneliness? Of the longing we feel for more dramatically intimate relationships between people, or between a person and some sort of transcendence? Could we salvage what was hopeful in modern progressivism and disentangle it from what wasn’t? That sounds… hard, I thought to myself. Anyway, I’m dead. Maybe someone else will worry about it. Then I remembered Judy Hopps. She wouldn’t accept me being dead as a reason for me not to try to help people. What could I do? “Polyphemus,” I cried out. “You’re back.” He surveyed me. “WHAT HAVE YOU LEARNED?” his voice boomed. I thought for a moment. Then I realized how to solve this problem. “Polyphemus,” I said. “I have learned that I have been ignorant and irresponsible and small-minded. When I hear criticism of liberals that I don’t want to think about, I deal with it by explaining how right-wingers caused the problem, or are worse than us, or are scary or horrible. Or I say the criticism is justified, but only as a criticism of not-real-progressives. Or I divert attention by accusing critics of ignoring the horrible things that have been done to marginalized people. I say I am against prejudice and trauma, but my attempts to repress certain forms of them have the predictable effect of intensifying their power throughout society. I say I am against prejudice, but I don’t mind making fun of old people, Millennials, hicks, wingnuts, adults who live with their parents, and a whole slew of other categories and stereotypes. I say I am against capitalism, but I’m completely fine with corporate action when it imposes antiracism, feminism, and other aspects of liberal culture. If someone raises an objection, I accuse them of opposing antiracism or feminism. I have the privilege of knowing that I can repel any attack on my basic understanding of reality. I really am a horrible hypocrite; some of the things I do hurt people, abet an atmosphere of shaming and guilt, and ultimately foreclose any possibility of positive change.” “How do you feel now?” Polyphemus inquired. “Great,” I responded. “I feel great.” “So will you honor the spirit of true progressivism in your heart, and try to keep it always?” he demanded. “Perhaps,” I said. “But not just now. A bootleg copy of the latest Game of Thrones season just made it past Charon. And anyway, I’ve faced my fears, I’ve recognized my progressive privilege, and I feel like I’ve really grown through this experience.” Polyphemus smirked at me. I smirked back. Epilogue: And so I thought no more about these matters, and have been able to return to my comfortable existence in the underworld. I no longer need this diary, and am casting it into a bottle so that it can dance along the eddies of fate, troubling whom it may. Outis Philalithopoulos'"}, "time": 1742562460.8409956}