{"duration": 0.13865447044372559, "input_args": {"text": "'The Spiritual Alchemy of Every Day Stuff Nov 20, 2016 1 0 \\nYou could work on your spiritual self in a secluded temple, or high in the most remote mountains as an ascetic hermit, but there is a surprising opportunity to use your every-day life as a way to blow the doors off of corporeal existence and arrive in the blissful state of full awakening. You can turn lead to gold, if you just know how. This is the true secret of alchemy. \\nFather Francis Tiso , a PhD in Buddhist studies has said, “Everyday stuff that we go through, good bad or indifferent, is of extreme value. It’s like gold. It is jewels, but only through spiritual practice do you develop the sensitivity, which is innate, so its really like bringing out the sensitivity, to know that. To know that this moment is the only one that you are going to get, and that it’s wide open, luminous and blissful.” Spiritual Alchemy – Fishing for Pearls \\nAlchemists have been around for ages, certainly before the age of Christ. These spiritual chemists were looking for ways to obtain the ‘holy grail.’ The gold of the early alchemists was found by uniting the physical body with the soul. This is considered the original ‘trinity’ which informs Buddhism, gnostic Christianity, Taoism, and many other alchemical sciences, and it is a science we all have access to. \\nThe church became threatened with alchemy because it offered a number of tools in which to find the true pearls of wisdom – distinct teachings that could show people how to awaken their dormant kundalini. \\nAlchemy was developed in ancient Egypt and China, and has been tied to the fertility of the Nile River basin as well as an understanding of what happens to the consciousness after death. Sadly, much of early information on alchemy was lost when the Christians invaded Egypt and burned the library at Alexandria . Others claim these secrets were not really burned , but simply moved to the Vatican and other places where they could be kept secretly. Nonetheless, there were anywhere between 40,000 to 600,000 scrolls of alchemical knowledge that were either destroyed or hidden . \\nThis knowledge has not been completely destroyed though. It has been carried across the world, to Egypt, India and China, to the Middle East, Greece, Rome, The British Isles, Nigeria, Ethiopia, and other Asian, European, and African cultures. \\nAt its heart, alchemy is just a type of transformation – of turning one type of matter into another. The alchemists of medieval times focused on trying to turn lead into physical gold, but they were missing the point. The true treasure of alchemy is in creating a sustained state of illumination and enlightenment. Three Tools Needed to Perform Alchemy \\nJust as in physical alchemy, there are three requirements. You must have a container, a substance to fill it, and a fuel. In spiritual alchemy, it is no different. Our awareness is the container. Our gross awareness, with all its beliefs, psychological patterns, emotional blockages, and stalled energies which keep us from seeking truth is where we start. \\nThe fuel is a heightened state of consciousness, which can be invoked or attuned to with simple awareness exercises. By placing, for instance, those aspects of our being which are no longer serving us, such as emotional wounds or beliefs of our unworthiness, into our awareness, and bringing the fires of transformational consciousness from within the subtle realms, to our assistance, we can transform those wounds. We are alchemists, then, turning our gross consciousness into ‘gold.’ How does this work in every day life, then? \\nWe can look to the practices of many ancient cultures to understand the simple wisdom of alchemy. \\nAny advanced esoteric school — whether it was Christian Gnosticism, Taoism, that can gather ‘qi’ from the morning dew , or the Hindus and Jainists of India that can literally live on the breath alone (called breatharians ) — reveals to the secrets of cultivating the energy which can turn lead (the dull consciousness) into gold (the fully awakened, original Self). \\nThese practices are simply the most advanced versions of paying attention, and developing awareness. In the modern world, most of our primordial life energy escapes us, and dissipates throughout the day. When we focus our awareness, we draw in immense amounts of Universal energy. \\nUniversal energy flows into the etheric body through the chakras, which translates from Sanskrit to mean ‘spinning wheel of energy.’ \\nCosmic chi can also be drawn in through the lungs (hence breatharians can learn to exist on only air and a little water.) The practice of Chi Kung, for example, is simply energy management. The practice of Chi Kung is simply meant to teach us to refuel the body, which is connected to the Universal energy. More specifically, there are 3 types of Chi described in Taoism, and other Chinese martial arts: Jing Chi – known as our ‘original Chi or inherited Chi’ which is passed down to us from our parents Gu Chi – or digestive Chi, which is derived from the food and drink we ingest Da Chi – or Cosmic Chi, which is drawn in through the lungs \\nSimilarly, yogic practices help us to remove impediments to the flow of the Universal Qi (chi) throughout our bodies. This system uses the term ‘ prana ’ instead of Qi. \\nIn both systems of developing Universal energy inherent within us, the tributaries that this energy flows through the body must be cleared. In Chinese medicine they are called meridians, in yoga, they are called nadis. Regardless of their names, there is a framework within the physical body to disseminate the Universal life force – to distribute Qi or prana. \\nSo, let’s apply this ancient wisdom to an every-day scenario. First, we wake up from sleep. We rarely put nourishing foods in our bodies. Our minds start to race, considering all the things we should do before the sun goes down. This is the first place that our original Qi dissipates. If we were to lay in bed for just five minutes, breathing deeply, cultivating energy in our abdomens, and then letting a sense of calm permeate our consciousness, we’d already be changing the tempo of the day, as well as the likelihood that the rest of our actions will be Qi-building, instead of Qi-destroying. \\nNext, we gulp down dead foods that contain no life-force, and rush to work or an appointment. Every healthy food we eat contains the life-force also, and can aid in developing our own energy levels, or continue to deplete them. Sprouted seeds and legumes, along with fresh fruits and vegetables contain the highest levels of life-force, as evidenced in Kirlian photography . All other foods pale in comparison. If we don’t eat organic, live foods, we miss out on an easy opportunity to build our life force. \\nThen, if we rush through the day, sitting at a computer for eight of the precious hours within our waking time, without moving our bodies – without dancing, practicing martial arts , or doing yoga, for example, we miss out on yet another opportunity to build our life force. As a side benefit to practicing Qi Gong, or yoga, we also get sick less frequently, and enjoy a better mood – when we are happy, and joyful, this vibration helps to promote a higher life force, also. \\nAdditional practices like meditation , pranayama , tantric sex , mudras , listening to high-vibrating music, spending time in nature , laughing , and more, can all add to our life force energy. Even our slee p can be used as a means to awaken our consciousness from its lowered state. The philosopher’s stone is a legendary alchemical substance capable of turning base metals such as mercury or lead into gold or silver. \\nIf you haven’t already surmised, almost every waking moment is an opportunity to practice alchemy – to make gold from lead. It doesn’t matter if you are having lunch with friends, or deciding how to spend your free time on a Saturday. You can choose to be aware, and to support the alchemical transformation of your consciousness. Though the ancient texts likely contained secrets which would expedite the process, there are simple acts we can participate in every day to find the priceless treasure of spiritual alchemy.'"}, "time": 1742562553.2265012}