{"duration": 0.17677879333496094, "input_args": {"text": "'Trump’s Tulsi Gabbard Factor November 21, 2016 \\nExclusive: By inviting in Rep. Tulsi Gabbard, a Democrat hostile to “regime change” wars, President-elect Trump may be signaling a major break with Republican neocon orthodoxy and a big shake-up of the U.S. foreign policy establishment, writes Robert Parry. \\nBy Robert Parry \\nTwo weeks after Donald Trump’s shocking upset of Hillary Clinton, the imperious and imperial neoconservatives and their liberal-interventionist understudies may finally be losing their tight grip on U.S. foreign policy. \\nThe latest sign was Trump’s invitation for a meeting with Rep. Tulsi Gabbard, D-Hawaii, on Monday. The mainstream media commentary has almost completely missed the potential significance of this start-of-the-work-week meeting, suggesting that Trump is attracted to Gabbard’s tough words on “radical Islamic terrorism.” Rep. Tulsi Gabbard, D-Hawaii. \\nFar more important is that Gabbard, a 35-year-old Iraq War veteran, endorsed Sen. Bernie Sanders in the Democratic primaries because of his opposition to neocon/liberal-hawk military adventures. She starred in one of the strongest political ads of the campaign, a message to Hawaiians, called “The Cost of War.” \\n“Bernie Sanders voted against the Iraq War,” Gabbard says. “He understands the cost of war, that that cost is continued when our veterans come home. Bernie Sanders will defend our country and take the trillions of dollars that are spent on these interventionist, regime change, unnecessary wars and invest it here at home.” \\nIn the ad, Gabbard threw down the gauntlet to the neocons and their liberal-hawk sidekicks, by accusing them of wasting trillions of dollars “on these interventionist, regime change, unnecessary wars.” Her comments mesh closely with Trump’s own perspective. \\nAfter the meeting on Monday, Gabbard released a statement confirming that the focus of the discussion had been her opposition to escalating the war in Syria by following neocon/liberal-hawk suggestions for a “no-fly zone” that would require widespread U.S. military destruction of Syrian government installations and the killing of a large number of Syrians. \\n“President-elect Trump asked me to meet with him about our current policies regarding Syria, our fight against terrorist groups like al-Qaeda and ISIS, as well as other foreign policy challenges we face,” Gabbard said. “I felt it important to take the opportunity to meet with the President-elect now before the drumbeat of war that neocons have been beating drag us into an escalation of the war to overthrow the Syrian government — a war which has already cost hundreds of thousands of lives and forced millions of refugees to flee their homes in search of safety for themselves and their families. … \\n“While the rules of political expediency would say I should have refused to meet with President-elect Trump, I never have and never will play politics with American and Syrian lives. … \\n“I shared with [President-elect Trump] my grave concerns that escalating the war in Syria by implementing a so-called no fly/safe zone would be disastrous for the Syrian people, our country, and the world. It would lead to more death and suffering, exacerbate the refugee crisis, strengthen ISIS and al-Qaeda, and bring us into a direct conflict with Russia which could result in a nuclear war.” \\nTrading Places \\nSo, the surprise election results on Nov. 8 may have represented a “trading places” moment for the neocons and liberal hawks who were eagerly counting the days before the “weak” President Barack Obama would turn over the Commander-in-Chief job to former Secretary of State Clinton who had made clear that she shared their hawkish agenda of escalating the war in Syria with a “no-fly/safe zone,” and ratcheting up the New Cold War with Russia. Former Secretary of State Hillary Clinton addressing the AIPAC conference in Washington D.C. on March 21, 2016. (Photo credit: AIPAC) \\nThere was even speculation that one of Clinton’s neocon favorites within the State Department, Assistant Secretary of State for European Affairs Victoria Nuland, might be rewarded with State’s top job for her “regime change” in Ukraine that sparked the start of the New Cold War in 2014. \\nNuland, the wife of arch-neocon Robert Kagan , sabotaged President Obama’s emerging strategy of collaborating with Russian President Vladimir Putin on sensitive global issues. In 2013-14, Putin helped orchestrate two of Obama’s brightest foreign policy successes: Syria’s surrender of its chemical weapons arsenal and Iran’s guarantee that it would not develop nuclear weapons. \\nBut those agreements infuriated the neocons who favored escalating both crises into direct U.S. bombing campaigns aimed at Syria and Iran – in accordance with the desires of Israeli Prime Minister Benjamin Netanyahu and the Saudi monarchy. Yet. there was perhaps even greater alarm at what the next move of the Obama-Putin tag team might be: demanding that Israel finally get serious about a peace deal with the Palestinians. \\nSo, the neocons took aim at Ukraine, which neocon National Endowment for Democracy President Carl Gershman identified as “the biggest prize” and an important stepping stone to an even bigger prize, a “regime change” in Moscow removing Putin . \\nWhile Gershman’s NED funded (with U.S. taxpayers’ money) scores of projects inside Ukraine, training anti-government activists and journalists, Nuland took the point as the key organizer of a putsch that removed elected President Viktor Yanukovych on Feb. 22, 2014, and replaced him with a fiercely anti-Russian regime. \\nGiven the geopolitical sensitivity of Ukraine to Russia, including its naval base on the Crimean peninsula, Putin had little choice but to react, supporting a referendum in Crimea in which 96 percent of the voters favored leaving Ukraine and rejoining Russia – and assisting ethnic Russian rebels in the east who resisted the violent ouster of their president. \\nOf course, the mainstream Western news media presented these developments as simply a case of “Russian aggression” and a “Russian invasion.” And, faced with this new “group think,” Obama quickly abandoned his partner, Putin, and joined in the chorus of condemnations. \\nNuland emerged as a new star inside the State Department, a hero of the New Cold War which was expected to funnel trillions of tax dollars into the Military-Industrial Complex. \\nTrump’s Heresy \\nBut Trump surprisingly adopted the position that Obama shied away from, a recognition that Putin could be an important asset in resolving major international crises. The real-estate-mogul-turned-politician stuck to that “outside-the-mainstream” position despite fierce attacks from rival Republicans and Democratic presidential nominee Clinton, who even mocked him as Putin’s “puppet.” President Barack Obama meets with President Vladimir Putin of Russia on the sidelines of the G20 Summit at Regnum Carya Resort in Antalya, Turkey, Sunday, Nov. 15, 2015. National Security Advisor Susan E. Rice listens at left. (Official White House Photo by Pete Souza) \\nAfter Trump’s upset victory on Nov. 8, many pundits assumed that Trump would fall back in line with Washington’s hawkish foreign-policy establishment by giving top jobs to neocons, such as former U.S. Ambassador to the United Nations John Bolton and ex-CIA Director James Woolsey, or Netanyahu favorites, such as former Republican presidential nominee Mitt Romney or ex-New York City Mayor Rudy Giuliani. \\nSo far, however, Trump has followed a different course, more in line with the libertarian thinking of the Koch brothers – not only the more famous ones, Charles and David, but also their long-estranged brother William, who I’m told have become behind-the-scenes advisers to the President-elect. \\nThough Trump did offer high-profile meetings to the likes of Romney and Giuliani, he has yet to hand over any key foreign-policy job to the Republican neocon wing. His one major announcement in that area has been naming as National Security Advisor retired Gen. Michael Flynn, who led the Defense Intelligence Agency when it produced a prescient warning that U.S. policy in Syria would lead to the creation of an “Islamic State.” \\nThough Flynn is regarded as a hardliner in the fight against Islamic jihadist terror, he is seen as an independent thinker regarding how best to wage that war. For instance, Flynn has objected to the notion that drone strikes, i.e., killing off individual jihadists, is a route to success. \\n“We’ve tended to say, drop another bomb via a drone and put out a headline that ‘we killed Abu Bag of Doughnuts’ and it makes us all feel good for 24 hours,” Flynn said . “And you know what? It doesn’t matter. It just made them a martyr, it just created a new reason to fight us even harder.” \\nThat leaves open the possibility that a President Trump might eschew the “whack-a-mole” approach that has bedeviled the “war on terror” and instead go after the “mole nest” – if you will – the Saudi monarchy that has long financed Islamic extremists both through the fundamentalist Wahhabi brand of Sunni Islam and by supplying money and weapons to jihadists dating back at least to the Afghan mujahedeen in the 1980s, the origin of modern Islamic terrorism. \\nTraditional U.S. politicians have recoiled from facing up to the hard reality that the Saudi monarchy is the real “terror central” because of Saudi Arabia’s enormous riches and influence, which is now enhanced by its quiet alliance with Israel in their joint campaign against the so-called “Shiite crescent,” from Iran through Syria to Lebanon’s Hezbollah. \\nTaking on this Saudi-Israel nexus has long been regarded as political suicide, given Israel’s extraordinary lobbying power and Saudi Arabia’s exceptional wealth. But Trump may be assembling a team that is “crazy” enough to take on that mission. \\nSo, while the fight over the future of U.S. foreign policy is far from over – the neocons will surely flex their muscles at the major think tanks, on the op-ed pages and inside the halls of Congress – the Trump transition is showing some creativity in assembling a national security team that may go in a very different direction. \\nMuch will become apparent in Trump’s choice of Secretary of State. If it’s someone like Sen. Rand Paul, R-Kentucky, or Rep. Gabbard or a libertarian from the Kochs’ world, that would be bad news for the neocons. If it’s someone like Romney, Giuliani, Bolton or Woolsey, then that will mean that President-elect Trump has blinked and the neocons can breathe a sigh of relief. \\nInvestigative reporter Robert Parry broke many of the Iran-Contra stories for The Associated Press and Newsweek in the 1980s. You can buy his latest book, America’s Stolen Narrative, either in print here or as an e-book (from Amazon and barnesandnoble.com ).'"}, "time": 1742562839.2693043}