{"duration": 0.15363097190856934, "input_args": {"text": "'Share This \\nAfter the FBI’s Friday announcement that they had reopened their investigation into Hillary Clinton’s private email server, many have been quick to attack director James Comey for the timing of his recent move. However, Trey Gowdy just obliterated the criticisms while also delivering a nasty surprise directly to Hillary herself. \\nThe Democrats have come unhinged as they watch their candidate sink, with the FBI’s reopened investigation delivering a devastating blow to an already disastrous campaign. In fact, what’s coming out of their mouths as they enter panic mode is almost laughable. Take for instance Howard Dean’s claim that Comey is in cahoots with Vladimir Putin or Harry Reid’s suggestion that director Comey broke the law. \\nIt’s rather ironic that he’s concerned about Comey following the law while, at the same time, basically suggesting Hillary should get a free pass. In fact, Reid is so concerned about the FBI director’s actions in investigating Hillary Clinton’s criminality that he had the nerve to write Comey, attempting to intimidate him. “I am writing to inform you that my office has determined that these actions may violate the Hatch Act, which bars FBI officials from using their official authority to influence an election,” Reid wrote. “Through your partisan actions, you may have broken the law.” \\nLuckily for us, Trey Gowdy was ready to call Reid out for his crap, and of course, it’s all on video for us to enjoy. Watch: \\nGowdy wasn’t falling for the left’s excuses, and he said what we were all thinking. First, he laid into Huma Abedin’s excuse that she didn’t know how her emails could have ended up on a device she says belongs to her husband. As Gowdy points out, there aren’t that many ways it could happen, but it’s rather irrelevant since that’s not what the FBI is investigating. \\nNext, Gowdy took out John Podesta for his “blame the cops” play, and then came the nasty surprise for Hillary. Gowdy reminded viewers that Comey isn’t responsible for a single one of the facts , saying, “ He didn’t tell her to use a private server, he didn’t tell Huma not to turn over all of her devices, and God knows, he didn’t tell Anthony Weiner to send sexually explicit texts to allegedly underage people. ” Gowdy continued to put Hillary on blast, saying “ The timing is a direct and natural consequence of decisions Hillary Clinton made ,” reminding everyone of where our focus and blame should be. But, he wasn’t done there. \\nIt was then Harry Reid’s turn to feel the Gowdy heat as the senator ripped into Reid’s asinine letter to Comey. “Thank God he’s leaving is my initial reaction,” Gowdy said about Reid before adding, “My second reaction is: I did not know Mormons used drugs, and anyone who is capable of sending out that press release has to be under the influence of something.” \\nThen, Gowdy went right back to putting the attention and blame where it needs to be — on Hillary Clinton. “ The person responsible for this fact pattern is Secretary Clinton ,” Gowdy explained. “Jim Comey did not tell her to use her private server. He did not say to mislead the public about whether or not you turned over all of your work emails. And he certainly didn’t say, Secretary Clinton, why don’t you say you neither sent nor received classified information.” \\nTrey Gowdy successfully obliterated any critics of the FBI and director James Comey while also delivering Hillary the nasty surprise she deserves. Although she’s used to skirting consequences, she has no one to blame for what’s happening besides herself, and it’s nice to see that there are those in Washington, D.C., who are more than willing to wrap up some personal accountability and drop it directly into the presidential candidate’s lap. Timing wouldn’t be an issue if her own actions didn’t lead our entire country down this path. Hillary Clinton has no one but herself to blame for what she’s facing. As for timing, now maybe Mrs. Clinton has a little idea what it’s like to be aborted just days before delivery.'"}, "time": 1742563172.4568594}