{"duration": 0.017909526824951172, "input_args": {"text": "'Trump llama a mantenimiento porque el botón nuclear no funciona \"O FALLAN O LO ESTOY HACIENDO MAL\", HA DICHO CINCO MINUTOS DESPUÉS DE RECIBIR LOS CÓDIGOS NUCLEARES Tercera Guerra Mundial \\nSólo unas horas después de derrotar a Hillary Clinton en las elecciones presidenciales, Donald Trump ha querido reunirse con el servicio secreto para informarles de que el botón que pone en marcha todo el dispositivo nuclear del ejército de Estados Unidos no parece responder, según ha informado su gabinete de prensa. \\n“No va”, ha declarado Trump. \\n“Es que no hace nada”, ha insistido el nuevo presidente de los Estados Unidos, que achaca el mal funcionamiento a la falta de uso. \\nSegún él mismo ha dicho nada más salir victorioso en las últimas elecciones americanas, tiene “mucha prisa y mucha ilusión” por asumir todas y cada una de las competencias que deberá desempeñar los próximos cuatro años. “Estoy ansioso por asumir todas mis responsabilidades, la del botón de las bombas y también las demás”, ha declarado el republicano en su discurso de agradecimiento a sus votantes. \\n“Quiero ponerme a trabajar cuanto antes”, ha repetido en varias ocasiones a lo largo de su primer discurso como presidente. \\n“Acabo de recibir la llamada de la secretaria Clinton. Nos ha dado la enhorabuena por la victoria, yo le he felicitado por toda la campaña y le he preguntado si su marido sabe cómo funciona el maletín, porque me lo acaban de traer y creo que está roto porque se queda igual y no responde”, ha dicho. También ha pedido “un poco de paciencia” a los americanos. \\n“Paciencia, paciencia, paciencia”, ha repetido el nuevo presidente. \\nEl magnate no ha querido detallar por qué sabe que el botón no funciona.'"}, "time": 1742564460.819184}