{"duration": 0.04466843605041504, "input_args": {"text": "'Wed, 26 Oct 2016 20:12 UTC © Daniel Mihailescu / AFP US, Turkey and Poland are among the NATO member states which confirmed their readiness to dispatch naval units to the Black Sea in 2017, boosting the alliance\\'s presence in the region, according to NATO Secretary General Jens Stoltenberg. Stoltenberg noted \"progress\" in in strengthening NATO\\'s presence in the Black Sea Region in his statement after the meeting of the block\\'s defense ministers in Brussels on Wednesday. \"With a Romania-led multinational framework brigade on land and we\\'re working on measures in the air and at sea,\" he said. According to the secretary General, several member-states \" indicated their willingness to contribute to our presence in the Black Sea region on land, at sea and in the air, including Canada, Germany, the Netherlands, Poland, Turkey and the US .\" \"Other allies are also looking into how they can contribute,\" he added. Comment: Canada, Germany, the Netherlands, Poland and the US have no business in provoking tensions with Russia in the Black Sea. Of the countries listed, only Turkey has shores on the Black Sea. Interestingly, Bulgaria isn\\'t listed. Perhaps they learned their lesson in botching their involvement in Russia\\'s Nord Stream project. Zing! The plans on enhancing Black Sea presence will be finalized during another meeting on NATO ministers in February. Following Crimea\\'s reunification with Russia, NATO has been increasingly concerned about the Black Sea is turning into a \"Russian lake.\" Since the spring of 2014, NATO warships, including missile cruisers from the US and other allied nations, have been patrolling the Black Sea on a rotational basis, never leaving the area unattended. NATO decided to increase their presence in the Black Sea during a summit in Warsaw in July, calling it a response to Russia\\'s increasing military capabilities and is a gesture of support to its Eastern European members. Comment: Baloney. Eastern European members are under no threat from Russia. This operation is part of the information war to create the image of a Russian threat. The military beef-up in the region is expected lead to the creation of NATO\\'s Black Sea Fleet to be formed by member-states with direct access to the sea. Stoltenberg also said that 17 NATO countries will delegate their units to join the four multinational ground battalions to be deployed in Poland and the Baltic State early next year. The battalions will be led by the US, UK, Canada and Germany, while the countries sending their forces included France, Poland, Albania, Romania, Croatia and others. The Secretary General stressed that NATO was monitoring the movement of Russian vessels in the Baltic Sea. \"I can confirm that two Russian warships have recently entered the Baltic Sea, and NATO is monitoring this movement in the way we always do,\" he said. However, Stoltenberg stressed that, despite its buildup in Eastern Europe, the alliance is ready for dialogue with Moscow. \"We are concerned about Russia\\'s behavior. Bur dialogue is even more important when tensions run high. And allies stand ready to hold an ambassadorial meeting of the NATO-Russia Council in the near future,\" he said.'"}, "time": 1742563389.192121}