{"duration": 0.04233908653259277, "input_args": {"text": "'The open borders lobby is bracing for a fight with President Donald Trump’s administration over the   foreign guest worker program, which opponents say is discriminatory against American workers. [In a piece by the Hindustan Times, a newspaper based out of India, open border proponents with the Indian group “Immigration Voice” are decrying the Trump Administration’s expected effort to not defend an   rule that allows   foreign guest workers’ spouses to also work in the U. S.  Sudarshana Sengupta, who is specifically cited by Immigration Voice, is currently in the U. S. on an   visa, which is given to spouses of   workers as they await green cards. When Attorney General Jeff Sessions, a longtime opponent of massive foreign guest worker programs, did not immediately defend the open borders lobby in a Washington court case, Immigration Voice denounced the move. The Washington court case was filed by Save Jobs USA, an organization comprised of IT workers who have been fired from their jobs after being replaced by cheaper, foreign workers under the   program. “The recent statements from the government present an unacceptable risk for Immigration Voice members that the department of justice might decide after 60 days to adopt the position of Save Jobs USA,”   of Immigration Voice Aman Kapoor wrote in a statement. Immigration hawks at NumbersUSA say the open borders lobby appears to be opposing every position the Trump Administration holds on immigration. “I think that the advocacy groups are going to scream and yell about any single thing that anyone proposes that is not open borders,” NumbersUSA Government Affairs Director Rosemary Jenks told Breitbart Texas. “They’ve decided that it’s in their interest to fight everything Trump wants to do. ” Jenks said the “coalition” between the business community, who wants continued cheap, foreign labor, and the Hispanic advocacy groups, who want to see higher levels of illegal and legal immigration, will continue as a united front in order to give the illusion that they care about workers and business. “The business community doesn’t really have much stake in chain migration issues,” Jenks told Breitbart Texas. “And the advocacy groups like La Raza don’t have a lot of stake in the foreign guest worker issues. They’re going to look like they’re defending the interest of business in order to keep that coalition going. ” Trump and Sessions’ positions on foreign guest worker programs remains highly popular with the American public, as only 30 percent of Americans said in a recent poll that the   visa was necessary, Breitbart Texas reported. The vast majority of Americans also said the number of   visas allotted every year to companies should either be kept on level or decreased. Only 23 percent of Americans said the number of   visas given out should be raised. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742561716.9235103}