{"duration": 0.09100627899169922, "input_args": {"text": "'Zero Hedge October 28, 2016 \\nMoments ago, Russian president started speaking at the final session of the Valdai International Discussion Club’s 13th annual meeting in Sochi. More than 130 experts and political analysts from Russia and other countries are taking part in this year’s three-day meeting, titled ‘The Future in Progress: Shaping the World of Tomorrow’. \\nWhile Putin’s speech can be seen below, he has already had a handful of soundbites, most notably the following he just said in response to accusations that Russia could influence the US election: \\n“Hysteria has been whipped up in the United States about the influence of Russia over the U.S. presidential election,” said Putin, calling it a ruse to cover up for the fact that the U.S. political elite had nothing to say about serious issues such as the country’s national debt or gun control. \\n“It’s much simpler to distract people with so-called Russian hackers, spies, and agents of influence. Does anyone really think that Russia could influence the American people’s choice in any way? The number of mythical, dreamt-up problems include the hysteria – I can’t think of another word – that has broken out in the United States about the influence of Russia on the current elections for the US president.” \\nHe ended that phrase as follows: “What, is America a banana republic?!” Putin mocks claim that Russia is trying to influence the US elections: “What, is America a banana republic? America is a great power” \\n— Steve Rosenberg (@BBCSteveR) October 27, 2016 \\nAnd then, to emphasize his trolling, added the following: “correct me if I am wrong.” \\nHe also said that “Russia has no intention of attacking anyone, it is ridiculous, foolish and unthinkable. I read your analytical materials prepared not only by those present but also by analysts in the US and Europe. However, it is just unthinkable, silly and unrealistic. In Europe alone, the combined population of NATO countries stands at 300 million, in the US the total population is, probably, 600 million, while in Russia – 146 million. It is just funny to talk about this.” \\nAccording to the Russian president, contradictions stemming from redistribution of political power are growing. \\n“Regrettably, next to nothing has changed for the better in the past months. To be frank, nothing has changed. Contradictions stemming from redistribution of economic power and political influence are only growing,” Putin said. \\nHence, according to the Russian leader, the burden of mutual mistrust is limiting possibilities to stand to real challenges and real threats facing the world community. “As a matter of fact, the entire globalization project has turned to be a crisis and voices in Europe are speaking (and we know and hear it well) about the failure of the policy of multiculturalism,” Putin said, adding that this situation is a consequence of a wrong, hasty and somewhat arrogant choice made by Europe’s political elites some twenty-five years ago. \\n“Back then, at the turn of the 1980s and 1990s, there was a chance not only to spur globalization processes but to give them a qualitatively new, harmonious and sustainable character,” the Russian leader said. \\nHe drew attention to the fact that the countries that claimed to be the winners in the Cold War began to reshape the global political and economic order in their own interests. \\nThese states, in his words, embarked on a path of “globalization and security for themselves only, but not for all.” But not all agreed on that.Some could not resist that any longer whereas others were not yet ready, so, no wonder the system of international relations has been feverish and the global economy is failing to recover from the crisis, Putin added. \\nOn globalization \\nThe Russian president stressed globalization should be for all but not only for the select few. \\n“Obviously, the global community must focus on really topical problems facing the entire humankind, the solution of which will make the world a safer and more stable place and the system of international relations equal and fair,” Putin said. \\nHe said such an approach will make it possible to “make the globalization for the select few turn into globalization for all.” \\n“I am confident that it is possible to overcome any challenges and threats only together,” Putin stressed. \\nOn Global Propaganda \\nThe president said he regrets that Moscow does not possess such global propaganda techniques as Washington does. \\n“I would like to have such a propaganda machine in Russia. But, unfortunately, I don’t. We have no such global media as CNN, BBC and some others. We have no such opportunities so far,” Putin said at a session of the Valdai Discussion Club. \\nOn the world economy \\nThe president expects the trend towards regionalization of the world economy will continue. It is absolutely evident that economic cooperation must be mutually advantageous and be based on general universal principles so that each state could become a full-fledged participant in the global economic life,” Putin said. \\n“In the mid-term prospect, the tendency towards regionalization of the global economy will apparently continue, but regional trade agreements should complement, develop, and not substitute universal norms and rules,” the president said. \\nThe global economy is unable to get out of the current systemic crisis and the political and economic principles continue to be reshuffled, Putin stressed. \\n“The system of international relations remains feverish. The global economy is unable to get out of the systemic crisis. The principles and rules in politics and the economy continue to be reshuffled. Quite often dogmas that until recently had been regarded as fundamentally true are turned inside out,” Putin said. \\nThese days, he said, whenever the powers that be find some standards or rules beneficial, they force everybody else to obey them. However, if at a certain point the very same standards begin to pose obstructions, they are at once sent into the dustbin as outdated and new rules are established. \\nAs an example of that strategy Putin mentioned the missile and bombing strikes against Belgrade and Iraq, then against Libya and Afghanistan. The operation began without a corresponding resolution by the UN Security Council. Some superpowers, the Russian leader said, in their attempts to change the strategic balance of force in their favor have torn down the international legal regime that prohibited the deployment of new missile defense systems. They have created and armed international terrorist groups, whose cruelty is now pushing millions of migrants out of the unsafe areas. \\nWhole countries are being plunged into chaos. The principles of free trade are trampled on and sanctions are used to exert political pressures. \\n“We can see the freedom of trade being sacrificed and so-called sanctions being used for exerting political pressures. In bypass of the World Trade Organizations attempts are being made to form closed economic alliances living by harsh rules and putting up firm barriers alliances where dome \\nOn NATO \\nHe said that NATO has outlived its usefulness as a structure and on the topic of the escalating proxy war in Syria, Putin had a simple comment: “Our agreements with the US on Syria did not work out.” \\nAnd some more headlines from his pragmatic remarks: RUSSIA’S PUTIN SAYS RUSSIAN MILITARY THREAT BEING EXAGGERATED TO JUSTIFY MILITARY SPENDING RUSSIA’S PUTIN SAYS CYBER ATTACKS OR OTHER TYPES OF INTERFERENCE INTO OTHER COUNTRIES’ AFFAIRS UNACCEPTABLE RUSSIA’S PUTIN SAYS DONALD TRUMP BEHAVES EXTRAVAGANTLY , BUT IT IS FOR A REASON \\nFollow Putin’s speech live below.'"}, "time": 1742562313.5442343}