{"duration": 0.09343910217285156, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Mike Pence, the Republican, and Tim Kaine, the Democrat, squared off in the one and only   debate. It was hosted by Longwood University in Farmville, Va. a community still grappling with its role in civil rights history. Times reporters Maggie Haberman, Adam Nagourney, Ashley Parker and Alan Rappeport provided analysis, and we   statements made by the candidates. We also had Walter F. Mondale, the country’s 42nd vice president, chatting with us via emails throughout the debate. ____ 2. Hurricane Matthew made landfall, slamming into Haiti with winds of up to 145 miles an hour. The country has been battered by natural disasters over the last decade. The storm is expected to retain its intensity until at least Wednesday night, delivering heavy rains and damaging winds to other Caribbean nations as it moves north. Much of the East Coast is bracing for dangerous conditions later this week and weekend. ____ 3. When Donald J. Trump claimed a loss so big in 1995 that it could have let him avoid up to 18 years of income taxes, 500, 000 other taxpayers used the same maneuver to claim losses, too. Mr. Trump claimed a $916 million loss. The average loss for everyone else was $97, 600. An executive who was hired by Mr. Trump in 1990 described the work environment then as “like getting on the Titanic just before the women and children were moved to the lifeboats. ” The Trump campaign has threatened legal action against The Times for publishing parts of his tax returns, but legal experts think that might not be such an easy case to win. Our reporter, who found the documents in her mailbox, said in a podcast, “I honestly thought it was a hoax, because who mails you Donald Trump’s tax returns?” ____ 4. The second Nobel Prize of the year, for physics, was awarded to three   scientists who study matter that assumes strange shapes. David Thouless, F. Duncan Haldane and J. Michael Kosterlitz, all of whom work at universities in the U. S. were recognized for discoveries that are largely theoretical, but may have practical applications for electronics. The prize for chemistry will be announced on Wednesday, and the Peace Prize on Friday. Two more Nobel prizes will be announced next week. ____ 5. The Justice Department has gone after a tech company again. Earlier this year, it issued a subpoena to the maker of a widely used encryption app called Signal, seeking information about two phone numbers, then blocked the company from talking about it. But there wasn’t much information to give up. “The Signal service was designed to minimize the data we retain,” said Moxie Marlinspike, above, the founder of Open Whisper Systems, which makes the app. Tech companies have complained about government overreach in similar cases. ____ 6. Maria Sharapova, the Russian tennis star, will be allowed to return to the sport in April of next year. The world’s top sports court reduced her   suspension for a doping violation, saying the original penalty was too harsh. In baseball, the postseason kicked off tonight with the Toronto Blue Jays hosting the Baltimore Orioles (the Blue Jays won). We asked six of our sportswriters to offer their predictions. Most of them are not picking the Chicago Cubs. ____ 7. At high schools across the U. S. football players are adopting the controversial protest of Colin Kaepernick, the San Francisco 49ers quarterback who took a knee during the national anthem and now sits during its playing. “When Kaepernick kneeled, he gave us an outlet. He gave us something to do,” said Vicqari Horton, a junior at Aurora Central High School in Colorado. Over the weekend,   of his team’s players took a knee with him. ____ 8. On Monday, people in the U. S. will mark Columbus Day. In Canada, it will be Thanksgiving. If you didn’t know, well, neither do a lot of U. S. citizens. The centerpiece of the Canadian holiday dinner is turkey with stuffing and gravy, much as in the U. S. In fact, a lot of the food is pretty similar. But why do they have the holiday in the first place? “You were supposed to go to church and reflect on the blessings you and the country had received,” a historian explained. ____ 9. Fashion Week in Paris is wrapping up, although our critic is less than impressed. “It has been an unambitious finale to what had been shaping up as a strikingly political season,” Vanessa Friedman wrote. But she lauded the Alexander McQueen show for its reflection on unity, inspired by the Shetland Islands in Scotland. (The country is grappling with whether to leave Britain following Britain’s vote to leave the European Union.) “Sarah Burton sent out a beautifully argued case for the allure of unity,” Ms. Friedman wrote of the designer. ____ 10. Finally, how do you say email in Yiddish? Well, for a long time, you just didn’t. But a new     dictionary has published, updating the    language. Blitspost is the Yiddish word for email. Butt dialing? Use “alpi tokhes”  —   which literally means “by way of the backside. ” The new dictionary will be formally celebrated with a panel discussion and music at the Center for Jewish History in Manhattan next month. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562098.2545013}