{"duration": 0.10306286811828613, "input_args": {"text": "'  Eric Zuesse. Eric Zuesse CNN explained well “5 surprising lessons from Trump’s astonishing win” , and the historic crushing failure of traditional Presidential-year American politics, but it really boils down to one simple fact: In the battleground states, where most of the advertising dollars and get-out-the-vote money was being spent, the Trump organization made use of the Republican-Party organization in those portions of the campaign-operation that benefited from those established contacts and its tried-and-tested methods and techniques, but not in the portions of the campaign-operation that needed to be improved and to function better than in all prior U.S. Presidential elections. The simple fact is that Trump’s understanding of U.S. national politics was transcendent, better even than that of the candidate whom all of the polls during the political primaries showed to be the most preferred by the most people and thus to be able to beat any of the other contestants in a one-on-one electoral choice against any of the others: Bernie Sanders. (See this and this for the evidence on that.) (And if there were any remaining doubt as to why he was, consider this report from Reuters near 3AM on Wednesday November 9th, right after the voting: “U.S. voters want leader to end advantage of rich and powerful – Reuters/Ipsos poll” . For example, this poll of 10,000 people leaving their polling-places showed: “75 percent agree that ‘America needs a strong leader to take the country back from the rich and powerful.’” That had been Bernie Sanders’s message, too. Trump’s campaign brought people like that out to vote.) Sanders may have been right to think that highest net approval-rating is generally the biggest single predictive factor determining a Presidential candidate’s winning the White House (and he had the highest net-approval rating), but he (like his opponent Hillary Clinton) missed the importance of the emotional-intensity factor, which Trump made virtuosic use of . (This can be seen clearly when you look further at the exit-poll results: the actual people who went to the polls — the people sampled in the exit-polling — were fundamentally different from the cross-section of America’s ‘likely voters’ that were sampled in the pre-election polling! Trump trumped all traditional politics. This achievement is simply astounding.) Whereas Sanders failed to recognize that in Democratic Party primaries there was more emotional intensity for the existing, Clinton-Obama, anti-FDR, Democratic Party, than there was for ideological progressivism (FDR’s legacy, which dominated the Democratic Party prior to Bill Clinton’s win in 1992) (and Hillary’s understanding of that turned out to have been correct), and so the incompetent but aristocracy-backed politician Hillary Clinton was able to steal the Democratic Party nomination from him, Trump was able easily to garner the most primary votes in a crowded 17-candidate field and so to become the nominee of one of the two major political Parties and go on to face the incompetent Hillary in the general election. From Bernie Sanders’s standpoint, such a general-election contest, between two candidates both of whom had hugely net-negative approval-ratings, couldn’t have made much political sense, and so he chose to endorse the thief Hillary and become a non-entity in the post-1992 and profoundly corrupt Democratic Party, instead of to found an authentically independent political movement — not political Party but political movement — which would honestly and without partisanship cherry-pick which candidates, from which of the two political Parties, will, on balance, as against the given candidate’s opponent, provide the highest benefit and least harm toward advancing the progressive cause. (That was the only constructive path forward for him after Hillary robbed him.) He chose the stick-in-the-mud route. Sanders opted to become just a cog in an ugly greasy pro-aristocracy machine, the Democratic Party wing of the U.S. aristocracy. After the Republican Party’s nomination was won by Trump (which he did honestly), he went on to build on that success an authentic anti-aristocracy (or ‘anti-Establishment’) movement, beside and outside the Republican Party. His basic anti-aristocracy message remained unchanged, and he, as the Republican nominee, faced the biggest decision-point in his entire campaign: whether now to reach out to the millions of Sanders’s voters (i.e., the largest of all voting-segments) by joining with now Hillary’s — the post-1992, Bill Clinton’s, Democratic Party’s — emphasis upon both race and gender over economic class as what’s posing the biggest barrier to achieving equality of economic opportunity in America (in which case, Trump would have adopted Hillary Clinton’s basic campaign message), or, instead, to stay with his original message that economic class (and the elite’s “corruption” behind that) poses the biggest barrier against achieving “the equal-opportunity society.” Trump — wisely, as it now turns out — chose the latter path (the original Bernie Sanders’ basic message): he was determined to retain the intensity-advantage (the ‘populist’ thrust), so as to be able to bring the largest numbers of voters to the polls on Election Day in the toss-up states and crush his opponent who was looking to win a ‘coalition’ of voting- segments : women, Blacks, Hispanics, Muslims, etcetera. She thought that those people’s personal group-identification would sufficiently surmount any negative feelings they might have regarding her long history of corrupt use of public office to advantage her financial supporters, so that she would beat ‘the bigot’, Donald Trump; she turned out to be wrong . What will be the important consequences of Trump’s win? I, a Bernie Sanders voter, voted for Trump against Hillary, for the reasons that I have earlier stated, describing the consequences that a Trump win would have. (See: “I’m a Bernie Sanders Voter: Here’s Why I’ll Vote Trump ” .) I summed up, on that occasion: Trump is rapidly moving America’s political center in the opposite direction from the direction that Bill Clinton, Barack Obama, and Hillary Clinton, did, which was toward conservatism, away from progressivism: those conservative Democratic Presidents and (now) would-be President, have moved America’s political center considerably toward the right ( the international-corporate agenda ). A President Trump would reverse the political direction that this country has been heading in ever since 1993. If we progressives don’t help Trump to do that, we shall be throwing away the only such opportunity that the U.S. oligarchy (slipped-up and) allowed us to have. A President Hillary Clinton would have the support of almost all congressional Democrats no matter how right-wing her proposals are, and her big-money financial backers will buy enough congressional Republicans to make her the most effective most conservative Democratic President in decades if not centuries. The prospect is chilling. The biggest objection I hear to that from my fellow progressives is: “But think of the people he’ll appoint to the U.S. Supreme Court!” And my answer to that is: “This Is No ‘Cold War’; It’s Far Worse Than That.” Hillary Clinton has been intensely committed to completing Barack Obama’s drive toward nuclear war against Russia, and even the question of the Supreme Court is trivial in comparison to that. Furthermore, as I argued in “I’m a Bernie Sanders Voter: Here’s Why I’ll Vote Trump ” , Trump might actually turn out to be a far more progressive President than he is expected to be. But, even if that turns out not to be the case, Trump is thoroughly committed to halting America’s aggression against Russia: the biggest loser in this Presidential election is George Herbert Walker Bush, the person who in 1990 secretly established the U.S. plan to conquer Russia, which plan every U.S. President since has been carrying out , and Hillary Clinton was expecting to complete that operation. This was thus a historic U.S. election: finally, the U.S. government will turn away from the path toward war against Russia, upon which path the United States has been leading the world ever since 1990. I am shocked, and enormously relieved, at the result — even if Trump turns out to be a bad (i.e., a conservative, the opposite of a progressive) President on all other matters (including the Supreme Court). Even in the worst-case scenario, Trump will be a much better President than would the neoconservative , Hillary Clinton. Thank you, Donald Trump! Without your achievement here, the likely result now would be catastrophic, even worse than what Hillary Clinton did as U.S. Secretary of State .'"}, "time": 1742562994.2556396}