{"duration": 1.7407686710357666, "input_args": {"text": "'in: Collapse , Economy & Business , Multimedia In the following interview, Elijah Johnson and Silver Doctors bring you the latest interview with someone we haven’t heard from in a while, Dr. Jim Willie. To begin the financial portion of the interview, Elijah begins by asking Dr. Willie about the unprecedented bond dumping by China and Saudi Arabia, and of course what Elijah is referring to is how several weeks ago the markets witnessed never before seen numbers when $28 billion in U.S. Treasuries were dumped one week, followed by another $23 billion a week or so later. \\nConsider the massive sell-off’s just further evidence in a long line of existing examples regarding why the days of the U.S. Dollar as the World Reserve Currency are numbered. Our creditors are aware that the Fed has been engaged in non-stop printing of money out of thin air, and even though the short-term effect has been the propping up of U.S. Treasury prices, our creditors know history, something Americans seems to pay no attention to. Our creditors know that just like other countries who have engaged in the same kinds of reckless monetary policy in the past, eventually when the QE (printing money out of thin air), is removed, hyperinflation will set in, and there will be massive devaluation of the same Treasuries that were artificially propped up for so long. Most creditors expect the QE to be shut off the moment this U.S. election is over, because unlike uninformed American voters, our creditors know that In addition to his role in allowing the largest case of massive voter fraud in America history to take place on his watch, Captain Transparency in the White House has made sure his loyal servant at the Fed, Janet Yellen, has continued committing massive financial fraud at the Fed at the same time. All of these actions by the U.S. result in what Dr. Willie refers to as psychological damage not just to the full faith and credit of the United States Dollar, but to the United States itself. Creditors of U.S. debt are watching a never before seen transition in the U.S. to a system of pure corruption, undermining ANY faith they might have had in the Dollar, and giving them every reason in the world to want to distance them from the U.S. Dollar. Dr. Willie explains that any “perceived” moral authority the U.S. once might have had is long gone. Among other things, the world learned not long ago through a shocking revelation by Wikileaks that Obama and Hillary not only knew of funds being used to provide ISIS (our enemy), with weapons during a time of war, the world has now seen that Barack Obama and Hillary allowed it. With almost a week until the official election we have heard tremendous stories of voter fraud including stories revealing as many as 20/20 examples of machines switching votes from Trump to Hillary, we know the polls have been massively rigged, and thanks to a national media as corrupt and dishonest and those they are tasked with watching over, Dr. Willie briefly mentions millennials who were recently highlighted on the Steven Colbert show expressing their excitement that Obamacare premiums are doubling in some states. The level of stupidity that is coming out of liberal indoctrination centers known as public schools or universities, where graduates have no ability to exercise critical thinking skills, is exactly why 20% college graduates are now living with their parents or grandparents, and Michael Snyder explains below. Expect that number to keep climbing considerably, particularly with a Clinton Presidency. Michael Snyder writes: In America today, more than 60 million people live in multi-generational households. That number is so large that it may seem difficult to believe, but the truth is that vast numbers of young adults have had to move back in with their parents and grandparents in recent years due to the deteriorating economy . Millions of our young people cannot find decent jobs once they leave school, and millions of them are absolutely overwhelmed by debt. Of course some of them are just lazy, but whatever the reason it is undeniable that multi-generational households are on the rise. According to the Pew Research Center , 12 percent of the U.S. population was living in multi-generational households back in 1980. Today, that number is up to 19 percent. That means nearly one out of every five U.S. adults now live with their parents or their grandparents. One of the big culprits, of course, is student loan debt.'"}, "time": 1742564484.9783983}