{"duration": 0.05553579330444336, "input_args": {"text": "'Home / Be The Change / NSA Whistleblower: ‘NSA Has ALL of Clinton’s Deleted Emails’— FBI Can Access Them Any Time NSA Whistleblower: ‘NSA Has ALL of Clinton’s Deleted Emails’— FBI Can Access Them Any Time Jay Syrmopoulos August 1, 2016 8 Comments \\nWashington, D.C. – One of the architects of the National Security Agency’s surveillance programs dropped a bombshell over the weekend when he stated that the NSA has “all” of Hillary Clinton’s deleted emails. He also noted that the FBI has the technical and legal ability to gain access to them if they chose to do so. \\nWilliam Binney is a former highly respected NSA official that served the agency for over 30 years, helping to create its surveillance program – before becoming a famed whistleblower upon resigning in 2001. On Sunday, he declared in a radio interview broadcast that the hack of the DNC could have been coordinated by someone inside the U.S. intelligence community angry over Clinton’s compromise of national security data with her email use. \\nAppearing on Sunday on “Aaron Klein Investigative Radio,” and speaking as an intelligence analyst, Binney questioned whether the hack of the Democratic National Committee’s servers were actually the work of Russian hackers, as the Clinton camp has alleged. Instead, he raised the possibility that it was actually the work of disgruntled U.S. intelligence officials upset about Clinton being given a pass on criminal charges after compromising national security secrets through her use of unsecure personal email servers that were undoubtedly accessed by numerous foreign intelligence services. \\nDuring his interview with reporter Aaron Klein, Binney referenced then-FBI Director Robert S. Mueller’s testimony in March 2011 before the Senate Judiciary Committee, in which Mueller spoke of the FBI’s ability to access a number of secretive databases “to track down known and suspected terrorists.” \\n“Now what he (Mueller) is talking about is going into the NSA database, which is shown of course in the (Edward) Snowden material released, which shows a direct access into the NSA database by the FBI and the CIA. Which there is no oversight of by the way. So that means that NSA and a number of agencies in the U.S. government also have those emails,” Binney said. “So if the FBI really wanted them they can go into that database and get them right now,” Binney stated in regards to the missing Clinton emails. \\nWhen Klein asked whether he believed the NSA has copies of “all” of Clinton’s emails, including the deleted correspondence, Binney replied with a one-word bombshell. “Yes ,” he responded. “That would be my point. They have them all and the FBI can get them right there.” \\nAccording to a report by Breitbart : \\nAnd the other point is that Hillary, according to an article published by the Observer in March of this year, has a problem with NSA because she compromised Gamma material. Now that is the most sensitive material at NSA. And so there were a number of NSA officials complaining to the press or to the people who wrote the article that she did that. She lifted the material that was in her emails directly out of Gamma reporting. That is a direct compromise of the most sensitive material at the NSA. So she’s got a real problem there. So there are many people who have problems with what she has done in the past. So I don’t necessarily look at the Russians as the only one(s) who got into those emails. \\nThe Observer defined the GAMMA classification: \\nGAMMA compartment, which is an NSA handling caveat that is applied to extraordinarily sensitive information (for instance, decrypted conversations between top foreign leadership, as this was). \\nHow interesting to think about the distinct possibility that the hacked and leaked emails are not the result of Russian hackers, but actually came to WikiLeaks from an unknown crusader at the NSA itself — another “Snowden” if you will. \\nLet us hope that after for years of watching Clinton expose national security secrets, through reckless handling of highly classified intelligence, some determined patriots within the intelligence community are now working to see the downfall of Clintons by exposing their corrupt political apparatus. Likely we will never know: as Zero Hedge reported , it is the NSA that has been tasked with determining if the Russian government is behind the hacks. One thing we already know is that when an agency investigates itself, it NEVER finds itself responsible. Share'"}, "time": 1742562173.5759153}