{"duration": 0.021574735641479492, "input_args": {"text": "'Philippine President Rodrigo Duterte has ordered an extended military operation against the Islamic State affiliate Abu Sayyaf and assured civilians that any violent action they take to subdue local terrorists will be forgiven in a court of law, following the arrest of a policewoman with ties to the group and the beheading of a soldier. [Abu Sayyaf, which has been active for years in the southern Philippines but more recently pledged allegiance to Islamic State caliph Abu Bakr   has become active in southern Bohol Island, a new territory for them. Duterte’s administration has responded with a reinforced military presence in the region, while Duterte himself has threatened to cannibalize the jihadists.  “I can eat you,” Duterte said this week. “Just give me salt and vinegar. True. Make me mad. Get me a terrorist. Give me salt and vinegar. I will eat his liver. ” In September, Duterte made a similar promise to “eat” Abu Sayyaf terrorists, following a series of attacks on soldiers. Duterte also assured civilians living in affected regions that he would endeavor to protect their right to  . Speaking last week following an attack on soldiers in Bohol, Duterte said, “to the police  …     and even civilians interested to fight and kill, the order is dead or alive. ” “I intend to also arm the civilians and I will include the civilians  …     you don’t have to worry,” he said. “Just go to the police and make a report and state your truth  …     no problem. I’ll take care of you, I’ll pardon you, whatever. ” Duterte has taken a similar stand with drug criminals, assuring civilians of impunity if they kill drug offenders. In addition to the increasingly common clashes between Abu Sayyaf terrorists and police, law enforcement arrested a Philippine policewoman this week for ties to the group. Philippine National Police (PNP) Superintendent Maria Cristina Nobleza is under arrest after police found evidence that she had been engaged in an affair with an Abu Sayyaf bombmaker, potentially handing over sensitive information. The investigation into whether she was a source for the terrorist group is ongoing. Authorities also found the head of Sergeant Anni Siraji, a Philippine soldier abducted on April 20 by the terrorist group. Abu Sayyaf terrorists reportedly beheaded him this weekend after the soldier was assigned to work as an intermediary between the terrorists and police. “He is involved in peace efforts,” Brigadier General Cirilito Sobejana told reporters. “He is not actually a combatant. We are using him to engage stakeholders because he is a Tausug [like most Abu Sayyaf],” he added, referring to the man’s ethnicity. Dutertespokesman Ernesto Abella called the beheading a “barbaric act” over the weekend and vowed more military action. “The President is firm and decisive in the fight against terrorism,” he said. “He has ordered government troops to carry out sustained, focused and intense operations to put an end to lawless and gruesome acts of violence. ” The Philippine Star quotes another PNP official as stating, “[Our] teams will do nothing except to ‘eat Abu Sayyaf in breakfast, lunch and dinner. ’” Duterte, who had repeatedly demanded the United States stay out of Philippine matters during the Obama administration, recently changed his disposition, requesting that American soldiers help his country fight the jihadist insurgency in the south. “As we fought together to stay above the enemy then, so we should help each other to address the threats that confront our societies, our region, and our world,” Duterte said in April, reaching out to President Donald Trump, according to regional outlet   News.'"}, "time": 1742628573.6887214}