{"duration": 0.09604382514953613, "input_args": {"text": "'Anderson Cooper was reading the names of victims of the Orlando massacre on CNN this week when, uncharacteristically, his voice wavered and he drew up short. For moments, viewers around the country heard only silence, and then the sounds of the anchor struggling to compose himself. “That was horrible,” Mr. Cooper recalled, a bit sheepishly, in an interview on Wednesday. Accustomed to covering foreign wars and lethal hurricanes, Mr. Cooper said he did not like to show his feelings on camera. But this time, he added, felt different: “I’ve been surprised at how emotional this has been. ” As the news industry descended on Florida this week in the aftermath of a mass shooting in a gay nightclub, Mr. Cooper’s raw,   coverage has stood out. He has held a   vigil of sorts, reciting a list of the dead refused to name the gunman, saying he wanted to focus on victims and, in a widely viewed exchange, grilled Florida’s attorney general for defending a state ban on   marriage. Mr. Cooper, who is gay, has seemed to embrace an advocacy role rarely seen among top network anchors, blending    reporting with a distinctly personal and empathetic touch. Until recently, Mr. Cooper did not discuss his sexuality in public. On Tuesday, for what he said was the first time he could remember, he referred to himself as gay on the air. “As gay people, we share strands of a common bond,” he said during the final moments of his   broadcast. “If this killer hoped to set us backwards, to make us live in fear, I think he’s made a sickening mistake. ” Speaking on Wednesday from his satellite truck in Orlando, Mr. Cooper insisted, emphatically, that he was no activist. “I’m not trying to push an agenda,” he said. “I’m not here to be an advocate, railing at the top of my lungs at injustices that’s the role other people have. ” But he said he had been preoccupied this week by memories of previous murders at gay nightclubs, including a 1970s firebombing in New Orleans and the shooting of gay patrons at a Greenwich Village bar in 1980. “There were people who have died, and no one really told their story,” Mr. Cooper said. “I think the fact that I am gay, and I am in a position where I can determine the content of a broadcast at night on CNN.   …     ” He let the thought trail off. “There have been generations of reporting on gay people where that has not been the case. ” Opinion is the coin of the realm on cable news, where Rachel Maddow, Sean Hannity and their brethren hold court nightly. Mr. Cooper is viewed as a more traditional   newsman, even if he does not shy away from conveying moral dismay in his coverage. He made his reputation during Hurricane Katrina, when his anguished reports from a decimated New Orleans seemed to channel national frustration with the recovery effort. It is hard to ignore, however, Mr. Cooper’s deeply felt connections with the gay community that was targeted in Orlando. In an exchange that spread quickly online, he confronted the Florida attorney general, Pam Bondi, with what he said were complaints from gay residents about her office’s legal defense of Florida’s   marriage ban. “Do you really think you’re a champion of the gay community?” Mr. Cooper asked, suggesting repeatedly that there was a “sick irony” in Ms. Bondi’s saying she would now work to help relatives of gay victims. Ms. Bondi said on Wednesday that she was “disappointed” by Mr. Cooper’s approach. In a radio interview, she said that all the anchor’s aggressive questioning had done was “encourage anger and hate. ” She said that CNN had omitted a portion of the exchange in which she discussed her   for victims’ families and that the location of the interview, in front of an Orlando hospital, “wasn’t the time nor the place. ” (Mr. Cooper said Wednesday that Ms. Bondi “was clearly unhappy at the end of the interview,” adding: “She intimated that I didn’t like her, and I said, ‘I have no ill will toward you at all, it’s just my job to ask you questions. ’”) But Mr. Cooper, who cut short a European vacation to fly to Florida to cover the shooting, said he preferred to keep his focus on the victims, whose experiences, he said, he easily recognized. “I can’t tell you how many bars and clubs I’ve been to over the years,” Mr. Cooper said, volunteering that his longtime companion, Benjamin Maisani, owned several gay bars in New York. “Every gay man in America remembers the first time they went to a gay bar and how they felt. “I don’t want to sound like I’m speaking for the gay community,” said Mr. Cooper, who publicly acknowledged his sexual orientation in 2012. “But it certainly resonates very deeply for me. ”'"}, "time": 1742562119.9723933}