{"duration": 0.05558204650878906, "input_args": {"text": "'Share on Twitter The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nThe strangest presidential election campaign in modern history continues. \\nAnd the old saying “politics makes strange bedfellows” was never more true than in this almost surrealistic example: conservative firebrand Sean Hannity praising uber-liberal filmmaker Michael Moore for praising Donald Trump—sort of, anyway. \\nDuring Hannity\\'s radio show on Wednesday, Hannity said of Moore : \\n“He realizes that there is a whole generation of people now, hard working, tax-paying long-suffering Americans, who have been keeping the country going through the hardest times — the people that built this country that are screwed over.\" \\nHannity was referring to observations Moore makes in his recently released film “Michael Moore in TrumpLand,” particularly about comments Moore said Trump made to Ford executives during a meeting of the Detroit Economics Club: \\n\"\\'If you close these factories like you\\'re planning to do in Detroit, and build them in Mexico, I\\'m going to put a 35% tariff on those cars when send them back, and nobody\\'s going to buy them.\\' \\nIt was an amazing thing to see. No politician — Republican or Democrat — had ever said anything like that to these executives.\" \\nLest you think Moore has \\'lost his mind\\' and gone over to \\'the dark side,\\' think again. \\nHe mocked Donald Trump Jr. and the “right wing” on Twitter on Wednesday for misconstruing his comments in “TrumpLand”: Hey everyone - Trump, Jr. & right wing thinks my movie called \"TrumpLand\" is pro-Trump! Haha. Pls don\\'t tell them otherwise! #satire #irony pic.twitter.com/difR93uzTg — Michael Moore (@MMFlint) October 26, 2016 \\nMeanwhile, Hannity continues to sing Moore\\'s praises. Strange bedfellows indeed. Even if one of them is being played. '"}, "time": 1742562604.587992}