{"duration": 1.5673580169677734, "input_args": {"text": "'CHICAGO  —   For hours, the body lay where it had landed, just steps from the wooden sign someone had put up  —   a painted gun with a red slash through it. Inside a nearby house, Lee Baez had heard the gunshots in the darkness and got up to move his car so his fiancée would not have to walk past the body as she left for work before dawn. Down the block, Sandra Harris rose later to care for her ailing    mother and saw the body, by then draped with a sheet. After the authorities finally carried away Lee Martin, the    man who was shot in his head and back and died here on Walnut Street in the middle of an August night, another neighbor emerged to scrub the red streaks off the sidewalk. “I just pray that nothing comes through the window and hits Mother,” Ms. Harris, 58, said, glancing over at the spot where Mr. Martin’s body had been a few hours earlier. Living on Chicago’s West Side, where the dazzling downtown skyline always seems to shimmer in view but out of reach, means mornings like these grow strangely normal. The blue lights, the yellow tape, the next day’s quiet moving on  —   all of it. Over Memorial Day weekend, when The New York Times tracked every shooting in this city, the largest concentration of them happened here, in about six square miles that make up Chicago’s 11th police district. Of 64 people shot that weekend, 16 were in this district. Three people were shot on this same stretch of Walnut Street. The Times returned to the blocks in the 11th District where the Memorial Day weekend shootings occurred to try to better understand Chicago’s crisis of violence. Residents along Walnut Street and at other crime scenes told of a fractured community  —   isolated by this city’s entrenched segregation, hollowed out by joblessness and poverty, and battered by resignation and indifference. Here, graystone homes and brick cottages line elegant boulevards with wide, grassy medians. Garfield Park, once known as Chicago’s Central Park, sits in the 11th’s middle. But on Walnut Street, one vacant lot has been there so long that walking paths are worn through it. Young men gather on this section of the street, and neighbors say they hear calls for “Pills!” or “Flats!” —   slang for drugs  —   in the middle of the day. In places like this, cycles reinforce themselves: Poverty and joblessness breed an underground economy that leads to jail and makes it harder to get jobs. Struggling, emptying schools result in the closings of the very institutions that hold communities together. Segregation throws up obstacles to economic investment. And people and programs with good intentions come and go, thwarting hopes, reinforcing frustrations while never quite addressing the underlying problems, anyway. Into it all comes a lethal mix of readily available guns, a growing number of splintering gangs and groups, and a sense among some here that the punishment for carrying a weapon on these streets will never be larger than the risk of not carrying one. “It’s about desperation, decadence, depression and rage,” the Rev. Marshall E. Hatch Sr. who has given eulogies for at least 12 victims of violence this year, says of the district, home to his New Mount Pilgrim Missionary Baptist Church. “It’s the concentration of all of that, all in one place. ” Homicides citywide are up about 56 percent compared to last year and shootings are up about 49 percent, but just five of Chicago’s 22 police districts are driving the bulk of Chicago’s rise. All are on the South or West Sides. In the 11th, shootings are up by 78 percent compared to a year ago, and homicides are up 89 percent. So far in 2016, 91 people have been killed in this district, where only about 74, 000 people live. That is more homicides than in all of last year in entire cities, such as Seattle (population 684, 000) Omaha  (444, 000) and Buffalo (258, 000). Early on the morning of May 28, a gray car pulled up on Walnut Street, several teenage witnesses told a Times reporter, and men with big guns got out and started firing at other young men on a porch. Shell casings littered the street. The police say witnesses were uncooperative, and no one has been arrested. Within weeks, that shooting was a hazy memory. “Now which one was that?” asked a woman who lives directly across the street. Soon after, neighbors say the large homemade sign of a gun with a condemning slash through it appeared beside a vacant lot. People were unsure who put up the sign, and more have followed, one beneath the clattering “L” train track to downtown, another across from a children’s playground. By November, someone had split the Walnut Street   sign in two, a curse word scrawled on part of the crumpled remains. “It’s mostly a camouflage,” Ms. Harris said. “I mean what’s really changed when people are getting shot dead right next to that sign?” On the Sunday of Memorial Day weekend, a    woman was shot in the back while driving in a car around 4:30 a. m. The police say two men approached and started shooting. No arrests have been made.  Weeks later, less than a block from that shooting on West Wilcox, a preacher led people holding hands in a circle, praying, singing and swaying. The group seemed not to notice as traffic rumbled down Pulaski Road, a crowded strip lined with storefronts promising tax preparation, hairbraiding, candy and liquor. Zaree Pendleton, a stranger to those in the circle, suddenly wandered up, agitated. He said he was recently out of prison and desperately needed help. He carefully set the Bud Light he had been drinking for breakfast on the sidewalk in the center of the swaying circle. Then he reached for the preacher’s hand. “I’ve been watching y’all out here every morning, praying,” Mr. Pendleton told the group, turning weepy. “Y’all want to pray with me?” Jamie Thompson, the pastor of Reborn Community Church, often holds services here, just outside the church he created at a shuttered fire station. The need is greatest among the people who cluster along Pulaski’s corners in the middle of the day, many out of work or only working some, the preacher said. In 2014, almost half of the families in the community areas that make up much of the 11th District  —   East Garfield Park, West Garfield Park and Humboldt Park  —   had incomes under $25, 000, close to the family poverty threshold that year. Industry once flourished here. The original headquarters and distribution center of Sears, Roebuck  Co. provided thousands of jobs. But the area changed in the 1950s, 1960s and 1970s, as whites moved away and blacks moved in. In 2014, almost a quarter of the housing units in the neighborhoods in the district were vacant, census data show. “The steel mills, the factories, those big economic engines aren’t there,” said Eric Washington, a deputy chief for the Chicago Police Department and a former commander of the 11th District, “and we need to see what can be the new engines in this district. It can’t be the drug trade. ” Residents like Mr. Pendleton say they feel stuck in an economic trap: go to jail for a crime, struggle to find work, wind up back in jail. “People have gotten to a place where they don’t have any hope and they don’t feel like they have any hope of getting any,” Mr. Thompson said. “You accept all kinds of ways to make money when you’re hopeless. ” Mr. Thompson used to live in a gentrifying neighborhood a few miles away, but he moved his family here a dozen years ago. He caught neighbors’ attention when he brought his prayers to the streets. “‘What’s a white guy doing over here?’ people would laugh,” he recalled. “Now they’re used to me. ” Mr. Pendleton came to the prayer circle with a plea. “I need a job,” he said. He said he felt lost. “I need everything. ” “I’m an alkie, God knows,” he said. “But I need a job. I want a job as bad as hell. ” Mr. Thompson told him: “The Lord wants to fill you completely, man. You’re trying to fill up with alcohol, but you’re taking a step. ” They made plans to get Mr. Pendleton an identification card  —   the first task on what could be a long road to employment. Mr. Pendleton needed to come back with some documents, Mr. Thompson told him. That was weeks ago. Mr. Thompson said Mr. Pendleton had not been back. On Memorial Day, two men, 21 and 28, were shot and wounded just before 11 a. m. The police say they  were gang members, and that neither has cooperated with the police. Witnesses said a black car sped away after the shooting. No arrests have been made. Steps from Gladys Avenue, where the two men were shot, Garfield Park opens up to 184 acres of plush lawns shaded by old trees and surrounded by curving paths and historic buildings. For visitors, the park is a tourist attraction, a jewel of the city. Its lavish conservatory is jammed with hundreds of exotic plants and a dewy, tropical aroma even through Chicago’s bleakest winter. Yet for many of the people who live here  —   some of whom say they rarely enter the conservatory  —   Garfield Park can be harrowing. Its nearby side streets, like Gladys, can feel menacing. On a bright afternoon not long ago, a man stepped out of an apartment onto a crowded sidewalk and a gust of wind blew his shirt up, revealing a gun. Residents say the park’s perimeter can be a magnet for drug sales and violence. Seven of the 16 people shot over Memorial Day weekend were nearby. The police say statistics show the park is actually safer than it has been in several years, but Cardell Bradley, who fishes for catfish with sausage bait in the Garfield Park lagoon, said he was cautious. “If I see a group of people gathering, I get out of here. ” “It’s scary,” he said. “And it’s just heartbreaking to see these kids involved in all this  —   they’re only young schoolkids, you know. ” Part of the problem is this: The district straddles the Eisenhower Expressway, a major thoroughfare that has long been known as the Heroin Highway. Suburbanites use it to drive into the city for drugs. Rivalries between Chicago’s increasingly splintered gangs and cliques over sales of heroin, Ecstasy, prescription drugs and marijuana have given way to gunfire  —   even among   sellers who see themselves as only peripherally involved. This year, a   dimpled    was shot as he rode his bicycle outside his house. “Our block was making a lot of money doing what they’re doing, so I guess people get jealous,” said the teenager, who wore an arm brace for weeks and who says his stomach still aches when he sneezes. The teenager said he only occasionally helped sell drugs and just happened to be there when competitors turned up, armed. At the time, he was enrolled in middle school and working    with a mentor, who asked that the youth’s name not be published for his safety. The teenager, the mentor said, was registered to attend a “peace conference” with him on the very evening he was shot. Early on the Sunday of Memorial Day weekend, a man, 37, was shot in his arm and his leg as he stood in an alley here. Police say the victim was uncooperative. No arrests have been made.  An incongruously upbeat song plays loudly along this battered block all day every day: Scott Joplin’s ragtime classic, “The Entertainer. ” The cheery tune tinkles from a   ice cream truck that is permanently parked in a vacant lot on the block where the man was shot in the alley. Mina Marquez, the owner, also lives on the block  —   an odd amalgam of empty lots and   homes, now decked with elaborate Christmas displays. In a police district that is mostly black, Ms. Marquez, 35, is unusual. She came from Mexico at 16, and after living in other Chicago neighborhoods, she and her husband and their three children moved to the 11th District because it was a place they could afford. Much of what happens here is driven by economics. People who can afford to leave, do. For Ms. Marquez, plunking down an ice cream truck on an empty lot next door was far cheaper than the family’s effort a few years ago to open in a storefront in a different neighborhood. Competition is scarce here. Sub shops and food marts struggle, and chain stores mostly stay away. Most of Ms. Marquez’s ice cream customers are black, though there is a growing Hispanic population in this northern section of the district. Chicago is now made up of nearly equal thirds whites, blacks and Hispanics, but many of the city’s stark lines of segregation still exist. New policies have actually hardened some lines. When Chicago’s   public housing projects were scheduled for demolition more than a decade ago, city leaders expected residents to spread across the city. But rental prices and other factors have concentrated many of those with government housing vouchers into neighborhoods on the South and West Sides, and kept many black   residents out of richer, whiter areas. Ms. Marquez says her family coexists, if a bit awkwardly, with her customers. “We don’t let them mess with us,” Ms. Marquez said in Spanish. “They’re not comfortable that we’re here. ” Still, Ms. Marquez, who keeps her two youngest children in view as she stands at the truck window, said she had grown used to life on this block. She said that she sold more than 100 ice creams most days, and that she planned to stay. A line often forms outside the truck, where milkshakes are in high demand. On the Saturday of Memorial Day weekend, a    man was walking along just before 5 a. m. when two men approached, told him to lie down on the ground and shot him. The victim has not cooperated with the police, the police say. No arrests have been made.  In this neighborhood, Marconi Elementary Community Academy was once the glue. Since the public school opened decades ago at the corner of Maypole and Kolmar Avenues  —   several blocks from where the man was shot over Memorial Day weekend  —   best friends were made there, parents kept in touch during   children were taught by teachers who had once taught their parents. “We all went there,” said Kenny Harvey, who attended the school half a century ago and still lives right here. In 2013, though, facing a fiscal crisis, the city closed Marconi and about 50 other public schools. Chicago’s education leaders cited poor student performances and low enrollments in what was then the largest simultaneous closing for any school district in the nation. Mayor Rahm Emanuel’s administration has defended the closings as needed, and a University of Chicago research group found that most of the displaced students wound up in   schools. Since 2012, the city has spent $178 million on capital improvements in the 11th District and added programs and services, city officials said. But six schools here were also shuttered, including Marconi. To get to their new school, Tilton Elementary, the children from Marconi had to cross different gang lines and new drug turfs, parents at Marconi complained. There were new teachers, new students and, in some cases, a longer walk. And the neighborhood itself was losing one more bit of precious ballast: the rare public institution that held them together. There is also this: Based on the city’s own criteria, Tilton barely rated a “good standing” designation, and so was only marginally better than Marconi. For many parents, the difference was hardly worth the effort. Tasha Walker, her husband and her oldest daughter had all once gone to Marconi, but she chose not to send her younger daughter on to Tilton. Instead, her children attend charter schools in a different neighborhood. “I’m not letting my kids get lost,” Ms. Walker said. For a brief time, Ms. Walker’s family had lived in a Chicago suburb, and she hopes to save enough money to move again. “I want them to be able to be teenagers,” she said.  On the Saturday of Memorial Day weekend, two men, ages 28 and 29, were shot and wounded as they stood on the sidewalk here at nearly midnight. The police say that both were gang members, and that neither would cooperate. No arrests have been made.  Sonja Bellephant, 48, grew up in an apartment building just across from the stoop where the two men were shot over Memorial Day weekend. These days, she lives in a Chicago suburb but works as youth director at the church her grandfather started on the corner. “Their life,” she said of the young people, “I wish it could be like my life. ” Ms. Bellephant wants to create an urban boarding school for young men in a shuttered, hulking church, school and convent on this block. She envisions an arts studio in a church down the street. She regularly stops strangers, asking if their children are in day care, if they have found a job, if they are in school. “Did you graduate from high school?” she called to a young man one morning. He looked puzzled but said yes, then hiked up his pants. “I want to tell them: ‘You don’t have to dodge bullets. You can finish school,’” Ms. Bellephant said. Ms. Bellephant, a former public school principal, is one in a vast array of individuals, government agencies, nonprofit groups and religious organizations with ideas for how to fix this area. The mayor’s office this fall announced plans for $36 million for mentoring in areas like this, and for a $100 million fund to bring economic development to neighborhoods. “The mayor is determined to turn around decades of neglect in the South and West Side neighborhoods that have been challenged by violence for generations,” said the mayor’s spokesman, Adam Collins. Mr. Emanuel’s “comprehensive strategy,” he said, “will add nearly 1, 000 new police officers, invest new dollars in our most challenged communities, make mentoring universal for young men in   areas, spur economic development, strengthen sentencing for violent gun offenders, and bring together community and faith leaders around a plan to provide   youth with better opportunities. ” Missing, though, community leaders say, is a single, overarching blueprint. Mentoring programs come and go with shifting grants. Job programs last a few months. “That’s the thing,” said Tio Hardiman, an activist who founded an   group that has worked along these blocks. “Nobody’s answering to nobody out there. Everybody’s in their own response mode. Sometimes, it’s more   between the various community groups than it is on the streets. ” Leaders have long been trying to draw attention to this part of Chicago. In 1966, the Rev. Dr. Martin Luther King Jr. moved into an apartment near this district as part of his Chicago Freedom Movement campaign to desegregate neighborhoods and get fair, affordable housing. In 1986, Jimmy Carter helped build a Habitat for Humanity townhouse but it caught fire years later, and was eventually torn down. Ms. Bellephant is still trying to figure out how to pay for her urban boarding school. An old banner is plastered on the shuttered building, a vestige from a different plan to turn it into a family life center, gym and school of performing arts. “It’s on the way 2013,” the banner promises.'"}, "time": 1742562502.2821279}