{"duration": 0.07490134239196777, "input_args": {"text": "'Share on Facebook Share on Twitter “Let food be thy medicine and medicine be thy food,” the great Hippocrates once said. This can sometimes be a torturous realization for me as I contemplate eating something that I know will not serve my body, mind, and spirit well. But if only it were that simple — merely having to decide between a cookie or a piece of fruit, rather than trying to understand how their ingredients may help or harm me. advertisement - learn more Labels in particular are one giant headache, but they can also make a world of difference between choosing a good food and a bad one. Labels on the majority of packaged foods need to meet strict requirements, relaying important information for people with food allergies, exposing food additives, and offering food storage instructions. But with the plethora of food labels out there, how can one keep up? It’s not even a matter of whether you can or not, or even want to or not; you simply need to know what you are putting in your body. We all shop for food, and as we do, whether it be online or in the store, we come across so many ingredients, brands, and ultimately, labels. There’s “cage free” and “humane certification,” there’s “natural”and “no antibiotics,” and then there’s “organic.” All of these labels can tell you important information about how animals are fed and handled, how crops are grown, and even how the workers are treated. They say ignorance is bliss, but when it comes to your health and humanity, the saying doesn’t always hold up. Have you ever seen a video online, listened to a descriptive story, or watched a full-length documentary about the way our food is made and by whom, and been utterly turned off, disgusted, or even beside yourself with anxiety and sadness? There’s a reason such exposures exist: to make people wake up and realize that the system isn’t as cut and dry as healthy and unhealthy. So when it comes to labels, while it can seem like far too much information to comprehend, it remains our duty to ourselves and to our families to learn what each signifies. And it doesn’t even have to be that difficult. advertisement - learn more Ghergich & Co. teamed up with Woodside to create an infographic on food labels in the hopes that they could easily share a go-to guide for consumers to understand exactly what the labels on the food they’re considering buying mean. They cover terms like cage free, certified humane, free range, free roaming, grass fed, and wild caught. Certified Fair Trade products, for instance, are made in safe and healthy working conditions. Both the farmers and producers receive a fair price and have a voice in how their workplace is run. “Natural,” on the other hand, doesn’t necessarily hold up to what consumers may assume. While these products don’t contain artificial ingredients or added colour and are minimally processed, growth hormones can still be used, they’re not always organic, and they don’t require that animals are raised in open space, either. Take a closer look at the following infographic to learn some valuable truths and important information for you to consider the next time you go grocery shopping. \\nThe Sacred Science follows eight people from around the world, with varying physical and psychological illnesses, as they embark on a one-month healing journey into the heart of the Amazon jungle. \\nYou can watch this documentary film FREE for 10 days by clicking here. \\n\"If “Survivor” was actually real and had stakes worth caring about, it would be what happens here, and “The Sacred Science” hopefully is merely one in a long line of exciting endeavors from this group.\" - Billy Okeefe, McClatchy Tribune'"}, "time": 1742564534.3436692}