{"duration": 0.1339576244354248, "input_args": {"text": "'LONDON  —   If walls could talk, Chatsworth House, with its sublime Painted Hall, Sculpture Gallery and endless parade of gilded staterooms, would have some tales to tell. Considered one of the great treasure houses of England, set amid the rolling green hills of the Derbyshire Dales, the estate has played host over the last 500 years to some of Britain’s most captivating and infamous women, including: Bess of Hardwick Mary, Queen of Scots Georgiana, Duchess of Devonshire Kathleen Kennedy, known as Kick (sister to John F. Kennedy) and Deborah Mitford, known as Debo. Their stories, and much more, will be revealed as part of an exhibition, “House Style: Five Centuries of Fashion at Chatsworth,” which opens to the public on Saturday. Curated by Hamish Bowles, international editor at large at American Vogue, and with creative direction and design by Patrick Kinmonth and Antonio Monfreda, the exhibition will delve into Chatsworth’s rich sartorial heritage, using the lives of its   inhabitants and their glamorous guests as mannequins on which to hang stories of the wider history of the house. “To be let loose in the wardrobe rooms, the gold vaults, the muniment room and the closets, cupboards and attics of Chatsworth  —   a place I came to as a little boy with a ticket in my hand and wonder in my eyes  —   has been a truly joyous experience,” Mr. Bowles said recently in a telephone call from the stately home. Lady Laura Burlington, the    of the current Duke and Duchess of Devonshire, conceived of the exhibition while hunting for a christening robe. She found umpteen perfectly preserved options complete with capes, underdresses and bonnets, which led her to wonder what else might lie undiscovered. Six years later, Mr. Bowles has seen his curatorial vision become a reality. The exhibition is organized by theme, including Coronation Dress Bess of Hardwick and the Tudor Influence the Georgiana Effect and Country Living and Entertaining at Chatsworth, though a standout moment for him may be a reimagining of the Devonshire House Ball, situated in the grandest staterooms in the house. Held in 1897 to celebrate Queen Victoria’s Diamond Jubilee, the ball, with 400 guests dressed as allegorical figures (and, crucially, photographed) was the grandest fancy dress ball of the century. Assistant curators for the exhibition spent months tracking down a handful of the original costumes, bringing them together for the first time since the night of the party. Mr. Bowles gasped as he described a Zenobia, Queen of Palmyra, gown made by the couturier   Worth for Louise, the formidable wife of the eighth duke, and arguably the jewel in the display’s crown. “So often,” Mr. Bowles said, “clothing is the most vivid entry point into getting a sense of how people of the past lived and existed in an environment or even a single moment in time. To create this exhibit on the landscape of Chatsworth, where so many legendary lives and moments have unfolded, has just been extraordinary. ” Lady Burlington, a former model and fashion buyer, said that her first meeting with Mr. Bowles was less than auspicious. “We met many years ago on an   fashion shoot for Harper’s and Queen,” Lady Burlington said, “where Hamish was the stylist, I was the model, and thanks to an overly snug Vivienne Westwood corset, I promptly fainted. ” Mr. Bowles helped revive her, she added, by giving her a cup of tea and a biscuit. Luckily, their next meeting proved more fruitful. Beyond the historical gems they unearthed, the exhibition is notable for its wealth of contemporary contributions, with garments from modern fashion labels like Alexander McQueen, Erdem, Maison Margiela, Vetements, Vivienne Westwood and Gucci, the exhibition’s principal sponsor. Last year, Gucci shot its 2017 cruise collection at Chatsworth, and the house clearly made its mark on the creative director Alessandro Michele, who said it was “unlike anywhere else in the world, full of charm and rituals. ” “You can see history everywhere,” Mr. Michele said, “yet everything is alive. ” The most recent Gucci runway collection was packed with what Lady Burlington termed “Chatsworth detail,” including fabrics, colors and bejeweled bugs and bees crawling over suiting and shirts. Given the calligraphy offerings on the Milan runway last month, Mr. Michele may also have been taken with the 11th duke’s trove of novelty slogan pullovers, printed with phrases like “Get Up and Do Something,” “Far Better Not” “All Passion Spent” and “Never Marry a Mitford. ” The duke’s wife, Debo Mitford (one of six Mitford sisters who dominated British high society in the 1930s) died in 2014, but she is represented in the exhibition. An ice pink satin “Carmel” gown she commissioned from Dior from its spring 1953 collection is a centerpiece of the show, while other highlights include her collection of bug and butterfly brooches and a pair of her favorite slippers, emblazoned with the image of Elvis Presley. Lady Burlington added wistfully that there might have been even more from the dowager duchess in the exhibition had she not willingly given away so many treasures. “Debo kept some things for sentimental reasons but generally thought nothing of passing clothes on,” she said. “As a result, her garments could turn up in the most unlikely of places. ” Lady Burlington recounted a story told by Charlotte Mosley about a time when the author had attended the local nativity performance alongside the duchess. The two had been sitting there for some time before the dowager suddenly sat upright in her chair, her eyes lit up. “Oh my goodness, I can’t believe it,” Lady Burlington said, repeating the account of the duchess’ reaction. “The Angel Gabriel is in my Givenchy!”'"}, "time": 1742561651.1870587}