{"duration": 0.11006712913513184, "input_args": {"text": "'From the archives: Here’s one of our favorite stories with helpful tips for Smarter Living. WE all have heard  —   or at least seen in the movies  —   great stories about people who are working in   jobs, then quit in some spectacular fashion and move on to fabulous second careers. This isn’t a column about that. Rather, more realistically, it’s about what to do if you’re in a job you dislike  —   or actively hate  —   but can’t move on. Maybe you need to pay the rent or the mortgage and you’ve sent out endless résumés and haven’t gotten a bite. Whatever the reason, you’re stuck. Are there ways to make going into work every day more palatable? Dawn Rosenberg McKay, who writes the career planning guide on About. com (which is owned by The New York Times) suggests first making a list of all the things you dislike about your job. Try to do it when you have a little distance, like during a vacation or on a weekend. Don’t cheat and write, “everything. ” It may feel that way, but that’s not helpful. “If you hate your boss, write down the things you hate about her,” Ms. Rosenberg said. Do you like what you do, but dislike your colleagues or boss, or do you despise the actual tasks? Try to separate it out. Then write down all the things you like about your job, and again, “nothing” is not a satisfactory answer. “Try to find something positive, even if it’s just the neighborhood you work in or the view from your window,” she said. If you want to switch careers, not just get out of that particular job, Cathy Goodwin, a career consultant  who specializes in career transitions, suggested focusing on “developing skills rather than serving time. ” What can you learn that you can put on your résumé? Computer skills? Public speaking? “If your company offers education benefits, use them to make yourself marketable,” she said. Even if your company will pay only $1, 000, you can take a class at a community college. Roy L. Cohen, author of “The Wall Street Professional’s Survival Guide” (Financial Times Press, 2010) said “a bad job may be a necessary placeholder while you take classes or network for a new and more satisfying job. ” And yes, I can hear the groans out there. I know people who have been networking and applying for jobs for a year or more in the hope of moving on. No one said it would be easy in these tough economic times, or quick. If you’re stuck, are there particular tasks in your job that you like? Has your job changed so that you’re now doing a lot of things you find   or off your career path? Is there any way to talk to your boss about this? But before you approach your manager, “consider whether how you are being treated is unique to you or shared by your colleagues,” Mr. Cohen said. As firms downsize, many employees are being forced to take on lots of extra work. If everyone is in the same boat, you may just have to accept it. If you feel, however, that you are unfairly singled out, or if you are truly overwhelmed, think whether there is a way you can talk to your supervisor, Ms. Rosenberg said. One trouble in many jobs is that workers feel underappreciated or completely unappreciated, Mr. Cohen said. There are some companies where “your boss sees you and your colleagues only as a resource to be used and exploited,” he added. “Don’t expect or look for appreciation to be expressed or for your good work to be acknowledged. In this situation, ‘employee appreciation’ is an oxymoron. ” So what can you do? Look outside your job for positive feedback. Can your family and friends supply it? Perhaps volunteering or joining a professional organization can give you some sense of purpose if you can’t get it from your workplace, he said. When I was in a job and my supervisors insisted  —   unfairly, I believed  —   that I wasn’t producing enough, I found it helpful to document exactly what I was doing. This proved not only important in negotiations with the   but also helped   my own sense of worth. A. J. Russo, a pharmacy technician in Pennsylvania, said she tried to manage her problems with her colleagues by putting the situation in some perspective. “I try to remind myself that it’s not my   or boss,” she said. “We’re all stressed. There are three of us doing 300 prescriptions a day. I try not to take it personally. ” With car payments and student loans, she said, “I would rather be employed than unemployed. ” She said she was determined to stay in her current one until a new job came along. Ms. Russo said she had complained a lot to her friends outside work, which might help deal with the pain. But, Ms. Rosenberg, the career columnist, cautioned against grousing too much to your colleagues at work. “They say misery loves company, but you don’t want set a tone in the office,” Ms. Rosenberg said. For one thing, it can get back to the powers that be. And while a little complaining can feel good, too much tends to just compound the negativity. Be aware of further   Ms. Goodwin said. Sloppy performance, talking back to   or managers or showing up late  —   that’s what people do when they are unhappy at work. And it can get you fired. You may find out how much you liked, or at least needed, that job once you’re forced out. There are times, of course, when you have to leave your job before you have another lined up, especially if it’s making you physically or emotionally ill, Ms. Rosenberg said. A friend of mine, who asked not be named because he was still looking for a job, quit his a year ago after three and a half months. “It was a constant source of stress,” he said. “I was always in a bad mood, even on weekends. ” A professional with many working years under his belt, my friend said he knew there were problems just a few weeks into the new job, but he was determined to stick it out. “But when I went to London for a meeting, I had to double my   medication and take a   monitor,” he said. “That’s a sign that something’s wrong. ” He acknowledged that he thought he would find another job more quickly than was the case. In the last year, he has done consulting work and even, at times, driven a limousine. But he never regrets leaving. “The uncertainty is uncomfortable, but it’s better than the certainty of that job,” he said. If you’re wondering about quitting your job, Ms. Rosenberg provides a useful quiz to help with the decision on her Web site. And while it’s not easy in our culture, where we tend to “live to work rather than work to live,” as the saying goes, everyone I spoke to agreed we could try to change that perspective. Do you have to work 60 hours a week, or can you shorten your work hours and take a dance or   class? Or go to a play? And beware of idealizing other jobs. It may well be that another position will suit you better. But remember, just because you’re unhappy in your current job doesn’t mean the next one will be perfect.'"}, "time": 1742562092.853008}