{"duration": 0.19327712059020996, "input_args": {"text": "'2016 presidential campaign by Matt Sedillo \\nHillary Clinton is, no doubt, a threat to life on Earth. But the duopoly electoral system is a menagerie of warmongers. “The response to the white nationalism of Donald Trump has been the rainbow coalition of hawks.” Barack Obama has proven an awesomely prolific war maker. Bernie Sanders is no peacenik. “It is only the white nationalist orange demon -- guided only by his own whims and twitter feuds -- that is at all off script on this question.” LesserOfTwoEvilism by Matt Sedillo \\n“ So long as there is a ruling class they shall rule by fire and blood.” \\nThe loathsome and shameless hypocrisy of the Democratic Party and the doctrine of lesseroftwoevilism has been laid bare this political season. This same Democratic Party that unquestionably rigged the primaries against the left-leaning Bernie Sanders campaign is now selling itself to the public as the savior of the downtrodden from the threat of an uber right wing candidate. \\nHillary Clinton at this point in her election run appears to be making no promises to the public other than to not to physically morph into Donald Trump during her coronation come Election Day. \\nLesseroftwoevilism is a bankrupt political ideology and the means by which the Democratic Party deadens any inkling towards decency or rational self interest that may lay dormant in the American electorate. Hillary Clinton and the Democratic Party intend to use the platform of \"at least not being Donald Trump\" to install the most despised Democratic candidate in a generation into the White House. \\nIt is indeed horrifying that a straight up eugenicist billionaire who brags about sexual assaulting women won the Republican primary. It is terrifying that the cult leader of a white nationalist zombie apocalypse has gotten this far through the electoral process. \\n“There is no greater threat to the future of much of life on the planet than Hillary Clinton.” \\nThe country is polarizing and it is terrifying to see that much of it is polarizing in the direction of Donald Trump whose campaign is defined by phrases like “Make America Great Again” quickly followed by “Mexico Will Pay.” Much of the country is also polarized in the direction of Bernie Sanders. It was the political apparatus of the Democratic Party, not the Republicans, that prevented these two competing visions from standing before the American public. \\nSetting aside the fact, for a moment, that we don\\'t live in a democracy, it must be noted that lesseroftwoevilism in American politics is an ideology by Americans for Americans. Hillary Clinton, Donald Trump, AND Bernie Sanders are all advocates of the US war machine. If any of these three warlords were to sit in the seat of power children in far off lands would still be bombed in their sleep and be reported on as collateral damage. \\nHillary Clinton is the most bloodthirsty advocate for murder and mayhem in a political system that thrives upon such practices. When it comes to dropping bombs, obliterating nations or possibly igniting a nuclear winter there is no greater threat to the future of much of life on the planet than Hillary Clinton. \\nRainbow Coalition of Hawks \\nFar beyond a “basket of deplorables,” the 2016 Republican national convention was a ghastly horror show of the most reactionary, bigoted elements of American political culture. Less than esteemed actor Scott Baio captured the mood when he proclaimed, “so of course let’s make America great again, but let’s make America America again.” That largely captured the theme of the proceedings and most speeches were some variation upon that theme. \\nThe Democrats in response sought to make their convention a big tent of peoples, ideas and movements. And indeed from the spontaneous chants of “black lives matter” to Tim Kaine leading a chant of “si se puede” to Eva Longoria reminding the audience “we didn’t cross the borders the borders crossed us” to Michelle Obama letting the thousands in attendance and the millions watching at home know that slave labor built the White House and the country, from Sebastian De La Cruz singing the national anthem in full mariachi garb to the Khan family holding a copy of the Constitution, the Democratic National Convention did present itself as a stark contrast to what the GOP was offering. \\nThe theme of inclusion ran high and, indeed, current president Barack Obama made his call for strength in unity, explicitly saying “And most of all I see Americans of every party, every background, every faith who believe we are stronger together, black white, Latino, Asian, Native American, young, old, gay, straight, men, women, folks with different abilities, all pledging allegiance, under the same proud flag, to this big bold country that we love.” One flag to rule them all. \\n“America the greatest and most diverse nation on Earth shall ransack the globe as it sees fit. ” \\nGeneral John Allen, standing before a multi ethnic group of people continued upon this theme and made the connection between a more inclusive union and explicit projection of American might \\n“Every American, in uniform or out, in the White House or at home, must be a force for unity in America, for a vision that includes all of us: every man and woman, every race, every ethnicity, every faith and creed, every gender orientation – all of us together pursuing our common values. \\n“From the battlefield to the capitals of our allies, friends, and partners, the free peoples of the world look to America as the last best hope for peace and for liberty for all humanity, for we ARE the greatest country on this planet. \\n“So we stand before you tonight to endorse Hillary Clinton for President of the United States of America.” \\nThe message could not be clearer. Sorry Donald Trump, we are all Americans here. No apologies rest of the world, America the greatest and most diverse nation on Earth shall ransack the globe as it sees fit. \\nThe response to the white nationalism of Donald Trump has been the rainbow coalition of hawks as chiefly embodied in the persons of Barrack Obama and Hillary Clinton. \\nHillary Clinton: The Obliterator of Nations \\nHillary Clinton is a war criminal. So is John Kerry. So is Condoleezza Rice. So are Colin Powell and Madeleine Albright. The secretary of state in an imperialist nation is the immediate manager of the projected might of the empire they represent. \\nHillary Clinton is known to be a war hawk for much the same reason Donald Trump is known as a white nationalist. She is blatant and crass about it. \\n“We came. We saw. He died” – Hillary Clinton on the assassination of Ghadaffi \\n“In the next 10 years, during which they might foolishly consider launching an attack on Israel, we would be able to totally obliterate them” – Hillary Clinton speaking of obliteration of 75 million Iranians. \\nFor much of the past few months the Clinton campaign have bemoaned a Russian conspiracy to reveal the words that Hillary Clinton actually wrote and thereby influence the American election. \\nHillary Clinton’s neo-Mcarthyite cold war against her own words and general war talk on Russia should come as no surprise to anyone paying any attention. She was hawkish on Russia in their land dispute with Georgia over Ossetia, even going so far as to arm the Georgian government in 2010 less than two years after the conflict. She was warlike on the conflict in the Ukraine, promising Ukrainian government officials as recent as September of this year to stand with them against “Russian aggression.” \\n“A Clinton presidency is the will of the ruling class.” \\nThis is the talk of someone prepared for a nuclear apocalypse. \\nIt should be mentioned, however, that Obama has also dialed up his anti Russian rhetoric, as has Tim Kaine, as has Mike Pence. It is only the white nationalist orange demon -- guided only by his own whims and twitter feuds -- that is at all off script on this question. \\nUltimately a Clinton presidency is the will of the ruling class. If she wants war it is a reflection of their desire for war. If they want the bombs to fall then death will rain from the sky. So long as they hold power they shall exercise it. So long as there is a ruling class they shall rule by fire and blood, because there truly is no alternative. Because ultimately, this is about Clinton and then again it isn’t. And this is about the Democrats and then again it isn’t. This is about the US and this is about war. Hillary Clinton is a 2016 warlord. War is a racket. And so is this God damn election. Matt Sedillo can be contacted at [email protected] .'"}, "time": 1742561660.775375}