{"duration": 0.06282901763916016, "input_args": {"text": "'Sen. Ted Cruz ( ) ripped into Tesla CEO Elon Musk Thursday night for his use of a private jet after the tech billionaire tweeted his disapproval of President Trump pulling out of the Paris Climate Accord. [Musk, the CEO of Tesla and SpaceX, took to Twitter to announce that he would be departing from all future presidential councils in protest of President Trump’s decision to pull the U. S. out of the Paris Climate Accord. He assured his followers that global warming is real and that leaving the Paris accords is “not good” for America or the world.  Am departing presidential councils. Climate change is real. Leaving Paris is not good for America or the world.  —   Elon Musk (@elonmusk) June 1, 2017,  Hours later, Cruz mocked Musk’s outrage, pointing out that he regularly travels around the country in his own private jet. If the billionaire CEO was so dedicated to reducing the world’s carbon output, Cruz snarked, he would choose to fly commercial planes rather than private ones. In support of Paris, CA billionaires pledge to never again fly private, will only fly commercial.   —  will quit symbolic councils instead. https:  .   —   Ted Cruz (@tedcruz) June 2, 2017,  Musk has come under fire previously for his liberal use of his private jet, which he upgraded last year from a Dassault Falcon 900 B to a Gulfstream G650 ER. It was reported in 2010 that Musk took private jets to Washington on at least 12 occasions over the course of two years to lobby the Department of Energy for a loan of $465 million, which Musk’s company Tesla was eventually granted. Around the same time, Tesla also struck deals with the California Alternative Energy and Advanced Transportation Financing Authority that made the company exempt from up to $320 million in California State sales and U. S. taxes. Musk has been a vocal supporter of carbon taxes, saying, “All we are doing [with a carbon tax] is trying to match the inherent subsidy for fossil fuels  …     on the sustainable energy side. Fossil fuels are already getting a massive subsidy if you believe in global warming. If you don’t then [the subsidy] seems really unfair. If you do then it is like oh we are just trying to correct it. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562140.1232514}