{"duration": 0.14060544967651367, "input_args": {"text": "'Email \\nIn American political terminology, “lame duck” refers to a politician whose term is drawing to a close. That of course describes President Barack Obama, who will turn over the keys to the White House to President-elect Donald Trump on January 20, 2017. Several past presidents have used the time between the presidential election and the inauguration of their successors to issue controversial executive orders, make “midnight appointments,” and grant controversial pardons. \\nAfter President John Adams lost to Thomas Jefferson in the election of 1800, he used this time to make a multitude of political appointments, including filling the post of chief of justice of the Supreme Court with John Marshall. Adams left office in 1801, but Marshall remained on the court until 1835. (This is a dramatic illustration of the importance placed on Supreme Court appointments during the just-past presidential campaign.) The Republican-controlled Senate has already made clear that Obama will not be allowed to make a repeat of that history-changing nomination, opting to not even hold hearings on Obama’s Supreme Court nominee Merrick Garland, offered as a replacement for the late Justice Antonin Scalia. \\nBut Obama still holds the reins of executive power until Trump takes the oath of office, and there are many more radical moves he could make in an effort to extend his influence beyond the end of his term of office. \\nOne area of concern, based on his previous actions, includes his pushing the envelope on the role of the executive branch in the enforcement of federal regulations. For example, Obama has pressured public schools across America to open their showers and restrooms to transgender students. Under this policy, the Obama Department of Education used Title IX statutes to argue that refusal to allow, for example, a male student to walk into a shower with female students, if that student claims to self-identify as a girl, is an act of discrimination not allowed under federal law. And if these schools refuse to follow Obama’s policy, they are threatened with the loss of federal funds. Of course, the federal statutes refer to discrimination on the basis of sex, and no one can seriously contend that those statutes were enacted decades ago with transgender students in mind. \\nAnd that was before the 2016 presidential election, when such a policy could hurt Democratic congressional candidates, or even the presidential nominee, Hillary Clinton. What will Obama do if he no longer has any such concern? Will he take even bolder action in the time he has left? \\nSam Batkins, director of regulatory policy with the American Action Forum, has said that five major rule changes in areas such as renewable fuels and methane are still awaiting action by Obama. With Trump unlikely to advance the radical environmental agenda of Obama, there may well be some move by the outgoing president in this area before the inauguration in January. \\nObama has regularly demonstrated a disregard for the doctrine of separation of powers. Under this important doctrine, the Constitution explicitly gives to Congress all legislative power enumerated in the Constitution. Yet faced with a Congress that has refused to pass legislation favored by Obama in areas such as immigration, he has not hesitated to use “executive orders” to implement this agenda anyway. \\nConsidering that restricting out-of-control immigration was a major campaign theme of Trump, will Obama issue yet another executive order in this area, believing nothing will happen to change it for the next four years? \\n“I’ve got a pen and I’ve got a phone,” Obama said back in 2014. “And I can use that pen to sign executive orders and take executive actions and administrative actions that move the ball forward.\" \\nSome of Obama’s previous executive orders have been challenged in court and sometimes blocked by federal judges on the grounds that he exceeded his powers. Yet he has not backed off in using executive orders to, in effect, make law. He has declared, “One of the things that I’m going to be talking to my Cabinet about is how do we use all the tools available to use, not just legislation , in order to advance a mission that I think unifies all Americans.” (Emphasis added.) \\nSurely Obama does not believe using executive orders to circumvent Congress and the Constitution is somehow “unifying.” \\nOther presidents have certainly issued executive orders, going all the way back to George Washington. But this misses the point. Executive orders are a legitimate exercise of presidential power — if they are directed to members of the executive branch, to implement an act of Congress, or in some cases, concerning court decisions. Contrary to Obama’s assertions, however, they are not a constitutional method of making law, as the Constitution clearly states that all that power belongs to Congress. All does not leave any such legislative power to the president. \\nOne subject that could be of more immediate concern during the upcoming lame-duck session of Congress is the Trans-Pacific Partnership (TPP) trade deal negotiated by Obama, but with which Congress has yet to take action. With President Trump an ardent opponent of the deal, it will most likely be withdrawn from congressional consideration after January 20 of next year. Knowing that, Obama may make a major effort to push the pact through in the lame-duck session. One might remember that President Bill Clinton did the same thing with NAFTA during his term as president. And since far too many Republican members of Congress, and even leaders such as House Speaker Paul Ryan favor the TPP, opponents of this globalist trade deal cannot let down their guard. \\nFinally, it is traditional for presidents to grant pardons in their last days in office, and even up to their very last day. These actions of executive clemency are certainly constitutional, as part of the checks-and-balances concept of the Constitution — powers granted to the president to correct alleged injustices that may have occurred in the federal courts. But some pardons over the years have certainly raised eyebrows. \\nWith Hillary Clinton remaining under a cloud of potential prosecution by a future Justice Department, some have even speculated that Obama may give her a pardon on his way out the door. Also, one Republican lobbyist, Michael McKenna, noted, “I do think a pardon for Huma and Weiner might happen.” McKenna was referring to Clinton’s top confidante, Huma Abedin, and her estranged husband, Anthony Weiner. It appears that Abedin and Weiner may have violated federal laws in their handling of sensitive State Department documents. The discovery of a trove of these e-mails on the laptop of Weiner precipitated the issuance of a statement by FBI Director James Comey that he had reopened the investigation into Clinton. \\nIt is not the first time that Comey has given a Clinton a clean bill of legal health. \\nComey also played a role in a controversial pardon issued by Bill Clinton years ago. Marc Rich was a fugitive who fled the country during his prosecution (ironically, by then-federal attorney Rudi Guiliani), and traveled to Switzerland to avoid imprisonment. He owed $48 million in taxes and was charged with 51 counts of tax fraud. Rich was also wanted for trading illegally with Ayatollah Khomeini’s Iran, where he purchased around $200 million worth of oil during the time 53 Americans were held hostage in Teheran. He also made illegal deals with Gadhafi in Libya, Kim Il Sung in North Korea, and other communist dictatorships, including the Soviet Union and Cuba. \\nHe fled to Switzerland in 1983, but outgoing President Bill Clinton pardoned him on his last day in office, on January 20, 2001. Even Clinton supporters were repulsed by the pardon, with the New York Times calling it “a shocking abuse of presidential power,” and former President Jimmy Carter declaring it “disgraceful.” Even Democrat Congressman Barney Frank said, “It was a real betrayal of Bill Clinton of all who had been strongly supportive of him to do something this unjustified. It was contemptuous.” \\nJames Comey was later appointed to investigate the circumstances surrounding this pardon, but claimed he found no illegality on Clinton’s part. This investigation occurred as a result of Rich’s wife donating over $200,000 to the Democratic Party in 2000. She later gave $450,000 to the Clinton Library Foundation, and $100,000 to Hillary Clinton’s Senate campaign. \\nWith this kind of sordid history of a past president, coupled with Obama’s own track record of disregarding constitutional restrictions, it\\'s no surprise that many are holding their breaths to see just what our outgoing president might do during his last few weeks at 1600 Pennsylvania Avenue. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562257.1133413}