{"duration": 0.05728411674499512, "input_args": {"text": "'The Blaze reported : \\nThe National Republican Congressional Committee cut an ad for one of its endangered congressional candidates, touting him as an “independent voice” who “stood up to” Republican nominee Donald Trump “months ago.” \\nRep. Bob Dold, who represents a heavily Democratic district in northeastern Illinois, is in danger of losing his House of Representatives seat to former Democratic Rep. Brad Schneider. This is the third time in three cycles the two politicians have faced off in the pendulum-like district — first Schneider unseated Dold in 2012, then Dold unseated Schneider in 2014. \\nThe NRCC went on to criticize the Democrat nominee for voting with his party 90 percent of the time and touted their candidate as “one of the most bipartisan members of Congress.” \\nIn the ad, a clip from March 2016 showed Dold take a swipe at Trump in an interview with the Clinton News Network: “I think Donald Trump has disqualified himself.” \\nCNN reported on Aug. 10, 2016: \\nOne of the first Republicans to oppose Trump, the Illinois representative told WLS May 6: “I will not support Donald Trump,” referring to Trump’s comments about women, Muslims, Latinos and POWs. “We’re looking for a uniter, not a divider,” he said. \\nSupporting: Will write in a candidate. \\nRepublicans like Dold are a big part of the reason why Trump has been so successful. The Republican Party has sold out this country and the American people who used to support them. \\nThe veil has been lifted and many Americans have woken up to the fact that establishment Republicans are in on the globalist agenda and are one in the same with the Democrats. They attempt to squabble over minor issues to make it seem as if there’s a difference, but the reality is that they’re all in on it. \\nThey’re selling out our country, and many of the so-called principled Republicans truly want a Hillary Clinton presidency because they want her globalist agenda to succeed. \\nThe NRCC’s praise for Dold and criticism of his opponent evidences the fact that they’re in on it. They criticize the Democrat for siding with his party but praise Dold for being “bipartisan,” which might as well be Washington-ese for Republicans rolling over while Democrats fundamentally transform this country. \\nThis country is at a precipice. There are those who want to maintain national sovereignty and get back to what made America great, and there are those that want globalism and to eviscerate America as we know it. \\nSo to the NRCC: there is nothing “principled” about giving our country away, and many of us are on to your game.'"}, "time": 1742564057.9709637}