{"duration": 0.1067805290222168, "input_args": {"text": "'The   posters, pasted on walls and lampposts around Paris by an activist group during the United Nations climate talks last year, were hardly flattering. They depicted Myron Ebell, a climate contrarian, as one of seven “climate criminals” wanted for “destroying our future. ” But in his customary   way, Mr. Ebell, who directs environmental and energy policy at the Competitive Enterprise Institute, a libertarian advocacy group in Washington, brushed it off. “I’ve gotten used to this over the years,” he told an interviewer at the talks. “But I did go out and get my photo taken with my poster, just so I have it as a memento. ” In looking for someone to follow through on his campaign vow to dismantle one of the Obama administration’s signature climate change policies,   Donald J. Trump probably could not have found a better candidate for the job than Mr. Ebell. Mr. Ebell, who revels in taking on the scientific consensus on global warming, will be Mr. Trump’s lead agent in choosing personnel and setting the direction of the federal agencies that address climate change and environmental policy more broadly. Mr. Ebell, whose organization is financed in part by the coal industry, has been one of the most vocal opponents of the linchpin of that policy, the Clean Power Plan. Developed by the Environmental Protection Agency, the plan is a   set of regulations that, by seeking to reduce carbon emissions from electricity generation, could result in the closing of many   power plants, among other effects. Mr. Ebell has said that the plan, which has been tied up in the courts since it was finalized in 2015, is illegal. In the interview in Paris last year, he said he hoped whoever was elected president would “undo the E. P. A. power plant regs and some of the other regs that are very harmful to our economy. ” As the person Mr. Trump has chosen to lead the transition at the E. P. A. Mr. Ebell, 63, will be in a position to begin to do just that. Mr. Ebell, who did not respond to a request for an interview, grew up on a ranch in Oregon. He got his undergraduate degree at Colorado College and master’s at the London School of Economics, where he studied under the conservative political philosopher Michael Oakeshott. He has described himself as “sort of a contrarian by nature and upbringing,” and has said he was very strongly influenced by the “question authority” ethos of 1960s and ’70s counterculture “I really think that people should be suspicious of authority,” he told an interviewer last year. “The more you’re told that you have to believe something, the more you should question it. ” Mr. Ebell leads the Cooler Heads Coalition, a   group that says it is “focused on dispelling the myths of global warming by exposing flawed economic, scientific, and risk analysis. ” He has been one of the nation’s most visible climate contrarians, known for dispensing memorable sound bites on cable news shows and at events like the annual conferences sponsored by the Heartland Institute, a   group that rejects the overwhelming scientific consensus on climate change. Mr. Ebell has said that “a lot of     and   scientists have gotten a long ways” by embracing climate change. He frequently mocks climate leaders like Al Gore, and has called the movement the “forces of darkness” because “they want to turn off the lights all over the world. ” No one, it seems, is immune to his criticism. He called Pope Francis’s encyclical on climate change, issued in   “scientifically ill informed, economically illiterate, intellectually incoherent and morally obtuse. ” “It is also theologically suspect, and large parts of it are leftist drivel,” he added. Mr. Ebell cut his teeth in Washington working for Frontiers of Freedom, a research group founded by former Senator Malcolm Wallop, a Wyoming Republican, to advocate for limited government. He also worked for a Republican congressman from Arizona, John Shadegg, on an effort to revamp the Endangered Species Act to make it more respectful of property rights. In interviews and speeches, Mr. Ebell comes off as amiable and calm. But he is hardly shy about lobbing verbal grenades, sometimes directly at scientists and environmentalists. He clashed with Kevin E. Trenberth, a senior researcher at the National Center for Atmospheric Research, in an appearance on Fox News in 2009 after the unauthorized release of emails from a server at an English university set off a battle over the integrity of leading climate scientists. Mr. Ebell called Dr. Trenberth “part of a gang” that had been “cooking the data” on climate for years, accusations that Dr. Trenberth strenuously denied. During an August 2015 appearance on   with Jeremy Symons of the Environmental Defense Fund, Mr. Ebell did not deny Mr. Symons’ assertion that the Competitive Enterprise Institute receives money from the Murray Energy Corporation, one of the nation’s largest coal producers. He countered that his group’s total budget, of about $6 million, was far smaller than that of Mr. Symons’ group. “I would like to have more funding,” Mr. Ebell said, “so that I could combat the nonsense put out by the environmental movement. ”'"}, "time": 1742628421.8327286}