{"duration": 0.17510652542114258, "input_args": {"text": "'259 Views November 17, 2016 1 Comment Analyses The Saker \\nThis article was written for the Unz Review: http://www.unz.com/tsaker/putin-is-finally-purging-the-medvedev-government/ \\nWhile the word was focused in rapt attention on the outcome of the US Presidential election, Vladimir Putin did something quite amazing – he arrested Alexei Uliukaev , Minister of the Economy of the Medvedev government, on charges of extortion and corruption. Uliukaev, whose telephone had been tapped by the Russian Security Services since this summer, was arrested in the middle of the night in possession of 2 million US dollars. Putin officially fired him the next morning. \\nRussian official sources say that Uliukaev extorted a $2 million bribe for an assessment that led to the acquisition by Rosneft (a state run Russian oil giant) of a 50% stake in Bashneft (another oil giant). Apparently, Uliukaev tried to threaten Igor Sechin , the President of Rosneft and a person considered close to Vladimir Putin and the Russian security and intelligence services. \\nYes, you read that right: according to the official version, a state-owned company gave a bribe to a member of the government. Does that make sense to you? How about a senior member of the government who had his telephone tapped and who has been under close surveillance by the Federal Security Service for over a year – does that make sense to you? \\nThis makes no sense at all and the Russian authorities fully realize that. But that is the official version. So what is going on here? Do you think that there is a message from Putin here? \\nOf course there is! \\nRemember the corrupt Minister of Defense Anatolii Serdiukov ? He was first fired from his position and only then arrested. But this time around, it is a member of the government which is arrested in the middle of the night. For a few hours, his subordinates could not even reach him – they had no idea what had happened to him. Was that a mistake? Hardly. \\nThe way Uliukaev was detained was carefully choreographed to instill the strongest sense of fear possible in all the other 5 th columnists still in power because in so many ways Uliukaev was a symbol for all the the “Atlantic Integrationists” (those in the Kremlin who want to integrate Russia into the US controlled international security system): Uliukaev was a known liberal, just like Nikita Belykh , governor of Kirov Region, who was detained in a high-publicity arrest in June for taking a 400’000 Euros bribe. I would even say that Uliukaev could be considered the ultimate symbol of the Atlantic Integrationists and a faithful member of the Russian “liberal” (meaning the “Washington consensus” type) sect who, in the past had worked with Egor Gaidar and Alexei Kudrin and who now has been brought down by the Russian “ siloviki ”, the top officials of the so-called “power ministries” (defense, state security, intelligence). Sergei Korolev, the Head of the Economic Security service of the FSB \\nThis was immediately recognized by everybody and the main headline of the popular website Gazeta.ru could not be clearer, it read: “ The Siloviki brought down Uliukaev ” and featured a photo of the key actors of this drama, including the tough-looking man thought to have brought Uliukaev down, Sergei Korolev, the Head of the Economic Security service of the FSB (shown on photo here). \\nIn April, I predicted that a government purge was in the making . I have to admit that I thought that this would have happened earlier. Apparently Putin decided to take action while Uncle Sam was busy with his own, internal, problems. If that is indeed the reason for the late timing, that says a lot about the power of the USA still wields in Russia. Some observers noticed that the arrest of Uliukaev took place after the telephone conversation between Trump and Putin, hinting that Trump might have given Putin the go ahead for the arrest. That is, of course, utter nonsense, but if that can make Putin look bad – it’s good enough for the 5 th columnists. \\nThe list of potential ‘candidates’ to be purged next is still long and includes names like the Deputy Prime Minister Arkadii Dvorkovich , the First Deputy Prime Minister Igor Shuvalov , the Governor of the Russian Central Bank Elvira Nabiullina , the Minister of Finance Anton Siluanov and, of course, Prime Minister Dmitri Medvedev. Uliukaev was only one amongst many more. Still, he was definitely a top-level target and the manner in which he was arrested must have sent a chill down the spine of all the other 5 th columnists in the Kremlin. Just the fact that his phone was tapped for so long is quite unthinkable and clearly points to the fact that nobody is safe from Putin’s purges. And that, by itself, is truly a most welcome change: every member of the Medvedev government now has been put on notice that his/her life is now spent under the close scrutiny of the FSB. \\nIt really matters little what will happen to Uliukaev next. He has be formally arraigned, now his case will be further investigated and then Uliukaev will have his day in court (right now he has only be detained and he will be kept under house arrest for the next two months). Potentially, he faces 15 years in jail and a fine equivalent to 70 times the amount of the bribe he took. Judging by the case of Serdyukov, who is managed to escape any prison time thanks to a Presidential Amnesty for the 20 years of the Russian Constitution, Putin seem to be reluctant to inflict any form of retribution upon his enemies. But even if Uliukaev does not get to enjoy the fresh air of the Siberian taiga, he is already finished as a power broker, and that is all that really matters to Putin. \\nWhat matters here is that in the course of one night, a top level Russian Minister went from his Ministerial Offices to a holding cell and that absolutely nobody saw it coming or could prevent this. Yet again we have a case of 100% Putin style: no warnings of any kind, no hints even, just sudden dramatic action with an immediate result. His “handwriting” is clearly all over the case. Uliukaev ain’t laughing no more… \\nThe reaction to this arrest in Russia was predictable, especially after sources in the security services told the Russian media that Arkadii Dvorkovich and Andrei Belousov were also under investigation. Anatolii Chubais, for example, declared that he was in “total shock”. Even better was the reaction of Prime Minister Medvedev who said that this development was at the “edge of his understanding”. \\nIt will be interesting to observe the inevitable reaction from the Atlantic Integrationists: if they really feel defeated, they will pay lip-service to the need to “fight corruption on all levels” and generally keep a low profile. If they still have some fight in them, they will denounce a “Stalinist” crackdown, the return to “1930’s -like purges” and a “new campaign of terror” against democracy. The western corporate media, whose only “value” is money, will write about how the Russian “secret police” is cracking down on “business entrepreneurs” and how that will end up damaging the Russian economy. Basically, a repeat of the whining which we all heard when Putin dismantled the infamous semibankirshchina . As Elton John would say, we “have seen that movie too…” \\nAs for the rabid Putin-hating nationalists, they will say that this is too little too late. For years they have been complaining about corruption and how top level officials were never investigated, and now that they seem to have gotten their wish, it’s “too little, too late”. But that doesn’t really matter, since they have almost as little credibility with the Russian general public as the pro-western parties like Iabloko or Parnass. \\nThe main media outlets and political commentators are all giving Putin a standing ovation right now. That is hardly surprising since they are the ones who for many months now have been loudly and constantly complaining about the “economic bloc of the government”, meaning the pro-US 5 th columnists inside the Medvedev government. Quite literally all the main political commentators have been begging and demanding a purge of this “economic bloc” and a radical change in the economic policies of Russia. Well, they got one villain purged, which is a good start, but there are no signs that more heads will roll or that the economic course of Russia will finally break from the Washington consensus kind of policies and be replaced it with much needed policy of internal growth. But then, knowing Putin, we should not expect any signs – only action. \\nIn Russia, just as in the USA, changing the people is far easier than changing the system while the only way to achieve real change is, precisely, to change the system, not the people. So far, Putin has only succeeded in kicking some of the worst people out and, to his credit, getting some very good people in. Now that a threat of war with the USA is very substantially reduced and that Uncle Sam will be busy with his own, internal, struggles, I hope that Putin will finally take some very strong action to liberate Russia from the Washington consensus types and replace them with real patriots who will finally make it possible for Russia to become a truly sovereign country, even in the economic sense. \\nThe Saker The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742562212.010721}