{"duration": 0.059635162353515625, "input_args": {"text": "'0 comments In many ways, this SCANDALOUS investigation is more DISTURBING than the others… It is hard to imagine an investigation more scandalous than the one presented my sexting wild man Anthony Weiner and his beautiful, estranged wife, Huma Abedin. Depending on what is found on the 650,000 emails on Weiner and Abedin’s laptop, the infamous couple could take down one of the most powerful women on the planet, Hillary Clinton. Something tells me that there is plenty of scandal to go around, however. It is now being reported that the FBI’s Miami office is investigating the Clinton Foundation for their “work” in Haiti. . @rpollockDC reports that FBI’s Miami office is conducting Clinton Fnd probe concerning Haiti work. https://t.co/w8iPeQ69nr @dailycaller \\n— Chuck Ross (@ChuckRossDC) October 31, 2016 \\nIt is no surprise that the FBI is interested in the Clinton’s dealings in Haiti. \\nSince January of 2015, when a group of Haitians surrounded the Clinton Foundation’s offices in New York, carrying signs that said, “Clinton, where’s the money?” \\nDhoud Andre, of the Commission Against Dictatorship, has said, “We are telling the world of the crimes that Bill and Hillary Clinton are responsible for in Haiti.” \\nRecent emails, leaked from the State Department, indicated that contractors seeking to provide earthquake relief to devastated Haitians were heavily vetted by Secretary of State Hillary Clinton’s team. The criteria? Contractors needed to be “FOB’s,” or “Friends of Bill.” These FOB’s were donors to the Clinton Foundation. Reportedly, if a contract company was not a donor, they were referred elsewhere, while donating contractors were given funds to work in Haiti. \\nAlmost $4 billion was sent to Haiti for relief, and it has been noted by some Haitians that little of this money actually made it to those who need it. \\nHaitians also have noted that Bill Clinton was the designated UN Representative for aid to Haiti while Hillary Clinton was the Secretary of State. \\nThe Clintons were the two most powerful people controlling the funds meant to help Haitians. \\nContracts went to friends of the Clintons, and, reportedly, homes were not built, schools were not built, technology was not installed, and infrastructure was not significantly improved. \\nHaiti did, however, gain a few million dollar hotels. \\nNot exactly what the poor were hoping for. \\nTake a look at this video, entitled “How the Clinton Foundation Got Rich Off Poor Haitians.” \\nThe details are almost too numerous to list. For more information, visit the National Review. \\nOne thing is certain, if the FBI continues at this pace, the details are forthcoming, and they are not likely to be pretty.'"}, "time": 1742562351.9207716}