{"duration": 0.12811756134033203, "input_args": {"text": "'JÉRÉMIE, Haiti  —   Things had been looking up in Jérémie, a coastal city marooned on the tip of Haiti’s southern peninsula. It had recently gotten its first decent road link to the rest of the country, a new highway through the rugged mountains that brought development. Cellphone service had finally begun, enabling farmers and businesses to flourish. The city was racing into the 21st century, dreaming of advanced agriculture and tourism in one of Haiti’s few nature preserves. But now, Hurricane Matthew has turned back the clock. The rich forests and vegetation are now splinters and a saltwater swamp. Roads are blocked with detritus, trees turned to tinder, homes reduced to mounds of stone and rusted tin shards cleaved from roofs. Jérémie’s ambitious economic plans have been eviscerated. “Instead of going forward, we have to restart,” said Marie Roselore Auborg, the minister for commerce and industry in the Grand Anse department, where Jérémie is the capital. “This storm leveled all of the potential we had to grow and reboot our economy. ” Hurricane Matthew’s toll in Haiti has been hard to measure: the deaths and injuries, the number of people still stranded, the cases of cholera contracted in the week since winds of 145 miles an hour blew the country back to a tragically familiar state of disaster. So, too, is the economic impact of the devastation on the poorest country in the Western Hemisphere. For Jérémie, isolated and underdeveloped for decades, recent history had been relatively kind, bringing new hotels and a robust coffee crop. But as so often in the past, whenever Haiti tries to pick itself up, something always seems to knock it back down, including, and perhaps especially, the forces of nature. “In 2010, before the earthquake, we had a growth rate of 5. 7 percent,” said Jude Célestin, a presidential candidate who toured the devastated area on Sunday afternoon. “It’s the same in Jérémie. It was going up. People from    were investing here. ” As a crowd shouted in the background, trying to get closer to the candidate in the scrum, Mr. Célestin looked around at the homes stripped to their foundations and the mounds of refuse piled up to his shoulders. “And now, this,” he said, shaking his head. “It’s the way it is. ” The vista in Jérémie was a familiar one, of devastation more profound than the sum of its parts. Fetid water pooled along the only entrance and exit from the town, and just about everything on the   hillsides had been leveled  —   trees, houses, cellphone towers. Helicopters and convoys of sport utility vehicles descended on the city on Sunday, choking it with traffic after the highway, blocked for the better part of a week, was reopened. Collecting the dead in Jérémie has become a cruel pastime. The government tally for all of Grand Anse was up to 191 on Sunday, but locals put the figure closer to 450, and the grim work of counting the dead has only begun. New outbreaks of cholera were reported in stretches of the south that were still inaccessible by road, and dozens of victims were said to be making their way to hospitals on foot to seek care. In Jérémie, cholera may be one of the hurricane’s worst aftereffects. Of all departments in Haiti, Grand Anse has the least access to fresh water and modern sanitation, according to the World Bank. The smell of feces and soured storm water filled the streets closest to the city’s waterfront, a recipe for a sustained crisis. For now, though, residents were more focused on the immediate problem of shelter. Gary Guerrier, 36, a schoolteacher, saw the storm rip the metal roof off his house, leaving him, his wife and their   baby daughter exposed to the elements. After being driven back twice by the raging winds, he finally wrapped the infant in a bundle of bedsheets to protect her for the journey to a neighbor’s house. “I’m still in a state of shock,” Mr. Guerrier said. “We’re lucky we didn’t lose anyone. But as for material things, I lost everything. ” Houses in Beaumont, a town on the outskirts of Jérémie, fared even worse. Constructed of white stones and red earth, they were no match for the winds and pounding rain, and few were left standing among the felled coffee plants and orange trees after the storm passed. Residents farther up in the hills were still hunting for family members, while those along the lower rungs of the mountain had already interred their loved ones. “We found my father in his home, suffering several broken bones,” said Desir Luckner, 49, pointing to what remained of the house  —   a concrete foundation with one timber beam still upright. “We carried him down the hill to find help, but he died on the way. ” For all the shattered lives, the city of Jérémie was bustling on Sunday. Vendors squeezed between the wreckage on the roadsides, selling bread patties and overpriced spring onions magically procured from somewhere. A few businesses were operating, mostly out of necessity, to begin earning back what was lost. Claudia St. Louis opened her small bakery, selling comparettes, a local sweet bread, to those who could pay. “I lost my home, but I have to keep going, because it’s my livelihood,” she said, swatting at bees whose hive had been crushed during the storm. “There will be fewer people to buy these now, but there is nothing to be done about it. ” Ms. St. Louis said her business had been booming before the storm, with sales up 50 percent in the last year, and she was planning to expand into other baked items and perhaps even open a cosmetics shop as well. “I can’t do that now,” she said. The head of the chamber of commerce in Grand Anse, Monode Joseph, said the situation would be dire for a while. Along with the stores, hotels and small restaurants that gave the city its ambience, the farmers of the region were struggling, he said. Mr. Joseph traveled to    the national capital, after the storm to ask investors to keep supporting the coffee planters and bean farmers of the region as they tried to restore their land and start over. “The people were beginning to better organize themselves, which was increasing our business,” and he persuaded the investors only last year to put in more capital, Mr. Joseph said. “It’s going to be hard to get the credit we need now. ” Without that money, he said, the repercussions for farming will be catastrophic: “We don’t even know everything that’s been lost. ”'"}, "time": 1742562302.9078043}