{"duration": 0.1309652328491211, "input_args": {"text": "'Hillary Is a Communist Spy- Alex Jones, Dave Hodges and Global Research \\nHillary Clinton wanted for treason. \\nAlex Jones came out with his reasons why he believes that Hillary Clinton is a Communist Chinese spy. Alex and I both have our beliefs as to why Clinton should be considered to be a Communist operative and we both come at this from different angles. Alex maintains that Hillary is a Communist Chinese spy. I maintain that Hillary is a KGB operative. However, I believe at the time we are at today, we are both right. Alex Jones maintains that the Chinese will emerge as the dominant power whose mission it will be to usher in the NWO. I agree wholeheartedly with that statement. For the Moment, China and Russia Are Allied \\nRussia and China are allied and the linchpin of the Russia/Chinese alliance are the massive energy deals that Russia and China have mutually entered into. In something that our main stream media (MSM) never talks about, Russia and China are militarily aligned in Syria. as I have noted in past articles. Therefore, in the present moment, when Hillary is working for the Russians, she is also, by default, working for the Chinese. \\nAlex Jones has a very interesting take on why Hillary’s association with China will help perpetuate our downfall. \\nGlobal Research Declares Clinton to be Foreign Spy \\nIt is at this point that Alex Jones and Dave Hodges find common ground. \\nFrom Global Research : During her 4 years as Secretary of State of the United States (2009-2014), Hillary Clinton controlled US foreign policy. She had access to the most confidential information and state documents, numbering in the tens of thousands, from all of the major government departments and agencies, Intelligence, FBI, the Pentagon, Treasury and the office of the President. \\nShe had unfettered access to vital and secret information affecting US policy in all the key regions of the empire…” \\n“…There are several lines of inquiry against Mme. Clinton: \\n(1) Did she work with, as yet unnamed, foreign governments and intelligence services to strengthen their positions and against the interest of the United States? \\n(2) Did she provide information on the operations and policy positions of various key US policymakers to competitors, adversaries or allies undermining the activities of military, intelligence and State Department officials? \\n(3) Did she seek to enhance her personal power within the US administration to push her aggressive policy of serial pre-emptive wars over and against veteran State Department and Pentagon officials who favored traditional diplomacy and less violent confrontation? \\n(4) Did she prepare a ‘covert team’, using foreign or dual national operative, to lay the groundwork for her bid for the presidency and her ultimate goal of supreme military and political power? (Ed. Note: My assertion) \\nClinton’s covert war policies, which included the violent overthrow of the elected Ukraine government, were carried out by her ‘Lieutenant’ Under-Secretary of State Victoria Nuland, a virulent neo-conservative holdover from the previous Bush Administration and someone committed to provoking Russia and to enhancing Israel’s power in the Middle East. Clinton’s highly dangerous and economically destabilizing ‘brainchild’ of militarily encircling China, the so-called ‘pivot to Asia’, would have required clandestine exchanges with elements in the Pentagon – out of the State Department and possibly Executive oversight. \\nIn other words, within the Washington political circuit, Former Secretary of State Clinton’s escalation of nuclear war policies toward Russia and China required secretive correspondences which would not necessarily abide with the policies and intelligence estimates of other US government agencies and with private business interests…” (EDITOR’S NOTE: I MAINTAIN THAT THIS ISSUE IS ALSO CONTAINED IN THE “MISSING EMAILS”). \\nMy main interest toward Hillary Clinton’s treason has recently focused on one issue, namely, the Clinton Foundation’s selling uranium to Russia. I would argue that Clinton’s policies which pushed the US into a war mode against Russia was done so Clinton would have a willing buyer of uranium (i.e. Russia) should war every come. \\nAgain, from Global Research: \\n“The executive leadership now faces the problem of how to deal with a traitor , who is the Democratic Party nominee for US President, without undermining the US quest for global power. How do the executive leadership and intelligence agencies back a foreign spy for president, who has been deeply compromised and can be blackmailed? This may explain why the FBI, NSA, and CIA hesitate to press charges; hesitate to even seriously investigate, despite the obvious nature of her offenses. Most of all it explains why there is no indication of the identity of Secretary Clinton’s correspondents in the various reports so far available”… Hillary Clinton: An Agent for Russia \\nI published my assertion that Clinton was a traitor in 2015. I repeated this charge nearly two months ago. \\nA former key member of the Obama administration and current Presidential candidate, Hillary Clinton, has proven herself to be the Ethel Rosenberg of her generation. You may recall your U.S. history as Ethel Rosenberg sold nuclear secrets to the Soviet Union at the height of the Cold War. In an act every bit as egregious as Ethel Rosenberg’s treason, Hillary Clinton sold uranium to the Russians while serving as the Secretary of State. Ironically, the original source on this treasonous act committed by Clinton was none other than the liberal rag we call the New York Times . The proof is undeniable that Hillary Clinton committed the treasonous act of selling uranium to the Russians while Secretary of State , as reported in the New York Times. The Russian blood money, as reported, is being held in an offshore account and is being used to fund her run for the Presidency. \\nFrom the New York Times…. \\n“A Uranium One sign that points to a 35,000 acre ranch by John Christensen, near the town of Gillette, Wyoming. Uranium One has the mining rights Mr. Christensen’s property.” This is proof of more BLM chicanery which will involve multiple BLM ranches. \\nThe New York Times further asserts that members of the Canadian mining industry, who have supported Clinton’s campaign, financed and sold off to the Russians a company known as Uranium One. Uranium One is directly responsible for transferring uranium from BLM land to the Russians through an off-shore holding company. Again, according to the NY Times, the Russians, through three separate transactions, acquired Uranium One, while paying off the Clintons and their Canadian partners from 2009-2013. The business deal also involved paying Bill Clinton $500,000 dollars for a speech on energy which was delivered in Moscow. \\nConclusion Alex Jones, Global Research and Dave Hodges all agree on central point. Hillary Clinton is a foreign asset dedicated to the destruction of the United States. Alex maintains that Hillary is aligned with China and I see evidence that she is aligned with Russia. At this point in time, I do not view this as a discrepancy. Nor, do I have an issue with believing that the globalists have chosen China to usher in the NWO agenda. The central point here is that this nation sits upon the precipice of putting a person into the White House who is an absolute traitor to this country. To this point, whether it is the Chinese flavor or the Russian flavor that Hillary represents, “what does it matter?” She is going continue to sell America out to her enemies. It is interesting to note that during the Grid EX drills, which simulated a take down of the grid, both the Chinese and the Russians were invited to participate. Finally, when Alex Jones, Dave Hodges and Global Research all reach the same conclusion, via different means, THAT HILLARY CLINTON IS A SPY, perhaps it is time to pay closer attention to who we are electing as our next President.  '"}, "time": 1742562108.9550412}