{"duration": 0.058362722396850586, "input_args": {"text": "'Tchaikovsky’s bombastic “1812 Overture” has been a staple of the Boston Pops’ Fourth of July concert since 1974, when the famed Pops conductor Arthur Fiedler added it  —   complete with cannon blasts and church bells  —   to lift attendance. It became the traditional   to the fireworks display over the Charles River. But that changed over the past decade, as CBS began broadcasting the show and the “1812 Overture” was moved earlier in the evening, before the nationally televised portion began. The   pyrotechnics this year instead used hits by Adele, Beyoncé, Justin Bieber and others as a soundtrack. Some traditionalists took to social media to vent their dismay. “Nice they let the Pops play ONE song at their own concert,” one viewer wrote in a sarcastic tweet, adding, “And #1812Overture relegated to commercial break. ” “For first time in 40 years #BostonPops doesn’t play 1812 Overture, opting instead for crass   dreck. Pathetic sellout,” another wrote on Twitter. “I agree with a lot of that reaction,” Keith Lockhart, the orchestra’s conductor since 1995, said in an interview. “The network has very specific ideas about the demographic that they want to attract, which may not jibe with our ideas about the demographic that is going to get the most out of this, and have the best relationship with the Boston Pops. ” There is a fundamental challenge facing pops orchestras and series, which tend to have audiences older than classical ones. As music directors and administrators try various approaches to connect with new audiences  —   adding film screenings with live orchestral accompaniment, video game soundtracks, theatrical circus spectacles and 1990s rock acts  —   are they abandoning the large repertory that drew many listeners in the first place? What is disappearing, some say, are the light classics that once were staples of mainstream classical concerts that, around the middle of the last century, migrated to pops: Rossini overtures, Liszt’s “Hungarian Rhapsodies,” Respighi’s “Fountains of Rome,” Bach transcriptions and other colorful showpieces. “If you’re going to do a Mahler symphony as the centerpiece of a concert,” said John Mauceri, the founding director of the Hollywood Bowl Orchestra, “you don’t have any room for von Suppé or Offenbach. ” The average age of a Boston Pops subscriber is 55  —   compared with 48 for subscribers to its parent ensemble, the Boston Symphony Orchestra. The Pops has been turning more and more to headliners with multigenerational appeal, such as the comedian and singer Seth MacFarlane and contestants from “Dancing With the Stars. ” Last week, the St. Louis Symphony followed orchestras in Pittsburgh and Columbus, Ohio, by booking the rapper Nelly. The National Symphony Orchestra has drawn much attention for performances with Kendrick Lamar and Nas: far from fluffy Strauss waltzes. “There’s kind of a lost repertoire,” Mr. Lockhart said. “As pops orchestras have begun to chase an increasingly nonclassical audience, that material is woefully underrepresented in a lot of places. It’s even represented less here than it was when I first started,” he said, referring to the Boston Pops. These changes have   roots. In 2004, Henry Fogel, then president of the League of American Orchestras, wrote an article for the league’s Symphony magazine documenting the fading of   works like Smetana’s tone poem “The Moldau” and Chabrier’s   “España. ” Comparing classical subscription programs of six major American orchestras from the early 1920s through 2001, he showed how light classics had nearly disappeared by 1960. “The development of pops as a separate thing actually hurt orchestras,” Mr. Fogel said in a telephone interview. “It tended to remove some of the music whose principal reason for existence is pure entertainment. ” He placed some of the blame on music critics, who often dismissed tuneful pieces like Enescu’s Romanian Rhapsodies, and on conductors, who were afraid of being branded as mere entertainers. Some orchestras devoted to pops, including the New York Pops and Cincinnati Pops, continue to mix light classics with American songbook standards and film music. But others, like the Philly Pops, have abruptly changed course. When Michael Krajewski became that ensemble’s music director in 2013, he jettisoned light classics for   and   programs, which this season will include tributes to the Beatles and 1970s arena bands. Sarah Maiellano, a spokeswoman for the Philly Pops, credited this overhaul with a 64 percent increase in subscriptions since 2014. Concerts at the Kimmel Center for the Performing Arts in Philadelphia sold at 96 percent capacity last season. A similar tactic has been used at the Nashville Symphony Orchestra, which has a history of championing contemporary American music. Last year, its pops series sold at 85 percent capacity, compared with 73 percent for its classical series orchestra officials partly credit the higher pops sales to headliners such as the country band Alabama. “Pops is a way to bring in money, but we also look at it as a way to bring in new audiences,” said Larry Tucker, the orchestra’s vice president for artistic administration, who has a lead role in overseeing concert programming. (Research from the League of American Orchestras shows that audiences seldom cross over from pops to classical concerts, but pops concerts, which involve fewer rehearsals, are known to subsidize classical series.) The New York Philharmonic is one of several major orchestras without a pops series, though its Summertime Classics concerts, which ran from 2004 to 2014, harkened back to the Fiedler model of pops repertory. The series was discontinued not because of poor ticket sales but because of touring obligations, said Edward Yim, the Philharmonic’s vice president for artistic planning, who works with the music director Alan Gilbert to plan concerts. “It would be nice to see some of that repertoire sprinkled throughout our main subscription series,” he added. “Not every subscription concert, week in and week out, should be so deadly serious. ” The Philharmonic has drawn large audiences by showing films with live accompaniment popular performances in May of Charlie Chaplin’s “City Lights” and Disney’s “Fantasia: Live in Concert” were added after the season had already begun. The orchestra has started to spin off touring editions of films from its Art of the Score series, renting the production elements to other orchestras. The pilot installment, “On the Waterfront,” featuring a score by Leonard Bernstein, had its premiere in New York last September and will be presented this season by the Los Angeles Philharmonic and the San Francisco Symphony. A similar distribution strategy is planned for a restored version of Woody Allen’s “Manhattan,” its soundtrack dotted with brassy Gershwin melodies that will be conducted by Mr. Gilbert on Sept. 16 and 17 at David Geffen Hall. As these film programs multiply (current favorites of concert presenters include “Home Alone” and “Raiders of the Lost Ark,” according to the online directory Movies in Concert) conductors and artistic administrators say they struggle to find room for the traditional light orchestral numbers. But Steven Reineke, the National Symphony’s principal pops conductor, doesn’t plan to abandon those older pops staples. “To play those types of pieces as preludes or interspersed throughout the programming,” he said, “I don’t see them disappearing. ”'"}, "time": 1742628504.5919292}