{"duration": 0.048252105712890625, "input_args": {"text": "'Reality check media Hillary ON TAPE: Don\\'t Hold an Election Unless You Rig It in Advance \\nMs Clinton made the obseravtion about elections in occupied Palestine while speaking to a private gathering of Jewish journalists Print   The Ron Paul Institute \\nAnyone wondering what \"democracy promotion\" will look like in a Hillary Clinton administration may get a taste from a new audiotape released today of Hillary addressing the editorial board of the Jewish Press back in 2006. In the tape Hillary is clearly heard telling the Jewish Press journalists present: I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake. And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win. \\nListen for yourselves: \\nPresent at the meeting was Jewish Press editor Eli Chomsky, who recalls being shocked that “anyone could support the idea—offered by a national political leader, no less—that the U.S. should be in the business of fixing foreign elections.”Hillary Clinton\\'s stated practice of taking a private position and a public position on every issue is also apparent in her comments in that same meeting on whether it was worth talking to the Syrian government. Said Clinton at the time (sounding almost like Ron Paul): You know, I’m pretty much of the mind that I don’t see what it hurts to talk to people. As long as you’re not stupid and giving things away. I mean, we talked to the Soviet Union for 40 years. They invaded Hungary, they invaded Czechoslovakia, they persecuted the Jews, they invaded Afghanistan, they destabilized governments, they put missiles 90 miles from our shores, we never stopped talking to them. ...But if you say, ‘they’re evil, we’re good, [and] we’re never dealing with them,’ I think you give up a lot of the tools that you need to have in order to defeat them… \\nPerhaps Hillary should come clean on how many elections she \"determined who was going to win\" beforehand while Secretary of State.'"}, "time": 1742563506.0421262}