{"duration": 1.472496509552002, "input_args": {"text": "'Breitbart News Senior    Joel Pollak was a Breitbart News Daily guest on Tuesday to talk about his new book, How Trump Won: The Inside Story of a Revolution. [Pollak told SiriusXM host Alex Marlow he chose the title for the book after the election was settled because he originally thought Donald Trump’s presidential campaign “was going to be a spectacular defeat  —   not necessarily a big defeat, but definitely one worth writing about. ”  “I think the frame of mind that I was in was concern about what was going to happen to conservatism after Trump lost,” he revealed,“that there was so much infighting, that there had been a kind of civil war in the GOP, that all the knives were out  —   for you and me in particular, but for other people, as well, once this election was over. And so I started working on this, I pitched it to various people who I knew had an interest in publishing something, and started writing it with a view to trying to frame the debate after the election. ” “I knew Trump could win. I was one of the few people on that traveling press corps plane who thought he could still win. But I didn’t think it was likely, and so I wanted to make sure that the whole conservative movement didn’t collapse into infighting, and I wanted to try to frame what his defeat would mean so that going forward, there would be something productive and positive to do,” he said. “Larry Schweikart, my   was quite the opposite. He had predicted in August 2015 that Trump would not only win the nomination, but would win the election,” Pollak recalled. “So there’s a healthy tension there in the book. ” “Larry had data that few other people had, and he talks about that data in the book,” he said. “He had people, for example, in various counties that were crucial to the outcome of the election tracking voter registration numbers. He knew that a large number of people in Ohio, for example, had switched their voter registration from Democratic to Republican, and he knew that coming out of certain parts of Ohio, coming out of Cleveland, for example, Democrats needed to have a certain advantage to balance out the Republican advantage in the rest of the state. And he began to see, very early on, they weren’t going to have that advantage, if people simply voted on partisan lines. ”  “So he got the signal that if Trump managed to dominate the primary, which he did and was doing, he was going to win the election. There were enough people who were disgusted with the Democratic Party, there were enough Democrats willing to make the switch, that if a candidate came along who pitched a message to them, that was going to happen. So he talks about that in the book,” Pollak said. “I had the sense Trump was going to win the nomination only in about December 2015, when I went to my first Trump campaign event and saw with my own eyes this wasn’t a vanity candidacy this wasn’t a kind of joke,” he recalled. “This was a very real campaign and a real connection with the voters, who clearly felt tied in to what he was saying and doing. ”  “That same visit also told me that the mainstream media had no idea what was going on because I went to a perfectly exciting, warm, fun Trump rally with about 3, 000 people in Nevada, and the next day, I saw it reported as a kind of Nazi   rally by NBC. And that clued me in as to what was going on. I’d never been to an event where the description the day after was more different than the reality on the night of. That just was a cold bucket of water to the face, that this was going to be a campaign unlike any other, and Trump was going to have to go around the media to win,” he said. Pollak testified there were some “really interesting people” in the traveling press corps, “some great people, some professional   people. ” “But generally, the consensus was that Trump didn’t have a chance,” he said. “It was almost a feeling like, we don’t know why we’re doing this anymore. You’d think the media would have an interest in playing up the contest, that the horse race would be interesting to people, that the drama of an election campaign would motivate people, but I think people were just exhausted. Trump was keeping a really tough pace, and they couldn’t really see the point of it all. ”  He summed up the Trump press corps mindset as, “Why is he spending all this time on the road? Why are we doing seven states in one day? What’s the point? He’s not going to win, this is pointless, and the only way it’s interesting to us is to pick out little things he does that are weird, zany, unusual, and likely damaging. ”  “They just couldn’t see the    between Trump and the Clinton campaign. I think they just didn’t have a sense that it was going to be fun. That changed a little bit with the Comey announcement, which I saw in New Hampshire  . It was more of a horse race. The media perked up a little bit,” he said. “But what was really interesting to me was that even though you might think commercially it was in their interest to play up the chance that Trump might win, they really seemed to have no interest in it, and no belief that he could,” Pollak said. “And so it was kind of almost a death march through all these different campaign rallies and stops in different states. I just don’t think they thought it possible, and some certainly were completely dismissive and mocking of him. ” He said one of the most surprising things he discovered on the Trump campaign trail was “just how determined the audiences were to vote for this man, to crawl over broken glass to vote for him, as our colleague John Nolte likes to say. ” He cited a rally in Virginia that had been scheduled to start at 9:30 p. m. on the Sunday before Election Day: “Trump had scheduled a lot of different events, and there was a large amount of traffic in one city because the police couldn’t clear the entire highway and so forth. In any event, the rally didn’t happen at 9:30 p. m. It happened at 12:30 a. m. in Virginia, the next morning. This is on a Sunday night into a Monday morning. It’s a school night. There are families there. We get there, thousands of people not only inside the hall, but outside, in the cold, young children with their parents, sleeping almost on their parents’ shoulders, waiting to see Donald Trump. Nobody had gone home! People had stayed there, and they were determined to be there. And when I asked people why they were there, they said, ‘We’re here to be a part of history. ’” “To the people in those audiences, there was no doubt that Trump was going to win,” Pollak observed. “They sensed a connection with this candidate that they hadn’t sensed with any other Republican candidate in decades. That felt new enough to them that they were convinced he was going to win. And that was really the first moment where I thought Trump might win, even though I thought the odds were still stacked against him and even though Election Day looked pretty rough until late in the evening. ” “The surprise to me was seeing the determination of the audiences,” he related. “At another rally in Michigan, I asked two young women why they were there, and they said something which I would hear repeated by others, which is: ‘He doesn’t have to be doing this for us, and we’re here because he loves us’  —   which is odd, and it’s always strange as a journalist to hear that from people because you have something of a critical distance. ”  “Even though we’re a conservative website, and we were more on the side of Trump, obviously, than the side of Clinton, you feel some kind of connection to what’s going on,” Pollak explained. “You never really get to that level of emotional investment. But people felt that because he had given up his Hollywood career, because he had suffered personal damage, because he had taken a hit in his businesses, he was sacrificing for them. That moved them to come out for him. And that was something I don’t think people really picked up on. That was surprising and I think part of the secret of why Trump actually won. ” Marlow asked Pollak for his list of the major storylines heading into Trump’s inauguration on Friday. “I think there are three main storylines,” Pollak replied. “The first is the outgoing administration, the Obama administration, casting doubt on Trump’s legitimacy. You’ll notice on Sunday, Meet the Press, Obama’s chief of staff would not say that Trump was legitimate. They said ‘freely elected,’ but they didn’t say ‘legitimate’ because they’re riding this Russian hacking conspiracy theory. They’re saying what John Lewis is saying. It makes me think that John Lewis is, in some ways, a surrogate for the administration. ”  “They’re talking about what a great job they’re doing in the transition, while they’re totally undermining the premise of the transition. So I think the Obama administration is going out on a really sour note. That’s one storyline,” he said. “Another storyline is the inauguration itself and the protests that are going to be there,” he continued. “The day after, there’s going to be quite a bit of protests. The security services, the officials are preparing for that. But there’s a certain amount of unknown. We just don’t know how many people. We don’t know exactly what they’re going to do. James O’Keefe has been releasing videos about the inside planning that’s going on at some of these events, so we’re starting to lift the veil on that a little bit. That’s another uncertain element. And we know that MoveOn. org and other   groups are planning nationwide protests on Inauguration Day and thereafter, so that’s another storyline, how the Left is trying to regroup. ” “And then the third storyline is the storyline about the Trump administration itself and how it’s going to start,” Pollak concluded. “This is now real. This is happening. He’s going to be President Trump on Friday. And he is beginning to unroll his agenda. We’re seeing some policies beginning to take shape. We’re seeing some very interesting clashes with Congress. ” “I think one of the more interesting elements of the Trump presidency is that the leading opposition force right now, at least, is going to be the conservatives in Congress, not Democrats,” he contended. “Democrats are busy whining about Russian hacking, and about John Lewis, and about deplorables and the   or whatever. They’re still reliving the election and trying to undermine it. They haven’t yet connected with the fact that they lost for a reason. It wasn’t just that Trump won. It’s also that they completely lost touch with their voters, with their issues, and they haven’t pulled that together yet. ”  “It’s the conservatives in Congress who are putting forward policies that Trump is agreeing with in many cases, disagreeing with in some cases  —   the fight right now with Paul Ryan over taxation. It’s going to be interesting to see the two sides hammer that out,” he said. “But if you’re a conservative, this is the kind of debate you want to see. You want to see a debate between alternate versions of conservatism. You don’t want to see a debate where conservatives always have to compromise with the far Left. So it’s an encouraging, positive sign if you’re a conservative, watching the administration in its first few days. ” Marlow noted that the media praised Obama for putting together a    cabinet that didn’t agree on everything, while Trump’s transition has been portrayed as disastrous because he did the same thing with    nominees. Pollak noted the media believe it has “a civic duty to oppose the Trump administration,” which is very different from the supportive role it saw for itself with Obama. “They believed the same thing during the campaign. It was their job to protect America from this Republican nominee,” he argued. “They failed at that job. Now they’re trying to set themselves up as the political opposition. There’s an element of that in the media’s role that is appropriate. I think where it starts to blend into inappropriate is where they’re starting to make very biased assessments against Trump that they didn’t make against Obama. ” He added to Marlow’s point about the transition that Obama was actually compared to Abraham Lincoln for assembling his “team of rivals,” even though he was   to remember when “a member of Obama’s cabinet actually dissented about anything. ” As he recalled, the few officials who might have disagreed with President Obama about anything of importance left early in his first term, under somewhat cloudy circumstances. If anything, Obama’s cabinet was even less concerned with vibrant diversity of opinion than Bill Clinton’s, which saw the occasional public spat, and even resignations, over policy differences. Pollak suggested this lack of actual intellectual diversity in the Obama administration planted the seed of Hillary Clinton’s downfall, since she had great difficulty running as anything other than Barack Obama’s third term  —   something Americans clearly did not want. “Trump really has appointed people with very different views, compared to what his views are presumed to be,” he said. “We saw that with some of the questions in the confirmation hearings about waterboarding. We saw it about Russia policy. I’m not so sure Russia policy is an area where Trump has a completely defined view, by the way, so I don’t think that clash is particularly set. ”  “But nevertheless, he has said openly he welcomes this exchange of views. He welcomes people with different views. That’s the sign of a person who has led organizations before, who is confident in having people with different opinions around the table, who’s also confident in his own ability to make the choice between those opinions, between different courses of action,” Pollak proposed. “It says something about his nominees, as well, that they are prepared to come into an administration knowing they may disagree on one or two points, but knowing that they have something to contribute nonetheless, and their job is to advocate for their point of view and to work together as a team if they decide to take, collectively, a different course,” he said. “So I think it’s a very encouraging sign. The media say it’s some kind of sign of incompetence  —   did Trump not know these people had these views? Or maybe Trump just doesn’t care. It’s always given a negative spin,” he observed, regretfully noting the media seemed to have learned nothing from its experiences on the 2016 campaign trail. Marlow argued that Trump has already done “a tremendous amount of good in putting the global elite on notice,” even though he has not been sworn in yet, citing the collapse of the planned   policy summit in Paris this week as an example. “It’s amazing,” Pollak agreed. “But I also think it’s the inevitable result of the rest of the world coming to grips with the reality of what’s happening on Friday, to an extent that Democrats haven’t yet done. ” He suggested the political fallout from “that U. N. Security Council resolution that Obama pushed, where all of the other countries on the Security Council also supported this resolution, and the reaction from the Trump administration was quite stern” might have   the Left’s   realization that the Obama era is over. “It was clear that this was not acceptable to the incoming administration. This approach to Israel was done, it was over, and there was going to be a radical shift towards a   stance, towards a strong U. S.  relationship, and away from the confrontation that Obama had sought, when he wanted to put distance between the U. S. and Israel,” Pollak noted.  “That’s why I think you already saw the U. K. walking back some of its statements. You saw Australia criticizing the U. N. Security Council. When John Kerry gave that speech at the State Department attacking the Israeli government, saying it was the most   government and everything, Prime Minister Teresa May of the United Kingdom said we don’t do that we don’t criticize the composition of other democratic countries. And she rebuked John Kerry. And so I think people understood there was a new sheriff coming to town,” he said.  “I think the original plan for the Paris conference, by the French and by Obama, had been to use that as a springboard for some kind of declaration of Palestinian statehood in the days before Obama leaves office,” he speculated. “Who knows? He’s got 72 hours or so left we’ll see what damage he can do. But I think that the reaction of the Trump transition team, and the   to what happened at the U. N. put the rest of the world on notice that we are not going to continue Obama’s foreign policy. Not just with regard to the great powers, China and Russia and so forth, but we’re also going to make a break with the way he handled the   conflict. Trump talks about negotiation and that sort of thing, but he wants to make clear that the U. S. is a strong ally of Israel  —   and not, as Obama did, make clear the opposite. ” Marlow turned back to the earlier discussion of how Democrats are challenging Trump’s legitimacy by playing a clip of Senator Marco Rubio ( ) essentially endorsing Rep. John Lewis’ moral authority. He asked why so many Republicans are still willing to fight under the Democrats’ rules of engagement. Pollak responded by quoting another of Trump’s rivals from the Republican primary, Senator Rand Paul ( ) who declared that he was capable of disagreeing with Rep. Lewis today without opposing the civil rights movement. “This is a conflation even the media don’t believe, but they’ve set it up this way,” he argued. “John Lewis has a track record, unfortunately, over the last ten years or so, of making these kinds of accusations, false accusations of racism against Republicans. He did it to John McCain. He did it in a more subtle way when Mitt Romney was running for president. Now, he’s doing it to Donald Trump. Eventually, you have to be called out on what you’re doing, and that’s legitimate to do. John Lewis is exploiting the civil rights struggle in a negative way. You could even say he’s demeaning it, by bringing it into this very partisan debate, the idea that the election was illegitimate. ”  “What John Lewis is basically doing is disenfranchising the millions of voters who voted for Donald Trump, by saying that their vote didn’t count, that they were part of some Russian conspiracy,” Pollak charged. “To me, that’s the irony, that the civil rights movement is about marching for the right to vote, and here you are telling people that their votes don’t matter, that they’re part of some nefarious foreign plot. To me, that’s an irony for which John Lewis has to answer. ” He denounced Lewis’ tactics as an example of “politics distorting history,” given the implication that Trump is somehow worse than the racists who physically assaulted Lewis during the civil rights era and whom he forgave. As Pollak put it, Lewis is effectively stating he’s “not even willing to reconcile with the guy who had nothing to do with Jim Crow  —   and, in fact, for most of his life, Donald Trump was a Democrat, often seen in the company of Jesse Jackson and other people in the civil rights tableaux in New York City and urban America. ” “Now, I think John Lewis has made positive contributions,” he added. “I actually remember writing John Lewis a letter about a year ago because he spoke at my wife’s graduation. I expected him to give a very partisan address, and he didn’t. He gave a very nonpartisan,     speech, and I wrote to him to say how impressed I was with the speech. I think you’ve got to reward these politicians when they do the right thing. But he is clearly not doing the right thing. ” As for Senator Rubio, Pollak suggested he is “trying to find his way” and “jockeying for a position among the leading voices in opposition, sort of conservative opposition, in Congress to Donald Trump. ” “There are some positive things in that. What’s missing, weirdly, from Rubio’s statement there and other issues is the sort of peppy joyfulness, the kind of optimism you associated once with Marco Rubio’s speaking style,” he lamented. “He seems very stern, very severe, sort of talking over the national anthem in the background. I mean, it’s just sort of weird. I don’t know where Rubio’s head is. ” Pollak ventured that it was unwise for a Republican with White House aspirations, such as Rubio, to give any degree of support to tactics that will be turned against him, should he realize his ambition to succeed President Trump. He also wondered if those tactics were going to pay off for Democrats, as they have done in the past, since they’ve made a habit of attacking voters, not just opposition political figures.  “They’re not reaching out to those Obama voters in Pennsylvania and Michigan who switched their vote to Trump,” Pollak observed. “They’re not reaching out to them and saying, ‘Hey, we need to get back in touch with you. We need to understand your issues. You used to vote for us, you voted the other way this time. We need to figure that out and   a relationship with you.’ No, what they’re telling those people is, ‘You’re part of a Russian conspiracy. ’”  “It’s almost like back to the fifties and the McCarthy era, basically saying this is a Communist plot against the United States. Donald Trump is a Manchurian candidate who’s sent by the Kremlin to take over America,” he said. “It’s so ridiculously outlandish. It’s like birtherism elevated to a national political platform. Donald Trump pulled some shenanigans when he was going up against Barack Obama in 2011, 2012, we all know that, but a lot of that washed out by the time the presidential campaign happened, and he’s not doing that any more. Republicans as a whole never did that. Democrats are going down this really weird road, and it’s going to isolate them further from their own voters in the end,” he predicted. Pollak contended that the strength of the civil rights movement came from its unifying nature, as Dr. Martin Luther King Jr. “succeeded by reaching out to what Americans held in common and refocusing it in a direction that he wanted to take the country. ” He noted that modern problems, such as persistent poverty, could only be solved through inclusive efforts, not by framing it as “a struggle by one group of Americans against another,” as today’s Left prefers. “One thing we forget about the civil rights struggle was how much faith was a part of it, how much religion, how much the Christian tradition was really brought to bear, and Americans were challenged to live up to it,” he added. “You don’t hear that when John Lewis is challenging Donald Trump and saying he wouldn’t invite him to Selma. I mean, that’s just silly. ”  “Donald Trump’s statement that Lewis was ‘all talk and no action,’ I think, in a way, hit the nail on the head because he’s not talking about the civil rights movement. He’s talking about what Lewis is doing in politics today,” Pollak argued.  He ran through the list of questions that flowed naturally from Trump’s response to Lewis: “What is John Lewis doing for his district? What is John Lewis doing for these problems of poverty in America? What are the Democrats doing? They’ve been in the minority now for six years, in the House. Have they achieved anything? What are they doing other than politics? What are they doing other than trying to take control again? Are they actually making any progress on those issues that they talk about every two years, around election time?”  “I think that’s the challenge that John Lewis has to face, and I think every congressman has to face, but especially John Lewis. People who are elected to where they are partly because of who they are, partly because of their history, have a special burden to live up to that. Trump is saying, ‘Okay, well, where is it? What are you doing? Is this just about setting yourself up as a partisan every time somebody wants to attack the Republican Party, and you use the civil rights history  —   which, by the way, Republicans were much more on the side of civil rights than Democrats. The civil rights movement was largely a struggle against southern Democrats,” he noted. “Is that what you’re going to do  —   you’re going to just use this as a partisan hatchet every time? Or are you actually going to do something? I think that was a very appropriate challenge,” Pollak declared. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562491.4157887}