{"duration": 0.05789375305175781, "input_args": {"text": "'Amazon boss Jeff Bezos wants to apply the same principles used in Amazon’s developing delivery services to bring supplies to the future population of the moon. [After The Washington Post obtained a copy of the confidential “white paper” that Bezos’ space company Blue Origin is passing on to Trump’s transition team, the company verified its authenticity. And while Elon Musk’s SpaceX rushes to beat Trump’s own lunar ambitions, Bezos is focused on the logistics of something a little more permanent than private sightseeing excursions.  Blue Origin want to deliver cargo to the moon, paving the way for sustained human colonization of our natural satellite. They’ve even picked a spot for this potential real estate  —   a cheery little crater near the moon’s south pole, with access to water via ice hidden in the crater’s shadows, and enough consistent sunlight to make use of solar energy. The thought of lunar expansion has managed to whet the appetites of several companies, who are already offering their own ideas for involvement. One such example is Bigelow Aerospace. Its founder, Robert Bigelow, wants to adapt the design of their BEAM habitat, currently docked with the International Space Station. He wants to create an orbital depot to house supplies and medical facilities. According to Bigelow, venturing toward Mars is “premature. ” As for the moon? Bigelow asserts that “We have the technology. We have the ability, and the potential for a terrific business case. ” For his part, Bezos believes that “if you go to the moon first, and make the moon your home, then you can get to Mars more easily. ” Bezos says that this project “only be done in partnership with NASA,” and believes that “[Blue Origin’s] liquid hydrogen expertise and experience with precision vertical landing offer the fastest path to a lunar lander mission. ” He is personally “excited about this,” to the point of investing his own money “alongside NASA,” to make sure they get there. “Blue Moon is all about   delivery of mass to the surface of the Moon,” according to the Amazon boss. “Any credible first lunar settlement will require that capability” But all of this is just the beginning of Blue Origin’s ambitions. Their first proposed mission hopes to be just the first in “a series of increasingly capable missions. ” We’ll have to wait to see whether President Trump and his advisors are as excited about the possibilities as Bezos himself. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742563267.56586}