{"duration": 0.0644676685333252, "input_args": {"text": "'Environmental Protection Agency (EPA) Administrator Scott Pruitt and Breitbart News Daily SiriusXM host Joel Pollak discussed President Trump’s decision to withdraw from the Paris climate accords on Monday’s show. [“I think that what’s lost in the debate and discussion at times is the tools in the toolbox, if you will, that the EPA actually possesses or doesn’t possess to respond to the CO2 issue,” said Pruitt.   He looked back to the legal battle between the state of Massachusetts and the EPA in 2007, which ended at the Supreme Court. He noted the outcome did not force the EPA to regulate CO2 but “simply said it had to make a decision on whether CO2 actually poses a risk to human health and the environment. ” “Following that was the endangerment finding in 2009, which eventually led to the Paris discussion and clean power plan, all the rulemaking and the climate action agenda of the previous administration,” he recalled. “What’s not discussed at all is, has Congress ever responded or acted upon this matter, this issue of CO2 with respect to power generation? I will tell you, they clearly have not. ” “If you go back to the clean air amendments from 1990, many of the folks, including Congressman Dingell,  —   a Democrat as you know  —   said that it would be a ‘glorious mess’ to endeavor to use the current framework to regulate CO2. The framework that we have is a framework that’s supposed to address local and regional air pollutants, not in my estimation, based upon those who amended the Clean Air Act in 1990, this phenomenon that people describe as the greenhouse gas effect,” he said.  “The only power that agencies have, executive agencies have, is the power given to them by Congress,” he stressed. “We can’t reimagine authority. We can’t make up authority. This Supreme Court has been very, very consistent at sending that message through court decisions over the last several years. ” Pollak built on Pruitt’s point to argue there is a profound difference between the Environmental Protection Agency’s original mandate to combat pollution and “what it’s being asked to do by the left, which is to regulate fossil fuel use, and energy use, and energy efficiency around CO2. ” Pruitt agreed it was important to emphasize the distinction between pollutants and carbon dioxide, a naturally occurring component of the earth’s atmosphere. “The American people deserve this debate. They deserve this discussion because it is an orthodoxy,” he declared. “It’s been an orthodoxy for the last several years, and you have rightly stated it. ” He criticized those, such as House Minority Leader Nancy Pelosi, who imply that withdrawal from the Paris climate accord will strip the EPA of its authority to regulate genuine pollutants, with disastrous health consequences. “What they’re referring to is pollutants that we regulate under the National Ambient Air Quality Standards Program, criteria pollutants: SOx and NOx, and particulate matter, and ozone, and other types of things that they then commingle the CO2 discussion with, and that’s where they come up with these types of statements  —   which is not very transparent for the American people,” Pruitt explained. “What the American people deserve is a true, legitimate,   objective, transparent discussion about CO2,” he said. “There was a great article that was in the Wall Street Journal about a month or so ago called ‘Red Team, Blue Team’ by Steve Koonin, a scientist, I believe, at NYU. He talked about the importance of having a Red Team of scientists and a Blue Team of scientists, and those scientists get into a room and ask, ‘What do we know? What don’t we know? What risk does it pose to health in the United States and the world, with respect to this issue of CO2? ’” “The American people need to have that type of honest, open discussion, and it’s something that we hope to help provide as part of our leadership,” said Pruitt. Pollak praised Pruitt for explaining in a press conference that allegedly harmless,     agreements like the Paris accord can be used by activists to trigger provisions in American laws such as the Clean Air Act that would force the EPA to issue new regulations  —   in effect, creating a foreign legal regime with power beyond the U. S. Constitution. Pruitt added that another   point in the argument about the Paris accord is that President Obama did not submit it to the Senate for ratification as a treaty, an inexcusable omission given its   effects and the fact that Congress had duly ratified other international agreements Obama submitted. “It was discussed at the time that the ‘agreement’ was signed by the previous administration as an executive agreement. As you know, the previous administration walked up to the precipice, if you will, what they perceived as the precipice with respect to agreeing to certain types of targets and obligations of reporting and the rest  —   and trying to stop at the precipice and say, ‘Well, we didn’t go far enough to trigger treaty obligations,’” he said. Pruitt denounced that approach as “really unfair to the American people. ” “If you’re going to agree to targets in Paris  —   if you’re going to say, ‘We’re going to reduce our GHG, greenhouse gas emissions, by 26 to 28 percent’  —   the people of America deserve a voice in that process,” he insisted.  “They need to make sure that if it’s going to contract the economy, it’s going to raise electricity rates  —   as is already happening, by the way, if you compare our price per kilowatt versus Europe largely or Germany particularly I think we’re at seven or so cents per kilowatt, far better than those in Europe and Germany particularly,” he noted.  “The American people deserve a voice in that process, which is what the Founders put into the construct of the Constitution. If it’s going to have an enforceable, obligatory type of response, the citizen’s voice needs to be heard through ratification of these international agreements,” Pruitt said. “What also is not talked about is the exposure domestically, through Section 115 of the Clean Air Act, because Section 115 of the Clean Air Act actually talks about international agreements,” he continued. “The precursor to enforceability around those international agreements under Section 115 is reciprocity with other nations across the globe. At Paris, that’s what we agreed to with China and India and all of those   nations. We agreed to reporting requirements. We agreed to take certain steps to engage in reciprocal types of obligations. ”  “As such, that reciprocity is evident and could trigger lawsuits by environmental groups here, the environmental left suing the EPA and the United States government and saying, ‘Hey, we agreed to 26 percent and 28 percent targets in this international agreement. Why aren’t you taking steps to meet those targets?’ and then to compel action,” he cautioned. Pruitt said this is where “most of the rulemaking has occurred at the EPA over the last several years  —   not through general   administrative procedure act types of rulemaking, but consent decrees and third parties suing the EPA to compel certain action. ”  “Regulation through litigation, if you will, which, I think, is an abuse of executive authority, an abuse of the rulemaking process,” he said. “That’s something that was absolutely key to this decision, is to mitigate and eliminate the exposure to those targets that were set by the previous administration. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742628538.986898}