{"duration": 0.09633064270019531, "input_args": {"text": "\"Tennessee Children with Brittle Bones Suffer in State Care as Mom Charged with SBS Turner family at visitation. Photo source: Turner family. \\nby Health Impact News/MedicalKidnap.com Staff \\nChris and Keshia Turner from East Tennessee are still waiting to bring their son Brayden home since he was removed from their custody on December 11, 2014. Keshia had rushed the baby to the emergency room when his leg that had been splinted in the NICU became tight and warm to the touch. While at the hospital, an x-ray revealed a broken bone and several rib fractures. \\nThe following day, Keshia took Brayden to his pediatrician to follow-up on his care. There she found herself confronted with law enforcement and a Department of Children’s Services worker who demanded that she take Brayden to Vanderbilt Medical Center in Nashville, nearly three hours away. \\nThat evening, Vanderbilt Medical Center Child Abuse Specialist Dr. Deborah Lowen said that Brayden’s injuries could only be abuse, and investigators and doctors allegedly stopped looking for another explanation. \\nDr. Lowen first said that it was a “classic case of Shaken Baby,” though most of the classic symptoms were not present. Later Dr. Lowen claimed that Keshia had crushed her three month old child with her hands and caused multiple rib fractures. \\nThe Turner’s first story is here: Baby Found with Broken Bones – Parents Assumed Guilty of Abuse and Lose Custody Keshia’s Second Child Taken \\nIn September of 2015, while her case was pending, Keshia delivered her second child, a baby boy named Carson, who was in perfect health. Sadly, he was removed from her custody four days after he was born because of the ongoing case involving Brayden. Both boys have been in a relative placement with their paternal grandparents. Chris and Keshia have had limited supervised contact with the children since their removal. \\nRecently, the boys were evaluated by Tennessee Early Intervention System, a voluntary educational program for children ages birth through age two with disabilities or developmental delays. The program is also associated with Vanderbilt Medical Center. Both children were diagnosed with significant developmental delays. Brayden with his baby brother Carson. Photo source: Turner family. \\nBrayden’s evaluation revealed that he is delayed 25% in cognitive development and 40% in adaptive, communication, social skills, and motor. He also exhibited “multiple red flags of autism.” Additionally, he has a 30 degree curvature in both feet and will require orthotics. \\nCarson’s evaluation showed that he is delayed 25% in communication and cognitive development, and 40% in adaptive and motor. It was also noted that his head was “really flat.” The family was told that when he begins to walk, there is a possibility that he will need to wear orthotics. \\nAdditionally, both boys have low muscle tone. In light of the new developments, the family believes that this is, as Eugene Wilson at the Center for Ehlers-Danlos Syndrome Alliance says, “more than likely an underlying medical condition.” \\nTherapy has been recommended for both children. Difficult Day at Court \\nBecause Keshia was the last one to care for Brayden before the emergency room visit, she is being accused of abuse in the dependency proceeding in juvenile court. \\nAfter several days of hearings, including the presentation of medical experts on behalf of the parents, on June 25, 2016 Judge Larry Warner found Keshia guilty of “severe child abuse.” The judge cleared Chris of any finding of abuse. Because of that, the couple was advised by the father’s attorney to file for divorce, in the hope that the court would award Chris custody. Although the couple’s divorce is still pending, Judge Warner ordered immediate reunification with Chris. However, the children are still in a relative placement, and the Department of Children’s Services has not done anything to establish their reunification. There is no plan in place to get the children home with their father. Bias and Lack of Understanding Impeding the Case \\nThe judge’s ruling came despite the Turners having two medical experts who testified on their behalf, a radiologist and a pediatrician with experience teaching at a university as well as working in the emergency room. The two medical experts gave extensive medical testimony—comprehensive explanations of Brayden’s medical conditions— which both opined as osteopenia of prematurity. \\nGoing in to court, the mother’s Attorney Connie Reguli was concerned that Vanderbilt’s Child Abuse Specialist Dr. Lowen’s deposition had been filed months before the trial by Department of Children’s Services. It appeared to Attorney Reguli that once the judge read it, he had made up his mind before coming to court, leaving no room for other medical explanations. Dr. Deborah Lowen. Source: Vanderbilt University . \\nAttorney Reguli points out that this is “an extremely complex” case. Because of that, the experts took painstaking measures to educate the judge about the “fragile bone state of a baby…who was premature and so small.” She says that after examining Brayden’s history, the pediatrician concluded that he had rickets of prematurity. The doctors explained in detail the medical evidence supporting their opinions, including the premature birth, the loss of amniotic fluid prior to birth, the low vitamin D levels, and the healing pattern of the bones. \\nThe Turner family’s experts disputed Child Abuse Specialist Dr. Debra Lowen’s conclusion. Dr. Lowen said that Brayden’s injuries were non-accidental, and therefore, must be child abuse. Attorney Reguli says that Dr. Lowen’s conclusion was drawn without being challenged on the medical research upon which she relied. When Dr. Lowen was asked to submit medical research to support her conclusion, she submitted a mere nine articles and references, some of which contradicted her own conclusion. \\nIn contrast, the experts called by the family provided a bibliography of over 50 articles which supported the rickets diagnosis. \\nAttorney Reguli is very concerned about the court’s apparent bias and lack of understanding about the intricacies of the medical evidence, which she believes are impeding this case. She says, “The complexity of presenting the evidence is a tremendous challenge.” Further, she points out that the medical community is not in agreement on this issue, and she is concerned that it might be too complex for a juvenile court judge to understand. The Environmental Epidemic of Vitamin D Deficiency in Infants \\nIn August 2008, researchers Kathy A. Keller and Patrick D. Barnes published the article, “ Rickets vs. Abuse: A National and International Epidemic .” The article documents that, what was at first “believed to primarily affect the elderly and dark-skinned populations in the US,” was found “demonstrated in otherwise healthy young adults, children, and infants of all races.” \\nIn “ Rickets or Abuse, or Both? ” Russell W. Chesney says, “We are in the midst of an epidemic of nutritional vitamin D deficiency rickets that has been termed ‘the third wave of rickets.'” The article goes on to say, “Inherent in each wave is that infants with rickets are born to mothers who are deficient or insufficient in vitamin D themselves.” \\nDr. Teresa Hill points out in the Journal Advocate that vitamin D deficiency persists today. She says, “Vitamin D deficiency during pregnancy is considered epidemic.” \\nOne reason that the medical profession is not in agreement on this issue is the lack of information about the role of vitamin D deficiency resulting in metabolic dysfunction in abuse cases. Dr. Mercola reports that Dr. Ayoub, after reviewing over 3,000 pieces of medical literature, concludes that “a great number of child abuse cases may, in fact, be instances of misdiagnosed metabolic dysfunction.” \\nDr. Mercola, citing the work of Dr. Ayoub and others, says: \\n“Thousands of child abuse cases may, in fact, be misdiagnosed cases of rickets caused by either vitamin D deficiency or aluminum adjuvants in vaccines, or both.” He goes on to say, “Vitamin D deficiency is a hidden problem that can actually cause bones to appear as if they’ve been broken on an X-ray, which is a sure diagnosis of abuse to the inexperienced eye.” \\nDr. Mercola says that Dr. Ayoub estimates that “there may be literally tens of thousands of misdiagnosed cases of child abuse around the country,” and that it is a “trend of misdiagnosis goes back at least 25 years or more.” \\nDr. Mercola calls this “the other side of the child abuse drama,” and he believes that “it is critical for this information to become more widely known.” He goes on to say that being informed about “how infantile rickets mimics cases of child abuse” is the best way to prevent the “traumatic injustice to parents who really have done nothing wrong, besides listening to and trusting conventional medical advice, which still does not place sufficient weight on the importance of vitamin D.” \\nDr. Ayoub asserts: \\n“Modern textbooks simply do not cover rickets as textbooks of the past did, and flawed research has been used as the basis to perpetuate the misdiagnosis of healing rickets as an inflicted injury.” \\nFurther, he says that the current protocol for doctors does not include testing vitamin D levels in expectant mothers, who are considered “one of the most at-risk populations.” In his opinion, this is “reprehensible medical malpractice.” Apparent Conflict of Interest \\nThe complexity of the underlying medical condition of the child is buttressed with the conflict of interest inherent in Child Abuse Specialists, whose only role is to determine and “diagnose” child abuse. Attorney Reguli says: \\n“Child Abuse Specialists aren’t doing true clinical rule-out evaluations.” \\nThe hospital pediatricians who are certified as Child Abuse Specialists are considered by default “state expert witnesses.” However, they are not trained in all of the medical areas that they include in their opinions of abuse. \\nFurther, Attorney Reguli says: \\n“Doctors like Lowen have a contract with the Department of Children’s Services and have a vested interest in maintaining their relationship with them.” Subsequently, she says, “The Department has to remove children from their homes to get the money they need to fund the agency itself in the current federal funding scheme.” \\nUltimately, the children and their parents are the ones who pay the price. \\nSee Also:\""}, "time": 1742628587.811899}