{"duration": 0.09628653526306152, "input_args": {"text": "'  President-Elect Trump Invites An Excited Israeli Prime Minister Benjamin Netanyahu To Come Visit “The bond between the U.S. and Israel is based on shared values, shared interests and a shared future. I am sure that President-elect Trump and I will continue to strengthen the unique alliance between Israel and the U.S. and we will bring them to ever greater heights,” he added.   16, 2016 Prime Minister Benjamin Netanyahu said he is looking forward to working with President-elect Donald Trump on “the twin interests of peace and security.” \\n“For when they shall say, Peace and safety; then sudden destruction cometh upon them, as travail upon a woman with child; and they shall not escape.” 1 Thessalonians 5:3 (KJV) \\nEDITOR’S NOTE: After enduring 8 years of a pro-Muslim, anti-Israel president , you can well imagine Benjamin Netanyahu’s excitement at a Donald Trump presidency. At the same time, it will be Trump’s very support that God will use to usher in some dramatic fulfillment of end times events. As we have been telling you – warning you – for over a year now, when Trump moves the US Embassy from Tel Aviv to Israel, get ready to fly. We here at NTEB believe that the move will trigger the Psalm 83 war, or worse, and that the Rapture of the Church will then be right around the corner. If you have something you want to get done for the Lord, do it now. \\nIn a satellite address to the Jewish Federations of North America ’s annual General Assembly in Washington on Tuesday, Netanyahu urged President Barack Obama to continue America’s “longstanding policy” of supporting direct negotiations between Israel and the Palestinians, and not pursue other avenues. Israel is concerned that Obama will use his final days in office to push for a UN Security Council resolution that will impose a two-state solution to the conflict. \\n“I, for one, find great encouragement in the fact that there’s this continuity of friendship,” Netanyahu said . “I very much hope that President Obama will continue the policy that he enunciated,” Netanyahu said, referring to comments made by the outgoing president at the beginning of his first term. “The only way you get a workable and enduring peace is to have the parties agree to it. This is what has happened with our peace agreements with Egypt and Jordan. PM Netanyahu Congratulates US President-Elect Donald Trump: \\n“We’ve had convulsions in the Middle East, and yet these peace treaties hold because they were directly agreed to by the parties,” he added. “The reason we’ll object to any such effort is because it will harden the Palestinian position, and because it will harden the Palestinian position, it will push peace back.” Netanyahu added that he is hoping to nurture the recent “quiet diplomacy” Israel has had with Arab nations with the future Trump administration. \\nThe day after the Republican candidate rocked the world by winning the election, he invited Netanyahu to visit Washington at the “first opportunity.” The prime minister and president-elect “who have known each other for many years, had a warm, heartfelt conversation” over the phone, a statement from the Prime Minister’s Office said . \\nNetanyahu responded by saying that he and his wife Sara were excited to visit the incoming commander-in-chief and his wife Melania. Netanyahu congratulated Trump earlier in the day, calling the president-elect “a true friend of the State of Israel.” Donald Trump vows to protect Israel: “We will work together to advance security, stability and peace in our region,” Netanyahu said in a statement. \\n“The bond between the U.S. and Israel is based on shared values, shared interests and a shared future. I am sure that President-elect Trump and I will continue to strengthen the unique alliance between Israel and the U.S. and we will bring them to ever greater heights,” he added. \\nThe son of the late president Shimon Peres, Chemi Peres, also congratulated Trump in his speech to the Jewish Federations General Assembly. \\n“I would like to wish President-elect Trump the best of luck,” he said. “I am sure he will maintain the unbreakable link between Israel and the U.S., at the core of which are the unwavering support of Israel’s security and the forever-extended hand for peace.” source SHARE THIS ARTICLE  '"}, "time": 1742562331.8568537}