{"duration": 0.03393363952636719, "input_args": {"text": "'During a speech on the House floor on Monday, Representative Hakeem Jeffries ( ) argued that while not all Trump voters are racists, “every racist in America voted for Donald Trump. ”  Jeffries said, “Since January 20th, we’ve seen a disturbing increase here in America in         and   acts. And the question is, is this just a coincidence, or could it possibly have something to do with the election of the 45th president of the United States of America? Now, in part, what we’re seeing is connected to a historic backlash that has often occurred throughout this journey that we’ve been on here in America, that whenever we make significant progress, there’s always a backlash amongst some in America who’ve got a problem with the fact that we’ve done things designed to be more consistent with our values of liberty and justice for all, equal protection under the law. ” After listing historical examples of this, Jeffries stated, ” And then, of course, we’ve got Barack Obama, who was elected in what many of us viewed as an incredible step in the right direction,   having gone from the outhouse to the White House. Eight years of tremendous progress in moving this country forward, followed by the election of Donald Trump, a man who spent five years perpetrating the racist lie that Barack Obama was not born in the United States of America. And many of us are wondering, why were so many people who worship at the altar of white supremacy drawn to Donald Trump’s campaign? What was it about this individual that so many folks dripping in hatred flocked to his candidacy? That’s not to say that every American who voted for Donald Trump is a racist. We do know that every racist in America voted for Donald Trump. that’s a problem. ” He concluded, “And so, again, I just ask the question in closing, is this all a big coincidence? We know part of it is the backlash that has often occurred whenever we’ve made progress in America, but this president has a responsibility to address the rise in hate crimes that have taken place on his watch, whether or not his election is directly connected to it. ” (  Grabien) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742563265.1611378}