{"duration": 0.04155278205871582, "input_args": {"text": "'Posted on November 3, 2016 by DCG | 6 Comments \\nTruth hurts. \\nFrom Washington Post : Authorities are investigating apparent tampering with an electronic road sign at a busy Virginia commuter lot that resulted in a disparaging remark about Democratic presidential candidate Hillary Clinton and a call for people to “Vote Trump.” \\nThe sign at the Tackett’s Mill commuter lot in Lake Ridge flashed three consecutive message screens: “CROOKED \\xadHILARY”; followed by a profanity (“IS A B –––– ”); followed by “VOTE TRUMP.” \\nThe messages were on display for an unknown period Tuesday evening while commuters headed to their homes in the Virginia suburb, about 25 miles southeast of the District. \\nTheir tone reflects the bitter 2016 presidential race, in which both major-party candidates are historically unpopular and Trump’s supporters openly wear T-shirts calling Clinton the b-word and gleefully chant “Lock her up” during his rallies. \\n“Crooked Hillary” is a name Trump coined for Clinton and uses regularly. Earlier this week, a tweet from the account of Texas’s agriculture commissioner , a Trump adviser, took the name-calling a step further, using a vulgar term for female genitalia to refer to Clinton. \\nIn Prince William County, the offending electronic sign was one that had been placed in the commuter lot about a month ago by the county elections office. It was programmed to broadcast a message encouraging early voting for those who cannot make it to the polls on Tuesday. \\nThere are about 10 such signs posted in heavily trafficked areas across Prince William County, a relative Republican stronghold in the Washington area. The Board of County Supervisors is chaired by Corey Stewart (R), a high-profile cheerleader for Trump who co-chaired the GOP nominee’s Virginia campaign until a dispute last month led to his ouster . \\nElection officials in the county, which also has a fast-growing Latino population, are taking special measures this year to speed voting and minimize potential disruptions at the polls. \\nOn Wednesday, officials said the tampered-with sign equipment had not been locked, giving whoever changed the message easy access to a keyboard panel inside. “There’s a set of instructions next to the panel,” said Winston Forrest, a spokesman for the county elections office. “Anyone who could get access to it could make the change.” \\nAfter the errant message was reported, it was turned off and the equipment was removed, according the county police. \\nCounty elections officials said they have placed locks on the remaining voting road signs in the county. “There are no more of these types of messages,” Forrest said. \\nRead the rest of the story here . \\nDCG'"}, "time": 1742562177.6348298}