{"duration": 0.05160975456237793, "input_args": {"text": "'BREAKING: Obama ATF Accused of Covering Up Political Element in Firebombing of GOP HQ \\n“I am not of the mindset that any vote not for Trump is a vote for Hillary, but a vote for Trump is a vote against Hillary. And I need to vote against Hillary. I need to vote against the media.” \\nHunter noted the extreme bias exhibited by the media who refused to fact-check Clinton at the last debate, and what he sees as the difference between what a Trump and a Clinton presidency would look like: \\n“A Trump administration at least will include people I trust in positions that matter. I don’t know if they will be able to hold him completely in check, but I know a Clinton administration will include people who have been her co-conspirators in corruption, and there won’t even be a media to hold her accountable.   \\nAlthough Hunter didn’t want to tell NeverTrumpers how they should vote, he asked them to think about how important it is to keep Clinton out of office: \\n“I’m not saying you should support him, but you shouldn’t lose sight of the importance of opposing her. If, or when, Hillary Clinton takes the oath of office, she needs to have as little support as possible. Frankly, she needs to be damaged. The mainstream media won’t do it; they’re in on it.” \\n“A simple protest vote for a third party or a write-in of my favorite comic book character might feel good for a moment. It might even give me a sense of moral superiority that lasts until her first executive order damaging something I hold dear — or her first Supreme Court nominee. But the sting that will follow will far outlive that temporary satisfaction. “ \\n“I oppose much of what Donald Trump has said, but I oppose everything Hillary Clinton has done and wants to do. And what someone says, no matter how objectionable, is less important than what someone does, especially when it’s so objectionable. A personal moral victory won’t suffice when the stakes are so high. As such, I am compelled to vote against Hillary by voting for the only candidate with any chance whatsoever of beating her — Donald Trump.”  '"}, "time": 1742561957.6715615}