{"duration": 0.06541085243225098, "input_args": {"text": "'Family members say that Esteban Santiago, the suspect in the Fort Lauderdale airport shooting in which five people were killed, seemed troubled when he came back from military service in Iraq. His brother described him as “more furious” after his deployment in 2010 with a Puerto Rico National Guard unit. His aunt said that after coming home, Mr. Santiago “lost his mind. ” After Mr. Santiago’s arrest in the shooting, emerging details of his military service led some to blame the rampage on the   mind of a veteran haunted by   stress disorder, a common pattern when veterans are arrested in violent crimes. But experts not connected to Mr. Santiago’s mental health treatment say it may be a mistake to blame PTSD. Mr. Santiago, who served for eight years in the National Guard and Army Reserve and saw combat in Iraq in 2010, exhibited symptoms that do not appear to fit the disorder, they say, and more closely resemble schizophrenia, a condition unrelated to military service. Mr. Santiago’s family said he reported hearing voices and had other hallucinations, but said he was never given a diagnosis of PTSD. In November, he walked into an F. B. I. office in Alaska and told agents that his mind was being controlled by a United States intelligence agency. “The delusions, the hallucinations are far more consistent with psychosis than PTSD,” said Dr. Donald C. Goff, a psychiatrist at New York University and a leading expert on schizophrenia. “So is the timing of the onset. ” Mr. Santiago deployed to Iraq when he was 20 years old, which is the age when many males with schizophrenia begin to exhibit symptoms, Dr. Goff said, cautioning that he could not comment on Mr. Santiago specifically without reviewing his medical records. “Generally, it’s in the first year of college or military service, or some other stressful event, that we see schizophrenia,” he said. “It’s not that deployment is the cause of the psychosis, but the stress may contribute to the symptoms coming out. ” The level of stress Mr. Santiago experienced on deployment is unclear. He went to Iraq with the Puerto Rico National Guard’s 1013th Engineering Company, and was charged with keeping highways clear of roadside bombs. Violence had dropped drastically in the country by 2010 nonetheless, two soldiers in his company were killed by a roadside bomb. After his tour, Mr. Santiago was awarded the Combat Action Badge, which is given only to service members who are actively engaged with the enemy. “There is nothing to say that a person can’t have psychosis and PTSD,” said Claude M. Chemtob, a professor of psychology at New York University who has studied the link between PTSD and aggression. But, he said, the two disorders are characterized by different symptoms. PTSD sufferers can struggle with anxiety, sleeplessness, flashbacks and anger. In rare cases, the disorder results in increased violence and aggressiveness. But paranoid delusions are not typical. “That is a cardinal symptom of psychosis,” Dr. Chemtob said. “But inevitably people’s prejudice toward veterans is going to lead them to emphasize PTSD. ” Veterans have complained that too often they are labeled with the disorder, and that ascribing all violent acts among veterans to the psychological scars of war perpetuates damaging stereotypes. Many have argued that is what happened with Eddie Ray Routh, the    former Marine corporal who killed Chris Kyle, a member of the Navy SEALs and the author of “American Sniper,” in 2013. Mr. Routh’s medical records revealed he had persistent delusions that he was being devoured from the inside by parasites, and that his   were pig people who wanted to eat him, but a doctor at a veterans hospital gave him a diagnosis of PTSD. Veterans have struggled with the reputation for being dangerously unstable since at least the Vietnam War. The stigma was stoked in part by Hollywood narratives like “Rambo,” and is still pervasive today, said Bill Rausch, the executive director of Got Your 6, a nonprofit group that tracks the public image of veterans. According to a survey by the group in 2016, 83 percent of respondents said they believed veterans were more likely to have mental health problems. Respondents also said they thought veterans were more likely to be unemployed and abuse drugs. In fact, in terms of employment and drug use, the opposite is true. “The public sees veterans as broken, and they often shape the narrative to fit their perceptions,” Mr. Rausch said. When the news of the Fort Lauderdale shooting broke, he said: “My first thought was that I hoped no one was hurt. My second was that I hoped it wasn’t a veteran because I knew if they were, it would spark a simplified explanation that would never happen with a civilian, tying everything back to war. ” After telling the F. B. I. in November that his mind was being controlled, Mr. Santiago was taken to a civilian psychiatric hospital. The law prevents patients from being held involuntarily if they are not an imminent threat to themselves or others. Mr. Santiago was released after four days. “Anyone who has ever known someone with mental illness knows it’s extremely complicated and hard to deal with,” Mr. Rausch said. “Blaming on military experience keeps us from having a real conversation about how to fix things. This isn’t a veteran problem, it’s an American problem. ”'"}, "time": 1742563019.2168753}