{"duration": 0.13411784172058105, "input_args": {"text": "'To celebrate Donald Trump’s inauguration this week, I’m returning to my new favorite parlor game: quoting Republican consultants on the 2016 campaign. [It never gets old! Also, this exercise reminds us of the many things we are thankful for this week: Donald Trump, the cluelessness of his opponents, and Nexis transcripts.  Our featured GOP consultant this week is Matthew Dowd, chief strategist for the   campaign and   Mr. Magoo. Nominally a conservative in a liberal business, Dowd couldn’t pull off a full Arianna, so if he wanted to sit in a warm studio on Sunday mornings issuing pronouncements as if from Mount Olympus, he had to come up with an act. Even a guy like Dowd  —   wrong on everything else, from the time of day to whether it’s raining  —   accurately sussed out what the media wanted: a   playing “the conservative. ” How else to explain the fact that the entire American media refused to have on anyone who supported the man who just won a landslide presidential election? The territory Dowd carved out for himself was: patriotic sage, above partisanship, announcing on every subject that both sides were wrong, he alone was right. This made him a regular panelist on ABC’s “This Week” with George Stephanopoulos. Dowd’s “both sides are wrong” offering to the   church was condescending and tiresome, but it would help if he were, from time to time, correct. Instead, from the moment Trump announced, Dowd treated us to hilariously boneheaded prognostications that were instantly proved wrong and never acknowledged as he issued each successive boneheaded prediction. On Feb. 7, 2016, Dowd pronounced that the nominations would be wrapped up in “April for the Democrats and May for the Republicans. ” Trump won the nomination by May 4 and Hillary won it in June  —   two months after Dowd’s confident prediction. On April 3, Dowd said Trump “can’t win a general election for all intents and purposes. ” (“For all intents and purposes” is what consultants add to   statements to make them sound weighty.) Trump won the election  —   and he won it with far more electoral votes than Dowd’s candidate ever got. On May 1, Dowd said, “It’s going to be a    election, unfortunately. ” Trump won both white men and white women, decisively. White women without a college degree carried the Midwest for Trump. (See here.) Dowd spent several Sundays in May assuring viewers that a   candidate would be on stage at the debates: “I think there is likely to be somebody else standing in the debates and that changes the dynamics. ” That never happened. After Trump wrapped up the nomination, Dowd claimed he had predicted it! “Well, I was very bullish on Donald Trump in the primaries,” he said on May 8. His use of the term “bullish” was, well,  . As for Trump winning the general election, Dowd declared it “unlikely. ” (Based on his fantastical recollections of his own predictions, I assume he is currently claiming to have predicted Trump’s win in the general election.) In the week leading up to the election, Dowd was a whirling dervish of soothsaying on Twitter: NOVEMBER 1, “@matthewjdowd Any expenditure of time or money by Trump in PA, VA, MI and NH is a total waste. Campaign mismanagement if they keep it up. ” Of the four states Dowd considered “a total waste” for Trump to campaign in, he won the two biggest, worth more than twice as many electoral votes as the other two combined  —   and one of those he lost by only 0. 3 percent. NOVEMBER 2, “@matthewjdowd clinton has a better chance of carrying Arizona than trump does of carrying Mi or Wi” Trump carried both Michigan and Wisconsin. Hillary did not win Arizona. NOVEMBER 4, “@matthewjdowd Look for sure signs Trump will lose: 1. ‘The only poll that matters is election day’ 2. ‘Our vote doesn’t show up in polls.’ 3. ‘Truman’” Although Trump never made any excuses  —   he won!  —   all three of those statements turned out to be true. (See Time magazine’s “Madam President” issue.) NOVEMBER 5 was Dowd’s Latino Appreciation Day: “@matthewjdowd even if Trump gets the exact % of votes of whites, blacks  Asians as Bush in 2004, Trump would lose by 3 million votes due to Latinos. ” “@matthewjdowd Trump will lose latino voters by a larger margin than romney. Who set a new modern low. ” “@matthewjdowd It looks like Trump campaign was right, the silent hidden vote is showing up: Latinos are voting at record levels. Motivated by Trump. ” Trump won more of the Hispanic vote than either McCain or Romney  —   and probably more than Bush, for whom we only have nonsense numbers (as both Republican and Democratic analysts agree  —   see here and here). NOVEMBER 6, “@matthewjdowd If trump loses Ohio and Florida one reason is that Clinton campaign head faked them into thinking he had chance in Michigan.  media helped” Trump won Michigan. Also Ohio and Florida. On Nov. 6  —   48 hours before the election  —   Dowd announced on ABC’s “This Week” that Trump would lose, “and lose badly. ” Bored with his own omniscience, Dowd explained, “George, to me, this election has been   …     incredibly predictable actually from the primary. ” Mr. Magoo had more wisdom to impart: “On election night, Hillary Clinton’s margins among nonwhite voters and among   voters are going to be the highest margins we’ve ever seen. ” Dowd’s sweeping declarations turned out to be less accurate than a blindfolded monkey throwing darts in a bar. On Twitter, Dowd assured his readers: NOVEMBER 7, “@matthewjdowd Clinton wins by five points. Over 300 electoral votes. Trump loses by more popular votes than Romney. ” Final electoral vote: Trump, 304 Clinton, 227. TV bookers couldn’t get enough of Dowd. What smugness! What monumental cluelessness! ABC’s “This Week” is a show famous for confronting guests with their own prior statements. Would ABC play this game with its own Powerhouse Roundtable prognosticators? Surely a man of Dowd’s integrity would come on the air and admit, “I couldn’t have been more wrong!” HELLO! That didn’t happen at all! Dowd was allowed to sit out the Sunday after the election. The following Sunday, he was in his usual seat on the Powerhouse Roundtable, right back to giving his sweeping, grinning predictions, with no acknowledgment that he had been spectacularly  —   and characteristically  —   wrong in every prediction he’d made, all year long. That’s why Dowd is our   Mr. Magoo. As Trump is being sworn in and visions of the wall are dancing in your head, remember that if he ever runs out of bricks, he can always use Republican consultants.'"}, "time": 1742562666.3684149}