{"duration": 0.11423897743225098, "input_args": {"text": "'A Washington state middle school teacher received a lot of heat for her decision to pull aside a student wearing a “Build the Wall”  . [The Chinook Middle School language arts teacher, after pulling the student aside, compared the shirt’s message to wearing a swastika, the   Herald reported.  “She asked, ‘How would you feel if someone wore a   with a swastika on it?’ ” the student’s mother, Michelle Fischer, told the   Herald. “He said, ‘You can’t compare my shirt to wearing a swastika. They aren’t the same thing.’ ” Fischer said the teacher asked her son Jack to stay in her class during lunch to talk about the shirt and told him that it wasn’t appropriate to wear clothing with a political message. Jack responded to the teacher that he saw a math teacher wearing a shirt with Barack Obama on it. Fischer posted her outrage over the teacher’s handling of the situation on Facebook and it went viral, especially after conservative talk show host Sean Hannity shared it to his 2. 8 million followers. Fischer is hoping that her son’s experience makes it easier for other children to speak up about political bullying. “It does happen,” said Michelle Fischer. “I think (politics) should be taught in our schools, but only in a   positive way. ” Jack told her that the teacher had appeared opposed to Donald Trump since the beginning of the school year because of how she handled class discussions of the presidential election and the candidates. Fischer spoke with Chinook’s principal, Kevin Pierce, who said there was nothing wrong with the shirt. School district officials said appropriate action was taken against the teacher, but could not release details on personnel matters. The district said students are allowed to express their opinions so long as it doesn’t disrupt the education of others. “I think most parents would agree with me,” Fischer said. “If this was the other way around, I guarantee there would be some parents that were pretty upset. ” Students at other high schools around the country have also been harassed by school officials for wearing clothing in support of Trump. A student at a high school in South Portland, Oregon was harassed by school officials because he wore a hat with Trump’s campaign slogan, “Make America Great Again” in April 2016.'"}, "time": 1742563176.726777}