{"duration": 1.6474740505218506, "input_args": {"text": "'Well, in a long list of documented lies, coverups and criminal activity , Barack Hussein Obama Soetoro Sobarkah continues to get busted, demonstrating that the man is a pathological liar , which makes him mentally unstable and unfit for office ( not that he was qualified in the first place ). \\nFirst, let\\'s review what Obama said. Michael Bastasch reports : \\nThe White House knew President Barack Obama had emailed former Secretary of State Hillary Clinton\\'s private email account that was run out of an unsecured server in her New York home, according to emails released by WikiLeaks. \\nObama told CBS News in March 2015 he learned of Clinton\\'s private server the way basically all Americans did, \" through news reports .\" But emails hacked from Clinton campaign chair John Podesta\\'s Gmail account suggest the White House already knew about Clinton\\'s private email server. \\n\"They know POTUS and HRC emailed,\" Clinton communications director Jennifer Palmieri wrote to aides in March 2015 — about a month before Clinton announced she was running for president in 2016. \\nSo, how did Obama find out about Clinton\\'s illegal email server ? The same way most Americans do, \"through new reports;\" at least that is the lie he told. \\nSo, how do we know he\\'s lying? First, his lips are moving. Second, is the documented evidence of a March 7, 2015 email from Josh Schwerin to Jennifer Palmieri, Kristina Schake, Nick Merrill, Jesse Ferguson, which reads, \"Jen you probably have more on this but it looks like POTUS just said he found out HRC was using her personal email when he saw it in the news.\" \\nAnd what was the reply? \\n\"we [sic] need to clean this up – he has emails from her – they do not say state.gov.\" \\nThat reply came from none other than Cheryl Mills, who wrote to John Podesta. \\nDoes anyone else think Josh had to change his cell phone number after this? \\nThis is right along the lines of the lie Obama told when he said, \"If You Like Your Health Care Plan, You Can Keep It\" . \\nAnyways, this is what we have come to expect from those who are supposed to serve the people in government, but we should not expect such and should not allow it to continue. Rather, we should be demanding that justice prevail in all things and deal with these people not just by getting them out of government, but by bringing a just punishment on them for what they have done and sending a message to anyone else that chooses to engage in this behavior while in public service that they will receive the same treatment. shares'"}, "time": 1742564093.392771}