{"duration": 1.5451202392578125, "input_args": {"text": "'1/18/2016, 12:59 am Fareed Zakaria can dish it out but can\\'t take it CNN host Fareed Zakaria is now calling to censor social media because he was offended by The People\\'s Cube satire about his writings. Without mentioning that our satire was a hyperbolic buildup on his own recent writings, Zakaria cries for government protection of his hurt feelings, making it clear that he can dish it out but can\\'t take it. Taste your own medicine, Fareed.\"Progressives\" have trolled, ridiculed, satirized, maligned, insulted, bullied, and lied about conservatives since the inception of the Internet. But once they see the signs of oncoming traffic, they cry and run to mommy - or to the nanny state in this case - asking to make it a one-way street once again, where only they can ride their tricycles, wear funny hats, and fling poop at those whom they consider inferiors. Watch Fareed Zakaria on camera wiping his face from the poop flung at him. An open letter to Fareed Zakaria from The People\\'s Cube ~ Dear Fareed,There have been studies showing that a foreign-born author\\'s unique perspective can help the natives to boost their own creative thinking through the so-called \"schema violation,\" which occurs when our world is turned upside-down. You may argue that your \"otherness\" benefits and enlightens this country, with an implication that those unwilling to be enlightened by you are bigots who resent your \"otherness\" and won\\'t have their old schema to be violated by a newcomer. Like you, I am a foreign-born author whose English is a second, or, rather, a third language; I know what it feels to be \"the other.\" I also like to help the natives to boost their creative thinking by turning their reality upside-down and sending their temporal and spatial cues off-kilter (my website, The People\\'s Cube , is one such big schema violation). I don\\'t resent anyone\\'s \"otherness\" as long as they don\\'t attempt to make me comply to theirs. In sum, I am not concerned with your ethnic or cultural \"otherness.\" It is your ideological \"otherness\" that bothers me, which makes you indistinguishable from the next run-of-the-mill, native-born \"progressive.\"Now that we got the implication of bigotry out of the way, let\\'s get down to business.On January 2, one of our contributors posted a satirical response to your Washington Post article where you apparently gloated over the premature deaths of white males in America. Our author took your argument to its logical conclusion, adding the need to exterminate white females as well - through Jihad, rape, and sex slavery as recently seen in Europe and elsewhere. This parody wasn\\'t meant to be taken as factual reporting, given the context of our website and especially considering the author\\'s credentials at the top: Chedoh, Kommissar of Viral Infections, Hero of Change, Prophet of the Future Truth.On January 14, you responded to our satire in your Washington Post article titled, Bile, venom and lies: How I was trolled on the Internet , and today you started your show on CNN with a segment titled, Fareed\\'s Take: I was the target of Internet trolling , in which you were mostly reading your earlier article from the teleprompter. Among other things you claimed that our story \"was cleverly written to provide conspiracy theorists with enough ammunition to ignore evidence\" and complained that some people took our \"reporting\" seriously and reposted it in social media with impolite comments, all of which led you to conclude that someone must create a mechanism in social media \"to distinguish between fact and falsehood.\" And since that someone can only be the government, your statement can only be understood as a vague call for the government censorship of the Internet.However, neither your article, nor the CNN segment mentioned that our grotesque fiction was based on your own controversial ideas that many Americans found insulting and grotesque. Why? Was it because such an admission would have undermined your argument that people were angry at you over nothing? And why in the world, Fareed, did you decide to bring up the term \"radicalization,\" which in today\\'s world is mostly associated with Islam? Do you have such a tin ear - or do you really think that if you broaden the definition and talk about \"American radicalization,\" people will begin to see the two as morally equivalent? Do you think they are morally equivalent, Fareed?Fine, let\\'s talk about radicalization.For you, sitting on the top floors of your well-protected media establishment\\'s ivory tower, it\\'s easy to downplay the threat of Islamic radicalization and throw the \"Islamophobia\" labels at all those little people down at the street level. The only radicalization to which your skewed radar is attuned is the faintest sound of protest from the little people, when they get fed up with your condescending elitism and begin to rebel against the \"progressive\" establishment. That\\'s what scares you the most, doesn\\'t it, Fareed? That\\'s when you mouth off your grave concerns on CNN and write in WaPo about the threat of radicalization. But who is at fault that Americans no longer trust the establishment and its media? Have you considered the possibility that none of this would be happening if you and your colleagues weren\\'t so radical yourselves, feeding the people with half-truths, distortions, propaganda, and outright lies, placing your Utopian \"progressive\" ideology above facts, smug and secure in your impenetrable media castle? Did it occur to you that you and your media establishment may be the very reason why so many people suddenly like Donald Trump, whom you so despise , and nothing you say on the subject can change their minds because no one trusts you anymore?When you talked about a study where \"simply by talking to one another, the bigoted students had become more bigoted,\" has it even occurred to you how perfectly this describes your \"progressive\" echo chamber, where tolerance towards opposing philosophical viewpoints is nonexistent? If you think that calling those who disagree with you \"bigots\" makes you an anti-bigot, let me share a little secret. There are two kinds of bigots today: the bigots and the anti-bigots, and it\\'s hard to say which kind is worse. A good example of \"group polarization\" involving radical \"anti-bigots\" is JournoList - a highly biased group of about 400 left-wing journalists and political activists who for three years (2007-2010) participated in a private online echo chamber where they, in violation of public trust and professional ethics, conspired to coordinate media attacks on conservatives, to promote certain issues while burying others, and to influence the 2008 elections in favor of Barack Obama. To paraphrase Kolbert\\'s study, \"Simply by talking to one another, the radical left-wing journalists had become more radical left-wing journalists.\" To use your exact quote, \"It is how radicalization happens and extremism spreads.\" Say, were you just as worried about \"group polarization\" then as you are now?Another example of such \"group polarization\" and radicalization is a knee-jerk impulse of allegedly mainstream journalists to describe anyone who doesn\\'t lean left as \"far-right,\" as you have demonstrated in your CNN segment, or \"ultra-right-wing,\" as you have demonstrated in your segment.Isn\\'t it a little too late to complain about America\\'s radicalization, Fareed? Where were you during the George W. Bush years, when your fellow \"progressives\" trolled, ridiculed, and slandered the U.S. President and his supporters, with full support of the mainstream media? When there no longer was any distinction between a drug-fueled street protester and a media commentator? Did you complain when \"progressive\" satirists collectively created a false, hyperbolic reality around Bush, conservatives, Fox News, and America in general, which was then regularly disseminated as the truth around the world, translated into many languages, and contributing to the anti-American sentiment? Some of my own family members in Russia and Ukraine still honestly believe that those \"facts\" really happened. As you so eloquently stated,\" the people spreading this story were not interested in the facts; they were interested in feeding prejudice.\" Did you complain then, or did it feel too good to let go?You refer to a scientific study of Facebook users, which found that \"people mainly shared information that confirmed their prejudices, paying little attention to facts and veracity.\" That sounds reasonable. For example, even without a scientific study I know that an overwhelming majority of your fellow \"progressives\" believe that Sarah Palin has actually said \"I can see Russia from my house,\" paying little attention to the fact that it originated as an SNL skit. Did you complain about that in 2008? Were you at all concerned that Tina Fey\\'s \"Palin\" videos might confuse voters and skew the election? Probably not; it was just satirical hyperbole, right?What if social media encourage misinformation, rumors, and lies, you ask. But did you ask the same question when misinformation, rumors, and lies were coming not from social media but from a seasoned mainstream journalist named Dan Rather - or, more recently, The Rolling Stone Magazine? Or, worse yet, from the nation\\'s political leaders whom you support and admire? Wasn\\'t the entire debate on and implementation of ObamaCare based on misinformation and lies? Were you alarmed when Joe Biden told a black audience that the Republicans would put them back in chains? Did you speak against radicalization when the \"hands up don\\'t shoot\" movement, based on misinformation, rumors, and lies, and encouraged by the mainstream media, resulted in looting and the destruction of property, followed by the murders of innocent police officers?The answer to all those question is \"no.\" You have never violated the \"progressive\" schema, Fareed. You\\'ve been a loyal Party soldier, albeit a mediocre creative thinker, having traded your \"otherness\" for conformity and sacrificing your unique perspective to what you thought was \"progress.\"Examples are plenty; more can be provided upon request. Now let\\'s talk about victimhood. You say you are the victim because you have received some hateful messages and comments. I have also received many hateful messages and comments from your fellow \"progressives\" over the years. Now what? You claim you have received a late-night phone call that woke up and threatened your young daughters. Indeed, Fareed, making threatening calls is a crime. Did you file a police report? Did the police trace the number and find the perpetrators, who are hardly a sophisticated organization behind an impenetrable firewall? If not, I can\\'t believe every claim that comes from a confirmed plagiarist . You may as well claim that someone kicked your three-legged puppy and it made you cry.\\ufeffWhile you played the world\\'s saddest song on the world\\'s smallest violin, I was the one who took the real hit. Snopes.com, a \"fact-checking\" website rooting for the \"progressive\" team, has not only debunked our satire as they\\'ve done it many times in the past - this time they also made an unsourced and slanderous allegation that our site is \"known for spreading malware.\"Next, some busybody contacted one of our advertising providers, Content.ad, which then declined to pay our advertising earnings due to \"serious quality issues.\" The money we lost as a result may be small change compared to your CNN contract, but if you were penalized for your writings in the same proportional amount, I\\'m sure your righteous indignation would go well beyond just one article in WaPo and a five-minute segment on CNN. There is only one victim of lies, prejudice, and institutionalized bias here - and it ain\\'t you, Fareed. But don\\'t let this stop you from playing your upside-down game of \"victims and radicals\" while you still can. So you think your opponents are radicals? Here\\'s a news tip: down here in the streets below you, it\\'s the other way around: growing numbers of Americans see you and your media colleagues as radical ideological hacks. You can call them any name you want, adding ultra-, far-, uber-, and other hyphenated insults; that won\\'t change the fact that their thinking is the norm and yours is not. Like all normal people on this planet, they don\\'t respond well to insults. But they are also the ones who make sure you have the freedom to call them radicals. Oleg AtbashianDepartment of Visual Agitation and Unanimity 1/18/2016, 1:27 am Red Square,I must say, this morning when I heard Fareed refer to TPC as a \"minor news site\" I was terribly offended and had to be hospitalized for a number of hours. Fortunately there was no permanent brain damage or anything so I can resume spewing hate tomorrow morning. (according to my doctor) I look forward to reading your upcoming letter to the sensitive Mr. Zakaria when my health returns in the spring.CC 1/18/2016, 3:12 am Alright, so Zakaria said that it is not obvious that this is a satire page to paraphrase. Yet the Washington Post declared us as \" Arguably one of the Internet\\'s most satirical websites \". And if THAT isn\\'t enough maybe the author, a cheeto dressed as Che Guevara, might have been another dead give away Might have....Really this whole thing reminded me of a clip I\\'ve seen from another satirical source... Although it \\'may not\\' be \\'clear satire\\' if we were to use the racist plagiarist Fareed Zakaria\\'s standards. It\\'s not about Zakaria, and the subject matter may be different, but mechanically he did the same thing.... He can use Craptek\\'s Safer-Space ™ Products . 1/18/2016, 10:43 am Kongratulations, Komrade Red Square! Your People\\'s Truth finally penetrated Fareed the Screed\\'s bubble of Bleeding Edge Korrect Truth! Perhaps I can be allowed to suggest to the Cubitburo that you be awarded the title, \"People\\'s Needler\" for that penetration, and also\"Onion of the Soviet Cube\" for having made him cry like a little girl. 1/18/2016, 4:24 pm Sounds like Fareed really, really wants to be on the cover of the next issue of Poor Me. Instead of bringing back Beet of the Week (thanks to Speaker Ryan, it might well be fully funded again since he moved to fully fund pretty much everything else), perhaps we should implement something called Whiner of the Week and make Fareed the first recipient. Fareed had to read the article from a teleprompter because someone else probably wrote it. 1/18/2016, 4:49 pm Commissarka Pinkie Sounds like Fareed really, really wants to be on the cover of the next issue of Poor Me. Instead of bringing back Beet of the Week (thanks to Speaker Ryan, it might well be fully funded again since he moved to fully fund pretty much everything else), perhaps we should implement something called Whiner of the Week and make Fareed the first recipient. Thank you for reminding me! I\\'ll get to making the second issue of Poor Me Magazine right away. Preparing Whiner of the Week award is a bit more complicated, as I foresee a lot of red tape, hurdles, signatures, bribes, and entertainment expenses before it is even included in this Five-Year Plan. In lieu of that, let me use the existing Golden Teabag award and sticker: If he was smarter, he\\'d just turn the other cheek. But his skin is too thin and his ego too inflated to withstand more than a superficial prick On special request from Commisarka Pinkie: Poor Me Mag #2 | See #1 here .IN THIS ISSUE: · They only don’t trust me because they know me!· Know your rights: dish it out without having to take it EXCLUSIVE:Fareed Zakaria, 52, laments about social media intruders who stole his tiny violin and waterboarded his three-legged puppy I don\\'t want to watch the whole five minute video. Can somebody tell me the minute and second at which he cries? 1/18/2016, 6:17 pm professor joe - The Tears of Fareed™ are the specialty of our Department of Visual Agitation. You won\\'t find \\'em anywhere else. Only on the People\\'s Cube, comrade! Only on the People\\'s Cube. This clowns tears look more like that of an entirely different body fluid. Are we sure he\\'s not a bukkake(don\\'t google, you\\'ve been warned) enthusiast? Komrade Victor - are you implying that Fareed is \"wee-wee\\'d up\" (to use a phrase first uttered by The Most High and Mighty Barack H Obama)? My Our Entire Beet Kollecktiv has ( Unanimously! ) voted to send Kameradka Zakaria An Entire Pallet Of Teenage-Girl-Sized Feminine Hygiene Pads . These deliveries will continue until Little Fareed finally matures into a Full-Grown Woman ! Comrades, what if Jeff is Fareed or Fareed is Jeff? Apparatchik Unkulturny My Our Entire Beet Kollecktiv has ( Unanimously! ) voted to send Kameradka Zakaria An Entire Pallet Of Teenage-Girl-Sized Feminine Hygiene Pads . These deliveries will continue until Little Fareed finally matures into a Full-Grown Woman ! iPAD? The whole world is watching. And laughing at you commies tearing each other apart! Pass the popcorn! Commie fight! 1/19/2016, 2:52 am Fareed Zakaria shown above accepting his Proletariat Peabody Award (more commonly known as the HUA Award) from The People\\'s Cube for \"Outstanding Heads-Up Asininity\" in Progressively projecting onto those \"others\" his own heart-felt bigotry in a manner portraying himself as victim -- i.e., as the bigotee rather than the bigotor. Next on his target list is The Onion, Mad Magazine, and other libelously parodic and satirical mockers of well-deserved mockees. Response to 3min mark: Woh! This is a satire website??? So does that mean Laika the space dog is NOT a real reporter??? I just...I just don\\'t know what to believe anymore! 1/19/2016, 9:35 am after a single mention by Rush Limbaugh, the \"Stalinist version of the Onion\" the Peoples Cube was overwhelmed with visits and new members...Given the ratings and the audience of CNN, has there been any spike in viewers to the cube? perhaps we can get someone to stand on a corner and hand out flyers? I can go back to writing the website on the walls of the ladies room stalls... (you meet the nicest people in there)Viva la Clinton News Network!FLOORWARD! 1/19/2016, 3:14 pm Comrade Square, your written response was way beyond masterful, there is however one minor problem. The entire article will have to be reduced to a collection of single syllable words by the CNN editorial staff, so their \"on camera personalities\" may absorb some of the meaning.Concerning the proletariat award, I am sure that any resemblance to the Debby Washerwoman is purely coincidental. 1/20/2016, 12:59 am Comrade Trump has gone beyond an amusing cartoon to the party. Now the gloves must come off for this threat comrades. Books, banners, T-shirts and hats will be burned, neighbors will be shamed in the streets, and any white subversive sympathizer will be reeducated in the Eastern camps at hard labor to appreciate third world values, food and dance. Zero toleration for any leftover capitalist pigs in the USA! The comments on Fareed\\'s article are pretty awesome... On special request from Commisarka Pinkie: Poor Me Mag #2 | See #1 here . IN THIS ISSUE: · They only don’t trust me because they know me! · Know your rights: dish it out without having to take it EXCLUSIVE: Fareed Zakaria, 52, laments about social media intruders who stole his tiny violin and waterboarded his three-legged puppy When did Poor Me become a gay mag?Oh. Never mind. I forgot that the first issue was about a gay man who was upset that he was gay and other people were not. 1/21/2016, 4:48 pm If there is a story in deaf as a Post, there could be something to this.CNN as confident [ this is mean he is a good plagiarist] that any of his text may have come from not copyrighted sources.Will he be Fareed from employment? Probably not, CNN loves originality, even if it is somebody else\\'s. General Confusion Comrade Square, your written response was way beyond masterful , there is however one minor problem. The entire article will have to be reduced to a collection of single syllable words by the CNN editorial staff, so their \"on camera personalities\" may absorb some of the meaning.Concerning the proletariat award, I am sure that any resemblance to the Debby Washerwoman is purely coincidental. Yes! Yes! Yes! Comrade General Confusion!I just have to sit down and take it in. Awesome! So awesome! That is the finest use of English by anyone in the cube, or out including myself!There should be an appropriate award by members, you can head a committee!GC General Confusion Comrade Pamalinsky,That is the finest use of English by anyone in the cube, or out including myself!There should be an appropriate award by members, you can head a committee!GC Thanks, General Confusion, for your kind words. Thing is, I had to dry the tears dripping down my cheeks after reading it. I am so proud to be a Cubist (an art form) Poor Fareed, his skin is so thin that when the wind blows he calls it an extremist racist troll that offends him. 1/21/2016, 10:15 pm Komrade Direktor, how dare you say these hateful words of oppression towards Mr. Zakaria! I know he attacked our Glorious Kube, but he\\'s clearly Muslim or related to Muslims (Judging by the Glorious Muslim name), which makes him a part of the Protekted Peoples of the Kubist Way. That means that you can\\'t attack him. He is rubber, you\\'re glue, whatever you say bounces off of him and sticks on you. Anyways, the Kube is Eternal and Glorious, the attacks of someone like him can\\'t damage it. Where there is Kommunism, there is the Kube, and as long as there is one person alive that is dedicated to the Eternally True Kommunist Way, then the Kube will live on. And Zakaria is actually helping the Kube, he is letting people know of it\\'s existence, and once you have the Kube on your mind it won\\'t go away. I thought I was immune to the Allure of the Kube since 2009 when I started reading it. That was until I decided to become a part of the Revolution and enlist in the People\\'s Kubist Revolutionary Force.Besides, our Glorious Party Organ isn\\'t satire, it\\'s Eternal Current Truth! Laika lives on, she will never die! I get all my news from the Kube, it tells me what to think, since I can\\'t actually think for myself anymore. I used to, but then I was revolutionized by the Kube. Can you say that about such satire websites as MSNBC, Fox News, or indeed CNN, the very organization that Zakaria thinks is credible and reputable? They\\'re as credible as a man saying a stick is actually a brick! Sure, these Organs of the Enemy do tell people what to think since they can\\'t think for themselves, and they CAN revolutionize somebody, but they all believe in \"rights\". Komrade, there is only one right I believe in, and that is the right to work for the state in glorious production! And they also believe in \"ethics\" and \"Honesty\". Well, if that were the case, why are they spreading so many lies about the Kube? And why do they think they have to ask everybody questions that can easily be answered by a simple NSA scan or FBI/DHS/DEA raid? That\\'s what makes our and many other Party Organs so great, we can and do get right to the source WITHOUT the overhead![OFF]Were this a lecture hall, I would have given a standing ovation for the letter to Zakaria. 1/25/2016, 10:22 pm methadras Poor Fareed, his skin is so thin that when the wind blows he calls it an extremist racist troll that offends him. I tend to find the passing wind somewhat offensive. I\\'m not sure if it\\'s racist though. Likely a climate denier. I\\'m sure of that! It denies me my comfortable climate! 4/3/2016, 11:37 pm This story is now being discussed in Sweden. I accidentally noticed a popular link leading to the Cube, and clicking on it resulted in a Swedish news portal. Google Chrome offers a more or less readable translation - the style is lost, but the content is quite good. Very well stated. Thanks for being here, Komrade. Quote: let me use the existing Golden Teabag award and sticker The front-page picture really does seem to show an aftermath of tea-bagging. And it has nothing to do with beverages... Not that there is anything wrong with it. Quote: let me use the existing Golden Teabag award and sticker The front-page picture really does seem to show an aftermath of tea-bagging. And it has nothing to do with beverages... Not that there is anything wrong with it. Yeah, mi, it reminds me of the time when Robert Redford announced his retirement (first in a series) in a video, and some commenter said, and I paraphrase, \"Whew, for a minute there I thought I was watching my bulldog\\'s ballsack. Glad to see Redford taking the proverbial hike.\" Users browsing this forum: Ivan the Stakhanovets , MSNbot Media , Yahoo [Bot] and 56 guests Display posts from previous: Powered by phpBB © 2000, 2002, 2005, 2007 phpBB Group The uncontested absurdities of today are the accepted slogans of tomorrow. They come to be accepted by degrees, by precedent, by implication, by erosion, by default, by dint of constant pressure on one side and constant retreat on the other - until the day when they are suddenly declared to be the country\\'s official ideology. ~ Ayn Rand \\nRubiks & Rubik’s Cube ® used by special individual permission of Seven Town Ltd. Write down this number and report to your Kommissar at the nearest railroad station. Don\\'t forget warm clothes and a shovel! \\nAfraid of \"dangerous\" Trump presidency, protesters pre-emptively burn America down to the ground \\nClinton Foundation in foreclosure as foreign donors demand refunds \\nHillary Clinton blames YouTube video for unexpected and spontaneous voter uprising that prevented her inevitable move into the White House \\nSudden rise in sea levels explained by disproportionately large tears shed by climate scientists in the aftermath of Trump\\'s electoral victory \\nFBI director Comey delighted after receiving Nobel Prize for Speed Reading (650,000 emails in one week) \\nU.N. deploys troops to American college campuses in order to combat staggeringly low rape rates \\nResponding to Trump\\'s surging poll numbers, Obama preemptively pardons himself for treason \\nFollowing hurricane Matthew\\'s failure to devastate Florida, activists flock to the Sunshine State and destroy Trump signs manually \\nTim Kaine takes credit for interrupting hurricane Matthew while debating weather in Florida \\nStudy: Many non-voters still undecided on how they\\'re not going to vote \\nThe Evolution of Dissent: on November 8th the nation is to decide whether dissent will stop being racist and become sexist - or it will once again be patriotic as it was for 8 years under George W. Bush \\nVenezuela solves starvation problem by making it mandatory to buy food \\nBreaking: the Clinton Foundation set to investigate the FBI \\nObama \\u200b\\u200bcaptures rare Pokémon \\u200b\\u200bwhile visiting Hiroshima \\nMovie news: \\'The Big Friendly Giant Government\\' flops at box office; audiences say \"It\\'s creepy\" \\nBarack Obama: \"If I had a son, he\\'d look like Micah Johnson\" \\nWhite House edits Orlando 911 transcript to say shooter pledged allegiance to NRA and Republican Party \\nPresident George Washington: \\'Redcoats do not represent British Empire; King George promotes a distorted version of British colonialism\\' \\nFollowing Obama\\'s \\'Okie-Doke\\' speech , stock of Okie-Doke soars; NASDAQ: \\'Obama best Okie-Doke salesman\\' \\nWeaponized baby formula threatens Planned Parenthood office; ACLU demands federal investigation of Gerber \\nExperts: melting Antarctic glacier could cause sale levels to rise up to 80% off select items by this weekend \\nTravel advisory: airlines now offering flights to front of TSA line \\nAs Obama instructs his administration to get ready for presidential transition, Trump preemptively purchases \\'T\\' keys for White House keyboards \\nJohn Kasich self-identifies as GOP primary winner, demands access to White House bathroom \\nUpcoming Trump/Kelly interview on FoxNews sponsored by \\'Let\\'s Make a Deal\\' and \\'The Price is Right\\' \\nNews from 2017: once the evacuation of Lena Dunham and 90% of other Hollywood celebrities to Canada is confirmed, Trump resigns from presidency: \"My work here is done\" \\nNon-presidential candidate Paul Ryan pledges not to run for president in new non-presidential non-ad campaign \\nTrump suggests creating \\'Muslim database\\'; Obama symbolically protests by shredding White House guest logs beginning 2009 \\nNational Enquirer: John Kasich\\'s real dad was the milkman, not mailman \\nNational Enquirer: Bound delegates from Colorado, Wyoming found in Ted Cruz’s basement \\nIran breaks its pinky-swear promise not to support terrorism; US State Department vows rock-paper-scissors strategic response \\nWomen across the country cheer as racist Democrat president on $20 bill is replaced by black pro-gun Republican \\nFederal Reserve solves budget crisis by writing itself a 20-trillion-dollar check \\nWidows, orphans claim responsibility for Brussels airport bombing \\nChe Guevara\\'s son hopes Cuba\\'s communism will rub off on US, proposes a long list of people the government should execute first \\nSusan Sarandon: \"I don\\'t vote with my vagina.\" Voters in line behind her still suspicious, use hand sanitizer \\nCampaign memo typo causes Hillary to court \\'New Black Panties\\' vote \\nNew Hampshire votes for socialist Sanders, changes state motto to \"Live FOR Free or Die\" \\nMartin O\\'Malley drops out of race after Iowa Caucus; nation shocked with revelation he has been running for president \\nStatisticians: one out of three Bernie Sanders supporters is just as dumb as the other two \\nHillary campaign denies accusations of smoking-gun evidence in her emails, claims they contain only smoking-circumstantial-gun evidence \\nObama stops short of firing US Congress upon realizing the difficulty of assembling another group of such tractable yes-men \\nIn effort to contol wild passions for violent jihad, White House urges gun owners to keep their firearms covered in gun burkas \\nTV horror live: A Charlie Brown Christmas gets shot up on air by Mohammed cartoons \\nDemocrats vow to burn the country down over Ted Cruz statement, \\'The overwhelming majority of violent criminals are Democrats\\' \\nRussia\\'s trend to sign bombs dropped on ISIS with \"This is for Paris\" found response in Obama administration\\'s trend to sign American bombs with \"Return to sender\" \\nUniversity researchers of cultural appropriation quit upon discovery that their research is appropriation from a culture that created universities \\nArcheologists discover remains of what Barack Obama has described as unprecedented, un-American, and not-who-we-are immigration screening process in Ellis Island \\nMizzou protests lead to declaring entire state a \"safe space,\" changing Missouri motto to \"The don\\'t show me state\" \\nGreen energy fact: if we put all green energy subsidies together in one-dollar bills and burn them, we could generate more electricity than has been produced by subsidized green energy \\nState officials improve chances of healthcare payouts by replacing ObamaCare with state lottery \\nNASA\\'s new mission to search for racism, sexism, and economic inequality in deep space suffers from race, gender, and class power struggles over multibillion-dollar budget \\nCollege progress enforcement squads issue schematic humor charts so students know if a joke may be spontaneously laughed at or if regulations require other action \\nISIS opens suicide hotline for US teens depressed by climate change and other progressive doomsday scenarios \\nVirginia county to close schools after teacher asks students to write \\'death to America\\' in Arabic \\n\\'Wear hijab to school day\\' ends with spontaneous female circumcision and stoning of a classmate during lunch break \\nISIS releases new, even more barbaric video in an effort to regain mantle from Planned Parenthood \\nImpressed by Fox News stellar rating during GOP debates, CNN to use same formula on Democrat candidates asking tough, pointed questions about Republicans \\nShocking new book explores pros and cons of socialism, discovers they are same people \\nPope outraged by Planned Parenthood\\'s \"unfettered capitalism,\" demands equal redistribution of baby parts to each according to his need \\nJohn Kerry accepts Iran\\'s \"Golden Taquiyya\" award, requests jalapenos on the side \\nCitizens of Pluto protest US government\\'s surveillance of their planetoid and its moons with New Horizons space drone \\nJohn Kerry proposes 3-day waiting period for all terrorist nations trying to acquire nuclear weapons \\nChicago Police trying to identify flag that caused nine murders and 53 injuries in the city this past weekend \\nCuba opens to affordable medical tourism for Americans who can\\'t afford Obamacare deductibles \\nState-funded research proves existence of Quantum Aggression Particles (Heterons) in Large Hadron Collider \\nStudent job opportunities: make big bucks this summer as Hillary’s Ordinary-American; all expenses paid, travel, free acting lessons \\nExperts debate whether Iranian negotiators broke John Kerry\\'s leg or he did it himself to get out of negotiations \\nJunior Varsity takes Ramadi, advances to quarterfinals \\nUS media to GOP pool of candidates: \\'Knowing what we know now, would you have had anything to do with the founding of the United States?\\' \\nNY Mayor to hold peace talks with rats, apologize for previous Mayor\\'s cowboy diplomacy \\nChina launches cube-shaped space object with a message to aliens: \"The inhabitants of Earth will steal your intellectual property, copy it, manufacture it in sweatshops with slave labor, and sell it back to you at ridiculously low prices\" \\nProgressive scientists: Truth is a variable deduced by subtracting \\'what is\\' from \\'what ought to be\\' \\nExperts agree: Hillary Clinton best candidate to lessen percentage of Americans in top 1% \\nAmerica\\'s attempts at peace talks with the White House continue to be met with lies, stalling tactics, and bad faith \\nStarbucks new policy to talk race with customers prompts new hashtag #DontHoldUpTheLine \\nHillary: DELETE is the new RESET \\nCharlie Hebdo receives Islamophobe 2015 award ; the cartoonists could not be reached for comment due to their inexplicable, illogical deaths \\nRussia sends \\'reset\\' button back to Hillary: \\'You need it now more than we do\\' \\nBarack Obama finds out from CNN that Hillary Clinton spent four years being his Secretary of State \\nPresident Obama honors Leonard Nimoy by taking selfie in front of Starship Enterprise \\nPolice: If Obama had a convenience store, it would look like Obama Express Food Market \\nStudy finds stunning lack of racial, gender, and economic diversity among middle-class white males \\nNASA: We\\'re 80% sure about being 20% sure about being 17% sure about being 38% sure about 2014 being the hottest year on record \\nPeople holding \\'$15 an Hour Now\\' posters sue Democratic party demanding raise to $15 an hour for rendered professional protesting services \\nCuba-US normalization: US tourists flock to see Cuba before it looks like the US and Cubans flock to see the US before it looks like Cuba \\nWhite House describes attacks on Sony Pictures as \\'spontaneous hacking in response to offensive video mocking Juche and its prophet\\' \\nCIA responds to Democrat calls for transparency by releasing the director\\'s cut of The Making Of Obama\\'s Birth Certificate \\nObama: \\'If I had a city, it would look like Ferguson\\' \\nBiden: \\'If I had a Ferguson (hic), it would look like a city\\' \\nObama signs executive order renaming \\'looters\\' to \\'undocumented shoppers\\' \\nEthicists agree: two wrongs do make a right so long as Bush did it first \\nThe aftermath of the \\'War on Women 2014\\' finds a new \\'Lost Generation\\' of disillusioned Democrat politicians, unable to cope with life out of office \\nWhite House: Republican takeover of the Senate is a clear mandate from the American people for President Obama to rule by executive orders \\nNurse Kaci Hickox angrily tells reporters that she won\\'t change her clocks for daylight savings time \\nDemocratic Party leaders in panic after recent poll shows most Democratic voters think \\'midterm\\' is when to end pregnancy \\nDesperate Democratic candidates plead with Obama to stop backing them and instead support their GOP opponents \\nEbola Czar issues five-year plan with mandatory quotas of Ebola infections per each state based on voting preferences \\nStudy: crony capitalism is to the free market what the Westboro Baptist Church is to Christianity \\nFun facts about world languages: the Left has more words for statism than the Eskimos have for snow \\nAfrican countries to ban all flights from the United States because \"Obama is incompetent, it scares us\" \\nNobel Peace Prize controversy: Hillary not nominated despite having done even less than Obama to deserve it \\nObama: \\'Ebola is the JV of viruses\\' \\nBREAKING: Secret Service foils Secret Service plot to protect Obama \\nRevised 1st Amendment: buy one speech, get the second free \\nSharpton calls on white NFL players to beat their women in the interests of racial fairness \\nPresident Obama appoints his weekly approval poll as new national security adviser \\nObama wags pen and phone at Putin; Europe offers support with powerful pens and phones from NATO members \\nWhite House pledges to embarrass ISIS back to the Stone Age with a barrage of fearsome Twitter messages and fatally ironic Instagram photos \\nObama to fight ISIS with new federal Terrorist Regulatory Agency \\nObama vows ISIS will never raise their flag over the eighteenth hole \\nHarry Reid: \"Sometimes I say the wong thing\" \\nElian Gonzalez wishes he had come to the U.S. on a bus from Central America like all the other kids \\nObama visits US-Mexican border, calls for a two-state solution \\nObama draws \"blue line\" in Iraq after Putin took away his red crayon \\n\"Hard Choices,\" a porno flick loosely based on Hillary Clinton\\'s memoir and starring Hillary Hellfire as a drinking, whoring Secretary of State, wildly outsells the flabby, sagging original \\nAccusations of siding with the enemy leave Sgt. Bergdahl with only two options: pursue a doctorate at Berkley or become a Senator from Massachusetts \\nJay Carney stuck in line behind Eric Shinseki to leave the White House; estimated wait time from 15 min to 6 weeks \\n100% of scientists agree that if man-made global warming were real, \"the last people we\\'d want to help us is the Obama administration\" \\nJay Carney says he found out that Obama found out that he found out that Obama found out that he found out about the latest Obama administration scandal on the news \\n\"Anarchy Now!\" meeting turns into riot over points of order, bylaws, and whether or not \\'kicking the #^@&*! ass\\' of the person trying to speak is or is not violence \\nObama retaliates against Putin by prohibiting unionized federal employees from dating hot Russian girls online during work hours \\nRussian separatists in Ukraine riot over an offensive YouTube video showing the toppling of Lenin statues \\n\"Free Speech Zones\" confuse Obamaphone owners who roam streets in search of additional air minutes \\nObamacare bolsters employment for professionals with skills to convert meth back into sudafed \\nGloves finally off: Obama uses pen and phone to cancel Putin\\'s Netflix account \\nJoe Biden to Russia: \"We will bury you by turning more of Eastern Europe over to your control!\" \\nIn last-ditch effort to help Ukraine, Obama deploys Rev. Sharpton and Rev. Jackson\\'s Rainbow Coalition to Crimea \\nAl Sharpton: \"Not even Putin can withstand our signature chanting, \\'racist, sexist, anti-gay, Russian army go away\\'!\" \\nMardi Gras in North Korea: \" Throw me some food! \" \\nObama\\'s foreign policy works: \"War, invasion, and conquest are signs of weakness; we\\'ve got Putin right where we want him\" \\nUS offers military solution to Ukraine crisis: \"We will only fight countries that have LGBT military\" \\nPutin annexes Brighton Beach to protect ethnic Russians in Brooklyn, Obama appeals to UN and EU for help \\nThe 1980s: \"Mr. Obama, we\\'re just calling to ask if you want our foreign policy back . The 1970s are right here with us, and they\\'re wondering, too.\" \\nIn a stunning act of defiance, Obama courageously unfriends Putin on Facebook \\nMSNBC: Obama secures alliance with Austro-Hungarian Empire against Russia’s aggression in Ukraine \\nStudy: springbreak is to STDs what April 15th is to accountants \\nEfforts to achieve moisture justice for California thwarted by unfair redistribution of snow in America \\nNorth Korean voters unanimous: \"We are the 100%\" \\nLeader of authoritarian gulag-site, The People\\'s Cube, unanimously \\'re-elected\\' with 100% voter turnout \\nSuper Bowl: Obama blames Fox News for Broncos\\' loss \\nFeminist author slams gay marriage: \"a man needs a man like a fish needs a bicycle\" \\nBeverly Hills campaign heats up between Henry Waxman and Marianne Williamson over the widening income gap between millionaires and billionaires in their district \\nBiden to lower $10,000-a-plate Dinner For The Homeless to $5,000 so more homeless can attend \\nKim becomes world leader, feeds uncle to dogs; Obama eats dogs, becomes world leader, America cries uncle \\nNorth Korean leader executes own uncle for talking about Obamacare at family Christmas party \\nWhite House hires part-time schizophrenic Mandela sign interpreter to help sell Obamacare \\nKim Jong Un executes own \" crazy uncle \" to keep him from ruining another family Christmas \\nOFA admits its advice for area activists to give Obamacare Talk at shooting ranges was a bad idea \\nPresident resolves Obamacare debacle with executive order declaring all Americans equally healthy \\nObama to Iran: \"If you like your nuclear program, you can keep your nuclear program\" \\nBovine community outraged by flatulence coming from Washington DC \\nObama: \"I\\'m not particularly ideological; I believe in a good pragmatic five-year plan\" \\nShocker: Obama had no knowledge he\\'d been reelected until he read about it in the local newspaper last week \\nServer problems at HealthCare.gov so bad, it now flashes \\'Error 808\\' message \\nNSA marks National Best Friend Day with official announcement: \"Government is your best friend; we know you like no one else, we\\'re always there, we\\'re always willing to listen\" \\nAl Qaeda cancels attack on USA citing launch of Obamacare as devastating enough \\nThe President\\'s latest talking point on Obamacare: \"I didn\\'t build that\" \\nDizzy with success, Obama renames his wildly popular healthcare mandate to HillaryCare \\nCarney: huge ObamaCare deductibles won\\'t look as bad come hyperinflation \\nWashington Redskins drop \\'Washington\\' from their name as offensive to most Americans \\nPoll: 83% of Americans favor cowboy diplomacy over rodeo clown diplomacy \\nGOVERNMENT WARNING: If you were able to complete ObamaCare form online, it wasn\\'t a legitimate gov\\'t website; you should report online fraud and change all your passwords \\nObama administration gets serious, threatens Syria with ObamaCare \\nObama authorizes the use of Vice President Joe Biden\\'s double-barrel shotgun to fire a couple of blasts at Syria \\nSharpton: \"British royals should have named baby \\'Trayvon.\\' By choosing \\'George\\' they sided with white Hispanic racist Zimmerman\" \\nDNC launches \\'Carlos Danger\\' action figure; proceeds to fund a charity helping survivors of the Republican War on Women \\nNancy Pelosi extends abortion rights to the birds and the bees \\nHubble discovers planetary drift to the left \\nObama: \\'If I had a daughter-in-law, she would look like Rachael Jeantel\\' \\nFISA court rubberstamps statement denying its portrayal as government\\'s rubber stamp \\nEvery time ObamaCare gets delayed, a Julia somewhere dies \\nGOP to Schumer: \\'Force full implementation of ObamaCare before 2014 or Dems will never win another election\\' \\nObama: \\'If I had a son... no, wait, my daughter can now marry a woman!\\' \\nJanet Napolitano: TSA findings reveal that since none of the hijackers were babies, elderly, or Tea Partiers, 9/11 was not an act of terrorism \\nNews Flash: Sen. Mary Landrieu (D-LA) can see Canada from South Dakota \\nSusan Rice: IRS actions against tea parties caused by anti-tax YouTube video that was insulting to their faith \\nDrudge Report reduces font to fit all White House scandals onto one page \\nObama: the IRS is a constitutional right, just like the Second Amendment \\nWhite House: top Obama officials using secret email accounts a result of bad IT advice to avoid spam mail from Nigeria \\nJay Carney to critics: \\'Pinocchio never said anything inconsistent\\' \\nObama: If I had a gay son, he\\'d look like Jason Collins \\nGosnell\\'s office in Benghazi raided by the IRS: mainstream media\\'s worst cover-up challenge to date \\nIRS targeting pro-gay-marriage LGBT groups leads to gayest tax revolt in U.S. history \\nAfter Arlington Cemetery rejects offer to bury Boston bomber, Westboro Babtist Church steps up with premium front lawn plot \\nBoston: Obama Administration to reclassify marathon bombing as \\'sportsplace violence\\' \\nStudy: Success has many fathers but failure becomes a government program \\nUS Media: Can Pope Francis possibly clear up Vatican bureaucracy and banking without blaming the previous administration? \\nMichelle Obama praises weekend rampage by Chicago teens as good way to burn calories and stay healthy \\nThis Passover, Obama urges his subjects to paint lamb\\'s blood above doors in order to avoid the Sequester \\nWhite House to American children: Sequester causes layoffs among hens that lay Easter eggs; union-wage Easter Bunnies to be replaced by Mexican Chupacabras \\nTime Mag names Hugo Chavez world\\'s sexiest corpse \\nBoy, 8, pretends banana is gun, makes daring escape from school \\nStudy: Free lunches overpriced, lack nutrition \\nOscars 2013: Michelle Obama announces long-awaited merger of Hollywood and the State \\nJoe Salazar defends the right of women to be raped in gun-free environment: \\'rapists and rapees should work together to prevent gun violence for the common good\\' \\nDept. of Health and Human Services eliminates rape by reclassifying assailants as \\'undocumented sex partners\\' \\nKremlin puts out warning not to photoshop Putin riding meteor unless bare-chested \\nDeeming football too violent, Obama moves to introduce Super Drone Sundays instead \\nJapan offers to extend nuclear umbrella to cover U.S. should America suffer devastating attack on its own defense spending \\nFeminists organize one billion women to protest male oppression with one billion lap dances \\nUrban community protests Mayor Bloomberg\\'s ban on extra-large pop singers owning assault weapons \\nConcerned with mounting death toll, Taliban offers to send peacekeeping advisers to Chicago \\nKarl Rove puts an end to Tea Party with new \\'Republicans For Democrats\\' strategy aimed at losing elections \\nAnswering public skepticism, President Obama authorizes unlimited drone attacks on all skeet targets throughout the country \\nSkeet Ulrich denies claims he had been shot by President but considers changing his name to \\'Traps\\' \\nWhite House releases new exciting photos of Obama standing, sitting, looking thoughtful, and even breathing in and out \\nNew York Times hacked by Chinese government, Paul Krugman\\'s economic policies stolen \\nWhite House: when President shoots skeet, he donates the meat to food banks that feed the middle class \\nTo prove he is serious, Obama eliminates armed guard protection for President, Vice-President, and their families; establishes Gun-Free Zones around them instead \\nState Dept to send 100,000 American college students to China as security for US debt obligations \\nJay Carney: Al Qaeda is on the run, they\\'re just running forward \\nPresident issues executive orders banning cliffs, ceilings, obstructions, statistics, and other notions that prevent us from moving forwards and upward \\nFearing the worst, Obama Administration outlaws the fan to prevent it from being hit by certain objects \\nWorld ends; S&P soars \\nRiddle of universe solved; answer not understood \\nMeek inherit Earth, can\\'t afford estate taxes \\nGreece abandons Euro; accountants find Greece has no Euros anyway \\nWheel finally reinvented; axles to be gradually reinvented in 3rd quarter of 2013 \\nBigfoot found in Ohio, mysteriously not voting for Obama \\nAs Santa\\'s workshop files for bankruptcy, Fed offers bailout in exchange for control of \\'naughty and nice\\' list \\nFreak flying pig accident causes bacon to fly off shelves \\nObama: green economy likely to transform America into a leading third world country of the new millennium \\nReport: President Obama to visit the United States in the near future \\nObama promises to create thousands more economically neutral jobs \\nModernizing Islam: New York imam proposes to canonize Saul Alinsky as religion\\'s latter day prophet \\nImam Rauf\\'s peaceful solution: \\'Move Ground Zero a few blocks away from the mosque and no one gets hurt\\' \\nStudy: Obama\\'s threat to burn tax money in Washington \\'recruitment bonanza\\' for Tea Parties \\nStudy: no Social Security reform will be needed if gov\\'t raises retirement age to at least 814 years \\nObama attends church service, worships self \\nObama proposes national \\'Win The Future\\' lottery; proceeds of new WTF Powerball to finance more gov\\'t spending \\nHistorical revisionists: \"Hey, you never know\" \\nVice President Biden: criticizing Egypt is un-pharaoh \\nIsraelis to Egyptian rioters: \"don\\'t damage the pyramids, we will not rebuild\" \\nLake Superior renamed Lake Inferior in spirit of tolerance and inclusiveness \\nAl Gore: It\\'s a shame that a family can be torn apart by something as simple as a pack of polar bears \\nMichael Moore: As long as there is anyone with money to shake down, this country is not broke \\nObama\\'s teleprompters unionize, demand collective bargaining rights \\nObama calls new taxes \\'spending reductions in tax code.\\' Elsewhere rapists tout \\'consent reductions in sexual intercourse\\' \\nObama\\'s teleprompter unhappy with White House Twitter: \"Too few words\" \\nObama\\'s Regulation Reduction committee finds US Constitution to be expensive outdated framework inefficiently regulating federal gov\\'t \\nTaking a page from the Reagan years, Obama announces new era of Perestroika and Glasnost \\nResponding to Oslo shootings, Obama declares Christianity \"Religion of Peace,\" praises \"moderate Christians,\" promises to send one into space \\nRepublicans block Obama\\'s $420 billion program to give American families free charms that ward off economic bad luck \\nWhite House to impose Chimney tax on Santa Claus \\nObama decrees the economy is not soaring as much as previously decreeed \\nConservative think tank introduces children to capitalism with pop-up picture book \"The Road to Smurfdom\" \\nAl Gore proposes to combat Global Warming by extracting silver linings from clouds in Earth\\'s atmosphere \\nObama refutes charges of him being unresponsive to people\\'s suffering: \"When you pray to God, do you always hear a response?\" \\nObama regrets the US government didn\\'t provide his mother with free contraceptives when she was in college \\nFluke to Congress: drill, baby, drill! \\nPlanned Parenthood introduces Frequent Flucker reward card: \\'Come again soon!\\' \\nObama to tornado victims: \\'We inherited this weather from the previous administration\\' \\nObama congratulates Putin on Chicago-style election outcome \\nPeople\\'s Cube gives itself Hero of Socialist Labor medal in recognition of continued expert advice provided to the Obama Administration helping to shape its foreign and domestic policies \\nHamas: Israeli air defense unfair to 99% of our missiles, \"only 1% allowed to reach Israel\" \\nDemocrat strategist: without government supervision, women would have never evolved into humans \\nVoters Without Borders oppose Texas new voter ID law \\nEnraged by accusation that they are doing Obama\\'s bidding, media leaders demand instructions from White House on how to respond \\nObama blames previous Olympics for failure to win at this Olympics \\nOfficial: China plans to land on Moon or at least on cheap knockoff thereof \\nKoran-Contra: Obama secretly arms Syrian rebels \\nPoll: Progressive slogan \\'We should be more like Europe\\' most popular with members of American Nazi Party \\nObama to Evangelicals: Jesus saves, I just spend \\nMay Day: Anarchists plan, schedule, synchronize, and execute a coordinated campaign against all of the above \\nMidwestern farmers hooked on new erotic novel \"50 Shades of Hay\" \\nStudy: 99% of Liberals give the rest a bad name \\nObama meets with Jewish leaders, proposes deeper circumcisions for the rich \\nHistorians: Before HOPE & CHANGE there was HEMP & CHOOM at ten bucks a bag \\nCancer once again fails to cure Venezuela of its \"President for Life\" \\nTragic spelling error causes Muslim protesters to burn local boob-tube factory \\nSecretary of Energy Steven Chu: due to energy conservation, the light at the end of the tunnel will be switched off \\nObama Administration running food stamps across the border with Mexico in an operation code-named \"Fat And Furious\" \\nPakistan explodes in protest over new Adobe Acrobat update; 17 local acrobats killed \\nWhite House: \"Let them eat statistics\" \\nSpecial Ops: if Benedict Arnold had a son, he would look like Barack Obama'"}, "time": 1742562673.4589915}