{"duration": 0.04774975776672363, "input_args": {"text": "'On Monday, International Workers Day, protesters will fill the National Mall and the streets of cities elsewhere to protest what they call the federal government’s “deportation machinery” and to demand civil rights reserved for citizens be bestowed upon illegal immigrants. [The May Day protest by illegal aliens goes back to 2006 when “1. 5 million people took to the streets across the country to demand immigration reform,”   magazine The Nation reported on Friday.  Now, protesters aren’t asking for a pathway to citizenship. “Today, no one, not even immigrants rights advocates, is calling for immigration reform anymore,” Nation contributor Julianne Hing  wrote . “Immigrants and their allies are now defending civil rights like due process and values like democracy and inclusiveness. “The policy agenda is no longer about winning citizenship or even legal status for the nation’s 11 million undocumented immigrants,” the article said. “It’s about defending families from separation. ” This year’s march will also include other protesters opposed to President Trump’s    policies on immigration. “With the Trump administration intensifying attacks on Native Americans, immigrants, refugees, trans individuals, Muslims, women, people of color in general, and the poor, a coalition led by immigrants and workers is aiming to mark this year’s May Day with the biggest workers strike in over a decade,” The Nation article said. “One thing I’ve been struck by since the election is everyone is ready to see how these different movements intersect,” Jack Darin, director of the Illinois chapter of the Sierra Club said in the article, and he cited the Women’s March shortly after Trump’s inauguration as the prototype for their protest. “Our members see how our struggles and our goals intersect with these other constituencies. ” “It showed a lot of people at a moment when we really needed to see it that we were all in this together and combined, we really do represent the majority,” Darin said. “As immigrants our livelihoods, our futures, our families —  they’re all in danger,”   Cabrera, the director of communications at Coalition for Humane Immigrant Rights of Los Angeles (CHIRLA) said in The Nation article. “May Day presents an opportunity for us to not silence ourselves and to remain vigilant. ” Organizers behind the “Day Without Immigrants” protest in February are calling again for people to not report to work on Monday. “Activists in Scranton, Pennsylvania Raleigh, North Carolina and Newark, New Jersey and dozens of other cities have been calling for a   strike,” The Nation reported in an article entitled “How to Join the ‘Day Without Immigrants’ on May Day. ” “We believe that when the country recognizes it depends on immigrant labor to function we will win permanent protection from deportation for the 11 million undocumented immigrants the right to travel freely to visit our loved ones abroad, and the right to be treated with dignity and respect,” Movimiento Cosecha’s Maria Fernanda Cabello in a statement included in the article. “Immigrant, African American, LGBTQ, indigenous and women workers along with allies are striking on May 1,” the bsolid. org website states. “#may1strike is an invitation from the Food Chain Workers Alliance and SEIU USWW to build a General Strike on International Workers Day. Stand with us to pledge your participation   …     ” The website states that people said should not be silent when the government and corporations are escalating “immigration raids,” violating “Native sovereignty,” banning Muslims “because of their faith,” “criminalizing” black, brown and “trans people,” and “rapidly destroying the environment. ” “Opposing Trump is not enough,” the website states. “We must stop him. ”'"}, "time": 1742563808.8371077}