{"duration": 0.02010202407836914, "input_args": {"text": "'Amy Schumer’s latest   comedy special for Netflix, The Leather Special, has been inundated with   negative reviews on the streaming service, with viewers of the program calling it “awful,” “unfunny,” and “unwatchable. ”[The   special, which debuted on the streaming service on March 7, currently boasts an average rating of one star out of five.  “This past year, I’ve gotten very rich, famous, and humble,” Schumer says at the beginning of her unapologetically raunchy routine. She riffs about such subjects as how she came to grips with realizing her own beauty despite being called “very fat” by Hollywood honchos, and how “gun nuts” constantly fight against stricter firearms laws. A week after its release, however, The Leather Special is a critical flop. As The Federalist noted, of the   member reviews of the special currently posted on Netflix. com, more than 700 users gave it just one star. Some have even given the special zero stars. “Absolutely horrible. Amy is 1 special away from being broke and homeless. Female comics are the best! Amy is not,” one Netflix user wrote. “I’ve had migraines that were way funnier than this   performance. Very poor show,” another wrote. Schumer’s comedy special isn’t faring much better on The Internet Movie Database (IMDB). There, The Leather Special is currently holding a 5. 5 out of 10 rating. “I enjoyed her shows before, but Schumer was neither funny nor insightful in this special,” one IMDB user wrote.  “A huge swing and a miss. With the exception of the gun riff, she relied on old material focused mainly on her smelly body parts. Maybe that is why none of the big premier pay channels picked up this special. ” “Netflix will have to do better in the future choosing streaming material,” the user added. This was Schumer’s first special since 2015’s Live at the Apollo, which was nominated for two Emmy Awards.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562344.981028}