{"duration": 0.08289885520935059, "input_args": {"text": "'WASHINGTON  —   Democrats on the Senate Finance Committee sought to stall the confirmations of Steven Mnuchin and Tom Price, President Trump’s picks for Treasury secretary and secretary of health and human services, by refusing to attend scheduled votes on Tuesday. As Mr. Trump’s dramatic firing of his acting attorney general threw the capital into tumult, Democrats on Tuesday also seized on the contentiousness to try to block Senator Jeff Sessions’s nomination as attorney general because they said he was too close to Mr. Trump. In describing their tactic of boycotting the votes on nominees to Treasury and to health and human services, Senator Ron Wyden of Oregon said that recent news reports suggested Mr. Mnuchin and Mr. Price had given false statements in their nomination hearings. He said more information was needed before making judgments about the nominees. “We have made clear that we need additional information,” Mr. Wyden said. Senator Debbie Stabenow, Democrat of Michigan, assailed the nominees for failing to be honest with the committee. “The truth matters,” she said. “That’s not what has been happening here. ” Republicans expressed dismay at the delay. “I think this is a completely unprecedented level of obstruction,” said Senator Patrick J. Toomey, Republican from Pennsylvania. But with a Supreme Court vacancy nearing its   point after a long blockade by Republicans, Democrats were not exactly feeling the heat, at least not yet. During a   hearing before the Senate Judiciary Committee, Democrats painted Mr. Sessions as an extremist legal savant for Mr. Trump in support of   ideologies, while Republicans portrayed him as a   lawyer and    prosecutor who would enforce the law as written. “How could we possibly conclude that this nominee will be independent?” asked Senator Dianne Feinstein of California, the top Democrat on the Senate Judiciary Committee. She said that Sally Q. Yates, the former acting attorney general fired late Monday, showed “guts” and independence in refusing to defend Mr. Trump’s executive order banning immigrants from seven largely Muslim countries. “I have no confidence that Senator Sessions will do that,” Ms. Feinstein said. Democrats hope to turn the tumult into a referendum on Mr. Sessions, an Alabama Republican, and whether he would have the independence to serve as the nation’s chief law enforcement official after emerging as one of Mr. Trump’s closest advisers in the presidential campaign. Democrats are already calling it “the Monday night massacre” after Mr. Trump fired Ms. Yates, the acting attorney general, for refusing to defend his immigration order in court. Senator Charles E. Grassley of Iowa, the chairman of the Judiciary Committee, said in opening the hearing that there was still “no mystery” whether Mr. Sessions would be confirmed, since the Republicans hold a majority. He urged approval of Mr. Sessions as quickly as possible to restore leadership at the Justice Department. At Mr. Sessions’s nomination hearing this month, Democrats challenged him repeatedly about whether he would have the independence to stand up to Mr. Trump if the president veered into legally questionable terrain. Mr. Sessions assured the lawmakers that he would be able to “say no” to the president and would not be a “mere rubber stamp for the president. ” Mr. Sessions said he was not involved in drafting the contentious executive order on immigration. Republicans showed no sign of breaking rank as they defended Mr. Sessions, a friend of many senators who served alongside a number of them on the committee. The hearing evolved into dueling portraits of what Senator Patrick J. Leahy, Democrat of Vermont, called “two different people. ” Senator John Cornyn, the Texas Republican, scoffed at the “faux outrage” from Democrats who cast Ms. Yates’s stance as a “a   act of political courage. ” Democrats, he said, were unfairly making Mr. Sessions the target of their anger because they “still seem to be upset about the results of the election. ”'"}, "time": 1742562015.422239}