{"duration": 0.047183990478515625, "input_args": {"text": "'Since the day Donald J. Trump began his presidential campaign, there were questions about how the Trump brand would be affected. Would his stream of insults hurt viewership of “The Apprentice” or sales of Ivanka Trump shoes? Or was all the attention good for business, a marketing adage President Trump could have learned during his time as a reality television star. The answer may surprise him. Major companies appear to be   their relationships with the Trump brand, which, in some instances, does not appear to have benefited from Mr. Trump’s presidency. Hinting at lackluster sales, Neiman Marcus confirmed on Friday that it had dropped Ivanka Trump’s jewelry line from its website. A day earlier, her brand had disappeared from Nordstrom. com, a move  reported by the fashion news site Racked. Not everyone was happy that retailers were distancing themselves from the Trump name. By Saturday, some Twitter users were posting #BoycottNordstrom. Companies also seem worried about how protests over the president’s actions, particularly his recent executive order on immigration, could hurt sales. On Friday, MillerCoors, a brewing company, contacted Shannon Coulter, a founder of GrabYourWallet. org, a campaign pushing for boycotts of Neiman Marcus, Nordstrom and other businesses associated with the Trump name. “He wanted to talk about why they were on the list,” she said, adding, “I think all the companies are paying close attention. ” At a time when protests and boycotts can easily be organized online, brands face more pressure to respond to consumer demands. Chris Allieri, a marketing consultant with Mulberry  Astor, said, “Before he became president, I think that a lot of consumers were indifferent to the Trump brand. ” He added, “It’s going to be harder for people to ignore the connection. ” The MillerCoors name appeared on GrabYourWallet. org after Peter Coors, a board member of its parent company, Molson Coors, lent his name to a   for Mr. Trump in June. MillerCoors said it did not support candidates in presidential races but respected the rights of its workers to do so. “Boycotting our brands only harms   employees and their families and is counter to the positive progress that we should all be encouraging and delivering at a time when our nation seems so divided,” Marty Maloney, a spokesman, said. Mr. Trump and his daughter have stepped away from executive roles at the Trump Organization, which still earns money from golf courses, hotels and other properties around the world. (Ms. Trump has also stepped away as head of her brand.) Because Mr. Trump’s company is privately held, it is hard to know what impact his presidency has had on his businesses. But the merchandise side of the Trump licensing empire may be more vulnerable to negative attention. “Retailers around the country are going to say, do we need the aggravation or not,” said Wendy Liebmann, chief executive at WSL Strategic Retail, a consulting firm. “It’s hard to imagine that if a brand is really, really doing well, a retailer like a Nordstrom or Neiman Marcus would cut off their nose to spite their face. ” Rosemary K. Young, senior director of marketing for Ms. Trump’s brand, said in a statement that the company keep expanding and that it had “significant”    revenue growth in 2016. Representatives for Macy’s, which sells Ms. Trump’s clothing, handbags and shoes, did not respond to requests for comment. The retailer dropped Mr. Trump’s clothing line early in his campaign after he called Mexican immigrants “killers” and “rapists. ” Companies have also faced pressure to back away from “The Apprentice” franchise, of which Mr. Trump is an executive producer. Kawasaki said last month that it would pull its sponsorship, though the Japanese company seemed to backtrack somewhat within hours. Ms. Coulter said the Honest Company, whose products will appear in an episode of “The New Celebrity Apprentice,” had committed not to advertise for the rest of the season or next year. The brand confirmed that it had limited involvement with the show, which has not yet been renewed for 2018. In addition to possibly repelling some advertisers, Mr. Trump’s association with the show does not appear to have helped viewership much. On Thursday, he asked people  —   perhaps jokingly  —   to pray for the company’s ratings at the National Prayer Breakfast in Washington. Mr. Allieri, who backed Hillary Clinton’s presidential campaign, said, “If you’re looking for a good opportunity to advertise, I would look beyond ‘The Apprentice,’ because there’s not going to be an upside. ” As the Trump name became politicized so have brands associated with it. Just days after #DeleteUber began trending on Twitter  —   a response to criticism that the   app had undercut protests of Mr. Trump’s immigration order  —   Uber’s chief executive, Travis Kalanick, resigned from a presidential economic advisory council. Nordstrom, which mainly sold Ivanka Trump shoes, said demand for Ms. Trump’s products had not been strong. The company still has some merchandise from previous orders that it plans to sell in stores. For the time being, the relationship appears to have ended. Neiman Marcus said it “continuously” assesses productivity to determine where its products are sold. Some jewelry will still be available in the stores. After apparel, Ms. Trump’s shoes account for the largest portion of her company’s revenue. Three years ago, the brand predicted that shoe sales would reach $35 million last year at wholesale, generating $2 million in royalty fees, according to documents obtained by The New York Times. Jewelry was predicted to reach $7. 5 million, or $300, 000 in fees. At the time, Ms. Trump seemed to be having more trouble with Mondani, which makes her handbags. “We think the handbags are terrible,” the documents said. “They don’t. ” A spokesman for Ms. Trump’s brand said, “We are fortunate to have dedicated and engaged partners on our handbags and all of our product categories. ” Representatives for Mondani did not respond to requests for comment.'"}, "time": 1742628469.1014447}