{"duration": 0.03267383575439453, "input_args": {"text": "'One in four people fantasize about A. I. virtual assistants, including Apple’s Siri and Amazon’s Alexa, according to a new survey. [“The ‘Speak Easy’ study  —   based on the responses of over 1, 000 UK smartphone owners aged 18+ and 100 Amazon Echo owners  —   was published on Wednesday by advertising agencies JWT and Mindshare,” reported Business Insider on the survey. “It’s not clear what percentage of respondents were men and what percentage were women. ”  “The study also found that 37% of voice technology users ‘love their voice assistant so much that they wish it were a real person. ’” they continued, adding that “Clearly some humans are finding themselves very attached to their voice assistants. ” The survey also discovered that 88% of UK smartphone users surveyed had used voice technology services, or would consider doing so in the future. “We are on the cusp of a new era in technology where voice is set to become mainstream,” said Elizabeth Cherian, a director at JWT. “Our research shows that 88% of UK smartphone users have used voice technology or would consider doing so in the future. ” “To successfully integrate voice into their offerings, brands need to understand how the technology can simplify everyday tasks by adding value and removing friction from their experience,” she continued. “This is not about tech for tech’s sake. Thoughtful and helpful interactions which genuinely enhance the experience will drive engagement and deeper relationships between consumers and brands. ” Last year, it was also reported that sexual conversations with A. I. were on the rise, with one company CEO claiming that his virtual assistant “Robin” is used by “teenagers and truckers without girlfriends” for up to 300 conversations a day. “This happens because people are lonely and bored,” said Robin Labs chief executive Ilya Eckstein. “It is a symptom of our society. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628373.7222972}