{"duration": 0.11178040504455566, "input_args": {"text": "'ReadyNutrition Guys and Gals, Thanksgiving is upon us. Does that sound kind of bad? Perhaps the phrase is indelibly etched in my mind as I think about a 20-pound turkey “lurking” in the refrigerator for the next two weeks, and turkey-everything to eat…turkey sandwiches, turkey for every meat dish, turkey omelets. Needless to say at JJ’s place, the cats will eat really well when that happens. This year will be different: The turkey here will be about a 10 pounder and that will go quickly.\\nI like to either deep-fry or smoke the turkey, and the Brinkmann smoker is one of my best friends in this endeavor. Yes, all of the accouterments will be there: the mashed potatoes will be grilled in the smoker and then mashed, the vegetables all thrown in there with extra braising to keep them from drying out. Everything except sweet potatoes, which I hate. The stuffing I make myself, with this as my recipe:\\nJJ’s Stuffing Recipe 2 loaves of wheat bread, dried out on racks for three days and cubed 1 head of celery 1 large onion 1/2 pound of butter (you can use more) Salt and pepper to one’s wishes Sage, in copious (blinding) amounts – 1 cup or more Turkey “base” or grease…yes, JJ uses the grease as opposed to something healthier Water (about 2 cups) After cutting the dried bread into cubes and setting this aside, sauté your head of celery, chopped to pieces about 1/4 inch or less, in one of the sticks of butter in a large pot, adding the chopped onions just before the celery softens. Then melt another stick of butter, and then add your seasonings listed (never enough Sage), and the bread cubes. Mix them all together well with half of the turkey grease, and then pour it all out into a large aluminum deep-dish pan. Pour in your two cups of water and the rest of the turkey grease, and mix well once again. Cover the pan with foil and vent the ends. Either throw it in the Brinkmann for three hours or in your oven for an hour to an hour and a half at 350 degrees. Comes out really good!\\nSo we’re all going to eat about the same thing at the same time! But I wish to bring to your attention what it’s really about. Thanksgiving this year? We can make it about just making it through a very rough year indeed, with the fact that we actually have a chance as a nation. When you spend the meal together, look at all of the members of your family…fellow Americans…and are thankful for being together this year with one another. Each new year is a new chance with them and another good memory of time together.\\nEat well and enjoy the day. It’s actually my favorite holiday. All of our readers and commenters out there, you enjoy that day and keep it with you even after the holiday is over. May God bless you and your families in all that you do, and restore and strengthen all of you together. Happy Thanksgiving, don’t burn the stuffing (you have to keep checking on it), and thank you for all of your letters and for reading ReadyNutrition’s pages. On Black Friday, I don’t venture out of the house, because there’s still plenty to eat and it’s safe. On Thanksgiving, I’ll also be raising my egg-nog in a toast to all of you, and thanking you for all of your great support, input, and readership. Happy Thanksgiving and all of the best! God bless!\\nJJ \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 23rd, 2016 Oh What Do You Do With The Leftovers? Is Thanksgiving food killing you? The Thanksgiving Club Sandwich Pad Your Pantry: How to Preserve Your Thanksgiving Leftovers 10 Dehydrator Meals for Your Prepper Pantry '"}, "time": 1742561958.6886096}