{"duration": 0.07459664344787598, "input_args": {"text": "'Era of Wisdom October 27, 2016 \\nBrandon Turbeville took a trip to Lebanon, and almost made it to Syria last month, to report on what is really going on. \\nHe observed no chemtrails in Lebanon. He said food is generally cheaper there than in the United States, and it is some of the the most flavorful food he has ever eaten. \\nUpon arriving back in the United States, he noticed a sickly, tired, generally unwell state of being in Americans, compared to the people who seemed full of life in Lebanon. He described feeling ill for days trying to re-acclimate to the “American diet.” \\nThis is part two of the interview, part one can be found here . \\nHe observed no chemtrails in Lebanon. He said food is generally cheaper there than in the United States, and it is some of the the most flavorful food he has ever eaten. \\nUpon arriving back in the United States, he noticed a sickly, tired, generally unwell state of being in Americans, compared to the people who seemed full of life in Lebanon. He described feeling ill for days trying to re-acclimate to the “American diet.” \\nBrandon Turbeville is a journalist with Activist Post , and he has his own website which you can find her e. He is also the vice editor and a contributor at Era of Wisdom , and you can find an excellent interview with Brandon and James Corbett of the Corbett Report at this link . \\n\\nThis article ( “Kindest People You’ve Ever Met”: American Journalist Describes Lebanon, Syrian Attitude After Trip ) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to Era of Wisdom.org . This entry was posted in propaganda . Bookmark the permalink . ← “The Fed Failed ….” And that Changes Everything David S \\nIf you can find it, I would highly recommend watching the PBS series Rick Steve’s Europe – specifically his shows on Iran. What becomes clearly obvious is that when war is sought by the powers that be, and the powers that profit from death and destruction, the propaganda machine goes into full demonization mode. As can be seen in the show, the people of Iran are warm, wonderful people, just like Americans, who simply wish to live their lives in peace, and would likely be much happier if not for the horrible government they have to live under (just like Americans – and I am not distinguishing between democrat and republican in my condemnation – they are BOTH THE SAME). When war is sought, EVERY member of the target group becomes Hitler or worse. The same was done with the Japanese, the Germans, the Italians, and for decades the Soviets. But really, who is the most horrible of the horrible in any society? The government of course. But the government is RARELY the target of the bombs, the missiles, or the occupation and destruction. But hey, they’re just Huns, Gooks, Chinks, Japs, Rag heads, sand niggers, camel jockies, etc……right??? So who cares how many of them get blown to pieces. Well of course that is how Halliburton, Lockeed, the banksters, the Military-Industrial-Congressional complex, etc. want you to think, and thankfully the boot-licking compliant mainstream media is more than happy to paint whatever horrible picture of the country as is needed to engender those feelings. Donate'"}, "time": 1742561983.60774}