{"duration": 0.06487751007080078, "input_args": {"text": "'Every nation is free to vote for the political leaders it wants, said Pope Francis Saturday, while Europe itself is in danger of “falling apart. ”[“Every country is free to make the choices it believes are right for itself. I cannot judge if it is making this choice for this reason or another, because I do not know its internal politics,” Francis said, in reference to the upcoming French presidential elections.  We must “respect people’s opinions, honest opinions of a political discussion,” he said. During the return flight from Egypt to Rome on Saturday, the Pope granted a press conference to the journalists aboard the papal flight, during which he was asked about the populist movements expanding in Europe. Virginie Riva of the French group, “Radio Europe 1,” made direct reference to the French presidential elections, claiming that French Catholics “are being forced to vote for either a populist or an extremist, and they are divided and confused. ” Late last month, a first round of elections reduced the list of presidential candidates to Marine Le Pen of the Front National party and Emmanuel Macron of the “En Marche!” party. The final,   vote will take place on May 7. Francis confessed that “I do not understand French internal politics,” but repeated the principle that every country is free to make the choices it believes are right for itself. “I have worked to have good relations, including with the current President, with whom there was a difficulty once, but afterwards I was able to speak clearly with him about the issue, while respecting his viewpoint,” the Pope said. “I do not know the history of the two candidates [Le Pen e Macron] I do not know where they are from,” he added. “Yes, I do know that one is a representative of the far right, but the other candidate, I truly do not know where he is from,” he said. “For this reason, I cannot offer a clear view on France. ” The Pope said that he was recently asked why there is not a Catholic political party, a proposal that the Pope found impractical and anachronistic. “This man is good, but he is living in the last century!” Francis said, referring to the person who made the suggestion. The Pope also reflected on the future of Europe, as he has done on other occasions. “Europe is in danger of coming undone this is true,” he said. “There is a problem that frightens Europe and perhaps increases populism: the problem of migration. This is true,” he said. “But let us not forget that Europe is made of migrants: centuries and centuries of migrants  …     that’s us!” “But it is a problem that must be studied well, and we must also respect people’s opinions, honest opinions of a political discussion with a capital “P”: great Politics, not the small national politics that eventually end up falling down,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742562907.389785}