{"duration": 0.12182927131652832, "input_args": {"text": "'When Dan Diamond was 12, his mother gave him a book titled “It All Begins With a Date: Jewish Concerns About Intermarriage. ” At the time, it seemed a bizarre gift for someone so young, but its aim was clear. Mr. Diamond was expected to marry a Jewish woman one day and raise Jewish children, a view his mother later reinforced, he said, by asking the religion of every girl he dated. Then, in November 2012, Mr. Diamond, a psychotherapist, met Ashley Mask, a doctoral student researching art museum education. At that time, Ms. Mask had started to reconnect with her Presbyterian upbringing. But after falling in love with Mr. Diamond, she agreed, should they marry, to raise their future children as Jewish. “I had this naïve sense that since we had the same creation story, it wouldn’t be hard,” said Ms. Mask, 38. But it was. As the relationship progressed, she feared abandoning important holiday traditions. At synagogue services, she said, she felt lost. She worried she would always be an outsider. Interfaith couples represent a swiftly rising demographic. Before 1960, only 19 percent of American married couples were of two different religions, according to a 2015 study by the Pew Research Center. Today, it’s nearly 40 percent. As a result, there are a number of new programs providing support to these couples. Given that a 2013 Pew study reported that since 2000, 72 percent of   Jews have married outside their faith, it is not surprising that many of the resources are sponsored by Jewish organizations. “There’s a deep fear in the Jewish community about losing Jews, about assimilation,” Mr. Diamond said. He and Ms. Mask chose to work through some of their issues by signing on with Honeymoon Israel, an organization in Buffalo that offers interfaith partners, including gay and lesbian couples, subsidized   trips to Israel. The trips cost $1, 800 a couple  —   or about 20 percent of the total cost  —   with the remainder picked up by a Jewish family foundation in Boston (which prefers to be unnamed) as well as by Jewish organizations in the cities where Honeymoon Israel operates. Once in Israel, the couples, who are organized into groups of 20, are encouraged to explore Jewish culture and religion. They stay in upscale hotels, lounge by the Mediterranean and visit Jewish, Christian and Muslim historic sites. They also bond with their fellow travelers, other committed couples also struggling to figure out what role religion should play in their marriages, their homes and in the lives of their future children. “The train has left the station,” said Avi Rubel, a founder of Honeymoon Israel, which expects to send 360 couples this year. Mr. Rubel said the program has no political or religious agenda. “We don’t care what you believe in,” he said. “You married into our family, so you’re in our family. We want couples to explore the issues on their own terms. We’re not trying to dictate how anybody feels about being Jewish or about Israel. ” Ms. Mask and Mr. Diamond went to Israel in February, three months after their wedding, with the first group organized out of New York City. Ms. Mask was especially relieved to meet so many other Christians in her situation. “It helped address this fear that I will lose part of my identity,” she said. For Mr. Diamond, the trip “was all about an   to the idea that there are many kinds of Jewish families,” he said. “That’s not something I’ve been exposed to most of my life: a celebration instead of a grudging acceptance. ” Seth Preminger, 31, and Tracy Lyons, 30, each assumed they would marry within their own faiths. Dr. Preminger, a child and adolescent psychologist in Chicago who was raised Jewish, and Dr. Lyons, a pediatrician in Chicago who was raised Catholic, met in July 2011. “As a little girl, the only thing I’d ever planned for my wedding was what church I’d get married in and what church music I’d have,” Dr. Lyons said. Neither realized how stressful planning an interfaith wedding would be. The Catholic clergyman who agreed to be an officiant wanted to marry them in a church, but that made Dr. Preminger uncomfortable. It was difficult to find a rabbi willing to be part of a joint ceremony. After much searching with Google, they found the Interfaith Family School in Chicago, run by Catholics and Jews. The school, which offers a     curriculum for children whose families consider themselves “both,” and which also has a couple’s counseling group, invited Dr. Lyons and Dr. Preminger to attend a student presentation. “It was really exciting for us to hear these kids talk about growing up in an environment that supports both faiths, especially as we were planning our wedding,” Dr. Lyons said. “They help you explain the different traditions to extended family. ” Dr. Preminger said their wedding in May 2015 at the Kenmare Loft, a former factory in Chicago, raised a few eyebrows, but everyone eventually came around. Another organization, InterfaithFamily, which is overseen by rabbis, demonstrates the ripple effect of this new attitude. The nonprofit started as a website, interfaithfamily. com, to help couples plan interfaith weddings and find rabbis willing to jointly officiate ceremonies. Within the last five years, the organization has opened offices in eight cities, where the group hosts couples discussion groups, religious services and social events. “Couples need safe spaces to be with others just like them,” said Rabbi Ari Moffic, who heads the Chicago branch. “If you Google ‘interfaith marriage,’ you’ll still find negative headlines. ” “The American Jewish community sees this as a public concern for Jews at large,” said Helen Kim, an associate professor of sociology at Whitman College in Walla Walla, Wash. “They want to mobilize the larger community. ” Dr. Kim is a     who was raised without religion and adopted Judaism after marrying Noah Leavitt, an associate dean at Whitman. The couple recently wrote a book, “JewAsian: Race, Religion, and Identity for America’s Newest Jews. ” There are no hard statistics, but Dr. Kim, who said she has noticed a rise in   marriages, has also found that Asians in the United States, who are mostly Christian, aren’t concerned about “dilution of the population” the way Jews are. On balance, there are fewer resources for couples seeking a more equitable arrangement. Many organizations “say they’re friends of interfaith, but they have a tiny asterisk that says, ‘We want you to have a Jewish home,’” said Eileen O’Farrell Smith, the founder and director of the Interfaith Union, which holds workshops for   and   couples in Chicago. In New York, a group called Interfaith Community runs couples workshops, private counseling sessions and an elementary school curriculum that teaches the fundamentals of Judaism and Christianity for interfaith families. “In this multicultural, global, diverse world, where people are bringing many differences into a family, the old   War II paradigm, where you married the boy next door and everyone went to the same church, has completely changed,” said Sheila Gordon, the group’s president. Some 100 children are enrolled in Interfaith Community’s educational programs, Dr. Gordon said, but the number of couples in the premarital workshops has declined, even as the percentage of interfaith marriages has increased. At least for younger couples, “the millennial ethos of fairness and respect means they don’t feel threatened by entering into this kind of partnership,” she said. So these couples do not think workshops are necessary. And yet, such programs can be vital for some couples, who do face challenges in joining different faiths. “It helps to know other people in the same boat,” said Kamran Khan, a Muslim who joined Ms. O’Farrell Smith’s group with his Christian fiancée, Corinne Atty. Their wedding, planned for September in Chicago, has caused a rift, with Mr. Khan’s parents disapproving of his relationship and refusing to talk about it or to attend the wedding. But Mr. Khan wants to discuss the difficult questions with Ms. Atty now, “instead of seven years from now,” he said. Being a part of the   group at Interfaith Union, he added, has given him a sense of pride about creating a different kind of family. “We can blaze a trail for others,” Mr. Khan said. “We’re at the forefront of something. ”'"}, "time": 1742562671.3387752}