{"duration": 0.05428361892700195, "input_args": {"text": "'Transgender lifestyles and   relationships should be ‘promoted’ to children as young as two to reduce hate crime, the National Union of Teachers (NUT) has said. [Delegates at the union’s national conference in Cardiff on Monday voted for its members to teach about ‘LGBT+’ issues and lifestyles to toddlers starting from nursery school.  Teachers bemoaned a “lack of policies which promote LGBT+ within schools” which they allege has a “significant negative impact” on the   of students and teachers who are homosexual or transgender. It was revealed last month that primary schools will likely be legally obliged to teach pupils about   couples as part of the mandatory relationships curriculum that is due to begin from 2019. But the NUT says the amendment to the Children and Social Work Bill doesn’t go far enough, calling for “  content” on the subject at an even younger age, and for secondary school pupils to be taught more about safe sex in gay relationships. NUT executive committee member Annette Pryce slammed a “right wing, religious lobby” which she blamed for having prevented ministers from proposing a more “inclusive” agenda for sex education. “Generations of young LGBT+ people who have been failed by the system are still not told explicitly in the law that their lives are important too,” Pryce said. They urged ministers to make proposed sex and relationship education (SRE) “inclusive” to so that lesbian, gay, bisexual, and transgender students “are told explicitly in the law that their lives are important too”. “It is high time that PSHE and SRE  —   including LGBT+ education  —   is recognised as an essential part of the school curriculum,” NUT general secretary Kevin Courtney told the conference. “It is important for a modern   society to understand and embrace differences within our communities. “The alternative is many pupils being isolated, bullied or misinformed and, for many, there is an impact on health and   that can last well beyond school years,” he warned. While teaching sex and relationships is not compulsory for nurseries, it is thought that NUT members working in daycare facilities for two to    could introduce it voluntarily. The Church of England announced that they support the introduction of statutory sex education in schools, and Archbishop of Canterbury Justin Welby has previously said that children should be taught to “revere” and “honour” LGBT people despite the Church’s   teaching that homosexual acts are a sin. Chief executive at Christian Concern Andrea Williams, however, argued that teaching sex and relationships education (SRE) to    would be “devastating” and risks “robbing them of their innocence”.'"}, "time": 1742563069.2271805}