{"duration": 0.15898656845092773, "input_args": {"text": "'Veteran financial journalist John Carney made his debut appearance as a Breitbart News commentator on Thursday’s edition of Breitbart News Daily to discuss the historic rise of the Dow Jones average above 20, 000 points. [Carney cheerfully veered off topic five seconds into his talk with SiriusXM host Alex Marlow, expressing his fascination with the current discussion of voter fraud, and wondering how anyone can claim there is “no evidence” of a problem the authorities resolutely refuse to study in a serious way.  “How would they know whether there’s illegal voting, when you don’t have to show an ID?” he asked. “They say there’s no evidence. How would anybody know? Who’s been investigating? There’s no evidence because nobody’s been looking. ” “I vote here in New York. Nobody checks IDs. You just walk in, you give them your address, and you go on in and vote,” he said. “It would be really easy for there to be voter fraud. ” Marlow recalled the infamous  —   but evidently not infamous enough  —   incident in 2012 when an undercover filmmaker working for James O’Keefe was handed Attorney General Eric Holder’s ballot. “I cover Wall Street, and one thing we know about Wall Street  —   and it applies to everything  —   but when we make fraud really easy, fraud always happens,” Carney pointed out. “That’s a rule. If fraud is easy, fraud occurs. ” Marlow noted that while the media obsess over President Trump’s claim that millions of illegal votes were cast in the 2016 election, the Dow hit 20, 000, and everything “seems to be going Trump’s way. ” “And now he’s got the media focused on basically defending themselves for not covering this widespread fraud, and it’s a fraud not just in a literal sense, but also in the figurative sense, that the mainstream media has allowed this to happen because they have shown no interest in voter integrity,” Marlow said. “You would think this would be a huge story, but of course, it’s one that wasn’t in the interests of the mainstream media to cover, so they ignored it,” Carney agreed. “It’s yet another one of these stories that, I think, is going to wind up being one of the greatest unreported stories  —   that now we’ll get to the bottom of this. ” As Carney has assumed the lead role in Breitbart News’ financial and economic coverage, Marlow was most eager for his thoughts on the historic stock market high. “It’s a big deal. It’s a big milestone that reminds us how far we’ve come, just since election week,” Carney said. “The Dow Jones Industrial Average is up 9. 5 percent just since Election Day, which is a big deal. ” “Just to give a sense, on average, the SP  —   which is a broader index, the SP 500, more stocks  —   is up about 7. 4 percent. On average, it’s about 7 percent a year,” he noted. “In just a couple of months since Election Day, we’re up what we usually do in about a year. Investors are very excited about the changes they see coming. ” As Marlow observed, this is the exact opposite of what many in the press predicted would occur after Trump won the election. “I’m divided in my own mind about whether it was just pure scare tactics or the bias of both the press and a lot of economists,” Carney said. “There were very prominent economists who were saying if Donald Trump is elected, the stock market will fall ten, fifteen percent. Beforehand, I understood this didn’t make any sense, and there were some of us out there saying no, why would the stock market fall? It will rise if you get a guy who’s going to pare back government regulation and cut taxes. ”  “This is actually what we’re seeing now,” he asserted. “There’s a sort of hope reborn. Economists are actually now moving up their economic expectations. Everybody from the Federal Reserve now expects the economy to grow a little bit faster. The International Monetary Fund, of all places, has said they think under Trump, the economy will grow faster. ”  “Investors had gotten very used to the idea that projections about where the economy was going were going to keep being lower and lower and lower,” he explained. “Ever since the great financial crisis, we would begin each year with some sort of rosy expectations, and then everybody would say, “Oh no, it’s going to be worse.’ For the first time in a long time, we’re actually seeing people move up their economic expectations. When it comes to the stock market, that translates into investors seeing more upsides than downsides. ”  “In other words, people are willing to look at the future and say, ‘You know what? I think the risk is that we do better than we thought, rather than worse, which translates into higher stock prices.’ The   term for this is just: people have hope again,” Carney said. Carney said Trump’s proposed tax cuts were one of the major policy initiatives driving this sense of renewed optimism in the markets. “If you cut the corporate tax rate, that just translates directly into higher earnings for companies,” he noted. “Another is the possibility of companies being able to move,” he continued. “You know, we’ve been hearing for years about how companies hold all this money abroad because they’re afraid to repatriate it, reinvest it in the U. S. economy, because they’re going to get a big tax hit. Well, if we cut taxes, a lot of that money can come back, get reinvested in expanding business in the U. S. which means more jobs, and, more importantly, better jobs for the American people. When the American people have better jobs, that means they can spend more, buy more, save more, and invest more. So there’s a sort of virtuous cycle going on here where that pushes up stocks. ” Carney also saluted Trump’s cabinet picks as being people who don’t “see business as the enemy. ” “These are guys who think that one of the things we need to do is remove some of the regulatory barriers that stand in the way of Americans expanding their businesses, starting their own businesses. That is really helping fuel this enthusiasm about the economy, and, therefore, about the stock market,” he said. Marlow pointed out that Trump has been criticized precisely for putting “too many Wall Street guys” in his cabinet, making it look like “a Goldman boardroom. ” “There’s something funny about that, right?” Carney responded. “A lot of the guys who they say are Wall Street guys or Goldman guys haven’t been on Wall Street or at Goldman for a long time. Steve Mnuchin, the Treasury Secretary nominee, he hasn’t touched Goldman Sachs for a long time. A guy very familiar to Breitbart people, Steve Bannon  —   yeah, he was at Goldman at one point, but that was ages ago. So a little bit of that is phony. ”  “There are guys actually direct from Goldman, like Gary Cohn was president, he was the number two guy at Goldman. You know what? I think that it’s actually a sign of, rather than Donald Trump being sort of   by Wall Street, Wall Street being   by Donald Trump,” he mused.  “In other words, Goldman wasn’t a friend of Donald Trump’s before he got elected, but now these guys are saying, ‘You know what? Let’s be a part of what’s happening in the American economy. This is a really exciting time. I want to be a part of this.’ So I welcome it,” he said. “Rather than standing in opposition, I think there was a lot of fatalism,” Carney theorized. “People said, ‘Yeah, we’re going to get on Hillary Clinton’s side because we think it’s just going to be another eight years of Obama followed by the Clintons.’ They see change in the air, and they say, ‘You know what? Let’s get on board. ’” Carney anticipated that markets would “continue to go higher. ” “After we hit 20, 000 yesterday, we stayed above 20, 000. We’re set to go even higher today,” he pointed out. “Today is my birthday, so I look at this almost as a birthday gift for me. We’re going to open for the first time higher than 20, 000 on my birthday, and it’s largely because we elected a guy who is going to improve the American economy, and it’s going to just keep happening. It’s a very helpful sign, not just for investors. Investors are enthusiastic because they believe the economy is getting better. We’ve thrown off the slow growth of the last eight years, and we’re set for something better. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742564109.1553342}