{"duration": 0.0723114013671875, "input_args": {"text": "'Hollywood actor and Guardians of the Galaxy star Chris Pratt apologized in sign language to deaf people last week after he said “turn up the volume” during a video. [Pratt encouraged viewers to “turn up the volume and not just read the subtitles,” during an Instagram video, which are muted on the platform by default. Pratt made the comment in the context of hoping Instagram users would stop and watch the video, instead of just scrolling past the silent clip. The video was removed shortly after.  In the apology video, which was made using American Sign Language, Pratt expressed regret for making “incredibly insensitive to the many folks out there who depend on subtitles. ”  Instagram does this thing where it mutes all the videos it shows and forces you to turn on the volume in order to hear them. (maybe because most people are watching those videos at work when they should be working and don’t want to get caught. I know that’s when I do it. 😬) So when I made a video recently with subtitles, and requested that people turn up the volume and not just ”read the subtitles” it was so people wouldn’t scroll past the video on mute, thus watching and digesting the information in the video. HOWEVER, I realize now doing so was incredibly insensitive to the many folks out there who depend on subtitles. More than 38 million Americans live with some sort of hearing disability. So I want to apologize. I have people in my life who are   and the last thing in the world I would want to do is offend them or anybody who suffers from hearing loss or any other disability. So truly from the bottom of my heart I apologize. Thanks for pointing this out to me. In the future I’ll try to be a little less ignorant about it.  Now  …     I know some of you are going to say, ”Hey! Chris only apologized because his publicist made him!” Well. That is not the case. As always I control my social media. Nobody else. And I am doing this because I’m actually really sorry. Apologies are powerful. I don’t dole them out  . This is one of those moments where I screwed up and here’s me begging your pardon. I hope you accept my apology.  And on that note. Why doesn’t Instagram have some kind of technology to automatically add subtitles to its videos? Or at least the option. I did a little exploring and it seems lacking in that area. Shouldn’t there be an option for closed captioning or something? I’ve made them lord knows how much money with my videos and pictures. Essentially sharing myself for free. I know they profit. So  …     GET ON IT INSTAGRAM! !! Put closed captioning on your app. #CCinstaNow, A post shared by chris pratt (@prattprattpratt) on May 4, 2017 at 5:59am PDT,  “More than 38 million Americans live with some sort of hearing disability  …     I want to apologize. I have people in my life who are   and the last thing in the world I would want to do is offend them or anybody who suffers from hearing loss or any other disability,” declared Pratt. “In the future I’ll try to be a little less ignorant about it. ” Pratt also finished off his video by encouraging Instagram to integrate closed captioning to videos on their platform. “Why doesn’t Instagram have some kind of technology to automatically add subtitles to its videos? Or at least the option,” he asked. “I did a little exploring and it seems lacking in that area. Shouldn’t there be an option for closed captioning or something?” “I’ve made them lord knows how much money with my videos and pictures. Essentially sharing myself for free,” Pratt continued. “I know they profit. So  …     GET ON IT INSTAGRAM! !! Put closed captioning on your app. #CCinstaNow. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563877.8883462}