{"duration": 0.07691287994384766, "input_args": {"text": "'Frank Ancona, the professed leader of the Traditionalist American Knights of the Ku Klux Klan, was shot and killed in Missouri last week in what officials called a “tragic and senseless act of violence. ” His wife and stepson were charged in his death on Monday. His body was found on a riverbank on Saturday with gunshot wounds to the head, according to the Washington County coroner, Brian DeClue, who called the death a homicide. In an interview, he said that Mr. Ancona, 51, was killed with “a shotgun of some sort. ” Jerrod Mahurin, the prosecutor in the case, said Mr. Ancona was also shot in the head with a   handgun. On Monday, Mr. Ancona’s wife, Malissa Ancona, 44, and stepson, Paul Jinkerson Jr. 24, were charged with a range of crimes in connection with the killing, including   murder and the abandonment of a corpse, according to the St. Francois County Sheriff’s Department. The sheriff said Mr. Ancona was killed at his home last Thursday, and his body was then left at a remote location. Mr. Mahurin said he believed the killing happened because of a marital dispute and was not connected to Mr. Ancona’s membership in the K. K. K. The Washington County Sheriff’s Office said that it learned of Mr. Ancona’s disappearance on Friday, shortly before his vehicle was discovered on land owned by the United States Forest Service. His body was found on the banks of the Big River in Belgrade, Mo. the next day by a family who had gone to fish. In an interview with The New York Times this month, Mr. Ancona said he had been a member of the Klan for more than 30 years. He formed the Traditionalist American Knights in 2009. There are at least 29 separate, rival Klan groups currently active in the United States, and they compete with one another for members, dues, news media attention and the title of being the true heir to the Ku Klux Klan, said Mark Potok, a researcher at the Southern Poverty Law Center, which tracks extremism in the United States. Most recently, Mr. Ancona was accused by rival Klansmen of being secretly Jewish. “It is endless infighting,” Mr. Potok said. Mr. Ancona’s group was not considered the largest or the most influential iteration of the Klan, but he was skilled at attracting the spotlight. During the 2014 protests in Ferguson, Mo. after the police killing of Michael Brown, Mr. Ancona’s group passed out leaflets in the city, vowing to use “lethal force” against protesters. The fliers got him invited on MSNBC. Shortly after, Mr. Ancona explained his beliefs in an interview with a member of the hacker group Anonymous, which later claimed to have gained access to his group’s files and released his personal information. This year, the group also distributed fliers in several towns in Maine, far from its base in Park Hills, Mo. Mr. Ancona pointed to these operations as a sign of his group’s popularity and reach, but Mr. Potok said it had no more than a few dozen members in chapters in three states: Missouri, Idaho and Pennsylvania. Mr. Ancona promoted the Klan as a nonviolent fraternal organization for white Christian men, something akin to a   group that endorsed the separation of the races and opposed what he called “equality propaganda. ” “I don’t focus on the negative history,” Mr. Ancona said, adding that he did not understand why people were afraid of the Klan. “What Klansman do you ever see go out and see terrorize anyone?” But the group’s website and fliers contained a more violent message, including images of hooded Klansmen brandishing nooses, racist cartoons of   and the letters “KKK” engulfed in flames. In one picture, which appeared to be manipulated, Mr. Ancona stood before a burning cross. “They want to portray us as all toothless, redneck tobacco chewers,” Mr. Ancona said this month. “Some of us are! But some of us are college educated. I am a business owner,” he said. “We just believe in promoting traditional American values. ” Mr. Ancona dismissed the Klan’s violent history as the work of “a few bad apples” in another era. He said killings attributed to the group during the civil rights era were the work of government agents, like those who infiltrated civil rights groups at the time. “I’d say that operation cointelpro really never ended,” he said. In reality, the K. K. K. has killed scores of people since it was founded in 1865, the vast majority of them  . Many of the crimes believed to be committed by the Klan were not investigated, so the precise number of its victims may never be known. “Frank Ancona posed as the kinder, gentler Klansman, but he was really none of those things,” Mr. Potok said. “A lot of these characters seem like jokes  —   and some of them really are  —   but that doesn’t mean they’re not incredibly dangerous. ”'"}, "time": 1742562668.5327635}