{"duration": 0.11268997192382812, "input_args": {"text": "'It was not true in 2011, when Donald J. Trump mischievously began to question President Obama’s birthplace aloud in television interviews. “I’m starting to think that he was not born here,” he said at the time. It was not true in 2012, when he took to Twitter to declare that “an ‘extremely credible source’” had called his office to inform him that Mr. Obama’s birth certificate was “a fraud. ” It was not true in 2014, when Mr. Trump invited hackers to “please hack Obama’s college records (destroyed?) and check ‘place of birth. ’” It was never true, any of it. Mr. Obama’s citizenship was never in question. No credible evidence ever suggested otherwise. Yet it took Mr. Trump five years of dodging, winking and joking to surrender to reality, finally, on Friday, after a remarkable campaign of relentless deception that tried to undermine the legitimacy of the nation’s first black president. In fact, it took Mr. Trump much longer than that: Mr. Obama released his   birth certificate from the Hawaii Department of Health in 2008. Most of the world moved on. But not Mr. Trump. He nurtured the conspiracy like a poisonous flower, watering and feeding it with an ardor that still baffles and embarrasses many around him. Mr. Trump called up   sowers of the same corrosive rumor, asking them for advice on how to take a falsehood and make it mainstream in 2011, as he weighed his own run for the White House. “What can we do to get to the bottom of this?” Mr. Trump asked Joseph Farah, an author who has long labored on the fringes of political life. “What can we do to turn the tide?” What he could do  —   and what he did do  —   was talk about it, uninhibitedly, on social media, where dark rumors flourish in   bursts and, inevitably, find a home with those who have no need for facts and whose suspicions can never be allayed. And he mused about it on television, where bright lights and sparse editing ensure that millions can hear falsehoods unchallenged by  . “Why doesn’t he show his birth certificate?” Mr. Trump asked on ABC’s “The View. ” “I want to see his birth certificate,” he told Fox News’s “On the Record. ” And so it went. The essential question  —   Why promote a lie?  —   may be unanswerable. Was it sport? Was it his lifelong quest to court media attention? Was it racism? Was it the cynical start of his eventual campaign for president? It might not matter. He kept doing it, even as his most senior aides assured the public that he had long since abandoned the fallacy. He had not. He was disingenuous until the very end, telling a Washington Post reporter just 72 hours before that he was unready to concede the president’s place of birth. But he treated the weighty topic, as he does so much else, like a television cliffhanger, promising a major declaration on Friday. And then, around 11 a. m. Friday in Washington, he gave up the lie. But he conjured up a bizarre new deception, congratulating himself for putting to rest the doubts about Mr. Obama that he had fanned since 2011. “I finished it,’’ he declared, unapologetically. “President Obama was born in the United States  —   period. ’’ Surrounded by, and in many ways shielded by, decorated veterans in his new Washington hotel, he could not resist indulging in another falsehood  —   that his opponent, Hillary Clinton, had started the   birther movement. She did not. Much has been made of Mr. Trump’s casual elasticity with the truth he has exhausted an army of   with his mischaracterizations, exaggerations and fabrications. But this lie was different from the start, an insidious, calculated calumny that sought to undo the embrace of an   president by the 69 million voters who elected him in 2008. In the end, it seemed, Mr. Trump’s plot to diminish Mr. Obama did not succeed. On Friday, the president of the United States seemed much bigger. “I was pretty confident about where I was born,” Mr. Obama said from the White House, a wry smile crossing his face. “I think most people were as well. ’’ And the president had this to say about the myth heedlessly spread by the man seeking to replace him: “My hope would be that the presidential election reflects more serious issues than that. ”'"}, "time": 1742563935.5563562}