{"duration": 0.10605263710021973, "input_args": {"text": "'Russian experts collecting evidence of anti-govt chemical attack in Aleppo – Defense Ministry ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. Syrian War Report – November 3, 2016: Egyptian Officers Arrive in Syria By South Front on November 3, 2016 …from SouthFront \\nOver 2,500 militants have been killed and wounded in western Aleppo since the start of Al-Nusra-led attempt to break the government forces’ defenses in the area on October 28, according to sources in the Syrian military. Considering that the total striking force deployed by Jaish al-Fatah coalition for the operation was about 5,000 fighters, it’s clear why the militant coalition failed to achieve its military goals. \\nAn infighting allegedly started between Harakat Nour al-Din al-Zenki and Fastaqim Kama Umirt militant groupsin Salaheddine and Al-Ansari Mashhad areas in Aleppo city on November 2. Nour al-Din al-Zenki stormed Fastaqim Kama Umirt checkpoints and arrested dozens of Fastaqim Kama fighters including their commander ‘Istakem kma Oumrt’. At least 1 militant was reported dead and 25 injured as result of the clashes. The conflict among ‘moderate rebels’ reportedly appeared because Fastaqim Kama Umirt was considering a possibility to leave Aleppo through corridors set up by the Syrian and Russian military. \\nThe Russian general staff has announced that President Vladimir Putin had ordered a humanitarian pause in Aleppo from 9am to 7pm on November 4. \\n“Considering that our American colleagues were unable to separate the opposition from terrorists, we are addressing all militant leaders directly, urging them to cease hostilities and leave Aleppo with their arms,” General Valery Gerasimov, the chief of the Russian General Staff said, adding that “Two corridors will be opened, from which Syrian troops and weapons would be pulled back.” Six additional corridors will be opened for civilians. \\nA group of Egyptian officers allegedly arrived in Syria on November 1 in order to learn from Russian military advisers that are embedded with government troops at the battle against terrorists across the country. The development took place amid the ongoing expansion of military cooperation between Russia and Egypt. In October 2016, Russian airborne troops arrived Egypt to participate in a joint military drill with the host country. The drill was codenamed “Defenders of Friendship 2016”. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on November 3, 2016, With 926 Reads Filed under WarZone . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments 2 Responses to \" Syrian War Report – November 3, 2016: Egyptian Officers Arrive in Syria \" Paedo hunter November 3, 2016 at 9:35 am \\nKerry’s awfully quiet these days……as is Erdogan'"}, "time": 1742563423.12292}