{"duration": 0.32017087936401367, "input_args": {"text": "'  => Eddie and Friends \\nWhen 46-year-old Eddie found out I’d been interviewing people, he wanted to talk. “You can write a book about me!” and that’s true enough, but then again, I’ve never met an uninteresting person. \\nWithin a minute, Eddie was showing me photos of women on his cell phone. There was plenty of skin and at least one crotch shot. These voluptuous ladies had sent these boudoir selfies to him, Eddie growled, his eyes sparkling. \\nEddie’s a beefy dude, with a head like an Olmec statue. Though he wears a permanent scowl, it’s a friendly scowl. \\nEddie was in Friendly Lounge with his housepainting boss, Tony, an Italian dude who used to live in the neighborhood. \\nAfter talking to Eddie, I checked out his FaceBook page. “im a fun loving guy who just wants peace in my life,” he introduces himself, and the first two photos feature Eddie with white women. In one, he’s in some bar and wearing a white T-shirt, “WHITE GIRLS LOVE ME.” With his arms outstretched, Eddie’s surrounded by eight white females and one bald white guy. The women appear to be in their 30’s and 40’s, though one, wearing granny glasses, has sweated, cursed and imbibed her way through nearly six decades, it seems. You go, grandma! In the other photo, two beaming blondes drape themselves all over Eddie. \\nBelow these shots, there’s a video of Oprah Winfrey begging her audience to vote for Hillary Clinton, and down the page, there’s a computer animation of Donald Trump making his most grotesque faces while sitting on a toilet. \\nTalking to me, Eddie brought up the pains of being rejected by his dad all his life. The rates of American children being born out of wedlock have been rising, calamitously, for decades, and currently stand at around 40%. Among blacks, it’s 72%. \\nI’ve known Tony since high school. He lives in the suburbs too. I grew up in West Philly, right around the corner from the zoo, then I moved to the suburbs. I’ve been working with Tony for two years. \\nI was in Boston for ten years. The only reason I came back here was because I had the cancer and everything. After they did the surgery, my family wanted me to come back, you know, be closer to home, in case it happens again. \\nI was doing work. The customers loved the work. Their relatives were from Boston, and they were like, “Do you travel?” I said, “If it’s worth it, yeah.” \\nSo they put me on a job up there, and my ex-girlfriend, I stayed at her house for a while, then I bought my own place. When I moved up there, I just got work, work, work, work. \\nI loved it up there! I loved it! I loved it! I loved it! \\nIt’s funny because I’m not like most black guys, black people, you know. I love the water, being out there on the water, fishing and all types of stuff, and there are so many bodies of water up there. That’s where I get my peace of mind, you know what I mean? I sit there and don’t have a care in the world. I didn’t have my own boat. I was renting the stuff right there. \\nHere, it’s not the same because you can’t get in the water. I love fresh water. Fresh water is beautiful. I like deep sea fishing, salt water and all that, but freshwater is beautiful. \\nThis whole summer, I didn’t hit the water at all. I didn’t even swim this summer. Did you hear what I just said, Tony? This whole summer, I didn’t even swim. Like, what the fuck! \\nThey have lakes up there, and they have park rangers and they’ve got grills up there, where you can grill, volleyball nets, all that stuff. \\nIt’s $4 a car-load, so you can have six people in a car. It only takes $4 to get in there. You can swim, fish, play volleyball, and you can do that almost any time. \\nEverybody kept telling me that it’s crazy to move up there, like they’re so prejudiced up there, but they’re not. They were so nice. \\nThe first day I got up there, people were opening doors for me. They were like, “Hey, how are you doing?!” It was totally different from here, you know, and I loved it, just loved it. \\nIt’s not racial at all. There were so many mixed couples, so many Brazilians, Ecuadorians, all types. Puerto Ricans, Chinese, Asians, all, all, everything. \\nThey did have a bad rap, but it’s just not correct. \\nThey do still have certain areas. They still have these little gangs. Like, one of my buddies wanted to take me to a club. We get there, and I have to park down the street. They had already gone inside the club, but I had to park. When I got close, walking, two dudes stopped me. There was a black guy and a Puerto Rican guy. They were like, “Yo, you got the wrong color on.” \\nSo I opened my mouth, and I said, “You’ve got to be kidding me,” and I was laughing. “You don’t know my lifestyle. You’re coming at me like that?” \\nAs soon as I opened my mouth, though, they were like, “Oh, you’re not from around here. Where are you from?” I said I’m from Philly, so they were like, “You’re cool, man.” I laughed at them, basically. \\nThere are different levels with me. You get mad, you get angry and you get upset, you know what I’m saying? I try not to get angry, at all. Angry takes me to a totally different place, which is not good, so I try not to do that. I try to stay at one focal point and, even though I’m mad at you right now, I’ll still say something stupid so that you laugh. \\nLet’s say you’re just bothering me. I’ll walk outside or something, then come back in, and I’ll start fucking with you back, but in a fun way. Even though you were fucking with me in a bad way, I’ll come back and fuck with you, in a good way. ORDER IT NOW \\nI always try to turn a negative into a positive. \\nYou’re not going to defeat me by your words or whatever, you know, because I’m very smart. In the 7th grade, I used to smoke weed and stuff like that, came to class all high, and I still got A’s on my tests. \\nThey kept me after school, you know, because I was cheating, and I still got the same grade, so they were like, “You’re so smart to be so dumb.” \\nMy sociology teacher said, “You shouldn’t be getting high. You’re too intelligent for that.” It stuck with me all my life. \\nLike, me and him are FaceBook friends. I texted him, “Hey Mr. Coleman, blah, blah, blah. Yo, thank you for saying that to me when I took your class,” and he was like, “Well, Eddie, I don’t remember what I said.” I told him, “You said that I was so smart to be so dumb,” and I always took that into my brain. \\nMy kids are mixed. I love white women. Ha, ha, ha! \\nWe all bleed the same damn color. People don’t realize that racism is taught. If you take an Asian kid, a black kid and a white kid and put them in the sandbox, they’re going to play, until somebody say they can’t play with that child. \\nIt’s the parents. The parents may come up to that kid, “Get out of there! You can’t play with them!” You know what I mean? The kids will act how kids act. They don’t know no better. They’ll play! \\nMe, I have no problems at all. You respect me, I respect you. \\nLike I said, I have mixed kids, but growing up, I was shot at because I was black. I walked through the wrong neighborhood. Somebody tried to shoot me with a harpoon! I’ve been through some shit. I can’t help it if I’m black. I can’t help that. \\nThat’s what he does, you know, scuba diving. He didn’t hit me. I was lucky I got pushed out of the way. This was growing up in the suburbs, Lansdowne, Yeadon, Upper Darby. I got shot at, you know what I mean, because I walked on the sidewalk. \\nCops in Darby, they beat me up. It was a domestic call. My wife was white, OK? We had kids, mixed kids. The argument was next door, not my house, but they came at my house, threw me down the steps, beat me up, put me in a cop car, then turned around and told me, “If you don’t want to go to the hospital, you better give me your address,” so I gave them my address. \\nThey were like, “You don’t live there. A white girl lives there.” They were like, “Where you live at?” I gave them the address again. They were like, “You don’t live there! You go to the hospital,” so guess what? I went to the hospital. They beat me the fuck up! \\nThey took me from my house. She was living there, with me! \\nI couldn’t even fight back. My wife said, “That’s my husband,” but they made her go back in the house. This was ‘92. \\nI came home the next day. They ripped my shirt. I had a button shirt. They cut it in the back, with a razor, so I’m walking in my shirt with a hole in it. They made me walk home without no shoes. \\nSo I went to my old neighborhood. I talked to my mom and all that, and we went to the Lansdowne police station, because we knew an officer there. They said there was nothing they could do about it, because there’s a code of silence among the police officers, or so they said, so my sister took it to a different level. \\nI don’t know if you’ve ever heard of Mary Mason? WHAT? My sister took it to a radio station. They had a picture of me. They had a picture of my clothes. They had a picture of me all beat up and everything. \\nOver nothing! Over nothing! Literally. I was beaten up over nothing! \\nI ended up suing them but, again, I was young, so I settled out of court with them. I ended up getting, like, $45,000. If I kept it going, I would have gotten a whole lot more. \\nLike I said, again, then I was selling drugs. I had an arsenal. I had guns and stuff like that, you know. I was going to blow the police station the fuck up, you know what I mean, but the police station was right next to a school, so I couldn’t do that. \\nNo, I didn’t have a record then. I never got caught. \\nThey were arguing next door. It wasn’t us! They went to the wrong house and fucked me up! \\nI’ve got three friends that are police officers. I trust them, but I don’t trust those other ones. As soon as I saw them, it’s, “Yes, sir,” whatever, but they threw me to the ground and worked me over! \\nFor two years, they harassed me. They banned me from that town. If they saw me driving, they’d pull me over. They were like, “You’ve got two minutes to get out of this town!” \\nI had to move back to my mom for a little while. My wife and kids, too. \\nI never got bitter over that. I get sick of reading stuff now in the news. I think about my children’s security. It pisses me off, you know. \\nLike I said, again, I already lived that life. Innocent people getting beaten up by the cops, getting killed, that could have been me, I could have gotten killed. That night. \\nWhat I was doing was, I was avoiding that act, you know, which was kind of hard to do, because certain roads led that way, so I had to take back streets just to keep away. Again, I was still young too. \\nI was going to blow the hell out of that police station, you know what I mean? I had the artillery to do it, but, again, glory to God and all that. God had my back! Otherwise, that police station and whoever was in it was gone! ORDER IT NOW \\nThere’s a kid that I went to school with, they killed him in a cell. Now, when they put you in that cell, they take your shoe strings, they take your belt and they take your shirt from you, so how are you going to hang yourself? He’s 6-4. How do you hang yourself when you’re 6-4 and you’re in a 6-foot cell? You can’t! \\nHe was a good kid, but he was a bad kid, you know what I mean? I forget how he got locked up. He got locked up for something. They killed him the same night. They locked him up, then they killed him. You can look it up. It’s on the internet still. \\nMy wife stayed with me. Five years later, we split up, but it wasn’t over that. I had three children with her, my oldest three. \\nShe got mad because I moved on. I had another woman. I was just having another kid. I had a reason to dump her, you know what I mean? If you’re in a relationship, and you’re not growing. You’re supposed to grow together. She cheated on me. I’m sure she did. She got caught twice, so when she started doing it, I started doing it. \\nShe did it first, she did it first, she started it. \\nAll I did was work. I worked, then came home, I swear to God! I was bringing home $1,300 cash a week. I was taking out vent systems, heaters, boilers and all that. I was bringing all this money home. It’s heavy work, back-breaking stuff. All you wanted to do was go home to your shower and that’s it. Eat, then sleep. \\nI was mad because she was collecting welfare. It’s like, “Why are you collecting welfare?” We’ve got plenty of money. We had a good life. It’s because of her girlfriends. It was like, “You can get this, you get that.” Now, I had no insurance and stuff. I told her, “You can get the medical, and you can get the food stamps, but don’t get the cash,” but she went out and got it all. She got all the benefits, so I ended up in the system. \\nI told the judge, “How are you locking me up, when my kids live with me? Like, what are you talking about? This is my house. My kids live with me and everything.” Well, it was because of her, she was getting welfare, but I didn’t know. \\nI was getting locked up for a month here, a month there, you know. When they locked you up in the state of Pennsylvania, they suspended your license, so how could you get to work? If you had a driving job, you couldn’t do it. It’s fucked up! \\nI told the judge, again, here you go, “My kids live with me. I don’t owe her nothing. Why am I here? If you look at the record, you’ll understand what I’m talking about here. I’m confused. You guys locked me up, like, six fuckin’ times,” so he said, “Ma’am, why is he here?” \\n“Oh, I’m trying to get more money, blah, blah, blah blah,” so he looked and found out that she had a warrant out, so he said to me, “Mr. Calvin, you want me to lock her up? What she’s doing is welfare fraud.” \\nI said, “Your honor, no.” I said no. “We’re not together no more. I didn’t suffer from you guys. I was in the system. I was in jail six times, but I’m done now.” I said, “No, that’s my kids’ mother. Don’t lock her up.” \\nHe went to her, and he said, “Ma’am, this is a hell of a nice guy. Why did you do this to him?” She had no answer. \\nShe was acting real stupid. I looked at her and I said, “I told you you wasn’t going to get no money.” That’s what I said to her. “I told you you weren’t going to get no money. The judge could have locked you up, no matter what I said. You heard what he said. It was welfare fraud. You’re stupid for even bringing me in here.” \\nI had three kids with her, my oldest three. \\nI have a kid that’s getting ready to turn four, up in Boston. All of my other kids are here. I’ve got 24, 21, 20, 16, 15 and one that’s getting ready to turn four. I grew up without a father, so I was going to make sure I’m not going to be like my father, you know what I mean? \\nMy three oldest, I put money into their accounts, in their names. They each have $50,000 in their bank account, right now. They’ve got more money than I do. Now, my younger ones, my 16 and 15-year-old, they’ve got about $10,000. The baby don’t have shit, you know what I mean, but she’s going to get hers. \\nI was doing the smart thing with the money. Like I said, I grew up without a father, so I’m going to provide for my kids, no matter what. I’ll suffer later, but as long as my kids are OK, then I’m happy. \\nWhen I did get to know my father, I met him in church. I was 16 years old when I got to meet my father. I went to church with my mom. \\nI was 16. Again, I was selling drugs, but I was also working at McDonald’s and going to school. \\nHe comes into church, sits behind us and goes like this to my mom. Taps on her shoulder, “Who’s that?” She almost cursed in church. “It’s a shame you don’t know your own son!” I turned around and almost flipped, but then I realized I was in church. I was like, “You made me and you don’t know who I am?!” \\nWhen she got pregnant by him, she was with him for, like, five years. She said, “I’m pregnant,” and the next day, he was gone. My father did this to five other women, the same exact thing, because I have five brothers. He did the same thing to each one of the women. \\nMy father, I almost killed him, in church. I was so angry. Yeaah. Yeaah. I was like, “How can you not know who I am? Where was you at?” Like, “Why don’t you want me? What did I do to you? I didn’t do anything to you. You made me,” but there was nothing, not a fuckin’ word, not a fuckin’ word. ORDER IT NOW \\nI never called him dad. I never called him pop. There was nothing until I turned 18. When we graduated high school, I paid for his parking to come see me graduate. That’s fucked up. \\nNow, my grandfather and grandma loved the shit out of me. I knew them. I knew them since I was three! \\nMy grandparents, they loved me. They knew who I was. My grandpop and grandmom used to always brag about me when I walked down the street, when I walked by the house, everything like that. They’d say, “There goes my grandson.” They would tell people,” There’s my grandson.” \\nMy father came to my graduation because I begged him to come. Face to face, I was like, “I’m your son. Aren’t you proud of me for graduating, at least?” He was like, “Well, she has money.” \\nI paid for his parking. I paid for his ticket. We got, like, three graduation tickets, and you had to pay for two more. I paid for it. I paid for him. It was $10 or something. He didn’t want to pay $10 to see his son graduate. \\nThat’s why I made a promise to myself. I said that when I have kids, no matter what happens between me and the girl, my kids are going to know who I am, and that I was there, so that’s what I’ve done. \\nTony gets mad that a lot of his crew don’t have cars and stuff, but when my son, my first born, made me a grandpa, I gave him my truck. \\nI know what it’s like to be on a bus with kids, grocery shopping and all that, with the kid wrapped around you, and you carrying bags and getting on a bus. I know what it’s like, so I gave him my truck. \\nI told Tony, “I ain’t got no vehicle, man. I gave it to my son. I ain’t got no car!” But it made me feel good, because I would never be like my father. Never! \\nWhen I hear people, because I hear people all the time, like how they hate their mom, how they hate their dad, and I’m like, I can see how you hate your dad, and you must have a reason, but at least you’re living together. I didn’t have that. All I had was my mom. You’ve got a mom and a dad, so you should be happy, you’re lucky, because I didn’t have that. \\nLinh Dinh is the author of two books of stories, five of poems, and a novel, Love Like Hate . He’s tracking our deteriorating socialscape through his frequently updated photo blog, Postcards from the End of America .'"}, "time": 1742562273.738543}