{"duration": 0.054404258728027344, "input_args": {"text": "'Putin Prepares For World War 3 With Simulated Drills Across Russia \\n“This is very dangerous for Norway and Norwegians,” he said. \\n“How should we react to this? We have never before had Norway on the list of targets for our strategic weapons. But if this develops, Norway’s population will suffer,” he warned. \\n“Because we need to react against definitive military threats. And we have things to react to, I might as well tell it like it is,” Klintsevitsj added. \\nRussia has on several occasions criticized the plans to deploy 330 US troops at Værnes. Norway’s defence minister, Ine Eriksen Søreide, has rejected those criticisms and insisted that the deployment does not constitute a US military base but is rather a test run that will be evaluated during 2017. \\n“There is no objective reason for the Russians to react to this. But the Russians are reacting at the moment in the same way toward almost everything the Nato countries are doing,” Søreide said. \\nBefore joining Nato in 1949, Norway allayed Russian fears by pledging not to open its territory to foreign combat troops so long as Norway was not attacked or threatened with attack. \\nNorway’s government argues that Nato troops are already training regularly in the country and that the deployment of troops does not equate to the opening of a permanent American base. \\nThe US already has vast amounts of military equipment positioned in Norway — notably in tunnels dug into mountains — but no troops. \\nKlintsevitsj’s remarks bring to mind similar Russian comments made about Norway’s neighbour to the south, Denmark. \\nIn March 2015, Russia’s ambassador to Denmark warned that Danish ships will become Russian targets if Denmark joins Nato’s missile defence system. \\n“I don’t think the Danes fully understand the consequences of what will happen if Denmark joins the American-controlled missile defence. If it happens, Danish war ships will become targets for Russian atomic missiles,” Mikhail Vanin wrote in an opinion piece published by Jyllands-Posten.'"}, "time": 1742562138.542128}