{"duration": 0.1690220832824707, "input_args": {"text": "'Here are the top 10 comments of the week on our digital platforms, as selected by our readers and the journalists who moderate nearly every comment. To see how our readers reacted to Donald Trump’s request that Russian intelligence hack Hillary Clinton’s email, our   on story ever, go here. 1. I am thinking about my mother tonight, the child of immigrants, born in 1919 just when women were given the right to vote. I am remembering all the times she dragged me into the voting booth to show me what a privilege it was to be an American and to live in this country. I can’t talk to her about this historic night, but I can talk to my daughter who can see that her future is limitless. Almost 100 years in the making. It’s been a long time coming.  —   Ann in Connecticut, reacting to an article about Hillary Clinton accepting her party’s presidential nomination, the first woman from a major party to do so. This comment received more than 900 reader recommendations.  2. I think we don’t remember how recently women weren’t allowed to wear pants, or couldn’t attend Ivy League schools. Somehow we failed to pass these stories on to our daughters as we sought to give them all the opportunities of their male counterparts. Now the sexism is often more subtle, more hidden and our daughters take their opportunities for granted. “I’d like a woman, just not this woman. ” There isn’t a mythical, perfect woman running. There is a human woman running, sometimes making mistakes, sometime enduring private pain publicly, sometimes soaring to the highest levels of achievement. Let’s not hold her to a standard of perfection we wouldn’t apply to a man running for president, let’s honor her humanity and success as the first woman to achieve the nomination of a major party.  —   Ellie in Boston. 3. One of the best things to come of this election is the fact that the G. O. P. has been forced to examine the monster which has been allowed to grow in its midst. I firmly believe that something similar is required on the Left. Hillary Clinton is no monster like Trump, but she is the calcification of a   version of what is wrong with politics today: the intransigence and pandering, the corruption and secrecy, the influence of big money, and a    the     approach to an entitled sense of rulership. The Democratic Party has a chance to see what its Bernie contingent is pointing out to party leadership. Were the G. O. P. candidate any better than a buffoon, it would be easier for the mainstream Left to see what is wrong with Hillary. It has nothing whatsoever to do with her gender. The D. N. C. ’s treatment of Bernie Sanders and his supporters has alienated me to a degree I didn’t think possible.  —   Kelvin F. in the Pacific Northwest. This comment received more than 970 reader recommendations and more than 300 reader responses. 4. As a Sanders supporter, I will not be voting for Hillary. At this point, I’m left deciding between Gary Johnson and Jill Stein, who, like Bernie, were both actually against the Iraq war before it started. Or, perhaps, just staying home. I am not alone. The two major candidates are the least popular in history, and the biggest reason their supporters give for voting for them is that they aren’t the other one. I’m resigned to having a terrible president starting next January, but there’s no way I’ll be responsible for electing him or her.  —   Mike in New York. This comment had more than 320 reader recommendations. 5. I love the fact that people are outraged not because the White House was built by slaves, but because someone dared to bring it up.  —   Molly Maxine on The Times’s Facebook page, responding to an article about Michelle Obama’s speech at the Democratic convention, in which she said of the White House, “I wake up every morning in a house built by slaves. ”  This comment received 60 likes. 6. To those morally outraged commenters who are threatening to not vote  —   or to vote for Jill Stein, or Barney Fife, or whomever they imagine will represent some kind of integrity on their part  —   because they’re shocked and dismayed at the revelation that somehow the D. N. C. is “rigged,” I say the following: Everything is rigged! Life is rigged! You will encounter it in every endeavor. Sometimes, it will serve you unfairly, sometimes it will discriminate against you unfairly  —   but it’ll always be there. There is no pure, sterile laboratory environment when it comes to human beings and their comings and goings. Clinton and Sanders are subject to exactly the same dynamics as you and I are as far as that goes. To assume any higher order is  —   sorry  —   to be naive. One of the first lessons a child learns is that life isn’t fair. If they don’t learn it, if they don’t accept it and move forward knowing it, they’ll be disappointed at almost every turn.  —   Sean in New Orleans, reacting to an article about Debbie Wasserman Schultz stepping down as chairwoman of the Democratic National Committee after an email leak revealed party leaders seeking to damage Senator Sanders’s campaign.  7. You know, I’ve often wondered how people who are falsely accused feel after the truth comes to light. Relieved? Vindicated? Righteous? At peace? Supporters of Bernie Sanders have spent close to half a year being told we’re conspiracy theorists, that we’re paranoid, unhinged, entitled whiners unable to face the reality that “all is well, our guy’s just a loser. ” Learning that the D. N. C. did indeed actively collude to deny Bernie Sanders the nomination should make me feel something, shouldn’t it? The evidence is there for even the most stubborn of skeptics to behold: the odds were never in Bernie’s favor and his supporters were right to question the D. N. C. ’s impartiality. But I don’t feel anything. I just feel empty. There are so many days left in this election. There’s a monstrous creature that must be defeated at all costs. I just wish it felt like my party was one of the good guys.  —   Danielle in Seattle. This comment received more than 1, 900 reader recommendations and more than 70 reader responses. 8. Once again, no one is held responsible for the death of an innocent black man. Society and the justice system [are] more ready to find excuses to exonerate when a black life is involved, because somehow he is seen as less valuable. Then, a society without equal empathy for all is surprised to see protests and violence in the streets. In the long term, injustice and peace are not mutually inclusive in any society, as history repeatedly teaches.  —   Merlin in Atlanta, reacting to an article about the state’s attorney dropping all remaining charges against the three Baltimore police officers awaiting trial in the death of Freddie Gray. This comment received more than 80 reader recommendations. 9. Addiction is a disease. Naloxone was no more invented to “cure” it than insulin was invented to “cure” diabetes. The key, and unexamined, phrase in this article is “seek treatment”: where are all those sick people supposed to take their illness when states like mine (with the money to make better choices) are closing rehab clinics like the one that saved my friend when she began her recovery six years ago? Today she is a vibrant counselor to young people. If anyone ever gave YOU a second chance, you ought to reopen your closed mind when it comes to addiction.  —   Megan Macomber in New Haven, reacting to an article about naloxone, a drug that revives someone who has overdosed on opioids. Critics of the drug say it offers addicts a safety net advocates say it offers a path to treatment and recovery. 10. Based on my experience in marketing management at Verizon, I’d say this will be a case of the blind leading the blind. Verizon has so much money to burn  —   but no real strategy in the consumer space. They’ve never really “gotten” the   thing and this is not a company that takes a lot of risk. By the time they got FiOS up and running, the business model for TV consumption was already changing. My guess is that will be a few years of   efforts to launch new “products,” and then they’ll sell the entire consumer side of the business.  —   Pat B. in Blue Bell, Pa. reacting to an article about Verizon’s purchase of Yahoo’s core internet business for $4. 8 billion. '"}, "time": 1742562763.506998}