{"duration": 0.10005903244018555, "input_args": {"text": "'WORCESTER, Mass.  —   A freshman tentatively raises her hand and takes the microphone. “I’m really scared to ask this,” she begins. “When I, as a white female, listen to music that uses the N word, and I’m in the car, or, especially when I’m with all white friends, is it O. K. to sing along?” The answer, from Sheree Marlowe, the new chief diversity officer at Clark University, is an unequivocal “no. ” The exchange was included in Ms. Marlowe’s presentation to recently arriving   students focusing on subtle “microaggressions,” part of a new campus vocabulary that also includes “safe spaces” and “trigger warnings. ” Microaggressions, Ms. Marlowe said, are comments, snubs or insults that communicate derogatory or negative messages that might not be intended to cause harm but are targeted at people based on their membership in a marginalized group. Among her other tips: Don’t ask an Asian student you don’t know for help on your math homework or randomly ask a black student if he plays basketball. Both questions make assumptions based on stereotypes. And don’t say “you guys. ” It could be interpreted as leaving out women, said Ms. Marlowe, who realized it was offensive only when someone confronted her for saying it during a presentation. Clark, a private liberal arts college that has long prided itself on diversity and inclusion, is far from the only university stepping up discussions of racism and diversity in orientation programs this year. Once devoted to ice cream socials, tutorials on campus technology systems and advice on choosing classes, orientation for new students is changing significantly, with the issue taking on renewed urgency this year as universities increasingly try to address recent racial and ethnic tensions on campuses as well as an onslaught of sexual assault complaints. In addition to diversity sessions, many campuses train students on exactly what constitutes sexual consent as well as how to intervene when they see fellow students drinking excessively or poised to engage in nonconsensual sexual behavior. A bystander intervention presentation for arriving freshmen at Wesleyan University last Thursday  —   “We Speak We Stand”  —   featured students acting out fictional episodes of campus sexual violence, harassment and problematic drinking, with examples of how to intervene. “Each of you has the power to bring to light sexual violence in our community,” one student told the group. Fresh on the minds of university officials are last year’s highly publicized episodes involving racist taunts at the University of Missouri  —   which appear to have contributed to a precipitous decline in enrollment there this fall. “That closes your doors,” said Archie Ervin, the vice president for institute diversity at Georgia Institute of Technology and president of the National Association of Diversity Officers in Higher Education. “If you have sustained enrollment drops and disproportionately   students such as    the state legislature can’t make up the gap. ” At the University of   officials have put together a diversity presentation as a pilot program this year for 1, 000 freshmen  —   whom some colleges refer to with the   term   students. That program, expected to cost $150, 000 to $200, 000, follows incidents on campus last year. In one, a racist note was slipped under a black student’s door, prompting Patrick Sims, the university’s vice provost for diversity and climate, to post an emotional video on YouTube titled “Enough Is Enough. ” Lori Berquam, the university’s dean of students, said in an interview that the sessions would try to address the fact that some students in Wisconsin, a predominantly white state, had little exposure to people of other races until they got to Madison. “It would not be   for a student to join us from the state of Wisconsin having had zero people of color in their high school,” Dr. Berquam said. In August, the University of Wisconsin system, which includes the Madison flagship and 25 other campuses, said it would ask the State Legislature for $6 million in funding to improve what it called the “university experience” for students. The request includes money for Fluent, a program described as a systemwide cultural training for faculty and staff members and students. But that budget request has provoked controversy. “If only the taxpayers and   families had a safe space that might protect them from wasteful U. W. System spending on political correctness,” State Senator Stephen L. Nass, a Republican, said in a statement issued by his office, urging his fellow lawmakers to vote against the appropriation. Mr. Nass’s objection to spending money on diversity training reflects a rising resistance to what is considered campus political correctness. At some universities, alumni and students have objected to a variety of campus measures, including diversity training “safe spaces,” places where students from marginalized groups can gather to discuss their experiences and “trigger warnings,” disclaimers about possibly upsetting material in lesson plans. Some graduates have curtailed donations, and students have suggested that diversity training smacks of some sort of Communist   program. The backlash was exemplified recently in a widely publicized letter sent to new freshmen at the University of Chicago by the dean of students, John Ellison. He warned that the university did not “support   trigger warnings, we do not cancel invited speakers because their topics might prove controversial, and we do not condone the creation of intellectual safe spaces where individuals can retreat from ideas and perspectives at odds with their own. ” Still, the push to respond to complaints about subtle cultural insensitivity, as well as more overt racist behavior, continues on campuses across the country. About 75 chief diversity officers have been hired by colleges and universities in the past 18 months, according to Dr. Ervin’s organization. Ms. Marlowe, a lawyer who most recently was diversity officer at the University of California, Santa Cruz, was also recruited by two other colleges this year before settling at Clark, a manicured campus of about 3, 000 students an hour west of Boston in this heavily   city. Her   presentation on Aug. 27 aimed to help students identify microaggressions and to teach them how to intervene when they observe one. Microaggressions can be verbal, nonverbal or environmental, she said. “What’s an environmental microaggression?” Ms. Marlowe asked the auditorium of about 525 new students. She gave an example. “On your first day of class, you enter the chemistry building and all of the pictures on the wall are scientists who are white and male,” she said. “If you’re a female, or you just don’t identify as a white male, that space automatically shows that you’re not represented. ” A nonverbal microaggression could be when a white woman clutches her purse as a black or Latino person approaches. Another subset of microaggression is known as the microinvalidation, which includes comments suggesting that race plays a minor role in life’s outcomes, like “Everyone can succeed in this society if they work hard enough. ” For Clark students like Noelia Martinez, a Massachusetts resident who was born in Puerto Rico to Dominican parents, the session was an epiphany. “It helped me understand what I’ve been going through all of my life, basically,” she said, describing how she had endured stinging comments such as “You’re a really good student for a Hispanic. ” But Ms. Martinez, a sophomore transfer student, also realized that she, too, was guilty of microaggressions, because she frequently uses the phrase “you guys,” she said. “This helped me see that I’m a microaggressor, too. ” The presentation elicited a lively    session, during which students asked about the N word, discrimination against white people and men, and the definition of “Asian. ” Ms. Marlowe said she questioned the validity of the concept of reverse racism, arguing that racism is a system in which a dominant race benefits from the oppression of others. But some students appeared slightly confused. “When you use the term ‘ ’ as a white woman, are you saying that you can choose your race?” one white male student asked. “I’ll give you an example,” Ms. Marlowe said. “I went to a conference. I was talking to this man. I thought he was black. I was talking about diversity and social justice. ” “He said, ‘I’m Cuban,’” Ms. Marlowe told the crowd. “I assumed he was black because he was the same skin complexion as me, and the same type of hair. ” But, Ms. Marlowe said, while it is sometimes difficult to identify a person’s racial or ethnic background based on appearance, she does not believe that gives license to people like Rachel A. Dolezal, the white woman who claimed to be   while working for the N. A. A. C. P. in Spokane, Wash. “You can’t say you’re black if you’re not, historically. ” The student still seemed confused. “Maybe we can unpack it afterward,” Ms. Marlowe told the student. “You want to come see me afterward?”'"}, "time": 1742628407.5278447}