{"duration": 0.909184455871582, "input_args": {"text": "'More Than 101 Million Working Age Americans Do Not Have A Job By Michael Snyder, on April 7th, 2013 \\nThe jobs recovery is a complete and total myth. The percentage of the working age population in the United States that had a job in March 2013 was exactly the same as it was all the way back in March 2010. In addition, as you will see below, there are now more than 101 million working age Americans that do not have a job. But even though the employment level in the United States has consistently remained very low over the past three years, the Obama administration keeps telling us that unemployment is actually going down. In fact, they tell us that the unemployment rate has declined from a peak of 10.0% all the way down to 7.6%. And they tell us that in March the unemployment rate fell by 0.1% even though only 88,000 jobs were added to the U.S. economy. But it takes at least 125,000 new jobs a month just to keep up with population growth. So how in the world are they coming up with these numbers? Well, the reality is that the entire decline in the unemployment rate over the past three years can be accounted for by the reduction in size of the labor force. In other words, the Obama administration is getting unemployment to go down by pretending that millions upon millions of unemployed Americans simply do not want jobs anymore. We saw this once again in March. According to the U.S. Bureau of Labor Statistics, more than 600,000 Americans dropped out of the labor market during that month alone. That pushed the labor force participation rate down to 63.3%, which is the lowest it has been in more than 30 years. So please don’t believe the hype. The sad truth is that there has been no jobs recovery whatsoever. \\nIf things were getting better, there would not be more than 101 million working age Americans without a job. \\nSo exactly where does that statistic come from? Well, the following explains where I got that number… \\nAccording to the U.S. Bureau of Labor Statistics, there are 11,742,000 working age Americans that are officially unemployed. \\nIn addition, the U.S. Bureau of Labor Statistics says that there are 89,967,000 working age Americans that are “not in the labor force”. That is a new all-time record, and that number increased by a whopping 663,000 during the month of March alone. \\nWhen you add 11,742,000 working age Americans that are officially unemployed to the 89,967,000 working age Americans that are “not in the labor force”, you come up with a grand total of 101,709,000 working age Americans that do not have a job. \\nWhen you stop and think about it, that is an absolutely staggering statistic. \\nAnd anyone that tells you that “a higher percentage of Americans are working today” is telling you a complete and total lie. During the last recession the percentage of working age Americans with a job fell dramatically, and since then we have not seen that number bounce back at all. In fact, this is the very first time in the post-World War II era that we have not seen the employment-population ratio bounce back after a recession. At this point, the employment-population ratio has been under 60 percent for 49 months in a row… \\nSince the end of 2009, the employment-population ratio has been remarkably steady. Just check out these numbers… \\nMarch 2008: 62.7 percent \\nMarch 2012: 58.5 percent \\nMarch 2013: 58.5 percent \\nWe should be thankful that the percentage of working age Americans with a job did not continue to decline, but we should also be quite alarmed that it has not bounced back at all. \\nIf there was going to be a recovery, there would have been one by now. The next major economic downturn is rapidly approaching, and that is going to push the employment-population ratio down even farther. \\nSo why is the U.S. economy not producing as many jobs as it used to? Well, certainly the overall decline of the economy has a lot to do with it. We are a nation that is drowning in debt and that is getting poorer by the day. \\nBut since the end of the last recession, corporate profits have bounced back in a big way and are now at an all-time high . So you would figure that the big corporations should be able to hire a lot more workers by now. \\nUnfortunately, that is not the way things work anymore. Big corporations are trying to minimize the number of expensive American workers that they have on their payrolls as much as possible these days. \\nOne way that they are doing this is through the use of technology. Thanks to robots, computers and other forms of technology, big corporations simply do not need as many human workers as they used to. In future years, this trend is only going to accelerate. I wrote about how this is changing the world of employment in one of my previous articles entitled “ Rise Of The Droids: Will Robots Eventually Steal All Of Our Jobs? ” \\nAnother way that big corporations are replacing expensive American workers is by shipping their jobs off to the other side of the globe. Big corporations know that they can make bigger profits by making stuff in foreign countries where they can pay workers less than a dollar an hour with no benefits. How in the world are American workers supposed to compete with that? \\nFor much more on how U.S. jobs are being killed by offshoring, please see this article: “ 55 Reasons Why You Should Buy Products That Are Made In America “. \\nAnd of course immigration is having a dramatic impact on the labor market in some areas of the country as well. Cheap labor has dramatically driven down wages in a lot of professions. For example, once upon a time you could live a very nice middle class lifestyle as a roofer. But now many roofers really struggle to make a living. \\nWhen you add everything up, it paints a very bleak picture for the future of the American worker. \\nThe cost of living keeps rising much faster than wages do, and the competition for good jobs has become incredibly fierce. \\nMeanwhile, the government continues to make things even easier for those that are not working. This has caused some Americans to give up completely and to be content with letting the government take care of them. The following is from a recent article by Monty Pelerin … \\nAs we make it easier to get unemployment benefits for longer time periods, more people take advantage of the system. So too with food stamps and disability. All programs are at or near record levels in what is supposed to be four years into an economic recovery. For many, the benefits of becoming a government dependent exceed what they can earn. One study reported that a family of four, collecting all the benefits for which they were entitled, would have to earn $65,000 per annum to have the same after-tax purchasing power. \\nIf you are a product of the government schools and are legal to work (i.e., have skills enough that you are affordable at the minimum wage or higher), at what point do you realize that there is no need to go through the hassle of actual work. You can live pretty well by staying home and taking advantage of the entitlements available to you. That is exactly what a larger and larger percentage of the population are realizing. In many cases, it is economically irrational to work. \\nThis behavior creates a social pathology that only worsens over time. Kids learn from their parents that work is not necessary and the many ways to game the system. In this regard, look for this problem to become worse over time unless these programs are cut back. \\nIn some areas of the country, it actually pays not to work very hard. According to Gary Alexander , the Secretary of Public Welfare for the state of Pennsylvania, a “single mom is better off earnings gross income of $29,000 with $57,327 in net income & benefits than to earn gross income of $69,000 with net income and benefits of $57,045.” \\nBut the truth is that most Americans still want to work hard and would gladly take a good job if they could just find one. The following is one example that was featured in a recent Fox News article … \\nAfter a full year of fruitless job hunting, Natasha Baebler just gave up. \\nShe’d already abandoned hope of getting work in her field, working with the disabled. But she couldn’t land anything else, either — not even a job interview at a telephone call center. \\nUntil she feels confident enough to send out resumes again, she’ll get by on food stamps and disability checks from Social Security and live with her parents in St. Louis. \\n“I’m not proud of it,” says Baebler, who is in her mid-30s and is blind. “The only way I’m able to sustain any semblance of self-preservation is to rely on government programs that I have no desire to be on.” \\nAnd that is how most Americans feel. \\nMost Americans do not want to be dependent on the government . \\nMost Americans want to work hard and take care of themselves. \\nUnfortunately, our economy is not producing nearly enough jobs for everyone and it never will again. \\nSo there will continue to be millions upon millions of Americans that find that they cannot take care of themselves and their families without government assistance no matter how hard they try. \\nAnd this is just the beginning – things are going to get much worse during the next major wave of the economic collapse. \\nYes, at the moment there are more than 101 million working age Americans that do not have a job, but that number is actually going to go much higher in the years ahead. The anger and frustration caused by a lack of employment opportunities is going to shake this nation. \\nThat is why it is important to try to become less dependent on your own job. In this economic environment, a job can disappear at literally any moment. Anything that you can do to become less dependent on the system would be a good thing. 21 Statistics About The Explosive Growth Of Poverty In America That Everyone Should Know » Rodster \\nThe best advice is to try and start your own business. It’s funny how just prior to the crash of 2008 I always felt at a disadvantage not earning a regular paycheck and was tempted to give up my business and get a full time job. \\nAfter 2008 I thank my lucky stars I continued on with my business and now I feel i’m at an advantage because I can earn a living fixing cars. RICHARD \\nWhy would any one want to go out and get a job when they can sit on there duff and make more money drawing unemployment and food stamps, plus I am sure there working on the side to. Syrin \\nThis is EXACTLY the point. FunkYou FunkMe \\nHeck yeah, why work full-time with a company that covers their part of taxes and might offer benefits further bettering my compensation when I can work for myself without a guarantee of getting anything tomorrow. I mean sure it works for some, but we all can’t run our own businesses. More power to the people that do, but again it isn’t for everyone. LifeandLiberty \\nObama’s transformation of America is working as planned. charlie \\nThis is WAY bigger than Obama. He’s pushing the agenda, but he’s not the one giving the ques. Look to the secretary General of the United Nations if you want a clear path to start from. Jack White \\nNo….. Even farther back… Think creation of Fed Reserve, then you are gettin to the root/heart of the problem… \\nWell, Bernanke has no wiggle room to accommodate higher rates for savings. \\nThe Fed will have to quit printing $85 billion per month or finance such expansion through sales of treasuries if the fed rate is to rise and lift saving rates. The printing continues under the folly of needing to continue monetary expansion until unemployment gets down to a certain level. \\nThe next big delay in change will be based on “we gotta keep printing until the unemployment figures are solid”! Presently it just sticks an IOU in the drawer and waits for better times \\nSo, seniors are lured into risks of an inflated stock market. \\nStart learning to earn online folks, go to EarnCashSecrets dot com to start your free training. \\nI do not see the employment situation improving in the next 10 years. Cheap labor is available all over the place, both overseas, and inside the USA itself (imported from south of the border). Ralfine \\nYes, replace Obama with a white supremacist and everything will be well. Put the women back in the kitchen and you suddenly have zero unemployment. As you have now more jobs than workers, get in some mexican slaves, but without their families. Return them when they are worn out. Cut all welfare. But only the welfare to the poor. Cut all taxes to the rich. Force unemployed to work for free to get necessary work experience. Promote wars for American-style democracy and let the soldiers get their spoils directly on-site. Billy G \\nYour ideas are intriguing to me, I’d like to subscribe to your newsletter. Ralfine \\nHistory repeats itself. Read some books about the Third Reich. The BBC also has made some good documentaries. And dont forget to read Mein Kampf, which was mandatory reading, so every German should have known what was happening. \\nRead some American history, maybe Howard Zinn: A people’s history of the United States. jaxon64 \\nYou forget–Obama is a member of the party which created white supremacists in the USA, started the KKK, were the southern democrat slave holders, voted against the civil rights act 4 times from the 1860’s until the 1960’s and were even willing to die and have their sons die so that they could keep their slaves….etc. \\nI think the most surreal moment of 2011 was watching Obama give such a moving eulogy at WV senator (D) Byrd’s funeral. I still can’t figure out which was more mind-boggling. Having a man who is 1/8th black/african as the honored speaker at a KKK Grand Dragon’s funeral or.. vice versa- that a man who stirs the racial pot every chance he gets saying such glowing things about an ignorant Dem who hated blacks…. \\nPS: I’m not a supporter of the neo-cons like bush, mcCan’t or Obamney either so don’t waste your time with an attack as you defend “your blue team” Ralfine \\nYes, America is a strange place on earth. \\nI also found this on wikipedia: \\n“In 1997, Byrd told an interviewer he would encourage young people to become involved in politics but also: “Be sure you avoid the Ku Klux Klan. Don’t get that albatross around your neck. Once you’ve made that mistake, you inhibit your operations in the political arena.”[20] In his last autobiography, Byrd explained that he was a KKK member because he “was sorely afflicted with tunnel vision—a jejune and immature outlook—seeing only what I wanted to see because I thought the Klan could provide an outlet for my talents and ambitions.”[21] Byrd also said, in 2005, “I know now I was wrong. Intolerance had no place in America. I apologized a thousand times … and I don’t mind apologizing over and over again. I can’t erase what happened.”[10]” markthetruth \\nMr Bill : Mrs Obama is rich. Hope Your in DC Plenty of move where that one comes from. \\nthe end… \\nCan we do worse than Bush? How about Carter? Yes we can! Paul \\nMichael, I think it would be very interesting to see an article written by you discussing how the provisions of Obamacare kicking in 2014 will affect the U.S economy. I enjoy reading your articles. MichaelfromTheEconomicCollapse \\nThat is a good suggestion. Certainly Obamacare is not going to help things one bit. \\nMichael Stacey \\nMichael , alot of people are already feeling the effects of Obamacare. Workers are being reduced to part time. Under 30 hrs due to a provision in Obamacare which states employers have to provide health coverage to employees who work full time, 30 hours or more a week. \\nObamacare is already bending over the elderly even thou that was one of the arguements of the stupidcrats… They say it isn’t, but the boots on the ground say a different story…. markthetruth \\nOnly 1/3 of the 315 + 25(illegal) 340 million People in the U kfilly \\nWe know what it will look like. It will be ugly! markthetruth \\nand it won’t be natural either, man made ugly! \\nthe end. \\nThink 3rd world for a good idea of tomorrow in America. markthetruth \\nEverything is a SCREEN . Try and Go a day with out seeing one. \\nThe: \\nthe end… Mondobeyondo \\nThe next time you see a teenager, make note of whether he or she is plugged into an Android, or iPhone, or MP3 player, or some other digital device. \\nThen hand them an old fashioned book, and explain to them what it is. Heh! markthetruth \\nYep ! the Smart Andriods are making humans FAT, LAZY and DUMB. \\nthe end… FunkYou FunkMe \\nMeanwhile you’re using a computer, tablet, laptop, phone, etc. Hmmmm. These devices aren’t making humans fat, lazy, and dumb. It’s our society that does that. If our society geared these technological advances to be mainly the pathway to higher knowledge and productivity then we would be in a better position. In some ways it’s an individual thing for different people. I know some people that grew up loathing to read, but found joy in reading once they discovered eBooks. There are so many apps and potential apps that can help better organization and motivate people better, but it does no good if people don’t care. Simple fact is people just don’t care. This isn’t to generalize everyone. Some people care, but the majority of people don’t care. James \\nHow many of those people are stay at home moms or people in college etc… MichaelfromTheEconomicCollapse \\nJames: \\nYes, those are certainly included in the working age population, so we will never have a time when all of them are working. \\nBut what is alarming is that the percentage of the working age population that is working has not gone back up at all after falling so dramatically during the last recession. \\nMichael razorbacks \\nIts easy to get caught up in keeping up with the Jones’ and chasing the dollar. I struggle with how far to go in preparing for the next wave of economic problems. I live on a small farm (paid for) and have a garden spot, springs on the farm, nickels, ammo and guns…Problem is my work requires being gone for months at a time. My biggest concern is getting home if it gets very bad. So how much money stashed away is enough? That’s the million dollar question. K \\nMichael, once again you have touched on every major point. I believe you are totally correct. It is just another case of the numbers being rigged. Whether it is unemployment or the stock market, or the cost of living. All the numbers are rigged anymore. If more people were capable of critical thinking, the rigging of numbers, would have stopped working a long time ago. Remember, what is now called normalcy bias. We used to call, not being in contact with reality. And it was considered a mental disability. Jodi \\nThings are about to get much, much worse for those counting on unemployment benefits. This morning I logged onto my unemployment account & noticed a message saying that after April 1st unemployment benefits will be reduced to a certain percentage due to sequestration. Luckily, I found a job in November but anybody else who hasn’t been fortunate enough to find a job yet is going to feel the pain even more now. But interestingly enough no reduction in Obama’s golf outings & he doesn’t seem to care much. Mondobeyondo \\nYes Jodi, things are about to get very bad. Obamacare is going to be a job killer, for those who are still employed. For the long term unemployed, like moi… well… Jodi \\nMondo, I’m sorry you’ve been unemployed for a long time. It took me 14 mos to find work after I lost my good paying job for 13 years. God Bless you, I hope you find work soon. \\nI feel fortunate to have found a job but I only work 30 hrs a week & $5.00 less per hour than my old job. The reason why I’m working 30hrs…Bingo, that’s right Obamacare. Annoynimus \\nAnd because you continue to collect unemployment while working? Jodi \\nI know longer collect unemployment, I still have an account with the unemployment office. JackWms \\nShe didn’t say she was still collecting, prehaps you need to learn to read. Alika Nganuma Toshihiko Cripe \\nIve bee tirelessly on my bicycle looking for job North and sout of Melbourne FL. I cant get a job no matter how hard I try. They dont even count those who are trying reimburse their past crimes to better themselves. I have a felony and i cant find a job no matter how hard i try. \\nIm about to go homeless, loose my phone, my fiance, and my future. I cant even goto school i feel so helpless. El Pollo de Oro \\n“Obamacare is the perfection of crony capitalism that’s being sold as something that’s wonderful for the people. Insanely expensive care provided by crony capitalist cartels that have totally opaque pricing and are in cahoots with the central state that supposedly regulates them.”—Charles Hugh Smith \\n“Obamacare is essentially forcing us to buy a defective corporate product.”—Chris Hedges \\n“I share the right wing’s critique of Obamacare. It’s a disastrous bill. It was written by corporate lobbyists.”—Chris Hedges \\n“You need some health insurance? We’re going to privatize it. We’re going to make you buy from our pals that sell insurance. That’s what they call Obamacare.”—Gerald Celente Handog \\nDisturbing. Jodi \\nIt is very disturbing. I logged in for the heck of it yesterday to see if there has been any changes to unemployment & I couldn’t believe it. I don’t know how much of a percentage they will be reducing it too but it’s already barley enough to make ends meet. LazyIke \\nWhen a person runs out of unemployment, unless they register with the useless unemployment off, they are considered by the BLS as not looking for a job. Not necessarily true! charlie \\nThings are far worse than many know. We live in the rural area’s & we are being attacked at every turn by Agenda 21 AKA: Corporate farmers & others. Had 2 UN soldiers on our property. animals poisoned and slaughter as early as yesterday 2 calves killed in the same night, They have tried to burn down our place & attempted to kill us by running us off the road. We are very much on our own, as it is apparent the law enforcement is protecting them. It is very sad that people think this is a thing to save the environment because if they were out here in the war zone they would see it is exactly the opposite. Fact is it is a HUGE reason everyone’s standard of living is dropping and America is falling into a very dark abyss. Unless people wake up and get the UN out of the US it is going to get even worse real fast. I have been fighting these monsters for many years. AMERICA! WAKE UP! They are NOT your friends! If you have a problem, you isolate it and then resolve it. Everytime people isolate it, they push out a distraction to get minds on something else, but fact is Agenda 21 IS the problem & Americans need to get focused and stop them. Tex May \\ncharlie… make an appointment to see your Doctor. You need help man! charlie \\nYou do realize that those involved in this agenda all do the same things & say the same things, right, TEX? For the past 40 years it has been repetitious. The crazy card has been played to death to cover all this up. Fact is when people educate themselves on the happenings you are all very easy to spot. I find it amazing that so many Americans are willing to assist in the overthrow of their own country on a premise of a Utopia that will never exist the way you all think it will. charlie \\nHey Tex, I woke up to DEAD ANIMALS all over my farm this morning along with a bunch stolen again. I wake up EVERY DAY with trucks reving their engines all the way around my house, now let me tell you something if I wasn’t TRAUMA BASED RAISED BY SATANISTS & COMMUNISDTS this would drive me absolutely in sane, but FACT IS it is just another day for me because it is the ONLY LIFE I personally know. I am a CHRISTIAN. I KNOW why I am being stalked and tormented. These people have killed everything I love my entire life. I grew up in your so called Utopia and used to just watch your lives and became happy in doing so. My point is the actions happening in my life is NORMAL so though I may cry and be sad about what’s happening, being trauma based raised it’s not as traumatizing to ,me any longer what is sad for me is watching so many others enduring what I had screamed my bloody head off for years warning about and being called crazy which hurt my feelings at first but now I see what so called sane is and being crazy is an honor. Well, I have more dead animals to bury, so here I go again. Just another day, same thing over and over again. Euhill \\nAgenda 21 is just the tip of the ice berge. What is happening is a whole lot worse than that. What is happening is in the Book of Revelation. charlie \\nI also believe it is bigger than Agenda 21 ,I also believe they are a huge “player”… but do NOT believe this is the book of Revelations (yes, I am VERY familiar with my Bible),I admire the walk of CHRIST like no other…I can see why the world would be so jealous of him….. I believe this is one huge ((HOAX)) by the whore of Babylon played on the world & a great theft of the people. NONE of this is new to me as it is to many others, I have seen all this before. These monsters enjoy ” Crossing the centerline” when they drive….. over and over again. Euhill \\nYou’re the one that needs help if you can not see what is happening as a whole in the US, Europe, and UK. But then again you’re probably the type of person who would tell the Argentines what they went through in 2001 was a figment of their imaginations. What did happen in Argentina in 2001 is our future and when that time comes, may you get all you have coming to you, Tex May. seth datta \\nSecrets are kept in plain sight. Did you know Obama is the puppet that heads the UN? \\nSo he has to make a choice. Is he truly the leader of the free United States, or is he the leader of an anti-freedom, anti-US communitarian government? \\nAnd do we trust a leader who lies about his birth certificate and lies about his religion. Two basic things. What else is he lying about? \\nIt only takes one true ideal, one real direction and even just one person to change the nation. Unfortunately, we have the wrong one. Roger Smith \\nSome call him President….I call him a one-man sleeper cell. Tex May \\nI call you NUTS! Makati1 \\nDidn’t mention that those 101 million also do not have money to spend to increase demand so that corporations need to hire. And the others that are employed are getting shrinking paychecks and buy less and less. No corporation is going to hire and increase production when there is no market for their product. That is the ‘Catch 22′ of the current situation. But, then the other mentioned reasons also fed the collapse in jobs. Welcome to ‘for profit’ capitalism. Do you have your food stamps card? You soon may. quercus454 \\nI have talked that same point over and over again with my more liberal family members. Some 30 plus years ago corporate American found it was cheaper and easier to cut labor, rather then build a better mouse trap. They pushed the idea of free trade to increase profits and because of that today we have lost millions of well paying jobs. At first the effect was not so noticeable. Families with declining incomes borrowed on their homes and credit cards to try to keep their standard of living at the same level it was. Now the effects are really kicking in. Those who tried to keep up their standard of living by increasing their debt, lost on that gamble, the economy never picked up. \\nBy essentially destroying most of the middle class, corporate America killed the goose that laid the golden egg. As more and more people lost their jobs or had their wages decline because of foreign competition, their ability to purchase good and services also declined. Credit is no longer viable for many. Factor in Obamacare cutting employee hours and inflation and it is no surprise that many of America’s biggest and oldest retailers are closing stores. In order to prosper and be successful businesses need customers. If you remove a large segment of your customer base either by unemploying them, reducing their wages or displacing them with low wage foreign labor, you are going to fail. \\nCorporate American brought this on themselves by being greedy and short sighted. Congress hasn’t a clue as they still think increasing the population thru immigration will some how solve or negate their previous bad decisions. Adding more low income consumers will not replace the millions of middle class incomes that have been lost. Fred Montgomery \\nPeople want to work for a living; a man does not want a handout. The problem is there are no jobs and the few jobs out there don’t pay anything. No one can live off of nothing. Now, we are now promoting welfare and food stamps over hard work and perserverance. Meanwhile, the robber barons who started all of the economic misery keep robbing us blind. Syrin \\nTo quote Monty Perelin, “If you are a product of the government schools and are legal to work (i.e., have skills enough that you are affordable at the minimum wage or higher), at what point do you realize that there is no need to go through the hassle of actual work. You can live pretty well by staying home and taking advantage of the entitlements available to you. That is exactly what a larger and larger percentage of the population are realizing. In many cases, it is economically irrational to work. \\nThis behavior creates a social pathology that only worsens over time. Kids learn from their parents that work is not necessary and the many ways to game the system. In this regard, look for this problem to become worse over time unless these programs are cut back.” Syrin \\nFrom zerohedge, ” Now we finally know that the very bottom of the entitlement food chain also makes out like a bandit compared to that idiot American who actually works and pays their taxes. One can only also hope that in addition to seeing their disposable income be eaten away by a kleptocratic entitlement state, that the disappearing middle class is also selling off its weaponry. Because if it isn’t, and if it finally decides it has had enough, the outcome will not be surprising at all: it will be the same old that has occurred in virtually every revolution in the history of the world to date.” Syrin \\nMichael, why do you say most people don’t want to be dependent on gov’t? This is the age of the GARYs. Back in the 30’s, one would get gov’t assistance as a last resort with one’s head hung low in shame. Now it’s a career decision. People “work” to find the best way to milk the system for all they can. \\nWant to fix the problem? If you receive gov’t assistance in the form of welfare, food stamps or medicaid, YOU LOSE THE RIGHT TO VOTE BECAUSE IT’S A CONFLICT OF INTEREST. That way those who PAY for all these leeches get to decide how much they are willing to surrender. Two YEARS of unemployment? I don’t think so. Hank Kingsley \\nSo anyone who works for these parasitic Wall Street scumbanks shouldn’t be allowed to vote? I quite agree. Not American \\nI love your profile picture, it fits you! FunkYou FunkMe \\nConflict of interest?! We vote so that our voices (THE PEOPLE) are heard. Whether you like it or not, they are just as much part of the people as you are. Colin \\nI am reading Aristotle. He speaks of a continuum. On one end, there is excess, and,. on the other, there is deficiency. In the middle, there is the intermediate. Now applying this to the job market – there are people who are unemployed (the deficiency), who aren’t fully unemployed nor employed (the intermediate), and who are fully employed (the excess). For many on government dependence, they are attempting to reach the intermediate, but are not succeeding. \\nMy mother is deficient – she has no job. She wants to be employed, she wants to be on the other side of the continuum. She receives unemployment assistance. The state says, “You want money from us, look for a job.” She does, but hasn’t got a job. \\nThere was a belief in Aristotle’s time that the wealthy had an obligation to the city-state (the polis). They paid for the city’s defenses, for the construction of public works, and so on. It seems to me that we as a nation have failed to persuade the wealthy that they have an obligation to their homeland. I am not speaking of taxes solely, as Gary2 does; I am thinking of construction projects that could rebuild this country’s infrastructure and get people to work. \\nAristotle considered munificence to be a intermediate between vulgarity and shabbiness. Far too many of our wealthy are shabby. \\nThere are Senators and Representatives in the Congress who recognize that this country’s poor have become “Invisible”. However, they are few in numbers, and the majority opinion dominates the political discussion. Mondobeyondo \\nA sad commentary of America, circa 2013. \\nThe ONLY reason why the “unemployment rate”dropped one tenth of a percentage point for March, is that so many people have given up looking for work. \\nObamacare will certainly not help matters. It makes an already bad business environment downright horrific. kfilly \\nObamacare might help with the unemployment numbers as every full-time job is likely to become 2 part-time jobs. Boy, those job number will be looking better once it goes into full effect. Sigh! chilller \\nIt was all Obama’s hope to change us into a subservient nation under the thumb of big gov…without all of the extensive entitlements, the masses of unemployed would have overthrown the system by now, hence the gub-mint has bought time to put itself into a defensive posture for when the music stops and there’s 101M+ people trying to find 10 chairs. Mondobeyondo \\n101 million working age Americans, are 101 million working age Americans who are not able to contribute to the economy. \\nThey can not buy furniture. They can’t afford cable TV, so they’re stuck watching “The Voice” on network television. They can’t afford new clothes, a new car, jewelry, or a professional sports game. What are these people concerned about the most? Food. A roof over their heads. Keeping their children (if they have children) educated and healthy, and keeping themselves sane in spite of the Mess we’re all stuck in. \\nThere will be NO real economic recovery, unless and until our nation’s manufacturing base is rebuilt and restored – and there are serious doubts about that happening soon, if ever. Everything else – the stock market, low wage service jobs, etc – is just chasing after rainbows. El Pollo de Oro \\nMondobeyondo: Excellent points. There will be no economic recovery in the BRA if the only jobs being created are crap service jobs. When millions and millions of people are working 50 or 60 hours a week and still cannot make ends meet, what you have is a Third World economy. There are plenty of low-paying jobs in Guatemala and Bolivia, but not nearly enough jobs that pay a decent wage. And good luck starting a small business in the BRA. The deck is totally stacked against legal small businesses in this banana republic. \\nSo what happens when you have millions of people who have a strong work ethic, realize that the game is totally rigged and are sick of their miserable, desperate, hopeless circumstances? They join the underground economy, which (as we’ve seen in México) can have horrifying consequences. Unless this country rejects corporatism, returns to true capitalism and free enterprise, rebuilds its manufacturing base and becomes friendly to small businesses, the only growth areas will be: (1) dead-end crap service jobs, and (2) crime and the underground economy. I’m not optimistic. Mondobeyondo \\nOne final observation, before having my fourth can of “Red Bull” energy enhancing beverage: \\nIllegal immigration. It has a huge affect of the legal working American. It’s a huge topic here in Arizona (and frankly I’m sick of hearing about it every day, but nevertheless…) \\nIf you’re unemployed, you are competing with illegal immigrants who are willing to work for $3, $4/day. They don’t mind a bit. It’s far more money than they made in their homeland. Perhaps YOU can’t live on that, but they’re fine with it. \\nSo your professional American roofer guy who maybe earns $20 or $25 an hour, is getting replaced by some guy from Michoacan or Guadalajara, maybe Honduras, who’s willing to work for $5/hour. His employer does not have to pay licence/bonding fees, nor insurance, nor health care, nor Social Security, nor TAXES!! \\nDon’t get me wrong – I’m all for LEGAL immigration. But not ILLEGAL immigration! quiet_forest \\nUh, I wouldn’t be so keen on legal immigration anymore either. The Federal government runs four work visa programs. Three of those programs do not require the employer to pay any taxes or benefits. \\nSo, who do you think businesses hire first? The American that the government makes them pay taxes on, or the foreign worker who, because of his status, can’t quit? They can treat him like an indentured servant, cheat him on wages, pay no taxes for him, and it’s (mostly) legal. \\nEverything that is happening now is deliberate, top down bottom up. Government regulation crushes small business and stifles competition, while welfare programs demolish the work ethic, creating a defeated, compliant population. We are literally being turned into sharecrop tenants in our own country. If this next amnesty goes through, we are finished. The future of the whole country is already being showcased in California. We were never the land of fruits and nuts. It only looks that way. The reality is that, thanks to the machinations of people such as George Soros, California was the first state to become the land of rigged elections. FounderChurch \\nDEMOCRAT GOVERNMENT TRAINED BUMS: \\nWhere we started to go wrong was back in the Great Depression. Our moral center broke and we put everyone on welfare that whined for it, and it ruined the country permanently. \\nIt taught the people they didn’t need to fend for themselves and that the government would provide for them, if they would just sit on their rear ends and yelp like dogs waiting to be fed. \\nWhat those unemployed workers needed in the depression was to be kicked in the rear end, and told to “root hog, or die.” \\nAt the same time we were putting these bums on relief, we had millions of acres of good land laying unplanted, and people’s yards surrounding their houses just laying there. Why should people even plant a garden in their backyard when the government will feed them? CitizenS \\nThings are starting to really hit here in WV. My misses was laid off 2 weeks ago and she was the person that put miners for certain coal companies to work. Guess if they don’t need miners, they don’t need someone to call them in. but I met a friend the other evening (Friday night) to drop some things off to him @ the local movie house. The place was a ghost town! The entire strip was near vacant. This included multiple resteraunts, the big box stores, and multiple small shops. Batten down the hatches because when the poor state starts to see it, its gettin rough. Lucy Goldstein \\nCoal mining is such a source of contamination to our planet it needs to be eliminated! CitizenS \\nLucy I won’t argue that coal is dirty. However, the power plants in our area have upgraded to the point that the only byproduct of firing with coal is gypsum, which they make drywall mud with and water vapor. Done correctly most of the land mined is reclaimed into something useful instead of an area that was previously all but inaccessible. That being said, yes its dangerous and dirty, but its a livelyhood for the men that work in the coal fields. billy \\nHomeless Bill lives in Anchorage, AK. He has an apartment, and is a professional panhandler. I don’t feel sorry for people like Homeless Bill, because he is a fraud. I do feel sorry for the millions of others not like homeless bill. Harold \\nThe nation of sheeples will continue to support this WH incompetent fool Tim \\nThis article is on Zero Hedge! Congratulations. none \\nThank God President Obama has expanded the immigration numbers! \\nAlso now, they will be able to get government guaranteed loans to buy up all the small business that they own! This is why you always see foreigners running the gas stations and small convenience stores. \\nAnd I was about to start off with GOOD NEWS: Michael. Jagrick \\nStuff like this tells me that a lot more (deemed) illegal activity will go on in the future. Euhill \\nYes it will until the end game has been achieved. And when that has happened, things will not be like they once were. 2Gary2 \\nMichael=–are you still pretending to be named Bill and holding that sign? 2Gary2 \\nMichael–you are correct in what you say in this post. By any definition Obama is an abject failure. His problem is that he is a moderate republican posing as a dem. Before everyone starts calling me names stop and think of what Obama has done and compare it to Nixon/Ford. Robert (qslv) \\nGary, are you getting gun-shy? Oops, politically incorrect choice of words, lol…….I actually agree with you that Nixon Ford was a bad choice …off the silver standard, dollar devaluation, stagflation, the phony oil crisis. Republicrat or Demmican, they all suck equally….Where you err is to take sides in the phony two party illusion. You refuse to see those behind the curtain. Mondobeyondo \\nAnother job fair coming up this Thursday. Maybe THIS will finally be the one… Zaboomafoo \\neconomic recovery is a house of cards; illusory. Craig Stacy \\nLike the pic of the bum above… he says it all – \\n101 Million Working Age Americans are too lazy to work or even look for jobs Fred Sheetz \\nI agree Craig… Here in PA there are tons of high paying jobs in the gas drilling industry, from skilled truck drivers to folks with no experience… People are just too lazy to work. Bruce \\nI have read all the comments and it is obvious that NO PRESIDENT is responsible. NO MATTER who is in office or gets into office they are nothing but puppets. Listen, the economy has NO way of recovering, PERIOD!!! Manufacturing is in shambles, wages have dropped to slave levels for many. What company wants to pay 10-15 bucks an hour when they can get the assembly or machining done for pennies on the dollar? Not to mention not having to pay unemployment taxes, matching Social Security, holiday pay, sick pay or vacation plus higher corporate taxes within the US. Employment will NEVER come back. It can’t come back. Unless and until we place significant tariffs on all overseas products we are DONE. No other way will we ever be competitive or even hope to be. Who amongst you will work for 1.25 an hour with no benefits? Now is the time to prepare seriously to avoid hungry bellies in your family. I don’t think ANY commentator, politician, or genius can dispute the fact that we are in a perfect storm. The truth in the matter is Clinton started all this with NAFTA and other free trade agreements. We are screwed, with NO WAY OUT!!! \\nBruce, Bush Sr allowed NAFTA to go through, but it was a Democrat strictly sponsored bill. Clinton unleashed the real monster. The WTO. Mondobeyondo \\nThis is a brief excerpt from Jon Talton’s excellent blog (he was a former economic columnist for the “Arizona Republic” newspaper, until management forced him out. He now lives in Seattle.) \\n“…Some macro realities will not go away: most Americans are much poorer after the recession; wages are stagnant and have been falling on average for years; unemployment remains high and many may never find work again; “consumers” are still carrying more debt than historic norms; changing tastes and demographics, with talented young people and many boomers preferring real cities, not Sun City; Phoenix still has a low-wage economy…” \\nThe same thing can be said for the entire country. Don_in_Odessa \\nNow, this is the way to write a story on the internet. References posted with links to the actual dot Gov web sites. Little good it does these days though. The “Revolution” took a little over two hundred years and it looks like we have laid down our pitch forks and rocks, and retired to the latest news about Lindsay Lohan. Oh,…….we lost! SalMoanella \\nSchool maybe, retirement no. The age 55 plus group is actually increasing in the labor force. Make no mistake about it. It’s the obama non economy. Alasha Tim Mullins \\nIt’s good that somebody has the knowledge to mention the Third Reich. America is no longer the America of my youth. But any of the comments slamming capitalism, supremacism, or anything else from an earlier era is off base. \\nCheck the voting records of congress, as well as what was being passed, what it meant, and what riders were attached to the legislation. After that thoroughly confounds you, look up the definition of political far left, political far right, observe the real world results, and ask yourself why there is no real difference between the two. \\nThe problem is government period. We need less of it. Politicians need to learn that their job descriptions cover far more than simply passing laws. We don’t want our nation changed, we want it fixed. \\nThe American People have spoken, but President Obama has not listened. And who comes next? He bought MRAPS for DHS, what will the next person buy? Attack Helicopters? gary larson \\nMICHAEL. Your article is misleading.. \\nThe 89,967,000 figure is the number of Americans “not in the labor force”. That includes those too young to work, the retired , those institutionalized and those in the military. \\nThose numbers have always been high. \\nPease correct your mistake. gary larson \\nMICHAEL. Your article is misleading.. \\nThe 89,967,000 figure is the number of Americans “not in the labor force”. That includes those too young to work, the retired , those institutionalized and those in the military. \\nThose numbers have always been high. \\nPease correct your mistake Victoria \\nOur total population is a little over 300 million according the Bureau of Labor Statistics. If you take out children and the elderly that aren’t working that only leaves a little over 210 million working age adults. It is not possible half of all working adults are unemployed or not in the workforce. This article is full of crap. priya \\nTired of Posting jobs in different websites? A great news for you. MyDeals247 introduces an unique model to find the right job which exactly matches your experience and expected salary. No nonsense of getting too many alerts. Most of the employer trust the judgement of MyDeals247’s new recruitment solution. If you have the right skills, you will get a call from the employer in no time. Just login and create your profile. Once in a day, you just login into the system, you will find the matched jobs right on your dashboard. Just submit them. Its a very different solution. Its fun! FunkYou FunkMe \\nI honestly believe the government needs to create more jobs. You can nag and complain about it all you want, but let’s think about it. Sales Revenue in US soon will reach $5 trillion/year if it hasn’t already. I remember looking that up. I’m not sure if this is just in retail alone, but if it is then the numbers alone help my case. $50 billion plan to job 1.25 million Americans. This can be accomplished by a 1% federal sales tax. Pay could range from 30,000-50,000. 2% sales tax to extend the number of workers or including cost beyond labor. \\nAs a developed country we should pride ourselves in having a nation where a larger percentage of working age people are working, the community are clean, and advancements are made to better our communities. All my life I’ve gone up and down streets acknowledging trash littered throughout the sides of roads and even in creek/river areas. I never could understand how we let ourselves become so filthy. Growing up I was always told that people volunteer and serve community service through their probation officer after doing a crime. With that said I always remember seeing the same trash stay in specific spots for weeks. To this day I continue to see trash remain in spots for days. I never make an uproar about it because I know I could very well spend a day off from work to walk down my community and clean it up. Honestly I keep telling myself I’m going to do it, but after working a full week sometimes I don’t feel like doing anything. So I talk myself out of doing anything. \\nThis probably seems like a small insignificant task to consider a job, but it’s not much different than places that have janitor/maintenance workers/contractors. This is only one example. There are probably way more ideas to better our nation in multiple ways. I just know that creating that many jobs in a short period of time would be an immediate benefit to the economy and help it continue to grow. Now that we are working on getting out of a recession it is absolutely necessary that we figure ways to improve the economy. 1.25 million jobs added means 1.25 million potential more people to turn back around, pay taxes through income and sales, and contribute to businesses(big and small). The better business becomes for businesses the better their able to provide for their workers and themselves create more jobs. If I’m a small business owner gaining a lot of business with my one location open, eventually that would lead to opening more locations, this would involve creating more jobs. This problem with no jobs actually created is the result of many jobs disappearing. Tons of layoffs result in the image and reality of job growth not occurring. That is sadly the case of what we’ve experienced over these years. We need to let our voice be heard to move forward. \\nBTW looking at federal sales tax wasn’t to necessarily say it’s the way to go. I’m a fan of the idea that our high sales in America can do wonderful things for our economy and our future. With that said I’m not naive enough to say it could replace the income (personal/corporate) altogether with what our current spending is. peggie gor \\nLoan Application @ 2% (Serious Inquiry Only) \\nHello, do you need financial loan assistant, then your prayer has been answered, please contact us at: with Name,Amount,Duration and Phone Number. Reply Back'"}, "time": 1742562214.1011758}