{"duration": 0.1205143928527832, "input_args": {"text": "'At Planned Parenthood’s centennial gala this week, Hillary Clinton cited feminist novel The Handmaid’s Tale to urge supporters of the abortion chain not to relinquish the right to abortion, but  —   as it turns out  —   the Democrat Party has succumbed and abandoned many of its principles to become the “handmaid” of the abortion industry. [Planned Parenthood awarded the former Democratic Party presidential nominee its “champion of the century” award in New York City Tuesday evening as the organization held yet another celebration of its centennial anniversary.  The Hollywood Reporter noted that, in her remarks at the event, Clinton cited Margaret Atwood’s 1985 dystopian feminist novel, The Handmaid’s Tale. A new television production of the novel  —   about a totalitarian theocracy that forces women to procreate  —   can be seen courtesy of Hulu. “To paraphrase Margaret Atwood, ‘We can never let them grind us down,’” Clinton said. “In The Handmaid’s Tale, women’s rights are gradually, slowly stripped away. As one character says, ‘We didn’t look up from our phones until it was too late. ’” “It is not too late for us,” Clinton added. “But we have to encourage the millions of women and men who support Planned Parenthood to keep fighting. ” Democratic National Committee (DNC) chairman Tom Perez also recently announced that his party’s commitment to abortion is “not negotiable,” and that the Democrat Party would exclude   candidates for office. Perez’s autocratic remarks came after abortion lobbying group NARAL   America slammed the DNC for its embrace of Heath Mello, an Omaha mayoral Democratic candidate who had previously voted as a state lawmaker with his   conscience. “The actions today by the DNC to embrace and support a candidate for office who will strip women  —   one of the most critical constituencies for the party  —   of our basic rights and freedom is not only disappointing, it is politically stupid,” fumed NARAL’s president, Ilyse Hogue. In the wake of Perez’s comments, many Democrats have attempted to correct the optic of their party’s subservience to the abortion industry. While the party has attempted to portray itself as built upon morally upright virtues  —   such as diversity and inclusiveness  —   Perez’s statement clearly indicates the opposite. Democrats are now “newly divided   …     as they attempt to decide who they will welcome, and who they will exclude, amid soul searching over how the party should rebuild after its 2016 loss,” observes Clare Foran at the Atlantic, who interviewed   Democrats such as Sens. Claire McCaskill (MO) and Joe Donnelly (IN) who objected to Perez’s exclusion of   candidates. In a column at Jesuit magazine America, Robert David Sullivan also observed, “Abortion is proving that the Democratic Party can outdo Republicans in  . ” The author continued: Abortion is now the single issue defining the Democrats, and Ilyse Hogue, the president of NARAL   America, is the de facto head of the party. This gives the Republicans a major advantage in holding off electoral losses if the Trump administration continues to founder. Realizing the potential threat of a divide in a party that is already struggling,   individuals such as Planned Parenthood president Cecile Richards are attempting to smooth over the perhaps harsh reality that the abortion industry is running the Democratic Party. Richards appeared with MSNBC’s Nicolle Wallace this week, reports Newsbusters’ Katie Yoder. “Is it difficult right now to be a   Democrat?” Wallace asked Richards. “Do you guys make it difficult?” “Oh, I don’t think so,” she replied. “Abortion is one of these issues that it is  —   I think shouldn’t be politicized. ” Yoder notes, of course, that Planned Parenthood donated $38 million to Clinton’s campaign. House Minority Leader Nancy Pelosi  —   known for simultaneously touting her Catholic faith and her   views  —   also tried to soften Perez’s dictum that all Democrats must promote abortion. “This is the Democratic Party. This is not a   party,” she told the Washington Post, in response to a question about Perez’s exclusive statement. Pelosi, however, also acknowledged her doubt whether, at this point in time, a true   candidate could ever win a Democratic presidential primary. She suggested, in fact,  Democrats lost in the 2016 election races because their   positions on social issues did not appeal to average Americans who ended up voting for Donald Trump. “You know what? That’s why Donald Trump is president of the United States  —   the evangelicals and the Catholics,   equality,  . That’s how he got to be president,” she said. “Everything was trumped, literally and figuratively by that. ” The Post’s Karen Tumulty, however, reports Pelosi’s comment again drew the wrath of NARAL’s Hogue. “Encouraging and supporting   candidates leads to bad policy outcomes that violate women’s rights and endanger our economic security,” Hogue reportedly said in an email. Stephanie Schriock, the president of Democrat super PAC EMILY’s List, also reasserted the importance of abortion as a major issue for Democrats at her abortion lobbying group’s gala event this week. “They want us arguing about whether we’re a party focused on elevating diverse voices or a party focused on appealing to the white working class,” Schriock said, reports Roll Call. “And, from what I can tell, a lot of people in the Democratic Party are happy to have that argument. Well, I’m not one of them. ” “I don’t buy the argument that Democrats have to decide whether we’re a party of   white men in rural America or a party of   women in the big cities, a party of immigrants or a party of feminists,” Schriock said. “Democrats should be the party of working people. But we shouldn’t make the mistake of equating ‘working people’ with ‘white men. ’” At the Planned Parenthood event, Clinton  —   using the common euphemism “reproductive health care”  —   said about abortion, “[A]nyone who wants to lead should also understand that fundamentally, this is an issue of morality. ” The abortion industry appears to have succeeded at turning its “handmaid,” the former party of the “working class,” into one whose most cherished goal is ensuring women can end their pregnancies as they demand. Neither Perez nor the DNC responded to Breitbart News’s request for comment.'"}, "time": 1742562671.9138713}