{"duration": 0.10535717010498047, "input_args": {"text": "'More than a hundred years after Guy Zinn last appeared in a   game, his baseball card is causing a commotion. The fuss has nothing to do with Zinn’s skill. His playing career yielded some distinctions  —   including his being one of 11 players to steal home twice in a game and appearing as the first batter in Fenway Park. But most of his statistics over five   seasons, including a . 269 career batting average, suggest that he was a very ordinary athlete. The trait that set Zinn apart, and made his baseball card unusually valuable, was his ethnicity. Zinn was Jewish, which all but guaranteed him a following for generations. A fan subculture has long coalesced around Jewish ballplayers, so much so that their cards have a special category on eBay. Jeff Aeder, a Chicago real estate developer, is one of the most prominent figures in that subculture, and a 1914 Zinn card owned by a Maryland man has become, as other collectors describe it, Aeder’s holy grail. It is believed to be the only card of its type still in existence. Aeder offered $125, 000 for the card in 2014 and nearly claimed it. But the deal went sour at the last minute. Aeder balked because, he said, he received a poor appraisal of the card’s condition. The owner, Dan McKee of Baltimore County, refused to renegotiate. “I blocked his email,” said McKee, who bought the card for $2, 500 in 1995 at a show in Fort Washington, Pa. “I don’t do business like that. If you make a deal, you make a deal. ” “If Zinn was not a Jewish player, this card is probably worth $10, 000,” Aeder said. “If you talk to any dealer or collector, they’ll say McKee’s idea of value is the most overblown, crazy valuation of all time. ” So why was Aeder willing, at one point, to pay $125, 000? “It really is something that if you have the means and the obsession, then someone pays a lot more than it’s worth,” he said. Aeder and McKee, both 54, remain in a bitter standoff that highlights how passions that sprout in childhood can drive the sports memorabilia market. “Zinn was not a significant player. The card, and the brouhaha surrounding it, is more interesting than the man,” said John Thorn, the official historian for Major League Baseball. “If anything, it illustrates something so interesting about the hobby, the acquisitiveness about the fan. There is this transfer of power by owning this thing. ” McKee, a software engineer who now works part time, became a collector when he was 7 and ultimately concentrated on unique cards and sets. McKee periodically posts some of his cards on auction websites  —   mostly out of curiosity, he said. He tends to list his items at exorbitant prices because, he said, he loathes parting with any card. “I got stuff up in my eBay store that is actually part of my collection,” McKee said in a telephone interview. “And every now and then, somebody hits the ‘buy it now’ button and I’ll scream. ” He did sell an 1894 Baltimore Orioles set  —   which was produced by the Alpha Photo Engraving Company  —   for six figures in 2006. McKee said the transaction had helped pay for his current home, but he declined to specify the sales price or the worth of his overall collection, which he called “too valuable to admit to. ” McKee displays much of his memorabilia in open cabinets and a World War II map case that he received from his Army National Guard unit. The more valuable items, however, are kept in safes. “I keep a   in each one,” he said, then added dryly, “but I’d rather not use it if I don’t have to. ” Aeder also started collecting as a boy, while growing up in a family that, he has said, included Dodgers pitcher Sandy Koufax in its Yom Kippur prayers to honor his choice not to play in Game 1 of the 1965 World Series because it fell on the holiday. When Aeder was in his 30s, he said, he decided to sell his entire collection at a card show. That plan did not work out. “Instead of selling, I wound up spending every penny on me buying new cards,” he said. After completing the sets from his childhood, he turned to collecting the cards of Jewish baseball players. “Many collectors are happy just to get one card of each player,” said Martin Abramowitz of Newton, Mass. whose collection ended up with Aeder after Abramowitz sold it to someone else to help pay for his daughter’s wedding. “Jeff is determined to get every card of every Jewish player. ” Aeder sees curating such artifacts as an extension of the philanthropy that prompted Chicago Magazine to pick him and his wife, Jennifer Levine, as its “Chicagoans of the Year” in 2013. Among other things, the couple founded the Wolcott School for children with learning disabilities and Milt’s Barbecue for the Perplexed, a kosher restaurant that donates all of its profits to charity. In March, Aeder introduced the online Jewish Baseball Museum. “My idea was to celebrate both the rich history of Jews in America and how baseball was an opportunity to fit in,” he said. “And today, now that they fit in, it’s an opportunity for them to feel more Jewish. ” McKee said he had no idea that Zinn was Jewish when he bought his card more than 20 years ago. McKee valued it for another reason. It was part of one of three sets that appeared as an insert in The Baltimore News and that provided a full season schedule on the back of each card. A 1914 version of these     included the first card ever made of Zinn, who was then in his fourth season and playing for the Baltimore Terrapins of the Federal League. Unlike the more popular cards of that era, which were produced by the American Tobacco Company, the   were made from relatively thin material  —   like that of a playing card, but without the slick coating  —   and they were mostly discarded at the close of a season. As a result, few exist today. McKee said he had discovered 50 cards from the three   sets some of them turned up as markers in old books. Aeder first spotted the Zinn card in 2014 on McKee’s eBay store, where it was originally listed in 2010 as one of McKee’s “show and tell” items  —   for $250, 000. “He wrote me and offered me $10, 000,” McKee said. “He rubbed me wrong, right off the bat. ” At Aeder’s behest, McKee said, he took a vacation day from his job to drive four hours to New Jersey to have the card authenticated  —   or “slabbed”  —   at the Sportscard Guaranty Company. “I wasn’t even going to try to get a number,” McKee said. But the company also rated the card, giving it a one out of 10. “It’s a   card,” McKee said. “But it’s technical grade  —   because of the blue all the way to the edge, it has some chipping, it has a crease, it has some paper loss on the back  —   they’re never going to give it more than a one or a 1. 5. ” The final grade disturbed Aeder. “The pictures he had sent did not look like it was a one,” Aeder said. McKee said Aeder had suddenly begun overstating the importance of the card’s condition. Aeder did ask about it in their first email exchange, McKee said, “and I answered: ‘The only one known. That’s the only condition you need to know. ’” At an impasse, McKee and Aeder parted ways. They say they have not been in contact since. “I’m coming to terms with the fact that I may never own the Zinn card,” Aeder said. “Well, at least, I know I will never buy it from Dan McKee. ” But both he and McKee hold out hope that another Zinn   card could still turn up somewhere. “I have hopes that there’s plenty more of those out there,” McKee said. “That I’m going to find. ”'"}, "time": 1742628299.0753932}