{"duration": 0.038741111755371094, "input_args": {"text": "'When the Olympics are held in Pyeongchang, South Korea, in 2018, NBC will be broadcasting the Winter Games live across all time zones for the first time, the network announced on Tuesday. The move addresses the   number of people who have instant access to results and events through social media and internet streams, including NBC’s own live coverage online. “That means social media won’t be ahead of the action in any time zone, and as a result, none of our viewers will have to wait for anything,” Jim Bell, president for NBC Olympics production and programming, said in a statement. “This is exciting news for the audience, the advertisers and our affiliates alike. ” On most nights, in addition to morning and afternoon coverage,   broadcasting will still begin at 8 p. m. Eastern. That coverage will be followed, coast to coast, by local news and a variant of the broadcast the network will call “Prime Time Plus”  —   a nod to the West Coast audience  —   rather than declare it a   slot. With many major events taking place in the morning on the East Coast, which is 13 hours behind Pyeongchang, sports such as figure skating and snowboarding will air in prime time. NBC’s delayed broadcasts during past Games were the subject of some criticism as digital audiences grew. Previously, viewers in the Pacific and Mountain time zones would receive events on a   or   delay so that they fell within each region’s   slot. Viewership figures, however, highlighted the shrinking interest in the television broadcast of the Olympics. For the 2016 Games in Rio de Janeiro, TV audience figures averaged 25. 4 million over 17 nights, a decrease of 18 percent from the 2012 London Games. Online viewership, the network said at the time, increased 29 percent for the Rio Games compared with 2012. In deals in 2011 and 2014, NBCUniversal’s parent company, Comcast, bought exclusive broadcast and digital rights to the Olympics through 2032 for about $12 billion. Last month, the network announced that the   Bob Costas would be replaced by Mike Tirico, who will be the   program host during the 2018 Games. The opening ceremony in Pyeongchang will be held Feb. 9, and the event will run through Feb. 25.'"}, "time": 1742561791.935004}