{"duration": 0.11301445960998535, "input_args": {"text": "'We Are Change \\n\\nBill and Hillary Clinton have a long history of losing documents during various investigations and scandals over the years going all the way back to their time in Arkansas.\\nIt’s not just the current investigation into deleted emails in which the State Department’s own internal probe found former Secretary of StatW Hillary Clinton violated federal record keeping laws . It’s not just whitewater, it’s several investigations where documents have turned up missing, exonerating the Clintons and clearing them of guilt, despite huge violations of obstruction of justice.\\nHISTORY OF LOSING DOCUMENTS DURING INVESTIGATIONS: \\nIn 1999, investigators looked into then First Lady Hillary and President Bill Clinton’s scandals, which included Whitewater, Travelgate, Filegate and other scandals. It was discovered that more than 1 million subpoenaed emails were mysteriously “lost” due to a “glitch” in a West Wing computer server . \\nDuring the Project X email scandal, career White House staffers and contractors found that someone close to the first lady had basically turned off the White House’s automated email archiving system. \\nWHITEWATER: \\nThe first notable case is the whitewater land scandal fiasco, which started in Arkansas when Bill Clinton was governor. The allegation is that the Clintons used the Rose Law Firm and the Arkansas Financial Department Authority, as well as Madison Guaranty Savings and Loan owned by Susan and Jim McDougal , to scam Arkansas residents. An investigation was started when the Clintons invested and lost money in the Whitewater Development Corporation.\\nAn entire article could be dedicated to the Whitewater scandal, but what is important here is that documents for the whitewater investigation turned up missing were later discovered at the Clintons’ home .\\nBen Shapiro of Breitbart noted in his own article on Hillary’s long history of hiding documents :\\nIn 1996, a special Senate Whitewater committee released a report from the FBI demonstrating that documents sought in the Whitewater investigation had been found in the personal Clinton quarters of the White House. The First Lady’s fingerprints were on them. The documents had gone mysteriously missing for two years. \\nMark Fabiani, special White House counsel, immediately stated that there was no problem, according to the Times: “He added that she had testified under oath that she had nothing to do with the documents during the two years they were missing and did not know how they ended up in the family quarters.” Hillary remains the only First Lady in American history to be fingerprinted by the FBI. Those weren’t the only missing Whitewater documents later found in the Clinton White House. \\nVINCE FOSTER: \\nThe next notable case, which is also connected to Whitewater is Vince Foster. Foster worked alongside the Clintons as a top Rose Law firm attorney who had worked intimately with then First Lady Hillary Clinton throughout their career together. After Foster’s “suicide,” documents went missing from his office . Secret Service officer Henry O’Neill testified that he witnessed aides removing documents.\\nSeveral years later, more documents pertaining to Hillary Clinton and Vince Foster again vanished, this time from the National Library including a document from Ken Star’s investigation that proves that the “suicide” of Vince Foster was actually a murder . In those documents is the smoking gun that shows that Vince Foster sustained not one but two bullet wounds. One to the neck and one to the head an impossible suicide scenario.\\nIn addition to that, experts have called Foster’s suicide note “a forgery.” One of my rules is once, twice, okay, but three times is not a coincidence—it’s a criminal conspiracy. Conspiracy, as in the legal definition not a theory none of this is a theory when it’s well sourced.\\nTRAVEL GATE: \\nIn 1996, the day before the Whitewater documents were found at the White House, a two-year-old memo emerged written by a former Presidential aide. According to the New York Times it proved that Hillary Clinton “had played a far greater role in the dismissal of employees of the White House travel office than the Administration has acknowledged.” \\nPROJECT X EMAIL GATE: \\nAccording to Tom Fitton, President of Judicial Watch, Hillary’s top lawyer and top aide, Cheryl Mills “helped orchestrate the cover-up of another major scandal, often referred to as ‘Project X Email-gate.’” Over the course of years, the Clinton Administration allegedly withheld 1.8 million email communications from Judicial Watch’s attorneys, as well as federal investigators and Congress. In addition, Judicial Watch says that when a White House computer contractor attempted to reveal the emails, White House officials “instructed her to keep her mouth shut about the hidden e-mail or face dismissal and jail time.” \\n2015-2016 EMAIL GATE: \\nWhere do I start about the botched investigation of Hillary’s private email server? The obstruction of justice is so broad, it’s insane. She used “bleach bit” software the day after being subpoenaed, smashed several BlackBerrys and iPads with hammers, was tipped off by the DoJ and DoS into the investigation, according to Wikileaks, etc.\\nClinton’s close ally Terry McAulife gave a donation to the wife of the Deputy Director Of The FBI. Bill Clinton met with Attorney General Loretta Lynch towards the end of the investigation. The list goes on…\\n2 TERABYTES OF DATA MISSING: \\nTwo terrabyte drive with Clinton White House emails missing, presumed stolen from National Archives https://t.co/p3eZqxKxke pic.twitter.com/792rxje642 \\n— WikiLeaks (@wikileaks) November 3, 2016 \\n\\nYet even with all of the evidence, the current FBI director—who has been revealed to be connected to the Clintons—has once again refused to acknowledge the corrupt career nature of the Clintons.\\nDirector James Comey told Congress Sunday that the FBI does not recommend charges against Clinton, even after an additional 650,000 emails were discovered on the laptop of her aide’s estranged husband, Anthony Weiner.\\nWhether it’s deleting emails or covering up documents to prevent prosecution, it has always been the Clinton way. Why is it that journalists can uncover this past historic information, but the FBI investigators can’t? \\nSomething isn’t right. Drain the swamp and nominate AK for FBI Director 2017, and stay tuned to We Are Change. This case is closed. The Clintons are corrupt. That, or documents have somehow developed an artificial intelligence to stay away from the Clintons. It must be a right wing conspiracy. I would be willing to put my deplorable eggs into one basket and say it’s the latter.\\nThe post OBSTRUCTION OF JUSTICE: The Clintons’ Long History Of Losing Documents appeared first on We Are Change .\\n'"}, "time": 1742563714.9991403}