{"duration": 0.03196239471435547, "input_args": {"text": "'The 89th Academy Awards may well be remembered for its epic Best Picture gaffe ending  —   but that wasn’t the only mistake made on the broadcast. [During the annual In Memoriam segment Sunday night, a tribute to costume designer and   nominee Janet Patterson was botched when the Academy mistakenly used a photo of   Australian producer Jan Chapman.  The error was noticed quickly by dismayed Australian film industry veterans. “Oh dear. The #Oscars put up what I think is a photo of Jan Chapman, instead of Janet Patterson, for the In Memoriam segment,” film reviewer Rhett Bartlett wrote on Twitter. Oh dear.  The #Oscars put up what I think is a photo of Jan Chapman, instead of Janet Patterson, for the In Memoriam segment. pic. twitter.   —   Rhett Bartlett (@dialmformovies) February 27, 2017,  Others noted that Patterson is still “very much alive. ” Pic of my pal Jan   very much alive  —   was just featured in In Memoriam. #Oscars,  —   Virginia M Moncrieff (@VMMoncrieff) February 27, 2017,  hey @TheAcademy you need to pull this and replace with a photo of Janet Patterson, not very much alive Jan Chapman https:  .   —   palace films (@palacefilms) February 27, 2017,  As it turns out, both Patterson and Chapman were very close friends and longtime collaborators, according to the Hollywood Reporter. But the photo gaffe wasn’t the only issue with the traditional segment. According to the Daily Mail, the segment left out actress Alexis Arquette, comedian Garry Shandling, producer Dan Ireland, actress Doris Roberts and actor Robert Vaughn. The in memoriam gaffe came before the chaotic and disastrous end to Sunday’s ceremony that saw Moonlight win the prestigious best picture award  —   but only after La La Land was mistakenly handed the statuette. For more from the Oscars, including the full list of winners, check out Breitbart News’s livewire.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562345.0622735}