{"duration": 0.36818599700927734, "input_args": {"text": "\"[Hands Up installation by Basil Kincaid in Ferguson. heartacheandpaint.com] Henry A. Giroux Cultural Critic and Public Intellectual Editor's Note The institutions that drive and reinforce capitalism at its most direct and base level are not even considered by politicians – Hillary Clinton included – as needing dismantling in order to save children. Those institutions are (domestically) the so called “criminal justice” and “juvenile justice” systems, and (internationally) the military, mercenaries, and paid international forces that are hired to carry out US international policy where children are often collateral damage, and sometimes direct targets. The U.S. also uses poor children of all races, but disproportionately children of color, as front line expendable military troops. A s the distinction between the truth and lies fades in public life, politics appears to be increasingly emptied of any substance. As Lucy Marcus has observed , “Nowadays, facts and truth are becoming [more] difficult to uphold in politics (and in business and even sports).” Certainly, in the age of Trump there is a great deal of evidence to suggest that the appeal to reason, informed judgment and facts is at odds with the current political culture. That is, truth and evidence have gone the way of the electric typewriter, or so it seems.\\nAmericans seem to have a growing fondness for ignorance, an attitude that reinforces the downsizing of the civic function of language. Falsehoods and deceptions no longer appear marginal to political debate but now seem to shape much of what is said by the presidential candidates. This is shockingly true for Trump, who has organized much of his campaign around endless fabrications, sending fact checkers into a frenzy of activity. When Trump is caught in a falsehood, he simply ignores the facts and just keeps on lying. His followers could care less about whether he deceives them or not. \\nOn the other hand, Hillary Clinton has earned a reputation as a chameleon, willing to say almost anything to promote her political career, regardless of whether she sacrifices the truth in order to do so. Her email scandal is largely read as symptomatic of a more pronounced and deeper level of dishonesty. Consequently, she is viewed mostly by the general public as untrustworthy. In response, she has managed her truth deficit by invoking her lifelong defense of families and children. For instance, during the second debate she claimed she wanted “America to be for our children” and attempted to bolster her concern for the welfare of children by pointing to her early work with the Children’s Defense Fund. In the third presidential debate, she argued against Trump’s call for exporting 11 million immigrants by stating that she was against his deportation policies because she “didn’t want to rip families apart [and was against] sending parents away from children.” In her political television ads, she points to supporting policies that “will invest in schools and colleges [and will work to] develop an economy where every young American can find a job and start a family of their own.” \\nUnfortunately, Clinton only focuses on managing some of the problems that young people face, rather than doing anything to change the conditions that produce them. For instance, she says nothing about what education should accomplish in a democracy when educational policies are driven by a neoliberal economy that she supports. And while she talks about providing jobs for young people, she has little to say about transforming rather than adjusting an economy marked by wide gaps in inequality, wealth and power. \\nMatters of power, state violence, extreme poverty, institutional racism, a broken criminal justice system, the school to prison pipeline and the existence of the mass incarceration state, among other important matters, rarely if ever enter her discourse and yet these are major issues negatively affecting the lives of millions of children in the United States. And her alleged regard for children falls apart in light of her hawkish policies on global regime change, drone attacks and cyber-warfare, and her unqualified support for the warfare state. Her alleged support for children abroad does not capture the larger reality they face from when their countries are invaded, attacked by drones and subject to contemporary forms of indiscriminate violence. Rather than critique the US as a powerful engine of violence, Clinton expands its imperialist role around the globe. This is a key point in light of her defense of the rights of children, because her warmongering ideology puts children in the path of lethal violence. \\nAt the same time, Clinton’s promise to address the problems many children face in the United States reeks of a disingenuousness made visible by her history of siding with and supporting policies that were injurious to children. Not only did she once disparagingly call young people super-predators, but as the First Lady she strongly backed her husband’s campaign to “end welfare as we know it.” President Clinton’s welfare policies did great harm to poor children. They eliminated the Aid to Families with Dependent Children federal assistance program and infuriated Marian Wright Edelman, the president of the Children’s Defense Fund, to the degree that she ended her working relationship with Hillary Clinton. According to Edelman , the bill represented a frontal assault on the well-being of poor children and families. Yet as late as 2008, Hillary was still touting this pernicious welfare bill as a success. She also supported Bill Clinton’s “tough on crime” policies, which, according to Michelle Alexander , “resulted in the largest increase in federal and state prison inmates of any president in American history”— which has a devastating effect on the families and children of color. Finally, Clinton supported Bush’s invasion of Iraq, which led to the deaths of hundreds of thousands of children. \\nOccupying the right wing of the Democratic Party, Clinton has aligned herself with a war culture that supports drone warfare and continues to support military policies that result in the needless deaths of millions of children in the Middle East, Yemen, Somalia, and other places that bear the brunt of America’s foreign policy. It is difficult to imagine, given Clinton’s coziness with the financial elite, big corporations, the military-industrial complex and the reigning war culture, that she will do anything that will lessen the violence to which children, both at home and around the globe, will face under her potential reign as President of the United States. Clinton has nothing to say about the need for a collective struggle for economic and political justice. Given her past history, Clinton’s disingenuousness becomes even starker next to the images of war and violence that mark the bodies of youth both in the United States and abroad. Her commitments to war and security have been built on the misery, mutilation and deaths of young people and her recent alleged support for the welfare of children does little to cover up the many ways capitalism, militarism, state violence and racism are killing poor Black and Brown youth. Rethinking the Horrors of War \\nThe horrors of war became painfully visible when the image circulated of the lifeless body of Aylan (Alan) Kurdi, a three-year-old who washed up on a beach face-downin the coastal town of Bodrum, Turkey, on September 2, 2015, while traveling with other refugees toward the Greek island of Kos. A second haunting image appeared on August 17, 2016, showing five-year-old Omran Daqneesh, bloodied and covered with dust, sitting silently in an ambulance after an airstrike on Aleppo, a city in northern Syria. \\nOrdinarily, such images of children dead, injured and suffering motivate public outrage and also incite people to act. Omran’s image was widely circulated by mainstream news organizations and in the social media. The image provoked so much international outrage that the governments of Syria, China and Russia claimed it was pure propaganda and was staged. \\nOne of the most powerful images in history to provoke moral outrage and public anger was the image that circulated in 1955 of the grossly mutilated body of Emmett Till. That depiction of the effects of brutal racist violence helped to galvanize the civil rights movement. Nick Ut’s “Napalm Girl” via E-rea . \\nAnother image that changed the course of history was on display in 1972 when an anguished and terrified young girl was photographed running naked after a Napalm bomb burned and disfigured her body. The iconic picture played a significant role in mobilizing protests that helped stop the Vietnam War. \\nReactions to such horrible images still exist, but the brutal and unthinkable acts of violence they portray now seem to produce short-lived outrage and blend into the all-encompassing spectacle of violence and the fog of war. What is crucial to acknowledge is that the war has come home and has trapped many young people in its spiral of accelerated violence, which has become a new form of domestic terrorism and the primary force promoting a machinery of literal and social death for many youths. Domestic terrorism is now exemplified every day in media stories focusing on the killing of unarmed young people by the police and in the gun violence that is turning poor urban cities into war zones. Violence has become a habitual response by the state to every social problem. This has become more and more evident as the application of militarized police power produces on a daily basis a growing number of images of dead bodies which increasingly find their way onto the screen cultures of the social media. In the US, according to Marian Wright Edelman’s Children’s Defense Fund column , “Seventy-eight children under 5 died by guns in 2015 — 30 more than the 48 law enforcement officers killed by guns in the line of duty.” In other words, Edelman writes, “guns killed more preschoolers in one year than they did law-enforcement officers.” In Chicago alone, in the first eight months of 2016, 12 people were shot daily. According to a Carnegie-Knight News21 investigation : \\nFor every U.S. soldier killed in Afghanistan during 11 years of war, at least 13 children were shot and killed in America. More than 450 kids didn’t make it to kindergarten. Another 2,700 or more were killed by a firearm before they could sit behind the wheel of a car. Every day, on average, seven children were shot dead. A News21 investigation of child and youth deaths in America between 2002 and 2012 found that at least 28,000 children and teens 19-years-old and younger were killed with guns. Teenagers between the ages of 15 and 19 made up over two-thirds of all youth gun deaths in America. \\nGary Younge observes that every day in the United States “seven kids and teens are shot dead” which adds up to 2,500 dead children a year. What is clear is that neither mainstream political party nor their respective political leaders, including Hillary Clinton, “has a thoroughgoing plan for dealing with America’s gun culture, [one] that goes well beyond background checks,” he adds. This level of violence has deep roots in systemic structures of racism, inequality and poverty that make visible a broken democracy. Rather than being viewed as a social investment, poor youth of color are now seen as excess, threatening, suspect and undeserving of either a society in which they are protected or a future in which they are treated with respect. Instead of educating them, America spends large sums of money to imprison them; instead of building schools, we invest more and more in prisons; instead of providing quality health care, jobs and housing for them, we consign them to dilapidated schools, push them into the underground economy, and criminalize their behaviors. There are few safe spaces left for poor youth of color — rather our society offers them the promise of immiseration and a jail cell. This suggests not only a politics that has turned into a pathology, but also a dystopian logic that is as cruel as it is morally indifferent. \\nChildren and the Politics of Disappearance \\nThe killing of children in America and by US forces abroad has become part of a politics of willful disappearance in which a culture of cruelty, immediacy and forgetting works in tandem to eliminate any trace of the factors behind the production of violence in the service of the unthinkable — a society willing to sacrifice its own children to the industries that trade and profit in the massive production and distribution of guns. Such extreme violence no longer appears to have a threshold that would make it intolerable. In part, this is because the business of violence has become standardized as part of the culture of business. Or, as Phil Wolfson puts it , “the business of violence has become a far too accepted part of the fabric of contemporary life in the United States.” Tamir Rice remembrance / protest march. \\nWar culture becomes visible in the extreme violence captured in videos of the police killing of children, such as 12-year-old Tamir Rice and adults, such as Walter Scott, who was shot in the back as he was running away from his car by Michael Slager, a white North Charleston, South Carolina policeman. \\nThe scope and visibility of such actions often promote policies further wedded to military solutions, such as suspending civil liberties, accelerating the militarization of society and employing counter-terrorism tactics that rely heavily on military force. As violence becomes both normalized and spectacularized in the media, a war machine and culture becomes so deeply embedded in American society that, as Michael Hardt and Antonio Negri write in their book Multitude: War and Democracy in the Age of Empire , “war has become … a form of rule aimed not only at controlling the population but producing and reproducing all aspects of social life.” \\nYet, war machines do more than produce extreme forms of violence; they also fix whole categories of people as disposable enemies and force them into conditions of extreme precarity, if not danger. This is especially true of undocumented immigrants, poor Black youth, Muslims and those young people who now inhabit a neoliberal social order that has substituted precariousness for social and economic protections. Young people today are told they are on their own and not to expect much from a society that offers them poor health care, a terrain of uncertainty and insecurity, a crushing burden of debt, no hope for the future, and a market-based value system that tells them that their security and survival is no longer a social responsibility but personal responsibility. If the future looks bleak for many young people, it is not because of their own doing. Yet, the ruling elite and mainstream media journalists continually label them as losers, suggesting that their failure is a character flaw rather than the outcome of wider structural and systemic forces over which they have no control. In this instance, intolerable violence is masked by a state that has been taken over by the financial elite and that has abandoned its social functions while emptying out politics for an entire generation of youth. Indifferent to their own criminal acts, financial elites unapologetically “give precedence to private financial gain and market determinism over human lives and broad public values,” in the words of William Greider , and in doing so, inhabit the dark side of politics. Youth in a Suspect Society \\nYoung people, especially those considered the most suspect, provide a startling and eye-opening referent for analyzing not only how violence is represented and experienced, but also how it is distributed across a variety of interrelated sites. The daily violence experienced by youths, especially the most defenseless, does not often make news, because it exposes the harsh brutalizing reality that many youth face in a racist, homophobic, carceral and market-driven society. Such indifference is all the more tragic since one of the most unspoken acts of collective violence in the United States resides in its treatment of its children. \\nWhat I call the war on youth is alarming given that the fate of a society’s democracy is tied to the condition of its children. Dietrich Bonhoeffer, the Protestant theologian, once argued that the ultimate test of morality, if not democracy, is how a society treats its children. If we take this principle seriously, the US has failed its children, particularly those who are already underserved. Many face a bleak future filled with low-paying jobs, the effects of the collapse of the welfare state, the threat of a lifetime of unemployment, the paralyzing burden of high levels of debt and a political landscape that prioritized exchange relations over relationships built on trust, dignity and compassion. All of these factors make the future look bleak for young people, but there are also other more brutalizing forces at work that now bear down on many young people — forces that suggest that a distinctive type of hardness and culture of cruelty is now shaping American society and its view of young people. \\nIn this instance, young people marginalized by class, race and ethnicity are treated as disposable in a society in which the American dream has been turned into an American nightmare. Young people now inhabit a landscape of permanent uncertainty and crisis: one in which they are spied on, incarcerated, criminalized and written out of the discourse of democracy. No longer seen as a social investment, the most vulnerable youth have become a liability, subject to the harsh dictates of the neoliberal state and a symbolic reminder of a social order that offers youth no promise of an alternative and democratic future. The dictates of precarity and austerity have become repackaged and weaponized under neoliberalism and the ongoing morphology of violence normalized as the only possible mode of life. Under the reign of a war culture, America has arrived at a historical moment in which the war on children suggests that, as Stuart Hall, Doreen Massey and Michael Rustin have argued , “the very notion of a future seems to have been cancelled.” But the war on youth does more: it also reveals the raw reality of power politics and its willingness to crush early on all forms of resistance among young people. The Challenge Ahead for Progressives \\nThe current presidential race and the debates it has provided make clear that the Republican Party wants to eliminate whatever social provisions and public goods are available for young people while the allegedly more progressive Democratic Party puts forward reforms that do little to address the underlying economic, social and ethical conditions that produce them. Trump goes further and wants to accelerate the war on young people through a law and order campaign that expands the punishing state. Clinton points to some of the problems youth face, but in doing so fails to address a number of important issues, such as the high incarceration rates of poor Black youth, the neoliberal logic of financialization, the rise of the warfare state, massive poverty, systemic racism, the surveillance state, segregation, the militarization of the police, the destruction of the planet and a culture of institutional and symbolic violence that surges through society like an electric current. \\nIf children matter, as Clinton has argued, then it is crucial to recognize that her concerns are highly disingenuous because she refuses to dismantle capitalism as it exists and fight for a social order that is no longer ruled by the commanding institutions that serve the financial elite and the dictates of global neoliberalism. If young people are to be viewed as a crucial measure of a substantive democracy, it is important to take seriously what it means to create a society that addresses their needs and opens up a better future than the one the established political and financial elites have created for them. This is not a matter of reform; it is a matter of radical economic and political justice. Such a challenge must address the current struggles faced by young people by going to the roots of the problem. This will not happen by adopting the language of reform, which has no way of addressing why the plight of young people has dissolved into a domestication of the unimaginable. \\nThe real challenge for progressives is to build a broad-based movement and create a set of alternate educational public spheres to take on the task of transforming (rather than reforming) the existing capitalist social order and its poisonous relations of power and injustice. Children matter because they remind us of the need not only to create a more democratic future, but also to take seriously the collective struggle and modes of resistance that can make it happen. Henry A. Giroux, Contributing Editor C urrently holds the Global TV Network Chair Professorship at McMaster University in the English and Cultural Studies Department and a Distinguished Visiting Professorship at Ryerson University. His books include: American at War with Itself , Zombie Politics and Culture in the Age of Casino Capitalism (Peter Land 2011), On Critical Pedagogy (Continuum, 2011), Twilight of the Social: Resurgent Publics in the Age of Disposability (Paradigm 2012), Disposable Youth: Racialized Memories and the Culture of Cruelty (Routledge 2012), Youth in Revolt: Reclaiming a Democratic Future (Paradigm 2013). Giroux’s most recent books are America’s Education Deficit and the War on Youth (Monthly Review Press, 2013), are Neoliberalism’s War on Higher Education, America’s Disimagination Machine (City Lights) and Higher Education After Neoliberalism (Haymarket) will be published in 2014). He is also a Contributing Editor of Cyrano’s Journal Today / The Greanville Post , and member of Truthout’s Board of Directors and has his own page The Public Intellectual . His web site is www.henryagiroux.com . =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”]\""}, "time": 1742561914.584811}