{"duration": 0.05560612678527832, "input_args": {"text": "'By Jameson Parker Feminist Issues , News October 26, 2016 Congressman Who Said He Couldn’t Look His Daughter In The Eye And Endorse Trump Is Voting Trump 9143 Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nThumb through the pages of the dictionary until you find the word “craven” and a picture of Republican congressman Jason Chaffetz’s picture will probably greet you. In a year full of pathetic spinelessness from Republicans, his efforts seem to stand out. \\nIt’s hard to imagine a congressman doing more damage to his lasting reputation than Chaffetz pulled off on October 26th, 2016 – a date that will live in infamy. First, news broke that Chaffetz was already prepping for a Clinton White House by pre-planning two years worth of senseless investigations in a shameless attempt to destroy any chance of her – or congress – accomplishing anything. And yet sadly that story was only half of the reason why Chaffetz singlehandedly proved Mark Twain wasn’t kidding when he quipped “Suppose you were an idiot and suppose you were a member of Congress, but then I repeat myself.” Congressman Chaffetz is a very big idiot. \\nA little over one week after Chaffetz tried to score some cheap political points by unendorsing Donald Trump following the release of an audio tape in which the Republican nominee bragged about sexual assault, he sent out a tweet clarifying that when he said he wouldn’t endorse or defend Trump, he never said he wouldn’t vote for him. I will not defend or endorse @realDonaldTrump , but I am voting for him. HRC is that bad. HRC is bad for the USA. \\n— Jason Chaffetz (@jasoninthehouse) October 27, 2016 \\nWhat’s the distinction between “endorsing” and “voting for” you ask? Well, for Jason Chaffetz it’s like when you want to bake a cake but you also want to eat it too. See? Simple. Chaffetz is a very, very big idiot. \\nMaking Chaffetz’s cowardice all the more apparent is the reason why he said he was unendorsing Trump in the first place. Like the rest of the country, he heard Trump’s boasts about grabbing women’s genitals and found it abhorrent. He also said he couldn’t face his 15-year-old daughter and support a potential sexual predator like Trump. \\n“I can no longer in good conscience endorse this person for president. It is some of the most abhorrent and offensive comments that you can possibly imagine. My wife and I, we have a 15-year-old daughter, and if I can’t look her in the eye and tell her these things, I can’t endorse this person.” \\nSo to be perfectly clear, Jason Chaffetz, Republican congressman from Utah, can’t look his daughter in the eye and endorse Donald Trump, but he can stare her straight in the face and say “Dad just voted for this monster.” \\nNice work, Jason. You pathetic, small man. I’m forwarding your congressional photo to Webster’s. \\nFeatured image via Chip Somodevilla/Getty Images Share this Article!'"}, "time": 1742563010.140591}