{"duration": 0.12533903121948242, "input_args": {"text": "'WASHINGTON  —   Maybe it was the unexpected warmth of the gesture, the sheer enveloping display of affection. Maybe it was his response, the beatific expression on his face, eyes almost closed, head tilted toward her shoulder. Maybe it was the moment: tenderness at a time when presidential politics has become a festival of cruelty. But when Michelle Obama hugged former President George W. Bush on Saturday, at a ceremony to open the National Museum of African American History and Culture, the image quickly took flight online. However one chose to interpret it  —   and overinterpretation is a hazard in such exercises  —   it became an instant metaphor. Some saw the lost virtue of civility in politics others, the unlikely friendships that blossom at the rarefied heights of public life. To critics on the left, it was a shameful case of political amnesia by the wife of a president who spent years cleaning up the mess left by his predecessor. Mrs. Obama and Mr. Bush have had a few such memorable moments. In July in Dallas at a memorial service for five police officers killed by an Army veteran, the two held hands while singing “The Battle Hymn of the Republic. ” When Mr. Bush began swaying to the music, Mrs. Obama gamely let him swing her arm back and forth. At one point, as the choir sang “glory, glory hallelujah,” he turned to her in a burst of enthusiasm, causing the first lady to crack up, despite the solemnity of the occasion. In June 2012, when Mr. Bush returned to the White House for the unveiling of his official portrait, he aimed a few wisecracks at President Obama. But he saved his best material for Mrs. Obama, reminding her that when British soldiers set fire to the White House in 1814, another first lady, Dolley Madison, rescued the portrait of the first George W.  —   as in Washington. “Now, Michelle,” he said, gesturing to his own painting, “if anything happens, there’s your man. ” Some of these encounters are explained by proximity. When the Obamas and the Bushes appear in public together, protocol dictates that Mrs. Obama stand next to Mr. Bush. Some of it is a function of the former president’s playful manner, which by all accounts has become more playful in his retirement. But some of it also has to do with the relationship between the couples, which current and former officials say has deepened over the past seven and a half years, both because of the shared bond of living in the White House and because of Mr. Bush’s decorum as an  . “President Bush was very gracious to us during the transition, and he has been unfailingly gracious and respectful since,” said David Axelrod, a former adviser to Mr. Obama. He recalled the president telling him that the Bushes “had taught him lessons in how to be a former president. ” Mr. Bush has studiously avoided criticizing Mr. Obama or his policies. And Mr. Bush has lent his presence to occasions that meant a lot to the president, like the 50th anniversary of the civil rights march in Selma, Ala. when Mr. Obama delivered what some believe was the finest speech of his presidency, on race relations in the United States. Mrs. Obama sat next to Mr. Bush on that day, too, frequently leaning over to talk or share a laugh with him. Mrs. Obama’s rapport with Laura Bush is less playful, but Mrs. Obama’s aides say it is no less genuine. In early 2009, Mrs. Bush invited Mrs. Obama to visit the White House with her daughters, Malia and Sasha, for a private tour before her husband’s inauguration. Mrs. Bush’s daughters, Barbara and Jenna, showed the girls their new home, including good hiding places and banisters made for sliding. The two first ladies have appeared together regularly since, including this month at a conference at the National Archives to promote support for families of service members. In 2013, in Tanzania, Mrs. Obama and Mrs. Bush bonded during a conference on education for women and girls. “I like this woman,” the first lady said of Mrs. Bush. Mrs. Obama added that “it’s hard to find people who know what you’re going through, who understand the burdens and the fears and the challenges. ” “It’s sort of a club,” Mrs. Bush replied. “A sorority, I guess. ” The fraternity of presidents is well documented, though some members are closer than others. Bill Clinton and George H. W. Bush became famously chummy, with Mr. Bush inviting the man who defeated him to the family compound in Kennebunkport, Me. to “play golf, spend the night” and “hurdle the waves at breakneck speed,” according to the book “The President’s Club,” by Nancy Gibbs and Michael Duffy. Mr. Clinton’s relationship with Mr. Obama took longer to thaw, largely as a consequence of the bitter 2008 primary race between Mr. Obama and Hillary Clinton. There were a few golf games, an   lunch at an Italian restaurant in Greenwich Village, and, above all, Mr. Clinton’s memorable speech at the Democratic National Convention in 2012 defending the president’s economic record, after which Mr. Obama took to calling Mr. Clinton his “secretary of explaining stuff. ” Now, Mr. Obama is campaigning vigorously for Mrs. Clinton to succeed him, cementing the political alliance between them. Paradoxically, Mr. Obama’s relationship with the younger Mr. Bush has always seemed less complicated. Though Mr. Obama ran on his opposition to the war in Iraq  —   and has never stopped deploring that war  —   he appears to have an easy rapport with his predecessor. After the ceremony at the museum on Saturday, Mr. Bush was trying to take a photograph of himself with a family, only to find he could not fit everyone in the frame. The solution? He tapped Mr. Obama on the back, handed him the phone, and asked him to take the picture. As Mr. Obama was wrapping up his speech, he could not resist a gentle poke at his predecessor, who is known for his restlessness, laying odds on the length of his own remarks. “Enough talk,” Mr. Obama said. “President Bush was timing me. He had the   at 25” minutes.'"}, "time": 1742561940.572562}