{"duration": 0.11853170394897461, "input_args": {"text": "'Michael On Television Election Not Over? Money Is Being Raised To Challenge The Election Results In Wisconsin, Michigan And Pennsylvania   23rd, 2016 \\nJust when you thought it was safe to celebrate Trump’s victory, the left is hatching a plan to try to steal the election right from under his nose. A group composed of “prominent computer scientists” and “election lawyers” is urgently asking the Clinton campaign to challenge the election results in Wisconsin, Michigan and Pennsylvania. They claim that there is “persuasive evidence” that the election results in those states were “manipulated or hacked”, and they are pushing Clinton to file formal challenges to those results while there is still time to do so. As I write this article, the final result in Michigan could still go either way, and if Hillary Clinton does end up winning Michigan all she would have to do would be to flip the results in Wisconsin and Pennsylvania to become the next president of the United States. \\nMany on the left are absolutely incensed that Donald Trump is going to be the next president even though it looks like Hillary Clinton is going to win the popular vote by a very wide margin. In fact, as I write this article Hillary Clinton’s lead in the popular vote has expanded to more than 1.8 million votes . \\nAfter all of the votes have been counted, it is entirely possible that Hillary Clinton may finish more than 2 million votes ahead of Donald Trump. \\nIn a desperate bid to try to salvage the election, an attempt is being made to push for recounts in the key swing states that Clinton lost. This is being talked about all over the mainstream media today, but it was first reported by New York Magazine … \\nHillary Clinton is being urged by a group of prominent computer scientists and election lawyers to call for a recount in three swing states won by Donald Trump , New York has learned. The group, which includes voting-rights attorney John Bonifaz and J. Alex Halderman, the director of the University of Michigan Center for Computer Security and Society, believes they’ve found persuasive evidence that results in Wisconsin, Michigan, and Pennsylvania may have been manipulated or hacked . The group is so far not speaking on the record about their findings and is focused on lobbying the Clinton team in private. \\nLast Thursday, the activists held a conference call with Clinton campaign chairman John Podesta and campaign general counsel Marc Elias to make their case, according to a source briefed on the call. The academics presented findings showing that in Wisconsin, Clinton received 7 percent fewer votes in counties that relied on electronic-voting machines compared with counties that used optical scanners and paper ballots. Based on this statistical analysis, Clinton may have been denied as many as 30,000 votes; she lost Wisconsin by 27,000. \\nThe race in Michigan is even closer, and the truth is that Clinton may be able to close the gap of about 11,000 votes there without a recount. \\nIn Pennsylvania, the gap is currently about 68,000 votes, and so that would present much more of a challenge for the Clinton campaign. \\nAt this point it is questionable whether Hillary Clinton is willing to formally request recounts in those states before the deadlines arrive, but she doesn’t have to be the one to do it. \\nIn fact, according to MSN another presidential candidate is already raising the money needed to submit her own requests for recounts in those key battleground states… \\nJill Stein, the Green party’s presidential candidate, is prepared to request recounts of the election result in several key battleground states, her campaign said on Wednesday. \\nStein launched an online fundraising page seeking donations toward a $2m fund she said was needed to request reviews of the results in Michigan, Pennsylvania and Wisconsin. \\nStein said she was acting due to “compelling evidence of voting anomalies” and that data analysis had indicated “significant discrepancies in vote totals”. \\nBut if Stein wants to do something, she needs to act very quickly. \\nThe deadline to officially file for a recount in Wisconsin is Friday, in Pennsylvania it is Monday, and in Michigan it is next Wednesday. \\nMeanwhile, six former Bernie Sanders supporters are engaged in a last ditch effort to use the Electoral College to deny Trump the presidency on December 19th. Just like the attempt to recount the votes in key battleground states, this plan is not likely to work either, but right now it is receiving a lot of attention from the mainstream media. The following comes from a Daily Caller article entitled “ Sanders Electors Vow To Vote Against Clinton In Wild Attempt To Keep Trump From White House “… \\nThe group asserts that in order to succeed in their goal, they would have to convince 37 Republican electors to vote against Trump, a number the groups understands is unlikely. The ultimate goal, the group says, is to reduce the overall faith the average american voter has in the electoral college system. \\nUntil the actual votes are tallied, it will be very difficult for either Democrats or Republicans to ascertain just how effective the movement is, because there is no organized whip effort to gauge how many electors intend to vote they way they are instructed. \\nThere is no remedy for a faithless elector. \\nIt is extremely unlikely that 37 Republican electors would betray Trump at this point. \\nWhat is far more likely is that these former Bernie Sanders supporters will bring enough attention to “faithless electors” that it will cause an even bigger push to abolish the Electoral College. \\nBut because it would require changing the Constitution in order to abolish the Electoral College, it is something that is not likely to happen any time soon. \\nUltimately, all of these last minute moves by the left seem destined to fail, and there doesn’t seem to be anything that they can do at this point to keep Donald Trump out of the White House. \\nAnd the truth is that so many of the things that I warn are coming to America in my new book are far more likely to happen if Trump is in the White House rather than if a Democrat is residing there. \\nWe have reached a critical moment in U.S. history, and right now optimism about the future of this country among conservatives is off the charts . \\nBut is that optimism justified? \\nWe shall see, but without a doubt this optimism is not shared by Democrats, and many on the left are preparing to fight against Trump every step of the way. November 23rd, 2016 | Tags: 2016 , 2017 , Debt , Debts , Donald Trump , Extreme Pain , Intense Pain , Lawyers , Michigan , Pain , Painful , Pennsylvania , Trump , Wisconsin | Category: Commentary Half Of The Population Of The World Is Dirt Poor – And The Global Elite Want To Keep It That Way » Cinderella Man \\nFear mongering…it’s not gonna happen jeez there’s no way in hell they steal this from us..they think protests from leftist crybabies is bad just wait and see 60 million pissed off Deplorables not gonna happen James Staten'"}, "time": 1742563784.8417115}