{"duration": 0.19934821128845215, "input_args": {"text": "\"Print \\nHave you ever noticed how Washington always has a plan to solve everybody’s problem – except their own? \\nFor the federal government, it’s always easy and tempting to look at problems – real or imagined – outside of the beltway and solve them from afar. \\nYou will recall, of course, how former Attorney General Eric Holder was going to stop police shootings all over America with sensitivity training, the power and force of the federal government and investigations, investigations and more investigations. \\nNow Loretta Lynch, his successor, also known as Hillary Clinton’s guardian angel, is set to turn police shootings throughout America into big business and more power for Washington. \\nHer latest pet project is assembling a national database on “interactions between law enforcement and civilians,” she reported this month. \\n“Accurate and comprehensive data on the use of force by law enforcement is essential to an informed and productive discussion about community-police relations,” Lynch said. “In the days ahead, the Department of Justice will continue to work alongside our local, state, tribal and federal partners to ensure that we put in place a system to collect data that is comprehensive, useful, and responsive to the needs of the communities we serve.” \\nThe irony here is thick, indeed. \\nOne of Lynch’s goals, she says, is to get law enforcement agencies to report more thoroughly about people who died during an interaction with them. \\nMeanwhile, Lynch presides over the most egregious cover-up of the most outrageous police shooting case I have ever seen in my life – namely the killing of Miriam Carey, a young black mother with baby in tow, who was gunned down by Washington cops and Secret Service agents for a wrong turn in the nation’s capital. \\nLynch wants reports? \\nSo does WND, which has been pursuing the information through Freedom of Information Act requests and finally, after being stonewalled for years, a lawsuit. \\nSo does the public and the family of Miriam Carey. Unfortunately, Lynch is holding back on a few things: Missing Evidence The 92-page memo with findings, analysis of evidence and conclusions in the Carey shooting investigation. This would show the evidence and reasoning that led the Department of Justice to decline to file criminal charges against officers. Why they considered this a justifiable homicide – or whether they should have, based on the evidence. Why officers used deadly force. Whether officers followed or violated the policy of their agencies. Video of shooting at Capitol Police guard post at intersection of Constitution Ave., Maryland Ave. and 2nd Street. Only stills have been released. Video would show more clearly if officer’s life actually was in danger, as DOJ claimed, when he fired fatal shot to Carey’s head. Not one of the five witnesses at the scene said Carey was driving at the officer, as the DOJ claimed. Police statements The police report said four officers fired shots at Carey, two from the Capitol Police and two from the Secret Service. Not one statement from those officers was in the report. Their names were also redacted. Redacted information An attorney in the Washington, D.C., mayor’s office said the only redactions were names, in order to protect privacy. It turned out much more was redacted than names. The report was riddled with blacked-out sections and missing information. 12 pages in the report were entirely blacked out. 15 pages were mostly blacked out. 22 pages were partially blacked out. Some of the blacked-out pages just included a heading marked “Evidence.” Some just had a date. Witness statements An astonishing 38 witness accounts are missing from the police report. The police report stated: “There were seventy-two (72) witnesses interviewed regarding this incident and their statements were captured by audio and/or video recordings. Copies of the aforementioned recordings were turned over to the USAO for review. Copies of the aforementioned audio and video recordings are stored in the main case file at the Technical Support Unit (TSU) located at the IAD.” Of those 72 witness statements, only 34 were in the materials provided to WND, leaving 38 missing. Statement transcripts None of the actual transcripts of interviews in the witnesses’ own words were provided, just paraphrased versions in what the former NYPD officer Sanders described as “cop talk.” White House guard post video Stills were released but not the video. It would show whether anyone was manning the post when Carey drove up; whether she tried to drive around the off-duty guard who dragged a gate in front of her; and whether she sped off, or left at a normal speed, as a witness said. Police radio recordings No recordings or transcripts of radio transmissions during the pursuit and shooting of Carey were provided in the FOIA material. Also not provided were transcripts of computer transmissions (instant messaging) between squad cars and police headquarters. Ballistics and forensics reports The Justice Department Washington Metro Police Department responses to FOIA requests did not include a ballistics or a forensics report. \\nI could go on and on. For people who want facts and reports, the U.S. Justice Department under both Holder and Lynch have a strong propensity for not willingly releasing the facts and reports to the public or the press. \\nWe’ve been at this for a long time – years. Yet the stonewall and cover-up of a horrendous, unjustifiable, outrageous police shooting right in their own jurisdiction and backyard continues. \\nDo we really expect Eric Holder and Loretta Lynch to find justice for police shooting victims outside of their own jurisdiction with a track record like that? \\nMedia wishing to interview Joseph Farah, please contact . Receive Joseph Farah's daily commentaries in your email BONUS: By signing up for Joseph Farah’s alerts, you will also be signed up for news and special offers from WND via email. Name *\""}, "time": 1742562245.048724}