{"duration": 0.01593470573425293, "input_args": {"text": "'A group of witches is attempting to use black magic to neutralize U. S. President Donald Trump by casting a “binding spell” to prevent him from governing. [The “mass spell to bind Donald Trump” will be performed at midnight on every waning crescent moon beginning Friday, February 24, “until Donald Trump is removed from office,” the group’s website states.  The mass ritual will allegedly be repeated again March 26, April 24, May 23, June 21 (the summer solstice) July 21, and August 19. The spell also invokes evil on “those who abet” Trump, which would seem to appear to cover his staff and political nominees, and perhaps the millions who voted for him as well.  The spell involves such items as an unflattering photo of Trump, a tower tarot card, a tiny stub of an orange candle, a pin or small nail, water, salt, a feather and an ashtray. “This binding spell is open source, and may be modified to fit your preferred spiritual practice or magical system,” the site explains. What is critical is “the simultaneity of the working” as well as “the mass energy of participants. ” “Some   are doing a variation of this as a group working, while a number of solitary practitioners are planning to connect and livestream via Facebook, Twitter, and other social media,” the site explains. In reaction, a number of Christian groups and individuals have promised to pray for Mr. Trump, asking God’s blessings on his work and on the nation. Witches cast spells tomorrow, We  &gtNo weapon formed against you shall prosper . @POTUSAmerica’s praying for you @VP #Pray4DJT ❤️ pic. twitter.   —   ❤️MAGAMama❤️ (@tteegar) February 24, 2017,  The witches’ spell involves a lengthy incantation, calling on spirits and “demons of the infernal realms” to bind Donald J. Trump so that “he may fail utterly, that he may do no harm. ” Calling on the spirits to work the same harm on “all those who enable his wickedness and those whose mouths speak his poisonous lies,” the hex beseeches the spirits to “bind them in chains, bind their tongues, bind their works, bind their wickedness. ” The climax of the spell involves a crescendo “with increasing passion” ending by blowing out the orange candle while “visualizing Trump blowing apart into dust or ash. ” Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742628529.626512}