{"duration": 0.0637671947479248, "input_args": {"text": "'British singer M. I. A. claimed that President Donald Trump’s administration is full of “pathological liars” in a series of charged social media posts this week. [“Mental disorder is serious. Psychopathic behaviour traits should be analysed in schools   collages etc I don’t believe there’s no cure!” the “Paper Planes” singer wrote on Twitter.  “You know trumps office shows signs,” she added. “They r pathological liers. All politicians should go though vetting for psychopathic behaviour trait [sic]. ” Mental disorder is serious. Psychopathic behaviour traits should be analysed in schools   collages etc I don’t believe there’s no cure!  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  You know trumps office shows signs. They r pathological liers. All politicians should go though vetting for psychopathic behaviour traits.  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  The   singer continued, criticizing Twitter for its failure to police speech from the mentally ill. “Twitter doesn’t delete the accounts of people with mental disorder for free speech sake. It has to be “hate speech” i. e a racial slur,” she said. “Since twitter provides a platform to people with disorder. they should fund research on how we can help, prevent and cure people suffering. ” Twitter doesn’t delete the accounts of people with mental disorder for free speech sake. It has to be ”hate speech” i. e a racial slur.  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  Since twitter provides a platform to people with disorder. they should fund research on how we can help, prevent and cure people suffering,  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  At the end of her rant accusing Trump staffers of suffering from mental illness, M. I. A. revealed that she is dyslexic and said she values having “responsible” thoughts. I’m an artist. I’m dyslexic. Over 60% of artists are. Mental illnesses is found in artists too + creative people seek solutions through art 2,  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  To me it’s more important to be responsible with my thoughts and actions and check myself and grow then to spell correctly. I’ve done ok.  —   M. I. A P. O. W.A (@MIAuniverse) March 3, 2017,  Last month, the    singer posted lyrics from a new song, called “POWA” on Twitter. The song featured an apparent   lyric: “Throw up my finger and I’m taking on the (Trump) Tower and   fascist racist   . ” M. I. A. has also tackled immigration and the European migrant crisis. In a 2015 music video for the song “Borders,” the British singer is seen scaling a large fence and huddled up on a boat alongside a large group of refugees.    Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562039.436198}