{"duration": 0.2439579963684082, "input_args": {"text": "'Fred Tyrell November 4, 2016 How To Revive Your Old Guns And How To Use Them \\nIf your firearms require repair after a social collapse, it will be too late to start thinking about how to work on firearms and keep them in good working order. Now is the time to start learning how to repair and maintain your firearms so that your guns are always ready to serve your needs. \\nYou Need to Be a Gunsmith and a Blacksmith \\nThese days, if your handguns, rifles, or shotguns need repair, you can just take them to a gunsmith, or return them to the manufacturer for factory warranty work. \\nIn a time of crisis there may not be any gunsmiths or even any warranty service centers open to repair your weapons. With this in mind, you must know how to make and replace any parts that break or wear out. \\nTwo good trades to learn and be proficient in are gunsmithing and blacksmithing. A good gunsmith can repair and modify most modern firearms with a good supply of spare parts. If you don’t have anymore spare parts to repair broken firearms, you will need blacksmithing skills so that you can make the needed parts for these repairs. \\nAside from fixing your own weapons (and other machines), you can also barter or trade for other goods and services when needed. To do well in these two trades, you must have all of the necessary tools, repair manuals, a good memory, and a natural ability to do the work. \\nCount on Cannibalizing Other Broken Firearms \\nBattle field cannibalization should be used when you have run out of spare parts and there are none left to use. Sometimes there is not enough time for your gunsmith or blacksmith to manufacture the needed parts. Turn to cannibalizing non-serviceable firearms instead, to keep others working until they can be fixed or repaired. \\nA good source of firearms to cannibalize are those weapons that were discarded by their old owner because they would no longer work. Another place to search are battlefields or skirmish lines. Most of these firearms, when retrieved, may still have usable parts. If not, all of the steel and other metal parts can be melted down and reused. \\nThe question is, do your old weapons need special care to make them work? \\nWhen repairing or working with any gun that has cannibalized gun parts, take the time to hand fit each part to ensure that it fits and works perfectly, otherwise you will waste your time. You also run the risk of damaging or destroying the firearm or the valuable repair parts. \\nDo safety tests before and after repairs to determine if the firearm is safe to use! \\nA good gunsmith will always test the firearms that are to be repaired before any work is done. The first safety check is to see if the firearm is loaded. If not, then check the function of the weapon. If the weapon doesn’t function, then you can begin to disassemble the firearm. Once inside the firearm, the gunsmith can determine the problem and go about fixing it. \\nAfter the firearm is fixed, a good gunsmith will physically test the weapon unloaded. If the firearm passes the function testing, then it is time to load the gun and do a live fire test to check the weapon. Some gunsmiths will use a firearm rest to strap down the firearm and tie a string to the trigger so that the trigger can be pulled from a safe distance. \\nThis could save your life, especially if the firearm explodes. When the firearm passes all the function tests, then you know it is safe to use. \\nWhen buying survival handguns , rifles, or shotguns, ask questions and try to find out which firearms: Will last the longest with heavy use. Have a history of minimal repairs. Are easy to obtain repair parts for. Include easy to make parts as a gunsmith or blacksmith. Have easy to install replacement parts. \\nIf you can find firearms that have simple trigger, gas, loading, and other systems, then you could make the necessary parts on your own. Once you decide on a weapon, get all the gunsmith exploded views and specs for each weapon, but you will need tools, gun steel, or other supplies. \\nLike any other skill, you need to practice repairing firearms by making your own replacement parts and test firing them to insure they work properly. \\nBasic Gunsmith Tools and Procedures You Need for Reviving Old Guns \\nHere are some videos that can help you figure out which tools to obtain as well as the kinds of things you can do once you know the basics: \\nHere’s a video that shows the basic tools and supplies that are necessary for gunsmithing: Video first seen on Iraqveteran8888 . \\nHere’s how to make primers for reloading if they were not available. Remember, these methods can be dangerous, so make sure you study this and other resources before trying this on your own. Video first seen on Jon with no h . \\nIt is also possible to make a rifle firing pin by using a drill bit that fits the firing pin channel in the bolt. The rear portion of the drill bit will be used. It is better to make the firing pin a little too long, and then cut it back if needed. If you make the firing pin too short, it must be discarded. Video first seen on beltstowing . \\nMaking your own firearm parts when replacements are not available. Video first seen on MidwayUSA . \\nThe Best Guns You Can Revive for Your Survival Arsenal \\nThe following are firearms I would recommend for your survival arsenal . Each was selected because it is either readily available, or spare parts will be easy to get for some time. In some cases, you may also be able to make important parts on your own if needed. \\nGlock family of semi-auto pistols \\nGlock pistols are offered in 7 different calibers. There are 21 different styles for the Glock pistol. For each of the calibers, there are three different models: subcompact, compact, and full size for police or military. \\nThe Glock pistol is known as a safe action pistol. It is a polymer framed, short recoil operated, locked breech semi-automatic pistol. Even though the Glock was referred to as the plastic gun because of its polymer frame, it is extremely well-built and durable. It is carried by approximately 65% of all United States police departments and sheriff departments. \\nGlocks are also extremely popular among civilians for recreational and competition shooting, home and self-defense, and for concealed or open carry. Since Glocks are very popular, there is an excellent supply of spare parts to repair or upgrade the pistol. If you needed to make replacement parts, that can also be done. \\nS&W Revolvers \\nS&W is an American firearms manufacturing company that has built revolvers since 1852. With this long tradition, they have built high quality revolvers that will last the average shooter a life time. The designs of the S&W revolvers are simple, which allows the average person to work on them. If no suitable parts are available, a good gunsmith or a blacksmith should be able to make them and repair the revolver . \\nAnother thing that makes these revolvers a good choice is that certain ones can fire more than one type of bullet in the same gun. An example of this is the .22LR revolver which can shoot the .22 long rifle round, .22Long, and the .22short. The .357 magnum can also shoot .38 Specials, 38 Special + P, and 38 Special +P+. When you can shoot different ammo types, it makes it much easier to scavenge when bullets become more scarce. \\nThe S&W revolvers come in the following frame sizes: The smallest frame size is the “J” frame that features a 1-2 inch barrel. The “K” frame is for medium sized revolvers with a 2-6 inch barrel. The “L” frame is for medium to large frame revolvers with a 4-8 inch barrel. The “N” frame is also for large frame revolvers with a 4-8 inch barrel. The “X” frame revolvers were designed for the very heavy recoiling S&W 500 and 460 round. The “Z” frame was designed for the S&W Governor revolvers which can shoot the .410 shotgun shells ( 2 1/2 and 3inch ), the 45ACP, and the 45Long Colt. \\nRemington Model 700 series of bolt action rifles \\nThe Remington Model 700 is a series of bolt action rifles manufactured by Remington Arms since 1962. These rifles are all based on the same Centerfire bolt-action design. They come with a three, four, or five round internal magazine depending on the caliber. \\nSome models of the Remington Model 700 have a floor plate for quick unloading of the weapon while others do not. In recent years, this rifle has also been modified so it can be used with a detachable box magazine. \\nThe Model 700 is available in many different stock, caliber, and barrel lengths. There are three versions of the Model 700: the civilian version, the police version, and the military version. This rifle can be chambered from the .17 Remington to the .458 Winchester magnum. \\nI would recommend that you have your Remington Model 700 chambered in the .308 Winchester round. In a time of crisis the .308 Winchester round would be more plentiful than other calibers because the police and military use this caliber in their rifles. \\nAR-15 platform of semi-auto rifles \\nThe original AR-15 Sporter models were first manufactured in 1963 by Colt firearms. Over the years, other companies have made the AR-15 style rifles that vary in ammo type and other features. Even though the original caliber for this weapon was .223, some models have been chambered in 5.56, the Russian 7.62×39, AAC Blackout, and .458 SOCOM. \\nSome AR-15 style rifles can also take Pistol calibers such as the .22 caliber long rifle, 9×19, and the 45 ACP. \\nPositive features of the basic AR-15 style rifles are excellent molecularity, the great availability of spare and replacement parts, and accessories. These rifles have a great potential for excellent accuracy and they fit the shooter quite well. The greatest feature of the AR style rifle is that anybody can swap out the upper receiver and quickly replace it with another. \\nThe wide availability of spare and after market parts allows you to customize your rifle for almost any purpose and budget. It is possible to build the AR style rifle yourself, have a gunsmith build it, or even order one from a custom manufacturing company. \\nNegative features of a typical AR-15 style rifles include sensitivity to ammunition and relatively high maintenance requirements, compared to its longtime rival, the AK. Another weakness of the AR-15 style rifle is the flimsy design of the original magazines. \\nAnother feature which can be considered as a negative is the buffer tube housing which protrudes rearward from the receiver and into the shoulder stock. This precludes any use of folding stocks. \\nIt is important to note that the ammunition used for AR style rifles is plentiful to buy and to reload. This ammunition it’s also used by the military and the police. \\nAK-47 and AK-74 platform of semi-auto rifles \\nThe AK platform is the end result of years of research and development of a Russian selective fire rifle while the rifles made for the American civilian market are semi-automatic only rifles. The most commonly found AK platform rifles are mainly stamped receiver rifles, but there are a few milled receiver rifles available in the marketplace as well. \\nThe AK-47 platform was design to be cheaply, easily and quickly manufactured using mass production methods. It is simple to use and very reliable. It uses a lot of stamped steel parts to help keep the unit price down. \\nThe AK uses a long stroke gas system that is generally used for great reliability in adverse conditions. The large gas piston, generous clearances between moving parts, and tapered cartridge case design allow the AK platform to endure large amounts of dirt, other foreign matter, and fouling without failing to cycle. \\nThis rifle is cheaper to produce and repair than other semi-automatic rifles. Furthermore this rifle was designed to be used by individuals that did not have much formal education. It is an easy to use, relatively simple rifle. \\nThe AK platform can be broken down into its basic groups quickly and easily for cleaning and repairing. No special tools are required for cleaning or simple repairs in the field. This platform is one of the easiest to work on. If there are no spare parts to repair the rifle, they can be made easily enough by a good gunsmith or a blacksmith. \\nAmmunition for the AK platform is cheap to buy and easy to reload. \\nThe standard AK-47 magazines are metal and hold 30 rounds of 7.62×39 ammunition. After market magazines can hold from 5-40 rounds of ammunition, or you can use a drum that holds 75 rounds of ammunition. \\nThe standard AK-74 magazines are made of metal or synthetic materials and hold 30 rounds of 5.45×39 ammunition. There are also after market magazines that hold between 5-40 rounds of ammunition. \\nKeep spare parts that are known to break easily or often. \\nFor each of your firearms you should have a spare parts kit. If any of your firearms have known weak points in their design, it is to your advantage to get rid of these weapons before a time of crisis and replace them with a more reliable weapon. \\nCritical Items for Your Spare Parts Kit \\nSemi-auto Rifles'"}, "time": 1742564286.7548623}