{"duration": 0.01981496810913086, "input_args": {"text": "'Donnerstag, 10. November 2016 Mann verhaftet, nachdem er in Single-Börse Komplizin zum Pferdestehlen suchte Homburg (Archiv) - Dreister geht\\'s kaum: Völlig unverhohlen hat ein 35-jähriger Homburger im Internet nach einer Komplizin für einen Diebstahl gesucht. Der inzwischen festgenommene Mann hatte auf einer bekannten Online-Singlebörse nach einer Frau Ausschau gehalten, mit der er eine noch unbekannte Anzahl an Pferden entwenden wollte. \"Ich suche eine abenteuerlustige Frau (20-35), mit der man Pferde stehlen kann\", schrieb der 35-Jährige nach Polizeiangaben wörtlich in sein Profil auf der Datingplattform. Seine Komplizin müsse dabei \"zu jeder Schandtat bereit\" sein. Haben nichts mehr zu befühüühhühhüühühürchten: Pferde \"Das stellt nach unserer Ansicht ganz klar eine Anstiftung zu einer Straftat dar\", erklärt Polizeidirektor Norbert Frieß. Derzeit prüfe man auch, ob sich der mutmaßliche Viehdieb zusätzlich wegen des Versuchs der Bildung einer kriminellen Vereinigung (§ 129 StGB) strafbar gemacht habe. Der Verdächtige hatte offensichtlich klare Vorstellungen von seiner möglichen Komplizin. Sie solle sportlich sein, nicht rauchen und Sonnenuntergänge mögen. \"Kein Wunder: Das Stehlen von Pferden ist ein körperlich sehr forderndes Verbrechen und wird in der Regel nachts durchgeführt\", so Frieß. Das Vorgehen des Verdächtigen scheint eine beliebte Masche zu sein. Allein im zweiten Quartal dieses Jahres konnte die Polizei durch das wachsame Prüfen von Kontaktbörsen und Zeitungsannoncen deutschlandweit über 250 Pferdediebstähle bereits im Planungsstadium vereiteln. Doch auch andere zwielichtige Geschäfte werden oft über Online-Partnerbörsen abgewickelt. So deuten zahlreiche Einträge auf einen regen illegalen Tierhandel hin, bei dem von Mäusen über Tiger, Bären und andere exotische Tiere bis hin zu \"Dreilochstuten\" alles gesucht und angeboten wird. ssi, dan; Idee: gul; Fotos: Shutterstock; Hinweis: Erstmals erschienen am 10.11.15 Artikel teilen:'"}, "time": 1742628566.4265826}