{"duration": 0.23216748237609863, "input_args": {"text": "\"We Are Change \\nWikileaks helped celebrate Hillary Criminalton’s birthday Wednesday by gifting Hillary and the American people another glimpse into Clinton land. Corruption, dirty tricks all to get the Presidency the tactic hasn’t changed since Arkansas. Do whatever it takes. Wikileaks has now proven the Clinton’s past allegations of corruption likely to be true, all those talks over the years of Hillary claiming Bill’s sexual assaults were fraudulent are now bluntly obvious Hillary’s ill attitude towards staff is also confirmed the “right wing” conspiracy is clearly seen and it’s one against the American people to rig the election. Now Wikileaks may have something in the works a potential birthday surprise for Mrs. Clinton according to Kim DotCom a friend of Julian Assange.\\nKim Dotcom tweeted out a series of mysterious tweets today that suggest Wikileaks could potentially have a Birthday wish for Hillary Clinton containing her 33,000 work related emails later this evening.\\nDoes @Wikileaks have 33,000 explosive candles for Hillary's birthday cake? Maybe?! ?\\n— Kim Dotcom (@KimDotcom) October 26, 2016 \\nRing Ring ??\\n— Kim Dotcom (@KimDotcom) October 26, 2016 \\nOh no! @wikileaks pic.twitter.com/HcHRNl3pMq \\n— Kim Dotcom (@KimDotcom) October 26, 2016 \\nBleachbit(ch) can't bleach it ?\\n— Kim Dotcom (@KimDotcom) October 26, 2016 \\n\\n \\nKim Dotcom additionally hinted in an interview in May, 14th, 2015 that “Julian Assange and Wikileaks would be Hillary’s worst nightmare in 2016,” prior to Guccifer 2.0 prior to the DNC leak, Collin Powell’s emails, Podesta’s emails, Obama’s emails and the list goes on and on..\\nEither Kim Dotcom knew what Wikileaks had or he’s the new age Nostradamus. The next keypoint is that Kim DotCom knows Julian Assange they talk as seen in the video below Kim Dotcom is asked by Bloomberg reporter, Ali Elkin , “How often do you talk to Julian Assange.” Dotcom responds, “Why is that important to you? Look I like these guys I look up to them I think they are very brave they are going through a very hard time you know and they chose to do that for the betterment of all of us so yeah I love to talk to them.”\\nLater on in the interview DotCom was questioned about another previous tweet that “he would be Hillary’s worst nightmare in 2016.” Dotcom then went on to correct himself saying “I have to say really it’s more Julian but I am aware of some of the things that are going to be roadblocks well he has access to information I don’t know the specifics.”\\nIs it possible that Kim Dotcom was tipped off by Julian Assange that a birthday gift from Wikileaks the international whistle-blower organization to Hillary Clinton may drop later on tonight? We will soon find out, If these tweets were just Dotcom trolling or if he was serious and a massive leak is about to happen that could potentially end the campaign presidency of Hillary Rodham Clinton. Stay tuned to we are change we will keep you up to date and will break news if Wikileaks leaks “explosive candles” as Dotcom put it for Hillary Clinton.\\n \\n \\n \\n \\n \\n \\nThe post Is A Birthday Surprise Coming For Hillary Criminalton? Kim Dotcoms Mysterious Tweet. appeared first on We Are Change .\\n\""}, "time": 1742563855.2511406}