{"duration": 0.06656837463378906, "input_args": {"text": "'The chairman of Britain’s oldest conservative think tank has slammed political strategist turned media pundit Steve Hilton for portraying himself as a Tea Party style   figure, accusing him of being a liberal “moderniser” and RINO (Republican in name only). [Speaking to Breitbart London Editor in Chief Raheem Kassam on Breitbart News Daily, Bow Group Chairman Ben   said Fox News’s new anchor Steve Hilton and his show The Next Revolution, with its focus on “how corrupt the establishment is” was far from a friend of the people.  Explaining how Hilton has contributed to the collapse of Conservative grassroots in the United Kingdom before jumping ship to the U. S. to become a media pundit,   said of Hilton and his long association with Britain’s former prime minister: Steve Hilton was really the original moderniser in the Conservative party  …     the original RINO. He worked with David Cameron going back 20, 25 years  …     came up with him through the ranks of the Conservative party. Their whole basis was to move the Conservative Party leftwards to the centre, to ape what [Labour Party Prime Minister] Tony Blair had done in British politics. It is extraordinary to now see him almost placing himself with the Tea Party movement in the United States. Listing the disastrous and unconservative policies pushed by Hilton in the UK, Kassam said: “Let us not forget this man is somebody who was behind implementing the ‘big green’ agenda in the United Kingdom, he was behind telling Conservative Members of Parliament that they could no longer espouse conservative views and that they had to hide behind these liberal left approaches to things. His big flagship policy was what they called the ‘big society’ which really meant big government, and using fluffy   words to implement it. ” Both Bow Group Chairman   and Breitbart host Kassam agreed they were glad Hilton had suddenly performed a   and decided his decades of progressive politicking was a mistake as he looked to populism for a new career, but they also said it was time to hear him admit he had been wrong.   said: “Everyone can change their views in politics, everyone can change their opinions. But what I’d like to hear from Steve Hilton is an address as to how he was wrong and why we were right. How did he change his views and why?” Kassam went further, demanding Hilton apologise to the public for the damage he had done. He said: “I’d like to have him look squarely down that Fox News camera and say: ‘I’m sorry for ruining the United Kingdom, I’m sorry for ruining the Conservative Party  …     I’m sorry for continuing the legacy of Tony Blair  …     I see one of my fellow countrymen masquerading as something that for so many years he was against. He was ridiculing us, he was mocking us. ’”   remarked in reply that not only had Hilton and his fellow travellers damaged conservatism in Britain, they had also attacked those who sought to defend the old principles of the movement, including his own think tank which had been known as a favourite of former Prime Minister Baroness Margaret Thatcher. Explaining how that damage led to the disastrous result for the Conservative Party in last week’s general election,   remarked: They took a very uncompromising attitude towards those who continued to defend   conservatism. David Cameron personally tried to wipe both myself and the Bow Group out, and what happened with Steve Hilton and David Cameron was to totally disempower the grassroots membership, who tended to stick to traditional conservative values. All of that has actually led to the general election we just saw because the Conservative Party now has one sixth of the membership of the Labour Party because everyone got extremely annoyed that the leadership of the party held the membership in contempt, and left. That legacy is still having a major effect on British politics. I’m glad Steve Hilton has admitted he’s wrong, but he seems to want to rewrite that history. Steve Hilton worked with the Conservative Party on their failed 1997 general election campaign before becoming the director of strategy  —   known as the “  man”  —   to former British Prime Minister David Cameron, resigning in 2012. LISTEN: Bow Group Chairman Ben   speaks to Breitbart London Editor in Chief Raheem Kassam on the Breitbart Daily Show on Sirius XM 125 Patriot:    '"}, "time": 1742628320.291092}