{"duration": 0.05762839317321777, "input_args": {"text": "'We Use Cookies: Our policy [X] BREAKING: Honey G Fatally Gunned Down In Bitter Rap Feud November 8, 2016 - BREAKING NEWS , ENTERTAINMENT Share 0 Add Comment \\nFANS of London rap artist Honey G have flooded social media with condolences this afternoon following a fatal shooting linked to a West London rap feud. \\nReal name Anna Georgette Gilford, the X-Factor contestant was reportedly shot 17 times by a group of unknown assailants who cut off the car she was a passenger in. \\n“I saw the blacked out jeep overtaking her car, forcing her driver to stop,” one eyewitness recalls, “Five men in balaclavas got out and began trying to open her door, but then she seemed to open fire on them from the inside, hitting one in the shoulder and another guy in the chest”. \\nCCTV footage from the scene showed the two men hitting the ground, before the other three men took out semi-automatic machine guns and opened fire. Honey G can be seen crawling out of the opposite side of the car. She then began shooting at her assailants. \\n“She started shouting ‘you East side pansies will never take me alive’,” said another witness, “She went at them all guns blazing”. \\nPolice confirmed Honey G stood up from behind the car, wielding duel gold plated desert eagle handguns in each hand before slowly firing off rounds while walking calmly towards the men. \\n“They fired back, and hit her several times. She was bleeding from several areas on her torso, but it didn’t seem to stop her,” police investigators confirmed, “She took out the three guys, executing one of them on the ground to the line ‘I say Honey, you say…’ before then putting two slugs behind his ear, finishing him off to the letter ‘G’. Unfortunately, she didn’t see the driver of the vehicle coming around from the other side”. \\nIn a split second, the X-Factor hopeful was gunned down by the driver of the vehicle, who then sped off through the busy London streets. The SUV was later found burned out in the East side of the city. \\nIt is understood Honey G was involved in a bitter East/West feud which has been spanning over 5 years. \\nHer family have asked for bottles of Hennessy to be spilled over her grave instead of flowers.'"}, "time": 1742562019.987785}