{"duration": 0.06581234931945801, "input_args": {"text": "'Sweden’s health minister has promised more support for gender identity clinics as it emerged that the number of children claiming to be in the wrong body has risen 100 per cent each year. [Louise Frisén, child psychiatrist at the Astrid Lindgren Children’s Hospital, told Aftonbladet that in 2016, the gender investigation team saw 197 children who were interested in ‘transitioning’ to becoming the opposite sex.  “There’s a 100 per cent increase in numbers each year, and the people we’re seeing are younger and younger and more and more children are coming at very young ages,” she said, adding that “the increase is identical on the adult side of things, too,” she said. Chief of Karolinska University Hospital’s gender identity team, Cecilia Dhejne, said the rise in children unhappy with having been born male or female reflects “greater openness” in Swedish society, but warned that resources are overstretched. “The problem in Sweden is that there’s a long wait for young people, both for initiating an investigation into their gender identity and then also for the different parts of treatment across the country after that. ” “It is worrying” said the   sexologist, cautioning that “having to wait in a queue can worsen the mental health of transgender people”. “It’s sad on an individual level when people feel bad about themselves, and on a wider level it’s much better that young people are able to get started with their lives so they can contribute to society,” said Ms. Dhejne. Sweden’s Public Health Minister Gabriel Wikström said: “It is totally unacceptable that there are deficiencies in care for transgender people at every stage of treatment. ” He told Aftonbladet the government had appointed a commission to investigate waiting times and gaps in care across the country, the results of which will be ready by October. “I believe [municipalities in Sweden] do the best they can with the resources they have, but unfortunately I think society has failed to do enough to listen to transgender people. As a result, we were not aware of the problems now being faced by that group. ” In recent years, left wing activists along with global media enterprises like National Geographic have worked hard to promote the concept of ‘transgender children’ but there is increasing evidence that gender ideology puts minors’ mental health at risk. There is also mounting evidence that children are too young to choose their gender. In June, the American College of Pediatricians released an open letter asserting that   trans children are psychologically confused. “Conditioning children into believing that a lifetime of chemical and surgical impersonation of the opposite sex is normal and healthful is child abuse,” it read.'"}, "time": 1742563179.3218224}