{"duration": 0.06146669387817383, "input_args": {"text": "'Longtime Trump opponent Sen. John McCain ( ) added his voice to the chorus of alarm Tuesday in the wake of a New York Times report on an alleged memo from   Director James Comey. [“We’ve seen this movie before,” McCain told CBS News’s Bob Schieffer. “I think it’s reaching the point where it’s of Watergate size and scale  …     it’s a centipede that the shoe continues to drop. ”   “Every couple of days, there’s a new aspect of this really unhappy situation  …     None of us, no matter what our political leanings are, no matter how we feel about Trump, feel this is not good for America,” McCain added. The comments are the harshest yet from the GOP side of the aisle and come as some Democrats are openly calling for President Donald Trump impeachment over the “Comey Memo. ” Rep. Al Green ( ) did so on the House floor Tuesday morning. McCain’s comments add to rumblings among certain other Republicans on Capitol Hill who have signaled their willingness to abandon Trump over the allegations in Comey’s memo and reports of discussion of classified information with Russian diplomats. The Hill reported Wednesday that the Comey Memo was causing more GOPers to try and detach their legislative agenda from the president. McCain has been a proponent of the Russian   narrative, and a central figure in Senate hearings on the issue. He expressed his dismay over President Trump’s decision to dismiss Comey last week. The   senator and 2008 GOP nominee for president has been a pillar of   Republicans since shortly after Trump’s announcement in 2015 when the two became embroiled in a controversy over Trump’s comment on McCain’s time as a Vietnam POW. “Never Trump” commentator Bill Kristol even called for McCain to intervene as an independent candidate on the eve of the 2016 Republican National Convention. McCain’s opposition to Russia’s foreign policy ambitions, dating back to the Cold War era, has played a central role in his political career. In his 2008 bid for the presidency, McCain famously wrote that “we are all Georgians” in advocating a stronger American response to the contemporaneous Russian military intervention in the small Caucasian state. He similarly called for the United States to provide military aid to Ukraine in 2014. Although he stopped well short of calling for impeachment or resignation, the ultimate fate of President Richard Nixon in the 1970s scandal he referenced, McCain’s appraisal of the situation fits neatly into an emerging mainstream media narrative that Trump’s actions rise to an equivalent level.'"}, "time": 1742563839.9139812}