{"duration": 0.11761140823364258, "input_args": {"text": "'ISLAMABAD, Pakistan  —   Qandeel Baloch, a Pakistani social media sensation, was strangled by her brother in central Pakistan, police officials said Saturday, in what appears to have been a   honor killing. The police said Ms. Baloch was apparently attacked on Friday night while she was asleep in her parents’ house in Muzaffarabad, a town on the outskirts of Multan in the province of Punjab. Ms. Baloch’s brother, Waseem Ahmed Azeem, was arrested late Saturday night in connection with her death. Ms. Baloch, 26, a model, singer and social media celebrity, had gained notoriety in Pakistan recently because of provocative, seminude photographs of herself that she posted on social media sites, and appearances in music videos. Her bold persona defied the conventions of Pakistan, a deeply conservative society. She was reviled by some in the country for being crass and vulgar, and prone to   stunts. But other Pakistanis admired her defiance and independence. She attracted more than 700, 000 followers on Facebook and at least 40, 000 on Twitter. “Qandeel was probably the first true female internet celebrity in Pakistan, in that her celebrity had nothing to do with any achievement beyond her provocative presence on social media,” said Hasan Zaidi, a Pakistani filmmaker and media critic. “It was unfathomable to a lot of Pakistanis that a real woman could be as brazen or shameless about her sexuality publicly, because her entire persona was built around flaunting her body, talking about sex and being in everyone’s face,” Mr. Zaidi said. Ms. Baloch’s latest appearance was in a video by an unknown singer, in which she danced provocatively to a song titled “Ban. ” The producers of the song anticipated that it could not be broadcast on mainstream entertainment channels and instead posted it on YouTube. Born to a poor family from the backwaters of Punjab, Ms. Baloch, whose real name was Fauzia Azeem, said she had run away from home to pursue her dream of becoming a star. She took to social media after unsuccessful efforts to enter the mainstream entertainment industry. In interviews, she acknowledged that she was pushing the traditional boundaries of socially acceptable behavior in Pakistan. “I know I exploited the freedom given to me by my parents,” she said in an interview with BBC. “But now, it is too late. ” In June, Ms. Baloch posted photographs of herself with a   Muslim cleric, Mufti Abdul Qavi, which attracted much attention on social media. The pictures show Ms. Baloch pouting and wearing the cleric’s hat while he, seemingly bedazzled, stares into the camera. Many Pakistanis saw the photographs as scandalous, and Mr. Qavi was removed from his position on the country’s   committee, which determines when Ramadan starts and ends in accordance with the Islamic lunar calendar. On Wednesday, she found herself in the spotlight again after local media outlets reported that a man identified as her former husband claimed that he had a son with her and that he had divorced her after he could not meet her demands to provide a house and a luxury car. In response, Ms. Baloch said she had been a victim of domestic abuse. Ms. Baloch was not shy about saying she wanted to be famous. In a Twitter post on Wednesday, Ms. Baloch wrote: “I will fight for it. I will not give up. I will reach my goal  absolutely nothing will stop me. ” The news of her death prompted an immediate outcry on Twitter and Facebook in Pakistan, with many people condemning her killing and praising Ms. Baloch for her irreverent and uninhibited ways. “Qandeel Baloch was no role model,” Sherry Rehman, an opposition politician and a former Pakistani ambassador to Washington, posted on Twitter. “But she deserved a better life and death. Strongly condemn. ” The killing has put the spotlight back on   honor killings in Pakistan. Each year, hundreds of Pakistani women are killed by relatives angered by behavior they believe has tarnished the family’s reputation,   activists say. Prime Minister Nawaz Sharif has vowed to strengthen laws intended to prevent such killings, but critics say no concrete steps have been taken yet. In most cases, the honor killings take place within the family, said Syeda Sughra Imam, a former senator from Punjab who has pushed for legislation against the practice. “The accused and the complainant are from the same family and they forgive each other,” Ms Imam said. “No one is ever prosecuted. ” Ms. Imam’s proposed legislation calls for eliminating a “forgiveness clause” in Pakistani law that allows families to reach a financial settlement or to forgive the killer. “This killing with impunity has to stop,” Ms. Imam said.'"}, "time": 1742564110.559915}