{"duration": 0.09963417053222656, "input_args": {"text": "'  celebrities ripped President Donald Trump Thursday after he officially announced that the United States will withdraw from the Paris Climate Agreement. [Filmmaker Michael Moore took to Twitter and said “Trump just committed a crime against humanity. ”  Trump just committed a crime against humanity. This admitted predator has now expanded his predatory acts to the entire planet. #ParisAccord,  —   Michael Moore (@MMFlint) June 1, 2017,  USA to Earth: FUCK YOU,  —   Michael Moore (@MMFlint) June 1, 2017,  Actor Alec Baldwin said Trump is a “deranged, infantile maniac” getting in the way of the country from addressing climate change. All the world wants 2 address climate chg. Except the US. This country is being piloted in2 an iceberg by this deranged, infantile maniac,  —   ABFoundation (@ABFalecbaldwin) June 1, 2017,  “The United States will withdraw from the Paris Climate Accord,” President Trump said Thursday in a speech delivered in the White House Rose Garden. Withdrawing from the   Paris Climate agreement was a major campaign promise made by Trump during his presidential run. Below is a sampling of the reaction from   celebrities to Trump’s decision to remove the U. S. from the Paris Climate Accord. . @realDonaldTrump I ask humbly to remember your children, their children  all children will be left to live   results of your decision pic. twitter.   —   KATY PERRY (@katyperry) June 1, 2017,  FIRE SCOTT PRUITT  —   EPA HEAD  —   DEAR GOD THIS IS FUCKING INSANE,  —   ROSIE (@Rosie) June 1, 2017,  I’ve never been this embarrassed to be an American (besides Nov. 8th). #ActOnClimate #ParisAccord,  —   Kevin McHale (@druidDUDE) June 1, 2017,  Today, our planet suffered. It’s more important than ever to take action. #ParisAgreement https:  .   —   Leonardo DiCaprio (@LeoDiCaprio) June 1, 2017,    #DonaldTrump quits Climate Accords. Think of all the time effort  money poured into this  he bails giving BigOil a windfall.  —   Bette Midler (@BetteMidler) June 1, 2017,  Oh my God, you really are a monster, @realDonaldTrump.  —   Alyssa Milano (@Alyssa_Milano) June 1, 2017,  Mother ducker. https:  .   —   Alyssa Milano (@Alyssa_Milano) June 1, 2017,  Don’t boo. VOTE. #2018 #ParisAgreement,  —   Alyssa Milano (@Alyssa_Milano) June 1, 2017,  We need to organize our unions, retirement plans, stock accounts to pull out of all fossil fuels. We will have to lead our Gov. with our $.  —   Patricia Arquette (@PattyArquette) June 1, 2017,  We have to stop this asshole. This is urgent. You have to vote in 2018.  —   John Legend (@johnlegend) June 1, 2017,  You are a monster and you’re fucking up the world. https:  .   —   (((Joshua Malina))) (@JoshMalina) June 1, 2017,  I second that emotion! https:  .   —   John Leguizamo (@JohnLeguizamo) June 1, 2017,  The president believes in science LESS THAN THE POPE. #ActOnClimate pic. twitter.   —   Mike Birbiglia (@birbigs) June 1, 2017,  The family of the future after #trump and the @GOP get through with the environment. pic. twitter.   —   moby XⓋX (@thelittleidiot) June 1, 2017,  2017  …    the year science, reason and accountability died. https:  .   —   Josh Gad (@joshgad) June 1, 2017,  So Kathy Griffin is more harmful to Barron Trump than global warming. Got it.  —   billy eichner (@billyeichner) June 1, 2017,  If you listen carefully, every word he says in this clip is total bullshit. https:  .   —   Colin Hanks (@ColinHanks) June 1, 2017,  A 70 year old moron who thinks climate change is a hoax hired a band to celebrate the earth dying faster. This is beyond embarrassing,  —   Ike Barinholtz (@ikebarinholtz) June 1, 2017,  I’m guessing that Donald Trump doesn’t see the irony in making his announcement to leave the Paris Agreement while standing in a garden.  —   Chelsea Handler (@chelseahandler) June 1, 2017,  Donald asks ”At what point does America get demeaned? At what point do they start laughing at us?” Literally, the moment you were elected.  —   George Takei (@GeorgeTakei) June 1, 2017,  We have the list of  senators who supported Paris pull out. Now pressure those who didn’t want to divest in fossil https:  .   —   Patricia Arquette (@PattyArquette) June 1, 2017,  He loves the ocean so much he’s gonna give us a lot more of it to appreciate. https:  .   —   Full Frontal (@FullFrontalSamB) June 1, 2017,  A neurotic megalomaniac just stepped on his own dick in the parking lot. Each governor, mayor, state assembly can ignore this  accept Paris,  —   Peter Henry Fonda (@iamfonda) June 1, 2017,  He needs to stop saying ”believe me”  …    it just reminds us that we never can.  —   Ellen Barkin (@EllenBarkin) June 1, 2017,  Not only is Trump killing the Republican Party, he wants to make their mascot extinct.  —   Jason Reitman (@JasonReitman) June 1, 2017,  How is stepping away from the Paris Climate change agreement ’Making America Great Again’ America is one of the biggest polluters on the 🌎💸  —   Michelle Rodriguez (@MRodOfficial) June 1, 2017,    Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742562718.986366}