{"duration": 0.06813430786132812, "input_args": {"text": "'It has become something of an online custom in the social media age to react to tragic news stories  —   like Wednesday’s attack in London  —   with   if sometimes rote messages like “thoughts and prayers. ” But that does not appear to be Donald Trump Jr. ’s style. “You have to be kidding me? !” Mr. Trump said Wednesday afternoon on Twitter, as details of the episode  —   which left at least five dead, including the assailant, and 40 injured  —   continued to unfold. The message continued, “Terror attacks are part of living in big city, says London Mayor Sadiq Khan. ” Mr. Trump, the oldest son of President Trump, was calling attention to an article from September in The Independent, a British newspaper, that described Mr. Khan’s reaction to a bombing then in the Chelsea neighborhood of New York City. Mr. Trump mischaracterized the London mayor’s remarks. Mr. Khan did not describe terrorism as “part of living in a big city,” as if bombings and shootings were an inescapable fact of life. He said that terrorism preparedness, including providing sufficient support to the police, was “part and parcel of living in a great global city. ” “That means being vigilant, having a police force that is in touch with communities it means the security services being ready, but it also means exchanging ideas and best practice,” Mr. Khan said in a video interview published by The Evening Standard, another British paper. (For the record, Mr. Khan did say the victims of the Chelsea bombing were in his “thoughts and prayers. ”) “Nothing is more important to me than keeping Londoners safe,” Mr. Khan added. “I want to be reassured that every single agency and individual involved in protecting our city has the resources and expertise they need to respond in the event that London is attacked. ” On Thursday morning, Mr. Khan said in an interview on CNN that he would not respond to Mr. Trump’s tweet because he had “been doing far more important things over the last 24 hours. ” “What I do know is that the threat level in London and across the country is severe,” he said. “That means an attack is highly likely. I was in New York last year when there was an attack in New York. And terrorists hate the fact that whether it’s New York, whether it’s London, whether it’s Paris, whether its Brussels, whether it’s Istanbul, whether it’s Madrid, we have diverse communities living together peacefully. ” Mr. Trump’s tweet was not well received by Britons, who were still learning details of the attack when he weighed in. On Twitter, Wes Streeting, a member of Parliament from the Labour Party, accused Mr. Trump of capitalizing on the attack in London and called him “a disgrace. ” Ciaran Jenkins, a correspondent for Britain’s Channel 4, asked the president’s son on Twitter if he thought his remarks were “helpful. ” “Did you even read the article before goading London’s Mayor during a live incident?” he wrote. He added, “Headline is based on very first sentence, which if you’d bothered to read it could apply to any major city in the world. Key word: ‘threat.’ ” Mr. Trump declined to elaborate later on Wednesday. “I’m not going to comment on every tweet I send,” he said in an email. Political violence in the United Kingdom is relatively rare. Decades of sectarian violence in Northern Ireland often spilled over, but there had not been a   attack in Britain since 2005, when  more than 50 people died in subway and bus attacks.'"}, "time": 1742563491.0453463}