{"duration": 0.09887099266052246, "input_args": {"text": "'President Recep Tayyip Erdogan of Turkey said on Wednesday that he had no doubt the assassin of Russia’s ambassador had belonged to the outlawed Turkish organization of Mr. Erdogan’s rival, Fethullah Gulen. The president’s assertion, 48 hours after the ambassador was gunned down by an   police officer at an Ankara art gallery, essentially doubled down on the Turkish government’s contention that evidence showed the assassin was a sleeper agent of Mr. Gulen, a Muslim cleric. Mr. Gulen, who lives in exile in the United States, has denounced the assassination and denied any complicity in it. His spokesman has called such accusations “nonsense” meant to distract attention from what amounts to a spectacular security lapse in the Turkish capital. The Russian ambassador, Andrey G. Karlov, was shot multiple times on Monday evening by the   policeman, Mevlut Mert Altintas, 22, who shouted jihadist slogans and said, “Don’t forget Aleppo, don’t forget Syria!” His words suggested he was avenging victims of Russia’s intervention in the Syrian conflict. Mr. Altintas was fatally shot by other police officers. “There is no reason to hide that he’s a member of the Feto network,” Mr. Erdogan was quoted as saying by Turkish news media, using the acronym for what the government calls the Fethullah Gulen terrorist organization. “All his connections, from where he was educated to his links, point to Feto. ” The government of Russia, which has sent investigators to Turkey to collaborate on the inquiry into Mr. Karlov’s assassination, has been far more cautious in public statements about the killer’s possible affiliation or motive, saying it was premature to draw any conclusions. Mr. Gulen has been accused by the Turkish government of remotely directing the failed coup attempt on July 15, which he has denied. Since then, the government has requested his extradition from the United States and arrested or dismissed thousands of people in the security forces, civil services and educational institutions suspected of being Gulen followers, describing them as seditious infiltrators. The purge was further widened on Wednesday with the suspension of nearly 2, 000 teachers and school employees, Reuters reported from Ankara, quoting an unidentified Education Ministry official. The Turkish authorities also have arrested more than 100 journalists and closed dozens of news media outlets, in what press activists have called an unprecedented repression. The Committee to Protect Journalists, an advocacy group, reported on Dec. 13 that Turkey has become the world’s leading jailer of journalists.'"}, "time": 1742563087.9085252}