{"duration": 0.10666942596435547, "input_args": {"text": "'November 03, 2016 Reward Clinton\\'s Hawkishness Because Trump\\'s Foreign Policy Is Uncertain? \\nFor me, as a non U.S. person, the major issues of the U.S. presidential elections is always foreign policy. There Trump is not hawkish at all. He has somewhat confused, unlearned blustering positions on foreign policy but is basically a cautious, risk averse businessman. He consistently criticizes the war mongering in Washington DC. Hillary Clinton is a run-of-the-mill warmongering neoconservative compatible with the imperial \"mainstream\" of the power centers in Washington and elsewhere. \\nTrump has called up this contrast again and again (as do I ). In a speech (vid at 53:20 min) in Grand Rapids Michigan on October 31 he again highlights these points. Some excerpts (taken from this partial transcript part 9, 10): Hillary led us to disaster in Iraq, in Syria, in Libya. ... Hillary and our failed Washington establishment have spent $6 trillion on wars in the Middle East, and now it’s worse than it’s ever been before. \\nHad Obama and others gone to the beach, Obama could have gone to the golf course, we would have been in much better shape. \\nWe shouldn’t have gone into the war, and she thinks I’m a hawk. Oh, Donald Trump. ... Imagine if some of the money had been spent, $6 trillion in the Middle East, on building new schools and roads and bridges right here in Michigan. \\nNow Hillary, trapped in her Washington bubble, that’s blind to the lessons, wants to start a shooting war in Syria in conflict with a nuclear armed Russia that could drag us into a World War III. \\nOkay, folks. She – I’ll tell you what. She will get us into World War III. She will get us into World War III. I will tell you that. She’s incompetent. She will get us into World War III. \\nThe arrogant political class never learns. They keep repeating the same mistakes over and over again. They keep telling the same lies. They keep producing the same failed results. \\nTrump may well be lying when he says he does not seek a conflict with Russia or anyone else. Trump surely lies on other issues. But those are mostly rather obvious lies and some are even a bit comical. He is playing Reagan on economic issues, promising tax cuts that can not be financed (and which Reagan had to take back in the end when he introduced the biggest tax hike ever). On many issues we do not know what Trump is really planning to do (or if he plans at all). But he has never given the impression that he is hawkish or willing to incite a war. \\nClinton on the other hand has a proven record of being a proactive hawk. She is willing to go to war and to kill people because the U.S. can. bigger \\nShe is a political animal totally dependent on her sponsors. Economically she is pro-banks, pro-big-business and for further deregulation. A neoliberal. The only \"liberal\" standpoints she has are on some hyped identity issues relevant only for a very tiny group of people like transgenders. She told her real voters, the people who pay her, that her public standpoint on many issues is different from the one she will pursue. She did not mean that what she will pursue will be less hawkish than her public stand, or that she will be more progressive on economic issues than she openly claims. \\nClinton assures us that Trump is Putin\\'s puppet who will start a nuclear World War III with Russia. She doesn\\'t say how that computes. Will Putin order Trump to give him asylum in Washington while Moscow and Washington get nuked? \\nWith Trump the U.S. would get a president who is a pretty unknown factor but, in my judgment, a less dangerous one to the U.S. and the world than Clinton. With her the next useless and deadly wars are practically guaranteed. \\nMicah Zenko , who\\'s opinion I value, agrees with my diagnose, Trump is less hawkish , but has a different judgement: When it comes to foreign policy, Trump’s own positions make him the most immoral, poorly informed, and dangerous presidential candidate in recent American history. \\nIf Clinton is elected, there will undoubtedly be troubling foreign-policy positions and actions which must be thoroughly questioned and scrutinized. I just deeply hope that citizens have the opportunity to hold a President Hillary Clinton to account. \\nThe citizens of the United States now have an opportunity to hold Secretary of State Clinton to account for her \" We came, we saw, he died \" war on Libya and for escalating the war on Syria. The militaristic (and failed) pivot to Asia, the \"regime changes\" putsches in Honduras and Ukraine and the deterioration of relations with Russia are also to a large part her work. Should the voters reward her for all the death, misery and new dangers she created as Secretary of State by making her President? \\nWho would I vote for? Not Hillary. Not for Trump either. Some third party candidate - probably Stein of the Green Party. It would be a \"useless and wasted\" vote in the short term though such votes have some light influence on the programs of the big parties. In the long term the example of voting third parties will hopefully induce more people to do the same. If it becomes a more common, regular thing to do it might over time break the duopoly of today\\'s consensus in Washington. It is a small chance, but possibly a big long-term reward.   3, 2016 at 03:22 PM | Permalink'"}, "time": 1742563942.4647367}