{"duration": 0.06346249580383301, "input_args": {"text": "\"Big Pharma Targets Profits in Rare Diseases All of the world's most expensive drugs are used to treat uncommon conditions Image Credits: StockSnap/Pixabay . \\nOne might think Big Pharma garners most of its profit peddling pills for more well-known diseases, but new research shows that pharmaceutical companies are instead searching for the next “big thing” in rare diseases. \\nBig Pharma’s profit margins continue to rise considerably with rarer diseases, simply because they can charge more for the pills than they do for medication for more common ailments. \\nThe search for the next money-maker within rare diseases has actually halted some of the advancements for more common ailments, which may explain why they still haven’t discovered a cure for some of the most common diseases affecting the world’s population. \\nIn 1983, the Orphan Drug Act started to incentivize the creation of drugs for rarer diseases to ensure that those suffering from uncommon conditions were not neglected in new scientific research simply because the drugs weren’t as profitable. \\nBecause of the incentives, which include reduced taxes and reduced or waived regulatory fees, over 500 new drugs for uncommon diseases have hit the market since the law was introduced. \\nFor common illnesses, Big Pharma can get still turnover big profits while not charging a fortune for the drug. For example, Liptior (atorvastatin), which is used to regulate cholesterol, generates a sales profit of $131 billion with the prescription only costing patients around $2 per day. \\nBut with rare diseases, prices must be kept high in order to keep Big Pharma in business. This means that while those with uncommon illnesses may benefit healthwise from the new measures, their pocketbooks are in for a hit. \\nFor example, the cystic fibrosis drug Kalydeco by Vertex costs individual patients $311,000. \\nGilead’s Sovaldi, used to treat Hepatitis C, cashes in at $84,000 for a paltry 12-week course of medication. \\nAnd Soliris, used to treat rare blood conditions, costs the patient a whopping $400,000 per year. \\nThe list of the 10 most expensive drugs that are currently manufactured are all created to treat “orphan” or uncommon illnesses. \\nThanks to these laws that allow Big Pharma to charge these insane amounts of money, they can use those who suffer from rare diseases as their cash cows. \\nDrugs for rare diseases will account for 19% of pharmaceutical branded drug profits by the year 2020. NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles\""}, "time": 1742562043.012391}