{"duration": 0.11220383644104004, "input_args": {"text": "'Email \\n“We don’t force our faith on anybody else,” Chuck Wingate, executive director of Bethesda Mission, told PennLive.com . “But we find the whole idea that the government’s going to come in a[nd] tell us what we can and cannot do in our own facility to be out of bounds, especially in matters of faith.” \\nWingate, who says his Harrisburg, Pennsylvania, ministry serves 100,000 people a month, was referring to a new U.S. Department of Agriculture (USDA) regulation forbidding recipients of USDA food from requiring “a beneficiary to attend or participate in any explicitly religious activities that are offered by the organization.” A USDA press release stated that the rule was established pursuant to an executive order issued by President Barack Obama and would “provide new religious liberty protections for beneficiaries of federally funded social service programs.” \\nBethesda, which has been helping the poor and homeless in the Keystone State capital for nearly 102 years, formerly received about 1,000 pounds of USDA food per month via the Central Pennsylvania Food Bank. But given the choice between taking Uncle Sam’s freebies and continuing to offer thanks to God before serving meals, the mission’s leaders decided on the latter. \\n“We can no longer take the food on principal [sic] because prayer is an integral part of everything we do at Bethesda Mission,” Scott Dunwoody, the shelter’s vice president of business development, told Harrisburg’s WHTM-TV . \\n“The USDA revised regulations regarding this food distribution to say that no religious services or religious activities could occur during the distribution of the food,” Wingate told CNSNews.com . “Well, we pray before meals, so if there’s a meal being served — and we serve 3,000 meals a week — if there’s a meal being served with USDA food somewhere in it, then we would be prohibited from praying. We just said ‘nope’ that’s too onerous for us and we’re not going to continue to accept the food if that’s a condition of receiving it.” \\nMany religious charities are now faced with the same dilemma as Bethesda. So far, few seem willing to cut the umbilical cord to Washington — or perhaps they long ago made the necessary compromises to get USDA comestibles. Jennifer Powell of the Central Pennsylvania Food Bank told PennLive that “only a handful” of the bank’s 900 program partners have chosen either to stop taking the USDA food or to change their practices — by, say, conducting prayers outside the room in which the food is served — to fall in line with the new rule. \\nEric Saunders, executive director of Harrisburg-area New Hope Ministries, told PennLive his ministry didn’t need to change its practices because they have never required people to participate in prayer or a religious service in order to obtain food. “When the new rule came out,” reported the website, “Saunders said he simply reminded staff to make sure any religious activities were done at a different time or place from when people were being served.” \\nBethesda doesn’t require participation in religious activities, either, but anyone there for a meal is going to be in the presence of an audible prayer. This, apparently, does not comport with the Obama administration’s definition of religious freedom, whereby passively causing someone to hear a prayer before giving him free food is unacceptable but forcing a Christian charity or business to pay for contraceptive coverage for its employees is worth defending all the way to the Supreme Court. \\nSaunders said of Bethesda, “I have a lot of respect for them and the principled stand they took.” \\nBethesda will probably not be hurt much by declining the USDA’s food. Although 1,000 pounds a month sounds like quite a bit of food, it really only amounted to about 0.5 percent of the food distributed by the shelter, according to Wingate. He claimed the announcement has already led to an increase in donations to the ministry. In addition, Powell said the food bank has plenty of other food the mission could use. \\nAll of these problems could have been avoided, of course, if the federal government had not strayed from its enumerated powers under the Constitution. Nowhere in that document is the government delegated the authority to distribute food, no matter how noble its intentions may be in doing so. As James Madison, the father of the Constitution, so eloquently put it, “I cannot undertake to lay my finger on that article of the Constitution which granted a right to Congress of expending, on objects of benevolence, the money of their constituents.” \\nCharities, especially Christian ones, ought also to be mindful of the fact that the “free” food they get from Washington and other levels of government is paid for by the expropriation of the citizenry; “Thou shalt not steal” contains no exceptions for either government or charities. Furthermore, they should recognize that by accepting the government’s largess, they are also accepting its control, even to the point of denying their faith. It may be more cumbersome and less reliable to subsist on voluntary contributions, but it is the only sure way to maintain a charity’s religious character over the long run. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563901.2991796}