{"duration": 0.05075883865356445, "input_args": {"text": "'Actor George Clooney went on an   Trump rant at the César Film Awards ceremony in Paris Friday night, claiming that the president is alarming America’s allies and giving “comfort to our enemies. ”[While accepting his honorary award, Clooney said, “I was thinking about Edward R. Murrow,” referencing his 2005 film Good Night, and Good Luck, “as we find ourselves nostalgic for when America was great and when the news wasn’t fake. ”  “We must not confuse dissent for disloyalty,” Clooney continued, quoting Murrow. “We must not walk in fear of one another. We must not be driven by fear into an age of unreason. ” Then Clooney got political. “The actions of this president have caused alarm and dismay amongst our allies abroad and given considerable comfort to our enemies. ” “And whose fault is that?” the Money Monster star asked, never mentioning Trump by name. “Not really his. He didn’t create this situation of fear, he merely exploited it, and rather successfully. ” Le discours de George Clooney était sans aucun doute LE moment des #cesar2017 pic. twitter.   —   BuzzFeed France (@BuzzFeedFrance) February 24, 2017,  The    actor’s politically charged speech comes just days after he called Trump and White House chief strategist Steve Bannon the real “Hollywood elitists. ” Referencing actress Meryl Streep’s infamous   speech last month at the Golden Globes, Clooney said Hollywood celebrities have a right to preach politics. “When Meryl [Streep] spoke, everyone on that one side said, ‘Well, that’s elitist Hollywood speaking,’” Clooney said during an interview with French news outlet Canal Plus. Trump, the actor added, “collects $120, 000 a year from his Screen Actors Guild pension fund. He is a Hollywood elitist. ” Clooney said Bannon, who has produced 16 films, is a “failed film writer and director. ” “He wrote a Shakespearean rap musical about the L. A. riots that he couldn’t get made,” Clooney said. “He made a lot of money off of Seinfeld. He’s elitist Hollywood. I mean, that’s the reality. ” The   was a staunch Hillary Clinton supporter throughout the presidential election, having hosted a $33, 400   fundraiser for her last year at the Studio City home where he and his wife Amal Clooney reside. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742564457.8904696}