{"duration": 0.299724817276001, "input_args": {"text": "'  \\nIntroduction: Wall Street and the Pentagon greeted the onset of 2016 as a ‘banner year’, a glorious turning point in the quest for malleable regimes willing to sell-off the most lucrative economic resources, to sign off on onerous new debt to Wall Street and to grant use of their strategic military bases to the Pentagon. \\nBrazil and Argentina, the most powerful and richest countries in South America and the Philippines, Washington’s most strategic military platform in Southeast Asia, were the objects of intense US political operations in the run-up to 2016. \\nIn each instance, Wall Street and the Pentagon secured smashing successes leading to premature ejaculations over the ‘new golden era’ of financial pillage and unfettered military adventures. Unfortunately, the early ecstasy has turned to agony: Wall Street made easy entries and even faster departures once the ‘honeymoon’ gave way to reality. ; The political procurers persecuted center-left incumbents but, were soon to have their turn facing prosecution. The political prostitutes, who had decreed the sale of sovereignty, were replaced by nationalists who would turn the bordello back into a sovereign nation state. \\nThis essay outlines the rapid rise and dramatic demise of these erstwhile ‘progeny’ of Wall Street and the Pentagon in Argentina and Brazil, and then reviews Washington’s shock and awe as the newly elected Philippines President Rodrigo Duterte embraced new ties with China while proclaiming, ‘We are no one’s ‘tuta’ (puppy dog)!’ \\nArgentina and Brazil: Grandiose Schemes and Crapulous Outcomes \\nThe international financial press was ecstatic over the election of President Mauricio Macri in Argentina and the appointment of former Wall Street bankers to his cabinet. They celebrated the ouster of the ‘evil populists’, accusing them of inflating economic results, reneging on debt obligations and discouraging foreign lenders and investors. Under the Macri regime all market obstacles were to be removed and all the bankers trembled with anticipation at the ‘good times’ to come. \\nAfter taking office in December 2015, President Macri unleashed the ‘animal instincts’ of the market and the carrion birds flocked in. US ‘vulture funds’ scooped up and demanded payment for on old Argentine debt ‘valued’ at $3.5 billion – constituting a 1,000% return on their initial investment. A devaluation of the peso of 50% tripled inflation and drove down wages by 20%. \\nFiring over 200,000 public sector employees, slapping 400% price increases on utilities and transport, driving small and medium size firms into bankruptcy and enraged consumers into the streets ended the honeymoon with the Argentine electorate quite abruptly. This initial massive dose of free enterprise ‘medicine’ was prescribed by the local and Wall Street bankers and investors who had promised a new golden era for capitalism! \\nNow that he had banished the ‘populists’, Macri was free to tap into the international financial markets. Argentina raised $16.5 billion from a bond sale taken up by the big bankers and speculators, mostly from Wall Street, who were eager to cash in on the high rates in the belief that there was no risk with their champion President Macri at the helm. Wall Street based its giddy predictions on a mere three-month experience with Mauricio! \\nBut then… some of the hedge fund managers began to raise questions about the viability of Mauricio Macri’s presidency. Instead of reducing the fiscal deficit, Macri began to increase public spending to offset mass discontent over his triple digit increases in utility fees and transportation, the mass layoffs in the public sector and the slashing of pension funds. \\nThe major banks had counted on the abrupt devaluation of the currency to invest in the export sector, but instead they were confronted with a sudden 11% appreciation of the peso and a skyrocketing inflation of 40% leading to high interest rates. As a result, the economy fell even deeper in recession exceeding minus 3% for the year. \\nWhile most Wall Street bankers still retain some faith in the Macri regime, they are not willing to fork-over the kind of cash that might allow this increasingly unpopular regime to survive. What keep Wall Street on board the sinking ship are the political and ideological commitments rather than any objective assessment of their protégée’s dismal economic performance. Wall Street counts on free market bankers appointed to the ministries, the massive purge of social services (health and education) personnel and the lucrative bond sales to cover the burgeoning deficit. They hope the vast increase in profits resulting from increased utility fees and the sharp cuts in salaries, pensions and subsidies will ultimately lead them into the promised land. \\nWall Street has expressed dismay over Macri’s failure to stimulate growth – in fact GDP is falling. Furthermore, their ‘golden boy’ failed to attract productive investments. Instead thousands of Argentine small and medium businesses have ‘gone under’ as consumer spending tanked and extortionate tariffs were slapped on vital public utilities and transport – devastating profits. Inflation has undermined the purchasing power of the vast majority of households. Wall Street speculators, concentrating on fixed-rate peso denominated debt, are at risk of losing their shirts. \\nIn other words, the administration’s ‘free enterprise’ regime is based largely on attracting foreign loans, plundering the national treasury, firing tens of thousands of public sector workers and slashing spending on social services and business-friendly subsidies. Macri has yet to generate any large-scale investment in new innovative productive sectors, which might sustain long-term growth. \\nAlready facing growing discontent and a general strike of private and public sector workers, the ‘bankers’ regime’ lacks the political links with the trade unions to neutralize the growing opposition. ORDER IT NOW \\nTo hold back the growing tidal wave of discontent, President Macri had to betray his overseas investors by boosting fiscal spending, which has had little or no impact on the national economy. \\nWall Street’s hopes that President Mauricio Macri would inaugurate a ‘golden era’ of free market capitalism lasted less than a year and is turning into a real fiasco. Rising foreign debt, economic depression and class warfare ensures Macri’s rapid demise. \\nBrazil: Wall Street’s Three Month ‘Whirl-Wind’ Honeymoon \\nMost of the current elected members of the Brazilian Congress, Senate and the recently-installed (rather than elected) President, as well as his cabinet, are in trouble: The hero, Michael Temer and his argonauts, chosen by Wall Street to privatize the Brazilian economy and usher in another ‘golden dawn’ for finance capital, now all face criminal changes, arrest and long prison sentences for money laundering, bribery, fraud, tax evasion and corruption. \\nIn less than four months, the entire political edifice constructed to impeach the elected President Dilma Rousseff and then de-nationalize key sectors of the economy, is shaking. So much for the financial press’s proclamation of a new era of “business friendly” policies in Brazilia. \\nThe pundits, politicians, journalists and editors, who prematurely celebrated the appointment of Michael Temer to the Presidency by legislative coup, now have to face a new reality. The key to understanding the rapid collapse of the New Right project in Brazil lies in the growing ‘rap sheets’ of the very same politicians who engineered the ouster of Rousseff. \\nEduardo Cunha, the ex-president of the Congress in Brasilia, used his influence to ensure the super majority of Congressional votes for the impeachment. Cunha was godfather to ensuring the appointment of Michael Temer as interim president. \\nCunha’s influence and control over the Congress was based on his wide network of bribes and corruption involving over a hundred members of congress, including the newly anointed President Temer. \\nOnce Cunha secured the ouster of Rousseff, the Brazilian elite washed their collective hands of the ‘fixer’, overwhelmed by the stench of his corruption. In September 2016, Cunha was suspended from Congress and lost his immunity. One month later, he was arrested on over a dozen charges, including fraud and tax evasion. It was public knowledge that Cunha had squirreled away a ‘tidy nest’ of over $70 million in Swiss banks. \\nCunha directed (extorted) public and private firms to finance the campaigns of many of his political colleagues. He had intervened to secure bribes for President Temer, his foreign minister and even the next presidential hopeful, Jose Serra. One of the most powerful representatives of the new regime, Moreira Franco, Grand Wizard of the Privatization Program, was ‘in hock’ to Cunha. \\nAs all this has come to light, Cunha has been negotiating a plea bargain with the prosecutor and judges in return for his ’singing’ a few arias. He is facing over a hundred years in jail; his wife and daughter face trial; Eduardo Cunha is prepared to talk and finger political leaders to save his own neck. Most knowledgeable observers and judicial experts fully expect Cunha to bring down the Temer Administration with him and devastate the leadership of Temer’s Brazilian Democratic Movement Party, as well as ex-president Fernando Henrique Cardoso’s Brazilian Social Democratic Party. \\nThe Brazilian elite, Wall Street bankers and their mass media propagandists, who wrote and directed the impeachment plot scenario are now discredited and bereft of political front men. Their expectations of a new ‘golden era of free market capitalism’ in Brazil has turned into a political mad scramble with every politico and corporate leader desperate to save his own skin and illicit fortune by denouncing each other. \\nWith the demise of the ‘Brazilian takeover’, Wall Street and Washington are bereft of key markets and allies in Latin America. \\nThe Philippines: The Duterte turn from the US to China \\nIn April 2014, Washington ’secured’ an agreement granting access to five strategic military bases in the Philippines critical to its ‘pivot to target’ China. Under the outgoing President ‘Noynoy’ Aquino, Jr. the Pentagon believed it had an ‘iron-clad’ agreement to organize the Philippines as its satrap and military springboard throughout Southeast Asia. Washington even prodded the Aquino government to bring its Spratly Island dispute with China before the obscure Permanent Court of Arbitration in the Hague. Washington anticipated using the Court’s ‘favorable’ ruling as a pretext to confront the Chinese. \\nAll this has changed with the June 2016 ascent to the Presidency of Rodrigo Duterte: In only four months, all Washington’s imperial designs had been swept off the table. By October 21, 2016 President Duterte announced he would end military exercises with Washington because they threatened Philippine sovereignty and made his country vulnerable to a military confrontation with China. He promised to end sea patrols of disputed waters that the US uses to harass China in the South China Sea. \\nIn advance of the Philippines President’s meeting with China, he had already declared that he would not press the Dutch-based ruling over the South China Sea island dispute against Beijing but rely on diplomacy and compromise. During the China meeting President Duterte declared that the two countries would engage in a constructive dialogue to resolve the Spratly Islands as well as other outstanding issues. The ‘agreement’ over US access to bases in the Philippines was put in doubt as the President declared “a separation from the US” and promised long-term, large scale economic and investment ties with China. Undergirding the Philippines pivot to China were 13 trade and investment agreements worth more than $20 billion, covering financing of infrastructure, transport, social projects, tourism, industry and agriculture. ORDER IT NOW \\nThe military base agreement, signed by the notoriously servile ex-President Aquino without Congressional approval, was review by the Philippine Supreme Court and can be revoked by the new President Duterte by decree. \\nInside of four months, the US strategy of armed encirclement and intervention against China has been dealt a major blow. The newly emerging China-Philippines linkage strikes a fatal blow to Washington’s overtly militarist ‘pivot’ against China. \\nConclusion \\n2016 opened with great fanfare: The defeat of the two major center-left governments (Argentina and Brazil) and the advent of hard-right US-backed regimes would inaugurate a ‘golden era of free market capitalism’. This promised to usher in a prolonged period of profit and pillage by rolling back ‘populist’ reforms and creating a bankers paradise. In Southeast Asia, US officials and pundits would proclaim another ‘golden era’, this time of rampant militarism, encircling and provoking China on its vital sea lanes, and operating from five strategic military bases obtained through a Philippine Presidential decree by an unpopular and recently replaced puppet, ‘Noynoy’ Aquino, Jr. \\nThese dreams of ‘golden eras’ lasted a few months before objective reality intruded. \\nBy the autumn of 2016 the rightist regimes had been replaced in the Manila by a colorful ardent nationalist, while the ‘banker boys’ in Brasilia faced prison, and the ‘Golden Boys’ of Buenos Aires were mired in deep crisis. The notion of an easy Rightist restoration was based on several profound misunderstandings: \\n1) The belief that the reversal of social reforms and denial of popular demands would smoothly give way to an explosion of foreign financing and investment was shattered when private bond purchases profited the financial sector but did not bring in large-scale productive investment. Devaluation of the currency was followed by skyrocketing inflation, which led to fiscal deficits and the loss of business confidence. \\n2) Washington’s promotion of ‘corruption investigations’ started with prosecuting democratically elected center-left politicians and ended up with the arrest of Wall Street’s own protégés encompassing the entire right-wing political class and decimating the ‘Golden’ regimes. \\n3) The belief that long-term hegemonic relations, based on client regimes in Asia, could resist the attraction of signing trade and investment agreements with the rising Chinese mega-economy, while sacrificing vital economic development, and relegating their masses to more stagnation and unemployment, collapsed with the massive electoral of nationalist Rodrigo Duterte as President of the Philippines. \\nIn fact, these and other political assessments among the decision makers in Washington and on Wall Street were proven wrong leading to a strategic retreat of the empire in both Latin America and Asia. The policy failures were not merely ‘mistakes’ but the inevitable results of changing structural conditions embedded in a declining empire. \\nThese decisions were based on a calculus of power, rooted in class and national relations that may have held true two decades ago. At the dawn of the new millennium the US still dominated Asia and China was not yet an economic alternative for its neighbors eager for investment. Washington could and did dictate policy in Southeast Asia. \\nTwenty years ago, the US had the economic leverage to sustain the neoliberal policies of the Washington Consensus throughout Latin America. \\nToday the US continues to pursue policies based on anachronistic power relations, seeming to ignore the fact that China is now a world power and a viable economic trade and investment alternative successfully competing for markets and influence in Asia. Washington is failing to compete in that marketplace and, therefore, can no longer rely on docile client state. \\nWashington cannot effectively control and direct large-scale capital flows to shore-up its newly installed rightist regimes in Argentina and Brazil as they crumble under their own corruption and incompetence. Meanwhile the world is watching a domestic US economy, mired in stagnation with its own political elites torn by corruption and scandals at the highest level, and staging the most bizarre presidential campaign in its history. Corruption has become the mode of governing under conditions of deregulation and rule by political warlords. Political allegiance to the empire and open doors to foreign pillage do not attract capital when those making political decisions are facing prison and the business ‘doormen’ are busy stuffing their suitcases with cash and making a mad-dash for the airports! \\nFor Wall Street and the Pentagon, Latin America and Asia are lost opportunities – betrayals to be mourned at the officers clubs and exclusive Manhattan restaurants. For the people in mass social movements these are emerging opportunities for struggle and change. \\nThe strenuous US effort to rebuild its empire in Latin America and Southeast Asia has suffered a rapid succession of blows. Washington can still seize power but it lacks the talent and the favorable conditions to hold it. \\nThe vision of a Brazilian state, build on the edifice of the privatized oil giant, Petrobras, and the political incarceration of its left adversaries, with foreign capital attracted and seduced by political procurers, pimps and prostitutes, has ended in a debacle. \\nIn this vacuum, it will be up to the new governments and peoples’ movements to seize the opportunity to advance their struggles and explore political and economic alternatives. The aborted rightist power grab inadvertently has done the peoples’ movements a great favor by exposing and ousting the corrupt and compromised center-left regimes opening the door for a genuine anti-imperialist transformation. ORDER IT NOW'"}, "time": 1742561911.0420253}