{"duration": 0.04719805717468262, "input_args": {"text": "'Horror author Stephen King took to his Twitter account Saturday to pen a   story that mocked President Donald Trump’s claim that former President Obama wiretapped his office in Trump Tower before the 2016 presidential election. [“Not only did Obama tap Trump’s phones, he stole the strawberry ice cream out of the mess locker,” King wrote in the first of three Tweets Saturday.  Not only did Obama tap Trump’s phones, he stole the strawberry ice cream out of the mess locker.  —   Stephen King (@StephenKing) March 4, 2017,  Obama tapped Trump’s phones IN PERSON! Went in wearing a Con Ed coverall. Michelle stood guard while O spliced the lines. SAD!  —   Stephen King (@StephenKing) March 4, 2017,  Trump should know OBAMA NEVER LEFT THE WHITE HOUSE! He’s in the closet! HE HAS SCISSORS!  —   Stephen King (@StephenKing) March 4, 2017,  On Saturday, the president claimed that Obama had   the phone in his office in Trump Tower before the election, comparing the alleged incident to Richard Nixon’s conduct during the Watergate scandal. Is it legal for a sitting President to be ”wire tapping” a race for president prior to an election? Turned down by court earlier. A NEW LOW!  —   Donald J. Trump (@realDonaldTrump) March 4, 2017,  I’d bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!  —   Donald J. Trump (@realDonaldTrump) March 4, 2017,  How low has President Obama gone to tapp my phones during the very sacred election process. This is  . Bad (or sick) guy!  —   Donald J. Trump (@realDonaldTrump) March 4, 2017,  A representative for Obama has strongly denied the claim. The    author  —   awarded the National Medal of Arts by Obama in 2015  —   has been a frequent and outspoken critic of Trump since well before the election. In December, King tweeted that he would no longer tweet about Trump. “That anyone in America would even CONSIDER voting for this rabid coyote leaves me speechless,” he wrote then. In May, the Carrie author joined hundreds of other prominent authors in signing an open letter “unequivocally” condemning Trump’s candidacy. The following month, King told Rolling Stone that he was “disappointed in the country” after Trump claimed the Republican nomination. “I think that he’s sort of the last stand of a sort of American male who feels like women have gotten out of their place and they’re letting in all these people that have the wrong skin colors. He speaks to those people,” he told the magazine. “Trump is extremely popular because people would like to have a world where you just didn’t question that the white American was at the top of the pecking order,” he added.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562044.5230386}