{"duration": 0.06005120277404785, "input_args": {"text": "'BuzzFeed’s Mitch Prothero traveled all the way to Hungary to dig up dirt on White House foreign policy advisor Dr. Sebastian Gorka  —   and discovered that he is neither a Nazi or an antisemite, but merely a   conservative. [Prothero did his best to smear Gorka. He describes the former Breitbart News editor (inaccurately) as having “failed his way upwards” (a description that could apply equally to the career paths of many of BuzzFeed’s own crack reporters).  But in the search for evidence of Gorka’s ties to the   Prothero came up short, despite contacting Gorka’s former employers in Hungary and members of the Hungarian counterintelligence service. Gorka’s Hungarian critics are not shy to attack him, either: some describe him rather viciously. Even so, they say that Gorka is not a Nazi or an antisemite. “Sebastian Gorka is not a Nazi or a security threat because he is some sort of secret British agent,” said a member of the Hungarian counter intelligence service, who has reviewed the files a security background check on Gorka from 2002. “Gorka is, how do you say in English  —   a peddler of snake oil. ”   …     Gorka’s rejection for a [Hungarian] security clearance to serve on the committee was a devastating blow to his reputation in Hungary. He had come to be seen as a   the intelligence official said, while the minor ties to the British government that had been established were enough to alienate him from much of the Hungarian nationalist right.   …     This chimes with the views of some of those who knew him in Hungary, who remember Gorka as   and keenly   but whose views set him outside the  .   …     “Within the context of historical Hungarian fascism, Gorka never appeared to be particularly interested in these [extreme,  ] movements, having always been a supporter of the   Atlantic alliances and an advocate for Hungarian integration into the West,” he said. “So I don’t think it’s fair to characterize him as a Nazi, when he’s more of a  . ”   …     “The charges that Gorka supports   movements”  —   such as Jobbik, which has been roundly criticized by human rights groups across Europe  —   “doesn’t seem consistent with his attitude or background when he was here in Hungary,” said Horvath, citing Gorka’s loud   stance. “While all   seem to be Nazis, not everyone in the Hungarian right is a racist because there’s a lot of diversity in thought. ” When asked about the controversy over Gorka’s use of his father’s Order of Vitéz medals and title, Molnar first dismissed the complaint, arguing that the Order was fairly common in Hungarian political circles, and is associated with nationalism rather than ideology. Porter also confirms what was first reported here at Breitbart News  —   that the medal Gorka wore at the inauguration, which was awarded to his father for his anticommunist activism by an organization called the Vitezi Rend, had nothing to do with the historical Vitezi Rend that had ties to the   Hungarian regime in the Second World War. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak '"}, "time": 1742563697.253966}