{"duration": 0.2313976287841797, "input_args": {"text": "'Madman Merkel Demands the Internet Publicly Release All Closed-Source Code \\nAndrew Anglin Daily Stormer October 27, 2016 This woman is looking haggard af. Botta start calling her Merkel Haggard. New song for refugees refusing deportation: “I think I’ll just stay here and drink, riot, rape, sell drugs and commit acts of terrorism (allah akbar remix)” \\nThere comes a time in the life of every brutal totalitarian psychopath that they just have to lash out against everyone and everything, demand it all be shut down. \\nRT : \\nGerman Chancellor Angela Merkel launched a broadside at internet media giants, accusing them of â\\x80\\x9cnarrowing perspective,â\\x80\\x9d and demanding they disclose their privately-developed algorithms. Merkel previously blamed social media for anti-immigrant sentiment and the rise of the far right. \\nâ\\x80\\x9cThe algorithms must be made public, so that one can inform oneself as an interested citizen on questions like: what influences my behavior on the internet and that of others?” said Merkel during a media conference in Berlin on Tuesday. \\nâ\\x80\\x9cThese algorithms, when they are not transparent, can lead to a distortion of our perception, they narrow our breadth of information.â\\x80\\x9d \\nGoogle uses an algorithm to decide which search results are first shown to a user, while Facebook arranges the order of the news feed, and decides to include certain posts from a userâ\\x80\\x99s liked pages and friends, at the expense of others. Both sites also promote links to news articles, often based on a userâ\\x80\\x99s own media interests. \\nI don’t know about Facebook, but Google’s algorithm is worth billions and billions of dollars. The algorithm is why people use Google instead of Bing. If they released the algorithm, it would effectively make their main product – their search engine – valueless, beyond the value of its brand name. \\nThat’s why it’s not open-source in the first place. Because if they released it, everyone would use it, and their service would no longer have any unique value. \\nAsking them to release this “because I said” is completely and totally insane – the demand of a madman who thinks the universe belongs to him. \\nThese algorithms are at the core of the intellectual property of any social media or search website, and comprise some of the most highly-protected trade secrets in the world, potentially worth billions. No internet giant has ever revealed its inner workings. \\nMerkel did not specifically name Facebook, Google or Twitter, but implied that the large platforms are creating â\\x80\\x9cbubblesâ\\x80\\x9d of self-reinforcing views, and squeezing out smaller news providers. \\n“The big internet platforms, via their algorithms, have become an eye of a needle which diverse media must pass through to reach users,â\\x80\\x9d warned Merkel. â\\x80\\x9cThis is a development that we need to pay careful attention to.â\\x80\\x9d \\nThe internet giants themselves have argued that the so-called social media bubble is largely a myth, and that online users have a wider access to differing views than under a pre-internet model, where most news would be acquired from just a handful of newspapers and one or two TV channels. \\nThis is obviously absolutely true, and it’s absolutely why Merkel is throwing a fit. \\nShe wants media to be limited to approved sources. \\nThese approved sources still have an extreme amount of control, as we see with the Trump situation, but in order to maintain her multicultural utopia, Angela Merkel needs complete 1984-style control of all information the public has access to. “We’ve always been at war with Russia to protect ISIS, Winston.” \\nAnd that’s control over international (read: American and Russian) media, because in Germany, they can just go arrest anyone who is saying things they don’t like on the internet. They arrest people for Facebook posts. \\nThis is not the first attack on social media by Merkel and her Grand Coalition government, and while the German politician advocates diversity of views, she has previously accused it of perpetrating opinions that are most at odds with those of the establishment and traditional media. \\nLast month, Merkel accused AfD, the recently-established anti-immigrant and anti-Muslim party, which receives overwhelmingly negative coverage in most newspapers, of â\\x80\\x9cspreading their liesâ\\x80\\x9d through social media , as it achieves breakthroughs in regional elections around the country. \\nA year ago, at the height of the refugee influx into the country, Merkel, who was first elected in 2005, was caught on a hot mic personally pressing Facebook CEO Mark Zuckerberg to clamp down on anti-migrant posts during a UN session in New York. \\nA fortnight ago, the leader of Merkelâ\\x80\\x99s parliamentary CDU faction, Volker Kauder, said that social media should be fined â\\x82Ź50,000 for failing to remove â\\x80\\x9chate speech,â\\x80\\x9d saying that a â\\x80\\x9cSword of Damoclesâ\\x80\\x9d has to hang over social media. Kauder also called for warnings, similar to those on cigarette packs or before entering pornographic websites, to be given to those about to go on social media. \\nJustice Minister Heiko Maas â\\x80\\x93 who said that there had been a 77 percent increase in hate crimes following the arrival of 900,000 asylum seekers â\\x80\\x93 has given internet media companies until February next year to comply with EU directives on xenophobia and racism, or face legal action. \\nThis looks to me like the first huff of the last gasp. \\nMama Merkel tried. \\nBut Merkel Haggard has lost control. \\nNow, she’s about to see the fightin’ side of Germany.'"}, "time": 1742563172.745877}