{"duration": 0.06664705276489258, "input_args": {"text": "'Sunday on ABC’s “This Week,” while discussing President Donald Trump executive order halting immigration from seven   countries to the United States, Senate Majority Leader Mitch McConnell ( ) said, “the extent they’re trying to improve the vetting process, I think that’s in order. ”  “We need to bear in mind that we don’t have religious tests in this country and we also need to remember that some of our best allies in the war against Islamic terrorism are Muslims,” he added. Partial transcript as follows: RADDATZ: Do you support president Trump’s temporary immigration ban from these predominantly Muslim countries. SEN. MITCH MCCONNELL ( ) MAJORITY LEADER: Well, I think it’s a good idea to tighten the vetting process. But I also think it’s important to remember that some of our best sources in the war against radical Islamic terrorism are Muslims, both in this country and overseas. And we have had some difficulty in the past getting interpreters as you suggested in the earlier segment who are helpful to us treated properly. So we need to be careful as we do this. Improving vetting, something  …     RADDATZ: And yet right now they’re being detained so  —   do you support this or not support this. MCCONNELL: It’s hopefully going to be decided in the courts as to whether or not this has gone too far. I don’t want to criticize them for improving vetting. I think we need to be careful. We don’t have religious tests in this country. RADDATZ: In the past, you’ve called the Muslim ban completely and totally inconsistent with American values. The president says this is not an outright Muslim ban, even if this is temporary, how is this order consistent with American values? MCCONNELL: Well, if they’re looking to tighten the vetting process, I mean who would be against that? But I am opposed to a religious tests. The courts are going to determine whether this is too broad. RADDATZ: So it sounds to me like you are opposed to certain parts of this. If we’re detaining or holding back people who have helped Americans in the fight. MCCONNELL: Well, obviously I’m against that. RADDATZ: A religious test then you’re opposed to certain parts of this. MCCONNELL: Look, the president has a lot of latitude to try to secure the country. And I’m not going to make a blanket criticism of this effort. However, I think it’s important to remember, as I said, a lot of Muslims are our best sources in the war against terror. RADDATZ: So, do you think this will have blowback in the world? I mean, are you sensing that already? You’ve seen the reactions. MCCONNELL: Yeah, well, we’ll see. And it’s important, however, to emphasize it’s important to keep America as secure as possible and we’ll see how it plays out. RADDATZ: Just tell me again how you would summarize what happened with this executive order. MCCONNELL: How I would summarize. RADDATZ: Yes, how would you  —   what would you say about it? Others are saying it’s devastating, others are saying it’s  . MCCONNELL: Well, I’m not saying either of those things, I’m saying what I just said a few minutes ago, which is to the extent they’re trying to improve the vetting process, I think that’s in order. We need to bear in mind that we don’t have religious tests in this country and we also need to remember that some of our best allies in the war against Islamic terrorism are Muslims. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562259.634916}