{"duration": 0.08976411819458008, "input_args": {"text": "'Scholar Phyllis Chesler was disinvited from a speaking event on honor killings at the University of Arkansas due to articles she has published on Breitbart News. [Chesler was slated to appear as a part of a conference at the University of Arkansas Law School’s King Fahd Center for Middle East Studies on honor killings, but was ultimately disinvited after concerns arose over Chesler’s alleged “Islamophobia. ”  Three professors that work at the King Fahd Center for Middle East Studies wrote a letter denouncing Chesler. In the letter, which was addressed to King Fahd Center Director Thomas Paradise, Professors Joel Gordon, Ted Swedenburg, and Mohja Kahf called Chesler a “bigot” and a “prominent Islamophobe” for her commentary on Islam. They expressed concerns that Chesler had her writings published by Breitbart News. Dear Tom: It has come to our attention that MEST is   Phyllis Chesler to lecture via Skype at the University of Arkansas Law School’s symposium about honor killings on 14 April 2017. Chesler’s writings frequently feature on the   Breitbart forum as well as many other   platforms. They continued, claiming that Chesler’s perspective on Islam would violate the school’s mission to educate students on the Middle East. “Our work is to educate students on the Middle East, not to promote bigotry,” they wrote. “While we welcome respectful debate and diverse opinions, we believe that bigotry should not be promoted on this campus. ” Chesler was ultimately disinvited in response to the criticisms. You can read the letter in its entirety below: Dear Tom: It has come to our attention that MEST is   Phyllis Chesler to lecture via Skype at the University of Arkansas Law School’s symposium about honor killings on 14 April 2017. Chesler’s writings frequently feature on the   Breitbart forum as well as many other   platforms. One disturbing example is the pamphlet, The Violent Oppression of Women in Islam, that Chesler   in 2007 with Robert Spencer, director of Jihad Watch, who is is considered by the Southern Poverty Law Center to be “one of America’s most prolific and vociferous   propagandists. ” The pamphlet was published by David Horowitz’ Freedom Center, which frequently targets students and scholars for speaking out about justice for Palestinians. The pamphlet is a catalogue of horrors inflicted on women that are said to be the outcome of Islam’s essential nature. “Islamic gender apartheid,” Chesler and Spencer write, “is not caused by western imperialism, colonialism, or racism. It is indigenous to Islam both theologically and historically. ” Retaliation is obligatory against anyone who kills a human being purely intentionally and without right, [except when] a father or mother (or their fathers or mothers) for killing their offspring, or offspring’s offspring” (section o1. ). Chesler has also said, “It’s easy to say, yes, the Muslims are against everyone who is not a Muslim. [  …    ] The West, and that means Jews and Israelis, would like to lead sweet and peaceful lives. We’re up against an enemy now that is dying to kill us, that lives to kill, and that at best merely wishes to impose on the rest of us its laws and strictures. ” (Fern Sidman, “Israel Today  Always: Breaking Ranks  —   An Interview With Phyllis Chesler,” The Jewish Press, August 15, 2007) Our work is to educate students on the Middle East, not to promote bigotry. The Executive Travel Order of February 2017 (which we all know is a xenophobic, Islamophobic, travesty of justice) specifically mentions   as a means of differentiating Muslims and in so doing, it capitalizes on fear of Muslims, Honor killings are part of rape culture. Any manifestation of rape culture in any society, including the U. S. is reprehensible. Condemning rape culture and honor killings must not be tainted with bigotry and Islamophobia. While we welcome respectful debate and diverse opinions, we believe that bigotry should not be promoted on this campus. Our program in particular has the responsibility not to be the sponsor of an event featuring a prominent Islamophobe. Sponsoring an event with Chesler on the program sends the opposite message to our students. Sponsoring such a speaker also contributes to an unsafe environment for students on our campus already at risk for   violence. We have asked that MEST provide, via Skype, a qualified speaker to follow Chesler’s remarks. This was deemed not feasible. We ask that MEST publicly withdraw its sponsorship from this symposium. We ask that MEST provide copies of the Islamophobia Is Racism syllabus, created by a collective of academics inspired by the Ferguson syllabus, for distribution at the symposium. We ask that MEST release a statement condemning Islamophobia and bigotry, and affirming its commitment to gender justice and diversity, and that this statement be read at the symposium. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742563337.1159678}