{"duration": 0.11849617958068848, "input_args": {"text": "\"6 329 2 5 Les volontaires qui aident les réfugiés en Europe, sont-ils vraiment des complices de terroristes? Depuis le début de la crise migratoire, les Européens se posent de nouvelles questions en matière de sécurité. Ces craintes sont parfois poussées jusqu’à l’absurde. Une bénévole hongroise risque même une peine de prison. \\nL'arrivée massive des migrants a divisé les Européens dont certains craignent, et non sans raison, la montée du terrorisme. Mais ces craintes sont parfois poussées jusqu'à l'absurde. Une volontaire de Budapest, Adele Nagy, 38 ans, risque d'être condamnée à 20 ans de prison pour avoir aidé les réfugiés. « J'ai collecté des vêtements, des produits alimentaires, des médicaments et des produits d'hygiène pour femmes. Mes amis m'ont trahie, ils croyaient que j'aidais les terroristes et m'ont dénoncé aux autorités. En Hongrie, je risque d'écoper de vingt ans de prison. Je suis donc partie pour les Emirats arabes unis », a indiqué Adele Nagy cité par la chaîne de télévision RT. © AP Photo/ Muhammed Muheisen Les réfugiés afghans «déçus» par la vie en Europe Selon Adele Nagy, le gouvernement hongrois considère les réfugiés comme des terroristes potentiels et les médias en persuadent les habitants locaux. Plusieurs Hongrois ont déjàété condamnés à des amendes et même à des peines de prison pour leur bontéà l'égard des migrants. « La plupart des Hongrois détestent les musulmans uniquement en raison des fausses informations qu'on diffuse. Mais je crois que nous devons aider les réfugiés parce qu'ils se trouvent dans une situation difficile, leur pays natal est en proie à une guerre », a ajouté Mme Nagy. \\nLes Européens qui sympathisent avec les migrants reconnaissent qu'il peut y avoir des criminels parmi les réfugiés, mais ils sont plutôt confiants, d'après la mère d'une étudiante de Berlin, Jana Olernikova. « Ma fille (…) donne des cours d'allemand aux enfants des réfugiés syriens et afghans à Vienne et à Bratislava. Elle a beaucoup d'amis parmi les migrants (…). Je ne dirais pas que je crains de me promener dans les rues depuis le début de la crise. Il peut sans doute y avoir des criminels parmi les migrants, mais il y en a aussi parmi les Européens. Je suis contente que je puisse voir la vie arabe, j'aime la diversité culturelle en Europe », a indiqué Jana Olernikova. © AFP 2016 PHILIPPE HUGUEN Calais: «Les réfugiés ont le droit d’avoir une vie heureuse» Selon Miriam Dusterhoft, bénévole au camp de réfugiés de l'association humanitaire ASB en Allemagne, l'arrivée des migrants est une nouvelle occasion pour les Européens de faire preuve de souplesse. « Je porte une jupe longue ou un pantalon. Je couvre mes bras. Mais c'est une décision personnelle, j'ai beaucoup de tatouages et je ne veux pas gêner les gens qui n'y sont pas habitués. Je ne crois pas que mes droits soient lésés, je porte ce que je veux en ville », a précisé la volontaire. \\nSelon l'agence Frontex, plus de 1,8 million de migrants sont arrivés en Europe en 2015. Ce flux de réfugiés a compliqué la vie des habitants locaux. Les problèmes causés par la présence d'un grand nombre de migrants font réagir les autorités. En France, le démantèlement du camp des réfugiés de Lande, aussi baptisé la Jungle, a commencé le 24 octobre. Les migrants seront relogés dans des centres d'accueil en France ou transférés vers d'autres pays européens. \\nSuivez Sputnik sur Telegram pour ne jamais manquer les actualités les plus importantes grâce à nos sélections du matin et du soir. Pour recevoir les actualités de notre chaîne, il suffit de télécharger l'application Telegram sur n'importe quel smartphone, tablette ou ordinateur puis cliquer sur le lien et appuyer sur « Join » ...\""}, "time": 1742562333.115822}