{"duration": 0.015926122665405273, "input_args": {"text": "'in: Human Rights , War Propaganda , World News (image: REUTERS/Khaled Abdullah) US naked aggression on Yemen gets scant scoundrel media coverage. It includes undeclared drone war begun post-9/11, Obama continuing what George Bush began, civilians harmed most of all. In March 2015, Saudi Arabia and other regional rogue states, backed by America and its NATO partners, began terror-bombing Houthi forces, falsely called terrorists. Casualties are multiples higher than officially reported, civilians ruthlessly slaughtered – war in Yemen another bonanza for US, UK, French and German weapons makers, along with war-profiteers from other countries. Earlier in October, Saudi warplanes terror-bombed a Sanaa Houthi funeral ceremony, killing and wounding hundreds of civilians – the single deadliest incident in over 18 months of fighting so far. Washington bears full responsibility. Riyadh shares it. Conflict continues raging, the Pentagon selecting targets for Saudi warplanes to terror-bomb. Over the weekend, a Saudi-led “coalition” airstrike targeted a prison and nearby administration buildings in Houthi-controlled Hodeidah, destroying facilities struck, massacring dozens, wounding many more victims, separately hitting Hodeidah’s port. Saudi military spokesman General Ahmed Asiri lied, claiming facilities struck were used as “a command and control center for (Houthi) operations.” Hours before the Hodeidah terror-bombing, Saudi warplanes massacred at least 18 civilians in Taiz, including 11 members of one family. Throughout months of fighting, Saudi warplanes terror-bombed schools, hospitals, residential areas, commercial marketplaces and other nonmilitary targets. Conflict resolution efforts failed because Washington, Riyadh and their rogue partners want war, not peace – holding an entire nation hostage to their viciousness, a severe humanitarian crisis taking unknown numbers of lives. Separately, on October 28, Saudi Arabia was overwhelmingly reelected to the UN Human Rights Council (HRC), a body infested with major human rights abusers. Heavy US pressure got General Assembly members to vote Russia off the HRC. Genocidal war on Yemen continues, the body failing to condemn the slaughter. It doesn’t promote human rights. It supports horrendous abuses committed by Washington and its imperial allies. Submit your review'"}, "time": 1742628555.7422533}