{"duration": 0.1662144660949707, "input_args": {"text": "'Lisa Tanner October 27, 2016 Leaky Cellar 101: What You Need To Know \\nCellars can be an ideal location for storing your emergency supplies, and especially your food. Located underground, cellars take advantage of insulation from the Earth. This helps prevent your supplies from freezing in the winter. \\nYour survival cellar is also out of sight for your household visitors, so you won’t be advertising your stores for everyone. Whether you’re building a cellar , or using a crawlspace or cellar that’s already under your house, they’re very useful. \\nBut, cellars can have a humidity problem. Because leaks can spring up, it’s easy to get too much moisture inside. That’s what we need to solve. \\nProblems with a Leaky Cellar \\nToo much water in your cellar can cause a variety of problems. The humidity can easily cause your food and paper goods to develop mold. It’ll make your cans rust. Both issues will severely impact the shelf life of your stores. \\nIf your cellar is under your house, water damage can eventually lead to structural issues. This can lead to your house’s integrity being compromised. The wood your house is built from isn’t meant to be continually wet. \\nAdditionally, unpleasant odors are common in damp cellars. If your cellar lacks ventilation, these odors will become more noticeable and can lead to allergic reactions and health problems. \\nSigns of a Water Leakage \\nSince signs of water damage can be subtle, you may not realize at first that there’s a problem in your cellar. You probably won’t find standing water across the floor. Instead, you’ll notice signs like these: A musty odor A white, chalk-like powder on the walls Cracks in the walls or floor Condensation on windows Water stains on the walls or floor \\nOnce you discover signs of moisture, it’s important to investigate further. If you are unsure if the water is seeping into your cellar from the outside, or condensing from the inside, you can perform a simple test. \\nTake a piece of aluminum foil and cut it to a 2-foot by 2-foot square. Using duct tape around the edges, tape the foil to your wall. \\nThe next day, examine the foil. Is there water on the side facing out? If so, it’s a sign that your water is coming from inside. \\nIf not, take down the foil and feel the side that was facing out. Water on this side indicates you have a seepage problem. \\nWhere Is the Water Coming From? \\nCellar leaks from internal and external sources can come from a variety of places. It’s important to give the entire space an inspection. Here are some common causes of a leaky cellar: Ground Water \\nIf you’ve had an unusually amount of precipitation, your cellar could be the collection point for the excess groundwater. Ground water can also be a problem during spring runoff times. \\nThe water will have to find its way into your cellar, so be on the lookout for cracks in the walls or on the floor. Leaking Water Pipes \\nCheck your water pipes for leaks. This can include outdoor spigots. One year ours sprung a leak underground and the only reason we knew was because of the water leaking into our basement. Sprinklers \\nAre you watering too close to your cellar? A misaimed sprinkler can send unwanted water into your cellar. Gutters \\nIf you have gutters meant to bring the water away from your home, check and make sure they’re working properly. A clogged gutter can lead to water in the cellar. \\nA lack of gutters can cause a similar problem. It’s important to have a way for the excess water to be channeled away from your cellar. Trees or Bushes Too Close \\nIs there vegetation growing right next to your cellar? If so, the root systems can allow water to work its way inside. Drainage Conditions Around the Cellar \\nWhat’s the ground like around your cellar? Does the soil absorb water, or let it run freely? Is the grade of the land forcing water away from the area? \\nTaking a few minutes to inspect your cellar and the land around it can help you pinpoint the source of your leak. \\n8 Steps to Prevent a Leaky Cellar \\nThere are a few simple ways to prevent leaks in your cellar. If you don’t yet have a moisture issue, these steps will help reduce the risk. \\n1. Gutter Maintenance \\nMake sure to take time to clean out your gutters regularly and ensure they haven’t fallen. While you’re working with your gutters, it’s a great time to evaluate your rainwater collection system . \\n2. Fix the Grade \\nCheck the level of the soil around your cellar. You want it to be at its highest around the perimeter. That way water runs away from your cellar instead of down into it. \\nIf you need to, you can add additional soil around your cellar. Then, use a rake and shovel to slope it away from your structure. \\nFor a more permanent solution, you can make a retaining wall and then regrade around it. Video first seen on This Old House . \\n3. Remove Overgrown Greenery \\nThe roots of trees can reach a long way. If you have any planted too close to your cellar, their roots can cause problems. Bushes, shrubs, and other plants that send down massive root structures can cause similar problems. \\nBe sure to remove any greenery that threatens your cellar space. You don’t want roots to allow water inside. \\n4. Patch Cracks \\nUse caulking to fill any small cracks you see in your cellar walls. Even if they aren’t yet letting in moisture, they’re a weak spot that could start leaking in the future. \\nLarger cracks will need a little more attention. They may require the insertion of a rubber membrane, additional reinforcement with cement, or a special epoxy. Your exact repair will depend on the location, the material of the wall, and the size of the crack. You might need to bring in an expert to evaluate. \\nIf your cellar has a cement floor, you can use epoxy to seal small cracks in it. Larger floor cracks may need a cement patch. You can mix up a small amount in a wheelbarrow and use a trowel to pack in the crack and smooth over the top. \\n5. Insulate Your Pipes \\nDo you have water pipes running through your cellar? If you do, make sure they’re insulated to avoid condensation. \\nIf your pipes are leaking and you don’t have the material on hand to fix them the proper way, you can make a makeshift patch out of a plastic bottle . \\n6. Apply Waterproof Sealant \\nYou can purchase special sealant at home improvement stores designed to keep the water away. Many varieties go on just like paint, though you’ll need a sturdy brush to apply it to cement. A coat of this will help keep your cellar dry. Video first seen on Today’s Homeowner . \\n7. Put Plastic Down \\nIs your unfinished cellar’s floor made of dirt or gravel? Moisture can easily seep up through these materials. Consider lining your floor with thick plastic vapor barrier. \\n8. Insulate \\nInsulation will help produce interior condensation. If your walls aren’t insulated, the temperature change between inside and out can cause water droplets to form. \\nBe sure your insulation is designed for foundation walls. Foil-backed or foam based insulation materials are common in cellars. \\nDepending on building regulations in your area, you may need to cover the insulation with a fire barrier. Thin drywall is acceptable in many areas. \\nRemoving Moisture from a Wet Cellar \\nIf excess moisture has already reached your cellar, the above steps can help prevent future problems. By keeping future water from getting in, you’ll help improve the conditions in your cellar. However, you will also have to address the moisture problem. To get rid of excess moisture you can: Air Out the Space \\nOpen the windows and use a fan to help circulate the air. A dehumidifier will also help suck the moisture out. Remove Mold or Mildew Damaged Items \\nIf your cellar has mold or mildew, you need to get rid of the items effected if they can’t be properly cleaned. This will help remove the odor and built up moisture from your space as well. Install a French Drain and a Sump Pump \\nIf your cellar continues to have water problems even after taking corrective measures, it might be time to install a French drain and a sump pump. This interior drainage system will help channel the water where you want it to go. \\nThis involves digging a trench as close to the wall as possible around the inside perimeter of your cellar. You’ll then put down connected pipe that slopes to your water collection pit. Inside this pit is a sump pump. \\nThe sump pump will then pump the water out of your cellar and out to a spot away from your foundation. When the pipes are all connected, you’ll cover it with gravel and then pour more concrete on top. You’ll leave the sump pump accessible, with an air-tight lid, in case it needs repair in the future. \\nThis is a more involved DIY project, but it’s possible to do without calling in a professional. Video first seen on gregkieslich . \\nHave you ever dealt with a leaky cellar? What other tips can you share for preventing the problem or taking care of moisture in your cellar? Were you successful in drying it out, or are you still dealing with moisture? \\nClick the banner below to find out how our ancestors use to deal with the challenge of storing the food safely for long term survival! \\n  Lisa Tanner for Survivopedia. 8 total views, 8 views today'"}, "time": 1742563925.1088767}