{"duration": 0.14324307441711426, "input_args": {"text": "'How the Oligarchy Has Prepared the Groundwork for Stealing the Election \\nIn addition to the cyber manipulation of electronic voting (see http://www.paulcraigroberts.org/2016/11/01/very-easy-to-invisibly-steal-us-elections/ ), Finian Cunningham explains a second method the Oligarchy has prepared that would allow the election to be stolen for Hillary. The groundwork that has been officially established indicates that a false flag cyber attack is the preferred method.\\nA Digital 9/11 If Trump Wins by Finian Cunningham \\nThere are disturbing signs that a digital 9/11 false flag terror attack is being readied for election day in the US to ensure that Donald Trump does not win. \\nSuch an attack – involving widespread internet and power outage – would have nothing to do with Russia or any other foreign state. It would be furnished by agencies of the US Deep State in a classic “false flag” covert manner. But the resulting chaos and “assault on American democracy” will be conveniently blamed on Russia. \\nThat presents a double benefit. Russia would be further demonized as a foreign aggressor “justifying” even harsher counter measures by America and its European allies against Moscow. \\nSecondly, a digital attack on America’s presidential election day this week, would allow the Washington establishment to pronounce a Trump win invalid due to “Russian cyber subversion”. Invalidation is a prepared option if the ballot results show Republican candidate Donald Trump as the imminent victor. \\nDemocrat rival Hillary Clinton is the clear choice for the White House among the Washington establishment. She has the backing of Wall Street finance capital, the corporate media, the military-industrial complex and the Deep State agencies of the Pentagon and CIA. The fix has been in for months to get her elected by the powers-that-be owing to her well-groomed obedience to American imperialist interests. \\nThe billionaire property magnate Trump is too much of a maverick to be entrusted with the White House, as far as the American ruling elite are concerned. \\nThe trouble is that, despite the massive campaign to discredit Trump, polls show his support remains stubbornly close to Clinton’s. The latter has been tainted with too many scandals involving allegations of sleazy dealings with Wall Street, so-called pay-for-play favors while she was former Secretary of State, and her penchant for inciting overseas wars for regime change using jihadist terrorist foot-soldiers. \\nAs one headline from McClatchy News only days ago put it: “Majority of voters think Clinton acted illegally, new poll finds”. http://www.mcclatchydc.com/news/politics-government/election/article112635048.html#emlnl=Evening_Newsletter \\nTrump is right. The US presidential election is rigged. The system is heavily stacked against any candidate who does not conform with the interests of the establishment. The massive media-orchestrated campaign against Trump is testimony to that. \\nBut such is popular disgust with Clinton, her sleaze-ball husband Bill and the Washington establishment that her victory is far from certain. Indeed in the last week before voting this Tuesday various polls are showing a neck-and-neck race with even some indicators putting the Republican narrowly ahead. \\nOver the weekend, the Washington Post, which has been one of the main media outlets panning Trump on a daily basis, reported this: “The electoral map is definitely moving in Trump’s direction”. https://www.washingtonpost.com/news/the-fix/wp/2016/11/04/dont-look-now-the-electoral-map-is-definitely-moving-in-donald-trumps-direction/?wpisrc=nl_headlines&wpmm=1 \\nIn recent days, American media are reporting a virtual state of emergency by the US government and its security agencies to thwart what they claim are Russian efforts to incite “election day cyber mayhem.” \\nIn one “exclusive” report by the NBC network on November 3, it was claimed that: “The US government believes hackers from Russia or elsewhere may try to undermine next week’s presidential election and is mounting an unprecedented effort to counter their cyber meddling.” http://www.nbcnews.com/news/us-news/white-house-readies-fight-election-day-cyber-mayhem-n677636?cid=sm_tw \\nOn November 4, the Washington Post reported: “Intelligence officials warn of Russian mischief in election and beyond.” https://www.washingtonpost.com/world/national-security/russia-seen-as-unable-to-alter-election-but-may-still-seek-to-undermine-it/2016/11/03/b7387160-a1cd-11e6-8832-23a007c77bb4_story.html \\nApparently, the emergency security response is being coordinated by the White House, the Department of Homeland Security, the CIA, the National Security Agency and other elements of the Defense Department, according to NBC. \\nThese claims of Russian state hackers interfering in the US political system are not new. Last month, the Obama administration officially accused Moscow of this alleged malfeasance. https://www.theguardian.com/technology/2016/oct/07/us-russia-dnc-hack-interfering-presidential-election \\nRussian President Vladimir Putin has lambasted American claims that his country is seeking to disrupt the presidential elections as “hysterical nonsense”, aimed at distracting the electorate from far more deep-rooted internal problems. http://abcnews.go.com/International/wireStory/putin-rejects-claims-russian-interference-us-election-43103312 \\nThe Obama administration and its state security agencies have not provided one iota of evidence to support their allegations against Russia. Nevertheless the repeated charges have a tendency to stick. \\nThe Clinton campaign has for months been accusing Trump of being a “pro-Russian stooge”. Clinton’s campaign has also claimed that Russian hackers have colluded with the whistleblower organization Wikileaks to release thousands of private emails damaging Clinton with the intention of swaying the election in favor of Trump. \\nWikileaks’ director Julian Assange and the Russian government have both rejected any suggestion that they are somehow collaborating, or that they are working to get Trump elected. \\nBut on the eve of the election, the US authorities are recklessly pushing hysteria that Russia is trying to subvert American democracy. \\nMichael McFaul, the former US ambassador to Russia from 2012 to 2014 is quoted as saying: “The Russians are in an offensive mode and the US is working on strategies to respond to that, and at the highest levels.” \\nNBC cites a senior Obama administration official as saying that the Russians “want to sow as much confusion as possible and undermine our process”. \\nOminously, the news outlet adds that “steps are being taken to prepare for worst-case scenarios, including a cyber-attack that shuts down part of the power grid or the internet.” \\nNearly two weeks ago, on October 21-22, the US was hit with a widespread internet outage. The actors behind the “distributed denial of service” were not identified, but the disruption was nationwide and it temporarily disabled many popular consumer services. One former official at the US Department of Homeland Security described the event as having “all the signs of what would be considered a drill”. http://www.nbcnews.com/news/us-news/white-house-readies-fight-election-day-cyber-mayhem-n677636?cid=sm_tw \\nCould that cyber-attack have been the work of US Deep State agencies as a dress rehearsal for an even bigger outage planned for November 8 – election day? \\nThe Washington establishment wants Clinton over Trump. She’s the marionette of choice for their strategic interests, including a more hostile foreign policy towards Russia in Syria, Ukraine and elsewhere. But Trump might prove to be the voters’ choice. In which case, the shadowy forces that really rule America can trigger a “digital 9/11”. \\nIt’s not difficult to imagine the chaos and mayhem from internet blackout, power, transport, banking and communications paralysis – even for just a temporary period of a few hours. Months of fingering Russia as a destabilizing foreign enemy intent on interfering in US democracy to get “Comrade Trump” into the White House would then serve as a self-fulfilling prophecy. In that event, the US authorities could plausibly move to declare the election of Donald J Trump null and void. \\nIn fact the scenario could be contrived to a far more serious level than merely invalidating the election result. The US authorities could easily feign that a state of emergency is necessary in order to “defend national security”. That contingency catapults beyond “rigged politics”. It is a green light for a coup d’état by the Deep State forces who found that they could not win through the “normal” rigging methods.\\nOriginally published: https://sputniknews.com/columnists/201611061047117877-digital-9-11-if-trump-wins/ \\nThe post How the Oligarchy Has Prepared the Groundwork for Stealing the Election appeared first on PaulCraigRoberts.org .'"}, "time": 1742561651.007007}