{"duration": 0.2215893268585205, "input_args": {"text": "'Rajiv J. Shah, a trustee of the Rockefeller Foundation, was asked about six months ago to join the committee that would select the foundation’s next president. He said no. Instead, Mr. Shah, who until recently had been the administrator of the United States Agency for International Development, ultimately said he wanted to be considered for the post. He got the job. On Thursday, the Rockefeller Foundation, one of the country’s largest and most influential philanthropies, will name Mr. Shah to succeed Judith Rodin, who has been president for 12 years. The appointment will make Mr. Shah one of the most powerful forces in charitable giving, overseeing a foundation that donates roughly $200 million each year and corrals governments, companies and organizations to contribute money and resources in tandem. Mr. Shah, 43, will be the first   to lead the Rockefeller Foundation, which has gained stature in recent years through some prominent projects but has sometimes been criticized as being more interested in its publicity than its grantees. Founded in 1913 by the oil tycoon John D. Rockefeller, the foundation says it has given away the equivalent of more than $17 billion in today’s dollars. Its first grant was to the American Red Cross, and it went on to play pivotal roles in establishing the field of public health, creating vaccines for yellow fever and malaria, and bringing agricultural advances to the developing world. In recent years, the foundation has focused on the themes of “resilience” and “inclusive economies. ” That has resulted in programs aimed at establishing “resilience officers” in 100 cities to focus on disaster relief and a plan that is sending 100, 000   students to see the musical “Hamilton. ” These efforts have struck critics as public relations stunts more than meaningful agents of change. And Ms. Rodin has drawn fire for spending too much time with corporate partners and not enough time with the recipients of grants. Much of the foundation’s work concerns improving health and   in Africa, aiding economic development in impoverished areas and developing strategies to combat climate change. It was these diverse causes that attracted Mr. Shah to the job. With advanced degrees in medicine and health finance from the University of Pennsylvania, Mr. Shah worked at the Bill  Melinda Gates Foundation for nearly a decade, rising to be director for agricultural development. From 2009 to 2015, he ran U. S. A. I. D. leading the response to disasters including the 2010 earthquake in Haiti and the 2014 Ebola outbreak in West Africa. After leaving the agency, he founded Latitude Capital, a private equity firm focused on emerging markets. In those roles, Mr. Shah said, he came to understand the power of   partnerships, a strategy that Ms. Rodin has embraced at the Rockefeller Foundation. “I’ve seen what’s possible when people come together,” he said in an interview this week. “We were able to save tens of thousands, if not millions, of lives. ” Ms. Rodin was not involved in the search for her successor but has known Mr. Shah for years. They worked together on an agricultural project when he was at the Gates Foundation, and he joined the Rockefeller Foundation board in 2015. “He’s a marvel,” Ms. Rodin said in an interview this week. “He’s very strategic and very innovative. He shows an interpersonal dexterity that is well beyond his years. ” Ms. Rodin said she believed that Mr. Shah was a good fit for the job thanks in part to his time at U. S. A. I. D. which required that he forge alliances with a vast array of governments, organizations and companies. “One of the things we tried to emphasize during my time at Rockefeller was broadening the scope of partnerships,” Ms. Rodin said. “We see in Raj someone who has the capacity to take advantage of this, and has the capacity to be a great partner. ” Richard Parsons, the chairman of the Rockefeller Foundation board, said Mr. Shah was the unanimous choice of the search committee after a competitive process that considered hundreds of candidates. “Raj is the perfect guy to come in after her,” Mr. Parsons said in an interview. “He’s a performer. You put him up in front of a group and people come away impressed. Now, he’s got a platform. ” Mr. Shah said he was committed to the broad themes of resilience and inclusive economies. “That core concept of resilience is extraordinarily important going forward,” he said. “It gives us the opportunity to evolve into the future. ” But he said he would look for opportunities to address schisms in the American electorate in this divisive political moment. “It is a different time today than it was 10 or 15 years ago,” he said. “We live in a more fractured world. ” The Rockefeller Foundation is viewed by some has having a liberal bent. During Ms. Rodin’s tenure, the foundation donated money to the Clinton Foundation. Mr. Shah is close with President Obama but said he maintained good relations with Republicans in the House and Senate and believed that the foundation’s core mission had bipartisan appeal. “It’s widely acknowledged that tackling hunger and ensuring health around the globe are in our own national interest,” Mr. Shah said. “I have always been passionate about delivering social justice results at a massive scale. ” He will now have a $200 million a year to try to deliver those results.'"}, "time": 1742564514.5827398}