{"duration": 0.07949328422546387, "input_args": {"text": "'Home / Be The Change / Antiwar / ‘Unlawful’ US Airstrikes Kill 300 Civilians In Syria — Bombs Dropped a Second Time to Kill First Responders ‘Unlawful’ US Airstrikes Kill 300 Civilians In Syria — Bombs Dropped a Second Time to Kill First Responders John Vibes October 27, 2016 Leave a comment \\nAs the media and the general population in the United States remain distracted by the sham elections, the US military is waging undeclared war across the middle east. Just t his week, we reported that 60 civilians were killed, and over 200 injured during a US-led airstrike in Iraq. \\nNow, only a day later in Syria, 300 innocent civilians have died as a result of 11 different airstrikes conducted by a US-led coalition. \\nThe killings were largely absent from the major headlines in American mainstream media, but the operations were condemned by human rights organization Amnesty International. \\nThe organization stated that the US Central Command (CENTCOM) “may have… carried out unlawful attacks” in Syria, killing civilians. \\nLynn Maalouf, Deputy Director for Research at Amnesty International’s Beirut regional office said that the CENTCOM is downplaying the human cost of the recent attacks \\n“We fear the US-led coalition is significantly underestimating the harm caused to civilians in its operations in Syria,” she said. \\n“It’s high time the US authorities came clean about the full extent of the civilian damage caused by coalition attacks in Syria. Independent and impartial investigations must be carried out into any potential violations of international humanitarian law and the findings should be made public,” she added. \\nAccording to witnesses, “double tap” airstrikes, in which the same target is attacked multiple times, ended up killing numerous first responders who were trying to save innocent victims trapped in the rubble of collapsed buildings. \\nAmnesty international estimated that 300 civilians were killed in the attacks based on satellite imagery, eyewitness reports as well as media documentation from the front lines. \\n“At this point, I had a two-month-old baby boy in my arms whom I had rescued. The hit caused me to fall and drop him… I fell into the hole made by the air strike. That was what saved me… My mother, aunt, wife and children – a daughter who was four years old and a son who was two and a half were all killed. The woman and her son who I’d rescued were killed. Everyone but me was killed,” one survivor told reporters. \\n“Given the likely increase in air strikes by the US-led Coalition as part of the Iraqi offensive to recapture Mosul, it is even more pressing that CENTCOM be fully transparent about the impact of their military actions on civilians. And it is crucial that they adhere scrupulously to international humanitarian law, including by taking all feasible precautions to spare civilians and to minimize harm to civilian homes and infrastructure,” Maalouf of Amnesty International said. \\nThis is not the first time such a large death toll has occurred recently in Syria. Amnesty also documented that over 200 civilians were killed in a US-led attack on the city of Manbij, Syria. John Vibes is an author and researcher who organizes a number of large events including the Free Your Mind Conference. He also has a publishing company where he offers a censorship free platform for both fiction and non-fiction writers. You can contact him and stay connected to his work at his Facebook page. John is currently battling cancer naturally , without any chemo or radiation, and will be working to help others through his experience, if you wish to contribute to his treatments please donate here . Share Social Trending ‘Unlawful’ US Airstrikes Kill 300 Civilians In Syria — Bombs Dropped a Second Time to Kill First Responders October 27, 2016'"}, "time": 1742562464.5413284}