{"duration": 0.07373332977294922, "input_args": {"text": "'Planned Parenthood is bidding farewell to a president and his administration that have provided the organization with   support and new streams of funding. [Thank you for standing with Planned Parenthood, Mr. President. #ObamaFarewell pic. twitter.   —   Planned Parenthood (@PPIAction) January 11, 2017,   In 2013, Barack Obama was the first sitting president to deliver an address to the nation’s largest abortion chain. At its annual gala, Obama praised the group’s century of service to women and condemned those who “try to turn Planned Parenthood into a punching bag. ” “You’ve also got a president who is going to be right there with you, fighting every step of the way,” the president said. “Thank you. God bless you. ” . @POTUS: Thank you for your eight years of support for Planned Parenthood and reproductive freedom! #ObamaFarewell #IStandWithPP ❤👏  —   Planned Parenthood (@PPact) January 11, 2017,  Planned Parenthood’s president, Cecile Richards, has enjoyed significant access to the White House during the Obama presidency. CNSNews. com reported that, as of July of 2015, Richards had already made 39 visits to the White House since 2009, when she first was a guest on Obama’s inauguration day. We didn’t do it all, but we accomplished so much. Thank you, @POTUS  @FLOTUS. It’s been the honor of a lifetime. #ObamaFarewell pic. twitter.   —   Cecile Richards (@CecileRichards) January 11, 2017,  Thank you @FLOTUS. For everything. ❤️ pic. twitter.   —   Cecile Richards (@CecileRichards) January 6, 2017,  Going to miss @JoeBiden almost as much as @BarackObama pic. twitter.   —   Cecile Richards (@CecileRichards) January 11, 2017,  Obama’s deputies in the Department of Health and Human Services allowed Planned Parenthood to serve as “navigators” to assist in signing individuals up for Obamacare, the president’s signature legislation. The abortion business received more than $1 million in the form of grants even as the group was embroiled in a scandal alleging its practice of harvesting the body parts of babies aborted in its clinics and selling them for a profit. As the “baby parts” scandal erupted, the Obama administration came to Planned Parenthood’s defense by threatening states that passed laws that eliminated the group’s taxpayer funding and redirected it to other federally qualified health care centers that do not perform abortions. In October of 2016, Obama celebrated Planned Parenthood’s centennial anniversary with a wish, “Here’s to another #100YearsStrong”: For a century, Planned Parenthood has made it possible for women to determine their own lives. Here’s to another #100YearsStrong.  —   President Obama (@POTUS) October 16, 2016,  The “nonprofit” abortion chain’s IRS form 990 for 2014 shows that Richards’ salary and compensation jumped to $957, 952, double the salary she made just three years prior, in 2011, when her reported income was $420, 153. Despite a significant increase in Richards’ pay, Planned Parenthood’s annual reports show a consistent decline in legitimate health care services, such as pap smears and sexually transmitted disease treatment. Its 2014 tax return also shows that Planned Parenthood’s 12 highest paid employees all earn   salaries amounting to almost half a billion dollars. Planned Parenthood receives over a half billion dollars annually in taxpayer funding  —   as well as some $186 million in private and corporate donations  —   and performs over 300, 000 abortions per year. On   we’ll start the fight for our future with #IDEFY Live on FB. What will you defy in 2017?  —   Planned Parenthood (@PPFA) January 16, 2017,   '"}, "time": 1742563417.9106627}