{"duration": 0.04927182197570801, "input_args": {"text": "'Bill Clinton’s ‘Son’ Danney Williams has Youtube Channel Restored Youtube had deactivated channel hosting popular documentary linking Williams to Bill Clinton Infowars.com - October 27, 2016 Comments \\nYoutube has decided to reverse its ban on a channel registered by a man who claims to be Bill Clinton’s long-lost son. \\n“Your YouTube account was suspended due to repeated or severe violations of our Terms and our Community Guidelines, and as such cannot be restored,” the company wrote earlier this week to Danney Williams after he filed an appeal to restore his channel. \\nFor decades, Williams has been on a mission to reunite with the person he believes to be his biological father, the 42nd President of the United States, William Jefferson Clinton. \\nThe most popular video on the channel , a nine-minute mini-documentary posted two weeks ago produced by filmmaker Joel Gilbert, features the 30-year-old Williams recounting memories from his childhood which prompted the search for his father. \\nArguing the channel had “absolutely zero violations of any kind,” Gilbert places blame for the suspension squarely at Google and the Clinton campaign’s feet. \\n“It’s obvious to me that the fix is in!” Gilbert wrote in a statement. “The only possible explanation is that the Clinton campaign requested YouTube/Google to silence Danny, ‘to run him off the plantation’ as Danny said Hillary Clinton did to him and his aunt when he was a small child and they were chased off the grounds of the Arkansas Governor’s mansion in 1990.” \\nYoutube later restored Williams’ channel early Thursday morning claiming a review confirmed it was not in violation of its Terms of Service. \\nLast week, Danney went to Las Vegas – the site of the third US presidential debate – where he held a press conference alongside his lawyers announcing his intention to seek a DNA sample from Bill Clinton in order to settle the paternity dispute. \\nDanney and his lawyers claim a previous DNA test carried out by the tabloid Star Magazine failed to obtain a blood sample from Clinton, an assertion confirmed by one of Star’s former editors to World Net Daily . \\n“I don’t remember ever seeing any laboratory test that was done on Clinton’s DNA,” former Star Magazine editor Phil Bunton stated to WND. \\nWatch Infowars’ exclusive in-studio interview with Danney Williams from earlier in October. NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742564620.6304448}