{"duration": 0.3838355541229248, "input_args": {"text": "'Welcome to Breitbart News’s live coverage of the 2017 inauguration of Donald Trump, the 45th President of the United States. [All times Eastern.  8:08 AM: From last night  —   Watch   anarchists destroy a U. S. Flag and light fires in D. C.: WARNING: Explicit language,  12:53 AM: Watch video below of Trump’s remarks at the donor reception earlier this evening: 11:10 PM: Tens of thousands of   protestors and celebrities kicked off   filmmaker Michael Moore’s “100 Days of Resistance” Thursday, rallying outside Donald Trump’s New York City International Hotel. Breitbart’s Jerome Hudson reported on the event “which featured speeches from political figures including New York Mayor Bill De Blasio and Minneapolis Mayor Betsy Hodges and actors Alec Baldwin, Robert De Niro, and Mark Ruffalo. ” Moore told the crowd that America has entered into a “very dangerous” time, after electing a “sociopath. ” “With a lot of work on our part, we will stop this man,” Moore shouted. “He will not last four years. ” “If your rep is a Democrat, tell   you expect them to AGGRESSIVELY fight the Trump agenda  —   and if they don’t, you will work with others to support a true progressive in the Democratic primary in 2018,” Moore added.  10:40 PM:   protestors continue to gather outside the National Press Club in Washington, D. C. Thursday. Here is a list by Breitbart’s Lee Stranahan of the 75 leftist groups trying to stop Trump from taking office. ”Our streets, our streets, our streets!” Protesters chants at the police during the demonstration outside the Deploraball. pic. twitter.   —   Neil W. McCabe (@NeilWMcCabe) January 20, 2017,  10:09 PM: AP reports: 10 Promises Trump Made for His First Day, WASHINGTON (AP)  —   Behind in the polls in late October, Donald Trump ventured to Gettysburg, Pennsylvania, to give American voters a “contract” detailing what he would achieve during his first day in office. Beneath a list of 18 major actions was the flourish of Trump’s familiar signature and a blank space for voters to sign. But as Trump becomes president on Friday, it remains hazy as to which actions he will immediately take. The list included several items likely to fire up Republican voters but backed up by scant policy. It includes “begin removing the more than 2 million criminal illegal immigrants” and “cancel every unconstitutional executive action   …     by President Obama. ” Trump has already backed down from one pledge to label China a currency manipulator, recently saying he would first like to speak with the Chinese leadership. A look at 10 of the key promises Trump made for his first day as president:  —  Introduce a constitutional amendment for congressional term limits.  —  Freeze hiring for the federal government to reduce payrolls, although the military, public safety and public health agencies would be exempt.  —  Ban White House and congressional officials from becoming lobbyists for five years after they leave the government.  —  Announce plans to renegotiate the North American Free Trade Agreement with Canada and Mexico or withdraw from the deal.  —  Formally withdraw from the   Partnership.  —  Lift restrictions on mining coal and drilling for oil and natural gas.  —  Remove any   roadblocks to energy projects such as the Keystone XL pipeline.  —  Cancel U. S. payments to U. N. climate change programs and redirect the money to U. S. water and environmental infrastructure.  —  Stop all federal funding to “sanctuary cities,” places where local officials don’t arrest or detain immigrants living in the country illegally for federal authorities.  —  Suspend immigration from regions associated with terrorism where vetting is difficult. 9:58 PM: Breitbart News’ Ian Hanchett reports: During a live report on Thursday’s “Tucker Carlson Tonight” on the Fox News Channel, a young man protesting in Washington, DC claimed to have started a fire in the street, “Because I felt like it. And because I’m just saying, ‘Screw our president. ’” ”Screw our President!”  —   Child claims to have started fire at @realDonaldTrump protest. pic. twitter.   —   Fox News (@FoxNews) January 20, 2017,  9:38 PM: Breitbart’s Washington, D. C. Editor Matthew Boyle interviewed Trump supporters earlier today on the National Mall. ‘They Are Fake News’: Trump Supporters Rip into CNN on National Mall,  (Meanwhile, CNN is advertising a job listing for a   “fake news” reporter.) 9:21 PM: Trump on chance of #inauguration rain: ”If it really pours, that’s OK because people will realize it’s my real hair” https:  .   —   CNN (@CNN) January 20, 2017,  9:00 PM:   Donald Trump delivered remarks at a dinner for campaign donors in Washington, D. C. on the eve of his inauguration. He told a cheering crowd that in 2018 Republicans are going to win more seats in the Senate. Breitbart’s Neil Munro reports: “We have an election coming up in two years,” Trump told the crowd after thanking his early and his late donors. “We’re going to get a lot of them elected  …     [GOP Sen.] Mitch McConnell is here, he’s smiling so big,” Trump joked. McConnell is the GOP leader of the Senate. In 2018, he will have the opportunity to push his narrow 52 to 48 majority up to dominant 58 or even 60 seats. If the GOP reaches 60 Senate seats, then McConnell will usually be able to break the Democrats’s “filibuster” ability to block legislation. Forty Senators are needed to maintain a filibuster.   Senate Democrats face   in November 2018, while only eight Republicans must face the voters. Among the Democrats, nine Senators are either freshmen or won less than 53 percent in their prior election, and four will face the voters in states won by Trump. Several balls and dinners are taking place around town tonight amid protests. Breitbart’s Charlie Spiering reports from the Black Tie and Boots Texas Ball: ”In a @realDonaldTrump administration there will be no bullshit”  —   Bobby Knight at Texas ball introducing The Beach Boys pic. twitter.   —   Charlie Spiering (@charliespiering) January 20, 2017,  7:55 PM: Protesters wearing black masks confronted police Thursday outside the National Press Club, where the   “DeploraBall” event is being held. As Breitbart News’ Brandon Darby reports: “the event inside drew the ire of the hundreds of anarchists and their associates. Many of the   protesters physically resisted police efforts to clear the sidewalk as others shot their middle fingers to the police officers. ” Mob of anarchists pushback at police in front of Deploraball at National Press Club building. pic. twitter.   —   Neil W. McCabe (@NeilWMcCabe) January 20, 2017,  Marchers in DC with anarchist flags, swarm and jostle with Trump supporter. pic. twitter.   —   Neil W. McCabe (@NeilWMcCabe) January 20, 2017,  #BREAKING. Smoke devices. I’m at 14th St.  F St. Protesters set off ”smoke devices.” Some scream ”  Trump.” #Inauguration #NBC4DC pic. twitter.   —   Shomari Stone (@shomaristone) January 20, 2017,  7:40 PM: Thank you very much. Thank you very much everybody, and thank you Tom. I’d like to congratulate our incredible entertainers tonight. Toby, and Lee Greenwood and all of the great talent. It was really very special. I also have to thank our incredible military right here. Thank you. Stand up, please. You guys were really great. Thank you. So this journey began 18 months ago. I had something to do with it, but you had much more to do with it than I did. I’m the messenger. I’m just the messenger. And we were tired. And I love you. Believe me, I love you. We all got tired of seeing what was happening. And we wanted change, but we wanted real change. And I look so forward to tomorrow. We’re going to see something that is going to be so amazing. So many people have poured into Washington, D. C. This started out tonight being a small little concert, and then we had the idea maybe we’ll do it in front of the Lincoln Memorial. I don’t know if it’s ever been done before. But if it has, very seldom. And the people came by the thousands and thousands, and here we are tonight, all the way back. All the way back. So it’s a movement that began, it’s a movement that started, and it’s a movement like we’ve never seen anywhere in the world, they say. There’s never been a movement like this and it’s something very, very special. And we’re going to unify our country, and our phrase  —   you all know it, half of you are wearing the hat  —   “Make America Great Again. ” But we’re going to make America great for all of our people, everybody. Everybody throughout our country. That includes the inner cities, that includes everybody.  And we’re going to do a special job, and I can only tell you that 18 months ago, we never knew, a lot of people didn’t know, some people had a feeling. A lot of people didn’t give us much of a chance, but we understood what was happening. And that last month of the campaign, when I traveled around to every place that you can imagine. State after state after state, speech after speech. And we had ten thousand, twenty thousand, thirty thousand people. There was never an empty seat, just like tonight. We didn’t know if anybody would even come tonight. This hasn’t been done before. And you look. It was the same way. And we all knew that last month of the campaign. I think a lot of us knew the first week of the campaign, but that last month of the campaign we knew that something special was happening.  And I can only tell you this: The polls started going up, up, up, but they didn’t want to give us credit. Because they forgot about a lot of us. On the campaign I called it “the forgotten man” and “the forgotten woman. ” Well, you’re not forgotten anymore. That I can tell you. Not forgotten anymore. So I want to thank my great family, my incredible wife Melania. They’ve been so supportive, and it wasn’t easy for them. But they have been so supportive. I want to thank you, most importantly. And I promise you that I will work so hard. We’re going to get it turned around. We’re going to get our jobs back. We’re not going to let other countries take our jobs any longer. We’re going to build up our great military. We’re going to build it up. We’re going to strengthen our borders. We’re going to do things that haven’t been done for our country for many, many decades. It’s going to change. I promise you it’s going to change. So I’ll see you tomorrow. And I don’t care frankly if it’s going to be beautiful or if it’s going to rain like crazy. Makes no difference to me. I have a feeling it’s going to be beautiful. But I will see you tomorrow, and I’m going to be cheering you on. You’re going to cheer me on, but I’m going to be cheering you on. Because what we’ve done is so special. All over the world they’re talking about it. All over the world. And I love you folks, and we’re going to work together. And we are going to  —   make America great again. And I’ll add: Greater than ever before! Thank you very much and enjoy the fireworks. Thank you everybody. Thank you for joining us at the Lincoln Memorial   a very special evening! Together, we are going to MAKE AMERICA GREAT AGAIN! pic. twitter.   —   Donald J. Trump (@realDonaldTrump) January 20, 2017,  7:36 PM: In case you missed it, here’s the video of Lee Greenwood’s performance of “God Bless the USA. ” 6:55 PM: Breitbart’s Neil McCabe reports: Washington’s Trump International Hotel is closed tonight to  . But, the lobby bar is full of deplorables in tuxedos and evening gowns. 6:51 PM: Some wire photos  …     6:33 PM: The concert closed with a moving rendition of the “Battle Hymn of the Republic” accompanied by a display of fireworks. The Trump family then viewed the inscriptions over Lincoln’s towering figure. Watch the moment below: 6:25 PM: Trump ends the concert with remarks talking about the movement that got him elected, calling himself just “the messenger” for it and promising that the forgotten men and women of America “are not forgotten anymore. ” Video of his remarks below: . @ABC News Special Report: Pres.  Trump delivers remarks at Lincoln Memorial on day before Inauguration Day. https:  .  pic. twitter.   —   ABC News (@ABC) January 19, 2017,  Donald Trump: ”There’s never been a movement like this  …     We’re going to unify our country” https:  .  https:  .   —   CNN (@CNN) January 19, 2017,  ”You are not forgotten anymore,” Donald Trump tells crowd at #inauguration concert https:  .  https:  .   —   CNN (@CNN) January 19, 2017,  6:18 PM: Watch Sam Moore’s amazing rendition of “America the Beautiful” here. 6:12 PM: “This is some day,” Voight said to roaring applause from the massive crowd. “Dear friends, fellow Americans. I’m so happy to be here to welcome you all to the inauguration of the 45th president of the United States, Donald J. Trump. ”  Voight continued, recounting that the election was “a barrage of propaganda that left us all breathless with anticipation not knowing if God could reverse all the negative lies against Mr. Trump, whose only desire was to make America great again. ” “He certainly didn’t need this job. And yes, God answered all our prayers,” the   said. Voight assured the crowd that Abraham Lincoln was smiling knowing “America will be saved by an honest and good man who will work for all the people, no matter their creed or color. ” The Deliverance star endorsed Trump for president last March in an exclusive interview with Breitbart News. “He’s an answer to our problems,” Voight said. “We need to get behind him. The Republicans need to unite behind this man. We need somebody to go in and reconstruct us in a sort of way, get us back to where we were, who we need to be. ” Voight gave his brief remarks Thursday before introducing Rock and Roll Hall of Famer Sam Moore, who sang an emotional rendition of “America the Beautiful. ”   Follow Jerome Hudson on Twitter @jeromeehudson, 5:57 PM: Breitbart’s Joel Pollak interviewed  …     ”Salt of the earth Americans” have come to Washington for #Trump’s inauguration, says @joelpollak from @BreitbartNews #Newsnight pic. twitter.   —   BBC Newsnight (@BBCNewsnight) January 19, 2017,  5:43 PM: Wire image from earlier of   Trump and Melania Trump arriving at the Lincoln Memorial Concert  …     Other wire images from the concert  …     5:15 PM: From the Associated Press: From there, Trump shuttled to a celebratory welcome concert on the steps of Lincoln Memorial that was to end with fireworks. The   concert, open to the public, promised headliners including country star Toby Keith, soul’s Sam Moore and The Piano Guys. But not singer Jennifer Holliday: She backed out after an outcry from Trump critics. “This is some day, dear friends,” actor Jon Voight told the crowd, casting Trump’s impending inauguration as evidence of divine intervention after “a parade of propaganda that left us all breathless with anticipation, not knowing if God could reverse all the negative lies against Mr. Trump. ” Trump spokesman Sean Spicer said the   was still making “edits and additions” to the inaugural address he’ll deliver at Friday’s  . 5:09 PM: Exclusive video shot by Breitbart’s Brandon Darby of the bomb squad in action earlier today. 4:54  PM:   Trump and Melania Trump have arrived at the Lincoln Memorial for the “Make America Great Again” concert. Watch the   video coverage of the concert here. Appropriately, Trump arrives to the music of The Rolling Stones, whose song “You Can’t Always Get What You Want” was the Trump campaign theme song. Breitbart’s Joel Pollak wrote about the significance of the song to Trump’s campaign message. 4:40 PM:  last Obama WH pool note: “The White House just called an enthusiastic final   lid of the Obama presidency at 4:11 p. m.”  —   Tamara Gitt (@tamaragitt) January 19, 2017,  4:31 PM: More crowd members’ portraits from Breitbart reporter Charlie Spiering: Kentucky patriots #maga #inaguration pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  Proud protesters pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,   —   @BikersForTrump #maga #Inauguration #inaug2017 pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,    Cowgirls pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  4:26 PM: Watch live  —   the “Make America Great Again” celebration concert, where Trump and Pence will be addressing supporters. 4:13 PM: Wire photos of the Arlington wreath laying ceremony: 3:57 PM: 3:43 PM:    @realDonaldTrump at the Tomb of the Unknowns in honor of the nation’s fallen soldiers. pic. twitter.   —   Fox News (@FoxNews) January 19, 2017,  3:42 PM: Concert crowd cheers as Trump wreathlaying ceremony at Arlington is aired live on concert screens pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  3:40 PM:  NOW: Donald Trump, Mike Pence lay wreath honoring fallen soldiers at Tomb of the Unknowns https:  .  pic. twitter.   —   CBS News (@CBSNews) January 19, 2017,  Proud protesters pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  3:26 PM: More Deplorables. Photos: Matthew     3:25 PM: 3:10 PM: Bomb squad in DC wasn’t playing around when apparent backpack found on street. pic. twitter.   —   Brandon Darby (@brandondarby) January 19, 2017,  3:08 PM:  pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  3:06 PM: Some   Obama trolling: Just in: President Obama grants commutations for 330 individuals.  —   Phil Elliott (@Philip_Elliott) January 19, 2017,  . @POTUS saves final WH call for Angela Merkel, whose judgment and trust Donald Trump questioned Sunday. pic. twitter.   —   Cathleen Decker (@cathleendecker) January 19, 2017,  2:57 PM: This #Inauguration is like the #RNCinCLE  —   Hollywood celebs stay away so the people are enjoying full run of the city  —   Deplorables in force,  —   Joel B. Pollak (@joelpollak) January 19, 2017,  2:50 PM: The only reliable way to get around the mall. Photo: Joel   2:44 PM: Photo: Matthew   2:43 PM: Photo: Neil W.   2:37 PM: Street is now reopened. The cause for the alarm was a backpack left on the street corner behind a newspaper machine. The bomb squad appears to have   the bag and now they are removing police tape and packing up. 2:32 PM: Bomb squad in action. Man in bomb suit appears to be using a device to analyze a newspaper dispenser. Photos: Brandon     2:31 PM: Roger Stone spotted. Photo: Joel   2:23 PM: Amanda House reports: DEVELOPING: street closure outside the Hilton Garden Inn for what appears to be a bomb threat (14th and I street NW). Breitbart’s Brandon Darby is on the scene. 2:21 PM:  Trump delivered these remarks at a leadership luncheon with inauguration officials and Republican leaders at Trump International Hotel in Washington, D. C. on Thursday afternoon.   He praised the members of his cabinet, including “the legendary Jeff Sessions”  —   the Alabama senator who is Trump’s nominee for U. S. Attorney General. He also mentioned UN Ambassador nominee South Carolina Governor Nikki Haley, Health and Human Services Secretary nominee Dr. Tom Price ( ) and Treasury Secretary nominee Steve Mnuchin, among others. “We have a lot of smart people. I tell you what  —   we have by far the highest IQ of any Cabinet ever,” he said. Watch the video of his complete remarks above. 2:17 PM:  They’re playing Star Wars on the bagpipes #magaconcert,  —   Charlie Spiering (@charliespiering) January 19, 2017,  2:02 PM: Breitbart video crew interviewing Deplorables at the concert. Photo: Amanda   2:01 PM:  A rebel at the #maga celebration  —   says he voted for Jill Stein in 2016 pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  1:59 PM: If Sly Stallone can’t have it, no one can: Trump plans to eliminate the National Endowment for the Arts: https:  .  pic. twitter.   —   The Hill (@thehill) January 19, 2017,  1:50 PM: Via AP: Senate Democratic leader Chuck Schumer says the Senate will vote on two of Donald Trump’s Cabinet nominees on Friday and begin debate on a third. The Senate will vote on retired Gen. James Mattis to be defense secretary and retired Gen. John Kelly to lead the Department of Homeland Security. Both are expected to be easily confirmed. And debate is expected to begin on the nomination of Mike Pompeo  —   a Republican congressman from Kansas  —   to head the CIA. 1:49 PM: Via Neil W. McCabe: Trump is now leaving the hotel with a full presidential convoy. 1:44 PM: Via Breitbart Jerusalem Editor Aaron Klein: The CODEPINK   activist organization is planning “audacious and creative, colorful protests” targeting the inauguration of   Donald Trump on Friday, Ariel Gold, CODEPINK’s campaign director, told Breitbart News in an interview. 1:43 PM: Jerry Falwell Jr. with other Deplorables outside Trump International Hotel. Photo: Neil W.   1:42 PM: From the Voices of the People Concert. Photo: Amanda   1:40 PM: Big tent. PICTURED: Caitlyn Jenner at LAX airport on her way to Washington DC https:  .  pic. twitter.   —   Daily Mail US (@DailyMail) January 19, 2017,  1:38 PM: White House pool report: ”Photos of Obama, his family and staff that previously lined the West Wing walls have been taken down.”  —   Sabrina Siddiqui (@SabrinaSiddiqui) January 19, 2017,  1:23 PM:   serenades  . Via AFP: New York (AFP)  —   Bruce Springsteen performed a secret concert for President Barack Obama and his staff as they leave the White House, urging optimism in uncertain times, the rock legend’s fanzine reported. Backstreets, a   magazine and website that methodically documents Springsteen’s shows, said The Boss played a   acoustic set in the White House’s East Room on January 10. 1:19 PM:  Trump supporter swipes a protester’s sign and throws it in the reflection pond, runs off waving an American flag as the crowd cheers,  —   Charlie Spiering (@charliespiering) January 19, 2017,  1:16 PM: Ready for @TobyKeith #maga concert pic. twitter.   —   Charlie Spiering (@charliespiering) January 19, 2017,  1:15 PM: Crowd forming outside Trump’s hotel. Photos via Breitbart’s Neil W. McCabe:     1:13 PM: Trump, in remarks at his hotel’s luncheon, says Jeff Sessions “will be one of the outstanding stars of this country. ” Quips “We will have, by far, the highest IQ of any Cabinet ever assembled. ” 1:00 PM: Bey stirs up the Hive. From Breitbart’s Jerome Hudson: Pop   Beyoncé encouraged her 64 million fans on Facebook to turn out and support the Women’s March on Washington to protest   Donald Trump’s inauguration. “We raise our voices as mothers, as artists, and as activists. As #GlobalCitizens, we can make our voices heard and turn awareness into meaningful action and positive change. #WomensMarch. ,” the “Lemonade” singer wrote Wednesday. 12:51 PM: Photos from Trump International, waiting on the arrival of the  . Via Breitbart’s Neil W. McCabe:    12:48 PM: Some of the Trump swag available in town: Trump bear: $18. Trump chocolate: $10. Sipping a Trumppuccino from a Trump mug during Trump’s inauguration? Priceless. pic. twitter.   —   Los Angeles Times (@latimes) January 19, 2017,  12:46 PM: Congressman Filemon Vela claims Trump supporters spat on a “migrant student” from his district while visiting DC: Filemon Vela statement: pic. twitter.   —   Abby Livingston (@TexasTribAbby) January 19, 2017,  12:29 PM: More egg on  ’ faces, via The Hill: Donald Trump is ready to take an ax to government spending. Staffers for the Trump transition team have been meeting with career staff at the White House ahead of Friday’s presidential inauguration to outline their plans for shrinking the federal bureaucracy, The Hill has learned. Read the rest of the story here. 12:25 PM: Yes, we really need to know if they hit all green lights along the way.   Donald Trump’s motorcade is off, en route to DC. It’s missing a key ingredient: A press van.  —   Matt Viser (@mviser) January 19, 2017,  12:25 PM:  Family of   Donald Trump deplanes at Joint Base Andrews ahead of Inauguration Day. pic. twitter.   —   ABC News (@ABC) January 19, 2017,  12:17 PM: This morning, Vice   Mike Pence surprised reporters at a press conference to comment on the Transition Team’s wrapup. Breitbart’s Alex Swoyer reports: “We’re wrapping up this transition on schedule and under budget,” Pence declared. “We will actually return some 20 percent of taxpayer funding. ” Pence added that this is in keeping with Trump’s expectations going forward as President of the United States.     …     “We look forward to seeing you tomorrow. It will be a very humbling and moving day,” he added ahead of Friday’s inauguration. “We are all ready to go to work. ” Spicer spoke after Pence, telling reporters that Trump is continuing to edit his inaugural address for Friday’s speech. 12:14 PM: Trump arrives in DC.   Donald Trump has landed at Joint Base Andrews. He did not bring a press pool with him.  —   Phil Elliott (@Philip_Elliott) January 19, 2017,  12:05 PM: There they are. First pussyhats spotted in Washington, DC. (Fur coat? ??) #Inauguration pic. twitter.   —   Joel B. Pollak (@joelpollak) January 19, 2017,  11:44 AM: Trump, aboard Air Force plane, is now headed for DC pic. twitter.   —   Steve Kopack (@SteveKopack) January 19, 2017,  11:41 AM: From Forward. com: Ivanka Trump and Jared Kushner have been given a free rabbinical pass to travel by car following Donald Trump’s inauguration on Friday. According to Jewish law, driving or riding in cars is prohibited on Sabbath. But a principal in Jewish law called “pikuach nefesh” mandates that the rule can only be broken in   situations. In an interview with Kol Barama radio, Mark Zell, the chair of the Republican Party in Israel, said the couple have been granted special permission by a rabbi to use a vehicle because of “safety” concerns. Read the rest of the story here. 11:20 AM: Tribal consumerism is here to stay.  Not Obama’s Washington any more:    catering breakfast in the Inauguration media tent, A photo posted by David Frum (@davidfrumofficial) on Jan 19, 2017 at 5:32am PST, '"}, "time": 1742562864.3954203}