{"duration": 0.046599388122558594, "input_args": {"text": "'Actress Talulah Riley has criticized feminist activist Emma Watson for leading a ‘confusing’ campaign on gender equality that seeks to eliminate differences between the sexes. [Riley, who rose to fame in the 2007 remake of St. Trinians, criticized Watson’s brand of feminism in conversation with The Daily Mail.  “Men and women should have equal rights, of course, but [they] are also different and there’s nothing wrong with that,” she said. “We don’t have to start unifying gender in order to establish political equality. ” The actress, who is twice divorced from the   business magnate Elon Musk, then took aim at Watson’s HeForShe campaign, claiming it promotes the idea of both genders being the same. “The HeForShe campaign creates a lot of confusion when it comes to gender equality, because people are getting stuck in a semantic argument, rather than addressing the actual issue. People are associating gender equality with being exactly the same and, of course, that’s not what it means,” she continued. The campaign, which was launched by Watson in 2014 following her speech on gender equality at the United Nations, seeks to eliminate gender equality by involving men in the feminist movement. Last week, Watson praised MTV for scrapping the channel’s yearly ‘Best Actress’ award in favor of a gender “ ” honor, describing it as “the first acting award in history that doesn’t separate nominees based on their sex. ” In March, Watson hit back at critics accusing her of promoting the objectification of women after she posed for a racy photo shoot in lifestyle magazine Vanity Fair. “Feminism is about giving women choice. Feminism is not a stick with which to beat other women with,” Watson told Reuters. “It’s about freedom. It’s about liberation. It’s about equality. I really don’t know what my t*ts have to do with it. It’s very confusing. I’m confused. Most people are confused. ”   You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742564495.6375926}