{"duration": 0.07971620559692383, "input_args": {"text": "'It’s Wednesday, the trash people picked up my trash at 5:30 this morning… this post is still way more interesting than whats on the news.. carry on.\\nThis was Todd Kohlhepp’s first post to Facebook the day Kala Brown and Charlie David Carver went missing. A little over two months later, Brown was found alive, with a chain around her neck, in a metal storage container on property belonging to Kohlhepp, in Woodruff, South Carolina.\\nCarver’s 2002 Pontiac Grand Prix was located on the same property, covered with brush and in a ravine. Spartanburg County Coroner Rusty Clevenger confirmed a body was also found, however, no identification was given. Greenville Online reported that Solicitor Barry Barnette, from the 7th Judicial Circuit Court, acknowledged that Brown saw Kohlhepp shoot and kill Carver.\\nSheriff Chuck Wright of Spartanburg County appears to think that Kohlhepp is responsible for more than kidnapping. From the new information he received from Brown, Sheriff Wright believes there could be at least four bodies buried on Kohlhepp’s land. Wright told WYFF 4 News:\\nWe’re trying to make sure we don’t have a serial killer on our hands. It very possibly could be what we have.\\nIt was later confirmed that the body discovered was Carver. The couple was reportedly missing for two months before they were found.\\nWithout any knowledge of his past, one can easily mistake Kohlhepp for a nice guy. However, recent reports of his history, paint a totally different picture of him.\\nThe Past Life of Kohlhepp: November 1987, a year after he was charged with rape, Kohlhepp was sentenced to prison at 16 years old. He would not be released until 14 years later, at the age of 30. He has been described as incessantly aggressive to others and property since he was in nursery school. Seemingly without cause, he destroyed his own things, such as electronics, toys, clothing, and pets. These statements were made by the judge who had the rape case turned over to an adult court.\\nAround the age of 8, he was already seeing a counselor, due to behavioral issues at home. Reportedly, he shot a dog with a BB gun and was hitting other children. Kohlhepp’s father has stated that anger is the only emotion his son shows. This anger only progressed, even with more than a decade in prison and years of counseling. He is currently 45 years old.\\nThe Future of Kohlhepp: Weapons and ammunition were found on Kohlhepp’s property, along with chains above his garage door. It may take weeks to cover the 95 acres of land, in the search for other possible victims. He is under suspicion for seven murders but has only been charged with four of them and kidnapping.\\nAllegedly, he often invited the waitresses from the Waffle House he frequented in Roebuck to his house. He would leave them large tips. A former cook at the restaurant said the women thought Kohlhepp was creepy. The frequent patron’s behavior became so disturbing, in 2015, the cook started taking his orders.\\nOne of those waitresses was Meagan Coxie, age 26. She and her husband, Johnny Coxie, age 29, were found murdered on Kohlhepp’s property, in early November 2016. They were missing for almost a year. The Coxie’s had a history of panhandling. In December 2015, the waitress was charged with child neglect after their baby tested positive for heroin.\\nKohlhepp has not been charged with the Coxie murders, despite the fact their bodies were found on his property.\\nHe has been charged with four slayings committed in 2003, known as the “Superbike murders.” Beverly Guy, Scott Ponder, Brian Lucas, and Chris Sherbert were shot and killed, on Nov. 6, 2003, at Superbike Motorsports. This case remained cold until Kohlhepp offered his confession.\\nHis admission to these four homicides came with his arrest on Nov. 3, 2016. He was taken into custody when police found Brown chained up in a storage container on his land.\\nIn the meantime, Solicitor Barnette asserts that Kohlhepp is a dangerous individual. He is being held without bail and there is a court date scheduled for Jan. 19, 2017.\\nBy Amy Weins\\nEdited by Jeanette Smith\\nSources:\\nFacebook: Todd Kohlhepp\\nWYFF 4: Woman Missing Since August Found Held Captive, Man Still Missing Police Say\\nFox Carolina: Court documents highlight troubled past of man accused of holding Anderson woman captive\\nGreenville Online: BREAKING: Kala Brown watch Kohlhepp shoot boyfriend, solicitor says\\nCBS News: The frequent patron’s behavior became so disturbing, the cook started taking his orders\\nImages Courtesy of micro.81’s Flickr Page – Creative Commons License    Charlie David Carver , Johnny Coxie , Kara Brown , Kohlhepp , Meagan Coxie , spot'"}, "time": 1742563943.654015}