{"duration": 0.17858219146728516, "input_args": {"text": "'Waking Times \\n“How could one person like myself be able to do what we in the business call regime change?” ~Steve Pieczenik \\nFormer Deputy Assistant Secretary of State under Henry Kissinger, Steve Pieczenik has a long history as an expert in psychological warfare and was a diplomat to Soviet Russia helping to instigate the collapse of the megalithic communist state in 1991. In a recently released video he speaks on the role the American government played in manipulating Soviet culture and leadership to bring about a silent coup, or bloodless regime change, offering insight that is especially relevant in the present context of U.S. politics. \\nPieczenik explains the effectiveness of soft strategies as tools for destabilizing the U.S.S.R., noting firstly how religion was used externally to bring about an internal rise in the Russian Orthodox religion to undermine the atheist regime in the Kremlin. \\nA second soft tactic by the U.S. was to demonstrate for top Soviet military leaders the effectiveness of modern U.S. weaponry against Soviet tanks and other weapons systems. This allowed Soviet leaders to grasp the dominance of power already in play, effectively neutralizing the Soviet military without having to actually engage in warfare. \\n“A third element was creating economic hardship for the Soviet Union which they really could not comprehend,” says Pieczenik, who explains how Reagan’s funding of the Strategic Defense Initiative , or SDI, was largely a tactic of smoke and mirrors to force the Soviets to respond by over-spending on obsolete defense programs. It was a bluffed cold war arms race, aimed at destabilizing the financial systems of the Soviet Union. \\nThe fourth component of regime change, of which Pieczenik was greatly concerned, was cultural, involving the creation of a fissure between the younger and older generations in Soviet Russia, achieved primarily by exposing Russians to American rock and roll music, which was, at the time, highly revolutionary for the Soviet culture. \\nThe fifth element was the process of negotiations that took place between the Soviet politburo and American intelligence agencies for the deconstruction of the communist elements of the Soviet state, initiating the sequence of events that became known as perestroika . This was systemic and psychological warfare and negotiation with members of the government and Soviet elite, which neutralized the Soviet Union allowing for a collapse of the communist component. A regime change. Silent Coup in America Today? \\nWe see hints of many of these same elements at play in American politics today. \\nRecent revelations made public by Wikileaks impacted the result of the 2016 election. The timing of the releases and the overtly partisan nature of their contents, targeting only the Democrat campaign, revealed a clear bias, opening the door to speculation of a connection between Julian Assange and deeper state actors in both the Russian and the American intelligence communities. \\nThe primary defensive play of the Democrats was to blame Russia without ever providing specific evidence of Russia’s involvement in the leaks, yet some analysts indicated that the NSA was the source of the leaks , and that a silent coup had been initiated by the U.S. intelligence community covertly working to prevent a Clinton win. \\nNow, after the election, the manipulation of the body politic continues as protests organized by political front groups funded by the likes of billionaire social engineer George Soros continue, and resistance to a Trump presidency picks up steam. \\nThe nation is clearly being manipulated by off-screen actors on both sides of the stage. Is there an attempted silent coup happening right before our eyes in the United States? \\nMany of the elements of regime change noted by Pieczenik are visibly in play in America today. Religion is weaponized as Islam is being used by globalists as an invincible enemy. There are signs of a new arms race as both Russia and China demonstrate new military capabilities and global assertiveness. Economic warfare is in play as the banking and financial crisis created by central banks continues to destabilize the financial system. There are elements of a cultural war in the U.S. as millennials and so-called social justice warriors are attempting to disrupt civil discourse, essentially advocating for the end of free speech . And as we see in recent election events, there is some type of negotiation taking place behind the scenes in American politics between several factions. \\nIn the end, the American people may very well be at the mercy of those who are maneuvering to drastically alter the social, cultural and political environment in the U.S. Unfortunately these maneuvers would only lead to greater system of control and authoritarianism than we already have, unless the body politic wakes up refuses to allow themselves to be weaponized and used as pawns by the oligarchy . Read more articles by Dylan Charles . About the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor of OffgridOutpost.com , a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at . This article ( Silent Coup in the USA? Former Diplomat Explains How Soft Regime Change Works ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Dylan Charles and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742562788.05204}