{"duration": 0.03680419921875, "input_args": {"text": "\"There’s no way to sweep this under the rug: the American people have voted to end the empire. The entire imperial apparatus lined up behind former Secretary of State Hillary Clinton to become president. Former CIA Director Mike Morrell even publicly endorsed Clinton and called her opponent an “unwitting agent of the Russian Federation.” \\nBut it was ultimately Donald Trump who prevailed in the election. Trump spent the entirety of his campaign attacking the foreign policy of George W. Bush and one of its chief advocates, Clinton. First Trump took down former Florida Governor Jeb Bush in the primary by slamming the Iraq War and Jeb’s ambivalence surrounding it. Then he used Clinton’s support for the Iraq War and regime change in Libya to call her “trigger happy” and dangerous.\\nThe Clinton campaign struck back saying Trump did not support American exceptionalism, to which Trump responded by essentially agreeing and explained his foreign policy was more realist . Trump said he only endorsed using military force if American interests and security were actually under threat.\\nTrump’s realism and Clinton’s history of aggression and interventionist positioning led to a neoconservative exodus from the Republican Party. The neocons uniformly opposed Trump from the beginning and before long they all endorsed Clinton. By election day, almost all of the 2003 Iraq War architects and cheerleaders supported Clinton or at least said they would not vote for Trump.\\nRobert Kagan, a leading neoconservative and co-founder of The Project For A New American Century, even took a role advising and fundraising for Clinton. He also helped write a foreign policy document with Clinton’s likely nominee for secretary of defense Michèle Flournoy called, “Expanding American Power.” \\nDon't understand why people are surprised by neocon support for Hillary against Trump. Many neocons endorsed Clinton in 92. @maxboot \\n— (((Jamie Kirchick))) (@jkirchick) February 27, 2016 \\n\\nIn the final debate, Clinton said she would launch an air war against Russia and the Syrian government to establish a No Fly Zone in Syria, then accused Trump of being a “puppet” of Russian President Vladimir Putin for not supporting it. Trump coolly responded that he thought it would be good for the country and world if America and Russia got along.\\nThe contrast could not have been clearer and the American people made their choice to begin disentangling ourselves from foreign quagmires and focus our energy on our own country.\\nThe post America Votes Against Empire appeared first on Shadowproof .\\n\""}, "time": 1742561769.164233}