{"duration": 0.053198814392089844, "input_args": {"text": "'Comments \\nA Catholic church in San Diego has taken Donald Trump’s calls to demonize of Democratic nominee Hillary Clinton a tad too literally. The Immaculate Conception Catholic Church was caught passing out flyers last week that told parishioners that voting Democratic was a sin, and would immediately damn them to the fires of hell. \\nThis week, they’ve gone even further, and declared that the lawyer, former First Lady, and lifelong public servant is in fact an agent of the ruinous dark lord of evil incarnate himself, Satan. \\n“The devil does this through tactics outlined by Saul Alinsky with the outcome as Hillary Clinton stated ‘And deep-seated cultural codes, religious beliefs and structural biases have to be changed,’ to draw us away from God’s teachings regarding the sanctity of life to those of the world and its prince!” railed the flyer. \\nPreviously, the flyers asserted that “it is a mortal sin to vote Democrat … immediately after death the souls of those who die in a state of mortal sin descend into hell.” \\nThis, of course, is not the first time that Secretary Clinton has been compared to the despoiler of worlds. Former neurosurgeon and pyramid expert Ben Carson declared Hillary in league with the devil at the Republican National Convention . A recent poll of Florida Trump supporters found a staggering 40% of them believe that the former New York Senator is a literal demon . \\nThe irrational and all-consuming hatred that the right-wing feels for Democratic nominee Hillary Clinton is astonishing, and the fact that this is an actual issue shows that either the American public schooling system is entirely failing to do its job, or that a fair segment of the American population has fallen to thirteenth-century radical Christian extremism. \\nWhat’s truly ironic is that if one were to rationally approach this from such a literalist perspective, it is quite obvious that the envious glutton, shameless thief, and unrepentant lecher Donald Trump is Sin Manifest and his supporters are worshiping a false prophet, placing their own souls in mortal danger as they are consumed in heresy. \\nBut since those are fairytales designed to maintain social control over an illiterate pre-industrial peasant populace, it’s hard to explain this phenomenon without concluding that they may all just be idiots. Forgive me, but at this point my patience with these people is running very thin.'"}, "time": 1742562102.9415185}