{"duration": 1.4100229740142822, "input_args": {"text": "'360 Views Share: By Dr. David Duke. When I was first began to understand the ultra-racist, supremacist ideology of Judaism and Zionism, I came into contact with the theory that present-day Jews are genetically unrelated to the historical Jewish community. The allegation, known as the “”Khazar theory”, claims that the Ashkenazim Jews of today are actually the descendants of the Khazar people, a Central Asiatic nomadic tribe that allegedly converted to Judaism in the 9th Century AD. It is claimed that these newly-minted Jews then migrated into what is now Russia, Eastern Europe and later Western and Northern Europe. The theory is also used to advance the idea that Jewish actions are character are not genetic or racial because the Khazar people adopted the Talmudic values of Shephardic and other Jews who were unrelated to them. Interestingly enough, the Khazar theory was launched, and is still to this day, driven primarily by Communist Jews and other Jews who promote it in the Gentile community as a refutation that the Jews can’t be racist because they are not a race! It is ironic that the three most prominent exponents of the theory that “the Jews are not a race” all have almost exaggerated caricatures of features people ascribe as Jewish. Above, left to right: Zionist extremist and Communist Party member Arthur Koestler (author of the “The Thirteenth Tribe”); Jewish geneticist Eran Elhaik; and Shlomo Sand, an Israeli academic and former member of the Union of Israeli Communist Youth (Banki). All three maintain that large numbers of present-day Jews are completely genetically unrelated to the Middle Eastern-origin Jews who wrote the Babylonian Talmud. \\nFor years I accepted the Khazar theory as true. After it, all it was repeated by some writers who also recognized the leading Jewish role in Communism and their leadership in many other subversive movements. It was only later, when I considered the question logically and scientifically, were my doubts about the Khazar theory aroused. One thing that I did not know then was that Koestler, the communist Jew who popularized the Khazar Theory bragged in a Jewish magazine that he advanced the theory as way to fight against anti-Semitism. His theory was that since the Gospels and Europeans blamed Jews for the crucifixion of Jesus Christ, if he could make Europeans believe that they are not related by blood to the Christkiller Jews talked about in the New Testament that he could lessen hatred against Jews. One must remember until the Jewish triumph of “Christian Zionism” 99 percent of Christianity viewed Jews as the greatest enemies of Jesus Christ and God, as the New Testament makes very, very clear. So in those days some Jews, such as Koestler saw an advantage to say that the Jews were not actually related to the Jews who crucified Christ and so persecuted Christians. Koestler’s official biography, written by Michael Scammell, specifically quotes him on why he wrote The Thirteenth Tribe . ”His argument was that if he could persuade people that a non-Jewish “Khazar” heritage formed the basis of modern Jews, then this would be a weapon against European racially-based anti-Semitism. “Should this theory be confirmed, the term ‘anti-Semitism’ would become void of meaning,” he said. According to Scammell, Koestler told French biologist Pierre Debray-Ritzen he “was convinced that if he could prove that the bulk of Eastern European Jews were descended from the Khazars, the racial basis for anti-Semitism would be removed and anti-Semitism itself could disappear.” (Source: Scammell, Michael. Koestler: The Literary and Political Odyssey of a Twentieth-Century Skeptic, Random House, 2009, ISBN 978-0-394-57630-5, p. 546.) In the 1950s the Khazar Theory was also promoted by Benjamin Friedman, a prominent rich Jew who converted to Christianity and turned against the Jews. It was certainly self-serving for him to promote the idea that Jewishness was mostly cultural and religious and not racial in nature therefore facilitating more acceptance of him. There are three fundamental issues which need to addressed: the scientific evidence; thehistorical-logical evidence; and the reasons why the Khazar theory came about. Part I: The Scientific Evidence—Twelve DNA Studies Which Disprove the “Khazar Theory” 1. A 1999 study titled “Jewish and Middle Eastern non-Jewish populations share a common pool of Y-chromosome biallelic haplotypes” ( M.F. Hammer et.al, Proceedings of the US National Academy of Sciences 6769–6774, doi: 10.1073/pnas.100115997 ) found that: “[D]espite their long-term residence in different countries and isolation from one another, most Jewish populations were not significantly different from one another at the genetic level. “Admixture estimates suggested low levels of European Y-chromosome gene flow into Ashkenazi and Roman Jewish communities . . . Jewish and Middle Eastern non-Jewish populations were not statistically different. The results support the hypothesis that the paternal gene pools of Jewish communities from Europe, North Africa, and the Middle East descended from a common Middle Eastern ancestral population, and suggest that most Jewish communities have remained relatively isolated from neighboring non-Jewish communities during and after the Diaspora.” 2. A November 2001 study titled “The Y Chromosome Pool of Jews as Part of the Genetic Landscape of the Middle East” ( Almut Nebel et. al., American Journal of Human Genetics, Nov 2001; 69(5): 1095–1112 ) found that in most Jewish populations, male line ancestors appear to have been mainly Middle Eastern. The study found that Ashkenazi Jews in particular “share more common paternal lineages with other Jewish and Middle Eastern groups than with non-Jewish populations in areas where Jews lived in Eastern Europe, Germany and the French Rhine Valley. This is consistent with Jewish traditions in placing most Jewish paternal origins in the region of the Middle East.” 3. A September 2006 study titled “European Population Substructure: Clustering of Northern and Southern Populations” ( Michael F Seldin et.al., PLOS Genetics, DOI: 0.1371/journal.pgen.0020143 ) found that both Ashkenazi Jews as well as Sephardic Jews showed more than 85% membership in the ‘southern’ European group which made their results “consistent with a later Mediterranean origin of these ethnic groups.” 4. An April 2008 study titled “Counting the Founders: The Matrilineal Genetic Ancestry of the Jewish Diaspora” ( Doron M. Behar et.al., PLoS ONE. 2008; 3(4): e2062. doi: 10.1371/journal.pone.0002062 ) found that about 40% of Ashkenazi Jews originate maternally from just four female founders, who were of Middle Eastern origin. 5. A January 2009 study titled “A genome-wide genetic signature of Jewish ancestry perfectly separates individuals with and without full Jewish ancestry in a large random sample of European Americans” ( Anna C Need et.al., Genome Biology, 2009; 10(1): R7. doi: 10.1186/gb-2009-10-1-r7 ) found that “individuals with full Jewish ancestry formed a clearly distinct cluster from those individuals with no Jewish ancestry.” This study showed that in DNA terms, Jews, both Sephardic and Ashkenazim, cluster as a distinct group—something that, if the Khazar theory was true, would be impossible. 6. A December 2009 study titled “Genomic microsatellites identify shared Jewish ancestry intermediate between Middle Eastern and European populations” ( Naama M Kopelman et.al., BMC Genetics. 2009; 10: 80. doi: 10.1186/1471-2156-10-80 ) found that : “Jewish populations show a high level of genetic similarity to each other, clustering together in several types of analysis of population structure. These results support the view that the Jewish populations largely share a common Middle Eastern ancestry and that over their history they have undergone varying degrees of admixture with non-Jewish populations of European descent.” 7. A December 2009 study titled “The genome-wide structure of the Jewish people” ( Doron M. Behar, et. al., Nature 466, 238–242 (08 July 2010) doi:10.1038/nature09103 ) analyzed individuals from 14 Jewish Diaspora communities and compare these patterns of genome-wide diversity with those from 69 Old World non-Jewish populations in order to “provide comprehensive comparisons between Jewish and non-Jewish populations in the Diaspora, as well as with non-Jewish populations from the Middle East and north Africa.” The results identified a “previously unrecognized genetic substructure within the Middle East” and that “Most Jewish samples form a remarkably tight subcluster,” and that “trace[s] the origins of most Jewish Diaspora communities to the Levant.” 8. A June 2010 study titled “Abraham’s children in the genome era: major Jewish diaspora populations comprise distinct genetic clusters with shared Middle Eastern ancestry” ( Atzmon et al., American Journal of Human Genetics, 2010;86:850-859 ) refuted the idea of large-scale genetic contributions of Central and Eastern European and Slavic populations to the formation of Ashkenazi Jewry. This study found used genome-wide analysis of seven Jewish groups (Iranian, Iraqi, Syrian, Italian, Turkish, Greek, and Ashkenazi) and “demonstrated distinctive Jewish population clusters, each with shared Middle Eastern ancestry, proximity to contemporary Middle Eastern populations, and variable degrees of European and North African admixture.” This paper specifically excluded the “Khazar theory” as an origin for present-day Jews, saying “the genetic proximity . . . is incompatible with theories that Ashkenazi Jews are for the most part the direct lineal descendants of converted Khazars or Slavs.” 9. A March 2012 study by Steven M. Bray et. al., titled “Signatures of founder effects, admixture, and selection in the Ashkenazi Jewish population” ( Proceedings of the US National Academy of Sciences, 16222–16227, doi: 10.1073/pnas.1004381107 ) found that the “Ashkenazi Jewish (AJ) population . . . has a common Middle Eastern origin with other Jewish Diaspora populations” while concluding that the Ashkenazi Jewish population has had the most European admixture. 10. A March 2012 study by Christopher L. Campbell et. al., titled “North African Jewish and non-Jewish populations form distinctive, orthogonal clusters” ( Proceedings of the US National Academy of Sciences, doi: 10.1073/pnas.1204840109 ) found that genome-wide analysis of five North African Jewish groups (Moroccan, Algerian, Tunisian, Djerban, and Libyan) “demonstrated distinctive North African Jewish population clusters with proximity to other Jewish populations.” Furthermore, the study showed, the Sephardic Jewish genome is “compatible with the history of North African Jews—founding during Classical Antiquity with proselytism of local populations, followed by genetic isolation with the rise of Christianity and then Islam, and admixture following the emigration of Sephardic Jews during the Inquisition.” Finally, this study added “ These populations showed a high degree of endogamy and were part of a larger Ashkenazi and Sephardic Jewish group.” (*Endogamy: the practice of marrying within a specific ethnic group, rejecting others on such a basis as being unsuitable for marriage or for other close personal relationships.) 11. In his book, “Legacy: A Genetic History of the Jewish People” (Oxford University Press, USA; May 2012), Harry Ostrer, a professor of Pathology and Genetics at Albert Einstein College of Medicine of Yeshiva University and Director of Genetic and Genomic Testing at Montefiore Medical Center, Medicine, concluded that “Jews exhibit a distinctive genetic signature.” ( Jews Are a ‘Race,’ Genes Reveal–Author Uncovers DNA Links Between Members of Tribe, The Jewish Daily Forward, May 04, 2012 ). Ostrer, who is also director of genetic and genomic testing at Montefiore Medical Center, said in his conclusion that “Jews are a homogeneous group with all the scientific trappings of what we used to call a race.” Ostrer also deals specifically with the Khazar theory. He pointed out that the findings from the Jewish HapMap Project (see below) completely refute “the theories that Ashkenazi Jews are the descendants of converted Khazars or Slavs.” ( Jews: A religious group, people or race?, Jerusalem Post, 8/26/2012 ) 12. The Jewish HapMap Project , a joint project of Albert Einstein College of Medicine and New York University School of Medicine, was created to “understand the structure of the genomes in Jewish populations” and is an outgrowth of the Human HapMap Project. According to this project, “Jewish populations are remarkable for maintaining continuous genetic, cultural, and religious traditions over 4000 years, despite residence all over the world.” Its findings, based on first hand DNA studies amongst Jewish populations around the globe, found no evidence to support a Central Asian DNA origin for Jewry. According to the Jerusalem Post, the “Jewish HapMap Project in New York City has so far shown “in exquisite detail what had been conjectured for a century. Jewish populations from the major Jewish Diaspora groups – Ashkenazi, Sephardic and Mizrahi – form a distinctive population cluster that is closely related to Semitic and European populations. Within this larger Jewish cluster, each of the Jewish populations formed its own subcluster. “A high degree of mixing of Ashkenazi, Sephardi, Italian and Syrian Jews caused them to become more closely related to each other than they were to Middle Eastern, Iraqi and Iranian Jews. This genetic split seemed to have occurred about 2,500 years ago.” ( Jews: A religious group, people or race?, Jerusalem Post, 8/26/2012 ) DNA Studies Find that Ashkenazim Jews have 30% European Admixture Both the Behar study (section 7 above) and the Atzmon study (section 8 above) were commented upon by the British former deputy editor of the journal Nature , and currently the scientific correspondent for the N ew York Times , Nicholas Wade, in an article in that newspaper as follows: “Jewish communities in Europe and the Middle East share many genes inherited from the ancestral Jewish population that lived in the Middle East some 3,000 years ago, even though each community also carries genes from other sources — usually the country in which it lives,” adding that a “major surprise from both surveys is the genetic closeness of the two Jewish communities of Europe, the Ashkenazim and the Sephardim.” Wade pointed out that the two studies “refute the suggestion made by the historian Shlomo Sand in his book ‘The Invention of the Jewish People’ that Jews have no common origin but are a miscellany of people in Europe and Central Asia who converted to Judaism at various times. “Jewish communities from Europe, the Middle East and the Caucasus all have substantial genetic ancestry that traces back to the Levant; Ethiopian Jews and two Judaic communities in India are genetically much closer to their host populations,” Wade wrote. “The shared genetic elements suggest that members of any Jewish community are related to one another as closely as are fourth or fifth cousins in a large population, which is about 10 times higher than the relationship between two people chosen at random off the streets of New York City. “Ashkenazic and Sephardic Jews have roughly 30 percent European ancestry, with most of the rest from the Middle East, the two surveys find. The two communities seem very similar to each other genetically, which is unexpected because they have been separated for so long.” ( Studies Show Jews’ Genetic Similarity, Nicholas Wade, New York Times, June 9, 2010 ). Eran Elhaik’s Single Study Attempts to Refute the Mass of Earlier DNA Evidence The mass of DNA and genetic evidence is, therefore, overwhelmingly indicative that, despite a certain amount of European admixture among Ashkenazim Jewry, there is still a clearly definable Middle Eastern genetic component to both Ashkenazim and Sephardic Jewry. Despite all of these studies—and many more, too numerous to list individually here—in December 2012, a single individual by the name of Eran Elhaik, from the Johns Hopkins University School of Medicine, attempted to refute all of the above mentioned evidence. His paper, titled “The Missing Link of Jewish European Ancestry: Contrasting the Rhineland and the Khazarian Hypotheses” was published in the journal Genome Biological Evolution ( (2013) 5 (1):61-74.doi: 10.1093/gbe/evs119 ). In a nutshell, Elhaik—whose rather obviously Jewish physical appearance should by itself indicate that there is indeed a common Jewish “type” (how else can many Jews be physically “recognized” as Jews?)—argues that his method of doing comparative studies between present-day Central Asian populations, Ashkenazim Jews and non-Jewish test groups, “proves” that Ashkenazim Jews are a hotchpotch of genetic origins, with a strong link to what he identifies as the “Khazar” tribe. Even though Elhaik’s work is the only single paper (as opposed to literally dozens of opposing DNA studies), written by a single Jewish individual (as opposed to the other papers which were written by dozens and dozens of scientists from around the globe, Jewish and non-Jewish alike), it has quickly become the most-quoted “proof” of the “Khazar Theory.” Critical Errors in Elhaik’s Paper Elhaik’s paper has a number of errors, some small and a number of major ones. But they are all serious, because even the “small” errors cast doubt on his academic ability and motivation. For example, his paper discusses in detail what he sees as the geographic origin of the Khazars—yet he completely misidentifies the geographic location of one of his test sample groups, the Mbuti and Biaka Pygmies. These two groups, Elhaik asserts at least twice, are to be found in “South Africa.” Actually, the Mbuti and Biaka Pygmies are nowhere near South Africa, and are only to be found literally half a continent away, in the Congo. While this may seem a “small” error, it does indicate sloppiness in research which certainly does not bode well for the rest of the paper. This sloppiness is again repeated when Elhaik asserts that “Eastern and Central European Jews account for approximately 90% of over 13 million worldwide Jews.” In reality, the figure is far less. Of the estimated 13 million Jews worldwide, 8 million are Ashkenazim and 5 million are Sephardic, a division of 61% “European Jews” to 39% “non-European Jews.” And it should be pointed out that the Zionist State of Israel actually has a Sephardic and Mizrahi (non-Ashkenazi) Jewish majority among Jews. These actual facts on Jewish ethnicity are readily available, and Elhaik’s motivation for making this clearly false claim could only be ascribed to a desire to underscore his general assertion, namely that most Jews are not Middle Eastern in origin and that Jews are not race, or a genetically similar people. The most important error in Elhaik’s paper, however, is actually openly admitted: namely that there is actually no “Khazar DNA” in existence, against which any sort of measurement can be taken. Elhaik himself admits this in his paper: the “Khazars have been vanquished and their remains have yet to be sequenced. . .” —in other words there is no record of what exactly Khazar DNA might have been. As there is no record of what Khazar DNA is—it is, ipso facto, physically impossible to determine who is descended from it and who is not. Elhaik attempts to circumvent this major problem by selecting what he calls “surrogate populations”—in this case, “contemporary Middle Eastern and Caucasus populations.” Anyone with a basic understanding of historical events in the Caucasus in particular will immediately see that Elhaik’s assertion that current populations in that region can be taken to reflect those of 1,500 years ago, is highly problematic and quite simply, unsustainable. The Caucasus, a region at the border of Europe and Asia, situated between the Black and the Caspian seas, has been crisscrossed by numerous peoples and races over the last 2000 years, ranging from Indo-Europeans, Semites, Mongols and others—and is today highly genetically diverse. A claim that DNA samples from this region can be taken as any sort of DNA yardstick, is dubious to say the very least. Finally, Elhaik’s methodology in comparing the DNA samples is, to make an understatement, unique to him. As Marcus Feldman, director of Stanford University’s Morrison Institute for Population and Resource Studies, said, “He [Elhaik] appears to be applying the statistics in a way that gives him different results from what everybody else has obtained from essentially similar data.” ( ‘Jews a Race’ Genetic Theory Comes Under Fierce Attack by DNA Expert. The Jewish Daily Forward, May 07, 2013 ) Interestingly, the study which was cited in the New York Times of the “Jews as a race” is exactly the same conclusion that was reached by German National Socialist anthropologists and other experts who studied race science in the United States and elsewhere. Also, many of the present-day extensive studies have been carried out by both Gentile and Jewish geneticists alike, obviating any claims of racial bias. Elhaik’s theory is completely refuted by the new, most massive and most complete study ever done of the Jewish Genome One of Elhaik’s arguments was that the previous studies (referenced above) “were done in the pregenome-wide era using uniparental markers and including different reference populations”—implying that their results are not in line with the most modern DNA sequencing methodology. In fact, at least one study—which appeared after Elhaik’s work was first published—has confirmed the accuracy of the original studies, and also completely refuted Elhaik’s hypothesis. Titled “No Evidence from Genome-Wide Data of a Khazar Origin for the Ashkenazi Jews,” this study was published by the journal Human Biology in August 2013 (Behar, Doron M. et.al.; Human Biology, Access Pre-Prints. Paper 41 ), this paper emphasized the serious error with Elhaik’s work: “Because the Khazar population has left no obvious modern descendants that could enable a clear test for a contribution to Ashkenazi Jewish ancestry, the Khazar hypothesis has been difficult to examine using genetics. “Furthermore, because only limited genetic data have been available from the Caucasus region, and because these data have been concentrated in populations that are genetically close to populations from the Middle East, the attribution of any signal of Ashkenazi-Caucasus genetic similarity to Khazar ancestry rather than shared ancestral Middle Eastern ancestry has been problematic.” This latest, most massive study of the Jewish genome was a worldwide effort of geneticists, both Gentile and Jewish, to analyze Jewish genetics. Researchers from laboratories around the globe, including Estonia, Russia, Italy, Greece, Bosnia and Herzegovina, Croatia, Armenia, the US, and Israel, gathered together the largest Jewish DNA data set ever yet assembled. The paper explained as follows: “Here, through integration of genotypes on newly collected samples with data from several of our past studies, we have assembled the largest data set available to date for assessment of Ashkenazi Jewish genetic origins.” “Employing a variety of standard techniques for the analysis of population genetic structure, we find that Ashkenazi Jews share the greatest genetic ancestry with other Jewish populations, and among non-Jewish populations, with groups from Europe and the Middle East. “No particular similarity of Ashkenazi Jews with populations from the Caucasus is evident, particularly with the populations that most closely represent the Khazar region. Thus, analysis of Ashkenazi Jews together with a large sample from the region of the Khazar Khaganate corroborates the earlier results that Ashkenazi Jews derive their ancestry primarily from populations of the Middle East and Europe, that they possess considerable shared ancestry with other Jewish populations, and that there is no indication of a significant genetic contribution either from within or from north of the Caucasus region.” The latest, most up-to-date and modern DNA analysis has, therefore, completely refuted the “Khazar Theory.” It is important to understand that this refutation has come from non-Jewish and Jewish scientists from dozens of different universities and geneticists all over the world, and cannot be ascribed to a “conspiracy.” Part II: The Historical-Logical Evidence The Historical Record Shows Jewish Physical Consistency One of the most obvious indicators of genetic commonality is physical appearance. European people broadly resemble each other; African people broadly resemble each other; Chinese people broadly resemble each other; Australian Aborigines broadly resemble each other and so on. It is a characteristic of genetically similar people to physically resemble each other. Jews are no different in this regard to any other people. They too show a resemblance to each other—this is why it is possible to often “recognize” a Jewish person by his physical appearance. A good example in point is the already mentioned Jewish geneticist Eran Elhaik, who, despite physically embodying a Jewish sterrotype recognized around the world, tries to claim that there is no genetic commonality amongst Jews. The “Khazar theory” holds that most Ashkenazim Jews are not Semitic, but are “Central Asian” converts to Judaism. Proponents of the “Khazar theory” fail to understand the logical consequence of their belief—namely that a supposed Central Asian origin of “most” Ashkenazim Jews means that they will not physically resemble other Jews. As anyone can see, this is not the case. Sephardic Jews are, on average, slightly darker than Ashkenazim Jews, but there is no doubt that there is a physical similarity which allows them still to be recognized as such. Above: These two illustrations make the point even more dramatically. On the left, the Ashkenazim Jewess, Barbara Streisand, New York, 1966. On the right, a Jewish leader of Israelite trade delegation as portrayed on a mural on the wall of the 18th Dynasty (1400 BC) Tomb of Sobekhotep, Thutmose IV; Egypt. Two thousand years before the alleged Khazar conversion and they look the same as modern Ashkenazi Jews. Streisand’s paternal grandparents came from Galicia (Poland–Ukraine) and her maternal grandparents came from Russia—if anyone would be “Khazar,” according to that theory, it would be her. Nonetheless, she closely resembles the only designated Jew as portrayed on an Egyptian tomb from 3.400 years ago, the leader of a Jewish trade delegation to Egypt. The genetic continuity is clear—and if the Khazar theory was true, there would be no physical similarity, because there would have been a racial sea change in Jewish appearance. Left: The famous banker of Pompeii, Jucundus, who lived circa 20–62 AD. (700 years before the alleged Ashkenazi conversion) Identified as a Jew by the German anthropologist, Hans F.K. Günther, in his book “ Racial Elements of European History” (Fig, 240a and b, chapter VIII) . Alongside, the Ashkenazi Jew, Abe Foxman of the ADL. The similarity between Jucundus and Foxman is clear, and serves a further indication of the physical continuity of the Jewish type over centuries—something that would be impossible if the “Khazar theory” was true. In addition to genetic studies, there have been extensive physiological comparison of Jewish remains from burial sites from ancient Israel and present-day Ashkenazi and Sephardic physiology, all of which conclusively shows their similarity across both the Sephardic and Ashkenazi spectrum—and their difference from European populations. Jewish Supremacist Behavior Through the Millennia Disprove the “Khazar Theory” Another piece of the jigsaw which disproves the Khazar theory, is that Jewish Supremacist behavior has remained constant throughout the millennia—from biblical times right through to the present day. Most Christians are aware of the behavior of the Old Testament Jews—who burn, rampage, kill rape and enslave their way through Palestine supposedly on order of their tribal God. They are aware of the fact that the gospels of the New Testament show that elite of the Jews, the Pharisees, were the biggest enemies of Christ and arranged for his crucifixion, and the New Testament is clear that they led the persecution of Christians which has continued through both Jewish Bolshevism and the cultural assault in the Zio global media. It must also be clear that the Talmud, the books of Jewish law promoting Jewish extremist supremacism and hatred against all non-Jews, was written hundreds of years before any alleged Khazar conversion. While it another debate altogether as to the historical accuracy of those events, there is no question about Jewish interaction with Gentiles—and Romans in particular—during the first century AD. The world’s first anti-Jewish riots broke out in the city of Alexandria in 38 AD, and re-occurred in 66 AD, 115 AD, 118 AD, and 411 AD. In that year, the archbishop of Alexandria, Cyril, ordered the expulsion of all Jews from the city. The Roman historian Socrates of Constantinople (not be confused with the Socrates of Classical Greece), in his Ecclesiastical History, recorded the reasons for this first great expulsion of Jews from a non-Jewish city in detail, and reveals behavior by Jewish Supremacists exactly as the world experiences it today, over 1,500 years later: “. . .[T]he Jews were continually factious; and there was added to their ordinary hatred of the Christians . . . Cyril, on being informed of this, sent for the principal Jews, and threatened them with the utmost severities unless they desisted from their molestation of the Christians. These menaces, instead of suppressing their violence, only rendered the Jewish populace more furious, and led them to form conspiracies for the destruction of the Christians, one of which was of so desperate a character as to cause their entire expulsion from Alexandria” (Socrates, Hist. Eccl., VII, 13; PC, LXXXII, 759 ff). The very first Jewish community outside of the Middle East was established in Rome in 139 BC—and it was not long before their activities roused Roman public opinion against them. The famous orator Cicero, among others, frequently spoke against the presence of Jews during sittings of the Roman senate. In his famous Pro Flacco oration (which dealt with the case of a Roman aristocrat, Lucius Valerius Flaccus, accused of unlawfully confiscating Jewish money), Cicero said: “Now let us take a look at the Jews and their mania for gold. You chose this site, [chief prosecutor] Laelius, and the crowd which frequents it, with an eye to this particular accusation, knowing very well that Jews with their large numbers and tendency to act as a clique are valuable supporters to have at any kind of public meeting.” Many other prominent and famous Romans, such as Seneca, Juneval, and Tacitus all went on record as complaining about the activities of Jews within the Roman Empire. The Roman historian Tacitus, in his most famous work, Histories, described the activities of the Jews as follows: “In order to secure the allegiance of his people in the future, Moses prescribed for them a novel religion quite different from those of the rest of mankind. Among the Jews all things are profane that we hold sacred; on the other hand they regard as permissible what seems to us immoral . . . The other practices of the Jews are sinister and revolting, and have entrenched themselves by their very wickedness. Wretches of the most abandoned kind who had no use for the religion of their fathers took to contributing dues and free-will offerings to swell the Jewish exchequer; and other reasons for their increasing wealth may be found in their stubborn loyalty and ready benevolence towards brother Jews. “But the rest of the world they confront with the hatred reserved for enemies. They will not feed or intermarry with gentiles. Though a most lascivious people, the Jews avoid sexual intercourse with women of alien race. Among themselves nothing is barred. They have introduced the practice of circumcision to show that they are different from others.” (Tacitus, Histories, 5.2–5). The famous British historian Edward Gibbon, in his monumental work, The Decline and Fall of the Roman Empire, (Lippincourt, Philadelphia, 1878, vol. 2, page 4), discussed Jewish Supremacist behavior in Roman times this way: “From the reign of Nero to that of Antoninus Pius, the Jews discovered a fierce impatience of the dominion of Rome, which repeatedly broke out in the most furious massacres and insurrections. Humanity is shocked at the recital of horrid cruelties which they committed in the cities of Egypt, of Cyria, and of Cyrene, where they dwelt in treacherous friendship with the unsuspecting natives; and we are tempted to applaud the severe retaliation which was exercised by the arms of the Legions against a race of fanatics whose dire and credulous superstition seemed to render them the implacable enemies not only of the Roman government, but of all human kind.” Anti-Jewish literature during Roman times was very widespread. One work by the Greek, Apion, was so well-known that the Romanized Jewish historian Josephus (who wrote the famous account of the Jewish uprising of 70 AD, called The Jewish Wars) wrote an entire book trying to refute Apion’s arguments. The Roman Emperor Tiberius formally expelled the Jews from Rome in 19 AD. They returned shortly thereafter, only to be expelled once again in 49 AD. In 116 AD, Emperor Trajan ordered that all Jews in Mesopotamia should be killed, saying that they were the cause of continual uprisings in that region. One of the most famous emperors of the Eastern Roman Empire, Justinian (527–565 AD), adopted a comprehensive anti-Jewish policy which barred Jews from the civil service, military posts, and any other positions of influence in his government. All of these events pre-date the supposed “Khazar conversion” by centuries—yet it can be seen that the identical behavioral patterns are on display before and after the supposed “Khazar” infusion. Logic dictates that if the racial make-up of Jews changed substantially after the year 700 AD, then their behavioral traits would also have changed. The fact that they did not, is yet more proof that there was no racial sea-change amongst Jews as is claimed by the supporters of the “Khazar theory.” The historical-logical evidence therefore clearly shows that there has been no change in Jewish Supremacist behavior from the time of the ancient Romans to the present-day. If there had been large-scale conversions, as the “Khazar theory” claims, the genetic continuity of the Jewish people would have been disrupted, which would likely have caused a change in behavior. As this behavior as remained constant, the historical account indicates that the “Khazar theory” is untrue. Part III: The Reasons Why the “Khazar Theory” Has Come About 1. The “Khazar Theory” Deflects Attention from the Most Racist Jews of all, the Sephardic Jewish Extremists, suggests that there is not “Jewish problem” but a Khazar or Ashkenazi problem. The “Khazar theory” falls down when it is understood that it only attempts to explain the origin of the “European” or Ashkenazim Jews—and completely ignores the Sephardic and Mizrahi element of Jewry, which compromises nearly 40% of all Jews today and a majority of Jews in the Zionist State of Israel. The ludicrousness of the situation is underlined when it is appreciated that the Sephardic element of Jewry tends to be the most religious and the most orthodox. They most closely follow the dictates of the Talmud and the Torah laws—and are therefore most immersed in the racist supremacy and anti-Gentile hatred which guides all Jewish behavior. It was, after all, the former chief rabbi of the Sephardic Jews in Israel who announced that Gentiles are donkeys, created by God only to serve Jews, among many other overtly racist comments. This ultra racist Jew, Rabbi Yosef, recently died and had the largest funeral in the history of Israel. By focusing on the bogus “Khazar” theory, its proponents deflect attention away from the proven historical record that Jewish Supremacist behavior is common to both Ashkenazim and Sephardic Jewish extremists. This is proven by the fact that Israel uses DNA tests to check if potential immigrants to that country are Jewish or not. If there was a wide divergence between Ashkenazim and Sephardic Jewry, as the “Khazar theory” would maintain, then it would not be possible for Israel to genetically distinguish who is a Jew and who is not. 2. The “Khazar Theory” is Popular Among Anti-Zionists (For the Wrong Reasons) In the wake of the Second World War and establishment of the Zionist State of Israel, the Khazar theory gained traction in the anti-Zionist movement. It seemed to be powerful argument against Zionism. If the leaders of the Zionist movement had no relation to the historical people called Jews in the Mideast, then the theoretical rationale of the Zionists to claim Palestine as a historical homeland, was demolished. This logic is, of course, fundamentally flawed, because it matters not if modern Jews were related or partly related to Jews who lived in the region 2,000 years earlier. No matter what the case, there is no moral justification for the Jewish terrorist creation of Israel. It is a crime against humanity to drive hundreds of thousands of men, women and children from their land and homes, terrorize them and murder thousands, just because of a claim that one’s distant ancestors supposedly lived there millennia ago. It this “logic” is carried through to its conclusion, then it would be “justified” to drive from their homes 99.9 percent of the people alive on planet Earth—because there is hardly a region on earth that has not been subjected to invasions or migrations throughout history. To explain this inconsistency another way: by using the “Khazar theory” as “proof” that the Zionists cannot claim Israel because they are not the real Jews, the anti-Zionists are in fact saying that IF it can be shown that the Zionists ARE the real Jews, then they would have the right to claim Palestine as a homeland. Remember that a majority of Jews in Israel are Sephardic or Mizrahi Jews who are non-Ashkenazi. This “logic”, as detailed above, is false. 3. The “Khazar Theory” is a Tactic to Disguise Jewish Supremacist Racism The “Khazar argument” is intrinsically related to the question of whether the present-day Jews are a religion or a race. Prominent Jews have long referred to Jews as a “race,” even in modern times. If there was any leader of world Jewry in the days before The Second World War it was Nahum Goldman, the President of the World Zionist organization. He said: “The Jews are divided into two categories, those who admit they belong to a race distinguished by a history thousands of years old, and those who don’t. The latter are open to the charge of dishonesty.” Even the current prime minister of Israel, Benjamin Netanyahu, speaking before a gathering of Jews from all over the world, candidly referred to the “Jewish race”: “If Israel had not come into existence after World War II than [sic] I am certain the Jewish race wouldn’t have survived.” (Daily Pilot, Newport Beach/Costa Mesa, Feb. 28, 2000, front page.) Leading Jews have always defined themselves as much more than a religion but as people of special genealogy, and expressed the ultimate supremacism that God has chosen them above all others. Israel is a Jewish religious state, in which the religious dictates hold supreme. The rabbis determine all the important issues: immigration, education, housing, and marriage. It matters not if a person believes in God or not—the only thing that counts is if one is of Jewish lineage, or Jewish descent. It matters not if one’s Jewish mother was an atheist or a Haredim, or if her great grandmother was religious or not—what ultimately counts is one’s blood, not one’s belief in God. Ironically, this is not only true in Israel. It is true in the very synagogues of the Jewish religion across the globe. Atheist? No problem as long as if you are of the tribe. The tactic of claiming that Judaism is simply a religion is an effective defensive strategy. Whenever anyone complains about Jewish domination of any institution (achieved by favoring their own and disfavoring their non-Jewish competitors), Jewish Supremacists simply say that they are a “religion” like any other, rather than an ethnic group. People in America, Europe, and the Western world, all overwhelmingly endorse the concept of religious freedom—and thus they equate criticism of Jewish actions as “religious bigotry” and oppression. “After all,” the claim is made, “it is just a religion.” This is a Jewish Supremacist tactic: They disguise Jewish racism through religious dogma, rather than admitting ethnic nationalism. I have come to believe that the Khazar theory is one more piece of controlled opposition as illustrated in Orwell’s 1984 where Emmanuel Goldstein is supposedly Big Brother’s opposition, but in fact he is part of the Big Brother apparatus. How convenient it is to suggest that Jews are not a race, not a related people that gives them a unity and strength in conflict with other peoples. One cannot explain the power of Zionism unless one understands Jewish tribalism. Jewish tribalism (racism) and favoritism and preference for fellow Jews combined with discrimination against non-Jews ultimately enables them to take over almost any institution. Without Jewish racism, Zionism could not flourish, for that is what gives the Jewish extremists its enormous economic, media and political influence. Christians who propagate the “Khazar theory” should not forget that the Talmud is perhaps the most anti-Christ tome ever written. The Talmud portrays Jesus being boiled in human excrement—“forever”! The Talmud as well the gospel recounting of the Jewish persecution behind the crucifixion of Christ all took place hundreds of years before any supposed Khazar conversion! How convenient it is for the anti-Zionist, anti-Jewish supremacist efforts be divided on the foundation of the Jewish problem. Bear in mind, the problem we face is not a “Khazar” problem, it is a Jewish problem, it is a problem of extremist Jewish racism and supremacism which continually plunges our world into war, hatred, tyranny and degradation. It is for these reasons, that I no longer believe the Khazar theory. Anyone who opposes Jewish extremism, supremacism and Zionism I consider an ally and brother in the cause for the liberation of Europeans and every people on the Planet from the Zio-Globalist threat. I accept whole heartedly those who still believe the Khazar theory, but at the same time I must express what I think to be the truth: that, overall, the theory does more harm than good in our efforts to oppose Jewish tribalism. As a final note is important to show that Sephardic and Mizrahi Jews are not claimed to be Khazars by anyone and they were throughout the Mediterranean world at the time of Christ some 900 years before any alleged Khazar conversion. They were the ones who crucified Christ, the ones Christ railed against. Some of the very same people who expose the Talmud and the Jewish role in Christ crucifixion are now telling us that Jews are actually Khazars today! Not a single Khazar wrote a word of the vicious Talmud. The most important Jewish rabbi in Israel is the Chief Sephardic Rabbi, as typified by the late Ovadia Yosef. Yosef was viciously anti-Gentile and anti European and anti-Palestinian. When he died he was honored like no other Israeli citizen in history — with the largest funeral honored by all Ashkenazi, Sephardi and Mizrahi. Although I am friends with and respect all who believe in the Khazar theory if they are fighting against the Jewish Supremacists, I though will personally will no longer endorse what I believe is a patently false idea fostered upon us by Jewish communists who seek to lessen our understanding of the core threat of Jewish racism and Jewish tribalist supremacism. When people tell us the threat of Ashkenazi Jews it confuses people on the subject to no end. It deflects from the fundamental fact that the Jewish establishment, i.e. every major Jewish organization of all types of Jews– is working for our genocide.'"}, "time": 1742562789.8301868}