{"duration": 0.029534578323364258, "input_args": {"text": "'During Attorney General Jeff Sessions’ testimony before the Senate Intelligence Committee, Senator Tom Cotton ( ) asked whether any spy fiction had “a plot line so ridiculous that a sitting United States senator and an ambassador of a foreign government colluded at an open setting with hundreds of other people to pull off the greatest caper in the history of espionage?”  Cotton said, “[A] very simple question that should be asked is, did Donald Trump or any of his associates in the campaign collude with Russia in hacking those emails and releasing them to the public? That’s where we started six months ago. We have now heard from six of the eight Democrats on this committee, and, to my knowledge, I don’t think a single one of them asked that question. They’ve gone down lots of other rabbit trails, but not that question. Maybe that is because Jim oCmey said last week, as he said to Donald Trump, that on three times he assured him he was not under investigation. Maybe it’s because multiple Democrats on this committee have stated they have seen no evidence thusfar, after six months of our investigation and ten  —   11 months of an FBI investigation of any such collusion. I would just suggest, what do we think happened at the Mayflower? Mr. Sessions, are you familiar with what spies called tradecraft?” After Sessions responded, “A little bit. ” Cotton continued, “That involves things like covert communications and dead drops and brush passes, right?” Sessions answered that’s “part of it. ” Cotton then asked Sessions if he liked spy fiction. After Sessions answered in the affirmative, Cotton asked, “Have you ever, in any of these fantastical situations, heard of a plot line so ridiculous that a sitting United States senator and an ambassador of a foreign government colluded at an open setting with hundreds of other people to pull off the greatest caper in the history of espionage?” Sessions answered that such charges are “beyond my capability to understand. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742561804.050563}