{"duration": 0.2445530891418457, "input_args": {"text": "'114 Views Share: In 2006, a remarkable article—and admission—appeared in the Israeli news source Ynet News. Titled “ Stalin’s Jews ” and written by Jewish columnist Sever Plocker, this piece confirmed that terrible crimes which Jewish Communists had committed under Stalin. “We must not forget that some of greatest murderers of modern times were Jewish,” Plocker started out by saying. He went on to make a number of startling confessions: “Here’s a particularly forlorn historical date: Almost 90 years ago, between the 19th and 20th of December 1917, in the midst of the Bolshevik revolution and civil war, Lenin signed a decree calling for the establishment of The All-Russian Extraordinary Commission for Combating Counter-Revolution and Sabotage, also known as Cheka. “Within a short period of time, Cheka became the largest and cruelest state security organization. Its organizational structure was changed every few years, as were its names: From Cheka to GPU, later to NKVD, and later to KGB. “We cannot know with certainty the number of deaths Cheka was responsible for in its various manifestations, but the number is surely at least 20 million, including victims of the forced collectivization, the hunger, large purges, expulsions, banishments, executions, and mass death at Gulags. “Whole population strata were eliminated: Independent farmers, ethnic minorities, members of the bourgeoisie, senior officers, intellectuals, artists, labor movement activists, “opposition members” who were defined completely randomly, and countless members of the Communist party itself. “In his new, highly praised book The War of the World, Historian Niall Ferguson writes that no revolution in the history of mankind devoured its children with the same unrestrained appetite as did the Soviet revolution. In his book on the Stalinist purges, Tel Aviv University’s Dr. Igal Halfin writes that Stalinist violence was unique in that it was directed internally. “Lenin, Stalin, and their successors could not have carried out their deeds without wide-scale cooperation of disciplined ‘terror officials,’ cruel interrogators, snitches, executioners, guards, judges, perverts, and many bleeding hearts who were members of the progressive Western Left and were deceived by the Soviet regime of horror and even provided it with a kosher certificate. “And us, the Jews? An Israeli student finishes high school without ever hearing the name Genrikh Yagoda, the greatest Jewish murderer of the 20th Century, the GPU’s deputy commander and the founder and commander of the NKVD. “Yagoda diligently implemented Stalin’s collectivization orders and is responsible for the deaths of at least 10 million people. “His Jewish deputies established and managed the Gulag system. After Stalin no longer viewed him favorably, Yagoda was demoted and executed, and was replaced as chief hangman in 1936 by Yezhov, the “bloodthirsty dwarf.” The Jew Genrikh Yagoda, director of the NKVD, the Soviet Union’s Stalin-era security and intelligence agency. “Yezhov was not Jewish but was blessed with an active Jewish wife. In his book Stalin: Court of the Red Star, Jewish historian Sebag Montefiore writes that during the darkest period of terror, when the Communist killing machine worked in full force, Stalin was surrounded by beautiful, young Jewish women. “Stalin’s close associates and loyalists included member of the Central Committee and Politburo Lazar Kaganovich. Montefiore characterizes him as the “first Stalinist” and adds that those starving to death in Ukraine, an unparalleled tragedy in the history of human kind, did not move Kaganovich. “Many Jews sold their soul to the devil of the Communist revolution and have blood on their hands for eternity. We’ll mention just one more: Leonid Reichman, head of the NKVD’s special department and the organization’s chief interrogator, who was a particularly cruel sadist. Yagoda (center) inspecting the construction of the Moscow-Volga canal, built by slave labor from the Gulags. “In 1934, according to published statistics, 38.5 percent of those holding the most senior posts in the Soviet security apparatuses were of Jewish origin. Even if we deny it, we cannot escape the Jewishness of ‘our hangmen,’ who served the Red Terror with loyalty and dedication from its esta blishment. After all, others will always remind us of their origin.” The Gulags: Jewish-Run Concentration Camps As mentioned above, the infamous Soviet Gulags were under the direct control of the Jew Yagoda. He was not the only such Jew involved in the running of these camps, in which millions were interned and nearly 1.4 million died. The most famous revelation about the Jewish nature of the Gulags was that of famous dissident Alexander Solzhenitsyn. Speaking from personal experience as a Gulag prisoner, Solzhenitsyn gave a candid account of Jews in charge of the Soviet prison camps in his book, Two Hundred Years Together. According to his observations, Jews made up a clear preponderance in the Gulag administration and in the early Bolshevist government, saying that of the 22 ministers in the first Soviet government three were Russian, one Georgian, one Armenian and 17 were Jews. In addition, he points out, from personal experience once again, that “two thirds of the Kiev Cheka” (secret police) were Jews. In 1937, another book appeared in Germany called Jewish-Run Concentration Camps in the Soviet Union, which revealed that Communist Jews were the commandants of 11 out of the 12 main Gulags.'"}, "time": 1742563117.09803}