{"duration": 0.059653282165527344, "input_args": {"text": "'November 25, 2016 Mainstream Reports Foggy - MoA Outed As Russian Propaganda Site \\nAl Masdar News (Syria), Nov 25 2016 - Syrian Air Force denies bombing Turkish Army in east Aleppo \\nAvid readers of news sides will ask which of those reports is correct. They may turn to the so-called (hint: it\\'s not) \"paper of record\", the New York Times and find this Nov 24 report: Syrian Warplanes Kill Turkish Soldiers Fighting in Syria \\nWhile that NYT headline claims certainty the text does not. It obediently repeats the Turkish government claim but adds: Syrian Arab rebel forces fighting with the Turks said they had not received official notification that the Syrian government had launched the strike. One fighter said he had heard that the strike was from the Syrian government but heard later that it had been from the Islamic State. The Syrian Observatory for Human Rights, a network based in Britain that monitors news from Syria, also said that the strike had been by the Islamic State. \\nAn updated version of that report adds: Some on the ground raised questions about whether the strike was undertaken by Syrian government forces. A network of activists who monitor the skies over Syria said Thursday that its watchers had spotted a Syrian aircraft taking off after 2 a.m. and also a Russian aircraft about the same time as the strike on Turkish forces occurred. It is impossible to know where the planes that were sighted went; they could easily have had another destination, the network said. \\nThe Syrian Observatory for Human Rights, a network based in Britain that monitors news from Syria, said the strike was by the Islamic State. But the Islamic State, also known as ISIS, is not known to have combat aircraft. \\n--- Excursus: The Syrian Observatory for Human Rights (SOHR) is a sophisticated disinformation outlet of the British foreign intelligence service MI-6. SOHR is on one side very manipulating, i.e. SOHR counts only foreigners, deserters of the Syrian army, ISIS and al-Qaeda fighters on the anti-government side as \"rebels killed\". Ten-thousands of Syrian civilians who took up arms to become well paid \"Syrian rebel\" fighters are counted as \"civilians\" when besieged, killed or wounded. On the other side SOHR provides the most complete and detailed record of the war. It helps its reputation and is the reason why it is a favorite quoted source for \"western\" news \"reporting\". --- \\nThe answer to the reader\\'s question is that both Hurriyet and Al Masdar, are right and the NYT writers are confused by the fog of war and too lazy to do basic research. The devil is, as always, in the details. \\nOn November 23 a Turkish armored military vehicle was attacked near the village Wiqah north of Al-Bab in northern Syria. Some sources claimed a guided missile strike. ISIS related Twitter accounts claimed a suicide attack. (Note: The above account has now been suspended.) \\nISIS later released a picture of the claimed suicide bomber. \\nThe SOHR account of the Turkish vehicle hit, cited by the NYT, obviously refers to this November 23 attack. \\nThe air-attack on the Turkish soldiers north of Al-Bab happened on November 24 at 3:30am local time according to the Turkish army. It was confirmed to journalists by very senior people in Damascus. The Al Masdar News account though, seemingly denying such a strike, includes a very specific non-denial-denial quote: A high-ranking official from the Syrian Arab Air Force (SAAYF) told Al-Masdar on Thursday night that their fighter jets did not bomb the Turkish Army in east Aleppo. \\n\"No Syrian or Russian aircraft bombed the Turkish Army near Al-Bab on November 23rd - all reports claiming otherwise are lies,\" the official confirmed to Al-Masdar on Thursday. \\nThe airstrike did not on occur on the 23rd, as \"denied\" by SAAYF, but on the 24th. The NYT report mixes up two attacks as one, while basic research shows evidence of two very different attacks. The Al Masdar folks do not understand the specificity of the quotes their sources give. \\nMystery solved. \\nHurriyet and others have connected the Syrian air-attack to the Turkish attack on a Russian jet exactly one year before. I doubt that this coincident is intended. Al-Bab, held by ISIS and coveted by nearby Turkish, Kurdish and Syrian government forces, is an important target that will be fought over between the various sides for some time to come. The hit was not some symbolic, historic revenge act, nor was it to roast Turkey for Thanksgiving, but a signal to Turkey that Al-Bab is and will stay off limits for its forces. \\nNews accounts of war, be those of casualties, of specific incidents or assume motivations, are always suspect . They are often written with disinformation in mind. Historic accounts are mostly written by the winners of a specific conflict and heavily \"colored\" from that perspective. Forensic or video proof can be easily forged and should always be taken with many pinches of salt. Only diligent research on all sides of a conflict can uncover what really happened. Only when \"reports\" from opposite sides agree on numbers or specific incidents on can assume to be near the truth. \\nBut when one tries to be diligent and not solely on one side, one can be sure to end up as denounced and hated by at least one if not all sides of a conflict. This website, MoonofAlabama.org , is now listed as \"Russian propaganda outlet\" by some neoconned, NATO aligned, anonymous \" Friendly Neighborhood Propaganda Identification Service \" prominently promoted by the Washington Post . The minions running that censorship list also watch over our \"Russian propaganda\" Twitter account @MoonofA . \\nI wholeheartedly recommend to use the list that new anonymous censorship entity provides as your new or additional \"Favorite Bookmarks\" list. It includes illustrious financial anti-fraud sites like Yves Smith\\'s Naked Capitalism , Wikileaks , well informed libertarian sites like Ron Paul and AntiWar.com and leftish old timers like Counterpunch . \\nI am honored to find this site listed next to the above.   06:56 AM | Permalink'"}, "time": 1742628434.2907825}