{"duration": 0.04364943504333496, "input_args": {"text": "'Friday on his nationally syndicated radio show, conservative talker Rush Limbaugh reacted to President Donald Trump’s tweets aimed at the House Freedom Caucus, which is considered by many to be what kept the American Health Care Act, House GOP leadership’s effort to repeal the Affordable Care Act, also known as Obamacare, from passing the House.  If @RepMarkMeadows, @Jim_Jordan and @Raul_Labrador would get on board we would have both great healthcare and massive tax cuts  reform.  —   Donald J. Trump (@realDonaldTrump) March 30, 2017,  Where are @RepMarkMeadows, @Jim_Jordan and @Raul_Labrador? #RepealANDReplace #Obamacare,  —   Donald J. Trump (@realDonaldTrump) March 30, 2017,  Limbaugh mentioned a Politico story describing the House Freedom Caucus leadership as “ringleaders” before saying there was a better way to handle the House Freedom Caucus than calling them out on Twitter. “Now, to this health care business. As I mentioned earlier today, the president has doubled down on the Freedom Caucus, the 30 or so members of the conservative members of the House of Representatives, The Politico and such others in their headline are referring to the three Freedom Caucus leaders as the ringleaders, Mark Meadows, Jim Jordan, Raul Labrador. The ringleaders? What do you associate ringleaders with? Ringleaders  —   crime, gangs,” he said. “Exactly right. Bank robbers. The ringleaders of the group were hiding in the getaway car parked one block down the street. ” “So now these guys are being characterized as ringleaders of some gang, some    gang in the House, and Trump has doubled down on it,” Limbaugh continued. “Look, folks, calling them out like this, I know it’s Trump’s technique I know it’s Trump’s method. But there’s a better way of doing this. These guys are not the enemy. The Democrats are the enemy. The Freedom Caucus has actually made a pretty big move here. ” Limbaugh went on to cite a Washington Examiner editorial calling the Freedom Caucus’ conditions reasonable and urging the White House, House Speaker Paul Ryan and congressional GOP centrists to accept those conditions. “That’s the problem with the first effort: It didn’t kill the law,” Limbaugh said. “It sustained much of it and then put in the hands of the secretary of Health and Human Services, Tom Price, the responsibility of removing a bunch of things from it. And the Freedom Caucus said, ‘We’re not really getting rid of it, if we’re just letting the secretary remove it and nothing else happens, then the next time the Democrats win they can put those things back in. We need to take them out by statute. ’” “But it’s clear that the objective here was to get a win,” he added. “The objective was to really knock it out of the park in the first two months, fulfill a campaign promise, say that Obamacare had been repealed and the replace effort was underway, first phase of three. But the ringleaders of the Conservative Caucus were suspicious that this was not gonna end Obamacare, and they had campaigned promising to do so. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563141.104778}