{"duration": 0.0763092041015625, "input_args": {"text": "'Financial Markets , Gold , Housing Market , Market Manipulation , U.S. Economy Comex , LBMA , Shanghai Gold Exchange , silver eagles admin \\nGold was pushing $1230/oz overnight, as the methodical take-down of gold and silver in the NYC and London paper markets has triggered an avalanche of demand for physical gold in the eastern hemisphere. \\nLast night ex-duty import premiums in India were $14 over spot gold. In Shanghai the premium to world gold was $9.76. Delivery volume into the Shanghai Gold Exchange rocketed to an extraordinary 86.55 tonnes (it was 35.9 tonnes on Wednesday). The open interest on the SGE was 807 tonnes. To one observer’s recollection, John Brimelow of John Brimelow’s Gold Jottings, this is the first time the open interest has been over 800 tonnes. \\nIn Viet Nam the premium paid by the public was $90 over world gold. The spread has been wider over the last 15 years, but not much and only during times when there’s been high “backwardation” between the physical delivery bullion markets in the east vs. the fraudulent paper gold markets in London and NYC. \\nTo reinforce this nebulous idea of gold flowing from west to east, and unusually high amount of gold was shipped out of the Comex kilo bar vaults yesterday. 320,434 ozs left the Comex. Over 12,000 kilobars have left JP Morgan’s kilobar vault account in the last two days. This is being attributed as evidence of Asia’s voracious demand right now, as NY and London – when those two conduits actually clear real metal – trade 400oz LBMA grade bars whereas Asia prefers kilobars. \\nThe price of gold is being attacked right now in a manner that is quite reminiscent of the way it was attacked in the summer of 2008, right before the global financial markets collapsed, led by the fall of Lehman. \\nSomething really ugly is coming toward the global economic and financial system. The dollar index soared from 72 to 86 between June 2008 and October 2008, while gold and silver were systematically taken a lot lower. We know how that played. \\nSimilarly, the dollar has gone parabolic in the last week without any visible news or events that would have triggered this move. Too be sure, if Trump implements his borrow and spend program for infrastructure projects, the Fed will have to print a lot of money to monetize the avalanche of Treasury debt issuance, given that the rest of the world is now dumping their Treasuries. \\nBoth of those factors should be dollar-bearish and gold-bullish. In good time that’s how this will play out. \\nIn the latest episode of the Shadow of Truth, we discuss the extraordinary “backwardation” that has developed in the price of gold between the west and the east. We also discuss evidence of the ongoing collapse in the U.S. economy. Share this:'"}, "time": 1742562217.0925496}