{"duration": 0.2581007480621338, "input_args": {"text": "\"Aliens That Appear As Light — Beware of the False Light Archons Is there any connection between the alien abduction and the near-death experience phenomenon? Excerp... I found this gem in my paperback copy of hypnotist Edith Fiore’s book “ Encounters: A Psychologist Reveals Case Studies of Abduction By Extraterrestrials ”.One of her case studies, Sherry, was taken up into a craft in a beam of light and under hypnosis recalled: “It seems like I see a flash of light. I feel this pulsating pulling kind of sensation. I don’t see anything. It’s dark except for violet and gold light…. I keep on getting these feelings that I shouldn’t be saying anything.I feel like there’s some kind of block that I… I don’t know if it’s my own fear that I’m not going to remember or anything or… I feel real tense, real stiff. It seems like there’s some kind of form that seems to be mostly light. I feel kind of frightened… much taller than I am, maybe eight feet or so… Now I’m seeing something different. Seems almost like a… leathery, almost amphibian-type skin. It’s kind of greenish-yellowish and wrinkly large eyes, but they were ohhhh! [Grimaces] I really don’t want to remember. It’s pretty scary. The one thing that I do see is that the eyes are very caring and loving. And I really sense that they are… they really don’t want to scare and they worry about that. The caring is really evident in the eyes. [Pause] The face I saw is gone. It was more amphibian like than anything else… I feel like they’re… it’s like light, some kind of light that’s making me calm. It’s calming. It seems to be emanating from whoever’s around me. There seems to be a kind of merging of forms or something. It’s like seeing an aura around somebody. It’s not like seeing an actual form, and so the colors merge. But it’s mostly like gold. It’s not like I’m actually seeing anything, but I feel like I’m being operated on… I just get feelings of love… it seems like they only want me to remember them as light.”Val Valerian wrote this about the Greys being able to store energy:“The Greys are able to detect and perceive emotional responses from humans. Some of these responses (or the frequencies involved) the aliens find distasteful. In order to minimize their exposure to undesirable emotional wavelengths, the Greys will test humans and apply behavior modification techniques to block specific emotional states.Likewise, they will encourage emotional states in the child (and adult) that will result in emotional wavelengths that they can use. The Greys have the ability to “feed” on this energy. They have the ability to confine this emotional energy to containers that have internal fields that will “bottle” the energy, much like a magnetic bottle will hold a plasma.The effect of the use of this energy is like “vitamins” on the Greys. It gives them a boost in vitality.The Greys also have the ability to pickup and gather the energy emitted through the eyes (sometimes called eloptic energy, or biological energy). Proof of Alien abduction: Italian Woman Abduction Evidence and Grey Fetus Abortion The Grey uppermost in the group hierarchy always takes the position in front of the abductee in order to absorb this energy, which is upgraded in quantity and quality by induction of emotional processes in the human. This process is not done as often with children as with adults.”David Jacobs from his book “ Secret Life ” on alien mindscans:When an abductee asks, “What are you doing?” he may answer with a cryptic, “You know what we are doing.”When an abductee asks if they will ever stop doing this to her, the Taller Being might respond with, “You are very special to us” or, “This is very important and you are helping us.”At times the Taller Being will perform the physical exam himself, but Mindscan is the focus of his attention. Mindscan entails deep, penetrating staring into the abductee’s eyes. Abductees commonly feel that data of some sort is being extracted from their minds. We do not know what the information is, how it is extracted, or what the Beings do with it. One abductee thinks that they transfer it to other Beings’ minds...My eyes are open, but my mind is sort of gone. I have no will. I have no will. I am absorbed and I’m not fighting it. (Karen Morgan, 9, 1958) Some people say that they feel that the Taller Being is “stealing their memories.”Bonding During Mindscan, the Taller Being can elicit specific emotions in the abductee, such as fear and terror. Often he will create an instant rush of pleasurable emotions in the abductee that “bonds” her to him. As he stares deeply into her eyes, she may feel that the Taller Being is really a “good” individual. She wants to help him. She wants to be with him. She wants to give herself to the Beings’“program,” to help in any way she can. She does not want to leave. Sometimes there is a romantic and even sexual quality to these thoughts. Some women say that they “love” the Taller Being.Love. By love, do you mean directed toward him, or just sort of amorphous? It’s for everything. Are you looking into his eyes also? He makes me. So he looks into your eyes and you get this sort of rush of pleasurable feelings again? Yes. When you have this rush of pleasurable feelings, is there sort of a sexual component to this as well? Yes. Is it because of the situation of the vulnerability of it all, or… ? I think from what he’s projecting… . Bud Hopkins wrote about alien orchestrated love relationships in abductees:In a few cases, a bonding with an alien being or spirit guide progressed into a love obsession where it was discovered later that the spirit guide turned out to be an alien masquerading as the “lover”. Have you been abducted but don't remember? 72 Possible Signs of Alien Abduction Detalied by Abductees TRUMAN CASH In his revealing book “The Eye of Ra” the frequent alien abductee Truman Cash recalls through hypnosis many episodes from past lives. He writes:“When one engages in extensive past life therapy, one will uncover many different types of implant stations. These are spirit traps that are designed to trick a free being and then force the being into a body. The common denominator of these experiences is electronics. There are many different types of high-tech electronic methods to accomplish this; it appears that electromagnetics plays a key role in this process. What I find amazing is that beings without bodies can be effectively controlled with electronics…“For example, on December 3, 1995 I uncovered an incident that started out with me as a free being in space. I became interested in a very large, disk-shaped craft, so I entered it. I was then pushed by an electronic force field into a small confinement area near the edge of the inside of the craft. I was then “sucked” into a body via some type of electronic tractor beam. Then I was anchored in the body through a series of electronic wave pulses that felt like very intense electric shocks. It overwhelmed me and then just beat me into the head of this body.“12,389 years ago I was out in space-as a free being-and looking down at Earth. I didn’t notice that a very large, black, spherical implant station was approaching me, because my attention was focused on the planet. An invisible, electronic tractor beam locked onto me and began pulling me into a circular, concave structure on the implant station. The extreme power of this tractor beam overwhelmed me and made me feel awful. In spite of my abilities as a free being, I couldn’t fight free. I was pulled into the entrance, which was a tunnel in the center of the concave surface. I was then accelerated down this long, curved tunnel toward the LIGHT at the end of the tunnel. (My colloquialism for this type of implant station is a “soul sucker. “)“After being totally overwhelmed by this energy beam and pulled through this tunnel, I began to feel very lethargic. I then found myself in an implanting room, being compressed into a female body by a powerful, WHITE LIGHT energy beam that beat me into a body. This energy beam was so irritating that I felt like screaming. I began to try to fight back with the body. That’s when they knew that the implantation was finished–because I was using MY BODY to fight back.“Two tall insectoid beings that looked like praying mantises then escorted me to another part of the implant station. I was now in a very large, WHITE LIGHT room….12,389 years ago I was out in space-as a free being-and looking down at Earth. I didn’t notice that a very large, black, spherical implant station was approaching me, because my attention was focused on the planet. An invisible, electronic tractor beam locked onto me and began pulling me into a circular, concave structure on the implant station. The extreme power of this tractor beam overwhelmed me and made me feel awful. In spite of my abilities as a free being, I couldn’t fight free. I was pulled into the entrance, which was a tunnel in the center of the concave surface. I was then accelerated down this long, curved tunnel toward the LIGHT at the end of the tunnel.“Through telepathic hypnosis I hear a very soothing, hypnotic voice whispering in my head: “Sleep.Don’t worry. We’ll take care of you. Don’t remember. You have no past. You will not need to remember your past.Be here now. No more thoughts of the past. Forget the past. Move forward into a new life. You will begin a new life in the LIGHT. ”After I was thoroughly inculcated in this WHITE LIGHT amnesia room, two insectoids approached me and told me that I was ready to begin my new life.“This involves an alien, a bug-like one, a praying mantis-like alien. I have the impression of a voice, possibly programming. Something flashed in my head. I’m just going on impressions. I saw that foggy LIGHT. I hear a voice say ‘Go to the LIGHT, ‘ and I go to the LIGHT…..”Start at the beginning of this incident and see if you can pick up more details.”“I’m not going to the beginning-about the middle of the incident. The phrase “Go to the LIGHT. ”It’s an implant station. I see a big round sphere, like a space station maybe. ““What happens next? ”“The insect guy. I think right before that, I’m in an area that feels like a round room, and there’s this intense, WHITE, blinding LIGHT coming from the walls. ”(The room that I was in was a sphere with a diameter of about twelve feet. The walls of the inside of this sphere were radiating this bright, WHITE LIGHT force field.)“There’s a struggle to counteract the force of the LIGHT that’s 360 degrees (around me), that’s forcing me into this body. I feel it in my body-not just my head-in my torso. They’re not just compressing me into a head. Oh man, don’t go to the LIGHT……Down by my feet is a cocoon-shaped capsule. The conveyor slides me into it, and the top is put on. I’m shut in this capsule and shot onto this planet. I think it’s Earth. “……”Return to the beginning of the incident. ”“Okay. I’m going into a big, huge sphere, space station. I’m going through a tunnel of LIGHT. At the end of the tunnel is this room-and a body–with intense LIGHT& power that just presses and pushes on me, forces me into this body.I can feel the body now, as it (the force field) pushes me in. It’s caucasian, naked, male. ”[At this point I compare my present body and genitalia with the body that I’m being forced into in this incident.]“Then this vesica piscis thing opens up. I walk out a ways. It’s starting to make sense: It’s programming you to be an infant and go out the birth canal.”……”Why do you feel sad?”“Because they put me in a body. They tricked me. They put me in a capsule and shoot it out of the... uh, shoot it out to a planet...” Return to the beginning of the incident.”“I think the beginning is when I died. It’s a battle with swords. I think a sword goes right through me, in my abdomen. I hear this (‘Go to the LIGHT’) — I’m out of my body — I don’t know if somebody communicates this to me or what, but I’m going to the LIGHT, a tunnel of LIGHT, very fast. This LIGHT goes to this implant station that’s just huge. Reminds me of a small planet or moon. It’s just really huge. At the end of the tunnel of LIGHT in this room with glowing WHITE LIGHT, there’s a body in the middle of the room. The LIGHT just pushes me into the body... Don’t go to the LIGHT. I was right about that. That makes sense–the Serpent Staff group.The New Age LIGHT. It’s part of the trap. ”“… I died in 1945 and went up to the implant station. It seems I always report in to the same one. The tunnel of LIGHT. I went into the room where the people are milling around. 1 went into the back of the head of one of the people. I’m being programmed: ‘Be in the LIGHT. Always return to the LIGHT. Safe refuge. No fear. ‘I can see why people are drawn to it. It’s like taking a vacation, milling around in the WHITE LIGHT. There’s no pain there. You’re being programmed to be a sheep. You aren’t exposed to stuff. There are other parts of the ship where you are rammed into bodies with force beams.““I leave my body and pulled into a tunnel of LIGHT. It just pulls you like a force you can’t resist.”(It’s like a soul-sucking tractor beam.) “It just sucks you in. It’s almost the exact parallel to when I was first put in a body (12,389 years ago in the Atlantis incident where I was sacrificed.) There’s a sphere about twelve feet in diameter (the LIGHT at the end of the tunnel). The walls of this device are glowing with a WHITE LIGHT. There’s a male body in the middle of this sphere. I’m being squeezed into the body…”At first I thought they were LIGHT BEINGS. These are the praying mantis guys! They take me into the WHITE, misty LIGHT. I’m being programmed: ‘PEACE, REST-soothing whispering in my mind. The words: ‘GOD LOVES YOU. PEACE IN THE LIGHT. ‘ I’m being programmed that I’m with GOD now.‘ALWAYS RETURN TO THE LIGHT. ‘ I can see why people think going to the LIGHT is good, because it FEELS good. ‘I WILL BEGIN A NEW LIFE NOW. THE OLD IS PASSED AWAY. YOU’LL BE SAFE IN THE LIGHT. YOU CAN ALWAYS COME TO THE LIGHT. ‘You feel like you’re really loved, and you’re really special. ” (When I said ‘really loved’ and ‘really special, ‘I said it in a soothing, but sarcastic tone. Their programming is very sweet, but very insincere and phony. I have observed the same kind of syrupy sweet, deceitful rhetoric from the channeled Pleiadians.) “So I’m taken out (of the big WHITE LIGHT room). I get the impression that they are LIGHT BEINGS, but they’re not! ”“What is a LIGHT BEING?”“A body that is just LIGHT. But it’s not. They’re the insect guys.“It appears that electromagnetics plays a key role in this procedure. I suddenly realized that they were using the nervous system of the body-including the brain, of course-to implant beings into bodies. The nerves transmit electrical charges, which creates electromagnetic fields around the body. The chakras are simply nerve networks, which create electromagnetic fields.“Many people today are reporting near death experiences (NDEs) in which they travel swiftly through a tunnel toward the LIGHT. When they reach the LIGHT at the end of the tunnel they sometimes report seeing “beings of LIGHT. ”They sometimes believe they have traveled to some kind of spiritual realm. From my own experiences these “beings of LIGHT” were insectoids. They only “appeared” to be LIGHT beings, due to their uncanny ET ability to create illusions in the minds of abductees, whether out of body or in the body. This ability, as I have mentioned before, can be best described as “telepathic hypnosis; ” other researchers use the term “screen memories.”Grays also possess this incredible ability to manipulate people’s minds and emotions, and they often use this ability to create an illusion of benevolence and love.” Here's how to Escape 'Their' TRAP and Set Your Soul FREE Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742562177.591187}