{"duration": 0.09720325469970703, "input_args": {"text": "'RIO DE JANEIRO  —   The   who could pass as Barbara Bush’s kid sister waded through the stands at Olympic Stadium on Sunday night, trying to get close enough to congratulate the South African runner Wayde van Niekerk, who had just captured the gold medal in the 400 meters and broken one of the oldest world records in men’s track and field. The woman, Anna Sofia Botha, 74, said she kept getting turned away, even though her credentials were impeccable. With her white helmet hair and kindly air, event officials apparently did not believe that she was a coach of a   holder in one of track’s glamour events. “We really tried really hard to get on the track,” she said. By Monday afternoon, Botha had the keys to the city  —   or at least to the Olympic Village  —   once word had spread that a most unlikely coach had helped propel van Niekerk to gold. Standing in the plaza, surrounded by reporters while van Niekerk conducted interviews a few yards away, she seemed perplexed that people were suddenly seeking her out for interviews. “The whole coaching scenario is an everyday way of life for me,” she said. “It’s nothing new, nothing out of the ordinary. ” Botha’s profile was measurably lower on Sunday night. Describing her attempts to see van Niekerk after his race, she said, “At every entrance there was security and they just wouldn’t let me go through. ” Finally, Botha said, members of Team South Africa interceded. With their help, she was able to see van Niekerk, whom she has coached for four years, over an hour after he had broken the American Michael Johnson’s 1999 world record of 43. 18 with a 43. 03 clocking. Tears were shed, she said. “We just hugged each other,” Botha said. “It wasn’t necessary to say anything. We knew in our hearts and in our minds what we thought and what we had achieved. ” Before the night was over, another of Bloemfontein’s athletes, Akani Simbine, had finished fifth in the 100 meters. A day later, Botha said, “I’m still struggling to let it sink in. It’s so unreal and unbelievable. ” This is Botha’s first Olympics. She competed  —   without distinction, she said  —   in the sprints and the long jump when she was young and began coaching in 1968 while living in her native Namibia, then a territory under the rule of South Africa. Her first athletes were her son and daughter, but when they reached a certain level, she passed them off to other coaches, she said, “because I feel that’s not always a good thing as a parent to coach your own children. ” The woman who didn’t believe it prudent to coach her own children has earned the trust of her athletes by treating them as family. “She doesn’t see us as athletes or as people she sees us as her children,” said van Niekerk, who asked Botha in late 2012 if he could train under her at the University of the Free State, where she has been the head track and field coach since 1990. The previous year, an    van Niekerk had won the 200 meters at the South African Athletics Championships with a personal best of 20. 57 seconds. “I was very excited but also humbled and also a little worried,” Botha said, “because I knew this is   athlete and there will be a really big responsibility on me to coach him and to bring him along. ” Van Niekerk’s favorite event is the 200 meters, but the explosiveness required in the long sprints was hard on his body. He was often injured, and so Botha encouraged him to switch his focus to the 400 meters, reasoning that he could still take advantage of his sprinting abilities but with less wear and tear on his body. In 2015, van Niekerk won the world championship title in the 400, validating Botha’s hunch. “When I tell him you have to do this and this and this, he never complains, never,” she said. “Sometimes he really suffers, then he tells me, ‘I know what our dreams and goals are and I will do what you tell me to do. ’” Her athletes describe her as a benevolent disciplinarian. “When I first met her I was scared of her,” Simbine said. When his words were relayed to her, Botha broke out in a laugh so infectious it could draw a solitary aardvark out of its burrow. “I’m really strict in my coaching,” she said. “I expect the moment that we start with training I want the focus and the dedication on the training. ” Van Niekerk, 24, described Botha as “an amazing woman. ” He expressed gratitude for the discipline she has instilled in him. He offered an example that could have been uttered by a Giants football player during the Tom Coughlin regime. “She’s got a thing where if we’re five minutes early we’re late,” van Niekerk said. Botha appeared for her interview several minutes before the arranged time. She took it in stride when a male reporter asked her if she is always, or only sometimes, coaching van Niekerk. “It’s very important for me to be there every day with Wayde or any of my other athletes to see every day if there is a problem,” she said, adding, “I have to read my athlete. I have to read his mind and read his body and listen to what his body tells me. I think I have the ability to know my athlete inside out. ” She took it in stride when another male reporter asked her if she knew what van Niekerk’s splits were in his   race. It was like asking a carpenter if he knew the measurements for the table he had just carved out of pine wood. “At 300 meters,” she said, “he was faster than what we had planned for. ” Van Niekerk won the race from Lane 8, considered a disadvantageous position. Botha said it didn’t bother her that he was in an outside lane. “Because every lane is the same distance,” she said. What did she say to van Niekerk before the race? “We didn’t really talk,” she said, adding, “The more empty the mind is the more focused he is on what he has to do. ” Botha said she has other talented athletes in her training group. “Oh, yes,” she said. “I have two girls and another boy. ” She will turn 75 later this year, but has no plans to slow down. “I still love coaching and I still love my athletes,” Botha said, “so I can’t see a reason why I would go and sit down and play with my fingers. That’s not in my nature. ”'"}, "time": 1742562713.209332}