{"duration": 0.04155111312866211, "input_args": {"text": "'George Orwell’s classic book “1984,” about a dystopian future where critical thought is suppressed under a totalitarian regime, has seen a surge in sales this month, rising to the top of the Amazon   list in the United States and leading its publisher to have tens of thousands of new copies printed. Craig Burke, the publicity director at Penguin USA, said that the publisher had ordered 75, 000 new copies of the book this week and that it was considering another reprint. “We’ve seen a big bump in sales,” Mr. Burke said. He added that the rise “started over the weekend and hit hyperactive” on Tuesday and Wednesday morning. Since Friday, the book has reached a 9, 500 percent increase in sales, he said. He said demand began to lift on Sunday, shortly after the interview Kellyanne Conway, an adviser to Donald J. Trump, gave on “Meet the Press. ” In defending a false claim by the White House press secretary, Sean Spicer, that Mr. Trump had attracted the “largest audience ever to witness an inauguration,” Ms. Conway used a turn of phrase that struck some observers as similar to the dystopian world of “1984. ” When asked on NBC’s “Meet the Press” why Mr. Spicer had said something that was provably false, Ms. Conway replied airily, “Don’t be so dramatic. ” Mr. Spicer, she said, “gave alternative facts. ” In the novel, the term “newspeak” refers to language in which independent thought, or “unorthodox” political ideas, have been eliminated. “Doublethink” is defined as “reality control. ” On social media and elsewhere on Sunday, the book’s readers made a connection between Ms. Conway’s comments and Orwell’s language, and the attention on the book “kind of took a life of its own,” Mr. Burke said. The dictionary publisher   described the interview as “fraught with epistemological tension. ” The dictionary also reported that searches for the word “fact” spiked after Ms. Conway’s comments, and then, as an apparent reminder, tweeted the dictionary’s definition. Even outside the United States, interest in “1984” has grown. So far this year, sales have risen by 20 percent in Britain and Australia compared to the same period a year ago, according to Jess Harrison, a   editor at Penguin Books. The novel is usually a   she said, and it sold 100, 000 copies last year in   countries outside the United States and Canada. “But we’ve definitely seen an uplift” in sales, she added. Dystopian novels are “chiming with people,” Ms. Harrison said, adding that “The Man in the High Castle” by Philip K. Dick, an alternative history in which the Nazis defeated America to win World War II, is also selling well. A television series based on Mr. Dick’s novel is now in its second season at Amazon. Penguin also published Sinclair Lewis’s “It Can’t Happen Here,” about the rise of a demagogue, last Friday in Britain for the first time since 1935, “and we’re already on to our third printing,” Mr. Burke said. On Wednesday, that book was also ranking among Amazon’s best sellers, as was Aldous Huxley’s “Brave New World,” another dystopian classic. Prof. Stefan Collini, a professor of intellectual history and an expert on Orwell at the University of Cambridge, said that readers see a natural parallel between the book and the way Mr. Trump and his staff have distorted facts. “Everyone remembers ‘1984’ as containing various parodies of official distortions,” he said. “That kind of unreality that is propagated as reality is what people feel reminded of, and that’s why they keep coming back. ”'"}, "time": 1742564300.2426116}