{"duration": 0.05051779747009277, "input_args": {"text": "'Former Breitbart Senior Editor Milo Yiannopoulos declared that he would “make sure” UC Berkeley would “become the free speech capital of the United States once again” in response to the cancellation of Ann Coulter’s event on campus. [“Awful to see my friend Ann Coulter forced to cancel her speech,” wrote Milo on his official Facebook page. “I don’t understand why Young America’s Foundation would capitulate so close to victory. Ann can hardly be expected to show up without insurance, security or a venue, so I completely understand why she had to cancel. She is Ann Coulter, after all. ”  “My proposed Free Speech Week will proceed as planned later this year,” he continued, before adding, “I WILL BRING AN ARMY IF I HAVE TO. ” “We will ensure that Ann and others can speak and we will publicly, ritually humiliate UC Berkeley for its failure to meet its legal obligations until conservative speakers no longer fear violent mobs just for exercising their First Amendment rights,” Milo concluded. “Berkeley is going to become the free speech capital of the United States once again. I will make sure of it. ” Like Coulter, Milo’s event at UC Berkeley earlier this year was derailed after a mob of violent   activists set fires, smashed windows, and assaulted attendees who were supposed to see him speak. Young America’s Foundation pulled out of the Ann Coulter event on Tuesday, blaming the college’s hostile environment towards conservatives. However, YAF and the UC Berkeley College Republicans are still in the process of suing the college, claiming that administrators put several limiting restrictions on the event in an effort to get it cancelled. The groups and their attorney Harmeet Dhillon referenced previous events featuring conservative speakers at the college which also faced similar scrutiny and restrictions, including Milo’s as well as conservative commentator David Horowitz. During a press conference about the lawsuit on Monday, Dhillon branded UC Berkeley’s policies on “acceptable speech” as “infinitely malleable” before criticizing the Mayor of Berkeley, Jesse Arreguin, for appearing to sympathize with, be friendly to, and act softly on the   rioters who shut down Yiannopoulos’ event earlier this year. “If the Mayor of Berkeley cannot maintain control of his city, the Governor should call the National Guard, because that’s a serious public health issue,” Dhillon proclaimed. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563363.10599}