{"duration": 0.05811882019042969, "input_args": {"text": "'March 4 (UPI)  —   A    Canadian boy’s bowling team was stripped of its   trophy after tournament organizers disqualified them because his pants didn’t meet the event’s dress code. [Grayson Powell had just bowled the three best games of his life  —   a top game of 171 pins  —   leading his   team to victory in the St. John’s, Newfoundland provincial tournament when the event’s organizer informed his parents the team had been disqualified.  The reason? Powell’s faded gray jeans did not meet the requirement for all participants to wear black pants, the tournament’s organizer and Youth Bowl Canada provincial director Gordon Davis said. Powell’s parents were outraged, the CBC reported. “Parents ruin it for kids,” Grayson’s father Todd Powell said. “If this is what sport is about when it comes to kids   …     shame on them. ” Child stripped of bowling medal after pants found not to be black enough https:  .  @AnthonyGermain @KrissyHolmes pic. twitter.   —   SJ Morning Show (@sjmorningshow) March 1, 2017,  Powell specifically questioned why they weren’t told before the event began that the jeans weren’t black enough to meet the dress code. Another team member’s pants were also deemed inappropriate. The Powells speculated the reason for the disqualification wasn’t merely a dispute over the color of their son’s pants. Powell’s team was on foreign turf, visiting Davis’ home alley, where several teams in the tournament regularly play. As a result of the disqualification, two teams from that alley who had finished second and third were bumped up to first and second. In a lengthy post on Facebook, Davis defended the organization’s decision. He said he was not aware of the child’s attire before the match started and didn’t want to provide further embarrassment by halting the match after it had already begun to announce the decision. Davis said tournament officials were approached by parents of children on other teams who said it wasn’t fair that some children were being allowed to wear jeans while their kids had to wear dress pants. Davis said he told Powell’s coach about the dress code violation while play was happening and said the coach could have made the decision to withdraw and spare the children the ordeal. “Mr. Todd Powell knew full aware [sic] of the dress code and sent his child to Provincials knowing that it was against the rules. There was another bowler on the team also with grey pants on who knew it was against our rules but sent their child anyway! What parent would do this? Was it to see if we would notice it or get away with it? Who knows but they knew it was against our rules,” the group wrote. “During the first game in the latter frames a coach and several parents brought it to my attention and complained that a team had players wearing faded jeans and grey pants. They asked why their players could not wear jeans and other pants too.   …     I was not going to embarrass those kids by stopping play and making a scene. The [coach] should have taken her parents aside and explained to them after she had our ruling about the disqualification. ” The post demanded the Powells apologize for publicly criticizing the volunteers who ran the tournament. Facebook users did not share the sentiment. The comment section of the post includes hundreds of angry responses, demanding Powell’s team be named the winners and given the award.'"}, "time": 1742562305.0960512}