{"duration": 0.04104757308959961, "input_args": {"text": "'Alternative News Thousands of Wild Bison Appear At Standing Rock Out Of Nowhere! A Sign From Mother Earth? \\nFor those of you who may not know, the largest Native American protest in HISTORY is happening right now . Over 500 Native American tribes from all over North, Central, and South America as well as Canada, all uniting under one cause: Protection of our water from greedy corporate interests. \\nIt certainly hasn’t been easy. Just this week alone hundreds of innocent people have been assaulted and arrested just for occupying the land the corporation behind the Dakota Access Pipeline stole using imminent domain. \\nIts been a major struggle for our water protectors. Not just because of the rampant violence they’ve had to face from police hired by the pipeline builders, but also because they are literally living in a camp set up in a field right now. Do you have any idea how cold it’s already getting there and it’s not even winter yet? TOO COLD. \\nThey’ve certainly been needing a pick-me-up.. And they just got one! (Video at the bottom of this article) \\nAccording to White Wolf Pack , a Native American website: \\n“The great bison or buffalo of North America is a very powerful symbol to American Indians. Though best suited to cooler climates, bison roamed virtually in entire continent. \\nThe smaller woodlands bison and its bigger cousin, the plains bison were revered and honored in ceremony and everyday life. To the plains Indian, our Bison Brother meant sacred life and the abundance of the Creator’s blessing on Mother Earth. \\nThe bison is powerful medicine that is a symbol of sacrifice and service to the community. The bison people agreed to give their lives so the American Indian could have food, shelter and clothing. \\nThe bison is also a symbol of gratitude and honor as it is happy to accept its meager existence as it stands proud against the winds of adversity. \\nThe bison represents abundance of the Creator’s bounty and respect for all creation knowing that all things are sacred.” The chairman of the Standing Rock Sioux Tribe criticized law enforcement’s “militarized” response to the camp and called for demonstrations to remain peaceful, but stressed that activists would not give up their cause. \\n“Militarized law enforcement agencies moved in on water protectors with tanks and riot gear today. We continue to pray for peace,” Dave Archambault II said in a statement Thursday evening. \\n“We won’t step down from this fight,” he added. “As peoples of this earth, we all need water. This is about our water, our rights, and our dignity as human beings.”” \\n'"}, "time": 1742563011.1997387}