{"duration": 0.21404123306274414, "input_args": {"text": "'Blair Rollin: Nice quote from The China Study. I had forgotten about that. Thanks! vegPat \\n“It’s the sunshine vitamin. Dr. McDougall, for example, does not recommend D supplements but rather fresh air and sunshine.” if you live in Florida or the tropics maybe and also not everyone can absorb vitamin D through this process so they may have a hard time getting there levels from the sun alone, its kind of like omega 3 from plant sources, yes its there but not readily available and some people cant’ absorb it efficiently, which is why you need a marine algae oil that can be easily absorbed Vege-tater \\nI heard it said that if plants and trees can photosynthesize at your latitude, generally we should be able to get enough sunshine for our less intensive human needs, provided we make an effort to actually go outside and soak up the rays. I’m originally from CT and always wondered if part of the sickly and depressive effect of winter was our tendency to “hibernate” and not go outside until you had to. When my kids were little and I was outside all winter with them sledding and playing in the snow, it wasn’t a problem, until they were old enough to go themselves, and I hung back in the dry warmth! (Now I live in FL and stay inside all summer instead! lol) Ben \\nHi Blair. I am familiar with Dr. McDougall’s opinion. Living a bit north of him I am not confident we share the same levels of sunshine opportunity. As for B12, I have never washed my organic produce, and we grow a lot of our own veggies. Our soil is fabulous. The “sanitation” hypothesis has not worked for me. And it does not explain higher b12 levels in some people eating from these poor soils. So, it’s probably a little more complicated. And, considering the risks of not supplementing, only a fool wouldn’t get tested. Our family does supplement with B12 and it did work to correct our deficiencies. So, that’s an example where a singular nutrient did work out for the body. Many people also report success with vit D and dha supplementation. Dr. Gregor is an advocate of these practices. In my mind, he needs to have his crew tackle the conflict between on the one hand steering people away from vitamin supplementation and on the other advocating vitamin/nutrient supplementation. I assume he would say something like “Hey, if after switching over to the best diet on the planet, you discover you are lacking in some essential nutrients… rather than eat animal products (which historically have provided these nutrients to humans) because our environment is so toxic, the cruelty to the animals so extreme and the long term damage done to your body… find a good provider of the micronutrients from a wholesome source. Accept the world as imperfect.” vegPat \\nthere is no real inconsistency Dr Greger’s book lists it out How not to Die recommends the following supplements B12 (soil no longer has it, yes you can grow in healthy soil but average person needs to supplement it) Vitamin D (because a lot of people live in northern regions and darker skin blocks good conversion) Omega 3 algae oil (plants have omega 3 but is not readily absorbed and as you get older this gets worse) WFPBRunner \\nHi Ben If you watch some of the videos under the nutrients you list you will see that non-vegans are deficient also. For example my husband rides his bike out doors 3 hours per day, eats some meat and tested below 20 for Vit D. B-12 is just so important for obvious possible neurological issues. We could always drink swamp water though. Ben \\nI agree. My question is about the necessity of supplementing. My question pertains to how are Dr. Greger’s recommendations to supplement (as outlined in his book) reconciled with a video like this one making the case that supplements do not work, and sometimes cause harm. WFPBRunner \\nHe is pretty specific. B12 is the big one. Vit D if you live too far North or work in an office all day. Omega 3 but I believe that was across the board. WFPB or not until we know differently for brain health. Blair Rollin \\nThese popups keep getting better and better. Vege-tater \\nI find it so amusing to read the oppositional commentary about them! Maybe I’m just old and cranky but people seem to be getting more and more entitled, and think each video is for them exclusively. I just love what Dr. G. does, and that he does it at all, for US and our benefit, from his generosity and caring! You can never please everyone, so I hope he continues to let his light shine as he sees fit and let it sort itself out. Life is full of angst and seriousness, we need all the humor we can get! Ron Ninon \\nIt’s somewhat supercillious to “be amused” by all the people’s comments and efforts to express their discontent, such as I am doing now in an attempt to contribute positive constructive criticism,. The fact is, for many, the “light-hearted” new format has been stated as being downright distracting and works against the intention of the video which is, surely, to educate and inform, NOT to entertain or promote some kind of clever food comedy. The new format pop-up segments can also come across as sarcastic and aloof and so the video is not worth sharing with the many who are already skeptical as it will really put them off. Even fans on here are put off! If the efficiency of transmission of information is interrupted with completely irrelevant bells and whistles doing little other than exhibiting technical prowess with video editing skills and that causes distraction, memory interference and forgetting, and for some, irritation, then that is a fact that needs considered very carefully. A handfull have said they like the format but more have said they do not. An online vote might be useful. But I would question what it is that those who like the format like and whether they have absorbed the info as well as they would have without the memory interference. There are real cognitive mechanisms at work. Just my 2500 cents worth. guest \\nI find some people’s repetitive complaints to be a needless distraction. The videos are prerecorded… after this, normal programming will resume. Ron Ninon \\nTypical anonymous trollololololol. Ron Ninon \\nYou delete my response to this but let the guest’s sarcasm remain?? Just who is guest?! Thea \\nRon Ninon: I have previously directed you to the rules for posting on this site. If you read those rules, you would know that you may not call people names. To be very specific: You may not call someone a troll. I can tell who guest is and this person has made many quality comments on this site. Leave the moderating to the moderators. . Also, I have already warned you about your comments in general. Your opinion on this topic has been noted – multiple times over. No one else is going on and on and on about this topic. Enough already. The decision has been made to discontinue the popups after the current volume of videos has been released. Additional complaints from people who have already voiced their opinion take away from the main focus we should have here. Let it go please. Ron Ninon \\nYour vendetta continues? First, Dr. Greger invited commentary. Until he himself posts a comment on this and his intentions, and his requests to stop commenting on it, then everyone, including me, has a right to comment on it. You have tried to intimidate me before (to see guidelines etc etc), and you continue to do so. You criticise me ALONE. I am NOT the only one who has criticized the format – and several others have repeated their sentiments across multiple posts on the topic but you do not slap them! This is social media and heavy-handed tactics by admin, although typical of facebook, should not be here. This is a more “professional” forum, at least I had thought. To that extent, your threats are unwelcome: you are targetting me and only me. I repeat, this is unfair! Your support of others who may disagree with me with your “votes up” of them belies a pack mentality – a popularity contest. This forum should not support such bias! I have made detailed and informed copmments. I work in the area of attention and perception…and distraction. Over 50% of drivers now text and drive – an epidemic of deadly distracted driving – many – half or more on this forum will do so while thinking they are just fine and so continue to do so. My point: I have knowledge on human attention. Nobody else has posted the reasons why they feel distracted by the videos. I have done so. If you don’t like my “info”, ignore it – it’s easy to do and easier than ignoring a pop-up! But to delete me or block me is a sad reflection of biased intolerance. I have done more for promoting Dr G’s videos than you will ever know or could ever comprehend. I am a supporter. I also use his info for personal health purposes. But I have a right to emphasize what (I think) needs emphasized (ie, no distractions, keep it professional, etc.). And we do NOT know what his new format, if it comes, will be. Will it also be controversial and problematic. Thus, repetition has value, provided it is not cut-and-paste, and my comments have not been repetitious in their content, if you bothered to read them carefully. I will continue to post if and when I feel it contributes. You must stop intimidating me. This is NF not FB. nc54 \\nBut in this video the popup was not irrelevant. It gave an example of how to create food synergy. So you are wrong about this video. Ron Ninon \\n“doing little other than…”. nc54, Fair comment, but…I still found it distracting as did some others who bothered to vote with a comment. Why do I need to watch a guy eating? Look, many will like it, many won’t. Would a vote help? The majority is not always correct! Guest \\nPlease stop the goofy dr greger popups….really distracts from the video content. I have enjoyed the videos and information for years, but really find the new popups jarring. Thea \\nGuest: Have no fears. The large majority of the feedback for the popups has been negative. The NutritionFacts team listened to the feedback. The rest of the videos on this volume are already pre-recorded. But after that, the popups (whew!) will no longer be part of the video. \\nWhat a coincidence…I just had blueberries and black beans for lunch! Don Bauer \\nAny benefits to adding Maca powder to a smoothie? Vege-tater \\nEvery home I visit has rows and rows of supplements and vitamins lining their counters and cabinets, and of course they all eat the Standard American Diet, and know they are deficient, so think this is their saving grace! Heaven forbid a bit of real food sneaks into their diet, let alone a combination! It’s so scary what people consider food, and sadly, I was once one of them, so it’s really hard to shut my big mouth when I know what a HUGE difference it can make! WFPBRunner \\nIt’s sad right. They think it works. Wade Patton \\nOkay, I lied. I cannot just quit the site because there are VERY few other sources I trust to keep abreast of new research and studies AND to do such in a non-commercial (i.e. believable) manner. \\nI tried five times to listen to today’s “lecture”, but kept distracting myself. I hide the video behind other tabs now-of course I can still hear the “spots”. \\nNow i have a solution. I’ll simply read transcripts. Thanks to those who transcribe. \\nAfter seeing practically every single video Dr. G has made for NF.O and most of the other videos he has been in on Youtube, I don’t need any “extra” Dr. G in my videos. I liked the first 1,000 or 2,000 videos, but just can’t watch them any more. \\nI hate that I cannot share the new videos. There are so many “nut jobs” out there selling ideas about foods and supplements and nutritional concepts that I fear Michael Greger would EASILY get lumped into that category if I shared the greenscreened videos. I had some hopes that I could help a few folks, friends, family, and others find a better way to eat, and was persistently pestering my FBF’s with video links from here with my own commentary, also some comments from here were shared in my short tenure as a WFPB eater. \\nI’ll just cut and paste transcripts. I don’t want anyone thinking I’m “following a nut job”, rather that Dr. G is a real MD with real information that can REALLY help nearly everyone. I understand that many folks enjoy the cutesiness and such, but it cheapens the whole experience for me. I’m not a fan of gimmickery and distractions. As you were. Thea \\nWade Patton: I hear you. The NutritionFacts team heard you too. The rest of the videos in this volume are pre-recorded and already have the popups. That will not change. However, after that, the new videos will not have the popups. Thank you for your patience. Wade Patton \\nThanks for letting me/us know. I had no idea how many vids he made per session. Endeavor to persevere I might. WFPBRunner \\nWade you quit? Dang I wasn’t aware. So yes Dr. Greger got the message but as you know they are made ahead of time. So be patient! I actually like reading the transcripts. Ron Ninon'"}, "time": 1742562080.7578588}