{"duration": 0.06353425979614258, "input_args": {"text": "'On a recent Southwest Airlines flight from Baltimore, Shvilla Rasheem arrived in Indianapolis, but her luggage did not. Ms. Rasheem, a    consultant, said she always checks her bag when flying on Southwest because there is no fee. “I never thought of the possibility that I would not get my luggage,” she said. She had good reason not to worry. Statistics compiled by Sita, an aviation technology company, show a steadily decreasing likelihood of bags going astray. Last year had the lowest rate of wayward luggage  —   6. 5 bags per 1, 000  —   in the dozen years Sita has been keeping track. Various advances in technology and   procedures deserve credit, including improvements over the years in the   tags and optical scanners that have long been in use for identifying and sorting checked luggage. But   systems have their limits, and the airline industry has been slow to adopt methods used by other industries that need to track items through the shipping process. Where   tags fall short is if the tag is wrinkled, smudged or torn, or not in line of sight of the scanner. If the tag is not readable, the bag can get lost without being noticed  —   which could be why no one was aware that Ms. Rasheem’s bag did not get loaded onto her flight. Bar code readers have a “read rate” of 80 to 95 percent of baggage tags, according to Nick Gates, a director at Sita responsible for baggage technology. “If you can improve the read rate of bag tags,” Mr. Gates said, “there is less chance the bag will be delayed as it moves through the airport. ” That is why the airline industry and some airport managers are intent on improving the tracking rate by looking beyond the    baggage bar code. They are adopting tags that do not need to be seen to be read. Delta Air Lines has installed a system using   tags that also have an embedded radio frequency identification, or R. F. I. D. chip. Such chips can store travel information and need to be only close to radio scanners along the way for the bag’s progress to be recorded. As with Delta’s older barcode tags, fliers will be able to use the airline’s travel app to keep track of their bags. “This is the next step in reliability,” said Rodney Brooks, general manager of airport operations at Delta. Air France, the German airline Lufthansa and Qantas of Australia are among those that have experimented with radio chip luggage tags. But adoption has lagged at airlines in the United States  —   which could change, with Delta’s decision. The airline is spending $50 million on the necessary scanners, printers and radio tags, which also use bar codes and look little different from conventional   tags. The system is now in place at all of the 344 airports into which Delta flies and is expected to be operational by the end of this month. Though still fairly novel in airline applications, R. F. I. D. technology is hardly new. It has been used for decades to keep track of shipments of merchandise, which is why many people wonder why it has not already been adopted by airlines, said Ryan Ghee, editor of FutureTravelExperience. com. “Look at online retailing like Amazon and the logistics industry,” Mr. Ghee said. “People ordered something and could have it delivered immediately to where they wanted it to go. Every step on the journey they could see, ‘Where is my parcel?’ People got used to that. ” Widespread adoption of radio chip tags in the air travel industry has not been easy to achieve, despite the efforts of the International Air Transport Association, a trade group. It has set a deadline of summer 2018 when all 265 member airlines should be able to track and fully trace bags  —   not only on their own flights, but also when passengers connect to other carriers. “It won’t matter what technology they choose,” said Nick Careen, an executive with the association, as long as bags can be tracked once they leave the traveler’s hands and traced if they are missing. Airline bag tracking is difficult for a number of reasons. Updating to the latest technology requires infrastructure changes that can be expensive and disruptive. And because most airports leave it to each airline to handle its own   system, the technology and procedures vary widely. McCarran International Airport in Las Vegas is an exception, having decided as part of a renovation in 2005 to become fully capable of incorporating radio chips into the   and sorting system, which the airport runs. The radio chips embedded in the paper tags being used in Las Vegas ensure that checked suitcases move more quickly and accurately through the system and increase the likelihood that the bags make it onto the right airplanes. “R. F. I. D. runs for us day in and day out very, very accurately  —   99. 5 percent accuracy,” said Samuel G. Ingalls, the airport’s assistant director of information systems. The airport has handled 160 million   bags in the last 10 years. There are many ways airlines and airports can use radio chips. In 2010, when Qantas became one of the first airlines to start using the technology, it sold a hard plastic reusable baggage tag for $60. A spokesman said 1. 5 million tags were in circulation. Customers “like the speed of checking in and the sense of control and recognition that comes with having their own permanent tag,” said Phil Capps, Qantas’s head of product and service development. Delta’s   paper tags, like the ones in at McCarran, are much cheaper, at just pennies apiece. Accurate bag handling can save an airline the size of Delta a lot of money. Last year, it mishandled about 276, 000 of the 120 million passenger bags it transported, according to statistics that it reported to the Department of Transportation. While that misfire rate  —   0. 23 percent  —   is well below the international average of 0. 65 percent for mishandled bags, it still adds up to a lot of unhappy customers. Even one passenger’s bad experience can become a big embarrassment for an airline, given the effect of social media. During the day Ms. Rasheem was separated from her bag, which contained notes for a presentation she was to give, she tweeted her frustration  —   not just to Southwest but also to her 1, 500 followers on Twitter. Ms. Rasheem’s notes and clothes arrived before her conference began, with no explanation about what had happened. Southwest said it was still exploring what bag handling options it will use to meet the new target of the International Air Transport Association. While the airlines work toward a tracking standard, various vendors have rushed in with disparate versions of bags, tags and apps  —   some working in partnership with airlines. Rimowa, a German maker of luxe luggage, has an   bar code and radio chip permanently affixed to the suitcases it sells. Passengers using the bags on Lufthansa flights can speed through  . “Whenever you come with such a bag already tagged, you can place it on the bag drop belt and it will be checked automatically,” said Björn Becker, a senior director at Lufthansa who oversees ground and digital services. Whatever approach the airlines take, Mr. Careen of the air transport association echoes the sentiments of travelers like Ms. Rasheem when he says fliers should “know at all times where their bag is. ”'"}, "time": 1742628439.74767}