{"duration": 0.08912777900695801, "input_args": {"text": "'Friday, 4 November 2016 Brad, sticking it to the Ruskies \\nThe 2016 presidential election has been full of talk about Russian involvement. WikiLeaks released repeated batches of emails related to the Democratic Party. U.S. intelligence agencies traced the leaks to Russian hackers sanctioned by the Russian government. \\nWhile no evidence emerged showing Russian hackers able to directly meddle with voting, hackers have been found to be electronically \"sniffing\" around election databases in multiple states. Experts speculate Russia may be planning something disruptive related to the election itself. \\nThis activity has left the public on edge about Russia and what its intentions are. Well, American citizens can rest easy on at least one front. \\nMoscow had one plan to reduce voter turnout on Tuesday, November 8th that backfired biggly. It seems to be getting MORE people out to vote. \\nIntelligence agencies recently found evidence of an extensive subliminal message campaign. Cleverly hidden in the background of internet memes about funny cats and fast food tray liners have been messages encouraging people not to vote. \\nThe hidden phrases include \"Vote nyet,\"\"Don\\'t vote,\"\"No Vote,\" and \"Vote no mas.\" \\nThe operation produced the opposite result. \\nUnder anonymity an U.S. agent explained, \"We are seeing unusually large turnout in all populations targeted by this campaign.\" \\n\"We have two main theories to explain this. \\nOne, those reading the message don\\'t register the negative in the statement and keep seeing the word \"Vote\". Kind of like ordering someone to not think of an elephant, and then all they can do is think of elephants. \\nThe second theory is that the Russians totally misread American culture. Americans harbor a deeply ingrained reaction against being told what to do. No American wants to be bullied into anything. \\nAs a result, the Russians are getting exactly what they didn\\'t want, people are actually getting themselves to the polls in record numbers.\" \\nWhen Brad Johnson, one of the many who found himself inexplicably voting early, heard all of this he said, \\n\"Well, heck, that makes me sort of proud. I was just sticking it to the Ruskies.\" Make pinkwalrus\\'s  '"}, "time": 1742564045.9958236}