{"duration": 0.10231447219848633, "input_args": {"text": "'Gardasil Vaccine Given without Consent and Ruins Life of 14 Year Old Girl Savannah with her mother Sarah Snyder. \\nHealth Impact News \\nThe VAXXED film crew continues interviewing people who are vaccine damaged around the country. \\nIn this interview in Nebraska, 14 year old Savannah Snyder is interviewed along with her mother Sarah. \\nSavannah talks about her experiences in receiving her 7th grade required vaccines. Her mother Sarah explains that she only gave permission for Savannah to receive the required vaccines. Gardasil, the HPV vaccine, is an optional vaccine. Sarah explains that she had been warned about this vaccine and wanted to investigate it further. \\nYou believe your doctor. Every parent believes their doctor. We’re all trying to do the right thing. \\nBut Savannah was given the Gardasil vaccine anyway, without their original knowledge. She immediately started suffering some side effects, such as a headache, almost fainting, and skin rashes breaking out. She soon developed pneumonia and other infections. \\nAs time went on, things got worse. She started experiencing seizures, including grand mal seizures. She was hospitalized many times for severe pain. Her mother tearfully explains that Savannah would wake up in the middle of the night and state that she was dying. \\nLike many other parents of children with Gardasil injuries, Sarah relates how they had little support, and that most people just thought it was all in Savannah’s head. \\nBut after a trip to the Mayo clinic, Savannah was diagnosed with POTS (postural orthostatic tachycardia syndrome), a known side effect of Gardasil that affects the heart. (See: Cardiologist Comments on New Study Linking HPV Vaccines to POTS ) \\nSavannah explains that before the Gardasil shot, she was very active and athletic. She was in the process of joining a gym. Now, she has difficulties speaking and walking, and needs a feeding tube. \\nComment on this article at VaccineImpact.com. \\nWatch the entire interview: More information about Gardasil Leaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people. In this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine. FREE Shipping Available! Order here . Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? eBook – Available for immediate download. \\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.” \\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines. \\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary. \\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field. \\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual. \\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot. \\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions. \\nIn this eBook, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe. Read : Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? on your mobile device!'"}, "time": 1742564502.6002972}