{"duration": 0.12696504592895508, "input_args": {"text": "\"— Susan? (@GaetaSusan) October 27, 2016 WikiLeaks: Former State Dept. Official Coordinated with Team Clinton on Uranium One Scandal Pushback One month before former State Department official Jose Fernandez defended then-Secretary of State Hillary Clinton’s decision to sign off on the transfer of 20 percent of U.S. uranium to Russia, Fernandez told John Podesta that he was eager to “do all I can to support Secretary Clinton,” according to purported emails uncovered by WikiLeaks. On March 30, 2015 — weeks before the explosive book Clinton Cash was released, and nearly a month before the New York Times published a 4,000 word story detailing the Uranium One transaction that multiple donors to the Clinton Foundation made millions from — Jose Fernandez wrote an email to Podesta in hopes that the pair could meet. \\nOn April 17, Fernandez writes to Podesta, again, thanking him for their meeting and said, “I would like to do all I can to support Secretary Clinton, and would welcome your advice and help in steering me to the right persons in the campaign.” \\nhttp://www.breitbart.com/big-government/2016/10/26/wikileaks-former-state-dept-official-coordinated-with-team-clinton-on-uranium-one-scandal-pushback/ If The Media Investigated Hillary Like They Did Watergate, We Wouldn’t Need WikiLeaks Today, mainstream publications have become willing accomplices in suppressing the same type of information they worked so tenaciously to expose all those years ago. \\nIt has now been more than four decades since the Washington Post and New York Times led the charge to bring down Richard Nixon and his administration’s massive web of corruption and political subterfuge schemes. They did so by aggressively and tirelessly seeking out the truth, and reporting back to the American people clearly and comprehensively. \\nToday, both publications have become willing accomplices in suppressing the same type of information they worked so tenaciously to expose all those years ago. By openly and unapologetically acting as institutional surrogates for the Clinton campaign, these same institutions, and nearly every other mainstream media outlet in America, have gone hands-off in exposing what may very well turn out to be the most explosive and damaging corruption scandal in American politics since “Tricky Dick” was reelected back in ’72. \\nNot by coincidence, Julian Assange and WikiLeaks have stepped in to fill the void. And boy, are the “truth seekers” mad about that! My, How Times Have Changed \\nOn June 17, 1972, five men were arrested for breaking and entering the Democratic National Committee headquarters at the Watergate complex. Bob Woodward and Carl Bernstein, both reporters for the Washington Post at the time, unflinchingly pursued the complete truth behind the break-in. Little did they know that summer how vast was the network of lies and corruption their investigation would eventually uncover. \\nThe editors at the Post initially put the story on the back burner, while the Nixon administration deftly stonewalled the reporters’ probes. By September, though, the Post and New York Times were fully on board with the investigation, and the administration had gone into full cover-up mode. Even though the FBI had confirmed that the administration had conducted a political sabotage conspiracy, it was not enough to keep Nixon from being reelected in a landslide in November. But the die was cast. The American press made it clear this story would not end until all the facts were in and Nixon and his henchmen were fully exposed. \\nFast-forward to 2016. We are now two weeks away from the general election, and once again a potentially devastating story appears to be developing, related to a web of corruption and deceit that could eventually rival the Watergate scandal. Just like 1972, the Post and the Times are fully engaged. Except this time, the “two lions of journalism” have little interest in covering the avalanche of revelations pouring forth against the Clinton campaign. Instead, both publications are working around the clock to bring the Democratic nominee to power. That’s not all. Nearly every other mainstream media outlet in the country has jumped on the bandwagon. \\nIt would be incorrect to think that until now the mainstream media has been a relatively objective source for news. This has been going on for a long time. Few could argue that back in the ’70s, editors Ben Bradlee at the Post and Abe Rosenthal at the Times were not absolutely salivating at the chance to bring Nixon down. But they achieved this objective in relentless pursuit of the facts, not the willing suppression of the same. \\nOne would think, given the self-inflicted meltdown the Donald Trump camp finds itself in right now, the media might at least feign some level of balanced reporting, but they’ve made it very clear they’re not taking any chances. They’re going to keep digging dirt on Trump, and they’re going to continue to minimize, to the best of their ability, a story that may well have historic and damaging implications, both for the nation as a whole and our entire political system moving forward. \\nAlthough this may prove to be a very successful political tactic for this year’s presidential election, it is likely to forever damage the reputation of mainstream American journalism, and it most certainly will continue to encourage the American public to look elsewhere for the unvarnished truth. President Obama's brother calls for @POTUS to pardon Assange https://t.co/BjtaY2wrJ1 \\nAssange & Kenya, background: https://t.co/BQ8EqCXTqD\""}, "time": 1742562195.9848244}