{"duration": 0.05022788047790527, "input_args": {"text": "'Russian families with children in Europe have no way back to Russia 03.11.2016 Finnish human rights activists said that Russian citizen Svetlana Rots had had her two daughters taken away from her. The Russian girls were accommodated in a Finnish private orphanage, but were later distributed between Finnish families. The children were taken away from their mother not to let the woman take the girls out of Finland to Russia. A press release from human rights activists says that Svetlana Rots, a citizen of the Russian Federation, was born in Leningrad (currently St. Petersburg). During the recent years, the woman has been residing in Finland with her family. In November of 2015, the Finnish authorities took the children away from their parents. The Russian mother has been completely isolated from her younger, five-year-old daughter Carolina. The girl holds only Russian citizenship. The girl was taken away from her mother after the police received information saying that the woman could take the girl to Russia. Svetlana\\'s elder daughter Sophia, aged 13, is also a citizen of the Russian Federation only. The girl was seized as well, but the Finnish authorities allowed the girl to communicate with her mother on the phone twice a week for 15 minutes. Print version Font Size It just so happens that Russian citizens can take their children to Finland , but they can not take their children back to Russia as simply an intention to visit the motherland is viewed as an act of kidnapping in accordance with European laws. According to coordinator of Russian Mothers movement, Irina Bergseth , this is not the first incident when Russian citizens in Europe have their children taken away from them just because Russian parents intend to leave the EU and take their children to Russia. \"Today, Russians with kids can enter Europe and can even have a child in Europe, but if a Russian family intends to return to Russia, Europe says that the Russian parents want to \"kidnap\" a child from the EU, so European officials act first to kidnap a child from Russian parents,\" said Bergseth. According to her, European child protection services used to kidnap Russian children mostly from mixed families (Russian-Finnish or Russian-Norwegian ), but presently, the practice has been expanded to the families where both parents are citizens of the Russian Federation. Russian human rights activists assess such incidents as a manifestations of hard core Russophobia . Currently, there is a large-scale campaign in Europe to \"persecute\" Russian families with children. \"It is necessary to set clear rules and procedures to return children, Russian citizens, to their motherland. While these rules and regulations are being developed, the Russian authorities should properly inform Russian families in Europe what they should do, if they had their children seized and taken away from them,\" says Bergseth. Earlier, Russian citizen Victoria Medvedeva found herself in a similar situation in Finland. The woman came to Finland with an intention to work there on a temporary basis. She had three of her children withdrawn from her. The Finnish authorities accommodated the children in a local orphanage. The woman\\'s children - two daughters and a son - hold only Russian citizenship. The children were returned to Victoria Medvedeva after a while, owing to their father\\'s interference. The family intends to leave Finland and return to St. Petersburg. Pravda.Ru Read article on the Russian version of Pravda.Ru'"}, "time": 1742561727.6369793}