{"duration": 0.05463075637817383, "input_args": {"text": "'Print \\nMany look at the new healthcare system with their higher premiums and wonder what has happened. Why are their coverages shrinking and their premiums growing? Some have come to the conclusion that the system itself is to blame. They believe that Obamacare is broken? \\nWhat they fail to recognize is that this is not the case at all. What we see as failing to make insurance better has made it worse, but it is simply a problem of ignorance. We just are not smart enough to know the truth. Higher premiums and less coverage is the point, it seems. \\nBreitbart reports : \\nOn Wednesday’s broadcast of “CNN Newsroom,” MIT Economics Professor and Obamacare architect Jonathan Gruber argued that “The law is working as designed. However, it could work better. And I think probably the most important thing experts would agree on is that, we need a larger mandate penalty.” \\nGruber said, “Obamacare’s not imploding. The main goal of Obamacare was two-fold. One was to cover the uninsured, of which we’ve covered 20 million, the largest expansion in American history. The other was to fix broken insurance markets where insurers could deny people insurance just because they were sick or they had been sick. Those have been fixed, and for the vast majority of Americans, costs in those markets have come down, thanks to the subsidies made available under Obamacare.” \\nSo basically, everything that is being reported is not accurate. There is no reason to think that all of the insurers are bailing like rats on a sinking ship. It just appears that way. This is little more that fool’s hope so that there will not be a mass exit from the exchange. \\nBut, unfortunately, people no longer demand proof. They simply take a man like this at his word. So, he will get away with telling Chicken Little that the sky is not falling; even while it is coming down on his head. \\nWhen you chase emptiness, God will let you catch it. \\nArticle reposted with permission from Constitution.com shares'"}, "time": 1742628304.6333582}