{"duration": 0.06063246726989746, "input_args": {"text": "\"Pussy Riot Released The Perfect Nasty Woman’s Answer To Trump (VIDEO) By Natalie Dailey on October 26, 2016 Subscribe \\nAt the third presidential debate last week, Republican presidential nominee Donald Trump made the mistake of calling Democratic presidential nominee Hillary Clinton a “nasty woman.” \\nJust a couple of weeks ago, Trump was caught in some hot audio from an Access Hollywood bus in 2005. He famously said that he can “grab them by the p***y” because he is a star. \\nThe Russian band, Pussy Riot, has released a new song in response to Trump’s comment. It is called “Straight Outta Vagina.” It is a very feminist and body-positive song. As women, we should all be proud of our bodies. Perverts like Donald Trump love to abuse us, but we can be stronger. \\nPussy Riot’s Nadya Tolokonnikova told The Guardian : “This song could be considered an answer to Trump. But I believe the idea of powerful female sexuality is much bigger than any populist megalomaniac man … Vagina is bigger than Trump.” \\nNSFW: Graphic content. \\nHere are some of the lyrics: “Does your vagina have a brand? / Let your vagina start a band / If your vagina lands in prison / Then the world is gonna listen “My vagina is tough and dangerous / Shaking up the major labels / Vagina gonna take the stage / Cuz vagina’s got a lot to say “My pussy my pussy / Is sweet just like a cookie / It goes to work / It makes the beats / It’s CEO, no rookie / From senator to bookie / We run this shit, go lookie / “Y ou can turn any page, any race, any age / From Russia to the states / We tearing up the place.” \\nI’ll warn you, the song is very catchy. Just watch who you sing it around. Rapists and abusers like Trump don’t realize just how strong we women are. This song is a great way to celebrate our bodies. \\nHere is the video : \\nFeatured image via YouTube screenshot . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect\""}, "time": 1742564156.0912712}