{"duration": 0.17445921897888184, "input_args": {"text": "'At last week’s Worldwide Developers Conference, Apple’s annual showcase of new tech, the company announced a special texting feature coming soon to iPhones near you. “You know, sometimes you’ve typed a whole message and you realize at the end that you’re entirely lacking in emojification,” said Craig Federighi, Apple’s senior vice president for software engineering. “So we provided the solution: When you tap on the emoji button, we’ll highlight all the emojifiable words there, and you can just tap, tap, tap, tap and emojify. ” On a screen behind Mr. Federighi, a simulated message underwent the process: The word “basketball” transformed into a little black and orange cartoon image of the ball itself. “Pizza” flipped into a glistening pepperoni slice. “Movie” turned into an   film camera. A collective “Ooh” wafted up from the technorati gathered in the crowd. “Children of tomorrow will have no understanding of the English language,” Mr. Federighi said jokingly. But Apple’s new emoji feature seems more likely to impede a different kind of skill: creating surprising, figurative and subversive forms of individual expression out of the digital ephemera that populate our devices. In a rush to harness the power of the web’s most evocative cultural units  —   emoji and their hyperactive cousins, GIFs  —   tech companies, corporate brands and entrepreneurial social media stars could risk inadvertently flattening the creative world that’s sprung up around them. “There is a constant push and pull between people finding new ways to express themselves online, and companies trying to make money off that expression,” said Luke Stark, who studies digital communication and psychology. Emoji have emerged as cultural forces in and of themselves. The crisp,   glyphs form a modern emotional palette. And it’s growing: On Tuesday, the Unicode Consortium, the body that standardizes emoji, will release 72 new ones that will soon make their way to our fingertips, including a black heart, a wilted flower and a pregnant woman. Emoji began as colorful icons loaded into Japanese pagers in the 1990s. When they first migrated to American devices several years ago, discovering emoji felt like opening a grab bag of Japanese curios: smiley faces, yes, but also a buffet of Japanese foods (a cut of sashimi, a fish cake, a bottle of sake) and a host of untranslatable images. But the emoji soon took on new meanings as they made their way to new countries and subcultures  —   like the information desk person emoji (recast as a sassy retort) or the eggplant emoji (which usurped the banana to become the internet’s favorite phallic symbol). In a group chat, adding emoji can feel like tacking up posters on the walls of a virtual clubhouse. A lively sequence can stoke flirtatious undertones or show off sparkling wit. One perfectly chosen emoji could suspend a mood in time, like an ’80s movie that ends on an exultant freeze frame. If emoji encourage visual puns and whimsical juxtapositions, GIFs inspire a sharp curatorial sensibility. The art lies in detecting the richest slices of popular media  —   film, TV or amateur video  —   and punctuating their greatness by setting them on infinite repeat. The best “reaction” GIFs  —   those chosen to inject human expression in online conversation  —   feel both emotionally familiar and visually surprising. But when emojis and GIFs are filtered through the interests of tech companies, they often become slickly automated. In addition to Apple’s “emojification” feature, there is Twitter’s new GIF keyboard (a partnership with the GIF company Giphy, which has been pumped with $78. 95 million worth of funding since 2013). It directs Twitter users to choose from a suite of emotional reactions, including “Agree,” “Applause,” “Aww” and “Eww,” which conjures a set of appropriate GIFs,   with those featuring the internet’s most GIFable celebrities, like Beyoncé and Oprah. Searching for a delicious bite of pop culture once took on the contours of a treasure hunt. A GIF keyboard feels like a shortcut: Click “GIF,” find an emotional state (“Agree”) then filter it through your cultural lens of choice (like Jerry Seinfeld saying “riiiiiight right right right right right. ”). Tap, tap, tap:  . It all feels simpatico with Facebook’s new “reactions,” released in February, which offer users a slim range of human experiences  —   Anger, Sad, Wow, Haha and Love  —   with which to react to news on their feed. Buying into these features means giving tech companies the power to shape our creative expressions in ways that further enrich the companies themselves. A limited emotional range helps collect data on users’ states of mind. Twitter advertisers can now target users based on the emoji they tweet. The commodification of digital culture has engendered more explicit corporate branding, too. On Snapchat, where users embellish their selfies with emoji, crayon scribbles, and elaborate “lenses” that cover their faces with virtual masks, marketers like McDonalds are seizing the opportunity to write their messages across people’s faces. Even celebrities have tried to encode themselves. In December, Kim   released her latest pioneering app, Kimoji, which serves up an alternative emoji set (and a suite of GIFs) designed around her own image. It inspired a boomlet of celebrity emoji offerings, including Stephen Curry’s StephMoji app, Amber Rose’s MuvaMoji, Justin Bieber’s Justmoji and the actor Ansel Elgort’s Anselfie. Even Drake’s dad has emoji now. With Kimoji, and its micro images of breasts and butts, Kim Kardashian isn’t just sexy: She represents sex itself. But as more stars jump on the bandwagon, these apps begin to represent little more than a branding opportunity: Ansel Elgort sticking out his tongue Ansel Elgort pouting Ansel Elgort wearing headphones. Meanwhile, as traditional emoji expand beyond their Japanese roots, tech companies like Apple, Microsoft and Google (all are voting members of Unicode) have become responsible for making cultural, and sometimes political, choices in determining which new emoji will make the cut. Some additions to the emoji repertoire are informed by experts: Unicode has consulted the Cornell Lab of Ornithology for bird emoji advice. Others are culled from “popular requests from online communities” and proposals submitted by the public. Companies have also made bids to influence the result, though Unicode says it rejects emojis “strongly associated with a particular brand. ” Last year, the ad agency Havas London started a campaign on behalf of Durex, calling for a condom emoji. Cerveza Indio wants a dark beer emoji. Ballantine’s has championed a glass of whiskey. The rice company La Fallera suggested a paella emoji. (The whiskey and paella made the cut both are coming on Tuesday.) For the Olympics, Unicode recently considered encoding a rifle emoji alongside other   glyphs, but members voted it down. “When vendors looked at it, they didn’t see a lot of additional value in adding it,” said Mark Davis, a Unicode spokesman. “There’s already a firearm in Unicode. ” That decision has helped stoke concerns that modern visual language is being shaped by the political or financial priorities of gigantic tech companies. While many don’t see the advantage of emojifying another gun, others wonder whether heightened scrutiny could lead to less idiosyncratic, less interesting characters. “One of the things that make emoji fun is this quirky weird list that came about through accidents of history,” said Jeremy Burge, the founder of Emojipedia and a member of Unicode’s emoji subcommittee. “The bomb, the cigarette, the dripping syringe  —   it’s crazy to think that all of those would make it in today. ”'"}, "time": 1742563457.0715227}