{"duration": 0.05580568313598633, "input_args": {"text": "'Former astronaut Buzz Aldrin spoke at the Humans to Mars conference in Washington, D. C. this week where he urged NASA to defund the International Space Station in order to dedicate more resources to exploring Mars. [“We must retire the ISS as soon as possible,” said the former Apollo 11 moonwalker on Tuesday, according to Space. com, “We simply cannot afford $3. 5 billion a year of that cost. ”  Aldrin believes that space activities in LEO (Lower Earth Orbit) should be conducted by private companies. NASA has indeed taken steps in that direction already, awarding contracts to companies such as SpaceX, the space exploration startup founded by Tesla CEO Elon Musk. Orbital ATK and Boeing have also recently been contracted to transport astronauts between the International Space Station and Earth. Aldrin believes that Bigelow Aerospace, Axiom Space or other companies should construct and maintain LEO space stations similar to the ISS, but operating entirely independently from NASA or the ISS. Aldrin hopes that these commercial space stations would share information with the space station that China plans to have in orbit by 2020, which Aldrin believes would help to encourage cooperation between China and Western companies. The creation of space stations in LEO is just one of the many plans that Aldrin has for further space exploration. Aldrin’s plans to colonize Mars also heavily rely upon “cyclers,” spacecraft that continuously move between two cosmic destinations in order to transport people and cargo. “The foundation of human transportation is the cycler,” said the    former astronaut. “Very rugged, so it’ll last 30 years or so no external moving parts. ” Aldrin predicts that various iterations of “cyclers” will enable a manned mission to a   asteroid by 2020 and could possibly perform a flyby of Venus by 2024. Based on Aldrin’s predictions, the first settlers on Mars would be able to launch for the planet by 2030. Aldrin believes that these travelers will not just be visitors to Mars but settlers. “Let’s be certain that we’ve developed a sustainable plan to stay on Mars,” he said. “No flags and footprints this time. ” However, the International Space Station is currently funded up until 2024. NASA officials and members of the Russian Federal Space Agency have also considered extending the life of the $100 billion outpost up until 2028. NASA has stated that the ISS is a vital part of their “Journey to Mars” plan, which will hopefully see astronauts in the vicinity of Mars by the 2030s. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562976.3821547}