{"duration": 0.02506399154663086, "input_args": {"text": "'Geert Wilders announces boycott of Free Speech Trial October 28, 2016 File picture: Dutch far-right Party for Freedom (PVV) leader Geert Wilders answers questions during a Reuters interview in Budapest, Hungary, June 24, 2016. REUTERS/Laszlo Balogh/File Picture \\nDutch Nationalist Geert Wilders has announced he refuses to attend his free speech trial because he believes it is politically motivated. Wilders: \"Next Monday, the trial against freedom of speech begins. Against a politician who says what the politically correct elite does not want to hear.” \"This trial is a political trial, in which I refuse to cooperate.\" Wilders is accused of discrimination and inciting racism after a famous TV appearance in 2014. Wilders faces a fine of up to 7,400 euros ($8,100) and a year in jail for the remarks. Wilders: \"It is a travesty that I have to stand trial because I spoke about fewer Moroccans. It is my right and my duty as a politician to speak about the problems in our country.” Dutch elections are set for March 15, 2017. Opinion polls: Wilders\\' Freedom Party is neck-and-neck with the VVD Party of conservative Dutch Prime Minister Mark Rutte. In 2011: Wilders was acquitted of inciting racial hatred for calling for the Koran to be banned and for the deportation of \"criminal\" Moroccans. Judges at time: His remarks, while offensive to some, were within the bounds of legitimate political discourse. Legal experts: Prosecutors have a stronger case this time because Wilders targeted a specific social group, rather than a religion. \\n(AMSTERDAM, NETHERLANDS) Geert Wilders, the Dutch anti-Islam opposition leader, said on Friday that he refuses to attend his trial next week and that he sees it as politically motivated. \\nWilders is accused of discrimination and inciting racism in remarks made on live television in 2014 when he led a roomful of people chanting that they wanted fewer Moroccans in the Netherlands. \\nDutch politicians are limbering up to campaign for elections on March 15, with opinion polls indicating that Wilders\\' Freedom Party is now neck-and-neck with the VVD Party of conservative Dutch Prime Minister Mark Rutte. \\n\"Next Monday, the trial against freedom of speech begins.Against a politician who says what the politically correct elite does not want to hear,\" Wilders wrote in a statement. \"This trial is a political trial, in which I refuse to cooperate.\"'"}, "time": 1742628440.1920543}