{"duration": 0.06339240074157715, "input_args": {"text": "'LIFESTYLE \\nI received the following email about a nine-year-old from Northern Europe who speaks about her ability to ‘heal’ water through star languages. She also gives her perspective on God and her Mission: “Poor us. poor kids who come to volunteer; we have such a difficult time ahead of us, a real fight. I am here to help my family ‘wake up,’ EVERYONE is sleeping.” \\nCathy’s Mother: “My nine-year-old daughter speaks ‘star languages’ to heal water. I live in Northern Europe and have four children. At the time of my first pregnancy, a ‘voice’ told me my children were not mine. They would only come through me. These children belong to no one. It wasn’t until recently that I was aware there were such things as extra-terrestrials. My nine-year-old daughter is a special girl who finds the conventional world and rules difficult. She asks me why isn’t she allowed to do things her own way. Cathy has healing abilities and dictated some healing words in an ET language to purify water. I noticed the water actually tasted different afterward. She says that star languages are from a place outside of the Universe. \\nCathy receives messages in ET languages and understands what they are saying to her. She says that they are important. \\nI showed her your presentation, where a woman does healing and writes several ET languages. My daughter responded with joy and excitement, ‘She knows what I have written’.” \\nAstounding as Cathy’s claim may be, a scientist from Northern Europe is researching ways to energize water and explains how this could be possible. \\nDr. Ohlson (Ph.D.) is a Swedish scientist referred to previously as coining the term letter people.. She is also studying water and its properties. Humanity Has to Believe in Itself: \\n“It is difficult, because first of all, we don’t believe it, then if we believe but still have doubts, this prevents us from reaching this potential. We have to be at a point within ourselves to get in touch with our REAL truth in order to achieve this. \\n“There is a certain time we will achieve it, and if one person does, it will spread to other people, and this is the way it will start. But at what time I can’t tell you.” \\nCathy shares why the star kids have come to this planet at this time: \\n“The star kids have come to show us the way. They are the ones to start the process, helping the rest of humanity to wake up.” \\nCathy says she is from Evening Land, to help us evolve. When her purpose is accomplished, she will go to the Day Light. We have already been in Day Land, but because we wanted to have more experiences, we came to this planet. \\nThe beings in Contact with her, like Emenoke, do not live on another planet. They are located at the ‘edge of the universe’ in the White Light. \\n“The ‘light orb’ is sent to protect us. My little brother has a blue orb that protects him.” \\nMary: “You said he will also be a teacher ˗ in what way?” \\nCathy: “He will be my teacher, as I will be, and he will be home schooled so he will retain true knowledge.” \\nM: “What do your guides teach you?” \\nC: “They are teaching me different knowledge so I can teach adults. The danger is that it can be changed and then the true information is lost. Then people get confused and lost by making fun of the star children, or not believing them. Many Star Kids are destroyed by education.” \\nM: “How many star kids are there?” \\nC: “Forty or fifty percent of people of a hundred, but many get lost and only twenty percent will remember who they are.” “We Have to Wake Up!” \\n“The beings want us to wake up and see reality as it is, to understand how powerful we really are. Some individuals from Day Land and Evening Land have come here to help humanity with the Awakening. \\n“It’s very dangerous to come here to help because our past life memories can be deleted at birth and some of this is destroyed by society and education, drink and drugs. Those who come here are aware of the dangers and still want to come and help. We are not awake yet.” \\nM: “How can we wake up?” \\nC: “We have to increase our energy as we don’t have the energy required; it’s stolen from us.” \\nM: “How can we protect our energy?” \\nC: “At present, we only have point five percent (.05%) of our energy. We need to have one point five percent (1.5%). \\nHow might we begin to increase our energy? Cathy says: Don’t get angry about small things. Don’t speak on mobile phones for a long time. Don’t eat white sugar. Don’t watch TV. Don’t use microwaves. Don’t have wireless internet.” 3 5 \\n“Something important will happen in the next five years on this planet. The parents have to listen to us. We need to educate the parents.” \\nAn Excerpt from the forthcoming book The New Human by Mary Rodwell About Raven Raven Fon is a freelance writer and a globetrotting journalist. She studied creative writing and journalism at Saint Petersburg College and has since been a contributor to several written and online publications including her own MysticalRaven.com She is an avid lover of cartoons and comics and believes everyone writes better while wearing a cape.'"}, "time": 1742628441.0749893}