{"duration": 0.07798361778259277, "input_args": {"text": "'How demonetisation has affected tipping Posted on Tweet (Image via blogcdn.com) \\nToday we will talk about the one area that probably has been hit the hardest by demonetisation: Tipping. \\nI got thinking about this after a small incident at a restaurant where I was for an evening bite early this week. The bill was for Rs.197 and, as it happened, I had only a few 100 rupee notes with me. I could have left two hundred rupee notes and walked off, but three rupees is, forget tips, pittance even as alms these days. Roadside beggars, if they were offered Rs.3, would perhaps take it as extreme insult, and, as is the norm these days, initiate an online ‘change.org’ petition against this discrimination and before the end of the week it would have had a lakh of signatories and the media would run away with the story (“Three rupees and the hubris of the privileged”, “Five reasons why beggars are also human beings”, “Post-Trump, alms hit a new low”, “India ranked 153rd in the Global Alms-Giving Index (below Rwanda, Gambia and Bhutan)”, and the inevitable “How twitter reacted to “AlmsGate”). And after a week or so of this — this is the power of media pressure and online change petitions — the general public would have quietly moved on to some other issue. \\nSorry, I digressed. Back to the restaurant. I could have topped the bill with another Rs.100, but Rs.103 would have been hefty as a tip. The middle-class cheapskate in me would not have let me sleep peacefully that night. \\nSo what did I do? I went for the third option, which was to pick the bill and pay it with my credit card at the counter and slink off without making any eye contact with the waiter, who, if ever I visit the same restaurant again, is sure to bring my soup after spitting into it. \\nThe problem with tipping is there is no hard and fast rule to it. In some countries,’ etiquette has it that you leave 15% of the bill amount as a tip. In some others, it is 10%. In some others, possibly pockets of Pakistan, it is good etiquette if you at least pay the bill. In my home town Madurai, it was considered good enough if you give the waiter a warm smile while leaving. But that is Madurai, a place where holding the door for the person coming behind you might be taken as extreme insult: “ Yaen pa, engallukku kai kaal illaiya? ” (“Why man, don’t we have hands and legs?”) \\nModern-day bills also leave you confused about tipping. You are always stumped by ‘service tax’ and ‘service charge’. One is a government levy and the other is a charge by the shop. Here is a handy explainer on what they actually mean: \\nService Tax: You pay \\nService Charge: You pay. \\nOkay, here is another definition: Service tax and service charge are totally two different things, but generally combine together to make the bill for the pizza, which you ordered only because the price was marked Rs.199, magically change to Rs. 476 at the time of paying. \\nWhen the bill includes ‘service charge’, it is generally taken that you need not tip. But not all bills include the service charge. But even when it is included, it may not be ‘totally’ included. Which, of course, means, you are even more unsure as to how much to tip. \\nEven more of a toughie is the scene at pricey hotels when you are on tour. At a fancy hotel you should be prepared to tip basically your annual provident fund payments. Even if you are travelling alone and carrying just a duffel bag, the moment you arrive at the hotel, the staff there will dart towards you, while one will open the car door and before you tip him a ten or twenty, another will reach for your small bag and without waiting for you, carry it towards the reception desk probably situated 60-70 metres away and deposit there (cue for you to slip in another ten or twenty), from where another staff will pick it up and take it to the lift located 20 metres away and travel with you all the way to the floor where your room is and then leave you when you pay him twenty or fifty) whereupon another person will materialise from nowhere to purvey something (“This water bottle is a compliment from the hotel, sir”) and also tell you how to operate the TV and AC (“Here is the switch and you have to turn it on”), but by this time you would have totally run out of all loose change and you will have no other go but to tip him a 100. When you are eventually through with the stay you would probably have tipped everyone and everything, including bathroom fixtures, and may want to leave sliding via the drainpipe without anyone noticing. \\nBut tipping is important and a basic courtesy extended to any service or work done. But not to trouble you in this demonetised time, I don’t mind cheques.'"}, "time": 1742562970.0657892}