{"duration": 0.12891864776611328, "input_args": {"text": "'by Mohsin Siddiqui for the Oceania Saker Blog \\nThe US elections much like the rest of our usual daily consumption of Mass Media are more about stage managed theatre with bucket loads of Americanism, a seasoning of hyperbole and most certainly reality-free. The constant barrage of infotainment from the indispensable nation, the exceptional nation and the benign super power tells us of a distinct desire to consume information reality-free. \\nThis informational GMO has permeated every facet of our existence and has infected the minds of billions around the world. It can be ridiculed, seen as inferior or even unsustainable. But do understand that it is the food for the liberal soul and it is a formidable force to be reckoned with. \\nHuman beings drive the vast bulk of their understanding of the world through information either delivered directly via consumable media or indirectly via peer impressions, religion, anecdotes, fables and cultural norms. All of it ultimately centres on the flow of information which is a commodity that has been designed, refined, repackaged and is continually ‘improved’. Most of us underestimate the true awesome power of mass media, we read the statistics, the concentration of power and observe the echo chamber yet we still need to let it all sink in to truly grasp what it means. \\nMass media is the encapsulation of the spectrum of information; From magazine to sports to history to business to politics, it is driven by a seamless thread of a philosophy guiding the ego & soul towards an atomised individualistic view of the world. It is an echo chamber that has not seen its parallel before on this planet, an organ to shape reality for the billions. A human being is a hodge-podge of history, culture, religion, philosophy, geography, epigenetics and a host of many more layers of information. Mass Media is the flute that organises this cacophony into a melody, and just like that a marionette of the modern man is born. \\nResistance to the pied piper is possible but requires one to leave that womb of comfort that the information matrix provides with its legions of followers; That feeling of belonging, of being understood, of being ‘right’ and of being good. The strength can only come from reality but in our upside down world many are malnourished on the diet of GM information and it is not a problem for only Americans – who are severely affected – but instead it is a global phenomenon. \\nSuccessful entrepreneurs, businessmen, academics, financial experts, journalists, neighbours, friends, brothers, sisters and parents can all be entangled in the web of the information matrix. Many of us have been at pains to explain the conflicts in Syria, Libya, Iraq, Ukraine and Yemen to our colleagues and friends but it is as if the words fall on deaf ears. The cognitive dissonance is heavy and the Teflon like value-matrix – a product of pre-packaged popularly accepted globalised values- lets all facts, figures and evidence that we present slip off. It is about the first woman president elect and not her war crimes, it is about the opposing camp saying that a racist, misogynist bigot is worse than a psychopathic mass murderer. It is inverted reality. It is full on dystopia. \\nWhere do you begin to explain that elections are for the most part mere stage managed theatre? That the USA is an Empire of 1,000 military bases and not a country? That Obama the peace maker has incinerated civilians in 7 countries with impunity? That Hillary’s black lives did not matter for whole black Libyan towns that were extinguished? That President Asad’s Syria is LGBTQ friendly and the “Syrian revolution” that never was is the opposite? Or that it simply is not about personality politics, gay rights and black lives but is about a class struggle? \\nMoreover, how do you abstract further and talk about Imperialism with a populace that thinks that protesting with Soros funds -to the benefit of the imperial war machine- is inline with being a Communist/Marxist movement? How do you explain Imperialism when King Leopold II has his bust on display with a higher tally than that of Hitler? \\nA chasm in time it is and it is widening. \\nI have been speaking to friends of the past 20 years trying to give my view of what I feel is missing in the discourse; Class struggle, how mass media works, what colour revolutions are, what imperialism is and how we ought to abandon personality politics. Our biggest obstacle is personality politics, and we are seen through that lens as arrogant bastards trying to educate Ivy League graduates, hedge fund managers, educated graduates and Silicon Valley success stories. How can we, the deplorable, know anything anyway? \\nAfter a recent exchange, a Rhodes Scholar quipped: “To put it succinctly, you are saying Trump is good for Russia. I think we kind of get that”. I did not know what to say, the Teflon value matrix had won again. Plato’s democratic man guards the citadel of his soul with vengeance. \\nAnother highly educated and decorated researcher at a prestigious Ivy League university said “… under Obama our economy bounced back, unemployment went down, we didn’t start any major new wars” and ended his raving review by stating “Obama did a great job.” The painful part is coming to terms with a colonized mind; These educated men and women are the crème de la crème of their imperialism ravaged countries, the ones who proverbially “made it”. \\nTheir world makes sense to them, the Mass Media might have shamed itself in our eyes and the veil might have been lifted for us. But for them their convictions have only strengthened and they have been wronged by the basket of deplorables. \\nMohsin Siddiqui'"}, "time": 1742562833.7138608}