{"duration": 0.11515045166015625, "input_args": {"text": "'Share This Residents were fed up with hearing the Islamic call to prayer blasting at 5 a.m. each morning, so Mayor Yair Revivo decided to give the Muslim community a taste of their own medicine. \\nAlthough citizens were fed up, they were too afraid to call out a Muslim community for disturbing the peace by blasting their call to prayer in the early morning hours. However, as soon as the mayor heard what was happening, he decided to give the Muslims a taste of their own medicine. \\nRegardless of which country Muslims infiltrate, they eventually overtake the politically correct majority with their incessant demands, compulsive behavior, and intimidating tactics. Unfortunately, even the last Jewish state on earth is slowly being driven out of their own land after millennia of thriving under religious persecution. \\nAs the only democracy in the Middle East, Israel is the only country in which Muslims and Jews can live free — that is, as long as the Muslim community is kept under strict control. Exacting the same racism, religious persecution, and terrorism they commit in every country to which they migrate, even the ever-progressing Jewish nation is finding it impossible to coexist with such barbarity. In an attempt to establish their religion as supreme, the Muslim community in Lod (Lydda) has been blasting the adhan, unconcerned with the non-Muslim population it disturbs and intimidates. \\nFortunately, there are still those who are willing to buck political correctness to stand against this bigotry. Hamodia reports that, in an attempt to combat the blatantly disruptive calls to prayer, Mayor Yair Revivo announced a new program to the city on Tuesday night. \\nThe Jewish leader has vowed that since the Muslims are blaring their adhan and refusing to turn it down to an acceptable volume, the city will blast the Jewish song “Shem Yisrael” at the same time. \\nAryeh Levi, a member of the city council, has begun singing the beautiful rendition of the Jewish prayer over loudspeakers, completely drowning out the unbearable adhan. Because the local Muslims were given chances to quiet their call to prayer but repeatedly refused, the Jewish community is invoking their country’s religious heritage to “fight fire with fire.” \\nRevivo explained that the new program has nothing to do with Judaism or Islam but peace and quiet. Muslims pray 5 times a day, but the first call to prayer is around an hour and a half before sunrise, which is often as early as 5 a.m. Undeniably, this is incredibly disturbing for non-Muslim residents, especially those living closer to the mosques. \\nIn a statement, Revivo’s office said that “the use of loudspeakers for the call to prayer has over time turned into a national phenomenon, and causes much suffering and annoyance for residents, who are awakened from their slumber in the early morning hours and are subject to the call several times a day. Both Jews and Muslims who live near mosques have complained about the noise. The city has tried to limit this phenomenon using legal means, as the call to prayer is a serious violation of laws against noise, but so far we have been unsuccessful.” \\nLod is home to 45,000 Jews and 21,000 Arabs, however, it is the religious minority that repeatedly terrorizes their hosts. Whether by noise pollution or old-fashioned Islamic terrorism, Muslims in Israel are attempting to overthrow democracy and freedom for Sharia. If this happens, history shows us that the Jews will again be oppressed, executed, and exiled, just as the Islamic prophet Muhammad modeled when he invaded and butchered the peaceful Jewish tribes of Medina . \\nAccording to the Times of Israel , Revivo, who is Jewish, said Lod “would be an Arab city today if not for the garin torani — a group of religious Zionists who began working in Lod 20 years ago to strengthen Jewish identity there. \\nOf course, Muslims immediately resorted to whining, angrily disputing being subjected to the same annoyance they create for others. \\nAbed el Karim Azbargeh, an Arab member of the city council, said Revivo had chosen a Jewish religious celebration for “cheap politics” and had acted in a “disgusting and irresponsible” way. \\nMuslims look us in the eyes and swear that “there is no compulsion in religion” while blasting the mandatory call for their mandatory prayers. Then, they demand special food, breaks, clothing, holidays, and other amenities at the expense of others. Unfortunately, appeasing these inherently violent worshipers does nothing but speed up their goal of establishing an Islamic state. Once they become powerful or numerous enough, the rest of the populace is too afraid to speak out.'"}, "time": 1742561902.4787948}