{"duration": 0.10163617134094238, "input_args": {"text": "'For the president’s many opponents, it was never just about derailing the peace deal. As Colombia debated how to end 52 years of war with the nation’s largest rebel group, there was the soccer player from the beloved national team who condemned the agreement, singled out President Juan Manuel Santos and accused him of practices that were “not of God. ” Then there were the angry marches across Colombia this summer against a gay education minister, which soon grew into a wellspring of opposition to Mr. Santos’s government and the peace deal he was championing. “My compatriots march in defense of family values,” declared Álvaro Uribe, the conservative former president who spearheaded the charge against the peace deal and rallied Colombia’s religious voters against it. Mr. Santos’s push to end the war has earned him enormous recognition internationally, culminating in the Nobel Peace Prize on Friday. But he has faced stiff resistance in Colombia, where he is confronted by a growing cultural divide. When Colombians last weekend rejected the peace deal between Mr. Santos’s government and the leftist Revolutionary Armed Forces of Colombia, or FARC, the decision shocked the region and laid bare generations of anger at the rebels. Many Colombians felt the guerrillas would have gotten off too easily in a deal that would have allowed a vast majority of them to avoid prison. But critics of the agreement appear to have harnessed something else as well: a resurgent conservative movement, angered by Colombia’s socially liberal tilt in recent months. “The opposition used that argument regarding gay marriage, abortion, religion to attract and rally against the peace accords,” said Juan Carlos Garzón, a researcher at the Ideas for Peace Foundation, a research group in Colombia. “It was an effective strategy to drive the most conservative voters against the peace agreement. ” Colombia has long been one of the region’s most conservative countries. But the tone was beginning to change in the last year. In April, Colombia’s highest court legalized   marriage, and last year it removed barriers to adopting children for gay individuals and couples. The country, torn by long drug wars, legalized medical marijuana late last year. A push to lift restrictions on abortions also emerged this year as the Zika virus spread. Then came the deal with the FARC. For some conservatives, it was bridge too far: a pact with a Marxist guerrilla organization that had terrorized Colombia for decades. “People have used the reaction to the peace agenda to talk about a larger conservative rollback in Colombia, a broadened cultural war,” said Winifred Tate, an anthropology professor at Colby College in Maine who studies Colombia. The accord’s defeat  —   aided by low turnout in regions that voted for the peace deal  —   allowed social conservatives to flex their muscle, as Mr. Santos was forced to court his opponents in an attempt to salvage what remained of the agreement. Two days after the vote, Mr. Santos took his negotiators to meet with a large group of evangelical Christian pastors to discuss their concerns. Mr. Santos must also negotiate with Mr. Uribe, his immediate predecessor, who has repeatedly called him a “traitor” for promoting a peace deal that includes reduced sentences for rebel war crimes. The two sparring leaders met on Wednesday, with Mr. Uribe outlining a list of demands like bans on political participation for rebels and punishments for those who had kidnapped children. And Mr. Uribe made a nod to his social conservative backers. “We presented our worries about family values,” he said. Even after Mr. Santos won the peace prize on Friday, Mr. Uribe remained defiant, calling the peace accord “damaging to democracy” and demanding that Mr. Santos change it. While the Nobel Prize may provide a morale boost for the peace camp, some observers warned that the country’s deep polarization would continue. “It’s not likely the agenda of the extreme right will change,” said Nazih Richani, a professor at Kean University in New Jersey who studies Colombia. Susana Correa, a lawmaker in Mr. Uribe’s Democratic Center Party, said she believed the deal contained a kind of subtext that undermined family values and supported nontraditional views on gender and sexual orientation. Hours after Mr. Santos won the peace prize, Ms. Correa said her party would still be using this “new era of modifications and corrections” to seek a more socially conservative text for the deal. “The Catholic and evangelical churches have joined us in complaining that in no part of the agreements God is even named,” she said. The fight between social conservatives and Mr. Santos’s government came to a boil this summer over education. Gina Parody, the country’s education minister, who is gay, proposed mixed bathrooms and changes to uniforms to put less emphasis on gender. She also proposed creating a manual for students related to sexual orientation, following an order by the country’s courts to do so. The proposed changes drew ire from the country’s far right. One politician accused Ms. Parody of “gay colonization. ” By   thousands of protesters  —   supported by Mr. Uribe  —   gathered throughout Colombia, waving signs denouncing   marriage and urging the country to defend the traditional family. As the controversy over the manuals continued, Ms. Parody temporarily stepped down from her post, taking a job as one of the central figures in the campaign to support the peace agreement in the national referendum. Soon the two issues  —   the peace deal and the fight over sexual orientation and gender  —   became linked in the eyes of many. “Colombians marched a month ago when the government tried to impose, through these manuals, gender ideology in Colombian education,” said Alejandro Ordoñez, Colombia’s inspector general at the time. Government officials, he argued, were “using peace as an excuse to impose their gender ideology. ” Evangelical Christian leaders were also starting to rally against the deal on moral terms, saying it did not offer justice to the victims. The war left more than 220, 000 dead and displaced five million. In a YouTube video posted last month, Johan Molina, a popular minister, complains that the agreement had not been “written in common language,” confusing its intent. He said a group of pastors and other experts had studied the terms and found that the deal conflicted with the Bible because of its leniency on the rebels. “There has been no repentance of any of FARC’s leaders, and the people can’t give forgiveness to those who have not asked for it,” Pastor Molina tells his congregation in the video. The religious message against the vote was gaining traction beyond Christian leaders. Before the vote, Daniel Torres, a Colombian soccer player, produced an online video in which he urged Christians to vote against the deal. “I want to tell you that what you have come up with, and the practices you are doing, are not of God nor come from God,” Mr. Torres said, speaking to Mr. Santos while the video showed a photo of the president bowed at an indigenous cleansing. “This will bring nothing good to our country. ” Other religious leaders made the argument that the deal would benefit gay and transgender residents directly. Pastor Marco Fidel Ramírez of the Family International Church in Bogotá, the capital, said he believed the architects of the deal planned to use the agreement to advance   marriage, though he had no direct evidence to support that assertion. “This was a fundamental objection and a danger to the natural family in Colombia,” he said. “A family in Colombia consists of a man and a woman. ” Marcela Sánchez, the director of Diverse Colombia, a group representing gay, lesbian, bisexual and transgender people, said the accord contained no such provisions. But, she said, the right waged a fierce disinformation battle to convince people otherwise, especially on social media. The   effect, in addition to derailing the peace deal, was increased homophobia, Ms. Sánchez said. After the failure in the referendum, Ms. Parody, the education minister who had campaigned for the deal, permanently resigned from her education post, leaving the country without its most prominent gay leader. “It’s sad in this country that there are people who have more fear of homosexuality than war,” Ms. Sánchez said.'"}, "time": 1742628318.0434628}