{"duration": 0.21140718460083008, "input_args": {"text": "'This post was originally published on this site \\nIn the week leading up to last Tuesday’s election the press was busy writing obituaries for the Republican Party. This continued even after Donald Trump’s “surprising” victory – which, like the 2008 bank-fraud crash, “nobody could have expected.” The pretense is that Trump saw what no other politician saw: that the economy has not recovered since 2008. \\nDemocrats still seem amazed that voters are more concerned about economic conditions and resentment against Wall Street (no bankers jailed, few junk mortgages written down). It is a sign of their wrong path that party strategists are holding onto the same identity politics they have used since the 1960s to divide Americans into hyphenated special-interest groups. \\nObviously, the bottom 95 Percent realize that their incomes and net worth have declined, not recovered. National Income and Federal Reserve statistics show that all growth has accrued to just 5 percent of the population. Hillary is said to have spent $1 billion on polling, TV advertising and high-salaried staff members, but managed not to foresee the political reaction to this polarization. She and her coterie ignored economic policy as soon as Bernie was shoved out of the way and his followers all but told to join a third party. Her campaign speech tried to convince voters that they were better off than they were eight years ago. They knew better! \\nSo the question now is whether Donald Trump will really a maverick and shake up the Republican Party. There seems to be a fight going on for Donald’s soul – or at least the personnel he appoints to his cabinet. Thursday and Friday saw corporate lobbyists in the Republican leadership love-bombing him like the Moonies or Hari Krishna cults welcoming a new potential recruit. Will he simply surrender now and pass on the real work of government to the Republican apparatchiks? \\nThe stock market thinks so! On Wednesday it soared almost by 300 points, and repeated this gain on Thursday, setting a DJIA record! Pharmaceuticals are way up, as higher drug prices loom for Medicaid and Medicare. Stocks of the pipelines and major environmental polluters are soaring, from oil and gas to coal, mining and forestry, expecting U.S. environmental leadership to be as dead under Trump as it was under Obama and his push for the TPP and TTIP (with its fines for any government daring to impose standards that cost these companies money). On the bright side, these “trade” agreements to enable corporations to block public laws protecting the environment, consumers and society at large are now presumably dead. \\nFor now, personalities are policy. A problem with this is that anyone who runs for president is in it partly for applause. That was Carter’s weak point, leading him to cave into Democratic apparatchiks in 1974. It looks like Trump may be a similar susceptibility. He wants to be loved, and the Republican lobbyists are offering plenty of applause if only he will turn to them and break his campaign promises in the way that Obama did in 2008. It would undo his hope to be a great president and champion of the working class that was his image leading up to November 8. \\nThe fight for the Democratic Party’s future (dare I say “soul”?) \\nIn her Wednesday morning post mortem speech, Hillary made a bizarre request for young people (especially young women) to become politically active as Democrats after her own model. What made this so strange is that the Democratic National Committee has done everything it can to discourage millennials from running. There are few young candidates – except for corporate and Wall Street Republicans running as Blue Dog Democrats. The left has not been welcome in the party for a decade – unless it confines itself only to rhetoric and demagogy, not actual content. For Hillary’s DNC coterie the problem with millennials is that they are not shills for Wall Street. The treatment of Bernie Sanders is exemplary. The DNC threw down the gauntlet. \\nInstead of a love fest within the Democratic Party’s ranks, the blame game is burning. The Democrats raised a reported $182 million dollars running up to the election. But when from Russ Feingold in Wisconsin and other candidates in Michigan, Minnesota and Pennsylvania asked for help. Hillary monopolized it all for TV ads, leaving these candidates in the lurch. The election seemed to be all about her, about personality and identity politics, not about the economic issues paramount in most voters’ minds. \\nSix months ago the polls showed her $1 billion spent on data polling, TV ads and immense staff of sycophants to have been a vast exercise in GIGO. From May to June the Democratic National Committee (DNC) saw polls showing Bernie Sanders beating Trump, but Hillary losing. Did the Democratic leadership really prefer to lose with Hillary than win behind him and his social democratic reformers. \\nHillary doesn’t learn. Over the weekend she claimed that her analysis showed that FBI director Comey’s reports “rais[ing] doubts that were groundless, baseless,” stopped her momentum. This was on a par with the New York Times analysis that had showed her with an 84 percent probability of winning last Tuesday. She still hasn’t admitted that here analysis was inaccurate. \\nWhat is the Democratic Party’s former constituency of labor and progressive reformers to do? Are they to stand by and let the party be captured in Hillary’s wake by Robert Rubin’s Goldman Sachs-Citigroup gang that backed her and Obama? \\nIf the party is to be recaptured, now is the moment to move. The 2016 election sounded the death knell for the identity politics. Its aim was to persuade voters not to think of their identity in economic terms, but to think of themselves as women or as racial and ethnic groups first and foremost, not as having common economic interests. This strategy to distract voters from economic policies has obviously failed. \\nIt did not work with women. In Florida, only 51 percent of white women are estimated to have voted for Hillary. It didn’t even work very well in ethnic Hispanic precincts. They too were more concerned about their own job opportunities. \\nThe ethnic card did work with the blacks (although not so strongly; fewer blacks voted for Hillary than had showed up for Obama). Under the Obama administration for the past eight years, blacks have done worse in terms of income and net worth than any other grouping, according to the Federal Reserve Board’s statistics. But black voters were distracted from their economic interests by the Democrats’ ethnic-identity politics. \\nThis election showed that voters have a sense of when they’re being lied to. After eight years of Obama’s demagogy, pretending to support the people but delivering his constituency to his financial backers on Wall Street. “Identity politics” has given way to the stronger force of economic distress. Mobilizing identity politics behind a Wall Street program will no longer work. \\nIf we are indeed experiencing a revival of economic class consciousness, who should lead the fight to clean up the Democratic Party Wall Street leadership? Will it be the Wall Street wing, or can Bernie and perhaps Elizabeth Warren make their move? \\nThere is only one way to rescue the Democrats from the Clintons and Rubin’s gang. That is to save the Democratic Party from being tarred irreversibly as the party of Wall Street and neocon brinkmanship. It is necessary to tell the Clintons and the Rubin gang from Wall Street to leave now . And take Evan Bayh with them. \\nThe danger of not taking this opportunity to clean out the party now \\nThe Democratic Party can save itself only by focusing on economic issues – in a way that reverses its neoliberal stance under Obama, and indeed going back to Bill Clinton’s pro-Wall Street administration. The Democrats need to do what Britain’s Labour Party did by cleaning out Tony Blair’s Thatcherites. As Paul Craig Roberts wrote over the weekend: “Change cannot occur if the displaced ruling class is left intact after a revolution against them. We have proof of this throughout South America. Every revolution by the indigenous people has left unmolested the Spanish ruling class, and every revolution has been overthrown by collusion between the ruling class and Washington.” [1] Otherwise the Democrats will be left as an empty shell. \\nNow is the time for Bernie Sanders, Elizabeth Warren and the few other progressives who have not been kept out of office by the DNC to make their move and appointing their own nominees to the DNC. If they fail, the Democratic Party is dead. \\nAn indication of how hard the present Democratic Party leadership will fight against this change of allegiance is reflected in their long fight against Bernie Sanders and other progressives going back to Dennis Kucinich. The past five days of MoveOn demonstrations sponsored by Hillary’s backer George Soros may be an attempt to preempt the expected push by Bernie’s supporters, by backing Howard Dean for head of the DNC while organizing groups to be called on for what may be an American “Maidan Spring.” \\nPerhaps some leading Democrats preferred to lose with their Wall Street candidate Hillary than win with a reformer who would have edged them out of their right-wing positions. But the main problem was hubris. Hillary’s coterie thought they could make their own reality. They believed that hundreds of millions of dollars of TV and other advertising could sway voters. But eight years of Obama’s rescue of Wall Street instead of the economy was enough for most voters to see how deceptive his promises had been. And they distrusted Hillary’s pretended embrace of Bernie’s opposition to TPP. \\nThe Rust Belt swing states that shifted away from backing Obama for the last two terms are not racist states. They voted for Obama twice, after all. But seeing his support Wall Street, they had lost faith in her credibility – and were won by Bernie in his primaries against Hillary. \\nDonald Trump is thus Obama’s legacy. Last week’s vote was a backlash. Hillary thought that getting Barack and Michelle Obama to campaign as her surrogates would help, but it turned out to be the kiss of death. Obama egged her on by urging voters to “save his legacy” by supporting her as his Third Term. But voters did not want his legacy of giveaways to the banks, the pharmaceutical and health-insurance monopolies. \\nMost of all, it was Hillary’s asking voters to ignore her economic loyalty to Wall Street simply to elect a woman, and her McCarthy-like accusations that Trump was “Putin’s candidate” (duly echoed by Paul Krugman). On Wednesday, Obama’s former Ambassador to Russia, Michael McFaul tweeted that “Putin intervened in our elections and succeeded.” It was as if the Republicans and even the FBI were a kind of fifth column for the KGB. Her receptiveness to cutting back Social Security and steering wage withholding into the stock market did not help – especially her hedge fund campaign contributors. Compulsory health-insurance fees continue to rise for healthy young people rise as the main profit center that Obamacare has offered the health-insurance monopoly. \\nThe anti-Trump rallies mobilized by George Soros and MoveOn look like a preemptive attempt to capture the potential socialist left for the old Clinton divide-and-conquer strategy. The group was defeated five years ago when it tried to capture Occupy Wall Street to make it part of the Democratic Party. It’s attempt to make a comeback right now should be heard as an urgent call to Bernie’s supporters and other “real” Democrats that they need to create an alternative pretty quickly so as not to let “socialism” be captured by the Soros and his apparatchiks carried over from the Clinton campaign. \\nNotes. \\n[1] Paul Craig Roberts, “The Anti-Trump Protesters Are Tools of the Oligarchy,” November 11, 2016. Related '"}, "time": 1742561767.5727782}