{"duration": 0.04937410354614258, "input_args": {"text": "'  \\nThe decision of FBI Director Comey to go public with a supposed ‘bombshell’ investigation into new Hillary emails was welcomed by Trump as the mainstream media recklessly reported on this total dud of a controversy. It basically dominated the news cycle all day and probably will until we all cast out our vote next Tuesday (or November 28th if you support Trump.) \\nBut the politically motivated and reckless actions of Comey have many outraged, including Senate Democratic leader Harry Reid \\nSenator Reid appeared with Clinton today to push back against the “inappropriate,” “unprecedented,” and “puzzling” move by FBI Director James Comey to suddenly go public with new emails. Roughly two months removed from retirement, Reid is waging an all-out war on Comey as he claims a “disturbing double standard” took place in the FBI’s decision to publish this misleading announcement while essentially ignoring Trump. \\nReid pointed specifically to information the FBI allegedly has that ties Trump to Russia – information Reid says they have intentionally sat on in order to not hurt the candidate’s chances of being elected. \\nHe expressed his ire in a blistering letter to Comey. Here’s a key passage: \\nYour actions in recent months have demonstrated a disturbing double standard for the treatment of sensitive information, with what appears to be a clear intent to aid one political party over another. I am writing to inform you that my office has determined that these actions may violate the Hatch Act, which bars FBI officials from using their official authority to influence an election. Through your partisan actions, you may have broken the law. \\nAnd it’s not as though one can accuse Reid of being blindly partisan since he previously defended Comey when Republicans tried to filibuster his nomination and subsequently delay his confirmation. Reid wrote: \\n“I believed you to be a principled public servant.” \\nThe actions of Comey were indeed politically motivated as he desperately wished to be loved again by law & order conservatives. But Reid just opened up a whole new can of worms. \\nFeatured image via Alex Wong/Getty Images Share this Article!'"}, "time": 1742561721.526837}