{"duration": 1.5010721683502197, "input_args": {"text": "'What Is Causing The Strange Trumpet Sounds In The Sky All Over The World?   May 21st, 2015 \\nAll over the globe, people are recording extremely loud sounds coming from the sky. In many instances, these ominous noises sound like someone is blowing a trumpet. So what are we supposed to make of these “apocalyptic” sounds? Should we be concerned? Well, what we do know is that this is truly a global phenomenon. In addition to being heard at locations all over the United States and Canada, these sounds have also been recorded in Germany, Hungary, the Czech Republic, Denmark, Sweden, England, Costa Rica, Ukraine and France. If you go to YouTube and type in “strange sounds”, you will literally get hundreds of results from all over the planet. Of course there are many scientists that insist that there must be a “rational explanation” for these strange sounds. Some theories have suggested fracking, “rock bursts”, venting of high-pressure gas, atmospheric pressure or the natural “background noise” of our planet as the causes of these sounds, but so far none of those theories have been proven. But two things seem certain – these noises sure are creepy, and they just keep on happening. \\nAnd this phenomenon is now really starting to get a whole lot of attention. Just within the last month, there have been headlines about it in major new sources all over the planet. For instance, the following is a brief excerpt about this phenomenon from an article in the New York Post … \\nVideo clips from around the world have captured an evil-sounding ‘trumpet’ noise coming from the sky — but no one can explain exactly what it is. \\nA number of people have filmed the bizarre sound over the past 10 years with the latest coming from Germany. \\nVideo of this most recent incident that happened in Germany is posted below. What do you think could possibly be making this noise? … \\nAs I discussed above, similar sounds have been recorded all over the globe in recent years. Very quickly, let me share four examples with you that were recently included in an article by Melissa Dykes . \\nThis first one comes from British Columbia, Canada … \\nThis next one was recorded in Allen, Texas … \\nSimilar sounds have also been heard all the way on the other side of the planet. This example comes from Queensland, Australia … \\nLastly, this next remarkable video comes from Melbourne, Australia … \\nPersonally, I have no idea what is causing these sounds. But so many people around the world are experiencing them that it seems to rule out a hoax. \\nSo how can we explain them? \\nThe following theories were put forward by the Daily Mail … \\nTectonic plates grinding – Tectonic plates are pieces of the Earth’s crust and uppermost mantle, together referred to as the lithosphere. The plates are around 100 km (62 mi) thick and consist of two principal types of material: oceanic crust (also called sima from silicon and magnesium) and continental crust (sial from silicon and aluminium). \\nAtmospheric pressure – Atmospheric pressure is defined as the force per unit area exerted against a surface by the weight of the air above that surface. \\nTrains shunting – Self explanatory – noise comes from trains in reaction to the track and overhead wires. \\nConstruction – Building works, especially if going on at the same time across a specific area, can led to similar sounds. \\nAliens – Can this be an alien lifeform in the sky, perhaps scouring out Earth? \\nHAARP weapon – Rumours persist that the U.S. government uses secret weapons in the sky for defence and weather modifying, the High Frequency Active Auroral Research Program (HAARP). This wouldn’t explain the sounds in other countries however… \\nThe Apocalypse and the Seven Trumpets of Heaven – Seven trumpets are sounded, one at a time, to cue apocalyptic events that were seen in the vision of the Revelation of Christ Jesus, by John of Patmos. Somewhat more worrying as it would signal the end of the world… \\nThe scientists at NASA have a different explanation. What they think is being heard is simply the natural background noise that our planet is constantly producing… \\nAccording to NASA, it could be the earth’s ‘background noise’. \\nA statement from the agency said: ‘If humans had radio antennas instead of ears, we would hear a remarkable symphony of strange noises coming from our own planet. Scientists call them “tweeks,” “whistlers” and “sferics.” \\n‘They sound like background music from a flamboyant science fiction film, but this is not science fiction. Earth’s natural radio emissions are real and, although we’re mostly unaware of them, they are around us all the time.’ \\nTo me, that explanation by NASA doesn’t really ring true, but I don’t have a really good explanation either. \\nSo what do you think? \\nDo you believe that you know what is causing these strange sounds? \\nPlease feel free to share your thoughts by posting a comment below… \\nEffing creepy at that. Just Truth \\nThe article that said that HAARP can be ruled out isn’t correct. It says: “This wouldn’t explain the sounds in other countries however…” \\nHAARP was developed to advance nonlethal weapons in other countries, and works by bouncing frequencies off the ionosphere, thus being able to direct them to any part of the globe. naked swimmer \\nAlso all the millions of other energies going into the air could be causing noises. Just think of all the antennas going up every year & satellites being launched !! \\nIn the book Toxic Electricity 2nd ed. it says that one thing that could be causing colony collapse disorder is wireless energy. Visible light is way less than 1% of the spectrum. \\nToxic Electricity & Dirty Electricity are interesting books. People don’t realize how much impact electricity & wireless is having on the environment. kfilly \\nI believe this is a sign of the end times. There are too many things that seem to be lining up with the book of Revelations (global government, wars/rumors of wars, disease, famine, and the proposed digital currency by Jamie Dimon of JP Morgan Chase). The bible was written way before this, and events are mirroring what has been predicted a very, very long time ago. jaxon64 \\nAll of creation cries out in longing…… Crawford Tillinghast \\nMore like your reality is fracturing and no matter what you believe in, it cannot protect you from what lays Beyond. CarriedbyGrace \\nWe who have Christ have perfect peace and no fear. These are extremely exciting times and we look forward to what is turning out to be a spectacular and supernatural time in our lives. Elaine Perkins \\nThe number one sign is Israel becoming a nation again in 1948, after years of being dispersed all over the World, the Jews are gradually returning home; And they are speaking their Hebrew language again after 2,000 years. One major sign that this is the last days is that the World is turning against Israel and what for: Because they will not give up that little tiny speck of real estate that you have to get a magnifying glass to see it on the Middle East map, that is IF you can find a Middle East map with Israel listed on it anymore. I have posted the land owners in the Middle East many times for ALL to see; But the Anti-Israel Haters will not admit the TRUTH when it is before them. I am posting it one more time below: \\nSquare land 0.6 of 1.0% 8,059 Million Arabia’s 756,981 29.2 Million Iraq’s Iran’s land 636,374 76 Million There has never been a Palestinian people. This is something that the Romans did when they conquered Jerusalem from the Jews. These so called Palestinians are Arabs; They are not Jews and do not belong in Israel or Jerusalem. They belong with their own people. folgers22 \\nThis story is spooky, but when I listen to the sounds on the videos, they don’t really sound like trumpets to me. I would love to hear majestic music from the skies, because I know what that would mean, but what I hear sounds more like industrial equipment or slow-moving trains and other man-made noises.– I wouldn’t want to stampede to an assumption on this one. Did anyone see that movie, Red State, where a group of Christians stops dead in their tracks when they hear a booming trumpet from the skies and assume it’s the end of the world, not realizing some college kids down the road are fooling around with an iPod full of trumpet mp3s and a firestation siren horn? (There’s a lot more to the plot, but that twist at the end seems oddly apropos here.)– My town is a nexus point for several different railroad lines and several switching yards and a commuter rail line. I hear a lot of trains during the day and night. Some of these sounds remind me of the sounds I hear when they’re shunting trains back and forth and moving the big heavy cargo trains through slowly, especially at night when there aren’t as many competing sounds.– I am not an expert on the atmosphere and what it might be able to do with sound, but I do know it can have an effect on sound. For instance, I’ve always heard you can hear noises easier across open water than through the woods.– It also has an effect on radio waves. Folks who know radio know the layers of the atmosphere can do strange things with radio waves. For instance, when the weather is right, you can pick up an AM radio station transmitting hundreds or thousands of miles away when the signal bounces off the troposphere down to you somewhere over the horizon.– Last year, I read an article explaining how changes in temperature at different altitudes can warp visible light. The article explained the Titanic might have sunk within visual range of the Carpathia, but due to the effects of cold and warm layers of air, witnesses saw something totally different from the largest cruiseship in the world sinking 5 miles away.– So I wonder if sound can react the same way; originating from one point, bouncing around from one temperature layer to another, then coming down elsewhere distorted and unrecognizable as these sounds? Sandbagger \\nYou have the best explanation I’ve heard. Trumpets from God it’s not. Do I believe God when he says he will use trumpets? Yes. But I believe what another poster said…there will be NO DOUBT as to them BEING TRUMPETS. \\nThe wild-eyed proclamations that these sounds are THOSE final trumpets only serve to make Christians look nutty. Perhaps that is one interpretation of the scripture: \\nEphesians 4:14 (KJV) That we henceforth be no more children, tossed to and fro, and carried about with every wind of doctrine, by the sleight of men, and cunning craftiness, whereby they lie in wait to deceive; folgers22 \\nThank you! I feel exactly the same way-if it really happens, it will be incontrovertible, unarguable, definite 100% honest-to-goodness trumpets. If this were truly the work of God, why would it be spread out over the course of years in different places and why would it sound so mundane?– You would think an omnipotent omniscient being would be able to sound real trumpets simultaneously everywhere worldwide and ensure not one of us would be able to miss it.– I wouldn’t be surprised if/when the day comes that you even hear the trumpets inside, even over your iPod. I don’t think He would let a single one of us escape the message.– I think if you go with Occam’s Razor and look for the most likely explanation, peculiar atmospherics+terrestrial sound makes the most sense. HumbleAmerican \\nUntil something actually happens, they’re just noises. Was looking for Jesus in the clouds, but he didn’t return, again! In current news, a major oil spill in California, 9 miles of a beach covered. So we’ll see if gas prices go up. It’s about time for a gas spike. Mike \\nWell, if you read the book of Revelation, you’ll see that Jesus comes back at the end in an event called the Day of Lord or the Second Coming. Before Jesus returns you will see the rise of the Antichrist and a one world government. And when all nations go to attack Jerusalem under the antichrist’s rule, Jesus will return. No pretribulation rapture is coming. We’re all going to go through it (Christian and Non-Christian) if indeed we are in the last of the last days. HumbleAmerican \\nAs I stated below, I apologize for bringing Jesus in to the conversation. It has nothing to do with the article, and was wrong of me. \\nI would agree. We are all in this sh** storm together. Hold on tight, endure to the end and PRAY! uisconfruzed \\nSo Mike, it appears you’re a post tribber. Are you reformed as well? I thought I was the only one by reading these comments. CarriedbyGrace \\nThis topic is so touchy but my husband and I were just discussing this earlier this evening so here goes. My husband contends that if one of the major goals of the anti-christ is to kill Jews and Christians, how is it possible for the catching up to happen before the anti-christ comes on the scene, who would he kill if we were all gone? Why are there so many warnings and signs described in the Bible if there were no Christians left here to heed them? Is our catching up in the clouds going to happen simultaneously to Christ’s coming to defeat anti-christ or prior to that time. Sheesh, I have been studying the bible for almost 40 years and I still can’t definitively say anything other than Pre-Wrath rapture. algol2000 \\nThere isn’t going to be any rapture. He who endures to the end shall be saved. Joe Woolf \\nI agree….. We’re all going at the 7th trump together. ( that’s the last trump ) \\nIt’s a touchy topic around many Christians but, I don’t believe there will be any “rapture” happening before the last trump. David \\nYou know, for having the Screen name ‘HumbleAmerican’ you could sure use some humbling. What I mean by that is, if all you’re worried about is gas prices than you need a major wake-up call, brother! Just look around what’s going on in the world today, and you’ll see that there are Volcanoes erupting, along with Earthquakes and diseases, wars AND rumors of more wars to come. \\nI also heard the sound, what I believe is a Trumpet blasting off. It was the 19th of April, and I was discussing with my daughter about how so many people aren’t considering the facts that are being presented right in front of them; ignoring what may be to ensure their own happiness, and self-security. We may soon be at Civil or Foreign or BOTH in this country! Soon after I had gotten done telling it to her, the trumpet sound was coming from outside. She walked to the door and opened it up more, and said silently, “It sounds like there’s a war going on right now.” That’s when I got up and walked to the door to hear it sounding off. It’s just a shame in the sense that it was raining outside! I’d be able to hear it better, but then again, if you believe that it’s a trumpet declaring the End of Days is nigh, than you know that you’ll get another chance to hear it again. \\n“But while they were on their way to buy the oil, the bridegroom arrived. The virgins who were ready went in with him to the wedding banquet. And the door was shut. \\n“Later the others also came. ‘Lord, Lord,’ they said, ‘open the door for us!’ \\n“But he replied, ‘Truly I tell you, I don’t know you.’ \\n“Therefore keep watch, because you do not know the day or the hour. Matthew 25:10-13; NIV. HumbleAmerican \\nI’m very humble, I boast about nothing, because I have nothing. Gas prices affect everyone, in one way or another. As for what’s going on in the world, natural disasters have been happening for thousands of years. Wars and rumors of wars have happened for thousands of years. Diseases have been around since man arrived on earth. I do apologize for bringing Jesus in to the conversation. It has nothing to do with the article, and was wrong of me. \\nIt’s up to nine miles now? They said it was only four. And it’s not making much mainstream news. But have u seen the pictures? Heart breaking. uisconfruzed'"}, "time": 1742563605.922954}