{"duration": 0.08776545524597168, "input_args": {"text": "'NTEB Ads Privacy Policy Investors Flock To West Texas As $900 BILLION Oil Field Discovered In Permian Basin Wolfcamp Oil explorers have been flocking to the Permian Basin in West Texas and New Mexico to tap deposits so rich that they can generate profits even at lower oil prices. by Geoffrey Grider November 16, 2016 In a troubled oil world, the Permian Basin is the gift that keeps on giving. \\nOne portion of the giant field , known as the Wolfcamp formation, was found to hold 20 billion barrels of oil trapped in four layers of shale beneath West Texas. That’s almost three times larger than North Dakota’s Bakken Play and the single largest U.S. unconventional crude accumulation ever assessed, according to the U.S. Geological Survey . At current prices, that oil is worth almost $900 billion. \\nThe estimate lends credence to the assertion from Pioneer Natural Resources CEO Scott Sheffield that the Permian’s shale could hold as much as 75 billion barrels, making it second only to Saudi Arabia’s Ghawar field. Irving-based Pioneer has been increasing its production targets all year as drilling in the Wolfcamp produced bigger gushers than the company’s engineers and geologists forecast. “The fact that this is the largest assessment of continuous oil we have ever done just goes to show that, even in areas that have produced billions of barrels of oil, there is still the potential to find billions more,” Walter Guidroz, coordinator for the geological survey’s energy resources program, said in the statement. Oil explorers have been flocking to the Permian Basin in West Texas and New Mexico to tap deposits so rich that they can generate profits even at lower oil prices. A race to grab land in the Permian has been the main driver of a surge of deals in the energy patch and the industry’s main source of good news. Although the Permian has been gushing crude since the 1920s, its multiple layers of oil-soaked shale remained largely untapped until the last several years, when intensive drilling and fracturing techniques perfected in other U.S. regions were adopted. The Wolfcamp, which is as much as a mile thick in some places, has been one of the primary targets. ConocoPhillips , the world’s largest independent oil producer by market value, increased its estimate for the size of its Wolfcamp holdings on Nov. 10 to 1.8 billion barrels from 1 billion last year. A day earlier, Concho Resources CEO Timothy Leach told investors and analysts that two recent wells it drilled in the Wolfcamp were pumping an average of 2,000 barrels a day each. Diamondback Energy Inc. disclosed last week that it has been drilling 10,000-foot sideways wells in the Wolfcamp. Production from the wells has been as high as 85 percent crude, according to the Midland, Texas-based explorer. For Apache Corp., a slice of the Wolfcamp and another Permian layer known as the Bone Spring are major components of the 3 billion-barrel Alpine High discovery that the company announced in September. CEO John Christmann called Alpine High “a world class resource” during a Sept. 7 presentation at a Barclays Plc conference in New York. The Wolfcamp shale also holds 16 trillion cubic feet of natural gas and 1.6 billion barrels of gas liquids, the geological survey said in a statement on Tuesday. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742563613.1764352}