{"duration": 0.16620850563049316, "input_args": {"text": "'Donald Trump, in his   speech on immigration in Phoenix on Wednesday, pressed his   approach to illegal immigration, even as he backed off a previous pledge to forcibly remove 11 million immigrants here illegally. • Build the wall. • End the catch and release policy for undocumented immigrants and instead return them to their country of origin. • Have zero tolerance for undocumented immigrants who have committed a crime, and deport them. • Triple the number of deportation officers at the department of Immigration and Customs Enforcement. • Repeal President Obama’s executive orders that temporarily protected undocumented immigrants from deportation and authorized them to receive work permit • Stop issuing visas to any country where “adequate screening cannot occur” that might endanger national security. • Ensure foreign countries take back deported immigrants from the United States (Mr. Trump said 23 countries refuse to do so). • Complete a biometric entry and exit visa tracking system under development. “It will be on land, it will be on sea, it will be in the air,” he said. • Mr. Trump made the case that Washington elites and the media have put the focus, wrongly, on the plight of an estimated 11 million undocumented immigrants in the country, rather than the Americans impacted by their presence. “Anyone who tells you that the core issue is the needs of those living here illegally has simply spent too much time in Washington. Only the out of touch media elites think the biggest problems facing American society today is that there are 11 illegal immigrants who don’t have legal status. ” • Trump ticked through the names of three Americans who were killed by undocumented immigrants. These are staples of his speeches and familiar to his audiences at this stage of the campaign. He has held them up as examples of an immigration system run amok with tragic consequences. • Comparing himself to Hillary Clinton, who he maligned throughout the speech, Mr. Trump asked: “What do you have to lose? Choose me. ” It was an echo of a much mocked question he asked black voters recently. • “Maybe they’ll be able to deport her. ” Mr. Trump wondered provocatively, whether it’s possible to send Mrs. Clinton out of the country. • A memorable passage from this speech: “Our message to the world will be this: You cannot obtain legal status or become a citizen of the United States by illegally entering our country. Can’t do it. This declaration alone will stop the crisis of illegal crossing. You can’t just smuggle in, hunker down and wait to be legalized. Those days are over. ” • Mr. Trump invited onto the stage the mothers and fathers of Americans whose children were killed by undocumented immigrants. He asked each to describe their children and how they died. He then kissed many of them on the cheek. It was the most emotional moment of the speech. “If you don’t vote Trump, we won’t have a country,” one of the mother told the audience. Mr. Trump, first reading slowly from a statement and then speaking more freely in response to a question, said he now considered Mr. Peña Nieto a friend and heaped praise on Americans of Mexican descent.   Mr. Trump said, were “beyond reproach” and “spectacular,   people. ” But Mr. Trump said he also told Mr. Peña Nieto directly that he felt Mexico had benefited disproportionately from its trade agreements with the United States, and that he had described illegal immigration as a problem for both countries. Mr. Trump said the two did not discuss the issue of forcing Mexico to pay for a border wall  —   one of the signature promises of his campaign. Mr. Peña Nieto did not challenge the idea during the news conference but later posted on Twitter that, during his meeting with Mr. Trump, he had made it clear that Mexico wouldn’t pay for the wall. Mr. Peña Nieto pushed back in the gentlest of terms on several of Mr. Trump’s claims on Nafta, citing U. S. Chamber of Commerce statistics to argue that free trade had been beneficial for both countries and stressing the economic importance of easy movement across the border. Without mentioning specific remarks by Mr. Trump, Mexico’s president said that hurtful comments had been made. “Mexican nationals in the United States are honest people, working people,” he said, adding, “Mexicans deserve everybody’s respect. ” But Mr. Peña Nieto stopped well short of scolding Mr. Trump on the international stage. On the contrary, he expressed optimism that they could work together if Mr. Trump was elected president, “even though we do not agree on everything. ” The showing was something of a surprise, considering the sense of betrayal among many Mexicans, who feel that their president sold them out to the worst possible person. By the start time of 11 a. m. there were dozens of journalist but only a few protesters. A   later, the number of protesters  —   at least those being vocal and carrying   signs  —   seemed stuck at four, including a guy wearing a Mexican wrestling mask, while the number of journalists topped 50. By 12:30 p. m. there were no more than 10 demonstrators, while the journalist pack continued to balloon. Still, the protesters did their best to represent the anger and disappointment that many Mexicans have expressed toward Mr. Trump as well as toward Mr. Peña Nieto, who is struggling with low approval ratings and a string of scandals. He has spoken out sharply against Mr. Trump in the past, saying in a television interview last month that there was “no way” Mexico would pay for a border wall, and earlier comparing Mr. Trump’s campaign to the rise of Hitler. “The president didn’t represent the Mexican people, he didn’t consult with us,” said the demonstrator in the wrestling mask, who called himself “Maldito Perro”  —   Damned Dog  —   though later said his real name was Diego Garcia. He admitted to being disappointed by the anemic turnout. Social media activity, he lamented, seemed to be replacing the   tradition of the street protest.'"}, "time": 1742563207.319206}