{"duration": 0.04729318618774414, "input_args": {"text": "'LOS ANGELES  —   Hollywood’s   summer lineup continued to falter over the weekend, at least in North America, as two movies carrying a combined $500 million in production and global marketing costs arrived to $57. 7 million in total ticket sales. “The BFG,” directed by Steven Spielberg and released by Walt Disney Studios, was envisioned as a return to family form for the director  —   marketing materials reminded consumers that he made “E. T. ”  —   but it ended up as a colossal misfire. The movie, an   fantasy that drew appreciative reviews, took in about $19. 6 million Friday through Sunday, according to comScore, which compiles box office data. Faring better was “The Legend of Tarzan. ” Starring Alexander Skarsgard as the   and made by Warner Bros. and Village Roadshow, “Tarzan” collected roughly $38. 1 million over the   period. That total was much higher than analysts predicted before release. Most critics turned up their noses, but audiences gave the film an   in CinemaScore exit polls, suggesting positive word of mouth. Even so, “Tarzan” remains squarely in the loser column when it comes to profitability. Loaded with visual effects  —   violent apes, stampeding wildebeests  —   the movie cost a   $180 million to make, not counting marketing. “This property has always really been about the international opportunity,” Jeff Goldstein, Warner’s executive vice president of domestic distribution, said by phone on Sunday. “You can best assess it a month from now. ” Directed by David Yates and   Margot Robbie, “Tarzan” opened in limited overseas release over the weekend, taking in $18. 8 million. Important markets like Britain and China are still to come. While acknowledging a “frustrating” result for “The BFG” at home, David Hollis, Disney’s distribution chief, also pointed to international audiences as a potential salvation for the movie, which is based on a book by Roald Dahl. “We’re really proud of the film,” Mr. Hollis said. “We’re going to be reliant in a lot of ways on international. ” So far, “The BFG” has opened in only two overseas markets, Russia and Australia. With “The BFG” collapsing in North America and “Tarzan” not exactly sizzling, the No. 1 movie on Hollywood’s home turf over the July Fourth weekend was again “Finding Dory. ” That sequel, from Disney’s Pixar division, took in an estimated $41. 9 million for a   domestic total of $372. 3 million. “Tarzan” was second. Third place went to “The Purge: Election Year” (Universal) a horror sequel that cost only $10 million to make and roughly $20 million to market. It sold a strong $30. 9 million in tickets. Blumhouse Productions, the   company behind the “Purge” series, has successfully kept this franchise going by pursuing different storytelling styles. The previous installment had action underpinnings this one added a political dimension. The summer box office always has ups and downs, but the current season has been much bumpier than usual. Disney has found two monster hits (“Finding Dory” and “Captain America: Civil War”) but has also suffered two major flops (“The BFG” and “Alice Through the Looking Glass”). Other   movies that have received a disappointing response from domestic audiences include “Independence Day: Resurgence,” “Teenage Mutant Ninja Turtles: Out of the Shadows” and “Warcraft. ” An   on sequels has been one reason for Hollywood’s rough ride. But analysts have cautioned about overgeneralizing at the season’s midway point. Several movies ahead could still salvage the summer box office, including “The Secret Life of Pets,” “Ghostbusters” and “Suicide Squad. ”'"}, "time": 1742628362.8466766}