{"duration": 0.18769550323486328, "input_args": {"text": "\"Pin \\n( ANTIMEDIA ) Before the presidential election, some Americans expressed hope that Donald Trump, if elected, would scale back U.S. militarism and the federal government’s habit of instigating and supporting regime change abroad. This hope came despite Trump’s promise to expand the scope of the American military. \\nOn the campaign trail, Trump criticized the Iraq war and nation-building. Since his election, he has garnered positive feedback from Russia, signaling cooling of tensions between the two large powers and highlighting a stark difference between Trump and his competitor, Hillary Clinton. But the president-elect’s impending choices for his cabinet and advisers should raise alarm for anyone interested in diminishing the U.S. military’s presence around the world. \\nHere are five figures who shatter the perception that Donald Trump will be a “peace” president: \\n1. Vice President-elect Mike Pence – Much of the nation is reeling over Pence’s regressive views on homosexuality and abortion, but one of his most damning stances is his support for traditional neoconservative foreign policy. When he was a House representative, Pence voted in favor of George W. Bush’s invasion of Iraq — the same one Trump has criticized. Pence has indicated the same type of hawkishness in his stance on Syria, which also contradicts Trump’s. \\n“ If Russia…continues to be involved in this barbaric attack on civilians in Aleppo, the United States of America should be prepared to use military force to strike military targets of the Assad regime ,” Pence said during one of the vice presidential debates this election cycle. Interestingly, his rhetoric sounds much like that of Hillary Clinton , who drew the support of many pro-war Republicans this year. \\nWith Joe Biden as his predecessor, it’s easy to assume Pence will have little tangible power, especially under a colossal personality like Trump. That being said, he recently said he views Dick Cheney as his role model. Cheney, one of the key architects and profiteers of the Iraq war, was largely believed to pull the strings of the Bush presidency. As President Obama previously joked : \\n“ A few weeks ago Dick Cheney said he thinks I’m the worst president of his lifetime, which is interesting, because I think Dick Cheney is the worst president of my lifetime .” \\n2. Rudy Giuliani — Rudy Giuliani is on Trump’s presidential transition team, and earlier this week he was he rumored to be up for the role of secretary of state. The New York Times reported Tuesday that Giuliani, who enthusiastically backed Trump’s campaign, is vying for the role of top diplomat and that Trump is inclined to reward his loyalty. Sign up for the free Anti-Media newsletter the establishment doesn't want you to receive \\nGiuliani, who was mayor of New York City during the 9/11 attacks in 2001, has long espoused hawkish policy in favor of security, often referencing the historic attacks as justification for his views. \\nHis lack of regard for rule of law is apparent in his recent statement that “anything’s legal” in war. He is apparently unaware of the Geneva Conventions . Giuliani was also a staunch proponent of the Iraq War and, unfortunately, fails to see the consequences of perpetual overseas intervention. \\nRon Paul attempted to explain these consequences during a 2008 presidential debate when both he and Giuliani were running for president. \\n“ We need to look at what we do from the perspective of what would happen if somebody else did it to us ,” Paul urged, attempting to explain that the United States’ ongoing bombing of the Middle East sows resentment and inspires terror attacks. \\nGiuliani ultimately insisted on adding to the conversation and was quick to invoke fear mongering and emotion surrounding 9/11: \\n“ That’s really an extraordinary statement. That’s an extraordinary statement, as someone who lived through the attack of September 11, that we invited the attack because we were attacking Iraq. I don’t think I’ve heard that before, and I’ve heard some pretty absurd explanations for September 11th. And I would ask the congressman to withdraw that comment and tell us that he didn’t really mean that .” \\nPaul did not retract that comment and rather, went on to explain the CIA’s concept of blowback and the United States’ meddling in Iran in 1953. \\nEight years later at the Republican national convention, Giuliani appeared to have ignored Paul’s warning, choosing instead to focus on the dangers of Islamic extremism without addressing the root causes but inserting plenty of 9/11 references. He promised terrorists that America is “coming for you.” \\nConsidering Hillary Clinton was able to leverage a war in Libya , weapons sales to regimes that donated to her foundation, and the failed policy of arming radical Syrian rebels in their fight against Assad, a Giuliani State Department could have violent ramifications. \\n3. John Bolton – Trump’s other potential secretary of state also adheres to establishment Republican party foreign policy. Bolton served as George W. Bush’s undersecretary, and in 2002, made wildly inaccurate claims about the impending Iraq war. As noted by the Atlantic : \\n“ Bolton was both a booster, and a minor architect, of the war in Iraq. As George W. Bush’s undersecretary of state in late 2002, he told the BBC that ‘We are confident that Saddam Hussein has hidden weapons of mass destruction and production facilities in Iraq.’ He added that ‘the Iraqi people would be unique in history if they didn’t welcome the overthrow of this dictatorial regime,’ and that although building a democracy would prove a ‘difficult task,’ the people of Iraq ‘are fully competent to do it.’ So competent, in fact, that ‘the American role [in post-war Iraq] actually will be fairly minimal.’ ” \\nAs Senator Rand Paul detailed in an op-ed explaining why he will oppose a Bolton appointment should it come to pass: \\n“ Bolton is a longtime member of the failed Washington elite that Trump vowed to oppose, hell-bent on repeating virtually every foreign policy mistake the U.S. has made in the last 15 years — particularly those Trump promised to avoid as president. \\n“ John Bolton more often stood with Hillary Clinton and against what Donald Trump has advised .” \\nBolton recently advocated war with Iran and is a member of the Council on Foreign relations, a foreign policy think tank. Dick Cheney is a member of the council and Hillary Clinton has lauded it for its leadership, which is guided by a litany of corporations , including Lockheed Martin, Goldman Sachs, JP Morgan Chase & Co., and Exxon Mobil Corporation. \\nAs Paul also noted, Bolton shares many policy aims with Clinton: \\n“ In 2011, Bolton bashed Obama ‘for his refusal to directly target Gaddafi’ and declared, ‘there is a strategic interest in toppling Gaddafi… But Obama missed it.’ In fact, Obama actually took Bolton’s advice and bombed the Libyan dictator into the next world. Secretary of State Clinton bragged , ‘We came, we saw, he died .’” \\nA Bolton State Department is, like a hypothetical Giuliani one, a recipe for continued aggression and reckless foreign policy. \\n4. James Woolsey – Few things scream “establishment” louder than appointing a former CIA director and key member of the Project for a New American Century (PNAC) to serve as a senior national security adviser. \\nPNAC was a pro-war think tank made up of prominent neoconservatives. It has since been disbanded, but archived versions of their website reveal the organization’s foundationally militaristic objectives). Woolsey has carried their torch. \\nAccording to the Intercept , Woolsey was a key supporter of the 2003 invasion of Iraq long before it transpired: \\n“ Woolsey signed a letter in 1998 calling on Clinton to depose Saddam Hussein and only hours after the 9/11 attacks appeared on CNN and blamed the attacks on Iraq. Woolsey has continued to insist on such a connection despite the complete lack of evidence to support his argument. He also blames Iran. ” \\nThe Intercept added: \\n“ He chairs the leadership council at the Foundation for the Defense of Democracies, a hawkish national security nonprofit, and is a venture partner with Lux Capital Management, which invests in emerging technologies like drones , satellite imaging, and artificial intelligence. ” \\nInterestingly, Woolsey also served as Vice President of Booz Allen Hamilton, the firm where whistleblower Edward Snowden worked before exposing the NSA’s secret surveillance programs. \\nWoolsey has said Snowden should be “ hanged by the neck until he’s dead, rather than merely electrocuted. ” \\nSo there’s that. \\n5. General Mike Flynn – Some have expressed optimism that Donald Trump included General Mike Flynn on his transition team and as a potential member of his administration. Flynn deviates from other militaristic members of Trump’s new team in that he’s willing to acknowledge the Iraq war was a mistake and has criticized Obama’s drone wars. Flynn played an active role in the wars in Afghanistan and Iraq. \\nAs he said last year: \\n“ When 9/11 occurred, all the emotions took over, and our response was, ‘Where did those bastards come from? Let’s go kill them. Let’s go get them.’ Instead of asking why they attacked us, we asked where they came from. Then we strategically marched in the wrong direction. ” \\nEven so, Flynn has criticized the Iran deal, and as the Intercept noted: \\n“ What Flynn appears to view as speaking honestly has a tendency to veer into dangerous and Islamophobic terrain. Earlier this year, he called for the destruction of Raqqa, the Syrian city captured by the Islamic State where tens of thousands of civilians remain trapped .” \\nFlynn has condemned elements of war, but his military mindset prevails. As the Intercept also observed: \\n“ Militarily, the campaign Flynn envisions would be ‘similar to the effort during World War II or the Cold War’ and would be guided by a single leader answering to the president. ” \\nFlynn may have issues gaining a key role in a Trump administration because of his previous role as Director of Intelligence for the Pentagon (he was ousted in 2014), as well as his consulting firm’s ties to a close ally of Turkish President Recep Erdogan, who has imposed authoritarian policies in Turkey. \\nAccording to the Wall Street Journal , Trump also recently added Frank Gaffney — a longtime hawk with a penchant for condemning Islam — to his transition team. The Trump campaign asserts he is not officially a member and is simply offering advice. \\nThough some may point to Trump’s potential partnership with Vladimir Putin as hope that some international conflicts may be resolved, Trump has willfully chosen to surround himself with establishment figures who contradict the foreign policy points he seemed to espouse — namely, the failures of regime change and the Iraq War. In fact, these individuals actually lean toward Hillary Clinton’s hawkish foreign policy agenda. \\nUnfortunately, Trump’s campaign promises to “bomb the hell” out of ISIS belie a chronically establishment foreign policy outlook — one sure to produce more terrorists in the indefinite, nebulous war against an ideology continually catalyzed by aggressive American militarism. \\nThis article ( 5 Trump Advisors Who Prove He’s More Like Hillary Clinton Than You Thought ) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to Carey Wedler and theAntiMedia.org . Anti-Media Radio airs weeknights at 11 pm Eastern/8 pm Pacific. If you spot a typo, please email the error and name of the article to . \""}, "time": 1742563229.5638845}