{"duration": 0.05118155479431152, "input_args": {"text": "'  Media Blackout: Hundreds Of Black Teens Attack Temple Students, Police And A Horse (Video) Media Blackout: Hundreds Of Black Teens Attack Temple Students, Police And A Horse (Video) October 27, 2016, 6:24 pm by Guest Author Leave a Comment 1 \\nBy: Renee Nal | New Zeal Still photograph of Temple university attack \\nIn a story that predictably did not make the mainstream media, and with video surveillance very difficult to find, a massive mob of black teens viciously attacked white Temple University students, police officers and even a police horse in Philadelphia on Friday night. \\nAnd their apologists are in full force. \\nIn the limited local coverage this story did receive, the race aspect was generally avoided. It is way past time to take back the media, and fill it with truth-tellers, not apologists. \\n“More than 150 teens, spread out in groups of 20 or 30, descended upon the campus at around 8:30 p.m. Friday — wreaking havoc for nearly two hours before eventually dispersing,” according to NBC 10 . Temple News reported that “multiple students were hurt and businesses had to close Friday evening due to a ‘flash mob’ of nearly 200 minors that flocked North Broad Street near Main Campus, police said.” \\nBut there is a reason for all of this horror, according to Solomon Jones of Philly.com . It evidently boils down to the socialist Gulag-wide Bulletins from Sovereignty Unbound We respect your privacy, time, and inbox. Track us Down @GulagBound Like the Gulag There are many important matters that Gulag Bound itself is not treating on a daily basis. For that reason we suggest The Globe & Malevolence and the sites shown under \"Key Links in our Chains,\" below. Your Daily Intelligence Brief MattSkosh on Secret Service Agents Pay a Visit to Anti-Obama Artist Sabo Tags activism Agenda 21 anti-American revolution authoritarianism Barack Hussein Obama II candidate eligibility collectivists & propaganda communisty organizations corruption crisis strategy Democrat finance & banking fraud George Soros globalism - NWO global Marxist-fascist movement government domination of resources history illegal immigration Islam Islamism jihad jihadism Israel kleptocracy labor unions Marxism Marxofascism Marxstream media Military Mitt Romney Obamacare health control Occupy Wall Street race-baiting/racism Republican Right of Private Property Russia Sovereignty Tea Party terrorism U.S. Congress U.S. Constitution U.S. Presidency (POTUS) United Nations (UN) video violence voting youth & education Sabotage What good will it do, to protect the United States of America, or our presumed interests against the aggressiveness of China, Russia, or Islam, if, partially in fear of these threats, we lose our free and independent nation to the stealth imperialism of transnational and global governance? As America threatens to shatter, we must see how a semi-covert, global, cartel collective and their NWO in the USA (\"progressive\" neo-Marxists and neo-fascists corporatists, updated with 21st Century techniques and technology) intentionally perpetrate this sabotage, while we patriots try to prevent it. Have a look around our camp, as we struggle to survive. - your tour guide Archives Militarization in America About DHS militarization, see the new, breakthrough analysis from James Simpson, \" Police Militarization, Abuses of Power, and the Road to Impeachment \" and our earlier, \"Marxist President’s Military Exercises in These U.S. Cities; Yours One?\" \\nAbout the trajectory of this, we must pray, communicate, keep calm, and do not become the first to engage. If it comes to it, do not even respond in kind, until after the after the first times that extreme, anti-American violence is done by them. It calls for an attitude of self sacrifice -- first cheek, second cheek, then no more. \\nAnd speak out about the potential and strategic \"sense\" of the Obama/NWO\\'s DHS carrying out false flag missions of violence, blaming it on American patriots, perhaps upon our militia movements. \\nWe are in a real war, right now (of which others and I have been trying to alert fellow Sovereign Citizens for years) and the prime war is for the minds, hearts, and wills of the American People. We are opposed by an anti-American insurrection using any means of power (see Gramsci, Frankfurt School) including government power, as they are granted that opportunity.'"}, "time": 1742561987.9970725}