{"duration": 0.10654067993164062, "input_args": {"text": "'Share on Twitter IJR Opinion is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nYou ask, “Why Trump?” From your college classrooms, comfortable suburban homes and your summer lakeside retreats in quaint New England towns, you wonder why. \\nWhile in class the professor comments, “Well, the main supporters of Trump are uneducated white males.” You, a new age liberal sympathizer - and my classmate - blurt out, “Uneducated white males shouldn’t have the right to vote!” \\nIs this the college experience I signed up for? I know I\\'m the type of person liberals like you disdain; I\\'ve spent about half my years on this earth working blue collar jobs: logging, haying, septic work, farming, stacking stone walls. I\\'ve owned two 1940s era tractors. You don\\'t know what true labor is. I do - I was born and bred into this lifestyle. \\nAll over this land, alarms go off before the dawn. You may work from 9 to 5 in a cozy office, but for the working class the day stretches from dawn to dusk. Sometimes it takes two or more jobs to make ends meet. “Work hard and you will be rewarded,” says the world. But those with the most wealth have only found ways to make others work hard for them. \\nAlthough I have chosen to not cast my ballot for the Republican ticket this time around, I have empathy for those who will - those whom you, modern liberalism, created. You outsource businesses and you coddle illegal immigrants who drive down the cost of labor - and therefore the benefits of a job. You, the rich, liberal elite, have taken advantage of those whose backs you live upon. You gutted them, you skinned them, you left them to hang like a deer carcass to bleed out. \\nOn top of it all, you say people like me are “white trash,“”standard rednecks“ and “dirty hicks.” The champions of social justice that attend my liberal arts college in rural Vermont call us “dirty townies.\" \\nWe grow your food, we transport your food, we build your homes and we keep them maintained - and yet we are snubbed. We plow the roads, fix the power lines and drive semi-trucks so that you can live a life of convenience. You cut our wages and our hours - yet you say we don’t work hard enough. \\nSince I was 12, I have worked for both rich Republicans and rich Democrats. At least the rich Republicans don\\'t preach all that Democrats do to save the world - while paying me dirt. Few of those who support Hillary Clinton have had to awaken at 3:45 A.M. to start a chainsaw in the dim light of dawn, to work a job where either that chainsaw, a wood chipper, or a falling tree could kill them any day - for the reward of $12 an hour, no less. What is the working man’s death worth to those with millions? \\nYou distract us with the media and you harp on racism, sexism and the insignificant. Where in your agenda is there time for the growing class struggle, the death of family farming, and the tearing of the fabric of rural New England life? You swoop in from elsewhere to buy the land, gentrify the towns, and reduce the local population to the same status as the English peasant after the enclosure movement . \\nYou speak of social programs, give to those who do nothing, give every child a trophy and shelter them from the realities of the world. You talk of raising taxes that the rich somehow never pay. You would rather take a loaf of bread from the working stiff to support the unemployed or those who drink away a college education. \\nThe question at hand should not be, “Why Trump?” The question at hand should be why you drove those who support him into a hole and then tied their hands behind their backs. You want them to support the broken system that gave you, not them, the benefit. Soon, you won’t have to worry about them supporting Trump; rum-filled farmers, a rabble in arms... \\nThose whom you called a “ basket of deplorables ” are the same stock that brought America into being. Yet, raise taxes, you say. Raise the cost of living, of each and every good that is bought and sold. The resulting burden will only fall upon those who labor their lives away, to struggle to exist, who always will. '"}, "time": 1742563972.2038858}