{"duration": 0.04782605171203613, "input_args": {"text": "'Storytelling matters desperately to Michael Chabon’s characters. It’s a way to remake an unhappy reality and exert control (“Werewolves in Their Youth”) a means of grappling with personal or historical disaster (“The Amazing Adventures of Kavalier  Clay”) or, in the case of his elegiac and deeply poignant new novel, “Moonglow,” a tool for connecting the dots of a family’s life and making sense of the past. “Moonglow” takes the form of a faux memoir by the narrator, Mike, a writer who bears more than a passing resemblance to the author himself. The story centers on tales told by his maternal grandfather as he lies dying of cancer, high on painkillers that have cracked his habit of silence and made him eager to spill “a record of his misadventures, his ambiguous luck, his feats and failures of timing and nerve. ” His grandfather’s disjointed accounts of being a soldier in World War II and his fascination with rocketry and space travel have a hallucinatory,   sheen, and they are tangled up with his wife’s enigmatic and contradictory retellings of her experiences in occupied France. Mr. Chabon weaves these   tales together into a tapestry that’s as complicated, beautiful and flawed as an antique carpet. The novel would have benefited from some rigorous editing  —   there are digressions about business travails,   rockets and “Gravity’s Rainbow” that are tedious and superfluous. But the fraying story lines seem to be a deliberate narrative strategy meant to convey the chaos of life and distortions of memory, and the bright threads of meaning that can be extracted, with imagination and will, from the mess. Mr. Chabon is one of contemporary literature’s most gifted prose stylists, and in novels like “Telegraph Avenue” and “The Yiddish Policemen’s Union,” he’s demonstrated his   mastery, his ability to move effortlessly between the serious and the comic, the existential and merely personal. In “Moonglow,” he writes with both lovely lyricism and highly caffeinated fervor. He conjures Mike’s childhood with Proustian ardor, capturing his fond memories of his mother (who smelled of Prell shampoo, making him think of those old TV commercials showing a pearl languidly drifting through the mentholated green) and his worst boyhood fears (convinced that a gaggle of   puppets were lying in wait, plotting to kill him). He makes Oakland, Calif. in the 1970s come alive  —   and does the same for Baltimore in the 1950s and Florida in the late 1980s. There are sharp, funny portraits of the many eccentric characters who wander through the lives of the narrator’s family, but it’s Mike’s grandfather who bestrides the novel  —   an Augie   hero who careens through life like a wildly thrown bowling ball, knocking over those who stray into his path while nearly crashing his own dreams. He goes at things freestyle, and often seems like the very embodiment, in Mr. Chabon’s mind, of America itself  —   proud, romantic, naïve, impulsive. He’s a roughneck and a dreamer, a pool hustler and a soldier, a jailbird and an engineer enraptured by the space race and the moon shot. “One glance at you and I know the whole story,” William J. Donovan, head of the Office of Strategic Services, who recruits him during World War II, says. “You’ve been looking for trouble all your life. ” His grandfather’s romance with the woman who becomes his wife  —   a French refugee who already has a young daughter (who will grow up to become Mike’s mother)  —   is a love story about two people who build new lives together after the war but who can never really manage to swim free from the undertow of the horror they witnessed in   Europe. His grandfather suffers from a form of   stress disorder, while his grandmother slips into bouts of madness that seem to be part mental illness, part guilt or shame over something that happened to her during the war. The novel’s title and some of its most moving passages come from his grandfather’s fascination with spaceflight. During the war, he becomes obsessed with rocketry and Wernher von Braun  —   the brains behind Nazi Germany’s   rocket, who would later oversee development of the rockets that propelled Americans to the moon. His grandfather drives to Cape Canaveral, Fla. for every space shuttle launch and gets a job with NASA building scale models of aircraft and vehicles as part of the educational and research and development process. He once promised his wife that he would fly her “to find refuge on the moon,” and after her death, he pictures the two of them in spacesuits like the ones worn by the astronauts in “2001: A Space Odyssey”  —   “an orange one for him, a blue one for her”  —   out for a spin in a lunar rover. He imagines her “cutting flowers in her hydroponic garden as the world hid its nightside and peace descended on their refuge in space. ” Although “Moonglow” grows overly discursive at times, it is never less than compelling when it sticks to the tale of Mike’s grandparents  —   these damaged survivors of World War II who bequeath to their family a legacy of endurance, and an understanding of the magic powers of storytelling to provide both solace and transcendence.'"}, "time": 1742628603.36953}