{"duration": 0.04756641387939453, "input_args": {"text": "'Frank Camp November 13, 2016 \\nDuring an interview with Lesley Stahl for 60 Minutes , which will air in its entirety Sunday night, Donald Trump began to walk back his campaign promise regarding the deportation of illegal immigrants: \\n\"We are getting them out of our country,\" the president elect said about the several million illegal immigrants with serious criminal records. \"After the border is secure and after everything gets normalized, we\\'re going to make a determination on the people you\\'re talking about who are terrific people, they\\'re terrific people who we\\'re going to make a determination on, but before we make a determination, we want to secure our border.\" \\nGasp. \\nDonald Trump rose to political fame on the back of his strong stance on illegal immigration. Throughout the primary process, he promised a \" deportation force ,\" telling MSNBC\\'s Mika Brzezinski in November 2015: \\n\"You\\'re going to have a deportation force, and you\\'re going to do it humanely. Don\\'t forget, Mika, that you have millions of people that are waiting in line to come into this country and they\\'re waiting to come in legally. And I always say the wall, we\\'re going to build the wall. It\\'s going to be a real deal. It\\'s going to be a real wall.\" \\nIn August, Trump delivered a major immigration speech in Phoenix, Arizona, in which he softened his stance a bit, focusing on illegal immigrants who have committed serious crimes: \\n\"Within ICE, I am going to create a new special deportation task force focused on identifying and quickly removing the most dangerous criminal illegal immigrants in America who have evaded justice.\" \\nHe then added that \"anyone who has entered the United States illegally is subject to deportation. That is what it means to have laws and to have a country. Otherwise we don’t have a country.\" \\nDuring the final presidential debate between Donald Trump and Hillary Clinton, Trump reiterated his position against amnesty: \\n\"Well, first of all, [Clinton] wants to give amnesty, which is a disaster and very unfair to all of the people that are waiting on line for many, many years. We need strong borders.\" \\nFor Trump diehards, these statements were enough. Their guy was going to deport 11 million illegal immigrants, and no one would tell them otherwise. However, as anyone with access to Google should know, the president elect has long supported amnesty in some fashion. \\nIn July 2015, Donald Trump told CNN\\'s Dana Bash: \\n\"I would get people out and then have an expedited way of getting them back into the country so they can be legal…A lot of these people are helping us…and sometimes it’s jobs a citizen of the United States doesn’t want to do. I want to move ’em out, and we’re going to move ’em back in and let them be legal.\" \\nWhat Trump was talking about is known as \"touchback amnesty.\" Such a plan would indeed involve the deportation of illegal immigrants, but allow them an expedited means of returning to the United States in order to obtain legal status. In other words, they touch base in their home country, then come right back. \\nIn November 2015, Eric Trump repeated his father\\'s plan during an interview with Fox News\\' Megyn Kelly: \\n\"The point isn’t just deporting them, it’s deporting them and letting them back in legally. He’s been so clear about that and I know the liberal media wants to misconstrue it, but its deporting them and letting them back legally.\" \\nGoing back further, Trump\\'s support for amnesty is even more stark. Speaking on Fox & Friends in 2012, he said: \\n\"For people that have been here for years that have been hard-workers, have good jobs, they’re supporting their family–it’s very, very tough to just say ‘By the way, 22 years, you have to leave. Get out’…I’m one of the world’s very conservative people, but I have to tell you on a human basis, how do you throw somebody out that’s lived in this country for twenty years?\" \\nDuring the 2012 presidential election cycle, Trump even called Mitt Romney\\'s idea of self-deportation \" maniacal ,\" and remarked that Republican Party policy toward illegal immigrants was \" mean-spirited .\" \\nDonald Trump is a man who will say whatever he needs to in order to win. Now that he has won, he\\'s already backtracking on multiple campaign promises, from the repeal of the Affordable Care Act (ACA) to the deportation of illegal immigrants. Tags '"}, "time": 1742628605.9015718}