{"duration": 0.033196210861206055, "input_args": {"text": "'Despite being told by their unions not to vote for   migration presidential candidate Marine Le Pen, many French police are voting for Le Pen, who they feel will restore law and order to France. [The police union “Alliance” have made it clear that they want officers in their union not to vote for Marine Le Pen on their website saying they want to, “block the candidate who challenges social democracy. ” The National Union of Independent Trade Unions have proclaimed the same message but many police say they will vote for Le Pen because they feel she can restore order to the streets of France plagued by violence and terrorism L’Express reports.  One of these officers is    Lucas who said that he had initially voted for the   candidate   Melenchon in the first round. Explaining why he will be voting for Le Pen he said, “I want things to change,” and didn’t believe that Macron’s policies were any different from the mainstream parties. Lucas said that he didn’t fully agree with Le Pen’s stance on migration, but her policies regarding law and order spoke to him as a police officer. At the moment, he said, “the rights of those held in police custody are more taken into account than those of the victims. ” Arnaud, an officer in Savoy, agreed with Lucas saying, “if the policemen vote Le Pen it is mainly for the security policies. I vote FN by default because there are no candidates who match me. ” The    also had choice words for Le Pen’s globalist rival Emmanuel Macron saying he was, “haughty and typically corresponds to the Parisian city dweller. ” Arnaud noted that it was not just in Paris where terror attacks have occurred and he is afraid Macron will reduce the number of officers in the future. “When one knows the realities of the ground,” voting for Le Pen is the logical choice said    Pierre who has been a Front National supporter for 30 years. “Security has to be a priority, everything stems from that,” he said. The officers are also supported by the majority of the armed police, known as the Gendarmerie, as a poll showed 51 percent supporting Le Pen in the first round and likely more in the second. Police are often on the receiving end of violence from   extremists as was the case earlier this week when several officers were injured during an   Pen march after extremists threw firebombs at them. Police are also targets for radical Islamic extremists and Islamic state terrorist fighters. Last month a police officer was gunned down on the Champs Elysee by a known Islamic radical and last year another Islamist invaded the home of a senior officer in Paris stabbing him and his wife to death. Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com '"}, "time": 1742628389.767616}