{"duration": 0.0826578140258789, "input_args": {"text": "'Stephen Colbert has come under fire on social media for a crude joke he made about President Donald Trump on Monday’s broadcast of The Late Show that some critics claimed was bigoted and homophobic. [While attempting to defend his CBS colleague John Dickerson, Colbert said Trump’s mouth is only “good for is being Vladimir Putin’s c*ck holster. ”  Outraged by the remark, social media users quickly made the hashtag #FireColbert a top trending topic on Twitter Tuesday. “Colbert’s homophobic rant was disgusting and we won’t tolerate this   behavior,” one user wrote. “Liberals ruin the careers of conservatives all the time, so the #FireColbert campaign is just giving libs a taste of their own medicine,” argued another. Some called Colbert a “homophobe” and a “bigot. ” #FireColbert Colbert is a  . Here’s all of   advertisers Contact them tell them stop funding him https:  .  pic. twitter.   —   Red Pill⏳ (@RedPillDropper) May 2, 2017,  Liberals ruin the careers of conservatives all the time, so the  #FireColbert campaign is just giving libs a taste of their own medicine.  —   Mark Dice (@MarkDice) May 3, 2017,  Hey @CBS #StephenColbert is NOT a comic. I NEVER tune in because of his   attitude towards @POTUS @realDonaldTrump #FireColbert,  —   Rep. B. J. Nikkel (@RepBJNikkel) May 3, 2017,  #firecolbert CBS STAND UP AND DO THE RIGHT THING FIRE COLBERT THIS SHOULD NOT BE TOLERATED, IF IT WAS SAID ABOUT OBAMA HE WOULD BE GONE,  —   MIKEM (@09BRAININJURY) May 2, 2017,  So, Colbert is saying homophobic things again? Disappointing that CBS supports and empowers this. #firecolbert,  —   Michael Oxley (@Truthchampion16) May 2, 2017,  I don’t know that it was homophobic, but Colbert’s comment was very inappropriate and not funny enough to be worth the risk  #firecolbert,  —   Kimbro13 (@kimbro1360) May 2, 2017,  Some social media users called for a boycott of CBS and the network’s advertisers. Time for him to go.  Total trash.  I will boycott advertisers. #FireColbert,  —   hank_1972 (@Hank_1972) May 3, 2017,  Boycott CBS #FireColbert,  —   Tricia Ann (@TriciaC0324) May 3, 2017,  German Lopez, a reporter for   news outlet Vox, wrote that Colbert’s joke pointedly mocked gay people. “In a setting in which Colbert is deliberately trying to find a way to insult Trump, it’s telling that he resorts to suggesting that Trump is engaging in sexual acts with another man. The suggestion is that the worst thing that could happen for these men is if they engaged in homosexual acts together, as if that devalues them as men or emasculates them. ” Colbert’s      monologue also included fat jokes about President Trump. “Mr. President, I love your presidency. I call it ‘Disgrace the Nation,’” he began. “You’re not the POTUS you’re the ‘BLOTUS.’ You’re the glutton with the button. You’re a regular ‘Gorge Washington.’ You’re the ‘ ’ but you’re turning into a real ‘ . ’” “Sir, you attract more skinheads than free Rogaine,” Colbert continued. “You have more people marching against you than cancer. You talk like a   gorilla that got hit in the head. ” Tonight: Stephen tells the President everything journalists, restrained by their dignity, wish they could say. #LSSC pic. twitter.   —   The Late Show (@colbertlateshow) May 1, 2017,  Colbert did not address the firestorm surrounding his comments during Tuesday night’s episode of The Late Show, opting instead to continue to blast Trump and Putin.  The CBS host compared the president to author Stephen King, saying Trump just “makes things up. ” He also aired a   clip of Trump’s quotes taken out of context. Colbert’s ratings have risen steadily since Inauguration Day. The CBS host has regularly beaten   rival Jimmy Fallon’s Tonight Show since January, though Fallon still usually leads in the adults   demographic.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628334.4530513}