{"duration": 0.18445348739624023, "input_args": {"text": "'Staff meetings at BuzzFeed are not uncommon. Jonah H. Peretti, the site’s founder and chief executive, who is based in Los Angeles, travels to the New York offices regularly and often meets with employees to answer questions or outline strategy. But two recent meetings took on greater import, after BuzzFeed told employees two weeks ago that it was formally dividing its news and entertainment divisions. The day the reorganization was announced, Ben Smith, the editor in chief, met with the news staff to reassure them that the company was committed to its news operations. And last Wednesday, Mr. Peretti held a    session and vowed that the company was not planning to sell its news division. Staff members at BuzzFeed said the overhaul provoked curiosity rather than deep anxiety. Still, BuzzFeed’s reorganization seemed a transformative moment for a company staking a big bet on the future of video and entertainment. Already, video represents more than 50 percent of BuzzFeed’s total revenue, compared with 15 percent at the end of 2014. In the next two years, BuzzFeed expects that video will generate up to 75 percent of its advertising revenue, according to a person briefed on the company’s operations. The move also reflects a broader shift at media companies that are increasingly turning to video and entertainment news to lure a younger generation and attract online advertising dollars. In April, the website Mashable  made a round of job cuts as it moved away from covering world and political news, and Mic, a site aimed at a young audience, hopes to have 60 percent of the company focused on video by year’s end. Traditional news organizations like The New York Times and Tronc, formerly called Tribune Publishing, are investing heavily in video as well. As video moves from an ancillary pursuit to a more important source of revenue, the shifts in structure and emphasis are causing major changes and some uncertainty in newsrooms. “In any company, especially one that’s going through rapid scale and one that has geographical disbursement, there are disconnects that come up,” said Ze Frank, who until the recent reorganization was president of BuzzFeed Motion Pictures, the company’s video division. Under the new structure, Mr. Smith, who is based in New York, will lead BuzzFeed News, and Mr. Frank, who is based in Los Angeles, will oversee a new division called BuzzFeed Entertainment Group. It no longer made sense, Mr. Peretti said in a memo to employees, for BuzzFeed to have “a single ‘video department. ’” Instead, Mr. Smith’s department will have its own news video team, and Mr. Frank’s division will oversee   video, like Tasty food videos, as well as the lists and quizzes that are BuzzFeed’s bread and butter. “As digital video becomes ubiquitous,” Mr. Peretti wrote in the memo announcing the change, “every major initiative at BuzzFeed around the world will find an expression as video. ” For years, BuzzFeed has been viewed as a digital success story. Its viral content has been the envy of the media industry and its business model, built on   native advertising rather than display ads, enticed brands that wanted to reach younger demographics. It has expanded internationally, with offices in cities including London, São Paulo and Tokyo. Last year, the company received a $200 million investment from NBCUniversal. But BuzzFeed is facing challenges similar to those faced by both traditional and   media companies. In July, BuzzFeed drew 72 million unique visitors in the United States, the lowest number since August 2014, according to the measurement firm comScore. (Mr. Peretti pointed out that comScore’s data did not accurately reflect how many people viewed BuzzFeed’s content across the web and on mobile platforms.) In April, The Financial Times  reported that BuzzFeed had missed its revenue target for 2015 and had halved its projection for this year. BuzzFeed has disputed the report, but has not provided its own numbers. “The number we set at the beginning of the year we’ve been ahead of,” Mr. Peretti said, “and we’re happy with where we are as a business. ” BuzzFeed’s decision to separate its news and entertainment divisions follows similar moves by media companies like News Corporation and Tribune Company, raising the question of whether BuzzFeed would   or even spin off its news operation. “We’ve seen in legacy organizations the splitting off of what might be deemed to be less profitable news and more profitable entertainment divisions,” said Emily Bell, the director of the Tow Center for Digital Journalism at Columbia. “If you were being very positive,’’ she said of BuzzFeed’s reorganization, “you might say perhaps they’re going to find a way to make news sustainable in the long term. When you start enumerating what’s very positive about it, you can also see that this isn’t necessarily an    piece of good news. ” Ms. Bell added, “What this underlines in a way is what everybody else is experiencing, which is that   news can make money, but it’s a real struggle. ” Kenneth Lerer, BuzzFeed’s executive chairman, dismissed the idea that BuzzFeed was moving away from news. “We’re completely 100 percent committed to news as much now as ever,” he said. Interviews with nearly a dozen current and former BuzzFeed employees, including Mr. Peretti, Mr. Smith and Mr. Frank, also reveal deeper reasons for the reorganization, including resource allocation, clarity of reporting lines and an undercurrent of tension between Mr. Frank and Mr. Smith. As BuzzFeed News began producing more video, it largely had to rely on Mr. Frank’s team for resources, an arrangement that at times caused friction. In a telephone interview, Mr. Smith, asked about his relationship with Mr. Frank, said: “My main relationship with Ze is, I wish he was as  —   I’m trying to think of the right word for it that isn’t pejorative  —   I think he’s built the most successful digital studio ever, easily, by far. ” Mr. Frank, in an interview in a conference room at BuzzFeed’s office last Tuesday, said of Mr. Smith: “I love him. ” He added, “I consider Ben to be a sort of genius in a space that I don’t totally understand. ” Mr. Peretti acknowledged that tension existed, but said it was inevitable at a growing media company. “I think that people will sometimes think things are personal rather than organizational,” he said. Mr. Peretti said he thought that there was a period when “the team in L. A. which was the team that was making all the video, felt that they were part of the cool new thing. ” Some employees, including Mr. Peretti, acknowledged there was tension between Tasty, the successful cooking channel overseen by Mr. Frank, and BuzzFeed Food, which was introduced in 2012 and ran under Mr. Smith’s oversight. With the overhaul, Mr. Smith will gain his own news video team, run by one of Mr. Frank’s protégés, Henry Goldman. “There are logistical things that I think this will resolve,” Mark Schoofs, the investigations and projects editor, said. A graduate of the MIT Media Lab and a   of The Huffington Post, Mr. Peretti started BuzzFeed in 2006 as a kind of laboratory for shareable content. Not until late 2011 did BuzzFeed begin building its news side when it announced it had hired Mr. Smith, a star political reporter at Politico. Over the last several years, BuzzFeed has added a business team, a science team and an investigative team led by Mr. Schoofs, a Pulitzer Prize winner. At the same time, it has also pushed aggressively into video and entertainment. One factor in any perceived strain at BuzzFeed is the company’s rapid growth, executives said. It now has more than 1, 300 employees across the globe. Still, several current and former employees said some responsibilities across the company were not clearly defined, and there were complaints that salaries were inconsistent. The company hired a compensation consultant, and many employees on the news and editorial side recently received raises. BuzzFeed has framed the reorganization as an investment in the news division. Mr. Smith said that the company was “doubling down on news” and that he intended to “stick around as long as they’ll let me. ” The company is expanding its newsroom at its new offices near Union Square, where construction signs abound and metal gates cordon off the area. Elsewhere in the building, cat images are pasted to the walls. Conference rooms are named after emojis and internet memes, suggesting that even as BuzzFeed takes stock of its future, it is still very much devoted to the things that made it BuzzFeed from the beginning.'"}, "time": 1742628530.718526}