{"duration": 0.35013532638549805, "input_args": {"text": "'IPet Goat And The Solar Flare In the video IPet Goat II, you see many symbols, some appear to represent celestial movements. In Egyptian mythology the planets and stars are shown in hieroglyphs as moving about on boats. In the film IPet Goat II, there is a figure riding on a boat which has been called Messianic by some viewers. However, I think this figure is a representation of the sun, he is very yellow, like the Simp(suns), he appears to be covered in flames and his hair looks distinctly like flames. He also seems to have sunspots on his face. Sunspots are quite distinct from ordinary spots.The reason I mention the Simp(suns) is that their eyes are designed to look like the circumpunct, a circle with a dot in the centre which represents the sun. [ link to en.wikipedia.org (secure) ] Also in the simpsons, Homer is obsessed with doughnuts and the torus is a doughnut shape that is seen throughout nature and space and has been the subject of much theorising by physicists such as Nassim Harramein.Sorry, back to IPet Goat II. The II in the title suggests it could be the symbol of Gemini. In the celestial realm the sun is currently moving through the sign of Gemini and will be moving to Wasat, a fixed star in the constellation and which appears to be where you might locate the phallus part of the constellation.You can see the phallus around the 4 min mark [ link to en.wikipedia.org (secure) ] This area is where the water signs are located in the sky. The sun moved through this area over the past few months.A little further in the video, just after the phallus scene, you see the sun produce either a massive solar flare or possibly an EMP which knocks out the grey men in the suits.Now I know there is much speculation about a possible celestial event and/or a financial collapse happening soon, perhaps these events have been foreshadowed by this video.The sun reaches the phallus around 11th July and if the video is prophetic, then we can expect some solar related event to happen very soon after that.This is the sun\\'s position on 11th July Re: IPet Goat And The Solar Flare \"The more you know, the crazier you look\" Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Anonymous Coward ( OP ) Report Copyright Violation Re: IPet Goat And The Solar Flare Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio. Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio. Quoting: Anonymous Coward 69290995 Right but as he emerges he\\'s gazing at the sun. Does the sun gaze at the sun? Anonymous Coward ( OP ) Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio. Quoting: Anonymous Coward 69290995 Right but as he emerges he\\'s gazing at the sun. Does the sun gaze at the sun? Quoting: f800 I see what you mean, at the end he is gazing at some object which appears to have rings coming off it. Saturn is actually in Libra, where it ends and Scorpio begins. Saturn\\'s been there for a while, it moves very slowly and will continue to remain there for at a while longer. The sun could be gazing at Saturn perhaps. Saturn is golden coloured. Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio. Quoting: Anonymous Coward 69290995 Right but as he emerges he\\'s gazing at the sun. Does the sun gaze at the sun? Quoting: f800 I see what you mean, at the end he is gazing at some object which appears to have rings coming off it. Saturn is actually in Libra, where it ends and Scorpio begins. Saturn\\'s been there for a while, it moves very slowly and will continue to remain there for at a while longer. The sun could be gazing at Saturn perhaps. Saturn is golden coloured. Quoting: Anonymous Coward 69290995 I still think that represents you gazing at the sun. I think there is an important message there for you. Just mho. Anonymous Coward Report Copyright Violation Re: IPet Goat And The Solar Flare I, Pet Goat is too important. I believe it must be decoded to understand future events and their timeline. Report Copyright Violation Re: IPet Goat And The Solar Flare I, Pet Goat is too important. I believe it must be decoded to understand future events and their timeline. Quoting: Anonymous Coward 29592187 I think you might be right. Maybe some of it is already happening. ISON Re: IPet Goat And The Solar Flare In the video IPet Goat II, you see many symbols, some appear to represent celestial movements. In Egyptian mythology the planets and stars are shown in hieroglyphs as moving about on boats. In the film IPet Goat II, there is a figure riding on a boat which has been called Messianic by some viewers. However, I think this figure is a representation of the sun, he is very yellow, like the Simp(suns), he appears to be covered in flames and his hair looks distinctly like flames. He also seems to have sunspots on his face. Sunspots are quite distinct from ordinary spots. The reason I mention the Simp(suns) is that their eyes are designed to look like the circumpunct, a circle with a dot in the centre which represents the sun. [ link to en.wikipedia.org (secure) ] Also in the simpsons, Homer is obsessed with doughnuts and the torus is a doughnut shape that is seen throughout nature and space and has been the subject of much theorising by physicists such as Nassim Harramein.Sorry, back to IPet Goat II. The II in the title suggests it could be the symbol of Gemini. In the celestial realm the sun is currently moving through the sign of Gemini and will be moving to Wasat, a fixed star in the constellation and which appears to be where you might locate the phallus part of the constellation.You can see the phallus around the 4 min mark [ link to en.wikipedia.org (secure) ] This area is where the water signs are located in the sky. The sun moved through this area over the past few months.A little further in the video, just after the phallus scene, you see the sun produce either a massive solar flare or possibly an EMP which knocks out the grey men in the suits.Now I know there is much speculation about a possible celestial event and/or a financial collapse happening soon, perhaps these events have been foreshadowed by this video.The sun reaches the phallus around 11th July and if the video is prophetic, then we can expect some solar related event to happen very soon after that.This is the sun\\'s position on 11th JulyI realise the video is around 3 years old but these events look like they are on the verge of happening this year, so I thought I would mention this. Quoting: Anonymous Coward 69290995 Sun Halo - circumpunct - circled dot Anonymous Coward Report Copyright Violation Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio . Quoting: Anonymous Coward 69290995 Report Copyright Violation Re: IPet Goat And The Solar Flare Sorry, back to IPet Goat II. The II in the title suggests it could be the symbol of Gemini. In the celestial realm the sun is currently moving through the sign of Gemini and will be moving to Wasat, a fixed star in the constellation and which appears to be where you might locate the phallus part of the constellation.You can see the phallus around the 4 min mark [ link to en.wikipedia.org (secure) ] This area is where the water signs are located in the sky. The sun moved through this area over the past few months.A little further in the video, just after the phallus scene, you see the sun produce either a massive solar flare or possibly an EMP which knocks out the grey men in the suits.Now I know there is much speculation about a possible celestial event and/or a financial collapse happening soon, perhaps these events have been foreshadowed by this video.The sun reaches the phallus around 11th July and if the video is prophetic, then we can expect some solar related event to happen very soon after that.This is the sun\\'s position on 11th July Quoting: Anonymous Coward 69290995 Genesis 32:30-3130 So Jacob called the name of the place Peniel:[a] “For I have seen God face to face, and my life is preserved.” 31 Just as he crossed over Penuel the sun rose on him, and he limped on his hip. Anonymous Coward Re: IPet Goat And The Solar Flare \"The light halts upon his thigh \" Anonymous Coward Re: IPet Goat And The Solar Flare \"The light halts upon his thigh \" Quoting: Anonymous Coward 69699674 The light halts upon his thigh \" Quoting: Anonymous Coward 69699674 \"phallus\". See my link above. Anonymous Coward ( OP )User ID: 69290995 Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 \\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio . Quoting: Anonymous Coward 69290995 Quoting: Anonymous Coward 69699674 \\'halo\\' and it could symbolise rings of Saturn rather than a sun halo. In a still it looks like a halo but in the video there is a lot of movement and a lot of rings/halos.I\\'m glad you mentioned clouds because I was going to question whether there would be clouds as far up as the sun. They do seem to have the appearance of clouds. f800 The light halts upon his thigh \" Quoting: Anonymous Coward 69699674 \"phallus\". See my link above. Quoting: Anonymous Coward 69699674 Re: IPet Goat And The Solar Flare Maybe the Christ figure is a representation of you and your journey through this reality. Why would the \"son\" gaze at the sun? Quoting: f800 \\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio . Quoting: Anonymous Coward 69290995 Quoting: Anonymous Coward 69699674 \\'halo\\' and it could symbolise rings of Saturn rather than a sun halo. In a still it looks like a halo but in the video there is a lot of movement and a lot of rings/halos.I\\'m glad you mentioned clouds because I was going to question whether there would be clouds as far up as the sun. They do seem to have the appearance of clouds. Quoting: Anonymous Coward 69290995 Saw a lovely rainbow halo around the sun July 4th This video links I Pet Goat to today based on Scorpius [ ( OP )User ID: 69290995 Saw a lovely rainbow halo around the sun July 4th This video links I Pet Goat to today based on Scorpius [ Quoting: rachel3108 \\'ll find out very shortly if 7th July is the date for the asteroid strike. There are 2 asteroids passing close today I beleive. Personally I\\'ll also be watching out to see if anything interesting happens on 16th August, the date from the Deep Impact film. Anonymous CowardUser ID: 3234272 Watch this full 10 min original version.What does anyone make of this? Please post your thoughts, if that short film is telling, you should see this for more insight. [ ... That\\'s a good question, but I dont think it\\'s the \"son\", I think the figure is the sun and he appears to be moving through the mazzaroth, or what we know as the Zodiac which is how the sun travels along the ecliptic in the sky.I know that some people identified the area where he gazes at the end of the video as possibly Scorpio. The sun will be nearer Scorpio around the winter time, around November. If he is indeed gazing at Scorpio ahead of him,that would indicate that the events are over before winter ends and before the sun moves into Scorpio . Quoting: Anonymous Coward 69290995 Quoting: Anonymous Coward 69699674 \\'halo\\' and it could symbolise rings of Saturn rather than a sun halo. In a still it looks like a halo but in the video there is a lot of movement and a lot of rings/halos.I\\'m glad you mentioned clouds because I was going to question whether there would be clouds as far up as the sun. They do seem to have the appearance of clouds. Quoting: Anonymous Coward 69290995 Quoting: Anonymous Coward 69699674 \\'s so complex. Is there any chance you could summarise what it is about so I and anyone else who might be interested can understand the gist of what is being said and might be able to follow it with some insight.Many thanks. Anonymous Coward'"}, "time": 1742562449.5026996}