{"duration": 0.13071608543395996, "input_args": {"text": "'Email \\nThe last time Alabama played God, executing death row inmate Christopher Brooks by lethal injection on January 21, 2016, The Montgomery Advertiser and al.com published a column of mine in which I wrote: “Initial reports out of Alabama are that the execution went as ‘smoothly’ as killing a reasonably healthy 43-year-old man can go. In any event, it appears there was no visible evidence Brooks suffered bodily distress as the lethal drugs were administered, prompting Alabama Prison Commissioner Jeff Dunn to say that the execution with the controversial sedative drug midazolam ‘went exactly as planned[.]” ( See “ Executions are hardly an exact science ,” on February 8, 2016, and “ Courts denied phone to attorneys of man condemned to death ,” on February 9, 2016). \\nBoy, was I wrong. I was wrong just like Commissioner Dunn, and every media representative and Alabama law enforcement official in attendance was wrong – for painting Mr. Brooks’ execution as a peaceful passing, like he just curled up in a comfy hammock and dozed off – never to wake again. \\nIn a federal court filing on April 15, 2016, that has been inexplicably unreported in the media, Mr. Brooks’ federal defenders, who additionally represent Ronald Bert Smith (scheduled for execution on December 8), allege that after Mr. Brooks was injected with the controversial drug midazolam – the first in Alabama’s three-drug execution cocktail which is supposed to anesthetize the prisoner so that they are “insensate” (completely lacking any physical sensation) – a witness to Brooks’ execution, a federal investigator, Ms. Terri Deep, saw that “Mr. Brooks’ left eye opened after the consciousness assessment and, assuming they even noticed, no one from the ADOC [Alabama Department of Corrections] took any action.” \\nThe filing further alleges that: (1) “[t]he fact that Mr. Brooks’ eye opened indicates he was feeling sensation contemporaneous with, or prior to, injection of the paralytic. Therefore, he was sensate at the time he was executed by injection of potassium chloride,” (2) “[t]he final drug, potassium chloride, disrupts the normal electrical activity of the heart and induces cardiac arrest by stopping the heart from pumping blood. Potassium chloride traveling in the blood stream from the site of injection towards the heart causes an extreme burning sensation as it moves through the body destroying the internal organs,” and (3) in the event the inmate is not properly anesthetized, “potassium chloride will cause excruciating pain” (citing a 2016 report by the National Institutes of Health). \\nIn “ The death penalty in Alabama: What’s it really like ?,” published by The Montgomery Advertise r in April, I discussed in graphic detail what it means when lethal drugs are administered to a condemned person who is not “insensate,” a word commonly used in the death penalty context to, as the Supreme Court put it, “eliminate any meaningful risk that a prisoner would experience pain from the subsequent injections” ( Baze v. Rees , 553 U.S. 35, 49 (2008)). \\nI wrote: \\n“That first drug is supposed to put you down, painlessly, like a dog – your eyes just close and you ‘go to sleep’ forever. Except often, it don’t work like that. Because when that first drug don’t do the trick and your eyes close like your sleepin’, but really, you’re not, they inject them next drugs and then your muscles stop workin’, your lungs can’t breathe, and your beaten broken-down heart goes bust. And then, Jesus H. Christ have mercy, you feel it, every sharp stinging step of the way. Like your insides are melting, ‘cause they are … they’re melting from the inside out … they’re burnin’, bubblin’, liquefyin’ … like a bonfire raging inside of you … and you’re the witch. You ever hear that expression a death by a thousand cuts? The needle, the ‘big jab,’ the ‘stainless steel ride,’ – whatever you want to call this lethal injection business – it may be worse.” \\nAttached to their filing pending before The Honorable Chief District Judge W. Keith Watkins, Smith and Brooks’ federal defenders have attached a sworn affidavit from Ms. Deep about her observation that “[b]efore the curtains were closed, Mr. Brooks’ left eye opened, and was still open when the execution chamber curtains were closed.” Medical experts, they allege, indicate that it is medically impossible for Mr. Brooks’ eye to have opened during his execution unless he was experiencing exactly that type of “excruciating pain” the Eighth Amendment of the United States Constitution forbids. \\nAlabama’s Attorney General’s office, beleaguered Governor Robert Bentley, and ADOC have not, to this date, offered any substantive response to the federal defenders’ claims about what now appears to be yet another shameful example of a botched U.S. execution – in which a death row inmate was forced to suffer cruel and unusual punishment – in the name of justice. \\nTommy Arthur’s execution in Alabama, scheduled for November 3, will mimic Mr. Brooks’ gruesome demise if allowed to proceed. Ronald Bert Smith’s execution date follows closely after on December 8. Will the people of Alabama allow these executions to go forward in their name, or will they, in the name of all that is good, and all that is right, demand that Governor Bentley immediately declare a halt to all state executions? \\nWhy? Because Alabama may have just burned a man alive. Join the debate on Facebook Stephen Cooper is a former D.C. public defender who worked as an assistant federal public defender in Alabama between 2012 and 2015. He has contributed to numerous magazines and newspapers in the United States and overseas. He writes full-time and lives in Woodland Hills, California.'"}, "time": 1742564131.0939054}