{"duration": 0.04169821739196777, "input_args": {"text": "\"Wake the F... UP America # 0 \\nI've never been more disgusted with the world and what's going on in it. \\nHow the fuck is it possible, to have an entire side of a continent, completely in the dark and uncaring about the bullshit wars happening over there in the east. \\nWho the fuck do we think we are going into another god damn country, saying who the fuck should do what the fuck with their god damn time, their god damn rights and to what ultimate purpose do we serve fighting someone elses fucking war for them. \\nAre you kidding me, that we spend how much fucking money fighting a bunch of god damn who knows what the fuck! \\nThis is some seriously disturbing shit happening here! \\nI can't even imagine what kind of Gustapo shit it's going to take for every citizen of every god damn province, city, territory, continent, god damn mother fucking family units upon family units to say enough already. \\nRound up ohh I don't know, what is it? A couple fucking thousand people on this entire planet with the amount of money exceeding the wealth of how many people and nations, take all those mother fuckers benefiting off of all of us and our suffering and just take everything away from them and send them off to try again in some slums off the west coast \\nSweet mother fucking justice of mother earth, that would be something to be prized and enjoyed for sure. \\nNormally it doesn' matter who you vote for in an election. It's all rigged. But this election is different. This election has a wild card gone rogue. This dude says what the fuck he wants when he wants and doesn't give a shit who he's defending. \\nIf you have soaked up the last year or so of political propaganda being spewed at you through your boob tube you would probably unconsciously be aware subtly that you should vote Clinton. I mean if you look at all the endorsements and current shit being said out there about anti-Trump, you can only just use common sense to connect the dots of whom your handlers and the controllers of your universe are trying to steer you in. \\nSure Trump will fuck some shit up, he'll definitely ensure that his and his own are well taken care of and lined within years to come of financial wealth and freedoms. Clinton much of the same, the only difference being that Clinton will do as she's said where Trump will say go fuck yourself. \\nThis is the handlers, the beast system, the powers that be's greatest fear and their working extra hard to prevent it from happening and becoming a reality. Tags\""}, "time": 1742628412.2430067}