{"duration": 0.11128997802734375, "input_args": {"text": "'  Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Rock star Roger Waters said to lose $4m over anti-Israel activism By Ian Greenhalgh on October 28, 2016 [Editor’s note: This sorry tale of the persecution of a famous musician due to his moral stance against the fascist, racist, genocidal apartheid state of Israel starkly illustrates why so many others choose not to speak out – they know that they will be attacked and it will probably end up hurting them financially, in Water’s case, to the tune of 4 million dollars. As Waters himself said in an interview, celebrities are ‘scared shitless’ to criticise Israel. Ian] Rock star Roger Waters said to lose $4m over anti-Israel activism \\nRoger Waters’ anti-Israel activism has cost the British rock star millions of dollars and an American Express sponsorship, the New York Post reported. \\nThe credit giant took off the table a $4-million sponsorship of Waters’ 2017 tour in North America following his partisan and anti-Israel rhetoric this month at a festival that American Express sponsored, according to the tabloid’s report Thursday. \\n“Roger is putting on a huge show. The company was asked to sponsor his tour for $4 million, but pulled out because it did not want to be part of his anti-Israel rhetoric,” an unnamed source from American Express is quoted as saying. \\nBut an official spokesperson for the firm said it never formally offered to sponsor Waters’ 2017 tour. “When we were approached with the options, we passed on making a bid,” the spokesperson said. \\nAt the “Oldchella” festival, Waters used his time on stage to blast the Republican presidential nominee Donald Trump and to call for a boycott against Israel, according to the Post. \\n“F\\u2009-\\u2009-\\u2009k Trump and his wall,” Waters said at that event, calling Trump “arrogant, lying, racist, sexist.” He then voiced his solidarity with students protesting for Palestinians. He also urged people to support the Boycott, Divestment and Sanctions movement against Israel. \\nWaters did not reply to requests for a reaction by the Post. \\nEarlier this year, Waters said during an interview that celebrities are afraid to “speak out against Israel’s policies,” as he termed it, because of what he described as financial consequences attached to doing so. \\n“I’ve talked to a lot of them, and they are scared s\\u2009-\\u2009-\\u2009tless. If they say something in public, they will no longer have a career. They will be destroyed,” he said. \\nWaters, the 69-year-old co-founder of the classic rock group Pink Floyd, has been widely criticized for his anti-Israel activities and accused of espousing anti-Semitic symbols, though he has denied doing so. \\nIn a 2013 concert in Brussels, Waters performed on a stage featuring a giant pig balloon emblazoned with a Star of David, among other symbols. \\nThe Simon Wiesenthal Center called Waters “an open hater of Jews.” And the Anti-Defamation League’s then leader, Abraham Foxman, in an open letter to Waters earlier this month, said his “views on Israel are in fact colored by offensive and dangerous undercurrents of anti-Jewish sentiment.” Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Ian Greenhalgh on October 28, 2016, With 474 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . Both comments and pings are currently closed.'"}, "time": 1742562564.9996154}