{"duration": 0.06313252449035645, "input_args": {"text": "'J. P. Morgan Chase has removed its television and digital ads from NBC News following controversy sparked by anchor Megyn Kelly’s upcoming interview with InfoWars founder and radio host Alex Jones, according to a report. [The Wall Street Journal reported Monday that the bank has requested the network remove all of its advertising from Sunday Night with Megyn Kelly and from other news programs ahead of the anchor’s scheduled Father’s Day interview.  Kelly  —   who left Fox News earlier this year to lead two news programs at NBC, including Sunday Night with Megyn Kelly  —   shared a preview of her interview with Jones on her Twitter account Sunday. In the clip, Jones takes exception to being called “the most paranoid man in the world” and reiterates his position that   was an “inside job. ” Next Sunday, I sit down with conservative radio host @RealAlexJones to discuss controversies and conspiracies #SundayNight June 18 on NBC pic. twitter.   —   Megyn Kelly (@megynkelly) June 11, 2017,  As Breitbart News previously reported, the preview clip stirred outrage on social media, including from relatives of victims of the 2012 Sandy Hook Elementary massacre. Jones has previously said he believes the Sandy Hook attack was a hoax. Twitter users called for a boycott of NBC News’ advertisers and urged others to tune out the interview when it airs June 18. Kristin Lemkau, chief marketing officer for J. P. Morgan Chase, tweeted Monday that she was “repulsed” that NBC News would give Jones a platform on its network. As an advertiser, I’m repulsed that @megynkelly would give a second of airtime to someone who says Sandy Hook and Aurora are hoaxes. Why? https:  .   —   Kristin Lemkau (@KLemkau) June 12, 2017,  According to the Journal‘s report, the bank could reinstate its advertising after the interview airs June 18. The company reportedly does not want its ads appearing next to promotional material for the interview. Kelly defended her   with Jones in a tweet Sunday, saying President Donald Trump’s appearance on Jones’ show during the presidential campaign made the media figure newsworthy: “Many don’t know him our job is 2 shine a light,” she tweeted. Sunday’s episode of Sunday Night with Megyn Kelly will be the third broadcast of the new magazine show. Kelly kicked off her program earlier this month with a highly contentious interview with Russian President Vladimir Putin. The anchor is expected to begin hosting a 9 a. m. news show under NBC’s Today banner in September.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562412.7798948}