{"duration": 0.09243512153625488, "input_args": {"text": "'Stanford Rape Survivor Pens Moving Essay About Life After the Trial Posted on Nov 1, 2016 \\nBy Kali Holloway / AlterNet Valeri Pizhanski / CC BY-NC-ND 2.0 \\nIt is impossible to fully express the devastation of sexual assault in words. But for millions who read the “victim impact statement” written by Emily Doe, the pseudonym used by the 23-year-old woman at the center of the Stanford rape case, the letter was a powerful recounting of the pain, anguish, anger, sadness, and strength of a rape survivor. Doe’s message went viral; as Glamour magazine notes, four days after it was publicly released it “had been viewed 11 million times; it was read aloud on CNN and the floor of Congress.” \\nBrock Turner, Doe’s attacker, was sentenced to a mere six months in jail. He ultimately served just three. The glaring injustice in the case, as in so many cases of rape and sexual assault, made Doe’s words resound even more loudly. Citing the importance of her message, Glamour magazine named Doe a Woman of the Year, and published her incredibly powerful followup essay. \\n“From the beginning, I was told I was a best-case scenario,” Doe writes. “I had forensic evidence, sober un\\xadbiased witnesses, a slurred voice mail, police at the scene. I had everything, and I was still told it was not a slam dunk. I thought, if this is what having it good looks like, what other hells are survivors living? I’m barely getting through this but I am being told I’m the lucky one, some sort of VIP. It was like being checked into a hotel room for a year with stained sheets, rancid water, and a bucket with an attendant saying, No this is great! Most rooms don’t even have a bucket.” \\nDespite all that, Turner would receive a slap on the wrist. Doe writes of how stunned she was by the leniency Judge Aaron Persky showed the rapist. \\nAdvertisement Square, Site wide \\n“[W]hen it was quickly announced that he’d be receiving six months, I was struck silent. Immediately I felt embarrassed for trying, for being led to believe I had any influence. The violation of my body and my being added up to a few months out of his summer. The judge would release him back to his life, back to the 40 people who had written him letters from Ohio. I began to panic; I thought, this can’t be the best-case \\xadscenario. If this case was meant to set the bar, the bar had been set on the floor.” \\nJust one day after the sentencing, Doe was contacted by Buzzfeed with a request to publish her statement. She agreed. Doe could not have expected the overwhelming response; she received an outpouring of thanks from people around the world who were moved by her words. \\n“I started getting e-mails forwarded to me from Botswana to Ireland to India,” Doe writes. “I received watercolor paintings of lighthouses and bicycle earrings. A woman who plucked a picture of her young daughter from the inside of her cubicle wrote, This is who you’re saving. ” \\nShe goes on to point out that blaming victims—suggesting women should get better at avoiding being raped, instead of telling rapists not to rape—is not a real solution. Dismantling rape culture starts with recognizing that rapists are responsible for rape, and demanding justice for survivors. \\n“If you think the answer is that women need to be more sober, more civil, more upright, that girls must be better at exercising fear, must wear more layers with eyes open wider, we will go nowhere.” Doe writes. “When Judge Aaron Persky mutes the word justice, when Brock Turner serves one month for every felony, we go nowhere. When we all make it a priority to avoid harming or violating another human being, and when we hold accountable those who do, when the campaign to recall this judge declares that survivors deserve better, then we are going somewhere.” \\nThe entire essay, which can be found on the Glamour site , is well worth a read. As the outlet notes, you can support the campaign to recall Judge Aaron Persky by visiting recallaaronpersky.com .'"}, "time": 1742562003.466789}