{"duration": 0.0335237979888916, "input_args": {"text": "'Hillary Melts Down Over Weiner In Public, PICS Prove Campaign Is Imploding Posted on October 30, 2016 by Rebecca Diserio in Politics Share This \\nHillary Clinton’s campaign is imploding, and it’s so bad that she was caught having a mini meltdown after her press conference as she tried to explain this new email investigation by the FBI, thanks to Anthony Weiner’s laptop. As Hillary lost it, her campaign was caught red-handed, doing dirty tricks to pictures, and you’ll love just how desperate they have become as they see this election sinking like the Titanic. \\nRumors are flying after Hillary Clinton responded to the latest bomb dropped on her campaign, that thousands of government emails are on Anthony Weiner’s laptop. Everyone knows Hillary should have been indicted before, and she had a meltdown of sorts when Kristen Welker of Fox News asked, “Are you worried this could sink your campaign, Secretary Clinton?” \\nWhile Hillary was walking away from the short press conference after the Weiner email story broke, she stopped and threw her head back and let out a creepy maniacal laugh . Fox News correspondent Jennifer Griffin found it really weird, saying it was like Hillary had lost it. She described Hillary “stopping and throwing her head back and laughing, it was really odd.” \"Are you worried this could sink your campaign, Secretary Clinton,\" a reporter shouts as HRC walks out. Clinton only lets out a big laugh. \\n— Ruby Cramer (@rubycramer) October 28, 2016 \\nHowever, Hillary Clinton was not really laughing. That was a public meltdown, and she is pissed off that an idiot like Anthony Weiner just cost her this election. It’s so bad that the Clinton campaign was caught photoshopping the crowd at a recent Ohio rally, where Bill Clinton spoke. Bill Clinton rally Oct. 29th, red arrow shows a man (left) who was duplicated in photoshopped pic put out by Clinton campaign, indicated with red circles (right) \\nThen, if all of that isn’t bad enough, the Chicago Tribune, one of the most liberal papers in the country, had this headline yesterday: “ Democrats Should Ask Hillary To Step Down ,” which was written by John Kass who was speaking from Hillary’s real home state of Illinois. \\n“FBI director James Comey ‘s announcement about the renewed Clinton email investigation is the bombshell in the presidential campaign. That he announced this so close to Election Day should tell every thinking person that what the FBI is looking at is extremely serious .” [via Chicago Tribune ] \\nIf we are agreeing with the Chicago Tribune, you know what happened on Friday with James Comey and the FBI is so devastating that this election is over for Hillary. However, that doesn’t mean we can let up and sigh with relief just yet. \\nHowever, we can be extremely optimistic that, after eight years and two elections that caused utter destruction for our country, we have an extremely good chance that Americans will reject Hillary and her criminal cabal. America was saved by Anthony Weiner, and it doesn’t get any stranger than that.'"}, "time": 1742628595.3575234}