{"duration": 0.07712173461914062, "input_args": {"text": "\"USA: The questions the people should be asking 06.11.2016 Given the dimension of the United States of America, given its economic power and given the fact that it is one of those nations that cannot help sticking its nose into other people's business, meddling and intruding where it was not invited, the forcoming election is of global importance and requires responsible voting. Here are some questions the people should be asking. Question 1: Has Hillary Clinton amassed a substantial or any part of her reported great wealth (some say hundreds of millions of dollars) while in public office? If so, how is that compatible with public service? Question 2: Is there a rumor that Hillary Clinton has used the Clinton Foundation to amass a fortune and if there is, to what extent is it truthful? The Clinton Foundation and foreign policy Question 3: There is an allegation that Hillary Clinton has used the Clinton Foundation to receive millions in payments from foreign states for access to contracts in return. This being the case, how ethical is it for a public figure to use a private foundation to conduct government policy, and obtain a fortune to boot? Is this what the USA's foreign policy ethics is about? Then why vote for her?   Question 4: Hillary Clinton laughed and sneered when she heard that Muammar al-Qathafi, the Leader of the Libyan Jamahariya, had been cruelly murdered by terrorists. Is it correct for the leader of a country's diplomacy to giggle and guffaw at the news of a terrorist murder? Backing terrorists Question 5: Hillary Clinton was Secretary of State at the time when the Libyan government was toppled in an illegal act by NATO forces using terrorists on their own lists of proscribed groups. Is this in line with the established law of the United States of America? If not, then what does the law of the United States of America have to say about the chief of the country's diplomacy using terrorists to conduct foreign policy? Question 6: Hillary Clinton was responsible for sending Libya, the country with the highest Human Development Index in the African Continent, back to the dark ages, crawling with terrorists and infested by Islamic State. If she was capable of that as Secretary of State, then what would she do as President and how competent is she for that role? Question 7: Hillary Clinton, as mastermind of the Libyan debacle, is ultimately responsible for the acts of the terrorists she unleashed in that country. Has she, have the citizens of the United States of America, any idea of what these terrorists did? Reader discretion advised, for those easily offended please scroll down to question 8. These terrorists sliced the breasts off women in the streets, these terrorists forced five-year-old girls to watch their parents being tortured and raped and murdered with their throats cut, and as their parents' throats were still spurting blood and gasping for breath, these five-year-old girls were themselves raped before and after being beheaded. Boys as young as six have been impaled on railings (metal rails thrust through their anus until they come out of the child's throat). You cannot unleash this sort of filth, then laugh and giggle and turn your back and walk away. Or can you if you are the US Secretary of State, and get voted in as President despite it all? Question 8: How long has Hillary Clinton been in or around Government? How long has Hillary Clinton been in or around the White House? What has she actually achieved? Can she rightfully claim she is the Queen of Change? Or the Queen of barefaced liars who feathered her nest at the expense of the hard-working people of the United States of America? Question 9: Is there a rumor that a lady was paid 500,000 dollars to come on stage and lie about Donald Trump having abused her? Was it not more than a rumor? Wasn't it proven that she was paid to come into the campaign and lie? When they go low, you go high. I am not going to mention any names, but wasn't there more than a rumor about a certain family of Hillbillies in the White House, lies and er...? Timothy Bancroft-Hinchey\""}, "time": 1742564190.6274276}