{"duration": 0.09190249443054199, "input_args": {"text": "' Trump Warns That By Attacking Assad, US Will \\x91End Up Fighting Russia\\x92 By RT November 13, \" RT \" - US President-elect Donald Trump has confirmed that he will most likely abandon the Obama administration policy on Syria to seek a possible rapprochement with Russia on the issue of Assad.\\n\\x93I\\x92ve had an opposite view of many people regarding Syria,\\x94 the 70-year-old Republican told the Wall Street Journal in his first interview since the election.\\nFrom the start of the Syrian war, Barack Obama\\x92s foreign policy has been focused on the support and training of the so-called \\x93moderate\\x94 rebel groups who were supposed to defeat Islamic State (IS, formerly ISIS/ISIL) terrorists, and survive to eventually overthrow Assad. That approach became deadlocked this year when Washington failed to honor its obligations under an agreement with Moscow to separate their moderate rebel forces from internationally-recognized terrorists.\\nTrump, on the other hand, said on Friday that the US should be focused on fighting Islamic State, instead of pursuing regime change in Syria.\\n\\x93My attitude was you\\x92re fighting Syria, Syria is fighting ISIS, and you have to get rid of ISIS. Russia is now totally aligned with Syria, and now you have Iran, which is becoming powerful, because of us, is aligned with Syria... Now we\\x92re backing rebels against Syria, and we have no idea who these people are.\\x94\\nIt has been widely documented and reported that American weapons supplied to the moderate rebels are often obtained by extremists in Syria. Those weapons, in turn, are being used by the jihadists to strike civilian positions and deploy them against Syrian forces.\\nThe president-elect warned that if the US attacks Assad, \\x93we end up fighting Russia, fighting Syria.\\x94\\nThe US coalition bombing of Syrian Army positions near the city of Deir el-Zour on September 17 led to the collapse of the US-Russian peace initiative.\\nRapprochement in US-Russia ties could, however, be on the horizon after Trump admitted receiving a \\x93beautiful\\x94 letter from Russian President Vladimir Putin. Trump said a phone call between them is scheduled shortly.\\nDonald Trump and Vladimir Putin are \\x93very much alike... in their basic approaches toward international affairs,\\x94 Dmitry Peskov told the Associated Press earlier.\\n\\x93[Trump] has been a very firm supporter of the idea of a good relationship between our countries, because we do carry a joint responsibility for strategic stability in the world, strategic security,\\x94 the spokesman said.\\nImmediately after Trump\\'s victory, Russian President Vladimir Putin stated that Moscow looks forward to restoring bilateral relations with the United States.\\nThe US military establishment, however, already seems to be working against Trump\\'s policies. In an interview with CBS This Morning, Defense Secretary Ash Carter leveled a barrage of accusations at Russia.\\nHe said the Russian campaign in Syria \\x93fuels the fires\\x94 of ongoing violence in the country, claiming \\x93they\\x92re not doing what we need to do and think needs to be done [in Syria].\\x94\\n\\x93What the Russians said, if you\\x92ll remember, was that they were going to come in and fight terrorism and help remove Assad,\\x94 Carter said. \\x93They haven\\x92t done either of those things. They haven\\'t done any of that.\\x94\\nWhile Moscow has been undertaking efforts to eliminate Islamic State and Al-Nusra Front terrorists in Syria, it never said it would take part in the forcible removal of President Bashar Assad.\\nWhen the anchor Norah O\\x92Donnell said \\x93They\\'re helping Assad?\\x94 Carter continued, \\x93Exactly. Which in turn simply fuels the fires of the Syrians civil war. So the Russians have been completely backwards there, in what they\\'ve been doing.\\n\\x93So we have not been able to, and I have not been in favor, and am not recommending to the president that we associate ourselves with or work with the Russians until they start doing the right thing,\\x94 Carter concluded.'"}, "time": 1742562549.3337917}