{"duration": 0.04790067672729492, "input_args": {"text": "'Tesla and SpaceX founder Elon Musk warned that deep A. I. could potentially be dangerous to the human race, who he described as already   should it overtake us in intelligence. [“One of the most troubling questions is artificial intelligence. I don’t mean narrow A. I   —   deep artificial intelligence, where you can have AI which is much smarter than the smartest human on earth,” proclaimed Musk during the World Government Summit in Dubai. “This is a dangerous situation. ”  “Pay close attention to the development of artificial intelligence,” he continued. “Make sure researchers don’t get carried away. Scientists get so engrossed in their work they don’t realize what they are doing. ” Musk continued to claim that humans are already   citing the range of digital applications that people now depend on every day. “To some degree we are already a cyborg  —   you think of all the digital tools that you have  —   your phone, your computer,” claimed Musk. “The applications that you have. The fact that you can ask a question and instantly get an answer from Google and other things. ” “You already have a digital tertiary layer. Think of the limbic system  —   the animal brain and the cortex as the thinking part of the brain, and your digital self as a third layer,” he added. “If you die your digital ghost is still around. All of their emails, and social media, that still lives if they die. ” “Over time I think we will probably see a closer merger of biological intelligence and digital intelligence  …     It’s mostly about the bandwidth, the speed of the connection between your brain and the digital version of yourself, particularly output,” Musk concluded. “Some high bandwidth interface to the brain will be something that helps achieve a symbiosis between human and machine intelligence and maybe solves the control problem and the usefulness problem. ” In November, Musk predicted that automated robots would lead to mass unemployment, which could eventually create a universal wage from the government. In June, the billionaire tech entrepreneur claimed it likely that mankind is living in a   computer simulation. Musk was also one of the Silicon Valley billionaires, along with fellow PayPal Mafia members Peter Thiel and Reid Hoffman, who invested $1 billion into an artificial intelligence center in 2015. On Monday, Business Insider reported that Google’s new A. I. had learned to become “highly aggressive” in stressful situations, turning on each other in a virtual game once resources became scarce. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562262.4063554}