{"duration": 0.05023527145385742, "input_args": {"text": "'Posted on October 26, 2016 by Carol Adl in Sci/Environment // 0 Comments \\nTwo powerful earthquakes struck central Italy on Wednesday, causing fear among residents still rattled by a deadly tremor in August. \\nAn 6.0-magnitude earthquake hit the Marche region almost two hours after a 5.4-magnitude quake damaged buildings and cut power lines across the area. \\nThere have been no reports of casualties so far. \\nRT reports: \\nThe latest earthquake occurred 71 km east of Perugia, with United States Geological Survey reporting it as a 6.0-magnitude temblor, and Italy’s National Institute of Geophysics and Volcanology saying it was 5.9-magnitude. M5.9 #earthquake ( #terremoto ) strikes 135 km NE of #Roma ( #Italy ) 13 min ago. Updated map of its effects: pic.twitter.com/LKWAtTLmBe \\n— EMSC (@LastQuake) October 26, 2016 \\nThe first earthquake was detected at 7:11pm local time, about 66km to the southeast of Perugia, striking a mountainous part of the Marche region and lasting several seconds.The exact epicenter of the tremblor remains unclear, but it was relatively shallow, at about 9km below ground. \\nWithin an hour of the first earthquake, there was a series of small but noticeable aftershocks, ranging in magnitude from 2.5 to 2.8. \\n“We’re in the square, all the lights are out, we can’t see, we’re counting each other to see who’s here, we still don’t know how bad the situation is,” Mauro Falcucci, mayor of Castelsantangelo sul Nera, the small commune closest to the epicenter, told Sky News by phone. “The situation is delicate. It is important to remain calm.” \\nThe official said that the emergency is exacerbated by a downpour, and intermittent problems with mobile phone communication. \\n“It was a very strong, apocalyptic earthquake – people were screaming in the street, and now the lights are cut off,” said Marco Rinaldi, the mayor of Ussita, a community of 400 that was also affected by the initial earthquake. \\nA video posted by a Huffington Post journalist shows rubble strewn through the streets of Visso, a commune less than 10 km from the epicenter. \\n— Claudio Paudice (@clapaudice) October 26, 2016 \\nThe Civil Protection agency, the centralized service which is receiving infromation from dozens of tiny settlements scattered across the area, say that older buildings have been damaged, or collapsed entirely, but that no injuries have been reported. #Italy Civil Prot Agency says so far no reports of injuries following 5.4M #earthquake in central Apennines. Panicked people in streets. \\n— Daniele Pinto (@DanielePinto) October 26, 2016 \\nEyewitnesses also reported a powerful tremor in the capital on the western side of the country, more than 150 km away, saying that centuries-old buildings were shaking. It’s been almost a hour since the earthquake and my heart is still racing. I hope nothing else will happen over night or tomorrow…'"}, "time": 1742561722.7404912}