{"duration": 0.06464099884033203, "input_args": {"text": "'One particular topic in a presidential election is the candidate’s plan for their first 100 days. First 100 Days History \\nPresident Franklin D. Roosevelt was inaugurated in 1933. During this time, the Great Depression had been going on for a few years. \\nOne-quarter of the population was unemployed. Roosevelt made an ambitious plan for the first 100 Days of his presidency. In those first three months, he passed lots of legislation to get more jobs. \\nNow, all presidential candidates make their own ambitious plans for the first 100 days. Hillary Clinton’s First 100 Days Plan \\nClinton’s plans seems designed to help the average American. \\nClinton wants to appoint a “trade prosecutor” to look into anti-competitive trade deals. She would like to work with Congress to make big investments in infrastructure. She wants to implement immigration reforms and raise taxes on the wealthy. \\nShe wants to appoint a Supreme Court Justice who supports upholding Roe v. Wade . She would like to see a Constitutional Amendment to reverse Citizens’ United. Donald Trump’s First 100 Days Plan \\nOn the other hand, Trump’s plan seems hostile to everyone. \\nTrump would cancel many of President Obama executive orders on energy, climate, immigration, overtime, retirement, and more. And deport “criminal” immigrants. He wants to institute a hiring freeze in the federal government. \\nHe wants to institute a multi-trillion-dollar tax cut. Of course, he wants to build the dumb wall. He wants to get rid of Obamacare and replace it with Health Savings Accounts and Interstate insurance marketing. He also wants to pick Supreme Court Justices that are more like the late Antonin Scalia. \\nTrump also promised to introduce a constitutional amendment, but his would impose term limits on members of Congress. Then, he would sue every women who has or might still come forward to allege he sexually assaulted them. \\nBoth of these candidates have wildly different views, as you can tell, and both are ambitious. \\nHowever, Hillary Clinton’s ideas are better for the country. Donald Trump’s plan will take us back into a recession. Cutting the taxes will just add onto the debt that we already have. Vote Blue on November 8! \\n  her 100 days plan : \\nFeatured image via YouTube screenshot  '"}, "time": 1742563492.1359968}