{"duration": 0.050459861755371094, "input_args": {"text": "'Email \\nIf you’re always making excuses to skip the gym, you’ve got to check this out. \\nLet’s be honest: We all can use a little extra push to get the most out of our workouts. Now, there’s one spin studio that has a brand-new approach to take motivation to the next level. At SpinZone NYC, they’ve got a great new twist to keep riders active and focused the whole 45 minutes: Every one of their bikes is hooked up to a sick child’s life support. \\nToo cool! Where do we sign up??? \\nIf you thought spin class was intense before, just wait until you see this setup. With 16 bikes, each hooked up to the equipment needed to keep one child alive, there’s no doubt that every bit of effort counts—if you stop pedaling, the machines stop, too. Even with the array of pulsing lights and music we’ve come to expect from spin class, the distinct sound of an EKG flatlining on a 7-year-old can be a powerful motivator to let riders know it’s time to step things up. \\nIn an increasingly competitive fitness market, the innovative approach at SpinZone NYC is a breath of fresh air, and it’s winning them new customers left and right. With no backup generators and no excuses, they’ve created exactly the kind of environment people need to get real results. Instructors are always there to offer a word of encouragement and remind cyclists how severe their child’s condition is. And forget about plateauing—once participants make it through a full session with one sick kid, that just means a bigger and sicker child for the next workout. \\n“I used to make it 30 minutes, tops,” said Erika Perry, a regular who says she never breaks eye contact with her kid for extra motivation to keep going. “Now I regularly make it the full class. There’s something about a child depending on me for survival that really gets me going in the morning. And I’ve dropped 11 pounds and feel great!” \\nWow, it sounds like things are off to a great start! If this catches on, it’s exactly the kind of bold idea that can transform an entire industry. Way to go, SpinZone NYC. Keep on pedaling!'"}, "time": 1742628364.909744}