{"duration": 0.03177022933959961, "input_args": {"text": "'TEHRAN  —   In the past, Iranians looking to mock the United States would burn cardboard effigies of Uncle Sam or Lady Liberty. But in recent months, as the American presidential election took a series of bizarre turns, Iranians seeking to make fun of the “Great Satan” have ditched the arts and crafts and simply switched on their TV sets. Iran’s state television, a bastion of conservative ideologues, for once interrupted its regular programing about the “murders and crimes committed” by the United States and broadcast all three debates between Hillary Clinton and Donald J. Trump  —   live. In a country that tightly controls information about the United States and depictions of Western democracy generally, the decision to show the debates was unprecedented but by no means inexplicable: The presidential campaign shows the United States political system in such a poor light,   evidently want it to speak for itself. “We only need to sit back and let these candidates show themselves how idiotic they are,” said Hamidreza Taraghi, a conservative analyst and a regular guest on state television. “The best way for us to prove that the U. S. government is corrupt and hideous is by showing these people live on our TV. ” Live, yes, but some parts  —   especially those criticizing Iran  —   were not fully translated. After each debate, analysts discussing the outcome were in unanimous agreement that America, in its current state, “cannot do a damn thing. ” To say that Iran’s political establishment has been thoroughly enjoying the campaign is an understatement. Last week, Iran’s supreme leader, Ayatollah Ali Khamenei, called the American election “a spectacle for exposing their crimes and debacles. ” Ayatollah Khamenei seized on the campaign’s tawdriest details: accusations of infidelity and sexual assault. “The remarks made by these two U. S. presidential candidates over the last few weeks on immoral issues  —   which are, for the most part, not baseless accusations  —   are enough to disgrace America,” he said during a speech commemorating the 1979 takeover of the United States Embassy in Tehran. His supporters responded enthusiastically by shouting, “Death to America. ” Mr. Trump, the Republican nominee, was not mentioned by name, but the ayatollah seemed to praise his outspokenness, saying: “People pay more attention to him. ” The candidate, he said, is tapping into genuine American dissatisfaction. “Because the people look at what he says and see it is true,” Ayatollah Khamenei said. “They see it in the facts of their lives. ” Since the 1979 Islamic Revolution, Iran has been officially  . Many ordinary Iranians have milder feelings for the United States, where over two million of their relatives live. Iran’s leaders, long entangled in a battle for power and influence with the United States in the Middle East, have been emboldened by the American withdrawals from Iraq and Afghanistan. “America is no longer a superpower in the region. It’s weak in the Middle East. They are now only one of the players,” said Jalal Barzegar, a reformist journalist. “It’s now just a country. ” For Iranians uninterested in watching the debates, Iran’s state television had another option. In recent weeks it has been airing Netflix’s “House of Cards,” called “House of Straw” here because playing cards is considered  . Kevin Spacey’s portrayal of the conniving politician Frank Underwood is the perfect embodiment of the “inhumane face” of American politics, state television officials have said. Apparently, Ayatollah Khamenei has also been watching. In his recent speech, he quoted a line uttered by Mr. Spacey in the series. “‘Shake with your right hand, but hold a rock in your left one,’ as they say themselves,” Ayatollah Khamenei said. “This is the kind of people they are. ”'"}, "time": 1742628527.1016455}