{"duration": 0.09980511665344238, "input_args": {"text": "'0 comments You read that correctly. Here is the ugly truth that is sending Black Lives Matter leadership into orbit over Hillary’s pandering hypocrisy! Eric Garner died a tragic, unexpected death at the hands of a police officer. His death has sometime’s referred to as “the chokehold death.” Video of the sad episode can be seen below: Eric Garner’s daughter, Erica, is a prominent Black Lives Matter leader, and she is none to pleased at what WikiLeaks has brought to light. In discussing an upcoming statement to describe Hillary’s stance on gun violence, Clinton staffer Nick Merrill wrote: “Finally, I know we have Erica Garner issues but we don’t want to mention Eric at all? I can see her coming after us for leaving him out of the piece.” Maya Harris replied, “Eric Garner not included because not killed by gun violence.” The full email can be read here . Hillary’s campaign was clearly considering how to best use, or not use, the Eric Garner story to push their agenda. The revelation, understandably, has set off a firestorm in the Black Lives Matter community. Erica Garner is teeing off! I’m troubled by the revelation that you and this campaign actually discussed “using” Eric Garner … Why would you want to “use” my dad? \\n— officialERICA GARNER (@es_snipes) October 27, 2016 I dont care what BLM activists endorse #Hillary … They WILL continue more of the same, they dont care about Black lives and I got proof! \\n— officialERICA GARNER (@es_snipes) October 27, 2016 https://t.co/jzfUl0FbXF In this #PodestaEmails leak @CoreyCiorciari n @NickMerrill plot to use police violence victims to push gun control \\n— officialERICA GARNER (@es_snipes) October 27, 2016 They can get whoever they want to play their game,she called YOU super predators, they passed the crime bill and welfare reform. JUST SAY NO \\n— officialERICA GARNER (@es_snipes) October 27, 2016 If you vote for her by default you are endorsing her and whatever she does. Remember her hiding being Nergos that supported the crime bill? \\n— officialERICA GARNER (@es_snipes) October 27, 2016 \\nDo you blame Erica Garner for feeling the way that she does? For years, since the days of Lyndon Johnson, the Democrats have pandered to blacks, women, and other minorities. Many times, these minority groups have fallen in step behind these pandering, hypocritical, power-hungry leaders. \\nWith WikiLeaks on the scene to reveal the truth, it appears that times are changing!'"}, "time": 1742562641.7836313}