{"duration": 0.09318399429321289, "input_args": {"text": "'Iowa Girl Faces Death: Life Destroyed by Gardasil Vaccine \\nby Health Impact News \\nThe VAXXED film crew continues interviewing people who are vaccine damaged around the country. They were recently in Iowa, and interviewed the family of Sydney Weggen. \\nSydney states that before Gardasil she used to dance up to 5 hours every day, but now she does not dance at all. \\nHer school recommended to her parents that she get the Tdap vaccine, because a student in her class with pertussis “coughed on” her. Sydney was almost 11 years old at that time. \\nWhen they took her to their doctor to get the pertussis vaccine, they were offered the Gardasil vaccine as well. Because they had seen many commercials on TV for the Gardasil shot, and because the doctor was recommending it, they consented and Sydney received the first Gardasil shot. She also received the second and third shots a few months apart. \\nSydney began to have appetite problems, not being able to eat much. She began to lose weight. She lost over 20 lbs. before her 12th birthday and became anemic. Doctors thought at this point it was a psychiatric problem, and not physical. The parents were told it was “all in her head.” \\nAs her condition continued to deteriorate, blood work done suggested there was something physical going on, and she was referred to the university hospital to check for some autoimmune sickness, such as Crohn’s Disease or Lupus. \\nAfter being admitted to the University of Iowa Hospital, they ran further tests. Her right lung was found full of fluid. But the doctors could not figure out what the problem was, and so they waited for more specialists to look at her. \\nAs they waited, her weight dropped to only 66 lbs., and her parents realized that she was dying. \\nSomeone suggested they take her to the Mayo clinic so they could get some answers. After spending $20,000.00 on tests, they were still not getting results. They had to put a stent in to get her lung to keep functioning. \\n  VaccineImpact.com. \\nWatch the entire interview: More information about Gardasil Leaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people. In this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine. FREE Shipping Available! Order here . Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? eBook – Available for immediate download. \\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.” \\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines. \\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary. \\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field. \\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual. \\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot. \\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions. \\nIn this eBook, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe. Read : Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? on your mobile device!'"}, "time": 1742564298.214487}