{"duration": 0.11213350296020508, "input_args": {"text": "'Plantas nómadas y robots parásito muestran cómo cambiar nuestra relación con el medio ambiente Publicado: 26 oct 2016 19:58 GMT \\nUn artista mexicano crea criaturas robóticas que roban energía eléctrica para hacer música y se alimentan de bacterias de ríos contaminados. El proyecto \\'Plantas Nómadas\\' evidencia el modo en el que nos relacionamos con el medio ambiente Proyecto Plantas Nómadas Síguenos en Facebook \\nUna oruga creada con tubos aparece colgada en cables de luz, hace ruido, convive con otras orugas como ella y sus cantos \"forman parte del paisaje urbano\". Una mosca vuela con vibradores de celulares y una araña de alambres y juguetes viejos toma desechos de la basura para construir nuevos seres como ella. \\nEstos \\'Parásitos Urbanos\\' creados con desechos tecnológicos pretenden hacernos reflexionar sobre las consecuencias de cómo usamos y gestionamos nuestros residuos. \\nDe alguna manera, explica su creador a RT , son \"organismos de vida artificial\" que surgen de la basura y vienen a la ciudad para \"parasitarla\". \\n\"Las preguntas que me hago tienen que ver con el impacto de la tecnología en la vida cotidiana en nuestro entorno\", dice Gilberto Esparza, artista mexicano formado en la Universidad de Guanajuato, en la región del Bajío, cruzada por el contaminado río Lerma. Plantas nómadas \\nDespués de los parásitos urbanos, Esparza creó otro ser, simbionte entre plantas, bacterias y una máquina, que camina solitario y lento al lado de ríos contaminados para alimentarse de ellos y limpiar el agua. \\n\"Utilizamos el agua como vehículo de deshechos\", afirma Esparza. \\nLa intervención tenía que ver con el tema del agua, y su intención era realizar una reflexión acerca de cómo convivir con el agua para revertir la contaminación. \\n\"Cómo hace la planta nómada para sobrevivir, entender, reconocer cuál es el entorno y aprovecharlo\", se pregunta. \\nEl artista explica que la planta nómada se integra al ecosistema y tiene la posibilidad de sobrevivir. Eso hace una simbiosis con su entorno. En el agua hay bacterias, las recoge y las lleva a pilas biológicas, contenedores internos, donde se desarrollan y empiezan a alimentarse. Luego invita a las bacterias que están en el agua. Las bacterias, en sus procesos metabólicos, generan electricidad. \\nEl agua limpia es llevada a otro contenedor dentro del robot y de ahí es tomada para hacer crecer plantas extintas en lugares contaminados. Finalmente, las plantas aportan energía al robot; esa es su estrategia para sobrevivir. Una planta nómada explora en un río contaminado. Proyecto Plantas Nómadas \\n\"Si lo proyectas a una ciudad, si comenzamos a cambiar nuestras estrategias, manera de relacionarnos, obviamente eso va a impactar de manera positiva en el entorno\", opina. \\n\"No es que su pretensión sea limpiar el río, sino que su actitud ante el río hace que el río se sane. Lo que busco con estos proyectos es reflexionar acerca de eso\", explica el artista. \\nEsparza hizo un cómic en el que se ve esa etapa del robot, viviendo en el río. Al final, el agua se ve limpia y queda abierta la pregunta si fue porque los humanos lograron entender cómo relacionarse con el agua o porque se extinguió la especie de la planta nómada, que ya no tuvo de dónde alimentarse. Un parásito urbano \"interviene\" la ciudad Proyecto Parásitos Urbanos No son la solución, sino la reflexión \\nLa intención profunda de este trabajo con robots, explica Esparza, es entender a través de estos desarrollos que tenemos que cambiar nuestra relación con el medio ambiente en lugar de resolverlo desde la tecnología, de tal forma que los desperdicios ya no serían una basura, sino energía y materiales. \\nEl último proyecto de esparza se llama \\'Plantas Autofotosintéticas\\', y pretende trasladar la idea de \\'Plantas Nómadas\\' a una ciudad. \\nLa nueva planta funciona a modo de maqueta para explicar cómo podría ser a nivel sistémico el funcionamiento de una ciudad en el futuro y plantear el reciclaje de sus aguas para que tenga un consumo externo mínimo y para que se pueda autosustentar. Gilberto Esparza lleva diez años trabajando con robots para reflexionar sobre la problemática medioambiental. Plantas Nómadas \\n\"La verdadera forma de poder terminar con estos problemas de contaminación no es tanto generando nuevas tecnologías que hagan un parche que traten de estar limpiando lo que ensuciamos\" explica. \\nDespués trabajará con un instrumento sonoro con celdas microbianas con el que pretende traducir la actividad biológica electroquímica a sonidos. \\nSu intención es hacer \"que suenen ríos contaminados\"; después dará un disco con los resultados para que cada río se exprese. \\n\"El problema, y por eso no lo hemos logrado, es que nuestra lógica gira en torno a la economía y no a qué es lo que necesitamos\" opina el artista. Todo sobre este tema '"}, "time": 1742562001.6405632}