{"duration": 0.06411528587341309, "input_args": {"text": "'Home › ECONOMIC › U.S. TRUCKING COMPANIES SLASH FLEETS AMID “TEPID SHIPPING DEMAND” U.S. TRUCKING COMPANIES SLASH FLEETS AMID “TEPID SHIPPING DEMAND” 0 SHARES \\n[10/31/16] For months now we have been writing about the collapse of class 8 truck orders. For the month of September, net class 8 orders were down 16% YoY while LTM orders were down a staggering 41%. In fact, the level of trailing 12-month net orders is the lowest since January 2011 with YoY changes now in negative territory for 19 consecutive months. \\nTherefore, it should come as little surprise that large trucking companies in the U.S. are being forced to slash fleets amid slumping demand and slack capacity. According to the Wall Street Journal , several U.S. trucking companies, including Swift, Werner and Covenant, have all been forced to cut 1,000s of trucks from their fleets as “overcapacity has driven down pricing.” Of course, all this means that class 8 truck manufactures are unlikely to see an uptick in new orders anytime in the near future with Werner promising it won’t add trucks “until they see meaningful improvement in the freight and rate markets.” \\n“We haven’t seen any difficulty in finding trucks,” said Ken Forster, chief executive of logistics company Sunteck Transport Group, a broker based in Jacksonville, Fla., that finds and books trucks for freight shippers. “It’s clear that overcapacity has driven down pricing.” \\nIn quarterly earnings reports this month, Swift Transportation Co., Werner Enterprises Inc. and Covenant Transportation Group Inc. said they have pulled a combined hundreds of trucks from service since the second quarter. \\nIdling trucks is a way large fleets can quickly reduce capacity to match demand, which has stagnated this year amid uneven retail imports and sluggish growth for manufacturers. \\nSwift, the country’s largest truckload carrier, counted 581 fewer trucks in the third quarter than it did this time last year, and plans to cut an additional 200 trucks in the fourth quarter. The company’s fleet tops 19,000 big rigs. \\nWerner, the fifth-largest U.S. truckload carrier, according to SJ Consulting Group, said it cut its fleet by 240 trucks in the quarter ended Sept. 30 from a year earlier. The company posted a 41% drop in third-quarter net profit, to $18.9 million, and said in its earnings statement that it won’t add trucks “until we see meaningful improvement in the freight and rate markets.” \\nThat said, we wouldn’t hold our breath waiting for demand and pricing to rebound. As Barclays points out, consumer goods imports have continued to remain very weak in 2016 which they think could “ presage a slowdown in household demand. ” Moreover, Barclays points out that amongst durable goods orders only autos have held up over the past several months amid overall declines for the larger basket though even autos have seemingly “ reached a plateau.” Post navigation'"}, "time": 1742561910.4772835}