{"duration": 0.06408023834228516, "input_args": {"text": "'Students expressed their “fear” over a Trump presidency in messages to each other that were being shared on Twitter today: “Literally scared for their lives” is the new “literally Hitler”. #NotMyPresident pic.twitter.com/8cKfQdF2Ce \\n— Paul Joseph Watson (@PrisonPlanet) November 9, 2016 \\nAnd finally, this ridiculous and totally biased email was sent from University of Michigan President to the students offering them assistance to help them through the results of our Presidential election last night. The President wants to ensure the students that the university remains committed to their “most important responsibility” at their school which is apparently, “to remain committed to education, discovery and intellectual honesty – and to diversity, equity and inclusion.”: \\nTo All Members of the University Community: \\nAs I’m sure many of you did, I watched the election coverage late into the night, and had the opportunity to visit with students and staff at a results-watching event sponsored by the Ginsberg Center at the Michigan Union. It will take quite some time to completely absorb the results from yesterday’s election, understand the full implications, and discern the long-term impact on our university and our nation . More immediately, in the aftermath of a close and highly contentious election we continue to embrace our most important responsibility as a university community. Our responsibility is to remain committed to education, discovery and intellectual honesty – and to diversity, equity and inclusion. We are at our best when we come together to engage respectfully across our ideological differences; to support ALL who feel marginalized, threatened or unwelcome; and to pursue knowledge and understanding, as we always have, as the students, faculty and staff of the University of Michigan. There are reports of members of our community offering support to one another. Students are planning a vigil tonight on the Diag at 6 p.m. Our Center for Research on Teaching and Learning also has numerous resources available for faculty seeking help in cultivating classroom environments that are responsive to national issues. I also want to make everyone aware of some of the plans and events we have had in place for today and beyond. · Our Gerald R. Ford School of Public Policy is holding a Post-Election Analysis from 4 to 5:30 p.m. today in the Weill Hall’s Annenberg Auditorium. Speakers include former U.S. Congressman John Dingell, former Ambassador Ron Weiser, and faculty members Mara Ostfeld, Betsey Stevenson and Marina Whitman. · Our History Department has organized a community discussion led by faculty and students to include historical perspectives at 6 p.m. tonight in 1014 Tisch Hall. · The Office of Student Life will provide resources and referrals for support on campus to students, faculty and staff at a location in the Michigan Union’s Willis Ward Lounge. It will be open today from 11 a.m. to 4 p.m. · Our Office of Multi-Ethnic Student Affairs is offering an open space of support to help members of our community connect during open hours today. MESA’s office is in the Michigan Union, Room 2202. · Tomorrow, our Ginsberg Center and Counseling and Psychological Services office is facilitating a Post-election Dialogue: Impact, Perspective-taking, and Moving Forward. This event is part of the Student Life Professional Development Conference at 1 – 2 p.m. in the Michigan League’s Henderson Room. I know that other schools, colleges and offices across our campus are planning events as well. I thank everyone who is helping us come together and ask anyone scheduling a post election event post it on the University of Michigan Events Calendar. I hope all of us will continue to proudly embrace the opportunities before us as the students, faculty and staff of a great public research university governed by the people. Elections are often times of great change, but the values we stand for at U-M have been shaped over the course of nearly 200 years. Our mission remains as essential for society as ever: “…to serve the people of Michigan and the world through preeminence in creating, communicating, preserving and applying knowledge, art, and academic values, and in developing leaders and citizens who will challenge the present and enrich the future.” I look forward to working together with all of you to advance the work we do in service of the public – and to ensure that the University of Michigan will always be a welcoming place for all members of society. Sincerely, \\nMark Schlissel President  '"}, "time": 1742562551.1018536}