{"duration": 0.07370305061340332, "input_args": {"text": "'James Bond wouldn’t make the grade in modern MI6, says Britain’s top... James Bond wouldn’t make the grade in modern MI6, says Britain’s top spy By 0 41 \\nFictional super-spy James Bond’s lack of a moral compass would quickly rule him out of the intelligence services today, the head of MI6 said in a rare public statement. \\nIn a question-and-answer session for the Black History Month website, spy chief Alex Younger said 007’s lack of an ethical core would have seen him rejected from training. \\n“ We know that if we undermine British values, even in the name of defending them, then we have failed. Our staff are not from another planet ,” Younger said. \\n“ They are ordinary men and women operating in the face of complex moral, ethical and physical challenges, often in the most forbidding environments on Earth .” \\nRead more \\n“ In contrast to James Bond, MI6 officers are not for taking moral shortcuts. In fact, a strong ethical core is one of the first qualities we look for in our staff, ” he added. \\nYounger insisted that Bond’s erratic individualism would certainly have rendered him unable to “get through our recruitment process.” \\n“ Whilst we share his qualities of patriotism, energy and tenacity, an intelligence officer in the real MI6 has a high degree of emotional intelligence, values teamwork and always has respect for the law… unlike Mr. Bond, ” Younger said. \\nSome, however, would contest claims that MI6 is a bastion of ethical conduct, not least during the UK’s heavy involvement in kidnap and torture in the post-9/11 world. \\nA Libyan kidnapped and delivered to the Libyan regime for torture recently questioned the commitment to morality of a previous MI6 head. \\nIn July, Abdul Hakim Belhaj said former MI6 chief Mark Allen was mistaken if he thinks a recent article he wrote for a Christian magazine means his “account is settled with God.” \\nIn 2004, Abdul Hakim Belhaj was kidnapped in Hong Kong with British complicity, along with his pregnant wife, and rendered back to his native Libya. He was then held and tortured by the regime of Colonel Muammar Gaddafi for six years. \\nA note faxed from Allen to the Libyan authorities told the regime’s spy chief Moussa Koussa: “ I congratulate you on the safe arrival of… the air cargo. ” \\nOn August 4, a day before the Crown Prosecution Service (CPS) decided it would not press charges against Allen, the ex-spook published a piece in the Catholic Herald on “ Christian ” approaches to terrorism. \\nBelhaj’s response, which had been offered to the Herald, was published on the website of the Reprieve human rights charity. \\n“ His words on the power of faith to see us through bloodshed are too rich to swallow, ” the torture victim wrote in reference to the now infamous ‘ air cargo ’ fax. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742562201.0161924}