{"duration": 0.11380600929260254, "input_args": {"text": "'Leave a reply Dylan Harper – The entire physical universe is made up of pure energy and vibration. When you have the insight to see everything as vibration, the nature of the universe is revealed to you. Light is vibration. The entire electromagnetic wave spectrum of visible light produces different colors. Colors are simply waves vibrating at different frequencies . On one end of the spectrum you have red, on the other end you have violet. Red has the longest wavelength and the lowest frequency, violet has the shortest wavelength and the highest frequency. There are two kinds of electrical lighting that you can find when you visit an electronic store. Warm light and cool light. Warm light contains a greater mixture of lower frequency color waves such as yellow and orange. Cool light contains a greater mixture of higher frequency color waves such as green and blue. Light is crucial in its environmental effect upon work, play, rest and other life activities. It controls stimulation, relaxation and energy level . Since warm light is more relaxing than cool light, you might decide to use it for the ambience it creates. Have you ever used only warm lights in a room and thought that you could make the place more relaxing or stimulating simply by increasing or decreasing the light intensity? But it doesn’t work that way. Increasing the light intensity of warm light does not make it a lot more stimulating. Higher energy levels require higher rate of vibration. It is not the magnitude but the frequency of the vibration that determines its energy level. Is it any wonder that blue flame is hotter than yellow flame? Health is vibration. Cold, damp and dark places with lack of airflow are breeding grounds for bacteria, whereas sunny places with abundance of airflow eliminate unhealthy micro organisms. The second type of environment is healthier than the first because it is high vibration while the other is low vibration. Although sunlight is biologically beneficial, too much of it causes heatstroke. The energy turns from being constructive to destructive. The key here is balance. Too much of something beyond the rightful amount causes instability. This is what all sickness and disease does. It seeks to weaken or destabilize vibration. The more vibrant and stable a person is, the more alive and constructive he/she are. The more lackluster and unstable he/she is, the less alive and/or the more (self)destructive. Ever wonder why you have always been told to drink warm water and not to drink cold one when you were sick? When the body is sick, there are things within that are clogging up the system and slowing down some functions. The body needs energy to move the sickness out of the body or to destroy it. That is why your doctor advices you to drink plenty of water. It is the medium that your blood cells use to mobilize their work. More water and oxygen gives your body the much needed resources it needs in getting rid of the sickness. Your impulse of coughing out phlegm and blowing out mucus is your bodies act of expelling the bad stuff from your body, which means you are on the road to recovery. Warm water is high vibration whereas cold water is low vibration. Cold water removes the precious energy needed for recovery, whereas warm water supplies it. One supports your recovery rate while the other sabotages it. Sound is vibration. Bassy music is low vibration and energetic music is high vibration. We enjoy listening to different types of music because we like to experience different ranges of emotion. The variety of feelings in life makes it fun and meaningful. High energy dance music appeal to younger people because they are highly energetic and expressive. Slower and emotional entrancing music is what we desire to hear when we want to be moved in a deep and sensual way. We want time to slow down and come to a standstill the experience to be like an eternal moment. Chemical is vibration. Alcohol and earl grey tea are opposite in terms of vibration. Although stress and anxiety is a form of high vibration, it is undesirable because the vibration is incoherent and disorderly. Alcohol lowers vibration. That’s why people drink to relax and distress. But drinking consumes more than the natural amount of alcohol that the body is supposed to take. Therefore it causes instability as well. Drivers who drink have impaired judgment and reaction rate are more susceptible to accidents. People who are above the need of alcohol to relax have chosen more intelligent means of doing so. Earl grey tea acts as a stimulant that counters the effects of alcohol to a certain extent to “sober” you up. The vibration of our “bodies” at every level, physical and non-physical, has a profound influence on our ability to attract positive experiences. The higher your vibration, the more of a “magnet” you become as a result of the thoughts you hold in your mind. By holding only thoughts of the “things” you wish to manifest into your experience, and keeping your vibrations high in the ways we discussed previously, you will find your wishes will manifest much more quickly. When you learn to see everything as vibration different in terms of rate and stability, you will understand what you need in order to obtain the desired effect in any situation. It is all about balancing vibrations. There are lots more aspects of physical reality than those mentioned here where this principle is applied to. Once you are aware of this principle and always think in terms of vibration, you can understand practically everything that happens in the physical world. This is one of the governing dynamics that allows you to make sense of everything. Having this awareness is like seeing the world in code, like the Matrix . Dylan Harper is a 32-year-old surfer from California. He traveled the world, rode the waves and learned the universal concept of oneness. He is a vegan for over a decade and, literally, wouldn’t hurt a fly. He was reunited with his twin soul in Greece, where they got married and settled… for now. Dylan is a staff writer for DreamcatcherReality.com and teaches surfing to children. SF Source Dreamcatcher Reality  '"}, "time": 1742562286.4570014}