{"duration": 0.04330945014953613, "input_args": {"text": "'Cast Your Vote: What Was Most Significant in Shaping the 2016 Election? Posted on Nov 4, 2016 Are you voting on November 8? ( Flickr / CC 2.0 ) \\nIn four days, the unprecedented political chaos that is the 2016 presidential election will ( hopefully ) come to a close. Looking back on the past year, we see innumerable instances of political turmoil that may shape Tuesday’s outcome. \\nDonald Trump, the Republican nominee, has faced his share of obstacles. Most notably, a leaked tape from Access Hollywood almost derailed his campaign in October. Hillary Clinton’s campaign, meanwhile, has been marred by the FBI’s investigation into her use of a private email server while secretary of state—a topic that has yet again become a focus of national attention because of FBI Director James Comey’s timing . \\nOutside the two main-party candidates’ own woes, other crucial issues have absorbed the nation throughout the election season: The battle over the Dakota Access pipeline . The changing role of third-party candidates . A renewed focus on racial inequality . And of course, the trove of information given to us by WikiLeaks. \\nAs we look toward Tuesday, the finale of an increasingly tight race to the White House, we at Truthdig turn to our readers to ask: What was the most significant story of the 2016 election season? Note that our poll is not intended as a scientific evaluation, but rather as a chance for readers to express their opinions and expand upon their answers in the comment section of this post. \\nLet us know in the poll below. Vote early but not often: One vote per person, please. Several possible answers are offered, but you can also choose “Other” and type in your own—we want to know what we’ve missed! \\n(Make your selection and then click on “Vote.” To see how others have weighed in, click on “Results.”) Which event was most significant in shaping the 2016 election? The allegations of sexual assault against Donald Trump following his leaked “lewd remarks” The FBI’s investigation into Hillary Clinton’s private email server The battle over the Dakota Access pipeline The presence of third-party candidates like Jill Stein and Gary Johnson A renewed focus on America’s racial inequality The “Podesta Emails” released by WikiLeaks Other'"}, "time": 1742628596.5324965}