{"duration": 0.11742877960205078, "input_args": {"text": "' Trump Camp Accused Of Anti-Semitism President Trump Has Shattered Jews\\' American Idyll November 14, \" Haaretz \" - American Jews have transformed virtually overnight from insiders to outsiders; the appointment of ex-Breitbart CEO Steve Bannon, an accused anti-Semite, as chief strategist, is bound to exacerbate the tensions.\\nBy Chemi Shalev WASHINGTON \\x96 Those were the best of times, arguably, but these may be the worst of times. That\\x92s the way most American Jews must feel as they wake up with a massive hangover from the shock election results and the reality that Donald Trump will soon be President of the United States.\\nWhatever differences American Jews may have had with Barack Obama over the Iran nuclear deal and Middle East peace, they\\x92ve never had a president who was more in tune with their Jewish and liberal essence.\\nObama was the realization of the American Jewish vision of a multicultural society, a dream come true for a generation of civil rights activists. He promoted and embodied the liberal ideals that American Jews are more attached to than any other religious group in America. And he was more knowledgeable about American Jewish culture and Yiddishkeit than any previous president, bar none. Even when they disagreed with him, most American Jews, with the exception of the vocal minority that hated his guts, viewed Obama as a mensch.\\nIt is probably no coincidence that during his tenure, American Jews reached a pinnacle of social and cultural acceptance. Being American Jews was hip. It was cool. It was the thing to be. From Jon Stewart to Jerry Seinfeld, from Joe Lieberman to Bernie Sanders, Jews seemed to be more entrenched than ever before in the American mainstream. Pew Research Polls repeatedly confirmed that Jews were the most loved and most admired religious group in all of America. Mashiach-zeit, old timers would say, but with a note of caution, because if Jewish history teaches anything, it is that all things must pass.\\nThe election of Donald Trump has shattered the Jewish idyll, all across the board. Although one must give the president-elect the benefit of the doubt that he is not an anti-Semite himself, he has frequently promoted disparaging Jewish stereotypes in his personal statements. Sunday evening\\x92s appointment of former Breitbart CEO Steve Bannon as chief strategist in the White House is bound to exacerbate Jewish tensions. He is considered the standard bearer for the racist, anti-immigrant alt-right movement and has been accused of harboring anti-Semitic sentiments himself.\\nTrump has repeatedly and unapologetically disseminated white supremacist tweets. His campaign has used anti-Semitic symbols that Trump has failed to disown even when advised of their offensive content. He has distanced himself from his neo-Nazi supporters only under duress. And under his wings, America has seen an unprecedented outburst of blunt and naked hatred of Jews, which has only gotten worse since his election.\\nIn recent months, most prominent Jewish journalists and other public critics of Trump have been harassed by anti-Semites on social media, in their mail at home and, in some cases, in close physical contact. Swastikas have been painted at schools. Jewish students have been threatened, taunted, told that Adolf Hitler was right all along. Along with Muslims, Hispanics, and African Americans, they are being targeted as the sworn enemies of the America First Weltanschauung that Trump is bringing with him to the White House.\\nThe shock that many Jews are feeling now is partly of their making. In recent years, the American Jewish establishment has willingly enlisted in the Israeli government\\x92s effort to depict ever-widening circles of anti-Israeli agitation on the left as anti-Semitism. The fight against BDS and the efforts to portray it as hatred of Jews in another form has consumed the time, energy and resources of the American Jewish leadership, with the possible exception of the Anti-Defamation League.\\nMeanwhile, virulent and classic anti-Semitism lurking just under the radical right\\x92s surface was virtually ignored, concealed by the mainstream right-wing\\x92s overwhelming support for Israel. Even mentioning it was considered to be an anti-Israeli provocation.\\nTrump\\x92s triumph has unleashed the pent up resentment against Jews. His reluctance to tackle manifestations of racism and white supremacism among his supporters has energized and empowered it. If he and his advisers don\\x92t take assertive steps soon, anti-Jewish agitators will feel they have a license from the White House to do as they please. They will get bolder, grow stronger, recruit new adherents and increasingly resort to violence: we\\x92ve seen it before.\\nBut even if brazen anti-Semitic incidents are quelled or die down by themselves, there is no denying that Jews have transformed virtually overnight from insiders to outsiders. Not only did they vote overwhelmingly for Hillary Clinton, prominent conservative Jews who could have allayed their concerns are the ones who have distanced themselves from Trump over the course of the campaign and will play no role in his administration.\\nAmerican Jewish liberals are bound to feel alienated from their own government in way they\\x92ve never felt before. Most of the values, goals and policy objectives of the Trump administration, even if they turn out to be a paler and more palatable version of his campaign rhetoric, are diametrically opposed to those of most American Jews. They support immigration, pluralism, multiculturalism, social reform, government intervention, separation of church and state, gay marriage, abortion rights and on and on. It is easy to see, in fact, why so many of Trump\\x92s radical supporters would view the Jews as their mortal enemies.\\nAs Shmuel Rosner rightly points out for the wrong reasons, Trump may ultimately divide Israeli and American Jews. But the reason for that is not limited, as Rosner asserts, to the yet to be proven assumption that American Jews will resent their Israeli counterparts for liking Trump because he is pro-Israel. It is because Trump\\x92s core message, his reactionary, nativist, chauvinistic, anti-foreigner, anti-immigrant and mainly anti-Muslim worldview is shared by far too many, though far from all Israelis, and is embraced by its ruling coalition. And because many Israeli Jews are indifferent to right-wing anti-Semitism and indeed share right-wing disdain toward the liberalism of American Jews.\\nOf course, all may not be bleak. Perhaps Trump will fight the anti-Semitism on his radical fringe with increasing vigor. Possibly his policies will be less offensive to American Jews. Perhaps the American Jewish establishment will produce a leadership capable of meeting these trying times. Who knows, maybe some American Jews will finally realize they should support Israeli Jews who share their worldview rather than a government that doesn\\x92t.\\nAnd if worse comes to worst, to paraphrase Casablanca, liberal American Jews will always have Israel itself. Moderate, liberal Israelis, beleaguered and on the point of despair, will flock to the airport to welcome them with open arms. Mashiach-zeit, they will tell themselves, in awe. Š Haaretz Daily Newspaper Ltd. All Rights Reserved'"}, "time": 1742563389.3530712}