{"duration": 0.1214137077331543, "input_args": {"text": "'WASHINGTON  —   President Trump on Thursday dismissed reports about his associates’ contacts with Russia last year and vigorously defended his performance in his first four weeks in office, in a contentious news conference that showcased his unconventional and unconstrained presidency. At a hastily organized White House event  —   ostensibly to announce a new nominee for labor secretary, R. Alexander Acosta  —   Mr. Trump engaged in an extended attack on the news media and insisted that his new administration was not a chaotic operation but a “  machine. ” Any challenges, he said, were not his fault. “To be honest, I inherited a mess,” he said. In addition to his cabinet announcement, the president revealed that he had asked the Justice Department to investigate government leaks and said he would sign an executive order next week restricting travel to the United States. He promised to produce by March a plan to repeal and replace the Affordable Care Act, followed by another plan to overhaul the tax system. But his   news conference was dominated by an extraordinarily raw and angry defense of both his administration and his character. At times abrupt, often rambling, characteristically boastful yet seemingly pained at the portrayals of him, Mr. Trump kept summoning the spirit of his successful campaign after a month of grinding governance to remind his audience, again, that he won. For a president who has already lost a court battle, fired an acting attorney general and a national security adviser, and lost a cabinet nomination fight, Mr. Trump was eager to demonstrate that he was still in command. He attacked judges for blocking his original travel order and Democrats for obstructing his nominations. He denied being   even when no one accused him of it. With the latest Pew Research Center poll showing that just 39 percent of Americans approve of the job he is doing, Mr. Trump at one point plaintively pleaded for understanding. “The tone is such hatred,” he said, referring to the commentary about him on cable television. “I’m really not a bad person. ” Mr. Trump disputed any contention that the White House was out of control or not fully functional, and boasted of a flurry of actions intended to create jobs, curb regulations and crack down on illegal immigration. “There has never been a presidency that has done so much in such a short period of time,” he said. “And we haven’t even started the big work yet. That starts early next week. ” The enactment of a temporary ban on refugees and all visitors from seven predominantly Muslim countries, he maintained, was “perfect,” despite widespread confusion and subsequent court rulings blocking it. “We had a very smooth rollout of the travel ban,” he said. “But we had a bad court. ” Mr. Trump offered his first account of his decision to fire Michael T. Flynn, his national security adviser, for misleading Vice President Mike Pence and others in the White House about the contents of a conversation with Russia’s ambassador in December. He said he was not bothered that Mr. Flynn had talked with the ambassador about American sanctions on Russia before arriving at the White House. “I didn’t direct him,” he said, “but I would have directed him, because that’s his job. ” The problem, he said, was that Mr. Flynn had told Mr. Pence that sanctions did not come up during the conversation, an assertion belied by a transcript of the call, which had been monitored by American intelligence agencies. “The thing is he didn’t tell our vice president properly, and then he said he didn’t remember,” Mr. Trump said. “So either way, it wasn’t very satisfactory to me. ” But he said reports that his campaign aides and other associates had contacts with Russia were “a joke” and “fake news put out by the media. ” The New York Times reported this week that phone records and intercepted calls showed repeated contacts between some of his associates and Russian intelligence officials in the year before the election. “Russia is a ruse,” Mr. Trump said. “I have nothing to do with Russia. To the best of my knowledge, no person that I deal with does. ” However, Mr. Trump said, all the pressure on Russia may ruin any future negotiations with President Vladimir V. Putin. “Putin probably assumes that he can’t make a deal with me anymore because politically, it would be unpopular for a politician to make a deal,” he said. Like presidents before him, Mr. Trump was peeved at a series of leaks, including about Mr. Flynn’s call and his own conversations with foreign leaders. In addition to requesting the Justice Department investigation, he confirmed that he might assign a New York billionaire, Stephen A. Feinberg, to conduct a broad review of the intelligence agencies. “He’s offered his services, and you know, it’s something we may take advantage of,” Mr. Trump said. But he added that it might not be necessary because “we are going to be able to straighten it out very easily on its own. ” Mr. Trump returned again and again to his contest with Hillary Clinton, replaying key events from the 2016 campaign and reviving his favorite attacks. He repeated a claim that Mrs. Clinton gave Russia access to American nuclear fuel supplies. “I’ve done nothing for Russia,” he said. “Hillary Clinton gave them 20 percent of our uranium. ” The State Department did sign off on the purchase of a Canadian company by a Russian state firm that gave Russia control of   of America’s uranium production capacity, as did eight other agencies. But Mrs. Clinton was not in a position to approve or reject the deal when she was secretary of state, and it is not known if she was briefed on the matter. Mr. Trump spent much of the conference berating reporters and their news organizations. Clearly exasperated by coverage of him, he said he did not watch CNN but then gave a detailed critique of one of its shows. He cited specific articles in The Times and The Wall Street Journal that he called “fake,” even harking back to one from last year’s campaign. “The press is out of control,” he said. “The level of dishonesty is out of control. ” He added later, “The public doesn’t believe you people anymore. ” The acrimony grew so sharp at one point that CNN’s Jim Acosta felt the need to tell Mr. Trump, “Just for the record, we don’t hate you. ” But that did not assuage him. At one point, he called on Jake Turx, an   Jewish reporter from Ami Magazine. “Are you a friendly reporter?” he asked. “I haven’t seen anybody in my community accuse either yourself or anyone on your staff of being ” Mr. Turx said. But, citing bomb threats against Jewish centers, he said, “What we haven’t really heard being addressed is an uptick in   and how the government is planning to take care of it. ” Mr. Trump bristled, taking it as a suggestion that he was   even though the reporter specifically said the opposite. “I am the least   person that you’ve ever seen in your entire life,” Mr. Trump said. Mr. Turx protested that he was not suggesting otherwise. “Quiet, quiet, quiet,” Mr. Trump said. “See? He lied. He was going to get up and ask a very straight, simple question. ” Instead, Mr. Trump said, the question was “repulsive” and “very insulting. ” He later accused Democrats of posing as supporters and holding up offensive signs at his rallies to smear him. When April Ryan of American Urban Radio Networks asked whether he would meet with the Congressional Black Caucus to discuss his urban agenda, Mr. Trump again seemed piqued. “Do you want to set up the meeting?” he challenged her. “Are they friends of yours?” “I’m just a reporter,” said Ms. Ryan, who is  . “Well, then, set up the meeting,” Mr. Trump said. That exchange and others included claims that were false or disputed. Mr. Trump told Ms. Ryan that he had planned a meeting with Representative Elijah E. Cummings, an   Democrat from Maryland, but that Mr. Cummings had said: “It might be bad for me politically. I can’t have that meeting. ” Mr. Cummings later denied that. “I have no idea why President Trump would make up a story about me like he did today,” he said. “I was actually looking forward to meeting with the president about the skyrocketing price of prescription drugs. ” Similarly, Mr. Trump asserted that his Electoral College victory was the largest since Ronald Reagan’s. But he won fewer Electoral College votes than three of the four presidents since Reagan: Barack Obama, Bill Clinton and George Bush. When a reporter pointed that out, Mr. Trump brushed it off. “I was given that information,” he said.'"}, "time": 1742562681.9541194}