{"duration": 0.11147737503051758, "input_args": {"text": "'Trump “Will Probably Win” and Gold “May Rise $100” Overnight – Jim Rickards Posted on Tweet Home » Gold » Gold News » Trump “Will Probably Win” and Gold “May Rise $100” Overnight – Jim Rickards \\nIn stunning remarks made yesterday, Jim Rickards says that Trump “will probably win” and, if he does, stock markets will crash 10% and gold will rise $100 over night. “If Hillary wins nothing happens, if Trump wins you will have an earthquake.” \\nFrom Mark Obyrne : \\nJim Rickards: Trump “Will Probably Win” and Gold “May Rise $100” Overnight \\nThe US election is just two weeks away on November 8th, and one of Hillary Clinton’s most vocal critics on the business side is finance commentator and monetary expert Jim Rickards. Jim is in Sydney this week, armed with his latest book, hot off the press entitled ‘The Road to Ruin – The Global Elites’ Secret Plan for the Next Financial Crisis’ and gave an interesting television interview to ‘The Business’ on ABC Australia. \\nRickards says that Trump “will probably win” and, if he does, stock markets will crash 10% and gold will rise $100 over night. \\nThe markets and polls believe Clinton will win and t hat is priced into markets in the same way that a ‘Bremain’ was priced into markets prior to the ‘Brexit’ vote. \\nKilkenomics 2016 – Where Comedy Meets Economics \\n“If Hillary wins nothing happens, if Trump wins you will have an earthquake.” \\nShould Trump win, which looking at the polls is not an impossibility, gold would likely surge $100 per ounce overnight, says Rickards. \\nWhat Hillary did was appalling Rickards says in relation to the Clinton email scandal. There will be ‘another reckoning on November 8th’ which the market has failed to price in, creating a good scenario for gold. He says you don’t have to agree that Trump will win, but agree that that in reality he could win. \\nFor Rickards, this is an excellent opportunity for investors, particularly those who have an allocation to physical gold which he believes is set to rise in the coming months and years. \\nJim is editor of Strategic Intelligence for Agora Financial as well as the founder of the James Rickards Project: an inquiry into complex dynamics of geopolitics and capital. He is also the author of New York Times bestsellers The New Case for Gold, Currency Wars: The Making of the Next Global Crisis and The Death of Money: The Coming Collapse of the International Financial System. \\nJim’s newest book, The Road to Ruin will be published in November and he is appearing at Kilkenomics 2016 where he will speak at a number of events.'"}, "time": 1742563163.3807802}