{"duration": 0.10720133781433105, "input_args": {"text": "'Rep. Luis Gutierrez ( ) whined about Breitbart News’ coverage of illegal immigrants and Muslim refugees during his recent commencement address at Cambridge College.  “Breitbart and Fox News didn’t invent their opinions on Mexicans and Central Americans or Muslims,” he claimed the day after the London Bridge terror attacks. “They’re just recycling them. ” He told Cambridge College’s graduates, “I say lift the Muslim ban and tell the Supreme Court to say it’s unconstitutional and  . ” Gutierrez called President Donald Trump an “unqualified game show host” and said he saw “in our country great hope and great enthusiasm for resistance against Trump’s America and what it stands for. ” After the London Bridge attacks, Trump called for the “Travel Ban” as an “extra level of safety” and added that “we must stop being politically correct” or “it will only get worse. ” “We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!” Trump tweeted. “We must stop being politically correct and get down to the business of security for our people. If we don’t get smart it will only get worse. ” We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!  —   Donald J. Trump (@realDonaldTrump) June 3, 2017,  We must stop being politically correct and get down to the business of security for our people. If we don’t get smart it will only get worse,  —   Donald J. Trump (@realDonaldTrump) June 4, 2017,  Gutierrez said when it comes to immigrants, religious and ethnic groups, “whatever group is coming right now,” there is “always a chorus” of people saying “they are the wrong kind of people, they are criminal, they are disloyal, and they will ruin everything for the rest of us in America. ” He said they were “wrong about the Irish Catholics that fled Ireland” and they are “wrong about the Syrian refugee Muslims that come to America seeking a place of refuge. ” He told graduates that when he was growing up, the New York Times said Puerto Ricans like his parents “were bringing tropical diseases” to New York and would be on welfare and “lead a life of crime. ” He also said there was “no one to stand up for my parents,” or the “Chinese when they were excluded,” or the Irish, or the “Japanese when they were put in internment camps, or the Jews when they were turned back to certain death, or the Italians everyone made fun of. ” He blasted Attorney General Jeff Sessions, claiming Sessions wants to “roll back voting rights and basic civil rights” and to “reignite the war on drugs. ” “I ask you to never forget as they try to roll back voting rights and civil rights that people were murdered, churches were bombed, people were lynched, they were beaten and brutalized so we can have these voting rights and civil rights,” he said. Gutierrez also claimed Sessions wants to deport as many people as possible and “use the law to paint all immigrants as criminals. ” He called on Trump’s administration to leave illegal immigrant laborers, parents, and those working in the fields alone and “go after the criminals that are in our neighborhoods, not after the decent people trying to make a better future in America. ” He told the audience that he became active in politics after realizing that his fellow establishment Democrats were “bigoted. ” Gutierrez told the graduates that in the 1980s, Democrats in Chicago asked him to vote for a Republican candidate for mayor because the Democrat, Harold Washington, was black. After Washington won the Democratic primary, “the Democratic Party of Chicago didn’t like it one bit because he was black,” Gutierrez said, adding that some Chicago Democrats wanted him to “vote against Harold Washington because a black person might move on your block, or went to school with your kids, or maybe married your daughter or your son. ” He said he was not “very political” at the time and just thought Washington, who would later endorse Gutierrez’s candidacy for Congress, was the best person for the job. Gutierrez said “these guys from the Democratic Party” were proving that “racism ran deep” and “something awoke in me. ” He said he told his neighbors “what racist bigots they were” and urged them to not let “fear and bigotry” determine their votes. Gutierrez told the graduates that they will have to play a role in “repairing the country from the damage that is being done today” and urged them to stand up “against the people who are surrounding the president and drawn from the most discredited corners of white nationalism, corporate greed   rights,   rights,       rights, and extremists who are anti almost everything that should be top tier in America. ” He implied that Trump, Sessions, and White House chief strategist Steve Bannon would be uncomfortable with the “different ethnicities” and “different languages” in the crowd of “different colors. ” “You are the flavor of America,” he said. “You are building a stronger America. ” Gutierrez is   for his    rhetoric, histrionics, and outlandish predictions. When House Republicans passed the American Health Care Act last month, Gutierrez compared the passage of “Trumpcare” to Pearl Harbor, Fort Sumter, and the invasion of Iraq. “Attacking Pearl Harbor, firing on Fort Sumter and invading Iraq looked like good ideas to the perpetrators at the time,” Gutierrez said. “But in the end, they were huge blunders that harmed America and came back to haunt those who to took those actions. That is how I see this health care vote for Republicans. ” Gutierrez also predicted on the House floor in 2014 that George W. Bush would be the last Republican president if Republicans did not work with his fellow Democrats to pass a massive comprehensive amnesty bill. Two years after the bipartisan effort to ram through amnesty failed —  largely because of Breitbart News’ relentless reporting on the matter —  Trump was elected president.'"}, "time": 1742561884.0787733}