{"duration": 0.015817880630493164, "input_args": {"text": "'The Left Turns on Bob Dylan for His Pro-Israel Views, Refusal to Acknowledge Nobel Prize Oct 28, 2016 Previous post \\nSo Bob Dylan has won the Nobel Prize for Literature “for having created new poetic expressions within the great American song tradition.” His name is now enshrined among a list of laureates that includes luminaries like T. S. Eliot, William Faulkner, and Aleksandr Solzhenitsyn. \\nIt’s a tremendous honor for the legendary singer-songwriter, that’s for sure. But it’s also stirred up its share of controversy. I won’t debate Dylan’s award—I’ll leave that to my esteemed colleagues Andrew Klavan and Ron Radosh —except to say two quick things. First, when the Nobel Peace Prize has gone to people like Yasser Arafat and Barack Obama, did it dim the luster of the prizes in other categories? And second, I like the idea of songs like “Gotta Serve Somebody” and “Saved” (and, apologies to Andrew, even “It Ain’t Me, Babe”) joining the pantheon of Nobel Prize-winning literature. \\nBut now that the reliably left-leaning Nobel Prize Committee has given Dylan an award, a funny thing has happened. The left has begun to turn on Dylan for being less than the predictable leftist they have expected him to be. In Defense of Bob Dylan’s Nobel Prize for Literature—He Deserves it! \\nThe first example comes to us from that cherished source of unbiased news, Al Jazeera. In a recent editorial , French sociologist and “media critic” Ali Saad takes the media to task for reporting the news of Bob Dylan’s award without mentioning that he— gasp— supports Israel. Saad gripes that: \\n…media outlets, both Arab and international, framed the story without taking issue with Dylan’s pro-Israel stance and instead portrayed him exclusively through the prism of his constructed image as defender of the oppressed. \\nSaad goes on to cite “Neighborhood Bully,” an early ’80s tune from Dylan that expresses support for the nation of Israel. \\nThe song, that Stephen Holden described in The New York Times in 1983 as “ an outspoken defence of Israel “, begins by stating two key precepts emphasising the Israeli perspective: first by comparing Israel to a man in exile whose enemies unjustly “claim he’s on their land”, a sentence that serves as a scolding to those who refute the legitimacy of Israel’s historic claim to Palestine’s land. Then, by metaphorically presenting Israel as a man “outnumbered by a million to one”, which postulates the frequent representation of Israel as the underdog of the Middle East.Such a stance by an anti-war activist raises serious doubts over Dylan’s commitment to humanity \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742628479.9891818}