{"duration": 0.031716346740722656, "input_args": {"text": "'LIFESTYLE \\nFinland’s education system is considered one of the best in the world. In international ratings, it’s always in the top ten. However, the authorities there aren’t ready to rest on their laurels, and they’ve decided to carry through a real revolution in their school system. \\nFinnish officials want to remove school subjects from the curriculum. There will no longer be any classes in physics, math, literature, history, or geography. \\nThe head of the Department of Education in Helsinki, Marjo Kyllonen, explained the changes: \\n“There are schools that are teaching in the old-fashioned way which was of benefit in the beginning of the 1900s — but the needs are not the same, and we need something fit for the 21st century.“ \\nInstead of individual subjects, students will study events and phenomena in an interdisciplinary format. For example, the Second World War will be examined from the perspective of history, geography, and math. And by taking the course ”Working in a Cafe,” students will absorb a whole body of knowledge about the English language, economics, and communication skills. \\nThis system will be introduced for senior students, beginning at the age of 16. The general idea is that the students ought to choose for themselves which topic or phenomenon they want to study, bearing in mind their ambitions for the future and their capabilities. In this way, no student will have to pass through an entire course on physics or chemistry while all the time thinking to themselves “What do I need to know this for?” \\nThe traditional format of teacher-pupil communication is also going to change. Students will no longer sit behind school desks and wait anxiously to be called upon to answer a question. Instead, they will work together in small groups to discuss problems. \\nThe Finnish education system encourages collective work, which is why the changes will also affect teachers. The school reform will require a great deal of cooperation between teachers of different subjects. Around 70% of teachers in Helsinki have already undertaken preparatory work in line with the new system for presenting information, and, as a result, they’ll get a pay increase. \\nThe changes are expected to be complete by 2020. \\nWhat do you think about all these ideas? We’d love to hear your opinion, so let us know in the comments. \\nPreview photo credit ZouZou'"}, "time": 1742628535.037604}