{"duration": 0.04123973846435547, "input_args": {"text": "'Lovers in India can bring a little sadism into their romance without shelling out for tickets to the Fifty Shades of Grey movies: just walk through the street holding hands, and wait for Bajrang Dal thugs to assault them. [Bajrang Dal is the youth wing of a Hindu fundamentalist organization. The party is “strictly against Western norms and believes youth should stop degrading the culture of India by celebrating Valentine’s Day,” as ANI News explains.  Bajrang Dal spends Valentine’s Day prowling the streets and pummeling any couple they chance across: #WATCH Bajrang Dal activists thrash couples in Bihar’s Muzaffarpur in a protest against Valentine’s Day pic. twitter.   —   ANI (@ANI_news) February 14, 2017,  This year was reportedly supposed to be different. Leaders of the umbrella group in charge of Bajrang Dal urged its members not to assault couples because those who indulge in expressions of love on Valentine’s Day are, they claimed, “similar to nature of animals,” and thus any attempt at convincing them to abandon the practice would be unlikely to sway them. India’s Daily O addressed the Bajrang Dal problem in an editorial dripping with sarcasm, beginning with the observation that lonely singles have the consolation of knowing they won’t be thrashed by a gang of “      scumbags” on Valentine’s Day: These   detectives travel in packs with hockey sticks and lead pipes. They can sniff out   couples from a mile away. Once they have cornered the poor prey, one of two things can happen: if it’s a   couple, they’ll get them married. God forbid, if it is an   couple, well, let us say we’ll pray for the dearly departed. Is there no way to escape these vicious hunters? Is there no respite for hormonal teenagers who just want to gift each other those pink,   things? That crack about forcibly marrying Hindu couples is not hyperbole. India Today reports that Bajrang Dal has warned Indian youth it will perform marriage rituals on the spot for any couples it catches wandering through public places on Valentine’s Day, physically dragging their parents to the scene if necessary. Greater Kashmir reports that Bajrang Dal is receiving substantial online support from India’s Muslims, who also regard Valentine’s Day as symbolic of Western decadence. “The other name of Islam is modesty, while Valentine Day [sic] is sheer immodesty,” one Muslim supporter of the Hindu youth gang wrote.'"}, "time": 1742561867.826207}