{"duration": 0.1264047622680664, "input_args": {"text": "'He said it best, of course: He was “the astronaut of boxing” who “handcuffed lightning,” threw “thunder in jail” the dazzling warrior “with iron fists and a beautiful tan” “the greatest fighter that ever will be” who could “run through a hurricane” and not get wet. But Muhammad Ali shook the world with more than his electrifying speed and power in the ring. He also shook the world with the power of his convictions: his determination to stand up to the rules of the Jim Crow South, and to assert his freedom to invent himself  —   “I don’t have to be what you want me to be. I’m free to be what I want. ” “I am America,” he proudly declared, decades before the Black Lives Matter movement. “I am the part you won’t recognize. But get used to me. Black, confident, cocky my name, not yours my religion, not yours my goals, my own get used to me. ” He stood with the Rev. Dr. Martin Luther King Jr. for freedom and social justice. And he stood up against the Vietnam War, refusing to be drafted in 1967 on religious grounds as a conscientious objector  —   a decision that would cost him his boxing title,     years of his career at the peak of his powers, tens of millions of dollars in prize money and endorsements, and for many years, his popularity. These acts of conscience are part of the reason that older fans, including Barack Obama and Bill Clinton, who eulogized Ali, were so deeply affected by his death. As his wife, Lonnie, noted, he also died at a moment when “we face uncertainty in a world and divisions at home as to who we are as a people. ” It’s a moment when racism has infected the presidential race, when many politicians lack the courage to stand up for their own convictions, when radical jihadists have been trying to subvert the peaceful vision of Islam embraced by Ali. Ali’s willingness to speak truth to power outside the ring and his embodiment of many of the political and cultural changes that rocked America in the 1960s are also reasons so many fans spent the weeks after his death watching old videos and reading books about him, of which there are a multiplying number. Ali was a    novelistic figure: not only an incandescent athlete dancing under the lights but also a showman, poet, philosopher, performance artist, statesman and   pioneer, a man compared to Whitman, Robeson, Malcolm X, Ellington and Chaplin. Writers were magnetized by his contradictions: the G. O. A. T. (Greatest of All Time) who vanquished some of the baddest men on the planet but became one of the world’s most revered humanitarians a deeply religious man who loved practical jokes and practically invented trash talk “a radical even in a radical’s time,” as President Obama put it, who became so beloved by Americans across the political spectrum that he was featured in a DC Comics book in which he teamed up with Superman to save the world. He is best remembered today for his boastful doggerel (“Ali’s got a left, Ali’s got a   if he hits you once, you’re asleep for the night”) but he also wrote more serious verse: a poem about the Attica prison riots read, “Better far from all I   To die fighting to be   What more fitting end could be?” Over the years, Ali has also inspired an uncommon amount of stellar writing, from Norman Mailer’s classic account of the boxer’s stunning victory over George Foreman in Zaire in 1974 to David Remnick’s “King of the World,” a powerful account of Ali’s emergence as a transformative figure in American politics and culture. There are also a plethora of essays about Ali by such gifted writers as Joyce Carol Oates, George Plimpton, Tom Wolfe, Hunter S. Thompson and Roger Kahn, many of which can be found in a terrific anthology, “The Muhammad Ali Reader” (1998). The newest Ali books, recently rushed into print, hardly rise to the top of the stack. “Muhammad Ali: A Tribute to the Greatest” is a hodgepodge of Thomas Hauser’s many essays  —   lackluster in comparison with the author’s valuable 1991 oral history, “Muhammad Ali: His Life and Times. ” Tim Shanahan’s “Running With the Champ,” an old friend’s reminiscences, has its share of touching moments, but proves less revealing than the 2004 book (“The Soul of a Butterfly”) written by Ali with his daughter Hana Yasmeen Ali  —   an elliptical, collagelike memoir that offered a philosophical look back at his life. Both these books give glimpses of Ali’s dignified,   struggle with Parkinson’s, the disease that cruelly robbed him of the dazzling physical and verbal agility of his youth  —   a struggle that could not help but remind older readers of the passage of time and their own mortality, and boxing’s existential proximity to death (or what Ali once called “the near room” after his war of attrition with Joe Frazier in Manila in 1975). As for Sports Illustrated’s “Muhammad Ali, ” it’s a pretty souvenir of Ali’s life in the ring, with excerpts from that magazine’s voluminous archives and some of the most dramatic sports photos ever taken. They are photos that capture the boxer popping and smoking and throwing lightning bolts in the ring  —   testaments to what the fighter José Torres called “his prodigious magic. ” The archetypal photo of a victorious Ali, standing over the fallen body of Sonny Liston. A violent action shot of him catching George Foreman with a hard right in the Rumble in the Jungle. And one of him locked in a grim   with an exhausted Frazier in the “Thrilla in Manila. ” There are also images of a skinny,    Cassius Clay learning to box, and a solemn Ali, surrounded by reporters, explaining his opposition to the Vietnam War. These new books will help younger readers understand just what a long strange trip Ali’s life has been, and how much social and cultural landscape he traversed. “Muhammad Ali was America  —   he will always be America,” Mr. Obama wrote. “He was our most basic freedoms  —   religion, speech, spirit. He embodied our ability to invent ourselves. His life spoke to our original sin of slavery and discrimination, and the journey he traveled helped shock our conscience and lead us on a roundabout path toward salvation. ” These books also prompt us to remember that perseverance was one of the consistent melodies in Ali’s life: coming back after his   exile to reclaim the world championship in 1974 by toughing it out against Foreman in Zaire coming back to beat Frazier twice, after losing their first arduous matchup and coming back against Leon Spinks in 1978 to win the world heavyweight championship for a third time. As Ali once observed: “Champions aren’t made in gyms. Champions are made from something they have deep inside them  —   a desire, a dream, a vision. They have to have   stamina, they have to be a little faster, they have to have the skill and the will. But the will must be stronger than the skill. ” When Cassius Clay was growing up in Louisville, Ky. the town was segregated, and even when he returned home from the 1960 Olympics with a gold medal around his neck, he was turned away from a luncheonette when he walked in and ordered a glass of juice. He would return to the Olympics     decades later in Atlanta in 1996 as its final torchbearer. By then, he’d become one of the most revered men in the world  —   “a universal soldier for our common humanity,” in the words of Bill Clinton, who like many in the audience that day, wept watching Ali light the caldron, his hand trembling violently from Parkinson’s disease. This month, Louisville  —   where a young Cassius Clay heard calls of “nigger go home” if he ventured beyond his neighborhood  —   turned out to pay tribute to Ali, as his funeral motorcade made its way through the city. Mourners showered his car with flowers and rose petals and all along the route, The Louisville   reported, lawns had been mowed and driveways freshly swept  —   out of respect for the Greatest on his final journey.'"}, "time": 1742562048.9459546}