{"duration": 0.05556774139404297, "input_args": {"text": "'Print \\nIt would be hard to imagine a Saturday night at your favorite bar or restaurant without music playing in the background. It would be equally hard to imagine a long road trip without music blasting from the car radio. But a new ruling from a judge in New York has the ability to change all of this, limiting our access music by drastically increasing music costs. \\nThe Department of Justice (DOJ) spent over two years reviewing its antitrust consent decrees with ASCAP and BMI, the leading music collectives that control the rights to nearly 90% of all music compositions. \\nThis summer, the DOJ made the sound decision to keep the decrees as-is with no alterations. \\nThis was the right move. The decrees have been in place for more than 75 years, allowing ASCAP and BMI to maintain their monopolies while also protecting consumers from monopoly pricing. \\nDespite breaking revenue records this year, ASCAP and BMI are thirsty for more profits and lobbied DOJ to relax the consent decrees, allowing them to price gouge music copyrights the way they did before the decrees’ enactment. \\nASCAP and BMI’s goal was to transition to “fractional licensing,” a process that would greatly increase their profits and make it nearly impossible for small businesses to license music. \\nUnder current law, known as “whole work licensing,” a bar or restaurant that wants to license music simply goes to one of the music collectives and purchases a single license for a basket of songs. This process has worked well for decades. However, under “fractional licensing”, small businesses would have to buy the individual rights to million songs, many of which have multiple owners. \\nFractional licensing would give an owner with a 1% stake in a song the same negotiating power as an owner that had the other 99%. Negotiating usage rights with each owner would be extremely complicated, surely driving up the cost of licensing music. In fact, negotiating with the millions of copyright owners would be a full time job in and of itself, so many wouldn’t business owners would be forced to raise prices or stop licensing music altogether. \\nThe DOJ spent years considering the long-term ramifications before it ruled on the consent decrees. The body held numerous meetings with stakeholders and offered multiple rounds of comment periods. Ultimately, they made the right decision to maintain the decrees in their current form because of the potential harm changes could make to the marketplace. \\nYet, just as a bratty child runs to Dad after Mom says no, BMI ran to the courts to appeal the decision. Unfortunately for consumers of music, a judge from the Southern District of New York ruled in BMI’s favor during a pre-hearing. Unlike the two years of research and consideration the DOJ gave the case, this judge spent less than an hour before making a decision. No testimony on the “merits” of such changes were heard before the judge released a six-page decision that would allow BMI to license music on a fractional basis. \\nThe judge’s decision was based on his belief that the consent decrees do not specifically prohibit fractional licensing. But it was unnecessary to mention fractional licensing because the consent decrees require ASCAP and BMI to provide a license for every work in their catalogs. If the sign says the speed limit is 70 miles per hour, it doesn’t mean that you can drive 80, just because the sign did not specifically say, “Do not drive 80 mph.” \\nIt is very likely that the DOJ will appeal this decision. If not, it will wreak havoc on the millions of businesses that pay music — and it will deny all of us the pleasure of listening to the songs we love. \\nBMI and ASCAP are make billions of dollars a year — they shouldn’t be able to manipulate pricing and force business owners to select music based on licensing prices. The time is now for the DOJ to stand firm with its previous decision and do what’s right for music consumers everywhere.'"}, "time": 1742563314.5583007}