{"duration": 0.07677888870239258, "input_args": {"text": "'The Neo-Liberal Globalist Wish List \\nHunter Wallace Occidental Dissent October 29, 2016 \\nI read all the #TruCon pundits. I even read the people like Damon Linker who write about the groupthink of #TruCon pundits : \\nâ\\x80\\x9cSome important segments of the party are quite happy with the way things were before Trump burst on the scene â\\x80\\x94 with the GOPâ\\x80\\x99s post-Reagan optimism, idealism, and conservative moralism; with the presumption that the country benefits when using military force to impose order around the globe; with the often unstated assumption that all Americans of every economic and cultural echelon automatically thrive when the nationâ\\x80\\x99s entrepreneurial class is given everything on its wish list (massive tax cuts along with open borders and markets). Plenty of people are perfectly content with this governing vision, including most conservative pundits, much of the partyâ\\x80\\x99s donor class, many senior officials and officeholders, most Mormons (including McMullin and his most passionate Utah supporters), many conservative Catholics, and some evangelical Protestants.â\\x80\\x9d \\nI liked that image. I hope he doesnâ\\x80\\x99t mind me borrowing it. \\nAnyway, Damon Linker makes a good point here that gets to the heart of the issue: the â\\x80\\x9cgoverning wingâ\\x80\\x9d of the Republican Party is used to getting its way, and #NeverTrumpism is their revenge on their â\\x80\\x9cbaseâ\\x80\\x9d (i.e., your votes belong to them) for defying its wishes and rejecting Bush, Rubio and Kasich in the primaries. \\nMario Loyola has a plan for reconciliation between #NeverTrump and Trump supporters: \\nâ\\x80\\x9cStill, the best outcome of this election, from the point of view of a traditional conservative Republican, is for Trump and the GOP to have a landslide victory and then for Trump to resign immediately in favor of Vice President Mike Pence, who is both eminently qualified to be president and a real conservative. â\\x80Ś \\nPledge to impeach. Should God elect to ignore my prayer, and should President Trump prove to be as bad a president as his detractors fear, then it is my duty and the duty of my fellow Republican members of Congress to impeach him. And I will apply that same rule to any president of my own party who fails to uphold the honor of the presidency. GOP members face a painful dilemma in Trump, but thereâ\\x80\\x99s another side to that coin. GOP members of Congress have a unique power that nobody else in the land possesses â\\x80\\x94 namely, the ability to pull the curtain down on a Trump presidency by impeaching him.â\\x80\\x9d \\nThe plan is to elect Trump. He will be given the chance to sign off on our neo-liberal globalist agenda â\\x80Ś or else, Paul Ryan and the #TruCons in the House will impeach him for â\\x80\\x9chigh crimesâ\\x80\\x9d against the establishment. Isnâ\\x80\\x99t it strange that Trump supporters donâ\\x80\\x99t seem to care much about the #NeverTrump downballot? \\nHe continues: \\nâ\\x80\\x9cTo do that, conservatives will need Trump supporters. Indeed, they will need to prevail not just among Trump supporters, but among Democrats as well. The international consensus for low regulation, low taxation, and free trade, enshrined in the Bonn Declaration of 1985, later elaborated as the â\\x80\\x9cWashington Consensus,â\\x80\\x9d must be restored to its former state of acceptance among both parties. \\nThe neo-liberal globalist consensus (Team America World Police, globalization, open borders, low-taxes, Wall Street deregulation) among both parties (read: the uniparty) has to be restored to â\\x80\\x9cits former state of acceptance.â\\x80\\x9d \\nKevin Williamson, who you might recall is famous for his declaration that White working class communities suffering from an opioid epidemic ought to die, is mounting a defense of the #TruCons in the GOP Congress : \\nâ\\x80\\x9cThe Republican party â\\x80\\x94 stupid and corrupt as it often is â\\x80\\x94 has in fact provided a number of dramatic victories for conservatives in recent years: the spread of right-to-work laws and school-choice programs, lower tax rates, trade liberalization, affirmations of the First and Second Amendments, restrictions on abortion, including a national ban on partial-birth abortion, etc. (See Charles C. W. Cooke, â\\x80\\x9cWhat Has Conservatism Ever Done for Us?â\\x80\\x9d) Consider the state-level work that has been done in Wisconsin, Michigan, Florida, Texas, and Oklahoma. These are not trivial victories â\\x80\\x94 these are the small things that in the end add up to big things. â\\x80Ś \\nThe Republican majority in Congress is like a hard and unpleasant job with long hours, but one that pays reasonably well: If you donâ\\x80\\x99t like it, try doing without it for a while and see how that works out for you.â\\x80\\x9d \\nYou will be sorry when we are gone! \\nWeâ\\x80\\x99ve conserved a low top marginal income tax rate and globalization. Weâ\\x80\\x99ve busted the unions, cut onerous regulations for hedge fund managers, kept the borders open to Third World immigration for half a century, and spread right-to-work laws. Weâ\\x80\\x99ve given strong rhetorical support to ending abortion and let the assault weapons ban expire when George W. Bush was president. Why arenâ\\x80\\x99t you rednecks satisfied? \\nThere was so much more for you we could have done with Rubio as president. We could have had Dow 38,000! We could have had World War III over the Donbass!'"}, "time": 1742563537.0684135}