{"duration": 0.09206581115722656, "input_args": {"text": "'After a Century, Planned Parenthood Needs to be Shut Down Written by John F. McManus Email \\nOn the 100th anniversary of Planned Parenthood , one of its greatest cheerleaders sent five separate messages to celebrate the significant milestone. Interrupting her election campaign, Hillary Clinton sent out several tweets that either praised or defended the organization that has slaughtered 59 million babies in the womb since 1973. \\nOne of those messages sent via her computer (a non-secured instrument this time!) stated as follows: “I’m proud to stand with Planned Parenthood. I’ll never stop fighting to protect the ability of every woman in this country to make her own health decisions.” She conveniently avoided the fact that half of the victims of abortion are females needing only time and nourishment to be able to reach womanhood in a few years. They won’t enjoy the protection she mentioned. Mrs. Clinton also equated terminating life in the womb with otherwise normal health decisions. Abortion surely doesn’t allow the victim a choice, and it surely isn’t good for his or her health. \\nStarted a century ago as the American Birth Control League, Planned Parenthood is the legacy of Margaret Sanger (1879-1966). A prominent eugenicist (the word comes from the Greek meaning “wellborn”), she sought to rid the nation of the “unfit” by which she initially meant Negroes, Hispanics, and Jews. Her goal would be achieved by forcing down the birth rate of the unwanted classes. One of her tactics included the use of deception. She told a financial supporter of her plan to recruit “colored minsters” to do her work. Explaining, she stated, “We do not want word to go out that we want to exterminate the Negro population, and the minister is the man who can straighten out the idea if it ever occurs....” (See Woman’s Body, Woman’s Right , a 1974 book by rabid pro-abortionist Linda Gordon.) \\nAs late as November 1939 (two months after Germany launched World War II and several years after its campaign against Jews had begun, Sanger’s Birth Control Review was still commending the Nazi campaign. Almost simultaneously, the Sanger campaign began to target Catholic immigrants to the United States, another group deemed “unfit.” \\nBeginning in 1970, Planned Parenthood started receiving federal grants, now totaling more than $500 million per year. The organization claims that none of the taxpayer dollars it receives are used to perform abortions. Even if that claim is accurate, the government funding it receives makes easier the use of other funding to kill babes in the womb. In 2015, some determined anti-abortion crusaders videotaped admissions by Planned Parenthood officials that they were selling the body parts of recently aborted babies. An uproar over that grisly practice led to a congressional attempt to defund the organization, a failed effort due to President Obama’s veto and the congressional inability to override it. Similar congressional moves to overturn the 1973 Roe v. Wade decision that opened the floodgates for abortion have also failed. \\nOver its history, besides being pro-Nazi, Planned Parenthood has shown itself to be anti-black, anti-Hispanic, anti-Catholic, and anti-Jewish. Yet within these groups of Americans are millions who support the Clinton candidacy. Meanwhile, the mass media that refuses to report the truth about Planned Parenthood and its Sanger-inspired efforts chooses to paint her opponent with unsavory labels, many of which are unfounded. \\nOne reason why the murder of innocent babes in the womb continues is that the practice has now involved millions of women and men. There is a wide lessening of disgust for a practice that, prior to 1973, was almost universally deemed abhorrent in America. This trend will only grow worse if the very prominent cheerleader for Planned Parenthood, Hillary Clinton, becomes America’s next president. \\n\\nJohn F. McManus is president emeritus of The John Birch Society . This column appeared originally at the insideJBS blog and is reprinted here with permission.  '"}, "time": 1742561949.4361463}