{"duration": 0.08350872993469238, "input_args": {"text": "\"Originally appeared at Chronicles \\nEdward Lozansky is president of the American University in Moscow. \\nJim Jatras is a former U.S. diplomat and foreign policy adviser to the Senate GOP leadership. He recently published a major study, “ How American Media Serves as a Transmission Belt for Wars of Choice .” \\nPerhaps one of the most used and abused political expressions in recent years has been that of “American exceptionalism.” Politicians and commentators routinely invoke it as high principle and accuse their opponents of insufficient devotion to it, or contrariwise blame it for all the ills of the world. \\nFor example, in 2013, Russian President Vladimir Putin ruffled many Americans’ feathers: \\n“It is extremely dangerous to encourage people to see themselves as exceptional, whatever the motivation. . . . We are all different, but when we ask for the Lord’s blessings, we must not forget that God created us equal.” \\nHillary Clinton weighed in on exceptionalism in an August speech before the American Legion, in which she also took a swipe at Donald Trump : \\nThe United States is an exceptional nation. . . . But, in fact, my opponent in this race has said very clearly that he thinks American exceptionalism is insulting to the rest of the world. In fact, when Vladimir Putin, of all people, criticized American exceptionalism, my opponent agreed with him, saying, and I quote, ‘if you’re in Russia, you don’t want to hear that America is exceptional.’ Well maybe you don’t want to hear it, but that doesn’t mean it’s not true. \\nIt needs to be asked, though: when people praise or criticize “American exceptionalism,” are they always talking about the same thing? \\nAmerica, like any country, has its own distinctive history, culture, and traditions. America’s unique founding principles—consent of the governed, due process, constitutionally limited division of powers, representative government—justly have been an inspiration to the world for over two centuries. Thomas Jefferson wrote of the “palpable truth, that the mass of mankind has not been born with saddles on their backs, nor a favored few booted and spurred, ready to ride them legitimately, by the grace of God.” \\nThis “exceptional” idea was new in human history. Any American worthy of the name justly takes pride in it. This is the genuine American exceptionalism of Washington, Jefferson, and Madison, lately championed by Reagan. The fact that we have strayed so far from it, both domestically and internationally, is shameful. \\nThe unique moral revolution to which the Founding Fathers pledged their lives, their fortunes, and their sacred honor has little connection to the bastard term (usually capitalized as “American Exceptionalism”) that describes post-Cold War U.S. global behavior, by which policymakers in Washington assert both an exclusive “leadership” privilege and unsupportable obligation to undertake open-ended international missions in the name of the “Free World” and the “international community.” This is the counterfeit “Exceptionalism” of a tiny clique of bipartisanapparatchiki—GOP “neoconservatives” and Democrat “liberal interventionists” and their mainstream media mouthpieces —who have little regard for our country’s oldest traditions or the security and welfare of the American people. \\nThis second kind of Exceptionalism means that the rules we demand of other countries don’t apply to us (so much for Jefferson’s appeal in the Declaration of Independence to “a decent respect to the opinions of mankind”). Its proponents justify “regime change” in Iraq, Libya, Syria, and Ukraine, maybe in Russia too . They have wasted trillions of Americans’ tax dollars in the process of making us less safe, not more. Now the Obama Administration is willing to risk confronting Moscow and sparking a new world war in a bid to save al-Qaeda in Aleppo. As Trump has noted: “ You're going to end up in World War Three over Syria if we listen to Hillary Clinton .” \\nIt is this debased and dangerous kind of Exceptionalism that Hillary represents. Closely related is her concept of America’s “indispensability” : \\n“We are the indispensable nation. People all over the world look to us and follow our lead. . . . When America fails to lead, we leave a vacuum that either causes chaos or other countries or networks rush in to fill the void.” \\nIt’s no coincidence she is preferred by self-regarded indispensable hacks of both parties who have been up to their elbows in every foreign mess since Reagan. Starting next year, they are eager to give us more of the same. \\nFor genuine patriots, the true, uniquely American exceptionalism of the Declaration of Independence and the U.S. Constitution is our precious inheritance. America’s true exceptionalism is the antithesis of what Hillary and her acolytes intend, as attested by John Quincy Adams : “Wherever the standard of freedom and independence has been or shall be unfurled, there will [America’s] heart, her benedictions and her prayers be. But she goes not abroad in search of monsters to destroy. She is the well-wisher to the freedom and independence of all. She is the champion and vindicator only of her own.” \\nIn scouring the world for monsters to destroy Hillary’s perversion of authentic American principles has more in common with Soviet universalism than the vision of the Founders. In pursuing “ benevolent global hegemony ” the supposed indispensables suggest that other countries and peoples are dispensable—or disposable. In the process, Americans’ freedoms have become disposable too. This is, in a word, un-American—a good old expression that needs to make a comeback. \\nGenuine American exceptionalism and the “America First” policies of Donald Trump don’t mean our withdrawal from the world. U.S. primacy in a multipolar system is something most countries, including Russia and China, would be prepared to accept, however grudgingly. But continuing down the road Hillary Clinton, Barack Obama, and George W. Bush have blazed for a quarter century promises us just more war, more enemies, and eventual catastrophe. It’s a mistake America cannot afford to make. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742628335.9359784}