{"duration": 0.14859795570373535, "input_args": {"text": "'ASKING for a raise is the type of conversation that can make even the most confident among us uncomfortable. Women, however, may have good reason to feel that way. Discrimination persists in the workplace and it isn’t necessarily intentional or overt, experts on gender and negotiation say. But it can emerge when women act in ways that aren’t considered sufficiently feminine, and when women advocate for themselves, these experts say, some people find it unseemly, if on a subconscious level. As a result, women need to take a more calibrated approach, whether in asking for a higher salary or a new position. Otherwise, they can risk being perceived as overly demanding and unlikable, experts say, and their requests can backfire. “We are asking women to juggle while they are on the tightrope,” said Linda C. Babcock, a professor at Carnegie Mellon University and founder of its gender equity program. “It’s totally unfair because we don’t require the same thing of men. But if women want to be successful in this domain, they need to pay attention to this. ” Research on gender and negotiation has largely focused on requests for a raise, but the same strategies can  —   and probably should  —   be applied to a broad range of requests, including negotiating for a new position or job title. “How women negotiate their career paths is arguably a more important determinant of lifetime earnings than negotiating a little extra money,” said Hannah Riley Bowles, a senior lecturer at Harvard’s Kennedy School of Government, who has conducted many studies on gender and negotiation. Some women may bridle  —   justifiably  —   at adjusting their behavior to conform to stereotypes. But the negotiation experts say that they think about these strategies pragmatically. “These stereotypes will hold us back, so we might as well use them to move forward,” added Joan C. Williams, a   of “What Works for Women at Work. ” Here are some strategies for approaching negotiations at work: Groundwork Asking for a raise shouldn’t be rushed or boiled down to one short conversation. To prepare, keep a record of every piece of positive feedback you receive over time, and catalog any objective metrics that help illustrate your contributions. This is easy to overlook when you’re busy. Be careful about how you present the information  —   in a performance review might be more effective instead of naked  . Women also benefit when other people highlight their accomplishments with the   experts said. That’s why it’s important for women to seek not only mentors, but also what some call sponsors, professionals who actively trumpet your work.   Women tend to negotiate less for themselves than men, when there aren’t clear standards on what they should be asking for, studies found. In fact, women worked longer and made fewer errors but paid themselves less than men did for similar tasks, according to another study. But that effect went away when women were given data on what others paid themselves. There are several ways to gather objective numbers supporting why a particular salary is merited. “The next time a recruiter calls you up, she is your new best friend, even if you don’t want to move,” said Ms. Williams, also founding director of the Center for WorkLife Law at the University of California, Hastings College of Law. Or seek one out. “Talk to her because she is the one who knows what you are worth on the open market. ” Women need to speak with men about salaries, too. If they network only with other women, experts said, they are more likely to come up with numbers that are systematically less. Specific Language When negotiating for higher pay, research has found that it is not enough for women to act in a way that conforms to stereotypes. Acting feminine enough  —   that is, showing they care about maintaining good relationships as well as the communal good over themselves, for instance  —   helps women in the likability department. And that’s important. But that doesn’t necessarily make the person in the position of power any more likely to grant a woman’s request. Women also need to legitimize their requests, or find ways to make them seem more appropriate, according to a study that Prof. Riley Bowles and Prof. Babcock published in 2012. That means saying something like, “My supervisor suggested that I to talk to you about raising my compensation. ” Women should also frame requests from the employer’s perspective. “The key thing is to turn it around and think about what it is legitimate to this person and what they value,” Professor Riley Bowles added. She refers to this as the “ ” strategy: You might be thinking about something from your perspective, but when you make the pitch, it should come out as “we. ” This, she says, is good advice for men, too. It just may be particularly important for women. Negotiate in Person Negotiation by email can backfire. “It comes across very cold, very hard and very direct, so all of the things that women tend to do in conversation that soften their approach are impossible to do in email,” Professor Babcock said. Email also requires waiting for a response. “If you are having a conversation, you can judge more accurately about how your request is going over,” she added, “and you can adjust your request as you see the reaction. ” That’s what may have caused one woman to have a recent job offer rescinded, a situation that recently made the rounds in the blogosphere and media. The candidate, known only as W. was offered a position as a philosophy professor at Nazareth College in Rochester. In response, she emailed the job search committee and listed    items that would “make my decision easier. ” W. also said in the email that she knew some requests would be easier to grant than others, indicating that she knew she wouldn’t get everything. Nazareth says it declines comment on personnel issues. In a blog post, W. said she figured asking couldn’t hurt. But it apparently did: In response, the college reportedly emailed her back and said it had determined that she was more interested in teaching at a research university. “It is impossible to say in any particular case whether” gender played a role, Professor Babcock said. “The research could not be more clear in that we tolerate more aggressive or assertive behavior by men more than women. ” Outside Offers Receiving an offer for a more lucrative position may seem like a prime opportunity to negotiate. But this tactic may harm women because it can be perceived as a threat, experts said, “Every negotiation textbook says to use an outside offer, except for mine,” said Professor Babcock, who with Professor Riley Bowles, studied the effects of using outside offers in an experimental setting. “That is seen as aggressive when used by a woman. ” If you do want to use this strategy, she said you have to be careful about how you craft your language. Approach the situation as a dialogue instead of a negotiation. She said women might say something like, “Hey, there is something I really want to talk about. I want to stay. Is there a way to make this happen for me?”   Keeping all this in mind isn’t easy, which is why experts suggest   the situation with a friend or partner. Practice how you might present yourself to make sure your request appears appropriate and persuasive, while also demonstrating that you are concerned about communal goals. “When you are personally inflamed or nervous,   helps to get into someone else’s perspective,” Professor Riley Bowles said. “It takes a lot of practice. ”'"}, "time": 1742563163.9943244}