{"duration": 0.0473790168762207, "input_args": {"text": "'One “brutally honest” Oscar voter says   nominee Meryl Streep played her role in this year’s Florence Foster Jenkins “like a clown”  —   and believes the actress was only awarded a nomination in return for delivering her infamous   Trump speech at last month’s Golden Globes. [“I thought Meryl [Streep in Florence Foster Jenkins] played it like a clown  —   she’s cute and adorable, but this woman didn’t matter to me in the end  —   but people are gaga over Meryl, and I think she solidified her nomination when she gave that speech at the Golden Globes,” the anonymous Oscar voter told the Hollywood Reporter.   The Academy member  —   a female member of the acting branch  —   added: “I don’t think she would have gotten nominated without it. ” In January, Streep used her Cecil B. DeMille Lifetime Achievement Award acceptance speech at the Golden Globes to rebuke President Trump for what she called his “disrespect” and his “violence” the actress also challenged a “principled press” to stand up to the president, and urged Hollywood to support the Committee to Protect Journalists. The    ’s Globes speech was lauded by the film industry and the press and set the tone for other awards shows to feature     screeds. Later that month, actors including Ashton Kutcher and Julia   trashed Trump and his executive order on immigration from the podium at the Screen Actors Guild Awards. In February, a number of artists at the 59th annual Grammy Awards used their performances to make political statements, including Busta Rhymes, A Tribe Called Quest and Katy Perry. The Hollywood Reporter solicits opinions from anonymous Oscar voters every year in the week before the ceremony. While the responses of one Academy member are hardly an indication of how the entirety of the 6, 000+ members will ultimately vote, the   “brutally honest” ballots usually offer a refreshing perspective on the process. In addition to her comments on Streep, this year’s anonymous voter said La La Land star Emma Stone’s performance wasn’t “as wonderful” as everyone is saying, the   thriller Arrival “just sucked” and the Denzel   Davis starring Fences underwhelmed because “they just filmed the play. ” See the rest of the anonymous voter’s “brutally honest” ballot here. The Academy Awards air Sunday night on ABC.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561709.1190155}