{"duration": 0.016133785247802734, "input_args": {"text": "'Apparently Obama wasn’t as worried about placing women in senior-level positions but Froman decided to offer up some suggestions anyway. “While you did not ask for this, I prepared and attached a similar document on women.” \\nFroman even went ahead and “scoped out” which people should be appointed to which cabinet positions. “At the risk of being presumptuous, I also scoped out how the Cabinet-level appointments might be put together, probability-weighting the likelihood of appointing a diverse candidate for each position (given one view of the short list) and coming up with a straw man distribution.” \\nAs New Republic points out, the Froman appointments ended up being almost entirely right. The cabinet list ended up being almost entirely on the money. It correctly identified Eric Holder for the Justice Department, Janet Napolitano for Homeland Security, Robert Gates for Defense, Rahm Emanuel for chief of staff, Peter Orszag for the Office of Management and Budget, Arne Duncan for Education, Eric Shinseki for Veterans Affairs, Kathleen Sebelius for Health and Human Services, Melody Barnes for the Domestic Policy Council, and more. For the Treasury, three possibilities were on the list: Robert Rubin, Larry Summers, and Timothy Geithner. This was October 6. The election was November 4. And yet Froman, an executive at Citigroup, which would ultimately become the recipient of the largest bailout from the federal government during the financial crisis, had mapped out virtually the entire Obama cabinet, a month before votes were counted. And according to the Froman/Podesta emails, lists were floating around even before that. Many already suspected that Froman, a longtime Obama consigliere, did the key economic policy hiring while part of the transition team. We didn’t know he had so much influence that he could lock in key staff that early, without fanfare, while everyone was busy trying to get Obama elected. The WikiLeaks emails show even earlier planning; by September the transition was getting pre-clearance to assist nominees with financial disclosure forms. \\nSo if this history is any guide then the real power within a future Clinton administration is being formed right now. In fact, another email from January 2015 reveals that Elizabeth Warren was already “intently focused on personnel issues” almost two full years ago as evidenced by the following recap of a conversation that the Hillary campaign had with her Chief of Staff, Dan Geldon. He was intently focused on personnel issues, laid out a detailed case against the Bob Rubin school of Democratic policy makers, was very critical of the Obama administration’s choices, and explained at length the opposition to Antonio Weiss. We then carefully went through a list of people they do like, which EW sent over to HRC earlier. We spent less time on specific policies, because he seemed less interested in that. He spoke repeatedly about the need to have in place people with ambition and urgency who recognize how much the middle class is hurting and are willing to challenge the financial industry. \\nTo the extent there are any purists left, this should clear up any illusion of who controls the political powers that be.'"}, "time": 1742628512.224783}