{"duration": 0.07732582092285156, "input_args": {"text": "'Alan Thicke, the Canadian actor, singer and songwriter best remembered for his portrayal of the ultimate suburban middlebrow dispenser of parental advice on the sitcom “Growing Pains,” died on Tuesday in Burbank, Calif. He was 69. Mr. Thicke was playing hockey with his    son, Carter, when he had a heart attack, his   Gloria Loring said. She added, “He died the way any good Canadian should  —   playing hockey with his son. ” Mr. Thicke projected a genial warmth across all his television work, most memorably on “Growing Pains,” which ran from 1985 to 1992 on ABC. His character, Dr. Jason Seaver, a psychiatrist, was a classic 1980s formulation of the reassuring father who solved everyone’s problems with a warm homily by the end of each   episode. The cast also included Joanna Kerns as his wife and Kirk Cameron as his oldest child. The role earned Mr. Thicke the nickname America’s Dad. His character was ranked No. 37 on TV Guide’s list of the “50 Greatest TV Dads of All Time. ” Mr. Thicke’s talents also included songwriting. He wrote the theme songs for numerous game shows, including “The Joker’s Wild,” “Celebrity Sweepstakes” and the original “Wheel of Fortune,” and he wrote the themes for the sitcoms “Diff’rent Strokes” and “The Facts of Life” with Al Burton and Ms. Loring. The “Diff’rent Strokes” theme is a masterpiece of the genre, setting up in less than a minute the story of a white multimillionaire who took in (and later adopted) two black children. It begins: His career also included stints as a   host, both real and fictional. His syndicated   show “Thicke of the Night” was seen in the   season, and he played the   host Rich Ginger on the soap opera “The Bold and the Beautiful. ” He also played himself on several episodes of the sitcom “How I Met Your Mother. ” He was a writer on the satirical talk show “Fernwood  ” (1977) a spinoff of “Mary Hartman, Mary Hartman” that starred Martin Mull and Fred Willard, and was nominated for a Primetime Emmy Award for his writing on a later version of the show, “America  . ” He was also nominated for a Golden Globe Award in 1988 for best performance by an actor in a comedy or musical series for “Growing Pains,” and for a Daytime Emmy in 1998 for his work as host of the game show “Pictionary. ” Mr. Thicke   called himself “the affordable Shatner,” a reference to his appearances at public events that were said to have been turned down by his fellow Canadian actor William Shatner, of “Star Trek” fame. He was a host of the annual Disney Christmas Parade with Joan Lunden in the 1980s, and of the Miss Universe pageant and the Canadian Comedy Awards. Mr. Thicke was born Alan Willis Jeffrey on March 1, 1947, in Kirkland Lake, Ontario. “We started in northern Ontario in a small town where I didn’t even see a television set until I was 7 years old,” Mr. Thicke said at the unveiling of his star on Canada’s Walk of Fame in 2013, the website ET Canada reported. “So when you take that moment and   to what I’m experiencing today with my family here and feeling embraced by my country  —   that’s unique. ” Mr. Thicke was the author of two books, “How to Raise Kids Who Won’t Hate You” and “How Men Have Babies: The Pregnant Father’s Survival Guide. ” In addition to his son Carter, Mr. Thicke is survived by two other sons, Robin, the singer and songwriter, and Brennan and his wife, Tanya Callau. Two previous marriages ended in divorce. Hours before his death, Mr. Thicke commented on Twitter about “Fuller House,” the Netflix   to the television series “Full House,” on which he had recently appeared as a guest star. “Season 2 Fuller House looking good,” he wrote. “I even like the ones I’m not in!”'"}, "time": 1742562523.3004677}