{"duration": 0.0778355598449707, "input_args": {"text": "'\\n21st Century Wire says… \\nThis should be the biggest revelation yet from WikiLeaks already epic email trove. Will the US media cover this story? \\nLast night, in an RT Exclusive interview conducted by award-winning filmmaker John Pilger, WikiLeaks editor and founder Julian Assange described what he believes is “the most significant email in the whole collection.” \\nWikiLeaks reveals an early 2014 email where the outgoing Secretary of State Hillary Clinton was urging John Podesta , then advisor to President Barack Obama, to “bring pressure” on Gulf states Saudi Arabia and Qatar, “which are providing clandestine financial and logistic support to ISIL [Islamic State, IS, ISIS] and other radical Sunni groups.” \\nThis constitutes proof that the Clinton Foundation knowingly accepting millions of dollars in ‘charitable’ donations from the same Gulf states which both Secretary Clinton and President Obama knew were funding ISIS, Al Nusra Front (al Qaeda in Syria) and known takfiri terrorist fighting organizations. \\nIn addition, the Clinton’s Foundation took money from a number of other gulf monarchies: \\n(Infographic: Conservative Post ) \\nThis latest news validates what 21WIRE has been saying since the ‘ISIS crisis’ began in June 2014. \\nAccording to FOX News , FBI sources have said that ‘indictments are likely’ for the Clinton Foundation investigation. One only wonders how this latest Assange revelation will factor into the wider investigation – as it goes right to the heart of the national security and foreign policy – two things which Clinton trades heavily on in her campaigning. \\nAssange went on to explain the deep ramifications of this latest criminal allegation against Clinton and her family foundation: \\n“All serious analysts know, and even the US government has agreed, that some Saudi figures have been supporting ISIS and funding ISIS, but the dodge has always been that it is some “rogue” princes using their oil money to do whatever they like, but actually the government disapproves. But that email says that it is the government of Saudi Arabia, and the government of Qatar that have been funding ISIS.” \\nDuring their 25-minute interview filmed at the Ecuadorian Embassy in London, Assange and Pilger discussed the obvious conflict of interest between Clinton as Secretary of State, the Clinton Foundation and Gulf monarchies who financed them. The following is an excerpt from the interview transcript: \\nJohn Pilger: The Saudis, the Qataris, the Moroccans, the Bahrainis, particularly the first two, are giving all this money to the Clinton Foundation, while Hillary Clinton is secretary of state, and the State Department is approving massive arms sales, particularly Saudi Arabia. \\nJulian Assange: Under Hillary Clinton – and the Clinton emails reveal a significant discussion of it – the biggest-ever arms deal in the world was made with Saudi Arabia: more than $80 billion. During her tenure, the total arms exports from the US doubled in dollar value. \\nJP: Of course, the consequence of that is that this notorious jihadist group, called ISIL or ISIS, is created largely with money from people who are giving money to the Clinton Foundation? \\nJA: Yes. \\nWatch a brief preview of the interview here: \\nThe interview will air in full on RT International this Saturday Nov 5th. \\nREAD MORE CLINTON NEWS AT: 21st Century Wire Clinton Files \\nSUPPORT 21WIRE – SUBSCRIBE & BECOME A MEMBER @21WIRE.TV '"}, "time": 1742562291.3164868}