{"duration": 0.05653023719787598, "input_args": {"text": "'California becomes second state to raise legal smoking age to 21 \\n  Ethan A. Huff, staff writer Tags: smoking age , California , prohibition (NaturalNews) If you\\'re between the ages of 18 and 21, live in California and are a smoker, expect to be denied your favorite pack at the convenience store. Beginning in June, the new minimum age for officially jumped from 18 to 21, a prohibition move that lawmakers claim will curb the number of smokers in the Golden State, and ultimately help save lives.Joining both Hawaii and the city of Needham in Massachusetts, California is the third locale in the U.S. to raise the legal smoking age to 21. Officials there hope that, like in these other places, age restrictions on smoking will help reduce the number of smokers and minimize the number of individuals who develop smoking-related health conditions like emphysema and lung cancer.Citing statistics from Needham that show a nearly 50 percent reduction in the number of smokers in the five-year period following the change that was made in 2005, April Roeseler, head of the California public health department\\'s Tobacco Control Program, told the Los Angeles Times that she expects similar reductions in her state.In Needham, the number of high schoolers smoking cigarettes fell by nearly half, according to a study published last year. And adult smoking rates in the town also fell from about 18.1 percent to a mere 8 percent – statistics that experts say can be replicated all across the country.\"If we can push that age up where fewer and fewer people start smoking as a teen, it\\'s likely that we will start to have some tobacco-free generations ,\" the Times quotes her as saying. Prohibition never works; people who want \\'contraband\\' will find a way At this point, though, very little, if any, evidence exists to show that the rule change is working as intended. University of California, San Francisco (UCSF) professor Dr. Stanton Glantz, for instance, admitted to the Times that the policy still needs time to \"settle in.\" The California Smokers\\' Helpline also says it hasn\\'t noticed any increases in the number of callers in the prohibited age range trying to quit, which suggests that not much has changed.There\\'s also the contraband factor – older kids still buying cigarettes for younger kids, for example, including those younger than the former threshold age of 18. Illegal buying has always been an issue, law or no law, which is something that the government never really seems to understand when it comes to issues of prohibition .\"They\\'re hanging out and partying together, so they\\'ll just get someone else to buy,\" says Leonard Charles, the owner of a liquor store in Oakland. Charles says he strictly enforces the new cigarette age law, but believes that if somebody wants cigarettes, he or she is going to find a way, regardless of the law.In the internet age, cigarettes are also freely available to anybody with a WiFi connection. People can order cigarettes off the web and have them delivered right to their doorstep, which means that state-level restrictions are basically moot.And what about e-cigarettes? The State of California classifies e-cigs as a \"tobacco product\" just like cigarettes, and they are subject to the same laws. However, everybody has them these days, they\\'re very discreet, and they don\\'t produce that typical tobacco smell that\\'s so hard to get out of a room , so trying to enforce restrictions against their use is next to impossible, say experts familiar with the reality of how easy it is to obtain tobacco, regardless of what the law says.When asked how the new law will realistically work in light of the fact that smoking laws often aren\\'t effective, Glantz responded, \"The short answer is I don\\'t know.\" Sources for this article include:'"}, "time": 1742562090.3190854}