{"duration": 0.16080808639526367, "input_args": {"text": "'WE NEED A REVOLUTION: Overcoming Fascism with a Movement of Love Sabine Lichtenfels negotiating with a general, “Grace Pilgrimage” in Colombia, 2008 By Martin Winiecki / terranovavoice.tamera.org \\nNovember 9th, the day after the U.S. election, will be a peculiar anniversary. On this day in 1938 more than 1000 synagogues and 7000 Jewish businesses were burning all over Germany, set ablaze by the Nazis. Going down in history as “Kristallnacht” or the “Night of Broken Glass,” this dreadful event marked the beginning of the Holocaust, resulting in six million Jews killed in less than seven years. \\nHistory reverberates in an eerie manner these days. In the United States, the anger and hatred that has long been boiling in millions of people has now found its political outlet. \\nNo matter whether or not he will be elected president, Trump’s success has been unprecedented and overwhelming. His simple message resonates in large parts of the American society, in people who have long felt betrayed, abused and disenfranchised by an alienated “establishment.” Trump wins against all reasoning of decency because he recklessly breaks what his supporters most despise: “political correctness.” He understands how to play the emotional piano of the masses; he’s the ultimate caricature of a society teeming with universal corruption and sexual perversion. \\nThe rise of fascism always seems to hit the world by surprise. Yet what we are now witnessing has not begun with Trump, just as German fascism had not begun with Hitler. Wherever people are prohibited to express their basic emotional and energetic drives, wherever they grow up and live in conditions of fear, mistrust and violence, the danger of fascism looms. Suppressed life energy dams up and turns into constant aggression. When the container of the bourgeois order crumbles, when people lose their jobs, voices and prospects – as it has gradually happened in this era of expanding corporate dominance – and the state no longer succeeds in controlling violence, the monstrous force of bottled-up emotions breaks free. Once they have a strong paternal authority telling them whom to blame, declaring them to be a collective that will now exact revenge, people get together in wild exaltation. Finally they have a channel and they develop a threatening force.i We must not despise or ridicule these people, but understand how they have gotten into the desperate state they are in. Thereby fascism is no longer a thing of “the others”; it’s something that concerns us all. The psychoanalyst Dieter Duhm writes, “Latent fascism is present everywhere; it is the cancer of humanity… It develops in the subconscious of our human relationships. In the emotional substrata of a misguided civilization lie the horrible powers that led to Nazi Germany and which currently lead to very similar atrocities in many countries on Earth.”ii \\nOn the eve of the election, armed militias across the United States are preparing themselves to, as they say, “take back their country” in case their opponent will “rig” the elections. People call for boycotting companies who employ refugees from Muslim countries and threaten the people running them. Attacks on people of color, other religions and political ideologies have steeply increased in the time leading up to the election. People no longer see any prospect for the future. They no longer have anything in this world they can believe in. Unable of loving, retaliation is what gives them strength. Similar explosions of hatred are occurring all over the world. When we witness what political prisoners in Turkey (neglected by our Western leaders) or the civilians trapped inside the besieged cities of Aleppo and Mosul are now facing, we know that this global culture has come to a turning point. \\nYet the aggression now explicitly exploding among white lower-class Americans is only a miniature version of the ruthless warfare systematically orchestrated by this country’s elites for many decades. War is an essential component of our entire economic system – one without which this system would instantaneously collapse. While “decent” Americans show themselves outraged about Trump, their candidate for President has her blueprints ready for expanding military interventionism around the world. Democratic President Obama has already bombed seven Islamic countries and ordered the drone assassination of thousands of innocent children and women abroad, but he is considered “moderate” in terms of warfare compared to Hillary Clinton. In the current escalation with Russia and China there no longer seems to be any limit. We mustn’t be surprised by what is now erupting inside America. Similar to how it was in the late Roman Empire, the American Empire is entering a phase of self-destruction as it is being eaten up by the very violence it has used to establish itself in the first place. And with it goes the entire capitalist world order this country has essentially shaped. \\nTrump is nothing other than a mirror for the world to look into, a call to awaken before it’s too late. It is silly to blame the mirror for what you see in it. Trump is not the enemy; he is merely the symptom of a culture worshipping power, violence and greed. If you are afraid of Trump, what you are actually afraid of is this culture. Stopping fascism isn’t achieved through ideological battles; it is rather a matter of building a new and humane culture. This is nothing short of a global revolution. A revolution from bottom up, on all levels of society. \\nWe need a revolution that establishes new foundations for human life on Earth, new foundations for our coexistence with each other and nature. A revolution that allows us to remember the sacredness of life and of all living beings. We need a revolution for solidarity and trust; “a revolution,” as Dieter Duhm says, “whose victory will create no losers because it will achieve a state that benefits all.”iii \\nOn November 9th 2005, Sabine Lichtenfels initiated the “Global Grace Day” at the separation wall in Israel-Palestine. At the time, the peace activist and co-founder of the Tamera peace research center in Portugal led a group of 50 Israelis, Palestinians and internationals on a “Grace Pilgrimage” through the Middle East – a form of political activism rooted in reclaiming the depth of our humaneness. The activists committed themselves to overcoming hatred and divide by addressing the human being trapped behind the masks of world views and traumatization.iv This allowed for “miracles” to happen – encounters between former enemies invoking the vision of a reunited land. No matter whether it is a dispossessed farmer, a soldier, a fanatic resistance fighter or ourselves, whether it is a fascist, a banker, a liberal or an anarchist – there is something identical in all of humanity running far deeper than our ideological denominations: a universal longing to be accepted and seen, a longing to love and be loved, to belong to a community and to express oneself in trust and freedom; and there is a similarly universal trauma stemming from the suppression of these essential human needs. What we need is a revolution that acknowledges and follows human longing and establishes societal conditions where they can finally be met. \\nThis new revolution will not be achieved by shifting political power from one party to another, but by establishing forms of coexistence which allow the human being to liberate himself from all disguises and reconnect in trust. Every fascist will transform into a loving person, every terrorist into a caretaker for life, if he or she can find home in a community that allows closed hearts to open again. This is not a matter of therapy, but of the social, sexual, ethical   we live in. Building a movement based on communities of trust would not only be a genuine alternative to the fascist threat emerging everywhere; it may also set the foundations for the new global culture we as humanity need in order to have a future worth living on this planet. November 9th is a day of both despair and hope. In 1989 it was the day the Berlin Wall was opened. This year it can be a day for opening the wall of despair—exercised by people who find their determination to collaborate for a world of solidarity and trust. \\nWorks cited'"}, "time": 1742561784.083545}