{"duration": 1.007758617401123, "input_args": {"text": "'Rise of the Divine Human Through a deceptive Interdimensional Intervention, Humanity has been disconnected from the Source, a... Print Email http://humansarefree.com/2016/11/rise-of-divine-human.html Through a deceptive Interdimensional Intervention, Humanity has been disconnected from the Source, and downgraded, that he may be enslaved within the matrix of society. But now the divine light is shining in his heart again, the human soul is healing and through the activation of Kundalini , reconnecting fully with the Source. We\\'re channeling that light through our being and out into the world which is beginning to break down the old fear based reality. It\\'s time for humanity to get off his knees and rise up; to peel off this limiting intervention by initiating the divine being within.How does that work? How do we resurrect those divine gifts that are our birth right? The Seven Bodily Vehicles of Expression We are multi-dimensional beings stretching into the highest levels of consciousness. The human soul flows downwards through ever decreasing vibrational plains of existence like a stream cascading down the mountain from the Source. The stream of our soul interacts with the dimensions at various consciousness exchange points (known as chakras) where \"Unity Consciousness\" as the soul flows into \"Separation Consciousness\" as the bodily vehicles. The overriding purpose is to initiate divine acts of creativity — \"Right Action\" — by which to experience who we really are. In my observation, here\\'s how that flow is supposed to happen. By bringing conscious awareness to this information, can direct you - through internal awareness - how to reactivate your divine human... 7. Spirit-Light-Body ( merkaba ): the spirit-light-body was designed to receive soul consciousness through the crown chakra to align our being with the right dimensional activity inline with our higher purpose. Through the spirit-light-body, the soul has the capacity to act through multiple planes of consciousness simultaneously. It interconnects us with all other sentient life and is able to harmonise with the co-creative intent of other souls within our sphere of influence. Our divine purpose could be channeling in the harmonistic light of the Fifth Dimensional Realm to which we are ascending; it could be counteracting Opposing Consciousness in the Fourth Dimensional Realm to prevent distortional interference; alternatively it could be bringing absolute presence into the Third Dimension to fulfill creative activity. Thus the spirit-light-body shines the light of our soul interdimensionally. 6. Celestial Body: the celestial body harnesses and stores reflections of our soul through the countless lifetimes we\\'ve experienced. It\\'s purpose is to help us align with our true aspects of beingness. The downward shining light of the soul is next received into the third eye chakra, which ‘looks’ into the outer world comparing what it sees to the reflections of the soul in the celestial body. When the soul notices its own brilliance, it helps us align with and unfold those aspects of beingness that are most becoming of us; we settle into our groove so to speak. It is that feeling of complete self-belief, self-confidence, self-acceptance and contentment. When we can notice ourselves manifested in the outer world through our own authentic inner reflection, that is when we are truly living. We are frequently reduced to tears at the seemingly simplest of things because we are fulfilling our divine purpose. 5. Higher Mind: from authentic being arises authentic creation. The purpose of higher mind is to harmonise with the divine flow of synchronicity and initiate \"Right Action\" aligned with the universe. Through the power of the celestial body, we have noticed how to be within the external world and now is the time to experience this through creative action. At this stage, the creative impulse is quite abstract and undefined; the purpose is more about creative intent, and co-creating with other sentient life, rather than an actual creation itself. The soul now acts through higher mind, gathering together ‘elementals of consciousness’ into a directional flow of Right Action, like swirling clouds in the heavens. 4. Causal Body: the causal body is where our \"karma\" is held. It is the cause of our incarnation, it sets the agenda for our learning experience based on the attachments and creative experiences we need to evolve through. As the soul shines its beams of creative light down through the higher vehicles, our karma casts shadows of attachment through the lower bodies and into our outer experience. The causal body (also known as the energy body) now attracts and manifests exactly the right conditions to unveil the learning experiences required for our evolution. We are invited to confront and dissolve the obscuring clouds of karma by fulfillment of non-judgmental Right Action. We perceive this directing influence as a pull through the Heart Center - \"this is the way to go now\". 3. Lower Mind: lower mind is designed to receive, interpret and process higher channeled knowing through our clairvoyant, clairaudient and clairsentient (psychic) skills. So now we know what to do, the question is how to do it? If our authentic, creative action does not get side-tracked, the gathering energies are next passed into our subconscious or \"lower mind\". Lower mind then helps us to ‘connect the dots’ within the co-creative weave. Through the clairvoyant, clairaudient and clairsentient skills of lower mind, we notice rhythms and patterns of synchronicity in our “consciousness landscape” and have clear visions of the ‘garment’ to be created. As Right Action clicks into place moment by moment, it becomes abundantly clear what we are being invited to do and how to do it. 2. Emotional Body: the emotional body builds energy, passion and conviction around our behaviours to bring our creative Right Action into fruition. The creative process has now gathered together the right fabric for our creation, but it now has to be woven into form. The soul now utilizes the emotional body to garner more consciousness \\'elementals\\' and weaves emotion around the creative act. It provides a multi-coloured palette of experience that brings the garment to life. It makes the illusionary reality feel very real, yielding meaning and sense of purpose to life. However, once the creative action has come to fruition, the weave of the garment is meant to quickly unwind again, so that something else may be created. It is not a part of the human design that we hang onto emotions and build identities around them as is so often the case. 1. Physical Body: the physical body provides the ultimate vehicle to bring the creative, downward flowing process into full expression; it provides the experience of separation - of one thing relative to another. Finally, the soul’s gathering weave of elementals takes form around our ultimate vehicle of creative expression - the physical body. As the master weaver, our brain reads the pattern that has been crafted through our higher bodily vehicles and then orchestrates a magical symphony of activity throughout our billions of material cells. The physical body finally brings life to the creative action experienced in the myriad of human, physical possibility. The physical body is a multifaceted mirror of higher creative intent. It is the jewel in the crown; when functioning as designed, it makes the illusion of reality real. Why is it then that most people don\\'t experience natural human beingness in this way? The Matrix — a system of control We live in a system of control. Our lower minds, emotional and physical bodies are over-stimulated with constant dis-harmonious distraction. Corporate marketeers, governments and the powerful, build unnatural life-styles propagated constantly through TV, newspapers, radio and other media. The surrounding energy field is bombarded with electromagnetic interference through mobile phones, satellite, microwave and WiFi. Our food is purposefully infused with addictive substances; processed sugar, caffeine, artificial colourings, pesticides, hormones and GMO . Our water is contaminated with nitrates from the industrial foodchain and so-called \\'medicinal\\' drugs that end up being constantly recirculated in our water system. It would seem our society has been perfectly configured to desensitise and condition souls to conform to lower patterns of behavior. The average home has constant, residual electric fields due to over-use of electronic gadgetry. Most houses are awash with toxic chemicals used to clean and disinfect which in actual fact damages and lowers our energetic sensitivity. The same can be said for the unnatural polyesters and other oil based compounds used to make our clothes. The overall effect if to create addictive, conditioned behaviours in the lower mind and physical body which then trap, fragment and dissipate the flow of the soul into continual, repetitive \\'eddy currents\\'. So the downward flowing soul is truncated at the solar plexus - our lower mind - and just like software on a computer, neural webs of behaviour form in the brain locking the soul into a \\' false self \\' persona. This false self then creates a lower based life-style which can be readily controlled by the I ntervention Agenda . So perfect is this system of control, many awakening people are left with the inescapable conclusion that it was designed and perpetuated that way to enslave people. So how do we liberate ourselves and return to authenticity once more? Our Journey of Ascension After centuries of incarnation and losing ourselves in this artificial drama, we\\'re being gifted an opportunity. A powerful wave of higher consciousness is beginning to activate within people\\'s hearts. This \"Christ Consciousness\" as some call it (although not of a religious nature), has been dispatched to liberate those who are ready to step out of the maze. This energy works by sounding a note - a vibration which resonates with and therefore amplifies the sound of our soul that it may be heard once more above the outer noise of society. The Christ Consciousness helps reconnect with the unity of all life and the cosmic library of all knowing. It helps reactivate the natural flow within. So what can we do in our day-to-day lives to facilitate the maximum inflow of this evolutionary consciousness? How may we provide the most fertile inner ground for the seeds to germinate and grow? Our book \" Five Gateways \" has plenty of insight, guidance and tools that awakening souls can benefit from. Here below are seven recommendations from the book: 1. Surrender: be absolutely clear that the ONLY game going on in the universe is self-realisation and that we might as well finally surrender and take an active part in that game rather than trying to conveniently ignore it while it plays with us! So accept that ALL events, happenings and circumstances have but one purpose...to discover our absolute completeness - our \"absoluteness\" - beyond all circumstances. Realise the aim of the game is to be completely free inside WHATEVER happens. 2. Become the \"Observer\": the next step is to become the Observer of ourselves in all activities, events and circumstances. We notice where we lose our temper; where we become tight inside because of other people\\'s behaviour; where we might blame another for the reality we are creating ourselves; where our addictions to something in particular cause us to act in predictable ways. When we notice this, firstly it is important just to watch it, accept responsibility for it, but not judge ourselves. In this way, we are already beginning to break free. It\\'s also important to contemplate and utilise techniques for regaining the place of the Observer when we lose it, which inevitably happens in the beginning. It could be a deep breathing exercise for example, a visualisation meditation, or a mantra of some kind. Some people find it of particular benefit to put up strategically placed \\'post-it\\' notes around the house; \"let go\" for instance. 3. Open the heart: next we need to open the heart further by attuning to those experiences that generate the sublime taste of divine oneness; the feelings such as lightness, expansiveness, timelessness and infinite peace. So the key is to follow those experiences that give us joy as much as possible - \"what makes our Hearts sing\" - until we are tuning in consistently throughout the day. Whilst we are in the experience, it is still paramount that we\\'re observing ourselves in it. So it could be a few moments of deep breathing at our desk, walking in the lunch break admiring natural beauty or doing the gardening after work; whatever \\'crumbles our cookie\\', the key is to be watching ourselves in our joy. 4. Follow the inner pull: as the heart opens, we begin to notice the natural synchronistic order of things and an inner pull to \"Right Action\". Sometimes this pull can be felt as an energy through the heart chakra, sometimes it is a simple inner knowing \"this is what to do now\". In which case it will benefit us to always respond to that pull. Where does the pull lead? It will guide us to events, circumstances and experiences that provide an opportunity to express a \"divine gift of beingness\" and to expose conditioned behaviour patterns formed from an attachment to a desired outcome. These are \"distortions\" of authentic beingness, often created by society and causing us to get tight, worried, angry or frustrated. 5. Deal with distortions and addictive behaviour: the key to dealing with distortions is to realise each conceals a divine gift of beingness and to ultimately unveil that instead. So for example someone might smoke because it gives them the feeling of relaxed completeness; we might drink because it makes us feel more sociable and confident; we might comfort eat because it gives us the feeling of contentment. Alternatively we might get worried, stressed or tight around particular issues because we think we need a particular outcome. The key to overcoming such conditioning is to go within, breathe deeply, settle into the pregnant pause before the moment is born, find our sense of inner completeness and then make space for an authentic act of beingness to arise naturally. This is by no means an easy thing to do, but the more we practice it, the more we\\'ll realise every moment offers a black and white choice: give in to conditioning or surrender into the soul. In this way, we become the masters of our own destiny. 6. Raise our energetic vibration: this can be achieved by regulating the denseness of vibrations we bring into the body thereby limiting the stimuli that raise our internal metabolic rate. So for example, if we eat dense, processed foods polluted with toxins then the body has to work harder to process them and the extra effort swallows up consciousness. Or if we pollute our minds with too much clutter, or the negativity caused by the judgmentalism frequently expressed through the media, then we tend to tighten inside. Internal tightness is also heightened by too much computer time, over use of electrical gadgets and chemical toxins used in household cleaning materials. The key is to organise our immediate living environment to raise our energetic vibration. 7. Conduct regular spiritual practice: we live in a world that de-sensitises us and it is therefore of paramount importance that we redress the balance by conducting regular spiritual practice such as daily meditation. Traditionally meditation is considered as sitting quietly in stillness, but it could also happen during movement or breathing. What is essential, is that we begin to open, cleanse and harmonise the chakra system . This infuses the light of the soul through our being, thus reactivating the Seven Bodily Vehicles of Expression. Also such practice liberates powerful endorphins into the body which counteract the intervention energy. They redress the internal balance helping us find greater harmony and peace that we may reactivate the divine, downward creative flow. Read: 13 Chakras — Your Next Spiritual Level The \"Resurrection\" When we\\'re truly connecting to the soul and experiencing it through the Seven Bodily Vehicles, it feels like coming home. Whatever is happening in the external drama, we feel like we\\'re \\'in the groove\\'. We sense our at-one-ment with the whole of life. Sitting on a park bench watching the light flickering through the leaves suddenly takes on a much deeper meaning. You find yourself soaring on the thermals of life. A yearning takes hold to return to our true nature; we\\'re ready to turn away from society\\'s conditioning and find the truth - to activate the divine human within. When you start fully infusing soul through meditation, you\\'ll be taken on a magical journey of remembrance, of detoxification, healing and rejuvenation. The Seven Bodily Vehicles are purified, reactivated and re-energised - in short they are \"resurrected\". You re-acquire those skills so tragically taken from you. You once more take on multi-dimensional form; a much greater expanded reality becomes your truth. You are reacquainted with your birth-right. Rise, Divine Human! By Open — Rise Up from Openhand on Vimeo . Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562636.0670376}