{"duration": 0.03158426284790039, "input_args": {"text": "'Posted on November 3, 2016 by DCG | 3 Comments \\nAin’t multiculturalism grand? \\nFrom Daily Mail : Pictures show men lunging at each other with makeshift clubs last night next to a row of tents in the Stalingrad district of the French capital. Amid chaotic scenes, gangs of men were seen brandishing pieces of wood and squaring up for a street battle. \\nThe violence unfolded just hours after demolition workers supported by riot police began smashing up an illegal camp full of UK-bound migrants in Paris. It also came in the wake of the destruction of the Calais Jungle which saw refugees transported around the country. It followed thousands of migrants arriving in the French capital following the razing of the Calais Jungle refugee camp last week. \\nWhile some 5,000 Jungle residents agreed to be bused to resettlement centres around France, many others headed off independently , saying they still wanted to get to Britain. Up to 3,000 set up tents on the pavements around the Stalingrad Metro station, which is close to the Gare du Nord Eurostar hub in the north of Paris. \\nShortly before yesterday’s clearance French president Francois Hollande said: ‘We won’t tolerate the camps any longer.’ Referring to the Paris clearance, Mr Hollande said: ‘We are going to carry out the same operation as in Calais.’ \\nCRS riot police around Stalingrad said there would be a ‘gradual operation’ which is likely to go on all week until all the camps are gone. \\nMeanwhile, the first ever official centre for refugees in Paris is due to be opened by the city’s Socialist council later this week. The £6m facility is also close to the Eurostar hub, and will have beds for 400 men. \\nBut local residents and business owners say it will attract people smugglers, and other criminals. Jean Brossard, who has been living in the area for 30 years, said: ‘None of us asked for an immigrant centre on our doorsteps. Everybody in the area is complaining. If these men want to go to England, then send them to England.’ \\nOthers have accused the Socialists of tokenism, saying they are simply opening the camps as a humanitarian gesture that will have no long term effect on Europe’s immigrant crisis. \\nThe official centre, which will include a football pitch, will only allow residents to stay for between five and 10 weeks, and is likely to shut down within two years. Another centre for women with children will also open in the Paris suburb of Ivry-sur-Seine later this year, or early next, but it too will only have a limited capacity of 350 temporary places. \\nMeanwhile, French authorities have started transporting migrant children out of Calais to processing centres around France, amid tensions around the closure of the vast Jungle camp. \\nThree buses carried a group of unaccompanied boys, mainly teenagers, out of the camp on Wednesday morning. French authorities transferred more than 5,000 adult migrants out of Calais last week, but the fate of its 1,500 unaccompanied children remained unclear. \\nMigrants from the Middle East and Africa converged on the Jungle in hopes of crossing the English Channel to Britain. \\nPresident Francois Hollande said this week that the children would be transferred within days to ‘dedicated centres’ where British officials can explore whether they have the right to UK asylum. \\nMr .Hollande said the others would be put in the care of French child welfare services. \\nDCG'"}, "time": 1742628473.0222757}