{"duration": 0.17113876342773438, "input_args": {"text": "'posted by Eddie As night begins to fall across East Java, Indonesia, the color palette of the world grows more subdued. That is, except in one area, where one of the most spectacular shows on Earth is about to take place. This is Kawah Ijen, a living volcano in eastern Java. It looks just like any other active volcano. That is to say: nothing grows on it, nor, if it can be helped, goes near it. Yet there are people who often have to venture to the volcano, regardless of the danger it may cause. This is because of the hot vents around the volcano slope, which pump out sulfur – something that can be extracted and sold and which, as a result, can help earn locals a living. This means that sometimes around Kawah Ijen a number of sulfur miners can be seen hanging around the vents. Some of them hold damp rags to their mouths to act as barriers against breathing in the toxic sulfur gas. It’s a necessary precaution for those who aim to harvest this bright yellow element. This process, however, is made easier by the addition of ceramic pipes, which were attached to one of the volcano’s vents. When the sulfur gas comes up through the Earth’s crust, then, it enters the pipes, cools into a liquid and eventually becomes solid. That’s when the workmen fragment the sulfur and heave the resulting deposits onto their backs to transport it away. Still, the miners don’t get much for their labor. Each pound of hard-earned sulfur, in fact, earns them less than 25 cents’ return. Still, there are some perks to the backbreaking work –particularly for those who graft when the sun is set. That’s when night finally does fall, an amazing change takes place. The deadly sulfur gas that was hardly visible before suddenly erupts in blue blazing flame. And those hot flames trickle down the mountainside – like a river. This amazing feat of nature works like this. The gaseous sulfur that pumps up through the Earth is extremely hot, at 1,112 degrees Fahrenheit, and that makes it very, very combustible. And once this heated sulfur comes in contact with oxygen, it bursts into flames – specifically, electric blue-colored ones. These cobalt fires, moreover, leap out of the vents to heights of up to 16 feet. Even as it burns, though, some of the gas begins to condense. And as it condenses, it forms liquid, yet continues to burn. That’s why you get liquid rivers of blue flame sometimes flowing down Kawah Ijen – and why it is also known as the Blue Fire Crater. But this eyecatching spectacle isn’t totally unique to the East Java volcano. After all, similar “rivers” of blue fire occur at Yellowstone National Park, Wyoming, when forest fires mix with sulfur from vents. The result, then, is a brilliant blue burst of flame. One of the most intriguing aspects of the blue flame phenomenon, however, is that it can only be witnessed at night. During the day, even though the fires burn just the same, they’re pretty much invisible to the naked eye. Indeed, finding molten sulfur around hot vents, which are also known as fumaroles, is not uncommon. This is because sulfur has a low melting point compared to other subterranean elements. As a consequence, the heat of the vent is often enough to turn the sulfur into a gas. What’s more, there are legends of this kind of fire that stretch back thousands of years. Ancient people living in Italy described this phenomenon, saying that they saw molten blue fire flowing down Mount Vesuvius as well as on a small island near Sicily called – aptly enough – Vulcano. And according to French photographer Olivier Grunewald, those old reports may have some basis in fact. “Blue flames may also be observed at the base of the plume of erupting volcanoes, when ash explosions occur,” he told National Geographic in January 2014. Indeed, Grunewald has explored other parts of the world where similar phenomena occur. In the Afar region in Ethiopia, for example, there is a volcano called Dallol which sometimes emits a blue-tinged light. And Grunewald is just one of the photographers who has braved Kawah Ijen to document its bright lights on film. Another is Reuben Wu, whose astonishing images here intimately show the power and danger of the sulfurous mountain. Speaking of danger, there’s yet another peril to be found at Kawah Ijen, in the form of its crater lake. That just happens to be the largest body of water featuring hydrochloric acid on the planet, at 650 feet deep and almost half a mile wide. But where does the acid come from? It comes from the volcano itself, in fact, which releases hydrogen chloride gas. This gas in turn reacts with the water in the crater and turns it into an acid. The acid is extremely concentrated and the pH is almost 0 – as acidic as it can be. There are fears, then, that if the crater bursts like a dam on its weakest side, it could be disastrous. But fortunately for those who don’t want to risk seeing the blue fire in person but who still clamor to see it in action, there’s a French documentary showcasing the amazing lights produced at Kawah Ijen. The film uses Grunewald’s footage to explore the sulfuric volcano in detail, along with – of course – shots of its stunning night-time displays. Source:'"}, "time": 1742563694.147451}