{"duration": 0.04762458801269531, "input_args": {"text": "'Horseradish Root \\nRaw Apple Cider Vinegar \\n** I add Cayenne Pepper and Turmeric Root but this isn’t a part of Dr. Schulze’s recipe \\nPreparation: \\nThis tonic is prepared like all tinctures: fill a glass with herbs, completely cover the herbs and then add two or three more inches of liquid, in this case vinegar. Then let the tonic sit in a dark place for at least 2-6 weeks, the longer the stronger it will be. \\nYou will need a large glass jar — I use the gallon size jar by Ball so that I can make a large batch that will last. \\n\\nNext, peel and chop your veggies. Some people put them in whole while others dice grate, or process them. This is up to you how small you want your pieces, I like mine chopped but not minced just because it makes the straining process a little easier and I reuse the pieces in soups after. \\n\\n*Remember, these are hot peppers and onions, if you’ve never cut them before they are powerful enough to make you cry. Many instructions recommend wearing gloves. I never have gloves around the house so I just do it bare handed and let the tears roll. However, if you have any small cuts on your hands you will becoming highly aware of them. To get the smell and burn off I wash my hands with hot soapy water and then with fresh squeezed lemon juice after and make sure not to touch my eyes for at least an hour. \\n\\nPlace all of the ingredients into the large glass jar and completely cover with apple cider vinegar so that the vinegar sits two inches above the herb and veggie line. (The extra vinegar accounts for the expansion) \\n\\nPlace a firm lid on the tonic and while holding the lid in place shake the tonic so that it mixes and settles. Add more vinegar if needed. You can let the medicine sit alone for weeks or you can shake it daily, which is recommended. I let mine sit for a full moon cycle. \\nStrain \\nNext, for storage and ease of use, strain the tincture. You will need a loosely woven piece of cloth, like cheesecloth, muslin, or some handkerchiefs, a large bowl, and a stainless steel colander that fits into the bowl. If you don’t have these tools, you can place the cloth over the mouth of the jar and pour until all of the liquid has come out but you will waste a lot. \\n\\nPlace the colander into the bowl and line the colander with cheesecloth. Pour the contents of the jar into this strainer. Take a flat object, like a plate, and press onto the concoction to press the remaining juices out. \\n\\nYou can pour the tonic into small jars or you can rinse your large jar and keep it in there. Tinted bottles, like amber glass, are recommended for storing tinctures because they reduce light damage. \\n\\nStore in a dark, cool place. Compost the remains or you can freeze to add a kick to soups and other dishes. This man made a youtube video to show how he makes the Master Tonic. Dosage \\nOnce the tonic is ready you can start drinking it daily or as needed to support digestion, the immune system, and other ailments. Remember, you were soaking really powerful and spicy herbs so that is what it is going to taste like. I actually mix a little raw honey into mine so that it goes down smoother but most take it as it is. Make sure you are drinking a lot of water throughout the day, too. \\nThis is Dr. Shulze’s label for dosing: \\nFor the homemade concoction, unless you have a dropper, a shot a day will work. A shot is usually 1-2 ounces. However, if you are fighting an infection or cold you can up the dosage to 5 or 6 shots a day. \\nKnow Your Herbs: Key Constituents \\nGarlic: alliin, essential oils, sulfur compounds, germanium, selenium, potassium, magnesium, phosphorus, Vitamin A, B Vitamins, Vitamin C \\n*treats colds, flus, sore throats, aids digestion, stimulates white blood cell production, antiseptic, antibacterial, antimicrobial, vermifuge, aids circulation and cholesterol, lowers blood sugar levels \\n\\nGinger: Essential Oils, oleoresin, gingerol \\n*anti-inflammatory, repair damaged joints, improves circulation, lowers blood sugar, heals nausea, antiseptic \\n\\nWhite Onion: sulfur, quercetin, alliins, phytochemicals, dietary fiber, vitamin C, vitamin B6, potassium \\n\\nHabanero: antioxidant, phenolic compounds, carotenoids and ascorbic acid \\n\\nHorseradish: sulfur, antioxidants, mustard oil, vitamin C \\n*antibiotic, vermifuge, increases white blood cell count, diuretic, loosens mucus and works for sinus infections, lung problems, cough, asthma \\n\\nReferences: European Journal of Clinical Nutrition The British Journal of Nutrition Journal of Food and Nutrition Sciences'"}, "time": 1742628543.87602}