{"duration": 0.09918427467346191, "input_args": {"text": "'Good morning. Here’s what you need to know: • François Hollande, the French president, announced he would not seek  . The prime minister, Manuel Valls, is likely to step up as a leading contender in the party’s primary. Mr. Hollande’s unprecedented decision only slightly improved the chances of the ruling Socialists in presidential elections in April as   and populist forces gain strength in France and across Europe. In Italy, the   Five Star Movement has campaigned aggressively against a referendum on constitutional changes on Sunday, turning it into a virtual plebiscite on Prime Minister Matteo Renzi. And Austrian voters on Sunday could become the first in Europe since World War II to elect a   head of state. _____ • A remarkably subdued Vladimir V. Putin, the president of Russia, called for cooperation with the new American administration in his annual state of the nation address. But a new foreign policy doctrine signed by Mr. Putin stressed the gravity of “the serious crisis between Russia and the West” and placed the blame for it on “geopolitical expansion” by NATO and the European Union. _____ • In the United States,   Donald J. Trump’s arrangements to save jobs in Indiana involved significant government subsidies. In his first   rally, Mr. Trump said James N. Mattis, a former general who served in the Middle East and is known for his critical stance toward Iran, will be his nominee for defense secretary. We mapped out the array of conflicts of interest that Mr. Trump’s global business empire presents. And the  ’s freewheeling exchanges with foreign dignitaries prompted the White House to urge him to seek diplomats’ counsel. _____ • Hallucinogens help cancer patients. Psilocybin, an ingredient found in hallucinogenic mushrooms, can significantly reduce anxiety and depression in the patients, according to a new study. The drug, administered via wooden goblet in one study, has been illegal in the U. S. for more than 40 years. _____ • British ministers said that the country could agree to pay the European Union to retain access to its single market. Zac Goldsmith, to the left in the photo above, a key proponent of Britain’s departure from the bloc, lost his seat in Parliament in a  . • In Reykjavik, commercial real estate construction is racing to keep up with demand and is transforming the Icelandic capital. • When a wealthy businessman set out to divorce his wife, their $400 million fortune vanished. The quest to find it would reveal the depths of an offshore financial system bigger than the U. S. economy. • The U. S. Labor Department’s monthly jobs report today will be scrutinized as the last indicator of unemployment and wages before the Federal Reserve’s likely increase in interest rates. • Global bond markets are plunging. Here’s a snapshot of global markets. • In Germany, a challenger to Chancellor Angela Merkel has emerged from the ranks of her party: Jens Spahn, a    critic of her refugee policy. [Der Spiegel] • Greece’s war of words with Turkey on territorial claims has deepened before bilateral talks this weekend. [Ekathimerini] • Ban   the departing secretary general of the United Nations, apologized for the organization’s role in the cholera outbreak that has claimed 10, 000 lives. [The New York Times] • At least 350 people have come forward to report sexual abuse at the hands of youth soccer coaches in Britain, deepening a scandal that has engulfed English soccer. [The New York Times] • Israel sent its first ambassador to Turkey in five years, just as the Turkish high court takes up a case involving the debacle that broke relations: the lethal Israeli raid on the Mavi Marmara, a ship challenging the Gaza blockade. [Hürriyet] • There are no laws in the Shuafat Refugee Camp, where 80, 000 people live surrounded by a   concrete wall, despite it being inside the city of Jerusalem. [The New York Times] • Scotland plans to raise the age of criminal responsibility to 12, from 8, currently the lowest in Europe. [The Scotsman] •   century Paris, the harrowing escape of an American slave and a seemingly ordinary Korean housewife turning vegetarian after a terrifying dream: These are The New York Times Book Review’s 10 Best Books of 2016. • In memoriam: The actor Andrew Sachs, who played Manuel in the British comedy series “Fawlty Towers,” died at 86. • Buzz Aldrin, the    adventurer and former astronaut who was the second person to walk on the moon, was evacuated from Antarctica after he became ill while visiting the South Pole with a tourism group. • Isabelle Huppert, the French actress, chooses roles that are sometimes hard to watch. And yet we can’t bring ourselves to look away. • Recipients of a new British scholarship will spend time in Buckingham Palace, but don’t get the wrong idea: They will cook, cater and otherwise serve the British royals. • A    Alaskan environmentalist with no formal design education is challenging a fashion world dogma: Is all fur bad fur? • Zinedine Zidane may not be the perfect soccer club manager, but he could well be perfect for Real Madrid. • And “Snow Beach,” a new book, chronicles the style of snowboarding culture in the 1980s and 90s. Artists, art collectors, curators and the scenesters who surround them are in Miami this week for Art Basel Miami Beach. It’s a spinoff of the fair held in Switzerland. (There’s also a Hong Kong version). Despite the party atmosphere, the art world may intimidate the uninitiated  —   especially with its terminology  —   so we’re here to offer some help. Showcasing “the masters of Modern and contemporary art” is Art Basel’s stated aim. Those categories may sound redundant, but they’re not. While “modern” can indicate the present, it is also tied to ideas that “were new or even experimental” when they were developed, according to the Museum of Modern Art. Contemporary means work by living artists. Just don’t confuse “master” with “Old Master,” which is a “distinguished European artist from about 1500 to the early 1700s. ” Think Michelangelo. At a gallery, you might enter a room with related sculptures. This isn’t an installation unless it encourages “active engagement” by the spectator. And if you’re thinking of calling something “sublime,” you’re saying the piece is “worthy of reverence,” according to MoMA. One last tip: Remember, the artists and the dealers are also nervous about how you’ll react. “What depresses me the most is if people walk past the booth and don’t stop,” a dealer told The Times this summer. “I want people to come in and then have a journey. ” Christopher Shea contributed reporting. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742562021.9391162}