{"duration": 0.016084909439086914, "input_args": {"text": "'Rigged Election: US Blaming Russia For Future ‘Falsified Voter Fraud’ by IWB · October 26, 2016 \\nby Baxter Dmitry \\nUS officials claim that if anybody produces evidence of voter fraud in the coming weeks, it will be a Russian plot to undermine people’s confidence in American democracy. \\nBlaming Russia for the Democratic National Committee and Clinton Foundation hacks proved so successful at distracting Americans from the contents of the WikiLeaks emails that US officials are now attempting to blame future evidence of voter fraud on Russia too. \\nThe claims are being disseminated to the public via mainstream media pipelines as we speak. Reuters, operating as an organ of state propaganda, reported the claims by anonymous U.S. officials on Thursday: \\n“ The officials, who spoke on condition of anonymity, said however, that the U.S. election system is so large, diffuse and antiquated that hackers would not be able to change the outcome of the Nov. 8 election. \\nBut hackers could post documents, some of which might be falsified, that are designed to create public perceptions of widespread voter fraud, the officials said. \\n\\nThey said that they did not have specific evidence of such a plan, but state and local election authorities had been warned to be vigilant for hacking attempts. “ \\nThe keyword in the second quoted paragraph is “ some. ” Truth mixed with lies. Reuters, in collusion with the state, are using confusion, paranoia and heavy-duty spin. Dizzy yet? \\nThe mainstream media has now laid the groundwork to ensure that if Clinton wins the election and is accused of voter fraud, any evidence provided to substantiate the claim can be instantly dismissed as fake Russian propaganda and not investigated properly. \\nIn essence, if the ruling party says that a specific document is false, then without question, it must be false. The Democrats will dismiss evidence of voter fraud as another “conspiracy theory” and “Russian plot.” \\nThe Democrat establishment has spent months attempting to deflect from the content of WikiLeaks emails by alleging the source of the hack was Russia. Now they are attempting to capitalize on the narrative by blaming future voter fraud evidence on Russia as well.'"}, "time": 1742628538.624185}