{"duration": 0.06706809997558594, "input_args": {"text": "\"I’ Two of Mohammed' \\nGenerally, I use Mohammed’s words, quoting him in a first person narrative. He told the story of their desperate life-threatening journey over a year ago. They went to Finland with the hope that fewer refugees would travel so far, that they would get asylum quicker and be reunited with their family, Mohammed’s wife and the other six children in Iraq. Together with a small group of friends, Kathy Kelly and I were able to visit them in Finland in the deep winter cold this past January. We were able to bring them for a few days from the camp to Helsinki where they were warmly r \\nIn late June, Mohammed wrote us about the depression and frustration among refugees in their camp as many of them were getting rejected for asylum. He wrote that even Iraqi refugees from Fallujah, Ramadi and Mosel were getting rejections. “I don’t know what I will do if I get a bad answer. For the last three weeks only bad answers are coming.” \\n“Today I got the immigration decision that my case was rejected. Me and Ahmed are not welcomed to Finland. Thanks for everything you did.” The next day he wrote again. “Today is one of the heaviest days of my life. Everybody, my son, my cousin and myself . . . we just kept silent. We are shocked from the decision. Losing my brother, jailed for 2 years, kidnapped, tortured, losing my house, parents, father-in-law, death threat letter and assassination attempt. Over 50 relatives killed. What more must I give them for them to believe me? Only one thing I forgot, to submit my death certificate. I feel I am being slaughtered. I don’t know what to tell my wife and children [in Baghdad]. \\nWe have since learned that Finland is granting residency to only 10% of asylum seekers. An appeal is in progress, and several people have written letters on Mohammed’ \\nIn the meantime, the situation in Iraq and in Baghdad continues to worsen in terms of daily explosions, suicide bombings, assassinations, kidnappings, ISIS, police, army and militia activity. His wife lives in a particularly open and vulnerable rural area. His brother, who used to live a stone’s throw away, had to flee with his family several months ago due to death threats. This left Mohammed’s wife and children without protection. During Ramadan Mohammed wrote, “The situation is really terrible during these days. My wife was planning to take the kids to her mother’s village during EID but she cancelled this idea.” On another occasion he wrote, “My wife is very worried about our second oldest son, afraid he will be kidnapped. She is thinking of moving from the village. Today we argued very hard as she blames me, telling me that I said we would be reunited within 6 months. \\nOn two recent occasions armed uniformed men came to Mohammed’s house seeking information about Mohammed and Ahmed. Mohammed wrote, “Yesterday at 5 a.m., the house was raided by armed official military guys in uniforms. Maybe the police? Maybe the militia or ISIS?” It is hard to imagine the fright of Mohammed’s defenseless wife and the children, the youngest of whom is only 3 years old. It is hard to imagine Mohammed and Ahmed’s fright being so far away. At times Mohammed’s wife has hidden the oldest boy in the reeds by their house, afraid he will be recruited by force by ISIS or the militia! She has also been afraid to send the children to school because the security situation is so dangerous. She is angry at Mohammed, scared and not understanding why they have not been reunited after a year’ \\nRecently Mohammed emailed, “Honestly, Cathy, every night I am thinking of returning home and ending these arguments. Living away from your beloved kids is really hard. If I get killed alongside of my family, then everyone will understand why we had to leave and the arguments will finish. Even the Finnish immigration will understand that what I told them was true. But the next morning I changed my mind and decided to await the court’s final decision. \\n“Every night I am afraid from the next morning’s news from my family. My daughter asked me by phone last week ‘Dad, when can we live together again. I am now 14 years and you have been away so long.’ She broke my heart. \\nJust a few days ago he wrote, “I’m so happy because the ice has melted between my wife and I. My little boy, 6 years, and his youngest daughter, 8 years, went to school today. My wife is so brave. . . . She decided to pay for a school bus for all of the kids. She said, ‘I believe in God and I am sending the children and taking the risk.’ \\nThis entry was posted in Special Reports . Bookmark the permalink\""}, "time": 1742563694.5489514}