{"duration": 0.08073806762695312, "input_args": {"text": "'November 7, 2016 at 6:52 pm \\nSo we are prepositioning enough equipment for a Marine Mechanized Task Force of 920 Marines 1000 Km from the Russian Boogie Man\\'s border? Complete with 58 M1A1 MBTs? Talk about a total waste of Taxpayers money. In 2003 45,000 Marines barely made it to Baghdad, 545Kms against almost no opposition. The Marines fought mostly Fedayeen Saddam(determined fanatics yes, but with little or no military training) and prison inmates released once the invasion started (\"fight the Americans or we shoot you now\"). The Marines never encountered one opposing complete Iraqi Battalion, they did fight Company strength Iraqi Light Infantry 4 times and never came under coordinated Artillery fire. With timid leadership, a inept ability to maneuver off of the Hardball (Main Highway), complete abandonment of Doctrine nearly every ambush (the damn Task Force comes to a 2hr stop so 2 squads can engage 6 Hadjis for 20 minutes) and a real arrogance that precluded using Combat Multipliers (Intel, Artillery, Combat Aviation, SIGINT/ELINT, Civil Affairs or Linguists (3/4s Battalion CO dismounting & having Infantry assault dug-in Fedayeen Saddam in palm groves without preparatory fires while 5 M1s, 2 LAV25s and 8 AAV-7s are walking distance away with 120mm, 25mm, .50cal, and Mk-19s sitting at idle and the 81mm & 120mm mortars are less than 2Km away. Scary to think this Jackwagon is a MG in charge of thousands)The Marines arrived in Baghdad a week late 10 days after Fox and Ghost Troops 2/7CAV occupied the International Terminal at Baghdad Airport.3ID eliminateded 4 complete Divisions and 7 Separate Armored Brigades in active combat destroying 690 MBTs, 1150 AFVs and 1000+ wheeled vehicles. The 1st Marine Division did a excellent job of destroying the 17 Tanks that actually engaged the Marines.The Marines last 35Kms into Baghdad were actually cleared of Iraqi Armor by Fox and Ghost Troops of 2/7 CAV, on their third Thunder Run they turned South on Highway 6 and destroyed 44 Armored vehicles of the 41st Separate Brigade, 3 days before the Marines arrived late.The Marines performance in the CENTCOM operational area hasn\\'t improved much over the last 13 years.Btw I was a 18E assigned as a Arabic IT, physically with 2nd LAR Bn, C Co, so I got to witness the entire 5 Star, 3 Ring Clusterfuck from the tip of the very dull Marine spear.Thats 800Km thru Norwegian Mountain passes and 200 across Europe\\'s biggest swamp(in the Spring, Fall and Summer) or Ice Flat (in Winter) that can support Tanks on three narrow roads.Pretty sure the the Murmansk Military District Commander ISN\\'T shaking in his boots as he looks out at his 260 Thermobaric MLRS launcher vehicles and 640 T-80 & T-90 MBTs.\\ufeff'"}, "time": 1742562808.141266}