{"duration": 0.0156857967376709, "input_args": {"text": "'Now Pak PM Nawaz Sharif announces demonetization of high value Pakistani currency Posted on Tweet (Image via intoday.in) \\nInspired by PM Modi’s gutsy decision to demonetize Rs 500 and Rs 1000 notes and by the generally positive reaction of the Indian public, Pakistan PM Nawaz Sharif too decided to abolish high denomination currency notes and win back public favour. After a quick meeting with the Governor of the State Bank of Pakistan, PM Sharif, like his Indian counterpart, decided to announce his decision in a nationally televised address to the nation. \\n“ Bhaiyon aur behnon! ” he roared, adopting a tone similar to Modi’s, “there comes a time in the history of a country’s development when a need is felt for a strong and decisive step. For years, this country has felt that corruption, black money and terrorism are festering sores, holding us back in the race towards development. Terrorism is a frightening threat. Have you ever wondered how terrorists get their money? Enemies across the border – RAW agents to be specific – run their operations by printing fake Pakistani currency!” \\nNawaz paused to take a sip of water. \\n“ Bhaiyon aur behnon! To break the grip of corruption and black money, we have decided that from midnight tonight, the Rs 5000 note and Rs 1000 note will no longer be legal tend…” \\nAt this point, Sharif’s address to the nation was rudely interrupted by army chief General Raheel Sharif who barged into the frame and landed a stinging slap on the PM’s face. \\n“ Bhaag yahan se! [Get out of here!]” the army chief barked. \\nHolding a hand to his reddened cheek, the shamefaced PM slowly got up and walked out. General Sharif turned to the camera. \\n“Ignore whatever he said. Things will continue as usual,” he said, before turning it off. Tweet About UnReal Mama \\nEk chatur naar badee hoshiyaar, apane hee jaal me phasat jaat ham hasat jaat are ho ho ho ho ho!'"}, "time": 1742628539.5788224}