{"duration": 0.11913776397705078, "input_args": {"text": "'VANCOUVER, British Columbia  —   It happens all the time: Young gay people leave their small towns and head to the big city, where they can find love, acceptance and, in Canada at least, a curling league to call their own. Yes, the winter sport that involves ice, round rocks and a good deal of sweeping has a passionate following among those who have come out of the closet, taking their brooms with them. They are men like Brock Endean, 27, the scion of national curling champions who grew up playing the sport in the rural British Columbia village of Chase, population 2, 500. “When I walked down the street, I was the entire gay pride parade,” said Mr. Endean, a consultant. After moving to Vancouver, he joined the gay Pacific Rim Curling League, which this year marched in the Vancouver gay pride parade, carrying brooms and wearing shirts that proclaimed, “I swept with your husband. ” Canada has for decades been at the forefront of gay rights, legalizing homosexual activity, openly gay military service and   marriage long before the United States and other Western democracies did. This summer, Justin Trudeau became the first sitting Canadian prime minister to march in a gay pride parade. Gay curling leagues have blossomed in recent decades, highlighting a distinctly Canadian aspect of modern gay life. The country’s oldest gay curling league, Rotators, was started in Toronto in 1962 and went publicly gay six years later. Its founders were largely men who worked as train porters. “They were the flight attendants of the railway,” said Murray Leaning, the president of Rotators and Riverdale, the nation’s largest gay curling league, comprising 56 teams. Canada has 12  gay curling leagues with hundreds of   teams. The leagues take a communal pastime beloved for its traditions of friendly competition and drinking and add campy humor and flamboyantly themed tournaments, or “bonspiels” in curling lingo. Among the teams in the Pacific Rim league are Don’t Curl for Me Argentina, Sweeping Beauties, Fruit of the Broom and Curls Gone Wild. During one recreational tournament, players dressed as Disney villainesses and as the sartorial embodiment of a “Sound of Music” lyric: girls in white dresses with blue satin sashes. In Winnipeg, Manitoba, players have dressed as characters from “The Golden Girls” and “The Wizard of Oz. ” This year, the Riverdale tournament had a “shipwrecked” theme. “There were an awful lot of slutty sailor outfits,” Mr. Leaning said. The Pacific Rim league, founded in 1983, plays on Sunday afternoons at a Vancouver facility where the 2010 Olympic curling events were held. In curling, teams of four take turns pushing   stones across the ice toward a target of concentric circles, aiming for the bull’  known as the button. One player, the lead, thrusts a stone, and then two   teammates sweep the ice in front in a frenzy while the skip shouts directions. On a recent weekend, the leads glided gracefully across the ice with one leg extended behind, looking like winterized flamingos. The air resounded with the squeaks of frantic sweeping and the crack of colliding rocks. In the lounge overlooking the ice, opposing teams sat together drinking beer and greeting their fellow players with a “hello, darling. ” Brought to Canada by Scottish immigrants, the sport has long been part of communal life, particularly in the frigid prairie provinces. At one curling facility in Winnipeg, a phone on the ice connects directly to the bar so cocktails can be delivered while the players curl. “When you grow up in a small town where the winter is long, you’ve got to do something or you’ll lose your mind,” said Glen Broad, 62, an Air Canada employee who moved to Vancouver from Saskatchewan. A member of the team Old Broad and Her Gurls, Mr. Broad started curling at 12, in an era when there were ashtrays on the ice and his father would sweep with a cigarette in his mouth, he said. Many curling enthusiasts first learned the sport by watching their parents play. “In the 1970s, curling club was like day care,” said Greg Elzinga, 47, a construction project manager and member of the Pacific Rim league. “My mom would say, ‘Don’t play in the ashtrays, and don’t drink the punch. ’” As curling brooms have evolved, from straw to hog hair to synthetic bristles, so has the sport, which has grown in popularity since it returned to the Olympics in 1998 after a   absence. Smoking on the ice is no longer permitted, and many provinces prohibit imbibing during play. “We have flasks, but you need to be discreet,” Mr. Broad said. Much of the drinking occurs after matches, when, according to curling tradition, the winners buy a round for the losing team, which then reciprocates. Despite the boozy heritage and reputation for camaraderie, curling requires skill and strategy. After all, as I discovered during my visit, pushing large rocks across ice while balancing on one knee is harder than it looks. (I tipped over on my first try.) Mark Trowell, 51, a human resources manager, who was on the winning team at this year’s Canadian Gay Curling Championships, said the sport’s civility had sometimes decreased as the competition had become fiercer. “There have definitely been some Tonya Harding moments,” he said, referring to the figure skater who was implicated in an attack on her rival Nancy Kerrigan at the 1994 United States Figure Skating Championships. But Mr. Trowell was quick to clarify that no battery had occurred. “Brooms smack on the ice,” he said, “not people’s heads. ” Given the modest prizes  —   a national championship team receives 1, 000 Canadian dollars  —   few players are in it for the money. Until a few years ago, the leagues relied on sponsors that provided considerably less lucrative prizes, like flashlights, hand blenders or toasters. Canada’s gay curling leagues welcome players of any sexuality or gender. Heather Kisbee, 57, an executive assistant, joined the Pacific Rim league five years ago with a few female friends, though she failed to tell them that most of the participants were gay until one of the women remarked excitedly on the large number of   men. “She was single and quite desperately looking,” Ms. Kisbee said. “Still is, poor girl. ” Inclusiveness goes both ways, said Jack Holmes, 53, a theater facilities manager whose team of gay players has twice won mainstream league tournaments. “The men get really serious, particularly if they’re playing us, because we’re openly gay,” he said. Straight players have not always been so tolerant, Mr. Holmes added, recalling a derogatory comment made in a locker room eight years ago. For many enthusiasts, gay curling truly hit the mainstream in 2010 when Mr. Trudeau attended the first bonspiel held by the gay curling league in Halifax, Nova Scotia. It immediately became clear that he was not as skilled at curling as at some of his favorite sports, like snowboarding and boxing, according to Mr. Leaning, the president of the Toronto leagues. After saying a few words, Mr. Trudeau slid a ceremonial rock down the ice. His throw, Mr. Leaning said, went wide of the mark.'"}, "time": 1742563008.8364246}