{"duration": 0.04432988166809082, "input_args": {"text": "'PARIS  —   On an upper floor of the Hôtel Salomon de Rothschild, the   manse formerly occupied by the banking Rothschilds, a line of sweating models fiddled with the rings in their lips and the septums of their perfect noses, and waited to have their lip gloss reapplied. They chatted among themselves, fanning one another with torn bits of cardboard in the close, sticky corridor and examining their nails, which had been sharpened to talons and encrusted with miniature gems. They received compliments with the languorous equanimity of court ladies, which for a night they were. Not for the first time, and surely not for the last, the thought occurred that the European fashion shows, with their ritual peregrinations from palace to palace, were not so different from the French court, which took its pomp and circumstance on the road at regular intervals. The thought occurred with particular force Wednesday evening because Rihanna  —   pop megastar, fledgling designer  —   had decreed that the look she wanted for this, her Fenty show for the German sportswear giant Puma, was Marie Antoinette “if she was going to the gym. ” Rihanna was in a chamber two rooms back. She was wearing a pink   of her own design, twirling a long strand of pearls and receiving guests who had come to pay court: journalists executives   Pinault, chairman and chief executive of Kering, which owns Puma. (“The collection is very interesting,” he said gamely, on his way to the salons downstairs where the show would eventually begin.) Attendants were barking out orders  —   “Nails, nails, we need nails! We’re losing nails!”  —   but Rihanna was serene and unusually humble for a reigning monarch, which, for the evening at least, she was. “I would never expect that I would be allowed in Paris to show a collection this early as a designer,” she said. “That wasn’t a thing that I expected at all. I couldn’t believe  —   I still right now can’t believe it happened. ” When the time came for the show to start, the models sashayed through, fanning themselves coquettishly, their chinoiserie boiler suits and filmy, frilly windbreakers dipping off their shoulders. The reaction from those outside the court, from the queen’s   subjects, was rapturous (on Twitter, a sampling: “I love this” “LIFE GIVING” “The look of the century”) and the designer, who took the final lap herself, did so with a giant smile on her face. Earlier in the evening Rihanna had been asked if she related to Marie Antoinette and she nodded. “She was very dramatic,” she replied.'"}, "time": 1742564065.1267903}