{"duration": 0.155256986618042, "input_args": {"text": "'LOS ANGELES  —   Chris Paul examined his crooked knuckles and the surgical scars that form tiny road maps on his hands. He has torn various ligaments in his thumbs and has broken bones in his fingers. He has worn casts and splints. His hands, though, are the indispensable tools of his trade, no matter how gruesome they look. “I’ve got the worst fingers,” he said. Paul, the starting point guard for the Los Angeles Clippers, long ago established himself as one of the N. B. A. ’s premier defenders. He has collected more steals than any other active player in the league: 1, 892 and counting. A     he clutters passing lanes. He strips dribbles like paint thinner. Doc Rivers, his coach, has concluded that Paul has the best hands he has ever seen. “Gifted,” Rivers said during an interview in January. “His hands are so damn quick. ” Three days after Rivers offered this assessment, Paul paid the price for possessing such gifts. In a game against the Oklahoma City Thunder, he jammed his left thumb fighting through a screen, tearing his ulnar collateral ligament  —   not to be confused with his radial collateral ligament, the one he tore on his right thumb training for the Olympics in 2012. Few people on the planet have firsthand knowledge of the difference between R. C. L. and U. C. L. tears. Paul is one of them. (They both hurt, he said.) As for his most recent injury, Paul missed 14 games before he returned late last month. Even now, with the Clippers vying for playoff position, he is trying to regain his feel for the game. “I see plays all the time where I know I can reach for the ball and I know I can steal it,” he said. “But it’s like risk versus reward: Do I go for it?” Such is life for Paul, who cannot help putting his hands in harm’s way. He tore ligaments in his right middle finger in March 2010. He fractured his left index finger in October 2015. He broke his right hand last April, and he continues to play with 16 pins and a metal plate embedded in his palm. He shoots with that hand. In the process, he has become something of an expert on hands for colleagues. After J. R. Smith of the Cleveland Cavaliers fractured his right thumb in December, Paul called him to offer tips on his rehabilitation. Whenever Paul himself jams a thumb or sprains a finger, the first person he usually hears from is Matt Barnes, a former teammate who now plays for the Golden State Warriors. “Because he gets his fingers hit all the time,” said Paul, who is averaging 17. 6 points, 9. 2 assists and 1. 9 steals a game. “He understands. ” The challenge for Paul is that he relies on his hands. He is not, by his own admission, one of the league’s most awesome physical specimens. He is 6 feet tall and weighs 175 pounds. He is not particularly fast and does not jump especially high. But he has exceptional reflexes and a knack for anticipating plays. “He could have been a boxer,” Rivers said. “I don’t know if he could have taken a punch, but he could have landed some for sure. ” Growing up in North Carolina, Paul worked to develop hand speed and coordination. He was almost never without a ball, he said. He also watched the game constantly, studying how other players dribbled and passed, and all the angles they used to create space. He determined that there were a finite number of possibilities. “Not being the most athletic player,” he said, “I’ve always had to understand where you’re going with the ball. ” He recorded his first N. B. A. steal before he scored his first N. B. A. points, intercepting an errant pass before racing away for a layup. His professional career was less than four minutes old. In 2008, he set an N. B. A. record by going 108 straight games with at least one steal. “I think that one’s going to be hard to break,” he said. Jamal Crawford, his teammate, said that Paul had an encyclopedic knowledge of his opponents thanks to his experience and his tireless analysis of game film. “He’s ahead of the play,” Crawford said. Metta World Peace, a veteran forward with the Los Angeles Lakers and a former defensive player of the year, cited Paul’s “hunger. ” Few players, for example, are more skilled at recovering the ball if it happens to get stolen away. “Oh, I’m getting it back,” Paul said. “I want it. I want it. ” But Paul said that no one had better hands than Brevin Knight, a point guard who retired in 2009 and now works as an analyst for the Memphis Grizzlies’ television broadcasts. As a kid, Knight knew that the only way he was going to earn his way onto the prime playground courts near his home in East Orange, N. J. was by playing great defense. “Being smaller, you have to figure out a way for people to want to pick you so you’re not just sitting there on the side watching,” he said in a telephone interview. “It stuck with me from there. ” Knight described himself as a “tendency person. ” He could study an opponent for two possessions, he said, and get a feel for what that player liked to do with the ball. Paul is the same way. “He has the ability to look as though the he is not engaged defensively, but he’s really there,” Knight said. “It’s his way of luring the offensive guy into thinking, ‘Oh, I’ve got an easy move here.’ ” In retirement, Knight has found that his good hands  —   along with excellent peripheral vision  —   are still useful when he broadcasts games. Occasionally, he said, a loose ball will rocket toward the courtside table where he and Pete Pranica, the Grizzlies’    voice, are calling the action. Knight tries to save Pranica first, he said, and the courtside monitor second. “Because these teams have enough money,” Knight said, “they can replace a monitor. ” Rivers knows about defense, too. During his   playing career, he came away with 1, 563 steals and the mangled instruments of his profession. “I mean, honestly, look at my fingers,” said Rivers, who stretched his hands before him and stared at them as if they had been assembled by Picasso. Rivers was constantly putting his hands in danger. He described himself as a “reacher. ” He reached for loose balls. He reached for deflections. And he reached into the midsections of opposing point guards, committing an average of one foul for every nine minutes of playing time. Paul, on the other hand, goes about 14 minutes between fouls. “I’m amazed how clean he gets steals in traffic,” Rivers said. Not that he is immune from workplace hazards. One of Paul’s more devastating injuries occurred last April, against the Portland Trail Blazers in the first round of the playoffs. As Portland’s Gerald Henderson drove for a layup, Paul used his left hand to strip the ball away from Henderson. The problem was that Paul entangled his right hand in the back of Henderson’s jersey. He led a fast break in the other direction, but the damage was done: He had broken the third metacarpal in his right palm. The Clippers lost the next two games and the series without him. “Right when he did it, you could see me react on the sideline,” said Rivers, who did not react well. “I knew what it was. Because I had done the exact same thing when I was playing. ” This season has been another exercise in perseverance for Paul, who sprained his left thumb at a preseason practice, which was bad enough. Then, in January, he tried to squeeze past that screen against Oklahoma City  —   a collision made worse by the Thunder’s Russell Westbrook, who tried to draw a foul by jumping into Paul. “I tried to shake it out because I’ve jammed my thumb a thousand times,” Paul said. “I thought it would calm down. But I could see how swollen it was. I said: ‘I tore it. I know I did.’ ” After spending several weeks squeezing a tiny rubber ball to rebuild the strength in his thumb, Paul has since returned to the court. He would like to stay there. “Just trying to keep my hands out of the way,” he said.'"}, "time": 1742562903.4156976}