{"duration": 0.016025781631469727, "input_args": {"text": "'Former Vice President Joe Biden launched a new political action committee Thursday  —   a move certain to stoke rumors that he has his eyes on a 2020 presidential run. [Biden unveiled the “American Possibilities” PAC, giving the former Delaware Democrat the ability to rub shoulders with donors and help candidates in upcoming congressional and gubernatorial races.  “It’s time to reach deep into the soul of this country and once again give everyone  —   and I mean everyone  —   the opportunity to achieve the impossible. It’s time to look beyond   news cycles and   arguments. It’s time to treat each other with dignity and respect. Not as opponents, but as fellow Americans. Because that’s what we are,” Biden says in a statement on the website. “This is a time for big dreams and American possibilities. If that’s what you believe  —   and you’re ready to help elect folks who believe that, and to support groups and causes that embody that spirit  —   then I’m asking you to join me today. ” However, the creation of the PAC will also serve to increase speculation he is eyeing a potential 2020 run  —   nurturing the support of donors and candidates that he will need to clinch the nomination. The New York Times reported that Biden has tapped Greg Schultz, a former aide and a veteran of President Obama’s presidential campaigns, to lead the organization. Biden ran unsuccessfully for the Democratic nomination in 1988 and 2008 Biden. He also considered running in 2015 as a primary challenger to eventual Democratic nominee Hillary Clinton  —   but eventually chose not to. Biden has since expressed regret over that decision, and has said that he “never thought [Hillary Clinton] was a great candidate. ”  “I thought I was a great candidate,” he said at a Las Vegas conference in May. Biden has the potential to be a tricky opponent for President Trump. His run would likely be a more centrist campaign than other potential 2020 candidates  —   such as liberal firebrand Sen. Elizabeth Warren. He could also challenge Trump’s hold over   white working class areas in places such as Pennsylvania and Michigan  —   states central to Trump’s 2016 victory. The New York Times reported ahead of the announcement that Biden is frustrated that Clinton lost, particularly her failure to pick up votes from white   voters. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628576.0225732}