{"duration": 0.09582281112670898, "input_args": {"text": "'ANAHEIM, Calif.  —   As thousands of athletes headed to the Summer Olympics in Rio de Janeiro worry, to varying degrees, about the Zika virus, at least one American has taken a   measure: freezing his sperm. John Speraw, 44, the coach of the United States men’s indoor volleyball team, said he was preserving sperm to use for a planned future pregnancy in case he is infected with the   virus. “My wife and I would like to have another kid,” he said recently at U. S. A. Volleyball’s training center. “And I’m no spring chicken. I don’t want to get Zika and have to wait an additional year, or whatever it may be, for us to have kids. I’m paying attention to Zika, and I’m concerned about it. It’s not going to stop me from going down there, but I’m taking measures right now. ” The level of anxiety over Zika among athletes and coaches headed to the Olympics sweeps across the spectrum. The American cyclist Tejay van Garderen, worried about contracting Zika and passing it along to his wife and his unborn daughter, recently removed himself from consideration for an Olympic spot. In interviews with many other likely Olympians, most said they were not hugely concerned about Zika but planned to take suggested precautions against it  —   generally by avoiding mosquito bites. The threat has mostly altered plans of friends and family members who expected to go to Rio to cheer them. “My brother’s wife is pregnant, so if I go, he won’t be coming,” the American indoor volleyball player Murphy Troy said. “That’s unfortunate. That’s the biggest impact  —   other family and friends, people who may have come before may not come now. “As far as an athlete perspective, there’s not much we can do but be as prepared as we can to be    —   bug spray and long sleeves and stay inside. The information that I’ve gotten is that maybe it’s not as bad in Rio as the media has portrayed. We’re kind of being optimistic but also want to be as prepared as we can. ” In most known cases, Zika has caused flulike symptoms for a few days. But it has been blamed for a huge rise in Brazil of microcephaly, or babies born with abnormally small heads, and some cases of   syndrome, which can cause paralysis, usually temporarily. The virus is transmitted primarily by the Aedes aegypti mosquito, but there have also been cases in which Zika was transmitted sexually. The World Health Organization said this week that athletes and spectators, except for pregnant women, should feel comfortable attending the Olympics. Rio organizers will distribute 450, 000 condoms to athletes, three times as many as were handed out at the London Games in 2012, an increase largely in response to the Zika outbreak. Generally, for those who participate in sports in which the Olympics represent the ultimate achievement, the threat of Zika  —   or, for that matter, Rio’s polluted water, its propensity for random violence, its collapsing economy or its   politics  —   is not enough to keep them away. Several of those who have expressed reservations have been golfers, tennis players and basketball players. Stephen Curry, Russell Westbrook and James Harden are among the N. B. A. players to have opted out of the Olympics, although none cited Zika concerns as the reason. U. S. A. Volleyball officials said that no players expected to make the Olympic rosters, men or women, had suggested they might not attend. The beach volleyball player Kerri Walsh Jennings, a   gold medalist, said in an interview on Wednesday that she was not concerned, having been in Rio for a tournament in March. The threat of mosquitoes is expected to decline into August, which is the heart of the Brazilian winter. “I took my essential oils, I’m going to bring my Honest bug repellent, and I escaped all mosquito bites until the very last day,” Walsh Jennings said. “And I came home, and I didn’t get Zika. ” She said her three children would not go to Rio  —   not because of Zika concerns but because they were young and there was not a lot for them to do. April Ross, Walsh Jennings’s playing partner, said Zika was not a worry, but her agent, who is pregnant, is not planning to go to Rio. “You’ve got to be smart about it and take all the precautions you can, which we will,” said Ross, who is married. “And I plan on getting tested when we get back before we start trying to have a baby. If we have to wait, we’re going to wait. In my mind, there’s no point in necessarily worrying about it if there’s nothing you can really do. Take the precautions you can, and forget about it. ” That is why Speraw, the men’s indoor coach, is taking the   measure of freezing his sperm. His wife, Michelle, and their    daughter, Brooklyn, will not go to Rio because of concerns over Zika, he said. And an original   list of about 10 family members and friends has been whittled to just his parents. Speraw is not the only one freezing sperm. The British long jumper Greg Rutherford said he was, too, and the Spanish basketball player Pau Gasol said he was considering it. Speraw said the idea had bounced around among other United States coaches and officials and even some of his players, many of them married. “I’m doing it because I’m 44,” he said. “I don’t want to wait and try to have a baby when I’m 46, you know? If we want to try next February, which was our original plan, then at least we can still do that. ”'"}, "time": 1742563360.6469445}