{"duration": 0.21910953521728516, "input_args": {"text": "'At 10:45 p. m. on Monday night, in a   office above the Ed Sullivan Theater, Stephen Colbert was talking so rapidly that he might as well have been speaking in tongues. Gazing at a monitor, this host of “The Late Show” on CBS was rapidly reading through dozens of jokes that his writers had been composing throughout the first presidential debate between Donald J. Trump and Hillary Clinton. The goal: to trim     minutes from a monologue Mr. Colbert would be performing live in less than an hour. In phrases that may have sounded like requests but were really demands, Mr. Colbert called out to his team of producers: Could he get a video package of all the times Mr. Trump said “wrong”? Could they cut the word “terror” from the phrase “panic and   terror”? Could they shelve a   joke about “Interrupting Donald Trump” for another night? There was no time to   Mr. Colbert. “Unless there’s a clean hit they think is undeniable, the playground is closed,” he announced to the room at 10:48 p. m. Mr. Colbert and his colleagues were hoping to capitalize on the debate’s colossal viewership and help reverse the fortunes of “The Late Show,” which after a year on the air still trails Jimmy Fallon’s “Tonight Show” on NBC and has sometimes finished third behind ABC’s “Jimmy Kimmel Live!” The “Late Show” team was also trying to sustain the momentum from its live episodes during the Republican and Democratic National Conventions in July. In those two weeks, Mr. Colbert and his program showed a nimbleness and bite that he often exhibited on Comedy Central’s “The Colbert Report”  —   an improvement on his lumbering, uncertain first months on “The Late Show. ” Among other course corrections, Mr. Colbert has brought in a dedicated showrunner and he has addressed a longstanding identity crisis by reconciling with his   conservative   character from “The Colbert Report,” a version of whom he has dusted off and resumed playing. Now he has to imbue “The Late Show,” on any other night of the week when the future of the Republic is not hanging in the balance, with the same sense of immediacy that has propelled him in his live broadcasts. And he must still find the harmony between his trademark brand of pointed political commentary and the broader demands of a mainstream   talk show. When he started at CBS, Mr. Colbert said in an interview last week: “People were watching me learn to play a new instrument in public. Now I really don’t care and it’s so much more fun. “If I do things that are like the old show,” he continued, “it was a good show. ” Yet the   host is capable of doing something his famously arrogant alter ego never would: admit mistakes. He believes he has identified what he did wrong: cutting himself off from the persona, tone and formats that he established on Comedy Central, for fear that they would overshadow the authentic self that he wanted his CBS viewers to see. As Mr. Colbert said, riffing on a favorite Elvis Costello lyric, “I tried so hard to be myself that I kept on fading away. ” His realization is that he can embrace elements of “The Colbert Report” and still be himself. “It is all me,” he said. “Of course it’s me. I thought of the character. It’s my humor. ” He remains a highly   host, to judge from a Monday evening rehearsal at the Ed Sullivan Theater. As he ran through monologue jokes while bobbing back and forth on a   scooter, Mr. Colbert asked for    changes to graphics of Gennifer Flowers and the debate stage, and called out his bandleader, Jon Batiste, for    munching on veggie chips at his piano. (“Is there a glacier toppling into the Arctic Ocean?” Mr. Colbert asked.) Any time Mr. Colbert hit a line he wasn’t fond of, he would call out to the writers and producers in the theater, “Let’s beat that. ” If, a year ago, the assumption was that Mr. Colbert would simply glide into the time slot and theater last occupied by David Letterman and dominate the   landscape, that did not happen. For months, his “Late Show” never shook off its   jitters, nor established a breakout recurring comedy bit. Though his ratings saw a small spike, to about 2. 5 million viewers a night during the live convention episodes, they generally lag well below “The Tonight Show,” the category leader, which averages more than 3. 6 million. (According to preliminary ratings information on Tuesday, the   “Late Show” was Mr. Colbert’s strongest performance with      viewers since   and tied “The Tonight Show” in overnight metered markets.) Mr. Colbert acknowledged in the interview that he had taken on too much. Was it  —   “Hubris?” Mr. Colbert said before the question was finished. “Yeah. A little bit. You think you know what you’re doing, until you do something different. ” In April, “The Late Show” brought in Chris Licht, an executive producer of “CBS This Morning,” as a showrunner, a role that did not exist at that program. As Mr. Licht explained in an interview, his principal task is to “systematically remove things from Stephen’s plate. ” “Anything that doesn’t involve him thinking creatively and enjoying his performance  —   anything that gets in the way of that, I take,” he added. Mr. Licht has a vision, too, for “The Late Show” to stand out in a crowded field  —   “It’s us versus the Jimmys,” he said  —   and to make topical humor one of its defining features. “The Late Show” will do two more live episodes on Oct. 4 and Oct. 19, following the   and third presidential debates. That path became a little clearer over the summer, when Mr. Colbert’s postconvention episodes were lifted by comedy segments that went viral, like a sketch starring Laura Benanti as a pouting, plagiarizing Melania Trump and a blistering monologue from Jon Stewart, Mr. Colbert’s former boss at “The Daily Show,” criticizing the Fox News host Sean Hannity. (Mr. Stewart is also an executive producer of “The Late Show. ”) Mr. Colbert revived his old “Stephen Colbert” character, in a way (he says the original character is dead, and he is now playing that man’s identical twin cousin) and added a recurring segment called “Werd,” which is awfully similar to “The Word,” a segment on his previous show. (When asked what Comedy Central thought about him using material originally created for that network, Mr. Colbert said, “I have been advised not to answer your question. ” He smiled and added, “It’s funny ’cause it’s true. ” Comedy Central declined to comment.) There is no certain formula for sustaining this adrenaline from night to night, but Mr. Colbert said the solution rested on his being his   self, by “being gobsmacked by the news and walking out and going, ‘Can you”  —   here he restrained himself from saying a naughty word  —   “believe what this person just said? ’” At a time when Mr. Fallon has been widely criticized for his chummy treatment of Mr. Trump, Mr. Colbert’s unvarnished political perspective could prove crucial in distinguishing himself from his network competitors. Without commenting directly on Mr. Fallon’s program, Mr. Colbert said, “I’ve surrendered to my natural instincts, and to how I actually feel on a daily basis. ” Besides, Mr. Colbert felt sufficiently regretful about his own interview with Mr. Trump, at the start of his tenure on “The Late Show” in September 2015. “I tried being gracious and pointed at the same time, and got almost nothing out of him,” Mr. Colbert said. “It was actually boring, because he wouldn’t even look me in the eye. Being nice to a guy who isn’t nice to other people, it doesn’t serve you that much. ” Mr. Licht said that topical comedy should be the “bread and butter” of “The Late Show. ” But growing its audience means the show must reach beyond the   crowd that already tunes in for Mr. Colbert’s political satire, and that remains a work in progress. “You have to be as funny, as relevant and as entertaining on a night when there’s no news, as when you’re in the middle of the biggest story of the day,” Mr. Licht said. “That’s what we’re striving for. ” What Mr. Colbert said he had learned from his live shows is not to be precious about his material, and to favor timely responses instead of stale, overthought takes. “Leave nothing on the table,” he said. “Talk about it immediately. If it happens at 5 o’clock and the show tapes at 5:30, we will have it on the show. ” Mr. Colbert’s opening monologue on Monday was mostly cleansed of the jokes in the rehearsal, replaced with bits about Mr. Trump’s persistent sniffles and his frequent invocations of “law and order” and Mrs. Clinton’s state of readiness. (“My new nickname for her is Preparation H,” Mr. Colbert said. “It’s a compliment. ”) There was only one other topical comedy segment, a prepared sketch in which Mr. Colbert interviewed Rob Lowe, who played the character of an undecided voter. Still, Mr. Colbert indicated that he had learned some lessons about being open to future possibilities. As he said, only   about his approach to this broadcast, “I will do anything as long as I have enough time to read it through once. ”'"}, "time": 1742562049.7987568}