{"duration": 0.18954944610595703, "input_args": {"text": "'Updated: 11:50 p. m. The New York Times is driving to Friday’s inauguration with supporters of   Donald J. Trump. On Wednesday, we traveled with a woman from Massachusetts, the bluest state east of the Mississippi. On Thursday, we joined a man from West Virginia, the reddest state in the East. Dianna Ploss, 53, is a volunteer organizer for Mr. Trump, a turn of fate that surprised even her  —   a longtime Democrat who until recently was uninterested in politics. I am a national correspondent for The Times, originally from Granville, Mass. and I rode with a photographer in the back seat of a Dodge pickup driven by Dianna’s friend Scott Hayes, a landscaper. There was a cardboard cutout of Mr. Trump, too. Along the way, we talked about life, Mr. Trump and the future of America. We stopped at a McDonald’s, Cracker Barrel, Applebee’s and multiple rest areas. We listened to Abba, the Supremes, Fleetwood Mac, Cheryl Lynn and Obama. I got carsick. And   hours later, we made it to Washington. SABRINA TAVERNISE _____ GLOUCESTER, Mass. 10:27 a. m.: I just wrapped up a Facebook Live video introduction to Dianna and Scott, and we’re about to leave for the drive. For her part, Dianna spent the past year working tirelessly for Mr. Trump’s campaign, spending her own money and countless hours to get him elected. She was even a delegate at the Republican convention. She also lived for years in Cambridge, where Hillary Clinton won 88 percent of the vote. (Mr. Trump got 6 percent.) She has a rare ability to move back and forth between the two worlds. She has a lot to say about both. She had never really been that interested in politics. She grew up in Boston in the 1970s. Her dad worked as a school bus driver. Her mom raised four children and tended bar. “We were all Democrats back then,” she says. “Forty years later, we are all Republicans. ” Miles driven: 0. Miles to go: 470. _____ NEAR WORCESTER, Mass. 11:59 a. m.: It has started to snow. The truck’s windows are steaming up. Dianna is talking to people on the phone, trying to help them find a place to stay in Washington. The Airbnb she will be staying in there is filling up fast. Her phone is pinging with people talking to her on Facebook. It’s like a giant extended family all chattering at once. Her journey to this point has been quite a trip of its own. Dianna’s adult life happened suddenly and soon. She got pregnant as a freshman in high school  —   a Catholic school. She was afraid. She says she got through it by putting each part of her life in a different room and closing the door. At graduation, she was the student council president. She thought she should go to college, but now she had a daughter. She had an underachiever boyfriend. She had no money. And her family did not understand what college would get her. It took her 10 years to finish community college. She worked in a bank, painting houses, as a secretary in an   shop. In her   she decided to go to nursing school. She worked in cardiac surgery, in psychiatry, in urgent care. She did well, but she didn’t like it. What she really liked was volunteering. And organizing. She knew nothing about running, but became the director of a private track club, managing 25 coaches and 200 kids ages 8 to 14, and raising the money to support it. When she had the kids sell a coupon book with discounts from local businesses, it was the     the club had ever run. Miles driven: 71. Miles to go: 399. _____ CHARLTON, Mass. 12:26 p. m.: I am carsick. Scott spots a rest area and pulls in. Dianna buys me a Coke and even finds me generic   medicine in a store. “Here you go, honey,” she says kindly. “Sit down. You don’t look so good. ” I’m drinking a full sugar Coke, and my stomach is already starting to feel better. Miles driven: 83. Miles to go: 387. _____ STURBRIDGE, Mass. 12:47 p. m.: “Oh my God! You got to put this one in!” Dianna says, looking through a stack of CDs. “The Partridge Family?! Are you nuts?” says Scott. “I have Abba,” she says. “Neil Diamond. Chicago. Bee Gees. But I love the Partridge Family. ” Scott: “Oh boy. ” The music begins to play. “I woke up in love this morning. Went to sleep with you on my mind. ” “It’s a very complicated song,” she says, laughing. Miles driven: 92. Miles to go: 378. _____ NEAR HARTFORD, 1:07 p. m.: Dianna reads through some of the comments on the Facebook Live segment: Lots of angry shouting about Trump. Some of it about us. I ask Dianna how she feels. “Uncomfortable,” she says. As much as she is part of the Trump team, she tries to avoid alienating people. Maybe that comes from having lived in Cambridge. Maybe that comes from her personality as a networker. “I try to encourage people not to yell,” she says. “I had a little meeting with women who are part of the volunteer team. I said, ‘If our goal is getting people to go toward Trump, criticizing them isn’t the right way. It makes you look bad, too.’ ” “I don’t attack people personally,” she adds. “Except if I’m by myself and the TV is on. ” She pops an Abba album into the truck’s CD player. Miles driven: 126. Miles to go: 344. _____ WETHERSFIELD, Conn. 1:30 p. m.: I ask Dianna how someone who grew up a Democrat in Massachusetts could have wound up a Trump voter. Her move toward politics, she explains, was less a burning ideological expression and more an affinity for people, and for bringing them together. She was good at leading people, but the world was also changing. In 2015, she sold her house in Cambridge and quit nursing to focus on an invention that involves beverages. “I was living in my camper in Framingham in my friend’s yard,” she says. “They were liberal. Stuff was happening  —   San Bernardino, Paris. I’d think: I don’t know if I agree with them. ” When Mr. Trump announced his candidacy in 2015, she felt no sudden spark, she says. But his message steadily seeped in, like a   realization about herself and her beliefs: one she had always had, but had never really considered. “People were lying down everywhere,” she says, recalling protests about police violence. “They were lying down in Harvard Square. They were lying down on Route 93. They blocked traffic for three hours.   is a really congested road you want to pull your hair out anyway. To shut it down? What the hell is going on? What are these people doing?” At some point, she registered as a Republican. “I was trying to find out who I am in this whole crazy mess,” she says. “I feel like I had to take a stand. It was just crazy. I couldn’t understand it. ” Miles driven: 135. Miles to go: 335. _____ BERLIN, Conn. 1:37 p. m.: It has stopped raining. I ask Dianna how she came to like Mr. Trump. She says she did not take his candidacy seriously at first. “All I knew about him was that reality show,” she says. But when she tuned in, she realized he appealed to her. “I really liked Trump’s   thing. I grew up, I went to Catholic school. We did the Pledge of Allegiance every day. That was important. ” “I started to pay attention not to what he was saying, but to the effect that he had. The freedom of speech things. He said outrageous things but so what. People would get so worked up over outrageous things. ” “He was the tough guy. I like that he stood up for himself. He didn’t take any garbage from people. He retaught people how to have their  . He showed that you can stand up for yourself. ” Miles driven: 142. Miles to go: 328. _____ NORWALK, Conn. 2:53 p. m.: “Oh, they were not happy in there,” Dianna announces, emerging from a McDonald’s with Scott, the Trump cutout and a small bag of French fries. (I had been in the bathroom and missed the action.) “The guy behind the counter said, ‘We don’t do politics,’” Dianna reports. “I told him we just needed some fries. ” A woman in a puffy blue jacket sitting at the window bangs on the glass with her fist. Having caught our attention, she points her finger at the cardboard Trump and gives a deep   motion. We are standing in the parking lot, and two women walk briskly up to Dianna. “I love Mr. Trump, trust me,” says Lillia Millard, a retired translator who was born in Russia and now lives in West Norwalk. “He says it like it is, just like me. ” Dianna asks if she is going to watch the inauguration. “Yes!” she says enthusiastically. Her daughter, a journalist, will not. “She’s going to the women’s march, unfortunately,” Ms. Millard says, adding, “I still have until Saturday to talk her out of it. ” Scott gives her a   bumper sticker, and we pull back out onto the highway to the music of Grand Funk Railroad. Miles driven: 202. Miles to go: 268. _____ DARIEN, Conn. 3:26 p. m.: We are stopping again. The rest stop is all beige plastic and fake wood. A television is playing President Obama’s last news conference. It is barely audible under a thumping Stevie Nicks song. It is in the final minutes. “There are a lot more good people than bad in this country,” he says. Dianna says back: “Yeah. I agree with that. I do. ” He says that he curses more behind closed doors. “So do I,” Dianna says. He is talking about his daughters. He keeps going. He says he believes in this country. Dianna stops agreeing. “Do you believe he believes in this country?” I ask her. “No,” she replies. “I don’t believe that. ” I ask her why. “For all these years, people said all this stuff about him and I didn’t believe them,” she said. “But he has done so much to harm America. He basically tried to be Robin Hood. His trade policies. His willingness to try to take away from people who had more and give to those who had less. ” “The middle class shrunk, more people ended up at the bottom. That was as the result of him. Obamacare was a big part of this. Look how much money it costs me just for my health care. It didn’t make sense to me. It’s hard to know. Is it really what’s in his heart, or are his ideals getting in his way?” Miles driven: 207. Miles to go: 263. _____ Still in DARIEN, Conn. 4:33 p. m.: We’re eating spicy hummus and carrots at the Darien, Conn. rest stop. I am asking Dianna about Mr. Obama. She didn’t vote for him. But she defended him when her family or friends would attack him. Now, she is glad to see him go. Part of that is because of policing. “The first thing he said that struck me was when he said the Cambridge police acted stupidly,” she said, referring to Mr. Obama’s remark about the arrest of Henry Louis Gates Jr. a black Harvard professor, in 2009 as Mr. Gates tried to enter his own home. “When that comment came out, something in my head went, ‘Huh? ’” “Then he said, ‘Trayvon Martin could have been my son.’ Maybe that’s what he’s thinking, but when he says something like that as a leader, people listen. I had this like, ‘What?’ I was confused by that. What are you doing?” She added: “Things have changed in terms of the criminality. People will do anything. They are going up to cops and executing them. People are blowing themselves up. They are ramming trucks into things. If you alienate the police, then we are going to have no law and order. ” On Mr. Obama, she said: “When you are the leader, there are times when you have to bite your tongue. ” She added: “I feel the irony in that, because people will say Donald Trump doesn’t bite his tongue. I want to see how it plays out once he’s president. I don’t know the answer. ” Miles driven: 207. Miles to go: 263. _____ FORT LEE, N. J. 6 p. m.: We are back on   closer now to the end of our trip than to the beginning. The Supremes are playing our driver, Scott, is grateful that we are no longer listening to Abba. We have just crossed over the George Washington Bridge. I’m asking Dianna and Scott about immigration. For Scott, economics undergirds his thinking. Two friends used to give him a lot of landscaping work 10 or 15 years ago, but have since stopped they have Latin American employees now. Another client, who recently sold a company for millions, said he wanted to cut Scott’s rate to $20 an hour from $30 and asked him if he could learn Spanish to manage a work crew. “Fundamentally, it’s not fair,” he says. “I’m working seven days a week now so I can carry myself through the winter. They say Republicans want the cheaper labor and Democrats want the votes. But I think they both want cheaper labor. People with money just want cheaper labor. ” He says he does not blame the laborers, but is angry with politicians who talk as if it were not a problem. “If I was a poor person south of the border, I’d probably do the same thing,” he says. Scott, 58, who lives in Beverly, Mass. has led rafting trips in Texas on the Rio Grande for years. In 2010, he says, he was at the end of a rafting trip when he saw five people trying to cross the river. They appeared to be asking him to help them across. He kept going. Several months later, Janet Napolitano  —   then the secretary of homeland security  —   was nearby, in Laredo, Tex. and said the border had never been more secure. Scott says he did not believe her. “You lose your language, border and your culture, you’re going to lose your country,” he says, sounding one of the  ’s campaign themes. “Your country is done. ” Miles driven: 240. Miles to go: 230. _____ EAST WINDSOR, N. J. 6:57 p. m.: The car is silent. Dianna: “Do you like lobster?” Scott: “I like it, but it’s expensive. ” Dianna: “I just don’t like fighting with my food. ” Scott: “The only thing that’s really good is the tail. ” Dianna: “The only thing that’s really good is the butter. Anything tastes good dipped in butter. ” Miles driven: 296. Miles to go: 174. _____ MOUNT HOLLY, N. J. 7:38 p. m.  We pulled into a Cracker Barrel for dinner. Dianna had never been inside one. “O. K. there’s country music in the bathroom,” she said. “It smells nice  —   like candles or something. ” She surveys the store. She looks at a wall full of coffee mugs with names on them: Grandpa. Papa. Mom. “Look at all these cups. It’s spewing happiness. It’s like a quaint little town or something. ” We left because there was no table with an outlet near it for Dianna or me. Miles driven: 318. Miles to go: 152. _____ WESTAMPTON, N. J. 8:11 p. m.: We are waiting for dinner in an Applebee’s. I ask Dianna and Scott what they expect from Mr. Trump and if they are afraid he might disappoint them. “If he doesn’t deliver on the economy, I’ll be disappointed,” Scott says. “He says he’s going to change the tax rate for the middle class. That’s huge for me. I bought a house five years ago and the taxes have gone up $200 every single year. ” Scott doesn’t trusts the elites  —   entrenched politicians with money. “I don’t trust McCain, I don’t trust Rubio, I don’t trust Paul Ryan,” he says. “I love Trump for calling out the elites and the ruling class for who they are. Because they have forgotten about the working man and working woman. ” He is also suspicious of the term “comprehensive immigration reform. ” Dianna says: “Anytime a politician uses the word comprehensive, it makes you think they are lying. It’s just an empty word. Smoke and mirrors. They throw big words around, make it look like they are actually doing something. Makes people feel like, almost like they are not smart enough to understand what they are doing. ” She added, “I think Trump will deliver. ” Our dinner comes. Two shrimp salads and a burger. Miles driven: 319. Miles to go: 151. _____ NEW CASTLE, Del. 9:51 p. m.: We are getting sleepy. Another toll, this one for the Delaware Memorial Bridge. Scott thinks the sign says $400. “What! ?” Dianna says in mock shock. “Got to pay for that wall somehow. ” Everybody laughs. We pull up to the cash lane. An older woman in a wool hat, glasses and a yellow security vest hands us change. Holding up the Trump cardboard cutout, Dianna asks: “Do you know who this is?” The woman responds in a deadpan voice: “I’ve never seen him in my life. ” But when she is asked if she likes him, a smile creeps onto her face. “Thumbs up,” she says. Miles driven: 366. Miles to go: 104. _____ NEWARK, Del. 10:03 p. m.: It’s dark. Dinner’s over. Disco is playing: Cheryl Lynn’s “Got To Be Real. ” Dianna is driving to give Scott a rest. Cardboard Trump is still smirking in the back seat. “I’m getting out my bell bottoms,” says Scott drily. I sing for a while. Dianna does too. Then I ask about health care. “I spent probably $20, 000 on health care last year,” Dianna says. She was paying about $850 a month through a private plan she bought herself. But her deductible for    care jumped to $4, 500 from $3, 000.   she says, jumped to $3, 000 from $2, 000. Dianna, who has been living off the proceeds from the sale of her house in Cambridge, says she could have gotten insured through Obamacare last year, because she was not working. But she chose not to. “I said, Dianna, how can you go on food stamps and get free health care if you are volunteering for Trump? I thought it would be the wrong thing to do. ” But now she has Obamacare. She is helping to support her father, she explains, and her budget has gotten tight. “I don’t feel good that I had to do that,” she says. “I have more control over my life when I have better health insurance. It’s also about pride. ” Miles driven: 381. Miles to go: 89. _____ BALTIMORE, 10:50 p. m.: Hurtling through Maryland. Fleetwood Mac’s greatest hits playing, “Rhiannon” among them. Whatever happens with Mr. Trump, Scott Hayes has already won something important: a deep network of people who think like him. He has a flip phone. He is not on Facebook. But he believes he will hold on to those new connections. They have revived him. Made him feel more alive. “I always felt so alone, like nobody wanted to hear what I was saying,” he says. “So I’d go to these rallies just to see if there were other people who thought like I did. Now I’m meeting all kinds of people. It’s been awesome. ” Dianna wants to keep up the momentum with all the people she has met, too. Like the woman named May who owns a Chinese restaurant in Newton, Mass. and who went up to New Hampshire on Tuesdays with some of her staff to volunteer. Dianna organized a Christmas party for Trump supporters in Massachusetts in December. There was Champagne on every table. The cardboard cutout of Trump was there, too. “I’m relieved,” she says. “He won. I think he’s going to deliver. ” Miles driven: 427. Miles to go: 43. _____ WASHINGTON, 11:50 p. m.: We pull into the parking garage at Dianna’s Airbnb in southwest Washington, ride the elevator to the eighth floor, and walk into a spacious   with parquet floors. Scott holds cardboard Trump. There is a view of the Washington Monument. “Wow, it’s huge,” Dianna says, looking out a long glass sliding door. “This is, like, pretty fancy. ” Scott stands the   up. I ask the two of them how it feels to be at the end of this    journey. “It’s the end, but it’s the beginning,” Dianna says. “Now, it’s a new chapter in our lives, for the country, for Mr. Trump. Let’s see what he can do. ” Miles driven: 470. Miles to go: 0.'"}, "time": 1742628494.3714283}