{"duration": 0.10258054733276367, "input_args": {"text": "'Jewish Exodus From GOP Driving Rise of Neo-Con Left \\nEric Striker Daily Stormer October 27, 2016 \\nThe 2016 Presidential election has shown the worthlessness of wing labels, as MoveOn.org menopausals in fanny packs who opposed the Iraq war join hand in hand with the very Neo-Con Jews that planned it in an attempt to thwart the anti-war candidacy of Donald Trump. Well-funded think-tanks and NGOs speaking on behalf of discredited and dutifully misrepresented ideologies, from Catholicism to “ Human Rights ,” are tripping over one another to come up with a new and unique justification for an American clash with Russia and Iran over some Jihadists in the Syrian Civil War. \\nThe merge between the cultural Marxist Left and Zionist neo-liberal war mongering has been accelerating in intellectual spaces for the last few years now, and now the foil of Donald Trump, whose blunt and direct rhetoric offends the shallow Pavlovian sensibilities of Venti-sipping bespectacled “world citizen” bourgeois jizz bags, is cementing this disturbing amalgamation. \\nDarlings of the faux-dissident Left, like Michael Moore and hardline Jewish supremacist Bill Maher, have dropped all pretense of being renegade opponents of war and vulture-capitalism by taking money (Moore) or putting racial interests (Maher) ahead of any principles and seamlessly submerging themselves as transitory ambassadors and cogs in new Wall Street first, invade-the-world Democrat machine of Hillary [‘s Jew donors ]. \\nSomehow Donald Trump, the only candidate opposed to NAFTA and TPP, against reckless foreign interventions and regime-changing, who backs the closing of the carried interest loophole that allows investment banking firms to dodge massive amounts of taxes, who in his Gettysburg contract to the American people promised to bust bloated Zionist cartels like Comcast – is triggering the singularity of everyone from the Communist Party USA and the National Review. \\nThe message is clear: the liberal left is the humanitarian alibi for plutocratic money, while the conservative right employs moral preening and Christianity to manipulate public opinion. The only principle that unites both is the foaming at the mouth globalist hostility towards white working people of their (((patrons))) and (((intellectuals))), which supersedes everything else. This is why when push comes to shove, there is no meaningful difference between the left and the right. \\nThe Trumpian collapse of the “Reagan coalition” has made neo-con Jews flee the GOP. People like Jerry Falwell Jr. are realizing that the agreement to push Israel and “free” trade on their largely working class and rural followers in exchange for some socially conservative concessions has been a one way street, and are now beginning to practice a degree of autonomy clinging to Trump’s coattails. Jewish neo-cons like Jennifer Rubin have for years perceived red state protestants as corruptible rubes incapable of self-starting thought, and are now enraged that the Goyim are going their own way. \\nThey were right to a point, as the Bush era shows, but as these churches and institutions struggle to keep White people in their pews, they are beginning to reflect and adapt to the dreams and desires of the people they serve. The leading Jewish Republicans of America are looking for a new shell to crawl into, which is why most of them are advocating votes and support for Hillary Clinton. If Trump wins, they will certainly be migrating en masse to the Democratic party, and DNC Zionist plutocrats like Haim Saban will be anticipating them with open arms. \\nWe are already seeing this to an extent right now. For example, “Republican” Jew Robert Kagan has been a huge Hillary Clinton promoter, to the point where his wife, the Jew Victoria Nuland, is being eyed as a candidate for Secretary of State under a future Democratic administration. Malleable and obedient Clinton was lavished with praise Â during her stint as Secretary of State in anti-Trump Jew “conservative” Bill Kristol’s Weekly Standard. \\nThe Cancer of (((Post-Modernism))) Devours Its First Political Victim \\nEncapsulating the rising New-New-Left is the young Jewish millennial being groomed by the New York Times and other establishment Jew publications as a future globalist brain-trust cabal member,Â Milo Beckman. In an extended piece called “Don’t vote for Hillary Clinton because you have to–vote for her because she’s a true progressive ,” Beckman rationalizes Hillary’s love of pointless military interventions as a way for liberals to impose their values around the world, and says that progrssives ought to defer to Hillary wanting to kill millions of people because she has more credentials (modern Leftists believe credentials come before common sense): \\nOkay, letâ\\x80\\x99s talk about foreign policy. \\nSo why is she a hawk? \\nWell first, letâ\\x80\\x99s be clear: Itâ\\x80\\x99s very easy, and very damaging, to pretend that foreign policy can be divided into â\\x80\\x9chawkâ\\x80\\x9d and â\\x80\\x9cdoveâ\\x80\\x9dâ\\x80\\x8aâ\\x80\\x94â\\x80\\x8athat some people want more war and some people want less. Obviously, this isnâ\\x80\\x99t close to true. \\nAnd yet, point by point, Clinton has recommended more aggressive military action in a number of situations. Foreign Policy magazine identifies seven total examples: Haiti, Iraq, Pakistan, Afghanistan, Libya, bin Laden, and Syria. Why? \\n1) Hillary Clinton is a liberal transnationalist. She believes in the primacy of human rights, particularly of individuals against oppressive governments. She dreams of a future system where nations are encouraged to adhere to international norms by something like the UN on steroids. \\n2) Hillary Clinton believes in firm commitment to international agreements. The only way to bring about this future globalist order, the argument goes, is to honor our present commitments and compel others to do the same. \\n3) Hillary Clinton does not see inaction as morally distinct from action. As long as youâ\\x80\\x99ve factored in all costsâ\\x80\\x8aâ\\x80\\x94â\\x80\\x8ain lives, dollars, and potential long-term unintended consequencesâ\\x80\\x8aâ\\x80\\x94â\\x80\\x8ashe believes every viable course of action (including inaction) should be considered on its merits. As with domestic policy, she has little patience for non-interventionist ideologues. \\n4) Hillary Clinton equates military might with moral responsibility. In the end, she is a cold realist: Whoever has the biggest stick sets the agenda. By shirking international responsibilities, the United States transfers power to the next biggest stick. \\nIn this context, many of Clintonâ\\x80\\x99s â\\x80\\x9chawkishâ\\x80\\x9d decisions make a good deal of sense. Againâ\\x80\\x8aâ\\x80\\x94â\\x80\\x8aIâ\\x80\\x99m not saying I personally support the decisions, but I understand where sheâ\\x80\\x99s coming from. Itâ\\x80\\x99s not because she doesnâ\\x80\\x99t care about brown lives or doesnâ\\x80\\x99t understand that actions have consequences. \\nBut as relativist as I am, there are some things that I canâ\\x80\\x99t really argue with. Girls should be allowed an education. Governments shouldnâ\\x80\\x99t gas their citizens. We absolutely shouldnâ\\x80\\x99t expect to correct every infraction, but itâ\\x80\\x99s not exactly innocent to sit back and let Putin dictate what happens in Syria either. \\nAnd when it really comes down to it, I feel woefully unqualified to make these kinds of judgments. I always have to remind myself: Clinton is smarter than me, more knowledgeable and more experienced than me. I should absolutely voice my concerns when I have them, but I shouldnâ\\x80\\x99t pretend that this kind of reasoned disagreement is even close to disqualifying. \\nAnother manifestation of the New-New-Left is the gaslighting of journalist Michael Tracey. A number of liberal trolls on twitter and in the mainstream media have been bombarding guilty-by-association accusations against the once-respected leftist journalist for the horrible crime of… covering Wikileaks and accurately juxtaposing Trump and Hillary Clinton’s policies. \\nIn fact, the establishment mulattoes vying for a place in the NWO are working the “white privilege” angle hard on White Leftists who are hesitant about voting for the female George W. Bush. If you don’t vote for Hillary, it’s because you’re racist. There have been dozens of articles sighted to attack weak-willed White Sociology majors in this vein , looking to bully thoughtful left-leaning White people into supporting the borderless global capitalist status quo. \\nIn-house extreme Left-wing intellectuals like (((Noam Chomsky))) have endorsed Hillary, not to mention (((Bernie))).Â Their stance is clear: risking a third world war with Russia is a worthy risk if it means maintaining an uncontrolled flow of non-Whites to replace America’s majority population. Those Leftists who are smart enough not to get on the Hillary bandwagon have seen their solicitations to media appearances cut down to a trickle – see Cornel West’s last appearance on Real Time With Bill Maher to see what it looks like when they do get on. \\nWhile their snark and condescension assumes it’s only “right-wing” people who fall into line like sheep, the way the Left has reigned in its radical elements in an attempt to propel Hillary to victory is a testament to the incredible weakness of the “far-left”: it is trotted out when it supports a plutocratic agenda (non-White immigration, intervention in Syria, Ukraine or Libya, using fag “rights” and feminism as a geopolitical club to fan discord in Russia and Iran), then put back into the box once it achieves this goal (or in the case of former libertarian left Julian Assange, many leftists are hoping to put him in a casket). \\nA minority of genuine, authentic Marxists and Leftists notice that the mass media is giving Evan McMullin a titanic amount of undeserved publicity, while pretending Green Party’s Jill Stein is non-existent. Kooky Gary Johnson was at the beginning featured all over the place, but he too is fading into obscurity once polls registered him taking more votes from Hillary than Trump. \\nThe only choice in 2016, of the two major parties, is Donald Trump, whether you’re on the left or the right. The White labor left in states like Ohio and Pennsylvania will ignore their union bosses and vote for Trump. The new GOP is on the path of becoming an actual Worker’s Party, to quote Trump. Those who seek to contain the excesses of capitalism, globalization and foreign war (whether left or right) to any degree this election cycle should honestly weight the options – the choice becomes obvious. \\nThis isn’t about Left vs Right, it’s about Whites vs Jews. You can pick your own side, or go back to being used as a dupe, no different than those patriotards during the Bush era that liberals used to mock.'"}, "time": 1742628531.2180612}