{"duration": 0.05454421043395996, "input_args": {"text": "\"Pinterest \\nCrazy Uncle Joe Biden is at it again, and this time he said he’d like to fight Donald Trump “behind the gym.” Trump responded, “Some things in life you could really love doing,” according to the U.K. Daily Mail . \\nBiden, who usually has his hands full groping any women and children that are in his vicinity, got upset when asked about comments Trump made 11 years ago on tape about women. Creepy Uncle Joe got so upset when asked if he would like to debate Trump that he said that he wished he could go back to high school because he “could take him behind the gym.” \\nSide note: don’t go anywhere alone with creepy Uncle Joe, no matter how much candy he offers you. \\nIt seems like Biden’s comments were a skosh defensive, probably because unlike Trump, who just talked about being able to grope women who would be willing because of his star status, Biden is actually on camera groping women and children. \\nBut what does the media do? “Oh that’s just Uncle Joe, he’s harmless. Wait, just don’t sit on his lap, okay? Or get in his van. Isn’t he charming?” \\nTrump wasn’t too concerned about creepy Joe and his empty threats. At a rally in Florida on Tuesday, Trump responded to gropey Biden’s blowhard comments, courtesy of the U.K. Daily Mail: \\n“Did you see where Biden wants to ‘take me to the back of the barn.’ Me! He wants to – I’d love that. I’d love that. Mr. Tough Guy! You know, he’s Mr. Tough Guy,’ Trump boasted.” \\n“You know when he’s Mr. Tough Guy? When he’s standing behind a microphone by himself. That’s when he’s Mr. – \\n“He wants to bring me to the back of the barn. Ohhhh. Some things in life you could really love doing! \\n“And by the way,’ Trump vented, “if I’d said that? They’d say, ‘He’s violent! How could he have done that? How could he have?'” \\nYeah, I’m going to go out on a limb here and say that Trump isn’t too concerned about Biden, a man who gropes women — including elderly women — and little girls on camera and probably does so because even the elderly women and little girls could take him if they weren’t caught off guard by the lecherous vice president molesting them in public with cameras all around. \\nMaybe Biden should learn to keep his hands, feet and other objects to himself before he worries about Trump’s comments on tape 11 years ago about what consenting, adult women would hypothetically allow him to do.\""}, "time": 1742561838.0997167}