{"duration": 0.16854310035705566, "input_args": {"text": "'Welcome to Watching, The New York Times’s    guide. We comb through releases big and small, famous and esoteric, to email readers twice a week with our timely recommendations. Our most recent suggestions also appear below. To receive our guide straight to your inbox, sign up here. I love a cop show. I love a doctor show. But the quickest way to entice me is for a show to have a unique setting or premise. That’s partially why “UnReal,” set within a reality show, and “Mr. Robot,” set among hacker activists, excite me so much, or shows like “Six Feet Under” and “Party Down” stay with me  —   they created and define my image of a funeral home and of a catering company. (Er   …     respectively.) This week, I’m spotlighting three shows that are, in significant ways, not like every other show. “Greenleaf” does something we relatively rarely on TV: It depicts religiosity. (The show’s creator Craig Wright has a background in theology.) The stars and creators of “Blackstone” are indigenous people  —   rarer still. And the chilly drama “Thirteen” is oriented around grief rather than horror. Hooray for anyone forging new paths. That’s also why I find myself wishing for stranger shows, and imaging oddball settings. I want a   soap set in the world of figure skating! Or an anthology like “In Treatment,” but where everyone has the same piano teacher, instead of the same therapist. Or a “Parks and Recreation,” but serious. A girl can dream. Lots to watch this week, and I hope you’ll share your secret dream setting for a TV show with me and Team Watching: watching@nytimes. com. “Greenleaf,” Tuesday, 10 p. m. with two more episodes Wednesday from 9 p. m. to 11 p. m. OWN Watch if you like “everybody has a secret” ensemble shows, stories about modern American Christianity and unusual workplace settings. “Greenleaf” is set within a black megachurch in Memphis and focuses on the Greenleaf family who runs the church and the prodigal daughter who has just returned to the fold after the mysterious death of her sister. There’s some contrived dialogue, and not all of the performances are at the same level. But the show is worth sticking with, particularly if you like twisty family stories that involve decades of resentment. The standout of the series is Keith David, who plays the family patriarch and bishop of the church. The scenes in which he preaches work better than most actual religious services I have attended. The members of his family and congregation say goodbye to one another by saying “God is good” and responding “all the time. ” I wish “Greenleaf” was good all the time, and it’s not quite, but it’s good some of the time, and features neither cops nor vampires, so I’m in for now. “Thirteen,” Thursday, 10 p. m. BBC America Watch if you like spooky foreign   and care more about the journey than the destination. Ivy Moxam (Jodie Comer of “My Mad Fat Diary”) was kidnapped as a teenager 13 years ago. Now she’s back. But what happened to her while she was gone? This     is less focused on being a whodunit and more concerned with Ivy’s emotional state and the unbearable weight her loved ones have carried around. It’s reminiscent of the French series “Les Revenants” (which has a supernatural element, unlike “Thirteen”) and is much more on the uncanny side of scary than the horror side. “Blackstone,” Hulu  Watch if you like bleak, unglamorous and distinctive ensemble shows.  “Blackstone” is one of the flagship shows of Canada’s Aboriginal Peoples Television Network, where it made its debut in 2011. It’s set on a (fictional) Blackstone First Nation reserve, within an indigenous community challenged by corruption and desperation. The depths of that corruption start coming to light when Leona (Carmen Moore) wins the election to become the new chief, though her victory celebration is overshadowed by a teenager’s rape and suicide. In its earliest episodes, the series’ dialogue is   and the camera distractingly jumpy. But stick with it: The story is powerful enough to outweigh early shortcomings, and around Episode 5, the show blossoms into itself, and it’s well worth the wait. The first three seasons, with 23 total episodes, are currently on Hulu. (Seasons 4 and 5 have already aired in Canada.) • Monday: “The Fosters,” Season 4 premiere, 8 p. m. Freeform. Last season was not my favorite, but this show is so good that even its crummy episodes are better than other show’s good ones. • Tuesday: “The Greeks,” series premiere, 9 p. m. PBS. This is a   documentary series about ancient Greece, beginning with how cave people eventually formed societies. Thorough! • Wednesday: “Big Brother,” Season 18 premiere, 8 p. m. CBS. I hate “Big Brother,” but in my experience many otherwise   people secretly love it. I know you’re out there, Watchers. No judgment. • Thursday: “Queen of the South,” series premiere, 10 p. m. USA. Based on Arturo  ’s book “La Reina Del Sur” (already adapted as a popular Mexican show) “Queen” follows a Mexican drug queenpin who winds up fleeing to the United States. Some of it feels like other, tenser dramas, but the pilot has promise. • Friday: “Comedy Bang! Bang! ,” 11:30 p. m. IFC. Nathan Fielder, of “Nathan For You,” is the guest, so it’ll be a real bonanza of comedy oddness. Game of Thrones: This season’s penultimate episode  —   like those of many previous seasons  —   was  . The “Battle of the Bastards,” between the forces of Jon Snow and Ramsay Bolton, was a spectacle. As Jeremy Egner writes, “Whether you actually slept well Sunday night probably depends on your tolerance for blood, guts, dead giants and other hallmarks of grim medieval battle, as presented in the tense, grimy and at times oddly beautiful clash. ” More Game of Thrones: At Hitfix, Alan Sepinwall wonders why he was “so unmoved” by it all. “No show in TV history has ever done spectacle on this level, as consistently well as ‘Game of Thrones’ has,” he writes. “But the show at its best finds a way for the characterization to be as powerful as the visuals, and ‘Battle of the Bastards’ ultimately didn’t manage to surround all those stunning battle images with enough emotional meat to make it all worth it. ” Or try this Joanna Robinson piece at Vanity Fair about Sansa’s decisions in the episode. Outlander: “Game of Thrones” wasn’t the only show to allow its characters a measure of vengeance. “Mary and Claire get revenge,” Angelica Jade Bastién writes of Saturday’s episode of “Outlander,” “but the show doesn’t fully wrestle with what this means for either of them going forward. ” Veep: Eight episodes of Catherine standing in the corner with a video camera finally pays off. As Noel Murray writes, “Kissing Your Sister” is “an offbeat episode that both summarizes and comments on everything that’s happened so far in Season 5. It’s a conceptual tour de force  —   and, more important, it’s very, very funny. ” Silicon Valley: “This seems like an odd question to ponder nearly three full seasons into ‘Silicon Valley,’” Scott Tobias writes. “But it’s worth asking: What exactly is Pied Piper anyway?”'"}, "time": 1742563362.7510486}