{"duration": 0.1519031524658203, "input_args": {"text": "'Alternative News Project CDC SPIDER is the biggest medical whistleblower event in history \\nThe CDC SPIDER bites! CDC Whistleblowers Team Up and Demand “House Cleaning” and Lend Credence to Increasingly Critical Views of Authority Structures \\nWhile the mainstream media and medical/Big Pharma spokespeople were doing their best to ignore the raging conflagration that is the VAXXED phenomenon and pretend it isn’t happening, another major blow was just struck against the entrenched liars in politics claiming across-the-board “safety” and “zero risk” of vaccines ( see: Victorian Health Minister Jill Hennessy ). CDC whistleblower/confessor William Thompson – the primary subject of the VAXXED documentary – appears to have triggered somewhat of a whistleblower avalanche following his explosive confession that he and his superiors literally binned (yes, threw in the trash) hard evidence linking vaccines to autism, thus vindicating the work of numerous scientists around the world who have detected such causal connections. \\nThis most recent blow against such malfeasance and criminal conspiracy consists of a letter addressed to Chief of Staff Carmen Villa at the CDC and signed off on by a group of at least a dozen disenchanted/fed up CDC scientists identifying themselves as SPIDER (CDC Scientists Preserving Integrity, Diligence and Ethics in Research). \\nCDC SPIDER constitutes the biggest whistleblower event we’ve ever seen, bigger even than Thompson’s disturbing and compelling confession of conspiracy and coverup at the highest levels. The latest bombshell reveals (read: confirms once more) that the corruption and complicity are not anomalies, but entrenched systemic problems. \\nSPIDER’s August 29, 2016 plaintive demand opens with this extremely revealing paragraph (emphasis added): \\nWe are a group of scientists at CDC that are very concerned about the current state of ethics at our agency. It appears that our mission is being influenced and shaped by outside parties and rogue interests. It seems that our mission and Congressional intent for our agency is being circumvented by some of our leaders. What concerns us most, is that it is becoming the norm and not the rare exception. Some senior management officials at CDC are clearly aware and even condone these behaviors. Others see it and turn the other way. Some staff are intimidated and pressed to do things they know are not right. We have representatives from across the agency that witness this unacceptable behavior. It occurs at all levels and in all of our respective units…We are asking that you do your part to help clean up this house! \\nLet’s decode some key phrases: “Outside parties and rogue interests.” = Big Pharma and general corporate whores with connections to (or jobs in) these key agencies (CDC, AMA, etc.). It’s well known that there is a revolving door between massive pharmaceutical corporations and government agencies, such that “outside parties” tend to become “internal parties” and vice versa. The governmental arena has been thoroughly infiltrated by these “rogue interests,” to the extent that such interests control policy creation itself. “…becoming the norm and not the rare exception.” – Well, let’s be real: this problem became normative a long time ago. Their statement shows that ALL authoritative claims around health/medical issues/medical interventions made by authorities such as the CDC or AMA should be viewed with suspicion and investigated thoroughly instead of taken prima facie (at face value). In other words, CDC and other such government agencies lie… a lot. “Some senior management officials…even condone these behaviors.” – Because they are paid handsomely to sell humanity out to the highest bidder, whether Big Pharma, Coke, or what have you. Senior management condoning this activity creates a top-down systemic problem that poisons the entire barrel, so to speak. A strained climate of pressure to “go along to get along” ensues. The public’s suspicion of such agencies is thus well justified. “It occurs at all levels and in all of our respective units.” I.e., no part of the CDC apparatus remains untainted by this repugnant corruption ( See: William Thompson’s confession ). It is all-pervasive and, frankly, we have no reason at all to believe this problem is restricted – as if by magic – to just the CDC. Parallel government agencies with similar or related functions are just as compromised. Truth is a minor concern (or even just plain problematical) for these corrupt elements whose primary interest appears largely to be lining their pockets with a lot of cash. \\nThe SPIDER letter also outlines some other issues, including data manipulation by the National Center for Chronic Disease Prevention and Health Promotion in the Wise Woman Program in order to present misleading results to Congress (“to make the results look better than they were.”) As they said, “definitions were changed and data ‘cooked’” – now where have we heard about definitions being changed before? Ah, yes, POLIO (but that’s another scandal for another day). \\nSPIDER added: \\nAn “internal review” that involved staff across CDC occurred and its findings were essentially suppressed so media and/or Congressional staff would not become aware of the problems. \\nSPIDER also singled out Drs. Barbara Bowman and Michael Pratt for their “irregular (if not questionable) relationships with Coca\\xadCola and ILSI representatives. Neither of these relationships were necessary (or appropriate) to uphold our mission. Neither organization added any value to the good work and science already underway at CDC…It appears to us that something very strange is going on with Dr. Pratt…His behavior and that of management surrounding this is very troubling.” \\nCarey Gillam reported on the notorious Bowman and dubious Pratt (whose surname seems apt): \\nBowman, retired after revelations of what the complaint called an “irregular” relationship with Coca-Cola and the nonprofit corporate interest group set up by Coca-Cola called the International Life Sciences Institute (ILSI). Email communications obtained through Freedom of Information Act (FOIA) requests by USRTK revealed that in her CDC role, Bowman had been communicating regularly with – and offering guidance to – a leading Coca-Cola advocate seeking to influence world health authorities on sugar and beverage policy matters. \\nEmails also suggested that Pratt has a history of promoting and helping lead research funded by Coca-Cola while being employed by the CDC. Pratt also has been working closely with ILSI, which advocates for the agenda of beverage and food industries, emails obtained through FOIA showed. Several research papers co-written by Pratt were at least partly funded by Coca-Cola, and Pratt has received industry funding to attend industry-sponsored events and conferences. \\nIt’s all merely the tip of a corrupt and fetid iceberg, folks. \\nFinally, the CDC SPIDER letter closes with: \\nWhy has the CDC OD turned a blind eye to these things. The lack of respect for science and scientists that support CDC’s legacy is astonishing. Please do the right thing. Please be an agent of change. Respectfully, CDC Spider (CDC Scientists Preserving Integrity, Diligence and Ethics in Research) \\nRemember, fellow change agents: it is agencies such as the CDC, AMA, TGA, etc. that are orchestrating the war on natural/”complementary” medicine. It is these outlets that are enacting Big Pharma’s modern day Inquisition against natural healing and demonizing those modalities and their practitioners at every opportunity, employing the lap dog mainstream media to great effect. Simultaneously they engineer a cult-like mentality in the public at large, touting the unquestionable “benefits” of various mainstream interventions while aggressively discouraging any free thinking or critical analysis. Anyone who points out the well documented risks or harms resulting from said “wonderful” interventions is mocked and ostracised in the most juvenile form of groupthink imaginable. Welcome to 1984 , 2016 style. \\nBeware the players with the deepest pockets – they have the motive and the means for distorting collective reality and convincing millions of us that black is white and 2 + 2 = 5. \\nI’m pretty sure that 2 + 2 = 4, even when it’s not “PC,” and even when our government agencies and ministers insist the answer is “5.” \\nNot to worry – there are legal means of dealing with their mendacity and complicity. \\nThe truth will out. \\nThis article (“CDC SPIDER is the Biggest Medical Whistleblower Event in History”) is original copyrighted material belonging to Global Freedom Movement and may be re-posted freely in full, with proper (clickable) attribution, with all hyperlinks, author bio, and this copyright statement intact. Share: Rate:'"}, "time": 1742562903.213858}