{"duration": 0.03370094299316406, "input_args": {"text": "'  Donald J. Trump will not be sworn in for two more months, but as of next week, the big gold letters spelling out his name will be removed from three large apartment buildings on the Upper West Side of Manhattan, tenants were told on Tuesday. Hundreds of tenants at the buildings at 140, 160 and 180 Riverside Boulevard, which contain a total of 1, 325 apartments, signed a petition to “Dump the TRUMP name,” last month after Mr. Trump’s provocative campaign statements had offended women, immigrants and liberals on the Upper West Side. The buildings, between 66th and 69th Streets, along Riverside Boulevard, are owned not by Mr. Trump but by Equity Residential, a publicly traded company based in Chicago, which bought them in 2005 for $809 million. Mr. Trump, a Republican, had been involved in the development known at various times as Riverside South and Trump Place. Equity Residential kept the name Trump Place on the exterior of the buildings and on their letterhead, signage and uniforms. Tenants got a hint that change was afoot in late October when doormen told residents that they were being measured for new uniforms that would no longer bear the Trump name. Then, on Tuesday, they received an email from Mary Pawlisa, a senior regional manager for Equity. It read: “This week, the Trump Place building names will change to the street addresses  —   140, 160 and 180 Riverside Boulevard. The purpose of this change is to assume a neutral building identity that appeals to all current and future residents. ” Asked whether the      letters on the buildings had hurt the company’s ability to lease vacant apartments, Martin McKenna, Equity Residential’s vice president for investor and public relations, said: “I don’t have a comment on that. A more neutral identity going forward is the path we’re taking. ” Equity Residential’s portfolio consists of about 80, 000 apartments in New York, Boston, Seattle, Southern California and Washington  —   coincidentally all areas where Hillary Clinton, the Democratic presidential nominee, won a majority. Mr. McKenna preferred to describe those markets as “  gateway cities. ” Linda Gottlieb, a resident who started the petition, was elated. “We won,” Ms. Gottlieb, a film and television producer, said. “We used the power of protest to say that we don’t have to accept the spread of the man’s influence into our very homes. To me, it feels like a cleansing of the place where I live. ” But in an interview on Tuesday, Sam Zell, the chairman of Equity Residential, said, “The tenants had no role in this. ” Mr. Zell said he and “Don”  —   as he called Mr. Trump  —   had talked about it a year ago. “We didn’t want anything to happen while the election was going on,” he said. According to Mr. McKenna, Equity entered a “use of name contract” with the Trump Organization, which did not require it to pay Mr. Trump to use his name. That contract has now expired. Amanda Miller, vice president of marketing for the Trump Organization, issued a statement saying the change “was mutually agreed upon. ”'"}, "time": 1742628404.3126302}