{"duration": 0.032834768295288086, "input_args": {"text": "'Following Brexit, the UK will be in the “front seat” for a new trade deal with the U. S. under the Trump administration, senior Republicans have confirmed. [Senate Foreign Relations Committee Chairman Bob Corker made the declaration after meeting British Foreign Secretary Boris Johnson, who said he was confident the UK would be “first in line” for such a trade deal, the BBC reports.  The strong statements come after outgoing President Obama travelled to the UK during the European Union (EU) referendum campaign to threaten the British people that they would be at the “back of the queue” for a deal if the voted to Leave. Mr. Corker said Mr. Johnson knows “full well” that “there is no way the United Kingdom is going to take a back seat”. “They will take a front seat and I think it will be our priority to make sure that we deal with them on a trade agreement initially but in all respects in a way that demonstrates the   friendship that we’ve had for so long,” he said. . @BorisJohnson joins us in Washington to discuss   @realDonaldTrump and the future of the #SpecialRelationship. pic. twitter.   —   British Embassy (@UKinUSA) January 9, 2017,  “Clearly, the Trump    has a very exciting agenda of change,” Mr. Johnson added. “One thing that won’t change though is the closeness of the relationship between the U. S. and the UK. “We are the number two contributor to defence in NATO. We are America’s principal partner in working for global security and, of course, we are great campaigners for free trade. “We hear that we are first in line to do a great   deal with the United States. So, it’s going to be a very exciting year for both our countries. ” Mr. Johnson reportedly also met the  ’s    Jared Kushner and Trump’s Chief Strategist and Senior Counselor Stephen K. Bannon, who took a leave of absence as Breitbart’s Executive Chairman, in New York. During the presidential election campaign, Mr. Johnson was highly critical of Mr. Trump. He said Mr. Trump was “clearly out of his mind” accused him of “quite stupefying ignorance” that made him “unfit for office” and said he would not visit New York because of the “real risk of meeting Donald Trump”.'"}, "time": 1742628423.0552063}