{"duration": 0.4704468250274658, "input_args": {"text": "'Home / Badge Abuse / Leaked Soros Memo Reveals Potential Plan to Use Black Lives Matter to Federalize US Police Leaked Soros Memo Reveals Potential Plan to Use Black Lives Matter to Federalize US Police Matt Agorist August 31, 2016 97 Comments \\nMemos and documents published by DCLeaks continue shedding light on billionaire globalist George Soros and his progressive organization, Open Society Foundations (OSF). Due to their poor digital curation, however, the leaks are hard to comb through which is leading to the information slowly trickling out. The latest of the documents reveals the billionaire’s attempt to organize a “national movement” to create a federalized police force. \\nThe document shows that OSF saw the killings of Mike Brown, Eric Garner, Walter Scott, and Freddie Gray as an opportunity to implement this mission of federal police guidelines. OSF, according to the documents, then held a meeting titled, “Police Reform: How to Take Advantage of the Crisis of the Moment and Drive Long-Term Institutional Change in Police-Community Practice.” \\nThe memo further documents that Soros-financed groups and personalities influenced a Task Force on 21st Century Policing, created by President Obama. Last may, the task force released a final report consisting of 60 recommendations recommending protocol to local departments on how to modify policing practices. \\nThe information is from a 61-page report of an Open Society U.S. Programs Board Meeting that took place in New York City in May of last year. \\nStates the board meeting document: \\nThe federal government is seeking philanthropic support for a number of its initiatives. In addition to seeking support to advance the implementation of the recommendations of the Presidential Taskforce, the White House recently launched the Policing Data Initiative to explore how best to use data and technology to build trust, voice, and solutions to improve community policing. The Department of Justice recently selected the first six cities to host pilot sites for the National Initiative for Building Community Trust and Justice, which was launched last fall to help repair and strengthen the relationship between law enforcement and the communities they serve by exploring strategies intended to enhance procedural justice, reduce implicit bias, and support racial reconciliation. \\nWe are gaining a better understanding of these efforts in order to determine how best USP can use this moment to create a national movement. We have already had a set of preliminary conversations with about a dozen key stakeholders and will undertake a field scan to map the areas of work currently underway to advance police reform, including an assessment of the redundancies and gaps in work, and opportunities for collaboration. As we proceed, we will engage the funder network we helped to establish, the Executive Alliance on Men and Boys of Color, which now includes forty foundations. \\nU.S. Programs (USP) is a part of OSF with the stated mission of working to further a vibrant democratic society in which all people can meaningfully participate in its civic, economic, and political life. \\nAccording to the above excerpt, USP was thinking of ways to capitalize on police killings to ‘create a national movement’ to implement their agenda. \\nThe think tank also raises the question of how to properly steer the ostensible ‘grassroots’ organizations, such as Black Lives Matter, to achieve USP goals. \\nThe events of the past several months have understandably led to a wide range of activities, including a variety of advocacy efforts, to respond to the significant challenges in policing that have been exposed and the opportunity to promote meaningful and lasting change. For example, organized under the banner of the Civil Rights Coalition on Police Reform, organizations like the Lawyers’ Committee for Civil Rights Under the Law, LCCHR, and LDF are advocating for federal reform efforts with a particular emphasis on data collection and transparency and, as noted above, 35 effecting federal funding streams. A variety of other national advocacy organizations, including grantees Advancement Project, PolicyLink, the Center for Popular Democracy and the ACLU are working to provide advocates with toolkits and resources to help their organizing efforts. Locally based groups such as the Ohio Student Association, the Organization for Black Struggle, the Asian Law Caucus, and the ACLU of New Jersey, to name a few, are advocating for specific reforms at the city and state levels. Another layer of grassroots and youth-oriented groups like Freedom Side, Ferguson Action, Black Lives Matter and Million Hoodies Movement for Justice are also advocating for specific reforms. The range of efforts underway raises a number of questions and concerns about capacity, the need for coordination and the appropriate prioritization of policy objectives, among others, which we will discuss in the policing portion of the meeting. \\nWhile the intentions of reforming police in America seem noble, the very idea of a Soros-led initiative is chilling. \\nAnother memo, leaked earlier this month, showed the billionaire was potentially funding the Black Lives Matter movement , to the tune of $650,000. Now, as today’s memo shows, we know why. \\nAs the Free Thought Project has pointed out many times before, Soros has been exposed literally manipulating the world. \\nEarlier this month, in an email found within the WikiLeaks’ Hillary Clinton archive, with the subject ‘Unrest in Albania,’ Soros makes clear to Clinton that “two things need to be done urgently.” He then directs the Secretary of State to “bring the full weight of the international community to bear on Prime Minister Berisha” and “appoint a senior European official as mediator.” Revealing the influence he wields within the corridors of power, Soros then provides Secretary of State Clinton with three names from which to choose. Unsurprisingly, Clinton acquiesced and chose one of the officials recommended by Soros — Miroslav Lajcak. \\nThis is standard operating procedure for Soros. Anyone familiar with the history of the Soros Open Society Foundations in Eastern Europe and around the world since the late 1980s, will know that his supposedly philanthropic “democracy-building” projects in Poland, Russia, or Ukraine in the 1990s allowed Soros the businessman to literally plunder the former communist countries wealth, according to the New Eastern Outlook . \\nSoros-affiliated organizations are deeply connected to numerous color revolutions, such as the Arab Spring, and a number of other uprisings across the world. They have been intimately involved in the coup that took place in Ukraine, and subsequent ratcheting up of Cold War tensions with Russia. \\nAs these leaked memos and emails prove, the United States is nothing more than one of Soros’ pawns. \\nWhile Americans remain oblivious and argue over straw men fed to them by the mainstream media, the police state is growing — both here and abroad. As the citizens are promised ‘reform’ the only thing that actually changes are the puppets in marble buildings. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. <a class=”twitter-follow-button” href=”https://twitter.com/MattAgorist” data-show-count=”false” data-size=”large”>Follow @MattAgorist on Twitter</a> and now on <a href=”https://steemit.com/ Share Google + Real Truth stings \\nI think its time to end local policing for profit. The police force should exist to protect and serve, not to fill the county coffers. We need direct oversight of the police, the end of the power of their union to protect bad cops and the end of corrupt local government. The downside is the federal government is so big and spread out that they can barely keep track of our military assets. We can count on them to institute a public facing, qualifications search for candidates. Randy Pitts \\nDo you really not understand that what you just said is exactly what this article is exposing?!?!?! \\nSoros has indoctrinated you fools into favoring a federal police!!! Real Truth stings \\ndo you have a better idea? we have localized corruption in every state. if you have another way to achieve this, feel free to discuss it. billdeserthills \\nRight, mostly because obama has been doing everything he can to crap on the police. By your thinking the TSA is doing a fantastic job, huh? Real Truth stings \\nyou aren’t looking at the upsides that are possible. billdeserthills \\nBecause there are no ‘upsides’ except for upside yo head, when those even stupider federalized cops hit you pto \\nReplace local corruption with centralized corruption… At least now some places aren’t corrupt. billdeserthills \\nCitizen Oversight cole \\nSoris is not favoring a national police, he wabts rules and restrictions put on the police before we devolve into a police state, and we already half way there, he is funding BLM because they are at the forefront of bringing police misconduct to lightt, how do you people not see this. Razedbywolvs \\nI don’t like police misconduct. But i don’t burn down the city yelling kill the Jews to accomplish it. Tracy Lund \\nWhat a stupid thing to say. Razedbywolvs \\nDoes that make you pro burring down the city to stop the 1% who all happen to be Ashkenazi Jews? AZ Patriot \\nWhat are you talking about ? What do Jews have to do with this ? You and some other people are on this are now blaming the Jews for the mess we are in. How stupid Razedbywolvs \\nWell that kind of happens when you use a lobby’s to buy off every politician in a foreign country, and are a big contributing factor to what appears to be a 3000 year old blood feud in the ME. https://www.youtube.com/watch?v=0KMVhb57RqI AZ Patriot \\nTypical Jew hater there really is no hope for you or your soul . Why not worry about the people who are willing to blow you up ? Razedbywolvs \\nWould being opposed to a special interest group of Saudi buying off American politicians make me a Arab hater? Thats stupid. I don’t hate Jews but i really wounder how you all got brainwashed as bad as North Koreans. I really don’t think Israel has a problem blowing us up. They sure as hell don’t care about us enough to give a heads up when they know in advance that 2000 Americans are going to die. https://uploads.disquscdn.com/images/23bbf79b4dfbe4c1798c7f00e5225d1d41c1c799c58f13bea0dab4bae52b80fb.jpg https://uploads.disquscdn.com/images/da89e01c99866c5f96482293178464b32f339551dc8aec652bbd2d11c75d9b5b.png s AZ Patriot \\nSo you are one of those 9/11 crazies who believe the Jews knew about this and that the Bushes did this to get oil. I think you and that other loon Rosie O’Donnell make a one team of nuts Razedbywolvs \\nAre you one of those crazies that doesn’t believe official FBI documents? I figured you would of been trigged by the brainwashing comment. but you skipped right over it and pointed at one the few non Jews in Hollywood as the problem. You have to have a short list for that? especially since Rosie O’Donnell hasn’t been relevant for 15 years if ever. My tin foil hat is itching. The Immigrant Absorption Ministry.. I think your I.D.F. https://www.youtube.com/watch?v=8OyUoGUV7b8 AZ Patriot \\nThis tape means nothing and you havent shown any shred of FBI evidence. You are a crazy 9/11 loon Razedbywolvs \\nI guess the difference between loon’s and sane people is we read the dam reports. You should try it. AZ Patriot \\nYou read into things that arent there. Go away loser Razedbywolvs \\nGo away from were. Do you think im inside your computer or something? billdeserthills \\nSure cause soros is such an honorable guy, huh?? Why I bet you think he does this for the good of humanity, just so he can get that real special place in heaven that he so richly deserves, don’t You?? Prince \\nLocal police should not exist…period! steve yates \\nWho will protect us from the criminals? Prince \\nThe 2nd. Amendment. Jo \\nPrince- the second amendment doesn’t matter if there is no government and police to ENFORCE it. DUH….. Prince \\nDuh Jo, We The People enforce it with guns! Doodlee Pigvirus \\ncheck out 6 ideas for a cop-free world. Carolyn \\nI think you can make a list of crimes in one night that Chicago will commit just for a starter. Carolyn \\nMr Prince. When he gets robbed, assaulted in anyway, he wants to call Razedbywolvs to help him because no one else will. Get real. The constitution states that the States should govern themselves not let the government do it. Nishi \\nI have never been so naive as to think that smart and engaged people refrained from brainstorming solutions together according to their shared beliefs. Nor have I ever thought that would be a good idea. cole \\nTell this so called journalist that he can’t complain about Soros trying to change the direction of our police force before it turns into a police state, then at the end of the article try himself to tell us we need to be on the watchout for a police state shusei \\nright? there is no evil plan in these memos.. I don’t know much about Soros if he is evil guy or good guy, but, least I can say is this article is BS, and many people in here have no ability to read, understand and think… Prince \\nSomebody really needs to put a bullet in Soros’ head! Despicable REM1875 ✓certified \\nDon’t leave out his son. Greg Geitner \\nNow it’s easy to see why soros was paying them to act out Ricialove \\nAs a black woman, here’s what I want to know…with all that money that BLM receives….what the heck do they do?!?! anna miller \\nGeorge Soros is a criminal subversive who has created havoc on a global level and for a long time. His crimes are well-documented. He is the billonaire who “broke the British pound” in 1992. He is responsible for funding numerous revolutions including the coup in Ukraine, toppling a democratically elected president and moving NATO closer to Russian borders. And funding NGO’s who were not really charities, but subversive infiltrators. He is an evil man. Have you noticed how many billonaire Jews are involved in all kinds of evil financial schemes, and or hold such high positions in both neoliberal as well as neocon (both sides of the fence)government positions although they only make up 2% of the populace? Why hasn’t this criminal been arrested? His aim is to deliberately stir up a race war. The police are attacking people of all colors and ages. Yet BLM seems to defend black men who were in truth, guilty. At least they could pick a black man or woman who was actually innocent. Why doesn”t Black Lives Matter defend blacks who have been murdered by other blacks, which is usually the case. Or don’t those black lives matter? And how about the 72% of black children born to single mothers, with NO father in the home? Often to siblings from multiple fathers. These children often grow up to be street thugs. The facts bear this out. Blacks do commit most of the crime in the U.S, and commit more crimes against whites as well. The issue should be on the increasing police brutality on ALL citizens, not only focused on black lives. The police target them more because blacks commit most of the crime. Does the truth enter this equation? BLM detracts from the entire populace of all races focusing together, on increased police brutality against the public at large. For Soros, and those who want to increase anti-white sentiment and race tensions, BLM is: mission accomplished. The bastard Soros should have been arrested a long time ago, and imprisoned, and not in one of those cushy hotel prisons either. And one can only wonder who is really running this nation, when Soros remains unfettered. Dan \\nmaybe, just maybe Hitler saw something that the rest of the world still can not see…. (or simply refuses to see) AZ Patriot \\nWhat are you saying, all Jews should have been sent to the gas chamber so that Soros wouldnt be around ? Dan \\noh right, your one of “those” kinds of people huh.. next you are going to tell me that they really did make lampshades and soap out of jews huh? AZ Patriot \\nIf I were you, I wouldnt continue to show your ignorance, insensitivity and anti Jew sentiment. Go away Dan \\nim ignorant? bwahahah. heres an easy one for ya, whats 6 minus 3 ? Carolyn \\nIdiot must run in your family Carolyn \\nDan, you are an atheist who wants the world to believe that Hitler did not slaughter millions of Jews. Go to the Holocaust museums filled with the pictures and tools the Nazi’s used to experiment on the children pictures taken by the American soldiers when they entered into the prisons. So go into a Hellnory site and w her with your crap. Dan \\nso, explain to me how they had to change the plaque at auschwitz in the 90’s from claiming 4 million died there to only just over 1 million? and its now believed that its not even 1 million that died there? \\nand you dare to call me the idiot? keep googling, im sure you can find it… Carolyn \\nI did not call you an idiot but I should have. Auschwitz was only one of many concentration and death camps. You check it out. Dan \\nwow, you have shown your level of stupid on 2 levels in the one post, good work.. but i digress, ad hominems like yours only exist to show your own lack of a reasonable argument… \\nauschwitz was well known to have been by far the largest concentration camp during ww2 with the greatest population compared to all other camps, it even boasted a swimming pool inside the camp for its population. how do they just “lose” 3 million deaths from that camp? if auschwitz could not accomodate 4 million deaths but only closer to 1 million how did the other much smaller camps process more deaths than alschwitz? \\nnow, here is hte real kicker, from back in 1901 jews were already claiming the 6 million 4 decades into the future… its in the damn newspapers and you can freely search and find them for yourself… \\ncare to explain how that happened? jew magic i guess? https://uploads.disquscdn.com/images/ef1a9d677260b8a4a2ae4d4d3fe66946ef9deedfffe439b92a51c9f1774787bf.jpg Carolyn \\nDan did you read any of the small incomplete articles? Evidently not. 6M was quoted to show that Russia and other countries had that many Jews. Nothing about death. These prior years to 1938 were expressing the plight of how the Jewish people were being treated. Now Auschwitz was not the only camp that slaughtered Jews. Now does that sign specifically say that Auschwitz deaths were just Auschwitz murders? Your ‘damn newspapers’ need to be read by you before you put that smudge attitude in writing. Dan \\nwow, your brain really is broken huh? you cant see the connection between claiming the magical 6 million prophecy (which is actually about claiming the heartland) in 1900 and using that same exact figure in the lies about ww2? the same lies that the nazis also made lampshades and soap out of jews? \\nauschwitz plaque was obviously blatantly lying (just like the lampshades and soap myths), once the soviets were forced to give up the ledgers iirc in the 80’s it was obvious that they could no longer sustain the lie that 4 million were killed there and were forced to bring that number down to “about” 1.5 million. are you really that stupid that you can not see the pattern here? \\nthere is a hell of a lot more but i get the feeling that im talking to someone to stupid to even grasp the basics. \\nfun fact: anne frank never wrote anne franks diary, otto bought the story from another novelist and changed it to reflect his daughter. there was even a recent copyright case where they are now claiming that he was the author. fun times. Carolyn \\nOh I see your pattern. Believe that crap instead of what the pictures, written accounts by the liberation armies, and you did not answer my question on the articles you want to point to that does not say 6M Jews died. Did you pull all of the articles and read the whole story? I would bet you did not. You are a typical atheist, Marxist, Democrat. You can pound your chest again when you check history and find out that the Democraps started the KKK group and were the biggest slave owners. You people amaze me how you put crap out there that you can not back up. Kind of like your loving candidate Hellnory. Dan \\nshow me a single picture of gassed jews? or even of the gas chambers themselves? or even the several thousand dead jews they would have to have piled up waiting for their several hours in the crematorium it actually took back then to cremate even a single body? or you mean i am meant to take the word of the proven lying jews who to this day, like in the video i linked above, have clung to their fantasies even after they have been busted lying? \\nas for the liberating armies, you do recall that all the “gas chambers” were in ruins when they came through? and there was zero evidence, besides the lamp shades and soap, of any jew holocaust? that account you mean? \\nand of course it dosnt say that 6 million died yet, only that they were in peril etc but you dont find it a mighty large coincidence? you also obviously have no idea how they came up with the 6 million at the end of ww2 do you? go find out where that number came from.. the person who made it up even claimed it was completely symbolic and not to be taken literally. \\n“You are a typical atheist, Marxist, Democrat.” and in the face of clear defeat, out with the mindless ad hominem once again. a clear indicator that you are way outside of your depth… you are incorrect on all 3 counts, once again. do you ever get anything right? \\n“were the biggest slave owners.” guess who the biggest slave owners were? fucking jews!!! hahaha. they owned all the slave ships and were behind every facet of the trade. \\n“Kind of like your loving candidate Hellnory.” and thats the funniest, go find my twitter feed, its full of anti hillary sentiment, in fact its the only reason i really began using twitter was during this election cycle to keep track of whats going on because i refuse to engage in the corrupt leftist media (once again, mostly jew owned) for fear of turning into a brainless zombie like yourself… \\nill give you this tho, you certainly are persistent in your stupidity. its no wonder you cant see anything thats going on around you in this world. Dan \\nhere is a great classic you really should watch about his explaining away his lies as not really lies… https://www.youtube.com/watch?v=j30sWIOMIak Carolyn \\nYou really have a real talent referencing things. Dan \\nyea, this is how you learn things. you take a fairytale, lets use santa as an example, and you work out (when your like 6 years old)… how can there be 12 santas in the same place? why are my presents always in the bottom of my parents wardrobe a week before “santa” apparently brings them to you a week later? and slowly you deduce that there is no santa clause and its just a lie that you have been fed while your brain is all still mushy. \\nor you know, you can just blindly have “faith” that there is still a santa, you know, like you do… even in the face of such a mountain of evidence… Carolyn \\nYou need to stop your atheistic info because you do not know what you are talking about. 1.1M Jews killed in all of the Auschwitz camps. Did you know that there were 3 large camps with 4 large crematoriums? No you did not. That is just a drop in the bucket places that murdered, experimented on, starved, gased, and shooting of Jews. 426K Hungary, 300K Poland, 69K France, 60K Netherlands, 55K Greece, 46K Boheman & Moravia, 27K Slovakia, 25K Belgium, 10K Yugoslavia, 8K Itally, 690 Norway, and 34K from other countries. 960K Jews, 74K Poles, 21K Gypsies, 15K Soviet prisoners, 15K Czecks, Yugoslavs, French, Germans. Did you know that Hitler had built 40,000 camps. Death camps, concentration camps, holding camps, gas camp vans, labor camps and detention camps. Many Jews died in ghettos, on trains, during the death march to evade the oncoming of the Russian Army and US forces. These camps were set up in France, Russia, Germany, Poland, and Austria. One of the camps, Berkenau, killed 6 thousand Jews per day. In total 2.7M Jews killed in killing centers and 3.3 Jews shot, gased, experimented on. Now how do you explain your decision to not believe these totals? Dan \\nof course i knew, i obviously know more about the subject than you do. like you i came from a place of believing the lies until i started questioning some of the “facts” i was taught and the advent of the internet and “survivors” videos where they constantly get busted telling lies made me reconsider the “truth” about ww2 \\nactually current scholars beleive its somewhere between 300k and i think its 700k (it might be 800k) died in all of auschwitz. while i do not doubt that there was some experimenting (america was doing the same thing but on its own people at the time) the great majority were simply natural attrition in a time of war considering the “allies” were bombing supply lines constantly (yet never the camps themselves because they also knew they were not “death camps”) in fact lets invoke the story of the holocaust poster child again anne frank, if they were really gassing people in some huge manner why would they even keep around a weak sickly girl long enough for her to die from typhus? \\nand yes of course many PEOPLE died, many of them jews. thats what happens when you have wars. none of this supports gassing or mass extermination of jews, stupid. \\nbut my final question is, how do you blindly believe the word of people who have been shown on many occasions to be liars? specially in the face of so much verifiable evidence to the contrary (IE the lampshades, soap, diesel gassing vans, eye witness stories that completely contradict everything etc) specially knowing the fact that many jews chose to escape with their german captors rather than await the soviet armys “rescue”? Carolyn \\nOf course you did not know any of the information I wrote. If you profess that you know how many died, then go on the Holocaust Site and you will see that after they checked the records that the Germans kept, you do know they tattooed the Jews, to make sure what numbers were dead or alive. How would I know why they kept Anne Franks till she died of typhus. They very cruel people. The Jews were at war with the Nazi Germans. What the hell are you talking about. If you go on the Site you will see pictures of the gas chambers and crematories. What the hell else do you want. Why don’t you go to Auschwitz and see for yourself? You are so bigoted and I believe you are a lousy Democrap. Despicable REM1875 ✓certified \\nHitler has the rothschild and other bank roll him while killing off the poor and middle class Jews who hardly dominate their own street block let alone the world. As a true socialist he had the pragmatic double standards so many on the left have today. AZ Patriot \\nYou are painting all Jews with a very broad brush. No all Jews, not all billionaire Jews are involved in evil schemes. Stop it. Despicable REM1875 ✓certified \\nsoros is to Jew as kerry, kaine, biden, pilosi or kennedy is to Roman Catholic. soros is to Jew like ryan or beck are to conservative Or and a better example soros is to Jew like oblamer is to Christian. anna miller \\nYes, all these people have one thing in common, they claim connection to the evil Hebrew Yahweh , the tyrannical Iron Age war- volcano god. Happy is the one who seizes your infants and dashes them against the rocks. Just another evil scripture found in your not so “holy” book. Psalm 137:9 Stop making excuses for evil! Despicable REM1875 ✓certified \\nHowdy Anna I an sorry I didn’t make myself clear – I was stating none of those people are believing Jews or Christians . They believe they are God. anna miller \\nThey have no humility nor conscience. Tatiana Covington'"}, "time": 1742562050.6702392}