{"duration": 0.042046308517456055, "input_args": {"text": "' Pick a Peacemaker By Suzy Kassem November 08, 2016 \" Information Clearing House \" - To vastly improve your country and truly make it great again, start by choosing a better leader. Do not let the media or the establishment make you pick from the people they choose, but instead choose from those they do not pick. Pick a leader from among the people who is heart-driven, one who identifies with the common man on the street and understands what the country needs on every level. Do not pick a leader who is only money-driven and does not understand or identify with the common man, but only what corporations need on every level.\\nPick a peacemaker. One who unites, not divides. A cultured leader who supports the arts and true freedom of speech, not censorship. Pick a leader who will not only bail out banks and airlines, but also families from losing their homes -- or jobs due to their companies moving to other countries. Pick a leader who will fund schools, not limit spending on education and allow libraries to close. Pick a leader who chooses diplomacy over war. An honest broker in foreign relations. A leader with integrity, one who says what they mean, keeps their word and does not lie to their people. Pick a leader who is strong and confident, yet humble. Intelligent, but not sly. A leader who encourages diversity, not racism. One who understands the needs of the farmer, the teacher, the doctor, and the environmentalist -- not only the banker, the oil tycoon, the weapons developer, or the insurance and pharmaceutical lobbyist.\\nPick a leader who will keep jobs in your country by offering companies incentives to hire only within their borders, not one who allows corporations to outsource jobs for cheaper labor when there is a national employment crisis. Choose a leader who will invest in building bridges, not walls. Books, not weapons. Morality, not corruption. Intellectualism and wisdom, not ignorance. Stability, not fear and terror. Peace, not chaos. Love, not hate. Convergence, not segregation. Tolerance, not discrimination. Fairness, not hypocrisy. Substance, not superficiality. Character, not immaturity. Transparency, not secrecy. Justice, not lawlessness. Environmental improvement and preservation, not destruction. Truth, not lies.\\nMost importantly, a great leader must serve the best interests of the people first, not those of multinational corporations. Human life should never be sacrificed for monetary profit. There are no exceptions. In addition, a leader should always be open to criticism, not silencing dissent. Any leader who does not tolerate criticism from the public is afraid of their dirty hands to be revealed under heavy light. And such a leader is dangerous, because they only feel secure in the darkness. Only a leader who is free from corruption welcomes scrutiny; for scrutiny allows a good leader to be an even greater leader.\\nAnd lastly, pick a leader who will make their citizens proud. One who will stir the hearts of the people, so that the sons and daughters of a given nation strive to emulate their leader\\'s greatness. Only then will a nation be truly great, when a leader inspires and produces citizens worthy of becoming future leaders, honorable decision makers and peacemakers. And in these times, a great leader must be extremely brave. Their leadership must be steered only by their conscience, not a bribe.\\x94\\n- Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem'"}, "time": 1742562187.6097105}