{"duration": 0.0857388973236084, "input_args": {"text": "'Longtime radio host and Fox News personality Alan Colmes passed away at the age of 66. Fox News’s official Twitter account posted the message confirming the sad news of Colmes’ passing on Thursday morning. [Fox News Channel’s Alan Colmes Dies at Age 66 https:  .  pic. twitter.   —   Fox News (@FoxNews) February 23, 2017,   Host Bill Hemmer interrupted programming on America’s Newsroom and updated viewers of Colmes’ passing. The network also aired a touching tribute narrated by Fox News Channel host Sean Hannity, who   with Colmes the   political debate show Hannity  Colmes from October 7, 1996 to January 9, 2009.  In a statement to Fox News, Hannity called Alan Colmes “one of life’s most decent, kind and wonderful people you’d ever want to meet. ” “When Alan and I started ‘Hannity  Colmes,’ there wasn’t a day that went by where we didn’t say we were the two most fortunate men in all of television,” said Hannity. Colmes, an outspoken liberal Democrat and host of the nationally syndicated radio show, The Alan Colmes Show, is survived by his wife, Jocelyn Crowley, who issued the following statement: Alan Colmes passed away this morning after a brief illness. He was   . He leaves his adoring and devoted wife, Jocelyn Elise Crowley. He was a great guy, brilliant, hysterical, and moral. He was fiercely loyal, and the only thing he loved more than his work was his life with Jocelyn. He will be missed. The family has asked for privacy during this very difficult time. Despite their polar opposite political views, Hannity said he and Colmes “forged a deep friendship. ” “Alan, in the midst of great sickness and illness, showed the single greatest amount of courage I’ve ever seen,” Hannity added. As news of his passing spread across the internet, friends and longtime colleagues of Colmes took to social media to offer their condolences and kind words. So sad to hear of the death of Fox News colleague Alan Colmes. He and I agreed on little, but I liked him immensely. Good guy. R. I. P.  —   Brit Hume (@brithume) February 23, 2017,  WHAT? @AlanColmes passed away? ????  Noooooooooooo!  Very sad.  He was a good guy.  Always surprised people that way. https:  .   —   Ann Coulter (@AnnCoulter) February 23, 2017,  Very sad to report our friend and colleague @AlanColmes has passed away.  —   Shannon Bream (@ShannonBream) February 23, 2017,  Shocked to hear of the passing of Alan Colmes. Thanks for providing great perspective on the stories of the day.  —   Mike Tobin (@MikeTobinFox) February 23, 2017,  I can tell you tears r flowing @FoxBusiness @FoxNews right now. We are all devastated by the loss of kind soul @AlanColmes may god bless RIP,  —   Liz Claman (@LizClaman) February 23, 2017,  Alan Colmes was an incredibly talented media personality but he was also my friend  a mentor. Saying he will be missed is an understatement.  —   dianafalzone (@dianafalzone) February 23, 2017,  Whoa. Alan Colmes died. We sparred a bunch, but decent guy. RIP.  —   Jonah Goldberg (@JonahNRO) February 23, 2017,  Deeply saddened to hear of the passing of my @foxnews colleague @alancolmes. A very nice, genuine man I had the pleasure to work with.  —   Meghan McCain (@MeghanMcCain) February 23, 2017,  I’m heartbroken. @AlanColmes was my fellow liberal colleague at Fox News. I admired his tenacious work ethic. He was a good man. RIP Alan.  —   Tamara Holder (@tamaraholder) February 23, 2017,  Former Fox News stars Megan Kelly and Greta Van Susteren shared their condolences on social media. Heartbroken my friend Alan Colmes has died. He lit up the FNC halls   kindness  humor. Incredibly positive force. Prayers 4 his family.  —   Megyn Kelly (@megynkelly) February 23, 2017,  Alan Colmes was always a gentleman  …    always kind  …    a wonderful colleague. pic. twitter.   —   Greta Van Susteren (@greta) February 23, 2017,  Colmes’ death comes less than a week after the passing of Fox News Channel’s Brenda Buttner, who died at age 55 following a battle with cancer. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564431.1810899}