{"duration": 0.05297493934631348, "input_args": {"text": "'Comments \\nConsultant Jesse Benton of the pro-Trump Great America Super PAC was just caught on camera admitting that he and his associates have been conducting a voter suppression campaign targeting African-Americans and women. \\n“In Cleveland, if we can return Hillary to normal turnout levels … we can turn her to regular turnout levels she’s gonna lose about 60,000 votes in that area – that’s dead heat. So we have a voter suppression campaign quite frankly, targeting African-Americans, and sort of suburban moms, just bad stuff about Hillary, just trying to take their taste for her away.” \\nBenton is the same Trump operative who was convicted of purchasing the vote of an Iowa state Senator and was recently busted attempting to funnel $2 million in illegal donations from a Chinese donor who turned out to be an undercover Telegraph reporter. \\nThe Donald Trump campaign has been accusing anybody who dares to speak against them – the Clinton campaign, the media, polling organizations – of “rigging” the election against them. But time and time again it’s been obvious that the Republican Party has been the one behind the scenes working to disenfranchis e the American voter – especially non-white, male voters . \\nSince the Republicans can’t win this game, they have elected to change the rules instead, by passing restrictive voter ID laws that disenfranchise a large number of voters – especially minorities – from exercising their right to vote, closing down polling stations. \\nThey justify this in an underhanded appeal to “protecting the integrity” of our democracy by waving the imaginary specter of “voter fraud” over the nation’s head. This is an entirely manufactured crisis that does not exist, but has been used to deprive thousands of potential Democratic voters of their rights. The Republican Party is an enemy of American democracy, and we must punish them for it at the ballot box. \\nWatch it here:'"}, "time": 1742561733.3103123}