{"duration": 0.2439136505126953, "input_args": {"text": "'Oregon Live – by Maxine Bernstein \\nA federal jury on Thursday found Ammon Bundy, his brother Ryan Bundy and five co-defendants not guilty of conspiring to prevent federal employees from doing their jobs through intimidation, threat or force during the 41-day occupation of the Malheur National Wildlife Refuge. \\nThe Bundy brothers and occupiers Jeff Banta and David Fry also were found not guilty of having guns in a federal facility. Kenneth Medenbach was found not guilty of stealing government property, and a hung jury was declared on Ryan Bundy’s charge of theft of FBI surveillance cameras. \\n“More than we could have hoped for,” said one of Ammon Bundy’s lawyers, J. Morgan Philpot. \\n“Stunning,” said defense lawyer Lisa Ludwig, who was standby counsel for Ryan Bundy. \\n“I’m just thrilled,” said Neil Wampler’s attorney Lisa Maxfield. \\nThe jury of nine women and three men returned the verdicts after five hours of deliberations on Thursday in the high-profile case that riveted the state and drew national and international attention to the federal bird sanctuary in rural eastern Oregon. \\nEach defendant stood separately, facing the jury, as the judge read the verdicts. Ammon Bundy, his hands clasped behind his back, nodded as the “not guilty” verdicts were read for him first. As he sat, he smiled and rubbed the shoulder of his lawyer, Marcus Mumford. \\nHis older brother Ryan Bundy stood. As his “not guilty” verdicts were read, he nodded, and mouthed to the jury, “Thank you.” Defendant Neil Wampler hugged and kissed his defense lawyer, Maxfield. \\nThe coda to the stunning verdict, undoubtedly a significant blow to federal prosecutors, was when Ammon Bundy’s lawyer Marcus Mumford argued that his client, dressed in a gray suit and white dress shirt, should be allowed to walk out of the court, a free man. \\nU.S. District Judge Anna J. Brown told him that there was a U.S. Marshal’s hold on him from a pending federal indictment in Nevada. \\nOregon Standoff defendant Jeff Banta is relieved by acquittals \\n“If there’s a detainer, show me,” Mumford stood, arguing before the judge. \\nSuddenly, a group of about six U.S. Marshals surrounded Mumford at his defense table. The judge directed them to move back but moments later, the marshals grabbed on to him. \\n“What are you doing?” Mumford yelled, as he struggled and was taken down to the floor. \\nAs deputy marshals yelled, “Stop resisting,” the judge demanded, “Everybody out of the courtroom now!” \\nMumford was taken into custody, a member of his legal team confirmed. \\nAmmon Bundy’s lawyer J. Morgan Philpot, said afterwards on the courthouse steps that Mumford had been arrested and marshals had used a stun gun, or Taser, on his back. Another member of Ammon Bundy’s legal team Rick Koerber, echoed Philpot, saying he heard Mumford questioning in court why they were using a Taser against him. \\nPhilpot decried the marshals’ treatment of Mumford in the courtroom. “What happened at the end is symbolic of the improper use of force by the federal government,” he said. \\nBy 6:30 p.m., Mumford was released from custody. He confirmed that he was struck with a stun gun once while he was on the floor of the courtroom. \\n“I grew up on a dairy farm, so am I used to some rough treatment, sure?” he said. But he said the actions of the U.S. marshals were uncalled for. \\n“All I was asking for was papers. Just show me you have the authority to take Mr. Bundy into custody.” \\nAs to the verdict, “Very pleased, very gratified. This jury was dedicated. They listened to our case.” \\nJust after the verdicts were announced, people emerged onto the front steps of the courthouse to tell a crowd of media and onlookers. \\nSupporters of the defendants gathered in a joyous hug. One of them, Brand Thornton of Las Vegas, one of the original occupiers who accompanied Ryan Bundy and others onto the refuge on Jan. 2 and was called as witness by the defense, said that he has been at the trial since Oct. 2. \\nThe verdict “means everything,” Thornton said. It’s huge for ranchers and land rights within Harney County and across the West, he said. \\n“We did something peaceful and wanted to stay peaceful,” said Thornton, who has kept vigil outside the courthouse, blowing a shofar. \\n“This is for the people of Oregon,” Thornton said. “This was never for us.” \\nWampler appeared on the courthouse steps and described the verdict as a “stunning victory for rural America.” \\nDavid Fry’s lawyer Per C. Olson said, “It was the right result.” \\n“I think the jury saw through this that they were well-meaning, well-intentioned individuals,” Olson said. The jury saw that the defendants cared about the Hammonds and didn’t like how the federal government was treating them. \\nMaxfield, who represented Wampler, came out of the courthouse, holding up her fists. She said she has never seen “anything like this happen,” where multiple defendants in a federal court trial were all acquitted, and called it one of the most significant cases in her career. \\nDefendant Shawna Cox said she had a “peaceful feeling,” as she waited for the verdicts, “but I didn’t expect we’d all be found not guilty.” \\n“I wept,” Cox said. “It brings me to tears. I’m so grateful to the jury.” \\nDefense lawyer Matthew Schindler, standby counsel to defendant Kenneth Medenbach who was excused from court because of medical ailments, said he called his client right away. \\n“He’s been fighting for more than 20 years to be in a situation where a jury acquitted him,” Schindler said. “It’s vindication.” \\nSchindler said he believes the jury’s verdicts resulted from the difficulty the government had in proving that the “intent” of the defendants was to conspire against the U.S. Fish and Wildlife Service and U.S. Bureau of Land Management. \\n“The judge gave us broad ability to bring in a defendant’s state of mind and what you saw was a number of defendants who each had their own motivations,” Schindler said. \\nWhen prosecuting a drug conspiracy, it’s easy to point to what the defendants’ underlying objective is. But in this case, Schindler said, there was “no obvious underlying self interest.” He said the defense also was bolstered because the jurors came from different regions from the state, and not just from Portland. \\nOregon U.S. Attorney Billy Williams sat in the back of the courtroom with Oregon’s FBI Special Agent in Charge Gregg Bretzing as the verdicts were read. Williams left the courtroom early, before the scrum with Mumford, to attend a gathering of the League of Minority Voters in Salem Thursday night. \\nHarney County Sheriff Dave Ward, who was the face of law enforcement during the 41-day refuge takeover, said in a statement, “While I am disappointed in the outcome, I believe our form of government and justice system to be the best in the world. These folks were tried in a court of law and found not guilty by a jury of their peers. This is our system, and I stand by it.” \\nThe five-week trial offered a rare display: Three of the seven defendants chose to represent themselves. Five of them were among the more than 80 people who took the witness stand to testify. \\nAnd one of the original 12 jurors was dismissed after a fellow juror raised concerns about his impartiality four days into an initial round of deliberations – what the judge called an “extraordinary circumstance.” An alternate juror was summoned to begin a new round of deliberations with the remaining 11 jurors Thursday morning. \\nThere was heightened security in and around the courthouse throughout the trial, with security officers ordered to wear bulletproof vests, and metal detectors set up outside the main trial courtroom and an overflow room with a live video feed of the proceedings. \\nOften, supporters knelt in prayer in the courthouse corridor before the trial began in the mornings, and some kept vigil across the street, with one fellow occupier blowing a ram’s horn, or shofar, as the jury deliberated. \\nPENDING PROSECUTIONS \\nThe seven on trial were among 26 people indicted on the conspiracy charge. \\nEleven of them pleaded guilty to the conspiracy charge. \\nSeven others are set for trial on Feb. 14, but their cases may be affected by the verdicts. If convictions are handed down in this case, then defendants scheduled for trial in February might consider potential pleas. If there are acquittals, prosecutors may rethink going to trial on same charges against co-defendants next year. \\nOn the eve of jury selection in this case, prosecutors agreed to dismiss the conspiracy charge against Pete Santilli, an independent broadcaster and self-described “shock jock,” who provided live stream footage of the occupation. \\nNEVADA CASE \\nAmmon Bundy and Ryan Bundy also face prosecution in Nevada in the 2014 standoff with federal agents over the impounding of their father’s cattle near Bunkerville, Nevada. \\nThe trial there is set to start Feb. 6. The two brothers and father Cliven Bundy are among 19 indicted in Nevada. Others from the Oregon refuge occupation also indicted on federal charges in Nevada are Pete Santilli, Ryan Payne, Brian Cavalier, Blaine Cooper and Joseph O’Shaughnessy. \\nPayne pleaded guilty to the federal conspiracy charge in Oregon under a potential global agreement that was in the works with Nevada prosecutors, but he recently asked to withdraw the Oregon plea because no deal was reached in Nevada. Prosecutors in Portland have until Oct. 31 to respond. \\nCooper entered guilty pleas in both cases. O’Shaughnessy pleaded guilty in the Oregon case, with a deal pending in Nevada. Cavalier pleaded guilty in the Oregon case. \\n— Maxine Bernstein'"}, "time": 1742561629.9688632}