{"duration": 0.03404068946838379, "input_args": {"text": "'Louder With Crowder October 27, 2016 \\nSometimes a thin layer of crust accumulates on the surface of the ocean, mostly made up of fecal matter and trash. It’s where environmentalists come from. \\nThey are, effectively, the pits. Also, environmentalists hate people (see Top 5 Environmentalists Who Openly Support Killing Off Humans ). A side effect of being sad, soggy little bottom dwellers. So it’s no surprise they want to kill off coal mines in Montana , despite the fact that said coal mines are pillars which help support the economy and the town’s well being. Also electric cars , but whatever: \\nThe 2,300 residents in Southeast Montana face an uphill battle to keep the city alive against an onslaught of legal battles and a major anti-coal crusade launched by outsiders. \\nAn out of court agreement was reached to close two of the four units of Colstrip’s coal-fired power plant by 2022. The Sierra Club and the Montana Environmental Information Center, which sued the plant, see the closure as a victory. \\nPlant operators came to an agreement with activists [because] Oregon Democratic Gov. signed legislation mandating the state be coal-free by 2030… \\nConsequences. \\nIt’s a win for everybody. Except the people employed by the coal plant… Also, Colstrip’s entire economy. Coal plant workers make money, then spend that money at other businesses. Except now all those lads will be jobless, which means they won’t be spending money or helping to boost the economy as much anymore, which means other businesses will suffer. Thanks environmentalists. \\nBy the way, “Green Earth” SJWs tend to also be fans of the Indians . The people, not the baseball team. Racist. That wee tidbit is worth noting, considering how their eco-friendly plan isn’t very native-friendly… \\n“You lose two of those units, and you are shutting down half the town,” Small said. “This closure will have an economic impact on the reservations, throughout the County and across the State…” Small is of North Cheyenne descent. He’s made an extra effort to recruit American Indian students… Nearly three dozen Northern Cheyenne work at the Colstrip plant, and three times that figure work in the coal fields. \\nA double header. Bad for the economy, bad for the indigenous people. \\nAs mentioned above, the coal plant never stood a chance. Thanks to impending regulations, the plant has long seen the end drawing near. Possibly because they would rather close indefinitely in order to be spared from ever having to hear another squawking lobbyist attempt to “talk” them into seeing things their way. Whatever the reason, environmentalists and the state teamed up to bully the coal plant into shutting down. Now the future of an entire town lies in jeopardy. \\nEnvironmentalists happily stomped their cloven hooves all over people’s livelihoods. But hey, less smog. #Caring \\nAlso, man–made climate change of the hot hots is a myth. Stop it. This article was posted: Thursday, October 27, 2016 at 5:55 am Share this article'"}, "time": 1742564415.6293716}