{"duration": 0.059556007385253906, "input_args": {"text": "'Singer and TV personality Nick Cannon doubled down on his criticism of Planned Parenthood, saying the abortion provider was designed to “exterminate” black people. [“When you talked about Margaret Sanger, all the people who follow eugenics. It was all about cleansing,” the America’s Got Talent host said of Planned Parenthood’s founder in a recent interview with DJ Vlad.  “Margaret Sanger said that she wanted to exterminate the negro race, and that she was going to use her organization as she founded to do so,” Cannon continued. “It was more about the sterilization and where it comes to actual ethnic cleansing  —   where they actually said we want to get rid of a class of people a group of people. “  percent of them are all in the hood. ” “They like to label ‘ ’ or ‘’ that’s what they used in public. In private, they were talking about the black community,” Cannon said.  The      says the issue of abortion is more personal than political. “I’m   because my mother did go to an abortion clinic to abort me,” he said. “I don’t feel like the government should have the right. I don’t feel like any organization that makes money should have the right to tell a woman what she can or cannot do with her body. ” Cannon says while Planned Parenthood  —   like the government  —   does some good things, it should be held accountable for “all the negative things. ” Last month, Cannon accused Planned Parenthood of committing “real genocide” on black Americans. “Hillary was sneaking and cheating,” Cannon said in an interview with “The Breakfast Club” radio show. “Think about all the stuff they did with Planned Parenthood and all that type of stuff. That type of stuff is to take our community  —   and forget gentrification, it’s real genocide, and it’s been like that for years. ”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742564587.4083433}