{"duration": 1.074453592300415, "input_args": {"text": "'BALTIMORE 2016 Bill the eighth \\nThis guy is real genius isn’t he? He is too stupid to realize all of those tweeter posts and Youtube videos are going to come back and bit him in the rear? Oh well, he will have plenty of time to think about his stupidity while he sits in a jail cell. doodaa \\nWould you hire this guy? Lancifer Wildwood \\nYou don’t need a job when soros the nazi funds you….geesh I don’t even live in the US and I know that! Koolz \\nJews created Black Lives matter and these guys get paid pretty well for there acting up at any protest. Black Lives Matter the very name creates violence. Purple lives Matter Hunter \\nBingo!!! \\nYou know, I wonder if / when “somebody in the know”, were to release nasty-jew George Soro’s travel itinerary…to the “right people”… \\n…hey Georgie…watch-out…payback can be a BITCH Zone43 \\n50 Rabbis marched with them in Ferguson. owr \\nJews are truly racist. M Saurette \\nso, the plan is to be more violent, more racist, more destructive. And the goal is to have blacks NOT be targeted by police? Good luck with that. owr \\nIt won’t just be the police targeting rioting blacks.The average white is ready fearfully cautious of black thugs. The thugs know this and they try to intimidate whites by flaunting theirs MTV image of the ‘Gangsta’ by learning the right facial expressions, and wearing their pants on their ass. Stacking gang signs, even if not in a gang to appear knowledgeable about such things. It might work with some of the girls, but to the average young white male it is perceived as a potential threat. The primary difference between white males and black males is that only 30%, on average, black males are not convicted felons, and cannot legally possess a firearm. On the other hand nearly 80% of white males have no felony conviction, and can, or do possess legal firearms. Blacks are 13% of our population. Whites are a little under 70%. There are also a huge number of pissed off white veterans of Vietnam, Bosnia, Iraq, and Afghanistan, who would not mind a little domestic house cleaning. You can bet your ass, and not be afraid of losing it, that these Vets are Trump supporters. Be careful what you wish for. The real world is not MTV, or a gangsta movie. Cornczech \\nThis morning on my walk to the Howard Redline stop in the Rogers Park neighborhood in Chicago, IL…..I was called out to by a black woman: “Hey, F* YOU, White B#tch!” The sad part, because I had to stop acting and looking scared a few years back when I first MOVED to this hood, (sometime after Obama became King), is that I am USED to this kind of thing, so I started to giggle after that outburst…yes, the abuse got worse …but…I get this at least once a week when I walk to the store, to the EL….to the bank……so (shrug). \\nI have never called a black man or woman a nigger…(I bet I get blasted or removed or censored for that…but I get called whitey, hillbilly…(I’m a Cracker, let’s get THAT straight!), and a myriad of other race specific names…..I have even been assaulted for being white and standing up for myself…(I am a female, by the way….so, I have OTHER stories about my lovely experience living in CHICAGO…the next Detroit….) \\nSo how am I a racist? I grew up in Texas and never had problems or saw violence..or had violence perpetrated against me…..since I came here… \\nSo tell me again how I am a racist? \\nMy LAST question is: WHEN DID AMERICA come to such a SAD STATE? owr \\nMy suggestion is to get out of Chicago, it will be a pure hell-hole in the coming depression. Go back to Texas, the economy is much better there, and race relations are as well. Ted Dura \\noh joy Trump to dump 40 million mexicans and open season on rioting niggas–See its True ! \\nTRUMP WILL MAKE AMERICA GREAT AGAIN !! Guillotine_ready \\nWhy wait? Burn your houses down now!! doodaa \\nAnd your liquer store! GORDON \\nSheesh can we all just get along , we’ve seen how well having a black president worked out ? Thank God I live where it’s cold and the black populous is to a minimal ! Thank God all you do is kill each other anyway ! \\nWill the HUMAN RACE ever grow up? Sheesh! This is so stupid. Does a Siamese cat hate the Prussian Blue because it’s a different ‘breed’? Does and Irish Setter hate the Black Lab because. . . \\nMan, people are the most un-evolved, unreasonable. . . doodaa \\nUnfortunately, this has been going on since humans became self aware. Will we ever evolve? Not in our genes. Jo Peter \\nActually the ‘good fences make good neighbors’ tendency toward self segregation followed by more or less peaceful voluntary trade appears more or less universal, and it’s only the radical liberal cultural Marxism nonesense that is making this unworkable in the west (and this is mostly to blame on the mechanations of one particular tribe that’s ‘white’ when it benefits them but who hold no actual allegiance to the white race, we all know who they are.) doodaa \\nDo you think maybe “GOD” knew what he was doing when he segregated races by continents? Jo Peter \\nThat is certainly a valid way to look at it. Some people view the order of the universe as through an impersonal ‘nature’ force, and others consider it a conscious design by an intelligent creator. In the end there is little practical difference when it comes to the specifics like this, since either way it worked before we broke it. \\nWell, some of us are OK. I’ve dated outside my race, and I miss my buds of the past who I spent time with who weren’t fellow ‘honky-gringo-crackers’. fujak \\ntypical….blacks want democracy but only if and when it suits them woody \\nThis country needs a good cleansing, bring it on brotha! Bruce Regael \\nWe need LA Riots everywhere with police standing down. I’d love for them to bring the riots to the nice white liberal neighborhoods where those agent provocateurs riling up minorities always tend to hide after they fan the flames. If anyone needs to pay its white liberals. They’ve been playing puppet master for far too long using racial politics against conservative white people. \\nTime is coming where we’re going to have to put the boots to their throats or force the minorities to kick their teeth in. doodaa \\nBlack folks will be OK. There is no bag limit on dumb niggers. Jo Peter \\nIndeed. The ones that long ago accepted the cultural superiority of the west are allies. They can’t choose what genes they’re born with but they can side with good against radical liberal insanity. doodaa Zaphod Braden \\nAMEN !!! Sanders was born and raised in the New York City borough of Brooklyn and graduated from the University of CHICAGO in 1964. While a student, he was an active civil rights protest organizer for the CONGRESS OF RACIAL EQUALITY and STUDENT (not really)NONVIOLENT COORDINATING COMMITTEE. Bernie ran to Vermont in 1968, to get away from BLACKS to raise HIS family in SAFETY Sanders switched PARTIES, BETRAYED the Veterans, and instigates the Blacks and then RUNS AWAY. In January 1962, Sanders led a rally at the University of Chicago administration building to protest university president George Wells Beadle’s segregated campus housing policy. “We feel it is an intolerable situation when Negro and white students of the university cannot live together in university-owned apartments,” Sanders said at the protest. But then Sanders ran to SAFE LILLY WHITE VERMONT to raise HIS children far away from those Blacks he wants you to live with. doodaa Cindyejohnson1 “my .friend’s mate Is getting 98$. HOURLY. on the internet.”…. two days ago new Mc.Laren. F1 bought after earning 18,512$,,,this was my previous month’s paycheck ,and-a little over, 17k$ Last month ..3\\x81-5\\x81 \\x81h\\x81/r \\x81o\\x81\\x81f \\x81w\\x81o\\x81r\\x81\\x81k \\x81a days ..with extra open doors & weekly. paychecks.. it’s realy the easiest work I have ever Do.. I Joined This 7 months ago and now making over 87$, p/h.Learn. More right Here o!507 http://GlobalSuperEmploymentVacanciesReportsWorld/GetPaid/98$hourly …. .❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦:❖:❦ o!507………. Jones \\nThis is the classic ” lets get dumb ass to do the dirty work for us” trick. This dude is being played by the same people who will drop his ass on the street when theyre done with him. Inciting race wars and turning people against each other. This dude is a total looser. The only rapping he should do is with some tape around his flappy mouth. Someone give this dude a hug and ask him if hes making the world a better place by being a dick. Jolly Roger \\nThis moron is just a tool, paid by rich people to incite racial tensions, with the usual hollow threats designed to intimidate white people as part of their ongoing divide-and-conquer agenda. \\n“We don’t want to work. We don’t want to go to school. We demand to be handed everything we want, and if we don’t get it, we’ll attack white people.” \\nShut up, you idiot, and go back to your zoo. \\nNo intelligent debate. No civilized discussion. Just a gang of RACIST thugs trying to intimidate people based on their skin color. Tell me more about “equality”. \\nI hate to participate, or even respond to a racist tirade, but these Soros-funded useful idiots may make it necessary. Just be ready to mow ’em down along with the wetbacks, just in case they make that necessary. doodaa \\nNigga’ just might get his ass shot. L Garou \\nIs that an admission of retardation, or shall we produce his test scores to prove it? doodaa \\nI thought all lives mattered until this dumb nigger started talking. Now I wonder. owr \\nThey are being programmed by George Soros to be agent provocateurs to create racial tension to allow for martial law to occur in order to keep the establishment as is. Clinton will insure this if elected. 8s5s5 \\nTo help payoff my student-loans I worked as a NYC teacher in “troubled” neighborhoods for ten years. During those ten years I saw delinquents call each other “niggas” hundreds of times every single school day. If I had done it once, I would have been fired that same day. They punched each other, stole from each other, and from the faculty, vandalized the school, threw brand new text books out the window but the state and federal funds continued to pour in, very much contrary to popular belief. \\nThey actually got more money then the nicer areas. When I was finally able to move to a “good” school district, I couldn’t believe it. When I told the children (99% Caucasians) to take a a book and read quietly they actually did it. No exaggeration, you good actually hear your own respiration, that’s how quiet it was!!! And yes, you can find some schools with 95-99% white student population. I was never a “racist” but this was too much. The difference is incredible!!! Unfortunately if you notice a obvious behavioral difference between races, you are labeled as some kind of a bad person and the general public has learned to accept this word “racist” as derogatory regardless of the evidences that may exist, and we all know that they do exist. This denial has successfully forced illogical integration, the destruction of our liberty and country and the rise of economic fascist billionaires. Donald Trump, the only billionaire to go against is fellow elites is being completely typecast as “the rich white guy that must be a racist.” He is probably the one and only chance the middle class and the poor class will ever see again for justice in this country. The last man to have had his courage was President JFK. owr \\nTo actually be a nigger, one must learn to be one. They have plenty of role models to copy. It’s a matter of choice. nobody \\nLol… what a dumb ass! It’ll be a hoot watching video of these “tough” guys(gals?) getting their butts whomped after they destroy mostly their own slums, and if we’re lucky a few other choice places. desertspeaks \\n“we will incite riots everywhere if trump wins” translation, we know if trump wins, we’ll have to get jobs to pay rent, food etc. and being societal parasites, we don’t want actual jobs, just free shit! owr \\nCulture is learned in the home, and in school. “Granny was on total entitlements, so was momma, so is sista, so is my daddy where-ever and who-ever he is. So why I has ta lern all this white shit in school, I quit when I’m 16 and be worken the streets, the man..he be givn me food-stamps evey month that I can sell fo beer and cigarettes. Man, we got it fucken made.” Zone43 \\nThey will stay in the cities, cry baby’s. Strayhorse \\nWhat government really fears is when other than people of color, were to take to the streets. That’s why the government and the controlled media hide the truth about crime, racist crime perpetrated against other than people of color. When other than people of color awakens to the truth about crimes against them, L.A., Ferguson, and riots of their kind would pale against the response levied against the government for allowing the crimes against other than people of color to continue as it does today. The Civil Rights Act of 1964 DOES NOT offer any protection for other than people of color. That’s NOT was it was passed for! Other than people of color have NO federal or state protections against prejudice, injustice and inequality. nightwisp \\nThe 14th amendment and the civil rights act of 1964 made their rights equal to the white man. If the white man is gone, they are equal to nothing. They will have no rights. owr \\nWe are all slaves to the corporations, debt slaves. owr \\nThat is precisely why the libs began the fake and un-natural PC agenda, to erode the 1st amendment. Raymond McGraw \\nYou are surely as you called it…“NIGGA’S.Does not make a hill of difference who.what where or why.You were just born to riot.You have failed to look at the true one who has enlslaved you the last 8 years in the liberals and there government.Now you have become pawns working for them.Of course you have not realized that either.When the true one wins this and he will. You can then say Gee! Mr .Trump wished I had listened to you. D Urge \\nHe’s right WE have been too nice. \\nTRUMP 2016 Lancifer Wildwood \\nI’m not sure this person of colour knows what he/they (whatever the frick) are up against if it comes down to it? The inner city shit holes they are seemingly incapable of building up into prospering neighbourhoods are NOT the rest of the US from my travels there. nightwisp \\n* YAWN * please pass the popcorn… Josephine Dorion \\nNO, THE WHITES AIN’T SCAYRED OF YAH. BE PREPARED TO BE EXTERMINATED. Ed Troyer \\nI see bulldozers, flame throwers…. jake \\nwow, doesn’t this show how clueless, americans trully are. almost makes one want to tell the trump campaign how to beat the voting fix. where are these guys and gals going to wreak havoc? in the cities where unarmed gay and mainly democrats live, black people, spanish, and poor people in general. poop where you eat, that is a controlled serf. show how your an oreo banker slave. when you get to the rural areas, the black, white, and spanish, rural people will be waiting. you won’t stand a chance, against the unified rural people. after following the banking oversears orders, to destroy yourself and your families based on unknown fears, do you think you’ll be going to valhalla, for following the bloodcults, marching orders, to divide and conquer. killing people who don’t have any more say than yourself, because a banker said it was so, priceless. Michael \\nThat would be instant death for the 3/5th’s, 14th amendment black United States citizens. This country was created by old white men to protect the white race. This is why the Jewish run media are promoting the blacks to riot. In fact black folks if your going to go after a group you might want to think about going after the Jews in the media. As they’re the one’s that have set you up to fail. Here’s a sweet piece of history the majority of the Negroes don’t know. Israel Cohen, the General Secretary of the World Zionist Organization, in his 1912 book “A racial program for the 20th Century”. And, read into the Congressional Record by Congressman Thomas Abernathy, U.S. House of Representatives Mississippi, 4th District on June 7, 1957, Volume 103, top of page 8559: Israel Cohen penned “We must realize that our party’s most powerful weapon is racial tension. By propounding into the consciousness of the dark races that for centuries they have been oppressed by the whites, we can mould them to the program of Negro minority against the whites, we will endeavor to instill in the whites a guilt complex for their exploitation of the Negroes. We will aid the Negroes to rise in prominence in every walk of life, in the professions and in the world of sports and entertainment. With this prestige, the Negro will be able to intermarry with the whites and begin a process which will deliver America to our cause.” So black folks before you embark on a suicide mission learn some real history and the true cause of your plight. As your anger is miss directed and you will be engaged as belligerents and enemy combatants. Live in peace, be well, and do your homework before you attempt something rash and dangerous. Rick \\nIt’s coon hunting season once again! Allan Munroe \\nI don’t know what color you are but I do know you are a Fucking Nigger ,,,soon you will know what it feels to be without hope just as I felt since you Voted into office That Fucking Ass Kissing Brother of the Muslim Brotherhood , who did all he could do except suck the Dick of the King of Saudi Arabia on National T.V. , all while trying to completely destroy USA but he didn’t learn enough in school regarding the Constitution of the USA. Soon Mr. Trump will be writing down names & kicking ASS ———-Niger Clean Kut \\nNot only do Trumpets have the tactical military training, and are stockpiling ammo, bombs, grenades and other weapons… They’ve been WAITING FOR THE DAY they can legally open fire on blacks and liberals for DECADES. They are SO ready… Trump says he will pay their legal fees and they feel emboldened.? det0918 \\nWhat a loser ….he is what you get when raise your children with violence, hit, beat and threaten your children, you get violent minds…who see no other way but to threaten other people and perpetrate on them what was done to them by their own parents- yes, it’s white people’s fault your life sucks. \\n…amazing how many blacks are able to live life like the rest of us…in peace…. but you can’t manage it …so it must be someone else’s fault …who do white people blame when their lives suck? C.A.Martin \\nWell Poe just remember there are ten times as many whites (many well armed) as blacks and your not exactly on good terms with the Hispanics as well. Self immolation is just not a good way to go. But go for it, burn baby burn. Maus \\nThey will destroy America one liquor store, one Best Buy and one Footlocker at a time! Zaphod Braden \\nThat nigga is the PROPERTY of George Soros. Zaphod Braden \\nThis moron should go visit Bernie Sanders —— in VERMONT Sanders was born and raised in the New York City borough of Brooklyn and graduated from the University of CHICAGO in 1964. While a student, he was an active civil rights protest organizer for the CONGRESS OF RACIAL EQUALITY and STUDENT (not really)NONVIOLENT COORDINATING COMMITTEE. Bernie ran to Vermont in 1968, to get away from BLACKS to raise HIS family in SAFETY Sanders switched PARTIES, BETRAYED the Veterans, and instigates the Blacks and then RUNS AWAY. In January 1962, Sanders led a rally at the University of Chicago administration building to protest university president George Wells Beadle’s segregated campus housing policy. “We feel it is an intolerable situation when Negro and white students of the university cannot live together in university-owned apartments,” Sanders said at the protest. But then Sanders ran to SAFE LILLY WHITE VERMONT to raise HIS children far away from those Blacks he wants you to live with. Zaphod Braden \\nHe just qualified — as a DOMESTIC TERRORIST: Hussein Obama claims Congress “must do it’s Constitutional DUTY” by accepting his nominee, but Hussein REFUSES to do HIS Constitutional DUTY of evicting illegal invaders and securing OUR borders “during a time of war on terror”. Hussein is the Chief Executive. Hussein’s PRIMARY CONSTITUTIONAL DUTY is to enforce the laws, yet he REFUSES to do so. \\n“our” politicians take oaths to uphold the LAW and the Constitution. When they REFUSE to, when they openly DEFY and circumvent the LAW, they FORFEIT their “Governmental Immunity”. Every Politician who goes on record as supporting ILLEGAL INVADERS should be held financially responsible for PAYING REPARATIONS for the crimes done by the ILLEGALS. Start CIVIL FORFEITURE on the assets of Politicians that cover for ILLEGAL INVADERS. RESOURCES'"}, "time": 1742562803.4479995}