{"duration": 0.13986849784851074, "input_args": {"text": "'Puberty Before Age 10: A New ‘Normal’? \\nReaching puberty is a rite of passage that we’ve all been through, but children nowadays are reaching it earlier than ever before — a trend that has both health experts and parents alarmed. \\nPrecocious puberty , which is the appearance of secondary sex characteristics like pubic hair or breast growth before age 8, or the onset of menarche before age 9, impacts at least 1 in 5,000 U.S. children, and the rate is on the rise. 1 \\nEven in the last three decades, children (particularly girls) are maturing at younger and younger ages (precocious puberty is 10 times more common in girls than in boys). \\nPuberty, Once the Norm at Age 15, Now Occurring in 7-, 8- and 9-Year-Olds \\nIn the 19th century the onset of menstruation occurred around the age of 15. Now the average age of the first period, or menarche, is around 12. The time during and before puberty is one of rapid development and change, which is why even months matter when it comes to first menstruation. Before menstruation, girls will show beginning signs of development, such as breast “budding” and growth of pubic hair. \\nThese signs are now becoming unsettlingly common among 7-, 8- and 9-year-old girls, to the extent that many health care providers, rather than labeling these children with a diagnosis that something is wrong, have simply changed the definition of what’s normal… but is it really “normal” for girls to mature at such a young age? \\nThere are more questions than answers in the case of precocious puberty, but what is certain is that girls are developing earlier than they have even 10, 20 or 30 years ago. \\nOne study in the journal Pediatrics revealed that by age 7, 10 percent of white girls, 23 percent of black girls, 15 percent of Hispanic girls and 2 percent of Asian girls had started developing breasts, with researchers noting: 2 \\n“The proportion of girls who had breast development at ages 7 and 8 years, particularly among white girls, is greater than that reported from studies of girls who were born 10 to 30 years earlier.” \\nEarly puberty can set the stage for emotional and behavioral problems, and is linked to lower self-esteem, depression, eating disorders, alcohol use, earlier loss of virginity, more sexual partners and increased risk of sexually transmitted diseases. There is also evidence that suggests these girls are at increased risk of diabetes, heart disease and other cardiovascular diseases, as well as cancer, later in life. \\nEnvironmental Chemicals a Likely Factor \\nScientists have brought forth a number of potential explanations for the rising rates of early puberty, but one that deserves special attention is environmental chemicals, and particularly estrogen-mimicking, “gender-bending” chemicals that easily leach out of the products that contain them, contaminating everything they touch, including food and beverages. \\nAs the featured New York Times article reported: \\n”…animal studies show that the exposure to some environmental chemicals can cause bodies to mature early. Of particular concern are endocrine-disrupters, like “xeno-estrogens” or estrogen mimics. These compounds behave like steroid hormones and can alter puberty timing. \\nFor obvious ethical reasons, scientists cannot perform controlled studies proving the direct impact of these chemicals on children, so researchers instead look for so-called “natural experiments,” one of which occurred in 1973 in Michigan, when cattle were accidentally fed grain contaminated with an estrogen-mimicking chemical, the flame retardant PBB. \\nThe daughters born to the pregnant women who ate the PBB-laced meat and drank the PBB-laced milk started menstruating significantly earlier than their peers.” \\nThis is an extreme case, but the truth is we are all part of a “secret experiment” of sorts, because hormone-disrupting chemicals are all around us. Bisphenol A (BPA), an industrial petrochemical that acts as a synthetic estrogen, is found in our plastics and our tin can linings, in dental sealants and on cash-register receipts. Laboratory tests commissioned by the Environmental Working Group (EWG) detected BPA in the umbilical cord blood of 90 percent of newborn infants tested — along with more than 230 other chemicals. As written in the New York Times : \\n“One concern, among parents and researchers, is the effect of simultaneous exposures to many estrogen-mimics, including the compound BPA, which is ubiquitous.” \\nNo one knows what happens when a developing fetus or young child is exposed to hundreds of chemicals, many of which mimic your body’s natural hormones and can trigger major changes in your body even as an adult, let along during the most rapid and vulnerable periods of development (in utero and as a young child). \\nBPA is, unfortunately, but one example. Others include phthalates, a group of industrial chemicals used to make plastics like polyvinyl chloride (PVC) more flexible and resilient. They’re also one of the most pervasive of the endocrine disrupters, found in everything from processed food packaging and shower curtains to detergents, toys and beauty products like nail polish, hair spray, shampoo, deodorants, and fragrances. \\nOther environmental chemicals like PCBs and DDE (a breakdown product of the pesticide DDT) may also be associated with early sexual development in girls. Both DDE and PCBs are known to mimic, or interfere with, sex hormones. \\nPerfluorooctanoic acid (PFOA), found in non-stick cookware, also falls into this dangerous category, as does fluoride, which is added to the majority of public water supplies in the United States. Research showed that animals treated with fluoride had lower levels of circulating melatonin , as reflected by reduced levels of melatonin metabolites in the animals’ urine. This reduced level of circulating melatonin was accompanied — as might be expected — by an earlier onset of puberty in the fluoride-treated female animals. \\nThese Chemicals Also Increase Your Risk of Cancer and Heart Disease \\nIf a chemical is capable of influencing the rate of your reproductive development, it stands to reason that it would be capable of influencing other hormone-sensitive growth processes as well, and this is indeed the case. \\nFor instance, new research has detected the presence of paraben esters in 99 percent of breast cancer tissues sampled. 3 Parabens are chemicals with estrogen-like properties, and estrogen is one of the hormones involved in not only puberty but also the development of breast cancer. They are widely used in household products such as: \\nRecent research has also confirmed the existence of a previously unknown class of cancer-causing estrogen-mimicking compounds: metals. Yes, a broad range of metals have been shown to act as “metalloestrogens” with the potential to add to the estrogenic burden of the human body, thereby increasing the risk of breast cancer and also possibly early puberty. The following metals, which are added to thousands of consumer products, including vaccines, have been identified as being capable of binding to cellular estrogen receptors and then mimicking the actions of physiological estrogens: 4 \\nData from a long-running British health survey, meanwhile, has shown that if you have high levels of the chemical BPA in your urine, you may be at an increased risk of heart disease . Some of the greatest concern surrounds early-life, in utero exposure to BPA, which can lead to chromosomal errors in your developing fetus, causing spontaneous miscarriages and genetic damage. But evidence is also very strong showing these chemicals are influencing adults and children, too, and leading to decreased sperm quality, early puberty, stimulation of mammary gland development, disrupted reproductive cycles and ovarian dysfunction, obesity, cancer and heart disease, among numerous other health problems. \\nAvoiding Hormone-Disrupting Substances is Crucial for Children and Adults Alike \\nWhile young girls may show obvious signs of exposure to hormone-disrupting substances via early puberty, other signals are more insidious and may not show up until a disease is already present. Here are 11 measures you can implement right away to help protect yourself and your children from common toxic substances that could cause precocious puberty and other long-term health problems: \\n1. As much as possible, buy and eat organic produce and free-range, organic meats to reduce your exposure to added hormones, pesticides and fertilizers. Also avoid milk and other dairy products that contain the genetically engineered recombinant bovine growth hormone (rBGH or rBST) \\n2. Eat mostly raw, fresh foods. Processed, prepackaged foods (of all kinds) are a major source of soy and chemicals such as BPA and phthalates. \\n3. Store your food and beverages in glass rather than plastic, and avoid using plastic wrap and canned foods (which are often lined with BPA-containing liners). \\n4. Use glass baby bottles and BPA-free sippy cups for your little ones. \\n5. Make sure your baby’s toys are BPA-free, such as pacifiers, teething rings and anything your child may be prone to suck on. \\n6. Only use natural cleaning products in your home to avoid phthalates. \\n7. Switch over to natural brands of toiletries such as shampoo, toothpaste, antiperspirants and cosmetics. The Environmental Working Group has a great safety guide to help you find personal care products that are free of phthalates, parabens and other potentially dangerous chemicals. \\n8. Avoid using artificial air fresheners, dryer sheets, fabric softeners or other synthetic fragrances, many of which can also disrupt your hormone balance. \\n9. Replace your non-stick pots and pans with ceramic or glass cookware. \\n10. When redoing your home, look for “green,” toxin-free alternatives in lieu of regular paint and vinyl floor coverings. \\n11. Replace your vinyl shower curtain with one made of fabric. \\n12. Avoid non-fermented soy, especially if you’re pregnant and in infant formula. \\nTheo Colburn’s book Our Stolen Future is a great source for further investigation as it identifies the numerous ways in which environmental pollutants are disrupting human reproductive patterns. I believe it is one of the best resources on this topic and highly recommend it. \\nVitamin D Also Linked to Early Puberty \\nIt has been suggested that girls who live closer to the equator start puberty at a later age than girls who live in Northern regions. Since this indicates a potential connection with sun exposure, researchers decided to investigate whether vitamin D was, in fact, related. Upon measuring vitamin D levels in 242 girls aged 5-12, researchers from the University of Michigan School of Public Health found that those who were deficient were twice as likely to start menstruation during the study period as those with higher levels. 5 \\nSpecifically, among the vitamin-D-deficient girls, 57 percent started their period during the study, compared to 23 percent with adequate vitamin D. However, researchers defined adequate vitamin D as ≥ 30 ng/mL, which is actually still a deficiency state! For optimal health, vitamin D levels should be a minimum of 50 ng/mL, which means the number of vitamin-D-deficient girls with early puberty was probably much higher than the study reported. \\nThe earlier you enter puberty, the longer you’re exposed to elevated levels of the female hormone estrogen, which is a risk factor for certain cancers such as breast cancer. This has been the primary “link” between early puberty and cancer that has been explored, but it’s important to understand that vitamin D deficiency is also a major risk factor for cancer, heart disease and many other diseases. So it could be that some of the increased risks that come from early puberty are linked to low vitamin D levels. \\nWhat You Should Know About Obesity, Stress and Exercise \\nObesity (which exposes girls to more estrogen because estrogen is both stored and produced in fat tissue) is another likely factor in early puberty. The New York Times reported: \\n“As Robert Lustig, a professor of clinical pediatrics at the University of California, San Francisco’s Benioff Children’s Hospital, explains, fatter girls have higher levels of the hormone leptin, which can lead to early puberty, which leads to higher estrogen levels, which leads to greater insulin resistance, causing girls to have yet more fat tissue, more leptin and more estrogen, the cycle feeding on itself, until their bodies physically mature.” \\nAs for stress, this, too, has been linked to early puberty, with girls whose parents divorced when they were between 3- and 8-years-old significantly more likely to experience precocious puberty. “Evolutionary psychology offers a theory,” the New York Times reports. “A stressful childhood inclines a body toward early reproduction; if life is hard, best to mature young. But such theories are tough to prove.” Interestingly, in addition to avoiding environmental chemicals, obesity and stress, and optimizing your vitamin D, regular exercise appears to be one of the best known ways to help prevent early puberty.'"}, "time": 1742628426.2496214}