{"duration": 0.39142489433288574, "input_args": {"text": "'By Stewart Dougherty: \\n“ There never was a democracy yet that did not commit suicide.” – John Adams, 2 nd President of the United States of America The 2016 United States presidential race was never intended to be an election. Rather, it has been psychologically engineered from the beginning to be a for-profit overthrow of America by an increasingly powerful and predatory establishment cabal, which seeks not just power, but full-spectrum dominion over the nation’s people, wealth and institutions. It has been rigged to be the exact opposite of an election: namely, a planned regime change that will then falsely be called after the fact an “election outcome,” “popular mandate” and “expression of the will of the people.” It will deliver a multi-trillion dollar post-“election” payday to the establishment insiders who have orchestrated it and nothing but ongoing misery for the people. This “election” is a carefully crafted coup that will result in the progressive annihilation of American freedom and liberty, personal and financial, for all citizens except those within the Establishment’s reach. The longstanding purpose of this election has been to impose upon the people a new national operating system that we have named “Crony Communism.” (This theme is detailed in our previous article entitled: “Crony Communism: Hillary Clinton’s Game Plan for America.” – LINK ). To effect this regime change, a new psychological syndrome was engineered, using proven techniques that predictably alter the thinking patterns and decision making capabilities of susceptible individuals. Psychological engineering is not science fiction; it is real, powerful and now, and its direct effects are being exhibited today by tens of millions of voters throughout the country. The economic implications of the coming regime change will be monumental – and the financial effects on individuals severe – if people do not take steps now to prepare and protect themselves. We will offer some suggestions in this regard in a follow-up article (Part 2). Our objective in this article is to give you a clear understanding of what is happening, at least as we see it. As readers of our previous Inferential Analytics articles know, prior to naming and describing a particular theme, we provide a snapshot of the contextual landscape so you can understand how the theme developed. Before continuing with the context, we would like to emphasize that we do not earn, or seek to earn one penny from our articles. We write because the themes being created lately by our Inferential Analytics (IA) model are so troubling that we feel a moral obligation to share them. In 15+ years of doing this work, we have never before seen themes as profoundly dystopic as the ones we see today. Our IA themes point to a fundamentally disintegrating American future that we believe 95+% of the people have no idea is coming. The future that IA is indicating will be extremely dangerous for the unaware and unprepared. We believe this is the last chance for the nation to reverse course. We write in order to help people see what is happening. Our motivation is as simple as that. Context for the New Theme: From August 23 – 28, 1973, a bank robber by the name of Jan-Erik Olsson unwittingly made a significant contribution to the understanding of human psychology, particularly of the abnormal, or at a minimum, the counterintuitive variety. Olsson robbed Kreditbanken, a bank located in Norrmalmstorg, a neighborhood within the city of Stockholm, Sweden. During the robbery, Olsson took four employees hostage for a period of six days. As their captivity progressed, the hostages began to exhibit positive attitudes toward their captor , which were contrary to the emotions of anger, resentment and rejection that psychologists would have expected in the circumstances. Nils Bejerot, a criminologist, medical professor and researcher who specialized in the study of addiction coined the term “Stockholm Syndrome” to describe the phenomenon. Even though this term, also known as “capture-bonding,” was created to describe the behavior of a mere four persons taken hostage during the robbery of a small bank in a small neighborhood of a relatively small city in a small country, it immediately struck a global chord. It became and remains one of the best known medical and psychological syndromes in the world, and has extraordinary name recognition to this day not just among experts, but common people as well. In Bejerot’s diagnosis, those with Stockholm Syndrome develop favorable feelings of trust and/or affection toward their captor(s); negative feelings toward those (e.g., the police) who are trying to rescue them from their captor(s); provide support and assistance to their captor(s); and at a certain point exhibit a lack of desire to be rescued from their captor(s) at all. The fact that the term went internationally viral shortly after its announcement begged the question, “Why?” The answer appeared after additional research into the syndrome was conducted. It turned out that the Stockholm Syndrome can also develop among a much larger prospective cohort that includes abused women and children; POWs; concentration camp prisoners; cult members; and incest victims. The term “Stockholm Syndrome” shone a verbal light onto a far broader psychological phenomenon that until then had been lingering in the shadows. The discovery of the Stockholm Syndrome, which is tangential to a powerful and potentially extremely dangerous psychological condition known as “identifying with the aggressor,” proved that people can actually come to admire an individual (or individuals) who commands, controls, exploits and abuses them. This was excellent news for psychopathic predators of all kinds, whose dirty work just got easier for them, and bad news for everyone else. Perhaps it should be no surprise that predators in greater and greater numbers have been running amok ever since. In fact, one of the emerging themes we track is “Predation.” Predation is a serious problem in our world, and it is spinning out of control according to the data we analyze. The Clinton Syndrome At Inferential Analytics, we have zeroed in on what we believe is the most sweeping psychological syndrome ever discovered. It affects literally tens of millions of people, and has no parallel in scale, scope or consequence that we can find in medicine or psychology. We have named it the “Clinton Syndrome,” after career politician Hillary Clinton. The Clinton Syndrome, a variant of Stockholm Syndrome, is a condition in which a voter develops positive feelings about and favorably identifies with a politician who has demonstrated, over a period of decades, a consistent behavior pattern of dishonesty, deceit, avarice, corruption, secretiveness, paranoia, rage, volatility, graft, dissembling, insincerity, disdain, theft, abusiveness, hypocrisy, scapegoating, lawlessness, subversion, war-mongering, nation-state destruction and murder. (In our view, state-sponsored murder is ordinary murder dressed up in false righteousness and rouge, and is actually more despicable.) While the named malignant characteristics are many, every single one of them has been exhibited, most on a repeated basis spanning decades, by Hillary Clinton. These lifelong behaviors have been documented time and again by numerous, non-related sources; are no longer conjecture but proven fact; and are simply beyond dispute or debate. Taken in the aggregate, they define what we call a “political predator.” It is worth mentioning that the abnormal psychological characteristics exhibited by sexual and political predators are similar, and that these two birds of a feather sometimes come together; like attracts like. We want to emphasize that Inferential Analytics is a wholly apolitical forecasting method. Furthermore, we are not engaged in politics as campaigners, donors, lobbyists, strategists, bundlers, organizers, advisors, consultants, supporters, sycophants or in any other way whatsoever. We are researchers, and we solely study the cards that history tosses onto the table of time and events. Truth is our only agenda, though finding it can be difficult and expensive. In our corrupt, dishonest world, Truth, is endlessly hunted down by Falsehood, its armed, dangerous, dirty and extremely well-funded enemy. Truth has been forced into exile in order to survive, and only rarely makes a public appearance, as it fleetingly has, for example, on the balcony of the Ecuadorian Embassy in London. Getting back to the Clinton characteristics, we know for a fact that Hillary Clinton has repeatedly lied to Congress and to the people; that as Secretary of State, she threw entire nations into chaos. In one instance alone, Libya, this resulted in the murder and maiming of tens of thousands of innocent civilians, and the grotesque execution of its leader, about which she joked and laughed: “We came; we saw; he died.” [Starts cackling]; that she and her husband stole furniture from the White House when they left it in 2001, which they subsequently were forced to return in what to normal people – but not to them – would have been shame; and that subsequently, while a centi-millionaire, she stole furniture from the State Department and placed it in her own house, demonstrating cheapness and kleptomania of an almost unbelievable magnitude; that she has shown sheer, utter, holier-than-thou disdain for those who hold beliefs, ideals and/or religious convictions different from her own (the “irredeemable” “deplorables”; Roman Catholics; conservative Christians; etc.); that she has been verbally and sometimes physically abusive toward her personal staff, colleagues and even the Secret Service personnel who risk their lives to protect her; that her temper is explosive, as reported by a large number of independent sources who have witnessed her rages first hand; that she has openly admitted to being a hypocrite who says one thing in private, and a totally opposite thing on the same subject in public, in order to pander to the particular audience she is addressing at the time and thereby hustle votes; that the “Pay for Play” collusion between Secretary of State Clinton and her family “Foundation” has been rampant and involves epic dollar sums; that she now endlessly needles, scolds and provokes Russia, a major nuclear power, after her “Foundation” (better known as a Slush Fund) accepted a $120,000,000.00 ($120 MILLION) bribe in exchange for her greenlighting a Russian deal to purchase 20% of America’s limited uranium reserves. She does this to demagogically deflect attention away from her corruption and graft; that the Middle East is littered with the corpses of the innocent thanks to her deadly, reckless, insouciant and vicious war-mongering and military adventurism; that she, her husband and her cabal have subverted the very heart of U.S. law enforcement and justice, at the highest levels of its institutions, for personal political gain; that she deserted her post, lifted not a finger to assist and thereby issued a death sentence against four American heroes in Benghazi, and then repeatedly lied through her teeth about the incident, even to the victims’ heartbroken parents; that she lies and waffles about her support for secret, establishment “treaties” such as the TPP, which is reviled by the people but held up by her in private as “the gold standard,” only to back down when she was caught red-handed in her dishonesty and hypocrisy; that she accepts millions of dollars in “donations” and “speaking fees” (aka, bribes) from Wall Street plutocrats, and then has the gall to tell everyday voters that she’s behind them, and is going to bring Wall Street to heel; that her family “Foundation” actually stole disaster relief donations made to help some of the poorest and most unfortunate people on earth, the Haitians, demonstrating greed gone exponential; that she totally disregards the Rule of Law, which to her is for the Little People, and replaces it with the Rule of Hillary, which exists only for her and over which she is the sole adjudicator; that she believes in “totally open borders,” something completely rejected by the American people and diametrically opposed to any form of common sense and that was only revealed when private documents never intended to be seen by the public were released; that she and her family Slush Fund gladly accept millions from the leaders of countries known for subjugating women and throwing gay people off of roof tops, and then has the sheer hypocrisy to court the votes of women and gays, saying she’s got their backs; and the list goes on and on and on, year after year after year. Her tricks, schemes and gambits are not one-off, occasional departures from decent, moral and respectable behavior. Rather, it is as if they are chiseled on a granite tablet as her personal “Ten Commandments” and standard operating procedures. (“Thou Shalt Lie;” “Thou Shalt Steal;” “Thou Shalt Be a Hypocrite;” “Thou Shalt Find Murder Hilarious,” etc.) They are Hillary’s own, homespun “Rules for Radicals,” perhaps also dedicated by her to Lucifer, just as her role model and hero Saul Alinsky’s “Rules” were dedicated to Lucifer, literally . Her personal commandments and way of behaving will tear this nation to shreds if she is empowered to continue on her path, with impunity, as President of the United States, and becomes backed by the vast, militarized government enforcement network that will be used to silence any critics of her destructiveness, corruption and criminality. None of these Clinton facts is disputable. They are documented, cross-documented, confirmed and undeniable. The scandals in which she is endlessly embroiled are real, and we all know they are real. Yet astonishingly, there remain millions of voters who completely ignore these facts, and remain supportive of Clinton’s presidential candidacy. Out of a duty to truth, we have an obligation to ask ourselves: “What is going on here?” Inferential Analytics is about identifying existing themes, inferring the likely full-blown realities that will grow out of those themes, and then forecasting the changes such full-blown realities will create. The theme here is self-evident: the Clinton Syndrome is real, and is propelling Clinton to a possible presidential victory. That the Clinton Syndrome exists is the only possible explanation for the fact that millions of people actually voted for her in the primary elections, and that millions more already have or are going to vote for her in the national presidential “election,” despite her ignominious past. The next phase, which we will know late in the evening of November 8, 2016, could be the full-blown reality of a Clinton presidency, should she be elected. This would demonstrate that the Clinton Syndrome had overtaken the minds of a majority of voters. The fact is that the Clinton Syndrome makes no logical sense. It makes no logical sense for a voter to think favorably about a lifelong political predator who has immersed herself in nothing but scandal, corruption, criminality, lies, chaos and destruction. Given that it is not logical, normal or comprehensible, the question becomes, “How on earth did the Clinton Syndrome come about in the first place?” The Clinton Syndrome is the product of the most sophisticated psychological engineering campaign ever unleashed upon the mind of humankind. It reflects a relentless, non-stop, multi-year, multi-originated, multi-faceted bombardment of the American psyche with propaganda, brainwashing, mind control and massive lies. Hitler was good at this kind of thing, but his tactics were in the Dark Ages compared to the hyper-sophisticated techniques being used upon Americans today to mass-activate the pathological Clinton Syndrome. This carpet-bombing of the American mind with weapons of mass mental destruction does not require anything even close to 100% effectiveness in order to create the planned electoral outcome. If roughly 70,000,000 voting age Americans succumb to it, the Clinton Syndrome will be victorious. This will result in a for-profit crony communist regime change taking place in the United States. The payoff for the cronies will be in the multiple trillions of dollars in Clinton’s first term alone, which explains the enormous effort that has gone into the deliberate establishment warping of the American consciousness. The barrage of psychological engineering has been orchestrated, conducted, aided and abetted by an establishment cabal that includes the Mainstream Media, including every single major television network; every single mainstream radio station; virtually every single major city newspaper; every non-major-city newspaper that runs syndicated, mainstream columns; every major website running on-screen advertisements; all search engine providers that skew search results; all leading social media operators; every mainstream magazine; the DNC and the RNC (the latter of which has done basically nothing to support and everything possible to undermine its candidate); a huge percentage of existing politicians including dozens of turncoat establishment Republicans who are cashing in on the current corruption and are adamantly opposed to any kind of change and who are therefore torpedoing their party’s candidate at every turn; professional, violence-funding regime change agitators such as Soros; virtually all of Wall Street and the financial establishment; the Federal Reserve System which has printed trillions of dollars’ worth of counterfeit dollars to keep the false illusion of normalcy alive; government agencies such as the BLS that concoct phony numbers to support the Big Economic Lie; countless other cronies who stuff billions in their pockets from the endemic corruption; and even the Director of the FBI, the Attorney General, the President of the United States and his wife. A full listing of the individuals, corporations and institutions that have purposefully created the Clinton Syndrome would require dozens of pages of single-spaced text to fully disclose. It is no wonder that it has been triggered en masse. This is historic. There has never in our history been such a coordinated establishment onslaught against one and for the other candidate in a national presidential election. As they say, “follow the money,” and that is what this election is all about. It has absolutely nothing to do with the good of the people, or the nation. Cronyism and its filthy lucre stink to high Heaven, and that is the foul odor you smell all around you. Central to the triggering of the Clinton Syndrome has been a litany of campaign lies and political bribes. The citizens have been told that already broke Social Security will be broadened to cover millions more people no matter whether they have paid into it or not; thet already-broke Medicare and Medicaid will be expanded; that student debts will be wiped out; that college will be free; that free or subsidized, universal health care is assured; that massive, government-funded infrastructure projects will create high-wage jobs that they can get; that wages will be increased and equalized; and that a wide array of additional welfare programs, subsidies and government giveaways await, as long as voters turn over their minds to the Clinton Syndrome. Clinton pre-empts voters who might wonder and ask, “Who is going to pay for all of this?” by telling them that, of course, it is the “rich” who will pay for it. As Clinton has repeatedly stated in her speeches and during the debates, “we’re going to go where the money is.” This is pure communistic cant and the rank politicization of envy, which cynically feeds upon the financial despair of millions of American citizens. The people’s financial morass has, in fact, been directly created by career political predators like Clinton herself, whose policies have robbed the nation blind and plunged it into over $120,000,000,000,000.00 ($120 trillion) of existing and contingent debt that can never possibly be repaid in dollars bearing any monetary resemblance whatsoever to the dollars existing today. America’s debt will be repaid in the equivalent of hyper-inflated Venezuelan bolivars, if the debt holders are lucky. In the final debate, on three separate occasions, Clinton said, “I will not add one penny to the debt.” This lie is so preposterous that they should have ended the debate the first time she said it, sent everyone home, and turned off the lights. The government’s own statistics, generated by such agencies as the Office of Management and Budget show beyond a shadow of a doubt that the nation’s deficit and debt crises are spiraling out of control, and this is without including Clinton’s proposed, radical expansion of crony communistic state spending. Every single “tax the rich” scheme hatched in the past by political hacks has failed, from “millionaire taxes” to “luxury goods taxes.” Not one of them has brought in the expected revenues, and virtually all of them have been discontinued because they were abject failures. The idea that her “tax the rich” schemes will actually pay for massive, full-scale government control of and hegemony over the populace is absurd, and her lie that “I will not add one penny to the debt” is so egregious that it should be prosecutable in a court of law. Unfortunately, most Americans, who are just struggling to get by, don’t have the time to fact-check a professional liar’s lies. On November 9, 2016, should the Clinton Syndrome psychological engineering scheme prevail, we project that somewhere in the order of 100,000,000 Americans, primarily its producers, will feel something more powerful than anger: grim resolve. They will know deep in their hearts that the nation they have known and loved is gone, and that it is never coming back. They will know deep in their minds that the malignant ethics of corruption, looting, immorality and structural inequality that stand at the very foundation of crony communism will seep into and infect every aspect of their lives. They will know that the exorbitant cost of crony communism will not just impoverish them financially, but will destroy the plans, hopes and dreams for the future that they and their loved ones hold dear. They will know in their souls that their freedom and liberty have been sacrificed once and for all upon the establishment’s dark altar of greed. And they will do something about it. We believe the United States is on the cusp of a combined “John Galt” and “Gresham’s Law” event, the economic implications of which will be unprecedented and profound. We believe that millions of productive Americans will refuse to be serfs to a corrupt, crony communistic, regime, and that they will quietly but effectively begin to shut down. The “people of the mind,” the honest, decent, hard-working, entrepreneurial, productive, tax-generating citizens are going to say, “No more.” They are not going to work 60 hours a week for scraps, only to enrich crony communist plunderers who will live like kings and queens while producing nothing but exploitation. The producers are going to give the middle finger to the money sucking political predators who rant about how they are “going to go where the money is” to pay for their false, arithmetically impossible, dishonest, bankrupting, vote-bribing “promises” and schemes. At the same time, the bad money of crony communism will “drive” into safety and sanctuary the good money to which financially intelligent people will move. Those of you who have gotten this far in the article already know exactly what we mean. And no matter how many commands, controls and executive orders the crony communists pile on to steal the people’s money, they are going to be unpleasantly surprised to find that they end up with next to none of it. Crony communist looters are no match for the ingenuity, resourcefulness, integrity and resolve of everyday, productive American people. Principled American patriots will throw their good money into deep rivers before they hand it over to crony communist plunderers This is the end of Part 1. In Part 2, we will provide additional information about the current landscape, several forecasts, and a short list of general recommendations. Closing Postscript: On a very specific note, if crony communism prevails on November 8 th , we believe that holiday retail sales will deliver an early statement about the unfurling economic consequences. We would project a major miss. Despite the miss, the aggregate number will still be overstated, because we forecast that the prudent will begin to make large investments in independence. These people will not be buying gifts; they will be buying what they need to opt out and hunker down. We recommend that analysts carefully parse the holiday retail sales numbers, because deep under the surface they will almost certainly express, in dollar terms, our notion of “grim resolve.” The mainstream business media will completely miss what is really happening. The real retail sales story will be told by very specific line items, not the aggregate data. The informational gold will be hidden deep in the underground, as always. Stewart Dougherty Stewart Dougherty is the creator of Inferential Analytics, a forecasting method that applies to events proprietary, time-tested principles of human instinct, desire and action. In his view, forecasting methods not fundamentally based upon principles of human action are unlikely to be reliable over time. He is a graduate of Tufts University and Harvard Business School and has developed IA over a period of 15+ years. This entry was posted in Finance News and tagged Clinton Syndrome , Donald Trump , Hillary Clinton , Stewart Dougherty . Bookmark the permalink . Post navigation'"}, "time": 1742562535.7994528}