{"duration": 0.13817405700683594, "input_args": {"text": "'WASHINGTON  —     knew it had a problem. Democrats had unexpectedly sat down in the middle of the House of Representatives chamber to demand a vote on gun control legislation, and with the body officially in recess,   the cable network known for “gavel to gavel” coverage of Congress, had no means to cover it. Then it found an unlikely source: the social media feeds of House members who had turned to Periscope, a live   app, and Facebook Live. “As soon as we knew it was available, we went for it,” Terry Murphy,  ’s vice president for programming, said on Thursday after a short night’s sleep. “We didn’t know when we got into it that we would be doing it for 24 hours. There just wasn’t much time to debate it. ” So began what was arguably the most memorable   period the network has seen in years, one that Mr. Murphy estimated had probably set a record for continuous broadcast of a social media feed and that others suggested amounted to something of a declaration of independence from congressional landlords, who control the TV cameras inside the Senate and House chambers. But it was perhaps even more momentous for Periscope, which debuted just over a year ago after being acquired by Twitter. As of 5 p. m. Wednesday, Twitter messages that one or both of the live video streams broadcast by Representatives Scott Peters and Eric Swalwell of California embedded had already been viewed more than a million times, according to the company. “We always told ourselves that if we were successful, we were building a tool to give a voice to the voiceless,” Kayvon Beykpour,   and chief executive of Periscope, said in an interview. “It’s showing you the truth from different people’s perspectives. It’s a really raw way of experiencing what you watch. “In this case, it’s really ironic that the voiceless were our elected representatives. ” Twitter has long had a presence in Washington, and holds regular training sessions for politicians and media organizations on how best to use its tools. After Twitter bought Periscope, the video app was incorporated into the company’s training efforts. About a month ago, Twitter held a training session with the House Democratic caucus that focused specifically on how to use Periscope. A staff member from Mr. Peters’s office attended. On Wednesday, when   lost access to cameras  —   which are normally shut off when the House is not in session  —   an aide suggested that Mr. Peters turn to Periscope as a means of broadcasting what was happening on the House floor. A Facebook spokeswoman said that broadcasts by members of the House had reached more than 2. 9 million viewers on the social media site. Mark Zuckerberg, the company’s founder, wrote in a post on Thursday morning that use of Facebook Live was “bringing more openness to the political process. ” Overnight ratings were not available for  . Other networks shared brief segments from the live feeds, but it was   that stuck with them, overriding other coverage and cutting away only when Speaker Paul D. Ryan and other House Republicans returned to the floor around 10 p. m. for a series of votes.   is no stranger to   sessions  —   be they for a filibuster or a contentious vote  —   but the impromptu   which Mr. Murphy said the network had no advance knowledge of, was different. A staff of around 25 people remained overnight in the Capitol and at the network’s offices a few blocks away, and the regular morning team was called in four hours early. “It was the least scripted of the   sessions we’ve had to cover,” Mr. Murphy said. The fact that   does not control the cameras inside congressional chambers has been a source of disquiet for the network since it arrived on the air in 1979. Every time a new leader comes to power in either chamber, Mr. Murphy said, network executives send a letter requesting greater access, including the placement of independent media cameras inside the chamber. Thus far, they have been denied. The network employs about 270 people and has an annual budget of $70 million, according to a spokesman, Howard Mortman. It enjoys a niche following: Journalists covering the federal government treat it as a lifeline, and for those addicted to politics from coast to coast, few sources can rival its unvarnished transmission. While  ’s decision to stick with the protest drew a flurry of criticism on Twitter, Mr. Mortman said there had been no serious concerns raised from Mr. Ryan’s office or outside groups. “We want to show as much of Congress as we can  —   that’s our mission,” he said. “This clearly is a big story, and this gives us a way to show what’s happening in an area where our own cameras are not allowed. ”'"}, "time": 1742563454.2778826}