{"duration": 0.06548142433166504, "input_args": {"text": "'First Lady Melania Trump has responded to Kathy Griffin’s   photograph of herself clutching Donald Trump’s bloody, severed head, describing the photo as “very disturbing” and “simply wrong. ”[A report Wednesday claimed that the First Lady’s    son, Barron Trump, was watching television when the image flashed up on the screen as part of the news coverage of the incident. The president’s son reportedly became “panicked” over the photo because he did not know who Griffin was or the context in which the photo was taken.  “As a mother, a wife, and a human being, that photo is very disturbing,” Melania Trump said in a statement Wednesday. “When you consider some of the atrocities happening in the world today, a photo opportunity like this is simply wrong and makes you wonder about the mental health of the person who did it. ” The photograph, first published by TMZ Tuesday morning, shows the    My Life on the   comedian holding up a bloody, decapitated head meant to resemble that of the president, in a photograph reminiscent of horrific pictures taken by Islamic State terrorists to celebrate their atrocities. The photo was taken during a shoot with L. A.  artist Tyler Shields. The image went viral Tuesday, drawing strong condemnation from both sides of the political aisle as well as thousands of calls for a boycott of Griffin’s current   comedy tour. The president responded Wednesday, saying the proliferation of the photograph had been particularly hard on his children, including Barron. Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!  —   Donald J. Trump (@realDonaldTrump) May 31, 2017,  The image also reportedly led the U. S. Secret Service to open an investigation into the circumstances surrounding the photo shoot. Griffin apologized in a video posted to her Twitter account Tuesday, saying the image had gone “too far. ” I am sorry.  I went too far.  I was wrong. pic. twitter.   —   Kathy Griffin (@kathygriffin) May 30, 2017,  “I’m a comic. I cross the line. I move the line, then I cross it. I went way too far,” Griffin said. “The image is too disturbing. I understand how it offends people. It wasn’t funny. I get it. I’ve made a lot of mistakes in my career, I will continue. ” The apology apparently did little to quell outrage over the image. On Tuesday, CNN  —   where Griffin has   a live New Year’s Eve broadcast with Anderson Cooper since 2007  —   said it was “evaluating” the comedian’s role in its future broadcasts. Home security services company ADT also announced that it would pull its advertising from the network over the incident. On Wednesday, the Route 66 Casino in Albuquerque announced that Griffin’s upcoming show, scheduled for June 16, had been cancelled.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564153.4708264}