{"duration": 0.05327129364013672, "input_args": {"text": "'You are here: Home / political cartoon / Why Ambassador Stevens Had a Hard Time Getting Through to Hillary Why Ambassador Stevens Had a Hard Time Getting Through to Hillary October 28, 2016 \\nRobert Gehl reports that when one of Hillary Clinton’s political cronies referred to the four Americans killed in the Benghazi attacks as “ the four guys ,” most Americans couldn’t believe it. \\nAnd when Mike Pence found out about it, he couldn’t stay silent. \\nVia Breitbart and WikiLeaks , we learned about the dismissive term that Clinton advisor Mandy Grunwald used for the four American heroes. She wouldn’t even mention their names (Glen Doherty, Tyrone Woods, Sean Smith and Ambassador Chris Stevens). \\nShe was talking about a discussion to include the Benghazi attacks as opening statements for a speech: \\nSeems odd to put the tributes to the four guys into this statement, since it is mostly the repackaged testimony. We can’t overdo the tributes to them and I think they should be done in person. \\nThx \\nGrunwald Communications \\nVice Presidential candidate Mike Pence didn’t respond well, Breitbart reports : \\n“This just came out today…when her staff was preparing her for testimony, an opening statement for the select committee on Benghazi, one of them actually mentioned in an email that she shouldn’t focus too much on the ‘four guys’ who were killed,” said Pence. \\n“Those were not four guys. Those were four American heroes,” Pence said to shouts of affirmation and applause. \\n“When she was questioned about the reason for the attacks she actually said of those four American heroes, she actually said, ‘What difference, at this point, does it make?’ \\nHe continued, “Let me tell you something, I’m a father of a United States Marine. Anybody who said that, anybody who did that, should be disqualified from ever serving as Commander-in-Chief of the armed forces.” \\n“It was Hillary Clinton who left Americans in harm’s way in Benghazi,” Pence remarked to the New Hampshire crowd earlier in his address. \\nClinton and her staff’s dismissiveness of these four heroes – who she was responsible for – is absolutely unforgivable .'"}, "time": 1742563261.4244795}