{"duration": 0.14842629432678223, "input_args": {"text": "'By Brandon Turbeville \\nAs the United States marches forward with its war of terror abroad it is, as predicted by researchers and informed observers many years ago, clamping down on the domestic population at home. Indeed, it is virtually inevitable that the great eating machine of the empire returns home to be turned on the people who ignored it while it was grinding up so many innocent lives overseas. \\nSo as the war drums beat louder and as America ekes closer toward the impending Clinton coronation and the possibility of the declaration of yet another “ no fly zone ,” this time over Syria, becomes more and more likely, it is poetic justice that a no-fly zone is being declared inside the United States. \\nWhile Russia stands in the way of America’s march to create Libya 2.0 in Syria, there is no one willing and virtually no one able to stand in the way of America’s declaration of war on itself, personified by the vicious police state brutality being visited upon the protestors at Standing Rock – indigenous and otherwise – and the crackdown on virtually every amendment to the Constitution including the arrest of demonstrators and journalists, some of whom are facing incredibly ridiculous amounts of time in jail. \\nIndeed, the United States has even declared a no-fly zone over the protest area, preventing media coverage of the ensuing bravery of the protesters and brutality of the “Serve and Protect” crew who are willing to bash every skull and crush every human right in the quest to “just do their jobs.” \\nOne need only take a look at the photos of the protesters vs the heavily armed and militarized police (can we still call them police?) forces amassed around the location to see the crumbling of America into the police state foreseen for Western countries as the rug gets pulled out from under them economically, socially, and culturally despite their use as tools of imperialism abroad. The blunt hammer of Anglo-American hegemony that is the United States is falling apart even as it continues to strike at Syria, Iran, and Russia. \\nWhile police can murder with impunity and Black Lives Matter activists can destroy cities at will, Standing Rock protesters are charged with high crimes for spray painting bulldozers; and journalists who dare to even cover the protests are arrested and charged with trespassing, inciting riots, and conspiracy. Even left gatekeepers like Amy Goodman have been charged with such crimes. But, while Goodman’s charges were eventually dropped, other journalists such as Deia Schlosberg face 45 years in prison simply for filming a protest that involved the disruption of the pipeline’s operations. \\nIn regards to the current events taking place at Standing Rock, Jay Syrmopoulos writes , \\nThis latest flashpoint in the ongoing conflict is north of the larger and more permanent encampments, which have been constructed on federally owned land where over 200 Native American tribes have gathered to oppose the pipeline’s construction. \\nOn Wednesday, a heavily militarized law enforcement presence began mobilizing heavy equipment, including Humvees, armored personnel carriers, and buses and demanded the protesters leave the occupied area. \\nIn an ominous sign, the Federal Aviation Administration (FAA) has restricted flights , and banned the use of drones within a radius of about 4 ½ miles of Cannon Ball. The FAA declared that only aircraft affiliated with the North Dakota Tactical Operation Center are allowed within the restricted airspace. The flight restriction went into effect Wednesday and will last until November 5. \\nIndian Country Today reports : \\nWhat began with prayers and a single tipi alongside Highway 1806 quickly grew to more than a dozen tipis surrounded by tents, buses, cars and hundreds of water protectors. Some are calling it the “1851 Treaty Camp” to acknowledge their Treaty rights. \\nAcross the road is the encroaching pipeline and a heavily militarized police force with armored vehicles, helicopters, planes, ATVs and busloads of officers. Tensions are growing as unarmed citizens worry that police will use unnecessarily harsh tactics. \\nIn recent weeks, nearly 300 unarmed water protectors who were arrested have been subjected to pepper spray, strip-searches, delayed bail, exaggerated charges and physical violence, according to interviews with several who were taken into custody. The ACLU and National Lawyers Guild recently sent attorneys to Standing Rock to help the Red Owl Collective, a team of volunteer lawyers headed by attorney Bruce Ellison, who are representing many of those arrested. \\nThe massive law enforcement contingent, consisting of sheriff’s deputies and officers from numerous other states and counties, as well as National Guard, began staging near the encampment — with scores of Armored Personnel Carriers, buses and Humvees poised at the ready. \\n“At some point the rule of law has to be enforced,” Cass County Sheriff Paul Laney said Wednesday. “We could go down there at any time. We’re trying not to.” \\nDakota Access LLC, the pipeline developer released a statement encouraging trespassers to “vacate the land immediately” or be “removed from the land.” \\n“Alternatively and in coordination with local law enforcement and county/state officials, all trespassers will be prosecuted to the fullest extent of the law and removed from the land,” the company said. “Lawless behavior will not be tolerated.” \\nJust days ago, sheriff’s officials had said earlier they didn’t have the resources to immediately remove activists from the private land, about 50 miles south of Bismarck. Subsequently, law enforcement officials put out a call for reinforcements, with hundreds of officers from out of state responding. \\nSo there is an official “no fly zone” over the Standing Rock protest (which can be seen here at the FAA website ) and, on the ground, we have an army of storm troopers no doubt eager to bust heads and fire off some rounds into a group of people who only want clean water, property rights, and the honoring of the legal agreements they signed. \\nAcross the ocean, however, we await another no fly zone with the creeping Clinton coronation and possibly even a last stab by the Obama administration once the fix for Hitlery is officially in. \\nIn the last of three Presidential (in name only) debates, Clinton stated clearly her support for war in Syria by virtue of establishing a “no fly zone.” She stated , \\nI’m going to continue to push for a no-fly zone and safe havens within Syria not only to help protect the Syrians and prevent the constant outflow of refugees but to, frankly, gain some leverage on both the Syrian government and the Russians so that perhaps we can have the kind of serious negotiation necessary to bring the conflict to an end and go forward on a political track. \\nOf course, the establishment of a “No-Fly Zone” is tantamount to a declaration of war . Such has even been admitted by top U.S. generals when explaining exactly what a No Fly Zone would entail. As General Carter Ham stated , \\nWe should make no bones about it. It first entails killing a lot of people and destroying the Syrian air defenses and those people who are manning those systems. And then it entails destroying the Syrian air force, preferably on the ground, in the air if necessary. This is a violent combat action that results in lots of casualties and increased risk to our own personnel. \\nGeneral Philip Breedlove also echoed this description when he said, \\nI know it sounds stark, but what I always tell people when they talk to me about a no-fly zone is . . . it’s basically to start a war with that country because you are going to have to go in and kinetically take out their air defense capability \\nWhen Senator Roger Wicker asked Gen. Joe Dunford what it would take to impose a no fly zone upon Syria, the General responded , “Right now… for us to control all of the airspace in Syria would require us to go to war against Syria and Russia.” \\nThus, the entire Western “sphere of influence” is slowly descending down to become a place of no fly zones, riot police, and a boot slowly stamping on the human face. At home, those individuals who resist the “new normal” will be steadily dealt with either by economic hardship or a rude reminder that dissenters will be silence, imprisoned, or killed. \\nElsewhere, however, the Anglo-American system has begun to encounter nations who are not only willing to fight back but who are able to do so. A dying empire caught in its death throes, trying to remain alive by creating the “absence of dissent” might well launch a third world war with a nuclear power as a last stab at hegemony. \\nOn the other hand, Rome could just burn slowly. \\nRest assured, however, the skies above the city will be empty.'"}, "time": 1742564353.1435075}