{"duration": 0.08449101448059082, "input_args": {"text": "'MIAMI  —   The   dredging of Miami’s port to accommodate the newest generation of freighters, an undertaking that prompted a   battle with environmentalists, caused widespread damage to a portion of the area’s fragile and already distressed coral reef, according to a new report by the National Oceanic and Atmospheric Administration. The report, based on a December survey undertaken by scientists for the agency’s National Marine Fisheries Service, found that as much as 81 percent of the reef near the dredging site was buried in sediment, and an Army Corps of Engineers contractor report from August shows up to 93 percent partial coral death because of sediment, despite a plan by the Corps to minimize the damage. The damage is particularly alarming because the world is rapidly losing its reefs, partly because of global warming, experts say. South Florida has the only coral reef in the continental United States and 80 to 90 percent of it has died or been badly harmed over the years, officials say. The causes include ocean temperatures that have dipped too low or risen too high, acidification, sewage and pollution. Several cycles of white plague disease, including one in 2014 that coincided with the dredge, have also badly hurt South Florida’s reef. White plague, a virus that bleaches and kills coral, has been destroying reefs around the world. “This Florida reef is as important to our country as the sequoias of California, and we are losing it faster than we can figure out why,” said Rachel Silverstein, the executive director of Miami Waterkeeper, a nonprofit environmental organization that has sued the Army Corps of Engineers over coral damage. “There are a lot of stressors that are impacting and killing coral reefs, but this is a   example of something we could easily have prevented. ” The agency’s analysis, obtained by The New York Times, contradicts a December report by the corps, which primarily blamed white plague for the coral damage on reef sections near the dredge. In the corps’s report, scientists said that white plague was responsible for 85 percent of the coral deaths in the upper and middle parts of the reef and in the control site, and for 18. 3 percent of the deaths of coral closer to shore. The report failed to highlight that 93 percent of the corals closer to the dredge had partially died because of sediment, compared with 7 percent at sites farther away, Ms. Silverstein said. Scientists for the National Oceanic and Atmospheric Administration disagreed with the corps’s emphasis on white plague disease. Rather, they concluded that the majority of the reef, stretching beyond 3, 000 feet, showed conclusive damage to corals by dredging sediment. The agency’s survey of the extensive damage comes at a time when Fort Lauderdale is seeking final congressional approval for the dredging of its own port, Port Everglades, one of the largest in the country. The dredging project to deepen the port cleared a crucial Senate committee last week as part of a larger water bill and is headed for the Senate floor. Coral reefs are critical to South Florida because they help lessen the damage from hurricanes, are important to marine biodiversity and lure tourists. Environmentalists have warned Congress and the state that the corps’s plan to lessen the damage to corals in that area is flawed because it does not take into account new information, much of it bolstered by state and county scientists, about the extent of the coral damage from the port of Miami’s dredge. Expansion of Port Everglades is expected to begin next year. The corps is still working on a final assessment of the Miami dredge’s effects on the coral, said Susan J. Jackson, a spokeswoman for the agency. Scientists will conduct dives this summer and then analyze their findings in the fall, she added. “The results of the assessment will aid us in determining whether any additional mitigation may be needed,” she said. As for Port Everglades, Ms. Jackson said in an email that “lessons learned from all dredging projects are important, and we’re taking them into consideration during this process. ” Ms. Jackson added that the corps’s plan to protect the coral near Port Everglades was already an improvement over the Miami strategy. The new plan includes planting 103, 000 new   corals across 18 acres of reef and relocating existing coral to another five acres. “We are confident in the extensive work we have done,” Ms. Jackson said. But environmentalists said the plan failed to take into account how much farther than anticipated the sediment spread from the dredge site in Miami, a crucial element. The sediment suffocates coral. They want to see the impact zone extended beyond about 3, 000 feet from the site. The Port Everglades plan also relies on a    survey of staghorn coral, which is listed as threatened under the Endangered Species Act. The vast majority of staghorn near the Miami dredge site was never relocated by the corps. Either it was missed in 2010 by contractors during the initial survey of the area, or the staghorn reproduced later. The corps ultimately agreed to rescue the remaining staghorn after a legal fight with Miami Waterkeeper and other groups. It also relocated 924 nonendangered corals. In addition, underwater monitors to measure the sediment failed to work, so the corps relied solely on divers to keep tabs on the coral. This time around, the Waterkeeper group is trying to set up independent monitoring of the coral before dredging begins to keep close track of possible damage. “The corps like to say they learned a lot of lessons, and they promise they won’t do this again in Port Everglades,” Ms. Silverstein said. “We would like to see less aspirational talk and more mandatory language protecting these reefs. ”'"}, "time": 1742561903.9618936}