{"duration": 0.1025848388671875, "input_args": {"text": "'\\nIt may be that even with the post-election riots that have swept the country, we ain’t seen nothing yet.\\nThis country is fissuring. Its people are sharply divided, but more than that, covert finance is pushing things towards unrest and martial law.\\nIf Soros money and its ilk proves effective, inauguration day on January 20th will become one of the largest demonstrations on record, with a group calling itself #DISRUPTJ20 planning to block “peaceful transition” and disrupt Trump’s swearing in.\\nThe groups promoting it are calling on people nationwide to join in, and for business in D.C. to take sides and take “direct action” and attempt to stop the parade, block streets and other delay the events as scheduled:\\n#DisruptJ20: Call for a bold mobilization against the inauguration of Donald Trump on January 20, 2017 \\nOn Friday, January 20, 2017, Donald Trump will be inaugurated as President of the United States. We call on all people of good conscience to join in disrupting the ceremonies. If Trump is to be inaugurated at all, let it happen behind closed doors, showing the true face of the security state Trump will preside over. It must be made clear to the whole world that the vast majority of people in the United States do not support his presidency or consent to his rule.\\n[…] If there is going to be positive change in this society, we have to make it ourselves, together, through direct action. From day one, the Trump presidency will be a disaster. #DisruptJ20 will be the start of the resistance. We must take to the streets and protest, blockade, disrupt, intervene, sit in, walk out, rise up, and make more noise and good trouble than the establishment can bear. The parade must be stopped. We must delegitimize Trump and all he represents. It’s time to defend ourselves, our loved ones, and the world that sustains us as if our lives depend on it—because they do.\\n[…]\\nIf you can’t make it to Washington, DC on January 20, take to the streets wherever you are. We call on our comrades to organize demonstrations and other actions for the night of January 20. There is also a call for a general strike to take place. Organize a walkout at your school now. Workers: call out sick and take the day off. No work, no school, no shopping, no housework.\\n#DisruptJ20 Spread the word. Join the fight. #DisruptJ20\\nFacebook: http://tinyurl.com/disruptj20\\nThough it remains to be seen how many will actually show up on the day and join in, the group is concerning as it is calling for violence out of the gates.\\n#DisruptJ20 : Call for a bold mobilization against the inauguration of Donald #Trump on January 20, 2017 pic.twitter.com/EGU65bOtNG \\n— stimulator (@stimulator) November 11, 2016 \\n\\nViolence Being Arranged for Trump Inauguration: Group Openly Recruiting for “No Peaceful Transition” #disruptJ20 https://t.co/ctPHDFrHiZ \\n— ✨Michelle✨ (@mrntweet2) November 12, 2016 \\n\\nWe can block the buses and make them late #disruptj20 get truckers to block the highways all the way there.\\n— 0 (@0hour) November 11, 2016 \\n\\nAll of these people openly planning violence need to be arrested. Domestic terrorism. #disruptj20 \\n— Christie Bluhm (@Christie_Bluhm) November 11, 2016 \\n\\nAs Dahboo77 is reporting :\\nUsing a propaganda video packed with outright lies, the radical left is already calling for violent uprisings and is recruiting for people to violently disrupt the Presidential Inauguration on January 20. The recruiting effort is so packed full of unbelievably false information, that only a totally uniformed moron would take it seriously.\\n\\nHow much longer will foundation fronts have to funnel seed money until – as planned – chaos has been sown?\\nHow many staged riots and paid provocateurs will it take until a police state response brings this country to its knees, and places it under martial law?'"}, "time": 1742562130.3541765}