{"duration": 0.13524889945983887, "input_args": {"text": "'The international community should not only act against Venezuela’s socialist dictatorship as a matter of principle, but to protect the world from a growing web of criminal influence to which Venezuela belongs  —   alongside Iran, Syria, Cuba, and North Korea. [So argues Diego Arria, a lifelong Venezuelan diplomat and former president of the UN Security Council who now advocates for the freedom of his country. In an interview with Breitbart News, conducted in both Spanish and English, Arria argues that the socialist Venezuelan government’s ties to terrorists, drug traffickers, and rogue states make it a threat to the global community, not merely its Latin American neighbors.  “Venezuela is a risk to international peace and security,” Arria argued. “Venezuela has extremely dangerous ties to groups in the Middle East, to Hezbollah, for example. Some say, ‘Iran’s missiles can never reach the continental United States,’ and I say, ‘yes, but if they are in Venezuela, they can reach Miami directly. ’” “We are associated with the worst causes of humanity,” Arria lamented. “We were with [former Iranian president Mahmoud] Ahmadinejad in Iran, we had ties to [late Iraqi dictator Saddam] Hussein, we had them with [late Libyan dictator Muammar] Qaddafi, we have them with the Palestinians. Never have there been in Venezuela so many Palestinians serving in high positions in the Venezuelan political hierarchy. ” Venezuela may serve “not only as an occupation site for the Cubans,” Arria argues, “but for the Chinese, the Russians, the Indians, the Palestinians  …     [this] turns Venezuela into an agitation center that is potentially very serious, and the United States has never given this the stature and importance that it should have for them. ” Arria also noted that Venezuela has close ties to the Revolutionary Armed Forces of Colombia (FARC) a Marxist   organization that in 2015 was considered the wealthiest   terrorist organization in the world, surpassed in wealth only by the Islamic State and Hamas. “The relationship between Venezuela and the FARC in Colombia is extremely dangerous in my estimation because the FARC will soon be the most important and richest political party in Latin America. Those who do not enter the [President Juan Manuel] Santos pacification process will make of Venezuela an even greater drug and weapons transporting site than it is today. ” The “peace deal” between Santos’ government and the FARC will allow the terrorist group to evolve into a political party, and most FARC members are likely to avoid prison time for their crimes. The government of dictator Nicolás Maduro maintains the close ties with Iran that his predecessor Hugo Chávez cultivated, ties so close that Ahmadinejad risked a violation of sharia law to embrace Chávez’s mother at his funeral and declared he would return to earth alongside Jesus Christ and the Imam Mahdi, the Shiite Muslim figure believed to be in hiding until the prophesied end of the world. The ties between Venezuela and Iran  —   and its terror proxy, Hezbollah  —   are so close that multiple reports have accused Venezuela of selling legal documents (birth certificates, passports, etc) to   citizen Shiite terrorists to grant them easier access to the Western hemisphere than their Middle Eastern passports would allow. Maduro has also kept ties with Palestinian leaders and Syrian dictator Bashar   whose   SANA news agency regularly publishes friendly diplomatic notes from Maduro. Maduro has enjoyed economic and political support from China and Russia, and North Korea’s state newspaper, the Rodong Sinmun, regularly publishes announcements that dictator Kim   has received accolades from socialist officials in the Latin American country. Venezuela’s closest ally, however, is Cuba  —   a communist state with a history of gross disregard for human rights that has killed U. S. citizens engaging in humanitarian efforts and embraced U. S. fugitive murderers as “revolutionaries. ” Asked about the role the United States can play in weakening Venezuela’s socialist tyranny, Arria suggests there is little outside sanctions and frozen assets that the international community can do. “The United States is playing a very interesting role, imposing sanctions on people tied to the regime, but they can do much more important things like following the money,” he proposed. “The United States and the Europeans know perfectly where the money is that people tied to the regime keep” and can freeze it, he added, noting that Republican legislators like Florida’s Ileana   and Marco Rubio and New Jersey Senator Robert Menendez have proposed such measures. Should the international community act to freeze Chavista assets worldwide, they will count on a Latin America more convinced than ever of the evil of Maduro’s regime. “There is a political change in Latin America, the countries who were the primary accomplices of the tyranny in Venezuela  —   Brazil with Lula [da Silva] Argentina with [Cristina Fernández de] Kirchner  —   [those governments] are not there anymore,” Arria noted. “That has been of great importance because now we have two of the largest Latin American nations supporting our efforts to recapture liberty. This is a notable change. ” Even Mexico, Arria added, a nation with what he identified as a “very accommodating policy of ” has “broken with this policy and categorically pronounced itself on Venezuela. ” “Today we have Mexico, Brazil, Argentina, Colombia, about 90 percent of Latin America repudiates and condemns the Venezuelan regime,” he noted. With the support of the Organization of American State (OAS) and a few unforced errors from the Maduro regime, Arria sees an unprecedented chance to recapture the country from the socialists. “This is the largest peaceful insurrection in the history of Venezuela,” he notes. “In Latin America, we have never seen for 42 days straight 1, 000 protests, 20 daily. And it is not just in Caracas, it is in many towns. Every time they kill a young [protester] more mothers, fathers, siblings show up. ” Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742561690.0529366}