{"duration": 0.057526350021362305, "input_args": {"text": "'IOC bans 2 Russian athletes after positive doping tests from 2012 Olympics October 27, 2016 TASS olympics2012 , Doping scandal , olympics The IOC stated that reanalysis of doping samples of Ikonnikov and Starodubtsev \"from London 2012 resulted in a positive test for the prohibited substance dehydrochlormethyltestosterone (turinabol).\" Source: Reuters \\nThe International Olympic Committee (IOC) ruled on Oct. 27 to sanction two Russian track and field athletes after their doping samples collected at the 2012 Summer Olympics tested positive for banned performance enhancing drugs. \\nThe two Russian athletes at the issue are hammer thrower Kirill Ikonnikov and pole vaulter Dmitry Starodubtsev. \\n\"Kirill Ikonnikov, 32, of Russia, competing in the men’s hammer throw event (qualification and final) in which he ranked 5th and for which he was awarded a diploma, has been disqualified from the Olympic Games London 2012,\" the IOC said in its statement. \\n\"Dmitry Starodubtsev, 30, of Russia, competing in the men’s pole vault event (qualification and final) in which he ranked 4th and for which he was awarded a diploma, has been disqualified from the Olympic Games London 2012,\" according to the IOC. The Russian Olympians who refuse to return their medals and winnings \\nThe world’s governing body of Olympic Games stated that reanalysis of doping samples of Ikonnikov and Starodubtsev \"from London 2012 resulted in a positive test for the prohibited substance dehydrochlormethyltestosterone (turinabol).\" \\nThis is the second announcement of positive doping results of Russian athletes made by the IOC within the last two days. The IOC ruled on Oct. 27 to strip Russian runner Ekaterina Volkova of her bronze medal, won at the 2008 Summer Games in Beijing in 3,000-meter steeplechase, following positive results of her doping sample’s reanalysis. \\nThe Executive Board of the world’s governing Olympic body convened a special session on May 17 discussing efforts of stepping up the fight against the drugs cheats and furnish measures to protect clean athletes ahead of the Olympics in Rio. As part of its anti-doping efforts, IOC ordered reanalysis of doping samples of athletes from 2008 Olympics in Beijing and 2012 Olympics in London. \\nFollowing two rounds of re-testing, over 100 Olympians were reported to test positive for banned substances - at least 60 from the 2008 Games and about 40 from the 2012 Games. Among them were over 25 medalists from both Olympics.'"}, "time": 1742563587.1156616}