{"duration": 0.04352998733520508, "input_args": {"text": "'October 28, 2016 at 10:00 am \\nOMG, a Confederate Flag at school! Minds have been warped forever! “We can’t have that, the truth being spewed out in public like that, people might think they actually have rights!” \\n“What will you do without freedom” (William Wallace) I don’t know about how others feel, but, in my mind, we’re quite far from true freedom. You need to dispose rubbish? Better have your permit. Need to take a shit, better get your permit. Birth and Death certificates log you in and out and you’re property. \\nThe dehumanizing of the species is well underway. Your number is 8675309.21 Like rats in a cage, we eat, shit, and breathe. Our cage is our own minds, manipulated beyond measure by unscrupulous bastards with a greed that can never be quenched. It’s unfortunate that there are those that exist with a superiority complex and think their shit don’t stink. That superiority complex leads to wars. We’re the most advanced, civilized monkeys on the planet, but you steal my bananas, we’re goin’ to war. \\nA Confederate Flag? They get their undies in a bundy over a Confederate Flag? \\nYep, we must lie to our children and not tell them our true history. We must protect them from the psychological trauma of the truth! “Yes Jimmy, everything’s lollypops and rainbows!”“Here, take some more Ritalin and STFU!” \\nPharmacy regulars, it seems most parents on some damned drug too. “Well, I gotta get the kids pills, I may as well get some for me, as long as I’m there.” Hey Dr. Feelgood, what’s up? \\n“Mother’s Little Helpers” told the story decades ago. Now, snoop in anyones “Medicine Chest” and you’ll discover an array of concoctions, herbals, stimulants, downers, mood enhancers, sleeping pills, wake up pills, stay awake pills, two in the morning, two at noon, two at bedtime, repeat every day until your dead. \\nYou want to live forever? I don’t. I suspect bigger and better things await my arrival, at least, I hope so.'"}, "time": 1742564245.21365}