{"duration": 0.30482912063598633, "input_args": {"text": "'thomas koch / Shutterstock.com \\nTurkey is restless. President Erdogan is consolidating his power, trying to get rid of Parliament’s bothersome interference. He intends to reformat Turkey into a presidential republic, assuming the powers of an American president. He wants to be a Caliph, the people in Istanbul jest, and call him “Sultan Erdogan”. And the failed July coup has been used as the pretext for a huge purge in the power structure. However, the result may be better than many observers expect. \\nThat much I learned during my visit to Turkey, where I was given an opportunity to meet Turkish members of parliament, ministers and chief editors of the major mass media. I expected the failed coup belongs to history, but I was mistaken. \\nIts shadow lays heavily on everyday events in the country. I was shown the debris in the parliament, where a bomb dropped by the putschists fell; there is a photo exhibition showing previous successful military coups with a horrible picture of President Menderes on the gallows. The Turkish coups weren’t vegetarian. The army intented to keep power for itself and for its NATO allies. \\nThe July coup caused death of 240 people, half of them killed at the Bosporus bridge in a confrontation with the army. It is not much compared with the successful coup in Egypt, where the victims were counted in the thousands; and where the army defeated the legitimately elected moderate-Islamist President Morsi. \\nAfter the coup, Erdogan began the purge of Gulenists, or Fethullists, as they call the followers of Fethullah Gülen, the father of moderate Turkish political Islam and the creator of the vast school network reaching 160 countries. They were supposed to be the initiators of the coup. It is not really clear whether Gülen and his followers were behind the coup, but they are definitely enemies of Erdogan. \\nThe purge is not bloody but painful: the purged Gulenists aren’t shot, but they lose their jobs and often land in jail. Some seventy or eighty thousand men have been purged, 35,000 are imprisoned. They are judges, army officers, officials and many teachers. 500 persons have been purged from the Ministry of Foreign Affairs, some of them refusing to return home when called back. The state of emergency had been declared right after the coup and it was extended a few days ago for an additional three months. \\nSuch emergency justice is notoriously blind: one judge died three months before the coup, but he still was purged for his participation in the coup. Some companies belonging to Gulenists had their assets confiscated, while their obligations and debts remained with their dispossessed owners. It is difficult to defend oneself against such moot accusations as Gulenism. \\nThe Turks answer with a salubrious joke referring to ‘blind justice’: “A blind man screws whomever he can catch”. \\nThe government claims that the Gulenists formed a conspiratorial organisation called FETO, and described it as “a terrorist organisation.” They compare it to Daesh (ISIS), to the Medellin Cartel and (surprise!) to the Jesuits. \\nHowever, it is hard to comprehend in what way the Gulenists were terrorists. The worst thing they are accused of is fraudulently obtaining examination tickets for the civil service and thus securing good positions for their followers. This is surely not cricket, but hardly an act of terror. \\nHow can one unmask a Gulenist? This is not an easy task, but there are a few cues to revealing a crypto-Gulenist. \\nUsers of the ByLock messenger system are suspicious. This amateur messenger had been popular with Gülen followers and with some people implicated in the coup. One hundred fifty thousand users of ByLock are being screened. This messenger system had been hacked by the state security services some time ago, for it was very light on security. Afterwards, the plotters switched to the professional WhatsApp messenger. That one offered good security, but it was enough to seize a smartphone of one plotter to gain access to the rest. \\nAnother way to unmask a crypto-Gulenist is to locate the one dollar bill a follower of Gülen received from his guru. I was told by a member of parliament that a true Gulenist often sews his one dollar bill into his underwear, close to his skin. \\nThis idea has been pioneered by Lubawitscher Rebbe of the Chabad Hassids. The late Menachem Mendel Schneersohn also gave away dollar bills and even blessed vodka for his Hassids’ consumption. He conversed with God, and so did Gülen – according to his followers and adversaries. Hassids also tried to obtain influence, with considerable success – but they were never called “terrorists.” \\nGülen had been, and remains a very powerful figure in the Turkic-speaking world, especially in the ex-USSR and China, from Tatarstan and Yakutia to Sinkiang (Xinjiang). Youths from Kazakhstan and Uzbekistan studied in his schools as well. The Gülen movement had been considered the leading moderate pro-Western branch of political Islam. Practically all modern Islamists of Turkey passed through his schools. He was the most important ally of Erdogan in his uphill fight against the violently secular Kemalists who ruled Turkey until 2002. \\nIt is being said that the Kemalists were quite pro-American, but they refused to privatise public assets. Erdogan and Gülen were equally pro-American, and they accepted the idea of massive privatisation and sale of assets to American and other Western companies. Much of Turkish wealth is now in the foreign hands, and this is what inhibits Erdogan’s U-turn towards Russia. \\nWhile Erdogan and Gülen were friends and partners, Gülen helped Erdogan cut the secular and all-powerful army generals down to size. His followers, well established in the legal branch of government, organised the Ergenikon affair. They had claimed to have discovered a vast ultra-nationalist terrorist conspiracy called Ergenikon and sent 43 generals and many politicians to jail. Erdogan was amazed by this feat of Gülen, amazed and frightened, as this old man from Pennsylvania apparently controlled the legal system of the Republic from police to attorneys to courts. ORDER IT NOW \\nIndeed Erdogan had good reason to be afraid. In 2013, Gülen demanded that Erdogan let him fill one hundred seats in the Parliament, and when he was refused, he unleashed his legal machine upon his old buddy. In December 2013 Gülen followers in the police and the attorney general office accused the Erdogan government ministers of corruption. Among the accused there was Bilal, Erdogan’s son, and personal friends of Erdogan. \\nInstead of trying to refute the accusations and argue the cases in courts, Erdogan described the accusations as “an attempted coup.” He went to people, traveled the country, appealed to the masses, and the masses supported him. He forced the police and the courts to close the cases, and began his de-Gulenisation of Turkey. \\nFor people brought up with the concept of Supremacy of Law, this feels like a travesty of the normal order of things. However, the Law is not better than the Legislative or the Executive, it is less democratic, it is less connected to an ordinary citizen, it is more connected to the real power of money. In the US, there is no Gülen or Gulenists, but the judges beginning in the Supreme Court can disregard the people’s will as we observed when they pushed for same-sex marriages or for the right of corporations to buy candidates. They are the Deep State, so their uprooting is not bad an idea. \\nYes, we want justice, but we want democracy, too. Once, the US judges were all elected, all connected to the people, but not anymore. In Turkey, Gülen had been too successful in promoting his people to legal positions; he had lost the people’s support. And the Turks were ready to forgive Erdogan even some very real corruption: they felt he cared for the people, while Gülen and his followersdid not. For the legal system, corruption is a crime, and a corrupt politician must go to jail. If a politician is not corrupt, he can be sentenced for an indecent proposal to a woman. Thus the legal system has the power to block any politician, to override the political democratic process. Erdogan succeeded in overriding the legal system. \\nAfter his victory in December 2013, Erdogan accused Gülen and his followers of having created Ergenekon affair and arresting many innocent people. Generals and politicians regained freedom. \\nIn Ankara, I’ve met a leader of the Republican Kemalist parliamentary faction, Mustafa Ali Balbai. This handsome, wiry, muscular European-looking (as many Turks do) man did five years in jail for his alleged involvement in Ergenekon conspiracy. He was elected to parliament while still a prisoner, and lately had been freed. “Now the judges who sentenced me are in jail themselves”, he said cheerfully. \\nDid the Ergenekon plot exist at all? I asked the chief editor of CNN Turk, a powerful network, that played the key role in neutralisation of the July coup. “There was a core of a plot, a tiny core, and it was blown into a monster that it never was”, he said. In other words, there was a conspiracy, but a conspiracy of judges and of security services, the most frequent sort of conspiracy. \\nAs for present purges of alleged Gulenists, one number tells a lot about its extent. The Ankara police had received forty thousand tips denouncing various Gulenists, I was told on my arrival to the capital of Turkey. Wives denounce unfaithful husbands, landlords denounce tenants who are in arrears. It became a universal accusation; naturally the police are not arresting everybody, but a lot of people have been called in for investigation. This campaign reminds of McCarthy’s campaign in the US, or the campaign against Trotskyites in the USSR of 1930s. \\nFor some people, the purge is not consistent enough. An editor of a small newspaper, let’s call him Mehmet, told me: “If they were to purge all followers of Gülen, they would have no party and no Parliament faction. All the party bosses and all ministers passed through Gülen’s network. They purge only small people, the big ones escape the purge.” \\nHowever, there is no doubt, Erdogan takes the purge very seriously, as he did the Ergenekon conspiracy purge five years ago. He does not want to have Gülen standing behind his back ready to plunge a dagger in, and he prefers to completely remove completely that network, extensive as it was. Erdogan says that the July coup was the second, while the previous one was the attempt to use police and court in December 2013 against him and his family. \\nTurkey’s relations with Russia and with the US are directly connected with the story of the two coups. I visited Turkey right after Putin’s October 2016 visit, when the two leaders agreed to proceed with the very important gas pipeline, and completed the last, or the most recent stretch of their zigzagging relations. \\nThe Erdogan-Putin friendship suffered an unexpectedly strong setback in November 2015, when a Russian SU-24 jet was downed by an air-to-air missile fired by a Turkish jet over Syria. Relations were severed, Russian tourists ceased to arrive, Turkish vegetables lost their Russian market, oil and gas projects were shelved. \\nIn June 2016, there was another zigzag. Erdogan sent his apologies, and the relations turned better before the July coup. Possibly this step of Erdogan actually triggered the attempted coup. After the coup, it was roses all the way. In August, Erdogan visited Russia and met with Putin. This was his first trip abroad after the coup. And now, in October, Putin came to Istanbul and signaled that their relations were as cordial as ever. Even the gas pipeline project was signed, putting paid to the only leverage Kiev had on Moscow. ORDER IT NOW \\nThe Gulenists were useful here, as well: the downing of the SU-24 has been attributed to them, though previously Ahmet Davutoglu, the Prime Minister, claimed he ordered it. On the other hand, Davutoglu was close to Gülen and even visited him in 2013, but then, Gülen was still a persona grata in Turkey. It was alleged Davutoglu was being groomed to assume power in case of the coup’s success. \\nSo why did Turkey turn to Russia and away from the US, its old senior partner? Mehmet, the editor, ascribes this move to Erdogan’s well-developed self-preservation instinct. \\nIt appears that the American administration decided to ditch the unruly Erdogan some time ago, and install Gülen’s man Ahmet Davutoglu in his stead. A leading American neocon expert on Turkey, Michael Rubin, had demanded Erdogan’s head for quite a while. In March 2016 he called for a coup, in August 2016 he said Erdogan should blame himself for the coup, and now in October he predicted , or rather called for another coup. \\nThe new putsch is expected on November 10 or thereabout, and it will begin with Erdogan’s assassination, it being said. Erdogan considers his partnership with Russia and friendship with Putin give him his only chance to survive politically. \\nThe Americans are upset by Erdogan’s attitude to the Syrian Kurds. The Turkish president cares about preserving Turkey, the rump state of the vast Ottoman empire intact, while the Americans prefer to dismantle Turkey altogether, and create a Great Kurdistan from the mainly Kurd-populated areas of Turkey, Iraq and Syria. \\nThe Americans would like the Syrian Kurds to unite their enclaves, but Erdogan does not agree and actually stopped their offensive. \\nNow the battle for Mosul is a new point of disagreement. Turkey, says Erdogan, has certain rights on Mosul. The city and its area had been illegally seized by the British, the Turks say. Mustafa Kemal Ataturk tentatively agreed with Mosul being given to Iraq only in 1926, well after the Treaty of Lausanne (1923). And now Erdogan objects to Mosul being taken from the Daesh and transferred to the Kurds. The people of Mosul are also far from happy about the perspective of passing to Kurds or to the predominantly Shia government in Baghdad. \\nIn the struggle for Mosul and for Aleppo, in the battles between Kurdish enclaves in Syria, Erdogan goes against the will of the US. The problem is that there aren’t many important Turkish leaders who are ready to stand up to Washington. The Kemalist opposition and the Gulenist forces prefer to accept the American line, more or less. \\nIf Erdogan loses in a power struggle, Turkey may collapse into a civil war: between Turks and Kurds, between various Muslim movements and Kemalists. This was the purpose of the July coup, I was told by Ali Mustafa Balbai, the Republican MP. \\nIt is not an easy time, for sure. The Turkish lira went south. The agenda has been changed: once, Taksim square demonstrated against Erdogan, now they demonstrate against the overwhelming presence of Syrian and Iraqi refugees. Not only the European Right: Turkey also feels there are too many refugees. They are afraid the battle for Mosul will force the two millions inhabitants of that city into Turkey. \\nAnd the demonstrators are different. It is ordinary people who demonstrate against the influx of Syrians, while the educated and Westernised Turks demonstrated against Erdogan. The latter are quite unhappy and discuss whether they have a future in Turkey. The political class is unhappy, too. They do not cherish the authoritarian rule of Sultan Erdogan. Gulenists are extremely displeased. The generals are still reassessing their positions after so many purges. And the long-standing dispute between the secular and religious populations goes on unabated. \\nWhile the US has a definite idea which way should Turkey should go, its competitor, Russia, just does not care about Turkish internal politics. Or about anybody’s else internal politics. The Americans under Obama, and presumably even more under Clinton are likely to interfere; to impose their rules from swimming suits to same-sex marriages. The Russians do not interfere. \\nThis is their tradition since the times immemorial. They did not interfere into private life of Uzbeks and Tajiks, and Chechens, and Finns, and Poles. That’s why inside Russia one can find areas ruled by Muslim law, by Buddhist tradition and even by sheer polytheist custom. \\nFor the Russians, Erdogan is a valuable partner, and they let him – and other Turks – decide whether they should have a parliamentary or a presidential republic and whether girls should go in a scarf or without. You may be sure the Russians will not teach them what to do in their private life. This is a big advantage of having the Russians for allies. \\nWe shall see whether having such good allies is enough in order to survive. Much is hanging upon the US elections: Erdogan was furious when Ms. Clinton referred to Kurd ambitions. But then, the whole world waits for the decision of the American people. \\nIsrael Shamir can be reached at ORDER IT NOW'"}, "time": 1742563935.3721626}