{"duration": 0.05666947364807129, "input_args": {"text": "'Dennis Paul Habern \\nOf all the turds that made the list, I am highly disappointed to read Brianna Keilar’s name, but of course, I shall give her the benefit of the doubt, as I maintain that she is only protecting her source of income, if even that is a worthy excuse. Therefore, we have to hold those responsible, accountable, commencing at the top, and that means indicting this worthless Black turd of a POS of a Tar-Baby of a Muslim POTUS and his girlfriend, George Soros, the former and still, NAZI collaborator during WW2 in his native country of Hungary, where this Communist mutt joined a group of NAZI thugs to evict JEWS from their homes and to confiscate their property for Adolf Hitler and the Third Reich. I am surprised by now, that any group of patriotic citizens have not stormed the White House gates to get rid of this worthless Black POS of a Communist, Anarchist, Marxist, Socialist, Criminal and Muslim, in mirroring the 1789 French peasants whom grabbed their muskets and pitchforks and stormed the Paris Bastille (prison) and arrested their worthless King and Queen. The current king and Queen of the United States are currently residing in the White House. Hint, hint, hint, hint!!! The sooner these turds are removed from the White House, Donals Trump can have the entire structure, fumigated to get rid of the political stench that has been accumu- lating since 2009, if you follow. The Bible has maintained that this worthless Black POS of a Muslim POTUS, will not finish his second term. Keep your fingers crossed. \\nThe Clinton’s and the worthless Black turd from Kenya of a POS of a token Tar-Baby of a Muslim POTUS, are in a classification all by themselves: “CEE YOU NEXT TUESDAY.” islesmetsgiantsfan \\nJust look at today. CNN and ABC (Stephanopoulos) asked the same exact question at different times. “Your backers are questioning why would you take time out of your schedule to go to a ribbon cutting ceremony when you should be on the campaign trail.” I thought Trump answered the question smartly. I have been to multiple events yesterday, I am going to 3 more today after this. I built this hotel below budget and ahead of schedule. Why shouldn’t I take an hour to go to this ceremony. Hillary goes to a Adelle concert and everyone says isn’t that wonderful. I go to events in front of thousands and get criticized for taking an hour by the media. Now you are going to tell me this wasn’t coordinated by Hillary’s campaign and the DNC? 2 reporters from 2 different organizations that normally fight for ratings ask the same question. rueangel \\nUmmm,… Would it be considered to be ,..’Anti Semitic’,..of me to point out that the entire , so called, “mainstream” media is owned & operated by members of the International Zio.Jew Criminal Cabal,.? \\nAnd might I suggest, that, ALL news coverage is slanted in such a way as to benefit this International Zio/Jew Criminal Cabal in furthering their, ongoing, conspiracy to achieve a ,..’One World’,.. government, which will be dominated by World Jewry,..? runsinquicksand \\nIt is well known that a lot of people in the press of various levels are married to Washington insiders, politicians, celebrities, and each other. They buy each other off. It’s disgusting. lloyd Lisco \\nAdd all these names to your list. susan.marsala \\nGet paid 90 bucks /day for working on the web from comfort of your own home for couple of h /day… Get regular payment every week… All what is required is a laptop or computer, internet connection, and also some free time… http://ow.ly/n1nP303oO1A GabbyinFlorida \\nWE need to boycott these losers and watch advertising dollars stop. America better wake up soon or we will look like Cuba Venezuela and all those other Communist countries. HILLARY Clinton is dangerous and a liar and SATAN. Subscribe TODAY and Never Miss Another D.C. Clothesline Article Email Address'"}, "time": 1742563051.495925}