{"duration": 0.01198434829711914, "input_args": {"text": "'Customers of YouTube TV, the upcoming television cable package from YouTube, will be forced to watch commercials even on recorded shows, according to a report. [“Let’s say a subscriber decides to record ABC’s ‘Blackish’ episode in hopes of being able to catch up on it in a few days, skipping over the ads while they watch. Within 24 hours, though, YouTube likely will have the   version of that show available, since many TV networks offer cable providers at least the last five episodes for catch up on demand,” explained The Wall Street Journal. “In   versions of shows, TV networks typically disable   over ads to make sure they get credit from marketers who pay for the commercials. ”  “If YouTube TV does have the   version of Wednesday night’s ‘Blackish’ available, then it won’t let its subscribers watch a recorded version that allows for ” they continued. “Instead, viewers will be forced to watch the   episode and all of the ads, even though consumers thought they saved the show on their DVR. ” The move has been attributed to YouTube’s various deals with companies such as Disney, 21’st Century Fox, and NBC Universal, though it has also been noted that “if the   version doesn’t exist, the YouTube TV subscriber will be able to watch a recorded version and skip ads. ” YouTube TV, which was announced in March, acts as a “skinny bundle” to compete with cable television providers at a much lower price. As reported by Breitbart Tech’s Jack Hadfield last month, “YouTube TV will cost customers only $35 a month, which gets them 6 accounts, 3 of which can be used to stream live TV concurrently, and access to 40 different networks, including ‘ABC, CBS, FOX, NBC, ESPN, regional sports networks, and dozens of popular cable networks,’ according to a recent entry on the official YouTube blog. ” “Each of the accounts will be personalized and utilize   searching algorithms, similar to Netflix’s profile system,” wrote Hadfield. “Users also gain access to YouTube Red original shows and an unlimited cloud DVR (1 per account) to record live TV. ” The service is only initially available in select U. S. cities, including New York City, Chicago, Los Angeles, Philadelphia, and the San Francisco Bay Area. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628531.8773353}