{"duration": 0.11512303352355957, "input_args": {"text": "'NICE, France  —     Rivère accepts the compliment, but rejects the comparison. Rivère, the president of OGC Nice, can see why his team, this season, has been cast as France’s equivalent to Leicester City. He knows their stories follow the same arc: a provincial David defying overwhelming financial obstacles to outwit Goliath. He appreciates that the parallel is intended as praise, a convenient, flattering shorthand to explain the scale of Nice’s achievement in competing with Monaco and Paris   at the summit of France’s Ligue 1 over the last six months, maintaining a title challenge despite a budget that is a small fraction of its two bigger, richer rivals’. Sitting in an office at the back of Nice’s official club store, though, Rivère does not indulge the comparison for long. What Leicester did in winning the Premier League last season, he says, came from the realms of fantasy. It was an alignment of the stars, one that can no more be explained than it can be repeated. Nice, he is convinced, is different. If Leicester was a wonderful accident, Nice’s metamorphosis is entirely by design. From the outside, it is tempting  —   though misguided  —   to put a specific date on Nice’s ascendance: Aug. 31, 2016 (more on that below). In reality, the club has been growing, slowly and steadily, ever since Rivère, a real estate magnate, took control in 2011. When he arrived, he said, it was a “club with a bad reputation, without a strategy, a club in perdition. ” He has changed all of that. Nice moved into a new stadium, the     Allianz Riviera, in 2013. Rivère is overseeing the construction of a new training facility. He has even delivered on his promise to find outside investment, having sold 80 percent of the club to a consortium of Chinese and American investors. Results on the field have consistently improved, too, culminating in last season’s   finish under Coach Claude Puel. When Puel left last summer for Southampton  —   a more apposite English parallel for Nice  —   Rivère persuaded Lucien Favre, an astute Swiss coach who had led Borussia Mönchengladbach to the Champions League, to replace him. “Like Puel, he was not at the level of Nice when he arrived,” Rivère said. “He was much higher. ” The squad Favre inherited was one of youth and promise, yet he has lifted it to another plane despite a wide disparity in resources. Nice’s annual budget is $45 million. Monaco’s is three times that, and P. S. G. ’s more than 10 times as large. Nice, though, has led the league for much of the season. A place in the Champions League next season now looks like the least of its ambitions. The spotlight, though, always prefers to fixate on hares, rather than tortoises. It was only on Aug. 31, when Rivère confirmed the arrival of Mario Balotelli, the enigmatic,   Italian striker, that the rest of the world sat up and took notice of what was happening on the Riviera. The year before, Nice had signed an equally tempestuous character, the France winger Hatem Ben Arfa. The move piqued interest in France, and a degree of curiosity from the rest of Europe. Balotelli was another order of magnitude. Dozens of reporters descended on the Riviera. L’Équipe, the French sports daily, devoted five pages to the signing. Nice’s name flashed around the planet. “With Ben Arfa, it was Europe,” Rivère said. “With Balotelli, it was the world. ” Much of the coverage, naturally, centered on Balotelli’s reputation, his truculence and his rebelliousness. Many felt that Nice  —   like Liverpool, Milan and Manchester City before it  —   would struggle to control Balotelli, to restore his focus. The move was dismissed, in some quarters, as a publicity stunt. Rivère was more confident. “I do not often do this,” he said, “but I looked at everything that had been said about him. I asked to see the videos of his matches, the good and the bad. I saw 20 bad things and just one good thing. “One day, after training at Manchester City, he met a small boy. He asked him what he was doing there, and the boy said he did not want to go to school, because he had been bullied. So Balotelli took the boy to school in his car, so the boy could feel like a star, and sorted out the problem. I said that if he had done this, he must have a good heart. ” Rivère has been proved right: Working to a customized training plan, Balotelli has thrived, emerging as a central plank of Nice’s title challenge. He has scored 11 goals in 18 games though there have been controversies, they have happened to him, rather than because of him: a red card that was later rescinded, and racial abuse directed toward him during a game at Bastia. “When a player arrives, I guarantee only one thing: that if they come to play here, they will find a family club, a good atmosphere, a good group,” Rivère said. “They will find a smile. “When you have a player who is in trouble, the problem is often in the head, not the feet,” he continued. “If you had talent in the past and lost it, with us you have more chance of rediscovering the pleasure of playing football. ” That is not to say Rivère is running some sort of corrective institution for the chronically wayward. Nice benefits from Balotelli just as much as he benefits from Nice, if not more on the field, of course, but off it, too. Rivère referred to the Italian as a marketing “accelerator. ” That is particularly important as the club tries to grow. Nice is one of the oldest soccer teams in France, and one of the proudest, too: It is the only French club with its own anthem  —   “Nissa la Bella,” or “Beautiful Nice,” in Niçois dialect. When its new stadium opened, Nice arranged for the turf from the center circle at its old home, the Stade du Ray, to be laid into the field, a symbolic gesture by club officials to worried fans that though the location had changed, Nice’s heart remained the same. And yet the city seems too genteel, too well heeled, to feel as   as Marseille, for example, a couple of hours down the Côte d’Azur. Soccer tends to thrive where it is the single unifying factor at first glance, that is not the case in Nice. The mountains are an hour away, Monte Carlo even less. There are beaches and nightclubs, money and glamour. All act as competition. So signing Balotelli was not just a way to garner international attention, but another effort to draw fans away from the various other delights of the area and into the stadium. “We try to make matches a complete experience,” Rivère said. He has always demanded that the style of play be “popular,” appealing. The club regularly hands out free tickets to local children, and it has refitted all of its V. I. P. areas some do not close until the small hours of the morning. There was even an ice rink installed outside the Allianz Riviera before Christmas. It would be unfair to dismiss all of those initiatives as gimmickry, an artificial imposition of a soccer culture. Beneath the surface, the bond between this city and this club is strong. At the start of the Promenade des Anglais, in the heart of the city, is a memorial to the 86 people killed in the Bastille Day terror attack last year. It is an impossibly moving sight: a bandstand awash with thousands of teddy bears left to commemorate the dead, poems written in their honor, flags, stones, candles and messages of condolence. Rival fans have made pilgrimages here, during the season, to pay their respects: a Montpellier pennant, a Lens jersey, a scarf from F. C. Krasnodar, a Russian team, all nestle among the tributes. And everywhere, there are flashes of red and black, OGC Nice’s colors, the team’s identity acting as a surrogate for that of the city. It is a role that Rivère, and the club as a whole, feel keenly. OGC Nice has helped raise hundreds of thousands of euros for the families of the victims. In the 86th minute of every home game, it remembers those who were murdered. It would be glib to say the tragedy has helped inspire Nice’s success this season nobody at the club would make that claim. But they know that such events cannot only put soccer into perspective but, in the aftermath, also lend it a greater significance. This year they have a greater responsibility and, as they write this latest chapter on their fastidiously planned journey, an opportunity for a greater impact, too. “What happened on July 14 wounded every citizen of Nice,” Rivère said. “It gives us even more willingness to succeed. We are like a medicine, for those who love football. The day of the match, the day after, we help people to forget. ”'"}, "time": 1742564599.4810903}