{"duration": 0.10854697227478027, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nThe forgotten man decided the presidential election. Donald Trump persuaded the forgotten man to repose his anger and frustration and power into Trump’s hands. Who is the forgotten man? What does he want from government? Why did he vote for Trump? \\nWhen the tide began to turn against Hillary Clinton on Tuesday night, I planned to write this column about the unwarranted and unlawful injection of the FBI into the political process. At the time, I was seated with the Fox News number crunchers and generally was exposed to trends and vote totals — and the number crunchers’ lucid explanation of them — long before they were revealed on-air. I am more an ideas guy than a numbers guy. \\nOn Tuesday night, the numbers were so overwhelming it was clear that the FBI had nothing to do with the outcome of the presidential election. The numbers on Tuesday told a tale that needs to be related. What the FBI did and failed to do assaulted the rule of law, but that is for another column. \\nWhatever the impression Trump may have given you — a carnival barker, a hero, a jerk, a courageous leader — he brilliantly tapped into a deep vein of millions of American men and women who believe they have been forgotten by the government they pay for. These good people have been alienated by the elites who dominate American government and culture and civic life. \\nOn Tuesday night, they found a home. \\nThe forgotten man believes that the Obama administration doesn’t care about him. The forgotten man knows that the government put into place regulations of economic activity that put him out of work or into a lower-paying job. These forgotten men and women resent the Obama administration’s telling them they must have health insurance or they will be taxed for it and then so incompetently manipulating the marketplace as to cause the cost of that insurance — often an unwanted product — to skyrocket. \\nThese good folks cringed when their family doctor told them that he could no longer afford to treat them because the feds had overregulated the practice of medicine. They simply couldn’t believe that their own government would make the practice of medicine so expensive that doctors in droves could not afford to stay in business. And they were outraged when their doctors told them the feds could see their medical records and dictate their medical treatment. \\nThe forgotten man has profound resentment for a government that is telling him how to live. The forgotten man’s union dues have shot up. His union leaders use his dues to support political candidates he doesn’t know or like. Yet he has usually voted for the Democrats — out of a traditional belief that the Democrats would think of him and his needs when framing federal legislation. They haven’t. \\nThe forgotten man speaks his mind but isn’t drawn to lofty arguments about the freedom of speech. The forgotten man wants the government to work but couldn’t tell you which aspects of its behavior are unconstitutional. The forgotten man wants elected officials who don’t and won’t forget him. The forgotten man hopes he never sees a judge in a courtroom, but if he does, he wants to be judged by someone who understands him. \\nThe forgotten man wants sexual freedom and privacy, but not babies being ripped from the womb for convenience. The forgotten man doesn’t want war but loathes military defeat even more. The forgotten man wants inexpensive goods but will pay more if they are made here by people like him. The forgotten man doesn’t want the government to take so much money from those who work hard that they lose their incentive to work or close up their businesses and kill jobs. The forgotten man wants everyone to be able to keep the lion’s share of what he earns. The forgotten man forgives but doesn’t forget. Trump got all that. Trump tapped into all that as no presidential candidate had since Ronald Reagan in 1980. \\nThe forgotten man viewed Clinton as having no interest in him. The forgotten man believed that Clinton would work for special interests and not for him. The forgotten man saw that what Trump grasped, Clinton overlooked; what Trump understood, Clinton ignored; and what Trump turned into votes, Clinton took for granted. \\nI doubt that the forgotten man saw what I did recently. At the Al Smith dinner in New York City last month — a 1,500-person black-tie fundraiser for the Archdiocese of New York at which Trump’s speech was mediocre and Clinton’s was stellar — I tried to shake the hands of both of them but ran into a Secret Service roadblock around the head table. Trump waved to me with a twinkle in his eye. When I saw Clinton, I saw a lonely face without joy. On Wednesday morning, it dawned on me that she was doomed and she knew it. \\nThe forgotten man knew it, as well. \\nCopyright 2016 Andrew P. Napolitano. Distributed by Creators.com.\""}, "time": 1742562033.2479818}