{"duration": 0.10827279090881348, "input_args": {"text": "'Gerard Baker, the editor in chief of The Wall Street Journal, vigorously defended his newspaper’s coverage of President Trump on Monday, rejecting suggestions that The Journal had not been aggressive enough. Facing tough questioning at a    meeting with the staff, Mr. Baker denied that The Journal had been too soft in its coverage, according to several people who participated in the meeting. He suggested that other papers had discarded objectivity, and that anyone who wanted to work at an organization with a more oppositional stance toward the administration could find a job elsewhere, these people said. “It’s a little irritating when I read that we have been soft on Donald Trump,” he said, according to three of the people. During the meeting, which lasted more than an hour and a half, Mr. Baker addressed the unease among some in the newsroom who feared that the paper was holding them back from aggressively covering Mr. Trump  —   and that he might be playing a role in shaping more favorable coverage. Mr. Baker offered a different interpretation, according to two participants in the session: The administration wants to engage the news media in a battle, he said, and The Journal should not become part of it. “We can’t allow ourselves to be dragged into the political process, to be a protagonist in the political fight,” he said, according to one of the people. He said that Americans already distrusted the news media, and that if The Journal covered Mr. Trump in an overly confrontational way, that distrust might increase. He joked that any stories suggesting The Journal had been soft in its coverage of Mr. Trump were akin to “fake news. ” The meeting came after months of uncertainty and frustration in the newsroom. The Journal has begun a sweeping newsroom strategy review, called WSJ2020, that the management recently indicated would result in about $100 million in cost savings. Buyouts and layoffs have roiled the staff. A significant overhaul of the print newspaper resulted in the elimination of some sections, including Greater New York, and the consolidation of others. And though employees recently ratified a new union contract with Dow Jones, the publisher of The Journal, there is worry that there could soon be another tense standoff. Morale sank lower last week when Mr. Baker said that Rebecca Blumenstein, a deputy editor in chief who had been at The Journal for 22 years, was leaving for The New York Times, where she will become one of the paper’s   editors. The announcement surprised and saddened many in the newsroom, where Ms. Blumenstein had been viewed as a potential successor to Mr. Baker. At Monday’s meeting, Mr. Baker answered questions about The Journal’s strategy going forward and acknowledged that the paper had to address concerns about diversity and offer more opportunities for women in the newsroom. But the issue of covering Mr. Trump was front and center, after an episode two weeks ago when Mr. Baker sent a note instructing editors to avoid the phrase “seven majority Muslim countries” when writing about Mr. Trump’s executive order on immigration. “It’s very loaded,” Mr. Baker wrote at the time. “The reason they’ve been chosen is not because they’re majority Muslim but because they’re on the list of countries Obama identified as countries of concern. ” Mr. Baker later sent a note to employees clarifying that there was “no ban on the phrase ‘  country’” but that the publication should “always be careful that this term is not offered as the only description of the countries covered under the ban. ” The discontent among a faction of journalists over coverage of Mr. Trump stretches back months, according to current and former employees. There was unease in the newsroom after Mr. Baker wrote a column in The Spectator, a conservative British magazine, about Mr. Trump’s victory. During the meeting on Monday, Mr. Baker, in answer to a question about the column, admitted that he probably should have resisted the temptation to write it, according to some of the people who participated. The Journal’s coverage has also drawn criticism from outside. In late November, after Mr. Trump falsely claimed on Twitter that “millions of people” had voted illegally, the paper was derided online for printing a   headline that parroted Mr. Trump’s assertion without pointing out that it was inaccurate. In a statement at the time, a spokeswoman for The Journal said, “We evaluate all statements by   Trump for their news value and then subject them to the tough, thorough and impartial reporting we bring to all issues we report upon. ” Disturbed by the paper’s coverage, a number of journalists at The Journal began communicating by email about their concerns. The internal email chain, a portion of which was obtained by The Times, included general concerns about how articles on the new administration were being framed and objections to certain wording choices. Some on the email chain proposed writing a letter to top management or creating a “no euphemisms” style guide. “We need to be able to cover the new administration with the probing, aggressiveness and authority that our readers deserve and pay for,” one journalist wrote. It is an especially sensitive time for journalists, particularly in the mainstream news media, and journalists in many newsrooms are on edge. Relentless   has ravaged news organizations that have yet to find ways to offset steep declines in print advertising and circulation. Against this backdrop, Mr. Trump and his aides have vilified the news media, calling it the “opposition party” and singling out certain organizations as purveyors of “fake news. ” There are some bright spots at The Journal. In an earnings call last week, Robert Thomson, the chief executive of News Corporation, said The Journal, like other publications, had benefited from interest in the election, adding more than 110, 000 digital subscriptions in the quarter. The Journal now has more than one million digital subscribers, representing more than 50 percent of the publication’s total subscribers, he said. Still, total advertising revenue at Dow Jones, a subsidiary of News Corporation, declined about 20 percent in the last quarter. Mr. Baker said on Monday that about 200 people had taken buyouts or been laid off, but that there were no plans for further layoffs.'"}, "time": 1742562241.8363469}