{"duration": 0.11211919784545898, "input_args": {"text": "'A jarring regulatory action this week against five large banks was bound to bring Wall Street to the fore in the Democratic presidential debate on Thursday. Hillary Clinton and Bernie Sanders differ on how to handle banks that are deemed “too big to fail. ” The complexities of bank regulation have made it hard for the candidates to express themselves clearly on Wall Street issues. Mr. Sanders, who is quite knowledgeable on the subject, nevertheless left some readers of a recent interview with The Daily News concerned that he wasn’t. On Thursday, Mrs. Clinton might have left viewers with plenty questions about what she’d actually do to break up the banks. The banking discussion started with a question about the news that sent a chill through the large banks this week. Federal regulators rejected special plans that large banks now have to draw up to show how they would go through bankruptcy in an orderly fashion. Early in the debate, CNN’s Dana Bash noted that, if the five banks don’t fix the plans, the regulators could, as a last resort, require them to break up. Ms. Bash asked Mrs. Clinton: “So, as president, would you call on regulators to start the process of breaking up these banks, something that the law not only allows, but actually explicitly encourages?” “Absolutely,” Mrs. Clinton said. But what followed was not absolutely clear. Mrs. Clinton described two powers she would have under the   Act, the law Congress passed to overhaul the financial system. She said how these powers might be used to break up the banks. But she might have left viewers confused over when she could use them. Under one interpretation, Mrs. Clinton appeared to be saying that she would quickly use the powers to pressure the banks to get smaller  —   an aggressive stance that might win admiration from Mr. Sanders’s supporters. But it is also plausible that Mrs. Clinton was saying that, while her administration would emphasize a tough line on the banks, it would not actually use the   powers until a serious debacle started to occur in the banking sector. This would be a more reactive approach, and, if no banking disasters happened on Mrs. Clinton’s watch, it could leave the banks at more or less the size they are today. Here is what Mrs. Clinton said to Ms. Bash: “I will appoint regulators who are tough enough and ready enough to break up any bank that fails the tests under  . There are two sections there, and if they fail either one, that they’re a systemic risk, a grave risk to our economy, or if they fail the other, that their living wills, which is what you’re referring to, are inadequate. ” Mrs. Clinton added: “I have been standing up and saying continuously, ‘We have the law we’ve got to execute under it.’ So you’re right: I will move immediately to break up any financial institution. ” When Mrs. Clinton said “living wills,” she was referring to the special bankruptcy plans that five big banks drew up, but that failed to pass muster with regulators. If after two years, the banks have not fixed the deficiencies that the regulators identified, the regulators can require the banks to take steps that would make them smaller. But the five banks, which include JPMorgan Chase and Bank of America, are now going to do everything they can to get their living wills in order. The last thing they want to do is give the regulators the right to demand that they downsize. So as things stand today, it is unlikely that Mrs. Clinton will get the chance to use the living wills to carry out a sweeping breakup of the biggest banks. Nor is the other test going to give the next president an    tool to dismantle large banks. This is the Kanjorski amendment, an obscure provision in   that is named for Paul Kanjorski, a former Democratic representative who helped design this part of the legislation. In her answer, Mrs. Clinton said the government would have the power to act with force when banks become “a grave risk to our economy. ” The Kanjorski amendment does just that. It gives a council of regulators the ability to determine that a large bank or financial firm poses a “grave threat to the financial stability of the United States. ” After a vote, the council can demand the bank take certain steps to reduce its riskiness, but if those are deemed inadequate, the council can tell the bank to sell assets. But if Mrs. Clinton were to use this power simply to break up the banks, and not because the system was in imminent danger, it would be viewed as a radical, even destabilizing, step. The chances of the Kanjorski amendment’s being used outside of an emergency to achieve broader policy goals are close to zero. Mrs. Clinton most likely knows this. And it may be why she favors legislation to do things that   cannot do. This is from her website: “As president, Clinton would pursue legislation that enhances regulators’ authorities under   to ensure that no financial institution is too large and too risky to manage. ” It adds: “If firms can’t be managed effectively, regulators would have the explicit statutory authorization to require that they reorganize, downsize or break apart. ” Getting Congress to pass a new law to break up the banks would be hard. But, as we have seen from looking closely at Mrs. Clinton’s assertions, the existing law does not make it easy.'"}, "time": 1742564089.7926478}