{"duration": 0.06457018852233887, "input_args": {"text": "' Putin Asks: \"Is America Now A Banana Republic\" By Tyler Durden\\n \" Zero Hedge \" - Moments ago, Russian president started speaking at the final session of the Valdai International Discussion Club\\x92s 13th annual meeting in Sochi. More than 130 experts and political analysts from Russia and other countries are taking part in this year\\x92s three-day meeting, titled \\x91The Future in Progress: Shaping the World of Tomorrow\\x92.\\nWhile Putin\\'s speech can be seen below, he has already had a handful of pearls, most notably the following statement he just said in response to accusations that Russia could influence the US election:\\n\"The number of mythical, dreamt-up problems include the hysteria - I can\\'t think of another word - that has broken out in the United States about the influence of Russia on the current elections for the US president. Does anyone seriously think Russia can somehow influence the choice of the US people ?\"\\nHe ended that phrase as follows: \"What, is America a banana republic?!\"\\nPutin mocks claim that Russia is trying to influence the US elections: \"What, is America now a banana republic? America is a great power.\"\\n\\x97 Steve Rosenberg (@BBCSteveR) October 27, 2016\\nAnd then, to emphasize his trolling, added the following: \"correct me if I am wrong.\"\\nHe also had a handful of notable comments on the growing specter of a new cold war, starting by assuring the world that \"Russia doesn\\'t plan to attack anyone\", and adding that \"Russian militaty threat is a myth\" although we are confident many in the Pentagon would be delighted to claim the opposite.\\nHe said that NATO has outlived its usefullness as a structure and on the topic of the escalating proxy war in Syria, Putin had a simple comment: \"Our agreements with the US on Syria did not work out.\"\\nFollow Putin\\'s speech below.\\nPresident of Russia Vladimir Putin : Tarja, Heinz, Thabo, colleagues, ladies and gentlemen,\\nIt is a great pleasure to see you again. I want to start by thanking all of the participants in the Valdai International Discussion Club, from Russia and abroad, for your constructive part in this work, and I want to thank our distinguished guests for their readiness to take part in this open discussion.\\nOur esteemed moderator just wished me a good departure into retirement, and I wish myself the same when the time comes. This is the right approach and the thing to do. But I am not retired yet and am for now the leader of this big country. As such, it is fitting to show restraint and avoid displays of excessive aggressiveness. I do not think that this is my style in any case.\\nBut I do think that we should be frank with each other, particularly here in this gathering. I think we should hold candid, open discussions, otherwise our dialogue makes no sense and would be insipid and without the slightest interest.\\nI think that this style of discussion is extremely needed today given the great changes taking place in the world. The theme for our meeting this year, The Future in Progress: Shaping the World of Tomorrow , is very topical.\\nLast year, the Valdai forum participants discussed the problems with the current world order. Unfortunately, little has changed for the better over these last months. Indeed, it would be more honest to say that nothing has changed.\\nThe tensions engendered by shifts in distribution of economic and political influence continue to grow. Mutual distrust creates a burden that narrows our possibilities for finding effective responses to the real threats and challenges facing the world today. Essentially, the entire globalisation project is in crisis today and in Europe, as we know well, we hear voices now saying that multiculturalism has failed.\\nI think this situation is in many respects the result of mistaken, hasty and to some extent over-confident choices made by some countries\\x92 elites a quarter-of-a-century ago. Back then, in the late 1980s-early 1990s, there was a chance not just to accelerate the globalisation process but also to give it a different quality and make it more harmonious and sustainable in nature.\\nBut some countries that saw themselves as victors in the Cold War, not just saw themselves this way but said it openly, took the course of simply reshaping the global political and economic order to fit their own interests.\\nTo be continued.'"}, "time": 1742562251.654462}