{"duration": 0.10778427124023438, "input_args": {"text": "'“Invisible Nation: Homeless Families in America” A book by Richard Schweid \\nAbout a quarter century ago, I taught a film course at UC San Diego. I drove from my home in Los Angeles once a week, returning the same day after my evening class. After one class session, some students requested to see me the next morning because they were unable to make my late afternoon office hours before class. I consented and stayed in San Diego that night. \\nFailing to find any local friends at that hour, I looked for an inexpensive motel. The clerk at a relatively nearby dump stood behind a glass partition and handed me the room key after I paid the cash-only daily rate. He sternly informed me that no visitors were allowed. The room smelled of cigarettes and looked extremely unappealing. The carpet was filthy and deeply stained. I never removed my socks the entire night. The foul smelling bathroom sink was also stained. I slept fitfully on the threadbare, unwashed sheets and kept the bathroom light on all night. At 6 a.m., I rose and left, feeling as though I had been released from jail. \\nRichard Schweid’s remarkable and disconcerting new book, “Invisible Nation: Homeless Families in America,” brought back my unpleasant San Diego motel memory. This exceptional work of journalism chronicles the lives of America’s homeless families, focusing dramatically on the plight of the thousands of homeless children, many living for protracted periods in motels eerily similar to my dreadful San Diego “fleabag.” Schweid traveled through a nation that privileged Americans generally try to avoid and deny. These more fortunate Americans are embarrassed, indifferent and sometimes actively hostile to the desperate plight of their hidden neighbors. Schweid’s book is a compelling account of his findings. \\nThroughout much of the 20th century, the homeless in America consisted primarily of men, often wandering from location to location. As late as 1980, families comprised only 1 percent of the homeless population. That number is now 37 percent, not only a huge increase, but a national catastrophe. Entire families now live in the streets, in cars, in temporary shelters, and often in one miserable motel room, waiting for some permanent relief in the form of a stable apartment. Schweid examined family homelessness in five U.S. cities: Nashville, Tennessee; Boston; Fairfax, Virginia; Portland, Oregon; and Trenton, New Jersey. He lived in the motels he described and listened carefully to the families’ stories, the basis for his grim observations and conclusions. \\nThe accounts of family motel stays are the most dramatic feature of the book. Single mothers (and sometimes fathers) with one or more children are greeted by mildewed shower curtains, cigarette stains and lingering odors, cracked mirrors, stained rugs and sheets (often with holes) and other physical indignities, including roaches. Young boys and girls eat only what can be cooked in motel room microwaves and hot plates, often subsisting on the unhealthy fast food options from nearby restaurants and convenience stores. A lack of refrigerator space ensures that sugary beverages and precooked lunchmeats are common; fresh fruits and vegetables are rare or nonexistent in most of these motel settings. \\nEspecially in cold weather states, children can play only in motel corridors, often encountering unsavory residents and visitors with criminal and drug histories and involvements. The children usually wait in these corridors for buses to transport them to schools, which they change with devastating regularity as their families move from motels to shelters and other temporary housing facilities. \\nAll too regularly, families are evicted from these barely habitable motel rooms, invariably for not paying the (exorbitant) rent. Typically, they are locked out and lose their meager possessions. Schweid makes the point with heartbreaking poignancy: “Children’s toys and favorite things were gone forever. Anyone who has ever watched a young child form an attachment to some beat-up raggedy doll, some scrap of material ... will understand that its sudden overnight loss may generate terrible anxiety.” \\nThe results are distressingly predictable. Children residing in these motels (and shelters) frequently act out in school and perform poorly. Physically, they suffer from a multitude of ailments, including ear infections, asthma, skin disorders, dental decay, obesity, depression and many others. Some of these are serious and chronic, and can have lifelong detrimental effects. Failure to address childhood dental problems, for example, often leads to massive tooth loss, gastrointestinal disorders and emotional trauma, among other consequences. \\n“Invisible Nation” also addresses the plight of homeless families in shelters, many run by local governments and sometimes assisted by churches and other charitable organizations. With minor variations, these shelters are the same in all five cities where Schweid conducted his investigations. The chief difference between shelters and motel rooms is that shelter food is generally better, and sanitary facilities like showers and toilets are generally superior. But privacy is conspicuously lacking, causing even greater stress to homeless parents and children. \\nA debilitating feature of many of these shelters, moreover, is that their temporary inhabitants must exit the premises early in the morning, forcing them out to the mean urban streets. In Boston, Fairfax, Trenton and Nashville, they can face freezing winter temperatures, while in Portland, they can encounter relentless winter rains. The shelters also impose strict, even punitive rules and regulations, further oppressing the temporary residents. These settings are understandably places of last resort for homeless families, who often have no relatives or friends with whom they can stay.'"}, "time": 1742563827.2818258}