{"duration": 0.03988504409790039, "input_args": {"text": "' 58 pm Again, Donald Trump was not opposed to the war in Iraq.   \\nEver since Donald Trump was lambasted by leaders in both parties for fighting with a Gold Star family and dishonoring the service of Captain Humayun Khan, he’s been trying out a new approach: pretending Khan would still be alive if he was president. \\nKhan was killed in 2004 in a suicide attack in Iraq. \\nWhen the Republican was asked in an interview with ABC’s George Stephanopoulos if he thinks he should apologize for the way he treated the Khan family following the Democratic National Convention, he repeated this bogus claim. \\nVideo: . @realDonaldTrump stands by claim slain U.S. Army Capt. Humayun Khan would still be alive if he had been president. https://t.co/VgLaQ0cJ3A pic.twitter.com/bcDiTMXY2k \\n— ABC News Politics (@ABCPolitics) October 26, 2016 \\nTrump said, “I have great respect for the Khan family, I have great respect for – I mean their son is a great hero – but if I were president at that time, Capt. Khan would be alive today, George, because I wouldn’t have been in Iraq … I was opposed to the war in Iraq.” \\nAs Hillary Clinton and many objective sources have noted repeatedly throughout the campaign, Donald Trump was not opposed to the war in Iraq from the beginning. Had he been president at the time, the war still would have taken place because Trump was in favor of it. \\nIn fact, Trump’s campaign rhetoric today indicates that he would be a president who acts recklessly and would only embolden our enemies. This would make the world a more dangerous place and only increase the odds that America gets mired in more conflicts, not less. \\nFor their part, the Clinton campaign has continued to stand up to Trump’s attacks on the Khan family. In an emotional new ad released days ago, Capt. Khan’s father recounts how his son died protecting “everyone in his unit.” Khan’s father asked of Trump, “Would my son have a place in your America?” \\nThe answer to Mr. Khan’s question is a resounding “no,” as Trump has promised to ban Muslims – like the Khans – from even entering the United States. For those living here already, a President Trump would treat them like criminals. \\nDonald Trump will likely continue to rewrite history when it comes to his initial support of military intervention in Iraq. But after spending so much time throwing mud at the Khan family, it’s unlikely that anybody will buy it.'"}, "time": 1742628454.4547331}