{"duration": 0.11523318290710449, "input_args": {"text": "'Several initiatives have launched to support the Standing Rock Sioux Tribe and other indigenous people resisting construction of the Dakota Access pipeline on their land.\\nFirst and foremost, the Sacred Stone Camp established by Standing Rock has an official page for funding the water, propane, food, blankets, and other needs of the camp.\\nSacred Stone also has a legal defense fund to help defend those engaged in peaceful prayer and nonviolent direction, who are targeted and attacked by police.\\nThe Standing Rock Medic and Healer Council was on the ground to assist hundreds of water protectors on Backwater Sunday, when police assaulted them on a highway bridge with a water cannon, tear gas, concussion grenades, rubber bullets, and threatened them with a sound cannon. The Council has an Amazon “wish list” of items needed to continue to provide such assistance to the water protectors.\\nPhoto by Leslie Peterson\\nAlso, as the water protectors prepare for much colder weather in North Dakota, the Council is raising funds for wool blankets, emergency blankets, wool socks, wool thermal underwear, hand warmers, safety goggles, trauma kits, straw bales, and firewood. They are accepting donations to provide herbal remedies to water protectors. Anyone with vehicles that could be used for responding to medical emergencies is encouraged to donate their vehicles.\\nOn top of that, funds for the Council will go toward “winter infrastructure needs.” The funds will be used for “climate-controlled storage of medic supplies” and for “emergency contingency supply funds.”\\nA supply list shows the array of items the encampment needs, including propane, gas cards, paint, ropes, and heavy duty canvas or tarps.\\nThe Red Warrior Camp is also an encampment on the front lines of the resistance to the pipeline. The camp is working to secure their encampment through the winter so it can “continue to protect the Mni Sose River in sovereign Lakota Territory.” The Camp has a legal defense fund as well.\\nAs noted, the name of the people commonly referred to as the Sioux is Oceti Sakowin, which means Seven Council Fires. The Oceti Sakowin have a camp that is on the front lines preparing for winter. They are collecting donations to build lodges and keep everyone in the camp safe and warm.\\nThe Indian Country Today Media Network highlighted the Indigenous Environmental Network , which is a nonprofit focused on advocacy for environmental issues affecting Standing Rock and other indigenous people; EarthJustice, which is a law firm representing the Standing Rock Sioux Tribe in their efforts to protect the water from pipeline destruction;\\nB Yellowtail has a fundraiser, where people can buy “Protector” t-shirts. All proceeds go to Standing Rock. Similarly, actress Shailene Woodley’s “Up To Us” organization produced an “I Stand With Standing Rock” t-shirt. Funds raised go to solidarity efforts by the organization.\\nSacred Stone Camp does not want anyone to show up to the camp without coordinating with leaders of the camp beforehand, however, anyone willing to contribute their time, energy, and labor to helping water protectors maintain the camp and prepare for winter is welcome. The camp believes it is important for white allies to recognize their privilege and take risks in solidarity. They also need assistance in the kitchens and with chopping wood, etc. They encourage people to register to come stay at the camp for a one-week period .\\nThose who do not have money to give should not be concerned they cannot show solidarity and help the water protectors. Informing friends, family, and colleagues of what is going on with pipeline resistance is an excellent way to show solidarity. The Sacred Stone Camp also consistently shares ways to help on their Facebook page, sometimes including phone numbers that can be called to pressure officials to release arrested water protectors or to convince leaders to make statements of support for the water protectors.\\nFor example, November 25 kicks off a week of solidarity action throughout the United States and the world. Banks supporting the pipeline will be targeted with nonviolent direct actions urging divestment. Banks like TD Bank and Citigroup will face protests demanding they stop funding the pipeline.\\nThe post Giving To The Water Protectors Fighting The Dakota Access Pipeline appeared first on Shadowproof .\\n'"}, "time": 1742562590.6818676}