{"duration": 0.10652852058410645, "input_args": {"text": "'CHARLESTON, S. C.  —   They sat on the same courtroom bench, but worlds apart  —   the parents of Walter L. Scott, a black man shot to death in 2015, and Michael T. Slager, the white police officer who killed him as he fled after a traffic stop. And the arguments they heard from lawyers were just as disparate as they pleaded with jurors to settle a bitterly divisive case in their favor: for the government, a rare conviction of a police officer, and for the defense, an acquittal of an officer seen on tape shooting a fleeing man. “Our whole criminal justice system rides on the back of law enforcement,” Scarlett A. Wilson, the chief prosecutor for Charleston County, told the jury of 11 white people and a black man. “They have to be held accountable when they mess up. It is very, very rare, but it does happen. ” But Mr. Slager’s lawyer, Andrew J. Savage III, pressed jurors to resist “a false narrative”  —   that the officer malevolently opened fire toward Mr. Scott’s back on April 4, 2015, when he fled a traffic stop for a broken taillight  —   and to find that Mr. Slager had acted in  . “This shooting didn’t happen in a vacuum,” Mr. Savage said. “Mr. Scott did not get shot because he had a broken taillight. Mr. Scott was shot because of what he did on April 4. ” Jurors, who began their deliberations on Wednesday evening, must reach a unanimous decision, and they have three options if they are to avoid a mistrial: a conviction for murder, a conviction for voluntary manslaughter or an acquittal. The difference between murder and manslaughter  —   charges with vastly different potential penalties in this state  —   revolves around whether someone had “malice” toward the person who was killed. Under South Carolina law, a conviction for murder carries a prison term of 30 years to life the penalty for manslaughter is between two and 30 years in prison. Mr. Slager has also been charged in Federal District Court with violating Mr. Scott’s civil rights. Like the federal case, the state’s case, tried over four grueling weeks in a   courtroom here, turns on a matter of minutes on the Saturday before Easter last year, when Mr. Slager stopped Mr. Scott for an equipment violation. It was a stop, virtually everyone agrees, that began normally. But Mr. Scott soon decided to flee on foot  —   his family and prosecutors believe he did so because of outstanding child support obligations  —   and Mr. Slager chased him. The men became involved in a fight, and, according to Mr. Slager, who testified on Tuesday, Mr. Scott took control of the officer’s Taser, leaving him in “total fear. ” Near the end of their physical struggle, a   switched on his cellphone’s camera and began to record a video of the moments that soon rocketed into the national consciousness: when Mr. Slager fired eight shots and Mr. Scott, wounded, collapsed to the ground. Mr. Scott was at least 17 feet from Mr. Slager, and running away, when the officer began to shoot. Mr. Savage, during a presentation when he argued that Mr. Slager had been maligned by the news media, failed by his department and victimized by a shoddy investigation, said Mr. Scott had left Mr. Slager with little choice after he “made decisions to attack a police officer. ” “Should he have assumed that an unarmed man would have attacked a police officer?” Mr. Savage said of Mr. Slager, who he complained had been made a “poster boy” of alleged police misconduct because of controversial killings in other parts of the country. Ms. Wilson unambiguously and furiously denied that other cases had affected the prosecution here, and she told jurors that there could not “let your decision be based on things going on elsewhere. ” Rather, she contended, investigators had at first sided with Mr. Slager. “They bought everything he said hook, line and sinker,” she said. “They believed him until they didn’t, until they knew better. ” Winding down a criminal case that has drawn enormous attention here, Ms. Wilson accused Mr. Savage of relying on a    defense strategy she said was intended to confuse jurors and shift blame for Mr. Scott’s death. The defense’s approach, she argued, could be summarized simply: “Look at everything else  —   everybody else  —   but don’t look at that video. ” She said that Mr. Slager, who is now 35, had embellished the nature of his confrontation with Mr. Scott, who was 50. She characterized one of Mr. Slager’s wounds, cited by his lawyers as evidence of a   struggle, as “a glorified paper cut,” and she hailed the role that video had played in the case. “Thank goodness we have a camera,” she said, “because it’s not just memory that matters. ” Eventually, as Ms. Wilson neared the end of her argument, she played the video of the shooting again. As the eight shots echoed the courtroom one last time, Mr. Scott’s parents, still in their seats, embraced, looking away from the killing.'"}, "time": 1742562254.3853874}