{"duration": 0.0640268325805664, "input_args": {"text": "'Objetivos: El tema catalán, que intentará resolver contando chistes de mariquitas. \\nDe él han dicho: “A veces, la belleza no está en el Interior”. \\nExperiencia previa: Exalcalde de Sevilla. Consiguió reparar la reputación de la ciudad después de que se adoptara a Curro como mascota en la Expo del 92. Polémicas: Investigado por la adjudicación a dedo de la empresa que pintó Sevilla de un color especial. \\nMinistro de Economía, Industria y Competitividad \\nAlias: ‘El Buque’, ‘Don Parné’, ‘Fermín Panoja’. \\nEdad a la que se quedó calvo: 11 años. \\nTrauma: Estuvo a punto de rescatar España pero al final no pudo. Después de aquello, se dio a la bebida y a la vida nocturna. Sus compañeros le dicen reiteradamente que no se fustigue, pues no fue su culpa, pero Luis no puede olvidar los ojos de España, cuando falló en su misión y él la vio caer. \\nMinistra de Defensa \\nAlias : Boeing AH-64 Apache. \\nPrecedentes : Antes que ella ya hubo una mujer en Defensa, Carme Chacón. Podría decirse que es la primera mujer de derechas en el cargo pero, de nuevo, ya lo fue Carme Chacón. \\nPrimera medida en el cargo : Cambiar la cartera ministerial por un macuto militar. \\nArchienemigos : El Daesh y Soraya Sáenz de Santamaría. \\nMinistra de Empleo y Seguridad Social \\nNúmero de nuevos empleos creados : 6. \\nReformas laborales llevadas a cabo : Creación del concepto “juernes” e impulsora del hashtag #FelizLunes. \\nOtras facetas menos conocidas : Sus videotutoriales para aprender a maquillar las imperfecciones de los datos del paro. \\nETT favorita : Explotalia. Íñigo Méndez de Vigo Ministro de Educación, Cultura y Deporte \\nDe él han dicho : “Sí, claro, va a venir el gordito este a hablarnos de deporte”. \\nHitos al frente del Ministerio : No se le escapó la risa en una exposición de Yoko Ono. \\nObjetivos : Recuperar el nivel de educación, recortando el sueldo a los profesores tratándolos de usted. \\nMinistro de Hacienda y Función Pública \\nSistema Operativo : Linux. \\nSúperpoder : Es capaz de oír la frase “No hace falta factura” a 200 km a la redonda. \\nPerfume : Brummel con unas gotitas de sangre de autónomo. Isabel García Tejerina Ministra de Agricultura, Pesca y Alimentación y Medio Ambiente \\nTamaño de su tarjeta de visita : Din-A3. \\nObjetivo : Unir los departamentos de Alimentación y Medio Ambiente comiéndose los presupuestos con patatas. \\nCrisis durante la anterior legislatura : Se bañó en una playa nudista para demostrar que no te puedes quedar embarazada. \\nPuntuación máxima en el Candy Crush : 2.000.000 puntos. \\nMinistro de Justicia \\nAlias : “Ah, sí, sí, creo que ahora le pongo cara…” \\nExperiencia previa : Juez de Miss Camiseta Mojada en la disco pub Glamour en los años 2001, 2002 y 2004. \\nFracasos : Su mala posición en el certamen Miss Camiseta Mojada en el disco pub Glamour, en el año 2003. \\nPropuesta estrella : Poner WiFi en las mazas de todos los jueces de España. \\nMinistro de Asuntos Exteriores y Cooperación \\nPrevisión de Puntos Iberia a final de la legislatura : 4829482911. \\nExperiencia previa : Excelente diplomático europeo, le dijo a Merkel que aquellos pantalones le hacían tipín. \\nPorros fumados en su etapa de embajador en los Países Bajos : 1, para poder decir que los ha probado. \\nCuriosidades : Fue el 50% del dúo de música bakalao Dastis & Buenri.'"}, "time": 1742564616.5001276}