{"duration": 0.11320948600769043, "input_args": {"text": "'When Tony Schwartz was writing Donald J. Trump’s first book, “The Art of the Deal,” in the late 1980s, he was startled by his client’s short attention span. During their first interview, Mr. Trump endured just a few minutes of Mr. Schwartz’s questions before leaping up from his chair and declaring the entire exercise a waste of his time. “He couldn’t tolerate doing interviews,” he tells me. “He just couldn’t stay focused for more than a few minutes at a time. And think about this, Michael, it was when he was talking about himself, which is his favorite subject. ” In the latest episode of The   Mr. Schwartz explains why he is sharing his intimate knowledge of how Mr. Trump thinks and behaves with aides to Hillary Clinton to help her prepare for Monday night’s highly anticipated presidential debate. He’s worried about a habit he noticed during Ms. Clinton’s performance at a national security forum hosted by NBC News a week ago: “What I would hope is that she doesn’t go the same route she did with Matt Lauer when he started coming at her relentlessly, which was to revert to her knowledge, to revert to her ability to produce a hundred facts in a short period of time,” he says. “Because this debate is going to turn not a bit on the issues. It’s going to turn on emotion, it’s going to turn on which candidate makes all of us feel safer and which candidate makes us feel less safe. And the one who wins that contest wins the debate  —   and probably wins the election. ” Mr. Schwartz offered his help to the Clinton campaign as part of his long (and possibly futile) effort to make up for the guilt he feels about setting Mr. Trump on a path to fame by ghostwriting his book. “I don’t think I can ever even the score I don’t think I can ever set it totally straight,” he says. All he can do now, he says, is “say the truth that I know in the service of trying to help save the country and the world from a guy who is exceptionally dangerous. ” In the episode, we explore the profoundly contrasting style of preparation and showmanship that Mr. Trump and Mrs. Clinton bring to the debate with my colleagues, Frank Bruni, an opinion columnist, and Amy Chozick, a reporter who has covered Mrs. Clinton for the last two years. “I think of Trump as a toddler sitting in a high chair,” Mr. Bruni says. “And his advisers are saying ‘Donald, you must get through the meal without throwing your spaghetti on the wall.’ So the question is, will they successfully persuade him not to throw his spaghetti on the wall before the debate ends?” From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742562257.3480694}