{"duration": 0.21154356002807617, "input_args": {"text": "'Roberta Peters, the   coloratura soprano who at 20 was catapulted to stardom by a phone call, a subway ride and a Metropolitan Opera debut  —   her first public performance anywhere  —   all in the space of five hours, died on Wednesday at her home in Rye, N. Y. She was 86. The cause was Parkinson’s disease, her son Bruce Fields said. Ms. Peters, who would sing with the Met 515 times over 35 vigorous years, was internationally renowned for her high, silvery voice (in private, she could hit a high A, two and a half octaves above middle C) her clarion diction in a flurry of languages her attractive stage presence and, by virtue of the fact that she and television came to prominence at about the same time, her wide popular appeal. “As a coloratura,” Cue magazine wrote of Ms. Peters in 1960, “she has no peer. ” In addition to the Met, with which she appeared regularly from 1950 to 1985  —   one of the longest associations of any singer with a major opera company  —   Ms. Peters was heard at the Lyric Opera of Chicago, Cincinnati Opera, the Vienna State Opera, Covent Garden and elsewhere. Her   roles include the Queen of the Night in Mozart’s “The Magic Flute,” Rosina in Rossini’s “The Barber of Seville,” Gilda in Verdi’s “Rigoletto” and Oscar (a pageboy played by a soprano) in his “Un Ballo in Maschera. ” But her most significant role was undoubtedly Zerlina in Mozart’s “Don Giovanni. ” Enlisted to sing that part in 1950 as a   substitute, Ms. Peters was propelled, with no rehearsal, onto the Met stage and into a stellar career. Known for taking meticulous care of her voice, she continued to sing in recital until well into her 70s, a good two decades past the de facto retirement age in her line of work. At midcentury, when it was more customary to encounter opera stars on television than it is today, she was seen on a string of shows, including “The Voice of Firestone,” “The Mike Douglas Show” and in particular “The Ed Sullivan Show,” on which she appeared scores of times in the 1950s and ’60s. Later in her career, she performed in operetta and musical theater. One thing that allowed Ms. Peters to sing so long was a prudent awareness of what her voice could and could not do. Possessed of a light, fleet instrument, she confined herself to coloratura and soubrette roles, steering clear of heavier fare. Critics sometimes faulted Ms. Peters’s singing for a certain lack of intensity, but her flageolet tones made an airy counterweight to the vocal heft of Maria Callas and Joan Sutherland, whose style was becoming the norm for sopranos at midcentury. “I would love to sing Tosca,” Ms. Peters told The Los Angeles Times in 1986. “And Salome. Those are my dream roles. But I won’t do them, at least not in this life. They would kill me, vocally. ” Another thing that kept Ms. Peters singing was her impeccable technique: From the age of 13, she had trained for an operatic career as an athlete trains for the Olympics. For years, her weekly regimen included not only voice and foreign language lessons but also instruction in ballet, acting and fencing, as well as a strength and conditioning program under the direct supervision of Joseph Pilates, the originator of the Pilates exercise method. Although Ms. Peters’s voice teacher, William Herman, did not want her to sing in public until she was thoroughly groomed, he insisted that she make a deep study of the operatic literature. By the time she was 19 and auditioned for the Met, she knew the scores of 20 operas cold. Providentially, as things fell out, “Don Giovanni” was one of them. Roberta Peterman, an only child, was born on May 4, 1930, and grew up near Jerome Avenue and 170th Street in the Bronx. Her father, Solomon, was a shoe salesman her mother, the former Ruth Hirsch, a milliner. As a girl, Roberta, in the words of her family, had “a real voice on her. ” When she was 13, her grandfather, the maître d’hotel at Grossinger’s, the redoubt of Jewish life in the Catskills, asked the celebrated tenor Jan Peerce (né Jacob Pincus Perelmuth) who was singing there, to hear her. Impressed, Mr. Peerce arranged for Roberta to study with Mr. Herman, whose students included the Metropolitan Opera coloratura Patrice Munsel, who died last year. Leaving school permanently after she completed junior high, Roberta took six lessons a week from Mr. Herman on a   scholarship. He also arranged for supplementary instruction in French, Italian, German, dance and drama. Mr. Pilates, meanwhile, did his part by standing regularly on Roberta’s abdomen (he weighed 174 pounds, she 119) to help her develop the musculature essential for breath control. All this proved so effective that at 16, Roberta was offered a $   role in “Street Scene,” a musical with music by Kurt Weill and lyrics by Langston Hughes that would open on Broadway in 1947. Though the salary would have been welcome in a family of modest means, Roberta, with the support of her parents, turned it down: She had set her sights on opera and would not be deterred. In late 1949, Ms. Peters (she had shortened her surname at her teacher’s suggestion) was taken on by Sol Hurok, the   impresario. He soon arranged an audition with the Met’s new general manager, Rudolf Bing. On Jan. 23, 1950, the    Ms. Peters stood on the stage of the old Metropolitan Opera House on Broadway and 39th Street in Manhattan. There, in the darkened hall, she sang “Der Hölle Rache” (“Hell’s Vengeance”) the Queen of the Night’s aria from “The Magic Flute,” which, with its fiendish series of high F’s, is among the canonical texts of the coloratura repertory. Somewhere out in the darkness was Mr. Bing. “It was the first audition I had done for anyone, and I was so scared,” Ms. Peters told The Chicago Tribune in 1993. “When it was over he asked if I would sing it again. Then he asked me to do it again. Well, I sang it four times, not knowing that he had silently brought in conductors Fritz Reiner, Fausto Cleva and Fritz Stiedry to hear me. ” Signed to a Met contract, Ms. Peters was scheduled to make her debut with the company as the Queen of the Night in January 1951. But on Nov. 17, the soprano Nadine Conner, scheduled to sing Zerlina in a Met “Don Giovanni” that night, fell ill. At 3 p. m. Mr. Bing telephoned Ms. Peters and told her to report to the opera house in time for an 8 o’clock curtain. Ms. Peters, who had planned to watch the performance with her mother from the   section that night, informed her parents that they now had box seats. The family, then living at Broadway and 71st Street, rushed to the street and hailed a taxi. When the cab became stuck in traffic, they jumped out and took the subway. At the opera house, there was no time for real rehearsal: Ms. Peters’s only preparation to play Zerlina, the country girl who catches Don Giovanni’s roving eye, took the form of hurried consultations with the stage director, Herbert Graf, and the conductor, Mr. Reiner. She was hustled into a costume the other singers would help her hit her marks onstage by gently propelling her wherever she needed to be. “Are you nervous?” the baritone Paul Schöffler, that night’s Don Giovanni, asked her before the curtain. “No, numb,” Ms. Peters replied, and on she went. “The delightful surprise of last night’s performance of ‘Don Giovanni’ at the Metropolitan was the emergency debut of little Roberta Peters in the part of Zerlina,” The New York  ’s review the next day said. “The voice came through the big house as clear as a bell, the notes equally bright and focused and the phrasing that of a true musician. And the girl  —   she is all of 5 feet 2  —   turned in a very smooth job of acting, too. ” From then on, Ms. Peters was in great demand, both at the Met, where she sang her planned Queen of the Night on Jan. 12, 1951, and around the world. As if her debut had foreordained as much, she developed something of a specialty as an   substitute for indisposed singers. Ms. Peters was by all accounts one of opera’s least divalike divas. She was exceptionally game  —   not hesitating, for instance, to don a chicken suit for an episode of “Captain Kangaroo” in 1975. (One is   to picture Maria Callas in similar confines.) She appeared in several memorable TV commercials. In one, for Chock Full o’Nuts, Ms. Peters sang the company’s signature jingle in mellifluous Italian. In another, for American Express  —   part of its   “Do you know me?” campaign  —   she hailed a cab by singing out “ !” in a descending major third, from G to E flat. She had dramatic roles in several movies, including “Tonight We Sing” (1953) based on Mr. Hurok’s life, and on TV shows including “Medical Center,” on which, in 1975, she played a dying singer. The closest thing to drama in Ms. Peters’s personal life was her very brief marriage to the great baritone Robert Merrill, whom she wed on March 30, 1952, and from whom she was divorced on June 26, 1952. (Ms. Peters later said that she had fallen in love with the voice rather than the man.) But they remained friends, and sometime   partners, ever after. Ms. Peters’s second husband, Bertram Fields, a hotelier and   investor whom she married in 1955, died in 2010. In addition to her son Bruce, she is survived by another son, Paul, and four grandchildren. Her many recordings include works by Mozart, Rossini, Verdi, Cole Porter and Gilbert and Sullivan. For all the acclaim that cloaked Ms. Peters, and for all the laurels heaped upon her  —   including a National Medal of Arts in 1998  —   perhaps nothing could match the electricity of that   November night, when a    from the Bronx stepped onto the Met stage an unknown and came back as Roberta Peters. An ovation followed, and flowers along with it. Afterward, Ms. Peters took a taxi all the way home.'"}, "time": 1742562711.552141}