{"duration": 0.017979145050048828, "input_args": {"text": "'California Gov. Jerry Brown declared Friday that the drought in his state is officially over, with a formal declaration to an end of the drought state of emergency in most counties. [In a statement released by his office, Brown said:  Following unprecedented water conservation and plentiful winter rain and snow, Governor Edmund G. Brown Jr. today ended the drought state of emergency in most of California, while maintaining water reporting requirements and prohibitions on wasteful practices, such as watering during or right after rainfall. “This drought emergency is over, but the next drought could be around the corner,” said Governor Brown. “Conservation must remain a way of life. ” Executive Order    lifts the drought emergency in all California counties except Fresno, Kings, Tulare and Tuolumne, where emergency drinking water projects will continue to help address diminished groundwater supplies. Today’s order also rescinds two emergency proclamations from January and April 2014 and four drought —  related executive orders issued in 2014 and 2015. The governor’s proclamation comes after one of the wettest and snowiest winters in the state’s recorded history. Initially, after last winter’s El Niño brought moderate rains to Northern California, the state was expected to suffer through a dry winter, thanks to the La Niña effect. But one “Pineapple Express” storm after another blew in off the Pacific, bringing atmospheric rivers to drench Northern and Southern California alike and coat mountains in snow. Earlier this week, the Sacramento Bee reported that Californians are still conserving water, in spite of the heavy precipitation. State water authorities likely hope that the habits formed during the drought will be retained  —   though some local agricultural water authorities are currently pumping water to farmers as fast as they can to keep dams from overflowing. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628595.4289122}