{"duration": 0.19683146476745605, "input_args": {"text": "'TALLADEGA, Ala.  —   For a band at a tiny,   historically black college, it seems in some ways to be the gig of a lifetime: a chance to march and perform at the Jan. 20 presidential inaugural parade in Washington. Some of the musicians at Talladega College have been excited to see the capital for the first time. But because the   is Donald J. Trump, the school has become the subject of an impassioned national outcry, with online petitions, threats to end donations and a flurry of    from alumni who feel that performing in the parade would betray the values of an institution founded by newly freed slaves 150 years ago. On Thursday, after days of speculation that the college administration might bow to the pressure and remove the band from the parade roster, the president of Talladega College, Billy Hawkins, issued a statement confirming the participation of the band, the Marching Tornadoes, and argued, in essence, that the 58th presidential inauguration is about something bigger than Mr. Trump. “We respect and appreciate how our students and alumni feel about our participation in this parade,” Dr. Hawkins said. “As many of those who chose to participate in the parade have said, we feel the inauguration of a new president is not a political event but a civil ceremony celebrating the transfer of power. ” Similar issues have been raised about other entertainers scheduled to perform, among them the Radio City Rockettes and the Mormon Tabernacle Choir. But because of Talladega’s history, the issues have been especially intense here, with calls for the college to reverse its decision to take part in the festivities. And beyond Talladega, the controversies raise tough questions for Mr. Trump’s most ardent critics as his presidency dawns: What is the proper response to a president as polarizing as Mr. Trump? Should the office of the president be honored, no matter who fills it? Or should there be four years of pure rejection and defiance? And if Mr. Trump’s opponents refuse to participate in his presidency, can critics on the right do the same thing to some other   in the future? To a number of Talladega alumni, the Dec. 30 announcement that the band would march in the parade was an insult to the very principles of the college, which was established two years after the end of the Civil War. The school is affiliated with the United Church of Christ, a liberal Protestant denomination that was deeply involved in the civil rights movement, and for decades it served as an incubator for theories and practices of social justice. Nikky Finney, a poet and Talladega graduate who is now a professor at the University of South Carolina, said in a statement this week that the band should not help celebrate Mr. Trump, who, she said, has maligned women and Mexican immigrants and has proposed barring all Muslims from entering the country. In an interview on Thursday, Ms. Finney, channeling a James Brown lyric, said the college had “sold out the history of Talladega College for chicken change” and “maybe a tin star on a hatemonger’s parade route. ” As of Thursday afternoon, an online petition calling for the band to withdraw from the inaugural parade had attracted more than 1, 900 signers, some of them supporters of the college who have threatened to withhold future contributions. But a second petition, which had nearly 300 supporters, argued that the parade was not about politics but “about seeing firsthand the process of a transition” and giving the students a chance to be a part of history. “We are not   thinkers and believe everyone is entitled” to their own beliefs, it stated. “However, we are in support of the United States of America. ” As the debate heated up this week in online forums for students and alumni, the leadership at the private,   college hunkered down to consider how best to proceed. The campus police ordered reporters off the   campus. Brief interviews with a few band members on Tuesday evening revealed a group divided. Jerome Haynes, 18, a freshman who plays the snare drum, said he hoped politics would not get in the way of an exciting opportunity for the band. In contrast, Ronald Peterson, 21, a sophomore who plays cymbals, said he was going to talk to the director about staying home. “I feel that those who are not Republicans should not have to play for it,” he said. On Thursday afternoon, some students said the administration had done the right thing, despite the protests from alumni. Antonio Phillips, 24, a senior and a drum major, welcomed the exposure. “We’re musicians, so this is a good platform for us to showcase our talent in front of the world,” he said. His friend Ken Randolph, 20, a junior who is not in the band, said the concerns of alumni like Ms. Finney “weigh heavily on the students of Talladega. ” But he said Mr. Trump might benefit from the exposure to a black art form. “This is a part of our culture,” Mr. Randolph said. “With it being on his front doorstep, he might be able to apprehend the vibe and the culture. ” That drama in Talladega, a city of 15, 000 about an hour’s drive east of Birmingham, played out as black activists, including the N. A. A. C. P. president, Cornell William Brooks, were arrested on Tuesday in Mobile in a   action at the office of Senator Jeff Sessions, the Alabama Republican nominated to be attorney general in the Trump administration. Mr. Sessions, who is white, was rejected by the Senate for a federal judgeship in 1986 after he was accused of making racially insensitive statements. To some Talladega alumni, the possibility that policies long opposed by   could now be enacted by a   Congress and executive branch was what made the notion of a black band marching for Mr. Trump seem so distasteful. “There’s a great deal of fear in this country that the Voting Rights Act is going to be abolished, that the Affordable Care Act is going to be abolished, that Planned Parenthood is going to be cut off from funding, that Medicaid is going be cut off from funding,” said J. Mason Davis, a Birmingham lawyer who graduated from the college in 1956. “Don’t you understand why we have a fear of the man?” Donavon Jackson, 24, a former trumpet player in the band who graduated last year, said performing as part of the inauguration would be particularly special for a college of about 1, 000 students whose band program is only about five years old. The school does not have a football team, which makes parade invitations all the more important. “I’m honored to go to a school that can say they marched in an inauguration parade,” said Mr. Jackson, who received a chemistry degree and now lives in Houston. “Not necessarily for the person  —   and that’s not necessarily saying he’s a bad person. ” In the statement on Thursday, school officials said they still faced the “challenge” of raising more than $60, 000 to cover expenses for the trip. The population of the city of Talladega is divided about evenly between blacks and whites, and to a visitor, it can feel like a place where racial harmony and discord coexist on seemingly parallel planes. Whites speak with pride about the historic black college downtown  —   though one white person was overheard on Wednesday warning of a liberal plot to foment a “race war” so that President Obama might declare martial law before the inauguration. While some residents said the band should stay home, and others said it should attend the event in Washington, a few spoke harshly of Mr. Trump while hoping the inauguration would help the band get noticed  —   something the city, which was bypassed by the interstate highway system, has struggled with in recent decades. Bonquita McClellan, 26, manages her father’s restaurant, Big Mac’s Open Pit BBQ, near campus. Ms. McClellan, who is black, said the disdain for Mr. Trump among her   peers was universal. “If anybody would have had us in concentration camps,” she said, “it’d be him. ” But she also said the band should go and make a name for itself in the nation’s capital. “How often,” she asked, “does Talladega College get a chance to play for the president?” Up the street at a real estate office near the   courthouse, Randy and Heather Roberts, a white couple who voted for Mr. Trump, raved about the Talladega College band and its performance at the Dec. 5 Christmas parade. Ms. Roberts showed a video of the band on her phone. “They were phenomenal,” Ms. Roberts said. Ms. Roberts, 41, said she grew up with black and white friends. Mr. Roberts, 48, said he and his wife were pleased to cater to their multiracial clientele. But when they spoke about politics, the couple sounded like people who knew something was broken but did not know how it might be fixed. “It is not going to be pleasant for the next four years,” Ms. Roberts said. “It is going to be a battle. ”'"}, "time": 1742561950.985808}