{"duration": 0.025013208389282227, "input_args": {"text": "'A Book Too Dangerous To Read A Book Too Dangerous To Read? \\nby Jennifer Margulis   Library Journal , which librarians read to decide what books to buy for their collections, announced last week that libraries should not carry the new book, The Vaccine-Friendly Plan : Dr. Paul’s Safe and Effective Approach to Immunity and Health, From Pregnancy Through Your Child’s Teen Years , which I co-authored with Paul Thomas, M.D., a Dartmouth-trained pediatrician who has over 13,000 patients in his pediatric practice in Portland, Oregon. \\n“The author’s style is gentle and motivating,” the reviewer writes, “and he clearly cares for parents and children. Despite this, many parents will have a hard time following some of his suggestions (e.g. no manufactured baby food, no formula, no circumcision, avoid acetaminophen), as he advises parents to come to “well child visits with a signed vaccine refusal form” and specifically warns against hepatitis, chicken pox, flu, polio, and HPV vaccines, among others.” \\nThe review goes on: \\n“VERDICT While Thomas does recommend a number of vaccines, his medical wisdom is too removed from both the AAP and the CDC (Centers   Prevention) guidelines to warrant a recommendation.” \\nDon’t make this book available to library patrons. \\nDon’t read this book. \\nDon’t even have a conversation about safety issues with childhood vaccines. \\nInstead, let’s just ignore the fact that the current rates of autism are at least 1 in 68, according to the CDC (possibly as high as 1 in 45 , also according to CDC data), that there’s a growing body of very disturbing scientific evidence showing that acetaminophen (the main ingredient in Tylenol) is triggering autism , and that American children today are plagued with allergies, asthma, and other chronic diseases (like Type 1 juvenile diabetes and leaky gut syndrome) than ever before. \\nBut following Dr. Paul’s recommendations to feed a baby and small child a real food, whole foods diet, stop using Tylenol , and making judicious decisions about vaccination is too difficult? A neonatologist and an obstetrician from Panama excited to read Your Baby, Your Way and The Vaccine-Friendly Plan , even as the Library Journal warns librarians against buying The Vaccine-Friendly Plan . Photo by Jennifer Margulis. \\nFollow one-size-fits-all medicine as defined by the CDC and the AAP and watch your children spend the rest of their lives battling vaccine injury and chronic disease. \\nFollow Dr. Paul Thomas’ vaccine-friendly plan of avoiding toxins, eating real food, getting plenty of outdoor time and sunlight, and choosing to do judiciously spaced vaccines, one aluminum-containing shot at a time (or choosing no vaccines at all), and raise happy, healthy children. \\nYou decide. \\n  \\nAbout the Author \\nJennifer Margulis , Ph.D., is an award-winning health journalist, co-author of The Vaccine-Friendly Plan (Ballantine, 2016), and author of Your Baby, Your Way: Taking Charge of Your Pregnancy, Childbirth, and Parenting Decisions for a Happier, Healthier Family (Scribner 2015). She has worked on a child survival campaign in West Africa, appeared live on prime-time TV in France, and been awarded a Fulbright from the United States government. She has a B.A. from Cornell University, an M.A.   California at Berkeley, and a Ph.D. from Emory. Learn more about her at www.JenniferMargulis.net  '"}, "time": 1742628454.694771}