{"duration": 0.22314214706420898, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name => Horatius Defends the Bridge at Rome. Credit: VDare.com. \\nVDARE.com Editor Peter Brimelow writes: I spoke at the H.L. Mencken Club conference in Baltimore last Saturday, November 5. It seems like a thousand years ago. Subject: “The Right and American Conservatism.” Reading the transcript, I see it’s almost as f I thought Donald J. Trump might lose the November 8 election . Silly me. \\n[See also: America`s Egalitarian Temptation—Stalinism`s Unquiet Ghost , Peter Brimelow’s address to the 2008 inaugural meeting of the H. L. Mencken club]. \\nPeter Brimelow: Ladies and Gentlemen: Some of you may recall I gave the banquet address at the H.L. Mencken Club last November. It’s been lost to history because (to my intense rage!) H.L, Mencken Club Chairman Paul Gottfried didn’t have it recorded. In it, I praised Ann Coulter’s great book Adios America! , which came to the same conclusions about immigration (moratorium, sealed borders, attrition through enforcement etc.) that I had in Alien Nation 20 years earlier. And a questioner said: “Why is she doing this? Why is she taking this risk?” And I said: “Well, look on the bright side, maybe Trump will win.” \\nThere was sort of a shocked silence, as I recall. [ Laughter ] This was before the primaries had even begun. I was pretty shocked at the idea myself! \\nBut, you know, he’s come very close . He’s come very close. The moral of this is: we should not give into despair. Amazing things happen—completely unexpectedly. \\nThe subject I’ve got now from Paul is: “The Right and American Conservatism.” And I think it’s right that we should use the term “American Conservatism” because it’s on the point at becoming a Term Of Art. It represented a specific intellectual eddy , which came into existence relatively recently. I don’t know how widely the term “conservatism” was used in American politics prior to 1950s —Paul, do you? \\nPaul Gottfried: \\nIt was not used often at all. Robert Taft described himself as a “liberal.” \\nPB: \\nRight. In Britain, of course, it didn’t exist at all before the 1840s. \\nAnyway, the American Conservative Movement came into existence in the 1950s—and now it’s ended. \\nI may say I immigrated to the American Conservative Movement. I discovered it when I was at university in England in the late 1960s, reading National Review, which we found in great bundles in the History Basement of the University of Sussex Library . They had discontinued their subscription —because they thought National Review was irrelevant and pointless. We of course were fascinated by the fact that there’d been a story on the cover proposing that the Americans nuke China, which struck us as very enterprising, the sort of initiative that was unthinkable in the British political context. [ January 12, 1965 ] So we made them re-subscribe. \\nAnd I’m not one of these people that thinks the American Conservative Movement did not achieve anything. It ended in failure, as all political movements do. But it did win the Cold War and that’s really significant. Some of you are old enough to remember the despair that prevailed in the mid1970s after the fall of Vietnam. And we had reason to despair. American society and American politics was riddled with no-goodniks who absolutely planned to staff the gulags after the Soviets arrived. Absolutely planned to do that. And, of course, now they’ve simply mutated into Cultural Marxists. They’re still planning to staff the gulags. \\nI was talking to Paul [Gottfried] a little earlier about Tom Fleming, our mutual friend, who was the long-time editor of the Chronicles . He’s a sort of wayward genius and I have learned to respect him because he told me more than 20 years ago that the great Lawrence Auster , the blogger , was in effect “mad, bad, and dangerous to know,” to use Lady Caroline Lamb’s description of Lord Byron. And he was understating the matter, although I do think Larry was a great man and we’ve missed him sorely in the immigration wars. \\nAnd Tom also said about 20 years ago that we had to give up the term “Conservatism”—because it had been co-opted by, basically, corporate lobbyists and rent-seekers. \\nI didn’t like this at all because I thought “Conservatism” was one of our very few—but there are a few—victories in the culture. Another one, for example, is the idea of Political Correctness. Everyone knows what Political Correctness is. It’s not that the Cultural Marxists wanted us to know, it’s just that somehow it made it to the front. \\nWe saw Romney describe himself in one of the 2012 primary debates as “ severely Conservative .” Now, of course, he’s not conservative at all, and he doesn’t strike me as particularly severe, he strikes me a rather a wimp as a matter of fact. But he felt obliged to say this because of the power that the word has achieved in the culture. So, I was kind of sorry to give it up. But I’m afraid that we are going to have to. \\nA few years ago, I learned with delight that the Indian Army has inscribed, on the monument erected in Tawang province to its soldiers who fell in the 1962 border war with China, now completely forgotten, the famous lines from the Lays Of Ancient Rome by Lord Macaulay—also now completely forgotten: \\nAnd how can man die better \\nThan facing fearful odds \\nFor the ashes of his fathers \\nAnd the temples of his gods? \\nIt`s always seemed to me that Macaulay`s verse is a litmus test for conservatism—or perhaps I should more accurately say, the Right. It either it speaks to you or it doesn`t. \\nIt`s vital to note that this verse is not vainglorious and chest-thumping, but somber and stoic. The scene, of course, is that Horatius is about to make a stand on the bridge to stop the storming of Rome by Lars Porsena and the deposed king of Rome, Tarquin the Proud. The previous lines are: \\nThen up spake brave Horatius \\nThe Captain of the Gate: \\n“To every man upon this earth \\nDeath cometh soon or late…” \\nIn other words, Horatius` point is not that death facing fearful odds is so wonderful—but that there is no wonderful alternative. So why not? \\nNote also that Macaulay has Horatio fight for “ashes” and “temples”—that is, not in the hope of saving any living family members, or in the service of any gods in whom he has confident faith. The implication: he could have no family members and no hope of divine providence—but his death in battle would still have symbolic resonance. \\nThe core of conservatism, it seems to me, is this recognition and acceptance of the elemental emotions. Conservatism understands that it is futile to debate the feelings of the mother for her child—or such human instincts as the bonds of tribe , nation , even race . Of course, all are painfully vulnerable to deconstruction by rationalistic intellectuals—but not, ultimately, to destruction. These commitments are Jungian rather than Freudian, not irrational but a-rational—beyond the reach of reason. \\nThis is one of the problems, by the way, with the American Conservative Movement. I was completely astonished when it fell apart at the end of the Cold War—I never thought it would. That’s because I assumed that everybody realized that America standing up to the Soviet Union was, in some sense, a nationalist resistance. Americans just didn’t want to be conquered by Russians. \\nBut, it turned out that there were people who had joined the anti-Communist coalition who harbored messianic fantasies about “global democracy” and and America as the first “universal nation” (i.e. polity. Nation-states must have a specific ethnic core.) They also had uses for the American military which hadn’t occurred to me. But they didn’t care about America—about America as a nation-state, the political expression of a particular people, the Historic American Nation. In fact, in some cases, it made them feel uneasy. \\nI thought about this this spring when Trump was debating in New Hampshire. ABC’s John Muir asked three candidates: “What does it mean to be Conservative?” \\nI’m going to quote from John Kasich: blah, blah, blah, blah. Balanced budgets—tax cuts—jobs—“but once we have economic growth I believe we have to reach out to people who live in the shadows.” \\nBy this he meant, not illegal aliens, although he did favor Amnesty , but “the mentally ill, the drug addicted, the working poor…[and] our friends in the minority community.” \\nThat’s because the Republican Party has lots of friends in the minority community. \\nMarco Rubio said: \\n…it’s about three things. The first is conservatism is about limited government, especially at the federal level…It’s about free enterprise…And it’s about a strong national defense. It’s about believing, unlike Barack Obama, that the world is a safer and a better place when America is the strongest military and the strongest nation on this planet. That’s conservatism. \\nKasich and Rubio’s answers, of course, are not remotely “conservative” but utilitarian, economistic, classical liberal. Note that Rubio even felt obliged to justify “strong national defense” in universalistic, Wilsonian terms: it will make the world “a safer and a better place.” \\nIn contrast to all that, Donald Trump said: \\nI view the word conservative as a derivative of the word conserve. We want to converse our money. We want to conserve our wealth…We want to conserve our country. We want to save our country. \\nNow, this caused a considerable amount of harrumphing among Conservative Inc. intellectuals and various Republican politicians. Somebody called John Hart , who writes a thing called Opportunity Lives —has anybody heard of it? It’s a very well-funded Libertarianism Inc. website in Washington. \\nNobody has heard of it? Good. \\nHart said: \\nTrump’s answer may have been how conservatives described themselves once: in 1957. But today’s modern conservative movement isn’t a hoarding or protectionist philosophy. Conservatism isn’t about conserving; it’s about growth. \\n“Growth”? \\nWell, I don’t think so. And not just because I remember 1957 . \\nAs I said, I think it turned out that American Conservatism was just a transitional phase. And now it’s over. \\nWhy did it end? After Buckley purged John O’Sullivan and all of us immigration patriots from National Review in 1997, we spent a lot of time thinking about why he had done this. And there were a lot of complicated psychological explanations: Bill was getting old, he was jealous of his successor, the new Editor, John O’Sullivan, he was terrified of the neoconservatives who didn’t like the emphasis on immigration because of their own ethnic agenda, and he was very inclined to listen to the Congressional Republicans, who didn’t want to talk about immigration because they are terrified too—because they are cowards, basically—and also because they have big corporate donors . And, I think that is part of the explanation. \\nBut there was a similar discussion in the 1950s and 1960s, which I’m old enough to remember, about why the Old Bolsheviks all testified against themselves in the treason trials during Stalin’s Great Purge . They all admitted to the most fantastic things—that they had been spies for the Americans and the British and the capitalist imperialists all along, that they’d plotted to assassinate Comrade Stalin. And there were all kinds of discussions as to why this was, and in fact a wonderful novel, Darkness At Noon [ PDF ] by Arthur Koestler , one of the most remarkable novels in the last century, describing the exquisite psychological process by which an old Bolshevik in prison came to the conclusion that he was going to have to say all these things in the long-term interest of the Revolution. \\nDo you agree about Darkness At Noon , Paul? [ Paul Gottfried indicates assent ] \\nGood. \\nWell, when Nikita Khrushchev got up and denounced Stalin in at the party conference in 1956, he was asked about this. Why did all these Old Bolsheviks turn turtle like this? And his answer was: “Beat, beat, beat.” \\nIn other words, there is no complex psychological explanation : they were just tortured. \\nI think that goes to what happened to the American Conservative Movement. It wasn’t tortured; it was bought . It was simply bought . \\nI think the dominance of the Donorist class and the Donorist Party is one of the things that has emerged analytically within the past 10 years. \\nWhen I was first writing about American politics and got involved in American politics–and I started by working for John Ashbrook (not Ashcroft , Ash brook ) against Nixon in 1972 –nobody thought about donors. We have only gradually become conscious of them. And their absolute dominant role, and their ability to prohibit policy discussions, has really only become clear in the last five to ten years. \\nI think, in retrospect, with Buckley , who subsidized his lifestyle out of the National Review to a scandalous extent, that there was some financial transaction. I think that now. \\nIt’s an open secret that Rich Lowry did not want to come out and with this anti-Trump issue that they published earlier this year, but he was compelled to do it. That’s not the type of thing that Lowry would normally do. He wouldn’t take that kind of risk, he’s a courtier, he would never take the risk of not being invited to ride in Trump’s limousine in the case that Trump won. But, apparently, someone forced him to do it. And I think that someone was a donor and I think I know who it was. \\nSo I think that is the reason for the end of the American Conservative Movement. It really goes back to what Eric Hoffer said: “Every great cause begins as a movement, becomes a business, and eventually degenerates into a racket .” It’s a racket. \\nBut the good news is, as John Derbyshire said a few minutes ago, that ultimately Conservatism—or Rightism— is a personality type. It underlies politics and it will crop up again—just as, to our astonishment, Donald Trump has cropped up. \\nSo, I guess my bottom line here is: “ Don’t despair .” \\nPeter Brimelow [ ] is the editor of VDARE.com. His best-selling book, Alien Nation: Common Sense About America’s Immigration Disaster , is now available in Kindle format. (Reprinted from VDare.com  \""}, "time": 1742562269.5056522}