{"duration": 0.10941314697265625, "input_args": {"text": "'I sat across from my father, stared into his eyes for an entire minute and said three words he hadn’t heard a lot while growing up in a dilapidated mobile home park in Buffalo, NY.\\nHis eyes teared up and so did mine. I said, “I love you.”\\nA rush of energy flooded through both me and my father. Energy that brought the two of us closer together. Energy that helped us both reach deeper into ourselves.\\nYou see, as a blue-collar man raised in the smoke of the railroad industry, my father grew up like many men. He learned that in order to get the job done, he must hold in his emotions. Life is hard and thick skin is what gets you through the hardships that come along.\\nTrue perhaps to some degree, but as Joseph Campbell reminds us, “The fundamental human experience is that of compassion.” Compassion — showing love for others and love for ourselves— drives us all further down our own hero’s journey. Because remember, the hero’s journey isn’t Frodo searching for a ring nor is it Luke Skywalker mastering his Jedi skills to overthrow an evil empire.\\nThese are just metaphors for the hero’s journey, told through a compelling story.\\nThe hero’s journey is a journey inside. As Campbell himself puts it: “The hero journey is inside of you; tear off the veils and open the mystery of the self.”\\nTo move further down the inner hero’s journey, Campbell reminds us that we need to practice direct compassion for our self just as much as we do for others. \\nMy inner journey took a turn this past weekend and began with a six-hour drive to my hometown, Buffalo, NY. Instead of meeting up with a bunch of people and getting my whole family together, I did something different.\\nI met with each of them for one-on-one quality time and did something I haven’t done before. I looked them each in the eye and told them I loved them and explained why I do.\\nEach of them teared up. And I did too.\\nSee, here’s the thing:\\nDirect communication is compassion for the soul. \\nWhen’s the last time you looked someone in the eyes, held their hand, and told them how you honestly feel?\\nIt’s easier to go through our lives by avoiding eye contact and avoiding honest communication out of fear of argument. Why else are children often told to avoid topics of politics and religion at the dinner table?\\nConsider, however, that by being honest in our communication we practice compassion for ourselves. Through this, we gain confidence in our own voice.\\nHonest communication with others and ourselves is hard work. It’s a lot easier to politely agree or nod your head with someone instead of disagreeing with them. It’s a lot easier to avoid direct eye contact instead of telling someone they hurt you. It’s quite awkward at first to look at someone other than your spouse directly in the eyes and tell them you love them.\\nThis type of communication moves the energy in our relationships and all parties involved grow because of it.\\nI invite you to try this:\\nChoose someone in your life that you appreciate, love platonically, or love romantically that perhaps you haven’t told before or in a while. Or perhaps you haven’t been direct in your communication of how you feel. Spend just one minute and look directly in their eyes and continue to tell them throughout this time why you appreciate them. \\nThat’s it.\\nSounds too simple, yes. I thought so too. Thing is, many people (myself included) are not used to direct communication, so don’t be surprised if this moves the person you speak with.\\nChances are you’ll feel moved too because this directness opens doors to the self. Why? Because by doing so, you’re showing compassion for your greatest self.\\nAs I continue to connect the dots in my life and grow into a more actualized being, I’m learning that compassion for the self moves one further down the hero’s journey. If we disagree with someone, if we feel hurt, or if we love someone and haven’t deeply shared it, we’re not being honest with ourselves. We’re not showing compassion to ourselves. We’re holding ourselves back from truly learning from the experience.\\nAnd perhaps it’s these lessons that we sometimes need to open a door to the next stage in our journey.\\nWhat about you? Let me know what you think and share YOUR story with me. \\n\\n(Want stories like this delivered weekly to your mailbox? Reach out and subscribe at yourlop.com) \\n'"}, "time": 1742561867.148705}