{"duration": 0.45064306259155273, "input_args": {"text": "\"Home / #Solutions / Robert De Niro to Produce Documentary Exposing Corruption Within the Vaccine Industry Robert De Niro to Produce Documentary Exposing Corruption Within the Vaccine Industry Jay Syrmopoulos May 24, 2016 78 Comments \\nCannes, France – Hollywood superstar Robert De Niro dropped a bombshell recently when he revealed that he is working on producing a documentary about the highly controversial topic of vaccines. However, he remained tight-lipped, noting that “when he talks about it, something happens,” seemingly implying that some power from above could potentially stifle his planned project. \\nIn an interview with pop culture/entertainment site Vulture from the Cannes Film Festival on Friday, De Niro was asked about the controversy surrounding the planned screening of the documentary film “Vaxxed: From Catastrophe to Coverup” at his Tribeca Film Festival, and subsequent decision to not screen the film. \\nWell, what I learned, first of all, there was a big reaction, which I didn’t see coming, and it was from filmmakers — supposedly, I have yet to find out who it was. I wanted to just know who they were, because to me there was no reason not to see the movie. The movie is not hurting anybody. It says something. It said something to me that was valid. Maybe some things were inaccurate, but if the movie was 20 percent accurate, it was worth seeing. And they were saying it’s because of the filmmaker and he was discredited, but how was he discredited? By the medical establishment? There’s a lot going on that I still don’t understand, but it makes me question the whole thing, and the whole vaccine issue is a real one. It’s big money. So it did get attention. I was happy about that. And I talked about another movie called Trace Amounts that I saw and spoke about it a lot, that people should see it, and it’s there. Something is there with vaccines, because they’re not tested in some ways the way other medicines are, and they’re just taken for granted and mandated in some states. And people do get sick from it. Not everybody, but certain people are sensitive, like anything, penicillin. \\nWhen asked whether he would try and screen “Vaxxed” again if given the opportunity, De Niro said he wouldn’t be interested in doing so, but hinted that he and the mega-producer Harvey Weinstein were planning to create a new documentary film potentially focused on the massive financial incentives underpinning the vaccine manufacturing industry, as well as dubious ties between pharmaceutical companies and governmental agencies. \\nYeah, and you always say, you’re not against vaccines, you’re against what they put in vaccines that can hurt certain people who are allergic. It can kill them sometimes. And there’s such an industry. There’s big, big money in vaccines that the CDC will put… \\n…I’m working on something else. Harvey Weinstein and I are working on doing a documentary, but I don’t what to talk much about it, because when I talk about it, something happens. But that’s what we plan to try to do. \\nAfter “Vaxxed” was pulled from Tribeca, the Hollywood legend went on the Today show to defend his original stance of wanting to screen the documentary, noting that there was “no reason” to pull the film. The documentary was allegedly pulled due to threats from other filmmakers, which De Niro believed could negatively impact the film festival. \\nWhen Today host Willie Geist attempted to point out that there is an overwhelming amount of scientific research that has found no link between vaccines and autism, De Niro quickly responded. \\n“I believe it’s much more complicated than that. There is a link and they are saying there isn’t and there are…. other things there. I don’t know, I’m not a scientist but I know because I’ve seen so much reaction of just ‘let’s find out the truth.’” \\nDe Niro went on to explain that he believes there is a potential link between autism and the ingredients in vaccines, highlighting a documentary called “ Trace Amounts .” The film star pointed out that he isn’t anti-vaccine, but simply wants safe vaccines, noting that he is the father of an autistic child. \\n“I, as a parent of a child who has autism, am concerned. And I want to know the truth. And I’m not anti-vaccine; I want safe vaccines,” De Niro stated. \\nDe Niro obviously realizes the power residing within the industry, as he pointed out that even talking about this conceptual project could make “something happen.” The vaccine industry has a vested financial interest in not allowing a broad public discussion to be had about vaccines. The “something happens” De Niro nebulously refers to would most likely consist of the large financial powers at the root of big pharma leaning on any movie studio bold enough to take on De Niro’s vaccine project — similarly to what happened to “Vaxxed” at Tribeca. Jay Syrmopoulos is a geopolitical analyst, free thinker, researcher, and ardent opponent of authoritarianism. He is currently a graduate student at University of Denver pursuing a masters in Global Affairs. Jay’s work has been published on Ben Swann’s Truth in Media, Truth-Out, Raw Story, MintPress News, as well as many other sites. You can follow him on Twitter @sirmetropolis, on Facebook at Sir Metropolis and now on tsu. Share Google + rose528 \\ndon’t believe it. you already know that your beliefs are wrong. you act just like the nazi fascist party of NO (repugs) lie and keep lying you’ll change some people minds. But IT IS STILL A LIE Neo \\nIf you’re referring to Robert Di Nero,i think you’re delusional! If the industry has nothing to hide than there is no problem right! But there is a huge problem…..it’s all lie from the industry. You can only suppress the truth of the dangers of vaccines especially for so long before people wake up to the corruption. Vaccines kill and damage children everyday and that’s a fact! Vaccines kill more people and children than any diseases…another fact. There are no facts that vaccines work,prevent or eradicated any disease. Have a good day! \\nwrong tamarque \\nI sure hope you don’t ever have a child go regressive autistic after a vaccine, but I fear that will be the only thing to get you to look as your belief system that blindly trusts the lies of govt agencies that are bought and bolstered by drug corporations. Karyn Abbey Chase \\nPlease elaborate. What does “”wrong”” actually mean, and where are you in Canada Karyn? gingercake5 \\nAnd there are so many peanut allergies today because in the 1990s they were using peanut oil as an adjuvant. Those guys are so brilliant, aren’t they? ang \\nshes a paid t r o l l read above. ang \\nGo easy on rose528, these people are paid to post, and English is not their first language, that is why the posts are weird. Translation software isn’t always good. They work out of I n d I a. Seriously, P r o p a g a n d a that desperate? Mike Cooney \\nGreat Article! I think it is very important that a high profile celebrity is putting his name out there next to an issue such as this. \\nI have a 5 month old daughter and when she was given her first round of shots I felt horrible! I felt that I had failed her because I didn’t have all of the knowledge of what they were injecting her with. \\nI have been very skeptical of vaccines for a long time and obviously because of stories such as this. I think it’s very sketchy that there seems to be some new illness floating around every year and the establishment wants us all to run out and get some new vaccine that has been concocted. The fact that there is big money involved in pushing these vaccines just takes away more credibility. \\nWe are finally seeing some of the long term effects of these vaccines as well such as the 1970’s Swine Flu Vaccines where people who received those shots are having Central Nervous System problems. \\nDiNero is obviously invested in this because of his own child and sometimes that is what it takes for these issues to reach the light of day. When someone important is personally being affected, they want to speak out. \\nI love the site and the stories that The Free Thought Project has to offer and I commend you guys for really touching on the “uncomfortable” topics that the mainstream ignores. I am starting my own blog, The A.D.D. Theory and I hope to integrate the same kind of stories. I will be happy with a fraction of the success that you guys are having! Karyn Abbey Chase \\nWhat happened to your child after the first round? Nothing? Oh \\nMy kid has all his vaccinations! Why would bring back diseases and illnesses that our countries havnt seen for decades!. Maybe pesticides are responsible for autism. Read that article. ang \\nAre you sure your kid is OK? They lose 10 IQ points every shot of aluminium/glyphosate or thimerosol. And vaccines never got rid of disease, they cause it. Here is the chart for whooping cough Australia, DTP either worked or didn’t, but didn’t spread whoopinig cough, at least. Look what happened when we switched to Dtap notice the rise? Dtap vaccinated catch carry and spread, over and over, no symptoms. The ones on this chart ARE ONLY THE ONES WHOSE VACCINE FAILED. AND THEY GOT SYMPTOMS. Thank GOD! Simples solution, known since 2010, stop vaccinating, and our whooping cough would go back to 400 a year, and no baby deaths. Instead they keep using this useless vaccine, that is spreading whooping cough and killing babies, Australia now has 1 in 25 children, aged 6-12 with whooping cough cough, cough cough each year (all fully vaccinated!). 5 jabs for what? Just so they can carry and spread it everywhere with no symptoms, for bloody 6 years? So what do they do to hide this abysmal failure instead of just banning the vaccine in 2010? Jab more, jab babies before birth, in utero, with a vaccine that KILLS THEM IF GIVEN AT BIRTH> Seriously what did CDC expect would happen? 400 times the baby deaths inside the mother? And if the babies survive, 1 in 50 have sever brain damage called microcephaly? How evil can CDC be? How fucking corrupt can they be? Protecting a useless vaccine, and its pharma and trying to cover it, by killing and maiming MORE BABIES? ang \\nUSA is currently at the second peak, 2003 , UK is currently at the 2008, ready to launch off! All caused by Dtap, an acellular vaccine, that is abysmally useless, and during an outbreak, which is now CONSTANT IN AUSTRALIA< ALL THE DTAP KIDS, catch carry and spread pertussis. so the ones meant to be protected, the newborn babies, are now ALL INFECTED FROM SYMPTOMLESS DTAP VACCINATED SIBLINGS. Oh the chart is for pertussis in Australia/ Western Australia, Australia, lucky US! got Dtap first in the world 1996. UK 2004, USA 2008. The graphs are identical, adjusted for time since introduction of Dtap. In 2012, we had double the number for 2011. Now we don't even bother to report whooping cough, Out of my grandchildrens two classes, 60 kids with whooping cough 4 reported it, and bothered to get tested. Yes that long lasting cough your kids have, if it lasts 6-8 weeks, yes its whooping cough. Not serious at all, the kids here still go to school., they are allowed to THEY ARE VACCINATED! ROFL XX Besides the ones coughing, are the ones we know to keep away from newborn babies, it is the Dtap vaccinated, that are not coughing that are the menace! Karyn Draper \\nAnd yes I’m sure! He’s amazing and in perfect health. You’ll just have to admit you don’t know everything and take my word on it. ang \\nSo are you Karyn Abbey Chase, or Karyn Draper, you trolling skills are appalling, at least try and remember which alias you are damn using! Hilarious stuff! Karyn Draper \\nI’m not trolling. Suck it up I have 2 id’s and this site decided it wouldn’t log me in through fb with the one I originally used. I tried several times but it kept catching this one so I said fuck it I’ll post using this one then. ang \\nOK then I apologise. Disqus is notorious for blocking people, so why did they block your first alias? Karyn Draper \\nCouldn’t tell you. This is the first article of theirs I’ve ever commented on. And the last. Worse than fb for sure. ang \\nI agree Disquis is terrible. Anyway if you are in Canada, do you know when they switched completely to DTap, the old one, that worked was called DTP. So the important bit is the aP a meaning acellular, instead of whole vaccine. It is more of a GMO type vaccine, I was chatting on line to someone just like you in UK, and he sent me the raw stats, ie number of whooping cough reports per year, for last 20 years. I told him, that they introduced Dtap in 2004, and was spot on. The correlation is that clear. Do you have the stats, yearly for whooping cough in Canada? Our vaccination rate is 93% in Australia, do you know the rates in Canada. Oh, had an aunty in Canada, Ontario, right near Niagra falls. ang \\nHello Karyn, is you alter ego, another Karyn, weird you have two different surnames, did you just get married in the last 5 minutes or something weird? Karyn Draper \\nYou really wanna change the subject? That all your facts are wrong. K goodnight psychopath ang \\nPosting in a few threads, nice to meet you Karen, you did explain the other thread why you have multiple aliases, I accept that. Did you know there is no polio in India, but Bill Gates has just crippled 40,000 by using a live vaccine, that is proven to spread polio. Why did he do this? ang \\nYes the latest is called z ika Brazil All pregnant women got T dap mandated 2014, vaccines were ready and begun My 2015. Women even 20 weeks pregnant in outlying areas got the jab. Look what happened 20 weeks later. Out of 5,000 sick babies, 5.000 got the jab while still in utero. Out of those 5,000 sick micro babies, 4 (FOUR) had zika, weird how CDC think people will believe it was a mossie? As for USA, they have more sick vaccine damaged babies than Brazil, they used to have 400 a year, after pregnancy jabs, they now have 25,000 a year since 2013. There is no zika in USA, so what are they trying to blame now, pesticides? Or are they going to say, oh, must have had that mossie in USA, also, but we just didn’t know? Centres for Disease Corrution…………. the latest paper they put out claiming OH ITS ZIKA, could have been written by a two year old. The real scientists in this world, cringe, at their BLANTANT FRAUD. ang \\nSeems the troll cant remember what alias he/she is using, weird that? I write to a Karyn Abbey Chase, yet she forgets which alias, and replies as Karen Draper? Oh well they only have to have High School certificate, work out of India and get paid Rs7000 a month, yeah $20 a week! Karyn Draper \\nYour an idiot… ang \\nAdd some information there, please, any reason why you believe MMR vaccine is safe? Any reason why you believe pollution, and contaminated with pesticides etc, food is the only reason for autism? I agree it could be one, but surely injecting a baby with aluminium, glyphosate, and all the other things, besides three different diseases, all in one shot, possible could be dangerous? None of my kids got the MMR, different vaccines then, they are all fine, all my grandkids got the MMR< now I have 4 out of 9 autistic grandchildren. Good on Robert De Niro for asking the right questions. Yojimbo \\nokay there is a fucking article on the man RIGHT up top, how are you spelling his name wrong you fucking tards? lemonfoundation \\nLearn more about WMDs: chem/bio-warfare, depleted uranium (DU), vaccine contamination, and multi-trillion $$$ Holocaustal government cover-up it is, join us on FB –> https://www.facebook.com/groups/230128710353922/ \\nEveryone is welcome. We are veterans, military family, civilians, concerned citizens, and researchers. If its happening in the general public, I can assure you that it was tested on the military, first. Please feel free to add your friends to the group too. \\nKNOWLEDGE=POWER. UNITY=STRENGTH! WE THE PEOPLE MUST UNITE! ang \\nHi lemonfoundation, is difficult for me to post on facebook, they keep blocking me, but thanks for accepting me into the group. [email protected] email seems to be working fine still. ang \\nPeople are not allowed to be pro fact, because that costs the corrupt, lots and lots of money. Here is the graph for whooping cough Australia, first to get Dt aP ie part vaccine in 1996. Look what happened, 93% vaccination rate. Yeah, those vaccinated are the ones catching and spreading it now, over and over. So bad now, that these Dtap vaccinated people are just reinfecting the whole herd, so full of whooping cough, but they don’t get symptoms themselves until around 3 years after last vaccine. 5 jabs 5 years ….. So by 6-12 all the vaccinated kids are finally getting the symptoms themselves, coughing for 8 weeks, just annoying, not deadly, and then they are 100% protected with REAL IMMUNITY FOR LIFE. The problem is now, the herd is so damn constantly infected, the vaccinated symptomless siblings are the ones infecting the newborn babies, usually their newborn brother or sister. There is no unvaccinated lurking coughing person hiding in maternity ward corridors at all! That is pure fiction, siblings, no symptoms because of their vaccine, are spreading it to their little babies. CDC know this, Australia has known this since 2010. All they had to do was stop vaccinating, in about 3-5 years, ie yes by now, no more symptomless carriers, infecting babies. INSTEAD CDC DECIDED TO VACCINATE BABIES BEFORE BIRTH, WITH A VACCINE THAT KILLS THEM IF GIVEN AT BIRTH? That is why babies are so vulnerable, cant be vaccinated as it kills them…………. So what a logical person would assume would happen HAS HAPPENED. Babies after the jab die in utero, at 400 times the normal unlucky event. If they survive, they have a 1 in 50 chance of brain damage, called microcephaly. The mandated Tdap in Brazil in all pregnant women in 2014, the vaccine was produced locally under licence from GSK and they began jabbing pregnant women from 20 weeks gestation in May 2015, 20 weeks later look what happened? 5,000 of 5,000 deformed babies, had Tdap given in utero, and 4 (four) had zika. Now it is believed they got the zika, as they were already brain damaged in utero. Yet for some reason Centres for Disease and Corruption, seem unable to see this direct, and totally obvious 100% correlation, and have spent millions trying to prove a mossie done it. The only problem with the CDC theory, is that Dtap of pregnant women began in 2013 in USA< and USAs microcephalic births, went from 400 a year, to 25,000 YES TWENTY FIVE THOUSAND A YEAR. But apparently CDC missed this? ang \\nSee comments below, tried once, said not allowed to comment, tried again a different way, seems to have worked, hope so! Doran Zeigler \\nIt’s good that DeNiro is taking this stance. But, he still could have used his influence in keeping “Vaxxed” in the TriBeca Film Festival. He caved in to industry pressure and took a lot of heat for it. So, it is good that he has clarified his position on vaccines. \\nBut, I would like to tell him, that if the manufacturers could remove the “harmful” ingredients to make what he calls a “safe” vaccine, doesn’t he think they would have done it and end the controversy? The fact is that preservatives, which are harmful to humans, are needed in the vaccines so they do not spoil. \\nWhat would be a better topic to discuss is the entire premise of the vaccine theory which met a lot of opposition when it was first stated by Pasteur, and still is questioned to this very day. Tom Bowshall \\nAre you sure about this? Only today’s West Australian 25/05/2016 authoritatively states that all vaccines are safe, and babies immune systems can cope with thousands of vaccinations and Gardasil is one of the safest vaccines ever produced. Mind you they also said GMO’s were safe and quoted two scientific studies funded by Monsanto to back up their statement. They also said TPP’s are good for our economy and we will all benefit, that was all no quotes or sources to back that up. Wonder if the West Australian newspaper is trying to do a head job on us? ang \\nWell they been trying hard to get me from posting, Disqus more corrupt than even facebook, god help us! Karyn Draper \\nMaybe cuz you talk to much. Your kinda spamming this comment section. I especially like the zero deaths from measles. Did you read the wiki pediatric site. I especially love how there were appx 2.6 million in 1980. And vaccines have decreased this by 85% so now only a outlet hundred thousand people die from it. ang \\nHello Karyn, nice to meet you. Am I not allowed to have an opinion, even though I am a pathologist, specialising in microbiology, and haematology, also a chemical analyst, and yeah I know my stuff. I don’t read wiki rubbish, that is all been damn trolled out by pharma, so much it is now just pure rubbish. Why should I talk about measles in the world? I live in Australia, we have decent sewerage systems, decent water, food, and hygienic living conditions. Where do you live that you have had measles deaths? Mumbai? Karyn Draper \\nI live in canada. And you are mistaken again. Someone in California died in 2015 from measles and it was the first death since 2003 ang \\nOk one measles death in 12 years. That death, was a lady in hospital, who was fully vaccinated, and she had measles, with no spots, she infected others in the hospital, they were not aware she actually had measles until the autopsy. She had measles, and they didn’t even know until she died and did an autopsy? Fully vaccinated. 0101 \\nwe’re lucky you live in Straya keep the harness tight don’t let go ang \\nHello staff member 0101 what you posted makes no sense, get a supervisor to check your English. Translation software just doesn’t make sense all the time. 0101 \\nthe US I guess, because of people like you Dee Pol \\nHi Angela Coral Eisenhauer – you have now been reported to AHPRA for falsely claiming you are a pathologist… \\nGo ahead and remove your comments – not to matter – screenshots have been taken and sent… 😀 \\nHave a great day!!!!\""}, "time": 1742562929.7977035}