{"duration": 0.05643749237060547, "input_args": {"text": "'The president of the American Conservative Union, the sponsor of the annual Conservative Political Action Conference, told Breitbart News Sunday host Matt Boyle that this year’s CPAC is about action after years of protest over taxes, regulations, and Obamacare. [“Now the question is: Are we really going to get it done?” said Matt Schlapp, who leads the ACU, one of the leading conservative group’s in the country and the keeper of the ACU Ratings scorecard.  Schlapp told Boyle that after the political victories of 2016, conservatives gather at CPAC, which opens Wednesday and runs through Saturday morning, to make sure the politicians fulfill the promises made to conservative activists. “How do we repeal and replace Obamacare? What is the right tax package to get passed into law?” he asked. “What can we do to stop these regulations? What can we do to keep Americans safe from Islamic terrorists? It is going to be a   of the actual ways that policies getting impacted. ” This is not the time for theories, he said. “It’s real. It’s: What do we have to do now?” Schlapp said. “As happens every time at CPAC, there’s going to be times when the movement and grassroots activists have to push those in government  —  even those we respect. ” The Conservative Political Action Conference began in 1973 as a partnership between the ACU and Young Americans for Freedom. It was part of the same movement by conservatives that supported Rep. John Ashbrook to oppose President Richard Nixon in the 1972 Republican primaries and led to the founding of the Heritage Foundation and the Republican Study Committee. Unlike any other annual political gathering, CPAC has always been full of college and high school students mixing with the activists and the dynamic is about the politicians coming to see the conservatives and make their case —  not the other way around. In addition to Republican office holders, administration officials and conservative thought leaders, Breitbart Technology Editor Milo Yiannopoulos is scheduled to deliver CPAC’s keynote address. Schlapp said with Republicans in control of Congress and the White House, the expectations are very high. Another highlight of the 2017 CPAC is the joint conversation with White House Chief of Staff Reince Preibus and White House Chief Strategist Stephen K. Bannon facilitated by Schlapp. He said: “I think there are a lot of questions that people in the audience probably want me to ask —  like: Hey, how’s it all working up there?” Boyle told Schlapp that he remembered when President Donald Trump spoke at the 2013 CPAC. “He really lit the room on fire. ” Is Trump coming to CPAC this year? he asked Schlapp. “Well, I’m hopeful he’ll be there,” Schlapp said. Trump’s 2016 appearance was canceled at the last minute in favor of a campaign stop. “He has been to CPAC, I think, for five years or so,” he said. “You never know what he is going to do, which is why he is a political genius in a lot of ways. I’m hoping he doesn’t just read a script. I hope, if he comes, he speaks from the heart and thanks these activists. “Trump knows these are the activists who helped put him in the White House. ” In the   to Wednesday’s CPAC opening Schlapp and his wife Mercedes have their show on SiriusXM’s Patriot Channel 125 “The Road to CPAC 2017,” where they talk about the conference and what people can expect. Here the whole conversation with ACU President Matt Schlapp and Breitbart News Daily host Matt Boyle: '"}, "time": 1742564218.8387222}