{"duration": 0.1221928596496582, "input_args": {"text": "'Fifty years ago right about now, two unassuming young brothers were standing in front of a CBS studio audience taping the first episode of their new variety show. They were also about to unleash the modern concept of television buzz, in a storm the likes of which the medium had not seen. They were the Smothers Brothers, Tom and Dick, and the    story of their show, “The Smothers Brothers Comedy Hour,” is worth recalling 50 years on as a case study that may prove newly relevant as a president with a habit of attacking TV shows via Twitter settles into office. That first episode, taped in late January and broadcast Feb. 5, 1967, wasn’t incendiary, but some that came later were spectacularly so. The brothers inflamed CBS censors and segments of their audience by injecting sexual innuendo, drug references, religion and especially politics into the typically bland   format, drawing, in Season 3, a   firing. The story of the show can seem  . The brothers were delivering two things that every network today covets: a lot of attention and a young audience. Why kill that    goose? The answer lies in the newness of it all. In 1967, no one knew quite how to exploit controversy and   conversation the way   publicists do. The series was CBS’s latest effort to compete against “Bonanza,” the NBC staple that had owned Sunday nights for years. The brothers had a     stage act in which Tom, on guitar, played a dimwit, and Dick, on bass, was the straight man. The dynamic translated exceedingly well to TV. Dick Smothers, now 77, who lives in Florida and advocates fitness and balance programs for older people, was a bit surprised by the show’s popularity at first. “I didn’t think we sang that well,” he said. “Now I can see the genuineness, the whimsy that we had. ” The series was remarkable for its   approach, mixing established guest stars with newcomers and rock acts. A September 1967 installment had Bette Davis, Mickey Rooney and the Who, whose   finale that night is said to have damaged Pete Townshend’s hearing. The multigenerational lineups led to ratings success some weeks, the show even outdrew “Bonanza. ” But the humor content increasingly reflected contentious times, and by Season 2, clashes with CBS’s censors were frequent. “They had something to offend everybody,” William H. Tankersley, then the executive in charge of programming standards and practices at CBS, said in a 2001 interview with the Archive of American Television, still sounding peeved. (Mr. Tankersley died last year at 98.) “They brought more complaints than any show in history on CBS. They injected politics up to the sky. They refused to do anything that we asked. ” The CBS response, though, was oddly inconsistent, evidence of how uncharted this territory was. Pete Seeger’s performance of the antiwar “Waist Deep in the Big Muddy” was cut out of his performance in an early Season 2 episode, but five months later he was allowed to sing the song. What today seems barely saucy would be cut. One early battle involved efforts to say “frigget” instead of “ribbet” in a frog sketch, David Bianculli recounts in “Dangerously Funny: The Uncensored Story of the Smothers Brothers Comedy Hour. ” A sort of guerrilla war broke out in which banned material would turn up in newspapers, including this one as early as April 1967, The New York Times reprinted a sketch by Elaine May that the network had killed. Yet some of the material that made it onto the air was pointed enough to raise eyebrows even today. A series of sketches in a December 1967 episode, for instance, mocked the American obsession with guns mercilessly. In one bit, a   contestant was to take shots at three hidden figures in hopes of killing either a stranger, a celebrity or his own wife. If the network was surprised by the show’s success and all the controversy, people on the creative side of things were, too. “I was naïve enough to think that nobody was watching except my friends,” said David Steinberg, who was then a   comedian who had made a few “Tonight Show” appearances. “We didn’t know that we were bothering the government. ” In Season 3, Mr. Steinberg did one of his satirical “sermonettes,” in which he tweaked religion, a subject that television of the day didn’t like to touch. Some time after that appearance, he said, he dropped by the show’s headquarters and Tom Smothers dragged him to a room that contained a bunch of bulging duffel bags. “I said, ‘What is this? ’” Mr. Steinberg recalled. “And he said, ‘It’s your hate mail. ’” In March 1969, Tom Smothers asked Mr. Steinberg to do another sermonette, although the network had banned the bit. That move is often credited with being the last straw, though it was just one of many, many straws. In any case, the network fired the Smotherses and canceled the show, though it was still pulling in decent ratings. Since those times, networks have learned that a certain amount of boundary pushing is healthy politicians have become more adept at manipulating TV and the people on the creative side have begun to understand that being on TV, especially in network prime time, requires compromises. That learning process continues today just ask Keith Olbermann or Bill Maher,   hosts whose mouths have landed them in hot water. Yet     content, the thing that got the Smothers Brothers in trouble, is all over prime time, even on comedies like “ . ” And now comes Donald J. Trump, who seems to have thin skin. The Smotherses incurred the wrath of two presidents, Lyndon B. Johnson and Richard M. Nixon. Tom Smothers, who turns 80 in February, said in an interview in 2000 that he had always believed Nixon was directly responsible for his show’s demise. “There was a bigger game going on that was beyond our scope of understanding,” he said. Who knows what games lie ahead as a Twitter president takes office?'"}, "time": 1742563203.705846}