{"duration": 0.10643935203552246, "input_args": {"text": "'Senate Democrats To FBI: Put Up Or Shut Up About Emails (TWEETS) By Darrell Lucus on October 30, 2016 Subscribe \\nIf there was any doubt that FBI Director James Comey’s announcement that the FBI was reviewing potential evidence in the Hillary Clinton email affair backfired spectacularly, it was erased on Saturday night. Four top Senate Democrats gave Comey an ultimatum –give us a full accounting of what you know about this, and do so by Monday. \\nSenators Dianne Feinstein, Patrick Leahy, Tom Carper, and Ben Cardin fired off a “what the hell is going on here?” letter to Comey and his nominal boss, Attorney General Loretta Lynch, demanding answers about Comey’s “vaguely worded” letter on Friday afternoon. They are the ranking members of the Senate committees that were most involved in the email server investigation–Intelligence (Feinstein), Judiciary (Leahy), Homeland Security (Carper), and Foreign Relations (Cardin). \\nRead the full letter here, courtesy Cardin’s Twitter feed. \\n— Senator Ben Cardin (@SenatorCardin) October 30, 2016 \\nIn a colossal understatement, they pointed out that the letter didn’t answer any questions, but in fact left a lot of them unanswered. For one thing, Comey’s letter didn’t clarify whether the FBI even had the emails in its custody, let alone had a chance to review them. Comey also didn’t say whether Hillary sent the emails, or if they even had anything to do with the investigation. Additionally, it represented a radical departure from FBI and Justice Department policy against doing anything that could potentially influence an election. \\nThe Senators also noted that Comey had told his own troops that he didn’t know just how significant those emails were, and that there was a possibility that his letter would be “misunderstood.” In light of the fact that this letter has already been misunderstood, Feinstein, Carper, Leahy, and Cardin want Comey and Lynch–in truth, Comey–to give the Senate “detailed information” about the FBI’s actions no later than the close of business on Monday. To not do so, they add, “would be irresponsible and a disservice to the American people.” \\nThere were already a number of reasons why Comey should be very afraid. For one thing, at the time, the FBI had not even obtained a warrant for the emails it discovered on the laptop of longtime Hillary aide Huma Abedin while investigating her estranged husband, Anthony Weiner, for inappropriate texts with a teenager. So Comey felt the need to alert the House and Senate about these emails, when his people hadn’t even asked a court to review them. \\nWe also know that Comey’s rumored excuse–that the emails were likely to be leaked unless he told Congress about them first–doesn’t wash. Judge Jeanine Pirro , no fan of Hillary, thinks Comey could have easily solved that problem by privately notifying the committee chairmen and putting them on notice that he would know who was behind any leaks. \\nBut on Sunday afternoon, The Washington Post reported that the FBI hadn’t gotten a warrant for those emails despite knowing for at least a month that those messages were potentially relevant to the email server case. It finally obtained a warrant on Sunday night. How is Comey going to explain that to the Senate, especially since he knew how explosive this could have been? \\nIt’s no wonder that Comey’s own troops are steaming mad at him, according to Newsweek and Vanity Fair’s Kurt Eichenwald. Here’s what Eichenwald has learned, by way of review. Word from inside @FBI . FURIOUS at Comey, think he\\'s mishandled public revelations from get go. \"Outrageous incompetence\" one agent told me. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 …his original decision to lay out info on clinton case, then opine on what it meant outside of criminal findings, infuriated these folks.. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 Re: anger within @FBI at Comey. I am getting this at the Special Agent, ASAC and SAC level. Those are the troops. (Most of em GOPrs)…. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 …for Comey to have so angered ppl at the field office level is really, really bad. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 If Comey\\'s improper comment on ongoing investigation changes polls, @FBI reputation as apolitical will never recover cause of his screwup. \\n— Kurt Eichenwald (@kurteichenwald) October 29, 2016 \\nWhile Feinstein, Leahy, Carper, and Cardin played good cop, their boss, Minority Leader Harry Reid, played bad cop, accusing Comey of breaking the Hatch Act . I wouldn’t quite go that far. But when the best-case scenario is that Comey was grossly incompetent, that isn’t good. \\nComey’s actions may not have risen to the level of criminal conduct. However, it is clear beyond any doubt that he cannot lead. Eichenwald has talked to a number of DOJ officials from both parties who feel the same way. Every current/former Dept. of Justice official I speak 2, GOP or Dem, says Comey must resign/be fired 4 election interference. All outraged. \\n— Kurt Eichenwald (@kurteichenwald) October 30, 2016 \\nUnless Comey has a very good explanation for this–and frankly, I doubt there is one–we need to hear only two things from him after he briefs the Senate. He needs to apologize to the American people, and he needs to resign. \\n( featured image courtesy FBI Flickr feed, part of public domain) About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right\\'s worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect'"}, "time": 1742562713.0322468}