{"duration": 0.09137654304504395, "input_args": {"text": "'BY ROBERT SPENCER \\nIt’s a common and recurring tendency among conservative Catholics to be complacent regarding the jihad threat because of a desire to see Muslims as allies in a culture war against all-encroaching and authoritarian secularism. This idea is based on ignorance of or indifference to the fact that, with its polygamy, divorce at a word, sexual slavery of Infidel women, allowance for wife-beating, tolerance for early abortion, and more, Islamic sexual morality is hardly akin to Catholic sexual morality. There is also a tendency, which is also found all over the West outside the Catholic Church, to assume that various concepts, and acts designed to express them, mean the same thing in an Islamic context that they do in a non-Muslim context. That false assumption is what we see here from Archbishop Chaput with regard to modesty. \\nArchbishop Chaput says: “The hijab and the burqa say two important things in a morally confused culture: ‘I’m not sexually available;’ and ‘I belong to a community different and separate from you and your obsessions.’” In reality, that is what a Western woman might be intending to convey, but in an Islamic context the message is slightly different, and that slight difference is all-important. Yes, the hijab and burqa certainly say, ‘I’m not sexually available” and “I belong to a community different and separate from you and your obsessions.” But there is more. The Qur’an says: “O Prophet, tell your wives and your daughters and the women of the believers to bring down over themselves of their outer garments. That is more suitable that they will be known and not be abused.” (33:59) This is the foundation of the prevailing assumption in Islamic culture that if a woman is raped or sexually abused, it is her fault for exciting men, who can’t be expected to control themselves. This is the assumption underlying honor killing, and the reason why it is so common in the Islamic Republic of Pakistan and other Muslim countries for women to be imprisoned after they were raped: the rape is their fault. \\nSo the hijab and burqa are really saying: “I am assuming the responsibility — willingly or not — for the possibility that I might be raped or sexually abused.” It is a visible sign of the subjugation of women. \\nAnd that “willingly or not” clause is all-important as well. Archbishop Chaput says: “I admire the integrity of those Muslim women” who wear the hijab and the burqa. He assumes that they are wearing it freely, as they would be in the West. And to be sure, many Muslim women, especially in the West, are indeed wearing it of their own volition. What does Archbishop Chaput think of the integrity of Aqsa Parvez, whose Muslim father choked her to death with her hijab after she refused to wear it? How does he feel about the integrity of Amina Muse Ali, a Christian woman in Somalia whom Muslims murdered because she wasn’t wearing a hijab? And of the 40 women who were murdered in Iraq in 2007 for not wearing the hijab; and of Alya Al-Safar, whose Muslim cousin threatened to kill her and harm her family because she stopped wearing the hijab in Britain; and of Amira Osman Hamid, who faces whipping in Sudan for refusing to wear the hijab; and of the Egyptian girl, also named Amira, who committed suicide after being brutalized for her family for refusing to wear the hijab; and of the \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742564451.432462}