{"duration": 0.06535100936889648, "input_args": {"text": "'President Donald Trump on Thursday said he did not ask former FBI Director James Comey to back down on investigating   Security Adviser Michael Flynn. [“No. No. Next question,” he said at a joint White House press conference, in response to reports that said Comey wrote a memo alleging that he did.  In his first press conference since he fired Comey, Trump defended his decision to do so, saying he thought it would actually draw bipartisan praise.  “When I made that decision, I actually thought that it would be a bipartisan decision. Because you look at all of the people on the Democratic side, not only the Republican side, that were saying such terrible things about Director Comey,” he said.  Democrats had slammed Comey’s “poor” handling of the Clinton email investigation as recently as this month, but then later decried his firing as an attempt to stymie the FBI’s investigation into Russian interference in the elections and any collusion with Trump’s campaign.  Trump said Deputy Attorney General Rod Rosenstein had recommended Comey’s firing due to his “very poor” performance at a Senate hearing earlier this month.  “That was a poor, poor performance,” Trump said. “So poor, in fact, that I believe  …    that’s why the deputy attorney general went out and wrote his very, very strong letter. ” He referenced Comey’s misstatement that Hillary Clinton adviser Huma Abedin had forwarded “hundreds and thousands” of emails to her husband Anthony Weiner, when FBI officials said it was only a “handful” of emails.  “I thought that was something that was terrible. We need a great director of the FBI. I cherish the FBI. It’s special,” he said.  “We’re going to have a director who’s going to be outstanding, I’ll be announcing that director very soon. And I look forward to doing it. I think the people in the FBI will be very, very, very, very thrilled. Trump also vigorously denied there has been any collusion and said he respected Rosenstein’s decision to appoint Robert Mueller as a special counsel to take over the investigation.  “I respect the move but the entire thing has been a witch hunt,” he said.  “There is no collusion between certainly myself and my campaign, but I can always speak for myself and the Russians, zero. ”  Trump said the issue is dividing the country and he wanted to get to work running the country.  “We look forward to getting this whole situation behind us so that, when we go for the jobs, when we go for the strong military, when we go for all of the things that we’ve been pushing so hard and so successfully, including health care,” he said.  “We need health care. We need to cut taxes. We’re going to cut taxes. If I get what I want, it’ll be the biggest tax cut in the history of our nation. And that’s what I want. It’s going to bring back companies. It’s going to bring back jobs. We lost so many jobs and so many companies,” he added.  “There was no collusion. And everybody, even my enemies, have said there is no collusion,” he said. “So, we want to get back and keep on the track that we’re on, because the track that we’re on is  . And that’s what we want to do is we want to break very positive records. ” '"}, "time": 1742561768.5500877}