{"duration": 0.03755068778991699, "input_args": {"text": "'A woman is suing a casino after a slot machine told her she won a $43 million jackpot, but the casino claimed it was an error and offered her a free steak dinner instead. [Katrina Bookman played the “Sphinx Slot Machine” at Resorts World Casino in Queens, New York in August 2016 when the screen popped up saying that she won $42, 949, 672. 76, the New York Daily News reported.  Bookman, excited thinking she won a great prize, took a selfie with the screen in the background. When she went to collect her prize, however, a casino worker told her a different story. The worker told her that she did not win the jackpot, but offered her a complimentary steak dinner and $2.  the prize the casino claims she won. Alan Ripka, a lawyer for Bookman, said she did not take the casino worker’s offer. Instead, Bookman filed a lawsuit against the casino Wednesday in Queens County Supreme Court. “You can’t claim a machine is broken because you want it to be broken. Does that mean it wasn’t inspected? Does it mean it wasn’t maintained? ,” Ripka told CNN Money. “And if so, does that mean that people that played there before [Bookman] had zero chance of winning?” Ripka is seeking at least $43 million in damages, the amount Bookman claims she won, from the casino for causing his client “mental anguish” and setting her back financially as a result of not being able to collect her prize. The complaint says the casino was “negligent” in failing to maintain the machine and names Genting New York LLC, Resorts World Casino’s parent company, as well as slot machine manufacturer International Game Technology as  . Dan Bank, a Resorts World spokesman, apologized in August and said: “Casino personnel were able to determine that the figure displayed on the penny slot was the result of an obvious malfunction  —   a fact later confirmed by the New York State Gaming Commission. ” The New York State Gaming Commission released a statement in August claiming that a disclaimer stating “malfunctions void all pays and plays” was posted on the machine at the time. The Iowa Supreme Court ruled in favor of Isle Casino Hotel in a similar court case in 2015 where the slot machine told a    woman she won $41 million, the Chicago Tribune reported. The court claimed that “the game’s rules capped jackpots at $10, 000 and didn’t allow bonuses. ”'"}, "time": 1742561849.462521}