{"duration": 0.08134698867797852, "input_args": {"text": "'THE HAGUE (AFP)  —   Geert Wilders may have been beaten into second place in the Dutch elections but the   MP will enjoy a magnified role in parliament and remain a force to be reckoned with, analysts said. [While he failed in his aim of starting a “patriotic revolution,” Wilders has already succeeded in shifting the debate and the tone in Dutch politics on immigration and integration, observers said.  Campaigning on an   ticket, the   politician saw his hopes wilt from an   high in January when opinion polls had said he could win as many as 37 seats in the   Dutch lower chamber. Instead, he captured a more sobering 20 seats in Wednesday’s general elections, behind the 33 won by the Liberal party of Prime Minister Mark Rutte, but enough to place his Freedom Party (PVV) second. “It would have been great if we were the largest, but we’re willing to talk and help govern. That’s my hope,” Wilders told journalists Thursday. But he warned his party would “show our hard opposition side” if he were excluded. The long process to form the next government has begun with the VVD sounding out other parties to try to cobble together a coalition. Most parties leaders, including Rutte, have already vowed not to work with Wilders, alienated by his fiery     rhetoric, and his    attitude.  —   Long shadow  —   But analysts say Wilders, who quit the VVD in 2006 to set up his party, will continue to cast a long shadow across the Dutch political landscape and has already succeeded in pulling the lowlands country to the right. “What’s telling is that many parties, including Rutte’s VVD, have already taken on some of the PVV’s viewpoints and content  …     particularly when it comes to immigration policies,” said Matthijs Rooduijn, a political sociologist at Utrecht University. “That doesn’t mean that parties like the VVD  …     suddenly moved to the   but there certainly is a shift in that direction,” he said. “Most parties have become more nationalist and that’s because of the PVV’s influence,” he said. With Wilders likely to end up the largest party in opposition, more clashes are also forecast, such as with rising young   star Jesse Klaver, whose GroenLinks party upped their seats from four to 14. Wilders will also likely lock horns with the progressive leader of Democracy party D66, Alexander Pechtold, which the PVV beat into third place with 19 seats. Should D66 or GroenLinks enter government with Rutte “the clash is going to continue when it comes to social and cultural topics. And the sparks are going to fly,” Rooduijn said.  —   ‘Bland political elites’  —   Wilders, who already triggered the collapse of one Rutte government in 2012, could also seek to exploit the fragmented nature of the next coalition which will be made up of at least four and maybe five parties, Rooduijn said. “He could argue the new cabinet is making too many compromises and   deals  —   it will give him extra ammunition for his populist message that there’s a bland political elite who still won’t listen to voters’ concerns,” he said. “The outcome of this election does not at all mean the end of Geert Wilders and the issues that he is advocating,” said Claes de Vreese, politics professor at the University of Amsterdam. “He remains an important force in Dutch and European politics. He had more votes and increased his number of seats, even though it was not this ‘people’s revolution’ that he was claiming. ” Wilders was hailed by European   leaders too, ahead of other key elections in France and Germany this year, who said his polls performance was far from a defeat. His success “proves that the ideas we share are advancing in the various European countries,” said Marine Le Pen, leader of France’s National Front, who is hoping to upset the French presidential elections. “Ignore the froth: whilst the establishment did cling on, they took a beating at this election,” wrote the new   British blog Westmonster. Wilders’s notoriety has already spread across the Atlantic. Trevor Noah, who hosts the popular US late night programme “The Daily Show” gave Wilders and his “hateful” message a roasting Thursday, comparing his blond mesh to Donald Trump, and likening him to a blond villan played by the actor Christopher Walken’s in “Batman Returns. ”'"}, "time": 1742562955.5636573}