{"duration": 0.18546438217163086, "input_args": {"text": "'Shortly after Jane Pauley’s daytime talk show was canceled 11 years ago, she thought that might be it for her. Though long forgotten, “The Jane Pauley Show” was a program NBC spent millions on, and executives had very high hopes for it. Instead, it was a bust, and was yanked off the air after one season. “I didn’t expect to have a career in television after that,” Ms. Pauley said in a recent interview. For a while, it looked like she might be right. All anchors of a certain age  —   particularly women  —   are confronted with the reality of diminished opportunity, and even with a distinguished broadcasting career, Ms. Pauley was no exception. Over the course of the next several years, there were some work with PBS, the irregular appearance on “Today” where she profiled aging baby boomers, and little else. And then came an unexpected comeback. She signed on with CBS two years ago and started doing features for its popular “Sunday Morning” program and filling in for various anchors, including on “CBS This Morning” and “The Evening News. ” And on Sunday she will triumphantly return to the spotlight: A couple weeks shy of 66, Ms. Pauley will formally succeed Charles Osgood as the anchor of “Sunday Morning. ” “There have been high points in my career, and low points as well,” she said. “But even at the low points there have always been these rebounds. Like those trick birthday candles: It flickers off, and comes on again!” Ms. Pauley was sitting on a couch at the CBS Broadcast Center, nursing a cup of tea to help her stave off a coughing fit. (She said she got a cold from her grandchildren by way of her husband, the “Doonesbury” creator Garry Trudeau.) She was quick to point out the fairly incredible timing of her “Sunday Morning” debut: It will occur almost 40 years after her first day as a   on “Today” where, at 25, she followed Barbara Walters. Her first day at “Today” was Oct. 11, 1976. But as much as Ms. Pauley will be remembered for her broadcast accomplishments, it is her departures that have prompted more sensational headlines. “I always make news by leaving,” she said, laughing. Well before Ann Curry’s disastrous departure from “Today,” in 2012, Ms. Pauley also left the show in acrimonious circumstances. NBC had brought in Deborah Norville to join Ms. Pauley and Bryant Gumbel in 1989. Ms. Pauley figured NBC had hired her replacement, and decided to act first: She announced shortly after Ms. Norville’s arrival that she was leaving the show. The damage to NBC was significant. Viewers were repelled by what they perceived as Ms. Pauley being pushed out, and fled “Today” for “Good Morning America” on ABC. The magazine editor Michael Kinsley once said Ms. Pauley was “the first baby boomer they tried to put out to pasture   …     and failed. ” Ms. Pauley stayed with NBC and moved onto a successful   run as   of the newsmagazine show “Dateline. ” But Ms. Pauley decided it was time to do something different, and in 2003 announced she would leave that show. NBC was caught off guard by her decision and what followed was yet another wave of warm publicity for her. NBC’s parent company found a way to get her to stay. “I think NBC noticed I’m getting all this attention and then came to me with the offer of a daytime show,” she said. Ms. Pauley has long been praised for exuding normalness on camera (“She’s as skilled a prompter reader as anyone I’ve worked with in 40 years in the business,” said Michael Weisman, the producer of her daytime show). That skill set did not carry over for her talk show. “People respected her and liked her, but she wasn’t relatable to the typical daytime audience,” Mr. Weisman said. “She was somebody who you would go to for career advice, not the girlfriend who you’d go to for cooking tips or weight loss tips or who’s dating who. ” Ms. Pauley said she was proud of the show, but even she acknowledged that it was a failure. And that is when she entered what she describes as her “fallow period. ” She returned to “Today’’ with a    segment about baby boomers. In 2014, she published a book, “Your Life Calling: Reimagining the Rest of Your Life,” that was inspired by those spots. The AARP paid for and sponsored the segment  —   which is why Ms. Pauley says she believes “Today” broadcast it  —   but just as she was beginning her book tour, the AARP said it was ending its commitment. Once again, Ms. Pauley was a television personality without a television job. “It wasn’t a tremendous disappointment but it was a little awkward in that I was on book tour talking about the future and I didn’t have one,” she said. Until she did again. While promoting her book, she was featured on “Sunday Morning. ” That is when CBS producers noticed something unusual: Emails were pouring in from viewers about how much they enjoyed the segment. CBS signed her as a contributor. Ms. Pauley leapt at the chance, and what was a modest commitment soon turned into steady work. When Mr. Osgood, the      host of “Sunday Morning,” was ready to step aside after more than two decades, CBS turned to Ms. Pauley. David Rhodes, the CBS News president, said that Ms. Pauley’s range, reputation and warmth made her the right steward for the job. “Sunday Morning” is the highest rated show on Sunday mornings, and CBS needs it to stay that way. “As much as you always want to bring new viewers to a program, this broadcast has a very dedicated audience,” Mr. Rhodes said. “You can’t chase them away. ” Ms. Pauley said that there would be few changes to the quirky show and that she was confident of one thing: she would be a good fit as anchor, she said repeatedly during the interview. And after a stretch where TV work was hard to come by, she said she’s soaking it all in now. “Where I come from  —   which is Indiana, and I’m a Hoosier five generations both sides  —   you do not boast or brag,” she said. “It’s an old joke of mine that the only thing we’re entitled to brag about is our humility. I’ve been dragging that around my whole career by apologizing, or saying ‘Oh, I’m so lucky. ’” She started laughing and added, “I seem to be over that. ”'"}, "time": 1742561713.3253512}