{"duration": 0.060178279876708984, "input_args": {"text": "'This post was originally published on this site \\n[embedded content] \\n“I ask in the framework of the Ukrainian legislation to deal with those criminals who have today blocked the work of the court. Those who did it are criminally liable. I am interested in establishing the truth and on Monday [28.11.16] it definitely will be,” said Yanukovych. The questioning of the ex-President Viktor Yanukovych can’t start due to the fact that ex- “Berkut officers” cannot be brought to Svyatoshinsky court. Their departure from the Lukyanovsky detention center was blocked by radicals of Right Sector. \\nToday the questioning of ex-President of Ukraine Viktor Yanukovych via videoconference in the Svyatoshinsky district court of Kiev was to be held. However, several dozen radicals blocked the exit of Lukyanovsky jail, thus, the former “Berkut officers” could not be brought to Svyatoshinsky court. \\nNote that the building of the Svyatoshinsky district court of Kiev is guarded today by 130 police officers. \\nAs a reminder, Yanukovych’s interrogation takes place in the framework of the case of five former employees of the “Berkut” special forces. The ex-President of Ukraine is present as a witness. \\nOver the years, such a quantity of videos have been published that the question of who was shooting is no longer rhetorical. “Berkut” was accused of aggressiveness on Maidan, but the soldiers of these special forces became the first victims. The resident of Lvov Ivan Bubenchik is not even hiding, but rather willingly gives interviews in which he brags about being the first who opened fire on the officers on Maidan. \\n“At first, I eliminated officers. Two. And then I didn’t do anything to the soldiers, I just wounded one in the leg,” said Bubenchik. \\n[embedded content] \\nHowever, somehow it is not him who is on trial, but five fighters of “Berkut” . Investigators allegedly found involvement of the Kiev special “Berkut” units in the murders of 48 members of Maidan and the gunshot wounds of another 80 protesters on February 20th, 2014, on Instytutska street. As a result of the investigation into 25 employees of the special forces and the leadership of the “Berkut” regiment it was reported about the suspicion of involvement in these events, and from 20 of them on the wanted list, five are in custody. \\nEarlier it was reported that the scandalous lawyer Mark Feygin had invented how it’s possible to use the video conference questioning of ex-President of Ukraine Viktor Yanukovych. Parubiy demands the return of Yanukovych to Ukrainian territory \\nSpeaker of Parliament Andriy Parubiy urged the Ukrainian investigators to read out the charges during the video interrogation former President of Ukraine Viktor Yanukovych. \\n“I think the most important thing that needs to be done by the Ukrainian investigators is to read out the charges against Yanukovych,” he declared to journalists of local media. After this, according to him, Kiev authorities will “continue to work” . In addition, Parubiy stated that it is precisely Yanukovych who is responsible for “what was on Maidan, and what was after Maidan” . \\nThe speaker of the Rada also believes that Kiev should demand the return of the former President to Ukraine. For this purpose, as Parubiy said, it is necessary to use every opportunity. Copyright © 2016. All Rights Reserved. Related '"}, "time": 1742562136.245713}