{"duration": 0.12714767456054688, "input_args": {"text": "'The capital city of New Mexico doubled down on its sanctuary city status despite knowing it is risking losing federal funds. The Santa Fe City Council unanimously approved a resolution reaffirming its policy. [Responding to a threat from   Donald Trump to defund sanctuary cities, the council moved forward with plans to refuse access to city property by immigration agents and keep the immigration status of any person confidential.  “This is doubling down,” City Council Member Joseph Maestas, the Albuquerque Journal reported. “We’re thumbing our nose at this incoming administration. ” In reference to the possible loss of federal funding, former Santa Fe Mayor David Cross told the council, “If that’s all we’re worried about, shame on us. That’s not what Santa Fe is about. ” The State of New Mexico has gone back and forth on its position on cooperating with immigration officials. In 1986,   Toney Anaya declared the state to be a sanctuary state, according to SanctuaryCities. info, a website that tracks such jurisdictions. That decision was reversed in 2011 by Governor Susana Martinez, a former prosecutor. “I did an executive order within minutes after I was sworn into office in 2011,” Gov. Susana Martinez said during a visit to Ruidoso, New Mexico in July 2015, the Ruidoso News reported. “I said there will not be any sanctuary city. Our police officers will ask where someone is from, especially if they are being arrested and put in jail for crimes, because that needs to be considered by a judge. Are you a flight risk or a danger to the community and would you return to court for proceedings to determine whether you are culpable for some offense you are accused of?” The City of Santa Fe had previously passed a sanctuary city resolution in 1999. Knowing the City is at risk of losing federal funding, it is attempting to strengthen its position. “This resolution puts us in a more defensible (legal) position than current sanctuary policies,” said retired attorney Jim Harrington. Harrington has done volunteer work for Somos un Pueblo Unido, the Albuquerque newspaper reported. Harrington told the reporter the U. S. Supreme Court has restricted how the federal government can use funding cuts to enforce policy. Under existing law, the Department of Justice (DOJ) can already move quickly to not only cut off future law enforcement grants to the city —  it can recoup past grants for any period of time the municipality was not 100 percent compliant with federal immigration law, according to U. S. Representative John Culberson ( ). Culberson spent most of 2016 working with DOJ officials to enforce 8 U. S. C. § 1373, a law that passed in 1996 to require local and state jurisdictions to cooperate with immigration officials or risk losing federal funding, Breitbart Texas previously reported. “The law requires cooperation with immigration officials 100 percent of the time,” Culberson said in an exclusive interview with Breitbart Texas in November. The DOJ Office of Inspector General certified the top 10 sanctuary jurisdictions last year and notified that they would not be eligible to apply for DOJ law enforcement grants for the coming year unless they change their policies. The current list of sanctuary jurisdictions to be defunded includes: the entire states of California and Connecticut Orleans Parish in Louisiana  New York City Philadelphia Cook County, Illinois   County, Florida Milwaukee, Wisconsin and Clark County, Nevada. The grant process begins this month. “I had to stand on their ‘air hose,’” Culberson explained referring to Congress’ power to cut a federal agencies’ funds. “For those on the   list, it is done. ” The actions of the defiant Santa Fe City Council could move New Mexico’s capital city onto that list as well. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742563356.7867205}