{"duration": 0.06178545951843262, "input_args": {"text": "'Share This A Trump supporter was arrested after polling officials spotted what he was wearing at an early voting station in Bulverde, Texas. \\nAs the election draws near, liberals are attempting to stifle any votes for Hillary Clinton’s increasingly popular opponent, Donald Trump, hoping their felonious candidate can pull off a win. However, what a Trump supporter was recently arrested for wearing shows just how desperate leftists really are to stop the conservative vote. \\nWhen Brett Mauthe woke up last Monday morning, he was eager to get his ballot in early and secure a vote for Trump while the Republican nominee’s approval rate continues to rise. The 55-year-old Texan got dressed, put on his favorite hat, and headed out the door. Unfortunately, he didn’t realize that it was his choice of clothing that would not only prohibit him from voting but also land him inside a jail cell. \\nKSAT 12 reports that Bulverde polling officials confronted Mauthe when they spotted him wearing a pro-Trump hat and a t-shirt that read “Basket of Deplorables,” a sarcastic reference to Hillary’s crude remarks about conservative voters. Apparently unaware that he wasn’t allowed to sport campaign gear inside the polling station, Mauthe removed his hat but refused to turn his shirt inside out. It was then that the officials called the police and had him arrested. \\nMauthe was placed in cuffs and charged with electioneering and loitering as local police threw the book at the confused man. Like Mauthe, voters at the same polling place were shocked that wearing such clothing is not only prohibited at the polls but can result in a misdemeanor charge . Brett Mauthe, 55, was charged with electioneering and loitering for wearing a “Basket of Deplorables” t-shirt mocking Hillary Clinton’s crude reference to conservatives. \\n“I don’t feel like you should be preaching to anybody, but I do feel like you should be able to wear a shirt if you want and if it has the candidate,” Georgina Pereida said after casting her vote Wednesday morning. “I’m kind of shocked because I think that’s part of the freedoms that we’re voting for. “ \\nWhile Mauthe is wholly responsible for not following the rules, although he may not have understood the severity of his violation, we’re betting that career politicians are keen on the election rules. Proving that the liberal elites are above the rules, Hillary herself was caught breaking the same law as Mauthe but with a very different outcome. This year, Hillary was caught campaigning in front of a North Carolina polling station and Bill was busted thanking Hillary voters over a loudspeaker within 20 feet of a Massachusetts polling station. Unlike Mauthe, neither of the Clintons were arrested. \\nMad World News reported that Hillary was captured on video campaigning in front of Raleigh’s Chavis Center, a polling place in North Carolina. The female candidate walked straight up to early voters, greeting them and snapping selfies as if she was at one of her own rallies. Of course, the scheming doesn’t end there. \\nIn March of this year, Bill was busted thanking “those of you who are supporting Hillary Clinton” with a loudspeaker while within 20 feet of a Massachusetts polling station. His massive police detail also blocked civilians from entering the precinct to vote. The Daily Kos reports that even though electioneering, which is Mauthe’s crime, is only a misdemeanor, interfering with voting rights is a felony, which is exactly what Bill did. As expected, Mauthe was arrested and charged for his crimes, but Bill was fawned over and even abetted by police officers. \\nAlthough Mauthe definitely broke the law when he refused to remove his shirt, his real crime is that he wasn’t a Hillary supporter. If he had been a liberal celebrity or the husband of a Democratic politician, he would’ve been allowed to block voters and openly campaign for his choice right there in the station. \\nThe bias is clear â\\x80\\x94 not only are the electronic polling machines switching votes for the left, influential Democrats are potentially changing views right there in the polling stations. It’s undeniable that, regardless of the results, the American people don’t stand a chance at a fair election.'"}, "time": 1742562384.549242}