{"duration": 0.1521470546722412, "input_args": {"text": "'To grab the attention of freshmen at the student club fair this month, the College Republicans of George Washington University unfurled a red banner and set out beer cozies and lime green   cups sent by the College Republican National Committee, which bills itself as “the best party on campus. ” Then came the issue of decorating. “We should put the Trump posters out,” said Demri Scott, the group’s    membership director. Christian Miller, the club’s political affairs director, disagreed. “That’s the best way to, A, get us heckled a lot and, B, get no one to sign up,” he said. The Trump posters stayed in the box. For decades, College Republicans have drawn ridicule from  —   and defined themselves against  —   the more liberal masses on college campuses. But this year has been especially nightmarish for C. R. s, as they call themselves. The nomination of Donald J. Trump, who has attacked their conservative heroes and esteemed alumni, has prompted widespread mockery from their liberal classmates, dissension from within and something of an identity crisis. While some College Republican leaders profess an appreciation for the   voters that Mr. Trump has awakened, many in the preppy Vineyard Vines set are wondering if Mr. Trump is transforming the party they hope to inherit into one in which they are unwelcome. “They tend to be   traditional Republican conservatives, and so you know there is a little bit of a mismatch there,” said Karl Rove, the architect of George W. Bush’s presidential campaigns. Mr. Rove’s career in politics started as a   national chairman of the College Republicans who won the position in 1973 over opponents supported by Roger J. Stone Jr. and Paul Manafort, both of whom went on to become advisers to Mr. Trump. “There’s a tension there,” he said. That tension, tangible on campuses across the country, threatens to change the nature of both the organization that has long trained the party’s leaders and the party they are being trained to lead. Since 1923, when Calvin Coolidge became the first former College Republican to become president, the list of the group’s alumni reads like a who’s who of the Republican establishment. Besides Mr. Rove, there is Lee Atwater, the former Republican National Committee chairman, and Grover Norquist, the president of Americans for Tax Reform. Ralph Reed, the former executive director of the Christian Coalition, was a College Republican, and so was the     Jack Abramoff. Speaker Paul D. Ryan, whose visage the George Washington chapter displayed on its table, was a member. So was Reince Priebus, the chairman of the Republican National Committee, and numerous elected Republican officials across the country. Mr. Trump was never interested. “I didn’t do that,” Mr. Trump said with a shrug when asked in an interview if he had ever considered joining the club. “I was very much into the world of real estate. ” At Mr. Trump’s alma mater, the University of Pennsylvania, Grayson Sessa, the vice president of the school’s College Republicans, said he was dismayed by the nominee’s   and hoped the party’s values could withstand him. “It’s not a great feeling,” he said. At Yale, the chapter’s endorsement of Mr. Trump led to a mutiny, with departing members forming the Yale New Republicans and Yale Undergraduate Conservatives Against Trump. And at Harvard, alma mater of countless Republican leaders, the club’s president, Declan Garvey, 21, said that between Mr. Trump and Hillary Clinton, “I would have to vote for Hillary. ” But Karis Lockhart, the chairwoman of the University of Central Florida chapter, whose parents met as College Republicans, said that those who could not bring themselves to vote for Mr. Trump were being overly sensitive. She argued that Mr. Trump would bring in new voters who would help in other races on the ballot. “He’s dumbing it down for people who don’t want the numbers and statistics,” she said approvingly. Mr. Trump’s nomination prompted the Central Florida’s chapter to post a letter on Facebook urging students “to not get discouraged” by Mr. Trump. Some did, and left the club. “My job is to bring everybody back on board to the Republican Party, whether or not they love Trump,” said Cade Marsh, the College Republicans’ state chairman in Florida, who wears “Hillary for Prison” shirts and wants to run for president in 2032. (His email handle is Cade2032POTUS, using the acronym for president of the United States.) Today, the College Republican National Committee claims to have around 250, 000 students in nearly 1, 800 chapters. It is a nonprofit political action committee with   power and shares its research on millennial voters with the Trump campaign, specifically the findings of its survey “Growing Up G. O. P. ,” the cover of which features hands cradling a plant sprout. “If you become a College Republican in college, then you are Republican for the rest of your life,” said Mr. Norquist, the former member. “Nobody learns anything about politics after they are 21. ” The task of reconciling Mr. Trump’s ascent with the bewilderment of conservative students falls to Alex Smith, the current national chairwoman of the College Republicans. She works in an office on K Street in Washington that is decorated with framed “Rove” and “Youth for Nixon” pins, a blues album featuring Mr. Atwater and letters from Mr. Rove. Ms. Smith, 27, is telegenic and   ready, the very picture of   message discipline. In an interview, she repeatedly tried to veer the conversation to Mrs. Clinton, whom she calls the first college Republican to win the Democratic nomination. (Mrs. Clinton was a   Goldwater Girl, a supporter of Senator Barry Goldwater of Arizona, who was the Republican presidential nominee in 1964.) Ms. Smith said that Mr. Trump’s preference for Twitter and Instagram suited her members. “In a lot of ways, he speaks like a person of my generation,” she said, adding, “He brings more people in. ” But was it not strange to work for the election of a candidate who had ripped her heroes to shreds, who disagreed on core Republican values? Ms. Smith looked at the tape recorder on her desk. “You could turn it off?” she asked. The George Washington chapter had its own struggles in absorbing the rise of Mr. Trump. When it released a statement in June congratulating him on winning the nomination, it drew backlash from its   members and from the College Democrats with whom they share an office on campus. “It was a really bad summer,” said Ms. Scott, the membership director. Allison Coukos, the chapter’s communications director, who, like Ms. Scott, is undecided on whether to vote for Mr. Trump, said, “They were like, ‘How can you support someone who is a racist, who hates women, who is a bigot?’ ” In an attempt at damage control, the group published a letter on Facebook clarifying that it had not endorsed Mr. Trump. Ms. Scott said the Trump fans in the club responded by calling them “pathetic” and mocked them for creating a “safe space. ” At the club fair this month at George Washington, many of the dozens of   freshman who stopped by the College Republicans table expressed relief when Ms. Scott explained that the group had, in fact, not supported Mr. Trump. But Tom Crean, a freshman who joined the club, wished they had. “It is their job to promote whoever is at the top of the ticket,” Mr. Crean, 18, said. “It’s undercutting the party. I would change it by being a   person in the organization. By being an apologist. ”'"}, "time": 1742561928.5202684}