{"duration": 0.06157803535461426, "input_args": {"text": "'Elections 2016 \\nTop democrats have repeatedly waved off substantial questions arising from their hacked emails by falsely implying that some of them are forgeries created by Russian hackers. \\nThe problem with that is that no one has found a single case of anything forged among the information released from hacks of either Clinton campaign or Democratic Party officials. \\n\\nClinton strategist Joel Benenson, asked about an email in which Clinton campaign staffers decide to accept foreign lobbyist money, used that line on MSNBC on Sunday. \\n“These emails, we have no idea whether they’re authentic or not,” he said. “Or whether they’ve been tampered with. I know I’ve seen things that aren’t authentic, that we know aren’t authentic, and it’s not surprising.” \\nJennifer Granholm, a senior adviser to the pro-Clinton Super PAC Correct the Record, was asked by CNN’s Jake Tapper whether the Clinton campaign should be responding to revelations revealed by Wikileaks. \\n“There are reports that these have been doctored,” she told Tapper on October 19. “And Newsweek had found that, in fact, that was happening.” \\nIn an interview with CNN’s Wolf Blitzer on October 18, Rep. Adam Schiff, D-Calif., a ranking member on the House Intelligence Committee, was asked if the Russian government would impact the election by hacking voting systems. \\n“What worries me the most … is between now and the election the Russians dump information that is fabricated,” Schiff warned. “To get a last minute dump of emails that contain fabricated emails that are widely reported in the press, and there isn’t enough time to fact check and demonstrate the forgery, that is what really concerns me.” \\nCNN host Wolf Blitzer pushed back, “But have you confirmed that any of these emails released over the past two weeks, if you will, by Wikileaks are fabricated or doctored?” \\n“You know I’m not in a position to be able to do that,” Schiff demurred. \\nEverything considered, the conclusion has to be that Wikileaks emails are probably authentic and if they weren’t they would have been disproven a long, long time ago. The question is if are you willing to vote for a person that (we saw in the emails) is capable of doing very, bad, dirty stuff. And if the answer is yes then this country has a BIG, BIG PROBLEM. If Clinton Campaign Believes WikiLeaks Emails Are Forged, Why Don’t They Prove It!? Share this: '"}, "time": 1742564464.6244884}