{"duration": 0.12349319458007812, "input_args": {"text": "'Breitbart News National Security Editor Dr. Sebastian Gorka, author of the   book Defeating Jihad: The Winnable War, was tasked by SiriusXM host Raheem Kassam on Tuesday’s Breitbart News Daily with choosing the “worst thing Obama is leaving this country, in terms of foreign policy. ”[“Oh, that’s easy,” Gorka replied. “It’s the empowering to nuclear threshold status of a nation that his own State Department says is a state sponsor of terrorism. The Iran nuclear deal is  —   of all the many, many catastrophic legacies, it’s the Iran deal. ”  He judged that the empowerment of Iran was a worse Obama legacy than the rise of the Islamic State because “we can wipe ISIS off the face of the earth, if we’re serious, and if we really go to war. ” “I mean, think about it: they’ve got maybe, at best, at this point, 40, 000 fighters. We have twice that number of special operators alone in the United States,” he noted. “If we’re serious, we can destroy them, and then follow that up with a   campaign. But dealing with an eschatologically informed theocratic republic that now has a crescent of influence from Yemen to Persia, which is on the cusp of nuclear capability, that’s even more dangerous. ” Gorka suggested a dissertation could be written on how the realignment of power in the Middle East became a “secret war,” largely unreported by U. S. media, because President Obama wanted to change American posture towards Iran and other regional powers. “Obama has a legacy for using more drones to kill people in the first six months of his administration than Bush ever did,” he said. “If you look at the fact that on one day, he has bombed six different nations  —   but nobody’s reporting about it. During the Bush administration, we had embedded journalists. You remember embed phenomena? That doesn’t exist any more. This is the complicity of the mainstream media, that they preach peace, they preach Nobel Prizes, but this is a truly   administration when it comes to doing what they think is right around the world for ideological reasons. But nobody writes about it, except Breitbart. ” Gorka agreed with author Dinesh D’Souza’s contention that Obama was “the first   President. ” “His guiding philosophy was very simple: America is bad. If there are problems in the world, from global warming to    we are the cause. America is the new imperial force. As a result, we have to be taken down a peg or two  —   and my, did he take us down a peg or two,” he said. Gorka had no patience for Obama’s claim of a “ ” presidency. “Where to begin? Benghazi, the IRS, the Iran deal, the involvement of drone strikes against U. S. citizens without due process  —   on and on and on,” he said. “That is perhaps the most   lie of any of the press reporting in the last eight years, that this was a   administration. ” Kassam asked for Gorka’s take on how the Trump transition team is handling the Russian hacking story, in particular the assertion in the intelligence community’s public report that Russian President Vladimir Putin directly ordered an effort to influence the 2016 election via media manipulation. “I can’t talk to the transition, but if you listen to the statements that are being made, I think you’ll understand that the transition team understands better than most: this isn’t about ‘hacking.’ It’s hard to hack somebody whose password is ‘password,’” Gorka replied, making a jab at the notoriously lax security procedures of Hillary Clinton campaign chief John Podesta. “This is about influence operations and information warfare,” he continued. “The issue is that Russia, for very little investment, managed to question the probity of our elections, without there really being anything that’s occurred to the elections themselves. That’s the big story. This is old, Cold   information operations at their worst. ” He said links to Russia could be seen in the penetration of the Democratic National Committee and Podesta’s email.  “If you look at the code that was used, if you look at the various modus operandi, the report from DHS, FBI, the unclassified one is clear. But the important point is, it’s not a ‘hack.’ The election wasn’t undermined. It is the perception of the probity of the election, and that’s called active measures. That’s called dezinformatsiya,” Gorka said. Kassam noted the IC report has been criticized for offering   conclusions about Russian involvement without providing any supporting information, much of which would still be classified  —   the very same criticism that was leveled retroactively, for years, with   passion, against the intelligence reports on   Iraq. “Why are we just sort of accepting this now?” he asked. “Look, the thing that has to be remembered  —   and this is the point I always try to make on any interviews  —   is that we have patriots and good people working inside the national security establishment,” Gorka responded. “For the majority of cases, that is absolutely true. But who runs them? Who is John Brennan? Who is General Clapper? These individuals are politically chosen. John Brennan has carried the water for Obama for eight years. That is important, and as a result, we have to reassess when one agency says something that the other agencies do not agree with. That’s the bottom line, Raheem. ” Kassam recalled that the last time unanimity was supposedly reached between the intelligence agencies, “it was Colin Powell sitting there claiming that everybody believed we had to go to war in Iraq. How’d that work out for us?” “Yes indeed  —   another political actor who I’m sure regrets waving a test tube at the United Nations Security Council. Indeed, the ‘ ’ dossier, Colin Powell’s behavior  —   these are all things we must remember,” Gorka urged. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563421.7182155}