{"duration": 0.04500436782836914, "input_args": {"text": "'BREAKING : Hillary Sent “MARKED CLASSIFIED” Info to Nonsecure Huma Abedin Account BREAKING : Hillary Sent “MARKED CLASSIFIED” Info to Nonsecure Huma Abedin Account Breaking News By TruthFeedNews October 29, 2016 \\nNEW YORK – WND’s reporting in late August of a marked classified email Hillary Clinton forwarded to aide Huma Abedin could cast light on FBI Director James Comey’s dramatic disclosure to members of Congress Friday that the bureau had reopened its investigation into Hillary Clinton’s use of a private email server due to new information apparently discovered in the sexting probe of former Rep. Anthony Weiner, Abedin’s estranged husband. \\nComey, however, said in his letter to Congress that he was only ‘briefed yesterday,’ meaning WND readers knew of the potential security breach two months before the director did. \\nAs WND reported Sept. 8 , Clinton forwarded an Aug. 8, 2009, email – clearly marked “Classified” – to a personal, nonsecure email address registered to aide Abedin, huma@clintonemail.com. Abedin then forwarded the message to another personal, nonsecure account, humamabedin@yahoo.com. \\nIn sworn testimony before Congress, however, Clinton declared, “There was nothing marked classified on my emails, either sent or received.” \\nThe 2009 email, sent to Clinton from longtime adviser Sidney Blumenthal, was discovered in a cache of emails obtained by Judicial Watch through a Freedom of Information Act lawsuit. The exchange concerned the “disastrous nature” of an Obama trip to Germany, charging the U.S. was “totally out of the loop in Berlin – no ambassador,” resulting in the expectation that “Germans and Russians will now cut their own separate deals on energy, regional security, etc.” \\nWND also reported two-thirds of Abedin’s released emails were forwarded to personal addresses she controlled and Clinton’s State Department chief of staff, Cheryl Mills, may have received classified information through personal email accounts . \\nIn WND’s report of the marked classified email, Greg Davis, a U.S. Army veteran with more than 30 years experience as a military intelligence officer, told WND the handling of the message is “an obvious violation of national security regulations regarding the handling of classified information for which people normally go to prison.” \\nDavis, the creator of the intelligence-oriented website SpookdBlog.com, said that typically the Justice Department would grant Abedin immunity from prosecution in return for her willingness to turn state’s evidence against Clinton. \\n“If Huma refused to cooperate, the Department of Justice could threaten to seek a maximum prison term for her should their effort to bring a criminal prosecution against her succeed,” he said at the time. \\nThe email containing marked classified information previously was released by the State Department, but it was unknown until the Judicial Watch released that Clinton forwarded the exchange to Abedin’s nonsecure, personal Yahoo account. \\nSee the classified email: \\nH/T – WND \\nSupport the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742561956.569011}