{"duration": 0.029632091522216797, "input_args": {"text": "'SJWs in Canada Trying to Get a Prof Fired for Saying Black People are Oppressed \\nZeiger October 28, 2016 Literally Hitler. Go back to Bulgaria! \\nHow dare this White man talk about the Blacks’ oppression? Doesn’t he know that this could trigger his sensitive students? \\nSounds like bigotry to me. \\nBetter start a petition to get this racist fired. Just to be on the safe side. \\nGlobal News : \\nMontrealâ\\x80\\x99s Concordia University has confirmed a professor has been â\\x80\\x9cremoved temporarilyâ\\x80\\x9d as officials â\\x80\\x9cassess the situationâ\\x80\\x9d after someone allegedly made racist comments during a classroom lecture. \\nGlobal News spoke to two students who were in the classroom when the allegedly racist comments were made. They asked not to be identified because they fear reprisals from the university. \\nYeah, I’m sure the university would enact reprisals against students for being anti-racists. They’re well known to be Nazi sympathizers, after all. A rare picture of the Concordia University board of directors. \\nIn an online post, a student at the John Molson School of Business (JMSB) described what allegedly happened on Oct. 21. \\nAccording to the post on the private John Molson School of Business Facebook page, part-time lecturer Roumen Solov said during a class that after the Second World War, Jewish people came to New York City and â\\x80\\x9cgot high education, but black people are not educated.â\\x80\\x9d \\nConcordia University is investigating the matter. Uneducated? smdh. \\nâ\\x80\\x9cWeâ\\x80\\x99ve interviewed the students and the professor and he has been removed temporarily while we assess the situation,â\\x80\\x9d ClĂŠa Desjardins, a spokesperson for the university told Global News. \\nSolov also allegedly singled out the only black student in the room. \\nShe told Global News she challenged Solov after his comments and said it sounded like he was saying black people were lazy and not interested in education. \\nAccording to her, Solov then tried to clarify by saying slavery prevented black people from getting access to education. \\nIn other words, he said Blacks were oppressed by Whites because of slavery, and thus didn’t have access to higher education. Sounds pretty much like standard SJW rhetoric to me, no? \\nSome students have started a petition to have Solov fired. \\nSeveral hundred have signed so far. \\nA spokesperson for the university said the issue should be resolved within the week. \\nThe endgame of the SJW movement is to enact public lynchings of every White man who even tries to address racial issues without immediately bending over backwards to apologize for being an evil oppressor of poor defenseless minorities. \\nSo yeah, they’re trying to get him fired. No surprise there. \\nSome students have started a counter petition, on the other hand, to get this man a promotion.'"}, "time": 1742628432.5538495}