{"duration": 0.1139216423034668, "input_args": {"text": "' Good morning. (Want to get California Today by email? Here’s the  .) Let’s turn it over to Jennifer Medina, a correspondent based in Los Angeles, for today’s introduction. Often referred to as the Ellis Island of Los Angeles, the neighborhood east of downtown known as Boyle Heights has been the first stop for several waves of immigration. Since the 1940s, it has transformed into a largely   enclave and the center of Chicano culture and activism in the city. As other parts of Los Angeles have seen real estate prices climb steadily, many in Boyle Heights have expressed concern about gentrification, particularly after several art galleries moved into an industrial stretch. The battle between the galleries and activists reached a peak last fall when someone   a vulgar statement condemning “white art” on the door of one gallery and a   investigation was opened. Almost from the moment it opened its doors last year Pssst, a nonprofit gallery, and its creators, have been the focus of protests and criticism on social media. Last month, they announced they could no longer tolerate it. They were closing up shop. “This persistent targeting, which was often highly personal in nature, was made all the more intolerable because the artists we engaged are queer, women,   people of color,” they said on their website. “We could no longer continue to put already vulnerable communities at further risk. ” Defend Boyle Heights, one of the activist groups that has called for a boycott of the galleries, said that it considered the closing a victory and that it hoped other galleries would soon follow suit. The response has raised alarms for many of the other galleries in the area. Ethan Swan, one of the directors of 356 Mission, which has been there since 2013, said that he had tried to arrange a meeting with local activists, but that he had been repeatedly turned down. “We want to be thoughtful about our presence and what it was that we could do or how we could work together for a better future for this neighborhood and how it might shift,” he said. “But their position is an uncompromising one since they don’t see a solution unless we leave. ” Do you think the galleries should stay in Boyle Heights or leave? Let us know your thoughts at caltoday@nytimes. com. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Insurance premiums would rise significantly for many Californians under the Republican health plan. [Los Angeles Times] • Democrats unveiled a sweeping plan to make college free for more Californians. They  . [Opinion | Sacramento Bee] • The Queen Mary, a historic vessel in Long Beach, needs more than $230 million in repairs to keep it from sinking. [Long Beach Press Telegram] • The dream of   rail is taking longer and costing more. [Orange County Register] • Daredevils are walking on slacklines high above a waterfall near Lake Elsinore. Forest officials aren’t happy. [The Press Enterprise] • A proposed California license plate design features a redwood forest. [The Mercury News] •  : Through music and relationships, a California man with Asperger’s syndrome finds another way to be “normal. ” [The New York Times] • “It has harmed me professionally,” said a screenwriter about his support for President Trump. [Los Angeles Times] • The artist Jimmie Durham has his first American solo show in 22 years, at a Los Angeles museum. He gave a rare interview. [The New York Times] • A new podcast investigates why Richard Simmons left public life. Is it any of our business? [The New York Times] • Drinking your way  —   responsibly and on a budget  —   through San Diego. [The New York Times] • The odds of U. C. Davis winning the N. C. A. A. men’s basketball tournament are    against. “This is a moment of hope,” a campus official said. [San Francisco Chronicle] On Monday, we wrote about an effort to end daylight saving time in California. We asked where you came down on the matter. Among hundreds of responses, an overwhelming majority made the same plea: stop the twice yearly clock changing. Readers called for the adoption of an unchanging time throughout the year, outnumbering those who favored the status quo by roughly eight to one. Most of those favoring an immutable time said they would prefer to simply stay on daylight saving time, dispensing with the “fall back” of November. Dave Spaulding, of Sausalito, echoed a theme: “Love that extra hour of sunshine. ” The     crowd expressed worries of falling out of sync with the rest of the country. Others complained that our politicians should be focused on bigger issues. A sample of the responses: “I really don’t care which one we use. But use it consistently. I dislike the change. One or the other, not both. ”  —   Carolyn Dennison, Garden Grove “I’m totally for permanent daylight saving time. I think people feel more energized and happy with the extra hour of sunshine. ”  —   Toni Bouman, San Luis Obispo “I very much favor eliminating the   time change. It is confusing and physically stressful. I dread it every time. Personally I would favor Pacific Standard Time year round. ”  —   Leslie Clarke Gray, Cambria “I feel daylight savings is an arbitrary practice of torture we impose upon ourselves. Ditch it and save the headache. ”  —   Cory Windorff, Irvine “Ideally the whole country would adopt a uniform time plan, either daylight saving time or standard. Maybe if California gets the ball rolling, other states would follow. Meanwhile, the shift back and forth is a useless and disruptive annoyance. ”  —   Linda Lancione, Berkeley California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U. C. Berkeley.'"}, "time": 1742564154.53619}