{"duration": 0.04772305488586426, "input_args": {"text": "'By Jason Easley   5:35 pm A Democratic super PAC is injecting millions of dollars into the Florida Senate race in a bid to retire Sen. Marco Rubio.   \\nA Democratic super PAC is injecting millions of dollars into the Florida Senate race in a bid to retire Sen. Marco Rubio. \\nCNN reported that Harry Reid’s super PAC, the Senate Majority PAC, is injecting millions of dollars into the Florida Senate race to help Rep. Patrick Murphy in his bid to defeat Marco Rubio: “This race is closing,” spokesman Shripal Shah told CNN. “Voters know that Marco Rubio is only looking out for himself and they’re going to hold him accountable for pushing a self-serving agenda at their expense.” \\n“This afternoon Senate Majority PAC made a seven-figure transfer to Floridians for a Strong Middle Class, a Florida based Super PAC supporting Patrick Murphy’s campaign. The move comes hours after Senate Majority PAC announced a record fundraising haul — $19.3 million — covering the pre-general reporting period (October 1st thru 19th) that will be filed with the FEC today.” \\nDemocrats have been divided over the strategy for handling the Florida race. Sen. Chuck Schumer canceled future spending in Florida to direct resources into Senate races in North Carolina, Indiana, and Missouri. Reid sees an opportunity to knock out Rubio and eliminate him from presidential contention in 2020. \\nThe retiring Senate Democratic leader has been loudly urging Democrats to spend big in Florida to end Rubio’s national political career. \\nAccording to Harry Enten at FiveThirtyEight , the polling suggests that pulling out of Florida is probably the right move for Democrats, but with cash to burn and a shot to beat Rubio, there is a case to be made for more spending. \\nDemocrats on the ground wanted in Florida wanted more spending on the Senate race, and they’ve gotten their wish thanks to Sen. Harry Reid.'"}, "time": 1742562835.7952456}