{"duration": 0.044486045837402344, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / On Being Aloof and Democratic Essential Reading They Live By wmw_admin on August 19, 2012 \\nConsidered by some as prophetic, many will find eerie echoes of present day concerns in John Carpenters 24-year-old ‘They Live’. View the cult classic here The Essene Gospel of Peace II By wmw_admin on April 26, 2007 \\nTranslated by Purcell Weaver and Edmond Szekely from its original Aramiac, a language that today few know but 2000 years ago was the language that Christ spoke and taught with Bloody Bill Clinton – American Caligula By wmw_admin on September 1, 2006 \\nThe real legacy of Clinton’s term of office: the chilling body count of those connected with him, who died in unusual or suspicious circumstances Hellstorm – Exposing The Real Genocide of Nazi Germany (Full Documentary) By wmw_admin on May 10, 2015 \\nWhat happened in the aftermath of World War II has been one of the darkest and best kept secrets in world history. Greg Palast is Related to Mossad Chief David Kimche By Christopher Bollyn on October 23, 2013 \\nGreg Palast may well be a Mossad disinfo agent. Christopher Bollyn provides the hard documentary evidence to prove it runs in his family The Life of an American Jew in Racist Marxist Israel Part II By wmw_admin on October 27, 2006 \\nWritten nearly twenty years ago, Jack Bernstein’s words now have a prophetic ring which he paid for with his life Who Really Murdered Holly Wells and Jessica Chapman? By wmw_admin on February 28, 2015 \\nRevelations that a US soldier was the killer would have jeopardised public support for the “War on Terror”. Hence a frame-up was required. A Joe Vialls classic recovered. 9/11 and Zion: What Was Israel’s Role? By Nick Kollerstrom on August 31, 2012 \\nWhen Netanyahu said the very next day, ‘This is very good for Israel”, he wasn’t just blurting out something indiscreet, he was publicly congratulating the various agents who had worked so hard\""}, "time": 1742562344.9333353}