{"duration": 0.040547847747802734, "input_args": {"text": "'President Donald Trump defied media coverage of his presidency, vowing to keep fighting for the people who elected him president.  “Look at the way I’ve been treated lately especially by the media,” Trump said. “No politician in history, and I say this with great surety, has been treated worse or more unfairly. ” The president made his remarks during his commencement address at the Coast Guard Academy in Connecticut, offering his advice to the graduates. “You will find that thing happen to you that you do not deserve and that are not always warranted, but you have to put your head down and fight, fight, fight. ” Trump said. “Never ever, ever give up. Things will work out just fine. ” Trump’s remarks are the first public remarks since leaked Comey memos accused Trump of trying to shut down an investigation into his investigation into his former National Security Advisor Michael Flynn. The president encouraged cadets to fight hard for what they believed in. “You can’t let them get you down,” he said. “You can’t let the critics and the naysayers get in the way of your dreams. ” Trump’s remarks drew cheers and applause from the crowd, as he explained that he would continue to fight, pointing out that he won the election by doing just that. “The more righteous your fight, the more opposition you will face,” he said. Trump boasted that he had already brought back jobs back into the country, appointed a new Supreme Court Justice and invested heavily into the military. He also spoke about his efforts to reduce job killing regulations and his success slowing illegal border crossings. “I didn’t get elected to serve the Washington media or special interests,” he said. “I got elected to serve the forgotten men and women of our country, and that’s what I’m doing. ”  '"}, "time": 1742564300.9843645}