{"duration": 0.029874086380004883, "input_args": {"text": "'TORONTO (AP)  —   Canadian social worker Christine Archibald is being remembered as a “bright light” for her profession as those who loved her launch an online campaign of compassionate acts after she was struck by a van of terrorists on London Bridge and died in her fiance’s arms. [The    from Calgary, Alberta, had recently moved to the Netherlands to be with her fiance Tyler Ferguson, his sister Cassie Ferguson Rowe said. The couple was engaged three months ago.  Ferguson had been walking a few steps ahead of his fiancee on the bridge, and then held her as she died, said Ferguson Rowe. “My baby brother lost the love of his life on the London bridge. In a split second, his entire life was ripped away from him,” Ferguson Rowe said. Born and raised in Castlegar, British Columbia, Archibald had later lived in Calgary, where she worked at a homeless shelter before moving to Europe to be with Ferguson. Her family in Castlegar said in a statement that Archibald “would have had no understanding of the callous cruelty that caused her death. ” “She had room in her heart for everyone and believed strongly that every person was to be valued and respected,” the family statement said. Kathy Christiansen, executive director of Alpha House in Calgary, said Archibald had worked at the shelter for homeless people addicted to drugs and alcohol until recently. She called Archibald a talented social worker and exceptional human being who inspired all who worked with her. “Chrissy was a bright light,” she said. Before that, Archibald was an   social work student from Calgary’s Mount Royal University. Peter Choate, an assistant professor of social work, said his former student “fit the profession. ” “She was very caring but at the same time very professional. She understood that she wasn’t in charge of the lives of her clients. She was able to offer her clients opportunities to do things with their lives,” Choate said. “She got it. The family should be very proud of the young woman, the social worker that she was. As a profession for us it is a loss. ” The Archibald family asked that people honor her memory by making the community a better place. “Volunteer your time and labor or donate to a homeless shelter,” the statement said. “Tell them Chrissy sent you. ” The hashtag #Chrissysentme was being used on Twitter to express sadness for the family’s loss. Inspired by the call for meaningful action, some people pledged to make donations to shelters, soup kitchens and other community groups. Ferguson Rowe said she hoped the use of the hashtag would “urge people to not let her death be in vain, to do good in their community. ” “It’s what she would have wanted,” Ferguson Rowe said.'"}, "time": 1742628560.166235}