{"duration": 0.05908346176147461, "input_args": {"text": "'Neal Katyal made oral arguments for maintaining the injunction against President Donald Trump’s executive order banning migrants from certain   countries Monday before the Court of Appeals for the Ninth Circuit. [“He could say, like President Bush did right after September 11th, ‘The face of Terror is not the true face of Islam, that’s not what Islam is about, Islam is Peace.’ Instead, we get ‘Islam hates us’,” Katyal told the bench, answering   Judge Richard Paez’s question on what, if anything, Trump could do to make the executive order acceptable.  Katyal, former President Barack Obama’s   acting Solicitor General, has taken on the representation of the plaintiffs who stopped the executive order’s implementation in March when a federal court in Hawaii ruled in their favor. The Justice Department has appealed the case to the Ninth Circuit, seeking to vacate that injunction. The most controversial element of   district court Judge Derrick Watson’s ruling was its justification of the injunction based not on the text or effect of the executive order, but on statements President Trump made during the 2016 campaign. According to that ruling, speaking about a “Muslim ban” and speaking negatively about the religion’s relationship with the West mean that the plaintiffs had a high enough likelihood of proving a violation of the First Amendment’s Establishment Clause to block the order. This is true even though the actual order does not take any action based on people being Muslim because, “[A] reasonable, objective observer —  enlightened by the specific historical context, contemporaneous public statements, and specific sequence of events leading to its issuance —  would conclude that the Executive Order was issued with a purpose to disfavor a particular religion[. ]” Katyal doubled down on this line of argument Monday, contending, as the district court had, that no reasonable objective observer could not see that the purpose of the order was to disfavor Muslims. As evidence, he rattled off an extensive list of amicus briefs submitted in favor of striking down Trump’s order. Mentioned were the usual bevy of     and liberal religious groups. “Even the Cato Institute,” Katyal finished, referring to the libertarian think tank with a long history of supporting weak immigration laws. The argumentation led naturally to the question of what, if anything, could be done to save such a facially neutral order. “Does that mean that the President is forever barred from issuing an executive order along these lines?” Judge Paez asked Katyal. “What does he have to do to issue an executive order that, in your view, might pass constitutional muster?” Trump might gain more power to issue executive order if he “disavows,” Katyal argued. “One example would be what Judge Hawkins said about disavowing formally the stuff before. ” “But that’s not it, he could do a lot of things,” Katyal continued. “I’m just going to throw out some examples, I’m not trying to micromanage the president. ” In addition to suggesting Trump could save his order by telling the country “Islam is peace,” Katyal also recommended removing references, in the text of the order, to the unsavory elements of Islamic society. “It could eliminate the text which refers to honor killings,” he told the court. Katyal, in his work at the Justice Department during the Obama administration, frequentally defended presidential power to govern by executive order. He appeared to recognize the unusual nature of this suit challenging a president’s authority on religious grounds. “Our fundamental point to you is that Presidents generally don’t run into establishment clause problems. This is a very unusual case in which you have these public statements by the President,” he said.'"}, "time": 1742563263.5302753}