{"duration": 0.04810976982116699, "input_args": {"text": "'SYDNEY  —   A terrorist plot to attack the Australian city of Melbourne with explosives, knives and guns  —   possibly on Christmas Day  —   is believed to have been headed off with the arrest of five people, Prime Minister Malcolm Turnbull said on Friday. Mr. Turnbull told reporters in Sydney the group was “ ” and inspired by the Islamic State. Five men, ages 21 to 26, were to be formally charged later Friday, the authorities said. Another man and a woman were also taken into custody, but were later released. According to the police, the plotters had scouted Federation Square, a popular shopping and entertainment district, as well as the Flinders Street train station, Melbourne’s busiest, and St. Paul’s Cathedral, an Anglican church. All three locations are close to one another in the center of the city. The country’s justice minister, Michael Keenan, said the planned attack was imminent and “would have been the most serious in terms of its intent” in Australia. Had it occurred, he added, it would have “caused very significant casualties. ” Andrew Colvin, the commissioner of Australia’s Federal Police, said the arrests had been carried out in overnight raids involving about 400 officers in Melbourne’s northern and western suburbs. “This is a significant disruption of what we would call an imminent terrorist event,” Mr. Colvin said at a news conference in Sydney, held with Mr. Keenan and Mr. Turnbull. “They had moved very quickly from an intention to a capability, a developed capability, including quite progressed plans, we will allege,” Mr. Colvin said. The premier of Victoria State, Daniel Andrews, said in Melbourne: “What was being planned were not acts of faith, they were, in their planning, acts of evil. ” Graham Ashton, the chief commissioner of the Victoria police, said: “The attack we will allege was being planned was going to involve the use of explosives and we have gathered evidence to support that, and the intention to use other weapons, that could include knives and or a firearm. ” Of the five to be charged, four were born in Australia, and one was born in Egypt. “We believe they were ” Mr. Turnbull said. “They’ve been inspired by Daesh or ISIL, that’s our intelligence at the present time,” he added, using alternate names for the Islamic State. The police have disrupted a number of terrorist plots in Australia, and Mr. Turnbull said that, since September 2014, 57 people have been charged as a result of 25 counterterrorism operations. But he added there had been four attacks in the country since then. In an episode that attracted international attention, two people were killed when a gunman took hostages at a cafe in Sydney in December 2014. The gunman was killed when the police stormed the building. Mr. Colvin said the state and federal police, as well as the Australian Security Intelligence Organization, had been monitoring the Melbourne suspects. “We believe that they were narrowing down exactly what their plan was, but that’s all in one very small part” of Melbourne’s central business district, he said. The police, he said, were confident there was no longer a threat to public safety. A series of tough counterterrorism measures were enacted by Parliament this year, including legislation that could keep convicted terrorists in prison after the completion of their sentences, and   control orders to monitor children as young as 14 if they were thought to be involved in, or planning, a terrorist act. Mr. Turnbull on Friday urged Australians to defy terrorists by simply going about their lives. “We are the most successful multicultural society in the world,” Mr. Turnbull said. “That’s because we have a culture of mutual respect. ”'"}, "time": 1742561723.4678705}