{"duration": 0.07312798500061035, "input_args": {"text": "'WASHINGTON  —   President Obama designated two new national monuments on Wednesday, protecting 1. 35 million acres of federal land surrounding the Bears Ears Buttes in southeastern Utah and about 300, 000 acres around Gold Butte in Nevada, northeast of Las Vegas. The monuments are Mr. Obama’s latest effort to protect public lands and waters from development and to nail down as much of his environmental legacy as he can before Donald J. Trump assumes the presidency on Jan. 20. But some local residents and elected Republicans have opposed the Obama administration’s extensive efforts to protect Western landscapes, calling them federal land grabs, and Utah officials voiced vehement opposition on Wednesday. The family of a Nevada rancher, Cliven Bundy, helped take over a national wildlife refuge this year in protest against such federal actions. The new desert monuments, designated under the executive authority of the 1906 Antiquities Act, encompass Native American sites of sacred and archaeological importance, as well as wildlife habitats and hiking and hunting terrain. Efforts to place the Bears Ears Buttes under federal protection have been underway since 1936, when President Franklin D. Roosevelt’s interior secretary, Harold L. Ickes, proposed the monument designation. Native American tribes began promoting legislation to protect Gold Butte in 2008. “Today’s actions will help protect this cultural legacy and will ensure that future generations are able to enjoy and appreciate these scenic and historic landscapes,” Mr. Obama said in a statement. In Utah, the Bears Ears designation was roundly opposed by statewide elected officials and the congressional delegation. “President Obama’s unilateral decision to invoke the Antiquities Act in Utah politicizes a   conflict,” said Representative Jason Chaffetz, Republican of Utah. “The midnight move is a slap in the face to the people of Utah, attempting to silence the voices of those who will bear the heavy burden it imposes. ” Representative Rob Bishop, Republican of Utah and chairman of the House Natural Resources Committee, which has authority over public lands issues, promised to work to repeal the designation. Mr. Obama has designated about 553 million acres as national monuments, more than any of his predecessors. While Mr. Trump has vowed to undo Mr. Obama’s environmental agenda, White House officials said they did not believe he would have the authority to reverse the designations. No president has undone a predecessor’s designations in the law’s   history. “The Antiquities Act gives the authority to create monuments and does not give explicit authority to undo them,” said Christy Goldfuss, the managing director of the White House Council on Environmental Quality. However, after Mr. Obama this month used an obscure provision of a 1953 law to place about 115 million acres in the Arctic Ocean and about 3. 8 million acres of the Atlantic Ocean permanently   to drilling, opponents, including oil companies, said they intended to file a legal challenge. Native American groups and environmentalists hailed Mr. Obama’s moves Wednesday in Nevada and Utah. Mr. Obama’s designation of Bears Ears as a national monument will create a     tribal commission of representatives from the five Native American tribes that live in the region. The commission will advise the monument’s federal managers. “This is an exciting day for Navajo Nation,” Russell Begaye, the tribe’s president, said in a phone call with reporters. “We have always looked to Bears Ears as a place of refuge, as a place where we can gather herbs and plants and as a place of sacredness,” he said. “It is a place of safety and fortitude. It is a place where our ancestors hid and survived from U. S. cavalry during the Long War. ”'"}, "time": 1742564174.5007668}