{"duration": 1.3825390338897705, "input_args": {"text": "\"défense , Opération russe en Syrie , armée Des exercices militaires conjoints entre la Russie et l'Inde. Crédit : Yuri Smityuk / TASS \\nLes hélicoptères de combat russes Ka-52K utiliseront pour la première fois les missiles antichars guidés (MAC) Hermes en Syrie dans la lutte contre l'organisation terroriste Daech, informe le quotidien Izvestia . \\n« Les essais sur le terrain permettront de finaliser le complexe de missiles qui fera ensuite partie de l’arsenal permanent des hélicoptères de combat russes Alligator. Il a été décidé de tester Hermes dans des conditions plus difficiles à bord d’un navire » , écrit le quotidien citant sa source au sein du complexe militaro-industriel russe. Qu’est-ce qu’Hermes et à quoi sert-il Buk-M3 et Kalibr : de nouvelles armes pour l’armée russe Selon les informations d’ Izvestia , la nouvelle arme permettra aux hélicoptères Ka-52K de détruite les chars ennemis, les fortifications et les cibles vivantes à une distance de 30 kilomètres. Pour le moment, la portée des modèles équivalents utilisés par les systèmes russes et étrangers (Ataka, Vikhr, Hellfire, etc.) est inférieure à dix kilomètres. \\nLe colonel à la retraite et expert militaire chez TASS Victor Litovkine explique qu’Hermes sera utilisé contre les sites bien protégés des islamistes – les usines d’armement et les engins explosifs improvisés, ainsi que contre les postes de commandement et les installations de tir temporaires. « L’utilisation sur le terrain permettra de décider si le complexe doit être amélioré ou s’il peut être adopté en l’état » , précise l’expert. Les particularités d’Hermes \\nLes experts interrogés par RBTH soulignent que la particularité principale du missile est la possibilité d’un usage « horizontal » . La tête autoguidée combinée au capteur infrarouge et au canal laser permet au missile d’atteindre les véhicules blindés de l’ennemi, même s’ils se trouvent hors du champ de vision de l’équipage de l’hélicoptère. Lire aussi : Les forces navales russes auront une base permanente en Syrie \\n« Le complexe israélien Spike-NLOS, monté sur un châssis à roues, peut accomplir des missions techniques similaires. Mais le complexe russe peut être utilisé tant sur des véhicules terrestres à chenilles que sur les hélicoptères et les navires. Hermes est plus universel » , a appris RBTH auprès du ministère russe de la Défense. Il précise que les informations officielles sur le missile seront publiées après son adoption par l’ armée . \\n« Aujourd’hui, on peut seulement affirmer que sa portée est largement supérieure à celle des complexes antichars étrangers, la plus grande étant de dix kilomètres pour ces derniers » , souligne notre interlocuteur. Il ajoute que l’ogive du missile peut être tant cumulative qu’explosive et incendiaire. Lire aussi : La Russie prête à abattre des avions américains en cas de frappe en Syrie Les hélicoptères de navire Ka-52 \\nLes hélicoptères de navire Ka-52 Katran ont été conçus spécialement pour les bâtiments de débarquement français du type Mistral . Cependant, sous la pression des alliés au sein de l’ Otan , François Hollande a été contraint de rompre le contrat de vente de ces navires à la Russie, rappelle Vadim Koziouline, professeur de l’Académie des sciences militaires. \\nAu final, les Mistral ont été rachetés par l’Égypte et, dans la foulée, le Caire acheta un lot de 50 Katran russes à Moscou . Les hélicoptères restants ont été affectés à l’Amiral Kouznetsov pour subir un « baptême de feu » en fin d’année. \\nL’expert précise que les modèles « terrestres » de Ka-52 se sont avérés efficaces dans la campagne syrienne . Les nouveaux engins devront également démontrer leurs capacités militaires aux futurs acheteurs. \\nLes hélicoptères peuvent utiliser les missiles air-air R-73 et Igla-B, les missiles non-guidés « air-sol » et les missiles guidés antichars Hermes. Lire aussi :\""}, "time": 1742563053.6389835}