{"duration": 0.04424476623535156, "input_args": {"text": "'43 Views November 08, 2016 GOLD , KWN King World News \\nOn election day, today John Embry told King World News that the greatest wealth transfer in history nears as the ‘Deep State’ is now pulling out all the stops. \\n‘Deep State’ Desperation John Embry: “Eric, mercifully election day in the U.S. has finally arrived to put an end to the ugly spectacle which has been billed as the presidential campaign. The capper came on Monday, when in response to the FBI ending its investigation of Hillary Clintons email transgressions, the Dow magically rallied back to 18,200, a level which had been defended for months by the powers that be… Continue reading the John Embry interview below… Advertisement To hear what billionaire Eric Sprott & Rick Rule are doing with their own money and which $7 billion company John Embry & Dr. Marc Faber oversee click on the logo: \\nJohn Embry continues: “ Simultaneously gold and silver were viciously attacked, while virtually every other asset category, including oil and copper, which incidentally have terrible fundamentals, rose in price. This represents business as usual as the ‘Deep State’ pulls out all stops to have their candidate Hillary Clinton elected. \\nI suspect that in the fullness of time Monday will be seen as one of the most ridiculous days in market history, irrespective of who wins the election. The sad fact is that the U.S. problems now run so deep that no president has any ability at this stage to address the situation and bring back the good old days of sustainable growth and containable inflation. I believe that we are going to see rising inflation in conjunction with a steadily weakening economy as the staggering debt load takes its inevitable toll. \\nI laughed when I saw the headlines in the New York Times and the London Financial Times in the wake of last week’s lousy jobs numbers, which incidentally would have been a whole lot worse if they weren’t so heavily doctored. The New York Times headline screamed, ‘Unemployment Hits 2008 Low, Wages Increase.’ The FT stated, ‘Wage Data Underlines Solid Jobs Market As Poll Nears.’ These newspapers are now so compromised that they shouldn’t be referred to as newspapers, but rather government propaganda machines. The old Soviet Pravda operation would be green with envy. In reality, U.S. federal government tax withholdings are now falling, giving a much better indication of the true state of the U.S. economy. \\nThe sharp fall in gold and silver on Monday provided yet another excellent buying opportunity. But irrespective of who is the next U.S. president, both metals will be heading sharply higher as financial reality overtakes the present pre-election fantasy. I would echo James Turk’s excellent advice on KWN yesterday when he said, ‘Own   assets.’ I believe he is dead right, and as I’ve said many times, before this saga is over we are going to witness the greatest wealth transfer in history and one best be on the right side of that transaction.” \\n  As The World Awaits The U.S. Election Outcome, Buckle Up For Some Rough Times  '"}, "time": 1742562249.3594186}