{"duration": 0.10667085647583008, "input_args": {"text": "'WASHINGTON  —   Hillary Clinton expressed doubts about whether the United States should go forward with a   modernization of its nuclear forces at a   in February, questioning an Obama administration plan that she has remained largely silent on in public. Mrs. Clinton also suggested she would be far tougher against foreign nations that hack into American computer networks and would kill one of the Pentagon’s pet projects, a   cruise missile. “The last thing we need,” she told the audience, “are sophisticated cruise missiles that are nuclear armed. ” Her comments were contained in an audio recording of the   that appeared on the website of The Washington Free Beacon, a conservative publication, which said it was gleaned from the hack of a campaign staff member. But it said nothing about who did the hacking. At a moment when Mrs. Clinton and the Obama administration have warned that Russia is trying to influence the American election, the mysterious release of the tape is also certain to raise new questions about the scope of attacks on the Democratic National Committee and the Clinton campaign. A former Defense Department official present at the   Andrew C. Weber, who raised the question about nuclear modernization, verified the contents of the tape, but also suggested its release was part of the same hacking campaign that exposed D. N. C. emails. Before she turned to nuclear matters, Mrs. Clinton used the   to suggest that she would be much firmer against foreign nations that hack into American networks. Though the administration never formally accused China of stealing the   records of nearly 22 million federal employees and contractors, she called the theft “a gold mine for Chinese intelligence. ” “They are at it all the time,” she said of the Chinese   hackers. But she also seemed to suggest  —   more directly than she did in Monday night’s debate  —   that she thinks the best deterrent to the Russians, the Chinese, the Iranians and the North Koreans, all of whom she named, was a dose of American offensive cyberweaponry. “They have physical assets that are also connected on the internet,” she said. “So they have to know we would retaliate. So that provides a certain level of deterrence. ” It may not: The   hacks of the Democrats’ infrastructure, so far without a visible American response, suggest that the deterrence Mrs. Clinton is relying on is not working. The   recording was made in February during a   event at the home of Beatrice and Anthony Welters in McLean, Va. Mrs. Welters was ambassador to Trinidad and Tobago when Mrs. Clinton was secretary of state. Mr. Weber was an assistant secretary of defense for nuclear programs from 2009 to 2014. Last year, after leaving office, he joined William J. Perry, a secretary of defense in the administration of President Bill Clinton and one of the Democratic Party’s most influential nuclear advisers, to write an   in The Washington Post strongly opposing White House approval of an upgraded nuclear cruise missile. The missile is part of a sweeping modernization of the American nuclear arsenal that is estimated to cost up to $1 trillion over three decades. Undertaken by the Obama administration, it features new factories, refurbished nuclear arms, and a new generation of weapon carriers, including bombers, missiles and submarines. The new bombers are to carry the new cruise missile. At the   Mr. Weber asked Mrs. Clinton about the modernization push and whether she, as president, would cancel the cruise missile, which he called a “particularly destabilizing, dangerous type of nuclear weapon. ” “I certainly would be inclined to do that,” she answered. “The last thing we need are sophisticated cruise missiles that are  . ” Mrs. Clinton went beyond the question to warn of an emerging nuclear arms race, naming Russia and China as well as Pakistan and India. “This is one of the most dangerous developments imaginable,” she told the audience. “Pakistan is running full speed to develop tactical nukes in their continuing hostility with India. ” she said. “But we live in fear that they’re going to have a coup, that jihadists are going to take over the government, they’re going to get access to nuclear weapons, and you’ll have suicide nuclear bombers. So, this could not be a more threatening scenario. ” The United States, Mrs. Clinton said, needs to “do everything we can” to restrain the competitions, including exploring new treaties with Moscow that would go beyond the New Start treaty of 2010, which she helped negotiate. Mrs. Clinton proceeded to praise Mr. Perry, saying the more he spoke out publicly and joined with Republican statesmen in trying to curb nuclear arms, “the better off we’ll be in trying to really cut this off.’ “This is going to be a big issue,” she added. “It’s not just the   cruise missile. There’s a lot of other money we’re taking about to go into refurbishing and modernization. ” “Do we have to do any of it?” Mrs. Clinton asked. “If we have to do some of it, how much do we have to do? That’s going to be a tough question, so I will look to people like you and Bill Perry to help me answer that question. ” Mr. Obama has said he wants to reduce the role of nuclear weapons in American strategy, and his aides have hinted he may believe the modernization program needs reconsideration. But he seems to have left that to his successor, and the cruise missile Mrs. Clinton spoke about so disparagingly remains in the Pentagon budget.'"}, "time": 1742563368.1515431}