{"duration": 0.06255340576171875, "input_args": {"text": "'Failed presidential candidate Hillary Clinton has once again blamed her widespread unpopularity on misogyny, telling a summit this week that it “certainly played a role” in her election defeat to Donald Trump last November. [“Certainly misogyny played a role,” Clinton told a Women in the World Summit on Thursday. “I mean, that has to be admitted. ”  She then went on to claim that people felt uncomfortable with her being a successful woman, claiming that there is an “inverse relationship” between success and popularity that only applies to women. Clinton’s comments were in response to a question on why she lost the election, to which she said she believed that there was no single reason. “[Like] in any campaign, there are so many different crosscurrents and events, and some have a greater impact than others,” she said. It is not the first time that Clinton has blamed her unpopularity on supposed sexism. During the Democratic Party primaries in April last year, the Clinton reportedly justified her low favorability ratings as a result of sexism within the Democratic Party. Meanwhile, last September Barack Obama blamed Clinton’s low poll numbers on the notion that “society [is still] grappling with what it means to see powerful women. ” Another former president, her husband Bill Clinton, also argued that sexist men would not vote for his wife because they couldn’t “fess up” to the idea of having a woman president. During the election campaign, Hillary Clinton described half of the Americans supporting Donald Trump as a “basket of deplorables” made up of “racist, sexist, homophobic, xenophobic, Islamophobic” people. She went on to lose the Electoral College vote by 232 to Donald Trump’s 306. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563781.7081206}