{"duration": 0.16003966331481934, "input_args": {"text": "'Was the airstrike in Syria Killing 22 schoolchildren another US false flag? Russian defense says so By Joachim Hagopian Posted on October 31, 2016 by Joachim Hagopian \\nThe Western media seizes every chance to twist the truth in favor of another round of Putin bashing as its worn out flimsy excuse to escalate further hostilities against Moscow in order to trigger World War III. \\nThe pathological liars of the West never fail to deceitfully add fuel to their propaganda war machine fire. The latest hype is blaming a Russian airstrike for destroying a school in the rebel held Idlib Province in northern Syria, killing 22 children and six teachers. \\nImmediately the UN, as the Washington vassal it is, through the United Nations Children’s Fund (UNICEF), for added sensational effect no less, began opportunistically milking the tragedy for all it‘s worth, denouncing the killing as “an outrage” and probable war crime, adding that it’s the deadliest attack on a school in the near six-year Syrian conflict. What’s being left out of this heavily biased narrative is that the war in Syria was maliciously started by the United States, specifically the CIA funding protests in 2011 (actually as far back as 2005 ) targeting Assad as part of its infamous Arab Spring uprising in accordance with Empire’s illegal regime change policy. As an independent, secular leader unwilling to succumb to Empire’s pressure to allow a 2009 proposed Qatar gas pipeline to Europe be built through his country, the fixated neocons have been gunning for Assad’s removal ever since. \\nRussian Defense Ministry spokesman Major General Igor Konashenkov explained that after closer examination and careful analysis, the video released to Western media allegedly depicting the airstrike in Idlib Province consists of more than ten separate pieces of footage fragmented together. Thus, it appears to be a hoax designed to incriminate the Russian aerospace group for killing innocent kids. \\nHe added, “As one can see on a photo from the Russian drone, the roof of the school is not damaged and there are no bomb craters in the area adjacent to the school . . . All this means that the UNICEF leadership fell a victim to a new deception of swindlers in White Helmets. That is why, before making loud statements, UNICEF officials should check sources of their information in order not to undermine reputation of a respected organization.” \\nOf course, this latest false flag isn’t the first time Russia’s been falsely blamed for attacks in Syria. Through CIA and military intelligence, the West has an elaborate network of anti-Russian and anti-Assad provocateurs waging staged events to implicate and vilify Putin and Assad as the enemy. General Konashenkov mentioned the White Helmets as part of the organized setup of US false flag operations in Syria. \\nA former UK military intelligence officer owns the private security company responsible for training and handling the so-called White Helmets, discredited Syrian provocateurs pretending to be Syria’s Civil Defense corps regularly staging fake photo-ops after US backed terrorist groups kill innocent civilians making it appear that Assad and Putin are willfully and inhumanely murdering them. This latest school tragedy appears no different as incident after incident has been exposed in recent months. \\nLike last month’s attack on that UN humanitarian aid convoy north of Aleppo, engineered by Western intelligence working with the terrorists to accuse Russia of yet another airstrike that didn’t happen, covering up the a rocket attack perpetrated by the US backed al Nusra Front (forget their recent name change designed to distance themselves from being US proxy war terrorists no different from al Qaeda or ISIS/Daesh/Islamic State). Bottom line, Terrorists-R-US, Inc . \\nIn this latest propaganda ploy, on-the-ground eyewitness reports vis-à-vis White helmets state that 10 airstrikes around midday on Wednesday were responsible for striking the residential compound containing two schools in session at the time resulting in the bloodbath. Of course the go-to propagandist organization out of London that the Western media never fails to quote, the already outed fraudulent Syrian Observatory of Human Rights consisting of one anti-Assad expatriated Syrian, began immediately pointing the finger at Russia, like Clinton, Obama and all the Western axis-of-evil liars determined to demonize Putin and Russia as false justification for starting their next world war . \\nIn response to the tragedy, Russian Foreign Ministry spokesperson Maria Zakharova on Thursday called for an urgent international investigation without delay. She had this reaction to the Western pressitutes blaming her nation: “This is not surprising, but at the same time it deserves the strongest criticism. Al-Jazeera, The Independent, and other mass media sharing the same attitude to the journalistic profession at once blamed the tragedy on Russia, on the Russian aerospace group and on the Syrian armed forces. They claimed outright that it was a bombardment carried out by Russia and Syria. This is a lie. Russia has nothing to with that terrible tragedy, with that attack.” \\nZakharova also mentioned concern that the UN humanitarian relief in Syria has not nearly been enough to evacuate the wounded and sick from East Aleppo after Russia and Syria agreed to a humanitarian pause there several days ago. However, US backed rebels and snipers fired on civilians attempting to leave the city. Moreover, the US took full advantage of the lull in the Russian-Syrian fighting by opportunistically resupplying their terrorists on the ground with 50 ton airdrops of fresh ammo and weapons. Again, clearly it’s the US that’s the war crime culprit, needlessly causing only more war and more deaths in the war ravaged nation reeling from nearly a half million lives lost. \\nAnother reality check for the Washington neocon war maniacs determined to blame Russia for all the ills of the world (including the corrupt US political system responsible for the rigged election ) as their deceptive sleight of hand brainwash to feebly cover up their own slaughterhouse carnage raping our planet, just one day prior to the Idlib school violence, the Beirut branch of Amnesty International (AI) chastised the US led coalition pretending to fight the terrorists for its wanton killing of civilians in Syria as “collateral war damage.” The inhumanities that Empire commits is never admitted or acknowledged but instead constant lies claiming that Russian and Syrian forces are cold-bloodedly mowing down innocents continue nonstop. The hubris and hypocrisy stemming from Washington’s rotten core is American exceptionalism at its diabolical worse. \\nDeputy Director for research at the Beirut Amnesty International office Lynn Maalouf , stated, “It’s high time the US authorities came clean about the full extent of the civilian damage caused by coalition attacks in Syria. We fear the US-led coalition is significantly underestimating the harm caused to civilians in its operations in Syria.” \\nAI estimates that in 11 US coalition airstrikes since September 2014 killed more than 300 civilians in Syria. Maalouf maintains that in each case, “the coalition forces failed to take adequate precautions to minimize harm to civilians and damage to civilian objects.” So who’s really the inhumane kid-killing bad guy in Syria? Definitely not Russia nor the Syrian government but once again the enemy of the world, the US Empire. \\nUltimately to silence this never-ending US blame game against Moscow, the Russian ambassador to the UN on Thursday began circulating the original September 9 US-Russian peace treaty to the UN Security Council as well as to the UN Geneva branch. This document clearly shows that Russia has exhausted every sincere effort to bring an end to the war in Syria and stop global terrorism but the United States and its Western lackeys have willfully and deceitfully sabotaged that process at every turn in order to save their precious terrorists and endless war on terror. The evildoers behind the lifted curtain are exposed and guilty as charged. \\nOr how can we forget that Obama staged false flag attack in August 2013 when the liar-in-chief falsely blamed Assad for sarin gassing his own Syrian children in the nearby Damascus suburb of Ghouta . Despite the real child murderers being Obama and his backed rebels, he and Hillary created soon to be named ISIS, the Manchurian president given the mission to destroy America and his then recently resigned secretary of state designated to be his successor to finish the job were trying to launch airstrikes on Syria to start World War III over three years ago. Putin outsmarted the US traitors in charge by brokering the last minute deal for Assad to turn in his chemical weapons arsenal. But with White House approval, US backed terrorists guilty of the Ghouta massacre are still using their Saudi and Turkish supplied chemical weapons to kill Syrian civilians even to this very day. Where are the humanitarian cries about those war crime atrocities? \\nOr what about all the civilians dying in Syria from mortar shelling of residential neighborhoods in West Aleppo? A mere one day after the Idlib school bombing, the US backed al Nusra fired rockets in two locations in West Aleppo, one a school killing six children under the age of 16 and injuring more than a dozen others. In response to the Thursday school bombing in West Aleppo by US backed terrorists, the Aleppo police chief Zuher Said Aldin commented, “There are no military units there, only schools. Nevertheless, militants carried out a strike on this area, moreover, when classes were underway. Innocent children were killed, they just wanted to study.” \\nBut where are all the humanitarian cries against US financed and supported terrorists constantly murdering innocents throughout the Middle East and North Africa? Conveniently absent, because the US plotters of wars around the world couldn’t care less about any dead children anywhere on this planet. \\nOr the 10,000 civilians in Yemen slaughtered by the US backed Saudi coalition consisting of US Special Force boots on the ground and more al Qaeda and ISIS terrorists, deployed there as well, in addition to Israeli and Gulf State airstrikes and now US destroyers pounding the Yemen coast killing more civilians with cruise missiles after yet more US false flag claims that the Houthis fired missiles at the US Navy without any evidence to prove it. Where are the sanctimonious humanitarian cries over dead Yemeni children? \\nThis historic, incessant use of false flags designed to bri \\nJoachim Hagopian is a West Point graduate and former US Army officer. He has written a manuscript based on his unique military experience entitled “Don’t Let The Bastards Getcha Down.” It examines and focuses on US international relations, leadership and national security issues. After the military, Joachim earned a master’s degree in Clinical Psychology and worked as a licensed therapist in the mental health field with abused youth and adolescents for more than a quarter century. In recent years he has focused on his writing, becoming an alternative media journalist. His blog site is at empireexposed.blogspot.co.id/ This entry was posted in Commentary . Bookmark the permalink'"}, "time": 1742561903.8760936}