{"duration": 0.050222158432006836, "input_args": {"text": "'KABUL, Afghanistan  —   Contending that her “life isn’t at risk at all,” military officials in Afghanistan have asked that the United States reject the asylum case of Capt. Niloofar Rahmani, the first female   pilot in the Afghan Air Force. On Thursday, Captain Rahmani revealed that she had applied for asylum this summer, saying she felt unsafe in Afghanistan, where she and her family have received death threats. For the last 15 months, she has been training at air bases in Arkansas, Florida and Texas. Captain Rahmani said that her Afghan male colleagues in the air force treated her with contempt and that she felt at risk. “Things are not changing” for the better in Afghanistan, Captain Rahmani said in an interview on Friday. “Things are getting worse and worse. ” Gen. Mohammad Radmanish, a Defense Ministry spokesman, disputed her claims of being in danger. “I am sure she lied by saying she was threatened, just to win the asylum case,” General Radmanish said on Sunday. “It is baseless that she claimed her life was at risk while serving in the Afghan Air Force. ” “Since Captain Rahmani’s claim is new, we expect her to change her mind and return to her own country and continue serving as a pilot,” the general said. “We request from our American friends and government to reject her asylum case and send her back, because knowing the truth, Captain Rahmani’s life isn’t at risk at all. ” The American government has celebrated Captain Rahmani as an example of its success in advancing women’s rights in Afghanistan. In 2015 the State Department honored her with its annual Women of Courage award, and Michelle Obama praised her courage. In Afghanistan, few supported her decision, and there were worries that her asylum request would affect the process of training Afghan pilots outside the country. “Captain Rahmani’s claim that she was harassed in the workplace is not true, because in the air force all the pilots and staff are   and highly trained people,” said Col. Ayan Khan, a helicopter pilot in the Afghan Air Force. “How can they harass their female colleague who serves along them?”'"}, "time": 1742561751.5920532}