{"duration": 0.14379525184631348, "input_args": {"text": "'2016 presidential campaign A Black Agenda Radio commentary by executive editor Glen Ford \\nAre most Americans warlike, or are they just easily misled into going along with the War Party that dominates both halves of the duopoly? In a certain sense, the distinction doesn’t matter. Most American don’t care enough about the lives of the millions of victims of U.S. empire to do much of anything to save them. And, if they voted for Hillary Clinton, they did not even have the presence of mind to save themselves from nuclear annihilation. War Less Imminent After Clinton Defeat A Black Agenda Radio commentary by executive editor Glen Ford \\n“Trump says he wants to cooperate with the Syrians and the Russians to defeat ISIS.” \\nWith so many people who call themselves liberals and leftists tearing their hair out in dread of a President Donald Trump, it is necessary to point out that the prospects of avoiding nuclear war are much better than they were the day before the election. Hillary Clinton was committed to imposing a “no fly zone” over Syria that would have meant instant war with Russia, likely resulting in the annihilation of the human species. You’d think that would have made Clinton anathema to decent people. But Americans, including those who call themselves liberals, are not decent people – not really. Based on their political behavior, they just pretend to be decent, but support U.S. governments that have slaughtered millions since the end of World War Two. If you voted for Obama and Clinton, you gave your assent to continuing George Bush’s wars, allowing Obama to start two major wars of his own, in Libya and Syria, and to Hillary Clinton’s plans to roll the nuclear dice on the fate of humanity. The whole world knows that Americans are dangerous, to themselves and to others. But, decent? Since when, and to whom? \\nDonald Trump looks and talks like the ugly, racist, bullying American -- and he is exactly that, but he hasn’t killed anybody yet, and his public statements have been of a far more peaceful nature than the woman he beat at the polls. Trump says he wants to cooperate with the Syrians and the Russians to defeat ISIS. Trump also does not make distinctions between the various Islamic jihadist groups in Syria, unlike the Obama administration, which has directly and indirectly armed and funded all of the jihadist groups, and has spent much of the last several months trying to protect the al Nusra Front, the al Qaida affiliate in eastern Aleppo, from Russian bombing. \\n“The jihadists are in despair, and the prospects for driving them out of Aleppo look promising.” \\nNo sooner had the votes been counted, than President Obama ordered U.S. Special Forces to go all-out to kill the leadership of al-Nusra. \\nThis war has been entirely based on lies, so Obama will probably limit his Kill List to al Qaida leaders, while sparing the rank and file jihadist fighters for future use by the United States. But it is safe to say that, had Hillary Clinton been elected, the most warlike factions in the U.S. military, the CIA, the State Department, and the foreign policy establishment at-large would be setting the stage for full-scale confrontation with Russia and all of Syria’s allies under President Clinton. Instead, the jihadists are in despair, and the prospects for driving them out of Aleppo look promising. Hopefully, the Syrian government and its friends will be on the road to victory before Donald Trump’s presidency is decisively captured by the bipartisan War Party that runs the empire. \\nSyrian President Bashar Assad says it’s fine with him if Trump wants to fight the terrorists. But, Assad isn’t sure that Trump can deliver on his campaign pledge. “What about the countervailing forces within the administration, the mainstream media that were against him?” Assad asks . Assad thinks the notion of Trump bucking the War Party is “dubious.” He’s right. Half a million Syrians are dead because most Americans don’t much care who their government kills, as long as they’re not white. But, getting rid of Clinton has slowed the War Party down a bit, and maybe prevented a nuclear war. If you are a decent person, you should be pleased about that. \\nFor Black Agenda Radio, I’m Glen Ford. On the web, go to BlackAgendaReport.com. BAR executive editor Glen Ford can be contacted at [email protected] .'"}, "time": 1742561736.103069}