{"duration": 0.1577286720275879, "input_args": {"text": "'For more than a year, much of the public scrutiny of Exxon Mobil was captured by the #Exxonknew hashtag  —   shorthand for revelations about   research on climate change conducted by the company while it funded groups promoting doubt about climate science. Articles about that research have energized protests against Exxon Mobil and the fossil fuel industry and had a role in initiating queries by at least five attorneys general, led by Eric T. Schneiderman of New York. Early on, his office demanded extensive emails, financial records and other documents from the oil company, leaving many observers with the impression that a deeper look into the company’s past was the focus of the investigation. But in an extensive interview, Mr. Schneiderman said that his investigation was focused less on the distant past than on relatively recent statements by Exxon Mobil related to climate change and what it means for the company’s future. In other words, the question for Mr. Schneiderman is less what Exxon knew, and more what it predicts. For example, he said, the investigation is scrutinizing a 2014 report by Exxon Mobil stating that global efforts to address climate change would not mean that it had to leave enormous amounts of oil reserves in the ground as   “stranded assets. ” But many scientists have suggested that if the world were to burn even just a portion of the oil in the ground that the industry declares on its books, the planet would heat up to such dangerous levels that “there’s no one left to burn the rest,” Mr. Schneiderman said. By that logic, Exxon Mobil will have to leave much of its oil in the ground, which means the company’s valuation of its reserves is off by a significant amount. “If, collectively, the fossil fuel companies are overstating their assets by trillions of dollars, that’s a big deal,” Mr. Schneiderman said. And if the company’s own internal research shows that Exxon Mobil knows better, he added, “there may be massive securities fraud here. ” Alan Jeffers, a spokesman for Exxon, dismissed the idea that its forecast could be viewed as fraudulent. “If it turns out to be wrong, that’s not fraud, that’s wrong,” he said. “That’s why we adjust our outlook every year, and that’s why we issue the annual forecast publicly, so people can know the basis of our forecasting. ” The company has said allegations that it secretly developed a definitive understanding of climate change before the rest of the world’s scientists are “preposterous. ” Mr. Schneiderman has praised reports from publications, including Inside Climate News and the Los Angeles Times, that detailed Exxon Mobil’s past research. And all indications were that his office planned to use its subpoena powers to unearth new documents that might show a disconnect between what the company was saying publicly and what it was saying privately about climate change over several decades. In the interview, however, Mr. Schneiderman said his focus lay elsewhere. “The older stuff really is just important to establish knowledge and the framework and to look for inconsistencies. ” He called his efforts a straightforward fraud investigation, like many that he and his predecessors have taken on in subjects as   as the crash of   securities and Volkswagen’s diesel engine deceptions. Mr. Schneiderman also mentioned, as an example of questionable public statements by Exxon Mobil,  congressional testimony in 2010 by its chief executive, Rex Tillerson, who said that while the company acknowledged that humans were affecting the climate through greenhouse gas emissions to some degree, it was not yet clear “to what extent and therefore what can you do about it. ” Mr. Tillerson added, “There is not a model available today that is competent” for understanding the science and predicting the future. Mr. Schneiderman disagrees, and cited the industry’s own extensive climate research and the actions it has taken in response, including exploration in the melting Arctic and raising the decks of offshore oil platforms to compensate for rising sea level. “These guys have the best science for their engineering purposes,” he said. “We’re confident they’re not wasting shareholder dollars to do things that are inconsistent with the science they have internally. ” Since November, when the investigation was first revealed, and as other state attorneys general announced their support, Mr. Schneiderman’s intentions have been questioned and, he said, misconstrued. Supporters of Exxon Mobil have accused him and his colleagues of using prosecutorial powers to pursue political ends and of trying to squelch the First Amendment rights of the company, its scientists and anyone who agrees with them. Lamar Smith, a congressman from Texas and chairman of the House Committee on Science, Space and Technology, accused the attorneys general of “pursuing a political agenda at the expense of scientists’ rights to free speech” and has issued subpoenas demanding internal documents from Mr. Schneiderman and another state attorney general, as well as eight groups that have supported the investigations. Hans von Spakovsky, a conservative commentator, compared the investigation by the attorneys general to the Spanish Inquisition, and the Daily Caller asked whether Mr. Schneiderman had suggested “jailing global warming skeptics. ” Mr. Schneiderman talks about such accusations with incredulity. “This is an investigation,” he said. “It is a civil fraud case. No one is being prosecuted  —   we’re not out to silence dissenting views. ” He has said, however, that if criminal actions turn up in the evidence the state gathers, criminal charges could be filed. When asked about the First Amendment implications of investigating Exxon’s statements, he repeated a sentence he has uttered many times: “The First Amendment doesn’t protect you for fraud. ” He added, “  monte operators can’t say, ‘Hey, I’m just exercising my First Amendment rights! ’” When asked about the focus of Mr. Schneiderman’s investigation, Joel Seligman, an expert in securities law who is the president of the University of Rochester, said that “at some level, this is a   investigation  —   and there is no guarantee it will lead to a case. ” Exxon Mobil has sued to block subpoenas from Massachusetts and the United States Virgin Islands, but the company has provided hundreds of thousands of pages of documents to New York. If the investigation does turn up the kind of evidence that could lead to a civil case, it is still unclear whether New York or the other states might win, said David M. Uhlmann, a former top federal prosecutor of environmental crime and a professor at the University of Michigan law school. Until governments impose the kind of regulations that will lead to concrete action to slow or reverse climate change, he said, “We’re going to continue to drill for oil and frack for gas. ’’ In that case, he continued, Exxon may “utilize a significant portion of its reserves, which means it may not even be wrong when it states that it expects to utilize its reserves. ” Even if Exxon is wrong in saying that it expects to be able to use all its reserves, “The question is whether they know that they are wrong and are therefore lying to investors,” he added. The investigation, Mr. Schneiderman said, mirrors an earlier inquiry into a coal giant, Peabody Energy. In 2013, he issued subpoenas for internal documents related to climate change, and found false statements to shareholders and the Securities and Exchange Commission. “Simple stuff like ‘it’s impossible to predict the effect of a carbon tax on the coal market,’ and they paid a consultant a lot of money to predict the effect of a carbon market,” he said. Peabody signed an agreement  pledging to properly disclose the climate risk to its business. Mr. Schneiderman has also been accused of conspiring with environmental groups, but he said, “People bring information to us all the time. If it’s got merit to it, we follow up on it. ” Groups like the Union of Concerned Scientists have investigated the fossil fuel industry for years, he said, and so “it would be malpractice for us not to meet with people like this. ” The industry’s tactics come “straight out of the tobacco playbook,” he said. “It’s delay, and sowing doubt. ” Mr. Schneiderman has refused to comply with the congressman’s subpoena, stressing the importance of federalism  —   normally an argument used by conservatives against federal overreach. When asked for comment, Kristina Baum, a spokeswoman for the Science committee, said that Mr. Smith was unavailable.'"}, "time": 1742562441.567371}