{"duration": 0.033187150955200195, "input_args": {"text": "'  Donald Trump fires back, after Hollywood actress Meryl Streep’s   tirade during the Golden Globe awards. [“Meryl Streep, one of the most   actresses in Hollywood, doesn’t know me but attacked last night at the Golden Globes,” Trump writes on Twitter. “She is a Hillary flunky who lost big. ”  Streep accused of Trump making fun of a disabled reporter, lamenting that the event “sank its hooks in my heart. ” “It kind of broke my heart when I saw it, and I still can’t get it out of my head because it wasn’t in a movie it was real life,” she said. But Trump argued that he was simply showing the reporter “groveling” for changing a 16 year old story to make him look bad. “Just more very dishonest media!” he concluded. Streep vocally supported Hillary Clinton in the 2016 campaign, and boldly celebrated that she would be the first woman president in a DNC convention speech.  “You’re gonna make history again in November. Because Hillary Clinton will be our first woman president. And she will be a great president,” Streep said at the time. “And she will be the first in a long line of women. And men. Who serve with grit and grace. ” In June 2016, Streep also did an unflattering Trump impression during a performance at the Public Theater Gala, as she smeared a spray tan on her face and sang for the audience.  She also gave a tribute speech to Hillary Clinton during a 2012 Women in the World summit.  In December 1, 2012, Streep snapped selfies with Hillary Clinton as she prepared another run for president. During her Golden Globes speech, she fretted that Trump would make the country worse. “Disrespect invites disrespect, violence incites violence. When the powerful use their position to bully others, we all lose,” she warned. “Disrespect invites disrespect” Meryl Streep pic. twitter.   —   Charlie Spiering (@charliespiering) January 9, 2017, '"}, "time": 1742628375.0392973}