{"duration": 0.13828659057617188, "input_args": {"text": "'by PAUL FASSA \\nAllowing and encouraging domestic hemp cultivation would be a boon for small farmers, especially organic farmers. I’m talking only about industrial hemp, not medical cannabis/marijuana, which continues to prove its merits and gain acceptance \\nIndustrial hemp’s use should be a no-brainer. But it’s a complex boondoggle of legal and bureaucratic nonsense even without THC, the molecule that leads to “Reefer Madness” . Industrial hemp commercial cultivation is legal in Canada. But the USA hemp industry was pushed to the side by government connected industry insiders whose monopolies were threatened when it appeared hemp may boom and compete for the very products of their monopolist concerns. \\nCirca 1937, the hemp industry had been given a mechanical invention gift known as the decoricator machine was invented. It was a machine that was to hemp what the 19th Century cotton gin was. It replaced hand shredding of hemp to glean its fibers, fibers that could be used for textiles, clothing, paper, and plastic. \\nWith the advent of the decoricator, hemp would have been able to take over competing industries in paper, textiles for clothing and other applications, fuel, and plastics. Growing hemp in abundance was easy, and it’s plant to harvest time was no more than six months. \\nAccording to Popular Mechanics during that time, “10,000 acres devoted to hemp will produce as much paper as 40,000 acres of average [forest] pulp land.” Then a small number of large businesses with competition concerns used high level government connections to push through the Marijuana Tax Act of 1937. \\nThe ensuing marijuana scares hyped by movies such as “Reefer Madness” brought about more legislation that would prohibit all hemp cultivation, even hemp without THC. \\nPrior to this, even without the high speed decoricator, hemp was an easy cash crop for small farmers, some of whom were recruited to continue cultivating hemp during WW II to provide hemp fibers for U.S. Naval ships’ ropes as well as other military applications. \\nAnd prior to that, hemp was so important during colonial and early American times that farmers were virtually required to cultivate it along with their other crops. \\nGeorge Washington –“Make the most you can of the Indian Hemp seed and sow it everywhere.” \\nThomas Jefferson –“Hemp is of first necessity to the wealth and protection of the country.” \\nHemp for Nutrition \\nHulled hemp seeds, their powders and cold pressed oils provide all the essential amino acids for easily digested high protein. Hemp is not only very high in omega-3, but it provides an almost perfect ratio of omega-3 to omega-6. \\nIt is truly a super food that you can buy in health food stores or online. The seeds come from Canada, where industrial hemp is legal . Hemp is so nutritionally dense that one could survive on hemp seeds alone during extreme food shortages. If hemp were legal, you could easily grow your own. Hemp Improves Farming \\nHemp plants don’t need pesticides or synthetic fertilizers, which rely mostly on the phosphate industry. A phosphate industry byproduct is the sodium fluoride that is sold to municipality water works for our poisoned tap water. \\nThe runoff from fields of phosphate fertilizers into waterways that merge with seawater is causing all sorts of nitrogen and phosphorous excesses and imbalances, leading to algae that stifles the water’s ecological support systems. \\nHemp’s thick roots ward off weeds, and growing hemp improves the soil’s nitrogen, making that soil better for other crops. They would be useful and lucrative rotation crops for organic farmers. \\nHemp plants have a growth cycle of only four months. In mild climates, harvesting hemp two times in one year would create an annual cash cow for farmers. The marijuana taboo is eliminated by allowing the male plants to continually pollinate the female plants. This reduces psychotropic THC to legal levels. \\nEliminating Toxic Petrochemical Plastics \\nThere is a clump of plastic waste residue larger than the state of Texas floating in the middle of the Pacific. A lot of it is expected to decompose, creating a plastic soup in the ocean. The toxins from this plastic soup spread out into other oceanic regions and are hazardous to fish and bird wildlife. This soup could find its way into our kitchens as well! \\nAll kinds of plastics are produced with hemp, from clear wraps for foods to automobile parts. Hemp plastics are durable and heat resistant. And they are bio-degradable. Recently the French auto industry use hemp to manufacture some of its automobile parts. Henry Ford pioneered this in 1941 when he built his “vegetable car” with hemp and flax. It was stronger and lighter than steel cars. \\nFord’s hemp-mobile also used hemp bio-diesel fuel, which creates very little pollution. The petroleum industry didn’t want to see or hear that. Hemp seeds were even used to make paints and lacquers in the mid-1930s. \\nPetrochemical plastics for all purposes could be replaced with hemp plastics that are non-toxic and bio-degradable. Bye-bye BPA! \\nConstruction Materials for Housing \\nAmazingly, housing construction materials made from hemp fibers have been discovered to be superior to most cheap materials used in housing construction these days. Ever see a house under construction after its initial framing? \\nWhat you’ll usually see before whatever exterior coating is used are sheets of wood substitutes, either pasteboard or particle board or pressboards, some of which are processed and bound with toxic chemicals that can off-gas into interior quarters. It’s cheaper than other materials and used abundantly. \\nInexpensive hemp can be made into various different building materials, hempcrete, fiberboard, carpet, stucco, cement blocks, insulation, and plastic. Those materials are stronger and much longer lasting than what’s being used currently. They are also mold and rot free and more fire resistant. And they are environmentally and ecologically friendly and non-toxic. More Trees for Tree Huggers \\nPulp from trees is used to make paper. But anything wood pulp can do, hemp fibers can do better. It’s said that the original Constitution and Bill of Rights were on hemp paper. \\nPaper from trees can be recycled maybe three times. Hemp paper can be recycled eight times. Since hemp was effectively banned in the USA since 1937, 70% of the USA’s forests have been eliminated. It takes years for trees to grow. Hemp can be gown and harvested within six months. \\nIt’s estimated that one acre of hemp produces more oxygen from CO2 and methane than 25 acres of forest. One idea presented by hemp advocates is to have inner city hemp plots to improve urban air quality. We wouldn’t need bogus carbon tax legislation. \\nPulping trees for paper creates more waste, pollution, and consumes more energy than most enterprises. This industry consumes more water than almost all others. It is the fifth largest industry consumer of energy, and it emits a good deal of toxicity in the process. \\n“Why use up the forests which were centuries in the making and the mines which required ages to lay down, if we can get the equivalent of forest and mineral products in the annual growth of the hemp fields?” — Henry Ford \\nAnything the petrochemical industry can produce, hemp can do better without toxic environmental and human consequences. Deforesting could be a thing of the past if hemp became the major source of construction materials and paper. Heavily pesticide and herbicide sprayed or GMO cotton wouldn’t be necessary, nor would toxic synthetic fibers. \\nAmazing how such an easily cultivated plant with so many beneficial applications has been so efficiently suppressed by the one or two percent for their purposes while too many among the 98% agreed with that suppression. \\n\\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption that harms more than most realize. Visit his blog by following this link and follow him on Twitter here .'"}, "time": 1742562607.2836974}