{"duration": 0.07497310638427734, "input_args": {"text": "'THE DAILY SHOW (THE BOOK) An Oral HistoryBy Chris SmithIllustrated. 459 pp. Grand Central Publishing. $30. After an election in which facts could be oh so elusive, it’s instructive to look back to 2003. That’s when several “Daily Show” staff members heard a speech from President George W. Bush that directly contradicted things the presidential candidate George W. Bush had said about foreign policy. It dawned on them to pull old tape and set up a mock debate in a split screen: Bush versus Bush. It was a breakthrough for Jon Stewart’s show. “If we, as basically stoner comedy people, could remember it, how was it possible that the actual media couldn’t remember it, or didn’t care, or didn’t think it was important?” Ben Karlin, a former producer of the show, says. That’s one valuable anecdote in this exhaustive oral history, which traces the   sprint that turned “The Daily Show” from a   cable presentation into a vital institution in American politics and the media. The book, compiled by the New York magazine contributing editor Chris Smith, rides through moments of history like the 2000 recount, Sept. 11, the 2004 election and the Obama years, explaining how all of it altered and refined “The Daily Show” with Stewart at the helm. As in other   show tales, the best stories here involve contract talks. And the book breaks plenty of news. It reveals that in 2012, negotiations for Stewart and Stephen Colbert  —   whose show “The Colbert Report” followed “The Daily Show” on Comedy Central  —   became so tense, both stars temporarily quit. The appointed villain is Philippe Dauman, former chairman of Comedy Central’s parent company, Viacom. Colbert was ready to stay through the 2016 election, but Dauman refused. (That worked out well for Colbert, who in 2014 was hired to replace David Letterman on CBS. “Thank God they said no,” he says.) Stewart also blames Viacom for botching the chance to sign John Oliver as his replacement before Oliver left for his successful HBO show. But delicious stories like these  —   the lifeblood of any oral history  —   can also be fleeting. When the journalists James Andrew Miller and Tom Shales paired up to compile oral histories of “Saturday Night Live” and ESPN, there were tales of sex and drugs. But “The Daily Show” was a different animal. “The drug stories are pretty lame,” Elliott Kalan, a writer on the show, tells Smith. “The sex stories are pretty lame. ” The “Daily Show” staff was, instead, mostly  . There are allusions to unhappiness in the writers’ room because of Stewart’s autocratic rule, with one producer saying “plenty of people” would describe Stewart as a tyrant. But the producer in question wasn’t one of them, and only rarely does any actual bitterness spill onto the page. Instead, there’s space dedicated to grindingly banal details like how morning and afternoon meetings were crucial to the show’s success. One producer is quoted discussing the pride she took in organizing a staff clambake and wine tasting. The book’s tone can be a bit   too. After “The Daily Show” wins one of its first Emmy Awards, Smith writes that despite their commercial and critical success, “Stewart and the staff, to a remarkable degree, stayed focused on the task of creating 160 or so shows each year. ” Still, the book is a valuable reminder of the show’s role in introducing an era of     in American politics. Producers recount seeing a politician lie on CNN, only to have the reporter respond, “Well, we’ll have to leave it there”  —   a   occurrence. “The Daily Show” ran a segment holding both the politician and the network accountable. “I think Jon’s joke was, ‘Don’t leave it there. There is a terrible place to leave it! ’’u200a” the producer Ramin Hedayati tells Smith. “Now when something crazy happens on CNN, there are five blogs that flag it. Back then, it was either us or no one. ”'"}, "time": 1742564267.526872}