{"duration": 0.12021446228027344, "input_args": {"text": "'For someone who promoted his management skills and campaigned as an “organizational genius,” as Anderson Cooper of CNN put it, it has been a rocky White House debut for Donald J. Trump, the first president to go directly from the executive suite to the Oval Office. “Chaos” seems to be the word most often invoked, closely followed by “turmoil. ” (One exception: the White House spokesman, Sean Spicer, who said he preferred “ . ”) In less than two weeks, Mr. Trump created upheaval at the nation’s borders, alienated longtime allies, roiled markets with talk of a trade war and prompted some of the largest protests any president has faced. The conservative editorial page of The Wall Street Journal bemoaned a refugee policy “so poorly explained and prepared for, that it has produced confusion and fear at airports, an immediate legal defeat, and political fury at home and abroad. ” Even the top House Republican, Speaker Paul D. Ryan, who had released a statement praising the immigration order, later distanced himself, saying, “It’s regrettable that there was some confusion with the rollout. ” All new presidents undergo a learning curve. But Mr. Trump promised a seamless transition and, with a real chief executive in charge as opposed to a career politician, an administration that would function as a   machine. So it doesn’t seem premature to ask some leading management experts for an assessment of Mr. Trump’s first weeks, purely from the viewpoint of organizational behavior and management effectiveness, as I did this week. The unanimous verdict: Thus far, the Trump administration is a textbook case of how not to run a complex organization like the executive branch. “This is so basic, it’s covered in the introduction to the M. B. A. program that all our students take,” said Lindred Greer, an assistant professor of organizational behavior at the Stanford Graduate School of Business. By all outward indications, Mr. Trump “desperately needs to take the course,” she said. Jeffrey Pfeffer, professor of organizational behavior at Stanford and the author of “Power: Why Some People Have It and Others Don’t,” said Mr. Trump’s executive actions as president “are so far from any responsible management approach” that they all but defy analysis. “Of course, this isn’t new,” he told me. “His campaign also violated every prudent management principle. Everyone including our friends on Wall Street somehow believed that once he was president he’d change. I don’t understand that logic. ” Wall Street did take notice. After months of cheering the prospect of tax reform and infrastructure spending, investors sold stocks after a weekend of chaos at the nation’s airports connected to the president’s executive order on immigration. On Monday, the Dow industrials experienced the biggest   decline since the election, fueled by worries that a dysfunctional White House wouldn’t be able to execute Mr. Trump’s policies. “If you thought immigration was bad, just wait for health care,” Mr. Pfeffer warned. The White House did not respond to requests for comment. There is an enormous amount of literature and data exploring what constitutes effective management of complicated organizations. “The core principles have served many leaders really well,” said Jeffrey T. Polzer, professor of human resource management at Harvard Business School. “It’s really common sense: You want to surround yourself with talented people who have the most expertise, who bring different perspectives to the issue at hand. Then you foster debate and invite different points of view in order to reach a   solution. ” This is often easier said than done. It “requires an openness to being challenged, and some   and even humility to acknowledge that there are areas where other people know more than you do,” Mr. Polzer continued. “This doesn’t mean decisions are made by consensus. The person at the top makes the decisions, but based on the facts and expertise necessary to make a good decision. ” Mr. Trump has already violated several of these core principles. The secretary of Homeland Security, John F. Kelly, was still discussing a proposed executive order restricting immigration when Mr. Trump went ahead and signed it. Nor was Jim Mattis, the defense secretary, consulted he saw the final order only hours before it went into effect. Not to consult thoroughly with top cabinet officers before deciding on the order “is insane,” since they “have the expertise and should be on top of the data,” Ms. Greer said. “Ignoring them leads to bad decisions and is also incredibly demoralizing. ” And there’s another reason to consult, Mr. Polzer said: “When people are genuinely involved in a decision and their input is heard and valued and respected, they are more likely to support and buy into the decision and be motivated to execute to the best of their abilities, even if the decision doesn’t go their way. ” Conversely, people who aren’t consulted feel they have no stake in a successful outcome. Far from encouraging and weighing differing views as part of the   process, Mr. Trump appears to view dissension as disloyalty. After career State Department officers circulated a draft cable questioning the effectiveness of the immigration ban, Mr. Spicer responded, “They should either get with the program or they can go. ” “Debate and dissent are essential to reaching any thoughtful outcome,” Ms. Greer said. Comments like Mr. Spicer’s “will discourage anyone from speaking up. You end up with group think, an echo chamber where people only say what they think the president wants to hear. ” And while it’s understandable that the president was eager to act swiftly to follow through on his campaign promises  —   he had made a long list of actions to be carried out on “Day 1”  —   his directives came across as needlessly hasty and poorly thought through. Some had to be reframed (talk of a Mexican border surcharge) or significantly modified and clarified after the fact (immigration policy). I asked the management experts to ignore their views about the merits of Mr. Trump’s policies, but all said that execution and substance are inextricably linked. “When you’re on the receiving end of a policy decision, the merits of the decision and the execution go hand in hand,” Mr. Polzer said. “If either one is done poorly, the outcomes will be bad. Even good plans that are poorly rolled out aren’t going to work well. ” For many people, the Affordable Care Act was indelibly tainted by the computer malfunctions that plagued its start. Similarly, for many Americans, the enduring image of Mr. Trump’s immigration policy will be that of a tearful Iraqi immigrant who was detained at Kennedy International Airport after risking his life working as a translator for the American military over a   period. (He was released after lawyers intervened on his behalf.) That prompted even Mr. Ryan to say, “No one wanted to see people with green cards or special immigrant visas, like translators, get caught up in all of this. ” Some Trump defenders have said that the president thrives on chaos, and it has proved to be an effective management approach for him in the past. But every expert I consulted said there is no empirical data or research that supports the notion that chaos is a productive management tool. “I’m not aware of anyone who advocates that,” Mr. Polzer said. “I don’t really know what’s going on in the White House, so I don’t feel comfortable commenting on that specifically. But I can say in general that in organizational settings, less chaos is a good thing. ” Everyone agreed that there was still time for Mr. Trump to right the ship. Other administrations have had course corrections and personnel  . But having to reorganize only weeks into a first term is not promising. If this were the private sector, “someone would be fired,” Ms. Greer said. That seems highly unlikely, since Mr. Trump has not even acknowledged a problem, instead blaming the media for an impression of upheaval in the White House. That is a fundamental problem, Mr. Pfeffer said. “No good business makes decisions that are based on falsehoods,” he said. “My sense is that Trump takes no one’s counsel but his own. That’s bad management, period. ”'"}, "time": 1742563378.4165292}