{"duration": 0.06970787048339844, "input_args": {"text": "\"Contact Us WikiLeaks: Hillary Admits Clinton Foundation Donors Fund ISIS Hillary Clinton is now on record saying Saudi Arabia and Qatar fund and support ISIS. So what did she do about it? She took their money, and sent them arms. Mainstream media won't touch this with a 10-foot pole. Posted on October 27, 2016 by administrator in News , US // 0 Comments \\nWikiLeaks have released an email in which Hillary Clinton admits that Qatar and Saudi Arabia – two of her mega-donors – provide financial and logistical support to ISIS. \\nIn the extraordinary email , sent to John Podesta in 2014, Clinton lays out an eight point plan to defeat ISIS in Iraq, and mentions that Saudi Arabia and Qatar are both giving financial and logistical support to the Islamic State and other extremist Sunni groups. \\nShe conveniently fails to mention that these two terror-funding states are both mega-donors to the Clinton Foundation. Qatar has given between $1 million and $5 million to the Clinton Foundation and Saudi Arabia has donated upwards of $25 million dollars to the Foundation. \\nNowhere in the email – sent, of course, through the notorious unsecured server – does Clinton address the staggering hypocrisy of continuing to provide Saudi Arabia with multiple billions in weapons, arms, aircraft, and other support in full knowledge of its active support for terrorists. \\nHillary Clinton has known since at least 2014 that the governments of Saudi Arabia and Qatar provide “ clandestine financial and logistic support ” to ISIS and other radical Islamic groups – but, rather than refuse their money and call for a halt of arms sales and support, she has campaigned for more money and tried to increase their supply of arms. \\nArming ISIS \\nIn an email revealed in the Intercept earlier this year, Jake Sullivan, then Clinton’s deputy chief of staff, celebrated the sale to Saudi Arabia of more than 80 Boeing F-15SA fighter jets – “ along with upgrades to the pre-existing Saudi fleet of 70 F-15 aircraft and munitions, spare parts, training, maintenance, and logistics ” – with the heading addressed to Clinton, “ FYI — good news .” \\nGood news – at least for Clinton, Saudi Arabia, and ISIS. And evidence of the cozy love-in doesn’t stop there. Ever wonder what a Clinton administration’s top priorities will be? Jobs? Healthcare? Education? More like arming ISIS. A top Clinton aide described a $60 billion weapons transfer of fighter jets and helicopters to Saudi Arabia as a “ top priority .” \\nSaudi Arabia is the largest customer of U.S. military sales in the world with “ active and open cases valued at approximately $97 billion ,” according to a White House fact sheet that championed the U.S.’ strong relationship with the terror-sponsoring state. \\nMedia blackout \\nEven in a period of America’s history in which mainstream media repeats what one of the most powerful political dynasties in the country keeps on repeating to exhaustion – accusing Russia of “rigging” the U.S. election without offering any proof to back their claims – it is still astonishing that major outlets are refusing to report on this story. \\nIs it that Qatar’s and Saudi Arabia’s funding of ISIS – while funding their favorite American candidate at the same time – is a difficult issue to report on? Or is the gutless and hopelessly biased media’s refusal to cover this topic rooted in fear that thoroughly addressing it will cause her to lose the presidential election? \\nThe press have given Clinton a free ride in this campaign. By failing to live up to their duties in a functioning democracy, the fourth estate have played their part in erecting a demon. Unencumbered by the law, unscrutinized by the media, Clinton will wield a dictator’s authority.\""}, "time": 1742562342.3637815}