{"duration": 0.02276778221130371, "input_args": {"text": "'Swedish Health Agency Rejects “Science” of Shaken Baby Syndrome \\nHealth Impact News Editor Comments \\nAs we have previously reported here on Health Impact News, U.S. courts are increasingly becoming skeptical of the “science” behind the pediatric medical diagnosis of “shaken baby syndrome” (SBS) which has been used to take many thousands of children away from their parents, and in some cases incarcerate the parents based on the SBS designation. Just recently, the University of Michigan’s Innocence Clinic, part of the University’s law school, was awarded $250,000 to train attorneys to fight wrongful shaken baby syndrome convictions. See: \\nThis week, the Swedish Council on Technology and Social Evaluation and the Swedish National Medical Ethics have also come to the conclusion that the “science” behind SBS is very weak. Shaky evidence of shaken-baby syndrome \\nDH.se \\nExcerpts: \\nThe diagnosis of “shaken baby syndrome” has previously been questioned both medically and legally. Now comes the SBU and Smers investigative report that argues that the evidence of skakvåld does not measure up. \\nThe Swedish Council on Technology and Social Evaluation and the National Medical Ethics have jointly investigated the scientific basis for the diagnosis skakvåld to infants or in English “shaken baby syndrome”. \\nAfter reviewing the scientific literature, explains the SBU and Smers report, there is not sufficient scientific evidence to establish that the typical damage is certainly caused by skakvåld. Skakvåld challenged in the Supreme Court \\nThe SBU and Smers investigation comes as a result of the diagnosis skakvåld being questioned, especially in law. \\nIn 2014, the Supreme Court concluded that the scientific evidence was not strong enough to judge anyone after a diagnosis of skakvåld. This was after experts testified that the children’s symptoms just as well have been caused by birth trauma and not skakvåld. Several parents have subsequently cleared of suspicions that have harmed their child with skakvåld. \\nComment on this article at MedicalKidnap.com. \\nSee Also: Child Abuse Pediatricians: An “Ethically Bankrupt” Profession that Destroys Families Support the cause of Medical Kidnapping by purchasing our new book! If you know people who are skeptical and cannot believe that medical kidnapping happens in the U.S. today, this is the book for them! Backed with solid references and real life examples, they will not be able to deny the plain evidence before them, and will become better educated on this topic that is destroying the American family. 1 Book – 228 pages'"}, "time": 1742628545.1825826}