{"duration": 0.06919717788696289, "input_args": {"text": "'Two senior White House officials suggested on Monday that President Trump’s unsubstantiated claim that President Barack Obama had tapped his telephone was not meant to be taken literally, arguing that Mr. Trump had been referring more broadly to a variety of surveillance efforts during the 2016 campaign when he made the incendiary accusation. “He doesn’t really think that President Obama went up and tapped his phone personally,” said Sean Spicer, the White House press secretary. In fact, Mr. Spicer said, when Mr. Trump charged in a Twitter post last weekend that Mr. Obama “had my ‘wires tapped’ in Trump Tower,” he was referring generally to surveillance activities during the 2016 race  —   not to an actual telephone wiretap. “The president was very clear in his tweet that it was, you know, ‘wiretapping,’” Mr. Spicer said, using his fingers to make a gesture suggesting quotation marks. “That spans a whole host of surveillance types of options. ” Mr. Spicer said there have been “numerous reports from a variety of outlets over the last couple months that seemed to indicate that there has been different types of surveillance that occurred during the 2016 election. ” The remarks were the first time the White House sought to explain the accusation Mr. Trump made in a series of posts on Twitter saying Mr. Obama “was tapping my phones” and calling the former president a “bad (or sick) guy. ” The explanations came as the Justice Department asked the leaders of the House Intelligence Committee, who had given a Monday deadline to produce proof of Mr. Trump’s claim, for more time “to determine what if any responsive documents exist. ” Kellyanne Conway, Mr. Trump’s senior adviser, said in an interview on Sunday that Mr. Obama could have employed any number of devices other than a traditional telephone wiretap, even including a microwave oven. Ms. Conway clarified on Monday that she was not accusing the former president of snooping via a kitchen appliance, arguing that her comments had been taken out of context. “I’m not Inspector Gadget,” she said Monday on CNN. “I don’t believe people are using the microwave to spy on the Trump campaign. ” But in an interview with a columnist for The Record of Bergen County, N. J. the day before, she said Mr. Obama’s alleged spying efforts against Mr. Trump could have been far more extensive than a telephone wiretap. “What I can say is there are many ways to surveil each other,” Ms. Conway told the paper. “You can surveil someone through their phones, certainly through their television sets  —   any number of ways. ” Surveillance can even be carried out with “microwaves that turn into cameras,” she added. “We know this is a fact of modern life. ” The unusual and shifting explanations from Mr. Spicer and Ms. Conway reflected the contortions that members of Mr. Trump’s inner circle have employed to explain the president’s explosive accusation, which he has yet to address personally. Neither Mr. Trump nor anyone at the White House has presented any evidence for the claim, instead asking Congress to investigate it as part of its inquiry into Russia’s interference in the presidential election. Both the House Intelligence Committee and the Senate Judiciary Committee have requested that the Department of Justice provide evidence it may have for Mr. Trump’s charge, but Mr. Spicer said on Monday that the president had not instructed the department to furnish any. He suggested that Mr. Trump had relied on multiple news reports, including in The New York Times, to make his charge. “It is interesting how many news outlets reported that this activity was taking place during the 2016 election cycle, and now are wondering where the proof is,” Mr. Spicer said. The Times and other news outlets have reported extensively on surveillance in the United States during the 2016 presidential campaign, particularly related to Russia’s efforts to influence the election. But The Times has never reported that intelligence or   officials were themselves spying on Mr. Trump. What The Times and other news organizations have reported is that American intelligence agencies have communication intercepts that officials believe show contacts between associates of Mr. Trump and Russian officials during the campaign. Still, several   websites, including Infowars, which traffics in conspiracy theories and whose eccentric operator, Alex Jones, has interviewed Mr. Trump, have erroneously asserted that The Times and others had reported that the president was under surveillance. In a story dated March 6, Infowars cited a Jan. 19 article in The Times detailing how American law enforcement and intelligence agencies were examining intercepted communications as part of a broad investigation into possible links between Russian officials and Trump associates. “Flashback: NYT admits wiretaps used against Trump,” the headline read. The story noted that The Times “didn’t specifically mention that Trump himself, or Trump Tower, was bugged,” but the caveat has not stopped Mr. Trump’s supporters from insisting that The Times was a source for the president’s tweet. Ms. Conway told CNN that in her interview, she had not been referring to the president’s charges when she talked about microwave surveillance, nor could she offer any proof of his allegations. “I’m not in the job of having evidence,” she said. “That’s what investigations are for. ” Ms. Conway said she had never meant to imply that Mr. Obama had used a microwave to spy on Mr. Trump.'"}, "time": 1742562292.038789}