{"duration": 0.06358146667480469, "input_args": {"text": "'\\nAs we draw closer to election day, polling data, rigged or not, certainly seems to indicate that the presidential race is tightening. In fact, just last weekend ABC released a poll that drew huge media attention on the Sunday talk show circuit as it showed Hillary opening up a 12-point national lead. Now, just a few days later, that exact same poll shows only a 5-point lead. That data seemingly proves one of two things, either the polls are indeed “rigged” to show a desired outcome or the daily drip of WikiLeaks emails is finally starting to take a toll on the Clinton campaign. \\nBut the ABC poll isn’t the only one tightening with most of the recent polls from the Real Clear Politics average showing only a modest lead for Hillary.\\n\\nA similar tightening of the polls is occurring in Florida…\\n\\nAnd even in Michigan, which has been a long-time democrat stronghold.\\n\\nAs The Hill points out, the damage from the daily barrage of WikiLeaks dumps may be finally starting to take their toll on voters.\\nHillary Clinton has failed to effectively contain the damage from the release of thousands of campaign chairman John Podesta’s personal emails, giving new ammunition to Republican presidential nominee Donald Trump.\\nThe fallout from the daily releases have raised concerns among Democrats that even if Clinton is elected president, the controversy will follow her into the White House. \\nAnyone with an Internet connection can dig into the thousands of pages of emails , which have revealed infighting among Clinton’s top advisers, as well as new details about the millions of dollars flowing into the Clinton’s charitable foundation and personal bank accounts.\\nMeanwhile, the mainstream press, after seemingly concluding that this race is a done deal, has finally decided they can no longer ignore the Clinton scandals.\\nCNN’s Jake Tapper called the Wikileaks revelation around Brazile “horrifying.” \\n“Let me go to bottom line: There is no way under any circumstance the Clinton Foundation should not be operating if she becomes president,” Chuck Todd, moderator of NBC’s Meet the Press, told WGN Radio in Chicago on Thursday. “I just don’t see how they can keep that going.\\n“She’s got an opportunity, again, if she doesn’t do half measures here, if they shut it down to at least limit the political damage,” he said.\\nEven Chris Matthews, who famously got the “thrill up his leg” listening to Obama speak back in 2008, admits that the “thrill is gone” with Hillary who will bring in “train loads of contributors” and “charge them by the hour” to sit in the Lincoln bedroom. \\n“People don’t change because we swear them into the White House. They become that person big-time. And the Clintons were raising money like this hand over hand, hand over fist, back in 1996, using—we called it Motel 6. They were hoarding them in, pulling them in by train loads of contributors and then letting them sit in the Lincoln bedroom for a while and charging them by the hour. You can still vote for Hillary Clinton, but remember, you’re getting this as part of the package, because that’s been their pattern.” \\nAnd, the Trump campaign will continue to hammer on the daily WikiLeaks dumps through election day.\\n“The more e-mails Wikileaks releases, the more the lines between the Clinton Foundation, the Secretary of State’s office, and the Clintons’ personal finances are blurred,” Trump said at a campaign stop in Ohio on Thursday.\\n“If the Clintons were willing to play this fast and loose with their criminal enterprise when they weren’t in the White House, just imagine what they will do if they are given the chance to use the Oval Office to pad their pockets.” \\nOf course, with 11 days left until the election there is still plenty of time for new scandals…somehow we suspect the surprises aren’t over.\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Zero Hedge of www.zerohedge.com . '"}, "time": 1742563965.079239}