{"duration": 0.8360581398010254, "input_args": {"text": "'The New Republic Mon, 04 Apr 1994 13:56 UTC You see a girl walking down the street. You can say, \"There goes a beautiful girl\" or \"There goes a whore.\" What the hell\\'s the difference? They\\'ve both got legs. ~ Jon E.M. Jacoby, executive vice president of Stephens Inc., explaining the Arkansas system of politics and finance as it reached perfection during the Clinton years Part 1 © Unknown In Arkansas, the latest backstairs of the national political system, you hear a lot of things. Concerning Whitewater, for example, you are constantly-- and probably correctly--reminded that the dustup involves nothing but a typical loony tunes savings & loans deal from the 1980s, despite the august personages involved and their perplexing insistence on behaving like refugees from a Raymond Chandler novel. In Arkansas memories are long, political rascality is king of regional sports and rumor and truth tend to commingle until otherwise reasonable people are driven slightly bonkers trying to sort out one from the other. In Little Rock the whole Whitewater affair is regarded as something of a hoot--the Yankee carpetbagger press, with the reality of Arkansas staring it in the face, has gone and missed the real story again. But if Whitewater was nothing but a minor peccadillo that the press has glommed onto because it thinks it understands it--and compared with the private financial shenanigans of Arizona Governor Fife Symington, Whitewater resembles a misdeed along the lines of crossing the street against the light-- why, then, has the Clinton administration so frantically placed its back to the door, as though a peek beyond would reveal grandpa tied to a chair, surrounded by his looted bank books? In Arkansas the answer to this question eerily resembles the epitaph on the tombstone of Sir Christopher Wren: if you would see Clinton\\'s monument, look around. When it comes to Bill Clinton\\'s home state, the national press has repeatedly looked, seen everything and observed next to nothing (the honorable, largely ignored exception being the Los Angeles Times ). Visiting Little Rock in search of atmosphere during the presidential campaign, reporter after reporter dutifully described the imposing Stephens Building, the elegant Capitol Hotel, the Worthen Bank tower and the headquarters of Arkla Petroleum, future White House Chief of Staff Mack McLarty\\'s gas company, without realizing that all of these things were either owned, controlled or under the influence of a single, immensely powerful family: the Stephenses . By a happy chance, the family is also the stellar client of Hillary Rodham Clinton\\'s old employer, the Rose Law Firm . Although it usually served as a hired gun with a conveniently blind eye, Rose proves to be a handy prism for observing a Gothic, sometimes darkly humorous tale of bonds, banks, a friendly cocaine distributor, sinister Pakistanis, shadowy Indonesians and the uses to which an agreeable state government can be put. The story is in fact three connected stories, combined in a typically Southern saga: Stephens Inc. and the Worthen Bank Corporation; the Rose Law Firm itself; and the Arkansas bond business, which, like most bond businesses, is extremely difficult for the well-educated layman to understand, thus making it an excellent place to hide things in plain sight. Central to the story is a pair of siblings named Witt and Jackson Stephens. Part 2 In one sense, nothing unusual occurred in Arkansas during the 1980s: tales of high jinks in high places have always figured prominently in American discourse, and some of the most colorful stories--a number of them actually true--have come out of the Bubba Belt of the South and Southwest, whose geographical heart happens to be occupied by Arkansas. But Arkansas is rendered sui generis by the presence of the only major investment bank not headquartered on Wall Street, Stephens Inc. of Little Rock, which does much to explain some of the arresting peculiarities of a state that is more than a little strange even when judged by the spacious standards of its region. For one thing, although Arkansas is the home to some of the nation\\'s wealthiest families, it is one of the poorest states in the country , although there is no reason for it to be poor at all. Abundantly endowed with minerals, petroleum, timber and some of the most fertile agricultural land on the surface of the planet, it bears a close resemblance to a Third World country, with a ruling oligarchy , a small and relatively powerless middle class and a disfranchised, leaderless populace admired for its colorful folkways, deplored for its propensity to violence (on a per capita basis, Little Rock has one of the highest murder rates in the nation) and appreciated for its willingness to do just about any kind of work for just about any kind of wage. In the words of one local wag, the farther you get from Arkansas, the better the Stephens boys look. Indeed, the family\\'s sanitized, Horatio Alger- like biographies have been featured, accompanied by a remarkable lack of examination, in publications as various as Forbes and Golf Digest . The dynasty\\'s founder, Witt Stephens, together with his younger brother by sixteen years, Jackson, grew up on a hardscrabble farm near the town of Prattsville, the sons of a small-time speculator in oil stocks and sometime state legislator, A.J. Stephens, who remained a power in state Democratic politics until the end of his life. An eighth-grade dropout, Witt first made his living by peddling Bibles and belt buckles before he discovered a pair of bonanzas in undervalued, Depression-era municipal bonds and the natural gas with which Arkansas is so richly endowed. Meanwhile, Jackson briefly served as a page with his father in the state legislature and went on to become a classmate of future president Jimmy Carter at the Naval Academy, a circumstance that would later serve the family\\'s fortunes well while causing a disaster of still unmeasured magnitude in the American banking system. After World War II the brothers joined forces at Stephens Inc. in Little Rock, with Witt--or Mr. Witt, as he came to be known--serving as the company\\'s colorful, cigar-chomping and aphoristic face to the world (or as much of the world as paid attention) while the taciturn Jack toiled away in the back office, revealing a golden touch at investment strategy. These things are relative, of course; by the time Witt (who died in 1992 at the age of 83) handed over the reins to Jack in 1957, while retaining his petroleum interests and serving as the presiding genius of the firm, Stephens Inc. was worth a beggarly $7.5 million. But in the Arkansas of 1957, a financial institution with $7.5 million had the money and the clout to do a number of things--including purchase a governor. Witt, like his father before him, was a staunch hereditary Democrat, a supporter and friend of such Arkansas luminaries as Senator William Fulbright. He was also a great patron of the infamous, six-term Orval Faubus--not, apparently, because of the governor\\'s segregationist policies (to the family\\'s credit, Jack Stephens, a trustee of the University of Arkansas since 1948, had successfully lent his voice to the cause of integrating the institution), but because Faubus was sound on the subject of natural gas, a subject dear to the Stephens\\' heart. As the family\\'s fortune continued to wax after the Faubus years, it became an axiom of Arkansas politics that someone could occasionally become governor without permission from Stephens headquarters, but the politician was unlikely to remain governor for very long unless he paid close attention to the care and feeding of the brothers-- the great exception to the rule being two-term Republican Winthrop Rockefeller, the beneficiary, representative and broken reed of an even vaster American fortune, who became the failed hope of Arkansas liberalism. Decades later, when the self-effacing Jack became chairman of the Augusta National Golf Club in Georgia, naive visitors were quickly enlightened on the subject of how a man so shy could assume a post so prominent in the sport of the moneyed and the gently bred. \"Jackson Stephens?\" it was explained. \"He\\'s the man who owns Arkansas.\" It was with Jackson Stephens at the helm that Stephens Inc. propelled itself into the stratosphere of the American financial plutocracy, making a bewildering variety of investments in enterprises as various as real estate, hazardous waste incineration, data processing, nursing homes, trucking and airplane maintenance, while simultaneously diversifying into the business of underwriting issues of common stock. In its new role, the firm called on the services of young C. Joseph Giroir, the only trained securities lawyer in the state, and his paralyzingly respectable firm, Rose. The securities business, in turn, led to a chain of peculiar events beginning in 1977 (the year, it so happened, that Bill Clinton became Arkansas attorney general and that Rose hired his wife). That year, no less a figure than T. Bertram Lance appeared on the corporate doorstep of his old friend\\'s classmate, bringing with him a load of troubles and a glittering opportunity. Lance was compelled to resign as head of Jimmy Carter\\'s Office of Management and Budget because of his long history of questionable financial practices in Georgia. As a result of that history, he was also beset by a negative net worth, substantial loans from banks in Chicago and New York and a large stockholding in the National Bank of Georgia. Sadly for Lance the price of the bank stock was depressed and its sale on the open market could not rescue him from the specter of bankruptcy, which was the dilemma Stephens Inc. was invited to solve. A solution was soon found in the form of the now notorious Bank of Commerce and Credit International (BCCI) , although whether Lance introduced Stephens to the Pakistani-run scam or vice versa is a matter of some debate. Beyond dispute, however, is the fact that the comptroller of the currency, the nation\\'s principal regulator of commercial banks, had clearly stated that BCCI was never to enter the American banking system under any circumstances. Oddly, this unambiguous order did nothing to prevent Stephens Inc. from solving Lance\\'s problems while settling a small score of its own. The National Bank of Georgia was controlled by a holding company called Financial General, one of the few entities in the country allowed to engage in interstate banking under the laws of the time. The Stephens interests controlled slightly less than 5 percent of Financial General and the investment had soured, partly because Financial General refused to hire the family\\'s data processing company. It was, Stephens soon persuaded BCCI, just the sort of investment BCCI was looking for, the comptroller\\'s edict notwithstanding. Comment: BCCI was pretty much the global (not \\'Pakistani\\') financial instrument that got the Western \\'war on terror\\' up and running, funneling weapons to terrorists via payments of hard drugs, prostitutes and cash. In short order, Stephens launched Lance on the path to renewed solvency, assembled blocks of stock for purchase by the front men who would conceal BCCI\\'s identity, effected an introduction to the subsequently disgraced Democratic wise man Clark Clifford, turned a small but tidy profit on the sale of its own shares, pocketed fees of at least $95,000--and, in return for a sum that in Stephens terms amounted to chump change, set in motion the process that would give BCCI its long-sought beachhead in the American financial community. When subsequently confronted with its BCCI involvement by the Securities and Exchange Commission, Stephens Inc. neither admitted nor denied the sec\\'s findings but promised to go and sin no more. But BCCI was not the only exotic party attracted by Lance\\'s bank holdings. Also appearing on the scene was Mochtar Riady, one of the wealthiest men in Indonesia, with far-ranging interests and a known connection to his country\\'s dictator, General Suharto . When someone went into business with Riady, there was also the possibility that they were in business with the general, a fairly decent chap by dictatorial standards (he had begun his reign with the slaughter of 200,000 supposed Communists, a feat he had not found necessary to duplicate except on the island of Timor) but a tyrant nonetheless. Stephens Inc., which appeared to be uninterested in the true activities of BCCI, exhibited a similar indifference when it came to Riady. Moreover, the Stephens people did not appear to be the least bit curious about the business endeavors of the distinguished former statesman who effected the introduction between Jakarta and Little Rock. This was Robert B. Anderson. Formerly a secretary of the treasury in the Eisenhower administration, Anderson had carried out diplomatic assignments for President Lyndon Johnson in the Middle East and had served as President Richard Nixon\\'s chief negotiator in the Panama Canal talks before opening an offshore bank--Commercial and Trade Bank and Trust Ltd. on Anguilla--that catered to people who needed to launder money, evade taxes, or both. Jack Stephens had willingly presided over the handoff of a big hunk of an American bank to a bunch of Pakistani thugs, but he was not willing to let Riady go so easily. \"He wanted to buy into an American bank, an idea I was not enthusiastic about,\" Stephens told an interviewer some years later, perhaps making an unconscious semantic distinction. He\\'d seen nothing wrong with selling BCCI an American bank--they even named it First American--but he and Riady soon began planning an entirely new kind of Arkansas bank holding company, for which they required the services of Giroir and his expertise in securities law. But they also needed something that increasingly became a hallmark of the Rose firm: a willingness to perpetrate a subtle conflict of interest. Founded in 1820, well before Arkansas became a state, Rose is one of the oldest surviving law firms west of the Mississippi, one of the most competent and one of the most quietly influential. Often, in looking at the state government of Arkansas, the Rose firm and the Stephens interests, it is hard to escape the impression that one is looking at a single entity, rather along the lines of NATO. The law partnership takes its curious name from U.M. Rose, a talented attorney who dominated the firm from the mid-1860s to the end of the century, was one of the founders of the American Bar Association and is one of two Arkansans whose statues adorn the Capitol in Washington. Over the years Rose has provided Arkansas with numerous legislators and justices of the state supreme court. In 1957, when the modern civil rights era was born in Governor Faubus\\'s refusal to integrate Little Rock\\'s Central High, it was a Rose lawyer who acted as lead counsel to the school board. (Rose still has no black partners.) And from 1975 until 1988 the firm enjoyed a spectacular run--growing from seventeen lawyers to fifty-three--under the leadership of the dapper and charming Giroir, the first and only chairman in the history of Rose, who deeply entwined the partnership and his personal destiny in the affairs of the Stephens family\\'s empire. During the Clinton administration, the history of the Rose firm could be divided into two periods: the Giroir years, and the shorter period, from 1987 to 1992, when the firm claimed to be a democracy, voting on its future rather than blindly following a single, charismatic leader. This democracy, however, was publicly dominated by three partners: the amiable Webster Hubbell, who was until a few days ago associate attorney general; the quiet Vincent Foster, who was deputy White House counsel until his suicide last summer; and Hillary Rodham Clinton, who as of press time is still First Lady. The firm\\'s sea change, which generated a certain amount of hoopla from the legal press, was more apparent than real. Under the surface, Rose was much the same as always, doing good for its friends and clients while doing well for itself, but much more silently. In his years as Rose\\'s chief, Giroir conspicuously chaired a group drawn from the state\\'s so-called Good Suit Club. The club successfully lobbied the legislature to change the state usury law, which made owning an Arkansas commercial bank a much more attractive proposition. It also was active in convincing the state\\'s lawmakers to revise the law restricting the formation of bank holding companies, which enabled Giroir, Riady and Stephens to make a substantial and potentially lucrative investment. On his own, Giroir had purchased control of four Arkansas banks. He sold all four--including the second-largest bank in the city of Pine Bluff--to Worthen Banking Corporation, the new holding company Riady and Stephens had been able to set up after state law, with Giroir\\'s help, had been made more congenial to such things. For his part in the deal, Giroir was compensated with $53,760,294 in cash, stock and assumed debt. He also became a major stockholder of Worthen (named after the venerable and very large Little Rock bank that was the pride of the Stephens commercial banking empire) and a powerful member of its board. He received further income by renting property to the company, and he pocketed an additional $2.1 million when he sold part of his stockholdings to a company affiliated with Riady\\'s son James (who was also Worthen\\'s co-president). More important, he managed to create a whole new client for his firm; Rose became Worthen\\'s principal outside counsel. These things are complicated, dull and dry, which is an excellent form of concealment, but consider the sequence of events. With the stroke of a pen and without a visible second thought, then-Governor Bill Clinton, following his traumatic period as a voter-rejected civilian between 1980 and 1982, gave life to two pieces of legislation inspired by his wife\\'s boss--revising the usury laws and permitting the formation of new banking holding companies. In a state as small as Arkansas, where everybody of importance knows everybody else, it seems impossible that Governor Clinton could not have known that the relevant legislation would be of immense personal benefit to the boss in question, the state\\'s most powerful family and an Indonesian investor whose presence in Arkansas seemed to be regarded as the most natural thing in the world. Last and not incidentally, the governor, by permitting the creation of the Worthen Bank Corporation, had arranged a new payday for the Clinton family through the windfall in legal fees provided to the Rose firm (Hillary Rodham Clinton, partner). When the compensation of the firm\\'s partners was computed, Rodham Clinton has insisted, she specifically exempted herself from receiving a share of Rose\\'s business with the state. But although Worthen could not have been brought to life without the help of her husband\\'s government, it was not a government agency. Rodham Clinton was therefore not excluded from a partner\\'s share of its fees. More important, Worthen also became a major depository of the state\\'s tax receipts. Nothing unusual here; governments frequently park their undeployed funds with large private banking institutions until they decide what to do with the money. But the results soon proved to be imprudent under the most charitable interpretation of the word. In 1985 Worthen Bank managed to lose $52 million of Arkansas state taxpayers\\' money in a purchase of government securities from a New Jersey brokerage with a questionable past and no future whatever; several of its principals ended up in jail for fraud. With its capital wiped out in a single stroke and a seizure by federal regulators imminent, Worthen was swiftly rescued with a $30 million cash infusion from its major stockholders, in the form of a loan that paid the Stephens partners a handsome 10 percent--together with additional funds from Stephens Inc., which pocketed a $3.2 million fee for its trouble. (The risk, in true Stephens fashion, was not great. Two-thirds of the funds were swiftly replaced by Worthen\\'s insurance company, which made Stephens Inc.\\'s noble rescue of the bank--and of a big hunk of the Arkansas treasury--an almost surefire, profitable investment.) Also conspicuous during the complex negotiations were Joe Giroir and his partner Webb Hubbell, appearing in their capacity as members of Rose. Two questions surround this incident. First, how could Worthen have allowed the state to make such an obviously tainted investment via the New Jersey brokerage firm? Second, and more important, why did nobody in Arkansas appear before the bar of justice? The New Jersey firm was a direct lineal descendent of a peculiar regional phenomenon: the world of so-called bond daddies. The bond-daddy racket, long centered in Memphis but with many of its members drawn from Arkansas, specialized in selling questionable government securities to gullible investors, principally small banks with little financial sophistication. Here is where the oddity begins, at least as it concerns Worthen. The Stephens brothers, if not Giroir and Riady, were intimately familiar with the black arts of finance. They were also experts in the government bond market. Moreover, at least one of the principals in the New Jersey brokerage of Bevill, Bresler & Schulman Inc. (which executed the transaction for Worthen and the state of Arkansas) was well-known in the region. Bevill\\'s operations had all the earmarks of a standard bond- daddy scam, and yet Worthen committed $52 million anyway. (At the bank, the official explanation was that co-president Jim Jett acted naively, on his own and without the supervision of his principal stockholders, which is possible but not entirely plausible, since Giroir, who represented the Stephenses, sat on the board.) Consider a virtually identical event at the same time in Ohio, in which a savings bank controlled by Marvin Warner, Jimmy Carter\\'s ambassador to Switzerland, invested in the same kind of fraudulent securities, destroyed itself, ignited a statewide financial panic and caused Governor Richard Celeste to declare the first Ohio bank holiday since the Great Depression. A number of the responsible parties, including Warner, found themselves behind bars, some for a very long time. Why? Under long established Anglo-American law, an officer or director of a bank is governed by the \"prudent man\" rule, which states that he is personally responsible for the financial and legal consequences of his acts. In Arkansas, where the prudent man rule seems to have been suspended, a number of people were fired, but the Clinton government hauled precisely no one into court on criminal charges. Once again in Clinton\\'s Arkansas, the law seemed to be different than it was in the rest of the United States--which makes certain Arkansans smile in knowing amusement over the fact that Bill Clinton now happens to be running the United States . Part 3 The near failure of Worthen in 1985, like the arrival of BCCI, proved to be another pivotal event in recent Arkansas history: Stephens, Worthen, Rose and the Clintons remained at the center of the stage, but the cast of supporting players began to change. A former Stephens executive named Ray Bradbury, who had been deeply involved in the bcci negotiations--hardly a job qualification, one would think--took the helm at Worthen, where he discovered that the bank was also stuffed with bad real estate loans. Meanwhile, federal regulators learned that the bank had made an excessive number of insider loans, particularly to the Riadys, although what happened next is, as usual, a matter of mutually exclusive explanations. Knowledgeable observers in Little Rock and elsewhere say that the Riadys were slowly forced out of the bank by the federal government; at Worthen, the official version says that the Riadys disengaged because it was clear the troubled bank could not be a major force in international finance. In any event, the Riadys soon departed. The role of Joe Giroir also underwent a change. As a principal owner of Worthen, he was charged with securities fraud in a shareholder suit; he was also sued by Worthen itself for taking illegal \"short-swing\" profits when he sold stock to the Riady affiliate. Not only did Giroir lose his board position and partial ownership of the bank--with Giroir and Riady out of the picture, the Stephenses gradually increased their stockholding to more than 40 percent, while stoutly denying they controlled the place--but, following Giroir\\'s disgrace in 1988, Rose lost Worthen as a client that had once paid the firm hundreds of thousands of dollars per year. As for Giroir, his troubles were far from over. In 1986 he was revealed to be a shareholder in and a substantial borrower from a Pine Bluff thrift called FirstSouth, the first billion-dollar savings & loan failure in the country . Comment: Isn\\'t that curious; the first S&L bust happened under the Clintons\\' watch. Before the dust had cleared, the head of FirstSouth had gone to jail together with a former president of the Arkansas Bar Association, and Giroir had sued the federal regulators while the federal regulators were suing him, putting a considerable crimp in the plans of his partners, Hubbell and Foster, to create a lucrative practice in the cleanup of the s&l crisis. (At failed s&ls, the fees for firms like Rose could be enormous. According to one frustrated federal investigator, private lawyers in Dallas were making $500,000 per month from the thrift catastrophe, more than the total annual budget for the federal cleanup effort in the entire state of Texas--and in Arkansas, where lawyers were cheaper, the damage per capita was among the worst in the country. Somehow, Governor Clinton escaped criticism for this interesting fact.) It was clear that Joe Giroir, who had built the modern Rose Law Firm, was now the partnership\\'s greatest liability--the firm\\'s reputation aside, federal regulators charged that Giroir had used Rose letterhead to give FirstSouth legal advice beneficial to himself; Rose was forced to settle with the Federal s&l Insurance Corporation regulators for a reported half-million dollars--although once again there is a contradictory official version of his abrupt departure. Giroir once claimed that he left the firm voluntarily but will no longer comment on the matter. The Rose firm fell abruptly silent on this and all other subjects following recent allegations that it had shredded its Whitewater files, but its spokesman told American Lawyer in 1992 that Giroir departed in a coup arranged by litigators who were miffed that he and the firm\\'s other rainmakers were paid substantially more than the lawyers who actually did the scut work in court--litigators prominently including Hubbell, Foster and Rodham Clinton, who actually seemed to be engaged in very little legal work at all. With the departure of Giroir, life at Rose became quieter if no less active. The three partners became the firm\\'s public face to the world. The most physically imposing and locally active of these was Hubbell, a six-foot, five- inch giant of a man who had played football for the University of Arkansas, had almost made it into the big time with the Chicago Bears, had served briefly as mayor of Little Rock (when Rose received a significant portion of the city\\'s bond business) and had received an interim appointment as chief justice of the Arkansas Supreme Court from Governor Clinton. (According to a reliable source, Hubbell\\'s father-in-law, Seth Ward, a septuagenarian self-made entrepreneur, once complained that keeping Hubbell in politics cost him $100,000 a year.) The second was Foster, once described as an immaculately brown-suited man in an immaculate brown office, who was regarded as the \"soul\" of a firm that, according to grand jury testimony, shredded volumes of his records the moment an independent federal prosecutor appeared in the vicinity . The last was Rose\\'s first female partner, Rodham Clinton, who occasionally did some lawyering in the intervals when she wasn\\'t working for the Children\\'s Defense Fund, attending to her personal business affairs or serving as the governor\\'s first lady. The three were described to American Lawyer as \"big, big buddies\"; Rodham Clinton\\'s office was next door to Hubbell\\'s, and much of her work was actually done by Foster. Comment: Hubbell is very likely the father of Chelsea Clinton. And Foster, another \\'lover\\', was suicided shortly after he followed Killary to the White House. The three also were closely entwined in a curious financial arrangement. This was Mid-life Investors, a partnership set up by E. F. Hutton in 1983. Hubbell, Foster and Rodham Clinton each kicked in $15,000 and named each other--rather than their spouses--as beneficiaries. But although the fund was active at least until 1991, Rodham Clinton reported annual dividends of under twenty dollars from Mid-life Investors, a sum that comes as a surprise to Roy Drew, the financial counselor who supervised the partnership and invested its money in such 1980s takeover candidates as Diamond Shamrock and Firestone Tire. According to Drew, with the likes of Sir James Goldsmith and the Japanese offering huge sums for the stock of Shamrock and Firestone, there was no way Mid-life Investors could have failed to reap substantial profits. Although Rodham Clinton was a litigator--that is, a lawyer whose task is to appear in court, if only to force the other side to settle--and an attorney who was named one of the 100 most influential in the country by the National Law Journal in 1988 and 1991, she was almost never seen in the courtrooms of Little Rock ; some court reporters remember an occasional appearance, and one could not remember having seen her at all. According to a search conducted by American Lawyer , she tried just five cases during her fifteen years at Rose; other published sources say her work revolved around copyright infringement cases involving songwriters and bread companies. But paradoxically, in view of what happened to Giroir, she (like Giroir) received extra compensation for the business she generated from her extracurricular activities, even if she did not work on the cases at all. For example, she was only one of two Rose partners to act as a corporate director, serving at various times on the boards of four companies and earning $64,700 in 1991 from director\\'s fees alone . (Her 1991 salary from Rose was in the vicinity of $110,000; her husband earned $35,000 and got to live in a free house.) She was on the board of Wal-Mart, a Rose client that Stephens had launched on the road to glory . (Rodham Clinton also owned $80,000 worth of Wal-Mart stock.) She served Southern Development Bancorp, a holding company created to give development loans in rural Arkansas, which, according to The Washington Post , paid Rose somewhere between $100,000 and $200,000 in fees. In 1989 she joined the board of TCBY yogurt company, which occupies the tallest building in Little Rock. TCBY then proceeded to pay Rose $750,000 for legal work during the next few years. Last, and puzzlingly, she was a director of Lafarge, a giant French cement company that had no discernible connection to Arkansas except, like Stephens Inc., it was engaged in burning hazardous waste . (As president, Bill Clinton did nothing to stop operation of an Ohio waste incinerator, partly backed at one time by Stephens Inc., despite the fact that it didn\\'t work, had no legal permit and his own vice president had promised that it would never operate until it was thoroughly investigated, which it wasn\\'t.) Comment: That\\'s the same Lafarge recently caught trading with Head-chopper Inc, ISIS: Paris strikes corporate partnership with Lafarge, who secretly sponsored ISIS for profit and has ties to Killary With Rodham Clinton aboard at Rose, the firm\\'s long established connections to the governor\\'s office were made firmer still. Rose, the gold standard of Arkansas law firms, had long enjoyed unusual access to the state\\'s corridors of power. It both advised and did the bidding of the powerful family that acted as the state\\'s shadow government, and during the Clinton years, the Rose Law Firm sometimes behaved as though it were an agency of the state rather than a legal partnership with offices in a converted YMCA. The intimate connection between Rose, Stephens Inc. and the governor\\'s office may help explain how the Stephens family made a vast amount of money when its most visible enterprises were doing no such thing. The investment bank had hit a gusher when it took Wal-Mart public, made a pleasing sum on the stock of Tyson Foods, the nation\\'s largest chicken processor, but otherwise cut no great swath in the stock market. Until recently, Worthen was a disaster area. At least part of the answer for the family\\'s continued prosperity seems to reside in the unusual way Bill Clinton\\'s state dealt with Stephens Inc.\\'s old specialty, government bonds. Part 4 The crown jewel of Bill Clinton\\'s avowed attempt to create industries and jobs in the state was an unusual entity called the Arkansas Development Finance Authority (ADFA). According to well-established common law, a government-chartered authority is supposed to be an independent body, insulated from the hurly-burly of everyday political life and its temptations. But ADFA, written into law with the help of Webb Hubbell, was no such thing. All ten members of its board were appointed by the governor. Though it was specifically granted the power to issue industrial development bonds, the governor, personally, was required to approve every bond issue. State agencies with the ability to issue industrial bonds are supposed to distribute the money (and thus create jobs and wealth) to companies and individuals who can\\'t receive lines of credit on favorable terms from the usual financial institutions or venture capitalists. On significant occasions, however, ADFA spread its bounty to less than deserving clients. Nor do the peculiarities of this body end here. Although it issued bonds, ADFA did no due diligence--the common practice of engaging an outside financial expert to examine the applicants for the proceeds and determine if they actually need the money and are otherwise worthy recipients. (Due diligence, according to an ADFA spokesman who happens to be the brother-in-law of one of Witt Stephens\\'s daughters, was the responsibility of the purchasers of the bonds under the ancient principle of caveat emptor --a practice that had previously helped the region\\'s bond daddies flourish and had wiped out the capital of the Worthen bank.) While its spokesman is a little fuzzy on the subject, it seems that there was no regular ADFA oversight to ensure that money was being spent according to the original purpose of the loan, although an ADFA employee might occasionally be sent into the field to discover if everything was tickety-boo. It is also somewhat difficult to discover just what ADFA was actually doing. A recent examination of the log kept at ADFA headquarters for the enlightenment of wandering reporters and inquisitive citizens reveals just twenty-five bond issues from 1985 to the present--or twenty-six, if you count the paperwork on a bond issue that was removed in a reporter\\'s presence. Moreover, the log suggests that ADFA was heavily involved in good works with religious orders. But according to the Los Angeles Times \\' count of ADFA\\'s activities, the authority released seventy industrial bond issues--according to my count, the number is sixty-five--none of them to religious charities or university hospitals, and most of them missing from the official log. Which begs the question: Just what was ADFA doing with the $719 million it dispensed (or whose dispensation it authorized) as of January 1992? \"ADFA,\" says Larry Nichols, a dismissed authority official, \"was set up by Clinton for Dan Lasater.\" Now, it should be borne in mind that Nichols is something of an Arkansas character and, in some circles, a figure of fun. A well-known supporter of the Nicaraguan contras, Nichols was also the person who originally alleged that Clinton had an affair with Gennifer Flowers and four other women, only to destroy his credibility when he retracted his charges in a document remarkable for its abject contrition . But there are those in Arkansas who insist that Nichols is neither entirely a vindictive nut nor the sort of notorious regional liar who has to hire a man to call his own dog. \"You ought to listen to Larry Nichols,\" says a Little Rock political consultant. \"He says a lot of things, but sometimes he tells you something you really need to know.\" And, certainly, there is something intriguing about Bill Clinton\\'s relations with Lasater, a man no governor in his right mind would let in the front door. If Dan Lasater was not the largest cocaine user in the state of Arkansas, he was certainly the most conspicuous one. A prosperous Little Rock bond dealer, he was an acquaintance of the Clinton family and a contributor to the governor\\'s political fortunes. Lasater distinguished himself in other ways, too. He served ashtrays full of cocaine at parties in his mansion, stocked cocaine on his corporate jet (a plane used by the Clintons on more than one occasion) and later told the FBI that he had distributed cocaine on more than 180 occasions . \"I shared my success ... in that manner,\" he explained. He was also a patron of Governor Clinton\\'s cocaine-using half-brother, Roger, employing the younger man in his thoroughbred racing stables in Florida and claiming that he gave Roger Clinton $8,000 to pay off debts to drug suppliers . By 1985 it was also known that Lasater was the subject of a police investigation that, even the most uneducated guess would suggest, could end in only one way. But that year, Governor Clinton deemed Lasater worthy of handling a $30.2 million bond issue to modernize the state police radio system, despite the fact that the expenditure would normally be made by an appropriation from the treasury and the fact that Lasater was about to be busted . Nonetheless, Clinton vigorously lobbied the legislature, ignored the wishes of the Stephens family and won the day, giving Lasater & Co. a handsome $750,000 underwriting fee , according to the Los Angeles Times . In 1986 Lasater was sentenced to two and a half years in prison, with Roger Clinton testifying against him at his trial. In 1990 he received a state pardon from Governor Clinton . For whatever it\\'s worth, one of the few people to have access to the office of the late Vincent Foster during the three days it was unsealed following his suicide was White House official Patsy Thomasson, who managed Lasater\\'s business affairs while he was in jail. But in the Clinton system, perfected in Little Rock and now being practiced in Washington, none of these things should be considered a mistake or an aberration. Lasater was not the only strange thing about the Arkansas bond business during the time of Bill Clinton. Whenever a normal state issues bonds, there are many ways for a variety of people to get well on the public nickel. The beneficiary of the proceeds receives a loan at below-market rates. The financial institution that sold the bonds receives underwriting fees. For each bond issue, an outside attorney is engaged to certify that the deal conforms to the law and prepares the documents required by the Internal Revenue Service and the federal treasury. A bank is chosen as trustee for the money, collecting the repayments from the lucky borrowers and making the repayments to the purchasers of the bonds. And the borrower itself almost invariably retains a lawyer. But when one examines the activities of ADFA, a certain pattern emerges concerning at least some of the beneficiaries of Arkansas largess. For example, one of the very first ADFA bond issues provided $2.75 million to POM, a manufacturer of parking meters in Russellville, whose president happened to be Seth Ward II, the brother-in-law of Webb Hubbell. Despite the fact that Hubbell was chairman of the conflicts committee at Rose, he seemed to see nothing amiss in the fact that Rose then collected a fee as adfa\\'s certifying attorney or that he himself served as POM\\'s attorney. Nor did Hubbell seem to see anything unusual in the fact that he was representing the Resolution Trust Corporation in its case against the auditors of Madison Guaranty, despite the fact that his father-in-law, the senior Ward, had not repaid millions in loans from the thrift, or that Ward had received an airplane from Madison in the bargain. Between 1985 and mid-1992 Stephens Inc. was involved in the underwriting and sale of 78 percent of ADFA\\'s housing and industrial bonds, an unsurprising figure considering the firm\\'s familiarity with the market and its clout in the state. Still, considering Stephens\\'s involvement in the authority\\'s affairs, Governor Clinton did not appear to feel that it was ever so slightly wrong to appoint two Stephens associates--a vice president of one of Worthen\\'s banks and a vice president of a chain of nursing homes partly controlled by the Stephens empire--to ADFA\\'s ten-member board. Nor did the man who signed off on every single ADFA bond issue exhibit suspicion when Stephens seemed to be supplementing its brokerage fees by helping itself to ADFA\\'s money in the form of favorable loans. Meanwhile, at least another member of the board, the vice president of Twin Cities Bank, an institution that served as trustee in one of ADFA\\'s tangled deals, appeared to take a similar double-dip. And the governor\\'s wife\\'s law firm was not only receiving a healthy chunk of ADFA\\'s legal business, but Rose apparently found nothing wrong with affiliates of Stephens receiving ADFA money, or with the fact that on not one but two occasions, ADFA issued bonds that benefited the relatives of Rose partners. In 1988 and 1989 ADFA lent a total of $1.37 million to the Pine Bluff Warehouse Company. Rose received $22,321 in legal fees from ADFA. The trustee bank was Worthen\\'s National Bank of Commerce in Pine Bluff, whose vice president sat on the ADFA board and whose chief executive officer was not merely a member of Pine Bluff Warehouse\\'s board but the father of a senior Rose partner, William Kennedy III, now associate White House counsel. Stephens, unsurprisingly, underwrote the bonds. In 1989 ADFA loaned $4.67 million to Arkansas Freightways, whose largest outside stockholder was Stephens Inc. Co-counsel on the bond issue was Rose. The trustee bank\\'s executive vice president was a member of the ADFA board. The underwriter was Stephens. Also in 1989 ADFA tried to loan $83 million to a Texas entrepreneur for the purpose of bailing out Beverly Enterprises, the country\\'s largest operator of nursing homes, 10 percent owned by Stephens, whose vice president sat on the ADFA board, at a time when Beverly\\'s stock was being hammered by the company\\'s persistent losses. A swift and decisive halt to the deal was called by Arkansas Attorney General Steve Clark, a rising political star who was expected to be a strong gubernatorial candidate in 1990, and who claimed that a Stephens-Beverly lobbyist had offered him a $100,000 bribe (as campaign contributions, of course) if he would just lay off and let the deal go through. The lobbyist was later cleared by an Arkansas court, but Clark was caught charging personal expenses on his state credit card. His political career in shambles, he was later disbarred. Current reports place him somewhere in the state of Georgia. But these were only the most conspicuously questionable of ADFA\\'s doings, the ones most easily understood by the public and the press. There was also the question of the true extent of Rose\\'s involvement in the authority\\'s bond business. According to the Daily Record , a Little Rock business journal, Rose ranked fourth among the law firms working directly for ADFA, with fees of only $175,000 for the years up to 1991. But not everyone agrees with this assessment. When Frank White, the only man ever to defeat Clinton in a gubernatorial election, tried to repeat the feat in 1986, his campaign claimed that Rose had actually been in on every ADFA deal (for the authority or for the recipient) while Clinton was governor . Unfortunately, the relevant data was assembled under the supervision of White\\'s political consultant, Darrell Glasscock, a former Louisiana state official and a great supporter of the contras ( an occupation that appears to have been an Arkansas cottage industry ). Reached recently by phone, former Governor White, now an officer of Worthen\\'s principal competitor, the First Commercial bank holding company, clearly wishes he had never heard of Glasscock, cheerily questions Glasscock\\'s veracity and pleasantly turns aside any questions about Rose. When a visitor to ADFA asks for the complete documentation on any particular bond issue, he is presented with a thick volume that, if placed on a chair, would allow him to dine with the grown-ups. A small sampling of these volumes reveals an interesting thing: every company examined, including POW, Arkansas Freightways, Pine Bluff Warehouse and Concert Vineyards appears to be eminently creditworthy. These are the sorts of enterprises that could walk in the door of any bank and walk off with any reasonable sum they needed. Why, then--in addition to the mutual back-scratching described above--were they being given loans at below market rates by a desperately poor state with other uses for its money? This question takes added luminosity from the fact that ADFA really didn\\'t work very well. The old Arkansas Industrial Development Commission, started by Orval Faubus, created 90,000 jobs in nine years. And it had no bonding power. After seven years under the Clinton regime and with tens of millions in issued loans, ADFA had created just 2,700 jobs, many at wages significantly below the national standard. This anemic showing obscures the fact that ADFA had yet another purpose: its generosity was returned in the form of campaign contributions for William Jefferson Clinton . According to the Los Angeles Times , in the 1990 race for the governorship, the recipients of ADFA\\'s largess contributed $400,300, nearly one-fifth of the Clinton war chest. They then kicked in with millions more for the presidential race. Outside Arkansas the white-shoe investment bank of Goldman Sachs, which later contributed its co-chairman, Robert Rubin, to President Clinton\\'s inner circle of economic advisers, raised millions for the presidential race and even paid for a substantial hunk of the Democratic National Convention. According to ADFA\\'s incomplete records, Goldman was either the lead or sole underwriter of at least $400 million in ADFA bonds. In addition, two of ADFA\\'s board members were active Clinton fund-raisers, which raises yet another question among many: Wasn\\'t this against the law? For once, the answer is terse and straightforward. Not in Arkansas . Under the Arkansas ethics-in-government act, passed in 1988 and, according to state legislators, either drafted or inspired by Hubbell, state legislators were required to report possible conflicts of interest. Surprisingly, the law specifically exempted the governor and other elected or appointed officials, including officials of state agencies and commissions. Moreover, these officials were not even required to report dealings with entities--such as Rose--that employed their relatives. This was not the only remaining service that Rose had provided to the governance of its state. When the time came to rewrite the state\\'s incorporation laws, it was Rose that drew up the 397-page treatise that formed the basis of the legislation. Well, somebody has to draft a state\\'s legislation, and under Arkansas\\'s unusual ethics law, it was perfectly all right for Rose to do just that. Less clear (if anything in these murky waters can be described as clear) is just why Clinton seemed so eager to assist the Stephens family, which was hardly enamored of the man and kept bankrolling the candidates who ran against him for governor until it experienced a change of heart in 1990. Witt Stephens habitually referred to Clinton as \"that boy.\" In a moment of candor his brother Jack once remarked that \"it would be awfully easy for Stephens, if we wanted to be close to a governor, to be close to Bill Clinton.\" Nonetheless, the Clinton governorship\\'s assistance to Stephens extended well beyond ADFA. During Clinton\\'s years in Little Rock, the Stephens interests were involved in some 61 percent of the $7 billion of all the state bonds issued in Arkansas . Contrary to state law, Stephens Inc., according to the Arkansas Democrat-Gazette , was given the underwriting for the state university system without competitive bids from other bond dealers. The Fayetteville campus alone, where the Clintons had once taught law, had $33 million in bonds outstanding. Under Clinton, Stephens devised a plan to rescue the state\\'s troubled student loan authority, in which the authority\\'s bonds would be bought by the state employees\\' retirement funds. An independent consultant--Roy Drew, the very man who created Mid-life Investors for Hubbell, Foster and Rodham Clinton-- was brought in to examine the deal. Drew thought it was a terrible investment and so did the state\\'s auditor, Julia Hughes Jones. But Drew was dismissed, Jones\\'s budget failed to pass the legislature (the first time ever for an Arkansas state auditor) and she began to receive late-night harassing calls from a collection agency--concerning, ironically, her own daughter\\'s student loan, which was current. In the upshot, the retirement funds bought $100 million of the loan authority\\'s bonds, another $100 million in the bonds of two other state agencies, ADFA was given the task of overseeing the retirement fund\\'s investment policies and Stephens Inc., according to The Philadelphia Inquirer , made $1.8 million. These were very considerable favors to a family that not only bankrolled Clinton\\'s opponents but seemed to despise him as a man. But Bill Clinton\\'s canny instinct that the Stephenses needed to be appeased--rather than ignored--eventually paid off. After Clinton\\'s unexpected loss in the New Hampshire primary, with the campaign coffers bare, the staff paying its bills on their personal credit cards and federal matching funds just beyond reach, the Worthen Bank rescued the candidacy with a prearranged $3.5 million line of credit, selflessly advanced at a lucrative rate of interest. Later, Worthen - whose executives, like many Stephens executives, experienced a spasm of Arkansas patriotism that caused them to reach for their checkbooks - became the Clinton campaign\\'s depository of $55 million in federal campaign funds, which, in effect, was free money. Worthen did not have to pay any interest on this staggering sum, but as long as it was on deposit (and as long as Worthen, with its undistinguished track record in the department of government deposits, managed not to lose it), the bank was free to use it to make itself some money that it got to keep. And when the votes were counted, everybody who wanted to go to Washington got to go to Washington: Bill Clinton and Hillary Rodham Clinton, president and First Lady; Mack McLarty, White House chief of staff; Vince Foster, deputy White House counsel; Webb Hubbell, associate attorney general; Patsy Thomasson, a White House aide. Jack Stephens, though mentioned as a candidate for secretary of the treasury, had, it now seems safe to say, the good sense to stay home. Oh, and one last thing: when Whitewater special prosecutor Robert Fiske--who once defended Clark Clifford, the famed friend of Jack Stephens\\'s old client, BCCI--arrived in Little Rock, something strange happened. Worthen Bank had a fire. Is this a great country, or what? Comment: Yeah, it\\'s a great country if you love giving free reign to your baser instincts. See also:'"}, "time": 1742562145.7107947}