{"duration": 0.14013266563415527, "input_args": {"text": "\"india , russia , indo-russian cooperation Russian President Vladimir Putin and Indian Prime Minister Narendra Modi, right, during their meeting at Taj Exotica Goa, India. Source:RIA Novosti On Oct. 15-16 Russian President Vladimir Putin travelled to India to participate in the annual BRICS summit held this year in Goa. Apart from discussing the future work of BRICS, the Russian leader held talks with India’s Prime Minister Narendra Modi on a wide spectrum of issues on the bilateral agenda. To discuss the results of the talks and the impact of recent military drills on Russia-India relations, Russia Direct reached out to Vyacheslav Trubnikov, member of the board of directors of the Institute of World Economy and International Relations (IMEMO) of the Russian Academy of Sciences, and Ambassador Extraordinary and Plenipotentiary of the Russian Federation to India (2004-2009). He explained why one should not worry about the future of Russia-India relations and shared his view on the closure of Russian media outlets working in Indian languages. \\nWhat is the most important result of the Russian President’s visit to India in the context of Russia-India relations? What was the main takeaway? The key result is the confirmation and further development of the privileged status of Russia’s strategic ties with India. During the visit 20 documents were signed and though, of course, some of them were more important than others, I think that a very serious step forward was made. I wouldn’t say that it is a breakthrough in bilateral relations – it’s rather a gradual development. Vyacheslav Trubnikov. Source: Boris Prihodko/RIA Novosti Today, the scale of our cooperation is growing and the important factor here is that both countries share common approaches to current developments in the international arena. This was expressed in the joint statement titled “ Partnership for Peace and Stability on the Planet .” This is a very important document, which apart from bilateral relations, also helps to form our understanding of how the future polycentric (i.e. multipolar) world might look like. Deputy Foreign Minister of India Sujata Mehta once called Indian foreign policy a “flexible multilateralism,” which I would interpret as a multi-vector foreign policy. The recent negotiations between Putin and Modi showed that Indians are very close to the Russian perception of a multi-vector foreign policy and the countries often have the same or very similar approaches to any particular issue. This is the main takeaway from Putin’s visit. What is more, the leaders considered a wide group of current problems from very pragmatic standpoints that were transparent to each other. It is very important that the countries have managed to maintain the ability to understand each other very well. Sometimes representatives of both sides – such as government officials, diplomats, military leaders and experts – find themselves as prisoners of Soviet-era stereotypes or, on the contrary, think that everything remains as it is and nothing is changing. These are polar-opposite attitudes. The key here is that both sides take into account the interests of each other in pursuing their own national goals. The relationship India and Russia share is indeed one of privileged status and strategic importance. What about economic ties? What is being done to improve the current situation and fulfill the huge potential of cooperation in this area? \\nIndia is Russia's especially privileged strategic partner: Putin We have a very limited trade turnover. There is no doubt about it. The countries have outstanding political relations, but the trade turnover does not reflect the vast economic potential. The volume of mutual investment does not reflect our capabilities as well – today they are at a level of $12 billion with $8 billion coming from India. So Indians are much more active in this respect, maybe due to their experience in working in foreign markets. RD: What about economic ties? What is being done to improve the current situation and fulfill the huge potential of cooperation in this area? Russia’s strong orientation to the West led to Russian companies being more interested in European and U.S. markets. Despite the sanctions, our missiles are still being produced in the U.S. Americans continue to cooperate when they have no option, notwithstanding the sanctions. Speaking about Russia’s pivot to the East, from my view, is not entirely correct. It is simply an alignment of our relations with the rest of the world. And now efforts are being made in this direction. The key thing here to understand is that the memoranda of mutual understanding only show the willingness of sides to cooperate. We can only talk about something when the contract is signed and sides are starting to implement it. This is a step-by-step work. Take, for example, the decision to create a free trade zone with India, which is due to be made in December by the Eurasian Economic Union. It’s not simple and it will require us to think about how to develop this aspect of our relationship. Discussing logistics will be key here. The establishment of economic corridors and energy bridges will require a lot of work on the ground. This can only be done gradually after necessary agreements are prepared and then signed. This is a serious question that requires a lot of time. Another example is the program signed between the Russian Ministry of Energy and India’s Ministry of Petroleum and Natural Gas to expand cooperation between the two countries in energy. This program will have to be fulfilled by specific projects and contracts later, and then it can be implemented. The countries are quite far away from each other and the questions of logistics and transportation of energy products will be crucial. All this work will be done gradually, stage by stage. The fact that the countries have set 2025 as a due date shows that both of them have considered this issue with responsibility. Overall, I would say that the cooperation now is moving in the right direction and is likely to provide a basis for future breakthroughs in trade turnover and energy cooperation. While the demand for energy in India is growing, the country does not enjoy many of its own energy sources, so that will give the basis for more active cooperation with Russia. \\nRussia and India: A civilizational friendship What is your position towards the closure of many media outlets in Russia working in Indian languages? What are the implications of that? \\nI’m strongly against it. The liquidation of media coverage that previously was done in eight Indian languages leads to a situation when Indians have less and less knowledge about Russia. The situation is similar in Russia as well: Russian businessmen don’t know how India looks like today. That’s why they are very cautious about entering the Indian market. Indian bureaucracy is sometimes a push-off factor, but the Modi government is making steps to liquidate many of the bureaucratic obstacles changing the tax system and making the environment for foreign investors more transparent. But if our businessmen don’t know about it, they will not go there. The same is applicable to Indians, though they know us a bit better. However, they get their information mostly from Western sources. Economic cooperation requires a systemic approach and in this respect I support the upcoming opening of the office of the Russian Export Center in India. People working there will be researching the developments on the Indian market and business climate. Once the TASS news agency had a correspondent in Delhi to report on the situation in the Indian market. Today I don’t know if someone is doing or is able to do this. All this leads to a situation when the countries don’t even know about the opportunities existing for effective cooperation. For instance, India’s southern states allow for all-year shipbuilding as opposed to Russia’s traditional shipyards, where the construction takes place only half a year. If India and Russia developed joint shipbuilding projects in India’s southern states that could benefit both states. The problem here is the lack of information about each other, which leads to missed opportunities. The interview is abridged. Read the full version published by Russia Direct . Facebook\""}, "time": 1742562793.3784084}