{"duration": 0.27011609077453613, "input_args": {"text": "'Leave a reply “Love Sun & Mother Earth” – photographer Makiko \\nJuliet Tang – Prior to birth, just like an artist who is selecting which paints will go onto the blank canvas, our souls choose a set of colors to work with which determine our parents, ethnicity, country of birth, etc. We also choose a number of possible paths that would allow us to experience certain aspects of our being. For instance, if courage is one of those aspects of ourselves we wish to experience, we would collaborate with other souls in this physical realm so circumstances would arise in our lives where we are required to invoke courage within us. Likewise, we choose a certain mission, or a calling that would allow us to maximize our full potentials on this live stage called earth. \\nIn order to fully step into our calling with power and consciousness, we must first elect to forget what it is at birth so we may, after years and decades, and for some, lifetimes of soul searching, arrive at a point in our lives where we must make a choice to remember who we truly are and deliberately call forth what gives us highest joy. \\nPersonally, I see the long years of painful searching as nothing more than a rite of passage with intended experiences and divinely placed circumstances that fully prepares us to be who we came here to be. The second we reunite with our soul’s calling, the universe registers our seriousness and we come to the realization that nothing can and will stand in our way. \\nAt that moment, all fears and obstacles begin fading as the path unfolds in front of us. At that moment, we will move mountains and cross oceans just so that we can become one with our highest intention and commit to our divine mission. At that moment, our body, mind and soul become aligned with one single purpose – to experience ourselves as our own grandest creation in this life. \\nFunny enough, once we remember our mission, we often realize the mission has very little to do with us and everything to do with everyone else. It is a mission that allows us to serve humanity and to light the paths for others through servicing, healing, inspiring, teaching and empowering. \\nIt is no coincidence that for many, in order to remember that mission, we must first experience the pains and turmoil in life so we may later not only decide to transcend what limits us, but also use our life journey as a tool to inspire and encourage others to do the same. Some of the most influential teachers from Hay House such as Louise Hay, Anita Moorjani and the late Wayne Dyer are but a few who had journeyed to the darkness and back so they may light the way for others. \\nKnow that wherever you are in life is exactly where you need to be . You are not bound to any fate and you have the power to change and create anything in life. It is my hope that by sharing the following 3 reminders that are embedded in your soul blueprint, you will begin manifesting your calling. You came here with something to do. You are part of a universal consciousness, and there are no accidents in it. In your true essence—not the false self, not the ego part of you, but in the true essence of who you are—you are infinite and you have something very profound to accomplish while you’re here. Otherwise you wouldn’t be here. Find it. Pay attention to it. Listen to the callings. See the clues, the cues. See the alignments, whatever they might be, no matter how absurd or bizarre they might seem to everyone around you…if you have a calling inside that says there’s also something else, don’t ignore that. Don’t die with your music still in you. Don’t die with your purpose unfulfilled. Don’t die feeling as if your life has been wrong. Don’t let that happen to you. ~ Wayne Dyer Identify Your Highest Joy \\nAs beings of energy, we ourselves are literally the creation tools we are born with and our feeling is the direct line of communication with our soul, or the higher self. At any time when our thoughts, words and actions are aligned with the soul’s vision, we know it immediately by the way we feel which is usually identified as harmony, inner-peace, joy, gratitude and love. \\nWhenever we feel good, our vibration is instantly higher which easily leads to inspired action; and by committing ourselves to inspired action, it leads to more joy which expands the breeding ground of inspired action. The more we can get in touch with the “feel good” component within ourselves and listen to it, the easier it will be for us to define our mission in life. \\nFor the longest time, I had not a clue what my calling was and I spent the majority of my time complaining and wishing I could do something else with my life while holding onto the belief that a job and a passion are mutually exclusive. I did have many passions and since I felt miserable with my job, I indulged myself with activities I enjoyed whenever I had free time. Being a spiritual seeker since birth, one of my passions was alternative healing. For many years, I heard and read about Reiki and there was always that little voice in the back of my head whispering, “Take a Reiki class.” Like many, I brushed aside the little voice with as many excuses as I could find but eventually, the voice became so persistent that I decided to just go for it. \\nAs someone who was also obsessed with doing the due diligence for everything I stepped into, I spent hours researching for an experienced teacher. I already signed up for a course elsewhere when the name of my first Reiki teacher popped up in my search, and for reasons unknown to me at the time, I made a last minute decision to go with this class. \\nDuring the two days of training, I met someone whom I became friends with. Fast forward to years later, we currently share an office space doing healing work in Midtown Manhattan. Within the same year after the initial training, the same friend introduced me to another Reiki teacher who is the very reason why I eventually became a recovery and wellness coach as well as Reiki master. During those years, every time when I was guided by inspiration , life rewarded me with more people, events and circumstances that helped me remember my true essence and carry out my mission. \\nDo not despair if you do not yet remember what you came here to be. Your only duty in this life is to follow your highest joy. Believe me, it is much more than just a cliché line that we use as a bumper sticker. \\nOnce we follow the first inspired idea, we are sending out the energy with the intention of “I am my highest joy at this given moment” into the universe which slowly intensifies and magnifies as we become more accustomed to singing our heart’s song. What has started as a seed is given more opportunities to grow and flourish every time when we follow our highest feelings because the energy behind that intention is literally snowballing and creating more and more movement in the quantum field in bringing us what make us happy. \\nWhat inspires you? What makes your heart sing? What’s that one thing you’ve been wanting to do but have been putting off forever? \\nIt’s time. Allow Your Being to Guide Your Doing \\nOne of the most frustrating things we do to ourselves is we get stuck envisioning the million tasks we must do to accomplish anything, that can also be the very thing that keeps us from moving forward. \\nAnswering our calling is very much a process like everything else. The end result may look nothing like what we started off with or what we planned, and that is completely ok. Sometimes what we think we want only serves as a stepping stone that leads us closer to fulfilling our mission. The universe does not care about what we do that makes us radiate with joy, it can be taking a Reiki class or a baking class, going on that spontaneous vacation or calling an old friend we haven’t seen for years. The universe only cares about the vibrational signature we give off when we are being that joy. \\nBy giving ourselves into inspired action, we may be meeting a teacher for life who becomes our source of inspiration, or be welcoming an opportunity that otherwise would not be there had we not chosen to follow our heart and arrive at that exact location and time. \\nThe only decision we have to make on a daily basis is to start following whichever things that give us whatever amount of joy out of all the available daily activities in front of us rather than coming up with a huge plan of action to get ourselves from point A to B because “it is the right thing to do” or “ everyone else does it .” \\nIf your only daily activities are comprised of chores such as house cleaning, meeting deadlines and cooking for a family of six, then invite yourself to do some (or all) of those things with as much joy and presence as you can , and to squeeze in a couple of little activities that bring you peace and make you come alive. They can be as simple as having quiet time to read for 15 minutes or working on that hobby when everyone goes to sleep. You just never know what may come out of them! \\nDo not ever underestimate the power behind these little activities as they are what make the energy accumulate. Remember, it is always about being the “I am my highest joy at this given moment” energy rather than flooding ourselves with tasks and running around aimlessly for the simple reason that we cannot find our calling outside of ourselves, but we can remember or create it within us. The more we can allow that energy to flow to us and from us, the more the universe can bring us everything that resonates on the same energy level to help us remember and create our destinies. \\nIs the path of committing ourselves to remembering, and eventually embodying our calling always peachy? The answer is no. It is a journey that is made of a thousand little steps of learning and choosing. Along the way of building my healing practice, I was constantly discouraged by my lack of knowledge and tools to run a business as well as overwhelmed by the millions of tasks I was constantly bombarded with. \\nI invested a great deal of energy on training courses from learning how to write my about page to polishing up the content of my website so I can reach a larger audience. No matter how much I tried to tweak my writing while working with business coaches and alike, I was unable to meet their standards of using “simple and client friendly” language where I could explain what I do in a couple of sentences to an eight-year old. \\nOne day, exactly one year from the day I resigned from my last job, it finally hit me. While I will always remain grateful of the knowledge and support I have taken away from the courses, my writing reflects my true essence, and who I am at the core is someone who thinks, feels and speaks like the spiritual geek that I am proud to be. By giving myself endless tasks of to-do’s that do not align with my inspired actions, I am neglecting who I came here to be – someone who helps others heal, awaken and create through spiritual writing, healing and coaching. \\nIn fact, this article was entirely inspired by hours of staring at weeks worth of unfinished homework documents from my latest course with the sudden realization that the content of my website may never appeal to everyone, and that is perfectly ok. I was faced with two choices, to continue doing the daunting task of sounding like someone I am not, or being immersed in the joy of writing. The moment I chose the latter, a stream of inspiration poured in and gave birth to these words. \\nAt the end of the day, it isn’t about what we do, how we do it, what our titles are, how polished our website looks, how many credentials are displayed in our bios and how many award-winning books we’ve published. It is about whether we can allow ourselves to step into who we truly are, and boldly and lovingly declare our authenticity to the world. No vibration in the universe is more powerful than our energy when it becomes an extension of our divine calling. \\nWhat are some things on your daily to-do list? Which ones of those give you any amount of joy? How can you insert more “feel good” activities into your life? How can you replace the aimless “to-do’s” with more inspired action? Your Calling is Your Own Creation \\nOur souls have chosen a certain mission prior to birth, but the moment we become fully conscious of who we are and awaken to the creator within, we are no longer bound to any predetermined paths we laid out for ourselves before coming into this physical body. The more we are aware of our true essence and our connection with the divine source , the more empowered we become and the more we can claim the gift of free will which ultimately allows us to exercise our birthright as the conscious creator to Be, Do, and Have anything our soul desires. \\nTo achieve that, we must first free ourselves from everything that limits us. Limitations can take the form of fear such as fear of uncertainty/change, fear of lack, or even fear of success. Limitations can also manifest as endless excuses ranging from “I have a full time job with no time or money” to “I’m too old to do this.” In addition, limitations show up as disempowering beliefs including, “There isn’t enough for everyone” or “I am not special enough.” \\nThere is no one way to initiate that journey of liberation, there is only what works for you. Personally, I’ve found spiritual practices such as energy healing, Kundalini yoga, meditation, working with a spiritual coach, being in nature, journaling and reading inspirational books are all great ways to awaken. \\nI used to be the queen of “what-if’s.” “What if I failed?” “What if I lost it all?” “What if I became a laughingstock?” One day, I grew sick of my negative what-if’s and decided to do a 180. “What if I succeeded?” “What if I learned something from this?” “What if I could help others?” I made a point to do this every day for months and it made a remarkable difference in my ability to exercise my free will. \\nPrior to tapping into our true creator role, many of us feel like powerless victims who take whatever life throws at us. We may be passionate about answering our calling as an artist but end up working at a bank because we are afraid we won’t make ends meet. We feel limited, even enslaved by the conditions in our lives. We submit ourselves to our so-called fate and tell stories of how we aren’t fortunate enough to be one of those who seem to have it all . \\nWhen we awaken, we become aware that we are who we say we are, and what we create as well as how we wish to experience everything in life depends on one thing and one thing only – our choice. \\nYour calling is something you soul chose in the realm of the formless before it took on a body, and you can choose again at any time in this life because the truth is, your soul remains who you truly are while your body and mind are only additional tools for you to carry out your mission so you may experience your own creations physically in this 3D time and space dimension. That power of choice has never left you. Once you decide, allow the universe to bring you the rest of the co-creators to make it happen. \\nIt is time to unleash your free will and write your own destiny. There is nothing written in the stars that are foreshadowing who you are and what you can become. Once every part and every cell within you is aligned with this inner-knowing, you have awakened to the divine power of creation you have inherited. That power lives in you and patiently awaits for you to call upon it. \\nYou are neither your past, your birth conditions, your roles, your accomplishments, your credentials, your awards, your bills, your bank statements, your 9-5 job that makes you cringe every morning upon waking up, nor are you your body, your mind, your beliefs, your thoughts, your baggage, your limitations, your past relationships, even your soul contract. Deep down inside, you are a being powerful beyond your imagination. Once you remember all this, you will remember your sacred ability to create anything you wish and your joyous vibration will make the world just a little brighter. \\nIt matters not one bit if you do not know your calling. If you could start from a blank slate and create anything you wanted in life without limitations from this moment on, who would you be? What would you create? \\nWhat is one small step you can take today to be that? \\nFollow your heart. \\nJuliet Tang is a Usui/Holy Fire Reiki Master, certified hypnotist and founder of Jewel’s Healing Garden , a holistic practice in New York that combines energy healing, hypnosis and intuitive coaching to help others achieve healing and personal transformation. Juliet empowers her clients to tap into the power of their unconscious to access the infinite wisdom and inner resources that can be utilized to carry out their visions. With her psychology background and a decade of teaching experience, in addition to the healing work conducted, Juliet also teaches her clients simple and powerful techniques to rewire old habits to reinforce desirable patterns in all areas in life. Her hypnosis/coaching packages can be found here . SF Source Wake Up World  '"}, "time": 1742562339.3365896}