{"duration": 0.23569083213806152, "input_args": {"text": "\"Proof Hillary Clinton and her foundation are working with the Russians to destroy America Why isn't the FBI investigating Hillary's actual connections to the Russians? By Shepard Ambellas - November 1, 2016 \\nEditor’s Note: This article was originally posted back in January and links Hillary Clinton and the Clinton Foundation to the Russians. Now, seven days out from the U.S. Presidential Election, new rhetoric has surfaced in the media which shows that the FBI has investigated Donald Trump for possible Russian connections and of course has found no ties. But the real question to ask may be: Why isn’t the FBI investigating Hillary’s actual ties to the Russians which can be found herein this article? Please share this post everywhere, make it go viral! \\nRelated: Rancher Dwight Hammond threatened with “bullet”: Exclusive Interview \\nPRINCETON, Ore. ( INTELLIHUB ) — As it turns out there’s a lot more to the story behind the Malheur Wildlife Refuge — a whole lot more–and this article is just the tip of the proverbial iceberg. \\nAs you may or may not know, Intellihub reported on Jan. 4, that the Hammond’s ranch and other ranch-lands surrounding the refuge sit atop a vast swath of precious metals, minerals, and uranium that’s heavily desired by not only the federal government, but foreign entities as well. \\nHowever, at the time of the article’s publication the federal government’s full motive to seize the land was not yet known other than the fact that these elements do exist in the vicinity and are invaluable. \\nNow, after further investigation, more pieces of the puzzle have been put in place and you’re not going to believe what characters are involved. \\nI’ll give you a hint — one of them is currently being investigated by the FBI and is also running on the Democratic ticket in hopes of becoming the next President of the United States. That’s right, you guessed it–none other than Hillary Rodham Clinton of the notorious Clinton crime family . \\nHillary and her foundation are implicated in the dastardly scheme along with the Russian State Nuclear Energy Corporation, Rosatom, and a few dubious Canadian elite, which is where the news gets really bad. \\nRosatom is ranked #2 globally in uranium reserves and #1 globally for annual uranium extraction. The sheer power, strength, and size of the corporation is undeniable. Rostom is a major power-player in today’s world and didn’t become that way for no reason. \\nYou see, Rosatom wanted to expand their operations into America and needed a way in. So, in 2013, Rosatom acquired a Canadian company named Uranium One as part of a sinister side deal which involved multiple parties. Ultimately the deal opened a typically secure and closed-door, thus allowing the Russians to salt their way into Continental United States as part of a vast and extensive plan to mine Uranium ore out of states like Wyoming and Oregon. \\nThe deal was essentially brokered by Hillary and was ran through the Clinton Foundation using Canadian-backed contributions as a cover. With one swoop of a pen the bitch sold out the American people and one-fifth of America’s uranium resources to the Russians. \\nIn April of 2015, two reporters for the New York Times boldly reported how the plan worked: At the heart of the tale are several men, leaders of the Canadian mining industry, who have been major donors to the charitable endeavors of former President Bill Clinton and his family. Members of that group built, financed and eventually sold off to the Russians a company that would become known as Uranium One. Beyond mines in Kazakhstan that are among the most lucrative in the world, the sale gave the Russians control of one-fifth of all uranium production capacity in the United States. Since uranium is considered a strategic asset, with implications for national security, the deal had to be approved by a committee composed of representatives from a number of United States government agencies. Among the agencies that eventually signed off was the State Department, then headed by Mr. Clinton’s wife, Hillary Rodham Clinton . As the Russians gradually assumed control of Uranium One in three separate transactions from 2009 to 2013, Canadian records show, a flow of cash made its way to the Clinton Foundation. Uranium One’s chairman used his family foundation to make four donations totaling $2.35 million. Those contributions were not publicly disclosed by the Clintons, despite an agreement Mrs. Clinton had struck with the Obama White House to publicly identify all donors. Other people with ties to the company made donations as well. And shortly after the Russians announced their intention to acquire a majority stake in Uranium One, Mr. Clinton received $500,000 for a Moscow speech from a Russian investment bank with links to the Kremlin that was promoting Uranium One stock. At the time, both Rosatom and the United States government made promises intended to ease concerns about ceding control of the company’s assets to the Russians. Those promises have been repeatedly broken, records show. […] Soon, Uranium One began to snap up companies with assets in the United States. In April 2007, it announced the purchase of a uranium mill in Utah and more than 38,000 acres of uranium exploration properties in four Western states , followed quickly by the acquisition of the Energy Metals Corporation and its uranium holdings in Wyoming, Texas and Utah. That deal made clear that Uranium One was intent on becoming “a powerhouse in the United States uranium sector with the potential to become the domestic supplier of choice for U.S. utilities,” the company declared. […] While the United States gets one-fifth of its electrical power from nuclear plants, it produces only around 20 percent of the uranium it needs, and most plants have only 18 to 36 months of reserves, according to Marin Katusa, author of “The Colder War: How the Global Energy Trade Slipped From America’s Grasp.” “The Russians are easily winning the uranium war, and nobody’s talking about it,” said Mr. Katusa, who explores the implications of the Uranium One deal in his book. “It’s not just a domestic issue but a foreign policy issue, too.” Yes, the Russians are winning the “uranium war,” thanks to Hillary. Additionally BLM documentation shows: In September 2011, a representative from Oregon Energy, L.L.C. (formally Uranium One), met with local citizens, and county and state officials, to discuss the possibility of opening a uranium oxide (“yellowcake”) mine in southern Malheur County in southeastern Oregon. Oregon Energy is interested in developing a 17-Claim parcel of land known as the Aurora Project through an open pit mining method. Besides the mine, there would be a mill for processing. The claim area occupies about 450 acres and is also referred to as the “New U” uranium claims. On May 7, 2012, Oregon Energy LLC made a presentation to the BLM outlining its plans for development for the mine. The Vale District has agreed to work with Oregon Department of Fish and Wildlife on mitigation for the “New U” uranium claims, which are located in core sage grouse habitat. Although the lands encompassing the claims have been designated core, the area is frequented by rockhounds and hunters, and has a crisscrossing of off-highway vehicle (OHV) roads and other significant land disturbance from the defunct Bretz Mercury Mine, abandoned in the 1960s. However, by the fall of 2012 the company said that it was putting its plans for the mine on hold until the uncertainty surrounding sage grouse issues was resolved. Once again the Whore of Babylon , Hillary Clinton, her foundation, and other members of government, have literally been caught conducting illicit, illegal, and treasonous, activities right underneath the noses of the American people and are in no way being held accountable. Moreover she has the nerve to run for president! Are you kidding me? Now Oregon Governor Kate Brown has stepped in, calling for a ‘swift’ resolution to the armed occupation of the Malheur Wildlife Refuge, clearly shilling for the Dems, criminally assisting them with their master plan to sellout every last bit of America’s public lands to foreign entities like Uranium One, fully eviscerating whats left of the U.S. Constitution. So there you have it–rogue criminal factions of government are operating at all levels and are actually conspiring together to allow foreign corporations to invade and mine rich American resources, including uranium, from lands owned by the people. Uranium One’s slogan is: “Success through aggressive mine and land acquisition.” \\nAdditionally, President Obama has signed executive orders allowing the Department of the Interior to grab publicly owned lands. Update 1:29 p.m.: World Net daily published an article back in 1998 titled “Federal Land Grab Called ‘Political’.” In the article he author points out how Utah Republican Jame Hansen authored a bill at the time known as the “Utah Schools and Lands Exchange Act of 1998.” According to the report, this bill passed in June of 1998, and gave “Utah 139,000 acres of federally held land, certain mineral rights, and $50 million in exchange for all of Utah’s claims to lands within national parks, monuments, forests and federal areas” under then U.S. President Bill Clinton’s orders, further demonstration how the Clinton Crime Family has been using their vast political influence to loot some of the best assets from the Corporation of the United States, selling them for pennies on the dollar to private foreign corporations and one world bodies like the United Nations. Additionally we find this whole animal goes back the the Ronald Regan era–and possibly further. HCN.org reported back in 2004: […] President Ronald Reagan and his advisors looked across the West’s public lands and saw dollar signs. Money was something they desperately needed in 1982, as the national deficit hit $128 billion. So James Watt, then U.S. secretary of the Interior, and John R. Block, the secretary of Agriculture, earmarked 35 million acres, or 5 percent of the nation’s public lands (excluding Alaska), for the auction block. The plan to privatize public lands was met with outrage and skepticism, not only from Western liberals such as Arizona Gov. Bruce Babbitt, but also from conservatives like Sen. James McClure, R-Idaho, who objected because the states were cut out of the deal. Watt eventually withdrew Interior lands from the sale; shortly thereafter, the Forest Service’s sale lost steam, too. However unpopular the proposed sales were, they weren’t illegal. And the idea didn’t go away. The framework for selling public lands has inched forward since the Clinton administration, and now the Interior Department wants to give it a higher priority. The 1976 Federal Land Policy and Management Act (FLPMA) required the Bureau of Land Management to identify lands that were “uneconomical to manage,” or that stood in the way of a community’s development. But the BLM lacked a strong incentive to identify such sellable lands: Under FLPMA, any money received from their sale would go directly into the U.S. Treasury, rather than into the agency’s own coffers. Then, in 2000, Congress and the Clinton administration passed the Federal Land Transaction Facilitation Act (FLTFA), which changed how profits from BLM land sales were distributed. Twenty percent of any land-sale revenue would go toward the BLM’s administration costs, while the other 80 percent had to be used to buy private inholdings within BLM lands that contained “exceptional resources.” The act was based on a land disposal and acquisition mechanism in the Southern Nevada Public Land Management Act of 1998, which was crafted to accommodate Las Vegas’ rapid expansion onto neighboring public lands. But FLTFA’s profit scheme applied only to sellable lands identified before July 25, 2000. At that time, the BLM estimated it had 3.3 million acres of sellable land, but thanks to better inventories, its estimate has since shrunk to as low as 330,000 acres. From 2001 to 2003, the BLM sold almost 11,000 acres under FLTFA. Note: We know some of the land acquired by Uranium One is in Oregon and we know there are precious metals on and near the Hammond Ranch. Put two and two together. Stay tuned for more updates and confirmation as it is becoming increasingly clear that other companies and government entities are most likely also involved. The government, alongside private companies (including foreign-owned), are in the middle of a massive criminal land grab which the mainstream media is largely ignoring, instead opting to paint those in Oregon as crazy anti-government extremists. In other words, members of the mainstream media are directly responsible for helping to allow this takeover to happen. Other Sources: Uranium prospecting in Oregon, 1956 — State of Oregon \\nWhat is that I spy east of I-17? BLM acquires more land for monument, prevents development — Daily Courier \\nFrom Russia with no love for Colorado uranium mining climate — Colorado Independent \\nAll Oregon Dockets — USGS \\nPresidential Memorandum — America’s Great Outdoors — WhiteHouse.gov \\nPublic Versus Private Property Rights — BLM.gov \\nAbout Uranium One — Uranium1.com \\nWhat was the Whitewater scandal? — Investopedia \\nShepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter . Image: aphrodite-in-nyc/Flickr\""}, "time": 1742561763.4442797}