{"duration": 0.06945943832397461, "input_args": {"text": "'KINSMAN, Ohio  —   For years, Tammy and Joseph Pavlic tried to ignore the cracked ceiling in their living room, the growing hole next to their shower and the deteriorating roof they feared might one day give out. Mr. Pavlic worked for decades installing and repairing   and heating units, but three years ago, with multiple sclerosis advancing, he had to leave his job. By 2015, Ms. Pavlic was supporting her husband and their three children on an annual salary of $9, 000, earned at a restaurant. That year, they tapped a county program funded by Congress, called the HOME Investment Partnerships Program, to help repair their house. The next year, they voted for Donald J. Trump, who has moved to eliminate the HOME program. The Pavlics’ ceiling may no longer be cracked, but in the   game that Mr. Trump’s budget seeks to set up, the nation is showing new fissures. The president’s budget proposal would cut deeply into the Department of Housing and Urban Development, paring rental assistance and eliminating heating and   aid,   assistance, and partnerships with local governments like HOME. With the savings, Mr. Trump says, he would beef up military spending and build a wall along the Mexican border. “Keeping the country safe compared to keeping my bathroom safe isn’t even a comparison,” Mr. Pavlic, 42, said. “We have people who are coming into this country who are trying to hurt us, and I think that we need to be protected. ” His wife is hoping Mr. Trump changes his mind. “I am glad that he is our president, but I do believe, though, that if he could see this from a personal point of view that he would probably maybe change his mind about cutting this program,” Ms. Pavlic, 44, said. “Any mom wants their kids to be safe, so any mom wants their home to be safe. ” HOME Investment Partnerships is one of dozens of programs and independent agencies aimed at the poor  —   including the Appalachian Regional Commission, AmeriCorps, the Legal Services Corporation and the Interagency Council on Homelessness  —   that Mr. Trump has proposed cutting. The budget for the fiscal year beginning in October would cut $6. 2 billion  —   about 13 percent  —   from HUD, eliminating the Community Development Block Grant program, which funds local initiatives like Meals on Wheels and   efforts and the   Homeownership Opportunity and Choice Neighborhoods programs, which aim to replace distressed public housing with   development. Trumbull County, where the Pavlics live, teamed up with the City of Warren in the 1990s to create the   HOME Consortium, which receives about $450, 000 a year from HUD to repair homes, assist with down payments, finance affordable housing and build housing for people suffering from chronic mental illness, said Julie Edwards, the economic development coordinator for the county’s planning commission. The county, which voted overwhelmingly for Mr. Trump, is the type of place where people might hope to be great again. Open fields of overgrown grass line winding roads that lead to rusted steel mills and shuttered factories. The median household income in the county, which is about 90 percent white and 8 percent black, dropped by $7, 400, to $42, 368, from 2006 to 2015, while the population declined by 14, 000, to 203, 750. Near Kinsman is Masury, which locals have nicknamed Misery. “Our county voted for President Trump, so I’m not sure they quite understand what is going to happen,” Ms. Edwards said. “I don’t think people realize how much we rely on these services. I don’t think people are making the connection between cutting the HUD funds and paving our streets or building new affordable housing. ” No president’s budget is enacted as presented to Congress, and Mr. Trump’s is already facing bipartisan opposition. Representative Hal Rogers, Republican of Kentucky, pushed back hard shortly after Mr. Trump released his proposals. “While we have a responsibility to reduce our federal deficit, I am disappointed that many of the reductions and eliminations proposed in the president’s skinny budget are draconian, careless and counterproductive,” Mr. Rogers said in a statement. To Mr. Trump, the   budget “promotes fiscal responsibility by eliminating funding for a number of lower priority programs. ” Robert Rector, a senior research fellow at the conservative Heritage Foundation who specializes in welfare and poverty, said Mr. Trump’s budget trims only about 1 percent of federal spending on programs for the poor. He dismissed many of HUD’s programs as inefficient. “The welfare state is extremely large, far larger than anyone on the left likes to acknowledge,” Mr. Rector said. “What is necessary to reform this system is to reduce the amount of waste and take some of that waste and retarget to more effective programs for the poor. And I really think that is what you will see out of the Trump administration in the long term. ” Marion McFadden, the vice president for public policy at Enterprise Community Partners, an affordable housing organization, is not so sanguine. In her view, Mr. Trump’s budget would turn Washington’s back on America’s most vulnerable populations. “You’ve got an extraordinary number of   people who are devoting so much of their income to housing,” said Ms. McFadden, who spent 15 years at HUD, including two running the HOME and Community Development Block Grant programs. “These programs are carefully targeted to ensure they serve people of modest means. Taking the funds away from communities will be really devastating in some places. ” To William Brown, a former trucking company manager in Masury, the proposed cuts are not fodder for an academic argument: They’re just wrong. “Everything he is doing is systematically horrible for this country,” said Mr. Brown, who voted for Hillary Clinton and hasn’t worked since 2009 after he had a heart attack and was laid off from his job. “For him to even consider taking a program away when we can spend all this money for him to go down to Florida every weekend, how many people can use that money?” Mr. Brown, 67, who lives on a monthly Social Security check of $1, 400, feared he would have to move into an assisted living facility if he couldn’t repair his decaying home. He said he was ashamed to ask for government help but listened to a township official who encouraged him to apply for HOME money. “That program saved me,” Mr. Brown said. “Everybody’s life can turn in half a second. You can wake up and be devastated tomorrow. Same as anybody here. ” In Warren, Amber Barr, 34, lives in a women’s supportive housing complex and regrets voting for Mr. Trump. She and her    daughter, Brooklynn, survive on a $588 disability check and $340 in food stamps every month. Her rent is $99, and she fears that Mr. Trump’s housing cuts are just the beginning. “If I didn’t have these programs, I wouldn’t have any kind of support, I wouldn’t have any kind of direction as to what to do, where to go, and I wouldn’t have any money to help me find resources,” Ms. Barr said, as she began to cry. Housing assistance has helped her focus on getting treatment for hepatitis C, attending Alcoholics Anonymous meetings and seeing a psychiatrist for anxiety. It also meant escaping the temporary housing she was in for several months after leaving an abusive relationship. Last week, as she thought of Mr. Trump’s budget, Ms. Barr stood outside her building nervously clutching the only money she had left for the month: six quarters she hoped to put under her daughter’s pillow as a gift from the tooth fairy. “I don’t plan on being here forever,” Ms. Barr said, wiping away tears. “People that are getting help right now are succeeding. People are not going to succeed. They are going to give up. ”'"}, "time": 1742628465.8883128}