{"duration": 0.11040425300598145, "input_args": {"text": "'A proper foreign policy should be neither rash nor cowardly. It should be based on geopolitical facts, not emotions. And it should be consistent with the nation’s guiding principles, as well as internally consistent – meaning that the components of the foreign policy don’t conflict with each other. \\nVia TruthAndAction \\n\\nIt should be affordable, and recognize the nation’s strengths and weaknesses. None of this requires a genius to figure out. In other words, a proper foreign policy is exactly what we do not have in the United States. It’s difficult to imagine a more stupid foreign policy than one of using NATO to provoke Russia.\\nScroll Down Below For Video NATO should have been disbanded when the Soviet empire fell. Of course, ending a government program, regardless of how useless or detrimental it is, is all but impossible. The Obama Administration’s foreign policy in Eastern Europe is one of lunacy as NATO and Russia appear to be preparing for war.\\nNobody should admire cowardice. But recklessness needs to be condemned as well. When a nation engages others to assist it in taking rash and provocative actions, it needs to be called out for the danger it is. The military buildup in Eastern Europe, largely sponsored by the Obama Administration, supported by Hillary Clinton, and conducted through NATO, has the potential to trigger the unthinkable.\\nA key Russian defence figure says the deployment of US Marines at Værnes is part of a US buildup to go on a “global blitz” and warned that Norway may make itself a target for a potential nuclear attack. Frants Klintsevitsj, a deputy chairman of Russia’s defence and security committee, told TV2 that Russia views the presence of 330 Marines in Norway as a direct military threat that demands a reaction. Klintsevitsj, considered one of Russia’s most influential defence politicians, said that Norway may now be added to “the list of targets for our strategic weapons”. Frants Klintsevitsj, a deputy chairman of Russia’s defence and security committee, told TV2 that Russia views the presence of 330 Marines in Norway as a direct military threat that demands a reaction.\\nKlintsevitsj, considered one of Russia’s most influential defence politicians, said that Norway may now be added to “the list of targets for our strategic weapons”.\\n“This is very dangerous for Norway and Norwegians,” he said.\\nApparently Norway’s Defense Minister isn’t too concerned about all of this. He should be.\\nRussia has on several occasions criticized the plans to deploy 330 US troops at Værnes. Norway’s defence minister, Ine Eriksen Søreide, has rejected those criticisms and insisted that the deployment does not constitute a US military base but is rather a test run that will be evaluated during 2017.\\n“There is no objective reason for the Russians to react to this. But the Russians are reacting at the moment in the same way toward almost everything the Nato countries are doing,” Søreide said.\\nNow a bit of history to put this into context.\\nBefore joining Nato in 1949, Norway allayed Russian fears by pledging not to open its territory to foreign combat troops so long as Norway was not attacked or threatened with attack.\\nSomething changed.\\nThe perspective of this article may appear to be pro-Russia, but the truth is that the intention is to be neither pro-Russia, nor anti-Russia, but pro-US. It’s difficult to see how an Obama Administration sponsored military build-up on Russia’s western border is pro-US. Using NATO as a cover doesn’t help or give it legitimacy. It just drags other countries into a potential nuclear conflict with Russia. And for what?\\n'"}, "time": 1742563105.953279}