{"duration": 0.1222372055053711, "input_args": {"text": "'License DMCA With the U.S. more interested in finding Hillary\\'s emails and measuring Trump\\'s hand size, it\\'s no surprise that Africa, the continent with the fastest economic growth rate in the world, has been painfully absent from this election cycle. With the notable exception of Green VP candidate Ajamu Baraka, virtually no candidate even bothered to second-guess the many covert operations carried out by U.S. military forces in Africa or to examine what Washington\\'s role should be in promoting development in Sub-Saharan Africa. And for better or worse, that void has been rapidly filled by China. In an opinion piece published on October 23, China\\'s newly appointed ambassador to Nigeria emphasized Chinese investors\\' eagerness to invest into the development of Nigerian infrastructure, manufacturing and agriculture. The ambassador, Zhou Pingjian, also noted the enthusiasm and optimism prevalent among the Chinese business community in Nigeria, stressing the prospect of a lasting and beneficial partnership between the two countries. These developments are just the latest example of China\\'s desire to step up its involvement in Africa. While the relationship has existed since the 1970s, in recent years, China has taken this investment to a new level. At last year\\'s Forum on China-Africa Cooperation (FOCAC), Chinese President Xi Jinping encouraged African leaders to \"open a new era of China-Africa win-win cooperation and common development\" , pledging investments of $60 billion . During a time when Chinese involvement in Africa is rapidly increasing, surveys have shown that the African public holds a generally positive view of China\\'s growing economic role on the continent. Surveys by Afrobarometer revealed that Africans rank China second only to the US as a model for their own country\\'s economic development. In three out of five regions surveyed, China matched or even outpaced the US in terms of popularity as a model for development. In terms of perceived influence, China and the US were second only to former colonial powers. On average, 63 percent viewed China\\'s influence as positive. While these positive attitudes may be linked to the potential positive effects on Africa\\'s economic growth, as analyses from the World Bank suggest, China\\'s involvement with African leaders does not necessarily benefit the local populations. In the past, Beijing has not hesitated to leverage its important role on the continent for its interests using the threat of withdrawal of support to ensure the success of commercial and political objectives. For example, in 2006, China\\'s ambassador to Zambia threatened to cut ties if an opposition candidate who was critical of Chinese investment policies won power. - Advertisement - African leaders regard Chinese money pouring into their country as an appealing alternative to Western funds because in contrast to Western aid, Beijing does not insist on strengthening human rights or the rule of law. Consequently, China has come to forge close relationships with brutal and autocratic African heads of state. China has had longstanding ties with Zimbabwe\\'s Robert Mugabe since funding his guerilla fighters in the 1979 Rhodesian Bush War. When Mugabe took power in 1980, China helped to build a new sports stadium, hospitals, and a power station. Most importantly, China became Mugabe\\'s primary arms supplier. In the decades since, Mugabe and his administration have been accused of a wide range of human rights violations , including repression of activism and civil liberties, and violence leading up to elections, while Mugabe\\'s security forces have even been accused of using torture camps. Last December, President Xi Jinping made it clear that China still shares a bond with Zimbabwe, promising multibillion-dollar investments. While it might be appealing to African politicians, China\\'s willingness to look the other way when it comes to human rights violations has certainly not been good for the people of Zimbabwe. In another example, China\\'s relationship with Egypt\\'s increasingly autocratic President Abdel Fattah al-Sisi has been growing closer . With reduced tourism and support from Europe, Egypt has been turning towards China. For its part, the Chinese government is offering Egypt assistance with multiple infrastructure projects, including transport, housing, and power. China is looking towards Egypt as a focus of its \"One Belt, One Road\" plan to rebuild its ancient maritime Silk Road trade routes connecting China to Europe and Africa. China\\'s business plans frequently serve to prop up dictatorial regimes, and often hold little benefit for the people suffering under them. In Djibouti, profit from foreign military installations rarely improves the lives of Djiboutians, 42 percent of whom continue to live in extreme poverty and 48 percent of whom are unemployed. Meanwhile, China continues to ramp up investment in the nation , investing in multibillion-dollar infrastructure projects such as a new port, two airports, a new railway and other projects. Most importantly, China has started building its first overseas military installation in Djibouti. This support continues despite the fact that Djibouti\\'s strongman President Ismail Omar Guelleh was accused of killing opposition supporters in the run up to the general elections in April, during which he also severely strangled press freedoms . Despite enjoying a positive image among much of Africa\\'s population, China\\'s involvement in Africa often ignores glaring human rights abuses in order to accomplish political and commercial goals. While this might provide much needed funding for infrastructure in the short term, enabling autocratic regimes to act with impunity will be a detriment to Africans in the long run. For Africa to move past the post-colonial authoritarianism of last century, it needs aid that respects Africa\\'s right to self-determination, but also does not tolerate human rights abuses and autocracy. - Advertisement -'"}, "time": 1742564040.0024152}