{"duration": 0.04776263236999512, "input_args": {"text": "'Posted on July 4, 2014 by Dr. Eowyn | 37 Comments \\nYesterday, after officiating at a wedding of two sodomites in New York, comedienne Joan Rivers outed the president and first lady of the United States as a homosexual and transgender, respectively. (See Steve’s post here .) \\nRivers was asked by an off-camera reporter: “Do you think the country … United States will see the first gay president or first woman president?” \\nThis is what Joan Rivers said, sounding weary and definitely not in a joking mood: \\n“We already have [the first gay president] with Obama, so let’s just calm down. You know Michelle is a tranny… a transgender. We all know. “ We all know. \\nOf course, by “we,” Joan Rivers wasn’t referring to ordinary American people, aka the sheeple who pay the taxes that (barely) holds the U.S. government together, who pay the movie tickets that maintain the Hollyweirdos in their extravagant and debauched “lifestyle”. \\nSo who are those “we” who “all know” all along that Obama is “gay” and his “wife” Michael — oops, Michelle — is really a man? Clue No. 1 \\nRemember that Newsweek cover of May 21, 2012, proclaiming Obama to be “The First Gay President”? \\nNewsweek ‘s orgasmic cover was prompted by Obama’s reversal of the military’s long-standing “don’t ask don’t tell” policy and his open support of “gay marriage.” \\nThe weekly magazine’s accompanying cover story was written by the political pundit Andrew Sullivan, a public (i.e., outed) homosexual who wrote that Obama’s support of gay marriage had brought him to tears. (Lest you get all misty-eyed sentimental, he’s the same Andrew Sullivan who once said “gay marriage” does NOT mean monogamy. As he put it oh so delicately : “there is more likely to be greater understanding of the need for extramarital outlets between two men than between a man and a woman.”) \\nAt the time, we the sheeple thought Newsweek didn’t literally mean Obama is “the first gay president”. \\nThink again. \\nHomosexuals pride themselves on their gaydar. They have to, in order to find each other because homosexuals constitute only 3% of the U.S. population, according to the Williams Institute , UCLA’s LGBT research think tank. That means Andrew Sullivan already knew Barack Hussein Obama is a homosexual, just as another public homosexual — conservative blogger Kevin Dujan of HillBuzz — has known all along. Clue No. 2 \\n7 months after the Newsweek cover, Candy — the first transexual style magazine — caused a brief publicity stir when it chose for its cover a transgender model, Connie Fleming, bearing a decided resemblance to Michelle Obama. (See DCG’s post about this here .) \\nIn the words of Daily Mail : “A striking transgender model made up to look like Michelle Obama being sworn into office has been put on the front cover of a U.S. magazine…. Fleming is dressed in typical First Lady fashion, down to the pearl necklace. Even the hair style is reminiscent of President Barack Obama’s wife, Michelle. ” \\nFor Candy to do a cover story on a transgender U.S. president is bold enough, why pick a BLACK male-to-female transgender for its cover? And not just any black MtF transgender but one who resembles Michelle? Then have the model wear a wig just like Michelle’s and a sleeveless dress just like Michelle’s, exposing Fleming’s toned muscular arms, of which Michael Obama is so proud and for which he is celebrated by all the Obama idolators in the MSM? Clue No. 3 \\nFast forward 1½ years to Time magazine’s cover of June 9, 2014, proclaiming that we’re at a “Transgender Tipping Point: America’s Next Civil Rights Frontier.” (See my post, “ Transgender surgery now covered by bankrupt Medicare “.) \\nFor its cover picture, Time could have chosen any number of transgenders — male-to-female or female-to-male; white, black, yellow, brown. \\nBut the magazine chose a BLACK male-to-female transgender, an obscure actor named Laverne Cox who also bears an uncanny resemblance to Michelle Obama. As observant FOTM commenter motherbarbarian noted: “Looking at that Time cover photo, I am reminded of Michael Obama. Same sculpted arms and muscled legs.” \\nWink, wink. Nudge, nudge. \\nFriends, we’ve been played. \\n“We all know.” They all know. \\nJoan Rivers, Andrew Sullivan, Newsweek , Candy , Time , and all the denizens of the “liberal” media and Hollywood have known all along. \\nSee our posts:'"}, "time": 1742628558.0262804}